{"id": "1ARK9pfKJ5", "contents": "656 Breaking: physical Silver is limited and derivative paper silver holders are nervous. old perceptions are gone. We are about to have $5 days and on to $10, $100, $1000's SAVE AMERICA posted 9 hours ago by GenWashington 175 comments award share download report block\n175 comments Sort by Top Top New Worst Old Save guywholikesDjtof2024 72 points 9 hours ago Hoard all PHYSICAL gold. Same with all precious metals. Buy as much as possible. Go go go. The deepstate is after it, you should be too. Certificates are bogus. permalink award report block reply GenWashington OP 26 points 9 hours ago Everything depends on it going to the moon. Break the back of deep state, fed, big bank, etc.. Adding from below:\nIf a fake coin can get to over $100k per coin, with ZERO purpose outside of storage SILVER should be worth equal. The massive fake ounces (derivatives) that chase and BofA have 800 million ounces alone should make it take off like a rocket 🚀. Add in the 600m (estimated) ounces solar panel consumption. Electric car batteries, regular cars etc. Etc. Etc. , the actual demand 🫴 beyond storage is massive. When it is used, recover is only about 25%. They are out of large silver in the comex... shelves no longer have 100 Oz bars manufacturing needs. Old or new mines will take 2/3-4/5 years to just start to meet demand. It is an amaz8ng time. permalink parent award report block reply Hanging_Chad 32 points 9 hours ago is Ft Knox finna get audited? permalink parent award report block reply chickeninoven 48 points 9 hours ago Hah, no. But here's a shiny $2k check to make you forget all about that sweetie. permalink parent award report block reply carpetxparmesan 16 points 9 hours ago It was multiple stimmies, much more than that. People got MORE THAN ONE daniel defense stimmie gun. Libshits regularly got 15k in tesla gibs for a long time. There's quite a bit to go around if you're a scumbag with a nose for money. permalink parent award report block reply view 1 more comments... BigMikesChef 10 points 7 hours ago It's not a 2k check anymore, now they just want you to be grateful for the partial overtime rebate that expires in a couple of years. permalink parent award report block reply Necrovoter 4 points 6 hours ago Thw $2k check is a certificate certifying that you theoretically own a half ounce of the gold that was supposed to be in Fort Knox,  but is now 404. permalink parent award report block reply view 1 more comments... Brundlefly78 7 points 8 hours ago Nobody is allowed in to see the big IOU note. permalink parent award report block reply Retardloserimsogay 8 points 5 hours ago That one there is a Lamborghini, better hold on to that. permalink parent award report block reply FrmrAmericanRepublic 1 points 3 hours ago The big problem is that from the times of the Hunt Brothers, the massive silver 'corner' that got busted - is that they will change the rules to save themselves. If you like precious metals, great - just realize these fuckers will do whatever they can to keep the big derivative game going. permalink parent award report block reply DagneyTaggart 1 points 3 hours ago As soon as Pam’s finished in Fox’s green room. permalink parent award report block reply Texar1991 3 points 30 minutes ago Bitcoin was/ is a relief valve to keep people out of gold and silver. It worked!! Maybe the times they are a changing? permalink parent award report block reply BillGateCanSuckIt -2 points 1 hour ago If by fake coin you mean Bitcoin, then you must not understand what it is. permalink parent award report block reply MehNahMehNah 2 points 36 minutes ago It's the not understanding that makes it volatile and untrustworthy. permalink parent award report block reply BillGateCanSuckIt 1 points 25 minutes ago Got it. So because it's not understood the price action is volatile and untrustworthy. Lol. Thanks. I needed a long laugh this morning permalink parent award report block reply view 1 more comments... Consumerbot381732 1 points 24 minutes ago \"There is an infinite amount of cash at the Federal Reserve.\" ~Neel Kashkari, president of the Federal Reserve Bank of Minneapolis Volatility goes down as market cap goes up, and rebalancing of ETF allocations in portfolios has dampened it a bit. It's still a wild ride. I do agree that it's untrustworthy, considering the anonymous creator. The fact that you can memorize your money, carrying only a sequence of words in your brain as you cross a border makes it very special. You can try sneaking gold in a cavity, but there are limits. With proper storage, Bitcoin cannot be confiscated. permalink parent award report block reply view 2 more comments... ConvergenceMan -11 points 8 hours ago Cheering for this rock to skyrocket in price is even more retarded than cheering for Ponzicoin, stocks, and houses to skyrocket in price permalink parent award report block reply guywholikesDjtof2024 13 points 7 hours ago this rock Learn history. 4,000+ years and it is still strong. It's weathered more and been used more than dumb digital servers ever have. permalink parent award report block reply SonofaGunDealer12 7 points 4 hours ago Gold and Silver are God’s money fool. U can’t print precious metals and your arguing against about 5000 years of history permalink parent award report block reply FartOnLibtards 18 points 7 hours ago there's no way I'd buy crypto over gold/silver.  No way in hell.  Gold/silver has been around for thousands of years. permalink parent award report block reply guywholikesDjtof2024 9 points 7 hours ago BASED permalink parent award report block reply PatriotDescendant 2 points 3 hours ago Here's an interesting concept...  PORTFOLIO... permalink parent award report block reply Consumerbot381732 2 points 19 minutes ago Exactly. I like gold, silver, and Bitcoin. Not \"crypto\", though--I stay away from the shitcoin casino. permalink parent award report block reply MastaJoda 1 points 46 minutes ago Markwayne Mullet is that you? permalink parent award report block reply Friar_Pede 0 points 4 hours ago There's no way I'm buying a model T over a horse. Horses have been around for 1000s of years. permalink parent award report block reply grad16uc 7 points 4 hours ago If there's ever a point where you need gold over all other currencies, then yes, the horse would be far more valuable than the car. permalink parent award report block reply Friar_Pede 0 points 3 hours ago We're not that lucky to get to that point.  There's people here that, in all likelihood, have been waiting for that for 5 decades with no fruition. permalink parent award report block reply blitzkrieg1 1 points 9 minutes ago You could not afford a model T today. permalink parent award report block reply Yawnz13 11 points 8 hours ago Food, bullets, fuel, metal tools, etc. are all FAR more valuable than gold. permalink parent award report block reply Moebius 7 points 7 hours ago Yup.  Lead is a better investment. With Lead you can take the Gold... permalink parent award report block reply Thedaythe_redditdied 3 points 3 hours ago Lead is highly useless in un trained hands. And no one trains enough. permalink parent award report block reply Moebius 1 points 3 minutes ago CIB with one star and MQB Rifle and Pistol. I don't shoot as much lately though.  Ammo is expensive...even if you reload. permalink parent award report block reply Friar_Pede 1 points 5 minutes ago Shotgun is pretty easy permalink parent award report block reply PatriotDescendant 1 points 3 hours ago Not mine! Good luck! But in general, correct! permalink parent award report block reply IAmNotAnAutist 1 points 5 minutes ago Bring it on, marauder. Those of us with gold have lead too. Bring it, I say. permalink parent award report block reply XLNutts 3 points 2 hours ago Whiskey, don't forget whiskey. permalink parent award report block reply MehNahMehNah 2 points 35 minutes ago And land! permalink parent award report block reply SonofaGunDealer12 2 points 4 hours ago Only in very brief moments in history. Then ask yourself throughout history how food, bullets, etc were acquired. Gold permalink parent award report block reply IAmNotAnAutist 1 points 4 minutes ago Don't ask him to think.  He doesn't do 'thinking'. permalink parent award report block reply Moebius 9 points 8 hours ago Silver boasts a surprising rarity that throws the current market value into question. Geologists estimate that a mere 19 ounces of silver exist in the Earth’s crust for every 1 ounce of gold. That disparity shrinks when comparing that to actual mined silver, but it still sits at a much higher ratio (11.2:1) than the current market price reflects though that ratio is tightening. permalink parent award report block reply TrumpOrTreason 11 points 7 hours ago Historical, the silver to gold ratio has been 15:1 If the price of silver was honest, silver would be at $260 If the price of gold was honest it would be around $80k permalink parent award report block reply PatriotDescendant 1 points 3 hours ago All these economics are poised for massive disruption...we're less than a decade away from mining asteroids. permalink parent award report block reply strongdefense 2 points 2 hours ago Theoretically, yes, but practically, not even close.  There are not enough asteroids in close enough proximity to Earth to do so.  Asteroids are years away from us in terms of current space travel speeds.  Add in the need to land a spacecraft, extract the ore remotely, repackage it on a return vessel and then fly back to Earth and you quickly realize that the math doesn't math.  Couple in the incredible financial risk involved in pulling this off and it quickly falls apart.  It sounds great in movies but real life is much different. permalink parent award report block reply PatriotDescendant 1 points 2 hours ago Speak to Thales. Blue Origin. Others. They'll be crushed by your news. permalink parent award report block reply view 2 more comments... AlmostFullyDilated 8 points 5 hours ago I'm going to go with the opposite of the top post. buy property, cows, chickens, goats. you can't eat gold permalink parent award report block reply TerrorAndSlaughter 7 points 4 hours ago As someone who has goats, chickens, and a dairy cow, let me tell you that I will always sell my eggs, cheese, and meat to people offering silver.  Dollars?  I'm not so confident. permalink parent award report block reply AlmostFullyDilated -7 points 4 hours ago silver is for faggots! this silver fad will pass faster than pogs permalink parent award report block reply duznmatter 8 points 3 hours ago I hope it does so I can buy more. permalink parent award report block reply view 3 more comments... load 3 more comments... Trump2024 46 points 9 hours ago Oh FFS! We're pushing this bullshit again? Based on a 12 hour graph? Excuse me,  do you have a moment for me to tell you about the love of Pepe Coin? permalink award report block reply Hanging_Chad 23 points 9 hours ago silver is up 11.62% in the past 5 days 😯 permalink parent award report block reply the-new-style 18 points 8 hours ago Yes! To the same price it was a month ago! permalink parent award report block reply AstroLonghorn 3 points 2 hours ago (Which was an all time high) permalink parent award report block reply carpetxparmesan 8 points 8 hours ago On a more serious note, if someone wanted to dip their toes in silver, how would any of you do it? Do you have a favorite seller, some quick tips and techniques? In return, I'll leave a useful perspective for those who don't understand what's happening. Silver is increasing in value above the stock market. When that happens, historically, it is my understanding that there is fear in the population and a general belief that bad times are coming - and those bad times tend to happen, historically. The reason the price is increasing so much is that once that threshold is crossed, where the silver is more valuable than the market, people talk more about it and it is generally understood that things have gone from speculation to general feeling in the population. Inviduals can be stupid, but sometimes in large numbers, they can make fairly smart/educated decisions - sometimes. So it snowballs, more people talk about it, more people take it seriously, more people buy silver, the price rises. Now... will you lose your shirt if you invest now? Possibly. In your lifetime, the silver may not return to the price you bought it. But, if that silver stays in the family or you live another 50 years, chances are good it'll return to this value. Or, you could see it going even higher and never return to this value because our currency is so devalued. permalink parent award report block reply ViagraFalls 10 points 8 hours ago The first thing you need to understand about metals is the buyer/seller dynamic exists. If you sell your used car to a dealership, they might give you $1000 for it. Then you might find that they sold it for $1500-2000. Of course, you could sell your car to a person instead and get $1500. When dealing with metal dealers they are in the position of seller and you are in the position of buyer. With metals, I think people are paranoid about getting scammed, so they don’t like to buy from other people. Aside from this if you buy a substantial amount, you will probably want insurance on it, which is an additional cost and a scam. I heard they just automatically reject all claims. So if your $15,000 worth of metals disappears in shipping, you’ll have to be starting a lawsuit. I would only recommend buying metals if you think a major currency crash (hyperinflation) will happen. The prophet that predicted Trump getting shot in the ear also said there will be a currency crash and USD will be replaced by the Amero for the US, Mexico, and Canada. If you have enough cash to buy 10 horses, but buy metals instead, when you sell your metals, you’ll probably have enough cash to buy 9 horses in whatever you get at the time. If the currency gets highly devalued, all the cash you kept will be enough to buy a pack of toilet paper instead of a horse. Ultimately, I think of buying metals as a way to preserve the value of money instead of a way to make money. The paper trading problem might prove me wrong about that. People (most likely ones with long crooked noses) came up with this idea of selling pieces of paper that say you have x amount of silver (or whatever metal). They’re most likely selling 10 times as much silver than they have in stock. People will probably figure this out when it’s too late and then they’re just left with paper. This also enables the rich to manipulate the metal markets and keep the prices artificially low. Silver was around $45-48 in the 1980s. Some believe silver in the $20-25 range was artificial. If this whole scam collapses, the values of metals might shoot up to their proper values without manipulation going on making owning metals profitable even in terms of buying value. There is also the possibility of some new technology increasing the demand for a metal, but I wouldn’t count on that happening. permalink parent award report block reply Thedaythe_redditdied 4 points 2 hours ago Excellent explanation I would like to point out one thing that you probably underestimated the paper silver sellers don’t just give out 10 times paper what they have physical ( your local back actually does this with the US dollar. Yes they loan out 10 times more cash then they have) right now the paper to physically is 358 to 1. Meaning for every ounce of silver they have in thier vaults. They have sold 358 silver certificates for that one ounce. But wait you ask. What if I turn in my certificate and request the physical ounce be sent to me? If you ask for a couple ounces they might send you some. But if you ask for a lot. They will just send you a check in US dollars for the value of the silver  you supposedly own. Because you don’t actually own the silver. A small tribe owns the silver and then lies to you and says it’s yours and they will just keep it safe for you. Anyone interested in shiny rocks. you need to physically hold and control them your self or what you have is worth less than fiat cash. Silver or gold certificates are the second biggest scam going. After the US dollar. permalink parent award report block reply view 1 more comments... rextexMG 7 points 6 hours ago I buy direct from APMEX.com. I have had a subscription for gold and silver for years. permalink parent award report block reply DJTXLV 4 points 3 hours ago APMEX JM Bullion SD Bullion Bold Precious Metals BGASC Check if there are new customer deals where you can buy at spot. permalink parent award report block reply Shakakka99 4 points 4 hours ago Me also.  And don't listen to those here telling you that you might buy silver for $50 and sell it for $40.  That's bullshit.  Local shops near me will pay $1-$2 under spot price for it, sometimes right on spot.  You pay the premium when you buy it; at the moment silver is at $54 and APMEX is selling 1oz silver eagles for $62. Advice: avoid giant bars - they will be harder to sell.  5oz and 10oz are fine, but make sure the bars are a reputable known brand.  The best is to buy 1oz coins or rounds, they are easy to peel off and sell when you want to.  Don't buy fancy stuff, get the coins minted for each country: American silver eagles, Canadian maple leaf coins, UK Britannias, Austrian philharmonics, etc...  These are easily recognizable and accepted everywhere, and you'll get close to spot for them without issue. permalink parent award report block reply view 1 more comments... GenWashington OP 3 points 6 hours ago A. Where to buy and sell. Find a good local shop and a trusted online seller. Money metals is OK. You want a decent relationship with your local company. When time to sell Today we have multiple factors to consider.\nFed notes printed beyond belief -\nIllegal invasion -\nThe is a 800 million ounce (paper) derivative buble - Finally BRICS permalink parent award report block reply user2827 1 points 7 hours ago What u/ViagraFalls says is about accurate. More simply, buy and sell price is on margin... So, if silver is 50$ it might be you buy for 50$ and sell for 40$. Also agreed that buying metals is more about preserving wealth than something like stocks where there's an expectation of stock price increasing above and beyond inflation. If you bought gold at 25$ and sold it at 100$, you can reasonably expect that the general costs for stuff will have gone up roughly proportional. The issue about the manipulation of prices is also true, and one of those rare moments where one could reasonably expect a real profit relative to inflation. I've heard arguments that gold prices SHOULD be trading at about 2-3x the prices at the time and silver, because of the industrial uses should be in the range of 5-10x the market. This isn't something worth counting on because if that music does stop and people buying gold and silver for 1-20k per oz, then there's going to be a lot more going on to worry about, and are just as likely to be facing a barter scenario. permalink parent award report block reply Meow4me2 1 points 4 hours ago We are buying for a local dealer (check with BBB for complaints) and looking to set up a gold IRA now to lock in some gains from the stock market. Local dealer - markup will likely be 1-2% higher than an online company, but you can usually buy in smaller portions, so easier to add a bit here or there. I found our dealer via an online search, checked reviews and BBB, then met before deciding to buy from him. Online dealer - minimum buys are higher, markups lower. We haven’t gone this route because of worries over shipping “losses”. I’d rather pick it up directly myself from a local dealer. Precious metals IRA - Looking to move some money from an IRA overweighted in stocks to metals. IRA is physical metals held in a depository for us. Bonds are really underperforming, so looking at metals to preserve value. Have a gold ETF, but it behaves more like a stock. Stock market values so high, I’m worried about a big correction. I’m 3-5 years from retirement, no time to recover a big loss in the market. Physical gold and silver - we purchased enough to trade here if we ever really needed to. Hope the helps. permalink parent award report block reply Thedaythe_redditdied 1 points 2 hours ago Don’t forget if you buy online there is a paper trail they you own precious metals. And big daddy government has already stolen citizens gold in recent American history. So you don’t want the feds showing up to confiscate your gold to save the dollar (they absolutely will by the way) permalink parent award report block reply load 4 more comments... MySidesGoUp 3 points 5 hours ago Up 50% in a year… permalink parent award report block reply Texar1991 1 points 1 hour ago Almost double YTD. permalink parent award report block reply LaVaughnRobinson 13 points 9 hours ago Better is people thinking they investing in silver or gold with these stocks actually own any of it as if the fake shit wont crash also in a world-wide meltdown, kek.  Buy physical gold/silver coins if you want something for the apocalypse to actually use. permalink parent award report block reply darkmodeforgotpass 11 points 9 hours ago Lead is a better investment IMO. permalink parent award report block reply carpetxparmesan 3 points 9 hours ago It's not. I did the math, too dense, literally. When you factor in the cost of storage, which would be competitive advantage for you if you had a dry cave for free but NOT a competitive advantage if you erected a 100$/sqft structure like most people... you house finna buckle under the weight of your savings. And, so will your back, because you gonna need a fork lift to move any of it in or out or around for anything beyond a reasonable 3-10k round count which almost everyone should have (if nothing else, in 22 if that's all you can stuff under your bed). permalink parent award report block reply Thedaythe_redditdied 2 points 2 hours ago Only if you spend 50% of your lead on training. Cause a pile of bullets in the closet of a guy that thinks he can shoot is just free bullets for people who train. permalink parent award report block reply user2827 1 points 7 hours ago If that scenario comes about; you'd want to have guns, a reasonable amount of ammo, food and water stored or available, and the surplus could be kept in metals for barter. permalink parent award report block reply ValhallaBaboon 1 points 8 hours ago invest in lead paint permalink parent award report block reply TS-SCI_thong 1 points 2 hours ago Who would have guessed brass and lead was a great invest ment permalink parent award report block reply Trump2024 5 points 9 hours ago The only precious metal to invest in is high velocity lead ingots. With lead ingots you can have as much as you want of any other metal. permalink parent award report block reply zillat 3 points 9 hours ago You should do both, because many people have assets that are limited in what they can invest in, emerging markets are going to rip as well, if you don't want pure paper metals, buy mining stocks or small mining stocks are even better, GDXJ, etc. permalink parent award report block reply EatChit 7 points 9 hours ago Hey, I've got 170m of those bad boys.. And did you not SEE his graph? It's going up! permalink parent award report block reply Trump2024 5 points 9 hours ago I've got 500 million pepe coins. I'm hodling permalink parent award report block reply guywholikesDjtof2024 3 points 9 hours ago pepe coins are digital. One solar flare and they all get destroyed. buy metal with pepe coins. permalink parent award report block reply ReallyGayMods 3 points 9 hours ago I do actually and wouldnt mind hearing about pepe coin? Silver is up like 120% in the last 5 or so years. How does that compare to pepe coin? permalink parent award report block reply load 1 more comments... Saint_Samurai 20 points 9 hours ago \"The silver is mine, and the gold is mine, saith the Lord of hosts.\" - Haggai 2:8 permalink award report block reply carpetxparmesan 1 points 9 hours ago How does that square with render unto Caesar? Both claim the silver. permalink parent award report block reply CptObvious- 10 points 8 hours ago God made metal and it is His; coins made from it by Rome are for Roman purposes to choose. If Ceasar wants his money, it is his. \"Who's inscription is on the coin?\" etc. Ceasar's claim is temporal and finite, etc. permalink parent award report block reply MAGA_Toaster 4 points 8 hours ago Username checks out! 👍 permalink parent award report block reply freedom-thinker 11 points 9 hours ago Looking for a dip below 30 to get back in /s permalink award report block reply Texar1991 1 points 51 minutes ago $50 is the new floor for silver. And yes… I see the SaRC TaG. permalink parent award report block reply utfanx2 9 points 9 hours ago Ammocoin goes brrrt. permalink award report block reply BKav 8 points 8 hours ago As a client of mine once told me, “you buy gold and I’ll buy guns.  And if someday I want your gold, I’ll come get it” permalink award report block reply RandomJoe7 9 points 8 hours ago Except that most people also have guns anyways, because they cost a few hundred (or thousand) bucks. So... would you rather be the guy with a couple guns and a lot more in precious metals (instead of fiat), or the guy who put all his fiat into 100's of guns that he can't all shoot simultaneously anyways? At the end of the day, if you're having a \"battle\" for anything, it'll be 1 guy holding a gun vs another guy holding a gun, so you're no better off anyways. The idea that the guy with the gun can just walk around town and take everyone's belongings as if nobody else is armed is absurd, lol permalink parent award report block reply BKav 3 points 7 hours ago Hahaha.  You’ve never seen the contents of my safe. permalink parent award report block reply PeteButtplug 0 points 2 hours ago Gold is only useful in a hyperinflation situation where we expect the financial system to restabilize. If everything goes to shit, I can't eat gold. permalink parent award report block reply Forty_Five 2 points 5 hours ago Why not both? permalink parent award report block reply Kricket 2 points 2 hours ago The exchange rate for lead and your liberal neighbor’s stuff if SHTF is very favorable. permalink parent award report block reply tomthung 7 points 8 hours ago Minimum wage in 1964 was $1.25 and hour. If we had real money, those 5 quarters you were paid would have the buying power of over $50.00 today just in the silver content. I don't know what minimum wage is today, but it represents what they have stolen from all of us. permalink award report block reply Matehmateh 3 points 5 hours ago A great haircut in Southeast Asia costs just $1–3 , compared to $30–40 (no tip) in the US. The point ties directly to retirement: move to a country where the US dollar stretches further, and you’ll live like royalty on a modest income. permalink parent award report block reply MySidesGoUp 5 points 4 hours ago Born too late to be a boomer…. permalink parent award report block reply ForgottenUsername 3 points 4 hours ago It sucks to have to live in the third world though.     But since they're turning the first world into the third world already, you seem ahead of the curve on that permalink parent award report block reply Jack_NC 1 points 3 hours ago minimum wage in NC: $7.25/hour. Basically the value of one of those silver quarters. Huh, how about that? Quite a coincidence. permalink parent award report block reply tomthung 3 points 3 hours ago That's what the bankers and politicians have stolen from us, not the Boomers. One of those 1964 quarters is worth $10.00 today. Every dollar in your pocket should have at least $100.00 buying power and I can make an argument it should be a lot more. permalink parent award report block reply slokill 7 points 6 hours ago End The Fed permalink award report block reply GenWashington OP 3 points 6 hours ago Yes,! permalink parent award report block reply PeterThielAntiChrist 5 points 5 hours ago EVERYONE POSTING IN HERE IS BROKE permalink award report block reply GenWashington OP 4 points 5 hours ago Not me bro sorry permalink parent award report block reply Kricket 2 points 2 hours ago 🍿 permalink parent award report block reply MehNahMehNah 1 points 28 minutes ago That's what I tell everyone.  And get off my land.. permalink parent award report block reply cjcivicx 1 points 30 minutes ago OP, like every other boomer rock holder, is trying to get more people to buy because they're seething that crypto absolutely wrecked their \"long term investments\" in a little over a decade by making people like me, who they all laughed at because \"Hurr durr it's one's and zeroes\", independently wealthy and able to retire at 40, unlike them who are hoping beyond hope that someone will eventually buy their boomer rocks when the world ends or whatever they were told was going to happen decades ago when they bought them. permalink parent award report block reply ForgottenUsername 1 points 4 hours ago I'm rich in could have, should have, and did but wasted it permalink parent award report block reply buckeyeminuteman 4 points 4 hours ago I bought some silver coins right after Game Stop was shorted and we were trying to do the same to silver. It was right around $23 per ounce. Didn’t realize it was up to $54! permalink award report block reply GenWashington OP 1 points 1 hour ago Many don't know... off radar and why I raise it. permalink parent award report block reply first_amendment 3 points 7 hours ago There are silver mines all over the country shut down over a hundred of year ago per lack of profit.  I have my doubts we'll see thousands, we'll just see more mining operations where people least expect them. permalink award report block reply ckover9000 3 points 4 hours ago Here's my experience with precious metals...it's fun to hold and say you have them. As soon as you need to cash in any amount you quickly learn industry collusion is a thing. NOBODY will give you anything near what it's worth. If you cash in to the big guys they assume you bought it from one of them and joo down your payout no matter who you bought it from, not to mention fees and taxes. So you go to the local shop and they know you're there because the big guys are screwing you or you're desperate for cash and screw you just as much. BUT BUT BUT muh society collapses...nobody is going to trade you their goods needed to survive for useless metal. And anyone who thinks hoarding metals is going to somehow stick it to the man, get over yourself...the man has successfully pysopped you into gleefully handing over your shekels. If cash is going to be so worthless and metals are the future, why the everloving fuck would they be so willing to take your soon-to-be-worthless money in exchange for the only thing of value in the future? Spend your money on something actually valuable in usefullness. permalink award report block reply GenWashington OP 6 points 4 hours ago My local shop sells $2 over spot and buys at $1.5 under... pretty easy to calculate. You should know the game before getting in. permalink parent award report block reply ckover9000 1 points 42 minutes ago Do they ever send you a thank you note for doing your part inflating the value so they can make even more money from it? You help make them rich twice. Have fun eating your gold. permalink parent award report block reply cjcivicx 2 points 24 minutes ago Yep. OP, and other boomer rock holders, is like DOGE holders AFTER it peaked at .70 because they really thought it was going to a dollar or more. They've been everywhere desperately trying to get people whipped up to buy DOGE. That being said, they've only been doing it for a couple of years, boomer rockers have been doing it for decades. permalink parent award report block reply ViagraFalls 3 points 8 hours ago I checked silver yesterday, and it was at $51. permalink award report block reply GenWashington OP 2 points 6 hours ago $54.44 today https://www.moneymetals.com/silver-price permalink parent award report block reply Matehmateh -1 points 5 hours ago $24 several years ago. Guess you’ll have to wait several more years before making a profit permalink parent award report block reply cjcivicx 1 points 46 minutes ago OP had a few accounts he's Downvoting people with lol. permalink parent award report block reply tomthung 3 points 4 hours ago We're going to find out if the Hunt Brothers were right. permalink award report block reply GenWashington OP 0 points 1 hour ago 100% they were on target and knew it way back when. permalink parent award report block reply tomthung 0 points 56 minutes ago Yep and I'm really excited. permalink parent award report block reply EvilGreed209 3 points 7 hours ago It's been known for decades that they don't have enough gold or silver in the vaults they just been reselling gold bullion in vaults for years to different customers all owning the same gold bars because vaults seen the people never come get their gold only after decades so they figure they'll just resell it but if there was a margin call on all that bullion many precious metals would go to prison for theft. permalink award report block reply Texar1991 2 points 48 minutes ago If we had true rule of law they’d already be in prison. permalink parent award report block reply Wallstpatriot 2 points 2 hours ago This will never happen. You have to be able to buy the silver contract in full when you take delivery. Currently $270,000 for 1 contract.   Don’t know too many people with quarter million dollars for 1 silver contract laying around.   Then you have to pay to store it in an exchange warehouse every month. permalink award report block reply Lol_Garrus 2 points 2 hours ago I have some silverware. permalink award report block reply VanDeKoik 2 points 5 hours ago Pro tip: Never ever take advice like this from people that fetishize shit like \"global financial collaspes\" or some 'biblical prophecy\" horseshit. These are the reason why we have all of those annoying ads about buying gold. People with money do not do this. permalink award report block reply sir_rockness 2 points 2 hours ago Yall go ahead and buy your silver and gold and jerk off to it at night and then when you die somebody can buy it at an estate auction. I'm gonna keep playing their shitty equity game and keep making 75, 125 or maybe 150% yearly on my US paper which will eventually be digital. permalink award report block reply AstroLonghorn 2 points 1 hour ago Why would I ever auction my silver when it has a tangible price and risk someone buying it at 70% its value? Estate sale more accurate. Also, some of us came from families where gold and silver were bought as something to pass on. It was intended to be sold 3/4 generations down the road… So yes enjoy your hypothetical come up when some families can sell all their precious metals and make in one day what you will make in multiple years and then live off the dividend. One more thing: you need physical silver for digital cash. Those motherboards ain’t gonna solder themselves…. permalink parent award report block reply Rerun1Central 1 points 1 hour ago My silver eagles seemed high at $30 permalink award report block reply JustAnotherPsyopNPC 1 points 4 hours ago Buy Oz coins at a comfortable rate. permalink award report block reply Texar1991 1 points 22 minutes ago Gold is the money of kings. Silver is the money of gentlemen. Credit is the money of the poor. Gold and silver are money and everything else is credit. (The central banks know). permalink award report block reply queenicarius 1 points 4 hours ago I guess it's time to get my wedding silver out of the cabinet. permalink award report block reply Kricket 2 points 2 hours ago Why? permalink parent award report block reply knnbccb 1 points 6 hours ago A little something for you 'muh gold and silver' paytriots. https://biblehub.com/james/5-3.htm permalink award report block reply Kdiddy 1 points 2 hours ago Silver is easy to mine. They will mine more and bring it down. If it doesn’t go down, it is being manipulated. Be smart. permalink award report block reply Limbaugh 1 points 9 hours ago Zoom in more permalink award report block reply cjcivicx 1 points 21 minutes ago OP won't. He's like DOGE holders, desperately begging people to pump and dump so he can ger his money back. permalink parent award report block reply mykillk -1 points 8 hours ago Saying silver @ $1000 makes you look like you're just hawking it for your own interest, ngl. Same as all the cryptotards. permalink award report block reply lizardo221 3 points 7 hours ago Careful, every doomsday rightwing influencer might not like you saying that. They are hawking us gold ads nonstop every day because they are just looking out for us ... I'm sure that's what that is ... permalink parent award report block reply Matehmateh 2 points 5 hours ago Not a bad idea if you’re an affiliate marketer permalink parent award report block reply GenWashington OP 3 points 6 hours ago If a fake coin can get to over $100k per coin, with ZERO purpose outside of storage SILVER should be worth equal. The massive fake ounces alone (derivatives that chase and BofA have 800 million ounces alone should make it take off like a rocket 🚀. Add in the 600 ounces solar panel consumption. Electric car batteries, regular cars etc. Etc. Etc. , the actual demand 🫴 beyond storage is massive. They are out of large silver in the comex... shelves no longer have 100 Oz bars manufacturing needs. Old or new mines will take 2/3-4/5 years to just start to meet demand. It is an amaz8ng time. permalink parent award report block reply cjcivicx 1 points 21 minutes ago Except many cryptotards actually can spend theirs and have already made money if they were in early like me. permalink parent award report block reply BoatingAccident -2 points 6 hours ago Kinda like stonks …..  yawn permalink award report block reply cjcivicx -3 points 8 hours ago I see silver and gold fags still seething about crypto fags like me who they made fun of making enough  money to retire in less than a decade instead of sitting on boomer rocks for decades and hoping beyond hope more people will start buying so they can finally make some money. Edit: LMFAO OP big mad calling people trannies because his boomer rocks are worthless. Sign of a man who really believes in what he says. permalink award report block reply GenWashington OP 2 points 6 hours ago Stop being trans.... you are really a hold and silver guy. permalink parent award report block reply GETCHURbooztahh -5 points 9 hours ago Go try to sell your silver. Stores will reject anywhere near spot value or simply say no have enough. permalink award report block reply Taylor3006 4 points 8 hours ago That is horseshit. I have never had a problem getting melt value for my silver ever. Same with gold. Plenty of businesses who deal in scrap and coins will pay melt as the price goes up because so does the demand. They don't sell at melt you retard, they sell at spot plus a premium. If someone told you that they were not paying you spot, they were trying to fuck you because you seemed retarded to them. permalink parent award report block reply GETCHURbooztahh 0 points 8 hours ago Have you tried in the last few weeks? My buddys family owns cash carry jewelry stores. Not bullshit. They are turning away silver lately. Not gold. permalink parent award report block reply Taylor3006 2 points 8 hours ago Why the fuck would I sell at a jewelry store? That is like going to a pawn shop. Any town of any appreciable size will have coin dealers or silver/gold exchanges.  Larger cities will have scrap dealers that take precious metals and some of those companies will do mail in appraisals and offer you spot, easily. permalink parent award report block reply cjcivicx 1 points 44 minutes ago OP is using alt accounts to try and get people to buy his bags lol permalink parent award report block reply guywholikesDjtof2024 2 points 9 hours ago What about 30 years from now when WW3 starts? That rhetoric is short term thinking. permalink parent award report block reply Kricket 1 points 1 hour ago If you need to wait 30 years for your investment to payoff, it better payoff fucking big, like Beverly hillbillies big. I’d like to introduce you to the concepts of “the time value of money” and “opportunity cost.” permalink parent award report block reply GenWashington OP 2 points 8 hours ago Sorry trans not true permalink parent award report block reply cjcivicx -1 points 8 hours ago Yep, boomers are still clinging to their rocks hoping beyond hope they can convince people to buy the shit they bought decades ago because their parents still had the Gold standard that meant something. permalink parent award report block reply KungPaoMcChicken -16 points 9 hours ago Time to start breaking into old people's homes for the silver. Cough up you old cunt. Never let it be said that I didn't pay the iron price for where I am in this world. permalink award report block reply NimblePepeCentipede 10 points 9 hours ago .....sorry, best I can do is lead. thank you for your attention to this matter. permalink parent award report block reply carpetxparmesan 3 points 9 hours ago That guy ended up without a weiner, lord of the seas. Communists don't want you owning shotguns because the risk of a grandma in the night with a shotgun is too great. What they lack in reaction speed and preparation, they make up for by being quiet and having no fucks left to give if anyone puts them in jail. permalink parent award report block reply Saltyminer11 1 points 2 hours ago Free room and board! permalink parent award report block reply\nguywholikesDjtof2024 72 points 9 hours ago Hoard all PHYSICAL gold. Same with all precious metals. Buy as much as possible. Go go go. The deepstate is after it, you should be too. Certificates are bogus. permalink award report block reply GenWashington OP 26 points 9 hours ago Everything depends on it going to the moon. Break the back of deep state, fed, big bank, etc.. Adding from below:\nIf a fake coin can get to over $100k per coin, with ZERO purpose outside of storage SILVER should be worth equal. The massive fake ounces (derivatives) that chase and BofA have 800 million ounces alone should make it take off like a rocket 🚀. Add in the 600m (estimated) ounces solar panel consumption. Electric car batteries, regular cars etc. Etc. Etc. , the actual demand 🫴 beyond storage is massive. When it is used, recover is only about 25%. They are out of large silver in the comex... shelves no longer have 100 Oz bars manufacturing needs. Old or new mines will take 2/3-4/5 years to just start to meet demand. It is an amaz8ng time. permalink parent award report block reply Hanging_Chad 32 points 9 hours ago is Ft Knox finna get audited? permalink parent award report block reply chickeninoven 48 points 9 hours ago Hah, no. But here's a shiny $2k check to make you forget all about that sweetie. permalink parent award report block reply carpetxparmesan 16 points 9 hours ago It was multiple stimmies, much more than that. People got MORE THAN ONE daniel defense stimmie gun. Libshits regularly got 15k in tesla gibs for a long time. There's quite a bit to go around if you're a scumbag with a nose for money. permalink parent award report block reply view 1 more comments... BigMikesChef 10 points 7 hours ago It's not a 2k check anymore, now they just want you to be grateful for the partial overtime rebate that expires in a couple of years. permalink parent award report block reply Necrovoter 4 points 6 hours ago Thw $2k check is a certificate certifying that you theoretically own a half ounce of the gold that was supposed to be in Fort Knox,  but is now 404. permalink parent award report block reply view 1 more comments... Brundlefly78 7 points 8 hours ago Nobody is allowed in to see the big IOU note. permalink parent award report block reply Retardloserimsogay 8 points 5 hours ago That one there is a Lamborghini, better hold on to that. permalink parent award report block reply FrmrAmericanRepublic 1 points 3 hours ago The big problem is that from the times of the Hunt Brothers, the massive silver 'corner' that got busted - is that they will change the rules to save themselves. If you like precious metals, great - just realize these fuckers will do whatever they can to keep the big derivative game going. permalink parent award report block reply DagneyTaggart 1 points 3 hours ago As soon as Pam’s finished in Fox’s green room. permalink parent award report block reply Texar1991 3 points 30 minutes ago Bitcoin was/ is a relief valve to keep people out of gold and silver. It worked!! Maybe the times they are a changing? permalink parent award report block reply BillGateCanSuckIt -2 points 1 hour ago If by fake coin you mean Bitcoin, then you must not understand what it is. permalink parent award report block reply MehNahMehNah 2 points 36 minutes ago It's the not understanding that makes it volatile and untrustworthy. permalink parent award report block reply BillGateCanSuckIt 1 points 25 minutes ago Got it. So because it's not understood the price action is volatile and untrustworthy. Lol. Thanks. I needed a long laugh this morning permalink parent award report block reply view 1 more comments... Consumerbot381732 1 points 24 minutes ago \"There is an infinite amount of cash at the Federal Reserve.\" ~Neel Kashkari, president of the Federal Reserve Bank of Minneapolis Volatility goes down as market cap goes up, and rebalancing of ETF allocations in portfolios has dampened it a bit. It's still a wild ride. I do agree that it's untrustworthy, considering the anonymous creator. The fact that you can memorize your money, carrying only a sequence of words in your brain as you cross a border makes it very special. You can try sneaking gold in a cavity, but there are limits. With proper storage, Bitcoin cannot be confiscated. permalink parent award report block reply view 2 more comments... ConvergenceMan -11 points 8 hours ago Cheering for this rock to skyrocket in price is even more retarded than cheering for Ponzicoin, stocks, and houses to skyrocket in price permalink parent award report block reply guywholikesDjtof2024 13 points 7 hours ago this rock Learn history. 4,000+ years and it is still strong. It's weathered more and been used more than dumb digital servers ever have. permalink parent award report block reply SonofaGunDealer12 7 points 4 hours ago Gold and Silver are God’s money fool. U can’t print precious metals and your arguing against about 5000 years of history permalink parent award report block reply FartOnLibtards 18 points 7 hours ago there's no way I'd buy crypto over gold/silver.  No way in hell.  Gold/silver has been around for thousands of years. permalink parent award report block reply guywholikesDjtof2024 9 points 7 hours ago BASED permalink parent award report block reply PatriotDescendant 2 points 3 hours ago Here's an interesting concept...  PORTFOLIO... permalink parent award report block reply Consumerbot381732 2 points 19 minutes ago Exactly. I like gold, silver, and Bitcoin. Not \"crypto\", though--I stay away from the shitcoin casino. permalink parent award report block reply MastaJoda 1 points 46 minutes ago Markwayne Mullet is that you? permalink parent award report block reply Friar_Pede 0 points 4 hours ago There's no way I'm buying a model T over a horse. Horses have been around for 1000s of years. permalink parent award report block reply grad16uc 7 points 4 hours ago If there's ever a point where you need gold over all other currencies, then yes, the horse would be far more valuable than the car. permalink parent award report block reply Friar_Pede 0 points 3 hours ago We're not that lucky to get to that point.  There's people here that, in all likelihood, have been waiting for that for 5 decades with no fruition. permalink parent award report block reply blitzkrieg1 1 points 9 minutes ago You could not afford a model T today. permalink parent award report block reply Yawnz13 11 points 8 hours ago Food, bullets, fuel, metal tools, etc. are all FAR more valuable than gold. permalink parent award report block reply Moebius 7 points 7 hours ago Yup.  Lead is a better investment. With Lead you can take the Gold... permalink parent award report block reply Thedaythe_redditdied 3 points 3 hours ago Lead is highly useless in un trained hands. And no one trains enough. permalink parent award report block reply Moebius 1 points 3 minutes ago CIB with one star and MQB Rifle and Pistol. I don't shoot as much lately though.  Ammo is expensive...even if you reload. permalink parent award report block reply Friar_Pede 1 points 5 minutes ago Shotgun is pretty easy permalink parent award report block reply PatriotDescendant 1 points 3 hours ago Not mine! Good luck! But in general, correct! permalink parent award report block reply IAmNotAnAutist 1 points 5 minutes ago Bring it on, marauder. Those of us with gold have lead too. Bring it, I say. permalink parent award report block reply XLNutts 3 points 2 hours ago Whiskey, don't forget whiskey. permalink parent award report block reply MehNahMehNah 2 points 35 minutes ago And land! permalink parent award report block reply SonofaGunDealer12 2 points 4 hours ago Only in very brief moments in history. Then ask yourself throughout history how food, bullets, etc were acquired. Gold permalink parent award report block reply IAmNotAnAutist 1 points 4 minutes ago Don't ask him to think.  He doesn't do 'thinking'. permalink parent award report block reply Moebius 9 points 8 hours ago Silver boasts a surprising rarity that throws the current market value into question. Geologists estimate that a mere 19 ounces of silver exist in the Earth’s crust for every 1 ounce of gold. That disparity shrinks when comparing that to actual mined silver, but it still sits at a much higher ratio (11.2:1) than the current market price reflects though that ratio is tightening. permalink parent award report block reply TrumpOrTreason 11 points 7 hours ago Historical, the silver to gold ratio has been 15:1 If the price of silver was honest, silver would be at $260 If the price of gold was honest it would be around $80k permalink parent award report block reply PatriotDescendant 1 points 3 hours ago All these economics are poised for massive disruption...we're less than a decade away from mining asteroids. permalink parent award report block reply strongdefense 2 points 2 hours ago Theoretically, yes, but practically, not even close.  There are not enough asteroids in close enough proximity to Earth to do so.  Asteroids are years away from us in terms of current space travel speeds.  Add in the need to land a spacecraft, extract the ore remotely, repackage it on a return vessel and then fly back to Earth and you quickly realize that the math doesn't math.  Couple in the incredible financial risk involved in pulling this off and it quickly falls apart.  It sounds great in movies but real life is much different. permalink parent award report block reply PatriotDescendant 1 points 2 hours ago Speak to Thales. Blue Origin. Others. They'll be crushed by your news. permalink parent award report block reply view 2 more comments... AlmostFullyDilated 8 points 5 hours ago I'm going to go with the opposite of the top post. buy property, cows, chickens, goats. you can't eat gold permalink parent award report block reply TerrorAndSlaughter 7 points 4 hours ago As someone who has goats, chickens, and a dairy cow, let me tell you that I will always sell my eggs, cheese, and meat to people offering silver.  Dollars?  I'm not so confident. permalink parent award report block reply AlmostFullyDilated -7 points 4 hours ago silver is for faggots! this silver fad will pass faster than pogs permalink parent award report block reply duznmatter 8 points 3 hours ago I hope it does so I can buy more. permalink parent award report block reply view 3 more comments... load 3 more comments...\nGenWashington OP 26 points 9 hours ago Everything depends on it going to the moon. Break the back of deep state, fed, big bank, etc.. Adding from below:\nIf a fake coin can get to over $100k per coin, with ZERO purpose outside of storage SILVER should be worth equal. The massive fake ounces (derivatives) that chase and BofA have 800 million ounces alone should make it take off like a rocket 🚀. Add in the 600m (estimated) ounces solar panel consumption. Electric car batteries, regular cars etc. Etc. Etc. , the actual demand 🫴 beyond storage is massive. When it is used, recover is only about 25%. They are out of large silver in the comex... shelves no longer have 100 Oz bars manufacturing needs. Old or new mines will take 2/3-4/5 years to just start to meet demand. It is an amaz8ng time. permalink parent award report block reply Hanging_Chad 32 points 9 hours ago is Ft Knox finna get audited? permalink parent award report block reply chickeninoven 48 points 9 hours ago Hah, no. But here's a shiny $2k check to make you forget all about that sweetie. permalink parent award report block reply carpetxparmesan 16 points 9 hours ago It was multiple stimmies, much more than that. People got MORE THAN ONE daniel defense stimmie gun. Libshits regularly got 15k in tesla gibs for a long time. There's quite a bit to go around if you're a scumbag with a nose for money. permalink parent award report block reply view 1 more comments... BigMikesChef 10 points 7 hours ago It's not a 2k check anymore, now they just want you to be grateful for the partial overtime rebate that expires in a couple of years. permalink parent award report block reply Necrovoter 4 points 6 hours ago Thw $2k check is a certificate certifying that you theoretically own a half ounce of the gold that was supposed to be in Fort Knox,  but is now 404. permalink parent award report block reply view 1 more comments... Brundlefly78 7 points 8 hours ago Nobody is allowed in to see the big IOU note. permalink parent award report block reply Retardloserimsogay 8 points 5 hours ago That one there is a Lamborghini, better hold on to that. permalink parent award report block reply FrmrAmericanRepublic 1 points 3 hours ago The big problem is that from the times of the Hunt Brothers, the massive silver 'corner' that got busted - is that they will change the rules to save themselves. If you like precious metals, great - just realize these fuckers will do whatever they can to keep the big derivative game going. permalink parent award report block reply DagneyTaggart 1 points 3 hours ago As soon as Pam’s finished in Fox’s green room. permalink parent award report block reply Texar1991 3 points 30 minutes ago Bitcoin was/ is a relief valve to keep people out of gold and silver. It worked!! Maybe the times they are a changing? permalink parent award report block reply BillGateCanSuckIt -2 points 1 hour ago If by fake coin you mean Bitcoin, then you must not understand what it is. permalink parent award report block reply MehNahMehNah 2 points 36 minutes ago It's the not understanding that makes it volatile and untrustworthy. permalink parent award report block reply BillGateCanSuckIt 1 points 25 minutes ago Got it. So because it's not understood the price action is volatile and untrustworthy. Lol. Thanks. I needed a long laugh this morning permalink parent award report block reply view 1 more comments... Consumerbot381732 1 points 24 minutes ago \"There is an infinite amount of cash at the Federal Reserve.\" ~Neel Kashkari, president of the Federal Reserve Bank of Minneapolis Volatility goes down as market cap goes up, and rebalancing of ETF allocations in portfolios has dampened it a bit. It's still a wild ride. I do agree that it's untrustworthy, considering the anonymous creator. The fact that you can memorize your money, carrying only a sequence of words in your brain as you cross a border makes it very special. You can try sneaking gold in a cavity, but there are limits. With proper storage, Bitcoin cannot be confiscated. permalink parent award report block reply view 2 more comments... ConvergenceMan -11 points 8 hours ago Cheering for this rock to skyrocket in price is even more retarded than cheering for Ponzicoin, stocks, and houses to skyrocket in price permalink parent award report block reply guywholikesDjtof2024 13 points 7 hours ago this rock Learn history. 4,000+ years and it is still strong. It's weathered more and been used more than dumb digital servers ever have. permalink parent award report block reply SonofaGunDealer12 7 points 4 hours ago Gold and Silver are God’s money fool. U can’t print precious metals and your arguing against about 5000 years of history permalink parent award report block reply\nHanging_Chad 32 points 9 hours ago is Ft Knox finna get audited? permalink parent award report block reply chickeninoven 48 points 9 hours ago Hah, no. But here's a shiny $2k check to make you forget all about that sweetie. permalink parent award report block reply carpetxparmesan 16 points 9 hours ago It was multiple stimmies, much more than that. People got MORE THAN ONE daniel defense stimmie gun. Libshits regularly got 15k in tesla gibs for a long time. There's quite a bit to go around if you're a scumbag with a nose for money. permalink parent award report block reply view 1 more comments... BigMikesChef 10 points 7 hours ago It's not a 2k check anymore, now they just want you to be grateful for the partial overtime rebate that expires in a couple of years. permalink parent award report block reply Necrovoter 4 points 6 hours ago Thw $2k check is a certificate certifying that you theoretically own a half ounce of the gold that was supposed to be in Fort Knox,  but is now 404. permalink parent award report block reply view 1 more comments... Brundlefly78 7 points 8 hours ago Nobody is allowed in to see the big IOU note. permalink parent award report block reply Retardloserimsogay 8 points 5 hours ago That one there is a Lamborghini, better hold on to that. permalink parent award report block reply FrmrAmericanRepublic 1 points 3 hours ago The big problem is that from the times of the Hunt Brothers, the massive silver 'corner' that got busted - is that they will change the rules to save themselves. If you like precious metals, great - just realize these fuckers will do whatever they can to keep the big derivative game going. permalink parent award report block reply DagneyTaggart 1 points 3 hours ago As soon as Pam’s finished in Fox’s green room. permalink parent award report block reply\nchickeninoven 48 points 9 hours ago Hah, no. But here's a shiny $2k check to make you forget all about that sweetie. permalink parent award report block reply carpetxparmesan 16 points 9 hours ago It was multiple stimmies, much more than that. People got MORE THAN ONE daniel defense stimmie gun. Libshits regularly got 15k in tesla gibs for a long time. There's quite a bit to go around if you're a scumbag with a nose for money. permalink parent award report block reply view 1 more comments... BigMikesChef 10 points 7 hours ago It's not a 2k check anymore, now they just want you to be grateful for the partial overtime rebate that expires in a couple of years. permalink parent award report block reply Necrovoter 4 points 6 hours ago Thw $2k check is a certificate certifying that you theoretically own a half ounce of the gold that was supposed to be in Fort Knox,  but is now 404. permalink parent award report block reply view 1 more comments...\ncarpetxparmesan 16 points 9 hours ago It was multiple stimmies, much more than that. People got MORE THAN ONE daniel defense stimmie gun. Libshits regularly got 15k in tesla gibs for a long time. There's quite a bit to go around if you're a scumbag with a nose for money. permalink parent award report block reply view 1 more comments...\nBigMikesChef 10 points 7 hours ago It's not a 2k check anymore, now they just want you to be grateful for the partial overtime rebate that expires in a couple of years. permalink parent award report block reply\nNecrovoter 4 points 6 hours ago Thw $2k check is a certificate certifying that you theoretically own a half ounce of the gold that was supposed to be in Fort Knox,  but is now 404. permalink parent award report block reply view 1 more comments...\nBrundlefly78 7 points 8 hours ago Nobody is allowed in to see the big IOU note. permalink parent award report block reply Retardloserimsogay 8 points 5 hours ago That one there is a Lamborghini, better hold on to that. permalink parent award report block reply FrmrAmericanRepublic 1 points 3 hours ago The big problem is that from the times of the Hunt Brothers, the massive silver 'corner' that got busted - is that they will change the rules to save themselves. If you like precious metals, great - just realize these fuckers will do whatever they can to keep the big derivative game going. permalink parent award report block reply\nRetardloserimsogay 8 points 5 hours ago That one there is a Lamborghini, better hold on to that. permalink parent award report block reply\nFrmrAmericanRepublic 1 points 3 hours ago The big problem is that from the times of the Hunt Brothers, the massive silver 'corner' that got busted - is that they will change the rules to save themselves. If you like precious metals, great - just realize these fuckers will do whatever they can to keep the big derivative game going. permalink parent award report block reply\nDagneyTaggart 1 points 3 hours ago As soon as Pam’s finished in Fox’s green room. permalink parent award report block reply\nTexar1991 3 points 30 minutes ago Bitcoin was/ is a relief valve to keep people out of gold and silver. It worked!! Maybe the times they are a changing? permalink parent award report block reply\nBillGateCanSuckIt -2 points 1 hour ago If by fake coin you mean Bitcoin, then you must not understand what it is. permalink parent award report block reply MehNahMehNah 2 points 36 minutes ago It's the not understanding that makes it volatile and untrustworthy. permalink parent award report block reply BillGateCanSuckIt 1 points 25 minutes ago Got it. So because it's not understood the price action is volatile and untrustworthy. Lol. Thanks. I needed a long laugh this morning permalink parent award report block reply view 1 more comments... Consumerbot381732 1 points 24 minutes ago \"There is an infinite amount of cash at the Federal Reserve.\" ~Neel Kashkari, president of the Federal Reserve Bank of Minneapolis Volatility goes down as market cap goes up, and rebalancing of ETF allocations in portfolios has dampened it a bit. It's still a wild ride. I do agree that it's untrustworthy, considering the anonymous creator. The fact that you can memorize your money, carrying only a sequence of words in your brain as you cross a border makes it very special. You can try sneaking gold in a cavity, but there are limits. With proper storage, Bitcoin cannot be confiscated. permalink parent award report block reply view 2 more comments...\nMehNahMehNah 2 points 36 minutes ago It's the not understanding that makes it volatile and untrustworthy. permalink parent award report block reply BillGateCanSuckIt 1 points 25 minutes ago Got it. So because it's not understood the price action is volatile and untrustworthy. Lol. Thanks. I needed a long laugh this morning permalink parent award report block reply view 1 more comments... Consumerbot381732 1 points 24 minutes ago \"There is an infinite amount of cash at the Federal Reserve.\" ~Neel Kashkari, president of the Federal Reserve Bank of Minneapolis Volatility goes down as market cap goes up, and rebalancing of ETF allocations in portfolios has dampened it a bit. It's still a wild ride. I do agree that it's untrustworthy, considering the anonymous creator. The fact that you can memorize your money, carrying only a sequence of words in your brain as you cross a border makes it very special. You can try sneaking gold in a cavity, but there are limits. With proper storage, Bitcoin cannot be confiscated. permalink parent award report block reply view 2 more comments...\nBillGateCanSuckIt 1 points 25 minutes ago Got it. So because it's not understood the price action is volatile and untrustworthy. Lol. Thanks. I needed a long laugh this morning permalink parent award report block reply view 1 more comments...\nConsumerbot381732 1 points 24 minutes ago \"There is an infinite amount of cash at the Federal Reserve.\" ~Neel Kashkari, president of the Federal Reserve Bank of Minneapolis Volatility goes down as market cap goes up, and rebalancing of ETF allocations in portfolios has dampened it a bit. It's still a wild ride. I do agree that it's untrustworthy, considering the anonymous creator. The fact that you can memorize your money, carrying only a sequence of words in your brain as you cross a border makes it very special. You can try sneaking gold in a cavity, but there are limits. With proper storage, Bitcoin cannot be confiscated. permalink parent award report block reply view 2 more comments...\nConvergenceMan -11 points 8 hours ago Cheering for this rock to skyrocket in price is even more retarded than cheering for Ponzicoin, stocks, and houses to skyrocket in price permalink parent award report block reply guywholikesDjtof2024 13 points 7 hours ago this rock Learn history. 4,000+ years and it is still strong. It's weathered more and been used more than dumb digital servers ever have. permalink parent award report block reply SonofaGunDealer12 7 points 4 hours ago Gold and Silver are God’s money fool. U can’t print precious metals and your arguing against about 5000 years of history permalink parent award report block reply\nguywholikesDjtof2024 13 points 7 hours ago this rock Learn history. 4,000+ years and it is still strong. It's weathered more and been used more than dumb digital servers ever have. permalink parent award report block reply\nSonofaGunDealer12 7 points 4 hours ago Gold and Silver are God’s money fool. U can’t print precious metals and your arguing against about 5000 years of history permalink parent award report block reply\nFartOnLibtards 18 points 7 hours ago there's no way I'd buy crypto over gold/silver.  No way in hell.  Gold/silver has been around for thousands of years. permalink parent award report block reply guywholikesDjtof2024 9 points 7 hours ago BASED permalink parent award report block reply PatriotDescendant 2 points 3 hours ago Here's an interesting concept...  PORTFOLIO... permalink parent award report block reply Consumerbot381732 2 points 19 minutes ago Exactly. I like gold, silver, and Bitcoin. Not \"crypto\", though--I stay away from the shitcoin casino. permalink parent award report block reply MastaJoda 1 points 46 minutes ago Markwayne Mullet is that you? permalink parent award report block reply Friar_Pede 0 points 4 hours ago There's no way I'm buying a model T over a horse. Horses have been around for 1000s of years. permalink parent award report block reply grad16uc 7 points 4 hours ago If there's ever a point where you need gold over all other currencies, then yes, the horse would be far more valuable than the car. permalink parent award report block reply Friar_Pede 0 points 3 hours ago We're not that lucky to get to that point.  There's people here that, in all likelihood, have been waiting for that for 5 decades with no fruition. permalink parent award report block reply blitzkrieg1 1 points 9 minutes ago You could not afford a model T today. permalink parent award report block reply\nguywholikesDjtof2024 9 points 7 hours ago BASED permalink parent award report block reply\nPatriotDescendant 2 points 3 hours ago Here's an interesting concept...  PORTFOLIO... permalink parent award report block reply Consumerbot381732 2 points 19 minutes ago Exactly. I like gold, silver, and Bitcoin. Not \"crypto\", though--I stay away from the shitcoin casino. permalink parent award report block reply MastaJoda 1 points 46 minutes ago Markwayne Mullet is that you? permalink parent award report block reply\nConsumerbot381732 2 points 19 minutes ago Exactly. I like gold, silver, and Bitcoin. Not \"crypto\", though--I stay away from the shitcoin casino. permalink parent award report block reply\nMastaJoda 1 points 46 minutes ago Markwayne Mullet is that you? permalink parent award report block reply\nFriar_Pede 0 points 4 hours ago There's no way I'm buying a model T over a horse. Horses have been around for 1000s of years. permalink parent award report block reply grad16uc 7 points 4 hours ago If there's ever a point where you need gold over all other currencies, then yes, the horse would be far more valuable than the car. permalink parent award report block reply Friar_Pede 0 points 3 hours ago We're not that lucky to get to that point.  There's people here that, in all likelihood, have been waiting for that for 5 decades with no fruition. permalink parent award report block reply blitzkrieg1 1 points 9 minutes ago You could not afford a model T today. permalink parent award report block reply\ngrad16uc 7 points 4 hours ago If there's ever a point where you need gold over all other currencies, then yes, the horse would be far more valuable than the car. permalink parent award report block reply Friar_Pede 0 points 3 hours ago We're not that lucky to get to that point.  There's people here that, in all likelihood, have been waiting for that for 5 decades with no fruition. permalink parent award report block reply\nFriar_Pede 0 points 3 hours ago We're not that lucky to get to that point.  There's people here that, in all likelihood, have been waiting for that for 5 decades with no fruition. permalink parent award report block reply\nblitzkrieg1 1 points 9 minutes ago You could not afford a model T today. permalink parent award report block reply\nYawnz13 11 points 8 hours ago Food, bullets, fuel, metal tools, etc. are all FAR more valuable than gold. permalink parent award report block reply Moebius 7 points 7 hours ago Yup.  Lead is a better investment. With Lead you can take the Gold... permalink parent award report block reply Thedaythe_redditdied 3 points 3 hours ago Lead is highly useless in un trained hands. And no one trains enough. permalink parent award report block reply Moebius 1 points 3 minutes ago CIB with one star and MQB Rifle and Pistol. I don't shoot as much lately though.  Ammo is expensive...even if you reload. permalink parent award report block reply Friar_Pede 1 points 5 minutes ago Shotgun is pretty easy permalink parent award report block reply PatriotDescendant 1 points 3 hours ago Not mine! Good luck! But in general, correct! permalink parent award report block reply IAmNotAnAutist 1 points 5 minutes ago Bring it on, marauder. Those of us with gold have lead too. Bring it, I say. permalink parent award report block reply XLNutts 3 points 2 hours ago Whiskey, don't forget whiskey. permalink parent award report block reply MehNahMehNah 2 points 35 minutes ago And land! permalink parent award report block reply SonofaGunDealer12 2 points 4 hours ago Only in very brief moments in history. Then ask yourself throughout history how food, bullets, etc were acquired. Gold permalink parent award report block reply IAmNotAnAutist 1 points 4 minutes ago Don't ask him to think.  He doesn't do 'thinking'. permalink parent award report block reply\nMoebius 7 points 7 hours ago Yup.  Lead is a better investment. With Lead you can take the Gold... permalink parent award report block reply Thedaythe_redditdied 3 points 3 hours ago Lead is highly useless in un trained hands. And no one trains enough. permalink parent award report block reply Moebius 1 points 3 minutes ago CIB with one star and MQB Rifle and Pistol. I don't shoot as much lately though.  Ammo is expensive...even if you reload. permalink parent award report block reply Friar_Pede 1 points 5 minutes ago Shotgun is pretty easy permalink parent award report block reply PatriotDescendant 1 points 3 hours ago Not mine! Good luck! But in general, correct! permalink parent award report block reply IAmNotAnAutist 1 points 5 minutes ago Bring it on, marauder. Those of us with gold have lead too. Bring it, I say. permalink parent award report block reply\nThedaythe_redditdied 3 points 3 hours ago Lead is highly useless in un trained hands. And no one trains enough. permalink parent award report block reply Moebius 1 points 3 minutes ago CIB with one star and MQB Rifle and Pistol. I don't shoot as much lately though.  Ammo is expensive...even if you reload. permalink parent award report block reply Friar_Pede 1 points 5 minutes ago Shotgun is pretty easy permalink parent award report block reply\nMoebius 1 points 3 minutes ago CIB with one star and MQB Rifle and Pistol. I don't shoot as much lately though.  Ammo is expensive...even if you reload. permalink parent award report block reply\nFriar_Pede 1 points 5 minutes ago Shotgun is pretty easy permalink parent award report block reply\nPatriotDescendant 1 points 3 hours ago Not mine! Good luck! But in general, correct! permalink parent award report block reply\nIAmNotAnAutist 1 points 5 minutes ago Bring it on, marauder. Those of us with gold have lead too. Bring it, I say. permalink parent award report block reply\nXLNutts 3 points 2 hours ago Whiskey, don't forget whiskey. permalink parent award report block reply MehNahMehNah 2 points 35 minutes ago And land! permalink parent award report block reply\nMehNahMehNah 2 points 35 minutes ago And land! permalink parent award report block reply\nSonofaGunDealer12 2 points 4 hours ago Only in very brief moments in history. Then ask yourself throughout history how food, bullets, etc were acquired. Gold permalink parent award report block reply IAmNotAnAutist 1 points 4 minutes ago Don't ask him to think.  He doesn't do 'thinking'. permalink parent award report block reply\nIAmNotAnAutist 1 points 4 minutes ago Don't ask him to think.  He doesn't do 'thinking'. permalink parent award report block reply\nMoebius 9 points 8 hours ago Silver boasts a surprising rarity that throws the current market value into question. Geologists estimate that a mere 19 ounces of silver exist in the Earth’s crust for every 1 ounce of gold. That disparity shrinks when comparing that to actual mined silver, but it still sits at a much higher ratio (11.2:1) than the current market price reflects though that ratio is tightening. permalink parent award report block reply TrumpOrTreason 11 points 7 hours ago Historical, the silver to gold ratio has been 15:1 If the price of silver was honest, silver would be at $260 If the price of gold was honest it would be around $80k permalink parent award report block reply PatriotDescendant 1 points 3 hours ago All these economics are poised for massive disruption...we're less than a decade away from mining asteroids. permalink parent award report block reply strongdefense 2 points 2 hours ago Theoretically, yes, but practically, not even close.  There are not enough asteroids in close enough proximity to Earth to do so.  Asteroids are years away from us in terms of current space travel speeds.  Add in the need to land a spacecraft, extract the ore remotely, repackage it on a return vessel and then fly back to Earth and you quickly realize that the math doesn't math.  Couple in the incredible financial risk involved in pulling this off and it quickly falls apart.  It sounds great in movies but real life is much different. permalink parent award report block reply PatriotDescendant 1 points 2 hours ago Speak to Thales. Blue Origin. Others. They'll be crushed by your news. permalink parent award report block reply view 2 more comments...\nTrumpOrTreason 11 points 7 hours ago Historical, the silver to gold ratio has been 15:1 If the price of silver was honest, silver would be at $260 If the price of gold was honest it would be around $80k permalink parent award report block reply\nPatriotDescendant 1 points 3 hours ago All these economics are poised for massive disruption...we're less than a decade away from mining asteroids. permalink parent award report block reply strongdefense 2 points 2 hours ago Theoretically, yes, but practically, not even close.  There are not enough asteroids in close enough proximity to Earth to do so.  Asteroids are years away from us in terms of current space travel speeds.  Add in the need to land a spacecraft, extract the ore remotely, repackage it on a return vessel and then fly back to Earth and you quickly realize that the math doesn't math.  Couple in the incredible financial risk involved in pulling this off and it quickly falls apart.  It sounds great in movies but real life is much different. permalink parent award report block reply PatriotDescendant 1 points 2 hours ago Speak to Thales. Blue Origin. Others. They'll be crushed by your news. permalink parent award report block reply view 2 more comments...\nstrongdefense 2 points 2 hours ago Theoretically, yes, but practically, not even close.  There are not enough asteroids in close enough proximity to Earth to do so.  Asteroids are years away from us in terms of current space travel speeds.  Add in the need to land a spacecraft, extract the ore remotely, repackage it on a return vessel and then fly back to Earth and you quickly realize that the math doesn't math.  Couple in the incredible financial risk involved in pulling this off and it quickly falls apart.  It sounds great in movies but real life is much different. permalink parent award report block reply PatriotDescendant 1 points 2 hours ago Speak to Thales. Blue Origin. Others. They'll be crushed by your news. permalink parent award report block reply view 2 more comments...\nPatriotDescendant 1 points 2 hours ago Speak to Thales. Blue Origin. Others. They'll be crushed by your news. permalink parent award report block reply view 2 more comments...\nAlmostFullyDilated 8 points 5 hours ago I'm going to go with the opposite of the top post. buy property, cows, chickens, goats. you can't eat gold permalink parent award report block reply TerrorAndSlaughter 7 points 4 hours ago As someone who has goats, chickens, and a dairy cow, let me tell you that I will always sell my eggs, cheese, and meat to people offering silver.  Dollars?  I'm not so confident. permalink parent award report block reply AlmostFullyDilated -7 points 4 hours ago silver is for faggots! this silver fad will pass faster than pogs permalink parent award report block reply duznmatter 8 points 3 hours ago I hope it does so I can buy more. permalink parent award report block reply view 3 more comments...\nTerrorAndSlaughter 7 points 4 hours ago As someone who has goats, chickens, and a dairy cow, let me tell you that I will always sell my eggs, cheese, and meat to people offering silver.  Dollars?  I'm not so confident. permalink parent award report block reply AlmostFullyDilated -7 points 4 hours ago silver is for faggots! this silver fad will pass faster than pogs permalink parent award report block reply duznmatter 8 points 3 hours ago I hope it does so I can buy more. permalink parent award report block reply view 3 more comments...\nAlmostFullyDilated -7 points 4 hours ago silver is for faggots! this silver fad will pass faster than pogs permalink parent award report block reply duznmatter 8 points 3 hours ago I hope it does so I can buy more. permalink parent award report block reply view 3 more comments...\nduznmatter 8 points 3 hours ago I hope it does so I can buy more. permalink parent award report block reply view 3 more comments...\nTrump2024 46 points 9 hours ago Oh FFS! We're pushing this bullshit again? Based on a 12 hour graph? Excuse me,  do you have a moment for me to tell you about the love of Pepe Coin? permalink award report block reply Hanging_Chad 23 points 9 hours ago silver is up 11.62% in the past 5 days 😯 permalink parent award report block reply the-new-style 18 points 8 hours ago Yes! To the same price it was a month ago! permalink parent award report block reply AstroLonghorn 3 points 2 hours ago (Which was an all time high) permalink parent award report block reply carpetxparmesan 8 points 8 hours ago On a more serious note, if someone wanted to dip their toes in silver, how would any of you do it? Do you have a favorite seller, some quick tips and techniques? In return, I'll leave a useful perspective for those who don't understand what's happening. Silver is increasing in value above the stock market. When that happens, historically, it is my understanding that there is fear in the population and a general belief that bad times are coming - and those bad times tend to happen, historically. The reason the price is increasing so much is that once that threshold is crossed, where the silver is more valuable than the market, people talk more about it and it is generally understood that things have gone from speculation to general feeling in the population. Inviduals can be stupid, but sometimes in large numbers, they can make fairly smart/educated decisions - sometimes. So it snowballs, more people talk about it, more people take it seriously, more people buy silver, the price rises. Now... will you lose your shirt if you invest now? Possibly. In your lifetime, the silver may not return to the price you bought it. But, if that silver stays in the family or you live another 50 years, chances are good it'll return to this value. Or, you could see it going even higher and never return to this value because our currency is so devalued. permalink parent award report block reply ViagraFalls 10 points 8 hours ago The first thing you need to understand about metals is the buyer/seller dynamic exists. If you sell your used car to a dealership, they might give you $1000 for it. Then you might find that they sold it for $1500-2000. Of course, you could sell your car to a person instead and get $1500. When dealing with metal dealers they are in the position of seller and you are in the position of buyer. With metals, I think people are paranoid about getting scammed, so they don’t like to buy from other people. Aside from this if you buy a substantial amount, you will probably want insurance on it, which is an additional cost and a scam. I heard they just automatically reject all claims. So if your $15,000 worth of metals disappears in shipping, you’ll have to be starting a lawsuit. I would only recommend buying metals if you think a major currency crash (hyperinflation) will happen. The prophet that predicted Trump getting shot in the ear also said there will be a currency crash and USD will be replaced by the Amero for the US, Mexico, and Canada. If you have enough cash to buy 10 horses, but buy metals instead, when you sell your metals, you’ll probably have enough cash to buy 9 horses in whatever you get at the time. If the currency gets highly devalued, all the cash you kept will be enough to buy a pack of toilet paper instead of a horse. Ultimately, I think of buying metals as a way to preserve the value of money instead of a way to make money. The paper trading problem might prove me wrong about that. People (most likely ones with long crooked noses) came up with this idea of selling pieces of paper that say you have x amount of silver (or whatever metal). They’re most likely selling 10 times as much silver than they have in stock. People will probably figure this out when it’s too late and then they’re just left with paper. This also enables the rich to manipulate the metal markets and keep the prices artificially low. Silver was around $45-48 in the 1980s. Some believe silver in the $20-25 range was artificial. If this whole scam collapses, the values of metals might shoot up to their proper values without manipulation going on making owning metals profitable even in terms of buying value. There is also the possibility of some new technology increasing the demand for a metal, but I wouldn’t count on that happening. permalink parent award report block reply Thedaythe_redditdied 4 points 2 hours ago Excellent explanation I would like to point out one thing that you probably underestimated the paper silver sellers don’t just give out 10 times paper what they have physical ( your local back actually does this with the US dollar. Yes they loan out 10 times more cash then they have) right now the paper to physically is 358 to 1. Meaning for every ounce of silver they have in thier vaults. They have sold 358 silver certificates for that one ounce. But wait you ask. What if I turn in my certificate and request the physical ounce be sent to me? If you ask for a couple ounces they might send you some. But if you ask for a lot. They will just send you a check in US dollars for the value of the silver  you supposedly own. Because you don’t actually own the silver. A small tribe owns the silver and then lies to you and says it’s yours and they will just keep it safe for you. Anyone interested in shiny rocks. you need to physically hold and control them your self or what you have is worth less than fiat cash. Silver or gold certificates are the second biggest scam going. After the US dollar. permalink parent award report block reply view 1 more comments... rextexMG 7 points 6 hours ago I buy direct from APMEX.com. I have had a subscription for gold and silver for years. permalink parent award report block reply DJTXLV 4 points 3 hours ago APMEX JM Bullion SD Bullion Bold Precious Metals BGASC Check if there are new customer deals where you can buy at spot. permalink parent award report block reply Shakakka99 4 points 4 hours ago Me also.  And don't listen to those here telling you that you might buy silver for $50 and sell it for $40.  That's bullshit.  Local shops near me will pay $1-$2 under spot price for it, sometimes right on spot.  You pay the premium when you buy it; at the moment silver is at $54 and APMEX is selling 1oz silver eagles for $62. Advice: avoid giant bars - they will be harder to sell.  5oz and 10oz are fine, but make sure the bars are a reputable known brand.  The best is to buy 1oz coins or rounds, they are easy to peel off and sell when you want to.  Don't buy fancy stuff, get the coins minted for each country: American silver eagles, Canadian maple leaf coins, UK Britannias, Austrian philharmonics, etc...  These are easily recognizable and accepted everywhere, and you'll get close to spot for them without issue. permalink parent award report block reply view 1 more comments... GenWashington OP 3 points 6 hours ago A. Where to buy and sell. Find a good local shop and a trusted online seller. Money metals is OK. You want a decent relationship with your local company. When time to sell Today we have multiple factors to consider.\nFed notes printed beyond belief -\nIllegal invasion -\nThe is a 800 million ounce (paper) derivative buble - Finally BRICS permalink parent award report block reply user2827 1 points 7 hours ago What u/ViagraFalls says is about accurate. More simply, buy and sell price is on margin... So, if silver is 50$ it might be you buy for 50$ and sell for 40$. Also agreed that buying metals is more about preserving wealth than something like stocks where there's an expectation of stock price increasing above and beyond inflation. If you bought gold at 25$ and sold it at 100$, you can reasonably expect that the general costs for stuff will have gone up roughly proportional. The issue about the manipulation of prices is also true, and one of those rare moments where one could reasonably expect a real profit relative to inflation. I've heard arguments that gold prices SHOULD be trading at about 2-3x the prices at the time and silver, because of the industrial uses should be in the range of 5-10x the market. This isn't something worth counting on because if that music does stop and people buying gold and silver for 1-20k per oz, then there's going to be a lot more going on to worry about, and are just as likely to be facing a barter scenario. permalink parent award report block reply Meow4me2 1 points 4 hours ago We are buying for a local dealer (check with BBB for complaints) and looking to set up a gold IRA now to lock in some gains from the stock market. Local dealer - markup will likely be 1-2% higher than an online company, but you can usually buy in smaller portions, so easier to add a bit here or there. I found our dealer via an online search, checked reviews and BBB, then met before deciding to buy from him. Online dealer - minimum buys are higher, markups lower. We haven’t gone this route because of worries over shipping “losses”. I’d rather pick it up directly myself from a local dealer. Precious metals IRA - Looking to move some money from an IRA overweighted in stocks to metals. IRA is physical metals held in a depository for us. Bonds are really underperforming, so looking at metals to preserve value. Have a gold ETF, but it behaves more like a stock. Stock market values so high, I’m worried about a big correction. I’m 3-5 years from retirement, no time to recover a big loss in the market. Physical gold and silver - we purchased enough to trade here if we ever really needed to. Hope the helps. permalink parent award report block reply Thedaythe_redditdied 1 points 2 hours ago Don’t forget if you buy online there is a paper trail they you own precious metals. And big daddy government has already stolen citizens gold in recent American history. So you don’t want the feds showing up to confiscate your gold to save the dollar (they absolutely will by the way) permalink parent award report block reply load 4 more comments... MySidesGoUp 3 points 5 hours ago Up 50% in a year… permalink parent award report block reply Texar1991 1 points 1 hour ago Almost double YTD. permalink parent award report block reply LaVaughnRobinson 13 points 9 hours ago Better is people thinking they investing in silver or gold with these stocks actually own any of it as if the fake shit wont crash also in a world-wide meltdown, kek.  Buy physical gold/silver coins if you want something for the apocalypse to actually use. permalink parent award report block reply darkmodeforgotpass 11 points 9 hours ago Lead is a better investment IMO. permalink parent award report block reply carpetxparmesan 3 points 9 hours ago It's not. I did the math, too dense, literally. When you factor in the cost of storage, which would be competitive advantage for you if you had a dry cave for free but NOT a competitive advantage if you erected a 100$/sqft structure like most people... you house finna buckle under the weight of your savings. And, so will your back, because you gonna need a fork lift to move any of it in or out or around for anything beyond a reasonable 3-10k round count which almost everyone should have (if nothing else, in 22 if that's all you can stuff under your bed). permalink parent award report block reply Thedaythe_redditdied 2 points 2 hours ago Only if you spend 50% of your lead on training. Cause a pile of bullets in the closet of a guy that thinks he can shoot is just free bullets for people who train. permalink parent award report block reply user2827 1 points 7 hours ago If that scenario comes about; you'd want to have guns, a reasonable amount of ammo, food and water stored or available, and the surplus could be kept in metals for barter. permalink parent award report block reply ValhallaBaboon 1 points 8 hours ago invest in lead paint permalink parent award report block reply TS-SCI_thong 1 points 2 hours ago Who would have guessed brass and lead was a great invest ment permalink parent award report block reply Trump2024 5 points 9 hours ago The only precious metal to invest in is high velocity lead ingots. With lead ingots you can have as much as you want of any other metal. permalink parent award report block reply zillat 3 points 9 hours ago You should do both, because many people have assets that are limited in what they can invest in, emerging markets are going to rip as well, if you don't want pure paper metals, buy mining stocks or small mining stocks are even better, GDXJ, etc. permalink parent award report block reply EatChit 7 points 9 hours ago Hey, I've got 170m of those bad boys.. And did you not SEE his graph? It's going up! permalink parent award report block reply Trump2024 5 points 9 hours ago I've got 500 million pepe coins. I'm hodling permalink parent award report block reply guywholikesDjtof2024 3 points 9 hours ago pepe coins are digital. One solar flare and they all get destroyed. buy metal with pepe coins. permalink parent award report block reply ReallyGayMods 3 points 9 hours ago I do actually and wouldnt mind hearing about pepe coin? Silver is up like 120% in the last 5 or so years. How does that compare to pepe coin? permalink parent award report block reply load 1 more comments...\nHanging_Chad 23 points 9 hours ago silver is up 11.62% in the past 5 days 😯 permalink parent award report block reply the-new-style 18 points 8 hours ago Yes! To the same price it was a month ago! permalink parent award report block reply AstroLonghorn 3 points 2 hours ago (Which was an all time high) permalink parent award report block reply carpetxparmesan 8 points 8 hours ago On a more serious note, if someone wanted to dip their toes in silver, how would any of you do it? Do you have a favorite seller, some quick tips and techniques? In return, I'll leave a useful perspective for those who don't understand what's happening. Silver is increasing in value above the stock market. When that happens, historically, it is my understanding that there is fear in the population and a general belief that bad times are coming - and those bad times tend to happen, historically. The reason the price is increasing so much is that once that threshold is crossed, where the silver is more valuable than the market, people talk more about it and it is generally understood that things have gone from speculation to general feeling in the population. Inviduals can be stupid, but sometimes in large numbers, they can make fairly smart/educated decisions - sometimes. So it snowballs, more people talk about it, more people take it seriously, more people buy silver, the price rises. Now... will you lose your shirt if you invest now? Possibly. In your lifetime, the silver may not return to the price you bought it. But, if that silver stays in the family or you live another 50 years, chances are good it'll return to this value. Or, you could see it going even higher and never return to this value because our currency is so devalued. permalink parent award report block reply ViagraFalls 10 points 8 hours ago The first thing you need to understand about metals is the buyer/seller dynamic exists. If you sell your used car to a dealership, they might give you $1000 for it. Then you might find that they sold it for $1500-2000. Of course, you could sell your car to a person instead and get $1500. When dealing with metal dealers they are in the position of seller and you are in the position of buyer. With metals, I think people are paranoid about getting scammed, so they don’t like to buy from other people. Aside from this if you buy a substantial amount, you will probably want insurance on it, which is an additional cost and a scam. I heard they just automatically reject all claims. So if your $15,000 worth of metals disappears in shipping, you’ll have to be starting a lawsuit. I would only recommend buying metals if you think a major currency crash (hyperinflation) will happen. The prophet that predicted Trump getting shot in the ear also said there will be a currency crash and USD will be replaced by the Amero for the US, Mexico, and Canada. If you have enough cash to buy 10 horses, but buy metals instead, when you sell your metals, you’ll probably have enough cash to buy 9 horses in whatever you get at the time. If the currency gets highly devalued, all the cash you kept will be enough to buy a pack of toilet paper instead of a horse. Ultimately, I think of buying metals as a way to preserve the value of money instead of a way to make money. The paper trading problem might prove me wrong about that. People (most likely ones with long crooked noses) came up with this idea of selling pieces of paper that say you have x amount of silver (or whatever metal). They’re most likely selling 10 times as much silver than they have in stock. People will probably figure this out when it’s too late and then they’re just left with paper. This also enables the rich to manipulate the metal markets and keep the prices artificially low. Silver was around $45-48 in the 1980s. Some believe silver in the $20-25 range was artificial. If this whole scam collapses, the values of metals might shoot up to their proper values without manipulation going on making owning metals profitable even in terms of buying value. There is also the possibility of some new technology increasing the demand for a metal, but I wouldn’t count on that happening. permalink parent award report block reply Thedaythe_redditdied 4 points 2 hours ago Excellent explanation I would like to point out one thing that you probably underestimated the paper silver sellers don’t just give out 10 times paper what they have physical ( your local back actually does this with the US dollar. Yes they loan out 10 times more cash then they have) right now the paper to physically is 358 to 1. Meaning for every ounce of silver they have in thier vaults. They have sold 358 silver certificates for that one ounce. But wait you ask. What if I turn in my certificate and request the physical ounce be sent to me? If you ask for a couple ounces they might send you some. But if you ask for a lot. They will just send you a check in US dollars for the value of the silver  you supposedly own. Because you don’t actually own the silver. A small tribe owns the silver and then lies to you and says it’s yours and they will just keep it safe for you. Anyone interested in shiny rocks. you need to physically hold and control them your self or what you have is worth less than fiat cash. Silver or gold certificates are the second biggest scam going. After the US dollar. permalink parent award report block reply view 1 more comments... rextexMG 7 points 6 hours ago I buy direct from APMEX.com. I have had a subscription for gold and silver for years. permalink parent award report block reply DJTXLV 4 points 3 hours ago APMEX JM Bullion SD Bullion Bold Precious Metals BGASC Check if there are new customer deals where you can buy at spot. permalink parent award report block reply Shakakka99 4 points 4 hours ago Me also.  And don't listen to those here telling you that you might buy silver for $50 and sell it for $40.  That's bullshit.  Local shops near me will pay $1-$2 under spot price for it, sometimes right on spot.  You pay the premium when you buy it; at the moment silver is at $54 and APMEX is selling 1oz silver eagles for $62. Advice: avoid giant bars - they will be harder to sell.  5oz and 10oz are fine, but make sure the bars are a reputable known brand.  The best is to buy 1oz coins or rounds, they are easy to peel off and sell when you want to.  Don't buy fancy stuff, get the coins minted for each country: American silver eagles, Canadian maple leaf coins, UK Britannias, Austrian philharmonics, etc...  These are easily recognizable and accepted everywhere, and you'll get close to spot for them without issue. permalink parent award report block reply view 1 more comments... GenWashington OP 3 points 6 hours ago A. Where to buy and sell. Find a good local shop and a trusted online seller. Money metals is OK. You want a decent relationship with your local company. When time to sell Today we have multiple factors to consider.\nFed notes printed beyond belief -\nIllegal invasion -\nThe is a 800 million ounce (paper) derivative buble - Finally BRICS permalink parent award report block reply user2827 1 points 7 hours ago What u/ViagraFalls says is about accurate. More simply, buy and sell price is on margin... So, if silver is 50$ it might be you buy for 50$ and sell for 40$. Also agreed that buying metals is more about preserving wealth than something like stocks where there's an expectation of stock price increasing above and beyond inflation. If you bought gold at 25$ and sold it at 100$, you can reasonably expect that the general costs for stuff will have gone up roughly proportional. The issue about the manipulation of prices is also true, and one of those rare moments where one could reasonably expect a real profit relative to inflation. I've heard arguments that gold prices SHOULD be trading at about 2-3x the prices at the time and silver, because of the industrial uses should be in the range of 5-10x the market. This isn't something worth counting on because if that music does stop and people buying gold and silver for 1-20k per oz, then there's going to be a lot more going on to worry about, and are just as likely to be facing a barter scenario. permalink parent award report block reply Meow4me2 1 points 4 hours ago We are buying for a local dealer (check with BBB for complaints) and looking to set up a gold IRA now to lock in some gains from the stock market. Local dealer - markup will likely be 1-2% higher than an online company, but you can usually buy in smaller portions, so easier to add a bit here or there. I found our dealer via an online search, checked reviews and BBB, then met before deciding to buy from him. Online dealer - minimum buys are higher, markups lower. We haven’t gone this route because of worries over shipping “losses”. I’d rather pick it up directly myself from a local dealer. Precious metals IRA - Looking to move some money from an IRA overweighted in stocks to metals. IRA is physical metals held in a depository for us. Bonds are really underperforming, so looking at metals to preserve value. Have a gold ETF, but it behaves more like a stock. Stock market values so high, I’m worried about a big correction. I’m 3-5 years from retirement, no time to recover a big loss in the market. Physical gold and silver - we purchased enough to trade here if we ever really needed to. Hope the helps. permalink parent award report block reply Thedaythe_redditdied 1 points 2 hours ago Don’t forget if you buy online there is a paper trail they you own precious metals. And big daddy government has already stolen citizens gold in recent American history. So you don’t want the feds showing up to confiscate your gold to save the dollar (they absolutely will by the way) permalink parent award report block reply load 4 more comments... MySidesGoUp 3 points 5 hours ago Up 50% in a year… permalink parent award report block reply Texar1991 1 points 1 hour ago Almost double YTD. permalink parent award report block reply\nthe-new-style 18 points 8 hours ago Yes! To the same price it was a month ago! permalink parent award report block reply AstroLonghorn 3 points 2 hours ago (Which was an all time high) permalink parent award report block reply\nAstroLonghorn 3 points 2 hours ago (Which was an all time high) permalink parent award report block reply\ncarpetxparmesan 8 points 8 hours ago On a more serious note, if someone wanted to dip their toes in silver, how would any of you do it? Do you have a favorite seller, some quick tips and techniques? In return, I'll leave a useful perspective for those who don't understand what's happening. Silver is increasing in value above the stock market. When that happens, historically, it is my understanding that there is fear in the population and a general belief that bad times are coming - and those bad times tend to happen, historically. The reason the price is increasing so much is that once that threshold is crossed, where the silver is more valuable than the market, people talk more about it and it is generally understood that things have gone from speculation to general feeling in the population. Inviduals can be stupid, but sometimes in large numbers, they can make fairly smart/educated decisions - sometimes. So it snowballs, more people talk about it, more people take it seriously, more people buy silver, the price rises. Now... will you lose your shirt if you invest now? Possibly. In your lifetime, the silver may not return to the price you bought it. But, if that silver stays in the family or you live another 50 years, chances are good it'll return to this value. Or, you could see it going even higher and never return to this value because our currency is so devalued. permalink parent award report block reply ViagraFalls 10 points 8 hours ago The first thing you need to understand about metals is the buyer/seller dynamic exists. If you sell your used car to a dealership, they might give you $1000 for it. Then you might find that they sold it for $1500-2000. Of course, you could sell your car to a person instead and get $1500. When dealing with metal dealers they are in the position of seller and you are in the position of buyer. With metals, I think people are paranoid about getting scammed, so they don’t like to buy from other people. Aside from this if you buy a substantial amount, you will probably want insurance on it, which is an additional cost and a scam. I heard they just automatically reject all claims. So if your $15,000 worth of metals disappears in shipping, you’ll have to be starting a lawsuit. I would only recommend buying metals if you think a major currency crash (hyperinflation) will happen. The prophet that predicted Trump getting shot in the ear also said there will be a currency crash and USD will be replaced by the Amero for the US, Mexico, and Canada. If you have enough cash to buy 10 horses, but buy metals instead, when you sell your metals, you’ll probably have enough cash to buy 9 horses in whatever you get at the time. If the currency gets highly devalued, all the cash you kept will be enough to buy a pack of toilet paper instead of a horse. Ultimately, I think of buying metals as a way to preserve the value of money instead of a way to make money. The paper trading problem might prove me wrong about that. People (most likely ones with long crooked noses) came up with this idea of selling pieces of paper that say you have x amount of silver (or whatever metal). They’re most likely selling 10 times as much silver than they have in stock. People will probably figure this out when it’s too late and then they’re just left with paper. This also enables the rich to manipulate the metal markets and keep the prices artificially low. Silver was around $45-48 in the 1980s. Some believe silver in the $20-25 range was artificial. If this whole scam collapses, the values of metals might shoot up to their proper values without manipulation going on making owning metals profitable even in terms of buying value. There is also the possibility of some new technology increasing the demand for a metal, but I wouldn’t count on that happening. permalink parent award report block reply Thedaythe_redditdied 4 points 2 hours ago Excellent explanation I would like to point out one thing that you probably underestimated the paper silver sellers don’t just give out 10 times paper what they have physical ( your local back actually does this with the US dollar. Yes they loan out 10 times more cash then they have) right now the paper to physically is 358 to 1. Meaning for every ounce of silver they have in thier vaults. They have sold 358 silver certificates for that one ounce. But wait you ask. What if I turn in my certificate and request the physical ounce be sent to me? If you ask for a couple ounces they might send you some. But if you ask for a lot. They will just send you a check in US dollars for the value of the silver  you supposedly own. Because you don’t actually own the silver. A small tribe owns the silver and then lies to you and says it’s yours and they will just keep it safe for you. Anyone interested in shiny rocks. you need to physically hold and control them your self or what you have is worth less than fiat cash. Silver or gold certificates are the second biggest scam going. After the US dollar. permalink parent award report block reply view 1 more comments... rextexMG 7 points 6 hours ago I buy direct from APMEX.com. I have had a subscription for gold and silver for years. permalink parent award report block reply DJTXLV 4 points 3 hours ago APMEX JM Bullion SD Bullion Bold Precious Metals BGASC Check if there are new customer deals where you can buy at spot. permalink parent award report block reply Shakakka99 4 points 4 hours ago Me also.  And don't listen to those here telling you that you might buy silver for $50 and sell it for $40.  That's bullshit.  Local shops near me will pay $1-$2 under spot price for it, sometimes right on spot.  You pay the premium when you buy it; at the moment silver is at $54 and APMEX is selling 1oz silver eagles for $62. Advice: avoid giant bars - they will be harder to sell.  5oz and 10oz are fine, but make sure the bars are a reputable known brand.  The best is to buy 1oz coins or rounds, they are easy to peel off and sell when you want to.  Don't buy fancy stuff, get the coins minted for each country: American silver eagles, Canadian maple leaf coins, UK Britannias, Austrian philharmonics, etc...  These are easily recognizable and accepted everywhere, and you'll get close to spot for them without issue. permalink parent award report block reply view 1 more comments... GenWashington OP 3 points 6 hours ago A. Where to buy and sell. Find a good local shop and a trusted online seller. Money metals is OK. You want a decent relationship with your local company. When time to sell Today we have multiple factors to consider.\nFed notes printed beyond belief -\nIllegal invasion -\nThe is a 800 million ounce (paper) derivative buble - Finally BRICS permalink parent award report block reply user2827 1 points 7 hours ago What u/ViagraFalls says is about accurate. More simply, buy and sell price is on margin... So, if silver is 50$ it might be you buy for 50$ and sell for 40$. Also agreed that buying metals is more about preserving wealth than something like stocks where there's an expectation of stock price increasing above and beyond inflation. If you bought gold at 25$ and sold it at 100$, you can reasonably expect that the general costs for stuff will have gone up roughly proportional. The issue about the manipulation of prices is also true, and one of those rare moments where one could reasonably expect a real profit relative to inflation. I've heard arguments that gold prices SHOULD be trading at about 2-3x the prices at the time and silver, because of the industrial uses should be in the range of 5-10x the market. This isn't something worth counting on because if that music does stop and people buying gold and silver for 1-20k per oz, then there's going to be a lot more going on to worry about, and are just as likely to be facing a barter scenario. permalink parent award report block reply Meow4me2 1 points 4 hours ago We are buying for a local dealer (check with BBB for complaints) and looking to set up a gold IRA now to lock in some gains from the stock market. Local dealer - markup will likely be 1-2% higher than an online company, but you can usually buy in smaller portions, so easier to add a bit here or there. I found our dealer via an online search, checked reviews and BBB, then met before deciding to buy from him. Online dealer - minimum buys are higher, markups lower. We haven’t gone this route because of worries over shipping “losses”. I’d rather pick it up directly myself from a local dealer. Precious metals IRA - Looking to move some money from an IRA overweighted in stocks to metals. IRA is physical metals held in a depository for us. Bonds are really underperforming, so looking at metals to preserve value. Have a gold ETF, but it behaves more like a stock. Stock market values so high, I’m worried about a big correction. I’m 3-5 years from retirement, no time to recover a big loss in the market. Physical gold and silver - we purchased enough to trade here if we ever really needed to. Hope the helps. permalink parent award report block reply Thedaythe_redditdied 1 points 2 hours ago Don’t forget if you buy online there is a paper trail they you own precious metals. And big daddy government has already stolen citizens gold in recent American history. So you don’t want the feds showing up to confiscate your gold to save the dollar (they absolutely will by the way) permalink parent award report block reply load 4 more comments...\nViagraFalls 10 points 8 hours ago The first thing you need to understand about metals is the buyer/seller dynamic exists. If you sell your used car to a dealership, they might give you $1000 for it. Then you might find that they sold it for $1500-2000. Of course, you could sell your car to a person instead and get $1500. When dealing with metal dealers they are in the position of seller and you are in the position of buyer. With metals, I think people are paranoid about getting scammed, so they don’t like to buy from other people. Aside from this if you buy a substantial amount, you will probably want insurance on it, which is an additional cost and a scam. I heard they just automatically reject all claims. So if your $15,000 worth of metals disappears in shipping, you’ll have to be starting a lawsuit. I would only recommend buying metals if you think a major currency crash (hyperinflation) will happen. The prophet that predicted Trump getting shot in the ear also said there will be a currency crash and USD will be replaced by the Amero for the US, Mexico, and Canada. If you have enough cash to buy 10 horses, but buy metals instead, when you sell your metals, you’ll probably have enough cash to buy 9 horses in whatever you get at the time. If the currency gets highly devalued, all the cash you kept will be enough to buy a pack of toilet paper instead of a horse. Ultimately, I think of buying metals as a way to preserve the value of money instead of a way to make money. The paper trading problem might prove me wrong about that. People (most likely ones with long crooked noses) came up with this idea of selling pieces of paper that say you have x amount of silver (or whatever metal). They’re most likely selling 10 times as much silver than they have in stock. People will probably figure this out when it’s too late and then they’re just left with paper. This also enables the rich to manipulate the metal markets and keep the prices artificially low. Silver was around $45-48 in the 1980s. Some believe silver in the $20-25 range was artificial. If this whole scam collapses, the values of metals might shoot up to their proper values without manipulation going on making owning metals profitable even in terms of buying value. There is also the possibility of some new technology increasing the demand for a metal, but I wouldn’t count on that happening. permalink parent award report block reply Thedaythe_redditdied 4 points 2 hours ago Excellent explanation I would like to point out one thing that you probably underestimated the paper silver sellers don’t just give out 10 times paper what they have physical ( your local back actually does this with the US dollar. Yes they loan out 10 times more cash then they have) right now the paper to physically is 358 to 1. Meaning for every ounce of silver they have in thier vaults. They have sold 358 silver certificates for that one ounce. But wait you ask. What if I turn in my certificate and request the physical ounce be sent to me? If you ask for a couple ounces they might send you some. But if you ask for a lot. They will just send you a check in US dollars for the value of the silver  you supposedly own. Because you don’t actually own the silver. A small tribe owns the silver and then lies to you and says it’s yours and they will just keep it safe for you. Anyone interested in shiny rocks. you need to physically hold and control them your self or what you have is worth less than fiat cash. Silver or gold certificates are the second biggest scam going. After the US dollar. permalink parent award report block reply view 1 more comments...\nThedaythe_redditdied 4 points 2 hours ago Excellent explanation I would like to point out one thing that you probably underestimated the paper silver sellers don’t just give out 10 times paper what they have physical ( your local back actually does this with the US dollar. Yes they loan out 10 times more cash then they have) right now the paper to physically is 358 to 1. Meaning for every ounce of silver they have in thier vaults. They have sold 358 silver certificates for that one ounce. But wait you ask. What if I turn in my certificate and request the physical ounce be sent to me? If you ask for a couple ounces they might send you some. But if you ask for a lot. They will just send you a check in US dollars for the value of the silver  you supposedly own. Because you don’t actually own the silver. A small tribe owns the silver and then lies to you and says it’s yours and they will just keep it safe for you. Anyone interested in shiny rocks. you need to physically hold and control them your self or what you have is worth less than fiat cash. Silver or gold certificates are the second biggest scam going. After the US dollar. permalink parent award report block reply view 1 more comments...\nrextexMG 7 points 6 hours ago I buy direct from APMEX.com. I have had a subscription for gold and silver for years. permalink parent award report block reply DJTXLV 4 points 3 hours ago APMEX JM Bullion SD Bullion Bold Precious Metals BGASC Check if there are new customer deals where you can buy at spot. permalink parent award report block reply Shakakka99 4 points 4 hours ago Me also.  And don't listen to those here telling you that you might buy silver for $50 and sell it for $40.  That's bullshit.  Local shops near me will pay $1-$2 under spot price for it, sometimes right on spot.  You pay the premium when you buy it; at the moment silver is at $54 and APMEX is selling 1oz silver eagles for $62. Advice: avoid giant bars - they will be harder to sell.  5oz and 10oz are fine, but make sure the bars are a reputable known brand.  The best is to buy 1oz coins or rounds, they are easy to peel off and sell when you want to.  Don't buy fancy stuff, get the coins minted for each country: American silver eagles, Canadian maple leaf coins, UK Britannias, Austrian philharmonics, etc...  These are easily recognizable and accepted everywhere, and you'll get close to spot for them without issue. permalink parent award report block reply view 1 more comments...\nDJTXLV 4 points 3 hours ago APMEX JM Bullion SD Bullion Bold Precious Metals BGASC Check if there are new customer deals where you can buy at spot. permalink parent award report block reply\nShakakka99 4 points 4 hours ago Me also.  And don't listen to those here telling you that you might buy silver for $50 and sell it for $40.  That's bullshit.  Local shops near me will pay $1-$2 under spot price for it, sometimes right on spot.  You pay the premium when you buy it; at the moment silver is at $54 and APMEX is selling 1oz silver eagles for $62. Advice: avoid giant bars - they will be harder to sell.  5oz and 10oz are fine, but make sure the bars are a reputable known brand.  The best is to buy 1oz coins or rounds, they are easy to peel off and sell when you want to.  Don't buy fancy stuff, get the coins minted for each country: American silver eagles, Canadian maple leaf coins, UK Britannias, Austrian philharmonics, etc...  These are easily recognizable and accepted everywhere, and you'll get close to spot for them without issue. permalink parent award report block reply view 1 more comments...\nGenWashington OP 3 points 6 hours ago A. Where to buy and sell. Find a good local shop and a trusted online seller. Money metals is OK. You want a decent relationship with your local company. When time to sell Today we have multiple factors to consider.\nFed notes printed beyond belief -\nIllegal invasion -\nThe is a 800 million ounce (paper) derivative buble - Finally BRICS permalink parent award report block reply\nuser2827 1 points 7 hours ago What u/ViagraFalls says is about accurate. More simply, buy and sell price is on margin... So, if silver is 50$ it might be you buy for 50$ and sell for 40$. Also agreed that buying metals is more about preserving wealth than something like stocks where there's an expectation of stock price increasing above and beyond inflation. If you bought gold at 25$ and sold it at 100$, you can reasonably expect that the general costs for stuff will have gone up roughly proportional. The issue about the manipulation of prices is also true, and one of those rare moments where one could reasonably expect a real profit relative to inflation. I've heard arguments that gold prices SHOULD be trading at about 2-3x the prices at the time and silver, because of the industrial uses should be in the range of 5-10x the market. This isn't something worth counting on because if that music does stop and people buying gold and silver for 1-20k per oz, then there's going to be a lot more going on to worry about, and are just as likely to be facing a barter scenario. permalink parent award report block reply\nMeow4me2 1 points 4 hours ago We are buying for a local dealer (check with BBB for complaints) and looking to set up a gold IRA now to lock in some gains from the stock market. Local dealer - markup will likely be 1-2% higher than an online company, but you can usually buy in smaller portions, so easier to add a bit here or there. I found our dealer via an online search, checked reviews and BBB, then met before deciding to buy from him. Online dealer - minimum buys are higher, markups lower. We haven’t gone this route because of worries over shipping “losses”. I’d rather pick it up directly myself from a local dealer. Precious metals IRA - Looking to move some money from an IRA overweighted in stocks to metals. IRA is physical metals held in a depository for us. Bonds are really underperforming, so looking at metals to preserve value. Have a gold ETF, but it behaves more like a stock. Stock market values so high, I’m worried about a big correction. I’m 3-5 years from retirement, no time to recover a big loss in the market. Physical gold and silver - we purchased enough to trade here if we ever really needed to. Hope the helps. permalink parent award report block reply Thedaythe_redditdied 1 points 2 hours ago Don’t forget if you buy online there is a paper trail they you own precious metals. And big daddy government has already stolen citizens gold in recent American history. So you don’t want the feds showing up to confiscate your gold to save the dollar (they absolutely will by the way) permalink parent award report block reply\nThedaythe_redditdied 1 points 2 hours ago Don’t forget if you buy online there is a paper trail they you own precious metals. And big daddy government has already stolen citizens gold in recent American history. So you don’t want the feds showing up to confiscate your gold to save the dollar (they absolutely will by the way) permalink parent award report block reply\nMySidesGoUp 3 points 5 hours ago Up 50% in a year… permalink parent award report block reply\nTexar1991 1 points 1 hour ago Almost double YTD. permalink parent award report block reply\nLaVaughnRobinson 13 points 9 hours ago Better is people thinking they investing in silver or gold with these stocks actually own any of it as if the fake shit wont crash also in a world-wide meltdown, kek.  Buy physical gold/silver coins if you want something for the apocalypse to actually use. permalink parent award report block reply darkmodeforgotpass 11 points 9 hours ago Lead is a better investment IMO. permalink parent award report block reply carpetxparmesan 3 points 9 hours ago It's not. I did the math, too dense, literally. When you factor in the cost of storage, which would be competitive advantage for you if you had a dry cave for free but NOT a competitive advantage if you erected a 100$/sqft structure like most people... you house finna buckle under the weight of your savings. And, so will your back, because you gonna need a fork lift to move any of it in or out or around for anything beyond a reasonable 3-10k round count which almost everyone should have (if nothing else, in 22 if that's all you can stuff under your bed). permalink parent award report block reply Thedaythe_redditdied 2 points 2 hours ago Only if you spend 50% of your lead on training. Cause a pile of bullets in the closet of a guy that thinks he can shoot is just free bullets for people who train. permalink parent award report block reply user2827 1 points 7 hours ago If that scenario comes about; you'd want to have guns, a reasonable amount of ammo, food and water stored or available, and the surplus could be kept in metals for barter. permalink parent award report block reply ValhallaBaboon 1 points 8 hours ago invest in lead paint permalink parent award report block reply TS-SCI_thong 1 points 2 hours ago Who would have guessed brass and lead was a great invest ment permalink parent award report block reply Trump2024 5 points 9 hours ago The only precious metal to invest in is high velocity lead ingots. With lead ingots you can have as much as you want of any other metal. permalink parent award report block reply zillat 3 points 9 hours ago You should do both, because many people have assets that are limited in what they can invest in, emerging markets are going to rip as well, if you don't want pure paper metals, buy mining stocks or small mining stocks are even better, GDXJ, etc. permalink parent award report block reply\ndarkmodeforgotpass 11 points 9 hours ago Lead is a better investment IMO. permalink parent award report block reply carpetxparmesan 3 points 9 hours ago It's not. I did the math, too dense, literally. When you factor in the cost of storage, which would be competitive advantage for you if you had a dry cave for free but NOT a competitive advantage if you erected a 100$/sqft structure like most people... you house finna buckle under the weight of your savings. And, so will your back, because you gonna need a fork lift to move any of it in or out or around for anything beyond a reasonable 3-10k round count which almost everyone should have (if nothing else, in 22 if that's all you can stuff under your bed). permalink parent award report block reply Thedaythe_redditdied 2 points 2 hours ago Only if you spend 50% of your lead on training. Cause a pile of bullets in the closet of a guy that thinks he can shoot is just free bullets for people who train. permalink parent award report block reply user2827 1 points 7 hours ago If that scenario comes about; you'd want to have guns, a reasonable amount of ammo, food and water stored or available, and the surplus could be kept in metals for barter. permalink parent award report block reply ValhallaBaboon 1 points 8 hours ago invest in lead paint permalink parent award report block reply TS-SCI_thong 1 points 2 hours ago Who would have guessed brass and lead was a great invest ment permalink parent award report block reply\ncarpetxparmesan 3 points 9 hours ago It's not. I did the math, too dense, literally. When you factor in the cost of storage, which would be competitive advantage for you if you had a dry cave for free but NOT a competitive advantage if you erected a 100$/sqft structure like most people... you house finna buckle under the weight of your savings. And, so will your back, because you gonna need a fork lift to move any of it in or out or around for anything beyond a reasonable 3-10k round count which almost everyone should have (if nothing else, in 22 if that's all you can stuff under your bed). permalink parent award report block reply\nThedaythe_redditdied 2 points 2 hours ago Only if you spend 50% of your lead on training. Cause a pile of bullets in the closet of a guy that thinks he can shoot is just free bullets for people who train. permalink parent award report block reply\nuser2827 1 points 7 hours ago If that scenario comes about; you'd want to have guns, a reasonable amount of ammo, food and water stored or available, and the surplus could be kept in metals for barter. permalink parent award report block reply\nValhallaBaboon 1 points 8 hours ago invest in lead paint permalink parent award report block reply\nTS-SCI_thong 1 points 2 hours ago Who would have guessed brass and lead was a great invest ment permalink parent award report block reply\nTrump2024 5 points 9 hours ago The only precious metal to invest in is high velocity lead ingots. With lead ingots you can have as much as you want of any other metal. permalink parent award report block reply\nzillat 3 points 9 hours ago You should do both, because many people have assets that are limited in what they can invest in, emerging markets are going to rip as well, if you don't want pure paper metals, buy mining stocks or small mining stocks are even better, GDXJ, etc. permalink parent award report block reply\nEatChit 7 points 9 hours ago Hey, I've got 170m of those bad boys.. And did you not SEE his graph? It's going up! permalink parent award report block reply Trump2024 5 points 9 hours ago I've got 500 million pepe coins. I'm hodling permalink parent award report block reply\nTrump2024 5 points 9 hours ago I've got 500 million pepe coins. I'm hodling permalink parent award report block reply\nguywholikesDjtof2024 3 points 9 hours ago pepe coins are digital. One solar flare and they all get destroyed. buy metal with pepe coins. permalink parent award report block reply\nReallyGayMods 3 points 9 hours ago I do actually and wouldnt mind hearing about pepe coin? Silver is up like 120% in the last 5 or so years. How does that compare to pepe coin? permalink parent award report block reply\nSaint_Samurai 20 points 9 hours ago \"The silver is mine, and the gold is mine, saith the Lord of hosts.\" - Haggai 2:8 permalink award report block reply carpetxparmesan 1 points 9 hours ago How does that square with render unto Caesar? Both claim the silver. permalink parent award report block reply CptObvious- 10 points 8 hours ago God made metal and it is His; coins made from it by Rome are for Roman purposes to choose. If Ceasar wants his money, it is his. \"Who's inscription is on the coin?\" etc. Ceasar's claim is temporal and finite, etc. permalink parent award report block reply MAGA_Toaster 4 points 8 hours ago Username checks out! 👍 permalink parent award report block reply\ncarpetxparmesan 1 points 9 hours ago How does that square with render unto Caesar? Both claim the silver. permalink parent award report block reply CptObvious- 10 points 8 hours ago God made metal and it is His; coins made from it by Rome are for Roman purposes to choose. If Ceasar wants his money, it is his. \"Who's inscription is on the coin?\" etc. Ceasar's claim is temporal and finite, etc. permalink parent award report block reply MAGA_Toaster 4 points 8 hours ago Username checks out! 👍 permalink parent award report block reply\nCptObvious- 10 points 8 hours ago God made metal and it is His; coins made from it by Rome are for Roman purposes to choose. If Ceasar wants his money, it is his. \"Who's inscription is on the coin?\" etc. Ceasar's claim is temporal and finite, etc. permalink parent award report block reply MAGA_Toaster 4 points 8 hours ago Username checks out! 👍 permalink parent award report block reply\nMAGA_Toaster 4 points 8 hours ago Username checks out! 👍 permalink parent award report block reply\nfreedom-thinker 11 points 9 hours ago Looking for a dip below 30 to get back in /s permalink award report block reply Texar1991 1 points 51 minutes ago $50 is the new floor for silver. And yes… I see the SaRC TaG. permalink parent award report block reply\nTexar1991 1 points 51 minutes ago $50 is the new floor for silver. And yes… I see the SaRC TaG. permalink parent award report block reply\nutfanx2 9 points 9 hours ago Ammocoin goes brrrt. permalink award report block reply\nBKav 8 points 8 hours ago As a client of mine once told me, “you buy gold and I’ll buy guns.  And if someday I want your gold, I’ll come get it” permalink award report block reply RandomJoe7 9 points 8 hours ago Except that most people also have guns anyways, because they cost a few hundred (or thousand) bucks. So... would you rather be the guy with a couple guns and a lot more in precious metals (instead of fiat), or the guy who put all his fiat into 100's of guns that he can't all shoot simultaneously anyways? At the end of the day, if you're having a \"battle\" for anything, it'll be 1 guy holding a gun vs another guy holding a gun, so you're no better off anyways. The idea that the guy with the gun can just walk around town and take everyone's belongings as if nobody else is armed is absurd, lol permalink parent award report block reply BKav 3 points 7 hours ago Hahaha.  You’ve never seen the contents of my safe. permalink parent award report block reply PeteButtplug 0 points 2 hours ago Gold is only useful in a hyperinflation situation where we expect the financial system to restabilize. If everything goes to shit, I can't eat gold. permalink parent award report block reply Forty_Five 2 points 5 hours ago Why not both? permalink parent award report block reply Kricket 2 points 2 hours ago The exchange rate for lead and your liberal neighbor’s stuff if SHTF is very favorable. permalink parent award report block reply\nRandomJoe7 9 points 8 hours ago Except that most people also have guns anyways, because they cost a few hundred (or thousand) bucks. So... would you rather be the guy with a couple guns and a lot more in precious metals (instead of fiat), or the guy who put all his fiat into 100's of guns that he can't all shoot simultaneously anyways? At the end of the day, if you're having a \"battle\" for anything, it'll be 1 guy holding a gun vs another guy holding a gun, so you're no better off anyways. The idea that the guy with the gun can just walk around town and take everyone's belongings as if nobody else is armed is absurd, lol permalink parent award report block reply BKav 3 points 7 hours ago Hahaha.  You’ve never seen the contents of my safe. permalink parent award report block reply PeteButtplug 0 points 2 hours ago Gold is only useful in a hyperinflation situation where we expect the financial system to restabilize. If everything goes to shit, I can't eat gold. permalink parent award report block reply\nBKav 3 points 7 hours ago Hahaha.  You’ve never seen the contents of my safe. permalink parent award report block reply\nPeteButtplug 0 points 2 hours ago Gold is only useful in a hyperinflation situation where we expect the financial system to restabilize. If everything goes to shit, I can't eat gold. permalink parent award report block reply\nForty_Five 2 points 5 hours ago Why not both? permalink parent award report block reply\nKricket 2 points 2 hours ago The exchange rate for lead and your liberal neighbor’s stuff if SHTF is very favorable. permalink parent award report block reply\ntomthung 7 points 8 hours ago Minimum wage in 1964 was $1.25 and hour. If we had real money, those 5 quarters you were paid would have the buying power of over $50.00 today just in the silver content. I don't know what minimum wage is today, but it represents what they have stolen from all of us. permalink award report block reply Matehmateh 3 points 5 hours ago A great haircut in Southeast Asia costs just $1–3 , compared to $30–40 (no tip) in the US. The point ties directly to retirement: move to a country where the US dollar stretches further, and you’ll live like royalty on a modest income. permalink parent award report block reply MySidesGoUp 5 points 4 hours ago Born too late to be a boomer…. permalink parent award report block reply ForgottenUsername 3 points 4 hours ago It sucks to have to live in the third world though.     But since they're turning the first world into the third world already, you seem ahead of the curve on that permalink parent award report block reply Jack_NC 1 points 3 hours ago minimum wage in NC: $7.25/hour. Basically the value of one of those silver quarters. Huh, how about that? Quite a coincidence. permalink parent award report block reply tomthung 3 points 3 hours ago That's what the bankers and politicians have stolen from us, not the Boomers. One of those 1964 quarters is worth $10.00 today. Every dollar in your pocket should have at least $100.00 buying power and I can make an argument it should be a lot more. permalink parent award report block reply\nMatehmateh 3 points 5 hours ago A great haircut in Southeast Asia costs just $1–3 , compared to $30–40 (no tip) in the US. The point ties directly to retirement: move to a country where the US dollar stretches further, and you’ll live like royalty on a modest income. permalink parent award report block reply MySidesGoUp 5 points 4 hours ago Born too late to be a boomer…. permalink parent award report block reply ForgottenUsername 3 points 4 hours ago It sucks to have to live in the third world though.     But since they're turning the first world into the third world already, you seem ahead of the curve on that permalink parent award report block reply\nMySidesGoUp 5 points 4 hours ago Born too late to be a boomer…. permalink parent award report block reply\nForgottenUsername 3 points 4 hours ago It sucks to have to live in the third world though.     But since they're turning the first world into the third world already, you seem ahead of the curve on that permalink parent award report block reply\nJack_NC 1 points 3 hours ago minimum wage in NC: $7.25/hour. Basically the value of one of those silver quarters. Huh, how about that? Quite a coincidence. permalink parent award report block reply tomthung 3 points 3 hours ago That's what the bankers and politicians have stolen from us, not the Boomers. One of those 1964 quarters is worth $10.00 today. Every dollar in your pocket should have at least $100.00 buying power and I can make an argument it should be a lot more. permalink parent award report block reply\ntomthung 3 points 3 hours ago That's what the bankers and politicians have stolen from us, not the Boomers. One of those 1964 quarters is worth $10.00 today. Every dollar in your pocket should have at least $100.00 buying power and I can make an argument it should be a lot more. permalink parent award report block reply\nslokill 7 points 6 hours ago End The Fed permalink award report block reply GenWashington OP 3 points 6 hours ago Yes,! permalink parent award report block reply\nGenWashington OP 3 points 6 hours ago Yes,! permalink parent award report block reply\nPeterThielAntiChrist 5 points 5 hours ago EVERYONE POSTING IN HERE IS BROKE permalink award report block reply GenWashington OP 4 points 5 hours ago Not me bro sorry permalink parent award report block reply Kricket 2 points 2 hours ago 🍿 permalink parent award report block reply MehNahMehNah 1 points 28 minutes ago That's what I tell everyone.  And get off my land.. permalink parent award report block reply cjcivicx 1 points 30 minutes ago OP, like every other boomer rock holder, is trying to get more people to buy because they're seething that crypto absolutely wrecked their \"long term investments\" in a little over a decade by making people like me, who they all laughed at because \"Hurr durr it's one's and zeroes\", independently wealthy and able to retire at 40, unlike them who are hoping beyond hope that someone will eventually buy their boomer rocks when the world ends or whatever they were told was going to happen decades ago when they bought them. permalink parent award report block reply ForgottenUsername 1 points 4 hours ago I'm rich in could have, should have, and did but wasted it permalink parent award report block reply\nGenWashington OP 4 points 5 hours ago Not me bro sorry permalink parent award report block reply\nKricket 2 points 2 hours ago 🍿 permalink parent award report block reply\nMehNahMehNah 1 points 28 minutes ago That's what I tell everyone.  And get off my land.. permalink parent award report block reply\ncjcivicx 1 points 30 minutes ago OP, like every other boomer rock holder, is trying to get more people to buy because they're seething that crypto absolutely wrecked their \"long term investments\" in a little over a decade by making people like me, who they all laughed at because \"Hurr durr it's one's and zeroes\", independently wealthy and able to retire at 40, unlike them who are hoping beyond hope that someone will eventually buy their boomer rocks when the world ends or whatever they were told was going to happen decades ago when they bought them. permalink parent award report block reply\nForgottenUsername 1 points 4 hours ago I'm rich in could have, should have, and did but wasted it permalink parent award report block reply\nbuckeyeminuteman 4 points 4 hours ago I bought some silver coins right after Game Stop was shorted and we were trying to do the same to silver. It was right around $23 per ounce. Didn’t realize it was up to $54! permalink award report block reply GenWashington OP 1 points 1 hour ago Many don't know... off radar and why I raise it. permalink parent award report block reply\nGenWashington OP 1 points 1 hour ago Many don't know... off radar and why I raise it. permalink parent award report block reply\nfirst_amendment 3 points 7 hours ago There are silver mines all over the country shut down over a hundred of year ago per lack of profit.  I have my doubts we'll see thousands, we'll just see more mining operations where people least expect them. permalink award report block reply\nckover9000 3 points 4 hours ago Here's my experience with precious metals...it's fun to hold and say you have them. As soon as you need to cash in any amount you quickly learn industry collusion is a thing. NOBODY will give you anything near what it's worth. If you cash in to the big guys they assume you bought it from one of them and joo down your payout no matter who you bought it from, not to mention fees and taxes. So you go to the local shop and they know you're there because the big guys are screwing you or you're desperate for cash and screw you just as much. BUT BUT BUT muh society collapses...nobody is going to trade you their goods needed to survive for useless metal. And anyone who thinks hoarding metals is going to somehow stick it to the man, get over yourself...the man has successfully pysopped you into gleefully handing over your shekels. If cash is going to be so worthless and metals are the future, why the everloving fuck would they be so willing to take your soon-to-be-worthless money in exchange for the only thing of value in the future? Spend your money on something actually valuable in usefullness. permalink award report block reply GenWashington OP 6 points 4 hours ago My local shop sells $2 over spot and buys at $1.5 under... pretty easy to calculate. You should know the game before getting in. permalink parent award report block reply ckover9000 1 points 42 minutes ago Do they ever send you a thank you note for doing your part inflating the value so they can make even more money from it? You help make them rich twice. Have fun eating your gold. permalink parent award report block reply cjcivicx 2 points 24 minutes ago Yep. OP, and other boomer rock holders, is like DOGE holders AFTER it peaked at .70 because they really thought it was going to a dollar or more. They've been everywhere desperately trying to get people whipped up to buy DOGE. That being said, they've only been doing it for a couple of years, boomer rockers have been doing it for decades. permalink parent award report block reply\nGenWashington OP 6 points 4 hours ago My local shop sells $2 over spot and buys at $1.5 under... pretty easy to calculate. You should know the game before getting in. permalink parent award report block reply ckover9000 1 points 42 minutes ago Do they ever send you a thank you note for doing your part inflating the value so they can make even more money from it? You help make them rich twice. Have fun eating your gold. permalink parent award report block reply\nckover9000 1 points 42 minutes ago Do they ever send you a thank you note for doing your part inflating the value so they can make even more money from it? You help make them rich twice. Have fun eating your gold. permalink parent award report block reply\ncjcivicx 2 points 24 minutes ago Yep. OP, and other boomer rock holders, is like DOGE holders AFTER it peaked at .70 because they really thought it was going to a dollar or more. They've been everywhere desperately trying to get people whipped up to buy DOGE. That being said, they've only been doing it for a couple of years, boomer rockers have been doing it for decades. permalink parent award report block reply\nViagraFalls 3 points 8 hours ago I checked silver yesterday, and it was at $51. permalink award report block reply GenWashington OP 2 points 6 hours ago $54.44 today https://www.moneymetals.com/silver-price permalink parent award report block reply Matehmateh -1 points 5 hours ago $24 several years ago. Guess you’ll have to wait several more years before making a profit permalink parent award report block reply cjcivicx 1 points 46 minutes ago OP had a few accounts he's Downvoting people with lol. permalink parent award report block reply\nGenWashington OP 2 points 6 hours ago $54.44 today https://www.moneymetals.com/silver-price permalink parent award report block reply Matehmateh -1 points 5 hours ago $24 several years ago. Guess you’ll have to wait several more years before making a profit permalink parent award report block reply cjcivicx 1 points 46 minutes ago OP had a few accounts he's Downvoting people with lol. permalink parent award report block reply\nMatehmateh -1 points 5 hours ago $24 several years ago. Guess you’ll have to wait several more years before making a profit permalink parent award report block reply cjcivicx 1 points 46 minutes ago OP had a few accounts he's Downvoting people with lol. permalink parent award report block reply\ncjcivicx 1 points 46 minutes ago OP had a few accounts he's Downvoting people with lol. permalink parent award report block reply\ntomthung 3 points 4 hours ago We're going to find out if the Hunt Brothers were right. permalink award report block reply GenWashington OP 0 points 1 hour ago 100% they were on target and knew it way back when. permalink parent award report block reply tomthung 0 points 56 minutes ago Yep and I'm really excited. permalink parent award report block reply\nGenWashington OP 0 points 1 hour ago 100% they were on target and knew it way back when. permalink parent award report block reply tomthung 0 points 56 minutes ago Yep and I'm really excited. permalink parent award report block reply\ntomthung 0 points 56 minutes ago Yep and I'm really excited. permalink parent award report block reply\nEvilGreed209 3 points 7 hours ago It's been known for decades that they don't have enough gold or silver in the vaults they just been reselling gold bullion in vaults for years to different customers all owning the same gold bars because vaults seen the people never come get their gold only after decades so they figure they'll just resell it but if there was a margin call on all that bullion many precious metals would go to prison for theft. permalink award report block reply Texar1991 2 points 48 minutes ago If we had true rule of law they’d already be in prison. permalink parent award report block reply\nTexar1991 2 points 48 minutes ago If we had true rule of law they’d already be in prison. permalink parent award report block reply\nWallstpatriot 2 points 2 hours ago This will never happen. You have to be able to buy the silver contract in full when you take delivery. Currently $270,000 for 1 contract.   Don’t know too many people with quarter million dollars for 1 silver contract laying around.   Then you have to pay to store it in an exchange warehouse every month. permalink award report block reply\nLol_Garrus 2 points 2 hours ago I have some silverware. permalink award report block reply\nVanDeKoik 2 points 5 hours ago Pro tip: Never ever take advice like this from people that fetishize shit like \"global financial collaspes\" or some 'biblical prophecy\" horseshit. These are the reason why we have all of those annoying ads about buying gold. People with money do not do this. permalink award report block reply\nsir_rockness 2 points 2 hours ago Yall go ahead and buy your silver and gold and jerk off to it at night and then when you die somebody can buy it at an estate auction. I'm gonna keep playing their shitty equity game and keep making 75, 125 or maybe 150% yearly on my US paper which will eventually be digital. permalink award report block reply AstroLonghorn 2 points 1 hour ago Why would I ever auction my silver when it has a tangible price and risk someone buying it at 70% its value? Estate sale more accurate. Also, some of us came from families where gold and silver were bought as something to pass on. It was intended to be sold 3/4 generations down the road… So yes enjoy your hypothetical come up when some families can sell all their precious metals and make in one day what you will make in multiple years and then live off the dividend. One more thing: you need physical silver for digital cash. Those motherboards ain’t gonna solder themselves…. permalink parent award report block reply\nAstroLonghorn 2 points 1 hour ago Why would I ever auction my silver when it has a tangible price and risk someone buying it at 70% its value? Estate sale more accurate. Also, some of us came from families where gold and silver were bought as something to pass on. It was intended to be sold 3/4 generations down the road… So yes enjoy your hypothetical come up when some families can sell all their precious metals and make in one day what you will make in multiple years and then live off the dividend. One more thing: you need physical silver for digital cash. Those motherboards ain’t gonna solder themselves…. permalink parent award report block reply\nRerun1Central 1 points 1 hour ago My silver eagles seemed high at $30 permalink award report block reply\nJustAnotherPsyopNPC 1 points 4 hours ago Buy Oz coins at a comfortable rate. permalink award report block reply\nTexar1991 1 points 22 minutes ago Gold is the money of kings. Silver is the money of gentlemen. Credit is the money of the poor. Gold and silver are money and everything else is credit. (The central banks know). permalink award report block reply\nqueenicarius 1 points 4 hours ago I guess it's time to get my wedding silver out of the cabinet. permalink award report block reply Kricket 2 points 2 hours ago Why? permalink parent award report block reply\nKricket 2 points 2 hours ago Why? permalink parent award report block reply\nknnbccb 1 points 6 hours ago A little something for you 'muh gold and silver' paytriots. https://biblehub.com/james/5-3.htm permalink award report block reply\nKdiddy 1 points 2 hours ago Silver is easy to mine. They will mine more and bring it down. If it doesn’t go down, it is being manipulated. Be smart. permalink award report block reply\nLimbaugh 1 points 9 hours ago Zoom in more permalink award report block reply cjcivicx 1 points 21 minutes ago OP won't. He's like DOGE holders, desperately begging people to pump and dump so he can ger his money back. permalink parent award report block reply\ncjcivicx 1 points 21 minutes ago OP won't. He's like DOGE holders, desperately begging people to pump and dump so he can ger his money back. permalink parent award report block reply\nmykillk -1 points 8 hours ago Saying silver @ $1000 makes you look like you're just hawking it for your own interest, ngl. Same as all the cryptotards. permalink award report block reply lizardo221 3 points 7 hours ago Careful, every doomsday rightwing influencer might not like you saying that. They are hawking us gold ads nonstop every day because they are just looking out for us ... I'm sure that's what that is ... permalink parent award report block reply Matehmateh 2 points 5 hours ago Not a bad idea if you’re an affiliate marketer permalink parent award report block reply GenWashington OP 3 points 6 hours ago If a fake coin can get to over $100k per coin, with ZERO purpose outside of storage SILVER should be worth equal. The massive fake ounces alone (derivatives that chase and BofA have 800 million ounces alone should make it take off like a rocket 🚀. Add in the 600 ounces solar panel consumption. Electric car batteries, regular cars etc. Etc. Etc. , the actual demand 🫴 beyond storage is massive. They are out of large silver in the comex... shelves no longer have 100 Oz bars manufacturing needs. Old or new mines will take 2/3-4/5 years to just start to meet demand. It is an amaz8ng time. permalink parent award report block reply cjcivicx 1 points 21 minutes ago Except many cryptotards actually can spend theirs and have already made money if they were in early like me. permalink parent award report block reply\nlizardo221 3 points 7 hours ago Careful, every doomsday rightwing influencer might not like you saying that. They are hawking us gold ads nonstop every day because they are just looking out for us ... I'm sure that's what that is ... permalink parent award report block reply Matehmateh 2 points 5 hours ago Not a bad idea if you’re an affiliate marketer permalink parent award report block reply\nMatehmateh 2 points 5 hours ago Not a bad idea if you’re an affiliate marketer permalink parent award report block reply\nGenWashington OP 3 points 6 hours ago If a fake coin can get to over $100k per coin, with ZERO purpose outside of storage SILVER should be worth equal. The massive fake ounces alone (derivatives that chase and BofA have 800 million ounces alone should make it take off like a rocket 🚀. Add in the 600 ounces solar panel consumption. Electric car batteries, regular cars etc. Etc. Etc. , the actual demand 🫴 beyond storage is massive. They are out of large silver in the comex... shelves no longer have 100 Oz bars manufacturing needs. Old or new mines will take 2/3-4/5 years to just start to meet demand. It is an amaz8ng time. permalink parent award report block reply\ncjcivicx 1 points 21 minutes ago Except many cryptotards actually can spend theirs and have already made money if they were in early like me. permalink parent award report block reply\nBoatingAccident -2 points 6 hours ago Kinda like stonks …..  yawn permalink award report block reply\ncjcivicx -3 points 8 hours ago I see silver and gold fags still seething about crypto fags like me who they made fun of making enough  money to retire in less than a decade instead of sitting on boomer rocks for decades and hoping beyond hope more people will start buying so they can finally make some money. Edit: LMFAO OP big mad calling people trannies because his boomer rocks are worthless. Sign of a man who really believes in what he says. permalink award report block reply GenWashington OP 2 points 6 hours ago Stop being trans.... you are really a hold and silver guy. permalink parent award report block reply\nGenWashington OP 2 points 6 hours ago Stop being trans.... you are really a hold and silver guy. permalink parent award report block reply\nGETCHURbooztahh -5 points 9 hours ago Go try to sell your silver. Stores will reject anywhere near spot value or simply say no have enough. permalink award report block reply Taylor3006 4 points 8 hours ago That is horseshit. I have never had a problem getting melt value for my silver ever. Same with gold. Plenty of businesses who deal in scrap and coins will pay melt as the price goes up because so does the demand. They don't sell at melt you retard, they sell at spot plus a premium. If someone told you that they were not paying you spot, they were trying to fuck you because you seemed retarded to them. permalink parent award report block reply GETCHURbooztahh 0 points 8 hours ago Have you tried in the last few weeks? My buddys family owns cash carry jewelry stores. Not bullshit. They are turning away silver lately. Not gold. permalink parent award report block reply Taylor3006 2 points 8 hours ago Why the fuck would I sell at a jewelry store? That is like going to a pawn shop. Any town of any appreciable size will have coin dealers or silver/gold exchanges.  Larger cities will have scrap dealers that take precious metals and some of those companies will do mail in appraisals and offer you spot, easily. permalink parent award report block reply cjcivicx 1 points 44 minutes ago OP is using alt accounts to try and get people to buy his bags lol permalink parent award report block reply guywholikesDjtof2024 2 points 9 hours ago What about 30 years from now when WW3 starts? That rhetoric is short term thinking. permalink parent award report block reply Kricket 1 points 1 hour ago If you need to wait 30 years for your investment to payoff, it better payoff fucking big, like Beverly hillbillies big. I’d like to introduce you to the concepts of “the time value of money” and “opportunity cost.” permalink parent award report block reply GenWashington OP 2 points 8 hours ago Sorry trans not true permalink parent award report block reply cjcivicx -1 points 8 hours ago Yep, boomers are still clinging to their rocks hoping beyond hope they can convince people to buy the shit they bought decades ago because their parents still had the Gold standard that meant something. permalink parent award report block reply\nTaylor3006 4 points 8 hours ago That is horseshit. I have never had a problem getting melt value for my silver ever. Same with gold. Plenty of businesses who deal in scrap and coins will pay melt as the price goes up because so does the demand. They don't sell at melt you retard, they sell at spot plus a premium. If someone told you that they were not paying you spot, they were trying to fuck you because you seemed retarded to them. permalink parent award report block reply GETCHURbooztahh 0 points 8 hours ago Have you tried in the last few weeks? My buddys family owns cash carry jewelry stores. Not bullshit. They are turning away silver lately. Not gold. permalink parent award report block reply Taylor3006 2 points 8 hours ago Why the fuck would I sell at a jewelry store? That is like going to a pawn shop. Any town of any appreciable size will have coin dealers or silver/gold exchanges.  Larger cities will have scrap dealers that take precious metals and some of those companies will do mail in appraisals and offer you spot, easily. permalink parent award report block reply cjcivicx 1 points 44 minutes ago OP is using alt accounts to try and get people to buy his bags lol permalink parent award report block reply\nGETCHURbooztahh 0 points 8 hours ago Have you tried in the last few weeks? My buddys family owns cash carry jewelry stores. Not bullshit. They are turning away silver lately. Not gold. permalink parent award report block reply Taylor3006 2 points 8 hours ago Why the fuck would I sell at a jewelry store? That is like going to a pawn shop. Any town of any appreciable size will have coin dealers or silver/gold exchanges.  Larger cities will have scrap dealers that take precious metals and some of those companies will do mail in appraisals and offer you spot, easily. permalink parent award report block reply cjcivicx 1 points 44 minutes ago OP is using alt accounts to try and get people to buy his bags lol permalink parent award report block reply\nTaylor3006 2 points 8 hours ago Why the fuck would I sell at a jewelry store? That is like going to a pawn shop. Any town of any appreciable size will have coin dealers or silver/gold exchanges.  Larger cities will have scrap dealers that take precious metals and some of those companies will do mail in appraisals and offer you spot, easily. permalink parent award report block reply\ncjcivicx 1 points 44 minutes ago OP is using alt accounts to try and get people to buy his bags lol permalink parent award report block reply\nguywholikesDjtof2024 2 points 9 hours ago What about 30 years from now when WW3 starts? That rhetoric is short term thinking. permalink parent award report block reply Kricket 1 points 1 hour ago If you need to wait 30 years for your investment to payoff, it better payoff fucking big, like Beverly hillbillies big. I’d like to introduce you to the concepts of “the time value of money” and “opportunity cost.” permalink parent award report block reply\nKricket 1 points 1 hour ago If you need to wait 30 years for your investment to payoff, it better payoff fucking big, like Beverly hillbillies big. I’d like to introduce you to the concepts of “the time value of money” and “opportunity cost.” permalink parent award report block reply\nGenWashington OP 2 points 8 hours ago Sorry trans not true permalink parent award report block reply\ncjcivicx -1 points 8 hours ago Yep, boomers are still clinging to their rocks hoping beyond hope they can convince people to buy the shit they bought decades ago because their parents still had the Gold standard that meant something. permalink parent award report block reply\nKungPaoMcChicken -16 points 9 hours ago Time to start breaking into old people's homes for the silver. Cough up you old cunt. Never let it be said that I didn't pay the iron price for where I am in this world. permalink award report block reply NimblePepeCentipede 10 points 9 hours ago .....sorry, best I can do is lead. thank you for your attention to this matter. permalink parent award report block reply carpetxparmesan 3 points 9 hours ago That guy ended up without a weiner, lord of the seas. Communists don't want you owning shotguns because the risk of a grandma in the night with a shotgun is too great. What they lack in reaction speed and preparation, they make up for by being quiet and having no fucks left to give if anyone puts them in jail. permalink parent award report block reply Saltyminer11 1 points 2 hours ago Free room and board! permalink parent award report block reply\nNimblePepeCentipede 10 points 9 hours ago .....sorry, best I can do is lead. thank you for your attention to this matter. permalink parent award report block reply\ncarpetxparmesan 3 points 9 hours ago That guy ended up without a weiner, lord of the seas. Communists don't want you owning shotguns because the risk of a grandma in the night with a shotgun is too great. What they lack in reaction speed and preparation, they make up for by being quiet and having no fucks left to give if anyone puts them in jail. permalink parent award report block reply Saltyminer11 1 points 2 hours ago Free room and board! permalink parent award report block reply\nSaltyminer11 1 points 2 hours ago Free room and board! permalink parent award report block reply"}