{"id": "1ARK5BIEzx", "contents": "267 Roseanne Boyland was beaten to death by officer Lila Morris. \n\nDon’t forget, the CIA infiltrates US police departments to orchestrate false flag/Gladio events. 🛑  Corrupt Commies  🛑 posted 3 days ago by ALT26 4 comments award share report block ColonelTowner-Watkins @ColonelTowner • 3d Roseanne Boyland was beaten to death by officer Lila Morris. Don’t forget, the CIA infiltrates US police departments to orchestrate false flag/Gladio events. Gain of Fauci @DschlopesIsBack • 4d The Capitol Police on in January 6th: -Planted the pipe bombs. -Shot and tear gassed peaceful protesters in efforts to agitate them. -Removed barriers and literally waived people to go towards the Capitol building. -Opened giant magnetic doors from the inside to allow people\n4 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style impera 3 points 3 days ago Became celebrities that received Congressional and Presidential awards for their “efforts.” Its easy to look for inexplicable wealth turning up in the bank accounts of complicit deep state operatives as a sign that they are a cog in a treason machine. Its more difficult to try and look for the bribes and incentives and promotions and back-patting that are not direct cash infusions. Like all Capitol police who were awarded for their 'courage' and 'leadership' actions in J6. permalink award report block reply Crappydatum 2 points 3 days ago On in Waived Are they typos or trackers? permalink award report block reply Kraken 1 points 2 days ago Rosanne is the forgotten murder victim of J6. permalink award report block reply\nimpera 3 points 3 days ago Became celebrities that received Congressional and Presidential awards for their “efforts.” Its easy to look for inexplicable wealth turning up in the bank accounts of complicit deep state operatives as a sign that they are a cog in a treason machine. Its more difficult to try and look for the bribes and incentives and promotions and back-patting that are not direct cash infusions. Like all Capitol police who were awarded for their 'courage' and 'leadership' actions in J6. permalink award report block reply\nCrappydatum 2 points 3 days ago On in Waived Are they typos or trackers? permalink award report block reply\nKraken 1 points 2 days ago Rosanne is the forgotten murder victim of J6. permalink award report block reply"}