{"id": "1ARK57rx6k", "contents": "388 Judge James Boasberg is not only facing impeachment, but an ethics complaint for helping SPY on Republicans. posted 4 days ago by CatalystForChange 11 comments award share report block Eric Daugherty @EricLDaugh • 4d 🚨 BREAKING: Judge James Boasberg is not only facing impeachment, but an ethics complaint for helping SPY on Republicans. Boasberg has gone ROGUE! “Boasberg enabled one of the most disturbing episodes of political surveillance in modern history.” “Weaponizing the DOJ against Center to Advance Security in America @SecureUSA • 4d 🚨 CASA has filed an official judicial ethics complaint against Chief Judge James Boasberg for approving secret DOJ subpoenas targeting GOP Members of Congress WITHOUT their knowledge. Boasberg enabled one of the most disturbing episodes of political surveillance in modern\n11 comments Sort by Top Top New Worst Old Save I_Love_45-70_Gov 10 points 4 days ago But not facing a rope for sedition. permalink award report block reply AbrahamLincoln 5 points 4 days ago Oh golly gee, not an ethics complaint! permalink award report block reply America_No_1 3 points 4 days ago Oh no not a complaint by our GOP Karens! permalink award report block reply perma-maga 3 points 4 days ago Good. Congress' waiting until Boasberg's insanity effects them is not unnoticed. permalink award report block reply AwShitHereWeGoAgain 2 points 4 days ago I'm sure he's shaking in his gay boots. permalink award report block reply mikethemarine 2 points 4 days ago A judge should be allowed to issue a warrant to spy on all politicians, but he had NO CRIMINAL BASIS TO DO IT That is criminal in itself. This fucker can't fall back on ANY reason he allowed this,they needed to show evidence there was even a chance a crime was being committed, I say jail or hanging him permalink award report block reply DeplorableEsq 2 points 4 days ago should at least be disbarred since they'll never arrest him permalink award report block reply LolitaExpressPilot 2 points 4 days ago Gonna take at least 2 weeks to get the strongly worded letter together. permalink award report block reply NotYourMan 1 points 4 days ago Treason? permalink award report block reply barwhack 1 points 4 days ago But no teeth... permalink award report block reply\nI_Love_45-70_Gov 10 points 4 days ago But not facing a rope for sedition. permalink award report block reply\nAbrahamLincoln 5 points 4 days ago Oh golly gee, not an ethics complaint! permalink award report block reply\nAmerica_No_1 3 points 4 days ago Oh no not a complaint by our GOP Karens! permalink award report block reply\nperma-maga 3 points 4 days ago Good. Congress' waiting until Boasberg's insanity effects them is not unnoticed. permalink award report block reply\nAwShitHereWeGoAgain 2 points 4 days ago I'm sure he's shaking in his gay boots. permalink award report block reply\nmikethemarine 2 points 4 days ago A judge should be allowed to issue a warrant to spy on all politicians, but he had NO CRIMINAL BASIS TO DO IT That is criminal in itself. This fucker can't fall back on ANY reason he allowed this,they needed to show evidence there was even a chance a crime was being committed, I say jail or hanging him permalink award report block reply\nDeplorableEsq 2 points 4 days ago should at least be disbarred since they'll never arrest him permalink award report block reply\nLolitaExpressPilot 2 points 4 days ago Gonna take at least 2 weeks to get the strongly worded letter together. permalink award report block reply\nNotYourMan 1 points 4 days ago Treason? permalink award report block reply\nbarwhack 1 points 4 days ago But no teeth... permalink award report block reply"}