{"id": "1ARK0Ub4nD", "contents": "566 NOTICE anything?  (Link in comments) posted 7 days ago by redditadminssuckit 39 comments award share download report block\n39 comments Sort by Top Top New Worst Old Save Around the Web HankScorpio 22 points 7 days ago Being colonized by zionist international oligarchs who have people focused on muslims and not them. permalink award report block reply TrumpAndGodWin 14 points 7 days ago Zionists are trying to get Tucker Carlson assassinated recently through extreme dehumanization. Partly because he stood against the war Netanyahu wanted. permalink parent award report block reply KungPaoMcChicken -7 points 7 days ago Fuck Gaza. I don't object to any war on Muslims. It needs to happen. Who let all of these liberal crybabies in? Israel is taking one for the team. permalink parent award report block reply AccelerateAlready 2 points 7 days ago Gross. permalink parent award report block reply lash 1 points 7 days ago You are a cancer-spreader. permalink parent award report block reply HoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply SimaYi 6 points 7 days ago Which is why they did it. They imported their enemies to make them your enemies. The import subsaharan African animals so you are too busy getting shanked in the neck to notice them stealing everything. permalink parent award report block reply ReleasetheList 4 points 7 days ago Focus on both. AFAO. permalink parent award report block reply Aggrieved03 2 points 7 days ago Same here permalink parent award report block reply magapatriot_pa 19 points 7 days ago Segregation isn't a problem that needs to be tackled, it's a solution that needs to be embraced. The only alternative is sending all of these people back, and apparently nobody has the stomach for that permalink award report block reply stagolee 14 points 7 days ago No, sending them back is the only solution.  Segregation won't work because they'll outbreed us, unless you can suddenly convince white women to value motherhood  again. permalink parent award report block reply RINO_fatigue 13 points 7 days ago Muslims should be segregated to their desert shitholes and not be in White countries permalink parent award report block reply Female 5 points 7 days ago It may be a goal of President Trump to make a deal with the muslims to take them...there are dozens of muslim countries permalink parent award report block reply KungPaoMcChicken 4 points 7 days ago Multiculturalism is a cancer. permalink parent award report block reply SpellingContable 10 points 7 days ago Hahahahaha the last line. For all the people calling out the antisemites please answer this question. Why would only Jewish schools be exempt from this law? permalink award report block reply ColonelKlink 9 points 7 days ago It would be easier to send them all back home. permalink award report block reply LostElf 5 points 7 days ago Gender segregation in schools has existed since cavemen times. Sweden should stop attacking fake problems and embrace remigration. permalink award report block reply SimaYi 4 points 7 days ago Every Single Time. permalink award report block reply YaharaRiver 4 points 7 days ago <points & laughs at muslims frothing at the mouth over this> 😂 permalink award report block reply NotLikeThis 7 points 7 days ago Christians aren't exempt. permalink parent award report block reply YaharaRiver -6 points 7 days ago They’ll survive.  Everyone can be a Christian anywhere, anytime, alone or with others. Muslim schools won’t.  They require public participation and religious rules in every area of your life that can be judged and punished. permalink parent award report block reply NotLikeThis 4 points 7 days ago Do you see? Do you fucking see yet? permalink award report block reply based_trekkie 3 points 7 days ago Oy vey, don't notice the last line! permalink award report block reply redditadminssuckit OP 3 points 7 days ago https://archive.ph/qbwuB permalink award report block reply TrancePhreak 1 points 7 days ago 2018 permalink parent award report block reply redditadminssuckit OP 3 points 7 days ago So? permalink parent award report block reply TrancePhreak 2 points 6 days ago Kinda boring and don't care about Europe, especially in 2018. They were destined to fail long ago. It's why we separated. If you really cared, which I doubt you do, you'd post something more recent. You just want to push identity politics, which is very communist of you. permalink parent award report block reply Mintap 2 points 7 days ago Christian schools too. Just ban Islamic terrorist training centers. permalink award report block reply neveser 2 points 7 days ago OY VEY! Stop posting this antiseptic stuff!!!! This is making me verklempt! You've really got a lot of chutzpah posting this!!!! permalink award report block reply keeman 2 points 7 days ago The noticing is getting tiresome. permalink award report block reply Rideordie45 2 points 6 days ago It’s from 2018 and always the jews permalink award report block reply TonyTreehouse 2 points 7 days ago Didn't worry, it is just a vow.  They aren't going to do it. It is just a proposal and once they get bad press, they'll just cave and do nothing. permalink award report block reply hairless_ap3 1 points 6 days ago It's all so tiresome permalink award report block reply Deplorable_Yankee 1 points 6 days ago Strange how one religion is allowed. permalink award report block reply Cyber1776 -1 points 7 days ago 7 year old article to rage bait? permalink award report block reply redditadminssuckit OP 2 points 7 days ago Seriously? Coming from a guy who posts regular \"reminders\" of events from 20-200 years ago to get upvotes? I think your mom needs to bring you another hot pocket and kiwi-strawberry Celsius so you can calm down. permalink parent award report block reply Stormfagdeporter 1 points 7 days ago Comment removed by community filter, pending further review. permalink award report block reply HoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink award report block reply\nHankScorpio 22 points 7 days ago Being colonized by zionist international oligarchs who have people focused on muslims and not them. permalink award report block reply TrumpAndGodWin 14 points 7 days ago Zionists are trying to get Tucker Carlson assassinated recently through extreme dehumanization. Partly because he stood against the war Netanyahu wanted. permalink parent award report block reply KungPaoMcChicken -7 points 7 days ago Fuck Gaza. I don't object to any war on Muslims. It needs to happen. Who let all of these liberal crybabies in? Israel is taking one for the team. permalink parent award report block reply AccelerateAlready 2 points 7 days ago Gross. permalink parent award report block reply lash 1 points 7 days ago You are a cancer-spreader. permalink parent award report block reply HoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply SimaYi 6 points 7 days ago Which is why they did it. They imported their enemies to make them your enemies. The import subsaharan African animals so you are too busy getting shanked in the neck to notice them stealing everything. permalink parent award report block reply ReleasetheList 4 points 7 days ago Focus on both. AFAO. permalink parent award report block reply Aggrieved03 2 points 7 days ago Same here permalink parent award report block reply\nTrumpAndGodWin 14 points 7 days ago Zionists are trying to get Tucker Carlson assassinated recently through extreme dehumanization. Partly because he stood against the war Netanyahu wanted. permalink parent award report block reply KungPaoMcChicken -7 points 7 days ago Fuck Gaza. I don't object to any war on Muslims. It needs to happen. Who let all of these liberal crybabies in? Israel is taking one for the team. permalink parent award report block reply AccelerateAlready 2 points 7 days ago Gross. permalink parent award report block reply lash 1 points 7 days ago You are a cancer-spreader. permalink parent award report block reply HoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply\nKungPaoMcChicken -7 points 7 days ago Fuck Gaza. I don't object to any war on Muslims. It needs to happen. Who let all of these liberal crybabies in? Israel is taking one for the team. permalink parent award report block reply AccelerateAlready 2 points 7 days ago Gross. permalink parent award report block reply lash 1 points 7 days ago You are a cancer-spreader. permalink parent award report block reply HoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply\nAccelerateAlready 2 points 7 days ago Gross. permalink parent award report block reply\nlash 1 points 7 days ago You are a cancer-spreader. permalink parent award report block reply\nHoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply\nSimaYi 6 points 7 days ago Which is why they did it. They imported their enemies to make them your enemies. The import subsaharan African animals so you are too busy getting shanked in the neck to notice them stealing everything. permalink parent award report block reply\nReleasetheList 4 points 7 days ago Focus on both. AFAO. permalink parent award report block reply\nAggrieved03 2 points 7 days ago Same here permalink parent award report block reply\nmagapatriot_pa 19 points 7 days ago Segregation isn't a problem that needs to be tackled, it's a solution that needs to be embraced. The only alternative is sending all of these people back, and apparently nobody has the stomach for that permalink award report block reply stagolee 14 points 7 days ago No, sending them back is the only solution.  Segregation won't work because they'll outbreed us, unless you can suddenly convince white women to value motherhood  again. permalink parent award report block reply RINO_fatigue 13 points 7 days ago Muslims should be segregated to their desert shitholes and not be in White countries permalink parent award report block reply Female 5 points 7 days ago It may be a goal of President Trump to make a deal with the muslims to take them...there are dozens of muslim countries permalink parent award report block reply KungPaoMcChicken 4 points 7 days ago Multiculturalism is a cancer. permalink parent award report block reply\nstagolee 14 points 7 days ago No, sending them back is the only solution.  Segregation won't work because they'll outbreed us, unless you can suddenly convince white women to value motherhood  again. permalink parent award report block reply\nRINO_fatigue 13 points 7 days ago Muslims should be segregated to their desert shitholes and not be in White countries permalink parent award report block reply Female 5 points 7 days ago It may be a goal of President Trump to make a deal with the muslims to take them...there are dozens of muslim countries permalink parent award report block reply\nFemale 5 points 7 days ago It may be a goal of President Trump to make a deal with the muslims to take them...there are dozens of muslim countries permalink parent award report block reply\nKungPaoMcChicken 4 points 7 days ago Multiculturalism is a cancer. permalink parent award report block reply\nSpellingContable 10 points 7 days ago Hahahahaha the last line. For all the people calling out the antisemites please answer this question. Why would only Jewish schools be exempt from this law? permalink award report block reply\nColonelKlink 9 points 7 days ago It would be easier to send them all back home. permalink award report block reply\nLostElf 5 points 7 days ago Gender segregation in schools has existed since cavemen times. Sweden should stop attacking fake problems and embrace remigration. permalink award report block reply\nSimaYi 4 points 7 days ago Every Single Time. permalink award report block reply\nYaharaRiver 4 points 7 days ago <points & laughs at muslims frothing at the mouth over this> 😂 permalink award report block reply NotLikeThis 7 points 7 days ago Christians aren't exempt. permalink parent award report block reply YaharaRiver -6 points 7 days ago They’ll survive.  Everyone can be a Christian anywhere, anytime, alone or with others. Muslim schools won’t.  They require public participation and religious rules in every area of your life that can be judged and punished. permalink parent award report block reply\nNotLikeThis 7 points 7 days ago Christians aren't exempt. permalink parent award report block reply YaharaRiver -6 points 7 days ago They’ll survive.  Everyone can be a Christian anywhere, anytime, alone or with others. Muslim schools won’t.  They require public participation and religious rules in every area of your life that can be judged and punished. permalink parent award report block reply\nYaharaRiver -6 points 7 days ago They’ll survive.  Everyone can be a Christian anywhere, anytime, alone or with others. Muslim schools won’t.  They require public participation and religious rules in every area of your life that can be judged and punished. permalink parent award report block reply\nNotLikeThis 4 points 7 days ago Do you see? Do you fucking see yet? permalink award report block reply\nbased_trekkie 3 points 7 days ago Oy vey, don't notice the last line! permalink award report block reply\nredditadminssuckit OP 3 points 7 days ago https://archive.ph/qbwuB permalink award report block reply TrancePhreak 1 points 7 days ago 2018 permalink parent award report block reply redditadminssuckit OP 3 points 7 days ago So? permalink parent award report block reply TrancePhreak 2 points 6 days ago Kinda boring and don't care about Europe, especially in 2018. They were destined to fail long ago. It's why we separated. If you really cared, which I doubt you do, you'd post something more recent. You just want to push identity politics, which is very communist of you. permalink parent award report block reply\nTrancePhreak 1 points 7 days ago 2018 permalink parent award report block reply redditadminssuckit OP 3 points 7 days ago So? permalink parent award report block reply TrancePhreak 2 points 6 days ago Kinda boring and don't care about Europe, especially in 2018. They were destined to fail long ago. It's why we separated. If you really cared, which I doubt you do, you'd post something more recent. You just want to push identity politics, which is very communist of you. permalink parent award report block reply\nredditadminssuckit OP 3 points 7 days ago So? permalink parent award report block reply TrancePhreak 2 points 6 days ago Kinda boring and don't care about Europe, especially in 2018. They were destined to fail long ago. It's why we separated. If you really cared, which I doubt you do, you'd post something more recent. You just want to push identity politics, which is very communist of you. permalink parent award report block reply\nTrancePhreak 2 points 6 days ago Kinda boring and don't care about Europe, especially in 2018. They were destined to fail long ago. It's why we separated. If you really cared, which I doubt you do, you'd post something more recent. You just want to push identity politics, which is very communist of you. permalink parent award report block reply\nMintap 2 points 7 days ago Christian schools too. Just ban Islamic terrorist training centers. permalink award report block reply\nneveser 2 points 7 days ago OY VEY! Stop posting this antiseptic stuff!!!! This is making me verklempt! You've really got a lot of chutzpah posting this!!!! permalink award report block reply\nkeeman 2 points 7 days ago The noticing is getting tiresome. permalink award report block reply\nRideordie45 2 points 6 days ago It’s from 2018 and always the jews permalink award report block reply\nTonyTreehouse 2 points 7 days ago Didn't worry, it is just a vow.  They aren't going to do it. It is just a proposal and once they get bad press, they'll just cave and do nothing. permalink award report block reply\nhairless_ap3 1 points 6 days ago It's all so tiresome permalink award report block reply\nDeplorable_Yankee 1 points 6 days ago Strange how one religion is allowed. permalink award report block reply\nCyber1776 -1 points 7 days ago 7 year old article to rage bait? permalink award report block reply redditadminssuckit OP 2 points 7 days ago Seriously? Coming from a guy who posts regular \"reminders\" of events from 20-200 years ago to get upvotes? I think your mom needs to bring you another hot pocket and kiwi-strawberry Celsius so you can calm down. permalink parent award report block reply\nredditadminssuckit OP 2 points 7 days ago Seriously? Coming from a guy who posts regular \"reminders\" of events from 20-200 years ago to get upvotes? I think your mom needs to bring you another hot pocket and kiwi-strawberry Celsius so you can calm down. permalink parent award report block reply\nStormfagdeporter 1 points 7 days ago Comment removed by community filter, pending further review. permalink award report block reply\nHoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink award report block reply"}