{"id": "1ARK9l80o7", "contents": "613 Paging Captain Obvious... posted 1 day ago by KuzoKevin 12 comments award share download report block\n12 comments Sort by Top Top New Worst Old Save KuzoKevin OP 14 points 1 day ago Should we use taxpayer dollars to pay the rent and mortgages of trannies? Fuck off. permalink award report block reply Klaus73 2 points 19 hours ago We can call it TRAP permalink parent award report block reply boredrandomguy 2 points 20 hours ago Send them to an isolated island where they can play pretend all they want. Then after about a month or so, cut them off of their puberty blockers and hormones. permalink parent award report block reply someguy7738 1 points 24 hours ago Of course we should! First get them one of those big beautiful 50 year mortgages so they can \"afford\" housing, then make the taxpayers fund it, extortionate interest and all! Bankers must never see even a slight dent in their profits! permalink parent award report block reply KuzoKevin OP 4 points 1 day ago Link - https://twitter.com/teameffujoe/status/1988314146140733909 permalink award report block reply goatnuts 3 points 18 hours ago Framing it like their homes get taken from them for being trans. These people need to shut the fuck up. They're so full of shit. permalink award report block reply Modern_Times 2 points 20 hours ago How many lost their homes when their spouse found out and divorced them? permalink award report block reply Klaus73 2 points 19 hours ago Last I heard 58% of all trans folks eventually lose their homes. permalink award report block reply TerrorAndSlaughter 2 points 19 hours ago It's not because they are insane; it's because they don't pay their rent/mortgage.  Being crazy often means you fail to manage your financial affairs well. permalink award report block reply MatterThatMetals 2 points 1 day ago A strong jab to the shnoz. Well done. permalink award report block reply DlanOdcammron 1 points 17 hours ago Playing Russian Roulette with your cock has consequences. The more your know. permalink award report block reply TearsAficionado 1 points 16 hours ago A doctor needing to use pronouns in a signature block. Unacceptable. permalink award report block reply\nKuzoKevin OP 14 points 1 day ago Should we use taxpayer dollars to pay the rent and mortgages of trannies? Fuck off. permalink award report block reply Klaus73 2 points 19 hours ago We can call it TRAP permalink parent award report block reply boredrandomguy 2 points 20 hours ago Send them to an isolated island where they can play pretend all they want. Then after about a month or so, cut them off of their puberty blockers and hormones. permalink parent award report block reply someguy7738 1 points 24 hours ago Of course we should! First get them one of those big beautiful 50 year mortgages so they can \"afford\" housing, then make the taxpayers fund it, extortionate interest and all! Bankers must never see even a slight dent in their profits! permalink parent award report block reply\nKlaus73 2 points 19 hours ago We can call it TRAP permalink parent award report block reply\nboredrandomguy 2 points 20 hours ago Send them to an isolated island where they can play pretend all they want. Then after about a month or so, cut them off of their puberty blockers and hormones. permalink parent award report block reply\nsomeguy7738 1 points 24 hours ago Of course we should! First get them one of those big beautiful 50 year mortgages so they can \"afford\" housing, then make the taxpayers fund it, extortionate interest and all! Bankers must never see even a slight dent in their profits! permalink parent award report block reply\nKuzoKevin OP 4 points 1 day ago Link - https://twitter.com/teameffujoe/status/1988314146140733909 permalink award report block reply\ngoatnuts 3 points 18 hours ago Framing it like their homes get taken from them for being trans. These people need to shut the fuck up. They're so full of shit. permalink award report block reply\nModern_Times 2 points 20 hours ago How many lost their homes when their spouse found out and divorced them? permalink award report block reply\nKlaus73 2 points 19 hours ago Last I heard 58% of all trans folks eventually lose their homes. permalink award report block reply\nTerrorAndSlaughter 2 points 19 hours ago It's not because they are insane; it's because they don't pay their rent/mortgage.  Being crazy often means you fail to manage your financial affairs well. permalink award report block reply\nMatterThatMetals 2 points 1 day ago A strong jab to the shnoz. Well done. permalink award report block reply\nDlanOdcammron 1 points 17 hours ago Playing Russian Roulette with your cock has consequences. The more your know. permalink award report block reply\nTearsAficionado 1 points 16 hours ago A doctor needing to use pronouns in a signature block. Unacceptable. permalink award report block reply"}