{"id": "1ARK9nPd3s", "contents": "56 H1B’s are going to TRAIN Americans how to make stuff PSYOP!…. So the workers who have to WORST QUALITY STANDARDS and the WORST SAFETY RECORDS and WORST ENVIRONMENTAL STANDARDS are going to train us on how to do it!!!! What a joke… AMERICAN ALREADY DO IT BETTER than any H1B posted 5 hours ago by Trooph-Hurts 5 comments award share report block Last I looked, Americans are training their replacement H1B… the only thing China and India have to offer is brute force labor volume!….. but if you want bridges and buildings to collapse, you bring them here!\n5 comments Sort by Top Top New Worst Old Save UntakenUsername 9 points 5 hours ago They're going to train us on the things that we invented, developed, and industrialized? Sure. permalink award report block reply Trooph-Hurts OP 6 points 5 hours ago Exactly! I have 45 years in MFG and they are telling us that we can’t do it without them….. this is how white collar assholes look at Americans permalink parent award report block reply UntakenUsername 5 points 5 hours ago It is infuriating. I don't even know how to process this whole situation. None of it makes sense. Major betrayal. permalink parent award report block reply Trooph-Hurts OP 4 points 5 hours ago Just don’t believe anything…. But here is my take: When you hear grow out way out of debt they created that ONLY MEANN IMMIGRATION!….. the reality is this,,,,. The elite and politicians and bureaucrats have stolen trillions of dollars that they currently have in their pockets….. The only way out of our debt problem is to create a new currency and make everybody justify the wealth that they currently have! For example, take a billionaire and make them justify their ownership of billions of dollars when they did zero other than manipulate the system!.. we have black market money from cartels dealing drugs that have hundreds of billions of dollars in cash just laying around what did they do for it? Nothing they didn’t pay taxes. They did nothing but they have access to our economy and do not contribute to the debt. permalink parent award report block reply genericamerican69 2 points 2 hours ago Trump bought 10% of Intel. Intel is 99% Indians. You do the math. permalink parent award report block reply\nUntakenUsername 9 points 5 hours ago They're going to train us on the things that we invented, developed, and industrialized? Sure. permalink award report block reply Trooph-Hurts OP 6 points 5 hours ago Exactly! I have 45 years in MFG and they are telling us that we can’t do it without them….. this is how white collar assholes look at Americans permalink parent award report block reply UntakenUsername 5 points 5 hours ago It is infuriating. I don't even know how to process this whole situation. None of it makes sense. Major betrayal. permalink parent award report block reply Trooph-Hurts OP 4 points 5 hours ago Just don’t believe anything…. But here is my take: When you hear grow out way out of debt they created that ONLY MEANN IMMIGRATION!….. the reality is this,,,,. The elite and politicians and bureaucrats have stolen trillions of dollars that they currently have in their pockets….. The only way out of our debt problem is to create a new currency and make everybody justify the wealth that they currently have! For example, take a billionaire and make them justify their ownership of billions of dollars when they did zero other than manipulate the system!.. we have black market money from cartels dealing drugs that have hundreds of billions of dollars in cash just laying around what did they do for it? Nothing they didn’t pay taxes. They did nothing but they have access to our economy and do not contribute to the debt. permalink parent award report block reply genericamerican69 2 points 2 hours ago Trump bought 10% of Intel. Intel is 99% Indians. You do the math. permalink parent award report block reply\nTrooph-Hurts OP 6 points 5 hours ago Exactly! I have 45 years in MFG and they are telling us that we can’t do it without them….. this is how white collar assholes look at Americans permalink parent award report block reply UntakenUsername 5 points 5 hours ago It is infuriating. I don't even know how to process this whole situation. None of it makes sense. Major betrayal. permalink parent award report block reply Trooph-Hurts OP 4 points 5 hours ago Just don’t believe anything…. But here is my take: When you hear grow out way out of debt they created that ONLY MEANN IMMIGRATION!….. the reality is this,,,,. The elite and politicians and bureaucrats have stolen trillions of dollars that they currently have in their pockets….. The only way out of our debt problem is to create a new currency and make everybody justify the wealth that they currently have! For example, take a billionaire and make them justify their ownership of billions of dollars when they did zero other than manipulate the system!.. we have black market money from cartels dealing drugs that have hundreds of billions of dollars in cash just laying around what did they do for it? Nothing they didn’t pay taxes. They did nothing but they have access to our economy and do not contribute to the debt. permalink parent award report block reply\nUntakenUsername 5 points 5 hours ago It is infuriating. I don't even know how to process this whole situation. None of it makes sense. Major betrayal. permalink parent award report block reply Trooph-Hurts OP 4 points 5 hours ago Just don’t believe anything…. But here is my take: When you hear grow out way out of debt they created that ONLY MEANN IMMIGRATION!….. the reality is this,,,,. The elite and politicians and bureaucrats have stolen trillions of dollars that they currently have in their pockets….. The only way out of our debt problem is to create a new currency and make everybody justify the wealth that they currently have! For example, take a billionaire and make them justify their ownership of billions of dollars when they did zero other than manipulate the system!.. we have black market money from cartels dealing drugs that have hundreds of billions of dollars in cash just laying around what did they do for it? Nothing they didn’t pay taxes. They did nothing but they have access to our economy and do not contribute to the debt. permalink parent award report block reply\nTrooph-Hurts OP 4 points 5 hours ago Just don’t believe anything…. But here is my take: When you hear grow out way out of debt they created that ONLY MEANN IMMIGRATION!….. the reality is this,,,,. The elite and politicians and bureaucrats have stolen trillions of dollars that they currently have in their pockets….. The only way out of our debt problem is to create a new currency and make everybody justify the wealth that they currently have! For example, take a billionaire and make them justify their ownership of billions of dollars when they did zero other than manipulate the system!.. we have black market money from cartels dealing drugs that have hundreds of billions of dollars in cash just laying around what did they do for it? Nothing they didn’t pay taxes. They did nothing but they have access to our economy and do not contribute to the debt. permalink parent award report block reply\ngenericamerican69 2 points 2 hours ago Trump bought 10% of Intel. Intel is 99% Indians. You do the math. permalink parent award report block reply"}