{"id": "1ARK9oWebZ", "contents": "91 \"Over 800,000 Americans specific to those tech roles, have been laid off since 2022 AND they’re still here in America. America has those roles, tech companies have openly spoke about firing Americans to hire Indians. This is treasonous\" posted 2 hours ago by bleeje 6 comments award share report block Pelican Developer @PelicanDevelops • 7h @libertarianfilm @BarefootStudent Over 800,000 Americans specific to those tech roles, have been laid off since 2022 AND they’re still here in America. America has those roles, tech companies have openly spoke about firing Americans to hire Indians. This is treasonous\n6 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style patrioticwinning3 7 points 2 hours ago And Trump is going on faux news and repeating the lie that we need to import students/workers because Americans are too dumb and lazy to do it... permalink award report block reply Wrexxis780 4 points 34 minutes ago “America first… but Americans are too dumb to do work” Ok sure permalink parent award report block reply BidenShowerDrool 4 points 55 minutes ago Tech Bros and their shitty dystopian companies need to be investigated and the question needs to be asked...what special talent does this code monkey pajeet have that the American one lacks and doesn't even get a look into these jobs you all claim are unique and specific? As of now other a very select special handful of jobs i do not see the reason for hiring dumb as rocks pajeets who whisper on their phones all fucking day while at their desks doing very little worthwhile work. permalink award report block reply bejeavis 1 points 10 minutes ago The special talent is this: Accept 60% of a normal salary, \"work\" (lol) double the hours, and the company holds the keys to their future by dangling the ability to cancel their visa and send them packing no questions asked. It's indentured servitude all over again. permalink parent award report block reply breadbaker 1 points 51 minutes ago NTTA not trusting Trump anymore permalink award report block reply\npatrioticwinning3 7 points 2 hours ago And Trump is going on faux news and repeating the lie that we need to import students/workers because Americans are too dumb and lazy to do it... permalink award report block reply Wrexxis780 4 points 34 minutes ago “America first… but Americans are too dumb to do work” Ok sure permalink parent award report block reply\nWrexxis780 4 points 34 minutes ago “America first… but Americans are too dumb to do work” Ok sure permalink parent award report block reply\nBidenShowerDrool 4 points 55 minutes ago Tech Bros and their shitty dystopian companies need to be investigated and the question needs to be asked...what special talent does this code monkey pajeet have that the American one lacks and doesn't even get a look into these jobs you all claim are unique and specific? As of now other a very select special handful of jobs i do not see the reason for hiring dumb as rocks pajeets who whisper on their phones all fucking day while at their desks doing very little worthwhile work. permalink award report block reply bejeavis 1 points 10 minutes ago The special talent is this: Accept 60% of a normal salary, \"work\" (lol) double the hours, and the company holds the keys to their future by dangling the ability to cancel their visa and send them packing no questions asked. It's indentured servitude all over again. permalink parent award report block reply\nbejeavis 1 points 10 minutes ago The special talent is this: Accept 60% of a normal salary, \"work\" (lol) double the hours, and the company holds the keys to their future by dangling the ability to cancel their visa and send them packing no questions asked. It's indentured servitude all over again. permalink parent award report block reply\nbreadbaker 1 points 51 minutes ago NTTA not trusting Trump anymore permalink award report block reply"}