{"id": "1ARK9mHmlt", "contents": "27 Trump sends a letter to President Herzog formally asking him to pardon Netanyahu, saying the case against him is \"a political, unjustified prosecution.\" posted 12 hours ago by Looniz74 PRO 11 comments award share report block Disclose.tv @disclosetv • 12h NEW - Trump sends a letter to President Herzog formally asking him to pardon Netanyahu, saying the case against him is \"a political, unjustified prosecution.\"\n11 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style rightoverthere 14 points 12 hours ago wonder if trump will get $7k for this post? permalink award report block reply 19American62Woman 11 points 12 hours ago Free Tina Peters, here, in America permalink award report block reply Looniz74 OP PRO 4 points 12 hours ago https://x.com/disclosetv/status/1988578454833688633?s=20 permalink award report block reply Secondrun007 3 points 11 hours ago Trump knows what it's like when the left (labor) fucks around! permalink award report block reply Grindelwald 3 points 12 hours ago Looks like auto pen must be illegitimate permalink award report block reply _2022_ 3 points 11 hours ago MIGA. Don’t you know? permalink award report block reply SpeekFreely 0 points 12 hours ago Another DS hoax ? This one of  Khazarian origins. permalink award report block reply Raetchel 0 points 10 hours ago fuck bb permalink award report block reply T471 -1 points 10 hours ago trump should stay out of it, Netanyahu is dirty. permalink award report block reply Hambonemcgee -2 points 11 hours ago I am bathing in the MAGA glow, keep it up President Trump!   We were all worried that Bibi was accused of crimes.  Glad to see Trump take action to clear his name! permalink award report block reply\nrightoverthere 14 points 12 hours ago wonder if trump will get $7k for this post? permalink award report block reply\n19American62Woman 11 points 12 hours ago Free Tina Peters, here, in America permalink award report block reply\nLooniz74 OP PRO 4 points 12 hours ago https://x.com/disclosetv/status/1988578454833688633?s=20 permalink award report block reply\nSecondrun007 3 points 11 hours ago Trump knows what it's like when the left (labor) fucks around! permalink award report block reply\nGrindelwald 3 points 12 hours ago Looks like auto pen must be illegitimate permalink award report block reply\n_2022_ 3 points 11 hours ago MIGA. Don’t you know? permalink award report block reply\nSpeekFreely 0 points 12 hours ago Another DS hoax ? This one of  Khazarian origins. permalink award report block reply\nRaetchel 0 points 10 hours ago fuck bb permalink award report block reply\nT471 -1 points 10 hours ago trump should stay out of it, Netanyahu is dirty. permalink award report block reply\nHambonemcgee -2 points 11 hours ago I am bathing in the MAGA glow, keep it up President Trump!   We were all worried that Bibi was accused of crimes.  Glad to see Trump take action to clear his name! permalink award report block reply"}