{"id": "1ARK0UcAr2", "contents": "311 Trump is 100% correct. You go nuclear. What we have now is a slow methodical death sentence. Do it. Go fast and keep going. It will inspire people who love this country. They will show up come mid terms. Cross the Rubicon with this Army. We will not fail. posted 7 days ago by FlyinHeadlock 16 comments award share report block .\n16 comments Sort by Top Top New Worst Old Save TheJakeFroggy 16 points 7 days ago I'm honestly at the point where I think Trump should just invoke the Insurrection Act. Like, fuck it, just do it. I don't trust the senate Republicans enough to actually efficiently wield the power they'd get from nuking the filibuster. You expect Mitch McConnell or Susan Collins to vote in our favor on everything? Trump should just activate the military and have them arrest all the corrupt politicians, judges, and all their useful idiots. If he were to do it, most Americans would support it. There would be righteous nationwide cheering if he were to do it. I won't say it's impossible for him to have the willpower to do it, he did mention the Insurrection Act in a few recent interviews at least. And surely he'd know that he and his family would spend all their last days in prison if the enemies take back all power. permalink award report block reply 1_Badcop -2 points 7 days ago Trump is a pussy that just wants to be loved by everyone. He is never going to do what is necessary to save America. permalink parent award report block reply HoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply TheChillingEffect 15 points 7 days ago I was originally hesitant about this idea, but I've come to believe that either we cross the Rubicon or go into the dustbin of history. Now's the time.  Go nuclear. If we fail, the outcome is the same - physical warfare.  Either we win by law of man, or we fight by law of the jungle.  Thus is the ebb and flow of civilization. But they won't do it.  They're fat, fearful, and feckless.  Their money (they think) has value.  They'll be soft.  The Feckless 535 (TM) will fail us.   So at least then we'll all know where we're going.  Be ready.  When it comes down, it will be obvious. permalink award report block reply FlyinHeadlock OP 6 points 7 days ago Stranger things have happened. The GOP however knows we are at the end. The meandering is over. You either do something right now or they are all finished and even worse. This cancer is spreading and spreading fast. It's not going to stop until it destroys the country. permalink parent award report block reply TheChillingEffect 2 points 7 days ago I hope you're right.  But on the current trajectory, things are going to get really, really bad.  In about 1 year, it will be obvious.  I hope something changes course, but I'm not going to believe it's a done deal. Civilization ebbs and flows.  Rarely do we learn from history.  I'm skeptical on this batch of geniuses figuring it out until proven otherwise.  I hope I'm wrong. permalink parent award report block reply RufusPillula 13 points 7 days ago Yes, but I disagree with those suggesting the Trump administration needs to double down. They need to quadruple down , and not let up until the violent left, Democrat and Rhino elites, their media enablers and their mindless lemming voters are utterly destroyed. permalink award report block reply UCantStumpTheTrump 7 points 7 days ago Agreed. Trump is well within his rights to designate the entire Democrat party as a terrorist organization. Their elected officials & voters openly fantasize about killing conservative Americans. There can be no peaceful coexistence. Invoke the Insurrection Act and liquidate every last Dem politician, staffer, and donor permalink parent award report block reply BenDoverAssho 9 points 7 days ago Now that the Communist/Islamist Coalition is out in the open, the way is clear. We either go \" all in\" with the MAGA agenda NOW, or we end up losing major RIGGED ELECTIONS until finally the box cars and concentration camps become a reality. Look at what they wanted to do during the Covid-19 Plandemic. If we give them another opportunity  they will not screw it up. People will be sent to the Gulag.( or eliminated) permalink award report block reply UCantStumpTheTrump 5 points 7 days ago Covid was a dry run. We won’t get another chance if we let these people back in the WH permalink parent award report block reply Pede 7 points 7 days ago Yep, no choice. They're going too far. Maybe they always were going too far, but now it's all exposed and it makes no sense to try to play by the old rules. permalink award report block reply Trooph-Hurts 6 points 7 days ago There are no other options….. there is not justice with corruption….. the entire system is designed to protect itself by slow walking justice past legal limitations and election results….. elections are stolen through the justice system denying citizens of their rights…… rubicon or bus,  its the only way…. permalink award report block reply bearshawksfan826 3 points 7 days ago There is a way without going nuclear. Make them filibuster old school.  This silent filibuster is bullshit.  Make them keep talking. permalink award report block reply FlyinHeadlock OP 2 points 7 days ago There is no way that happens. Maybe in 1981 before the internet. I don't know if you noticed yet bet everything is double, triple down. Concede nothing. It's Delian Leauge shit where you are losing but refuse to ever admit defeat under any circumstance until the enemy army barges down the door. permalink parent award report block reply BenDoverAssho 1 points 7 days ago A silent filibuster? WTF? Fucking ridiculous!\nYeah. It's time to abolish it. permalink parent award report block reply HoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink award report block reply\nTheJakeFroggy 16 points 7 days ago I'm honestly at the point where I think Trump should just invoke the Insurrection Act. Like, fuck it, just do it. I don't trust the senate Republicans enough to actually efficiently wield the power they'd get from nuking the filibuster. You expect Mitch McConnell or Susan Collins to vote in our favor on everything? Trump should just activate the military and have them arrest all the corrupt politicians, judges, and all their useful idiots. If he were to do it, most Americans would support it. There would be righteous nationwide cheering if he were to do it. I won't say it's impossible for him to have the willpower to do it, he did mention the Insurrection Act in a few recent interviews at least. And surely he'd know that he and his family would spend all their last days in prison if the enemies take back all power. permalink award report block reply 1_Badcop -2 points 7 days ago Trump is a pussy that just wants to be loved by everyone. He is never going to do what is necessary to save America. permalink parent award report block reply HoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply\n1_Badcop -2 points 7 days ago Trump is a pussy that just wants to be loved by everyone. He is never going to do what is necessary to save America. permalink parent award report block reply\nHoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply\nTheChillingEffect 15 points 7 days ago I was originally hesitant about this idea, but I've come to believe that either we cross the Rubicon or go into the dustbin of history. Now's the time.  Go nuclear. If we fail, the outcome is the same - physical warfare.  Either we win by law of man, or we fight by law of the jungle.  Thus is the ebb and flow of civilization. But they won't do it.  They're fat, fearful, and feckless.  Their money (they think) has value.  They'll be soft.  The Feckless 535 (TM) will fail us.   So at least then we'll all know where we're going.  Be ready.  When it comes down, it will be obvious. permalink award report block reply FlyinHeadlock OP 6 points 7 days ago Stranger things have happened. The GOP however knows we are at the end. The meandering is over. You either do something right now or they are all finished and even worse. This cancer is spreading and spreading fast. It's not going to stop until it destroys the country. permalink parent award report block reply TheChillingEffect 2 points 7 days ago I hope you're right.  But on the current trajectory, things are going to get really, really bad.  In about 1 year, it will be obvious.  I hope something changes course, but I'm not going to believe it's a done deal. Civilization ebbs and flows.  Rarely do we learn from history.  I'm skeptical on this batch of geniuses figuring it out until proven otherwise.  I hope I'm wrong. permalink parent award report block reply\nFlyinHeadlock OP 6 points 7 days ago Stranger things have happened. The GOP however knows we are at the end. The meandering is over. You either do something right now or they are all finished and even worse. This cancer is spreading and spreading fast. It's not going to stop until it destroys the country. permalink parent award report block reply TheChillingEffect 2 points 7 days ago I hope you're right.  But on the current trajectory, things are going to get really, really bad.  In about 1 year, it will be obvious.  I hope something changes course, but I'm not going to believe it's a done deal. Civilization ebbs and flows.  Rarely do we learn from history.  I'm skeptical on this batch of geniuses figuring it out until proven otherwise.  I hope I'm wrong. permalink parent award report block reply\nTheChillingEffect 2 points 7 days ago I hope you're right.  But on the current trajectory, things are going to get really, really bad.  In about 1 year, it will be obvious.  I hope something changes course, but I'm not going to believe it's a done deal. Civilization ebbs and flows.  Rarely do we learn from history.  I'm skeptical on this batch of geniuses figuring it out until proven otherwise.  I hope I'm wrong. permalink parent award report block reply\nRufusPillula 13 points 7 days ago Yes, but I disagree with those suggesting the Trump administration needs to double down. They need to quadruple down , and not let up until the violent left, Democrat and Rhino elites, their media enablers and their mindless lemming voters are utterly destroyed. permalink award report block reply UCantStumpTheTrump 7 points 7 days ago Agreed. Trump is well within his rights to designate the entire Democrat party as a terrorist organization. Their elected officials & voters openly fantasize about killing conservative Americans. There can be no peaceful coexistence. Invoke the Insurrection Act and liquidate every last Dem politician, staffer, and donor permalink parent award report block reply\nUCantStumpTheTrump 7 points 7 days ago Agreed. Trump is well within his rights to designate the entire Democrat party as a terrorist organization. Their elected officials & voters openly fantasize about killing conservative Americans. There can be no peaceful coexistence. Invoke the Insurrection Act and liquidate every last Dem politician, staffer, and donor permalink parent award report block reply\nBenDoverAssho 9 points 7 days ago Now that the Communist/Islamist Coalition is out in the open, the way is clear. We either go \" all in\" with the MAGA agenda NOW, or we end up losing major RIGGED ELECTIONS until finally the box cars and concentration camps become a reality. Look at what they wanted to do during the Covid-19 Plandemic. If we give them another opportunity  they will not screw it up. People will be sent to the Gulag.( or eliminated) permalink award report block reply UCantStumpTheTrump 5 points 7 days ago Covid was a dry run. We won’t get another chance if we let these people back in the WH permalink parent award report block reply\nUCantStumpTheTrump 5 points 7 days ago Covid was a dry run. We won’t get another chance if we let these people back in the WH permalink parent award report block reply\nPede 7 points 7 days ago Yep, no choice. They're going too far. Maybe they always were going too far, but now it's all exposed and it makes no sense to try to play by the old rules. permalink award report block reply\nTrooph-Hurts 6 points 7 days ago There are no other options….. there is not justice with corruption….. the entire system is designed to protect itself by slow walking justice past legal limitations and election results….. elections are stolen through the justice system denying citizens of their rights…… rubicon or bus,  its the only way…. permalink award report block reply\nbearshawksfan826 3 points 7 days ago There is a way without going nuclear. Make them filibuster old school.  This silent filibuster is bullshit.  Make them keep talking. permalink award report block reply FlyinHeadlock OP 2 points 7 days ago There is no way that happens. Maybe in 1981 before the internet. I don't know if you noticed yet bet everything is double, triple down. Concede nothing. It's Delian Leauge shit where you are losing but refuse to ever admit defeat under any circumstance until the enemy army barges down the door. permalink parent award report block reply BenDoverAssho 1 points 7 days ago A silent filibuster? WTF? Fucking ridiculous!\nYeah. It's time to abolish it. permalink parent award report block reply\nFlyinHeadlock OP 2 points 7 days ago There is no way that happens. Maybe in 1981 before the internet. I don't know if you noticed yet bet everything is double, triple down. Concede nothing. It's Delian Leauge shit where you are losing but refuse to ever admit defeat under any circumstance until the enemy army barges down the door. permalink parent award report block reply\nBenDoverAssho 1 points 7 days ago A silent filibuster? WTF? Fucking ridiculous!\nYeah. It's time to abolish it. permalink parent award report block reply\nHoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink award report block reply"}