{"id": "1ARK9nOGDV", "contents": "34 DHS Secretary Noem Advertises MORE Foreigners Becoming US Citizens/Legal Residents posted 8 hours ago by flashersenpai 6 comments award share report block Disclose.tv @disclosetv • 11h NOW - DHS Secretary Noem on H-1Bs: \"Under the Trump admin, we've sped up our process and added integrity to the visa programs, to green cards, to all of that, but also more people are becoming naturalized under this admin than ever before. More people are becoming citizens.\"\n6 comments Sort by Top Top New Worst Old Save RudeFrog 5 points 8 hours ago Real tired boss permalink award report block reply flashersenpai OP 4 points 8 hours ago First, this is lame and gay. The US is FULL as far as I'm concerned. And once again I have to point out: DHS/State Department has tried to deport a student for writing a school news article critical of Israel. When they say they are screening for supporting terrorism, this is what they mean. Not sending money to ISIS or planning a terror attack. You know, things that can actually lead to harming Americans. permalink award report block reply PearlyGaits57 3 points 7 hours ago I will say it again \"DEPORT\" permalink award report block reply ScoobyDum 3 points 8 hours ago Trump is speeding up our replacement, what the fuck permalink award report block reply T471 3 points 8 hours ago Idiotic statement, no need for this shit to continue. permalink award report block reply NotYourMan 1 points 7 hours ago We don't want this.  We want MAGA.  Focus on jobs for Millennials and GenZ instead of foreigners.  Grants for US citizens instead of foreigners is good too.  Universities that have more international students instead of US born students should get a yearly fee per student from the federal government. permalink award report block reply\nRudeFrog 5 points 8 hours ago Real tired boss permalink award report block reply\nflashersenpai OP 4 points 8 hours ago First, this is lame and gay. The US is FULL as far as I'm concerned. And once again I have to point out: DHS/State Department has tried to deport a student for writing a school news article critical of Israel. When they say they are screening for supporting terrorism, this is what they mean. Not sending money to ISIS or planning a terror attack. You know, things that can actually lead to harming Americans. permalink award report block reply\nPearlyGaits57 3 points 7 hours ago I will say it again \"DEPORT\" permalink award report block reply\nScoobyDum 3 points 8 hours ago Trump is speeding up our replacement, what the fuck permalink award report block reply\nT471 3 points 8 hours ago Idiotic statement, no need for this shit to continue. permalink award report block reply\nNotYourMan 1 points 7 hours ago We don't want this.  We want MAGA.  Focus on jobs for Millennials and GenZ instead of foreigners.  Grants for US citizens instead of foreigners is good too.  Universities that have more international students instead of US born students should get a yearly fee per student from the federal government. permalink award report block reply"}