{"id": "1ARK9pf2zU", "contents": "96 Meet Gary Webb -- a guy who exposed the CIA's drug trafficking (m3.gab.com) posted 11 hours ago by FreeFire 4 comments award share report block\n4 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style FreeFire OP 2 points 11 hours ago https://m3.gab.com/media_attachments/23/35/0c/23350ca4a043a7897dfecd66e55eaffe.png?width=568 permalink award report block reply LordCommissarYarrick 2 points 9 hours ago CIA has been running drugs since Vietnam and Laos permalink award report block reply Tookens 2 points 10 hours ago Ah yes..  the double-tap \"suicide\". permalink award report block reply flp999 1 points 11 hours ago Hero. Legend. King. Paid the ultimate price for revealing (many aspects of) the ultimate truth of what our government is doing to us and how they view us. permalink award report block reply Trumpalorian 1 points 9 hours ago Rookie shit in the 90s. These days they just make an NGO for Black Transgender Chestnut famers and launder all the money into a slush fund for whatever the fuck you want. No crack needed. permalink award report block reply\nFreeFire OP 2 points 11 hours ago https://m3.gab.com/media_attachments/23/35/0c/23350ca4a043a7897dfecd66e55eaffe.png?width=568 permalink award report block reply\nLordCommissarYarrick 2 points 9 hours ago CIA has been running drugs since Vietnam and Laos permalink award report block reply\nTookens 2 points 10 hours ago Ah yes..  the double-tap \"suicide\". permalink award report block reply\nflp999 1 points 11 hours ago Hero. Legend. King. Paid the ultimate price for revealing (many aspects of) the ultimate truth of what our government is doing to us and how they view us. permalink award report block reply\nTrumpalorian 1 points 9 hours ago Rookie shit in the 90s. These days they just make an NGO for Black Transgender Chestnut famers and launder all the money into a slush fund for whatever the fuck you want. No crack needed. permalink award report block reply"}