{"id": "1ARK52CG9c", "contents": "820 Getting harder and harder to deny posted 6 days ago by Electricutie 50 comments award share download report block\n50 comments Sort by Top Top New Worst Old Save Around the Web Hair Will Grow Back! No Matter How Severe The Baldness HaloGrow loooooof 43 points 6 days ago Yup... The Nineteenth Amendment is a scourge. permalink award report block reply cereal_killer 33 points 6 days ago I'd argue that the deathblow was actually \"fertility\" tech. American women got the vote and then remained more or less hardline for 40 years. It wasn't until the mass introduction of cheap, reliable, and readily accessible birth control that they truly went off the rails. If women were still forced to live with the consequences of their actions today, I'd bet you'd find them lining up to vote for the right. permalink parent award report block reply loooooof 30 points 6 days ago Thus, why allowing them to vote was always a mistake. permalink parent award report block reply cereal_killer 12 points 6 days ago Yeah. I agree. It certainly didn't do America any favors. permalink parent award report block reply PM-Melania-feet-pics 2 points 5 days ago Some 68% of women voters said abortion was their priority?  They don't care if society collapses as long as their babies die in it too.  Horrific. permalink parent award report block reply terribletwos 8 points 6 days ago Every problem can be traced back to birth control and abortions. All of our other problems are symptoms. permalink parent award report block reply dr_gonzo 9 points 6 days ago That's not so. The Federal Reserve is one of our biggest problems, yet it was imposed long before abortions became legal or birth control existed. Ditto the progressive income tax, Social Security, the Administrative Procedure Act that created our regulatory state and many other problems. Those things are the foundation. Abortion and birth control are the symptoms. Our side really needs to come to the realization that 90% of politics is ECONOMICS. The economic policies create the social problems, not the other way around. That's why Lenin himself said 90% of communizing a country was the establishment of a central bank. It's what they use to manipulate society to their will, especially when used in conjunction with a progressive income tax. A return to economic liberty will bring back sanity in our society. permalink parent award report block reply RedEnsign4Trump 3 points 6 days ago Those two things are also a symptom. Every problem can in turn be traced to a decline in faith and Christianity. Same reason for all the decline both in US and the broader West (Christendom) permalink parent award report block reply terribletwos 2 points 6 days ago They're a large contributing factor to the decline of Christianity. You get the ability for women to be whores without responsibility in the 60s that leads to the major decline in Christianity. Top that off with the civil war creating a weak generation that travels throughout the century and you silent generation before the boomers and gen x after. So you get an entire generation whose defining character is free love and anti-Christian and due to their size versus the other generations, they become the defacto reality for the US for 60+ years. permalink parent award report block reply Floppybutthole 2 points 6 days ago This may be true.  But I would also argue higher education too.   Though it wouldn't have been as big of a deal if they didn't have the pill. permalink parent award report block reply cereal_killer 2 points 6 days ago Right. Women generally want to have sex and children in their late teens. They are only able to go to college by postponing that, so very few women would go to college if they couldn't. Give them the Pill or a Plan B or some abortion clinic though, and they can do whatever they want until it's too late. Birth control and women in college are correlated. permalink parent award report block reply PM-Melania-feet-pics 2 points 5 days ago And then you get liberal arts majors. permalink parent award report block reply fasterthanspeedofdum 2 points 6 days ago 40 years? This has a been a downfall of mankind since Garden of Eden. permalink parent award report block reply cereal_killer 2 points 6 days ago White women, the real White man's burden. permalink parent award report block reply 1_Badcop 3 points 6 days ago Repeal the 19th permalink parent award report block reply Bigdeal 3 points 6 days ago And letting in anyone to the country that is not from Europe. There was a reason the forefather had voting set only for White land owning males. permalink parent award report block reply CheekyHawk 3 points 6 days ago Wonder if there is a foreign interest group that has been engineering women’s lib, multi-culturalism, Marxism, communism, racism, and the rest… wonder who it could be! permalink parent award report block reply ReleasetheList 29 points 6 days ago Women are a problem for sure, the GOP pandering to everyone but white people is also a problem. The only people that should be allowed to vote are net tax payers. permalink award report block reply Overkillengine 6 points 6 days ago I'd take it a step further and make voting and taxes linked to the point that if you don't want to vote, you don't pay taxes. Then the establishment can't keep playing the \"heads I win, tails you lose\" game they have been playing for generations with the illusion of choice in candidates and parties. Because if they do, the net producer bloc can just abstain from voting and forcibly defund the government. A fiscal Sword of Damocles that the public can whip out every single year, not just on election years for that matter. And yes, for those about to have a soy-stroke, the threat of massive instability in the government is THE FUCKING POINT. permalink parent award report block reply Nerdrem3 1 points 6 days ago It kinda reminds me of Marvel, their movies were a money printing machine for a while but then they started pandering thinking they could get an even bigger audience and more profit but when they did that they lost more of their core audience than they gained in new viewers and now they're in a steep decline that's probably irreversible at this point. permalink parent award report block reply noPTSDforMePlease -1 points 6 days ago Voting should only be: veterans, clergy, parents, land owners, business owners, and farmers. Basically only people who have either served their country or God, or those with a stake in the economy, or a stake in raising the next generation. No one else. permalink parent award report block reply Lol_Garrus 16 points 6 days ago Blacks are a fucking problem too. Nobody votes more as a monolith than them and they vote to further the destruction of our civilization because all they care about is gibs. Repatriations! permalink award report block reply Appeal2Heaven98 11 points 6 days ago If it hurts the white man, they'll do it. permalink parent award report block reply berserkerbarrage 16 points 6 days ago It's been impossible to deny since the 1960s. We're now at the point where they don't even bother to deny it anymore which means that we've already reached the point of no return. That's why I don't care about the deficit and whatnot lol. I don't give a shit how much debt Pedro inherits. I hope that he drowns in it. permalink award report block reply ReleasetheList 10 points 6 days ago That's the thing about gloablist shitbags. They'll move from ethnic group to ethnic group, pitting them against each other by mixing them together and shaking the jar, sucking them dry and then moving onto the next ethnic groups they can cause friction between. permalink parent award report block reply Prussian_Pepe 4 points 6 days ago Someone gets the grift. permalink parent award report block reply MegoThor 15 points 6 days ago The Founding Fathers were correct about voting. permalink award report block reply MagaJay02 8 points 6 days ago We can say it is, sure. We can also say men aren't leading women. But our founders were right. If their ideals for voting were still in place, Trump would bs considered far too leftwing for a Democrat. permalink award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply ACActual 5 points 6 days ago NJ has a MASSIVE Illegal Aliens population.   Im talking entire big towns like Vineland Nj permalink award report block reply MidwestZoomer 5 points 6 days ago Rewrite the 19th permalink award report block reply womp-womp-twice 2 points 6 days ago Rewrite is a new one! What should it say then? permalink parent award report block reply MidwestZoomer 4 points 6 days ago I would rewrite it to apply to everyone. You have to sign up for the draft (which would be made optional to filter out people), or be a parent (in a prove-able long term committed relationship with the other parent). Easily just filtered out 50% of the problems. permalink parent award report block reply fasterthanspeedofdum 1 points 6 days ago It should say women can never vote. Ever. permalink parent award report block reply Flowers-By-Irene 2 points 6 days ago They're all on crack, fentanyl, and fake news over there. permalink award report block reply try4gain PRO 2 points 6 days ago win them over dont trash talk them permalink award report block reply TD_Covfefe_Crusader 2 points 6 days ago Add that to the long list of facts that no one wants to talk about or acknowledge. permalink award report block reply PM-Melania-feet-pics 1 points 5 days ago End the 19th and the Hart-Celler Act permalink award report block reply Easzq8 1 points 6 days ago That’s the only way to maintain a constitutional republic, only people who are qualified should have the right to vote. permalink award report block reply knnbccb 1 points 6 days ago Women vote for their fee fees and are more inclined to vote for the incumbent because of 'muh security'. It's the same anywhere in the world. Justin Trudeau got into power precisely because he was 'handsome' and received plenty of female Canuck votes based solely on that. permalink award report block reply ItsUsvstheelite 1 points 6 days ago Whats crazy is these globohomo dems destroying the country for power will eventually be overthrown by the same people they're using to keep them in power. permalink award report block reply AmericanJawa 1 points 6 days ago Moreso than the 17th? permalink award report block reply fasterthanspeedofdum 0 points 6 days ago The USA would be better off dialing it back to just the Bill of Rights. permalink parent award report block reply GreyKnight 0 points 6 days ago Modern politics of pandering and buying votes is all pretty bad, but women are narcissistically self destructive with Stockholm’s Syndrome… permalink award report block reply Tacitus1963 0 points 6 days ago As well as the 19th being a scourge, so also in the unabated illegal alien flood into our country.\nThe rot started when Ted Kennedy et al got the Hart-Cellar Act passed in 1965 which opened the US to non-whites.\nA majority of the illegal hordes and minorities in general vote for the Demtards who offer free stuff. Many of these people despise our country and white population.\nThe Demtards would not have opened the border for 4 years nor have championed illegals if they did not support them come election time.\nWe have illegals voting in blue states. However, many of those who are minorities and are legally here, vote blue as well.\nThe bottom line is that we now have generations of people living here who do not share our values, culture, history, etc.\nThe only way we can try to stop the rot is by deporting most of the illegals. Erik Prince had a plan he presented to Trump to take care of the problem for $25 Billion. I wish our president had considered it.\nWe need to stop giving federal monies to all the Demtard states which are not following federal law re ICE, illegal alien criminals, etc.\nWe need a moratorium on all immigration for at least 10 years.\nNo more H-1 Bs. We don't need the Indian sub-continent moving here. Other than Dinesh D'Souza, most of the Indians are Demtards. permalink award report block reply chargebeck23 -7 points 6 days ago The party that wanted to be all about white christian men has suddenly discovered that there aren't enough white christian men to vote for them. Probably shoulda thought that one through permalink award report block reply Neo2025 -3 points 6 days ago Don't confuse some useless assholes, bots, and incels as the GOP Party. You don't hear any real talk on this subject outside of the morons who post on this forum. permalink parent award report block reply 1_Badcop 1 points 6 days ago Nope, the GOP is worse than assholes, bots, and incels. permalink parent award report block reply EyesSewnShut 1 points 6 days ago Comment removed by community moderators. permalink award report block reply AlmostFullyDilated 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply\nloooooof 43 points 6 days ago Yup... The Nineteenth Amendment is a scourge. permalink award report block reply cereal_killer 33 points 6 days ago I'd argue that the deathblow was actually \"fertility\" tech. American women got the vote and then remained more or less hardline for 40 years. It wasn't until the mass introduction of cheap, reliable, and readily accessible birth control that they truly went off the rails. If women were still forced to live with the consequences of their actions today, I'd bet you'd find them lining up to vote for the right. permalink parent award report block reply loooooof 30 points 6 days ago Thus, why allowing them to vote was always a mistake. permalink parent award report block reply cereal_killer 12 points 6 days ago Yeah. I agree. It certainly didn't do America any favors. permalink parent award report block reply PM-Melania-feet-pics 2 points 5 days ago Some 68% of women voters said abortion was their priority?  They don't care if society collapses as long as their babies die in it too.  Horrific. permalink parent award report block reply terribletwos 8 points 6 days ago Every problem can be traced back to birth control and abortions. All of our other problems are symptoms. permalink parent award report block reply dr_gonzo 9 points 6 days ago That's not so. The Federal Reserve is one of our biggest problems, yet it was imposed long before abortions became legal or birth control existed. Ditto the progressive income tax, Social Security, the Administrative Procedure Act that created our regulatory state and many other problems. Those things are the foundation. Abortion and birth control are the symptoms. Our side really needs to come to the realization that 90% of politics is ECONOMICS. The economic policies create the social problems, not the other way around. That's why Lenin himself said 90% of communizing a country was the establishment of a central bank. It's what they use to manipulate society to their will, especially when used in conjunction with a progressive income tax. A return to economic liberty will bring back sanity in our society. permalink parent award report block reply RedEnsign4Trump 3 points 6 days ago Those two things are also a symptom. Every problem can in turn be traced to a decline in faith and Christianity. Same reason for all the decline both in US and the broader West (Christendom) permalink parent award report block reply terribletwos 2 points 6 days ago They're a large contributing factor to the decline of Christianity. You get the ability for women to be whores without responsibility in the 60s that leads to the major decline in Christianity. Top that off with the civil war creating a weak generation that travels throughout the century and you silent generation before the boomers and gen x after. So you get an entire generation whose defining character is free love and anti-Christian and due to their size versus the other generations, they become the defacto reality for the US for 60+ years. permalink parent award report block reply Floppybutthole 2 points 6 days ago This may be true.  But I would also argue higher education too.   Though it wouldn't have been as big of a deal if they didn't have the pill. permalink parent award report block reply cereal_killer 2 points 6 days ago Right. Women generally want to have sex and children in their late teens. They are only able to go to college by postponing that, so very few women would go to college if they couldn't. Give them the Pill or a Plan B or some abortion clinic though, and they can do whatever they want until it's too late. Birth control and women in college are correlated. permalink parent award report block reply PM-Melania-feet-pics 2 points 5 days ago And then you get liberal arts majors. permalink parent award report block reply fasterthanspeedofdum 2 points 6 days ago 40 years? This has a been a downfall of mankind since Garden of Eden. permalink parent award report block reply cereal_killer 2 points 6 days ago White women, the real White man's burden. permalink parent award report block reply 1_Badcop 3 points 6 days ago Repeal the 19th permalink parent award report block reply Bigdeal 3 points 6 days ago And letting in anyone to the country that is not from Europe. There was a reason the forefather had voting set only for White land owning males. permalink parent award report block reply CheekyHawk 3 points 6 days ago Wonder if there is a foreign interest group that has been engineering women’s lib, multi-culturalism, Marxism, communism, racism, and the rest… wonder who it could be! permalink parent award report block reply\ncereal_killer 33 points 6 days ago I'd argue that the deathblow was actually \"fertility\" tech. American women got the vote and then remained more or less hardline for 40 years. It wasn't until the mass introduction of cheap, reliable, and readily accessible birth control that they truly went off the rails. If women were still forced to live with the consequences of their actions today, I'd bet you'd find them lining up to vote for the right. permalink parent award report block reply loooooof 30 points 6 days ago Thus, why allowing them to vote was always a mistake. permalink parent award report block reply cereal_killer 12 points 6 days ago Yeah. I agree. It certainly didn't do America any favors. permalink parent award report block reply PM-Melania-feet-pics 2 points 5 days ago Some 68% of women voters said abortion was their priority?  They don't care if society collapses as long as their babies die in it too.  Horrific. permalink parent award report block reply terribletwos 8 points 6 days ago Every problem can be traced back to birth control and abortions. All of our other problems are symptoms. permalink parent award report block reply dr_gonzo 9 points 6 days ago That's not so. The Federal Reserve is one of our biggest problems, yet it was imposed long before abortions became legal or birth control existed. Ditto the progressive income tax, Social Security, the Administrative Procedure Act that created our regulatory state and many other problems. Those things are the foundation. Abortion and birth control are the symptoms. Our side really needs to come to the realization that 90% of politics is ECONOMICS. The economic policies create the social problems, not the other way around. That's why Lenin himself said 90% of communizing a country was the establishment of a central bank. It's what they use to manipulate society to their will, especially when used in conjunction with a progressive income tax. A return to economic liberty will bring back sanity in our society. permalink parent award report block reply RedEnsign4Trump 3 points 6 days ago Those two things are also a symptom. Every problem can in turn be traced to a decline in faith and Christianity. Same reason for all the decline both in US and the broader West (Christendom) permalink parent award report block reply terribletwos 2 points 6 days ago They're a large contributing factor to the decline of Christianity. You get the ability for women to be whores without responsibility in the 60s that leads to the major decline in Christianity. Top that off with the civil war creating a weak generation that travels throughout the century and you silent generation before the boomers and gen x after. So you get an entire generation whose defining character is free love and anti-Christian and due to their size versus the other generations, they become the defacto reality for the US for 60+ years. permalink parent award report block reply Floppybutthole 2 points 6 days ago This may be true.  But I would also argue higher education too.   Though it wouldn't have been as big of a deal if they didn't have the pill. permalink parent award report block reply cereal_killer 2 points 6 days ago Right. Women generally want to have sex and children in their late teens. They are only able to go to college by postponing that, so very few women would go to college if they couldn't. Give them the Pill or a Plan B or some abortion clinic though, and they can do whatever they want until it's too late. Birth control and women in college are correlated. permalink parent award report block reply PM-Melania-feet-pics 2 points 5 days ago And then you get liberal arts majors. permalink parent award report block reply fasterthanspeedofdum 2 points 6 days ago 40 years? This has a been a downfall of mankind since Garden of Eden. permalink parent award report block reply cereal_killer 2 points 6 days ago White women, the real White man's burden. permalink parent award report block reply\nloooooof 30 points 6 days ago Thus, why allowing them to vote was always a mistake. permalink parent award report block reply cereal_killer 12 points 6 days ago Yeah. I agree. It certainly didn't do America any favors. permalink parent award report block reply PM-Melania-feet-pics 2 points 5 days ago Some 68% of women voters said abortion was their priority?  They don't care if society collapses as long as their babies die in it too.  Horrific. permalink parent award report block reply\ncereal_killer 12 points 6 days ago Yeah. I agree. It certainly didn't do America any favors. permalink parent award report block reply\nPM-Melania-feet-pics 2 points 5 days ago Some 68% of women voters said abortion was their priority?  They don't care if society collapses as long as their babies die in it too.  Horrific. permalink parent award report block reply\nterribletwos 8 points 6 days ago Every problem can be traced back to birth control and abortions. All of our other problems are symptoms. permalink parent award report block reply dr_gonzo 9 points 6 days ago That's not so. The Federal Reserve is one of our biggest problems, yet it was imposed long before abortions became legal or birth control existed. Ditto the progressive income tax, Social Security, the Administrative Procedure Act that created our regulatory state and many other problems. Those things are the foundation. Abortion and birth control are the symptoms. Our side really needs to come to the realization that 90% of politics is ECONOMICS. The economic policies create the social problems, not the other way around. That's why Lenin himself said 90% of communizing a country was the establishment of a central bank. It's what they use to manipulate society to their will, especially when used in conjunction with a progressive income tax. A return to economic liberty will bring back sanity in our society. permalink parent award report block reply RedEnsign4Trump 3 points 6 days ago Those two things are also a symptom. Every problem can in turn be traced to a decline in faith and Christianity. Same reason for all the decline both in US and the broader West (Christendom) permalink parent award report block reply terribletwos 2 points 6 days ago They're a large contributing factor to the decline of Christianity. You get the ability for women to be whores without responsibility in the 60s that leads to the major decline in Christianity. Top that off with the civil war creating a weak generation that travels throughout the century and you silent generation before the boomers and gen x after. So you get an entire generation whose defining character is free love and anti-Christian and due to their size versus the other generations, they become the defacto reality for the US for 60+ years. permalink parent award report block reply\ndr_gonzo 9 points 6 days ago That's not so. The Federal Reserve is one of our biggest problems, yet it was imposed long before abortions became legal or birth control existed. Ditto the progressive income tax, Social Security, the Administrative Procedure Act that created our regulatory state and many other problems. Those things are the foundation. Abortion and birth control are the symptoms. Our side really needs to come to the realization that 90% of politics is ECONOMICS. The economic policies create the social problems, not the other way around. That's why Lenin himself said 90% of communizing a country was the establishment of a central bank. It's what they use to manipulate society to their will, especially when used in conjunction with a progressive income tax. A return to economic liberty will bring back sanity in our society. permalink parent award report block reply\nRedEnsign4Trump 3 points 6 days ago Those two things are also a symptom. Every problem can in turn be traced to a decline in faith and Christianity. Same reason for all the decline both in US and the broader West (Christendom) permalink parent award report block reply terribletwos 2 points 6 days ago They're a large contributing factor to the decline of Christianity. You get the ability for women to be whores without responsibility in the 60s that leads to the major decline in Christianity. Top that off with the civil war creating a weak generation that travels throughout the century and you silent generation before the boomers and gen x after. So you get an entire generation whose defining character is free love and anti-Christian and due to their size versus the other generations, they become the defacto reality for the US for 60+ years. permalink parent award report block reply\nterribletwos 2 points 6 days ago They're a large contributing factor to the decline of Christianity. You get the ability for women to be whores without responsibility in the 60s that leads to the major decline in Christianity. Top that off with the civil war creating a weak generation that travels throughout the century and you silent generation before the boomers and gen x after. So you get an entire generation whose defining character is free love and anti-Christian and due to their size versus the other generations, they become the defacto reality for the US for 60+ years. permalink parent award report block reply\nFloppybutthole 2 points 6 days ago This may be true.  But I would also argue higher education too.   Though it wouldn't have been as big of a deal if they didn't have the pill. permalink parent award report block reply cereal_killer 2 points 6 days ago Right. Women generally want to have sex and children in their late teens. They are only able to go to college by postponing that, so very few women would go to college if they couldn't. Give them the Pill or a Plan B or some abortion clinic though, and they can do whatever they want until it's too late. Birth control and women in college are correlated. permalink parent award report block reply PM-Melania-feet-pics 2 points 5 days ago And then you get liberal arts majors. permalink parent award report block reply\ncereal_killer 2 points 6 days ago Right. Women generally want to have sex and children in their late teens. They are only able to go to college by postponing that, so very few women would go to college if they couldn't. Give them the Pill or a Plan B or some abortion clinic though, and they can do whatever they want until it's too late. Birth control and women in college are correlated. permalink parent award report block reply PM-Melania-feet-pics 2 points 5 days ago And then you get liberal arts majors. permalink parent award report block reply\nPM-Melania-feet-pics 2 points 5 days ago And then you get liberal arts majors. permalink parent award report block reply\nfasterthanspeedofdum 2 points 6 days ago 40 years? This has a been a downfall of mankind since Garden of Eden. permalink parent award report block reply cereal_killer 2 points 6 days ago White women, the real White man's burden. permalink parent award report block reply\ncereal_killer 2 points 6 days ago White women, the real White man's burden. permalink parent award report block reply\n1_Badcop 3 points 6 days ago Repeal the 19th permalink parent award report block reply\nBigdeal 3 points 6 days ago And letting in anyone to the country that is not from Europe. There was a reason the forefather had voting set only for White land owning males. permalink parent award report block reply\nCheekyHawk 3 points 6 days ago Wonder if there is a foreign interest group that has been engineering women’s lib, multi-culturalism, Marxism, communism, racism, and the rest… wonder who it could be! permalink parent award report block reply\nReleasetheList 29 points 6 days ago Women are a problem for sure, the GOP pandering to everyone but white people is also a problem. The only people that should be allowed to vote are net tax payers. permalink award report block reply Overkillengine 6 points 6 days ago I'd take it a step further and make voting and taxes linked to the point that if you don't want to vote, you don't pay taxes. Then the establishment can't keep playing the \"heads I win, tails you lose\" game they have been playing for generations with the illusion of choice in candidates and parties. Because if they do, the net producer bloc can just abstain from voting and forcibly defund the government. A fiscal Sword of Damocles that the public can whip out every single year, not just on election years for that matter. And yes, for those about to have a soy-stroke, the threat of massive instability in the government is THE FUCKING POINT. permalink parent award report block reply Nerdrem3 1 points 6 days ago It kinda reminds me of Marvel, their movies were a money printing machine for a while but then they started pandering thinking they could get an even bigger audience and more profit but when they did that they lost more of their core audience than they gained in new viewers and now they're in a steep decline that's probably irreversible at this point. permalink parent award report block reply noPTSDforMePlease -1 points 6 days ago Voting should only be: veterans, clergy, parents, land owners, business owners, and farmers. Basically only people who have either served their country or God, or those with a stake in the economy, or a stake in raising the next generation. No one else. permalink parent award report block reply\nOverkillengine 6 points 6 days ago I'd take it a step further and make voting and taxes linked to the point that if you don't want to vote, you don't pay taxes. Then the establishment can't keep playing the \"heads I win, tails you lose\" game they have been playing for generations with the illusion of choice in candidates and parties. Because if they do, the net producer bloc can just abstain from voting and forcibly defund the government. A fiscal Sword of Damocles that the public can whip out every single year, not just on election years for that matter. And yes, for those about to have a soy-stroke, the threat of massive instability in the government is THE FUCKING POINT. permalink parent award report block reply\nNerdrem3 1 points 6 days ago It kinda reminds me of Marvel, their movies were a money printing machine for a while but then they started pandering thinking they could get an even bigger audience and more profit but when they did that they lost more of their core audience than they gained in new viewers and now they're in a steep decline that's probably irreversible at this point. permalink parent award report block reply\nnoPTSDforMePlease -1 points 6 days ago Voting should only be: veterans, clergy, parents, land owners, business owners, and farmers. Basically only people who have either served their country or God, or those with a stake in the economy, or a stake in raising the next generation. No one else. permalink parent award report block reply\nLol_Garrus 16 points 6 days ago Blacks are a fucking problem too. Nobody votes more as a monolith than them and they vote to further the destruction of our civilization because all they care about is gibs. Repatriations! permalink award report block reply Appeal2Heaven98 11 points 6 days ago If it hurts the white man, they'll do it. permalink parent award report block reply\nAppeal2Heaven98 11 points 6 days ago If it hurts the white man, they'll do it. permalink parent award report block reply\nberserkerbarrage 16 points 6 days ago It's been impossible to deny since the 1960s. We're now at the point where they don't even bother to deny it anymore which means that we've already reached the point of no return. That's why I don't care about the deficit and whatnot lol. I don't give a shit how much debt Pedro inherits. I hope that he drowns in it. permalink award report block reply ReleasetheList 10 points 6 days ago That's the thing about gloablist shitbags. They'll move from ethnic group to ethnic group, pitting them against each other by mixing them together and shaking the jar, sucking them dry and then moving onto the next ethnic groups they can cause friction between. permalink parent award report block reply Prussian_Pepe 4 points 6 days ago Someone gets the grift. permalink parent award report block reply\nReleasetheList 10 points 6 days ago That's the thing about gloablist shitbags. They'll move from ethnic group to ethnic group, pitting them against each other by mixing them together and shaking the jar, sucking them dry and then moving onto the next ethnic groups they can cause friction between. permalink parent award report block reply Prussian_Pepe 4 points 6 days ago Someone gets the grift. permalink parent award report block reply\nPrussian_Pepe 4 points 6 days ago Someone gets the grift. permalink parent award report block reply\nMegoThor 15 points 6 days ago The Founding Fathers were correct about voting. permalink award report block reply\nMagaJay02 8 points 6 days ago We can say it is, sure. We can also say men aren't leading women. But our founders were right. If their ideals for voting were still in place, Trump would bs considered far too leftwing for a Democrat. permalink award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nnewdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nACActual 5 points 6 days ago NJ has a MASSIVE Illegal Aliens population.   Im talking entire big towns like Vineland Nj permalink award report block reply\nMidwestZoomer 5 points 6 days ago Rewrite the 19th permalink award report block reply womp-womp-twice 2 points 6 days ago Rewrite is a new one! What should it say then? permalink parent award report block reply MidwestZoomer 4 points 6 days ago I would rewrite it to apply to everyone. You have to sign up for the draft (which would be made optional to filter out people), or be a parent (in a prove-able long term committed relationship with the other parent). Easily just filtered out 50% of the problems. permalink parent award report block reply fasterthanspeedofdum 1 points 6 days ago It should say women can never vote. Ever. permalink parent award report block reply\nwomp-womp-twice 2 points 6 days ago Rewrite is a new one! What should it say then? permalink parent award report block reply MidwestZoomer 4 points 6 days ago I would rewrite it to apply to everyone. You have to sign up for the draft (which would be made optional to filter out people), or be a parent (in a prove-able long term committed relationship with the other parent). Easily just filtered out 50% of the problems. permalink parent award report block reply fasterthanspeedofdum 1 points 6 days ago It should say women can never vote. Ever. permalink parent award report block reply\nMidwestZoomer 4 points 6 days ago I would rewrite it to apply to everyone. You have to sign up for the draft (which would be made optional to filter out people), or be a parent (in a prove-able long term committed relationship with the other parent). Easily just filtered out 50% of the problems. permalink parent award report block reply\nfasterthanspeedofdum 1 points 6 days ago It should say women can never vote. Ever. permalink parent award report block reply\nFlowers-By-Irene 2 points 6 days ago They're all on crack, fentanyl, and fake news over there. permalink award report block reply\ntry4gain PRO 2 points 6 days ago win them over dont trash talk them permalink award report block reply\nTD_Covfefe_Crusader 2 points 6 days ago Add that to the long list of facts that no one wants to talk about or acknowledge. permalink award report block reply\nPM-Melania-feet-pics 1 points 5 days ago End the 19th and the Hart-Celler Act permalink award report block reply\nEaszq8 1 points 6 days ago That’s the only way to maintain a constitutional republic, only people who are qualified should have the right to vote. permalink award report block reply\nknnbccb 1 points 6 days ago Women vote for their fee fees and are more inclined to vote for the incumbent because of 'muh security'. It's the same anywhere in the world. Justin Trudeau got into power precisely because he was 'handsome' and received plenty of female Canuck votes based solely on that. permalink award report block reply\nItsUsvstheelite 1 points 6 days ago Whats crazy is these globohomo dems destroying the country for power will eventually be overthrown by the same people they're using to keep them in power. permalink award report block reply\nAmericanJawa 1 points 6 days ago Moreso than the 17th? permalink award report block reply fasterthanspeedofdum 0 points 6 days ago The USA would be better off dialing it back to just the Bill of Rights. permalink parent award report block reply\nfasterthanspeedofdum 0 points 6 days ago The USA would be better off dialing it back to just the Bill of Rights. permalink parent award report block reply\nGreyKnight 0 points 6 days ago Modern politics of pandering and buying votes is all pretty bad, but women are narcissistically self destructive with Stockholm’s Syndrome… permalink award report block reply\nTacitus1963 0 points 6 days ago As well as the 19th being a scourge, so also in the unabated illegal alien flood into our country.\nNo more H-1 Bs. We don't need the Indian sub-continent moving here. Other than Dinesh D'Souza, most of the Indians are Demtards. permalink award report block reply\nchargebeck23 -7 points 6 days ago The party that wanted to be all about white christian men has suddenly discovered that there aren't enough white christian men to vote for them. Probably shoulda thought that one through permalink award report block reply Neo2025 -3 points 6 days ago Don't confuse some useless assholes, bots, and incels as the GOP Party. You don't hear any real talk on this subject outside of the morons who post on this forum. permalink parent award report block reply 1_Badcop 1 points 6 days ago Nope, the GOP is worse than assholes, bots, and incels. permalink parent award report block reply\nNeo2025 -3 points 6 days ago Don't confuse some useless assholes, bots, and incels as the GOP Party. You don't hear any real talk on this subject outside of the morons who post on this forum. permalink parent award report block reply 1_Badcop 1 points 6 days ago Nope, the GOP is worse than assholes, bots, and incels. permalink parent award report block reply\n1_Badcop 1 points 6 days ago Nope, the GOP is worse than assholes, bots, and incels. permalink parent award report block reply\nEyesSewnShut 1 points 6 days ago Comment removed by community moderators. permalink award report block reply\nAlmostFullyDilated 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply"}