{"id": "1ARK9pghYD", "contents": "9 In the feels... posted 35 minutes ago by blue5707 7 comments award share report block Mr PitBull @MrPitbull07 • 24h \"I’m 79. My name’s Agnes. I walk to Oakwood Elementary every Tuesday and Thursday at 2:45 p.m. Not for my grandkids, I don’t have any. I go for them. The kids waiting for parents who are late. Again. It started three years ago. I saw Miguel sitting alone on the school’s concrete\n7 comments Sort by Top Top New Worst Old Save NadlersNads 4 points 23 minutes ago Why does migel have a shirt with migel screenprinted on it? Super gay permalink award report block reply cpyder 4 points 14 minutes ago Ai generated? permalink parent award report block reply FusionBlack 2 points 12 minutes ago Its as real as a Mexican CDL. permalink parent award report block reply Wizard_Glick 3 points 32 minutes ago How doe she keep her paper dry? permalink award report block reply FreedomFlowerDelta 2 points 31 minutes ago Fake and gay permalink award report block reply Cocopepe 1 points 8 minutes ago Agnes shares true wealth. permalink award report block reply linthat22 1 points 26 minutes ago Migel, miguel, lol Shit has to be ai right? permalink award report block reply\nNadlersNads 4 points 23 minutes ago Why does migel have a shirt with migel screenprinted on it? Super gay permalink award report block reply cpyder 4 points 14 minutes ago Ai generated? permalink parent award report block reply FusionBlack 2 points 12 minutes ago Its as real as a Mexican CDL. permalink parent award report block reply\ncpyder 4 points 14 minutes ago Ai generated? permalink parent award report block reply FusionBlack 2 points 12 minutes ago Its as real as a Mexican CDL. permalink parent award report block reply\nFusionBlack 2 points 12 minutes ago Its as real as a Mexican CDL. permalink parent award report block reply\nWizard_Glick 3 points 32 minutes ago How doe she keep her paper dry? permalink award report block reply\nFreedomFlowerDelta 2 points 31 minutes ago Fake and gay permalink award report block reply\nCocopepe 1 points 8 minutes ago Agnes shares true wealth. permalink award report block reply\nlinthat22 1 points 26 minutes ago Migel, miguel, lol Shit has to be ai right? permalink award report block reply"}