{"id": "1ARK53LTHy", "contents": "921 Brought to you by the letters U, S, and A. posted 6 days ago by TinfoilHardhat 70 comments award share download report block\n70 comments Sort by Top Top New Worst Old Save Purple_Drank 33 points 6 days ago AH AH AH AH (in my best The Count laughter)😂 permalink award report block reply Svaap 3 points 5 days ago Wow Count von Count!!  I haven't seen that dude in 50 years, ROFL!  Someone should meme Mr. Owl from the Tootsie Pop commercials next... permalink parent award report block reply Doomer_Guy 2 points 5 days ago \"He's sunk sixteen boats!\" permalink parent award report block reply TinfoilHardhat OP 3 points 5 days ago +1 last night permalink parent award report block reply Raetchel 23 points 6 days ago you'd think they'd learn after the first two or three permalink award report block reply whataboob 15 points 6 days ago Do you know how drug cartels work? I don’t, but I assume violence is involved and they’re not necessarily doing this completely voluntarily. If they’re even drug boats or in a drug cartel, cuz since we never apprehended the humans, who really knows who was killed. permalink parent award report block reply Raetchel 17 points 6 days ago drug smugglers were killed all i need to know permalink parent award report block reply Andover 5 points 6 days ago Why would you trust anything the Deep State Pentagon says? Lindsey Graham is dancing and clapping his hands about this. Doesn't that make you question? Haven't you learned anything??? permalink parent award report block reply grad16uc 4 points 6 days ago \"Why don't we just blow it up?\" the uniparty, since forever permalink parent award report block reply KernalMustard 1 points 5 days ago Its because at some point it wont be a drug boat. They will put a decoy out with \"bodies\".  It will be street people nobody will miss and there will be indignation. 2 things will happen war is declared or we back off permalink parent award report block reply view 2 more comments... Aggrieved03 2 points 5 days ago Who's the largest drug smuggling organization in the world? I'll give you a hint, their offices are in Langley. permalink parent award report block reply Raetchel 1 points 5 days ago that's why they big mad permalink parent award report block reply whataboob -1 points 6 days ago How do you know though? How does anyone? How do we know they weren’t child smugglers? How do we know there weren’t Americans on board? How did we know they were guilty before our desperate empire killed them? Isn’t this a basic, classic case of why the concept of due process exists? permalink parent award report block reply MrGrayson 2 points 6 days ago I think you are what they call a \"bleeding heart\". permalink parent award report block reply view 1 more comments... Spicy_cat 2 points 5 days ago Yes of course foreign enemies in a war always have to be captured alive and given fair trials.  It's never appropriate to use lethal force during a defensive war. permalink parent award report block reply view 2 more comments... Shitsbrokeyo 10 points 5 days ago Career Coast Guard here. We know. Don't take the retard left approach just because you have TDS, spitting out sound bites you heard in the media or found on the internet. You're embarrassing yourself. It's called Intel.  Spies, eyes etc. Traffic patterns, tracking and monitoring, times, locations, personnel, associates, double agents, shared intel, informants,  ship design, ship purpose.  We know. The only difference now is, we aren't wasting our time with the judicial process, which is screwy with foriegn born judges and their obviously tainted opinions. permalink parent award report block reply ActNow 2 points 5 days ago Thank you for the work you do. Just wondering. Have you ever apprehended someone who was a mule? permalink parent award report block reply Shitsbrokeyo 2 points 5 days ago Personally no. Although I dealt with plenty working in a Arizona border jail before the CG. permalink parent award report block reply whataboob 1 points 5 days ago It's called Intel. Spies, eyes etc. Traffic patterns, tracking and monitoring, times, locations, personnel, associates, double agents, shared intel, informants, ship design, ship purpose Are those items you mentioned enough for the federal government to identify a person before killing them from a distance? So, since we know, then who?  Who did the federal government kill?  Is there a list of names? permalink parent award report block reply Shitsbrokeyo 1 points 5 days ago Ask your lord and savior 0bama, he knowingly droned Americans. permalink parent award report block reply view 3 more comments... aaafirefly123 0 points 5 days ago If the person is a foreigner, I don’t care if the government kills them extrajudicially. I’ll care when it happens to U.S. citizens like it did under Obama. permalink parent award report block reply view 1 more comments... Aggrieved03 2 points 5 days ago Who's marking the targets? I'd guess CIA who are the largest cartel in the world already. permalink parent award report block reply UltraFrogMan 1 points 6 days ago We apprehended a few permalink parent award report block reply namedaccount33 0 points 5 days ago You don't think they have satellite tracking of the entire operation from start to finish? permalink parent award report block reply whataboob 1 points 5 days ago Is satellite tracking enough to identify a person before the federal government kills them? permalink parent award report block reply namedaccount33 1 points 2 days ago They can identify their behavior. And if you are unflagged in international waters you have to stop for any Flagged sovereign that demands it. So if they have clear smuggling behavior. Then don't stop when required to they are allowed to be stopped by any means up to killing them. permalink parent award report block reply view 1 more comments... load 1 more comments... Bullet3250 4 points 6 days ago Acceptable loses... they know they will always lose a few trucks /boats... it's a cost of doing business. ;\\ permalink parent award report block reply ActNow 2 points 5 days ago So, I have to wonder. If we blew up 17, how many may have got through? permalink parent award report block reply DonsChair 15 points 6 days ago Imagine all the lives saved. We've had the greatest military in the world for decades. Yet, you're going to tell me that we couldn't detect and deal with vessels transporting illegal narcotics to our shores prior to 2025? Maybe all we really needed was a new president. permalink award report block reply AlmostFullyDilated -1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply Meister_Bockmist 14 points 6 days ago 🎵 99 boats full of drugs on the sea, 99 boats full of drugs, You bomb it around and run it aground, 98 boats full of drugs... 🎶 permalink award report block reply Mortal_Wombat 9 points 6 days ago 98 boats full of drugs on the sea, 98 boats full of drugs, drop a few bombs, make some phone calls to moms, 97 boats full of drugs on the sea... permalink parent award report block reply Washington_Redskins 8 points 6 days ago 97 boats full of drugs on the sea, 97 boats full of drugs.. Missile inbound, that boat's going down. 97 boats full of drugs on the sea. permalink parent award report block reply Frenchie619 3 points 5 days ago 96 boats full of drugs on the sea, 96 boats full of drugs.. you sink them now,  they still try anyhow,  96 boats full of drugs in the sea. permalink parent award report block reply ActNow 2 points 5 days ago 🎵 95 boats full of drugs on the sea, 95 boats full of drugs...blown to bits, they sink down, CIA has a frown, 94 boats full of drugs on the sea.🎵 permalink parent award report block reply BrewSwillis 8 points 5 days ago Wow! 17 boats, already? And I just heard some leftist, on a podcast that I listen to, spouting the leftist talking points that \"it's not even going to have that much of an effect, because that's not how most drugs make their way into the United States\". I would say 17 boats, in a couple months, is a fair amount of drugs to be taken off the streets. permalink award report block reply PearlyGaits57 1 points 5 days ago It's the LEFT. permalink parent award report block reply Bullet3250 5 points 6 days ago perhaps 1 to 2 tons of drugs per boat??... pure stuff... over 20 TONS of drugs - sent to sleep with the fishes. permalink award report block reply DeportThemAllForever 3 points 6 days ago Hunter Biden weekly supply permalink parent award report block reply ActNow 2 points 5 days ago If it's meth, the fish are WIDE awake. permalink parent award report block reply jsphere256 3 points 6 days ago Let us count how many airstrikes to sink the boat! ONE missile! ...TWO missiles! ... THREE missiles! ah ah ah ah permalink award report block reply DrTar 3 points 5 days ago I thought it was 15. As in this will be the 15th vote to reopen government. permalink award report block reply UltraFrogMan 3 points 6 days ago Based permalink award report block reply Beardholder 3 points 5 days ago Tomorrow is (0) . For there has been ( 0 ) arrests of traitors and corrupt politicians. permalink award report block reply bumpman 2 points 6 days ago Has anyone from Venezuela or wherever confirmed these boats are actually being blasted and given names/ details about who they are. Part of me thinks that a couple real boats got blown up but the rest are just ai or props being blasted to discourage actual drug boats. permalink award report block reply The_Emperor 2 points 5 days ago Yeah, that's stupid.  Let's go ask the Commies in charge of narco trafficking who fund their crime syndicate about whether they are real boats...instead of respecting GEOTUS, Hegseth  and the greatest military in History...the force for good that is the US Navy. permalink parent award report block reply ActNow 1 points 5 days ago Venezuela is not going to confirm anything. There's some general near the top running the drug operation, so it's safe to say a chain of command would allow him to know they are real or not. If \"AI boats\" were used, they would only propagandize Americans, so not likely. permalink parent award report block reply Frenchie619 2 points 5 days ago Had it been that many already?  Damn,  I must have missed a few.  By my count (ah ah ah), I've believe that I've only read about 9 or 10 that I'm aware of. Someone's working overtime. permalink award report block reply ActNow 1 points 5 days ago We've probably only been shown the highlight reel of the best explosions. permalink parent award report block reply someguy7738 2 points 5 days ago Those are rookie numbers. permalink award report block reply Mungo 2 points 5 days ago Q permalink award report block reply BrionK 2 points 6 days ago Not enough Vance. If you love your mom you'll kill the drug lords that hurt your family....kill thelm all Vance, or eat shit. permalink award report block reply SqRt7744 1 points 5 days ago This is great, makes my daily life so much better and now there's no drugs or homeless in my neighborhood anymore. I'm so glad we're spending millions to kill people and sink speedboats off the coast of another continent. permalink award report block reply Calumet57 1 points 5 days ago Is this a Q post? permalink award report block reply TDW4CBD -9 points 6 days ago Ehr mehr gehrd! 17 boats! Q predicted that this would happen! TrUsT tHe PlAn! permalink award report block reply Pongpagongbatibot 3 points 6 days ago Groypers must be banned from this site. Most of them aren't even Americans but Iranian trolls. I've seen the damage they done in stormfront. \"White nationalist\" are now fans of Greta because she stood up against the joos. They also love Hamas, Iran, and basically Islam because they oppose the joos. Their mantra there is the enemy of my enemy is my friend. And they hate Trump, even though Trump stands up against western invasion of immigrants and islamization. To them, Trump is the friend of their enemy. They don't care that Islam is the one invading white countries. Islam is their friend because the main enemy is the joos. This groyper mentality is spreading now in PDW. Groypers are not for Trump. They must banned from PDW or else, this site will be controlled by Iranian trolls permalink parent award report block reply TDW4CBD 1 points 5 days ago Comment removed by community filter. permalink parent award report block reply PearlyGaits57 3 points 5 days ago Q, 🤣🤣🤣🤣!!! permalink parent award report block reply x79q3pb 2 points 6 days ago Needless division. permalink parent award report block reply\nPurple_Drank 33 points 6 days ago AH AH AH AH (in my best The Count laughter)😂 permalink award report block reply Svaap 3 points 5 days ago Wow Count von Count!!  I haven't seen that dude in 50 years, ROFL!  Someone should meme Mr. Owl from the Tootsie Pop commercials next... permalink parent award report block reply Doomer_Guy 2 points 5 days ago \"He's sunk sixteen boats!\" permalink parent award report block reply TinfoilHardhat OP 3 points 5 days ago +1 last night permalink parent award report block reply\nSvaap 3 points 5 days ago Wow Count von Count!!  I haven't seen that dude in 50 years, ROFL!  Someone should meme Mr. Owl from the Tootsie Pop commercials next... permalink parent award report block reply\nDoomer_Guy 2 points 5 days ago \"He's sunk sixteen boats!\" permalink parent award report block reply TinfoilHardhat OP 3 points 5 days ago +1 last night permalink parent award report block reply\nTinfoilHardhat OP 3 points 5 days ago +1 last night permalink parent award report block reply\nRaetchel 23 points 6 days ago you'd think they'd learn after the first two or three permalink award report block reply whataboob 15 points 6 days ago Do you know how drug cartels work? I don’t, but I assume violence is involved and they’re not necessarily doing this completely voluntarily. If they’re even drug boats or in a drug cartel, cuz since we never apprehended the humans, who really knows who was killed. permalink parent award report block reply Raetchel 17 points 6 days ago drug smugglers were killed all i need to know permalink parent award report block reply Andover 5 points 6 days ago Why would you trust anything the Deep State Pentagon says? Lindsey Graham is dancing and clapping his hands about this. Doesn't that make you question? Haven't you learned anything??? permalink parent award report block reply grad16uc 4 points 6 days ago \"Why don't we just blow it up?\" the uniparty, since forever permalink parent award report block reply KernalMustard 1 points 5 days ago Its because at some point it wont be a drug boat. They will put a decoy out with \"bodies\".  It will be street people nobody will miss and there will be indignation. 2 things will happen war is declared or we back off permalink parent award report block reply view 2 more comments... Aggrieved03 2 points 5 days ago Who's the largest drug smuggling organization in the world? I'll give you a hint, their offices are in Langley. permalink parent award report block reply Raetchel 1 points 5 days ago that's why they big mad permalink parent award report block reply whataboob -1 points 6 days ago How do you know though? How does anyone? How do we know they weren’t child smugglers? How do we know there weren’t Americans on board? How did we know they were guilty before our desperate empire killed them? Isn’t this a basic, classic case of why the concept of due process exists? permalink parent award report block reply MrGrayson 2 points 6 days ago I think you are what they call a \"bleeding heart\". permalink parent award report block reply view 1 more comments... Spicy_cat 2 points 5 days ago Yes of course foreign enemies in a war always have to be captured alive and given fair trials.  It's never appropriate to use lethal force during a defensive war. permalink parent award report block reply view 2 more comments... Shitsbrokeyo 10 points 5 days ago Career Coast Guard here. We know. Don't take the retard left approach just because you have TDS, spitting out sound bites you heard in the media or found on the internet. You're embarrassing yourself. It's called Intel.  Spies, eyes etc. Traffic patterns, tracking and monitoring, times, locations, personnel, associates, double agents, shared intel, informants,  ship design, ship purpose.  We know. The only difference now is, we aren't wasting our time with the judicial process, which is screwy with foriegn born judges and their obviously tainted opinions. permalink parent award report block reply ActNow 2 points 5 days ago Thank you for the work you do. Just wondering. Have you ever apprehended someone who was a mule? permalink parent award report block reply Shitsbrokeyo 2 points 5 days ago Personally no. Although I dealt with plenty working in a Arizona border jail before the CG. permalink parent award report block reply whataboob 1 points 5 days ago It's called Intel. Spies, eyes etc. Traffic patterns, tracking and monitoring, times, locations, personnel, associates, double agents, shared intel, informants, ship design, ship purpose Are those items you mentioned enough for the federal government to identify a person before killing them from a distance? So, since we know, then who?  Who did the federal government kill?  Is there a list of names? permalink parent award report block reply Shitsbrokeyo 1 points 5 days ago Ask your lord and savior 0bama, he knowingly droned Americans. permalink parent award report block reply view 3 more comments... aaafirefly123 0 points 5 days ago If the person is a foreigner, I don’t care if the government kills them extrajudicially. I’ll care when it happens to U.S. citizens like it did under Obama. permalink parent award report block reply view 1 more comments... Aggrieved03 2 points 5 days ago Who's marking the targets? I'd guess CIA who are the largest cartel in the world already. permalink parent award report block reply UltraFrogMan 1 points 6 days ago We apprehended a few permalink parent award report block reply namedaccount33 0 points 5 days ago You don't think they have satellite tracking of the entire operation from start to finish? permalink parent award report block reply whataboob 1 points 5 days ago Is satellite tracking enough to identify a person before the federal government kills them? permalink parent award report block reply namedaccount33 1 points 2 days ago They can identify their behavior. And if you are unflagged in international waters you have to stop for any Flagged sovereign that demands it. So if they have clear smuggling behavior. Then don't stop when required to they are allowed to be stopped by any means up to killing them. permalink parent award report block reply view 1 more comments... load 1 more comments... Bullet3250 4 points 6 days ago Acceptable loses... they know they will always lose a few trucks /boats... it's a cost of doing business. ;\\ permalink parent award report block reply ActNow 2 points 5 days ago So, I have to wonder. If we blew up 17, how many may have got through? permalink parent award report block reply\nwhataboob 15 points 6 days ago Do you know how drug cartels work? I don’t, but I assume violence is involved and they’re not necessarily doing this completely voluntarily. If they’re even drug boats or in a drug cartel, cuz since we never apprehended the humans, who really knows who was killed. permalink parent award report block reply Raetchel 17 points 6 days ago drug smugglers were killed all i need to know permalink parent award report block reply Andover 5 points 6 days ago Why would you trust anything the Deep State Pentagon says? Lindsey Graham is dancing and clapping his hands about this. Doesn't that make you question? Haven't you learned anything??? permalink parent award report block reply grad16uc 4 points 6 days ago \"Why don't we just blow it up?\" the uniparty, since forever permalink parent award report block reply KernalMustard 1 points 5 days ago Its because at some point it wont be a drug boat. They will put a decoy out with \"bodies\".  It will be street people nobody will miss and there will be indignation. 2 things will happen war is declared or we back off permalink parent award report block reply view 2 more comments... Aggrieved03 2 points 5 days ago Who's the largest drug smuggling organization in the world? I'll give you a hint, their offices are in Langley. permalink parent award report block reply Raetchel 1 points 5 days ago that's why they big mad permalink parent award report block reply whataboob -1 points 6 days ago How do you know though? How does anyone? How do we know they weren’t child smugglers? How do we know there weren’t Americans on board? How did we know they were guilty before our desperate empire killed them? Isn’t this a basic, classic case of why the concept of due process exists? permalink parent award report block reply MrGrayson 2 points 6 days ago I think you are what they call a \"bleeding heart\". permalink parent award report block reply view 1 more comments... Spicy_cat 2 points 5 days ago Yes of course foreign enemies in a war always have to be captured alive and given fair trials.  It's never appropriate to use lethal force during a defensive war. permalink parent award report block reply view 2 more comments... Shitsbrokeyo 10 points 5 days ago Career Coast Guard here. We know. Don't take the retard left approach just because you have TDS, spitting out sound bites you heard in the media or found on the internet. You're embarrassing yourself. It's called Intel.  Spies, eyes etc. Traffic patterns, tracking and monitoring, times, locations, personnel, associates, double agents, shared intel, informants,  ship design, ship purpose.  We know. The only difference now is, we aren't wasting our time with the judicial process, which is screwy with foriegn born judges and their obviously tainted opinions. permalink parent award report block reply ActNow 2 points 5 days ago Thank you for the work you do. Just wondering. Have you ever apprehended someone who was a mule? permalink parent award report block reply Shitsbrokeyo 2 points 5 days ago Personally no. Although I dealt with plenty working in a Arizona border jail before the CG. permalink parent award report block reply whataboob 1 points 5 days ago It's called Intel. Spies, eyes etc. Traffic patterns, tracking and monitoring, times, locations, personnel, associates, double agents, shared intel, informants, ship design, ship purpose Are those items you mentioned enough for the federal government to identify a person before killing them from a distance? So, since we know, then who?  Who did the federal government kill?  Is there a list of names? permalink parent award report block reply Shitsbrokeyo 1 points 5 days ago Ask your lord and savior 0bama, he knowingly droned Americans. permalink parent award report block reply view 3 more comments... aaafirefly123 0 points 5 days ago If the person is a foreigner, I don’t care if the government kills them extrajudicially. I’ll care when it happens to U.S. citizens like it did under Obama. permalink parent award report block reply view 1 more comments... Aggrieved03 2 points 5 days ago Who's marking the targets? I'd guess CIA who are the largest cartel in the world already. permalink parent award report block reply UltraFrogMan 1 points 6 days ago We apprehended a few permalink parent award report block reply namedaccount33 0 points 5 days ago You don't think they have satellite tracking of the entire operation from start to finish? permalink parent award report block reply whataboob 1 points 5 days ago Is satellite tracking enough to identify a person before the federal government kills them? permalink parent award report block reply namedaccount33 1 points 2 days ago They can identify their behavior. And if you are unflagged in international waters you have to stop for any Flagged sovereign that demands it. So if they have clear smuggling behavior. Then don't stop when required to they are allowed to be stopped by any means up to killing them. permalink parent award report block reply view 1 more comments... load 1 more comments...\nRaetchel 17 points 6 days ago drug smugglers were killed all i need to know permalink parent award report block reply Andover 5 points 6 days ago Why would you trust anything the Deep State Pentagon says? Lindsey Graham is dancing and clapping his hands about this. Doesn't that make you question? Haven't you learned anything??? permalink parent award report block reply grad16uc 4 points 6 days ago \"Why don't we just blow it up?\" the uniparty, since forever permalink parent award report block reply KernalMustard 1 points 5 days ago Its because at some point it wont be a drug boat. They will put a decoy out with \"bodies\".  It will be street people nobody will miss and there will be indignation. 2 things will happen war is declared or we back off permalink parent award report block reply view 2 more comments... Aggrieved03 2 points 5 days ago Who's the largest drug smuggling organization in the world? I'll give you a hint, their offices are in Langley. permalink parent award report block reply Raetchel 1 points 5 days ago that's why they big mad permalink parent award report block reply whataboob -1 points 6 days ago How do you know though? How does anyone? How do we know they weren’t child smugglers? How do we know there weren’t Americans on board? How did we know they were guilty before our desperate empire killed them? Isn’t this a basic, classic case of why the concept of due process exists? permalink parent award report block reply MrGrayson 2 points 6 days ago I think you are what they call a \"bleeding heart\". permalink parent award report block reply view 1 more comments... Spicy_cat 2 points 5 days ago Yes of course foreign enemies in a war always have to be captured alive and given fair trials.  It's never appropriate to use lethal force during a defensive war. permalink parent award report block reply view 2 more comments...\nAndover 5 points 6 days ago Why would you trust anything the Deep State Pentagon says? Lindsey Graham is dancing and clapping his hands about this. Doesn't that make you question? Haven't you learned anything??? permalink parent award report block reply grad16uc 4 points 6 days ago \"Why don't we just blow it up?\" the uniparty, since forever permalink parent award report block reply KernalMustard 1 points 5 days ago Its because at some point it wont be a drug boat. They will put a decoy out with \"bodies\".  It will be street people nobody will miss and there will be indignation. 2 things will happen war is declared or we back off permalink parent award report block reply view 2 more comments...\ngrad16uc 4 points 6 days ago \"Why don't we just blow it up?\" the uniparty, since forever permalink parent award report block reply\nKernalMustard 1 points 5 days ago Its because at some point it wont be a drug boat. They will put a decoy out with \"bodies\".  It will be street people nobody will miss and there will be indignation. 2 things will happen war is declared or we back off permalink parent award report block reply view 2 more comments...\nAggrieved03 2 points 5 days ago Who's the largest drug smuggling organization in the world? I'll give you a hint, their offices are in Langley. permalink parent award report block reply Raetchel 1 points 5 days ago that's why they big mad permalink parent award report block reply\nRaetchel 1 points 5 days ago that's why they big mad permalink parent award report block reply\nwhataboob -1 points 6 days ago How do you know though? How does anyone? How do we know they weren’t child smugglers? How do we know there weren’t Americans on board? How did we know they were guilty before our desperate empire killed them? Isn’t this a basic, classic case of why the concept of due process exists? permalink parent award report block reply MrGrayson 2 points 6 days ago I think you are what they call a \"bleeding heart\". permalink parent award report block reply view 1 more comments... Spicy_cat 2 points 5 days ago Yes of course foreign enemies in a war always have to be captured alive and given fair trials.  It's never appropriate to use lethal force during a defensive war. permalink parent award report block reply view 2 more comments...\nMrGrayson 2 points 6 days ago I think you are what they call a \"bleeding heart\". permalink parent award report block reply view 1 more comments...\nSpicy_cat 2 points 5 days ago Yes of course foreign enemies in a war always have to be captured alive and given fair trials.  It's never appropriate to use lethal force during a defensive war. permalink parent award report block reply view 2 more comments...\nShitsbrokeyo 10 points 5 days ago Career Coast Guard here. We know. Don't take the retard left approach just because you have TDS, spitting out sound bites you heard in the media or found on the internet. You're embarrassing yourself. It's called Intel.  Spies, eyes etc. Traffic patterns, tracking and monitoring, times, locations, personnel, associates, double agents, shared intel, informants,  ship design, ship purpose.  We know. The only difference now is, we aren't wasting our time with the judicial process, which is screwy with foriegn born judges and their obviously tainted opinions. permalink parent award report block reply ActNow 2 points 5 days ago Thank you for the work you do. Just wondering. Have you ever apprehended someone who was a mule? permalink parent award report block reply Shitsbrokeyo 2 points 5 days ago Personally no. Although I dealt with plenty working in a Arizona border jail before the CG. permalink parent award report block reply whataboob 1 points 5 days ago It's called Intel. Spies, eyes etc. Traffic patterns, tracking and monitoring, times, locations, personnel, associates, double agents, shared intel, informants, ship design, ship purpose Are those items you mentioned enough for the federal government to identify a person before killing them from a distance? So, since we know, then who?  Who did the federal government kill?  Is there a list of names? permalink parent award report block reply Shitsbrokeyo 1 points 5 days ago Ask your lord and savior 0bama, he knowingly droned Americans. permalink parent award report block reply view 3 more comments... aaafirefly123 0 points 5 days ago If the person is a foreigner, I don’t care if the government kills them extrajudicially. I’ll care when it happens to U.S. citizens like it did under Obama. permalink parent award report block reply view 1 more comments...\nActNow 2 points 5 days ago Thank you for the work you do. Just wondering. Have you ever apprehended someone who was a mule? permalink parent award report block reply Shitsbrokeyo 2 points 5 days ago Personally no. Although I dealt with plenty working in a Arizona border jail before the CG. permalink parent award report block reply\nShitsbrokeyo 2 points 5 days ago Personally no. Although I dealt with plenty working in a Arizona border jail before the CG. permalink parent award report block reply\nwhataboob 1 points 5 days ago It's called Intel. Spies, eyes etc. Traffic patterns, tracking and monitoring, times, locations, personnel, associates, double agents, shared intel, informants, ship design, ship purpose Are those items you mentioned enough for the federal government to identify a person before killing them from a distance? So, since we know, then who?  Who did the federal government kill?  Is there a list of names? permalink parent award report block reply Shitsbrokeyo 1 points 5 days ago Ask your lord and savior 0bama, he knowingly droned Americans. permalink parent award report block reply view 3 more comments... aaafirefly123 0 points 5 days ago If the person is a foreigner, I don’t care if the government kills them extrajudicially. I’ll care when it happens to U.S. citizens like it did under Obama. permalink parent award report block reply view 1 more comments...\nShitsbrokeyo 1 points 5 days ago Ask your lord and savior 0bama, he knowingly droned Americans. permalink parent award report block reply view 3 more comments...\naaafirefly123 0 points 5 days ago If the person is a foreigner, I don’t care if the government kills them extrajudicially. I’ll care when it happens to U.S. citizens like it did under Obama. permalink parent award report block reply view 1 more comments...\nAggrieved03 2 points 5 days ago Who's marking the targets? I'd guess CIA who are the largest cartel in the world already. permalink parent award report block reply\nUltraFrogMan 1 points 6 days ago We apprehended a few permalink parent award report block reply\nnamedaccount33 0 points 5 days ago You don't think they have satellite tracking of the entire operation from start to finish? permalink parent award report block reply whataboob 1 points 5 days ago Is satellite tracking enough to identify a person before the federal government kills them? permalink parent award report block reply namedaccount33 1 points 2 days ago They can identify their behavior. And if you are unflagged in international waters you have to stop for any Flagged sovereign that demands it. So if they have clear smuggling behavior. Then don't stop when required to they are allowed to be stopped by any means up to killing them. permalink parent award report block reply view 1 more comments...\nwhataboob 1 points 5 days ago Is satellite tracking enough to identify a person before the federal government kills them? permalink parent award report block reply namedaccount33 1 points 2 days ago They can identify their behavior. And if you are unflagged in international waters you have to stop for any Flagged sovereign that demands it. So if they have clear smuggling behavior. Then don't stop when required to they are allowed to be stopped by any means up to killing them. permalink parent award report block reply view 1 more comments...\nnamedaccount33 1 points 2 days ago They can identify their behavior. And if you are unflagged in international waters you have to stop for any Flagged sovereign that demands it. So if they have clear smuggling behavior. Then don't stop when required to they are allowed to be stopped by any means up to killing them. permalink parent award report block reply view 1 more comments...\nBullet3250 4 points 6 days ago Acceptable loses... they know they will always lose a few trucks /boats... it's a cost of doing business. ;\\ permalink parent award report block reply ActNow 2 points 5 days ago So, I have to wonder. If we blew up 17, how many may have got through? permalink parent award report block reply\nActNow 2 points 5 days ago So, I have to wonder. If we blew up 17, how many may have got through? permalink parent award report block reply\nDonsChair 15 points 6 days ago Imagine all the lives saved. We've had the greatest military in the world for decades. Yet, you're going to tell me that we couldn't detect and deal with vessels transporting illegal narcotics to our shores prior to 2025? Maybe all we really needed was a new president. permalink award report block reply AlmostFullyDilated -1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nAlmostFullyDilated -1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nMeister_Bockmist 14 points 6 days ago 🎵 99 boats full of drugs on the sea, 99 boats full of drugs, You bomb it around and run it aground, 98 boats full of drugs... 🎶 permalink award report block reply Mortal_Wombat 9 points 6 days ago 98 boats full of drugs on the sea, 98 boats full of drugs, drop a few bombs, make some phone calls to moms, 97 boats full of drugs on the sea... permalink parent award report block reply Washington_Redskins 8 points 6 days ago 97 boats full of drugs on the sea, 97 boats full of drugs.. Missile inbound, that boat's going down. 97 boats full of drugs on the sea. permalink parent award report block reply Frenchie619 3 points 5 days ago 96 boats full of drugs on the sea, 96 boats full of drugs.. you sink them now,  they still try anyhow,  96 boats full of drugs in the sea. permalink parent award report block reply ActNow 2 points 5 days ago 🎵 95 boats full of drugs on the sea, 95 boats full of drugs...blown to bits, they sink down, CIA has a frown, 94 boats full of drugs on the sea.🎵 permalink parent award report block reply\nMortal_Wombat 9 points 6 days ago 98 boats full of drugs on the sea, 98 boats full of drugs, drop a few bombs, make some phone calls to moms, 97 boats full of drugs on the sea... permalink parent award report block reply Washington_Redskins 8 points 6 days ago 97 boats full of drugs on the sea, 97 boats full of drugs.. Missile inbound, that boat's going down. 97 boats full of drugs on the sea. permalink parent award report block reply Frenchie619 3 points 5 days ago 96 boats full of drugs on the sea, 96 boats full of drugs.. you sink them now,  they still try anyhow,  96 boats full of drugs in the sea. permalink parent award report block reply ActNow 2 points 5 days ago 🎵 95 boats full of drugs on the sea, 95 boats full of drugs...blown to bits, they sink down, CIA has a frown, 94 boats full of drugs on the sea.🎵 permalink parent award report block reply\nWashington_Redskins 8 points 6 days ago 97 boats full of drugs on the sea, 97 boats full of drugs.. Missile inbound, that boat's going down. 97 boats full of drugs on the sea. permalink parent award report block reply Frenchie619 3 points 5 days ago 96 boats full of drugs on the sea, 96 boats full of drugs.. you sink them now,  they still try anyhow,  96 boats full of drugs in the sea. permalink parent award report block reply ActNow 2 points 5 days ago 🎵 95 boats full of drugs on the sea, 95 boats full of drugs...blown to bits, they sink down, CIA has a frown, 94 boats full of drugs on the sea.🎵 permalink parent award report block reply\nFrenchie619 3 points 5 days ago 96 boats full of drugs on the sea, 96 boats full of drugs.. you sink them now,  they still try anyhow,  96 boats full of drugs in the sea. permalink parent award report block reply ActNow 2 points 5 days ago 🎵 95 boats full of drugs on the sea, 95 boats full of drugs...blown to bits, they sink down, CIA has a frown, 94 boats full of drugs on the sea.🎵 permalink parent award report block reply\nActNow 2 points 5 days ago 🎵 95 boats full of drugs on the sea, 95 boats full of drugs...blown to bits, they sink down, CIA has a frown, 94 boats full of drugs on the sea.🎵 permalink parent award report block reply\nBrewSwillis 8 points 5 days ago Wow! 17 boats, already? And I just heard some leftist, on a podcast that I listen to, spouting the leftist talking points that \"it's not even going to have that much of an effect, because that's not how most drugs make their way into the United States\". I would say 17 boats, in a couple months, is a fair amount of drugs to be taken off the streets. permalink award report block reply PearlyGaits57 1 points 5 days ago It's the LEFT. permalink parent award report block reply\nPearlyGaits57 1 points 5 days ago It's the LEFT. permalink parent award report block reply\nBullet3250 5 points 6 days ago perhaps 1 to 2 tons of drugs per boat??... pure stuff... over 20 TONS of drugs - sent to sleep with the fishes. permalink award report block reply DeportThemAllForever 3 points 6 days ago Hunter Biden weekly supply permalink parent award report block reply ActNow 2 points 5 days ago If it's meth, the fish are WIDE awake. permalink parent award report block reply\nDeportThemAllForever 3 points 6 days ago Hunter Biden weekly supply permalink parent award report block reply\nActNow 2 points 5 days ago If it's meth, the fish are WIDE awake. permalink parent award report block reply\njsphere256 3 points 6 days ago Let us count how many airstrikes to sink the boat! ONE missile! ...TWO missiles! ... THREE missiles! ah ah ah ah permalink award report block reply\nDrTar 3 points 5 days ago I thought it was 15. As in this will be the 15th vote to reopen government. permalink award report block reply\nUltraFrogMan 3 points 6 days ago Based permalink award report block reply\nBeardholder 3 points 5 days ago Tomorrow is (0) . For there has been ( 0 ) arrests of traitors and corrupt politicians. permalink award report block reply\nbumpman 2 points 6 days ago Has anyone from Venezuela or wherever confirmed these boats are actually being blasted and given names/ details about who they are. Part of me thinks that a couple real boats got blown up but the rest are just ai or props being blasted to discourage actual drug boats. permalink award report block reply The_Emperor 2 points 5 days ago Yeah, that's stupid.  Let's go ask the Commies in charge of narco trafficking who fund their crime syndicate about whether they are real boats...instead of respecting GEOTUS, Hegseth  and the greatest military in History...the force for good that is the US Navy. permalink parent award report block reply ActNow 1 points 5 days ago Venezuela is not going to confirm anything. There's some general near the top running the drug operation, so it's safe to say a chain of command would allow him to know they are real or not. If \"AI boats\" were used, they would only propagandize Americans, so not likely. permalink parent award report block reply\nThe_Emperor 2 points 5 days ago Yeah, that's stupid.  Let's go ask the Commies in charge of narco trafficking who fund their crime syndicate about whether they are real boats...instead of respecting GEOTUS, Hegseth  and the greatest military in History...the force for good that is the US Navy. permalink parent award report block reply\nActNow 1 points 5 days ago Venezuela is not going to confirm anything. There's some general near the top running the drug operation, so it's safe to say a chain of command would allow him to know they are real or not. If \"AI boats\" were used, they would only propagandize Americans, so not likely. permalink parent award report block reply\nFrenchie619 2 points 5 days ago Had it been that many already?  Damn,  I must have missed a few.  By my count (ah ah ah), I've believe that I've only read about 9 or 10 that I'm aware of. Someone's working overtime. permalink award report block reply ActNow 1 points 5 days ago We've probably only been shown the highlight reel of the best explosions. permalink parent award report block reply\nActNow 1 points 5 days ago We've probably only been shown the highlight reel of the best explosions. permalink parent award report block reply\nsomeguy7738 2 points 5 days ago Those are rookie numbers. permalink award report block reply\nMungo 2 points 5 days ago Q permalink award report block reply\nBrionK 2 points 6 days ago Not enough Vance. If you love your mom you'll kill the drug lords that hurt your family....kill thelm all Vance, or eat shit. permalink award report block reply\nSqRt7744 1 points 5 days ago This is great, makes my daily life so much better and now there's no drugs or homeless in my neighborhood anymore. I'm so glad we're spending millions to kill people and sink speedboats off the coast of another continent. permalink award report block reply\nCalumet57 1 points 5 days ago Is this a Q post? permalink award report block reply\nTDW4CBD -9 points 6 days ago Ehr mehr gehrd! 17 boats! Q predicted that this would happen! TrUsT tHe PlAn! permalink award report block reply Pongpagongbatibot 3 points 6 days ago Groypers must be banned from this site. Most of them aren't even Americans but Iranian trolls. I've seen the damage they done in stormfront. \"White nationalist\" are now fans of Greta because she stood up against the joos. They also love Hamas, Iran, and basically Islam because they oppose the joos. Their mantra there is the enemy of my enemy is my friend. And they hate Trump, even though Trump stands up against western invasion of immigrants and islamization. To them, Trump is the friend of their enemy. They don't care that Islam is the one invading white countries. Islam is their friend because the main enemy is the joos. This groyper mentality is spreading now in PDW. Groypers are not for Trump. They must banned from PDW or else, this site will be controlled by Iranian trolls permalink parent award report block reply TDW4CBD 1 points 5 days ago Comment removed by community filter. permalink parent award report block reply PearlyGaits57 3 points 5 days ago Q, 🤣🤣🤣🤣!!! permalink parent award report block reply x79q3pb 2 points 6 days ago Needless division. permalink parent award report block reply\nPongpagongbatibot 3 points 6 days ago Groypers must be banned from this site. Most of them aren't even Americans but Iranian trolls. I've seen the damage they done in stormfront. \"White nationalist\" are now fans of Greta because she stood up against the joos. They also love Hamas, Iran, and basically Islam because they oppose the joos. Their mantra there is the enemy of my enemy is my friend. And they hate Trump, even though Trump stands up against western invasion of immigrants and islamization. To them, Trump is the friend of their enemy. They don't care that Islam is the one invading white countries. Islam is their friend because the main enemy is the joos. This groyper mentality is spreading now in PDW. Groypers are not for Trump. They must banned from PDW or else, this site will be controlled by Iranian trolls permalink parent award report block reply TDW4CBD 1 points 5 days ago Comment removed by community filter. permalink parent award report block reply\nTDW4CBD 1 points 5 days ago Comment removed by community filter. permalink parent award report block reply\nPearlyGaits57 3 points 5 days ago Q, 🤣🤣🤣🤣!!! permalink parent award report block reply\nx79q3pb 2 points 6 days ago Needless division. permalink parent award report block reply"}