{"id": "1ARK0TUbHY", "contents": "1052 James O’Keefe has a Democrat insider revealing on hidden camera Gavin Newsom is funneling the money donated to his Prop 50 Redistricting Election into a Presidential Campaign fund for himself posted 7 days ago by Eruditio 40 comments award share report block Wall Street Apes @WallStreetApes • 7d WOW 🚨 James O’Keefe has a Democrat insider revealing on hidden camera Gavin Newsom is funneling the money donated to his Prop 50 Redistricting Election into a Presidential Campaign fund for himself This is money laundering\n40 comments Sort by Top Top New Worst Old Save MocksFordComma 52 points 7 days ago Of all the crap O'Keefe has uncovered, have there ever been any criminal charges, ever? permalink award report block reply 556x45mm 46 points 7 days ago Yeah, James O'Keefe and his associates where charged with crimes for video taping someone without their consent. Think it was ACORN stuff that he did that got him arrested. permalink parent award report block reply starjello 17 points 7 days ago Exactly. permalink parent award report block reply Krat 15 points 7 days ago None that matter, no. Laws are for Democrats tonpunish the peasant slaves and thats it permalink parent award report block reply fightfightfightx 6 points 7 days ago Pam is right on it! permalink parent award report block reply Nick-Kerr 1 points 7 days ago Right after her next hair appointment permalink parent award report block reply Threaper666 3 points 7 days ago Exactly.  Who gives a F.  The Trump administration won't act on it.   We are losing our country and we are still acting as if its politics as usual. permalink parent award report block reply LibertyFox 23 points 7 days ago Seeing as it takes almost nothing for these loose-lipped lefties to sing like canaries, one would expect a great many more arrests. permalink award report block reply Wrexxis780 8 points 7 days ago Any hope of them getting laid and they share every government secret they can think of permalink parent award report block reply Trump2020or4eva 2 points 7 days ago More? Who's been arrested? permalink parent award report block reply ReleasetheList 1 points 7 days ago Hahaha haha. Good joke. permalink parent award report block reply BeanieRed 14 points 7 days ago I have O’Keefe fatigue.  It’s not his fault; he’s uncovered huge issues, but what’s the point?  It’s depressing when no one is getting arrested. permalink award report block reply Apersonofinterest 12 points 7 days ago He did the same thing with the fire money and nothing happened to him same as this. permalink award report block reply becomelions 10 points 7 days ago TRUMP, WHERE THE FUCK ARE THE ARRESTS? permalink award report block reply USDMaga 7 points 7 days ago Its (D)ifferent when he does it. Lets face it, Fauci killed 6 million+ people and hasn't faced a single charge.  DNC faces no consequences no matter what it does at this point.  Literally wasting time pointing out their crimes, their voters don't care. permalink award report block reply Krat 6 points 7 days ago Their voters are openly calling for murder of wrong thinkers permalink parent award report block reply USDMaga 4 points 7 days ago And thier voters don't care and the DOJ won't prosecute. Until someone helps Trump clean things up, nothing will improve. permalink parent award report block reply SupFrens 7 points 7 days ago Nothing ever happens to these corrupt assholes.. permalink award report block reply PenguinOfDoom 6 points 7 days ago James is wasting his time. Gavin is in the group that's immune to any prosecution. permalink award report block reply perma-maga 5 points 7 days ago Where's the FEC? permalink award report block reply starjello 5 points 7 days ago In the democrats back pocket where it has always been. permalink parent award report block reply Moose_Antlers 1 points 7 days ago He hasn't moved the money yet. No crime has been committed. What is FEC supposed to investigate? There is no Newsom 2028 campaign, or account attached to it. This guy's talking about something he plans to do. Newsom's got total deniability here. It's literally just some Alphabet beta trying to impress a date. permalink parent award report block reply journalist 3 points 7 days ago Spoiler alert:  no one will do anything about it. permalink award report block reply surgeriot 3 points 7 days ago This is their frontrunner for 2028, he's invincible, this will do nothing. permalink award report block reply AstroBenny 3 points 7 days ago So is Newsome going to be held accountable or what? permalink award report block reply starjello 3 points 7 days ago Most likely selected to be your next President. permalink parent award report block reply freedom-thinker 2 points 7 days ago What's the point O'Keefe? no one prosecutes! permalink award report block reply jean_spad 1 points 7 days ago Bastard. permalink award report block reply 27Sandino 1 points 7 days ago Newscum to go down in two weeks permalink award report block reply AgnesDomini 1 points 7 days ago Arrest him. Exposures without consequences are pointless. permalink award report block reply llirrem 1 points 7 days ago That's not money laundering, that's embezzlement. Money laundering is when you get money through illegal means (like drug dealing for example) and you put it into a cash based business (like a laundromat for example) so that the money becomes legal and taxable so the IRS won't come after you for tax fraud. Embezzlement is when money that was appropriated to you for a specific reason is used for non-approved purposes usually personal gain. permalink award report block reply 2016TrumpMAGA 1 points 7 days ago That is not illegal, provided it is disclosed. permalink award report block reply AlvinOfTheTrumpmunks 1 points 7 days ago Just toss it in the pile of things Gavin Newsom has done to warrant a federal investigation but it won't happen right now because of Pam Bondi. Hell some investigations may not be happening because of the current available venues being to heavy in Democrats favor. permalink award report block reply Eatinglue 1 points 7 days ago HEY PAM! PAAAAAAAM! GOT ONE FOR YA TO LOOK AT. permalink award report block reply keeman 1 points 7 days ago And nothing will be done.  They will arrest more sportsball players, blow up more fishing boats around Venezuela and make a ceasefire in outer Bumfuckustan.  And you will all cheer.  Meanwhile swamp growing steadily, elections still fucked and gov spending still completely out of control. permalink award report block reply Greenhills 1 points 7 days ago Of course, duh. The dnc has no money. permalink award report block reply RBFace 1 points 7 days ago Cool. Nice story. Does anyone believe that they are going to arrest Newscum for money laundering?? I sure in the hell don't. I want so badly to be wrong. Bondi and Kash were put in their positions to prevent any major arrests. permalink award report block reply REEEEEEEEEEE 1 points 7 days ago Dude if i were to make ANY illegal transaction to myself I wouldn't be able to sleep at night because I'd know it was traceable and I would get caught... and I'm an absolute nobody. If anything here is true it would be immediately traceable and should be looked into.  It won't. permalink award report block reply questionmarks -2 points 7 days ago james o' keefe aka. J.O.K.E has been doing this craigslist actor scam for a decade, he has never accomplished anything and is just a fundraising vampire permalink award report block reply\nMocksFordComma 52 points 7 days ago Of all the crap O'Keefe has uncovered, have there ever been any criminal charges, ever? permalink award report block reply 556x45mm 46 points 7 days ago Yeah, James O'Keefe and his associates where charged with crimes for video taping someone without their consent. Think it was ACORN stuff that he did that got him arrested. permalink parent award report block reply starjello 17 points 7 days ago Exactly. permalink parent award report block reply Krat 15 points 7 days ago None that matter, no. Laws are for Democrats tonpunish the peasant slaves and thats it permalink parent award report block reply fightfightfightx 6 points 7 days ago Pam is right on it! permalink parent award report block reply Nick-Kerr 1 points 7 days ago Right after her next hair appointment permalink parent award report block reply Threaper666 3 points 7 days ago Exactly.  Who gives a F.  The Trump administration won't act on it.   We are losing our country and we are still acting as if its politics as usual. permalink parent award report block reply\n556x45mm 46 points 7 days ago Yeah, James O'Keefe and his associates where charged with crimes for video taping someone without their consent. Think it was ACORN stuff that he did that got him arrested. permalink parent award report block reply starjello 17 points 7 days ago Exactly. permalink parent award report block reply\nstarjello 17 points 7 days ago Exactly. permalink parent award report block reply\nKrat 15 points 7 days ago None that matter, no. Laws are for Democrats tonpunish the peasant slaves and thats it permalink parent award report block reply\nfightfightfightx 6 points 7 days ago Pam is right on it! permalink parent award report block reply Nick-Kerr 1 points 7 days ago Right after her next hair appointment permalink parent award report block reply\nNick-Kerr 1 points 7 days ago Right after her next hair appointment permalink parent award report block reply\nThreaper666 3 points 7 days ago Exactly.  Who gives a F.  The Trump administration won't act on it.   We are losing our country and we are still acting as if its politics as usual. permalink parent award report block reply\nLibertyFox 23 points 7 days ago Seeing as it takes almost nothing for these loose-lipped lefties to sing like canaries, one would expect a great many more arrests. permalink award report block reply Wrexxis780 8 points 7 days ago Any hope of them getting laid and they share every government secret they can think of permalink parent award report block reply Trump2020or4eva 2 points 7 days ago More? Who's been arrested? permalink parent award report block reply ReleasetheList 1 points 7 days ago Hahaha haha. Good joke. permalink parent award report block reply\nWrexxis780 8 points 7 days ago Any hope of them getting laid and they share every government secret they can think of permalink parent award report block reply\nTrump2020or4eva 2 points 7 days ago More? Who's been arrested? permalink parent award report block reply\nReleasetheList 1 points 7 days ago Hahaha haha. Good joke. permalink parent award report block reply\nBeanieRed 14 points 7 days ago I have O’Keefe fatigue.  It’s not his fault; he’s uncovered huge issues, but what’s the point?  It’s depressing when no one is getting arrested. permalink award report block reply\nApersonofinterest 12 points 7 days ago He did the same thing with the fire money and nothing happened to him same as this. permalink award report block reply\nbecomelions 10 points 7 days ago TRUMP, WHERE THE FUCK ARE THE ARRESTS? permalink award report block reply\nUSDMaga 7 points 7 days ago Its (D)ifferent when he does it. Lets face it, Fauci killed 6 million+ people and hasn't faced a single charge.  DNC faces no consequences no matter what it does at this point.  Literally wasting time pointing out their crimes, their voters don't care. permalink award report block reply Krat 6 points 7 days ago Their voters are openly calling for murder of wrong thinkers permalink parent award report block reply USDMaga 4 points 7 days ago And thier voters don't care and the DOJ won't prosecute. Until someone helps Trump clean things up, nothing will improve. permalink parent award report block reply\nKrat 6 points 7 days ago Their voters are openly calling for murder of wrong thinkers permalink parent award report block reply USDMaga 4 points 7 days ago And thier voters don't care and the DOJ won't prosecute. Until someone helps Trump clean things up, nothing will improve. permalink parent award report block reply\nUSDMaga 4 points 7 days ago And thier voters don't care and the DOJ won't prosecute. Until someone helps Trump clean things up, nothing will improve. permalink parent award report block reply\nSupFrens 7 points 7 days ago Nothing ever happens to these corrupt assholes.. permalink award report block reply\nPenguinOfDoom 6 points 7 days ago James is wasting his time. Gavin is in the group that's immune to any prosecution. permalink award report block reply\nperma-maga 5 points 7 days ago Where's the FEC? permalink award report block reply starjello 5 points 7 days ago In the democrats back pocket where it has always been. permalink parent award report block reply Moose_Antlers 1 points 7 days ago He hasn't moved the money yet. No crime has been committed. What is FEC supposed to investigate? There is no Newsom 2028 campaign, or account attached to it. This guy's talking about something he plans to do. Newsom's got total deniability here. It's literally just some Alphabet beta trying to impress a date. permalink parent award report block reply\nstarjello 5 points 7 days ago In the democrats back pocket where it has always been. permalink parent award report block reply\nMoose_Antlers 1 points 7 days ago He hasn't moved the money yet. No crime has been committed. What is FEC supposed to investigate? There is no Newsom 2028 campaign, or account attached to it. This guy's talking about something he plans to do. Newsom's got total deniability here. It's literally just some Alphabet beta trying to impress a date. permalink parent award report block reply\njournalist 3 points 7 days ago Spoiler alert:  no one will do anything about it. permalink award report block reply\nsurgeriot 3 points 7 days ago This is their frontrunner for 2028, he's invincible, this will do nothing. permalink award report block reply\nAstroBenny 3 points 7 days ago So is Newsome going to be held accountable or what? permalink award report block reply starjello 3 points 7 days ago Most likely selected to be your next President. permalink parent award report block reply\nstarjello 3 points 7 days ago Most likely selected to be your next President. permalink parent award report block reply\nfreedom-thinker 2 points 7 days ago What's the point O'Keefe? no one prosecutes! permalink award report block reply\njean_spad 1 points 7 days ago Bastard. permalink award report block reply\n27Sandino 1 points 7 days ago Newscum to go down in two weeks permalink award report block reply\nAgnesDomini 1 points 7 days ago Arrest him. Exposures without consequences are pointless. permalink award report block reply\nllirrem 1 points 7 days ago That's not money laundering, that's embezzlement. Money laundering is when you get money through illegal means (like drug dealing for example) and you put it into a cash based business (like a laundromat for example) so that the money becomes legal and taxable so the IRS won't come after you for tax fraud. Embezzlement is when money that was appropriated to you for a specific reason is used for non-approved purposes usually personal gain. permalink award report block reply\n2016TrumpMAGA 1 points 7 days ago That is not illegal, provided it is disclosed. permalink award report block reply\nAlvinOfTheTrumpmunks 1 points 7 days ago Just toss it in the pile of things Gavin Newsom has done to warrant a federal investigation but it won't happen right now because of Pam Bondi. Hell some investigations may not be happening because of the current available venues being to heavy in Democrats favor. permalink award report block reply\nEatinglue 1 points 7 days ago HEY PAM! PAAAAAAAM! GOT ONE FOR YA TO LOOK AT. permalink award report block reply\nkeeman 1 points 7 days ago And nothing will be done.  They will arrest more sportsball players, blow up more fishing boats around Venezuela and make a ceasefire in outer Bumfuckustan.  And you will all cheer.  Meanwhile swamp growing steadily, elections still fucked and gov spending still completely out of control. permalink award report block reply\nGreenhills 1 points 7 days ago Of course, duh. The dnc has no money. permalink award report block reply\nRBFace 1 points 7 days ago Cool. Nice story. Does anyone believe that they are going to arrest Newscum for money laundering?? I sure in the hell don't. I want so badly to be wrong. Bondi and Kash were put in their positions to prevent any major arrests. permalink award report block reply\nREEEEEEEEEEE 1 points 7 days ago Dude if i were to make ANY illegal transaction to myself I wouldn't be able to sleep at night because I'd know it was traceable and I would get caught... and I'm an absolute nobody. If anything here is true it would be immediately traceable and should be looked into.  It won't. permalink award report block reply\nquestionmarks -2 points 7 days ago james o' keefe aka. J.O.K.E has been doing this craigslist actor scam for a decade, he has never accomplished anything and is just a fundraising vampire permalink award report block reply"}