{"id": "1ARK9jzckm", "contents": "423 Hungary exposes the West's Proxy War with Russia:\n\n\"Brussels wants to build a United States of Europe. A new kind of Empire.\"\n\n-Prime Minister of Hungary, Orbán Viktor posted 1 day ago by StopCorruptionDC 12 comments award share report block Based Hungary 🇭🇺 @HungaryBased • 2d 🚨BREAKING: Hungary EXPOSES the West's Proxy War with Russia: \"Brussels wants to build a United States of Europe. A new kind of Empire.\" -Prime Minister of Hungary, Orbán Viktor 🇭🇺🇪🇺\n12 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style ThorsonTT 10 points 1 day ago It's not a united states of Europe, it's a Union of European Socialist Nations. permalink award report block reply Meister_Bockmist 2 points 1 day ago I heard the working title was \"Federated Aegis Guild\" permalink parent award report block reply MAGAPlenty 2 points 1 day ago Of Gold-Loving Traitors ? permalink parent award report block reply patrioticwinning3 2 points 1 day ago That was what Hitler described in \"Mien Kampf...\" permalink parent award report block reply MemoryHoleyeO 1 points 1 day ago If everyone in the EU commission met in Europe and then died of AIDs, the world would be a better place permalink award report block reply Josemarti 6 points 1 day ago Bro let's not pretend COVID is real permalink parent award report block reply Justlooking250 2 points 1 day ago They would say they died from Covid anyways even if a 2x4 went thru thier chest after crashing into a house at high speed high on drugs permalink parent award report block reply MemoryHoleyeO 2 points 1 day ago Meant to type AIDS , autocorrected because both are for gays permalink parent award report block reply Steve56775 1 points 1 day ago This time filled with Muslims! permalink award report block reply klunniclowns2 1 points 1 day ago All at the behest of... Nevermind were not allowed to say or notice. It's Christianity in the crosshairs. permalink award report block reply NoticesBugleOWO 1 points 1 day ago What a retard. Putin is LITERALLY trying to recreate the Russian Empire and openly talks about doing so... yet somehow it's Europe (who he is targeting) who are the aggressors? Fucking ridiculous. permalink award report block reply patrioticwinning3 0 points 1 day ago So did Hitler... permalink award report block reply\nThorsonTT 10 points 1 day ago It's not a united states of Europe, it's a Union of European Socialist Nations. permalink award report block reply Meister_Bockmist 2 points 1 day ago I heard the working title was \"Federated Aegis Guild\" permalink parent award report block reply MAGAPlenty 2 points 1 day ago Of Gold-Loving Traitors ? permalink parent award report block reply patrioticwinning3 2 points 1 day ago That was what Hitler described in \"Mien Kampf...\" permalink parent award report block reply\nMeister_Bockmist 2 points 1 day ago I heard the working title was \"Federated Aegis Guild\" permalink parent award report block reply MAGAPlenty 2 points 1 day ago Of Gold-Loving Traitors ? permalink parent award report block reply\nMAGAPlenty 2 points 1 day ago Of Gold-Loving Traitors ? permalink parent award report block reply\npatrioticwinning3 2 points 1 day ago That was what Hitler described in \"Mien Kampf...\" permalink parent award report block reply\nMemoryHoleyeO 1 points 1 day ago If everyone in the EU commission met in Europe and then died of AIDs, the world would be a better place permalink award report block reply Josemarti 6 points 1 day ago Bro let's not pretend COVID is real permalink parent award report block reply Justlooking250 2 points 1 day ago They would say they died from Covid anyways even if a 2x4 went thru thier chest after crashing into a house at high speed high on drugs permalink parent award report block reply MemoryHoleyeO 2 points 1 day ago Meant to type AIDS , autocorrected because both are for gays permalink parent award report block reply\nJosemarti 6 points 1 day ago Bro let's not pretend COVID is real permalink parent award report block reply Justlooking250 2 points 1 day ago They would say they died from Covid anyways even if a 2x4 went thru thier chest after crashing into a house at high speed high on drugs permalink parent award report block reply MemoryHoleyeO 2 points 1 day ago Meant to type AIDS , autocorrected because both are for gays permalink parent award report block reply\nJustlooking250 2 points 1 day ago They would say they died from Covid anyways even if a 2x4 went thru thier chest after crashing into a house at high speed high on drugs permalink parent award report block reply\nMemoryHoleyeO 2 points 1 day ago Meant to type AIDS , autocorrected because both are for gays permalink parent award report block reply\nSteve56775 1 points 1 day ago This time filled with Muslims! permalink award report block reply\nklunniclowns2 1 points 1 day ago All at the behest of... Nevermind were not allowed to say or notice. It's Christianity in the crosshairs. permalink award report block reply\nNoticesBugleOWO 1 points 1 day ago What a retard. Putin is LITERALLY trying to recreate the Russian Empire and openly talks about doing so... yet somehow it's Europe (who he is targeting) who are the aggressors? Fucking ridiculous. permalink award report block reply\npatrioticwinning3 0 points 1 day ago So did Hitler... permalink award report block reply"}