{"id": "1ARK9mHVvF", "contents": "39 Electric Bill Crisis Blame-Game Begins: Democrats Slam Data Centers, GOP Faults “Climate-Cult Ideology” (www.infowars.com) posted 12 hours ago by MADASHELLNEWS 5 comments award share report block Electric Bill Crisis Blame-Game Begins: Democrats Slam Data Centers, GOP Faults “Climate-Cult Ideology” This is happening much sooner than we anticipated. www.infowars.com\n5 comments Sort by Top Top New Worst Old Save Around the Web Hair Grows Back in A Few Days! At Any Stage of Baldness HaloGrow RBFace 4 points 12 hours ago How about both sides shut the hell up and fix it. permalink award report block reply Tacotuesday867 1 points 12 hours ago This permalink parent award report block reply 4886Battery 3 points 12 hours ago Imagine that, cutting supply by forcing coal and other energy suppliers to close while electricity demand increases exponentially results in higher costs.  It's crazy, whoda thunk it? permalink award report block reply cyberrigger 1 points 7 hours ago LED lighting is to blame. permalink parent award report block reply flp999 2 points 11 hours ago They're both true. So a win for everyone, I guess. permalink award report block reply\nRBFace 4 points 12 hours ago How about both sides shut the hell up and fix it. permalink award report block reply Tacotuesday867 1 points 12 hours ago This permalink parent award report block reply\nTacotuesday867 1 points 12 hours ago This permalink parent award report block reply\n4886Battery 3 points 12 hours ago Imagine that, cutting supply by forcing coal and other energy suppliers to close while electricity demand increases exponentially results in higher costs.  It's crazy, whoda thunk it? permalink award report block reply cyberrigger 1 points 7 hours ago LED lighting is to blame. permalink parent award report block reply\ncyberrigger 1 points 7 hours ago LED lighting is to blame. permalink parent award report block reply\nflp999 2 points 11 hours ago They're both true. So a win for everyone, I guess. permalink award report block reply"}