{"id": "1ARK9hj6IT", "contents": "394 veteran killed by “stolen car“. Must've been one if those auto drive cars posted 2 days ago by highenergywinning 17 comments award share report block New York Post @nypost • 3d Beloved Long Island veteran killed by stolen car just moments after visiting granddaughter at school https://t.co/9qVOKRjwtc\n17 comments Sort by Top Top New Worst Old Save Puff_Tokerson 20 points 2 days ago These immigrants have weird names... Stolen Car? His parents must have known he would be a car thief permalink award report block reply LiteraIIyHitIer 7 points 2 days ago It's like all those dudes named \"No Name Given\" getting CDLs. Seems like an extremely popular name, too. permalink parent award report block reply SarsourCuntReturns 4 points 2 days ago Correction: his parents used lower case letters because they knew referring to him as a proper noun would mean we would think he was people. permalink parent award report block reply MEME-SUPREME 8 points 2 days ago Mongoloid. permalink award report block reply Megabrain1960 1 points 2 days ago https://www.youtube.com/watch?v=mtK6pdUKmio permalink parent award report block reply redditadminssuckit 7 points 2 days ago I only hear monkey sounds nowadays permalink award report block reply realPixelDust 4 points 2 days ago Looks an illegal, too. permalink award report block reply DrCowboyPresident 4 points 2 days ago KARR is on the loose again, call Michael Knight permalink award report block reply DrowNamedDrizzt 1 points 2 days ago Do you mean KITT? permalink parent award report block reply Hawksendoom 4 points 2 days ago no KARR was the evil KITT had the orange light permalink parent award report block reply DrowNamedDrizzt 2 points 2 days ago Apologies, I was confusing KARR with Goliath.  My bad. permalink parent award report block reply Hawksendoom 2 points 2 days ago funny u bring it up i was watching the Goliath truck episode last night! permalink parent award report block reply Spez_Isacuck 3 points 2 days ago That stolen car looks weirdly similar to a black man permalink award report block reply Unboosted 3 points 2 days ago Add \"stolen car\" to the list! permalink award report block reply Lol_Garrus 2 points 2 days ago I say stolen car with a hard R permalink award report block reply mikethemarine 2 points 2 days ago so this other guy stole a car and while driving it he killed the vet? The car DIDN'T kill him the thief did permalink award report block reply Luvs_2_Bop 1 points 2 days ago Better headline:\n“Nignog does nignog things & nothing will happen to him” permalink award report block reply HoodooOperator 1 points 2 days ago Comment removed by community filter. permalink award report block reply\nPuff_Tokerson 20 points 2 days ago These immigrants have weird names... Stolen Car? His parents must have known he would be a car thief permalink award report block reply LiteraIIyHitIer 7 points 2 days ago It's like all those dudes named \"No Name Given\" getting CDLs. Seems like an extremely popular name, too. permalink parent award report block reply SarsourCuntReturns 4 points 2 days ago Correction: his parents used lower case letters because they knew referring to him as a proper noun would mean we would think he was people. permalink parent award report block reply\nLiteraIIyHitIer 7 points 2 days ago It's like all those dudes named \"No Name Given\" getting CDLs. Seems like an extremely popular name, too. permalink parent award report block reply\nSarsourCuntReturns 4 points 2 days ago Correction: his parents used lower case letters because they knew referring to him as a proper noun would mean we would think he was people. permalink parent award report block reply\nMEME-SUPREME 8 points 2 days ago Mongoloid. permalink award report block reply Megabrain1960 1 points 2 days ago https://www.youtube.com/watch?v=mtK6pdUKmio permalink parent award report block reply\nMegabrain1960 1 points 2 days ago https://www.youtube.com/watch?v=mtK6pdUKmio permalink parent award report block reply\nredditadminssuckit 7 points 2 days ago I only hear monkey sounds nowadays permalink award report block reply\nrealPixelDust 4 points 2 days ago Looks an illegal, too. permalink award report block reply\nDrCowboyPresident 4 points 2 days ago KARR is on the loose again, call Michael Knight permalink award report block reply DrowNamedDrizzt 1 points 2 days ago Do you mean KITT? permalink parent award report block reply Hawksendoom 4 points 2 days ago no KARR was the evil KITT had the orange light permalink parent award report block reply DrowNamedDrizzt 2 points 2 days ago Apologies, I was confusing KARR with Goliath.  My bad. permalink parent award report block reply Hawksendoom 2 points 2 days ago funny u bring it up i was watching the Goliath truck episode last night! permalink parent award report block reply\nDrowNamedDrizzt 1 points 2 days ago Do you mean KITT? permalink parent award report block reply Hawksendoom 4 points 2 days ago no KARR was the evil KITT had the orange light permalink parent award report block reply DrowNamedDrizzt 2 points 2 days ago Apologies, I was confusing KARR with Goliath.  My bad. permalink parent award report block reply Hawksendoom 2 points 2 days ago funny u bring it up i was watching the Goliath truck episode last night! permalink parent award report block reply\nHawksendoom 4 points 2 days ago no KARR was the evil KITT had the orange light permalink parent award report block reply DrowNamedDrizzt 2 points 2 days ago Apologies, I was confusing KARR with Goliath.  My bad. permalink parent award report block reply Hawksendoom 2 points 2 days ago funny u bring it up i was watching the Goliath truck episode last night! permalink parent award report block reply\nDrowNamedDrizzt 2 points 2 days ago Apologies, I was confusing KARR with Goliath.  My bad. permalink parent award report block reply Hawksendoom 2 points 2 days ago funny u bring it up i was watching the Goliath truck episode last night! permalink parent award report block reply\nHawksendoom 2 points 2 days ago funny u bring it up i was watching the Goliath truck episode last night! permalink parent award report block reply\nSpez_Isacuck 3 points 2 days ago That stolen car looks weirdly similar to a black man permalink award report block reply\nUnboosted 3 points 2 days ago Add \"stolen car\" to the list! permalink award report block reply\nLol_Garrus 2 points 2 days ago I say stolen car with a hard R permalink award report block reply\nmikethemarine 2 points 2 days ago so this other guy stole a car and while driving it he killed the vet? The car DIDN'T kill him the thief did permalink award report block reply\nLuvs_2_Bop 1 points 2 days ago Better headline:\n“Nignog does nignog things & nothing will happen to him” permalink award report block reply\nHoodooOperator 1 points 2 days ago Comment removed by community filter. permalink award report block reply"}