{"id": "1ARK52Bhiz", "contents": "635 Stop feeding them and they'll go away. posted 6 days ago by Crucible 17 comments award share download report block\n17 comments Sort by Top Top New Worst Old Save Elon Walked Away – Now We Know Why Read More Ads by Ad.Style LaptopDied 16 points 6 days ago A game is  called \"Spot the Handler.\" I found him, in the back, center. These things need to be organized, paid for. Important quote from Joe Kennedy, father of the president. \"Things don't just happen.\" permalink award report block reply BidenShowerDrool 9 points 6 days ago who pays the handler? who nose? permalink parent award report block reply LaptopDied 6 points 6 days ago Churches. Catholic, Lutheran, others. NGOs. Governments. And Tony Blair invented this. There is only one Jewish org involved, Hebrew Immigrant Aid Society. permalink parent award report block reply Prussian_Pepe 0 points 6 days ago All those groups are still funded and organized by the same occult European elite circles. The Catholics division in charge of such things are Jesuits. That order was founded by a crypto, who admits to the forced conversion and continuing to carry out his prime directive. There was the split in the Lutherans during the Prussian times. When the government tried to take over the church and make it a government entity. A lot of germans fled the country to avoid the government take over of doctrine. That abomination was created by Frankist cryptos, and is a communist NWO entity from day one. Weimer was rotten from within for awhile. There is a reason it reached critical mass. It doesn't take much to look into the founding of those groups. And find it's all the same incestuous network of money pushers. The individual entities are all just \"shell company\" in modern terms. They exist as a cover, and a veil, for the elite to push their agenda through what is perceived loop hole of \"charity work\". It's an old grift, but it's effective. Chasing phantoms when one only has to look at were the money comes from and why it all lines up with the same globalist agenda, despite being \"independent charity organizations\" which would in theory have different agendas if they were legit. permalink parent award report block reply TrumpAndGodWin 6 points 6 days ago The IMF and World Bank are responsible for a lot of the 3rd world invasion of the US. They intentionally made the covid lockdowns last for years longer to stop people from being able to work and afford to live, to create chaos then send them here. permalink parent award report block reply FullyDilated 2 points 6 days ago how could you spot him? they all look the same permalink parent award report block reply LLP2 0 points 6 days ago Where's Waldo berg? permalink parent award report block reply Cuetardian 4 points 6 days ago The concept of \"treat everyone fairly and equally\" is part of Western civilization. The parable Jesus told of the Good Samaritan was meant to teach this idea. You will not find this outlook in other religions or political systems. Virtually everywhere else, it is perfectly normal and expected to treat outsiders any way you like. You can cheat them, lie to them, steal from them, use them, buy them, sell them, and even kill them without consequence. As long as you treat your own immediate family well, and your own small tribe well, using outsiders is just the way life is. It's how you survive and, sometimes, grow rich. That's why it's completely normal and acceptable to people like this to take everything they can get from outsider, in any way they can. They honestly don't see anything wrong with it. But those in the West do not understand this. They think everybody is really just like we are and follows all the same rules. They don't. Not even close. Europe is already finding out And NYC is next. permalink award report block reply GoldenEarz 6 points 6 days ago In most cultures, taking advantage of others is celebrated. It’s viewed as “out smarting” them. It’s their fault for being dumb. The concept of being kind and fair is completely alien to them. permalink parent award report block reply Cuetardian 3 points 6 days ago Yes, exactly. And when you bring hordes of people into a fair-treatment society, it's like turning the wolves loose with the sheep - while the sheep owners sit back and refuse to lock the barn doors. Which is what is happening now. permalink parent award report block reply FullyDilated 1 points 6 days ago Comment removed by community filter. permalink parent award report block reply skuts 4 points 6 days ago Never a torpedo when you need one. permalink award report block reply Emoja621 2 points 6 days ago Cat food for strays.  Never fails permalink award report block reply mygovisacommie 2 points 6 days ago Don’t know why but this just made me think of an old joke. How do you kill 10 flies at once? Slap an Ethiopian in the face. permalink award report block reply Crappydatum 2 points 6 days ago They're hungry for white women permalink award report block reply patrioticwinning3 2 points 6 days ago No they will steal and loot.  Stop feeding them and DEPORT THEM ALL!  Don't forget the families :p permalink award report block reply FullyDilated 2 points 6 days ago that's a lot of rapists! permalink award report block reply FullyDilated 1 points 6 days ago that's some mighty fine looking whale/shark food permalink award report block reply\nLaptopDied 16 points 6 days ago A game is  called \"Spot the Handler.\" I found him, in the back, center. These things need to be organized, paid for. Important quote from Joe Kennedy, father of the president. \"Things don't just happen.\" permalink award report block reply BidenShowerDrool 9 points 6 days ago who pays the handler? who nose? permalink parent award report block reply LaptopDied 6 points 6 days ago Churches. Catholic, Lutheran, others. NGOs. Governments. And Tony Blair invented this. There is only one Jewish org involved, Hebrew Immigrant Aid Society. permalink parent award report block reply Prussian_Pepe 0 points 6 days ago All those groups are still funded and organized by the same occult European elite circles. The Catholics division in charge of such things are Jesuits. That order was founded by a crypto, who admits to the forced conversion and continuing to carry out his prime directive. There was the split in the Lutherans during the Prussian times. When the government tried to take over the church and make it a government entity. A lot of germans fled the country to avoid the government take over of doctrine. That abomination was created by Frankist cryptos, and is a communist NWO entity from day one. Weimer was rotten from within for awhile. There is a reason it reached critical mass. It doesn't take much to look into the founding of those groups. And find it's all the same incestuous network of money pushers. The individual entities are all just \"shell company\" in modern terms. They exist as a cover, and a veil, for the elite to push their agenda through what is perceived loop hole of \"charity work\". It's an old grift, but it's effective. Chasing phantoms when one only has to look at were the money comes from and why it all lines up with the same globalist agenda, despite being \"independent charity organizations\" which would in theory have different agendas if they were legit. permalink parent award report block reply TrumpAndGodWin 6 points 6 days ago The IMF and World Bank are responsible for a lot of the 3rd world invasion of the US. They intentionally made the covid lockdowns last for years longer to stop people from being able to work and afford to live, to create chaos then send them here. permalink parent award report block reply FullyDilated 2 points 6 days ago how could you spot him? they all look the same permalink parent award report block reply LLP2 0 points 6 days ago Where's Waldo berg? permalink parent award report block reply\nBidenShowerDrool 9 points 6 days ago who pays the handler? who nose? permalink parent award report block reply LaptopDied 6 points 6 days ago Churches. Catholic, Lutheran, others. NGOs. Governments. And Tony Blair invented this. There is only one Jewish org involved, Hebrew Immigrant Aid Society. permalink parent award report block reply Prussian_Pepe 0 points 6 days ago All those groups are still funded and organized by the same occult European elite circles. The Catholics division in charge of such things are Jesuits. That order was founded by a crypto, who admits to the forced conversion and continuing to carry out his prime directive. There was the split in the Lutherans during the Prussian times. When the government tried to take over the church and make it a government entity. A lot of germans fled the country to avoid the government take over of doctrine. That abomination was created by Frankist cryptos, and is a communist NWO entity from day one. Weimer was rotten from within for awhile. There is a reason it reached critical mass. It doesn't take much to look into the founding of those groups. And find it's all the same incestuous network of money pushers. The individual entities are all just \"shell company\" in modern terms. They exist as a cover, and a veil, for the elite to push their agenda through what is perceived loop hole of \"charity work\". It's an old grift, but it's effective. Chasing phantoms when one only has to look at were the money comes from and why it all lines up with the same globalist agenda, despite being \"independent charity organizations\" which would in theory have different agendas if they were legit. permalink parent award report block reply\nLaptopDied 6 points 6 days ago Churches. Catholic, Lutheran, others. NGOs. Governments. And Tony Blair invented this. There is only one Jewish org involved, Hebrew Immigrant Aid Society. permalink parent award report block reply Prussian_Pepe 0 points 6 days ago All those groups are still funded and organized by the same occult European elite circles. The Catholics division in charge of such things are Jesuits. That order was founded by a crypto, who admits to the forced conversion and continuing to carry out his prime directive. There was the split in the Lutherans during the Prussian times. When the government tried to take over the church and make it a government entity. A lot of germans fled the country to avoid the government take over of doctrine. That abomination was created by Frankist cryptos, and is a communist NWO entity from day one. Weimer was rotten from within for awhile. There is a reason it reached critical mass. It doesn't take much to look into the founding of those groups. And find it's all the same incestuous network of money pushers. The individual entities are all just \"shell company\" in modern terms. They exist as a cover, and a veil, for the elite to push their agenda through what is perceived loop hole of \"charity work\". It's an old grift, but it's effective. Chasing phantoms when one only has to look at were the money comes from and why it all lines up with the same globalist agenda, despite being \"independent charity organizations\" which would in theory have different agendas if they were legit. permalink parent award report block reply\nPrussian_Pepe 0 points 6 days ago All those groups are still funded and organized by the same occult European elite circles. The Catholics division in charge of such things are Jesuits. That order was founded by a crypto, who admits to the forced conversion and continuing to carry out his prime directive. There was the split in the Lutherans during the Prussian times. When the government tried to take over the church and make it a government entity. A lot of germans fled the country to avoid the government take over of doctrine. That abomination was created by Frankist cryptos, and is a communist NWO entity from day one. Weimer was rotten from within for awhile. There is a reason it reached critical mass. It doesn't take much to look into the founding of those groups. And find it's all the same incestuous network of money pushers. The individual entities are all just \"shell company\" in modern terms. They exist as a cover, and a veil, for the elite to push their agenda through what is perceived loop hole of \"charity work\". It's an old grift, but it's effective. Chasing phantoms when one only has to look at were the money comes from and why it all lines up with the same globalist agenda, despite being \"independent charity organizations\" which would in theory have different agendas if they were legit. permalink parent award report block reply\nTrumpAndGodWin 6 points 6 days ago The IMF and World Bank are responsible for a lot of the 3rd world invasion of the US. They intentionally made the covid lockdowns last for years longer to stop people from being able to work and afford to live, to create chaos then send them here. permalink parent award report block reply\nFullyDilated 2 points 6 days ago how could you spot him? they all look the same permalink parent award report block reply\nLLP2 0 points 6 days ago Where's Waldo berg? permalink parent award report block reply\nCuetardian 4 points 6 days ago The concept of \"treat everyone fairly and equally\" is part of Western civilization. The parable Jesus told of the Good Samaritan was meant to teach this idea. You will not find this outlook in other religions or political systems. Virtually everywhere else, it is perfectly normal and expected to treat outsiders any way you like. You can cheat them, lie to them, steal from them, use them, buy them, sell them, and even kill them without consequence. As long as you treat your own immediate family well, and your own small tribe well, using outsiders is just the way life is. It's how you survive and, sometimes, grow rich. That's why it's completely normal and acceptable to people like this to take everything they can get from outsider, in any way they can. They honestly don't see anything wrong with it. But those in the West do not understand this. They think everybody is really just like we are and follows all the same rules. They don't. Not even close. Europe is already finding out And NYC is next. permalink award report block reply GoldenEarz 6 points 6 days ago In most cultures, taking advantage of others is celebrated. It’s viewed as “out smarting” them. It’s their fault for being dumb. The concept of being kind and fair is completely alien to them. permalink parent award report block reply Cuetardian 3 points 6 days ago Yes, exactly. And when you bring hordes of people into a fair-treatment society, it's like turning the wolves loose with the sheep - while the sheep owners sit back and refuse to lock the barn doors. Which is what is happening now. permalink parent award report block reply FullyDilated 1 points 6 days ago Comment removed by community filter. permalink parent award report block reply\nGoldenEarz 6 points 6 days ago In most cultures, taking advantage of others is celebrated. It’s viewed as “out smarting” them. It’s their fault for being dumb. The concept of being kind and fair is completely alien to them. permalink parent award report block reply Cuetardian 3 points 6 days ago Yes, exactly. And when you bring hordes of people into a fair-treatment society, it's like turning the wolves loose with the sheep - while the sheep owners sit back and refuse to lock the barn doors. Which is what is happening now. permalink parent award report block reply\nCuetardian 3 points 6 days ago Yes, exactly. And when you bring hordes of people into a fair-treatment society, it's like turning the wolves loose with the sheep - while the sheep owners sit back and refuse to lock the barn doors. Which is what is happening now. permalink parent award report block reply\nFullyDilated 1 points 6 days ago Comment removed by community filter. permalink parent award report block reply\nskuts 4 points 6 days ago Never a torpedo when you need one. permalink award report block reply\nEmoja621 2 points 6 days ago Cat food for strays.  Never fails permalink award report block reply\nmygovisacommie 2 points 6 days ago Don’t know why but this just made me think of an old joke. How do you kill 10 flies at once? Slap an Ethiopian in the face. permalink award report block reply\nCrappydatum 2 points 6 days ago They're hungry for white women permalink award report block reply\npatrioticwinning3 2 points 6 days ago No they will steal and loot.  Stop feeding them and DEPORT THEM ALL!  Don't forget the families :p permalink award report block reply\nFullyDilated 2 points 6 days ago that's a lot of rapists! permalink award report block reply\nFullyDilated 1 points 6 days ago that's some mighty fine looking whale/shark food permalink award report block reply"}