{"id": "1ARK9hjNLS", "contents": "309 Trump urges all air traffic controllers back to work, promises $10,000 bonuses for those who stayed on the job during gov shutdown (thepostmillennial.com) posted 2 days ago by Sea_Still 7 comments award share report block Trump urges all air traffic controllers back to work, promises $10,000 bonuses for those who stayed on the job during gov shutdo... “For those Air Traffic Controllers who… didn’t take ANY TIME OFF… I will be recommending a BONUS of $10,000 per person for distinguished service to our Country.” thepostmillennial.com\n7 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget SaltyAv8er 3 points 2 days ago Trump recommended 10k bonus, he didnt promise it. I went thru several government shutdowns and continued to work. I wasn't in a position to go without a check but I still went to work. permalink award report block reply greatpumpkin 2 points 2 days ago Trump also promised 'no tax on O.T.', not 'no tax on O.T. under 12.5k'. No offense, but get it nailed down in writing before you believe it. permalink award report block reply Roadpower 1 points 2 days ago Uhh, this is kind of backwards. The ATC's that stayed working are likely the one's that could afford to wait out the government shutdown. permalink award report block reply geckogreen 2 points 2 days ago So the folks who didn't work should get the bonus? permalink parent award report block reply Roadpower 1 points 2 days ago I can't say with any conviction that they should or shouldn't. However logic dictates that they were likely to be more in need of it. permalink parent award report block reply YaharaRiver -1 points 2 days ago So? Trump told us to PREPARE in 2017, by now everyone should be an expert! He is rewarding the ones who avoided disaster, which took years of forethought. Well done, Mr. President!!  The era of bailouts is dying! permalink parent award report block reply Callsign_Fox1 1 points 2 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nSaltyAv8er 3 points 2 days ago Trump recommended 10k bonus, he didnt promise it. I went thru several government shutdowns and continued to work. I wasn't in a position to go without a check but I still went to work. permalink award report block reply\ngreatpumpkin 2 points 2 days ago Trump also promised 'no tax on O.T.', not 'no tax on O.T. under 12.5k'. No offense, but get it nailed down in writing before you believe it. permalink award report block reply\nRoadpower 1 points 2 days ago Uhh, this is kind of backwards. The ATC's that stayed working are likely the one's that could afford to wait out the government shutdown. permalink award report block reply geckogreen 2 points 2 days ago So the folks who didn't work should get the bonus? permalink parent award report block reply Roadpower 1 points 2 days ago I can't say with any conviction that they should or shouldn't. However logic dictates that they were likely to be more in need of it. permalink parent award report block reply YaharaRiver -1 points 2 days ago So? Trump told us to PREPARE in 2017, by now everyone should be an expert! He is rewarding the ones who avoided disaster, which took years of forethought. Well done, Mr. President!!  The era of bailouts is dying! permalink parent award report block reply Callsign_Fox1 1 points 2 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\ngeckogreen 2 points 2 days ago So the folks who didn't work should get the bonus? permalink parent award report block reply Roadpower 1 points 2 days ago I can't say with any conviction that they should or shouldn't. However logic dictates that they were likely to be more in need of it. permalink parent award report block reply\nRoadpower 1 points 2 days ago I can't say with any conviction that they should or shouldn't. However logic dictates that they were likely to be more in need of it. permalink parent award report block reply\nYaharaRiver -1 points 2 days ago So? Trump told us to PREPARE in 2017, by now everyone should be an expert! He is rewarding the ones who avoided disaster, which took years of forethought. Well done, Mr. President!!  The era of bailouts is dying! permalink parent award report block reply\nCallsign_Fox1 1 points 2 days ago Comment removed by community filter, pending further review. permalink parent award report block reply"}