{"id": "1ARK9oXCdN", "contents": "21 🔴All this posting by fickle MAGA types: “I’m done with Trump. He’s on his own.” Trump has always been fine on his own. He doesn’t need us, as much as we need him to fix the country. Right now, we don’t have anyone else. I’ll start to worry when Trump says he’s done with us. posted 45 minutes ago by DeusVult1096 10 comments award share download report block\n10 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style MrMcGreenGenes 16 points 44 minutes ago He just fucking did, retard. permalink award report block reply patrioticwinning3 3 points 30 minutes ago Speaking of \"Fickle posting\" did you know much like Isreal paying $7k+  for \"Pro-Isreal\" content, influencers are now being offered $3-5k PER POST promoting H1Bs? permalink parent award report block reply SneakyPete 2 points 13 minutes ago When he says \"US\" he means Indians and H1Bs permalink parent award report block reply SpeekFreely 7 points 41 minutes ago The problem w/this mindset is allowing the Federal government to become so big it needs a savior. This government needs to be downsized BIGLY. permalink award report block reply LeRiverDanube 5 points 43 minutes ago trading americans for pajeets has consequences? Who could have known! permalink award report block reply BrokenWolf2022 4 points 41 minutes ago I fail to see the problem. If things go as bad as everyone is predicting, we're left with a single alternative: shoot the communists and sandpeople. It was always going to come to that anyway. permalink award report block reply ReleasetheList 2 points 31 minutes ago Israel first shill posting another Israel first shill. Maybe they are one in the same? permalink award report block reply lostmyoldpassword 2 points 40 minutes ago Comment removed by community moderators. permalink award report block reply lostmyoldpassword 3 points 38 minutes ago Comment removed by community moderators. permalink parent award report block reply MrMcGreenGenes 0 points 35 minutes ago Like this one? https://patriots.win/p/1ARK9oXCV8/x/c permalink parent award report block reply\nMrMcGreenGenes 16 points 44 minutes ago He just fucking did, retard. permalink award report block reply patrioticwinning3 3 points 30 minutes ago Speaking of \"Fickle posting\" did you know much like Isreal paying $7k+  for \"Pro-Isreal\" content, influencers are now being offered $3-5k PER POST promoting H1Bs? permalink parent award report block reply SneakyPete 2 points 13 minutes ago When he says \"US\" he means Indians and H1Bs permalink parent award report block reply\npatrioticwinning3 3 points 30 minutes ago Speaking of \"Fickle posting\" did you know much like Isreal paying $7k+  for \"Pro-Isreal\" content, influencers are now being offered $3-5k PER POST promoting H1Bs? permalink parent award report block reply\nSneakyPete 2 points 13 minutes ago When he says \"US\" he means Indians and H1Bs permalink parent award report block reply\nSpeekFreely 7 points 41 minutes ago The problem w/this mindset is allowing the Federal government to become so big it needs a savior. This government needs to be downsized BIGLY. permalink award report block reply\nLeRiverDanube 5 points 43 minutes ago trading americans for pajeets has consequences? Who could have known! permalink award report block reply\nBrokenWolf2022 4 points 41 minutes ago I fail to see the problem. If things go as bad as everyone is predicting, we're left with a single alternative: shoot the communists and sandpeople. It was always going to come to that anyway. permalink award report block reply\nReleasetheList 2 points 31 minutes ago Israel first shill posting another Israel first shill. Maybe they are one in the same? permalink award report block reply\nlostmyoldpassword 2 points 40 minutes ago Comment removed by community moderators. permalink award report block reply lostmyoldpassword 3 points 38 minutes ago Comment removed by community moderators. permalink parent award report block reply MrMcGreenGenes 0 points 35 minutes ago Like this one? https://patriots.win/p/1ARK9oXCV8/x/c permalink parent award report block reply\nlostmyoldpassword 3 points 38 minutes ago Comment removed by community moderators. permalink parent award report block reply MrMcGreenGenes 0 points 35 minutes ago Like this one? https://patriots.win/p/1ARK9oXCV8/x/c permalink parent award report block reply\nMrMcGreenGenes 0 points 35 minutes ago Like this one? https://patriots.win/p/1ARK9oXCV8/x/c permalink parent award report block reply"}