{"id": "1ARK9l7SmC", "contents": "1572 🤡 Schools in Canada ask parents not to pack pork in their children’s lunches, saying it may be offensive to Muslim students posted 1 day ago by O__Q 301 comments award share report block TrueGov @TrueGovApp • 1d 🚨CANADIAN SCHOOL POLICY UNDER FIRE Several schools in Canada are reportedly asking parents not to pack pork in their children’s lunches, saying it may be offensive to Muslim students. The decision has drawn criticism from parents questioning how far religious accommodation\n301 comments Sort by Top Top New Worst Old Save kippo_hard 215 points 1 day ago Pack as much Canadian Bacon as the lunchbox will fit. permalink award report block reply Klaus73 47 points 1 day ago Agreed - though I suspect the content above is rage bait given that many schools even offer bacon in the cafeteria. Also another reason I am glad my kids are in a catholic school. permalink parent award report block reply tang81 61 points 1 day ago It's rage bait now. But it'll become a thing. Rush Limbaugh always said it took about 10 years for a crazy idea that everyone flipped out about to become forced on us by leftists. permalink parent award report block reply Klaus73 6 points 1 day ago OH I think folks need to keep an eye out for sure - but this particular story is actually from October and no proof was every actually provided - but folks need that \"engagement\" I swear insta/youtube and shit are going to destroy humanity. This isn't the first time either - folks made a false claim of such in Quebec a few years back too. Its important to note Lean meats such as pork are actually recommended by the public school boards in Canada. permalink parent award report block reply LabTech 5 points 24 hours ago Yeah, they'll ask that you don't at first, then they'll try shaming you, then there'll be acts of intimidation, then outright bans that are enforced, while anything the other side does gets a pass. I think Canada's basically a lost cause at this point that'll have to collapse to get better; the trucker convoy was the last best chance to pull things back from the brink, but Trudeau pulled a page from the playbook of his favorite country, China. permalink parent award report block reply Klaus73 5 points 24 hours ago Trudeau was a maoist buttboy that actually admitted admiration by how quickly Chinese government could move due to controlling everything. permalink parent award report block reply zooty 2 points 21 hours ago It sounds like Canada will probably be banning beef before pork by all accounts. permalink parent award report block reply BeauHD 4 points 23 hours ago I miss Rush Limbaugh and the EIB Network. I'd bet my left walnut he would say on air Trump needs to stand in solidarity with them and impose tariffs on Canadian bacon! permalink parent award report block reply AmericanMan00 1 points 17 hours ago \"half my brain tied behind my back—just to make it fair\" permalink parent award report block reply The_Return_of_User_x 2 points 23 hours ago Who the fuck do they think they are forcing parents to bend the knee on what goes in their own children's mouths? Fuck you! permalink parent award report block reply Shitsbrokeyo 4 points 24 hours ago Bacon will be gone if they submit to this crap.  Let the offend parent's kids eat lunch in the gym. permalink parent award report block reply Klaus73 5 points 24 hours ago Aye I think Canada is a little bit safer due to our winters tend to deter as much Muslim migration (though Toronto is pretty bad) Texas is more their weather. If politicians ever try to ban bacon I will literally pour bacon grease everywhere Muslims hold sacred. permalink parent award report block reply CheeseAndOnion 1 points 13 hours ago I put bacon in the fucking halal coolers at the supermarket. permalink parent award report block reply Necrovoter 1 points 23 hours ago Probably based off the \"Ooooops, it was all just a miStAkE!\"  memo sent out to parents of Mere Green Primary School students  not that long ago: \" School in Sutton Coldfield blames ‘human error’ after parents wrongly told of packed lunch pork ban \" https://www.birminghammail.co.uk/news/midlands-news/school-sutton-coldfield-blames-human-32819753 permalink parent award report block reply Klaus73 1 points 23 hours ago Quite possibly - Canada has a ton of problems its got to fix but at this point the Muslopocalypse isn't in the cards...yet; right now we got a issue with a group of people shitting allover. permalink parent award report block reply Hellsbells00 0 points 22 hours ago catholic You mean globalism masquerading as christianity? permalink parent award report block reply Klaus73 2 points 21 hours ago No I mean actually catholic...not whatever weird shit the Vatican is into. permalink parent award report block reply SaltyKrakenBalls 14 points 1 day ago Bring your dog to school day. EVERY FUCKING DAY. permalink parent award report block reply 0111000001100101 14 points 1 day ago Throw said bacon at muslims.  If we can carry and exercise assault sandwiches now certainly we can be slap happy with bacon sandwiches. permalink parent award report block reply BillGateCanSuckIt 5 points 1 day ago Remember how people used to send truck loads of salt. Well maybe the muzzies should be sent bacon. Anonymous bacon mail permalink parent award report block reply etcetera 1 points 21 hours ago Comment removed by community moderators. permalink parent award report block reply bringbackthe80s 4 points 1 day ago Yep, throwing sandwiches at people is now considered a form of protected free speech. Let 'em fly! permalink parent award report block reply imnotdeadyet 4 points 1 day ago How about porkrinds? permalink parent award report block reply 0111000001100101 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply etcetera 0 points 21 hours ago Comment removed by community moderators. permalink parent award report block reply awsure 9 points 1 day ago Need a bring your pig 🐖 to school day every Friday. BBQ Thursday. Pulled Pork Monday and Pork Rib Wednesday. Tuesday and Friday dealers choice. permalink parent award report block reply 0111000001100101 4 points 1 day ago How do I join this group? permalink parent award report block reply Hawksendoom 2 points 23 hours ago I so want in XD oooh can we have a little spin wheel thingy for Thursdays and Fridays? XD to choose XD permalink parent award report block reply schiff_for_brains 4 points 1 day ago Joke's on you.  TPTB in Canada hate Canada. permalink parent award report block reply load 3 more comments... NonbinaryPotatohead 76 points 1 day ago But not for the Jewish students that have been there for decades...interesting... permalink award report block reply Major_Nutt 89 points 1 day ago Jews don't randomly explode. permalink parent award report block reply rebuildingMyself 47 points 1 day ago Just don't trust their pagers, amirite permalink parent award report block reply Liberats 1 points 23 hours ago Only exported. permalink parent award report block reply 45fan 3 points 21 hours ago It's not random with the Muzzies. permalink parent award report block reply shialecuck007 1 points 1 day ago Until you deny them their Shekels permalink parent award report block reply yarg -1 points 1 day ago They play the long con. permalink parent award report block reply YaharaRiver 29 points 1 day ago jews don’t demand that everyone follow their practices, only the pisslamics do that ☠️☪️ permalink parent award report block reply 0111000001100101 18 points 1 day ago They just kill Jesus and other leaders that are leading us out of the Babylonian system set up in ancient Egypt.  No biggie. permalink parent award report block reply Porkbut 1 points 1 day ago People who say things like this will be first in line for new babylon. permalink parent award report block reply 0111000001100101 -2 points 1 day ago It's totally fine, please calm down sir. Trust the plan, Q, watch the show.  No action is required from you.  Thank you for staying passive and calm. permalink parent award report block reply view 2 more comments... Seeker_17 -2 points 1 day ago kiLl jEsuS. LOL. How long ago was that? permalink parent award report block reply Ryker 1 points 15 hours ago Every single day permalink parent award report block reply zooty -1 points 21 hours ago Wasn't it the Romans? I guess I'll hold it against Mario. permalink parent award report block reply BonginosRac1stCowboy 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply the-new-style 5 points 23 hours ago Then you don't know what happens in Iceland when they tried to outlaw circumcisions Hint: refugees https://www.newsweek.com/icelands-jews-beat-church-taxes-circumcision-ban-now-they-even-have-rabbi-1631954 permalink parent award report block reply TrumpAndGodWin 1 points 20 hours ago Circumcisions are like a tax, unnecessarily costing a family over $1,000 per boy. permalink parent award report block reply YaharaRiver 0 points 23 hours ago just reading the link (no intention of giving Newsweek a click), I can’t even IMAGINE being interested in that! LMFAOoooo wow, you bookmarked this?!  Why?? permalink parent award report block reply the-new-style 3 points 23 hours ago No I just did a search for it, I don't need bookmarks, I remember things permalink parent award report block reply view 2 more comments... LizardKingx002 4 points 1 day ago I mean, they kinda do in roundabout ways permalink parent award report block reply 123breadman 1 points 1 day ago Even Myron Gaines (one of the biggest anti Israel podcasters) doest say it's the Jews. He says people who say that are stupid. permalink parent award report block reply MySidesGoUp 0 points 21 hours ago Usury for one?? Jews treat “gentiles” specifically…You’re being dishonest.. permalink parent award report block reply load 1 more comments... JoyousMischief 23 points 1 day ago As a raging antisemite, I'll still give you and them a W on that point. Muslims are way more directly and visibly obnoxious. permalink parent award report block reply hilboggins 3 points 23 hours ago Anti-Semite is is very inclusive of Jews and Muslims alike permalink parent award report block reply IForgotToAddAnEmail 1 points 1 day ago No they do, otherwise they wouldn't have shit like the ADL. permalink parent award report block reply Seeker_17 5 points 1 day ago LOL. That's because Jews don't eat pork either. What's more interesting is that they try to appease the muzzies, but not the Jews. permalink parent award report block reply NonbinaryPotatohead 1 points 7 hours ago exactly my point LOL permalink parent award report block reply Martinez 0 points 23 hours ago With so much in common they should get along great. permalink parent award report block reply 5DchessWatch 2 points 1 day ago If they did that, they wouldn't be able to slowly poison the gois hog meat supply /s permalink parent award report block reply load 2 more comments... O__Q OP 44 points 1 day ago And it will come to America as well. Here’s a thought, maybe, just maybe, if we didn’t import illegal “immigrant” invaders in the first place, our kids could eat whatever they want at lunch without their woke teachers and schools sending home “harmless accommodating” requests like these that actually serve to magnify said invasion. permalink award report block reply Formerlurker92 19 points 1 day ago Deport 40 million to stop the retardation permalink parent award report block reply Krat 3 points 23 hours ago 40? More like 150 permalink parent award report block reply TwoArizonaPedes 16 points 1 day ago And it will come to America as well. There's already an entire school district in the U.S. that only serves halal meals. https://archive.is/9libl permalink parent award report block reply DCYR66 9 points 1 day ago Bullshit to that! Here in the south pork bbq is practically a religion! Any raghead trying to stop that here will find lead added to their diet! permalink parent award report block reply SaltyArmyChick 2 points 22 hours ago This guy gets it lol 😂 permalink parent award report block reply first_amendment 1 points 1 day ago They said pork, so bacon is [kosher]. permalink parent award report block reply Hellsbells00 2 points 22 hours ago Bacon is pork. permalink parent award report block reply LearnAboutRoaches 1 points 1 day ago In the near future \"food status\" will replace the pronoun fad. Food disabled, sufferers of nutrition insecurity, dinner nazis, anti poultry vegans, zero footprint chefs, pork assassins, brussel sprout fascists, meal police, cooking challenged, sugar snappers etc.. Diversity is our strength permalink parent award report block reply load 5 more comments... Haiti_kid 27 points 1 day ago How about you suck on deeeeez nuts? permalink award report block reply HumanSomewhere 6 points 1 day ago Acquaint them with the methods of the Sugondese Beware the Mind Goblin permalink parent award report block reply CommanderOfCheese 6 points 1 day ago What's a mind goblin? Does it have something to do with BOFA? permalink parent award report block reply DCYR66 3 points 1 day ago With strips of bacon! permalink parent award report block reply DlanOdcammron 1 points 17 hours ago Are your nuts halal? Asking for my friend MoHAMmed. permalink parent award report block reply The_MAGA_Destroyer 24 points 1 day ago If Mrs. Maga Destroyer and I still had children in school, it would be bacon sandwiches, ham sandwiches, or ham salad, every day permalink award report block reply Seldom_Seen_Kid 3 points 1 day ago And, on Fridays…half a rack of baby backs. permalink parent award report block reply MakingArrowsOrange 21 points 1 day ago Muslim students can pack their fucking bags and go to their home countries where they don't eat pork. permalink award report block reply BlackPilledMAGA 19 points 1 day ago For fuck sake the PANDERING has got to End! How about those fucking Muslims don't come to the Western World, or anywhere else if they plan on endless protesting of the cultures in those lands? They refuse to adapt they only want to dominate. People need to open their fucking eyes. Anyone who suggests more pandering and erosion of their own society to please these Muslim invaders is just an enabler and a liability to their country. permalink award report block reply KekistanPM 12 points 1 day ago It's not so much pandering is it is an invasion through kindness. Today it's \"please don't.\" Tomorrow is \"We no longer allow.\" Next week is severe penalties if you do it even on accident. It's like when a dictator kneels down in front of your kid and says with a smile \"You don't want to be insensitive, right?\" permalink parent award report block reply stars 4 points 1 day ago Britain's trio of anglosphere colonies embody the absolute worst of modern liberalism. The pandering is deliberate, the elite of those nations at best see the country as a soulless economic zone and at worst have a genocidal hatred of the White population. permalink parent award report block reply MySidesGoUp 1 points 20 hours ago Hey you're being selfish. The rivals to those Muslims need them to pack up as they build up greater diaspora… We also have NGOs to feed. And what about the hungry elites who wanna buy kids?  You’re gonna deny them that??… permalink parent award report block reply stealthboy 15 points 1 day ago Extra bacon it is. permalink award report block reply SaltyArmyChick 2 points 22 hours ago Triple permalink parent award report block reply DlanOdcammron 1 points 17 hours ago Send the kids with a pet pig for show-and-tell. permalink parent award report block reply GA_Logic 14 points 1 day ago Canadian bacon is a national treasure that must be protected. permalink award report block reply Hellsbells00 5 points 22 hours ago Canadion bacon is just shitty ham. Real bacon is superior, even on pizza. permalink parent award report block reply SaltyArmyChick 2 points 22 hours ago Amen brother 🙏 fkn delicacy… proscuitto wrap stuffed  jalapeño is fine dining 👌 permalink parent award report block reply Formerlurker92 13 points 1 day ago I'd rather have dogs, music, bacon and freedom than sharia and violence permalink award report block reply UncleTrumpsBand 11 points 1 day ago Buy pork stock!!!! Pork go burrrrrrrrrp permalink award report block reply eddieblasphemy 10 points 1 day ago im gonna smuggle.va hams into Canada. whos with me? permalink award report block reply SaltyArmyChick 1 points 22 hours ago 🤜🤛🥓🥓🥓 permalink parent award report block reply Dev404 10 points 1 day ago Ah yes, everyone must cater to the goatfucking muslims who don't have to cater to anyone. Enjoying feminism, yet? permalink award report block reply Metal4Freedom 10 points 1 day ago DEPORT ALL MUSLIMS permalink parent award report block reply JamesBond007 10 points 1 day ago Yeah, my kid would be eating Pork Ribs every day and then play \"Smear The Muzzy\" with dripping fingers. permalink award report block reply Haiti_kid 10 points 1 day ago How about you suck on deeeeez nuts? permalink award report block reply DCYR66 3 points 1 day ago And the meat popsicle to go with it. permalink parent award report block reply try4gain PRO 9 points 1 day ago the modern Crusades will be way more offensive permalink award report block reply TwoArizonaPedes 9 points 1 day ago Fight back! It begins by getting together a group of like-minded patriots. Start with your church and your friends and grow from there. Set up a phone tree. Use burner phones. Don't text. Organize, coordinate, think, be creative! You already know how to respond to their street-blocking \"prayers.\" Pick a name or organization and get involved. permalink award report block reply the_malcontent 9 points 1 day ago Hope my kids like BLTs, cause that's what they would have for lunch from now on. permalink award report block reply CommanderOfCheese 5 points 1 day ago BLTs minus the LT. permalink parent award report block reply Maga305_47 9 points 1 day ago Conclusion. Muslim kids steal lunches. permalink award report block reply YaharaRiver 3 points 24 hours ago HA! 🤣👍 There really is no other reason to henpeck children about their lunch, is there. Well done. permalink parent award report block reply grantking2256 8 points 1 day ago If real, have you seen the price of chicken vs beef vs pork. Fuck you. Pork is SOOOOOO MUCH cheaper permalink award report block reply KernalMustard 1 points 24 hours ago Producers also get next to nothing for pork. Semi exotic meats lile Goat and Emu get the highest prices. Cattle are somewhere from low to mid. permalink parent award report block reply Coprolite 8 points 1 day ago I once microwaved ham in the work microwave that was labeled \"halal food only \" nothing happened so I guess ham is halal compatible. permalink award report block reply OnlyTrump20 6 points 1 day ago Microwaving fish is the only workplace crime I know of. permalink parent award report block reply DlanOdcammron 2 points 17 hours ago It’s in the name of MoHAMmed. permalink parent award report block reply KekistanPM 7 points 1 day ago \"Hey son did you pack the triple BLT melt I made for you?\" permalink award report block reply OnlyTrump20 6 points 1 day ago Tell them your bacon is turkey bacon and offer the muslim kids a piece. permalink award report block reply conservatarian 6 points 1 day ago MORE PORK permalink award report block reply roflcopt0rz_returns 5 points 22 hours ago The only reason why the commies are doing this for the mooslims is that they know the mooslims will actually get off their asses and do something if they need to. They know the mooslims will actually stack fucking bodies. The commies meanwhile bully the whypipo because they know whypipo, even the \"far right\", won't actually do shit. Remember, you get the government you tolerate. permalink award report block reply Pappy_Gunn 5 points 1 day ago Sauce?  Name the school or GTFO. permalink award report block reply cptkloss5 3 points 1 day ago yeah it's bullshit - 100% people shouldn't be falling for this low effort crap. but no, instead it's getting stickied. permalink parent award report block reply Pappy_Gunn 2 points 1 day ago There are plenty of shenanigans going on in schools that you don't have to make shit up.  Pedos, LGBT propganda, grooming material in libraries, DEI, kids not being disciplined, kids forced to attend a Muslim service, etc. permalink parent award report block reply magnokor 2 points 23 hours ago It is real enough, everywhere. The city councils, the corporations, they are happy to ban ham. For Canada, to appease all their invaders, they will ban ham, bacon, beef.  Eventually, the few Old Stock Canadians left will only be able to consume vegetables, dirt, and bags of milk. This is CBC: Jul 9, 2024 KFC in Canada now requires nearly all of its Ontario restaurants to serve halal chicken and eliminate pork products KFC removes pork and converts to halal - Toronto 99 . England too. Subway removes ham and bacon from nearly 200 stores and offers halal meat only after 'strong demand' from Muslims https://www.dailymail.co.uk/news/article-2616576/Subway-removes-ham-pork-nearly-200-stores-strong-demand-Muslims-eat-Halal-meat.html permalink parent award report block reply Tellsyouhow 4 points 1 day ago In the UK there's a trend of abattoirs becoming Muslim Halal abattoirs. Because Muslims won't buy non halal meat and are growing in numbers, but Christians don't care. Big companies therefore switch to Halal abattoirs and put normal ones out of business. (While you eat meat blessed in the name of Islam) permalink award report block reply BidenShowerDrool 6 points 1 day ago (While you eat meat blessed in the name of Islam) it's the manner in which the animal is killed which is the distressing part. No-one cares about the blessing. The animal has it's throat slit while alive and it bleeds out to death. This can take several minutes of excruciating pain before the animal dies. The west has done everything to make the kill as quick and as painless as possible for the animals but Muslims insist on prolonged death practices due to their Satanic practices. permalink parent award report block reply MissPatriot713 3 points 1 day ago Honestly, kosher slaughter is the same! Many slaughterhouses only perform kosher slaughter in cities with large Jewish populations. Inherently cruel as the animal is hung upside down ( many tear limbs) while their throats are cut and they bleed out... permalink parent award report block reply BidenShowerDrool 3 points 23 hours ago yeh...i think you are right with this...this is just another part of the old testament the pedophile prophet used for his fake religion. permalink parent award report block reply CaJuN-Polak 4 points 23 hours ago So what? I'll pack ham sandwiches and PB&Js ... so those with nut allergies don't feel left out. permalink award report block reply getup 3 points 1 day ago I already knew this would be some faggot talking tiktok style like a woman before I even clicked on this post. How about show the email? I wouldn't doubt canacucks are subject to this, however this reeks of ragebait here. permalink award report block reply 1_Badcop 3 points 22 hours ago My kid would get a pork chop sandwich, with extra bacon, everyday. permalink award report block reply AbrahamLincoln 3 points 1 day ago Maybe they should piss off back to goatfuckistan then. permalink award report block reply Freefertilizer 3 points 1 day ago Fake news/Rage Bait.. why are we okay with some guy being gay in a tiktok video and taking that as fact? Show proof besides some guy in a video saying for rage bait. permalink award report block reply getup 4 points 1 day ago Thank you. This guy says an email was sent out. So...show it? This tiktok style brainrot is so beyond annoying. permalink parent award report block reply DeltaSierra 1 points 1 day ago This shit is coming from Marxists that have invaded this site … the Donald has gone in the shitter permalink parent award report block reply POTUS_DonnieJ 3 points 21 hours ago It is every Canadian's duty to pack bacon cheeseburgers for their kids every day. Bacon to ward off the muzzies, beef to ward off the jeets. permalink award report block reply DiamondDroid 3 points 21 hours ago Two or three double bacon sandwiches and baked ham to trade with his classmates. permalink award report block reply DeepStateParasite 3 points 21 hours ago How about those schools ban people who fuck kids and animals? Nah, they don't have the guts for that, too many of their parents and teachers likely to be offended, permalink award report block reply TheGrooter 3 points 22 hours ago BLTs every day all day...and take some to share permalink award report block reply cchris_39 3 points 21 hours ago My kids would have BLT’s every day. permalink award report block reply Nanteen 3 points 23 hours ago My kids would go to school with 2 -1lb each bacon sandwichs every day permalink award report block reply Honkey_McCracker 3 points 1 day ago I would tell them that they should ask moslem students to refrain from packing halal foods in their lunchboxes since that food had been offered as a blessing to Satan and see what the response would be. permalink award report block reply iamimaginos 3 points 1 day ago Ham and Cheese it is, every fucking day permalink award report block reply Tuggy_McTuggboat 2 points 21 hours ago Thank you for letting me know. My child's next lunch: Bacon wrapped porkchops, jalapeno poppers, bacon grease rubbed twice baked potato wedges with bacon and bacon cheddar and a big ass bowl of berry gelatin. permalink award report block reply magamagamaga123 2 points 1 day ago I am offended by people who do not eat pork. permalink award report block reply Wallllllllllllllllll 2 points 1 day ago The solution to the problem people being offended is let them be offended. Do not change your behavior. Do not apologize. Islam will not change for you. This is what people mean when they say Islam is not compatible with the West. They will invade your country, get themselves on welfare, turn your country into a shithole, and complain about the way you live your life while they destroy your country. Send them back to their own shithole. permalink award report block reply Fren20 2 points 22 hours ago Try spam 😂😂😂 permalink award report block reply RedEnsign4Trump 2 points 1 day ago Too many men in Canada and the US talk and act like women. permalink award report block reply YaharaRiver 2 points 24 hours ago Tis the muslim influence! They wear flowing gowns and go all Carrie Nation wherever real men congregate! permalink parent award report block reply Silentbutdeadly 2 points 23 hours ago Fuck them.  Send their asses packing back home and send you kid to school with his or her ham Sammie! permalink award report block reply SaltyTitties4 2 points 1 day ago That’s crazy, yes… do not comply, Canadians! But damn this guy isn’t making a case for sanity, with that..child? adult?…on his head with the absolute psycho eyes. permalink award report block reply ACActual 2 points 22 hours ago Where did you think voting for Globalist was going to end up?   More or less immigration? permalink award report block reply ianpatrick1966 2 points 23 hours ago My kid would get so many BLTs permalink award report block reply Ferretman 2 points 21 hours ago Up yours, Canada. permalink award report block reply raptormissle 2 points 21 hours ago Pork it up. Make the lunch bag out of pork. permalink award report block reply TrumpYouMagaFrenner 2 points 1 day ago If youre a muzzie youre a faggot and a retard permalink award report block reply Wrexxis780 2 points 22 hours ago Wrap everything in bacon permalink award report block reply OpusX 2 points 24 hours ago Meanwhile, Christian parents who object to their children being taught pornography and gender ideology are called 'hateful' and 'extremists'. permalink award report block reply shialecuck007 2 points 1 day ago Start printing school shirts for the kids that say \"Allah loves Bacon!\" permalink award report block reply Redpilled2Depression 2 points 24 hours ago Oh I hate them, I hate Muslims so Goddamn much permalink award report block reply Rango 2 points 21 hours ago BLT's all around. permalink award report block reply Bldg_2019 2 points 1 day ago Oh it will? We’re not subjects to the faggot british monarchs. Canada is. No, this isn’t inevitable in America at all. Canada was never free and has always been a latent enemy of the US. permalink award report block reply TwoArizonaPedes 6 points 1 day ago There's already an entire school district in the U.S. that only serves halal meals. https://archive.is/9libl permalink parent award report block reply stars 1 points 1 day ago They aren't subject either, the British monarchy has zero power and hasn't for centuries, it's the leftist race traitor that is facilitating this poison and they are doing the same here. permalink parent award report block reply Bldg_2019 -1 points 1 day ago Who does the Canadian PM swear loyalty to? The faggot british throne. Apparently an easy trick to fool morons into believing they don’t exist anymore. permalink parent award report block reply stars 1 points 1 day ago Doesn't matter, show me one instance of Charles directing Canadian policy or governance. permalink parent award report block reply Bldg_2019 -1 points 1 day ago Uh, the part where the PM swears loyalty to the throne. You’re a slave. Wake up. permalink parent award report block reply view 2 more comments... PhantomShield72 2 points 1 day ago So sick of this shit. And leftists will cave to the ever increasing demands. Meanwhile, they will treat Christians as though they're a threat... Unbelievable. permalink award report block reply DCYR66 2 points 1 day ago 🖕Muslims!!!! Have a pork bbq in their honor! permalink award report block reply MagaChamp253 2 points 1 day ago THE PACKING JUST GOT 10 FEET TALLER permalink award report block reply Big-E 2 points 1 day ago My religion requires me to eat pork every day. permalink award report block reply Lovethatorangeman 2 points 1 day ago Get bent permalink award report block reply corntortilla 2 points 21 hours ago How about NO. permalink award report block reply SGT_Glowie 2 points 1 day ago my 10 month old will only eat bacon and pickles.\nI had dreams non stop the other night that muzzies were tampering and poisoning all the pork in stores. Sick of these people permalink award report block reply YaharaRiver 2 points 24 hours ago Slip in some bananas and potatoes, your child has a salt craving.  Needs a bit of potassium to calm that down. permalink parent award report block reply MAGASquatch 2 points 21 hours ago Love me some bacon wrapped bacon sandwiches deep fried in bacon grease and sprinkled with chopped bacon bits and a hint of maple syrup. permalink award report block reply YT45 2 points 1 day ago Let the ham sandwiches and pork chops flow! Oink oink, hajji faggots! permalink award report block reply Keep_on_winning_kag 2 points 10 hours ago Muslims religion is offensive to me. permalink award report block reply CanadianMeathead 2 points 22 hours ago Not in my home school, we have bacon a few times per week. permalink award report block reply Faintlight 2 points 1 day ago I'm not even cool when they try to tell kids they can't have peanut products because of life-or-death allergies. If kids have allergies, the schools should let them eat in a different smaller room. You can't mess with the all for the few. permalink award report block reply alucard13mmfmj 2 points 1 day ago So no pork cause of muzzies. And no beef cause of jeets.. nice. permalink award report block reply The_Yakuza 2 points 22 hours ago A slice of bacon a day keeps the hijabs away. But seriously fuck you pedo worshiping goat fuckers permalink award report block reply LightBeacons 2 points 1 day ago Get bags of pig guts from local butcher shops and spread it all around outside the cafeteria of these schools. Throw in a few pig heads as well. permalink award report block reply Sparks1017 2 points 1 day ago I'd be trotting a whole hog into the lunchroom, on a leash to make sure you were really offended permalink award report block reply 5DchessWatch 2 points 1 day ago Hear me out: \"Nano Porkticulate chemtrails\" permalink award report block reply FearGodTheAlmighty 2 points 1 day ago Pisslam is piss permalink award report block reply Bramage 2 points 1 day ago FUCK degenerate islam. permalink award report block reply Easzq8 2 points 1 day ago I don’t like to fuck kids so I guess that offends scuzzlims as well. permalink award report block reply DontTreadOnLego 2 points 1 day ago Bacon is muzzie repellant permalink award report block reply Moebius 2 points 1 day ago I'm offended they're offended. permalink award report block reply CaffeineJ 2 points 23 hours ago Bacon 🥓 its what is for lunch permalink award report block reply kesh2011 2 points 1 day ago BLT’s and ham sandwiches coming up! permalink award report block reply The_RedWolf 2 points 21 hours ago While I never liked ham sandwiches, I'd be pissed the hell off at not being able to have the option for such a stupid reason. permalink award report block reply Don-O-Mite 2 points 23 hours ago bacon every day then. permalink award report block reply Duke442games 2 points 1 day ago My kids would get sick of all the pork they are going to get after this. permalink award report block reply Kiwipede22 2 points 1 day ago Call it veal… most of the left wing lunatics do not eat meat so they would not be able to tell difference.  Give your child crispy bacon in their lunch box every day. permalink award report block reply OnlyTrump20 3 points 1 day ago Pork roast can look just like beef. permalink parent award report block reply AbsurdOpinion 2 points 24 hours ago I would ask parents not to bring their muslim kids to school as they are offensive to civilization. permalink award report block reply SonofAnu 2 points 24 hours ago Peanut butter and bacon sammies for all the lil cuckadian weebs permalink award report block reply RobinNet 1 points 1 day ago Time to open up BBQ rib joints next to mosques. Sack up, king worshippers! Oh- and take the Canadian land way from king Chuckie, who owns 92% of your country. permalink award report block reply Timbo1965 1 points 1 day ago I'd pack a 20lb ham, and carve it up and hand it out permalink award report block reply FusionBlack 1 points 18 hours ago Why do I get this feeling a lot of us will be fighting Canada and half of our own country within 10 years if not sooner? permalink award report block reply friedchicken 1 points 24 hours ago Please someone explain wtf permalink award report block reply LearnAboutRoaches 1 points 1 day ago Ban soggy pickles! permalink award report block reply Meatbank84 1 points 1 day ago This is what you get when you import Islam and call it \"diversity\" permalink award report block reply Liberats 1 points 23 hours ago Just tell them it's offensive to arrive in another country and demand accommodations for their feelings. permalink award report block reply based_trekkie 1 points 1 day ago Canada is so cucked they cannot pack school lunches for their kids that contain a Canadian ingredient! permalink award report block reply HoldMyDangle 1 points 19 hours ago You've been overrun Canada man. Let this be a lesson the the Americans on here. They are the religion of Pieces and wont stop until they can fuck every goat in thr country. permalink award report block reply AwShitHereWeGoAgain 1 points 24 hours ago FUCK YOU.  Nuke Cananada. permalink award report block reply tax_collector 1 points 17 hours ago Ham and bacon sandwiches all day long mfers... permalink award report block reply TrumpLandslide20201 1 points 1 day ago I would bring open face BLT every day for lunch with extra bacon permalink award report block reply Thune 1 points 1 day ago Canada is Dar Al-Harb.  Repel the invasion, or they will destroy you. permalink award report block reply Jmricht 1 points 1 day ago More bacon permalink award report block reply OldWhiteMale 1 points 24 hours ago Parents in Canada should ask schools not to pack Muslims in their classrooms. Or their country. permalink award report block reply EastTexasMadLad 1 points 24 hours ago Every single day, bacon sandwich, blts permalink award report block reply ShotgunParade69x 1 points 24 hours ago This next move is called “the Canadian bowdown” permalink award report block reply MisprisionIsEvil 1 points 20 hours ago Pack BLT sammiches. permalink award report block reply TheSonOfGadsden 1 points 1 day ago Canada continues to reach new levels of stupidity permalink award report block reply EADReddit 1 points 1 day ago Fucking Hammy & Cheese everyday with a side of bacon permalink award report block reply sicarius 1 points 23 hours ago BLTs it is permalink award report block reply hey_spike 1 points 24 hours ago Note to parents of Muslim students: Bacon and other pork products are consumed at this school. Please consider relocating back to your country of origin. permalink award report block reply Tongs_Ya_Bass 1 points 1 day ago Packs ham hock permalink award report block reply barronwin 1 points 24 hours ago dumb. But I do remember being asked to not pack peanut butter because of some kid's deathly allergies permalink award report block reply entERmyMAtrix 1 points 24 hours ago Send them to school with a pound of real bacon. 🥓 🥓🥓🥓🥓🥓 permalink award report block reply Maskurbator 1 points 18 hours ago 100% pork it is then. permalink award report block reply Pede 1 points 1 day ago Next, students must participate in the Muslim calls to prayer during the day. They don't have to speak it but they must do the movements. Then, students must speak it and believe in it. Your daughter doesn't have to wear a hijab but she must exercise respect by wearing a little more clothes than normal. Next, your daughter must wear a hijab or she is responsible for triggering the uncontrollable rape instincts of her male classmates. permalink award report block reply barwhack 1 points 24 hours ago Canadian Bacon is now gay. permalink award report block reply larrry 1 points 23 hours ago murray, you sure you can;'t fit 2 pigs in your lunch box???? permalink award report block reply Nate_Higgersalot 1 points 17 hours ago Fake. That’s one ugly kid. permalink award report block reply JamesBlomey 1 points 21 hours ago What a bunch of bologna! permalink award report block reply MorningFrost 1 points 24 hours ago Yes bring the immigrant guests into the country and cater to them. permalink award report block reply popcycle 1 points 1 day ago peanut butter and bacon it is permalink award report block reply Olderbutwiser 1 points 23 hours ago Next week ,no meat it will offend the Hindu vegetarians! permalink award report block reply DeltaSierra 1 points 1 day ago yet another dumb shit post from a dumb fuk that is fake … leftists have destroyed the Donald permalink award report block reply Iranhasnukes 1 points 23 hours ago Grok says this is fake, and from 2014 permalink award report block reply bringbackthe80s 1 points 1 day ago Bacon and ham every fucking day. The proliferation of the bed sheet wearers must be stopped. permalink award report block reply GuerillaYourDreams 1 points 1 day ago Too. Fucking. Bad. permalink award report block reply TheLeftIsAntiRight 1 points 24 hours ago Coming to a NYC public school near you! permalink award report block reply blueeyephoto 1 points 1 day ago i'd pack my kids a BLT sandwich, but replace the LT with more Bacon permalink award report block reply BurtMcGirt 1 points 18 hours ago Big Mike packed the pork into a Muslim. permalink award report block reply Lawless 1 points 23 hours ago Today's leftist love Muslims for some reason permalink award report block reply Roadpower 1 points 1 day ago lmao, they're literally a self conquering society. permalink award report block reply ShitFromShinola 1 points 23 hours ago My kids would be getting BLT's five days per week. And I'd be packing pork rinds instead of chips. permalink award report block reply Roadpower 2 points 21 hours ago Pork rinds are better than chips anyway. permalink parent award report block reply JoinTheDiscussion 1 points 20 hours ago Give them BLTs for lunch every day! permalink award report block reply Seldom_Seen_Kid 1 points 1 day ago My kid would be hauling a pork butt to school for lunch. permalink award report block reply 5DchessWatch 1 points 1 day ago I think the USA citizenship test should require an oath of loyalty that comes in the form of eating a slice of crispy bacon I dont' trust ANYONE who doesn't like them some bacon permalink award report block reply CheeseAndOnion 1 points 13 hours ago If i had kids there they would be getting BLT, ham porkchops etc. permalink award report block reply Constitution_1788 1 points 24 hours ago I’d wrap my daughter in a Lady-GaGa-style bacon dress with pig’s feet shoes and do her hair with pork grease. permalink award report block reply YaharaRiver 1 points 24 hours ago no you wouldn’t 🙄 permalink parent award report block reply Constitution_1788 2 points 20 hours ago Nah. You’re right. permalink parent award report block reply BartzFFV 1 points 1 day ago My kid all of a sudden identifies as a piggy pig.  I know its experimental, so I'm going to let them wear their piggy nose and ears to school. permalink award report block reply KungPaoMcChicken 1 points 1 day ago Me at work: microwave the pork belly for 2 minutes sending a spray of pork popping everywhere inside the microwave. Cop that Muslim fuckers. permalink award report block reply Unboosted 1 points 1 day ago Pigs are for pleasure - old muslim adage. This is why they dont eat pork. Bottom line is if they could breed themselves using pigs they would kill off all their women immediatley. permalink award report block reply GuerillaYourDreams 1 points 1 day ago Maybe that’s why Jesus cast the demons into the swine? permalink parent award report block reply jdovejr 1 points 1 day ago Fuck em permalink award report block reply I_Love_45-70_Gov 1 points 24 hours ago Only Pack Pork Butthole - FTW! permalink award report block reply Nellie_the_Beaut 1 points 21 hours ago Today’s Sack Lunch Menu🥪: Black Forest Ham & Swiss Sandwich on Jewish Rye Sticky BBQ pork short ribs Deviled Ham w/crackers Garden salad with Bacon bits & Bacon Chipotle Ranch Sweet & Spicy Pork Rinds Chocolate Zingers permalink award report block reply Fuck_commies_2024 1 points 1 day ago So bacon wrapped bacon it is! permalink award report block reply dres3 1 points 1 day ago Is there any part of muslim food (for children) that is a common part of aphrodisiacs? Afterall, we don't want the horrible children to be sexually assaulting the muslim children. Pre-adult hormones and all. They wanna be ridiculous, we can be as well. permalink award report block reply DoMagnum 1 points 19 hours ago Don't like it, then go back to Dunecoonistan! permalink award report block reply jimzumaca 1 points 20 hours ago The goat fuckers can eat somewhere else that isn't haram. permalink award report block reply ElectionMeddler 1 points 21 hours ago So are Muslims the only group they aren't actively trying to make gay or Trans? permalink award report block reply Uffda 1 points 24 hours ago I had an Uncle (RIP) Pinky who was a non religious jew. He used to feed the little boy from upstairs (from a kosher family) pork chops. Pinky told the kid it was “bone meat” and not to tell his parents. permalink award report block reply booblitchutz 1 points 1 day ago Canada is so cooked permalink award report block reply DeltaSierra 0 points 1 day ago It is the Donald that is cooked with absolute bull crap posts that people pull out of their asses …. Fake as shit and you all fall for it permalink parent award report block reply gb1787 1 points 1 day ago Now I’m going to ham even harder permalink award report block reply DuesImperator 1 points 1 day ago Hmmm let me plan some packed lunches……..lham and cheese sandwiches, pepperoni sticks, hot dogs, pepperoni or Hawaiian pizza, bologna sandwiches, bacon, crackers with cheese and farmer sausage, baked goods made with lard, leftover ribs etc. permalink award report block reply MudDog 1 points 17 hours ago they're worried once the muslim kids try bacon, it's over permalink award report block reply CharlesWilliams 1 points 16 hours ago Peanut butter n bacon.  Yeah boy. permalink award report block reply Maxmax 1 points 24 hours ago Fuck that. permalink award report block reply thejohnson651 1 points 1 day ago Guess what? Don't care about your dumb ideology. permalink award report block reply bubadmt 1 points 1 day ago X to doubt.. Engagement farming is as bad, if not worse, now on X from the right since Elon took over than it was from the left during COVID. permalink award report block reply Stanwyk74 1 points 1 day ago Trojan horse inviting morons!!!!!! permalink award report block reply Smurfection 1 points 1 day ago This is insane.  If muslims are going to live in a democracy, they have to peacefully coexist with other who don't follow their dietary laws.   The brazen gull of schools to even ask parents to change the way they feed their kids to accommodate Muslims!  Frankly, if this happened in the U.S. I think there would be a Freedom of religion lawsuit because schools would be asking Christian parents to abide by a Muslim dietary law. permalink award report block reply DlanOdcammron 1 points 17 hours ago Is MoHAMmed halal? permalink award report block reply HenkZeilstra 1 points 24 hours ago Well thank the 🧃🧃, for the diversity permalink award report block reply GhostOfTheRepublic 1 points 24 hours ago More pork!!!  And bacon!!!! And even the fake bacon that’s really ham!! permalink award report block reply Drdonaldjtrump1776 1 points 1 day ago No PB and J allowed because if allergies, no ham, wtf r they supposed to eat? permalink award report block reply ingrowntoenail 1 points 24 hours ago I'd be smoking so much pork for my kid take to school to share with anyone that wanted it.  If you catch the pork bone-in butt on sale at Kroger you can stock up pretty good. permalink award report block reply WhoMeTwo 1 points 1 day ago Not only pack copious pounds of bacon, encourage all to partake in the lovely pork-a- palozza... (~_^) permalink award report block reply DJT4MoreYears 1 points 20 hours ago Don't bring your religion into your school. Remember? Separation of church and state. And your mudslime(or jew food) is offensive to Canadian kids. So how about you get the fuck out of their schools and get the fuck out of their country and guess what? Everything and everyone will be fine. permalink award report block reply GentleSlayer 1 points 1 day ago Let us all quietly reflect on the offensive perfection of the bacon cheeseburger. permalink award report block reply RandyQuaidsBeard 1 points 1 day ago Every food item I send would be made of pork. I'd weave a pair of pants and a shirt out of bacon and send my kid to school in that. Fuck them. permalink award report block reply sarsaparilla 1 points 16 hours ago Dude sounds gay af and is whining on social media like a 16 year old girl. permalink award report block reply Jesse3000 1 points 20 hours ago So they don't want you to send your Canadian Citizen student to Canadian School with a Canadian Ham Sandwich.  If you don't comply we'll have to make it a law punishable by euthanisia of  both parents and child at the citizens expense. permalink award report block reply Firespawn 1 points 15 hours ago BLT's with some pork n beans it is. Let's say grace.\nSmile with every bite. Fuck muzzies. permalink award report block reply ancroidubh 1 points 9 hours ago There is no food but pork and bacon is its prophet… permalink award report block reply lifeisahologram 1 points 1 day ago Yeah if I was a Canadian parent I would be packing pork everything. permalink award report block reply DeltaSierra 0 points 1 day ago You are not and you would be a dumb ass to add pork to everything because of some dum fuk Marxist that is shilling the Donald with fake trash posts permalink parent award report block reply King_Boobus_Toobus 1 points 19 hours ago BLTs every day then it is... permalink award report block reply ILoveSilk 0 points 23 hours ago And parents will oblige. permalink award report block reply lrdrokol 0 points 1 day ago This is being touted as FALSE NEWS by many Fact Checkers and GROK. Lots of Schemers in this site. permalink award report block reply 5DchessWatch 0 points 1 day ago This is so 4 weeks ago news permalink award report block reply Dantalian 0 points 24 hours ago How did Muslims take over ALL the Western \"democracies?\" permalink award report block reply RudeFrog 0 points 1 day ago I find being Muslim is offensive so now Canada has to ban Muslimx permalink award report block reply expertnoticer 1 points 19 hours ago Comment removed by community filter, pending further review. permalink award report block reply Knockoff 1 points 1 day ago Comment removed by community filter, pending further review. permalink award report block reply\nkippo_hard 215 points 1 day ago Pack as much Canadian Bacon as the lunchbox will fit. permalink award report block reply Klaus73 47 points 1 day ago Agreed - though I suspect the content above is rage bait given that many schools even offer bacon in the cafeteria. Also another reason I am glad my kids are in a catholic school. permalink parent award report block reply tang81 61 points 1 day ago It's rage bait now. But it'll become a thing. Rush Limbaugh always said it took about 10 years for a crazy idea that everyone flipped out about to become forced on us by leftists. permalink parent award report block reply Klaus73 6 points 1 day ago OH I think folks need to keep an eye out for sure - but this particular story is actually from October and no proof was every actually provided - but folks need that \"engagement\" I swear insta/youtube and shit are going to destroy humanity. This isn't the first time either - folks made a false claim of such in Quebec a few years back too. Its important to note Lean meats such as pork are actually recommended by the public school boards in Canada. permalink parent award report block reply LabTech 5 points 24 hours ago Yeah, they'll ask that you don't at first, then they'll try shaming you, then there'll be acts of intimidation, then outright bans that are enforced, while anything the other side does gets a pass. I think Canada's basically a lost cause at this point that'll have to collapse to get better; the trucker convoy was the last best chance to pull things back from the brink, but Trudeau pulled a page from the playbook of his favorite country, China. permalink parent award report block reply Klaus73 5 points 24 hours ago Trudeau was a maoist buttboy that actually admitted admiration by how quickly Chinese government could move due to controlling everything. permalink parent award report block reply zooty 2 points 21 hours ago It sounds like Canada will probably be banning beef before pork by all accounts. permalink parent award report block reply BeauHD 4 points 23 hours ago I miss Rush Limbaugh and the EIB Network. I'd bet my left walnut he would say on air Trump needs to stand in solidarity with them and impose tariffs on Canadian bacon! permalink parent award report block reply AmericanMan00 1 points 17 hours ago \"half my brain tied behind my back—just to make it fair\" permalink parent award report block reply The_Return_of_User_x 2 points 23 hours ago Who the fuck do they think they are forcing parents to bend the knee on what goes in their own children's mouths? Fuck you! permalink parent award report block reply Shitsbrokeyo 4 points 24 hours ago Bacon will be gone if they submit to this crap.  Let the offend parent's kids eat lunch in the gym. permalink parent award report block reply Klaus73 5 points 24 hours ago Aye I think Canada is a little bit safer due to our winters tend to deter as much Muslim migration (though Toronto is pretty bad) Texas is more their weather. If politicians ever try to ban bacon I will literally pour bacon grease everywhere Muslims hold sacred. permalink parent award report block reply CheeseAndOnion 1 points 13 hours ago I put bacon in the fucking halal coolers at the supermarket. permalink parent award report block reply Necrovoter 1 points 23 hours ago Probably based off the \"Ooooops, it was all just a miStAkE!\"  memo sent out to parents of Mere Green Primary School students  not that long ago: \" School in Sutton Coldfield blames ‘human error’ after parents wrongly told of packed lunch pork ban \" https://www.birminghammail.co.uk/news/midlands-news/school-sutton-coldfield-blames-human-32819753 permalink parent award report block reply Klaus73 1 points 23 hours ago Quite possibly - Canada has a ton of problems its got to fix but at this point the Muslopocalypse isn't in the cards...yet; right now we got a issue with a group of people shitting allover. permalink parent award report block reply Hellsbells00 0 points 22 hours ago catholic You mean globalism masquerading as christianity? permalink parent award report block reply Klaus73 2 points 21 hours ago No I mean actually catholic...not whatever weird shit the Vatican is into. permalink parent award report block reply SaltyKrakenBalls 14 points 1 day ago Bring your dog to school day. EVERY FUCKING DAY. permalink parent award report block reply 0111000001100101 14 points 1 day ago Throw said bacon at muslims.  If we can carry and exercise assault sandwiches now certainly we can be slap happy with bacon sandwiches. permalink parent award report block reply BillGateCanSuckIt 5 points 1 day ago Remember how people used to send truck loads of salt. Well maybe the muzzies should be sent bacon. Anonymous bacon mail permalink parent award report block reply etcetera 1 points 21 hours ago Comment removed by community moderators. permalink parent award report block reply bringbackthe80s 4 points 1 day ago Yep, throwing sandwiches at people is now considered a form of protected free speech. Let 'em fly! permalink parent award report block reply imnotdeadyet 4 points 1 day ago How about porkrinds? permalink parent award report block reply 0111000001100101 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply etcetera 0 points 21 hours ago Comment removed by community moderators. permalink parent award report block reply awsure 9 points 1 day ago Need a bring your pig 🐖 to school day every Friday. BBQ Thursday. Pulled Pork Monday and Pork Rib Wednesday. Tuesday and Friday dealers choice. permalink parent award report block reply 0111000001100101 4 points 1 day ago How do I join this group? permalink parent award report block reply Hawksendoom 2 points 23 hours ago I so want in XD oooh can we have a little spin wheel thingy for Thursdays and Fridays? XD to choose XD permalink parent award report block reply schiff_for_brains 4 points 1 day ago Joke's on you.  TPTB in Canada hate Canada. permalink parent award report block reply load 3 more comments...\nKlaus73 47 points 1 day ago Agreed - though I suspect the content above is rage bait given that many schools even offer bacon in the cafeteria. Also another reason I am glad my kids are in a catholic school. permalink parent award report block reply tang81 61 points 1 day ago It's rage bait now. But it'll become a thing. Rush Limbaugh always said it took about 10 years for a crazy idea that everyone flipped out about to become forced on us by leftists. permalink parent award report block reply Klaus73 6 points 1 day ago OH I think folks need to keep an eye out for sure - but this particular story is actually from October and no proof was every actually provided - but folks need that \"engagement\" I swear insta/youtube and shit are going to destroy humanity. This isn't the first time either - folks made a false claim of such in Quebec a few years back too. Its important to note Lean meats such as pork are actually recommended by the public school boards in Canada. permalink parent award report block reply LabTech 5 points 24 hours ago Yeah, they'll ask that you don't at first, then they'll try shaming you, then there'll be acts of intimidation, then outright bans that are enforced, while anything the other side does gets a pass. I think Canada's basically a lost cause at this point that'll have to collapse to get better; the trucker convoy was the last best chance to pull things back from the brink, but Trudeau pulled a page from the playbook of his favorite country, China. permalink parent award report block reply Klaus73 5 points 24 hours ago Trudeau was a maoist buttboy that actually admitted admiration by how quickly Chinese government could move due to controlling everything. permalink parent award report block reply zooty 2 points 21 hours ago It sounds like Canada will probably be banning beef before pork by all accounts. permalink parent award report block reply BeauHD 4 points 23 hours ago I miss Rush Limbaugh and the EIB Network. I'd bet my left walnut he would say on air Trump needs to stand in solidarity with them and impose tariffs on Canadian bacon! permalink parent award report block reply AmericanMan00 1 points 17 hours ago \"half my brain tied behind my back—just to make it fair\" permalink parent award report block reply The_Return_of_User_x 2 points 23 hours ago Who the fuck do they think they are forcing parents to bend the knee on what goes in their own children's mouths? Fuck you! permalink parent award report block reply Shitsbrokeyo 4 points 24 hours ago Bacon will be gone if they submit to this crap.  Let the offend parent's kids eat lunch in the gym. permalink parent award report block reply Klaus73 5 points 24 hours ago Aye I think Canada is a little bit safer due to our winters tend to deter as much Muslim migration (though Toronto is pretty bad) Texas is more their weather. If politicians ever try to ban bacon I will literally pour bacon grease everywhere Muslims hold sacred. permalink parent award report block reply CheeseAndOnion 1 points 13 hours ago I put bacon in the fucking halal coolers at the supermarket. permalink parent award report block reply Necrovoter 1 points 23 hours ago Probably based off the \"Ooooops, it was all just a miStAkE!\"  memo sent out to parents of Mere Green Primary School students  not that long ago: \" School in Sutton Coldfield blames ‘human error’ after parents wrongly told of packed lunch pork ban \" https://www.birminghammail.co.uk/news/midlands-news/school-sutton-coldfield-blames-human-32819753 permalink parent award report block reply Klaus73 1 points 23 hours ago Quite possibly - Canada has a ton of problems its got to fix but at this point the Muslopocalypse isn't in the cards...yet; right now we got a issue with a group of people shitting allover. permalink parent award report block reply Hellsbells00 0 points 22 hours ago catholic You mean globalism masquerading as christianity? permalink parent award report block reply Klaus73 2 points 21 hours ago No I mean actually catholic...not whatever weird shit the Vatican is into. permalink parent award report block reply\ntang81 61 points 1 day ago It's rage bait now. But it'll become a thing. Rush Limbaugh always said it took about 10 years for a crazy idea that everyone flipped out about to become forced on us by leftists. permalink parent award report block reply Klaus73 6 points 1 day ago OH I think folks need to keep an eye out for sure - but this particular story is actually from October and no proof was every actually provided - but folks need that \"engagement\" I swear insta/youtube and shit are going to destroy humanity. This isn't the first time either - folks made a false claim of such in Quebec a few years back too. Its important to note Lean meats such as pork are actually recommended by the public school boards in Canada. permalink parent award report block reply LabTech 5 points 24 hours ago Yeah, they'll ask that you don't at first, then they'll try shaming you, then there'll be acts of intimidation, then outright bans that are enforced, while anything the other side does gets a pass. I think Canada's basically a lost cause at this point that'll have to collapse to get better; the trucker convoy was the last best chance to pull things back from the brink, but Trudeau pulled a page from the playbook of his favorite country, China. permalink parent award report block reply Klaus73 5 points 24 hours ago Trudeau was a maoist buttboy that actually admitted admiration by how quickly Chinese government could move due to controlling everything. permalink parent award report block reply zooty 2 points 21 hours ago It sounds like Canada will probably be banning beef before pork by all accounts. permalink parent award report block reply BeauHD 4 points 23 hours ago I miss Rush Limbaugh and the EIB Network. I'd bet my left walnut he would say on air Trump needs to stand in solidarity with them and impose tariffs on Canadian bacon! permalink parent award report block reply AmericanMan00 1 points 17 hours ago \"half my brain tied behind my back—just to make it fair\" permalink parent award report block reply The_Return_of_User_x 2 points 23 hours ago Who the fuck do they think they are forcing parents to bend the knee on what goes in their own children's mouths? Fuck you! permalink parent award report block reply\nKlaus73 6 points 1 day ago OH I think folks need to keep an eye out for sure - but this particular story is actually from October and no proof was every actually provided - but folks need that \"engagement\" I swear insta/youtube and shit are going to destroy humanity. This isn't the first time either - folks made a false claim of such in Quebec a few years back too. Its important to note Lean meats such as pork are actually recommended by the public school boards in Canada. permalink parent award report block reply\nLabTech 5 points 24 hours ago Yeah, they'll ask that you don't at first, then they'll try shaming you, then there'll be acts of intimidation, then outright bans that are enforced, while anything the other side does gets a pass. I think Canada's basically a lost cause at this point that'll have to collapse to get better; the trucker convoy was the last best chance to pull things back from the brink, but Trudeau pulled a page from the playbook of his favorite country, China. permalink parent award report block reply Klaus73 5 points 24 hours ago Trudeau was a maoist buttboy that actually admitted admiration by how quickly Chinese government could move due to controlling everything. permalink parent award report block reply zooty 2 points 21 hours ago It sounds like Canada will probably be banning beef before pork by all accounts. permalink parent award report block reply\nKlaus73 5 points 24 hours ago Trudeau was a maoist buttboy that actually admitted admiration by how quickly Chinese government could move due to controlling everything. permalink parent award report block reply\nzooty 2 points 21 hours ago It sounds like Canada will probably be banning beef before pork by all accounts. permalink parent award report block reply\nBeauHD 4 points 23 hours ago I miss Rush Limbaugh and the EIB Network. I'd bet my left walnut he would say on air Trump needs to stand in solidarity with them and impose tariffs on Canadian bacon! permalink parent award report block reply AmericanMan00 1 points 17 hours ago \"half my brain tied behind my back—just to make it fair\" permalink parent award report block reply\nAmericanMan00 1 points 17 hours ago \"half my brain tied behind my back—just to make it fair\" permalink parent award report block reply\nThe_Return_of_User_x 2 points 23 hours ago Who the fuck do they think they are forcing parents to bend the knee on what goes in their own children's mouths? Fuck you! permalink parent award report block reply\nShitsbrokeyo 4 points 24 hours ago Bacon will be gone if they submit to this crap.  Let the offend parent's kids eat lunch in the gym. permalink parent award report block reply Klaus73 5 points 24 hours ago Aye I think Canada is a little bit safer due to our winters tend to deter as much Muslim migration (though Toronto is pretty bad) Texas is more their weather. If politicians ever try to ban bacon I will literally pour bacon grease everywhere Muslims hold sacred. permalink parent award report block reply CheeseAndOnion 1 points 13 hours ago I put bacon in the fucking halal coolers at the supermarket. permalink parent award report block reply\nKlaus73 5 points 24 hours ago Aye I think Canada is a little bit safer due to our winters tend to deter as much Muslim migration (though Toronto is pretty bad) Texas is more their weather. If politicians ever try to ban bacon I will literally pour bacon grease everywhere Muslims hold sacred. permalink parent award report block reply CheeseAndOnion 1 points 13 hours ago I put bacon in the fucking halal coolers at the supermarket. permalink parent award report block reply\nCheeseAndOnion 1 points 13 hours ago I put bacon in the fucking halal coolers at the supermarket. permalink parent award report block reply\nNecrovoter 1 points 23 hours ago Probably based off the \"Ooooops, it was all just a miStAkE!\"  memo sent out to parents of Mere Green Primary School students  not that long ago: \" School in Sutton Coldfield blames ‘human error’ after parents wrongly told of packed lunch pork ban \" https://www.birminghammail.co.uk/news/midlands-news/school-sutton-coldfield-blames-human-32819753 permalink parent award report block reply Klaus73 1 points 23 hours ago Quite possibly - Canada has a ton of problems its got to fix but at this point the Muslopocalypse isn't in the cards...yet; right now we got a issue with a group of people shitting allover. permalink parent award report block reply\nKlaus73 1 points 23 hours ago Quite possibly - Canada has a ton of problems its got to fix but at this point the Muslopocalypse isn't in the cards...yet; right now we got a issue with a group of people shitting allover. permalink parent award report block reply\nHellsbells00 0 points 22 hours ago catholic You mean globalism masquerading as christianity? permalink parent award report block reply Klaus73 2 points 21 hours ago No I mean actually catholic...not whatever weird shit the Vatican is into. permalink parent award report block reply\nKlaus73 2 points 21 hours ago No I mean actually catholic...not whatever weird shit the Vatican is into. permalink parent award report block reply\nSaltyKrakenBalls 14 points 1 day ago Bring your dog to school day. EVERY FUCKING DAY. permalink parent award report block reply\n0111000001100101 14 points 1 day ago Throw said bacon at muslims.  If we can carry and exercise assault sandwiches now certainly we can be slap happy with bacon sandwiches. permalink parent award report block reply BillGateCanSuckIt 5 points 1 day ago Remember how people used to send truck loads of salt. Well maybe the muzzies should be sent bacon. Anonymous bacon mail permalink parent award report block reply etcetera 1 points 21 hours ago Comment removed by community moderators. permalink parent award report block reply bringbackthe80s 4 points 1 day ago Yep, throwing sandwiches at people is now considered a form of protected free speech. Let 'em fly! permalink parent award report block reply imnotdeadyet 4 points 1 day ago How about porkrinds? permalink parent award report block reply 0111000001100101 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply etcetera 0 points 21 hours ago Comment removed by community moderators. permalink parent award report block reply\nBillGateCanSuckIt 5 points 1 day ago Remember how people used to send truck loads of salt. Well maybe the muzzies should be sent bacon. Anonymous bacon mail permalink parent award report block reply etcetera 1 points 21 hours ago Comment removed by community moderators. permalink parent award report block reply\netcetera 1 points 21 hours ago Comment removed by community moderators. permalink parent award report block reply\nbringbackthe80s 4 points 1 day ago Yep, throwing sandwiches at people is now considered a form of protected free speech. Let 'em fly! permalink parent award report block reply imnotdeadyet 4 points 1 day ago How about porkrinds? permalink parent award report block reply 0111000001100101 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply etcetera 0 points 21 hours ago Comment removed by community moderators. permalink parent award report block reply\nimnotdeadyet 4 points 1 day ago How about porkrinds? permalink parent award report block reply 0111000001100101 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply etcetera 0 points 21 hours ago Comment removed by community moderators. permalink parent award report block reply\n0111000001100101 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\netcetera 0 points 21 hours ago Comment removed by community moderators. permalink parent award report block reply\nawsure 9 points 1 day ago Need a bring your pig 🐖 to school day every Friday. BBQ Thursday. Pulled Pork Monday and Pork Rib Wednesday. Tuesday and Friday dealers choice. permalink parent award report block reply 0111000001100101 4 points 1 day ago How do I join this group? permalink parent award report block reply Hawksendoom 2 points 23 hours ago I so want in XD oooh can we have a little spin wheel thingy for Thursdays and Fridays? XD to choose XD permalink parent award report block reply\n0111000001100101 4 points 1 day ago How do I join this group? permalink parent award report block reply Hawksendoom 2 points 23 hours ago I so want in XD oooh can we have a little spin wheel thingy for Thursdays and Fridays? XD to choose XD permalink parent award report block reply\nHawksendoom 2 points 23 hours ago I so want in XD oooh can we have a little spin wheel thingy for Thursdays and Fridays? XD to choose XD permalink parent award report block reply\nschiff_for_brains 4 points 1 day ago Joke's on you.  TPTB in Canada hate Canada. permalink parent award report block reply\nNonbinaryPotatohead 76 points 1 day ago But not for the Jewish students that have been there for decades...interesting... permalink award report block reply Major_Nutt 89 points 1 day ago Jews don't randomly explode. permalink parent award report block reply rebuildingMyself 47 points 1 day ago Just don't trust their pagers, amirite permalink parent award report block reply Liberats 1 points 23 hours ago Only exported. permalink parent award report block reply 45fan 3 points 21 hours ago It's not random with the Muzzies. permalink parent award report block reply shialecuck007 1 points 1 day ago Until you deny them their Shekels permalink parent award report block reply yarg -1 points 1 day ago They play the long con. permalink parent award report block reply YaharaRiver 29 points 1 day ago jews don’t demand that everyone follow their practices, only the pisslamics do that ☠️☪️ permalink parent award report block reply 0111000001100101 18 points 1 day ago They just kill Jesus and other leaders that are leading us out of the Babylonian system set up in ancient Egypt.  No biggie. permalink parent award report block reply Porkbut 1 points 1 day ago People who say things like this will be first in line for new babylon. permalink parent award report block reply 0111000001100101 -2 points 1 day ago It's totally fine, please calm down sir. Trust the plan, Q, watch the show.  No action is required from you.  Thank you for staying passive and calm. permalink parent award report block reply view 2 more comments... Seeker_17 -2 points 1 day ago kiLl jEsuS. LOL. How long ago was that? permalink parent award report block reply Ryker 1 points 15 hours ago Every single day permalink parent award report block reply zooty -1 points 21 hours ago Wasn't it the Romans? I guess I'll hold it against Mario. permalink parent award report block reply BonginosRac1stCowboy 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply the-new-style 5 points 23 hours ago Then you don't know what happens in Iceland when they tried to outlaw circumcisions Hint: refugees https://www.newsweek.com/icelands-jews-beat-church-taxes-circumcision-ban-now-they-even-have-rabbi-1631954 permalink parent award report block reply TrumpAndGodWin 1 points 20 hours ago Circumcisions are like a tax, unnecessarily costing a family over $1,000 per boy. permalink parent award report block reply YaharaRiver 0 points 23 hours ago just reading the link (no intention of giving Newsweek a click), I can’t even IMAGINE being interested in that! LMFAOoooo wow, you bookmarked this?!  Why?? permalink parent award report block reply the-new-style 3 points 23 hours ago No I just did a search for it, I don't need bookmarks, I remember things permalink parent award report block reply view 2 more comments... LizardKingx002 4 points 1 day ago I mean, they kinda do in roundabout ways permalink parent award report block reply 123breadman 1 points 1 day ago Even Myron Gaines (one of the biggest anti Israel podcasters) doest say it's the Jews. He says people who say that are stupid. permalink parent award report block reply MySidesGoUp 0 points 21 hours ago Usury for one?? Jews treat “gentiles” specifically…You’re being dishonest.. permalink parent award report block reply load 1 more comments... JoyousMischief 23 points 1 day ago As a raging antisemite, I'll still give you and them a W on that point. Muslims are way more directly and visibly obnoxious. permalink parent award report block reply hilboggins 3 points 23 hours ago Anti-Semite is is very inclusive of Jews and Muslims alike permalink parent award report block reply IForgotToAddAnEmail 1 points 1 day ago No they do, otherwise they wouldn't have shit like the ADL. permalink parent award report block reply Seeker_17 5 points 1 day ago LOL. That's because Jews don't eat pork either. What's more interesting is that they try to appease the muzzies, but not the Jews. permalink parent award report block reply NonbinaryPotatohead 1 points 7 hours ago exactly my point LOL permalink parent award report block reply Martinez 0 points 23 hours ago With so much in common they should get along great. permalink parent award report block reply 5DchessWatch 2 points 1 day ago If they did that, they wouldn't be able to slowly poison the gois hog meat supply /s permalink parent award report block reply load 2 more comments...\nMajor_Nutt 89 points 1 day ago Jews don't randomly explode. permalink parent award report block reply rebuildingMyself 47 points 1 day ago Just don't trust their pagers, amirite permalink parent award report block reply Liberats 1 points 23 hours ago Only exported. permalink parent award report block reply 45fan 3 points 21 hours ago It's not random with the Muzzies. permalink parent award report block reply shialecuck007 1 points 1 day ago Until you deny them their Shekels permalink parent award report block reply yarg -1 points 1 day ago They play the long con. permalink parent award report block reply\nrebuildingMyself 47 points 1 day ago Just don't trust their pagers, amirite permalink parent award report block reply Liberats 1 points 23 hours ago Only exported. permalink parent award report block reply\nLiberats 1 points 23 hours ago Only exported. permalink parent award report block reply\n45fan 3 points 21 hours ago It's not random with the Muzzies. permalink parent award report block reply\nshialecuck007 1 points 1 day ago Until you deny them their Shekels permalink parent award report block reply\nyarg -1 points 1 day ago They play the long con. permalink parent award report block reply\nYaharaRiver 29 points 1 day ago jews don’t demand that everyone follow their practices, only the pisslamics do that ☠️☪️ permalink parent award report block reply 0111000001100101 18 points 1 day ago They just kill Jesus and other leaders that are leading us out of the Babylonian system set up in ancient Egypt.  No biggie. permalink parent award report block reply Porkbut 1 points 1 day ago People who say things like this will be first in line for new babylon. permalink parent award report block reply 0111000001100101 -2 points 1 day ago It's totally fine, please calm down sir. Trust the plan, Q, watch the show.  No action is required from you.  Thank you for staying passive and calm. permalink parent award report block reply view 2 more comments... Seeker_17 -2 points 1 day ago kiLl jEsuS. LOL. How long ago was that? permalink parent award report block reply Ryker 1 points 15 hours ago Every single day permalink parent award report block reply zooty -1 points 21 hours ago Wasn't it the Romans? I guess I'll hold it against Mario. permalink parent award report block reply BonginosRac1stCowboy 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply the-new-style 5 points 23 hours ago Then you don't know what happens in Iceland when they tried to outlaw circumcisions Hint: refugees https://www.newsweek.com/icelands-jews-beat-church-taxes-circumcision-ban-now-they-even-have-rabbi-1631954 permalink parent award report block reply TrumpAndGodWin 1 points 20 hours ago Circumcisions are like a tax, unnecessarily costing a family over $1,000 per boy. permalink parent award report block reply YaharaRiver 0 points 23 hours ago just reading the link (no intention of giving Newsweek a click), I can’t even IMAGINE being interested in that! LMFAOoooo wow, you bookmarked this?!  Why?? permalink parent award report block reply the-new-style 3 points 23 hours ago No I just did a search for it, I don't need bookmarks, I remember things permalink parent award report block reply view 2 more comments... LizardKingx002 4 points 1 day ago I mean, they kinda do in roundabout ways permalink parent award report block reply 123breadman 1 points 1 day ago Even Myron Gaines (one of the biggest anti Israel podcasters) doest say it's the Jews. He says people who say that are stupid. permalink parent award report block reply MySidesGoUp 0 points 21 hours ago Usury for one?? Jews treat “gentiles” specifically…You’re being dishonest.. permalink parent award report block reply load 1 more comments...\n0111000001100101 18 points 1 day ago They just kill Jesus and other leaders that are leading us out of the Babylonian system set up in ancient Egypt.  No biggie. permalink parent award report block reply Porkbut 1 points 1 day ago People who say things like this will be first in line for new babylon. permalink parent award report block reply 0111000001100101 -2 points 1 day ago It's totally fine, please calm down sir. Trust the plan, Q, watch the show.  No action is required from you.  Thank you for staying passive and calm. permalink parent award report block reply view 2 more comments... Seeker_17 -2 points 1 day ago kiLl jEsuS. LOL. How long ago was that? permalink parent award report block reply Ryker 1 points 15 hours ago Every single day permalink parent award report block reply zooty -1 points 21 hours ago Wasn't it the Romans? I guess I'll hold it against Mario. permalink parent award report block reply BonginosRac1stCowboy 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nPorkbut 1 points 1 day ago People who say things like this will be first in line for new babylon. permalink parent award report block reply 0111000001100101 -2 points 1 day ago It's totally fine, please calm down sir. Trust the plan, Q, watch the show.  No action is required from you.  Thank you for staying passive and calm. permalink parent award report block reply view 2 more comments...\n0111000001100101 -2 points 1 day ago It's totally fine, please calm down sir. Trust the plan, Q, watch the show.  No action is required from you.  Thank you for staying passive and calm. permalink parent award report block reply view 2 more comments...\nSeeker_17 -2 points 1 day ago kiLl jEsuS. LOL. How long ago was that? permalink parent award report block reply Ryker 1 points 15 hours ago Every single day permalink parent award report block reply zooty -1 points 21 hours ago Wasn't it the Romans? I guess I'll hold it against Mario. permalink parent award report block reply\nRyker 1 points 15 hours ago Every single day permalink parent award report block reply\nzooty -1 points 21 hours ago Wasn't it the Romans? I guess I'll hold it against Mario. permalink parent award report block reply\nBonginosRac1stCowboy 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nthe-new-style 5 points 23 hours ago Then you don't know what happens in Iceland when they tried to outlaw circumcisions Hint: refugees https://www.newsweek.com/icelands-jews-beat-church-taxes-circumcision-ban-now-they-even-have-rabbi-1631954 permalink parent award report block reply TrumpAndGodWin 1 points 20 hours ago Circumcisions are like a tax, unnecessarily costing a family over $1,000 per boy. permalink parent award report block reply YaharaRiver 0 points 23 hours ago just reading the link (no intention of giving Newsweek a click), I can’t even IMAGINE being interested in that! LMFAOoooo wow, you bookmarked this?!  Why?? permalink parent award report block reply the-new-style 3 points 23 hours ago No I just did a search for it, I don't need bookmarks, I remember things permalink parent award report block reply view 2 more comments...\nTrumpAndGodWin 1 points 20 hours ago Circumcisions are like a tax, unnecessarily costing a family over $1,000 per boy. permalink parent award report block reply\nYaharaRiver 0 points 23 hours ago just reading the link (no intention of giving Newsweek a click), I can’t even IMAGINE being interested in that! LMFAOoooo wow, you bookmarked this?!  Why?? permalink parent award report block reply the-new-style 3 points 23 hours ago No I just did a search for it, I don't need bookmarks, I remember things permalink parent award report block reply view 2 more comments...\nthe-new-style 3 points 23 hours ago No I just did a search for it, I don't need bookmarks, I remember things permalink parent award report block reply view 2 more comments...\nLizardKingx002 4 points 1 day ago I mean, they kinda do in roundabout ways permalink parent award report block reply\n123breadman 1 points 1 day ago Even Myron Gaines (one of the biggest anti Israel podcasters) doest say it's the Jews. He says people who say that are stupid. permalink parent award report block reply\nMySidesGoUp 0 points 21 hours ago Usury for one?? Jews treat “gentiles” specifically…You’re being dishonest.. permalink parent award report block reply\nJoyousMischief 23 points 1 day ago As a raging antisemite, I'll still give you and them a W on that point. Muslims are way more directly and visibly obnoxious. permalink parent award report block reply hilboggins 3 points 23 hours ago Anti-Semite is is very inclusive of Jews and Muslims alike permalink parent award report block reply IForgotToAddAnEmail 1 points 1 day ago No they do, otherwise they wouldn't have shit like the ADL. permalink parent award report block reply\nhilboggins 3 points 23 hours ago Anti-Semite is is very inclusive of Jews and Muslims alike permalink parent award report block reply\nIForgotToAddAnEmail 1 points 1 day ago No they do, otherwise they wouldn't have shit like the ADL. permalink parent award report block reply\nSeeker_17 5 points 1 day ago LOL. That's because Jews don't eat pork either. What's more interesting is that they try to appease the muzzies, but not the Jews. permalink parent award report block reply NonbinaryPotatohead 1 points 7 hours ago exactly my point LOL permalink parent award report block reply Martinez 0 points 23 hours ago With so much in common they should get along great. permalink parent award report block reply\nNonbinaryPotatohead 1 points 7 hours ago exactly my point LOL permalink parent award report block reply\nMartinez 0 points 23 hours ago With so much in common they should get along great. permalink parent award report block reply\n5DchessWatch 2 points 1 day ago If they did that, they wouldn't be able to slowly poison the gois hog meat supply /s permalink parent award report block reply\nO__Q OP 44 points 1 day ago And it will come to America as well. Here’s a thought, maybe, just maybe, if we didn’t import illegal “immigrant” invaders in the first place, our kids could eat whatever they want at lunch without their woke teachers and schools sending home “harmless accommodating” requests like these that actually serve to magnify said invasion. permalink award report block reply Formerlurker92 19 points 1 day ago Deport 40 million to stop the retardation permalink parent award report block reply Krat 3 points 23 hours ago 40? More like 150 permalink parent award report block reply TwoArizonaPedes 16 points 1 day ago And it will come to America as well. There's already an entire school district in the U.S. that only serves halal meals. https://archive.is/9libl permalink parent award report block reply DCYR66 9 points 1 day ago Bullshit to that! Here in the south pork bbq is practically a religion! Any raghead trying to stop that here will find lead added to their diet! permalink parent award report block reply SaltyArmyChick 2 points 22 hours ago This guy gets it lol 😂 permalink parent award report block reply first_amendment 1 points 1 day ago They said pork, so bacon is [kosher]. permalink parent award report block reply Hellsbells00 2 points 22 hours ago Bacon is pork. permalink parent award report block reply LearnAboutRoaches 1 points 1 day ago In the near future \"food status\" will replace the pronoun fad. Food disabled, sufferers of nutrition insecurity, dinner nazis, anti poultry vegans, zero footprint chefs, pork assassins, brussel sprout fascists, meal police, cooking challenged, sugar snappers etc.. Diversity is our strength permalink parent award report block reply load 5 more comments...\nFormerlurker92 19 points 1 day ago Deport 40 million to stop the retardation permalink parent award report block reply Krat 3 points 23 hours ago 40? More like 150 permalink parent award report block reply\nKrat 3 points 23 hours ago 40? More like 150 permalink parent award report block reply\nTwoArizonaPedes 16 points 1 day ago And it will come to America as well. There's already an entire school district in the U.S. that only serves halal meals. https://archive.is/9libl permalink parent award report block reply\nDCYR66 9 points 1 day ago Bullshit to that! Here in the south pork bbq is practically a religion! Any raghead trying to stop that here will find lead added to their diet! permalink parent award report block reply SaltyArmyChick 2 points 22 hours ago This guy gets it lol 😂 permalink parent award report block reply\nSaltyArmyChick 2 points 22 hours ago This guy gets it lol 😂 permalink parent award report block reply\nfirst_amendment 1 points 1 day ago They said pork, so bacon is [kosher]. permalink parent award report block reply Hellsbells00 2 points 22 hours ago Bacon is pork. permalink parent award report block reply\nHellsbells00 2 points 22 hours ago Bacon is pork. permalink parent award report block reply\nLearnAboutRoaches 1 points 1 day ago In the near future \"food status\" will replace the pronoun fad. Food disabled, sufferers of nutrition insecurity, dinner nazis, anti poultry vegans, zero footprint chefs, pork assassins, brussel sprout fascists, meal police, cooking challenged, sugar snappers etc.. Diversity is our strength permalink parent award report block reply\nHaiti_kid 27 points 1 day ago How about you suck on deeeeez nuts? permalink award report block reply HumanSomewhere 6 points 1 day ago Acquaint them with the methods of the Sugondese Beware the Mind Goblin permalink parent award report block reply CommanderOfCheese 6 points 1 day ago What's a mind goblin? Does it have something to do with BOFA? permalink parent award report block reply DCYR66 3 points 1 day ago With strips of bacon! permalink parent award report block reply DlanOdcammron 1 points 17 hours ago Are your nuts halal? Asking for my friend MoHAMmed. permalink parent award report block reply\nHumanSomewhere 6 points 1 day ago Acquaint them with the methods of the Sugondese Beware the Mind Goblin permalink parent award report block reply CommanderOfCheese 6 points 1 day ago What's a mind goblin? Does it have something to do with BOFA? permalink parent award report block reply\nCommanderOfCheese 6 points 1 day ago What's a mind goblin? Does it have something to do with BOFA? permalink parent award report block reply\nDCYR66 3 points 1 day ago With strips of bacon! permalink parent award report block reply\nDlanOdcammron 1 points 17 hours ago Are your nuts halal? Asking for my friend MoHAMmed. permalink parent award report block reply\nThe_MAGA_Destroyer 24 points 1 day ago If Mrs. Maga Destroyer and I still had children in school, it would be bacon sandwiches, ham sandwiches, or ham salad, every day permalink award report block reply Seldom_Seen_Kid 3 points 1 day ago And, on Fridays…half a rack of baby backs. permalink parent award report block reply\nSeldom_Seen_Kid 3 points 1 day ago And, on Fridays…half a rack of baby backs. permalink parent award report block reply\nMakingArrowsOrange 21 points 1 day ago Muslim students can pack their fucking bags and go to their home countries where they don't eat pork. permalink award report block reply\nBlackPilledMAGA 19 points 1 day ago For fuck sake the PANDERING has got to End! How about those fucking Muslims don't come to the Western World, or anywhere else if they plan on endless protesting of the cultures in those lands? They refuse to adapt they only want to dominate. People need to open their fucking eyes. Anyone who suggests more pandering and erosion of their own society to please these Muslim invaders is just an enabler and a liability to their country. permalink award report block reply KekistanPM 12 points 1 day ago It's not so much pandering is it is an invasion through kindness. Today it's \"please don't.\" Tomorrow is \"We no longer allow.\" Next week is severe penalties if you do it even on accident. It's like when a dictator kneels down in front of your kid and says with a smile \"You don't want to be insensitive, right?\" permalink parent award report block reply stars 4 points 1 day ago Britain's trio of anglosphere colonies embody the absolute worst of modern liberalism. The pandering is deliberate, the elite of those nations at best see the country as a soulless economic zone and at worst have a genocidal hatred of the White population. permalink parent award report block reply MySidesGoUp 1 points 20 hours ago Hey you're being selfish. The rivals to those Muslims need them to pack up as they build up greater diaspora… We also have NGOs to feed. And what about the hungry elites who wanna buy kids?  You’re gonna deny them that??… permalink parent award report block reply\nKekistanPM 12 points 1 day ago It's not so much pandering is it is an invasion through kindness. Today it's \"please don't.\" Tomorrow is \"We no longer allow.\" Next week is severe penalties if you do it even on accident. It's like when a dictator kneels down in front of your kid and says with a smile \"You don't want to be insensitive, right?\" permalink parent award report block reply\nstars 4 points 1 day ago Britain's trio of anglosphere colonies embody the absolute worst of modern liberalism. The pandering is deliberate, the elite of those nations at best see the country as a soulless economic zone and at worst have a genocidal hatred of the White population. permalink parent award report block reply\nMySidesGoUp 1 points 20 hours ago Hey you're being selfish. The rivals to those Muslims need them to pack up as they build up greater diaspora… We also have NGOs to feed. And what about the hungry elites who wanna buy kids?  You’re gonna deny them that??… permalink parent award report block reply\nstealthboy 15 points 1 day ago Extra bacon it is. permalink award report block reply SaltyArmyChick 2 points 22 hours ago Triple permalink parent award report block reply DlanOdcammron 1 points 17 hours ago Send the kids with a pet pig for show-and-tell. permalink parent award report block reply\nSaltyArmyChick 2 points 22 hours ago Triple permalink parent award report block reply\nDlanOdcammron 1 points 17 hours ago Send the kids with a pet pig for show-and-tell. permalink parent award report block reply\nGA_Logic 14 points 1 day ago Canadian bacon is a national treasure that must be protected. permalink award report block reply Hellsbells00 5 points 22 hours ago Canadion bacon is just shitty ham. Real bacon is superior, even on pizza. permalink parent award report block reply SaltyArmyChick 2 points 22 hours ago Amen brother 🙏 fkn delicacy… proscuitto wrap stuffed  jalapeño is fine dining 👌 permalink parent award report block reply\nHellsbells00 5 points 22 hours ago Canadion bacon is just shitty ham. Real bacon is superior, even on pizza. permalink parent award report block reply\nSaltyArmyChick 2 points 22 hours ago Amen brother 🙏 fkn delicacy… proscuitto wrap stuffed  jalapeño is fine dining 👌 permalink parent award report block reply\nFormerlurker92 13 points 1 day ago I'd rather have dogs, music, bacon and freedom than sharia and violence permalink award report block reply\nUncleTrumpsBand 11 points 1 day ago Buy pork stock!!!! Pork go burrrrrrrrrp permalink award report block reply\neddieblasphemy 10 points 1 day ago im gonna smuggle.va hams into Canada. whos with me? permalink award report block reply SaltyArmyChick 1 points 22 hours ago 🤜🤛🥓🥓🥓 permalink parent award report block reply\nSaltyArmyChick 1 points 22 hours ago 🤜🤛🥓🥓🥓 permalink parent award report block reply\nDev404 10 points 1 day ago Ah yes, everyone must cater to the goatfucking muslims who don't have to cater to anyone. Enjoying feminism, yet? permalink award report block reply Metal4Freedom 10 points 1 day ago DEPORT ALL MUSLIMS permalink parent award report block reply\nMetal4Freedom 10 points 1 day ago DEPORT ALL MUSLIMS permalink parent award report block reply\nJamesBond007 10 points 1 day ago Yeah, my kid would be eating Pork Ribs every day and then play \"Smear The Muzzy\" with dripping fingers. permalink award report block reply\nHaiti_kid 10 points 1 day ago How about you suck on deeeeez nuts? permalink award report block reply DCYR66 3 points 1 day ago And the meat popsicle to go with it. permalink parent award report block reply\nDCYR66 3 points 1 day ago And the meat popsicle to go with it. permalink parent award report block reply\ntry4gain PRO 9 points 1 day ago the modern Crusades will be way more offensive permalink award report block reply\nTwoArizonaPedes 9 points 1 day ago Fight back! It begins by getting together a group of like-minded patriots. Start with your church and your friends and grow from there. Set up a phone tree. Use burner phones. Don't text. Organize, coordinate, think, be creative! You already know how to respond to their street-blocking \"prayers.\" Pick a name or organization and get involved. permalink award report block reply\nthe_malcontent 9 points 1 day ago Hope my kids like BLTs, cause that's what they would have for lunch from now on. permalink award report block reply CommanderOfCheese 5 points 1 day ago BLTs minus the LT. permalink parent award report block reply\nCommanderOfCheese 5 points 1 day ago BLTs minus the LT. permalink parent award report block reply\nMaga305_47 9 points 1 day ago Conclusion. Muslim kids steal lunches. permalink award report block reply YaharaRiver 3 points 24 hours ago HA! 🤣👍 There really is no other reason to henpeck children about their lunch, is there. Well done. permalink parent award report block reply\nYaharaRiver 3 points 24 hours ago HA! 🤣👍 There really is no other reason to henpeck children about their lunch, is there. Well done. permalink parent award report block reply\ngrantking2256 8 points 1 day ago If real, have you seen the price of chicken vs beef vs pork. Fuck you. Pork is SOOOOOO MUCH cheaper permalink award report block reply KernalMustard 1 points 24 hours ago Producers also get next to nothing for pork. Semi exotic meats lile Goat and Emu get the highest prices. Cattle are somewhere from low to mid. permalink parent award report block reply\nKernalMustard 1 points 24 hours ago Producers also get next to nothing for pork. Semi exotic meats lile Goat and Emu get the highest prices. Cattle are somewhere from low to mid. permalink parent award report block reply\nCoprolite 8 points 1 day ago I once microwaved ham in the work microwave that was labeled \"halal food only \" nothing happened so I guess ham is halal compatible. permalink award report block reply OnlyTrump20 6 points 1 day ago Microwaving fish is the only workplace crime I know of. permalink parent award report block reply DlanOdcammron 2 points 17 hours ago It’s in the name of MoHAMmed. permalink parent award report block reply\nOnlyTrump20 6 points 1 day ago Microwaving fish is the only workplace crime I know of. permalink parent award report block reply\nDlanOdcammron 2 points 17 hours ago It’s in the name of MoHAMmed. permalink parent award report block reply\nKekistanPM 7 points 1 day ago \"Hey son did you pack the triple BLT melt I made for you?\" permalink award report block reply\nOnlyTrump20 6 points 1 day ago Tell them your bacon is turkey bacon and offer the muslim kids a piece. permalink award report block reply\nconservatarian 6 points 1 day ago MORE PORK permalink award report block reply\nroflcopt0rz_returns 5 points 22 hours ago The only reason why the commies are doing this for the mooslims is that they know the mooslims will actually get off their asses and do something if they need to. They know the mooslims will actually stack fucking bodies. The commies meanwhile bully the whypipo because they know whypipo, even the \"far right\", won't actually do shit. Remember, you get the government you tolerate. permalink award report block reply\nPappy_Gunn 5 points 1 day ago Sauce?  Name the school or GTFO. permalink award report block reply cptkloss5 3 points 1 day ago yeah it's bullshit - 100% people shouldn't be falling for this low effort crap. but no, instead it's getting stickied. permalink parent award report block reply Pappy_Gunn 2 points 1 day ago There are plenty of shenanigans going on in schools that you don't have to make shit up.  Pedos, LGBT propganda, grooming material in libraries, DEI, kids not being disciplined, kids forced to attend a Muslim service, etc. permalink parent award report block reply magnokor 2 points 23 hours ago It is real enough, everywhere. The city councils, the corporations, they are happy to ban ham. For Canada, to appease all their invaders, they will ban ham, bacon, beef.  Eventually, the few Old Stock Canadians left will only be able to consume vegetables, dirt, and bags of milk. This is CBC: Jul 9, 2024 KFC in Canada now requires nearly all of its Ontario restaurants to serve halal chicken and eliminate pork products KFC removes pork and converts to halal - Toronto 99 . England too. Subway removes ham and bacon from nearly 200 stores and offers halal meat only after 'strong demand' from Muslims https://www.dailymail.co.uk/news/article-2616576/Subway-removes-ham-pork-nearly-200-stores-strong-demand-Muslims-eat-Halal-meat.html permalink parent award report block reply\ncptkloss5 3 points 1 day ago yeah it's bullshit - 100% people shouldn't be falling for this low effort crap. but no, instead it's getting stickied. permalink parent award report block reply Pappy_Gunn 2 points 1 day ago There are plenty of shenanigans going on in schools that you don't have to make shit up.  Pedos, LGBT propganda, grooming material in libraries, DEI, kids not being disciplined, kids forced to attend a Muslim service, etc. permalink parent award report block reply\nPappy_Gunn 2 points 1 day ago There are plenty of shenanigans going on in schools that you don't have to make shit up.  Pedos, LGBT propganda, grooming material in libraries, DEI, kids not being disciplined, kids forced to attend a Muslim service, etc. permalink parent award report block reply\nmagnokor 2 points 23 hours ago It is real enough, everywhere. The city councils, the corporations, they are happy to ban ham. For Canada, to appease all their invaders, they will ban ham, bacon, beef.  Eventually, the few Old Stock Canadians left will only be able to consume vegetables, dirt, and bags of milk. This is CBC: Jul 9, 2024 KFC in Canada now requires nearly all of its Ontario restaurants to serve halal chicken and eliminate pork products KFC removes pork and converts to halal - Toronto 99 . England too. Subway removes ham and bacon from nearly 200 stores and offers halal meat only after 'strong demand' from Muslims https://www.dailymail.co.uk/news/article-2616576/Subway-removes-ham-pork-nearly-200-stores-strong-demand-Muslims-eat-Halal-meat.html permalink parent award report block reply\nTellsyouhow 4 points 1 day ago In the UK there's a trend of abattoirs becoming Muslim Halal abattoirs. Because Muslims won't buy non halal meat and are growing in numbers, but Christians don't care. Big companies therefore switch to Halal abattoirs and put normal ones out of business. (While you eat meat blessed in the name of Islam) permalink award report block reply BidenShowerDrool 6 points 1 day ago (While you eat meat blessed in the name of Islam) it's the manner in which the animal is killed which is the distressing part. No-one cares about the blessing. The animal has it's throat slit while alive and it bleeds out to death. This can take several minutes of excruciating pain before the animal dies. The west has done everything to make the kill as quick and as painless as possible for the animals but Muslims insist on prolonged death practices due to their Satanic practices. permalink parent award report block reply MissPatriot713 3 points 1 day ago Honestly, kosher slaughter is the same! Many slaughterhouses only perform kosher slaughter in cities with large Jewish populations. Inherently cruel as the animal is hung upside down ( many tear limbs) while their throats are cut and they bleed out... permalink parent award report block reply BidenShowerDrool 3 points 23 hours ago yeh...i think you are right with this...this is just another part of the old testament the pedophile prophet used for his fake religion. permalink parent award report block reply\nBidenShowerDrool 6 points 1 day ago (While you eat meat blessed in the name of Islam) it's the manner in which the animal is killed which is the distressing part. No-one cares about the blessing. The animal has it's throat slit while alive and it bleeds out to death. This can take several minutes of excruciating pain before the animal dies. The west has done everything to make the kill as quick and as painless as possible for the animals but Muslims insist on prolonged death practices due to their Satanic practices. permalink parent award report block reply MissPatriot713 3 points 1 day ago Honestly, kosher slaughter is the same! Many slaughterhouses only perform kosher slaughter in cities with large Jewish populations. Inherently cruel as the animal is hung upside down ( many tear limbs) while their throats are cut and they bleed out... permalink parent award report block reply BidenShowerDrool 3 points 23 hours ago yeh...i think you are right with this...this is just another part of the old testament the pedophile prophet used for his fake religion. permalink parent award report block reply\nMissPatriot713 3 points 1 day ago Honestly, kosher slaughter is the same! Many slaughterhouses only perform kosher slaughter in cities with large Jewish populations. Inherently cruel as the animal is hung upside down ( many tear limbs) while their throats are cut and they bleed out... permalink parent award report block reply BidenShowerDrool 3 points 23 hours ago yeh...i think you are right with this...this is just another part of the old testament the pedophile prophet used for his fake religion. permalink parent award report block reply\nBidenShowerDrool 3 points 23 hours ago yeh...i think you are right with this...this is just another part of the old testament the pedophile prophet used for his fake religion. permalink parent award report block reply\nCaJuN-Polak 4 points 23 hours ago So what? I'll pack ham sandwiches and PB&Js ... so those with nut allergies don't feel left out. permalink award report block reply\ngetup 3 points 1 day ago I already knew this would be some faggot talking tiktok style like a woman before I even clicked on this post. How about show the email? I wouldn't doubt canacucks are subject to this, however this reeks of ragebait here. permalink award report block reply\n1_Badcop 3 points 22 hours ago My kid would get a pork chop sandwich, with extra bacon, everyday. permalink award report block reply\nAbrahamLincoln 3 points 1 day ago Maybe they should piss off back to goatfuckistan then. permalink award report block reply\nFreefertilizer 3 points 1 day ago Fake news/Rage Bait.. why are we okay with some guy being gay in a tiktok video and taking that as fact? Show proof besides some guy in a video saying for rage bait. permalink award report block reply getup 4 points 1 day ago Thank you. This guy says an email was sent out. So...show it? This tiktok style brainrot is so beyond annoying. permalink parent award report block reply DeltaSierra 1 points 1 day ago This shit is coming from Marxists that have invaded this site … the Donald has gone in the shitter permalink parent award report block reply\ngetup 4 points 1 day ago Thank you. This guy says an email was sent out. So...show it? This tiktok style brainrot is so beyond annoying. permalink parent award report block reply\nDeltaSierra 1 points 1 day ago This shit is coming from Marxists that have invaded this site … the Donald has gone in the shitter permalink parent award report block reply\nPOTUS_DonnieJ 3 points 21 hours ago It is every Canadian's duty to pack bacon cheeseburgers for their kids every day. Bacon to ward off the muzzies, beef to ward off the jeets. permalink award report block reply\nDiamondDroid 3 points 21 hours ago Two or three double bacon sandwiches and baked ham to trade with his classmates. permalink award report block reply\nDeepStateParasite 3 points 21 hours ago How about those schools ban people who fuck kids and animals? Nah, they don't have the guts for that, too many of their parents and teachers likely to be offended, permalink award report block reply\nTheGrooter 3 points 22 hours ago BLTs every day all day...and take some to share permalink award report block reply\ncchris_39 3 points 21 hours ago My kids would have BLT’s every day. permalink award report block reply\nNanteen 3 points 23 hours ago My kids would go to school with 2 -1lb each bacon sandwichs every day permalink award report block reply\nHonkey_McCracker 3 points 1 day ago I would tell them that they should ask moslem students to refrain from packing halal foods in their lunchboxes since that food had been offered as a blessing to Satan and see what the response would be. permalink award report block reply\niamimaginos 3 points 1 day ago Ham and Cheese it is, every fucking day permalink award report block reply\nTuggy_McTuggboat 2 points 21 hours ago Thank you for letting me know. My child's next lunch: Bacon wrapped porkchops, jalapeno poppers, bacon grease rubbed twice baked potato wedges with bacon and bacon cheddar and a big ass bowl of berry gelatin. permalink award report block reply\nmagamagamaga123 2 points 1 day ago I am offended by people who do not eat pork. permalink award report block reply\nWallllllllllllllllll 2 points 1 day ago The solution to the problem people being offended is let them be offended. Do not change your behavior. Do not apologize. Islam will not change for you. This is what people mean when they say Islam is not compatible with the West. They will invade your country, get themselves on welfare, turn your country into a shithole, and complain about the way you live your life while they destroy your country. Send them back to their own shithole. permalink award report block reply\nFren20 2 points 22 hours ago Try spam 😂😂😂 permalink award report block reply\nRedEnsign4Trump 2 points 1 day ago Too many men in Canada and the US talk and act like women. permalink award report block reply YaharaRiver 2 points 24 hours ago Tis the muslim influence! They wear flowing gowns and go all Carrie Nation wherever real men congregate! permalink parent award report block reply\nYaharaRiver 2 points 24 hours ago Tis the muslim influence! They wear flowing gowns and go all Carrie Nation wherever real men congregate! permalink parent award report block reply\nSilentbutdeadly 2 points 23 hours ago Fuck them.  Send their asses packing back home and send you kid to school with his or her ham Sammie! permalink award report block reply\nSaltyTitties4 2 points 1 day ago That’s crazy, yes… do not comply, Canadians! But damn this guy isn’t making a case for sanity, with that..child? adult?…on his head with the absolute psycho eyes. permalink award report block reply\nACActual 2 points 22 hours ago Where did you think voting for Globalist was going to end up?   More or less immigration? permalink award report block reply\nianpatrick1966 2 points 23 hours ago My kid would get so many BLTs permalink award report block reply\nFerretman 2 points 21 hours ago Up yours, Canada. permalink award report block reply\nraptormissle 2 points 21 hours ago Pork it up. Make the lunch bag out of pork. permalink award report block reply\nTrumpYouMagaFrenner 2 points 1 day ago If youre a muzzie youre a faggot and a retard permalink award report block reply\nWrexxis780 2 points 22 hours ago Wrap everything in bacon permalink award report block reply\nOpusX 2 points 24 hours ago Meanwhile, Christian parents who object to their children being taught pornography and gender ideology are called 'hateful' and 'extremists'. permalink award report block reply\nshialecuck007 2 points 1 day ago Start printing school shirts for the kids that say \"Allah loves Bacon!\" permalink award report block reply\nRedpilled2Depression 2 points 24 hours ago Oh I hate them, I hate Muslims so Goddamn much permalink award report block reply\nRango 2 points 21 hours ago BLT's all around. permalink award report block reply\nBldg_2019 2 points 1 day ago Oh it will? We’re not subjects to the faggot british monarchs. Canada is. No, this isn’t inevitable in America at all. Canada was never free and has always been a latent enemy of the US. permalink award report block reply TwoArizonaPedes 6 points 1 day ago There's already an entire school district in the U.S. that only serves halal meals. https://archive.is/9libl permalink parent award report block reply stars 1 points 1 day ago They aren't subject either, the British monarchy has zero power and hasn't for centuries, it's the leftist race traitor that is facilitating this poison and they are doing the same here. permalink parent award report block reply Bldg_2019 -1 points 1 day ago Who does the Canadian PM swear loyalty to? The faggot british throne. Apparently an easy trick to fool morons into believing they don’t exist anymore. permalink parent award report block reply stars 1 points 1 day ago Doesn't matter, show me one instance of Charles directing Canadian policy or governance. permalink parent award report block reply Bldg_2019 -1 points 1 day ago Uh, the part where the PM swears loyalty to the throne. You’re a slave. Wake up. permalink parent award report block reply view 2 more comments...\nTwoArizonaPedes 6 points 1 day ago There's already an entire school district in the U.S. that only serves halal meals. https://archive.is/9libl permalink parent award report block reply\nstars 1 points 1 day ago They aren't subject either, the British monarchy has zero power and hasn't for centuries, it's the leftist race traitor that is facilitating this poison and they are doing the same here. permalink parent award report block reply Bldg_2019 -1 points 1 day ago Who does the Canadian PM swear loyalty to? The faggot british throne. Apparently an easy trick to fool morons into believing they don’t exist anymore. permalink parent award report block reply stars 1 points 1 day ago Doesn't matter, show me one instance of Charles directing Canadian policy or governance. permalink parent award report block reply Bldg_2019 -1 points 1 day ago Uh, the part where the PM swears loyalty to the throne. You’re a slave. Wake up. permalink parent award report block reply view 2 more comments...\nBldg_2019 -1 points 1 day ago Who does the Canadian PM swear loyalty to? The faggot british throne. Apparently an easy trick to fool morons into believing they don’t exist anymore. permalink parent award report block reply stars 1 points 1 day ago Doesn't matter, show me one instance of Charles directing Canadian policy or governance. permalink parent award report block reply Bldg_2019 -1 points 1 day ago Uh, the part where the PM swears loyalty to the throne. You’re a slave. Wake up. permalink parent award report block reply view 2 more comments...\nstars 1 points 1 day ago Doesn't matter, show me one instance of Charles directing Canadian policy or governance. permalink parent award report block reply Bldg_2019 -1 points 1 day ago Uh, the part where the PM swears loyalty to the throne. You’re a slave. Wake up. permalink parent award report block reply view 2 more comments...\nBldg_2019 -1 points 1 day ago Uh, the part where the PM swears loyalty to the throne. You’re a slave. Wake up. permalink parent award report block reply view 2 more comments...\nPhantomShield72 2 points 1 day ago So sick of this shit. And leftists will cave to the ever increasing demands. Meanwhile, they will treat Christians as though they're a threat... Unbelievable. permalink award report block reply\nDCYR66 2 points 1 day ago 🖕Muslims!!!! Have a pork bbq in their honor! permalink award report block reply\nMagaChamp253 2 points 1 day ago THE PACKING JUST GOT 10 FEET TALLER permalink award report block reply\nBig-E 2 points 1 day ago My religion requires me to eat pork every day. permalink award report block reply\nLovethatorangeman 2 points 1 day ago Get bent permalink award report block reply\ncorntortilla 2 points 21 hours ago How about NO. permalink award report block reply\nSGT_Glowie 2 points 1 day ago my 10 month old will only eat bacon and pickles.\nI had dreams non stop the other night that muzzies were tampering and poisoning all the pork in stores. Sick of these people permalink award report block reply YaharaRiver 2 points 24 hours ago Slip in some bananas and potatoes, your child has a salt craving.  Needs a bit of potassium to calm that down. permalink parent award report block reply\nYaharaRiver 2 points 24 hours ago Slip in some bananas and potatoes, your child has a salt craving.  Needs a bit of potassium to calm that down. permalink parent award report block reply\nMAGASquatch 2 points 21 hours ago Love me some bacon wrapped bacon sandwiches deep fried in bacon grease and sprinkled with chopped bacon bits and a hint of maple syrup. permalink award report block reply\nYT45 2 points 1 day ago Let the ham sandwiches and pork chops flow! Oink oink, hajji faggots! permalink award report block reply\nKeep_on_winning_kag 2 points 10 hours ago Muslims religion is offensive to me. permalink award report block reply\nCanadianMeathead 2 points 22 hours ago Not in my home school, we have bacon a few times per week. permalink award report block reply\nFaintlight 2 points 1 day ago I'm not even cool when they try to tell kids they can't have peanut products because of life-or-death allergies. If kids have allergies, the schools should let them eat in a different smaller room. You can't mess with the all for the few. permalink award report block reply\nalucard13mmfmj 2 points 1 day ago So no pork cause of muzzies. And no beef cause of jeets.. nice. permalink award report block reply\nThe_Yakuza 2 points 22 hours ago A slice of bacon a day keeps the hijabs away. But seriously fuck you pedo worshiping goat fuckers permalink award report block reply\nLightBeacons 2 points 1 day ago Get bags of pig guts from local butcher shops and spread it all around outside the cafeteria of these schools. Throw in a few pig heads as well. permalink award report block reply\nSparks1017 2 points 1 day ago I'd be trotting a whole hog into the lunchroom, on a leash to make sure you were really offended permalink award report block reply\n5DchessWatch 2 points 1 day ago Hear me out: \"Nano Porkticulate chemtrails\" permalink award report block reply\nFearGodTheAlmighty 2 points 1 day ago Pisslam is piss permalink award report block reply\nBramage 2 points 1 day ago FUCK degenerate islam. permalink award report block reply\nEaszq8 2 points 1 day ago I don’t like to fuck kids so I guess that offends scuzzlims as well. permalink award report block reply\nDontTreadOnLego 2 points 1 day ago Bacon is muzzie repellant permalink award report block reply\nMoebius 2 points 1 day ago I'm offended they're offended. permalink award report block reply\nCaffeineJ 2 points 23 hours ago Bacon 🥓 its what is for lunch permalink award report block reply\nkesh2011 2 points 1 day ago BLT’s and ham sandwiches coming up! permalink award report block reply\nThe_RedWolf 2 points 21 hours ago While I never liked ham sandwiches, I'd be pissed the hell off at not being able to have the option for such a stupid reason. permalink award report block reply\nDon-O-Mite 2 points 23 hours ago bacon every day then. permalink award report block reply\nDuke442games 2 points 1 day ago My kids would get sick of all the pork they are going to get after this. permalink award report block reply\nKiwipede22 2 points 1 day ago Call it veal… most of the left wing lunatics do not eat meat so they would not be able to tell difference.  Give your child crispy bacon in their lunch box every day. permalink award report block reply OnlyTrump20 3 points 1 day ago Pork roast can look just like beef. permalink parent award report block reply\nOnlyTrump20 3 points 1 day ago Pork roast can look just like beef. permalink parent award report block reply\nAbsurdOpinion 2 points 24 hours ago I would ask parents not to bring their muslim kids to school as they are offensive to civilization. permalink award report block reply\nSonofAnu 2 points 24 hours ago Peanut butter and bacon sammies for all the lil cuckadian weebs permalink award report block reply\nRobinNet 1 points 1 day ago Time to open up BBQ rib joints next to mosques. Sack up, king worshippers! Oh- and take the Canadian land way from king Chuckie, who owns 92% of your country. permalink award report block reply\nTimbo1965 1 points 1 day ago I'd pack a 20lb ham, and carve it up and hand it out permalink award report block reply\nFusionBlack 1 points 18 hours ago Why do I get this feeling a lot of us will be fighting Canada and half of our own country within 10 years if not sooner? permalink award report block reply\nfriedchicken 1 points 24 hours ago Please someone explain wtf permalink award report block reply\nLearnAboutRoaches 1 points 1 day ago Ban soggy pickles! permalink award report block reply\nMeatbank84 1 points 1 day ago This is what you get when you import Islam and call it \"diversity\" permalink award report block reply\nLiberats 1 points 23 hours ago Just tell them it's offensive to arrive in another country and demand accommodations for their feelings. permalink award report block reply\nbased_trekkie 1 points 1 day ago Canada is so cucked they cannot pack school lunches for their kids that contain a Canadian ingredient! permalink award report block reply\nHoldMyDangle 1 points 19 hours ago You've been overrun Canada man. Let this be a lesson the the Americans on here. They are the religion of Pieces and wont stop until they can fuck every goat in thr country. permalink award report block reply\nAwShitHereWeGoAgain 1 points 24 hours ago FUCK YOU.  Nuke Cananada. permalink award report block reply\ntax_collector 1 points 17 hours ago Ham and bacon sandwiches all day long mfers... permalink award report block reply\nTrumpLandslide20201 1 points 1 day ago I would bring open face BLT every day for lunch with extra bacon permalink award report block reply\nThune 1 points 1 day ago Canada is Dar Al-Harb.  Repel the invasion, or they will destroy you. permalink award report block reply\nJmricht 1 points 1 day ago More bacon permalink award report block reply\nOldWhiteMale 1 points 24 hours ago Parents in Canada should ask schools not to pack Muslims in their classrooms. Or their country. permalink award report block reply\nEastTexasMadLad 1 points 24 hours ago Every single day, bacon sandwich, blts permalink award report block reply\nShotgunParade69x 1 points 24 hours ago This next move is called “the Canadian bowdown” permalink award report block reply\nMisprisionIsEvil 1 points 20 hours ago Pack BLT sammiches. permalink award report block reply\nTheSonOfGadsden 1 points 1 day ago Canada continues to reach new levels of stupidity permalink award report block reply\nEADReddit 1 points 1 day ago Fucking Hammy & Cheese everyday with a side of bacon permalink award report block reply\nsicarius 1 points 23 hours ago BLTs it is permalink award report block reply\nhey_spike 1 points 24 hours ago Note to parents of Muslim students: Bacon and other pork products are consumed at this school. Please consider relocating back to your country of origin. permalink award report block reply\nTongs_Ya_Bass 1 points 1 day ago Packs ham hock permalink award report block reply\nbarronwin 1 points 24 hours ago dumb. But I do remember being asked to not pack peanut butter because of some kid's deathly allergies permalink award report block reply\nentERmyMAtrix 1 points 24 hours ago Send them to school with a pound of real bacon. 🥓 🥓🥓🥓🥓🥓 permalink award report block reply\nMaskurbator 1 points 18 hours ago 100% pork it is then. permalink award report block reply\nPede 1 points 1 day ago Next, students must participate in the Muslim calls to prayer during the day. They don't have to speak it but they must do the movements. Then, students must speak it and believe in it. Your daughter doesn't have to wear a hijab but she must exercise respect by wearing a little more clothes than normal. Next, your daughter must wear a hijab or she is responsible for triggering the uncontrollable rape instincts of her male classmates. permalink award report block reply\nbarwhack 1 points 24 hours ago Canadian Bacon is now gay. permalink award report block reply\nlarrry 1 points 23 hours ago murray, you sure you can;'t fit 2 pigs in your lunch box???? permalink award report block reply\nNate_Higgersalot 1 points 17 hours ago Fake. That’s one ugly kid. permalink award report block reply\nJamesBlomey 1 points 21 hours ago What a bunch of bologna! permalink award report block reply\nMorningFrost 1 points 24 hours ago Yes bring the immigrant guests into the country and cater to them. permalink award report block reply\npopcycle 1 points 1 day ago peanut butter and bacon it is permalink award report block reply\nOlderbutwiser 1 points 23 hours ago Next week ,no meat it will offend the Hindu vegetarians! permalink award report block reply\nDeltaSierra 1 points 1 day ago yet another dumb shit post from a dumb fuk that is fake … leftists have destroyed the Donald permalink award report block reply\nIranhasnukes 1 points 23 hours ago Grok says this is fake, and from 2014 permalink award report block reply\nbringbackthe80s 1 points 1 day ago Bacon and ham every fucking day. The proliferation of the bed sheet wearers must be stopped. permalink award report block reply\nGuerillaYourDreams 1 points 1 day ago Too. Fucking. Bad. permalink award report block reply\nTheLeftIsAntiRight 1 points 24 hours ago Coming to a NYC public school near you! permalink award report block reply\nblueeyephoto 1 points 1 day ago i'd pack my kids a BLT sandwich, but replace the LT with more Bacon permalink award report block reply\nBurtMcGirt 1 points 18 hours ago Big Mike packed the pork into a Muslim. permalink award report block reply\nLawless 1 points 23 hours ago Today's leftist love Muslims for some reason permalink award report block reply\nRoadpower 1 points 1 day ago lmao, they're literally a self conquering society. permalink award report block reply\nShitFromShinola 1 points 23 hours ago My kids would be getting BLT's five days per week. And I'd be packing pork rinds instead of chips. permalink award report block reply Roadpower 2 points 21 hours ago Pork rinds are better than chips anyway. permalink parent award report block reply\nRoadpower 2 points 21 hours ago Pork rinds are better than chips anyway. permalink parent award report block reply\nJoinTheDiscussion 1 points 20 hours ago Give them BLTs for lunch every day! permalink award report block reply\nSeldom_Seen_Kid 1 points 1 day ago My kid would be hauling a pork butt to school for lunch. permalink award report block reply\n5DchessWatch 1 points 1 day ago I think the USA citizenship test should require an oath of loyalty that comes in the form of eating a slice of crispy bacon I dont' trust ANYONE who doesn't like them some bacon permalink award report block reply\nCheeseAndOnion 1 points 13 hours ago If i had kids there they would be getting BLT, ham porkchops etc. permalink award report block reply\nConstitution_1788 1 points 24 hours ago I’d wrap my daughter in a Lady-GaGa-style bacon dress with pig’s feet shoes and do her hair with pork grease. permalink award report block reply YaharaRiver 1 points 24 hours ago no you wouldn’t 🙄 permalink parent award report block reply Constitution_1788 2 points 20 hours ago Nah. You’re right. permalink parent award report block reply\nYaharaRiver 1 points 24 hours ago no you wouldn’t 🙄 permalink parent award report block reply Constitution_1788 2 points 20 hours ago Nah. You’re right. permalink parent award report block reply\nConstitution_1788 2 points 20 hours ago Nah. You’re right. permalink parent award report block reply\nBartzFFV 1 points 1 day ago My kid all of a sudden identifies as a piggy pig.  I know its experimental, so I'm going to let them wear their piggy nose and ears to school. permalink award report block reply\nKungPaoMcChicken 1 points 1 day ago Me at work: microwave the pork belly for 2 minutes sending a spray of pork popping everywhere inside the microwave. Cop that Muslim fuckers. permalink award report block reply\nUnboosted 1 points 1 day ago Pigs are for pleasure - old muslim adage. This is why they dont eat pork. Bottom line is if they could breed themselves using pigs they would kill off all their women immediatley. permalink award report block reply GuerillaYourDreams 1 points 1 day ago Maybe that’s why Jesus cast the demons into the swine? permalink parent award report block reply\nGuerillaYourDreams 1 points 1 day ago Maybe that’s why Jesus cast the demons into the swine? permalink parent award report block reply\njdovejr 1 points 1 day ago Fuck em permalink award report block reply\nI_Love_45-70_Gov 1 points 24 hours ago Only Pack Pork Butthole - FTW! permalink award report block reply\nNellie_the_Beaut 1 points 21 hours ago Today’s Sack Lunch Menu🥪: Black Forest Ham & Swiss Sandwich on Jewish Rye Sticky BBQ pork short ribs Deviled Ham w/crackers Garden salad with Bacon bits & Bacon Chipotle Ranch Sweet & Spicy Pork Rinds Chocolate Zingers permalink award report block reply\nFuck_commies_2024 1 points 1 day ago So bacon wrapped bacon it is! permalink award report block reply\ndres3 1 points 1 day ago Is there any part of muslim food (for children) that is a common part of aphrodisiacs? Afterall, we don't want the horrible children to be sexually assaulting the muslim children. Pre-adult hormones and all. They wanna be ridiculous, we can be as well. permalink award report block reply\nDoMagnum 1 points 19 hours ago Don't like it, then go back to Dunecoonistan! permalink award report block reply\njimzumaca 1 points 20 hours ago The goat fuckers can eat somewhere else that isn't haram. permalink award report block reply\nElectionMeddler 1 points 21 hours ago So are Muslims the only group they aren't actively trying to make gay or Trans? permalink award report block reply\nUffda 1 points 24 hours ago I had an Uncle (RIP) Pinky who was a non religious jew. He used to feed the little boy from upstairs (from a kosher family) pork chops. Pinky told the kid it was “bone meat” and not to tell his parents. permalink award report block reply\nbooblitchutz 1 points 1 day ago Canada is so cooked permalink award report block reply DeltaSierra 0 points 1 day ago It is the Donald that is cooked with absolute bull crap posts that people pull out of their asses …. Fake as shit and you all fall for it permalink parent award report block reply\nDeltaSierra 0 points 1 day ago It is the Donald that is cooked with absolute bull crap posts that people pull out of their asses …. Fake as shit and you all fall for it permalink parent award report block reply\ngb1787 1 points 1 day ago Now I’m going to ham even harder permalink award report block reply\nDuesImperator 1 points 1 day ago Hmmm let me plan some packed lunches……..lham and cheese sandwiches, pepperoni sticks, hot dogs, pepperoni or Hawaiian pizza, bologna sandwiches, bacon, crackers with cheese and farmer sausage, baked goods made with lard, leftover ribs etc. permalink award report block reply\nMudDog 1 points 17 hours ago they're worried once the muslim kids try bacon, it's over permalink award report block reply\nCharlesWilliams 1 points 16 hours ago Peanut butter n bacon.  Yeah boy. permalink award report block reply\nMaxmax 1 points 24 hours ago Fuck that. permalink award report block reply\nthejohnson651 1 points 1 day ago Guess what? Don't care about your dumb ideology. permalink award report block reply\nbubadmt 1 points 1 day ago X to doubt.. Engagement farming is as bad, if not worse, now on X from the right since Elon took over than it was from the left during COVID. permalink award report block reply\nStanwyk74 1 points 1 day ago Trojan horse inviting morons!!!!!! permalink award report block reply\nSmurfection 1 points 1 day ago This is insane.  If muslims are going to live in a democracy, they have to peacefully coexist with other who don't follow their dietary laws.   The brazen gull of schools to even ask parents to change the way they feed their kids to accommodate Muslims!  Frankly, if this happened in the U.S. I think there would be a Freedom of religion lawsuit because schools would be asking Christian parents to abide by a Muslim dietary law. permalink award report block reply\nDlanOdcammron 1 points 17 hours ago Is MoHAMmed halal? permalink award report block reply\nHenkZeilstra 1 points 24 hours ago Well thank the 🧃🧃, for the diversity permalink award report block reply\nGhostOfTheRepublic 1 points 24 hours ago More pork!!!  And bacon!!!! And even the fake bacon that’s really ham!! permalink award report block reply\nDrdonaldjtrump1776 1 points 1 day ago No PB and J allowed because if allergies, no ham, wtf r they supposed to eat? permalink award report block reply\ningrowntoenail 1 points 24 hours ago I'd be smoking so much pork for my kid take to school to share with anyone that wanted it.  If you catch the pork bone-in butt on sale at Kroger you can stock up pretty good. permalink award report block reply\nWhoMeTwo 1 points 1 day ago Not only pack copious pounds of bacon, encourage all to partake in the lovely pork-a- palozza... (~_^) permalink award report block reply\nDJT4MoreYears 1 points 20 hours ago Don't bring your religion into your school. Remember? Separation of church and state. And your mudslime(or jew food) is offensive to Canadian kids. So how about you get the fuck out of their schools and get the fuck out of their country and guess what? Everything and everyone will be fine. permalink award report block reply\nGentleSlayer 1 points 1 day ago Let us all quietly reflect on the offensive perfection of the bacon cheeseburger. permalink award report block reply\nRandyQuaidsBeard 1 points 1 day ago Every food item I send would be made of pork. I'd weave a pair of pants and a shirt out of bacon and send my kid to school in that. Fuck them. permalink award report block reply\nsarsaparilla 1 points 16 hours ago Dude sounds gay af and is whining on social media like a 16 year old girl. permalink award report block reply\nJesse3000 1 points 20 hours ago So they don't want you to send your Canadian Citizen student to Canadian School with a Canadian Ham Sandwich.  If you don't comply we'll have to make it a law punishable by euthanisia of  both parents and child at the citizens expense. permalink award report block reply\nFirespawn 1 points 15 hours ago BLT's with some pork n beans it is. Let's say grace.\nSmile with every bite. Fuck muzzies. permalink award report block reply\nancroidubh 1 points 9 hours ago There is no food but pork and bacon is its prophet… permalink award report block reply\nlifeisahologram 1 points 1 day ago Yeah if I was a Canadian parent I would be packing pork everything. permalink award report block reply DeltaSierra 0 points 1 day ago You are not and you would be a dumb ass to add pork to everything because of some dum fuk Marxist that is shilling the Donald with fake trash posts permalink parent award report block reply\nDeltaSierra 0 points 1 day ago You are not and you would be a dumb ass to add pork to everything because of some dum fuk Marxist that is shilling the Donald with fake trash posts permalink parent award report block reply\nKing_Boobus_Toobus 1 points 19 hours ago BLTs every day then it is... permalink award report block reply\nILoveSilk 0 points 23 hours ago And parents will oblige. permalink award report block reply\nlrdrokol 0 points 1 day ago This is being touted as FALSE NEWS by many Fact Checkers and GROK. Lots of Schemers in this site. permalink award report block reply\n5DchessWatch 0 points 1 day ago This is so 4 weeks ago news permalink award report block reply\nDantalian 0 points 24 hours ago How did Muslims take over ALL the Western \"democracies?\" permalink award report block reply\nRudeFrog 0 points 1 day ago I find being Muslim is offensive so now Canada has to ban Muslimx permalink award report block reply\nexpertnoticer 1 points 19 hours ago Comment removed by community filter, pending further review. permalink award report block reply\nKnockoff 1 points 1 day ago Comment removed by community filter, pending further review. permalink award report block reply"}