{"id": "1ARK9k0RdL", "contents": "545 I'm not gonna defend MTG on everything, but she is absolutely correct to demand that we stop the foreign grifts. Ukraine etc. posted 1 day ago by StopCorruptionDC 22 comments award share download report block\n22 comments Sort by Top Top New Worst Old Save 2021Is1776 21 points 1 day ago cool now get her to stop corporate welfare AKA using illegals for labor. permalink award report block reply BlackJack1776 11 points 1 day ago She's in full damage control mode. \"Lemme throw basic bitch MAGA red meat out out to the Base. Surely, somebody will simp for me. And, while they're calling each other retarded over it, my bullshit will simply fade away with the next news cycle.\". -MTG permalink parent award report block reply TruculentGoose 15 points 1 day ago Yup... imagine hiring and employing illegals then still trying to claim MAGA... shes a joke permalink parent award report block reply Porkbut 4 points 1 day ago Grifting and pandering is so easy even a cavewoman can do it. permalink parent award report block reply 2021Is1776 1 points 1 day ago At this point if a girl is spouting Maga talking points I assume its a grift. Unless she can lay out the foundational principles of America first and admit the ones she violates I don't trust her. None of us are perfect I myself violate a few of our core tenants from time to time but I recognize those missteps and adjust accordingly. I myself am a contractor and have been for many years but you know what I've never done? used illegals even when it means working the project on my own. permalink parent award report block reply Corse46 1 points 23 hours ago Wasn't Trump the one that said the farmers can keep illegal workers as long as they haven't broken any other laws? Or was that MTG? permalink parent award report block reply dataonly 8 points 1 day ago You had me at... I'm not gonna defend MTG permalink award report block reply T471 6 points 1 day ago She's an ally, I don't care about the petty stuff. Ukraine, Israel, time for us to part ways with them. permalink award report block reply Drdonaldjtrump1776 5 points 1 day ago All that money and handlers and can't even get her hair done right. permalink award report block reply Tulkas71 4 points 1 day ago Its like her face from the eyes up and below are two different people permalink award report block reply TearsAficionado 3 points 1 day ago Can't unsee that now 🤣 permalink parent award report block reply KennyUS 3 points 1 day ago 0 dollars for any nation or illegals until the national debt is paid off. permalink award report block reply lifeisahologram 2 points 1 day ago Nobody is ever correct on everything, nobody is infallible and perfect, except God. So when Rand or MTG do something brain dead retarded, it’s annoying when they are absolutely correct on an issue and people pretend like they can’t hear the arguments and then just hate the person. permalink award report block reply DCYR66 1 points 1 day ago I thought Trump already cut those purse strings? permalink award report block reply NoticesBugleOWO 1 points 1 day ago We aren't gifting anything to Ukraine. Europe is buying our stuff and giving it to them. MTG is a retard. permalink award report block reply berserkerbarrage 0 points 15 hours ago The same is true with Israel but that doesn't stop people from pretending that Trump has given them 6 gorillion dollars. permalink parent award report block reply _Trunalimunumaprzure 1 points 1 day ago Interesting to see a grifter demand the grifting stop 😂 permalink award report block reply barwhack 1 points 1 day ago Trump needs to listen-to - rather than denigrate - actual representatives. He doesn't have to agree or act, but he needs to listen. He's losing his own representative status, by not doing so. permalink award report block reply ShadowInv 0 points 1 day ago Ukraine is run my jews and russia run by jews. The conflict is there to kill white men. permalink award report block reply BBvarn -1 points 1 day ago I told this bitch to STFU and go make Brian a samwich. permalink award report block reply\n2021Is1776 21 points 1 day ago cool now get her to stop corporate welfare AKA using illegals for labor. permalink award report block reply BlackJack1776 11 points 1 day ago She's in full damage control mode. \"Lemme throw basic bitch MAGA red meat out out to the Base. Surely, somebody will simp for me. And, while they're calling each other retarded over it, my bullshit will simply fade away with the next news cycle.\". -MTG permalink parent award report block reply TruculentGoose 15 points 1 day ago Yup... imagine hiring and employing illegals then still trying to claim MAGA... shes a joke permalink parent award report block reply Porkbut 4 points 1 day ago Grifting and pandering is so easy even a cavewoman can do it. permalink parent award report block reply 2021Is1776 1 points 1 day ago At this point if a girl is spouting Maga talking points I assume its a grift. Unless she can lay out the foundational principles of America first and admit the ones she violates I don't trust her. None of us are perfect I myself violate a few of our core tenants from time to time but I recognize those missteps and adjust accordingly. I myself am a contractor and have been for many years but you know what I've never done? used illegals even when it means working the project on my own. permalink parent award report block reply Corse46 1 points 23 hours ago Wasn't Trump the one that said the farmers can keep illegal workers as long as they haven't broken any other laws? Or was that MTG? permalink parent award report block reply\nBlackJack1776 11 points 1 day ago She's in full damage control mode. \"Lemme throw basic bitch MAGA red meat out out to the Base. Surely, somebody will simp for me. And, while they're calling each other retarded over it, my bullshit will simply fade away with the next news cycle.\". -MTG permalink parent award report block reply TruculentGoose 15 points 1 day ago Yup... imagine hiring and employing illegals then still trying to claim MAGA... shes a joke permalink parent award report block reply\nTruculentGoose 15 points 1 day ago Yup... imagine hiring and employing illegals then still trying to claim MAGA... shes a joke permalink parent award report block reply\nPorkbut 4 points 1 day ago Grifting and pandering is so easy even a cavewoman can do it. permalink parent award report block reply 2021Is1776 1 points 1 day ago At this point if a girl is spouting Maga talking points I assume its a grift. Unless she can lay out the foundational principles of America first and admit the ones she violates I don't trust her. None of us are perfect I myself violate a few of our core tenants from time to time but I recognize those missteps and adjust accordingly. I myself am a contractor and have been for many years but you know what I've never done? used illegals even when it means working the project on my own. permalink parent award report block reply\n2021Is1776 1 points 1 day ago At this point if a girl is spouting Maga talking points I assume its a grift. Unless she can lay out the foundational principles of America first and admit the ones she violates I don't trust her. None of us are perfect I myself violate a few of our core tenants from time to time but I recognize those missteps and adjust accordingly. I myself am a contractor and have been for many years but you know what I've never done? used illegals even when it means working the project on my own. permalink parent award report block reply\nCorse46 1 points 23 hours ago Wasn't Trump the one that said the farmers can keep illegal workers as long as they haven't broken any other laws? Or was that MTG? permalink parent award report block reply\ndataonly 8 points 1 day ago You had me at... I'm not gonna defend MTG permalink award report block reply\nT471 6 points 1 day ago She's an ally, I don't care about the petty stuff. Ukraine, Israel, time for us to part ways with them. permalink award report block reply\nDrdonaldjtrump1776 5 points 1 day ago All that money and handlers and can't even get her hair done right. permalink award report block reply\nTulkas71 4 points 1 day ago Its like her face from the eyes up and below are two different people permalink award report block reply TearsAficionado 3 points 1 day ago Can't unsee that now 🤣 permalink parent award report block reply\nTearsAficionado 3 points 1 day ago Can't unsee that now 🤣 permalink parent award report block reply\nKennyUS 3 points 1 day ago 0 dollars for any nation or illegals until the national debt is paid off. permalink award report block reply\nlifeisahologram 2 points 1 day ago Nobody is ever correct on everything, nobody is infallible and perfect, except God. So when Rand or MTG do something brain dead retarded, it’s annoying when they are absolutely correct on an issue and people pretend like they can’t hear the arguments and then just hate the person. permalink award report block reply\nDCYR66 1 points 1 day ago I thought Trump already cut those purse strings? permalink award report block reply\nNoticesBugleOWO 1 points 1 day ago We aren't gifting anything to Ukraine. Europe is buying our stuff and giving it to them. MTG is a retard. permalink award report block reply berserkerbarrage 0 points 15 hours ago The same is true with Israel but that doesn't stop people from pretending that Trump has given them 6 gorillion dollars. permalink parent award report block reply\nberserkerbarrage 0 points 15 hours ago The same is true with Israel but that doesn't stop people from pretending that Trump has given them 6 gorillion dollars. permalink parent award report block reply\n_Trunalimunumaprzure 1 points 1 day ago Interesting to see a grifter demand the grifting stop 😂 permalink award report block reply\nbarwhack 1 points 1 day ago Trump needs to listen-to - rather than denigrate - actual representatives. He doesn't have to agree or act, but he needs to listen. He's losing his own representative status, by not doing so. permalink award report block reply\nShadowInv 0 points 1 day ago Ukraine is run my jews and russia run by jews. The conflict is there to kill white men. permalink award report block reply\nBBvarn -1 points 1 day ago I told this bitch to STFU and go make Brian a samwich. permalink award report block reply"}