{"id": "1ARK9jztKz", "contents": "1020 Now kiss his shoe. posted 1 day ago by wst4 43 comments award share download report block\n43 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Save on Your Electric Bill (Try Tonight) GadgetCyno Patriots4TN 25 points 1 day ago PUT SHOE ON HEAD permalink award report block reply DogPilledMom69 8 points 1 day ago Came here for the lulz. Was not disappointed. permalink parent award report block reply Deportthemall23 -1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply Liberats 5 points 1 day ago Put shoe in mouth permalink parent award report block reply Ritchie_Blackadder 1 points 1 day ago Put boot in ass permalink parent award report block reply EdgyUsernamexX69Xx 13 points 1 day ago What’d we get out of “great deal” again? permalink award report block reply TPMJB 12 points 1 day ago Probably more money for Israel. permalink parent award report block reply Cheesemaker 3 points 1 day ago and more SNAP funding to keep Gorlock the Destroyer from starving permalink parent award report block reply Deportthemall23 -1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply starjello 1 points 1 day ago Most likely. Next week Time will show a picture of Trump kneeling before Bibi. Down vote away zombies. permalink parent award report block reply TPMJB 2 points 1 day ago Take my reddit gold updoot, kind redditor! permalink parent award report block reply starjello 1 points 1 day ago Yep the idiots around here love to refer to the truth tellers as redditors. Hell after 2016 I was on the reddit Trump site until it was shut down, then over to VOAT until that went titz up. Been here quite awhile  and eventually after this place dies a painful death on to the underground. permalink parent award report block reply view 7 more comments... NonbinaryPotatohead 7 points 1 day ago We didn't get shit LOL permalink parent award report block reply rebuildingMyself 6 points 1 day ago Kick the can down the road not even two months and start the whining all over again permalink parent award report block reply KekistaniMemeLord 0 points 1 day ago A complete and total defeat of demcucks using their usual tactics. No 1.5 trillion for illegals and incredible bad PR for SNAP and Dems as a whole. permalink parent award report block reply TrumpDupedMAGA -1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply DogPilledMAGA 7 points 1 day ago Put shoe on head! permalink award report block reply TPMJB 8 points 1 day ago 3 day old account copies your comment, gets 17+ points and you get downvoted. Shilling here is pretty bad, eh? permalink parent award report block reply DogPilledMAGA 1 points 1 day ago Comment removed by community filter, pending further review. permalink parent award report block reply EdgyUsernamexX69Xx 1 points 1 day ago And the community filter to follow lmao proving his point for him permalink parent award report block reply TPMJB 1 points 1 day ago It was an 8 hour old account lmao. This place is funny permalink parent award report block reply Yignuced 6 points 1 day ago Who’s the baddest mofo round this town! permalink award report block reply dodgetimes2 3 points 1 day ago I always upvote a Last Dragon reference. Sho Nuff!!! Now kiss my Converse!! permalink parent award report block reply SuperHonkey 2 points 1 day ago Who's da massa!? permalink parent award report block reply Deplorable556 4 points 1 day ago puts cheese on shoe and starts french kissin it. permalink award report block reply ListenJack 3 points 1 day ago American Lives Matter Chuck! permalink award report block reply quiznossucks 2 points 1 day ago 😆😆😆😆😆 permalink award report block reply akai_ferret 2 points 1 day ago Reverse the pictures. ACTUALLY LOOK AT WHAT'S IN THE COMPROMISE! Democrats have won again. Republican politicians are weak, backstabbing faggots. permalink award report block reply starjello 2 points 1 day ago Hey the \"elitists\" that are around here are much like the main stream leftist media. They love to spin things. Then attack you with \"doomer\" and down votes. permalink parent award report block reply UncleTrumpsBand 2 points 1 day ago “Kiss it” “Apologize” permalink award report block reply Everyonelovesblacks 1 points 1 day ago KNEEL BEFORE ZOD!!! permalink award report block reply Gopropak 1 points 1 day ago Do it. https://imgur.com/a/udGIsKk permalink award report block reply ParadigmShift2070 1 points 1 day ago both of you kiss the wall permalink award report block reply Smurfection 0 points 1 day ago Schumer is done.  AOC is going to be the next U.S. Senator from New York.  That being said, other than the \"six ways from Sunday\" threat and the threat against SCOTUS, Schumer didn't seem to have a hand in Muh Russia collusion Hoax, \"Very fine people\" Hoax, the raid on Mar-a-Lago, the Biden-Garland-Smith set up, the Stormy lies or J6 ridiculousness other than to leave the chamber along with Pelosi, Pence and McConnell.  Yes, he said some things to media but he doesn't seem to have been part of the orchstrating or fomenting of these hoaxes. If anyone has anything that shows Schumer was part of the actual conspiracy in any of these hoaxes, I'd like to see it. permalink award report block reply South_Florida_Guy -2 points 1 day ago Yass Kang! permalink award report block reply\nPatriots4TN 25 points 1 day ago PUT SHOE ON HEAD permalink award report block reply DogPilledMom69 8 points 1 day ago Came here for the lulz. Was not disappointed. permalink parent award report block reply Deportthemall23 -1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply Liberats 5 points 1 day ago Put shoe in mouth permalink parent award report block reply Ritchie_Blackadder 1 points 1 day ago Put boot in ass permalink parent award report block reply\nDogPilledMom69 8 points 1 day ago Came here for the lulz. Was not disappointed. permalink parent award report block reply Deportthemall23 -1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply\nDeportthemall23 -1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply\nLiberats 5 points 1 day ago Put shoe in mouth permalink parent award report block reply\nRitchie_Blackadder 1 points 1 day ago Put boot in ass permalink parent award report block reply\nEdgyUsernamexX69Xx 13 points 1 day ago What’d we get out of “great deal” again? permalink award report block reply TPMJB 12 points 1 day ago Probably more money for Israel. permalink parent award report block reply Cheesemaker 3 points 1 day ago and more SNAP funding to keep Gorlock the Destroyer from starving permalink parent award report block reply Deportthemall23 -1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply starjello 1 points 1 day ago Most likely. Next week Time will show a picture of Trump kneeling before Bibi. Down vote away zombies. permalink parent award report block reply TPMJB 2 points 1 day ago Take my reddit gold updoot, kind redditor! permalink parent award report block reply starjello 1 points 1 day ago Yep the idiots around here love to refer to the truth tellers as redditors. Hell after 2016 I was on the reddit Trump site until it was shut down, then over to VOAT until that went titz up. Been here quite awhile  and eventually after this place dies a painful death on to the underground. permalink parent award report block reply view 7 more comments... NonbinaryPotatohead 7 points 1 day ago We didn't get shit LOL permalink parent award report block reply rebuildingMyself 6 points 1 day ago Kick the can down the road not even two months and start the whining all over again permalink parent award report block reply KekistaniMemeLord 0 points 1 day ago A complete and total defeat of demcucks using their usual tactics. No 1.5 trillion for illegals and incredible bad PR for SNAP and Dems as a whole. permalink parent award report block reply TrumpDupedMAGA -1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nTPMJB 12 points 1 day ago Probably more money for Israel. permalink parent award report block reply Cheesemaker 3 points 1 day ago and more SNAP funding to keep Gorlock the Destroyer from starving permalink parent award report block reply Deportthemall23 -1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply starjello 1 points 1 day ago Most likely. Next week Time will show a picture of Trump kneeling before Bibi. Down vote away zombies. permalink parent award report block reply TPMJB 2 points 1 day ago Take my reddit gold updoot, kind redditor! permalink parent award report block reply starjello 1 points 1 day ago Yep the idiots around here love to refer to the truth tellers as redditors. Hell after 2016 I was on the reddit Trump site until it was shut down, then over to VOAT until that went titz up. Been here quite awhile  and eventually after this place dies a painful death on to the underground. permalink parent award report block reply view 7 more comments...\nCheesemaker 3 points 1 day ago and more SNAP funding to keep Gorlock the Destroyer from starving permalink parent award report block reply Deportthemall23 -1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply\nDeportthemall23 -1 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply\nstarjello 1 points 1 day ago Most likely. Next week Time will show a picture of Trump kneeling before Bibi. Down vote away zombies. permalink parent award report block reply TPMJB 2 points 1 day ago Take my reddit gold updoot, kind redditor! permalink parent award report block reply starjello 1 points 1 day ago Yep the idiots around here love to refer to the truth tellers as redditors. Hell after 2016 I was on the reddit Trump site until it was shut down, then over to VOAT until that went titz up. Been here quite awhile  and eventually after this place dies a painful death on to the underground. permalink parent award report block reply view 7 more comments...\nTPMJB 2 points 1 day ago Take my reddit gold updoot, kind redditor! permalink parent award report block reply starjello 1 points 1 day ago Yep the idiots around here love to refer to the truth tellers as redditors. Hell after 2016 I was on the reddit Trump site until it was shut down, then over to VOAT until that went titz up. Been here quite awhile  and eventually after this place dies a painful death on to the underground. permalink parent award report block reply view 7 more comments...\nstarjello 1 points 1 day ago Yep the idiots around here love to refer to the truth tellers as redditors. Hell after 2016 I was on the reddit Trump site until it was shut down, then over to VOAT until that went titz up. Been here quite awhile  and eventually after this place dies a painful death on to the underground. permalink parent award report block reply view 7 more comments...\nNonbinaryPotatohead 7 points 1 day ago We didn't get shit LOL permalink parent award report block reply\nrebuildingMyself 6 points 1 day ago Kick the can down the road not even two months and start the whining all over again permalink parent award report block reply\nKekistaniMemeLord 0 points 1 day ago A complete and total defeat of demcucks using their usual tactics. No 1.5 trillion for illegals and incredible bad PR for SNAP and Dems as a whole. permalink parent award report block reply\nTrumpDupedMAGA -1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nDogPilledMAGA 7 points 1 day ago Put shoe on head! permalink award report block reply TPMJB 8 points 1 day ago 3 day old account copies your comment, gets 17+ points and you get downvoted. Shilling here is pretty bad, eh? permalink parent award report block reply DogPilledMAGA 1 points 1 day ago Comment removed by community filter, pending further review. permalink parent award report block reply EdgyUsernamexX69Xx 1 points 1 day ago And the community filter to follow lmao proving his point for him permalink parent award report block reply TPMJB 1 points 1 day ago It was an 8 hour old account lmao. This place is funny permalink parent award report block reply\nTPMJB 8 points 1 day ago 3 day old account copies your comment, gets 17+ points and you get downvoted. Shilling here is pretty bad, eh? permalink parent award report block reply DogPilledMAGA 1 points 1 day ago Comment removed by community filter, pending further review. permalink parent award report block reply EdgyUsernamexX69Xx 1 points 1 day ago And the community filter to follow lmao proving his point for him permalink parent award report block reply TPMJB 1 points 1 day ago It was an 8 hour old account lmao. This place is funny permalink parent award report block reply\nDogPilledMAGA 1 points 1 day ago Comment removed by community filter, pending further review. permalink parent award report block reply EdgyUsernamexX69Xx 1 points 1 day ago And the community filter to follow lmao proving his point for him permalink parent award report block reply TPMJB 1 points 1 day ago It was an 8 hour old account lmao. This place is funny permalink parent award report block reply\nEdgyUsernamexX69Xx 1 points 1 day ago And the community filter to follow lmao proving his point for him permalink parent award report block reply TPMJB 1 points 1 day ago It was an 8 hour old account lmao. This place is funny permalink parent award report block reply\nTPMJB 1 points 1 day ago It was an 8 hour old account lmao. This place is funny permalink parent award report block reply\nYignuced 6 points 1 day ago Who’s the baddest mofo round this town! permalink award report block reply dodgetimes2 3 points 1 day ago I always upvote a Last Dragon reference. Sho Nuff!!! Now kiss my Converse!! permalink parent award report block reply SuperHonkey 2 points 1 day ago Who's da massa!? permalink parent award report block reply\ndodgetimes2 3 points 1 day ago I always upvote a Last Dragon reference. Sho Nuff!!! Now kiss my Converse!! permalink parent award report block reply SuperHonkey 2 points 1 day ago Who's da massa!? permalink parent award report block reply\nSuperHonkey 2 points 1 day ago Who's da massa!? permalink parent award report block reply\nDeplorable556 4 points 1 day ago puts cheese on shoe and starts french kissin it. permalink award report block reply\nListenJack 3 points 1 day ago American Lives Matter Chuck! permalink award report block reply\nquiznossucks 2 points 1 day ago 😆😆😆😆😆 permalink award report block reply\nakai_ferret 2 points 1 day ago Reverse the pictures. ACTUALLY LOOK AT WHAT'S IN THE COMPROMISE! Democrats have won again. Republican politicians are weak, backstabbing faggots. permalink award report block reply starjello 2 points 1 day ago Hey the \"elitists\" that are around here are much like the main stream leftist media. They love to spin things. Then attack you with \"doomer\" and down votes. permalink parent award report block reply\nstarjello 2 points 1 day ago Hey the \"elitists\" that are around here are much like the main stream leftist media. They love to spin things. Then attack you with \"doomer\" and down votes. permalink parent award report block reply\nUncleTrumpsBand 2 points 1 day ago “Kiss it” “Apologize” permalink award report block reply\nEveryonelovesblacks 1 points 1 day ago KNEEL BEFORE ZOD!!! permalink award report block reply\nGopropak 1 points 1 day ago Do it. https://imgur.com/a/udGIsKk permalink award report block reply\nParadigmShift2070 1 points 1 day ago both of you kiss the wall permalink award report block reply\nSmurfection 0 points 1 day ago Schumer is done.  AOC is going to be the next U.S. Senator from New York.  That being said, other than the \"six ways from Sunday\" threat and the threat against SCOTUS, Schumer didn't seem to have a hand in Muh Russia collusion Hoax, \"Very fine people\" Hoax, the raid on Mar-a-Lago, the Biden-Garland-Smith set up, the Stormy lies or J6 ridiculousness other than to leave the chamber along with Pelosi, Pence and McConnell.  Yes, he said some things to media but he doesn't seem to have been part of the orchstrating or fomenting of these hoaxes. If anyone has anything that shows Schumer was part of the actual conspiracy in any of these hoaxes, I'd like to see it. permalink award report block reply\nSouth_Florida_Guy -2 points 1 day ago Yass Kang! permalink award report block reply"}