{"id": "1ARK9pfbQF", "contents": "30 Mods are compromised, they are allowing rule-breaking shills to violate Rule 1 (be here for MAGA and Trump) posted 7 hours ago by UCantStumpTheTrump 51 comments award share report block Notice the influx of people complaining about Trump, pushing single-issue topics (like the Epstein list)? They are Redditors here to sow discord because the Democrat party is in shambles, so the next best thing is to make the other guy look bad. Often times the shills will blend in by making acceptable posts for awhile then start turning up the rhetoric. A common tell is referring to users on this site as \"you guys\" (slip-up indicating they don't consider themselves part of this community). Anyways, be very diligent about vetting posters and if you see people shitting on DJT (who saved us from a Kamala \"Presidency\") make sure to call them out.\n51 comments Sort by Top Top New Worst Old Save Around the Web 5 Parasite Causing Foods You Should Stop Eating Right Now Paratoxil Truthisunpopular 21 points 7 hours ago Anyone that disagrees with trump that Americans are too stupid, lazy and incompetent to do any job in America, from farmhand to engineer is a shill. Anyone that doesn't want 600k chicoms per year stealing tech and infesting our education system (and setting the curriculum, undoubtedly) disagrees with trump and is here from bluesky. Anyone that thinks the pathetic rates of deportation, which do not even meet the birthrate of new anchor babies and never EVER target the landlords and employers of illegals, is here from reddit. permalink award report block reply patrioticwinning3 14 points 7 hours ago Don't forget to take your clot shot boosters!  Anyone who disagrees with Trump is a shill remember! permalink parent award report block reply berserkerbarrage -17 points 7 hours ago You're a faggot and a shill and that's all you'll ever be, which is sad. permalink parent award report block reply Truthisunpopular 13 points 7 hours ago You can only attack the messenger but cannot refute the message. Pathetic. permalink parent award report block reply patrioticwinning3 6 points 7 hours ago Bro, stop talking to yourself, its just weird :p permalink parent award report block reply patrioticwinning3 18 points 7 hours ago Lol, let me guess, you report ANYONE who dares point out they don't like Trump endorsing H1Bs and implying Americans are too lazy and stupid to do any work as \"violating rule 1, herp derp.\"  Or \"shitting on Trump\" Amirite? permalink award report block reply MarshallB 1 points 7 hours ago Actually no. I am against Cornyn specifically because he supports H1B. But the difference is I support TRUMP and believe H1B support is hurting him and I don't want to see him hurt. permalink parent award report block reply patrioticwinning3 15 points 7 hours ago The pain is regretfully self inflicted for Trump.... permalink parent award report block reply MarshallB 7 points 7 hours ago I must agree. My disagreement with Trump is BECAUSE I support him generally. I do not believe the H1B program is necessary and I do believe it is even MORE CORRUPT than BIG PHARMA. permalink parent award report block reply berserkerbarrage -18 points 7 hours ago 99% of people in the real world couldn't care less about H-1B. It's at the very bottom of the list of problems that this country has. permalink parent award report block reply MarshallB 9 points 7 hours ago Many times the seed of the downfall of a society is something most \"couldn't care less about.\" permalink parent award report block reply patrioticwinning3 6 points 7 hours ago If you believe no one cares about H1Bs, I've got a bridge to sell you XD permalink parent award report block reply berserkerbarrage -9 points 7 hours ago That's nice, but H-1B is a 35 year old program that accounts for only a tiny fraction of a percentage of immigration and it hasn't gotten any worse under Trump, who doesn't have the authority to end it even if he wanted to because it's the law, enacted by Congress. If anything he has taken steps to curb the abuse (e.g.  adding a $100k fee). permalink parent award report block reply view 1 more comments... Brandon1776 1 points 6 hours ago You must be a jew talking like that permalink parent award report block reply deleted 1 points 6 hours ago view 10 more comments... Schweddynadzbackup 1 points 44 minutes ago You must not live in it permalink parent award report block reply berserkerbarrage -15 points 7 hours ago You shills aren't very subtle. And you've not managed to gaslight anybody but yourselves. permalink parent award report block reply patrioticwinning3 7 points 7 hours ago Bro, stop talking to yourself, its weird :p permalink parent award report block reply moxieprox 6 points 6 hours ago ❄🎵❄ \"It's beginning to look a lot like.....Reddit\" ❄🎵❄ permalink award report block reply Brandon1776 6 points 6 hours ago Trump turned his back on us. We are NOT a cult. America FIRST, America ONLY or gtfo permalink award report block reply HeavyMetalPatriot 8 points 6 hours ago THIS!!! The Trump cultists and GOP sheep don't understand AMERICA FIRST actually means we demand AMERICA FIRST actions from anyone waving the MAGA banner. We don't need MAGA talk. We need MAGA actions. permalink parent award report block reply GuerillaYourDreams 5 points 6 hours ago I have nuked four of them, so far, I believe. permalink award report block reply Brandon1776 -2 points 6 hours ago This is a comment from a women permalink parent award report block reply MasterChief 3 points 3 hours ago Learn to read faggot Be here for MAGA and Trump\nWe’re a community for those who want to Make America Great Again . If your purpose here is to push other unrelated or tangential agendas, you’re not welcome. permalink award report block reply Matehmateh 3 points 6 hours ago For a brief moment I thought I was using twitter when browsing here permalink award report block reply OrangeManNotBad 3 points 7 hours ago Mods have always been compromised. permalink award report block reply UCantStumpTheTrump OP -4 points 7 hours ago bingo and i see you've already been downvoted lmfao permalink parent award report block reply MarshallB 1 points 7 hours ago You're not over the TARGET until you receive a downvote bot or two or three. permalink parent award report block reply UCantStumpTheTrump OP 0 points 6 hours ago i see you've been targeted as well permalink parent award report block reply MarshallB 2 points 3 hours ago Only 5. permalink parent award report block reply eclectic22 -4 points 7 hours ago You are responding to a troll. Follow your own rules and be careful. permalink parent award report block reply bananafone 2 points 7 hours ago This comes in cycles. They'll move on. permalink award report block reply UCantStumpTheTrump OP 1 points 6 hours ago yep time and time again The_Donald from its inception has seen massive waves of shills, I remember famously from Hillary's \"Correct The Record\" in 2016 https://en.wikipedia.org/wiki/Correct_the_Record permalink parent award report block reply BannedAccount 2 points 2 hours ago Rule 1 be here for MAGA and Trump...ok but what if Trump goes one way and MAGA goes another? What then? The problem here is that the movement and the man are 2 separate entities whereas Trump has inflated his own ego to the point he believes he IS the movement and by doing so has largely abandoned the movement thinking that no matter what he does its MAGA because of the heavy cult like following he has that just nod and clap at every shit he takes...theres a massive difference between supporting Trump and enabling Trumps bad decisions. permalink award report block reply MarshallB -1 points 7 hours ago Make use of the DEPORT feature. Perhaps it's the ONLY positive use of the term LIBERALLY. permalink award report block reply GuerillaYourDreams 2 points 4 hours ago “Liberally apply water from the sponge to the head of the person who’s about to be executed.” For treason. permalink parent award report block reply justinkayz -4 points 6 hours ago Quit your fucking whining, faggot permalink award report block reply UCantStumpTheTrump OP -2 points 6 hours ago eat shit permalink parent award report block reply Brandon1776 1 points 6 hours ago Cult member permalink parent award report block reply JeetPoopDo 1 points 4 hours ago Comment removed by community filter, pending further review. permalink award report block reply\nTruthisunpopular 21 points 7 hours ago Anyone that disagrees with trump that Americans are too stupid, lazy and incompetent to do any job in America, from farmhand to engineer is a shill. Anyone that doesn't want 600k chicoms per year stealing tech and infesting our education system (and setting the curriculum, undoubtedly) disagrees with trump and is here from bluesky. Anyone that thinks the pathetic rates of deportation, which do not even meet the birthrate of new anchor babies and never EVER target the landlords and employers of illegals, is here from reddit. permalink award report block reply patrioticwinning3 14 points 7 hours ago Don't forget to take your clot shot boosters!  Anyone who disagrees with Trump is a shill remember! permalink parent award report block reply berserkerbarrage -17 points 7 hours ago You're a faggot and a shill and that's all you'll ever be, which is sad. permalink parent award report block reply Truthisunpopular 13 points 7 hours ago You can only attack the messenger but cannot refute the message. Pathetic. permalink parent award report block reply patrioticwinning3 6 points 7 hours ago Bro, stop talking to yourself, its just weird :p permalink parent award report block reply\npatrioticwinning3 14 points 7 hours ago Don't forget to take your clot shot boosters!  Anyone who disagrees with Trump is a shill remember! permalink parent award report block reply\nberserkerbarrage -17 points 7 hours ago You're a faggot and a shill and that's all you'll ever be, which is sad. permalink parent award report block reply Truthisunpopular 13 points 7 hours ago You can only attack the messenger but cannot refute the message. Pathetic. permalink parent award report block reply patrioticwinning3 6 points 7 hours ago Bro, stop talking to yourself, its just weird :p permalink parent award report block reply\nTruthisunpopular 13 points 7 hours ago You can only attack the messenger but cannot refute the message. Pathetic. permalink parent award report block reply\npatrioticwinning3 6 points 7 hours ago Bro, stop talking to yourself, its just weird :p permalink parent award report block reply\npatrioticwinning3 18 points 7 hours ago Lol, let me guess, you report ANYONE who dares point out they don't like Trump endorsing H1Bs and implying Americans are too lazy and stupid to do any work as \"violating rule 1, herp derp.\"  Or \"shitting on Trump\" Amirite? permalink award report block reply MarshallB 1 points 7 hours ago Actually no. I am against Cornyn specifically because he supports H1B. But the difference is I support TRUMP and believe H1B support is hurting him and I don't want to see him hurt. permalink parent award report block reply patrioticwinning3 15 points 7 hours ago The pain is regretfully self inflicted for Trump.... permalink parent award report block reply MarshallB 7 points 7 hours ago I must agree. My disagreement with Trump is BECAUSE I support him generally. I do not believe the H1B program is necessary and I do believe it is even MORE CORRUPT than BIG PHARMA. permalink parent award report block reply berserkerbarrage -18 points 7 hours ago 99% of people in the real world couldn't care less about H-1B. It's at the very bottom of the list of problems that this country has. permalink parent award report block reply MarshallB 9 points 7 hours ago Many times the seed of the downfall of a society is something most \"couldn't care less about.\" permalink parent award report block reply patrioticwinning3 6 points 7 hours ago If you believe no one cares about H1Bs, I've got a bridge to sell you XD permalink parent award report block reply berserkerbarrage -9 points 7 hours ago That's nice, but H-1B is a 35 year old program that accounts for only a tiny fraction of a percentage of immigration and it hasn't gotten any worse under Trump, who doesn't have the authority to end it even if he wanted to because it's the law, enacted by Congress. If anything he has taken steps to curb the abuse (e.g.  adding a $100k fee). permalink parent award report block reply view 1 more comments... Brandon1776 1 points 6 hours ago You must be a jew talking like that permalink parent award report block reply deleted 1 points 6 hours ago view 10 more comments... Schweddynadzbackup 1 points 44 minutes ago You must not live in it permalink parent award report block reply berserkerbarrage -15 points 7 hours ago You shills aren't very subtle. And you've not managed to gaslight anybody but yourselves. permalink parent award report block reply patrioticwinning3 7 points 7 hours ago Bro, stop talking to yourself, its weird :p permalink parent award report block reply\nMarshallB 1 points 7 hours ago Actually no. I am against Cornyn specifically because he supports H1B. But the difference is I support TRUMP and believe H1B support is hurting him and I don't want to see him hurt. permalink parent award report block reply patrioticwinning3 15 points 7 hours ago The pain is regretfully self inflicted for Trump.... permalink parent award report block reply MarshallB 7 points 7 hours ago I must agree. My disagreement with Trump is BECAUSE I support him generally. I do not believe the H1B program is necessary and I do believe it is even MORE CORRUPT than BIG PHARMA. permalink parent award report block reply berserkerbarrage -18 points 7 hours ago 99% of people in the real world couldn't care less about H-1B. It's at the very bottom of the list of problems that this country has. permalink parent award report block reply MarshallB 9 points 7 hours ago Many times the seed of the downfall of a society is something most \"couldn't care less about.\" permalink parent award report block reply patrioticwinning3 6 points 7 hours ago If you believe no one cares about H1Bs, I've got a bridge to sell you XD permalink parent award report block reply berserkerbarrage -9 points 7 hours ago That's nice, but H-1B is a 35 year old program that accounts for only a tiny fraction of a percentage of immigration and it hasn't gotten any worse under Trump, who doesn't have the authority to end it even if he wanted to because it's the law, enacted by Congress. If anything he has taken steps to curb the abuse (e.g.  adding a $100k fee). permalink parent award report block reply view 1 more comments... Brandon1776 1 points 6 hours ago You must be a jew talking like that permalink parent award report block reply deleted 1 points 6 hours ago view 10 more comments... Schweddynadzbackup 1 points 44 minutes ago You must not live in it permalink parent award report block reply\npatrioticwinning3 15 points 7 hours ago The pain is regretfully self inflicted for Trump.... permalink parent award report block reply MarshallB 7 points 7 hours ago I must agree. My disagreement with Trump is BECAUSE I support him generally. I do not believe the H1B program is necessary and I do believe it is even MORE CORRUPT than BIG PHARMA. permalink parent award report block reply\nMarshallB 7 points 7 hours ago I must agree. My disagreement with Trump is BECAUSE I support him generally. I do not believe the H1B program is necessary and I do believe it is even MORE CORRUPT than BIG PHARMA. permalink parent award report block reply\nberserkerbarrage -18 points 7 hours ago 99% of people in the real world couldn't care less about H-1B. It's at the very bottom of the list of problems that this country has. permalink parent award report block reply MarshallB 9 points 7 hours ago Many times the seed of the downfall of a society is something most \"couldn't care less about.\" permalink parent award report block reply patrioticwinning3 6 points 7 hours ago If you believe no one cares about H1Bs, I've got a bridge to sell you XD permalink parent award report block reply berserkerbarrage -9 points 7 hours ago That's nice, but H-1B is a 35 year old program that accounts for only a tiny fraction of a percentage of immigration and it hasn't gotten any worse under Trump, who doesn't have the authority to end it even if he wanted to because it's the law, enacted by Congress. If anything he has taken steps to curb the abuse (e.g.  adding a $100k fee). permalink parent award report block reply view 1 more comments... Brandon1776 1 points 6 hours ago You must be a jew talking like that permalink parent award report block reply deleted 1 points 6 hours ago view 10 more comments... Schweddynadzbackup 1 points 44 minutes ago You must not live in it permalink parent award report block reply\nMarshallB 9 points 7 hours ago Many times the seed of the downfall of a society is something most \"couldn't care less about.\" permalink parent award report block reply patrioticwinning3 6 points 7 hours ago If you believe no one cares about H1Bs, I've got a bridge to sell you XD permalink parent award report block reply berserkerbarrage -9 points 7 hours ago That's nice, but H-1B is a 35 year old program that accounts for only a tiny fraction of a percentage of immigration and it hasn't gotten any worse under Trump, who doesn't have the authority to end it even if he wanted to because it's the law, enacted by Congress. If anything he has taken steps to curb the abuse (e.g.  adding a $100k fee). permalink parent award report block reply view 1 more comments...\npatrioticwinning3 6 points 7 hours ago If you believe no one cares about H1Bs, I've got a bridge to sell you XD permalink parent award report block reply\nberserkerbarrage -9 points 7 hours ago That's nice, but H-1B is a 35 year old program that accounts for only a tiny fraction of a percentage of immigration and it hasn't gotten any worse under Trump, who doesn't have the authority to end it even if he wanted to because it's the law, enacted by Congress. If anything he has taken steps to curb the abuse (e.g.  adding a $100k fee). permalink parent award report block reply view 1 more comments...\nBrandon1776 1 points 6 hours ago You must be a jew talking like that permalink parent award report block reply deleted 1 points 6 hours ago view 10 more comments...\ndeleted 1 points 6 hours ago view 10 more comments...\nSchweddynadzbackup 1 points 44 minutes ago You must not live in it permalink parent award report block reply\nberserkerbarrage -15 points 7 hours ago You shills aren't very subtle. And you've not managed to gaslight anybody but yourselves. permalink parent award report block reply patrioticwinning3 7 points 7 hours ago Bro, stop talking to yourself, its weird :p permalink parent award report block reply\npatrioticwinning3 7 points 7 hours ago Bro, stop talking to yourself, its weird :p permalink parent award report block reply\nmoxieprox 6 points 6 hours ago ❄🎵❄ \"It's beginning to look a lot like.....Reddit\" ❄🎵❄ permalink award report block reply\nBrandon1776 6 points 6 hours ago Trump turned his back on us. We are NOT a cult. America FIRST, America ONLY or gtfo permalink award report block reply HeavyMetalPatriot 8 points 6 hours ago THIS!!! The Trump cultists and GOP sheep don't understand AMERICA FIRST actually means we demand AMERICA FIRST actions from anyone waving the MAGA banner. We don't need MAGA talk. We need MAGA actions. permalink parent award report block reply\nHeavyMetalPatriot 8 points 6 hours ago THIS!!! The Trump cultists and GOP sheep don't understand AMERICA FIRST actually means we demand AMERICA FIRST actions from anyone waving the MAGA banner. We don't need MAGA talk. We need MAGA actions. permalink parent award report block reply\nGuerillaYourDreams 5 points 6 hours ago I have nuked four of them, so far, I believe. permalink award report block reply Brandon1776 -2 points 6 hours ago This is a comment from a women permalink parent award report block reply\nBrandon1776 -2 points 6 hours ago This is a comment from a women permalink parent award report block reply\nMasterChief 3 points 3 hours ago Learn to read faggot Be here for MAGA and Trump\nWe’re a community for those who want to Make America Great Again . If your purpose here is to push other unrelated or tangential agendas, you’re not welcome. permalink award report block reply\nMatehmateh 3 points 6 hours ago For a brief moment I thought I was using twitter when browsing here permalink award report block reply\nOrangeManNotBad 3 points 7 hours ago Mods have always been compromised. permalink award report block reply UCantStumpTheTrump OP -4 points 7 hours ago bingo and i see you've already been downvoted lmfao permalink parent award report block reply MarshallB 1 points 7 hours ago You're not over the TARGET until you receive a downvote bot or two or three. permalink parent award report block reply UCantStumpTheTrump OP 0 points 6 hours ago i see you've been targeted as well permalink parent award report block reply MarshallB 2 points 3 hours ago Only 5. permalink parent award report block reply eclectic22 -4 points 7 hours ago You are responding to a troll. Follow your own rules and be careful. permalink parent award report block reply\nUCantStumpTheTrump OP -4 points 7 hours ago bingo and i see you've already been downvoted lmfao permalink parent award report block reply MarshallB 1 points 7 hours ago You're not over the TARGET until you receive a downvote bot or two or three. permalink parent award report block reply UCantStumpTheTrump OP 0 points 6 hours ago i see you've been targeted as well permalink parent award report block reply MarshallB 2 points 3 hours ago Only 5. permalink parent award report block reply eclectic22 -4 points 7 hours ago You are responding to a troll. Follow your own rules and be careful. permalink parent award report block reply\nMarshallB 1 points 7 hours ago You're not over the TARGET until you receive a downvote bot or two or three. permalink parent award report block reply UCantStumpTheTrump OP 0 points 6 hours ago i see you've been targeted as well permalink parent award report block reply MarshallB 2 points 3 hours ago Only 5. permalink parent award report block reply\nUCantStumpTheTrump OP 0 points 6 hours ago i see you've been targeted as well permalink parent award report block reply MarshallB 2 points 3 hours ago Only 5. permalink parent award report block reply\nMarshallB 2 points 3 hours ago Only 5. permalink parent award report block reply\neclectic22 -4 points 7 hours ago You are responding to a troll. Follow your own rules and be careful. permalink parent award report block reply\nbananafone 2 points 7 hours ago This comes in cycles. They'll move on. permalink award report block reply UCantStumpTheTrump OP 1 points 6 hours ago yep time and time again The_Donald from its inception has seen massive waves of shills, I remember famously from Hillary's \"Correct The Record\" in 2016 https://en.wikipedia.org/wiki/Correct_the_Record permalink parent award report block reply\nUCantStumpTheTrump OP 1 points 6 hours ago yep time and time again The_Donald from its inception has seen massive waves of shills, I remember famously from Hillary's \"Correct The Record\" in 2016 https://en.wikipedia.org/wiki/Correct_the_Record permalink parent award report block reply\nBannedAccount 2 points 2 hours ago Rule 1 be here for MAGA and Trump...ok but what if Trump goes one way and MAGA goes another? What then? The problem here is that the movement and the man are 2 separate entities whereas Trump has inflated his own ego to the point he believes he IS the movement and by doing so has largely abandoned the movement thinking that no matter what he does its MAGA because of the heavy cult like following he has that just nod and clap at every shit he takes...theres a massive difference between supporting Trump and enabling Trumps bad decisions. permalink award report block reply\nMarshallB -1 points 7 hours ago Make use of the DEPORT feature. Perhaps it's the ONLY positive use of the term LIBERALLY. permalink award report block reply GuerillaYourDreams 2 points 4 hours ago “Liberally apply water from the sponge to the head of the person who’s about to be executed.” For treason. permalink parent award report block reply\nGuerillaYourDreams 2 points 4 hours ago “Liberally apply water from the sponge to the head of the person who’s about to be executed.” For treason. permalink parent award report block reply\njustinkayz -4 points 6 hours ago Quit your fucking whining, faggot permalink award report block reply UCantStumpTheTrump OP -2 points 6 hours ago eat shit permalink parent award report block reply Brandon1776 1 points 6 hours ago Cult member permalink parent award report block reply\nUCantStumpTheTrump OP -2 points 6 hours ago eat shit permalink parent award report block reply Brandon1776 1 points 6 hours ago Cult member permalink parent award report block reply\nBrandon1776 1 points 6 hours ago Cult member permalink parent award report block reply\nJeetPoopDo 1 points 4 hours ago Comment removed by community filter, pending further review. permalink award report block reply"}