{"id": "1ARK52DLoe", "contents": "246 500,000 votes magically appeared out of thin air for NJ Gov race. posted 6 days ago by DebunkTheLeft 15 comments award share report block Right Angle News Network @Rightanglenews • 6d BREAKING - Conservatives are now pointing to inconsistencies in the New Jersey gubernatorial race after nearly 500,000 new voters appeared from 2021 to 2025, more than double the state’s population growth over four years, with almost all of them going to Democrats.\n15 comments Sort by Top Top New Worst Old Save Elon Walked Away – Now We Know Why Read More Ads by Ad.Style airborne3502 10 points 6 days ago The Department of Justice and the FBI need to look into this. Whatever tactics they have deployed they will repeat in the midterms. permalink award report block reply PatriotSkorzeny 9 points 6 days ago Well they never fixed voting. Let foreigners vote. Faked ballots. Just dilly dallying. permalink award report block reply NotYourMan 8 points 6 days ago And what happens?  Election integrity was one reason I voted for Trump.  After the 2020 election and then the AZ governors race in 2022, I was hoping for investigation and arrests.  Nothing yet! permalink award report block reply Counterwhat 6 points 6 days ago We keep noticing but until some people are in cuffs it will never end. permalink award report block reply drmrboy 5 points 6 days ago Do you think our side will do anything about it?  Lol. Most of them are most likely in on it.  🤓 permalink award report block reply Bullet3250 4 points 6 days ago Elon could DOGE THE VOTE DATA BASE.... find phantom voter accounts that 'voted'.... permalink award report block reply TheGreenDragon 4 points 6 days ago We will see if any republican does anything about it instead of just bitching. I am tired of the do nothing Republicans, it is ground hogs day with them from election to election.  I think they like being losers. permalink award report block reply spinometer2 2 points 6 days ago they are stealing as much as they can, brazenly permalink award report block reply Captainlizard 2 points 6 days ago Out of all the races from Tuesday, this one is the most clearly rigged. No one can explain how she did that well and outperformed every poll, even polls that favor democrats. No one can explain this strange \"turnout\". permalink award report block reply MidwestZoomer 2 points 6 days ago \"this again\" permalink award report block reply Moebius 2 points 6 days ago Registered Illegals permalink award report block reply Snooptwo 2 points 6 days ago Well you didn’t hang anyone after 2020 so of course they did it again. permalink award report block reply Northernbill 1 points 5 days ago Because conquered peoples  Votes don't count permalink award report block reply Losferwords 1 points 6 days ago We already did this one. permalink award report block reply\nairborne3502 10 points 6 days ago The Department of Justice and the FBI need to look into this. Whatever tactics they have deployed they will repeat in the midterms. permalink award report block reply\nPatriotSkorzeny 9 points 6 days ago Well they never fixed voting. Let foreigners vote. Faked ballots. Just dilly dallying. permalink award report block reply\nNotYourMan 8 points 6 days ago And what happens?  Election integrity was one reason I voted for Trump.  After the 2020 election and then the AZ governors race in 2022, I was hoping for investigation and arrests.  Nothing yet! permalink award report block reply\nCounterwhat 6 points 6 days ago We keep noticing but until some people are in cuffs it will never end. permalink award report block reply\ndrmrboy 5 points 6 days ago Do you think our side will do anything about it?  Lol. Most of them are most likely in on it.  🤓 permalink award report block reply\nBullet3250 4 points 6 days ago Elon could DOGE THE VOTE DATA BASE.... find phantom voter accounts that 'voted'.... permalink award report block reply\nTheGreenDragon 4 points 6 days ago We will see if any republican does anything about it instead of just bitching. I am tired of the do nothing Republicans, it is ground hogs day with them from election to election.  I think they like being losers. permalink award report block reply\nspinometer2 2 points 6 days ago they are stealing as much as they can, brazenly permalink award report block reply\nCaptainlizard 2 points 6 days ago Out of all the races from Tuesday, this one is the most clearly rigged. No one can explain how she did that well and outperformed every poll, even polls that favor democrats. No one can explain this strange \"turnout\". permalink award report block reply\nMidwestZoomer 2 points 6 days ago \"this again\" permalink award report block reply\nMoebius 2 points 6 days ago Registered Illegals permalink award report block reply\nSnooptwo 2 points 6 days ago Well you didn’t hang anyone after 2020 so of course they did it again. permalink award report block reply\nNorthernbill 1 points 5 days ago Because conquered peoples  Votes don't count permalink award report block reply\nLosferwords 1 points 6 days ago We already did this one. permalink award report block reply"}