{"id": "1ARK9oYZXs", "contents": "223 AMERICA IS CLOSED. AMERICA        FIRST posted 13 hours ago by FBIAREFAGGOTS 24 comments award share report block Matt Walsh @MattWalshBlog • 1d We do not want or need more people to become citizens Disclose.tv @disclosetv • 1d NOW - DHS Secretary Noem on H-1Bs: \"Under the Trump admin, we've sped up our process and added integrity to the visa programs, to green cards, to all of that, but also more people are becoming naturalized under this admin than ever before. More people are becoming citizens.\"\n24 comments Sort by Top Top New Worst Old Save magapatriot_pa 13 points 13 hours ago If they don't give us our country back, and soon, we're going to end up with an actual Nazi as president sooner rather than later. You want Nick Fuentes to become president in 20 years? Then close the fucking border and KEEP it closed! Trump will look like a moderate, even a squish, compared to whoever comes next if you don't permalink award report block reply Aggrieved03 5 points 12 hours ago He is a 90’s Democrat at best. permalink parent award report block reply patrioticwinning3 3 points 11 hours ago I think he's more of Spineless jellyfish... REFUSES to fire globohomos, refuses to bring justice, refuses to secure our elections, refuses to deport all the illegals, refuses to stop the flood of \"legal\" immigrants stealing our education and our jobs...  Refuses to stand up for anyone but the billionaires and DC elite... permalink parent award report block reply FurtherRight 4 points 12 hours ago Sooner than later.\nI am deep in the blue PNW and I am tired boss. permalink parent award report block reply Chemical 1 points 8 hours ago The problem is the rich use the world as a stage... permalink parent award report block reply Standingoak 1 points 10 hours ago Trump doesn't win the midterms the next will be the last. permalink parent award report block reply itspancakees 1 points 10 hours ago Fuck Nick, I would vote for Hitler. permalink parent award report block reply Chemical 10 points 12 hours ago So apparently everyone on earth is an American but i need a passport now to drive from Edmonton AB to Butte Montana to pay my respects to Evel Knievel, fuck this world.... permalink award report block reply patrioticwinning3 2 points 11 hours ago Everyone on Earth is apparently \"entitled\" to take American positions at Collages, get American jobs, and buy a home in America, ALL WITH AMERICAN TAXPAYER DOLLARS meanwhile us Americans aren't \"entitled\" to anything.... permalink parent award report block reply keeman 2 points 6 hours ago We are an empire of stupidity.  We rule the world by force and an endless stream of money, but gain nothing from it and our citizens have no rights from it.  The solution is to abandon the empire and become a republic again.  Along with draining the swamp, which is a correlated task. permalink parent award report block reply FUSnowflake 9 points 13 hours ago Betraying the citizens in favor of white genocide. permalink award report block reply Wexit-Delecto 9 points 13 hours ago Mass replacement immigration is NON NEGOTIABLE. You cannot vote on this issue. permalink award report block reply patrioticwinning3 3 points 11 hours ago Agreed! permalink parent award report block reply keeman 2 points 5 hours ago Have you noticed that you aren't allowed to vote on ANY issue you actually care about?  Weird.  Carlin said \"if voting mattered, they'd make it illegal\". permalink parent award report block reply Tiberius1 6 points 12 hours ago Noem is a retard and needs fired immediately.  America first. Fuck everyone else. permalink award report block reply keeman 2 points 5 hours ago Always has been. permalink parent award report block reply patrioticwinning3 2 points 11 hours ago Been saying this since she was nominated.  Openly cucks her husband, brags about shooting her dog, allowed \"no jab no job\" policies as governor.  FUCKING  DOG KILLING SLUT CUNT! permalink parent award report block reply GayPatriotMAGAUncle 5 points 11 hours ago Matt Walsh acting like a faggot again. Maybe he can take turns with Dim Fool by sitting on the fence and riding it and using it as a dildo for his faggotry. permalink award report block reply Retardloserimsogay 5 points 12 hours ago \"More than ever before\" JFC, the exact opposite of what we fucking voted for!!! permalink award report block reply Duke442games 5 points 12 hours ago What the actual FUCK is going on here??? MAGA doesn't mean more H1B's, more Somalis, more people from foreign lands. Thus administration has been overrun. permalink award report block reply GoldenEarz 1 points 12 hours ago Same for every Western country. permalink award report block reply CounterStrike 1 points 12 hours ago They will make sure to ask \"are you a terrorist?\". permalink award report block reply arkylady 1 points 12 hours ago wtf permalink award report block reply keeman 1 points 6 hours ago I'm officially getting tired of \"winning\".  All things being equal, I am in favor of immigrants who want to come here to be Americans.  But all things are not equal and the immigrants coming here have no such intention.  Shut everything down until we can figure out how to fix it.  For instance, a good immigrant is one who breaks down in tears of joy while reading the Declaration of Independence.  A bad immigrant is one who wants to know how much his gimmes are.  I know people in both categories, but mostly the latter. permalink award report block reply\nmagapatriot_pa 13 points 13 hours ago If they don't give us our country back, and soon, we're going to end up with an actual Nazi as president sooner rather than later. You want Nick Fuentes to become president in 20 years? Then close the fucking border and KEEP it closed! Trump will look like a moderate, even a squish, compared to whoever comes next if you don't permalink award report block reply Aggrieved03 5 points 12 hours ago He is a 90’s Democrat at best. permalink parent award report block reply patrioticwinning3 3 points 11 hours ago I think he's more of Spineless jellyfish... REFUSES to fire globohomos, refuses to bring justice, refuses to secure our elections, refuses to deport all the illegals, refuses to stop the flood of \"legal\" immigrants stealing our education and our jobs...  Refuses to stand up for anyone but the billionaires and DC elite... permalink parent award report block reply FurtherRight 4 points 12 hours ago Sooner than later.\nI am deep in the blue PNW and I am tired boss. permalink parent award report block reply Chemical 1 points 8 hours ago The problem is the rich use the world as a stage... permalink parent award report block reply Standingoak 1 points 10 hours ago Trump doesn't win the midterms the next will be the last. permalink parent award report block reply itspancakees 1 points 10 hours ago Fuck Nick, I would vote for Hitler. permalink parent award report block reply\nAggrieved03 5 points 12 hours ago He is a 90’s Democrat at best. permalink parent award report block reply patrioticwinning3 3 points 11 hours ago I think he's more of Spineless jellyfish... REFUSES to fire globohomos, refuses to bring justice, refuses to secure our elections, refuses to deport all the illegals, refuses to stop the flood of \"legal\" immigrants stealing our education and our jobs...  Refuses to stand up for anyone but the billionaires and DC elite... permalink parent award report block reply\npatrioticwinning3 3 points 11 hours ago I think he's more of Spineless jellyfish... REFUSES to fire globohomos, refuses to bring justice, refuses to secure our elections, refuses to deport all the illegals, refuses to stop the flood of \"legal\" immigrants stealing our education and our jobs...  Refuses to stand up for anyone but the billionaires and DC elite... permalink parent award report block reply\nFurtherRight 4 points 12 hours ago Sooner than later.\nI am deep in the blue PNW and I am tired boss. permalink parent award report block reply\nChemical 1 points 8 hours ago The problem is the rich use the world as a stage... permalink parent award report block reply\nStandingoak 1 points 10 hours ago Trump doesn't win the midterms the next will be the last. permalink parent award report block reply\nitspancakees 1 points 10 hours ago Fuck Nick, I would vote for Hitler. permalink parent award report block reply\nChemical 10 points 12 hours ago So apparently everyone on earth is an American but i need a passport now to drive from Edmonton AB to Butte Montana to pay my respects to Evel Knievel, fuck this world.... permalink award report block reply patrioticwinning3 2 points 11 hours ago Everyone on Earth is apparently \"entitled\" to take American positions at Collages, get American jobs, and buy a home in America, ALL WITH AMERICAN TAXPAYER DOLLARS meanwhile us Americans aren't \"entitled\" to anything.... permalink parent award report block reply keeman 2 points 6 hours ago We are an empire of stupidity.  We rule the world by force and an endless stream of money, but gain nothing from it and our citizens have no rights from it.  The solution is to abandon the empire and become a republic again.  Along with draining the swamp, which is a correlated task. permalink parent award report block reply\npatrioticwinning3 2 points 11 hours ago Everyone on Earth is apparently \"entitled\" to take American positions at Collages, get American jobs, and buy a home in America, ALL WITH AMERICAN TAXPAYER DOLLARS meanwhile us Americans aren't \"entitled\" to anything.... permalink parent award report block reply\nkeeman 2 points 6 hours ago We are an empire of stupidity.  We rule the world by force and an endless stream of money, but gain nothing from it and our citizens have no rights from it.  The solution is to abandon the empire and become a republic again.  Along with draining the swamp, which is a correlated task. permalink parent award report block reply\nFUSnowflake 9 points 13 hours ago Betraying the citizens in favor of white genocide. permalink award report block reply\nWexit-Delecto 9 points 13 hours ago Mass replacement immigration is NON NEGOTIABLE. You cannot vote on this issue. permalink award report block reply patrioticwinning3 3 points 11 hours ago Agreed! permalink parent award report block reply keeman 2 points 5 hours ago Have you noticed that you aren't allowed to vote on ANY issue you actually care about?  Weird.  Carlin said \"if voting mattered, they'd make it illegal\". permalink parent award report block reply\npatrioticwinning3 3 points 11 hours ago Agreed! permalink parent award report block reply\nkeeman 2 points 5 hours ago Have you noticed that you aren't allowed to vote on ANY issue you actually care about?  Weird.  Carlin said \"if voting mattered, they'd make it illegal\". permalink parent award report block reply\nTiberius1 6 points 12 hours ago Noem is a retard and needs fired immediately.  America first. Fuck everyone else. permalink award report block reply keeman 2 points 5 hours ago Always has been. permalink parent award report block reply patrioticwinning3 2 points 11 hours ago Been saying this since she was nominated.  Openly cucks her husband, brags about shooting her dog, allowed \"no jab no job\" policies as governor.  FUCKING  DOG KILLING SLUT CUNT! permalink parent award report block reply\nkeeman 2 points 5 hours ago Always has been. permalink parent award report block reply\npatrioticwinning3 2 points 11 hours ago Been saying this since she was nominated.  Openly cucks her husband, brags about shooting her dog, allowed \"no jab no job\" policies as governor.  FUCKING  DOG KILLING SLUT CUNT! permalink parent award report block reply\nGayPatriotMAGAUncle 5 points 11 hours ago Matt Walsh acting like a faggot again. Maybe he can take turns with Dim Fool by sitting on the fence and riding it and using it as a dildo for his faggotry. permalink award report block reply\nRetardloserimsogay 5 points 12 hours ago \"More than ever before\" JFC, the exact opposite of what we fucking voted for!!! permalink award report block reply\nDuke442games 5 points 12 hours ago What the actual FUCK is going on here??? MAGA doesn't mean more H1B's, more Somalis, more people from foreign lands. Thus administration has been overrun. permalink award report block reply\nGoldenEarz 1 points 12 hours ago Same for every Western country. permalink award report block reply\nCounterStrike 1 points 12 hours ago They will make sure to ask \"are you a terrorist?\". permalink award report block reply\narkylady 1 points 12 hours ago wtf permalink award report block reply\nkeeman 1 points 6 hours ago I'm officially getting tired of \"winning\".  All things being equal, I am in favor of immigrants who want to come here to be Americans.  But all things are not equal and the immigrants coming here have no such intention.  Shut everything down until we can figure out how to fix it.  For instance, a good immigrant is one who breaks down in tears of joy while reading the Declaration of Independence.  A bad immigrant is one who wants to know how much his gimmes are.  I know people in both categories, but mostly the latter. permalink award report block reply"}