{"id": "1ARK9pf37p", "contents": "48 If China having AI is a potential mortal threat to the U.S., why don't we just stop selling them and in many cases giving them the means by which to develop that AI? That would seem extremely commonsensical. posted 10 hours ago by flp999 9 comments award share download report block\n9 comments Sort by Top Top New Worst Old Save Nomad899 2 points 10 hours ago Just stop being a bigoted tax slave permalink award report block reply flp999 OP 1 points 10 hours ago We plebes like to cause the problems for our self-appointed, illegitimate rulers that steal our liberty. We like the core American Spirit very much. permalink parent award report block reply BlokeyMcBlokeFace 2 points 9 hours ago But if 600 gorillion chinese students aren't allowed to study at US universities then the higher education industry will be very sad. permalink award report block reply congruent 1 points 8 hours ago The answer to your question is that our govt is owned by China who has been working since the end of WWII to soft-infiltrate our politics, economy, academics, and social contract, all with the intent to conquer us, or soft-conquer us. So, yeah, people in Washington are paid to HELP China. That's why. permalink award report block reply flp999 OP 1 points 4 hours ago I’m more inclined to think that it’s US that owns China. At a minimum we allowed Mao to come to power. And former head of the CIA, George HW Bush, is single-handedly responsible for turning them into an economic powerhouse. https://www.chinafile.com/conversation/did-president-george-hw-bush-mishandle-china permalink parent award report block reply flp999 OP 1 points 10 hours ago They're running the exact same scam on us as they did during the Cold War. Here's how it works. \"Country X is doing Y. We're also doing Y. If we don't take Y a million times further a million times faster than Country X, WE ARE ALL GOING TO LITERALLY DIE.\" Meanwhile, we are singlehandedly enabling Country X to do Y. If we just stopped doing that, the threat would completely disappear. But then we wouldn't be able to get the end result of taking Y a million times further a million times faster than we otherwise would have, because the citizenry actually doesn't care about or want Y, let alone want to make all these sacrifices for this thing that isn't even going to provide any benefit to them. So the government uses lies and deception and subterfuge and TREASON to actually create a real threat to the citizenry, so the government (and the business interests they serve) can get the thing they want. See also: creating bioweapons in Chinese labs. permalink award report block reply tralbolh 1 points 10 hours ago Because we already gave them the chip manufacturing tech. permalink award report block reply Nomad899 1 points 8 hours ago And missile launch technology permalink parent award report block reply grenades_and_ham 1 points 4 hours ago NVDIA’s chicom ceo has plenty of chips to go around! permalink award report block reply\nNomad899 2 points 10 hours ago Just stop being a bigoted tax slave permalink award report block reply flp999 OP 1 points 10 hours ago We plebes like to cause the problems for our self-appointed, illegitimate rulers that steal our liberty. We like the core American Spirit very much. permalink parent award report block reply\nflp999 OP 1 points 10 hours ago We plebes like to cause the problems for our self-appointed, illegitimate rulers that steal our liberty. We like the core American Spirit very much. permalink parent award report block reply\nBlokeyMcBlokeFace 2 points 9 hours ago But if 600 gorillion chinese students aren't allowed to study at US universities then the higher education industry will be very sad. permalink award report block reply\ncongruent 1 points 8 hours ago The answer to your question is that our govt is owned by China who has been working since the end of WWII to soft-infiltrate our politics, economy, academics, and social contract, all with the intent to conquer us, or soft-conquer us. So, yeah, people in Washington are paid to HELP China. That's why. permalink award report block reply flp999 OP 1 points 4 hours ago I’m more inclined to think that it’s US that owns China. At a minimum we allowed Mao to come to power. And former head of the CIA, George HW Bush, is single-handedly responsible for turning them into an economic powerhouse. https://www.chinafile.com/conversation/did-president-george-hw-bush-mishandle-china permalink parent award report block reply\nflp999 OP 1 points 4 hours ago I’m more inclined to think that it’s US that owns China. At a minimum we allowed Mao to come to power. And former head of the CIA, George HW Bush, is single-handedly responsible for turning them into an economic powerhouse. https://www.chinafile.com/conversation/did-president-george-hw-bush-mishandle-china permalink parent award report block reply\nflp999 OP 1 points 10 hours ago They're running the exact same scam on us as they did during the Cold War. Here's how it works. \"Country X is doing Y. We're also doing Y. If we don't take Y a million times further a million times faster than Country X, WE ARE ALL GOING TO LITERALLY DIE.\" Meanwhile, we are singlehandedly enabling Country X to do Y. If we just stopped doing that, the threat would completely disappear. But then we wouldn't be able to get the end result of taking Y a million times further a million times faster than we otherwise would have, because the citizenry actually doesn't care about or want Y, let alone want to make all these sacrifices for this thing that isn't even going to provide any benefit to them. So the government uses lies and deception and subterfuge and TREASON to actually create a real threat to the citizenry, so the government (and the business interests they serve) can get the thing they want. See also: creating bioweapons in Chinese labs. permalink award report block reply\ntralbolh 1 points 10 hours ago Because we already gave them the chip manufacturing tech. permalink award report block reply Nomad899 1 points 8 hours ago And missile launch technology permalink parent award report block reply\nNomad899 1 points 8 hours ago And missile launch technology permalink parent award report block reply\ngrenades_and_ham 1 points 4 hours ago NVDIA’s chicom ceo has plenty of chips to go around! permalink award report block reply"}