{"id": "1ARK9mFaa0", "contents": "171 Fetterman says No one really knows who is running the Democrat Party. posted 22 hours ago by CatalystForChange 13 comments award share report block Eric Daugherty @EricLDaugh • 23h 🚨 WOW! Democrats in D.C. are livid at Sen. John Fetterman (D)'s response to \"who is RUNNING the Democrat Party?\" \"Uh, I, no one really knows.\" 💀 BRUTAL for Chuck Schumer and Hakeem Jeffries. \"And I think my values are reflected in my vote and the things I support. That\n13 comments Sort by Top Top New Worst Old Save CatalystForChange OP 7 points 22 hours ago Perhaps Satan Himself? Remember. The greatest trick the Devil ever pulled was convincing the world he didn’t exist. permalink award report block reply Mintap 3 points 21 hours ago Came here to say this permalink parent award report block reply mikethemarine 1 points 18 hours ago WHO is running the SHOW now? SHOULDN'T IT BE THEIR CONSTITUENTS? permalink parent award report block reply TrumpOrTreason 4 points 21 hours ago Should we nominate Fetterman? permalink award report block reply Deplora 1 points 21 hours ago No, we should adopt him. permalink parent award report block reply Mintap 2 points 21 hours ago ...convert him. permalink parent award report block reply Deplora 4 points 21 hours ago If I was running that shitshow, I sure wouldn't want anybody to know it was me. permalink award report block reply For_All_Mankind 3 points 21 hours ago Jews are running both parties permalink award report block reply Im_RickSteves_bitch 3 points 21 hours ago Everyone knows, even Fetterman! The intel agencies, same as who runs the Republicans. permalink award report block reply crashdaddy 3 points 22 hours ago Tell him to ask his AIPAC guy. permalink award report block reply M-m-m-my-corona 2 points 21 hours ago Who is running the President now?  Supports H1Bs.  Supports 600,000 Chinese F1 students.  Supports amnesty for hotel/ag illegals.  Supports war in Ukraine.  Refuses to release the Epstein list.  Goes to war for israel.  Fucking A.  This is despicable. permalink award report block reply OK_Parmaker 2 points 20 hours ago It’s demoralizing. permalink parent award report block reply Tcrlaf1 2 points 21 hours ago Alex Soros… DUH! permalink award report block reply\nCatalystForChange OP 7 points 22 hours ago Perhaps Satan Himself? Remember. The greatest trick the Devil ever pulled was convincing the world he didn’t exist. permalink award report block reply Mintap 3 points 21 hours ago Came here to say this permalink parent award report block reply mikethemarine 1 points 18 hours ago WHO is running the SHOW now? SHOULDN'T IT BE THEIR CONSTITUENTS? permalink parent award report block reply\nMintap 3 points 21 hours ago Came here to say this permalink parent award report block reply\nmikethemarine 1 points 18 hours ago WHO is running the SHOW now? SHOULDN'T IT BE THEIR CONSTITUENTS? permalink parent award report block reply\nTrumpOrTreason 4 points 21 hours ago Should we nominate Fetterman? permalink award report block reply Deplora 1 points 21 hours ago No, we should adopt him. permalink parent award report block reply Mintap 2 points 21 hours ago ...convert him. permalink parent award report block reply\nDeplora 1 points 21 hours ago No, we should adopt him. permalink parent award report block reply Mintap 2 points 21 hours ago ...convert him. permalink parent award report block reply\nMintap 2 points 21 hours ago ...convert him. permalink parent award report block reply\nDeplora 4 points 21 hours ago If I was running that shitshow, I sure wouldn't want anybody to know it was me. permalink award report block reply\nFor_All_Mankind 3 points 21 hours ago Jews are running both parties permalink award report block reply\nIm_RickSteves_bitch 3 points 21 hours ago Everyone knows, even Fetterman! The intel agencies, same as who runs the Republicans. permalink award report block reply\ncrashdaddy 3 points 22 hours ago Tell him to ask his AIPAC guy. permalink award report block reply\nM-m-m-my-corona 2 points 21 hours ago Who is running the President now?  Supports H1Bs.  Supports 600,000 Chinese F1 students.  Supports amnesty for hotel/ag illegals.  Supports war in Ukraine.  Refuses to release the Epstein list.  Goes to war for israel.  Fucking A.  This is despicable. permalink award report block reply OK_Parmaker 2 points 20 hours ago It’s demoralizing. permalink parent award report block reply\nOK_Parmaker 2 points 20 hours ago It’s demoralizing. permalink parent award report block reply\nTcrlaf1 2 points 21 hours ago Alex Soros… DUH! permalink award report block reply"}