{"id": "1ARK9mHVr8", "contents": "317 Churches, rise up! You are the bedrock of this country. posted 12 hours ago by StopCorruptionDC 17 comments award share report block Erika Kirk @MrsErikaKirk • 2d Churches, rise up! You are the bedrock of this country.\n17 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno SuperDuperBasedMD 14 points 12 hours ago Charlie is right of course. The difference, which he doesn't appreciate because he is young, is that all of that worked best in a stable high trust society. The off shoring, the financialization/looting, the normalization of physical, mental and moral poisons (drugs, porn, DEI) have all undermined the foundations of a society that could care for itself through churches. I'm not saying it can't be done or shouldn't be done. It's that it's a big problem and will require additional structural changes in the economy/society. permalink award report block reply 19American62Woman 10 points 12 hours ago My daughter and I used to visit different churches. Not one of them ever made us feel welcome. Still would love to find the right fit though permalink award report block reply Atruckdriver 1 points 9 hours ago What were you looking for and did you attempt any conversation or walk in, sit, and then leave right after service? permalink parent award report block reply MusicToMyEars 8 points 11 hours ago I am Catholic. Sermons are speeches in support of socialism and immigration. They will turn your stomach. The church I grew up in now is Spanish speaking. Only one mass is English, 5 pm on Saturday. The local ecumenical church in my neighborhood supports BLM, trans rights, and public housing zoning changes. When saying “go back to church”, spend some time finding the right one. If you live in a derogatory blue state (I live in Connecticut), you might have to drive a bit. permalink award report block reply someguy7738 1 points 5 hours ago Honestly I live in a deep red state and the situation isn't really any better here. Granted I live in an urban area, but every single church in my area is completely subverted by woke faggotry. permalink parent award report block reply sir_rockness 5 points 10 hours ago Many Churches are more focused on having an epic worship service than they are being the Church.  That's been my experience in charismatic ones. permalink award report block reply DontBeAFaggot 5 points 9 hours ago I'm a simple man. I see Charlie Kirk and I upvote. permalink award report block reply TheGreenDragon 4 points 12 hours ago before and during the revolutionary war the preachers were thought of as the black robe regiment. http://www.blackrobereg.org/ permalink award report block reply Moebius 2 points 11 hours ago That was before 501(c)(3) Tax Exemption... permalink parent award report block reply SpeekFreely 1 points 11 hours ago Found a documentary https://youtu.be/6emOK4lPQqY permalink parent award report block reply Givesgunstogrannies 3 points 9 hours ago My church wasted money flying the leadership to India once a month to proselytize to the Hindus. Disgusting. We'd give more and feel better about it if it went towards helping the poor here.  Instead we have found another church. permalink award report block reply SpeekFreely 2 points 11 hours ago Which church, and which faction ? This would be helpful to know. permalink award report block reply Greenhills 2 points 9 hours ago You think pastors are going to give up their free homes and cars to….feed people? permalink award report block reply Daveyclimber 2 points 9 hours ago My Church does. My pastor puts his money where his mouth is. We probably have 50 congregates and in my opinion, smaller is better. permalink parent award report block reply current_horror 1 points 8 hours ago Smaller is better only because you aren’t worth targeting for subversion. That’s not a good thing. It means they don’t think you’re a threat. permalink parent award report block reply glow-operator-2-0 2 points 9 hours ago Until every congregation is like the Rod of Iron Ministries, I'm pressing X to doubt. permalink award report block reply Wrexxis780 1 points 5 hours ago If your church is led by a woman or a faggot it’s not a church permalink award report block reply\nSuperDuperBasedMD 14 points 12 hours ago Charlie is right of course. The difference, which he doesn't appreciate because he is young, is that all of that worked best in a stable high trust society. The off shoring, the financialization/looting, the normalization of physical, mental and moral poisons (drugs, porn, DEI) have all undermined the foundations of a society that could care for itself through churches. I'm not saying it can't be done or shouldn't be done. It's that it's a big problem and will require additional structural changes in the economy/society. permalink award report block reply\n19American62Woman 10 points 12 hours ago My daughter and I used to visit different churches. Not one of them ever made us feel welcome. Still would love to find the right fit though permalink award report block reply Atruckdriver 1 points 9 hours ago What were you looking for and did you attempt any conversation or walk in, sit, and then leave right after service? permalink parent award report block reply\nAtruckdriver 1 points 9 hours ago What were you looking for and did you attempt any conversation or walk in, sit, and then leave right after service? permalink parent award report block reply\nMusicToMyEars 8 points 11 hours ago I am Catholic. Sermons are speeches in support of socialism and immigration. They will turn your stomach. The church I grew up in now is Spanish speaking. Only one mass is English, 5 pm on Saturday. The local ecumenical church in my neighborhood supports BLM, trans rights, and public housing zoning changes. When saying “go back to church”, spend some time finding the right one. If you live in a derogatory blue state (I live in Connecticut), you might have to drive a bit. permalink award report block reply someguy7738 1 points 5 hours ago Honestly I live in a deep red state and the situation isn't really any better here. Granted I live in an urban area, but every single church in my area is completely subverted by woke faggotry. permalink parent award report block reply\nsomeguy7738 1 points 5 hours ago Honestly I live in a deep red state and the situation isn't really any better here. Granted I live in an urban area, but every single church in my area is completely subverted by woke faggotry. permalink parent award report block reply\nsir_rockness 5 points 10 hours ago Many Churches are more focused on having an epic worship service than they are being the Church.  That's been my experience in charismatic ones. permalink award report block reply\nDontBeAFaggot 5 points 9 hours ago I'm a simple man. I see Charlie Kirk and I upvote. permalink award report block reply\nTheGreenDragon 4 points 12 hours ago before and during the revolutionary war the preachers were thought of as the black robe regiment. http://www.blackrobereg.org/ permalink award report block reply Moebius 2 points 11 hours ago That was before 501(c)(3) Tax Exemption... permalink parent award report block reply SpeekFreely 1 points 11 hours ago Found a documentary https://youtu.be/6emOK4lPQqY permalink parent award report block reply\nMoebius 2 points 11 hours ago That was before 501(c)(3) Tax Exemption... permalink parent award report block reply\nSpeekFreely 1 points 11 hours ago Found a documentary https://youtu.be/6emOK4lPQqY permalink parent award report block reply\nGivesgunstogrannies 3 points 9 hours ago My church wasted money flying the leadership to India once a month to proselytize to the Hindus. Disgusting. We'd give more and feel better about it if it went towards helping the poor here.  Instead we have found another church. permalink award report block reply\nSpeekFreely 2 points 11 hours ago Which church, and which faction ? This would be helpful to know. permalink award report block reply\nGreenhills 2 points 9 hours ago You think pastors are going to give up their free homes and cars to….feed people? permalink award report block reply Daveyclimber 2 points 9 hours ago My Church does. My pastor puts his money where his mouth is. We probably have 50 congregates and in my opinion, smaller is better. permalink parent award report block reply current_horror 1 points 8 hours ago Smaller is better only because you aren’t worth targeting for subversion. That’s not a good thing. It means they don’t think you’re a threat. permalink parent award report block reply\nDaveyclimber 2 points 9 hours ago My Church does. My pastor puts his money where his mouth is. We probably have 50 congregates and in my opinion, smaller is better. permalink parent award report block reply current_horror 1 points 8 hours ago Smaller is better only because you aren’t worth targeting for subversion. That’s not a good thing. It means they don’t think you’re a threat. permalink parent award report block reply\ncurrent_horror 1 points 8 hours ago Smaller is better only because you aren’t worth targeting for subversion. That’s not a good thing. It means they don’t think you’re a threat. permalink parent award report block reply\nglow-operator-2-0 2 points 9 hours ago Until every congregation is like the Rod of Iron Ministries, I'm pressing X to doubt. permalink award report block reply\nWrexxis780 1 points 5 hours ago If your church is led by a woman or a faggot it’s not a church permalink award report block reply"}