{"id": "1ARK9mHmyL", "contents": "412 Evil posted 9 hours ago by O__Q 16 comments award share report block Donald Trump Jr. @DonaldJTrumpJr • 9h Evil Savanah Hernandez @Savsays • 1d Here’s a CBS reporter standing ACROSS the street from the mob calling to kill TPUSA attendees, saying that last night’s events were “mostly peaceful” Conservatives getting punched in the face, smoke bombs being lit & violence is “peaceful” per the media\n16 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style spez_this 14 points 8 hours ago Nose ring girl: \"Nobody agrees with what they are saying.\" While standing in front of the sold-out event. permalink award report block reply Roadpower 7 points 7 hours ago Precious isn't it. permalink parent award report block reply PatriotSkorzeny 7 points 8 hours ago What’s with importing foreign labor????? 🔔🔔🔔 permalink award report block reply ChyNahAzzWhole1 6 points 8 hours ago We dont hate the media enough. Nose ring ADMITTED to not knowing CK but they let her call him vile and disgusting. permalink award report block reply Meatsuit 2 points 7 hours ago \"Marred by violence\" permalink parent award report block reply ElevenMile 6 points 7 hours ago Mob calls for death of Christians; media pretends they're peaceful Federal agents arrest illegal aliens; media calls it \"violent kidnapping\" permalink award report block reply God-is-good 2 points 6 hours ago Satanic semantics. They speak the same language yet continue to babble while meaning something very different than the words actually said. permalink parent award report block reply Roadpower 4 points 8 hours ago Creating the hate one nose ring at a time. permalink award report block reply spez_this 3 points 8 hours ago When I see them I am tempted to clip a dog leash to the nose ring and drag them away - just like I'm sure their girlfriends do. permalink parent award report block reply Bullet3250 3 points 7 hours ago \"Let's go Brandon\" permalink award report block reply TD_Covfefe_Crusader 1 points 3 hours ago Same shit that the misleadia has been doing for decades now. They will lie right to your face when the truth is right there in plain view for all to see, and their useful idiots will believe the lie. permalink award report block reply Slipcue 1 points 6 hours ago Can we just hire some Hell's Angels to go in there and do what the Hell's Angels are capable of doing? I mean, if that happens a handful of times, this nonsense becomes non-existent. permalink award report block reply BillyBobJimmyJoe -1 points 5 hours ago I wonder if Trump killed Charlie Kirk. permalink award report block reply O__Q OP 4 points 5 hours ago I wonder if some things that people “wonder” are absolutely insane. permalink parent award report block reply MAPatriot1966 1 points 7 hours ago Comment removed by community filter, pending further review. permalink award report block reply\nspez_this 14 points 8 hours ago Nose ring girl: \"Nobody agrees with what they are saying.\" While standing in front of the sold-out event. permalink award report block reply Roadpower 7 points 7 hours ago Precious isn't it. permalink parent award report block reply\nRoadpower 7 points 7 hours ago Precious isn't it. permalink parent award report block reply\nPatriotSkorzeny 7 points 8 hours ago What’s with importing foreign labor????? 🔔🔔🔔 permalink award report block reply\nChyNahAzzWhole1 6 points 8 hours ago We dont hate the media enough. Nose ring ADMITTED to not knowing CK but they let her call him vile and disgusting. permalink award report block reply Meatsuit 2 points 7 hours ago \"Marred by violence\" permalink parent award report block reply\nMeatsuit 2 points 7 hours ago \"Marred by violence\" permalink parent award report block reply\nElevenMile 6 points 7 hours ago Mob calls for death of Christians; media pretends they're peaceful Federal agents arrest illegal aliens; media calls it \"violent kidnapping\" permalink award report block reply God-is-good 2 points 6 hours ago Satanic semantics. They speak the same language yet continue to babble while meaning something very different than the words actually said. permalink parent award report block reply\nGod-is-good 2 points 6 hours ago Satanic semantics. They speak the same language yet continue to babble while meaning something very different than the words actually said. permalink parent award report block reply\nRoadpower 4 points 8 hours ago Creating the hate one nose ring at a time. permalink award report block reply spez_this 3 points 8 hours ago When I see them I am tempted to clip a dog leash to the nose ring and drag them away - just like I'm sure their girlfriends do. permalink parent award report block reply\nspez_this 3 points 8 hours ago When I see them I am tempted to clip a dog leash to the nose ring and drag them away - just like I'm sure their girlfriends do. permalink parent award report block reply\nBullet3250 3 points 7 hours ago \"Let's go Brandon\" permalink award report block reply\nTD_Covfefe_Crusader 1 points 3 hours ago Same shit that the misleadia has been doing for decades now. They will lie right to your face when the truth is right there in plain view for all to see, and their useful idiots will believe the lie. permalink award report block reply\nSlipcue 1 points 6 hours ago Can we just hire some Hell's Angels to go in there and do what the Hell's Angels are capable of doing? I mean, if that happens a handful of times, this nonsense becomes non-existent. permalink award report block reply\nBillyBobJimmyJoe -1 points 5 hours ago I wonder if Trump killed Charlie Kirk. permalink award report block reply O__Q OP 4 points 5 hours ago I wonder if some things that people “wonder” are absolutely insane. permalink parent award report block reply\nO__Q OP 4 points 5 hours ago I wonder if some things that people “wonder” are absolutely insane. permalink parent award report block reply\nMAPatriot1966 1 points 7 hours ago Comment removed by community filter, pending further review. permalink award report block reply"}