{"id": "1ARK9oXTwy", "contents": "340 BREAKING: Rep. Chip Roy announces the \"Pause Act\", a bill that freezes all immigration until H1-B is ended, chain migration is reformed, and birthright citizenship is dealt with: \n\n\"The H1-B system is broken. I've got a bill I'm introducing this week or next that is a freeze on all immigration posted 15 hours ago by PiratePatriotParrot 19 comments award share report block Benny Johnson @bennyjohnson • 19h BREAKING: Rep. Chip Roy announces the \"Pause Act\", a bill that freezes all immigration until H1-B is ended, chain migration is reformed, and birthright citizenship is dealt with: \"The H1-B system is broken. I've got a bill I'm introducing this week or next that is a freeze on\n19 comments Sort by Top Top New Worst Old Save OlivaireBandaloo 20 points 15 hours ago How many nice bills have been offered up? How many went anywhere? permalink award report block reply LordCommissarYarrick 11 points 15 hours ago None because the GOP is all in on sucking Indian dick. permalink parent award report block reply Kamalas_Cankles 5 points 13 hours ago And jew dick, and muslim dick, and Ukrainian dick, and 'girl' dick. permalink parent award report block reply Reefay 2 points 8 hours ago girl dick It's a Shenis thank you very much permalink parent award report block reply JeetPoopDo 1 points 5 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply mykillk 1 points 7 hours ago *Chamber of Commerce dick permalink parent award report block reply keeman 1 points 7 hours ago So we should stop offering them up?  Blame the RINOs, not the bill's author. permalink parent award report block reply AwShitHereWeGoAgain 9 points 13 hours ago Virtue signaling.  This will go nowhere. permalink award report block reply keeman 3 points 7 hours ago And if nobody pushes it then it guarantees it will go nowhere. permalink parent award report block reply Mungo 7 points 13 hours ago Chip is a douchebag.   But he is right on this. permalink award report block reply patrioticwinning3 4 points 13 hours ago I doubt it will pass but it sounds like a good idea. permalink award report block reply Aisle-is-closed 4 points 13 hours ago Without adequate blackmail or payoffs it has no chance. permalink award report block reply The_RedWolf 3 points 11 hours ago And itll die in committee Wake me up when it actually goes somewhere permalink award report block reply keeman 1 points 7 hours ago Perhaps if We the People let our Congresscritters know we require this or we primary them?  I am pretty doomer, but this is something we can actually influence. permalink parent award report block reply Senaleb 2 points 12 hours ago This is stupid to even waste his time writing nevermind introduce. The GOP wants h1-bs because cheap labor is great for the profit margin and the dems want illegals and legals to give free shit to for votes. I'll never forget when Chump did a Uturn on deportations a few months ago and stopped deporting illegal farm workers. permalink award report block reply sleepinggiant 1 points 7 hours ago Whats the chances it passes....\"i tried..\" no longer flies. permalink award report block reply Briben 1 points 7 minutes ago They already have the 100k fee for new.  Now end all old.  This performative nonsense is infuriating permalink award report block reply AlmostFullyDilated 1 points 7 hours ago Benny Johnson is nothing but a gay reposter permalink award report block reply ShitFromShinola 0 points 12 hours ago More political theater from Chip Soy. This is going nowhere and this limp-wristed, dicksucker knows it. permalink award report block reply\nOlivaireBandaloo 20 points 15 hours ago How many nice bills have been offered up? How many went anywhere? permalink award report block reply LordCommissarYarrick 11 points 15 hours ago None because the GOP is all in on sucking Indian dick. permalink parent award report block reply Kamalas_Cankles 5 points 13 hours ago And jew dick, and muslim dick, and Ukrainian dick, and 'girl' dick. permalink parent award report block reply Reefay 2 points 8 hours ago girl dick It's a Shenis thank you very much permalink parent award report block reply JeetPoopDo 1 points 5 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply mykillk 1 points 7 hours ago *Chamber of Commerce dick permalink parent award report block reply keeman 1 points 7 hours ago So we should stop offering them up?  Blame the RINOs, not the bill's author. permalink parent award report block reply\nLordCommissarYarrick 11 points 15 hours ago None because the GOP is all in on sucking Indian dick. permalink parent award report block reply Kamalas_Cankles 5 points 13 hours ago And jew dick, and muslim dick, and Ukrainian dick, and 'girl' dick. permalink parent award report block reply Reefay 2 points 8 hours ago girl dick It's a Shenis thank you very much permalink parent award report block reply JeetPoopDo 1 points 5 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply mykillk 1 points 7 hours ago *Chamber of Commerce dick permalink parent award report block reply\nKamalas_Cankles 5 points 13 hours ago And jew dick, and muslim dick, and Ukrainian dick, and 'girl' dick. permalink parent award report block reply Reefay 2 points 8 hours ago girl dick It's a Shenis thank you very much permalink parent award report block reply JeetPoopDo 1 points 5 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply\nReefay 2 points 8 hours ago girl dick It's a Shenis thank you very much permalink parent award report block reply JeetPoopDo 1 points 5 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply\nJeetPoopDo 1 points 5 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply\nmykillk 1 points 7 hours ago *Chamber of Commerce dick permalink parent award report block reply\nkeeman 1 points 7 hours ago So we should stop offering them up?  Blame the RINOs, not the bill's author. permalink parent award report block reply\nAwShitHereWeGoAgain 9 points 13 hours ago Virtue signaling.  This will go nowhere. permalink award report block reply keeman 3 points 7 hours ago And if nobody pushes it then it guarantees it will go nowhere. permalink parent award report block reply\nkeeman 3 points 7 hours ago And if nobody pushes it then it guarantees it will go nowhere. permalink parent award report block reply\nMungo 7 points 13 hours ago Chip is a douchebag.   But he is right on this. permalink award report block reply\npatrioticwinning3 4 points 13 hours ago I doubt it will pass but it sounds like a good idea. permalink award report block reply\nAisle-is-closed 4 points 13 hours ago Without adequate blackmail or payoffs it has no chance. permalink award report block reply\nThe_RedWolf 3 points 11 hours ago And itll die in committee Wake me up when it actually goes somewhere permalink award report block reply keeman 1 points 7 hours ago Perhaps if We the People let our Congresscritters know we require this or we primary them?  I am pretty doomer, but this is something we can actually influence. permalink parent award report block reply\nkeeman 1 points 7 hours ago Perhaps if We the People let our Congresscritters know we require this or we primary them?  I am pretty doomer, but this is something we can actually influence. permalink parent award report block reply\nSenaleb 2 points 12 hours ago This is stupid to even waste his time writing nevermind introduce. The GOP wants h1-bs because cheap labor is great for the profit margin and the dems want illegals and legals to give free shit to for votes. I'll never forget when Chump did a Uturn on deportations a few months ago and stopped deporting illegal farm workers. permalink award report block reply\nsleepinggiant 1 points 7 hours ago Whats the chances it passes....\"i tried..\" no longer flies. permalink award report block reply\nBriben 1 points 7 minutes ago They already have the 100k fee for new.  Now end all old.  This performative nonsense is infuriating permalink award report block reply\nAlmostFullyDilated 1 points 7 hours ago Benny Johnson is nothing but a gay reposter permalink award report block reply\nShitFromShinola 0 points 12 hours ago More political theater from Chip Soy. This is going nowhere and this limp-wristed, dicksucker knows it. permalink award report block reply"}