{"id": "1ARK57tKx1", "contents": "426 Rich Baris: \"50-year mortgages is not a good idea. Not only because of the lifetime financial prison it will put young people into, but also because of the vultures who are already circling to capture this entire agenda. The President has a good heart and means well. But he's being rolled.\" posted 4 days ago by raptoris2 61 comments award share report block Rich Baris The People's Pundit @Peoples_Pundit • 4d 50-year mortgages is not a good idea. Not only because of the lifetime financial prison it will put young people into, but also because of the vultures who are already circling to capture this entire agenda. The President has a good heart and means well. But he's being rolled.\n61 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget Taylor3006 23 points 4 days ago Just more debt slavery for Americans.\nClose our borders. Deport everyone here illegally including their kids. That will make housing more affordable and cause wages to increase as employers compete for workers.\nKeep our borders closed until we house every American living on the streets. Keep our borders closed until every American who wants to buy a home, has the opportunity to buy one. We don't need a bunch of faggots from shithole countries living here. They are destroying our way of life, bringing down our standard of living, and ruining the environment. It isn't immigration, it is conquest. We need to remove anyone who refuses to assimilate. permalink award report block reply tingo999 -9 points 4 days ago You're right we should lock people out of being able to afford a home and force them to rent and deal with landlords for their whole life because they don't earn enough money to pay a shorter term mortgage. The only negative to this longer term mortgage is it opens up the market to more buyers which causes house prices to go up and right now we dont want house prices to go up because we flooded the country with rich foriegners and corporations buying properties. But, your logic is fucking stupid. permalink parent award report block reply Taylor3006 11 points 4 days ago You are a fucking idiot but you just go on being you. There is little that surprises me in Retard Faggot Clown World any more. permalink parent award report block reply BidensBodyDouble 6 points 4 days ago Not meaningfully paying down your principal for 25 years is batshit insane. This is not a great idea and will only drive up housing prices with increased demand. Deport the fucking illegals first and watch demand and prices fall. permalink parent award report block reply Owmyballz 2 points 4 days ago Nah son, you have the smooth brained take. At the turn of the century, the US government was at an impasses as the masses were getting indoctrinated into communism.  To fight that the US government got involved in mortgages to help people take out mortgages to increase ownership and created things like the 30 year mortgage.  Something that someone could take out at 20 and have paid off by 50. By putting out a 50 year mortgage, it would massively increase the banks profits and decrease the workers ability to save. Do better by removing cunts like Blackrock from being able to own single family and multi family homes and watch the prices for homes decrease not increase. permalink parent award report block reply RedStoneDeepState -11 points 4 days ago Keep our borders closed until we house every American living on the streets. Every American living on the streets should be shot. The unsheltered homeless are parasites who are less than worthless. permalink parent award report block reply Taylor3006 10 points 4 days ago A lot of them are homeless vets. A lot of them have substance abuse problems. A majority of them have mental problems. I suppose they can have several of those things being true. They are still Americans and they are our problem. I don't advocate murdering the mentally ill.  I find your kind of thinking repugnant. If my home is better than your home, do we get to kill you too for being a parasite since you are not living up to my expectations? permalink parent award report block reply RedStoneDeepState -8 points 4 days ago A lot of them are homeless vets.  A lot of them have substance abuse problems. A majority of them have mental problems. Did I fucking stutter? Every American living on the streets should be shot. Every single last one. They are still Americans and they are our problem. Absolutely. Shoot them to solve the problem. my home is better than your home, Their housing arrangement isn't why they need shot, it's the reason they are on the streets. permalink parent award report block reply Taylor3006 8 points 4 days ago You are a faggot. Fuck off. permalink parent award report block reply view 7 more comments... Crucible 15 points 4 days ago Anything Baris gets an automatic updoot. He's clean data based, painfully honest and articulate. permalink award report block reply Madnote1984 11 points 4 days ago He pops up here and there and a lot of pedes don't know who he is, but he's absolutely the best pollster in the country and he knows the national electorate in and out. permalink parent award report block reply Deplora 12 points 4 days ago Everyone needs to get a clue about this \"50 year mortgage\" business.  Nobody is expected to stay in their home for 50 years (very few people stay in their home for 30, or even 15 years).  That's not what this is about.  It's essentially an interest-only mortgage, a product which already exists and is chosen by a lot of high-income buyers, in most cases those expecting to stay in the home for 5 years or less.  This proposal would make an effectively interest-only mortgage more widely available to non-wealthy borrowers. It's primarily a way to get in on the inflation benefit, selling the home after living in it for a few years, after inflation (even when very low) has increased the value.  Doesn't matter if the monthly payment is as much (or even a bit more) than the owner would be paying as a renter.  A renter isn't building any equity via inflation.  There's also a tax benefit under longstanding federal tax law, which allows lower income to upper-middle income borrowers to deduct all the mortgage interest from taxable income. permalink award report block reply snoopy3210 7 points 4 days ago It does delay ownership and with large firms like Blackrock buying homes, you just fell for the “you’ll have nothing and be happy” 50 mortgages also relief pressure on politicians from lowering the home costs. It’s an admission of failure. Trump naively being compared to FDR is also an obvious trick to manipulate. Trump must fire immediately the advisor pushing the 50 years mortgages. Now. permalink parent award report block reply Deplora 1 points 4 days ago No, it does not delay ownership, because nobody will actually be holding on to the mortgage for 50 years.  For many people, it would end up accelerating full ownership, because of the inflation and tax benefits, when they sell the home after 5 years, and are able to buy their next home on a 15 year mortgage, rather than the 30 year that they would have needed for the same home, if they hadn't built some equity through inflation on their 50 year mortgaged home. If it enables them to use their available income more profitably in the earliest years of the 50 year loan, they will be better positioned to own a mortgage-free home sooner (though that's not necessarily a goal for many people whose careers are expected to require frequent relocation). permalink parent award report block reply Newhawk237 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply ForceMultiplier 6 points 4 days ago Sometime during Japan's economic decline, they invented 100 year mortgages, because living in a tiny little condo was becoming crazy expensive. A 30-something couple were never expected to actually pay off a 100 year loan of course, but it was transferable to their adult children. permalink award report block reply Im_RickSteves_bitch 5 points 4 days ago Instead of doing things like this, Pres. Trump should do what he promised he would do: rid our country of illegal aliens. This will alleviate the upward pressure on both housing and food, and put him in a stronger position to do what he didn't promise but will have to do anyway: End the Fed. permalink award report block reply BlueKentuckyGirl 5 points 4 days ago 50 year mortgage should be illegal like government run student loans 😂😂😂 permalink award report block reply ChinchillaCapitalism 4 points 4 days ago The year is 2087. I'm on my way to my 14 hour data annotation shift for a pot shop's LLM AI. Then I'll have to monitor a self driving Amazon truck for my side gig for 6 hours after that. All to pay down the interest on a 200 year mortgage my local corpo-aristocrat sold to my grandfather in exchange for allowing us peasants to populate a broom closet micro-home on his land. God bless America. permalink award report block reply Grilledpepe 3 points 4 days ago It's funny all these clowns on X who always know better than trump every time.  Nobody is telling people to pay a mortgage for 50 years.  Longer term means lower payment and easier budget and easier to overpay on the principal.  Instead people are renting and getting slowly squeezed out over time because of aggressive rate hikes. permalink award report block reply GoGoGadgetGringo 1 points 4 days ago Exactly. This site has lost its way. permalink parent award report block reply RedStoneDeepState -2 points 4 days ago easier to overpay on the principal You have clearly never looked at the amortization table on a mortgage permalink parent award report block reply Grilledpepe 3 points 4 days ago Uhhh go back and do the math.  Amortization table was the reason for what I said.  Learn how to do more with the same money and you won't be a debt slave. permalink parent award report block reply RedStoneDeepState -3 points 4 days ago You will be doing less with the same money because the interest is front loaded on mortgages. permalink parent award report block reply Grilledpepe 5 points 4 days ago Yes I know even a retard can read an amortization table.  Front loading the interest has nothing to do with a budget and making your money go further.  You clearly have no idea what point I was trying to make. permalink parent award report block reply view 6 more comments... patrioticwinning3 2 points 4 days ago If you look at the numbers a 50 year mortgage ONLY saves you about a $200 a month...and you get 20 more years of that shit! $300,000 30-year fixed: $1,529 principal and interest 40-year fixed: $1,418 principal and interest 50-year fixed: $1,366 principal and interest $400,000 30-year fixed: $2,038 principal and interest 40-year fixed: $1,891 principal and interest 50-year fixed: $1,822 principal and interest $500,000 30-year fixed: $2,548 principal and interest 40-year fixed: $2,363 principal and interest 50-year fixed: $2,277 principal and interest https://www.housingwire.com/articles/trump-proposes-50-year-mortgage-to-help-affordability/ permalink award report block reply TonyTreehouse 2 points 4 days ago The real problem is the 50 year pays down really slowly.  With a 30 year, your're getting good pay down by year 10.  About 27% of the payment is going to principal by then. With a 50 year, only about 8% is.  The savings per month would have gone towards paying down the loan.  So you can save money per month, but it is because you are closer to an interest only loan. If the house appreciates your return is better because you put less in. But you walk with less money. For most people, the forced savings by having the higher monthly payment will end up better. permalink award report block reply TonyTreehouse 1 points 4 days ago I'll also add that by year 30, on a $100k loan at 6.5%, you will have paid $24,600 more in the 360 monthly payments and paid the loan off.  The 50 year loan will still have a $75,600 balance.  The 30 years of compound reduction results in the roughly 3x difference.  That's of the rate is the same.  A 50 year  would likely have a higher rate permalink parent award report block reply LordCommissarYarrick 2 points 4 days ago The government and financial system hate you permalink award report block reply Melchizedek18 1 points 3 days ago A 50-year mortgage is called rent, where your landlord is a bank. Statistically, you will never pay it off. permalink award report block reply keeman 1 points 4 days ago I thought we were gonna drain the swamp.  Now we are talking about making Fannie and Freddie even bigger?  End them both.  The government should not be in the business of backing mortgages. permalink award report block reply donteatthat 1 points 4 days ago Is this a pressing matter? How many irons do we need in the fire permalink award report block reply GayPatriotMAGAUncle 1 points 4 days ago Stormfags and unemployed millennial fags big mad they have to pull themselves up by their bootstraps to buy a house and pay back mortgages like a normal person has since 1950. We didn't have it easier back then either and Trump is letting you pay less a month for your house. The entitlement from this generation is embarrassing. permalink award report block reply SnakePlisken1776 1 points 4 days ago 20% of the population will die in the next 20 years (boomers) leaving everyone underwater on their 50 year loans. permalink award report block reply Tacitus1963 1 points 4 days ago Was this Susie Wiles' idea? Asking for a friend. permalink award report block reply thelastlast 0 points 4 days ago i wish that last sentence didnt describe his entire presidency. permalink award report block reply TurboMAGA 0 points 4 days ago Rich is starting to be consistently negative. Maybe a 50 year mortgage will actually get people into the real estate game and encourage them to place roots and build American communities. What's a better solution right now? permalink award report block reply Crucible 8 points 4 days ago Deport all the illegals. It will clean up the housing market. Usury is not the answer. permalink parent award report block reply tingo999 -5 points 4 days ago Its not Usury you dumb cunt. permalink parent award report block reply Crucible 7 points 4 days ago Buying a million dollar home that will cost you 10 million is usury you queef huffing jew retard. You'll be a debt slave for life. permalink parent award report block reply Xahnel 2 points 4 days ago The thing about being a debt slave is that you can't just resell your slavery for more than you got it for like  you can a house. permalink parent award report block reply josiborg 0 points 4 days ago This shit happens every time he comes back from kissing the ring of Bibi. permalink award report block reply tingo999 -1 points 4 days ago The stupid shit people post on this forum is astonishing. A 50 year mortgage doesn't mean you are forced to pay the mortgage on the house for 50 years. You can sell it and move. Often you can sell it for a higher amount and upgrade to a better home. It allows someone to buy a house with a lower monthly payment. So maybe they couldn't afford the house on a shorter term mortgage maybe they can afford it now. A mortgage on a home is a good thing. Fuck do I really need to explain how the house market and a mortgage work, and why owning a home is a good investment even if you are paying a mortgage. I swear to god you faggots are dumb. permalink award report block reply Crucible 10 points 4 days ago You won't have any equity to flip because the loan is front loaded. Stop pretending that you're smarter than everyone else - You aren't. permalink parent award report block reply Taylor3006 9 points 4 days ago A fucking 50 year mortgage means you don't start paying on principle until what, year 30? Buying a home on that kind of mortgage means you won't be able to sell it for nearly any money back. It will all go to the bank. All you are doing is renting at that point but you are responsible for all the repairs and upkeep. permalink parent award report block reply Madnote1984 5 points 4 days ago It allows real estate firms and banks to stay afloat instead of letting the market bubble crash. This will only make room for HIGHER prices in the market. permalink parent award report block reply RealmanPwns 1 points 4 days ago You are obviously a troll and a moron. The 50 year Mortgage is targeting SPECIFICALLY people who CAN'T AFFORD  to make a 30 yer mortgage. People in this category are NOT the kind of people that make smart decisions and wouldn't be market savvy. permalink parent award report block reply TheDarkEmperor 1 points 4 days ago Comment removed by community moderators. permalink award report block reply guywholikesDjtof2024 1 points 4 days ago Because he took the vax. permalink parent award report block reply\nTaylor3006 23 points 4 days ago Just more debt slavery for Americans.\nClose our borders. Deport everyone here illegally including their kids. That will make housing more affordable and cause wages to increase as employers compete for workers.\nKeep our borders closed until we house every American living on the streets. Keep our borders closed until every American who wants to buy a home, has the opportunity to buy one. We don't need a bunch of faggots from shithole countries living here. They are destroying our way of life, bringing down our standard of living, and ruining the environment. It isn't immigration, it is conquest. We need to remove anyone who refuses to assimilate. permalink award report block reply tingo999 -9 points 4 days ago You're right we should lock people out of being able to afford a home and force them to rent and deal with landlords for their whole life because they don't earn enough money to pay a shorter term mortgage. The only negative to this longer term mortgage is it opens up the market to more buyers which causes house prices to go up and right now we dont want house prices to go up because we flooded the country with rich foriegners and corporations buying properties. But, your logic is fucking stupid. permalink parent award report block reply Taylor3006 11 points 4 days ago You are a fucking idiot but you just go on being you. There is little that surprises me in Retard Faggot Clown World any more. permalink parent award report block reply BidensBodyDouble 6 points 4 days ago Not meaningfully paying down your principal for 25 years is batshit insane. This is not a great idea and will only drive up housing prices with increased demand. Deport the fucking illegals first and watch demand and prices fall. permalink parent award report block reply Owmyballz 2 points 4 days ago Nah son, you have the smooth brained take. At the turn of the century, the US government was at an impasses as the masses were getting indoctrinated into communism.  To fight that the US government got involved in mortgages to help people take out mortgages to increase ownership and created things like the 30 year mortgage.  Something that someone could take out at 20 and have paid off by 50. By putting out a 50 year mortgage, it would massively increase the banks profits and decrease the workers ability to save. Do better by removing cunts like Blackrock from being able to own single family and multi family homes and watch the prices for homes decrease not increase. permalink parent award report block reply RedStoneDeepState -11 points 4 days ago Keep our borders closed until we house every American living on the streets. Every American living on the streets should be shot. The unsheltered homeless are parasites who are less than worthless. permalink parent award report block reply Taylor3006 10 points 4 days ago A lot of them are homeless vets. A lot of them have substance abuse problems. A majority of them have mental problems. I suppose they can have several of those things being true. They are still Americans and they are our problem. I don't advocate murdering the mentally ill.  I find your kind of thinking repugnant. If my home is better than your home, do we get to kill you too for being a parasite since you are not living up to my expectations? permalink parent award report block reply RedStoneDeepState -8 points 4 days ago A lot of them are homeless vets.  A lot of them have substance abuse problems. A majority of them have mental problems. Did I fucking stutter? Every American living on the streets should be shot. Every single last one. They are still Americans and they are our problem. Absolutely. Shoot them to solve the problem. my home is better than your home, Their housing arrangement isn't why they need shot, it's the reason they are on the streets. permalink parent award report block reply Taylor3006 8 points 4 days ago You are a faggot. Fuck off. permalink parent award report block reply view 7 more comments...\ntingo999 -9 points 4 days ago You're right we should lock people out of being able to afford a home and force them to rent and deal with landlords for their whole life because they don't earn enough money to pay a shorter term mortgage. The only negative to this longer term mortgage is it opens up the market to more buyers which causes house prices to go up and right now we dont want house prices to go up because we flooded the country with rich foriegners and corporations buying properties. But, your logic is fucking stupid. permalink parent award report block reply Taylor3006 11 points 4 days ago You are a fucking idiot but you just go on being you. There is little that surprises me in Retard Faggot Clown World any more. permalink parent award report block reply BidensBodyDouble 6 points 4 days ago Not meaningfully paying down your principal for 25 years is batshit insane. This is not a great idea and will only drive up housing prices with increased demand. Deport the fucking illegals first and watch demand and prices fall. permalink parent award report block reply Owmyballz 2 points 4 days ago Nah son, you have the smooth brained take. At the turn of the century, the US government was at an impasses as the masses were getting indoctrinated into communism.  To fight that the US government got involved in mortgages to help people take out mortgages to increase ownership and created things like the 30 year mortgage.  Something that someone could take out at 20 and have paid off by 50. By putting out a 50 year mortgage, it would massively increase the banks profits and decrease the workers ability to save. Do better by removing cunts like Blackrock from being able to own single family and multi family homes and watch the prices for homes decrease not increase. permalink parent award report block reply\nTaylor3006 11 points 4 days ago You are a fucking idiot but you just go on being you. There is little that surprises me in Retard Faggot Clown World any more. permalink parent award report block reply\nBidensBodyDouble 6 points 4 days ago Not meaningfully paying down your principal for 25 years is batshit insane. This is not a great idea and will only drive up housing prices with increased demand. Deport the fucking illegals first and watch demand and prices fall. permalink parent award report block reply\nOwmyballz 2 points 4 days ago Nah son, you have the smooth brained take. At the turn of the century, the US government was at an impasses as the masses were getting indoctrinated into communism.  To fight that the US government got involved in mortgages to help people take out mortgages to increase ownership and created things like the 30 year mortgage.  Something that someone could take out at 20 and have paid off by 50. By putting out a 50 year mortgage, it would massively increase the banks profits and decrease the workers ability to save. Do better by removing cunts like Blackrock from being able to own single family and multi family homes and watch the prices for homes decrease not increase. permalink parent award report block reply\nRedStoneDeepState -11 points 4 days ago Keep our borders closed until we house every American living on the streets. Every American living on the streets should be shot. The unsheltered homeless are parasites who are less than worthless. permalink parent award report block reply Taylor3006 10 points 4 days ago A lot of them are homeless vets. A lot of them have substance abuse problems. A majority of them have mental problems. I suppose they can have several of those things being true. They are still Americans and they are our problem. I don't advocate murdering the mentally ill.  I find your kind of thinking repugnant. If my home is better than your home, do we get to kill you too for being a parasite since you are not living up to my expectations? permalink parent award report block reply RedStoneDeepState -8 points 4 days ago A lot of them are homeless vets.  A lot of them have substance abuse problems. A majority of them have mental problems. Did I fucking stutter? Every American living on the streets should be shot. Every single last one. They are still Americans and they are our problem. Absolutely. Shoot them to solve the problem. my home is better than your home, Their housing arrangement isn't why they need shot, it's the reason they are on the streets. permalink parent award report block reply Taylor3006 8 points 4 days ago You are a faggot. Fuck off. permalink parent award report block reply view 7 more comments...\nTaylor3006 10 points 4 days ago A lot of them are homeless vets. A lot of them have substance abuse problems. A majority of them have mental problems. I suppose they can have several of those things being true. They are still Americans and they are our problem. I don't advocate murdering the mentally ill.  I find your kind of thinking repugnant. If my home is better than your home, do we get to kill you too for being a parasite since you are not living up to my expectations? permalink parent award report block reply RedStoneDeepState -8 points 4 days ago A lot of them are homeless vets.  A lot of them have substance abuse problems. A majority of them have mental problems. Did I fucking stutter? Every American living on the streets should be shot. Every single last one. They are still Americans and they are our problem. Absolutely. Shoot them to solve the problem. my home is better than your home, Their housing arrangement isn't why they need shot, it's the reason they are on the streets. permalink parent award report block reply Taylor3006 8 points 4 days ago You are a faggot. Fuck off. permalink parent award report block reply view 7 more comments...\nRedStoneDeepState -8 points 4 days ago A lot of them are homeless vets.  A lot of them have substance abuse problems. A majority of them have mental problems. Did I fucking stutter? Every American living on the streets should be shot. Every single last one. They are still Americans and they are our problem. Absolutely. Shoot them to solve the problem. my home is better than your home, Their housing arrangement isn't why they need shot, it's the reason they are on the streets. permalink parent award report block reply Taylor3006 8 points 4 days ago You are a faggot. Fuck off. permalink parent award report block reply view 7 more comments...\nTaylor3006 8 points 4 days ago You are a faggot. Fuck off. permalink parent award report block reply view 7 more comments...\nCrucible 15 points 4 days ago Anything Baris gets an automatic updoot. He's clean data based, painfully honest and articulate. permalink award report block reply Madnote1984 11 points 4 days ago He pops up here and there and a lot of pedes don't know who he is, but he's absolutely the best pollster in the country and he knows the national electorate in and out. permalink parent award report block reply\nMadnote1984 11 points 4 days ago He pops up here and there and a lot of pedes don't know who he is, but he's absolutely the best pollster in the country and he knows the national electorate in and out. permalink parent award report block reply\nDeplora 12 points 4 days ago Everyone needs to get a clue about this \"50 year mortgage\" business.  Nobody is expected to stay in their home for 50 years (very few people stay in their home for 30, or even 15 years).  That's not what this is about.  It's essentially an interest-only mortgage, a product which already exists and is chosen by a lot of high-income buyers, in most cases those expecting to stay in the home for 5 years or less.  This proposal would make an effectively interest-only mortgage more widely available to non-wealthy borrowers. It's primarily a way to get in on the inflation benefit, selling the home after living in it for a few years, after inflation (even when very low) has increased the value.  Doesn't matter if the monthly payment is as much (or even a bit more) than the owner would be paying as a renter.  A renter isn't building any equity via inflation.  There's also a tax benefit under longstanding federal tax law, which allows lower income to upper-middle income borrowers to deduct all the mortgage interest from taxable income. permalink award report block reply snoopy3210 7 points 4 days ago It does delay ownership and with large firms like Blackrock buying homes, you just fell for the “you’ll have nothing and be happy” 50 mortgages also relief pressure on politicians from lowering the home costs. It’s an admission of failure. Trump naively being compared to FDR is also an obvious trick to manipulate. Trump must fire immediately the advisor pushing the 50 years mortgages. Now. permalink parent award report block reply Deplora 1 points 4 days ago No, it does not delay ownership, because nobody will actually be holding on to the mortgage for 50 years.  For many people, it would end up accelerating full ownership, because of the inflation and tax benefits, when they sell the home after 5 years, and are able to buy their next home on a 15 year mortgage, rather than the 30 year that they would have needed for the same home, if they hadn't built some equity through inflation on their 50 year mortgaged home. If it enables them to use their available income more profitably in the earliest years of the 50 year loan, they will be better positioned to own a mortgage-free home sooner (though that's not necessarily a goal for many people whose careers are expected to require frequent relocation). permalink parent award report block reply Newhawk237 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nsnoopy3210 7 points 4 days ago It does delay ownership and with large firms like Blackrock buying homes, you just fell for the “you’ll have nothing and be happy” 50 mortgages also relief pressure on politicians from lowering the home costs. It’s an admission of failure. Trump naively being compared to FDR is also an obvious trick to manipulate. Trump must fire immediately the advisor pushing the 50 years mortgages. Now. permalink parent award report block reply Deplora 1 points 4 days ago No, it does not delay ownership, because nobody will actually be holding on to the mortgage for 50 years.  For many people, it would end up accelerating full ownership, because of the inflation and tax benefits, when they sell the home after 5 years, and are able to buy their next home on a 15 year mortgage, rather than the 30 year that they would have needed for the same home, if they hadn't built some equity through inflation on their 50 year mortgaged home. If it enables them to use their available income more profitably in the earliest years of the 50 year loan, they will be better positioned to own a mortgage-free home sooner (though that's not necessarily a goal for many people whose careers are expected to require frequent relocation). permalink parent award report block reply Newhawk237 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nDeplora 1 points 4 days ago No, it does not delay ownership, because nobody will actually be holding on to the mortgage for 50 years.  For many people, it would end up accelerating full ownership, because of the inflation and tax benefits, when they sell the home after 5 years, and are able to buy their next home on a 15 year mortgage, rather than the 30 year that they would have needed for the same home, if they hadn't built some equity through inflation on their 50 year mortgaged home. If it enables them to use their available income more profitably in the earliest years of the 50 year loan, they will be better positioned to own a mortgage-free home sooner (though that's not necessarily a goal for many people whose careers are expected to require frequent relocation). permalink parent award report block reply Newhawk237 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nNewhawk237 1 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nForceMultiplier 6 points 4 days ago Sometime during Japan's economic decline, they invented 100 year mortgages, because living in a tiny little condo was becoming crazy expensive. A 30-something couple were never expected to actually pay off a 100 year loan of course, but it was transferable to their adult children. permalink award report block reply\nIm_RickSteves_bitch 5 points 4 days ago Instead of doing things like this, Pres. Trump should do what he promised he would do: rid our country of illegal aliens. This will alleviate the upward pressure on both housing and food, and put him in a stronger position to do what he didn't promise but will have to do anyway: End the Fed. permalink award report block reply\nBlueKentuckyGirl 5 points 4 days ago 50 year mortgage should be illegal like government run student loans 😂😂😂 permalink award report block reply\nChinchillaCapitalism 4 points 4 days ago The year is 2087. I'm on my way to my 14 hour data annotation shift for a pot shop's LLM AI. Then I'll have to monitor a self driving Amazon truck for my side gig for 6 hours after that. All to pay down the interest on a 200 year mortgage my local corpo-aristocrat sold to my grandfather in exchange for allowing us peasants to populate a broom closet micro-home on his land. God bless America. permalink award report block reply\nGrilledpepe 3 points 4 days ago It's funny all these clowns on X who always know better than trump every time.  Nobody is telling people to pay a mortgage for 50 years.  Longer term means lower payment and easier budget and easier to overpay on the principal.  Instead people are renting and getting slowly squeezed out over time because of aggressive rate hikes. permalink award report block reply GoGoGadgetGringo 1 points 4 days ago Exactly. This site has lost its way. permalink parent award report block reply RedStoneDeepState -2 points 4 days ago easier to overpay on the principal You have clearly never looked at the amortization table on a mortgage permalink parent award report block reply Grilledpepe 3 points 4 days ago Uhhh go back and do the math.  Amortization table was the reason for what I said.  Learn how to do more with the same money and you won't be a debt slave. permalink parent award report block reply RedStoneDeepState -3 points 4 days ago You will be doing less with the same money because the interest is front loaded on mortgages. permalink parent award report block reply Grilledpepe 5 points 4 days ago Yes I know even a retard can read an amortization table.  Front loading the interest has nothing to do with a budget and making your money go further.  You clearly have no idea what point I was trying to make. permalink parent award report block reply view 6 more comments...\nGoGoGadgetGringo 1 points 4 days ago Exactly. This site has lost its way. permalink parent award report block reply\nRedStoneDeepState -2 points 4 days ago easier to overpay on the principal You have clearly never looked at the amortization table on a mortgage permalink parent award report block reply Grilledpepe 3 points 4 days ago Uhhh go back and do the math.  Amortization table was the reason for what I said.  Learn how to do more with the same money and you won't be a debt slave. permalink parent award report block reply RedStoneDeepState -3 points 4 days ago You will be doing less with the same money because the interest is front loaded on mortgages. permalink parent award report block reply Grilledpepe 5 points 4 days ago Yes I know even a retard can read an amortization table.  Front loading the interest has nothing to do with a budget and making your money go further.  You clearly have no idea what point I was trying to make. permalink parent award report block reply view 6 more comments...\nGrilledpepe 3 points 4 days ago Uhhh go back and do the math.  Amortization table was the reason for what I said.  Learn how to do more with the same money and you won't be a debt slave. permalink parent award report block reply RedStoneDeepState -3 points 4 days ago You will be doing less with the same money because the interest is front loaded on mortgages. permalink parent award report block reply Grilledpepe 5 points 4 days ago Yes I know even a retard can read an amortization table.  Front loading the interest has nothing to do with a budget and making your money go further.  You clearly have no idea what point I was trying to make. permalink parent award report block reply view 6 more comments...\nRedStoneDeepState -3 points 4 days ago You will be doing less with the same money because the interest is front loaded on mortgages. permalink parent award report block reply Grilledpepe 5 points 4 days ago Yes I know even a retard can read an amortization table.  Front loading the interest has nothing to do with a budget and making your money go further.  You clearly have no idea what point I was trying to make. permalink parent award report block reply view 6 more comments...\nGrilledpepe 5 points 4 days ago Yes I know even a retard can read an amortization table.  Front loading the interest has nothing to do with a budget and making your money go further.  You clearly have no idea what point I was trying to make. permalink parent award report block reply view 6 more comments...\npatrioticwinning3 2 points 4 days ago If you look at the numbers a 50 year mortgage ONLY saves you about a $200 a month...and you get 20 more years of that shit! $300,000 30-year fixed: $1,529 principal and interest 40-year fixed: $1,418 principal and interest 50-year fixed: $1,366 principal and interest $400,000 30-year fixed: $2,038 principal and interest 40-year fixed: $1,891 principal and interest 50-year fixed: $1,822 principal and interest $500,000 30-year fixed: $2,548 principal and interest 40-year fixed: $2,363 principal and interest 50-year fixed: $2,277 principal and interest https://www.housingwire.com/articles/trump-proposes-50-year-mortgage-to-help-affordability/ permalink award report block reply\nTonyTreehouse 2 points 4 days ago The real problem is the 50 year pays down really slowly.  With a 30 year, your're getting good pay down by year 10.  About 27% of the payment is going to principal by then. With a 50 year, only about 8% is.  The savings per month would have gone towards paying down the loan.  So you can save money per month, but it is because you are closer to an interest only loan. If the house appreciates your return is better because you put less in. But you walk with less money. For most people, the forced savings by having the higher monthly payment will end up better. permalink award report block reply TonyTreehouse 1 points 4 days ago I'll also add that by year 30, on a $100k loan at 6.5%, you will have paid $24,600 more in the 360 monthly payments and paid the loan off.  The 50 year loan will still have a $75,600 balance.  The 30 years of compound reduction results in the roughly 3x difference.  That's of the rate is the same.  A 50 year  would likely have a higher rate permalink parent award report block reply\nTonyTreehouse 1 points 4 days ago I'll also add that by year 30, on a $100k loan at 6.5%, you will have paid $24,600 more in the 360 monthly payments and paid the loan off.  The 50 year loan will still have a $75,600 balance.  The 30 years of compound reduction results in the roughly 3x difference.  That's of the rate is the same.  A 50 year  would likely have a higher rate permalink parent award report block reply\nLordCommissarYarrick 2 points 4 days ago The government and financial system hate you permalink award report block reply\nMelchizedek18 1 points 3 days ago A 50-year mortgage is called rent, where your landlord is a bank. Statistically, you will never pay it off. permalink award report block reply\nkeeman 1 points 4 days ago I thought we were gonna drain the swamp.  Now we are talking about making Fannie and Freddie even bigger?  End them both.  The government should not be in the business of backing mortgages. permalink award report block reply\ndonteatthat 1 points 4 days ago Is this a pressing matter? How many irons do we need in the fire permalink award report block reply\nGayPatriotMAGAUncle 1 points 4 days ago Stormfags and unemployed millennial fags big mad they have to pull themselves up by their bootstraps to buy a house and pay back mortgages like a normal person has since 1950. We didn't have it easier back then either and Trump is letting you pay less a month for your house. The entitlement from this generation is embarrassing. permalink award report block reply\nSnakePlisken1776 1 points 4 days ago 20% of the population will die in the next 20 years (boomers) leaving everyone underwater on their 50 year loans. permalink award report block reply\nTacitus1963 1 points 4 days ago Was this Susie Wiles' idea? Asking for a friend. permalink award report block reply\nthelastlast 0 points 4 days ago i wish that last sentence didnt describe his entire presidency. permalink award report block reply\nTurboMAGA 0 points 4 days ago Rich is starting to be consistently negative. Maybe a 50 year mortgage will actually get people into the real estate game and encourage them to place roots and build American communities. What's a better solution right now? permalink award report block reply Crucible 8 points 4 days ago Deport all the illegals. It will clean up the housing market. Usury is not the answer. permalink parent award report block reply tingo999 -5 points 4 days ago Its not Usury you dumb cunt. permalink parent award report block reply Crucible 7 points 4 days ago Buying a million dollar home that will cost you 10 million is usury you queef huffing jew retard. You'll be a debt slave for life. permalink parent award report block reply Xahnel 2 points 4 days ago The thing about being a debt slave is that you can't just resell your slavery for more than you got it for like  you can a house. permalink parent award report block reply\nCrucible 8 points 4 days ago Deport all the illegals. It will clean up the housing market. Usury is not the answer. permalink parent award report block reply tingo999 -5 points 4 days ago Its not Usury you dumb cunt. permalink parent award report block reply Crucible 7 points 4 days ago Buying a million dollar home that will cost you 10 million is usury you queef huffing jew retard. You'll be a debt slave for life. permalink parent award report block reply Xahnel 2 points 4 days ago The thing about being a debt slave is that you can't just resell your slavery for more than you got it for like  you can a house. permalink parent award report block reply\ntingo999 -5 points 4 days ago Its not Usury you dumb cunt. permalink parent award report block reply Crucible 7 points 4 days ago Buying a million dollar home that will cost you 10 million is usury you queef huffing jew retard. You'll be a debt slave for life. permalink parent award report block reply Xahnel 2 points 4 days ago The thing about being a debt slave is that you can't just resell your slavery for more than you got it for like  you can a house. permalink parent award report block reply\nCrucible 7 points 4 days ago Buying a million dollar home that will cost you 10 million is usury you queef huffing jew retard. You'll be a debt slave for life. permalink parent award report block reply Xahnel 2 points 4 days ago The thing about being a debt slave is that you can't just resell your slavery for more than you got it for like  you can a house. permalink parent award report block reply\nXahnel 2 points 4 days ago The thing about being a debt slave is that you can't just resell your slavery for more than you got it for like  you can a house. permalink parent award report block reply\njosiborg 0 points 4 days ago This shit happens every time he comes back from kissing the ring of Bibi. permalink award report block reply\ntingo999 -1 points 4 days ago The stupid shit people post on this forum is astonishing. A 50 year mortgage doesn't mean you are forced to pay the mortgage on the house for 50 years. You can sell it and move. Often you can sell it for a higher amount and upgrade to a better home. It allows someone to buy a house with a lower monthly payment. So maybe they couldn't afford the house on a shorter term mortgage maybe they can afford it now. A mortgage on a home is a good thing. Fuck do I really need to explain how the house market and a mortgage work, and why owning a home is a good investment even if you are paying a mortgage. I swear to god you faggots are dumb. permalink award report block reply Crucible 10 points 4 days ago You won't have any equity to flip because the loan is front loaded. Stop pretending that you're smarter than everyone else - You aren't. permalink parent award report block reply Taylor3006 9 points 4 days ago A fucking 50 year mortgage means you don't start paying on principle until what, year 30? Buying a home on that kind of mortgage means you won't be able to sell it for nearly any money back. It will all go to the bank. All you are doing is renting at that point but you are responsible for all the repairs and upkeep. permalink parent award report block reply Madnote1984 5 points 4 days ago It allows real estate firms and banks to stay afloat instead of letting the market bubble crash. This will only make room for HIGHER prices in the market. permalink parent award report block reply RealmanPwns 1 points 4 days ago You are obviously a troll and a moron. The 50 year Mortgage is targeting SPECIFICALLY people who CAN'T AFFORD  to make a 30 yer mortgage. People in this category are NOT the kind of people that make smart decisions and wouldn't be market savvy. permalink parent award report block reply\nCrucible 10 points 4 days ago You won't have any equity to flip because the loan is front loaded. Stop pretending that you're smarter than everyone else - You aren't. permalink parent award report block reply\nTaylor3006 9 points 4 days ago A fucking 50 year mortgage means you don't start paying on principle until what, year 30? Buying a home on that kind of mortgage means you won't be able to sell it for nearly any money back. It will all go to the bank. All you are doing is renting at that point but you are responsible for all the repairs and upkeep. permalink parent award report block reply\nMadnote1984 5 points 4 days ago It allows real estate firms and banks to stay afloat instead of letting the market bubble crash. This will only make room for HIGHER prices in the market. permalink parent award report block reply\nRealmanPwns 1 points 4 days ago You are obviously a troll and a moron. The 50 year Mortgage is targeting SPECIFICALLY people who CAN'T AFFORD  to make a 30 yer mortgage. People in this category are NOT the kind of people that make smart decisions and wouldn't be market savvy. permalink parent award report block reply\nTheDarkEmperor 1 points 4 days ago Comment removed by community moderators. permalink award report block reply guywholikesDjtof2024 1 points 4 days ago Because he took the vax. permalink parent award report block reply\nguywholikesDjtof2024 1 points 4 days ago Because he took the vax. permalink parent award report block reply"}