{"id": "1ARK5A9ZlG", "contents": "700 CIA J6 pipebomber was also the first to fire into the crowd which caused the original panic and rush? 🤫 posted 3 days ago by SALTYinSeattle 43 comments award share download report block\n43 comments Sort by Top Top New Worst Old Save ColonelKlink 40 points 3 days ago Arrests? Trials for treason? permalink award report block reply dude_bro 17 points 3 days ago Trump is still busy “looking into RICO Soros” permalink parent award report block reply TheTelltaleFly 14 points 3 days ago Remember when we put this guy in as the deputy director of the fbi who kept saying that finding the pipe bomber and getting J6 justice were his top priorities? Anyone remember that guy? Wonder what he’s up to these days. Guess he’ll chat with his boss about it when the boss gets back in his private fbi jet from Shanghai. So glad our guys are in charge now. It’s going great. permalink parent award report block reply Payasyougo 2 points 3 days ago Yeah..I also found it weird that the website named after him, which I believe is run by his wife now...has not blasted this all over its page. I looked the other day when a lot of this was breaking...no mention at all. Extremely weird to me. permalink parent award report block reply snoopy3210 0 points 3 days ago You sent him on looking for Epstein. You're part of the problem. permalink parent award report block reply NotYourMan 11 points 3 days ago Nancy gives the order \"Create a riot!\" and this one fires into the peaceful crowd causing panic.  At the same time, \"somebody\" inside the capitol building opens the magnetically sealed doors.  It was entrapment of non-violent Trump supporters by the democrats to get to Trump!  Traitors! permalink parent award report block reply Jabronson 4 points 3 days ago Pam is such a disappointment. permalink parent award report block reply chickeninoven 2 points 3 days ago That's being extremely kind. permalink parent award report block reply Threaper666 1 points 3 days ago This cunt better be arrested. permalink parent award report block reply Payasyougo 1 points 3 days ago Were is this bitch. I haven't seen any info one where she lives, no one is at her house protesting. All I heard was that she is now CIA. Where are all the patriots who were imprisoned. Id be at her door if they did that to me. permalink parent award report block reply Trooph-Hurts 27 points 3 days ago So a UKRAINIAN is protecting our capital? How can foreigners be anywhere close to our govts capital and operations???? Now sending the Ukraine blackmail for billions! permalink award report block reply TrumpAndGodWin 8 points 3 days ago And why is that cop masked when the Democrats pretend to be against it on ICE. permalink parent award report block reply Payasyougo 4 points 3 days ago WAIT SHE IS Ukrainian? Just like that fuck Vindman who was used to justify impeachment by the Dems because he was spying on a phone conversation trump was having? Whose brother ran for office in Northern VA and won? permalink parent award report block reply RagnarD 1 points 2 days ago Quite the coincidence, isn't it? permalink parent award report block reply Trooph-Hurts 1 points 2 days ago I guess I didn’t know that Vindman was Ukrainian!….. But it’s a full circle… All the important processors and 2020 that were being shuttled around to all of these different riot sites where Ukrainian…. The forces that were used in Australia to beat up, the population were also Ukrainian. They did it because they sort of blend and they look Caucasian Automatically their English or American or Australian, but they’re just radical Marxist Who want to overthrow our country and actually did…. Stealing the 2020 election was an illegal takeover of our government permalink parent award report block reply PatriotSkorzeny 25 points 3 days ago The police fired upon the People. 📜 permalink award report block reply helenlisawhite 10 points 3 days ago I was there that is very true. Fortunately it was very windy that day so their tear gas had little to no effect. God was on the side of patriots !! permalink parent award report block reply chewsoap 7 points 3 days ago Back the blue hur dur permalink parent award report block reply _Sully_ 17 points 3 days ago Don't we have body cam footage of capitol police basically saying \"Ok they say it's time to start this\" and \"throw this in the crowd (referring to a tear gas canister) to get them riled-up\"? permalink award report block reply NSFW_PORN_ONLY 12 points 3 days ago It's always women. Started in Eden. They love the serpent. permalink award report block reply Lady_MaGa -5 points 3 days ago Men always lie.  Started in Eden.  Adam ate the apple first but when God's wrath came down the man blamed Eve.  And so it was written. permalink parent award report block reply TrumpAndGodWin 4 points 3 days ago Both lie e.g. older FBI statistics showing that women lied about rape around fifty percent of the time. permalink parent award report block reply Lady_MaGa 3 points 3 days ago And 90% of kiddie didlers are men. And to my first comment about Eden, you men haters/fake MAGA just to divide us people, couldn't even see I was returning a questionable answer to a stupid comment that was made. permalink parent award report block reply IForgotToAddAnEmail 3 points 3 days ago Incorrect. Bet women aren't looked at enough in the education depart with teachers sleeping with students. Let's add the knowingly false accusations women love to do. Women are the biggest contributors to Infanticide. < This is a fact. Do not try and argue with emotions, woman. All are sinners in truth though. permalink parent award report block reply view 6 more comments... 2Fangz 2 points 3 days ago Fuck off, bitch. permalink parent award report block reply Nomad899 11 points 3 days ago Them had xer orders permalink award report block reply loooooof 7 points 3 days ago Lol... Jan. 6 'PlPEB0MBER'... Master of evasion . permalink award report block reply realsolidsnakeoil 6 points 3 days ago And the rabbit hole goes deeper still. permalink award report block reply Billbuttlickerr 6 points 3 days ago Liberal white woman. Short hair. Probably a dyke. The satire writes itself. permalink award report block reply Nibba2 3 points 3 days ago Probably lmao. Did you see her? permalink parent award report block reply SALTYinSeattle OP 5 points 3 days ago https://x.com/RaheemKassam/status/1987576600855224560 permalink award report block reply TurboMAGA 3 points 3 days ago Capital punishment for her is deserved. permalink award report block reply Maga305_47 3 points 3 days ago Muh pensions… permalink award report block reply AmericanHeroSandwich 3 points 3 days ago I want a guillotine on the White House lawn permalink award report block reply AwShitHereWeGoAgain 2 points 3 days ago Hang that bitch. permalink award report block reply Doritalos 1 points 2 days ago Sentence her to a 50 year mortgage permalink award report block reply RagnarD 1 points 2 days ago It wouldn't surprise me, but all bull dyke cops look the same so it's hard to tell from the image. permalink award report block reply\nColonelKlink 40 points 3 days ago Arrests? Trials for treason? permalink award report block reply dude_bro 17 points 3 days ago Trump is still busy “looking into RICO Soros” permalink parent award report block reply TheTelltaleFly 14 points 3 days ago Remember when we put this guy in as the deputy director of the fbi who kept saying that finding the pipe bomber and getting J6 justice were his top priorities? Anyone remember that guy? Wonder what he’s up to these days. Guess he’ll chat with his boss about it when the boss gets back in his private fbi jet from Shanghai. So glad our guys are in charge now. It’s going great. permalink parent award report block reply Payasyougo 2 points 3 days ago Yeah..I also found it weird that the website named after him, which I believe is run by his wife now...has not blasted this all over its page. I looked the other day when a lot of this was breaking...no mention at all. Extremely weird to me. permalink parent award report block reply snoopy3210 0 points 3 days ago You sent him on looking for Epstein. You're part of the problem. permalink parent award report block reply NotYourMan 11 points 3 days ago Nancy gives the order \"Create a riot!\" and this one fires into the peaceful crowd causing panic.  At the same time, \"somebody\" inside the capitol building opens the magnetically sealed doors.  It was entrapment of non-violent Trump supporters by the democrats to get to Trump!  Traitors! permalink parent award report block reply Jabronson 4 points 3 days ago Pam is such a disappointment. permalink parent award report block reply chickeninoven 2 points 3 days ago That's being extremely kind. permalink parent award report block reply Threaper666 1 points 3 days ago This cunt better be arrested. permalink parent award report block reply Payasyougo 1 points 3 days ago Were is this bitch. I haven't seen any info one where she lives, no one is at her house protesting. All I heard was that she is now CIA. Where are all the patriots who were imprisoned. Id be at her door if they did that to me. permalink parent award report block reply\ndude_bro 17 points 3 days ago Trump is still busy “looking into RICO Soros” permalink parent award report block reply TheTelltaleFly 14 points 3 days ago Remember when we put this guy in as the deputy director of the fbi who kept saying that finding the pipe bomber and getting J6 justice were his top priorities? Anyone remember that guy? Wonder what he’s up to these days. Guess he’ll chat with his boss about it when the boss gets back in his private fbi jet from Shanghai. So glad our guys are in charge now. It’s going great. permalink parent award report block reply Payasyougo 2 points 3 days ago Yeah..I also found it weird that the website named after him, which I believe is run by his wife now...has not blasted this all over its page. I looked the other day when a lot of this was breaking...no mention at all. Extremely weird to me. permalink parent award report block reply snoopy3210 0 points 3 days ago You sent him on looking for Epstein. You're part of the problem. permalink parent award report block reply\nTheTelltaleFly 14 points 3 days ago Remember when we put this guy in as the deputy director of the fbi who kept saying that finding the pipe bomber and getting J6 justice were his top priorities? Anyone remember that guy? Wonder what he’s up to these days. Guess he’ll chat with his boss about it when the boss gets back in his private fbi jet from Shanghai. So glad our guys are in charge now. It’s going great. permalink parent award report block reply Payasyougo 2 points 3 days ago Yeah..I also found it weird that the website named after him, which I believe is run by his wife now...has not blasted this all over its page. I looked the other day when a lot of this was breaking...no mention at all. Extremely weird to me. permalink parent award report block reply snoopy3210 0 points 3 days ago You sent him on looking for Epstein. You're part of the problem. permalink parent award report block reply\nPayasyougo 2 points 3 days ago Yeah..I also found it weird that the website named after him, which I believe is run by his wife now...has not blasted this all over its page. I looked the other day when a lot of this was breaking...no mention at all. Extremely weird to me. permalink parent award report block reply\nsnoopy3210 0 points 3 days ago You sent him on looking for Epstein. You're part of the problem. permalink parent award report block reply\nNotYourMan 11 points 3 days ago Nancy gives the order \"Create a riot!\" and this one fires into the peaceful crowd causing panic.  At the same time, \"somebody\" inside the capitol building opens the magnetically sealed doors.  It was entrapment of non-violent Trump supporters by the democrats to get to Trump!  Traitors! permalink parent award report block reply\nJabronson 4 points 3 days ago Pam is such a disappointment. permalink parent award report block reply chickeninoven 2 points 3 days ago That's being extremely kind. permalink parent award report block reply\nchickeninoven 2 points 3 days ago That's being extremely kind. permalink parent award report block reply\nThreaper666 1 points 3 days ago This cunt better be arrested. permalink parent award report block reply Payasyougo 1 points 3 days ago Were is this bitch. I haven't seen any info one where she lives, no one is at her house protesting. All I heard was that she is now CIA. Where are all the patriots who were imprisoned. Id be at her door if they did that to me. permalink parent award report block reply\nPayasyougo 1 points 3 days ago Were is this bitch. I haven't seen any info one where she lives, no one is at her house protesting. All I heard was that she is now CIA. Where are all the patriots who were imprisoned. Id be at her door if they did that to me. permalink parent award report block reply\nTrooph-Hurts 27 points 3 days ago So a UKRAINIAN is protecting our capital? How can foreigners be anywhere close to our govts capital and operations???? Now sending the Ukraine blackmail for billions! permalink award report block reply TrumpAndGodWin 8 points 3 days ago And why is that cop masked when the Democrats pretend to be against it on ICE. permalink parent award report block reply Payasyougo 4 points 3 days ago WAIT SHE IS Ukrainian? Just like that fuck Vindman who was used to justify impeachment by the Dems because he was spying on a phone conversation trump was having? Whose brother ran for office in Northern VA and won? permalink parent award report block reply RagnarD 1 points 2 days ago Quite the coincidence, isn't it? permalink parent award report block reply Trooph-Hurts 1 points 2 days ago I guess I didn’t know that Vindman was Ukrainian!….. But it’s a full circle… All the important processors and 2020 that were being shuttled around to all of these different riot sites where Ukrainian…. The forces that were used in Australia to beat up, the population were also Ukrainian. They did it because they sort of blend and they look Caucasian Automatically their English or American or Australian, but they’re just radical Marxist Who want to overthrow our country and actually did…. Stealing the 2020 election was an illegal takeover of our government permalink parent award report block reply\nTrumpAndGodWin 8 points 3 days ago And why is that cop masked when the Democrats pretend to be against it on ICE. permalink parent award report block reply\nPayasyougo 4 points 3 days ago WAIT SHE IS Ukrainian? Just like that fuck Vindman who was used to justify impeachment by the Dems because he was spying on a phone conversation trump was having? Whose brother ran for office in Northern VA and won? permalink parent award report block reply RagnarD 1 points 2 days ago Quite the coincidence, isn't it? permalink parent award report block reply Trooph-Hurts 1 points 2 days ago I guess I didn’t know that Vindman was Ukrainian!….. But it’s a full circle… All the important processors and 2020 that were being shuttled around to all of these different riot sites where Ukrainian…. The forces that were used in Australia to beat up, the population were also Ukrainian. They did it because they sort of blend and they look Caucasian Automatically their English or American or Australian, but they’re just radical Marxist Who want to overthrow our country and actually did…. Stealing the 2020 election was an illegal takeover of our government permalink parent award report block reply\nRagnarD 1 points 2 days ago Quite the coincidence, isn't it? permalink parent award report block reply\nTrooph-Hurts 1 points 2 days ago I guess I didn’t know that Vindman was Ukrainian!….. But it’s a full circle… All the important processors and 2020 that were being shuttled around to all of these different riot sites where Ukrainian…. The forces that were used in Australia to beat up, the population were also Ukrainian. They did it because they sort of blend and they look Caucasian Automatically their English or American or Australian, but they’re just radical Marxist Who want to overthrow our country and actually did…. Stealing the 2020 election was an illegal takeover of our government permalink parent award report block reply\nPatriotSkorzeny 25 points 3 days ago The police fired upon the People. 📜 permalink award report block reply helenlisawhite 10 points 3 days ago I was there that is very true. Fortunately it was very windy that day so their tear gas had little to no effect. God was on the side of patriots !! permalink parent award report block reply chewsoap 7 points 3 days ago Back the blue hur dur permalink parent award report block reply\nhelenlisawhite 10 points 3 days ago I was there that is very true. Fortunately it was very windy that day so their tear gas had little to no effect. God was on the side of patriots !! permalink parent award report block reply\nchewsoap 7 points 3 days ago Back the blue hur dur permalink parent award report block reply\n_Sully_ 17 points 3 days ago Don't we have body cam footage of capitol police basically saying \"Ok they say it's time to start this\" and \"throw this in the crowd (referring to a tear gas canister) to get them riled-up\"? permalink award report block reply\nNSFW_PORN_ONLY 12 points 3 days ago It's always women. Started in Eden. They love the serpent. permalink award report block reply Lady_MaGa -5 points 3 days ago Men always lie.  Started in Eden.  Adam ate the apple first but when God's wrath came down the man blamed Eve.  And so it was written. permalink parent award report block reply TrumpAndGodWin 4 points 3 days ago Both lie e.g. older FBI statistics showing that women lied about rape around fifty percent of the time. permalink parent award report block reply Lady_MaGa 3 points 3 days ago And 90% of kiddie didlers are men. And to my first comment about Eden, you men haters/fake MAGA just to divide us people, couldn't even see I was returning a questionable answer to a stupid comment that was made. permalink parent award report block reply IForgotToAddAnEmail 3 points 3 days ago Incorrect. Bet women aren't looked at enough in the education depart with teachers sleeping with students. Let's add the knowingly false accusations women love to do. Women are the biggest contributors to Infanticide. < This is a fact. Do not try and argue with emotions, woman. All are sinners in truth though. permalink parent award report block reply view 6 more comments... 2Fangz 2 points 3 days ago Fuck off, bitch. permalink parent award report block reply\nLady_MaGa -5 points 3 days ago Men always lie.  Started in Eden.  Adam ate the apple first but when God's wrath came down the man blamed Eve.  And so it was written. permalink parent award report block reply TrumpAndGodWin 4 points 3 days ago Both lie e.g. older FBI statistics showing that women lied about rape around fifty percent of the time. permalink parent award report block reply Lady_MaGa 3 points 3 days ago And 90% of kiddie didlers are men. And to my first comment about Eden, you men haters/fake MAGA just to divide us people, couldn't even see I was returning a questionable answer to a stupid comment that was made. permalink parent award report block reply IForgotToAddAnEmail 3 points 3 days ago Incorrect. Bet women aren't looked at enough in the education depart with teachers sleeping with students. Let's add the knowingly false accusations women love to do. Women are the biggest contributors to Infanticide. < This is a fact. Do not try and argue with emotions, woman. All are sinners in truth though. permalink parent award report block reply view 6 more comments... 2Fangz 2 points 3 days ago Fuck off, bitch. permalink parent award report block reply\nTrumpAndGodWin 4 points 3 days ago Both lie e.g. older FBI statistics showing that women lied about rape around fifty percent of the time. permalink parent award report block reply Lady_MaGa 3 points 3 days ago And 90% of kiddie didlers are men. And to my first comment about Eden, you men haters/fake MAGA just to divide us people, couldn't even see I was returning a questionable answer to a stupid comment that was made. permalink parent award report block reply IForgotToAddAnEmail 3 points 3 days ago Incorrect. Bet women aren't looked at enough in the education depart with teachers sleeping with students. Let's add the knowingly false accusations women love to do. Women are the biggest contributors to Infanticide. < This is a fact. Do not try and argue with emotions, woman. All are sinners in truth though. permalink parent award report block reply view 6 more comments...\nLady_MaGa 3 points 3 days ago And 90% of kiddie didlers are men. And to my first comment about Eden, you men haters/fake MAGA just to divide us people, couldn't even see I was returning a questionable answer to a stupid comment that was made. permalink parent award report block reply IForgotToAddAnEmail 3 points 3 days ago Incorrect. Bet women aren't looked at enough in the education depart with teachers sleeping with students. Let's add the knowingly false accusations women love to do. Women are the biggest contributors to Infanticide. < This is a fact. Do not try and argue with emotions, woman. All are sinners in truth though. permalink parent award report block reply view 6 more comments...\nIForgotToAddAnEmail 3 points 3 days ago Incorrect. Bet women aren't looked at enough in the education depart with teachers sleeping with students. Let's add the knowingly false accusations women love to do. Women are the biggest contributors to Infanticide. < This is a fact. Do not try and argue with emotions, woman. All are sinners in truth though. permalink parent award report block reply view 6 more comments...\n2Fangz 2 points 3 days ago Fuck off, bitch. permalink parent award report block reply\nNomad899 11 points 3 days ago Them had xer orders permalink award report block reply\nloooooof 7 points 3 days ago Lol... Jan. 6 'PlPEB0MBER'... Master of evasion . permalink award report block reply\nrealsolidsnakeoil 6 points 3 days ago And the rabbit hole goes deeper still. permalink award report block reply\nBillbuttlickerr 6 points 3 days ago Liberal white woman. Short hair. Probably a dyke. The satire writes itself. permalink award report block reply Nibba2 3 points 3 days ago Probably lmao. Did you see her? permalink parent award report block reply\nNibba2 3 points 3 days ago Probably lmao. Did you see her? permalink parent award report block reply\nSALTYinSeattle OP 5 points 3 days ago https://x.com/RaheemKassam/status/1987576600855224560 permalink award report block reply\nTurboMAGA 3 points 3 days ago Capital punishment for her is deserved. permalink award report block reply\nMaga305_47 3 points 3 days ago Muh pensions… permalink award report block reply\nAmericanHeroSandwich 3 points 3 days ago I want a guillotine on the White House lawn permalink award report block reply\nAwShitHereWeGoAgain 2 points 3 days ago Hang that bitch. permalink award report block reply\nDoritalos 1 points 2 days ago Sentence her to a 50 year mortgage permalink award report block reply\nRagnarD 1 points 2 days ago It wouldn't surprise me, but all bull dyke cops look the same so it's hard to tell from the image. permalink award report block reply"}