{"id": "1ARK9k0ANv", "contents": "1208 Do these people even hear themselves?! 💩   SHITPOST   💩 posted 1 day ago by sebster 141 comments award share download report block\n141 comments Sort by Top Top New Worst Old Save SHILL_DETECTOR 200 points 1 day ago RayCist Man  lol *its parody guys permalink award report block reply White-tailed_Eagle 45 points 1 day ago Ah, I did not see that at first. But I imagine there are some EBT recipiants who think this way. permalink parent award report block reply Rydanovich 28 points 1 day ago There genuinely are. The homeless camp where I live is packed with them. permalink parent award report block reply mikethemarine 9 points 1 day ago see, they even think they deserve to eat for free, Try getting a job and buying it at the grocery store like the rest of us have to and also want to. Nothing in this world is free, so when you commit a crime and steal it, you have to pay for it with your time in prison, your payment becomes time in your life which can NEVER be recovered. permalink parent award report block reply The_Return_of_User_x 4 points 1 day ago EBT was used as reparations. Slave boat times are over. No one alive today was ever a slave. Go to work. permalink parent award report block reply view 1 more comments... TrumpsBigBalls 2 points 1 day ago How people didn't instantly know this was parady is pretty scary yet telling about many on our side and it's embarrasing at times. permalink parent award report block reply view 1 more comments... Standingoak 1 points 1 day ago Animals just following their training.  Remove our trainers , then train them without the hearts of EVIL in our current trainers. permalink parent award report block reply view 2 more comments... BaldyGull 5 points 1 day ago By homeless camp, do you mean the cities of Portland or San Francisco, or like you actually live in a tent somewhere? permalink parent award report block reply Rydanovich 2 points 1 day ago I don't. I was homeless a couple years back. The homeless camp is little more than a section of land the city set out for people to legally tent down. Previously they were set up beneath the overpass, but the department of transportation took issue with it, so they were made to move. I didn't stay like that. First thing I did was hit the streets for job options, got working, filed with the housing authority, got an apartment. permalink parent award report block reply view 2 more comments... deleted 2 points 1 day ago Rydanovich 2 points 1 day ago I was homeless a couple years back. I'm not currently. permalink parent award report block reply TXPatriot_73 10 points 1 day ago I imagine it's the same reason they think white people don't season their food. permalink parent award report block reply lul_cheto 3 points 1 day ago Yeh, tell a French, Spanish or Italian person they dont know how to season their food.. see how that works out. permalink parent award report block reply 4444444444444 2 points 1 day ago That's an old boomer thing.  All my boomer family eats things bland as fuck.   And way over cooked. permalink parent award report block reply BaldyGull 3 points 1 day ago That is a bad cooking thing. I know some old people that cook great. My parents think season salt is a little too razzle dazzle for most dishes, and think boiling is an acceptable way to cook chicken breast, even if you aren't shredding it. permalink parent award report block reply view 4 more comments... RetardIsMyMiddleName 3 points 1 day ago So when faced with a lie, instead of admitting to yourself you got fooled, you decide to make up a story about how the lie may still be real... permalink parent award report block reply White-tailed_Eagle 1 points 1 day ago What? I do not live in the US but imagine there are some people who have been on EBT for a long time. Some of those people would have no plans to get  off EBT so would be looking for other welfare to keep their (parasitic) lifestyle. I did think the twitter account was real at first until I reread it. I am just assuming that out of the millions of  people on EBT right now, some of them just watnt the government to feed them forever. But who knows, maybe I am wrong and 100% of EBT recepients are people who genuinly need it and will leave the program when they no longer need it. permalink parent award report block reply minttea2 2 points 1 day ago https://x.com/TheOnlyDSC/status/1988066729797546429 permalink parent award report block reply patrioticwinning3 -2 points 1 day ago He's a Reverend too!  This guy is telling Church goers this shit! permalink parent award report block reply deleted 11 points 1 day ago Region 8 points 1 day ago I don’t know how much experience you have being around ghetto blacks, but this post was 100% believable. permalink parent award report block reply alfredbester 8 points 1 day ago Ha, I like the idea but a year is way too much. Maybe a little flair next to your screen name for a couple weeks. permalink parent award report block reply BaldyGull 6 points 1 day ago Dunce cap where the handshake gets displayed. permalink parent award report block reply CyanScales 4 points 1 day ago Parody Account 100% https://x.com/RevRayCistman permalink parent award report block reply Run_over_Antifa 3 points 1 day ago Just need Covered Income ;) permalink parent award report block reply DCSucks 1 points 1 day ago Parody, BUT millions agree. permalink parent award report block reply load 6 more comments... maverick202 61 points 1 day ago Parody account.. Read meltdown in the comments for some of his race baiting. It's hilarious. permalink award report block reply TheAftermath 25 points 1 day ago RayCist man. Good catch. permalink parent award report block reply DManthey 16 points 1 day ago Parody account, but the point still stands lol. permalink parent award report block reply TheAftermath 8 points 1 day ago Very true. permalink parent award report block reply maverick202 5 points 1 day ago 💯 permalink parent award report block reply snoopy3210 2 points 1 day ago Yep thanks to elon 8$ verification permalink parent award report block reply Raetchel 35 points 1 day ago as it should be i don't 'eat for free' you shouldn't eat at my table uninvited permalink award report block reply BlackCrimesMatter 12 points 1 day ago How dare you! They built tha cuntriiii n sheiiit. Their culcha is cancer. They glorify violence, theft, drugs, prostitution, welfare culture, scams, and hating whitey. A lot of them are also arguing that EBT is simply reparations that must be paid. Seriously, just look: https://patriots.win/p/1ARK0Q4JSS/so-glad-we-are-rewarding-these-w/c permalink parent award report block reply HunterBidensPC 6 points 1 day ago But ThATs rAciSt! permalink parent award report block reply skuts 18 points 1 day ago Why do you expect to eat for free, my Negro? permalink award report block reply jaeger 12 points 1 day ago Show me in the Constitution where it says we have to keep pets. permalink award report block reply Scot 11 points 1 day ago Rev \"racist man\".\nGood parody account. permalink award report block reply DarthEP 5 points 1 day ago The Greatest! permalink parent award report block reply monkadelic 2 points 1 day ago The sentence he wrote is absolute perfection.  I don't think we are giving enough credit to the genius behind it. permalink parent award report block reply AstroLonghorn 7 points 1 day ago The most holy reverend has spoken. His will be done 🙏 permalink award report block reply Mike_Hoxbigg 6 points 1 day ago Even though it's parody, statistically... permalink award report block reply Mount_10_ear 5 points 1 day ago Excuse me rev its White people with a capital W. permalink award report block reply YodaBannon 5 points 1 day ago programmed to depend on the government to feed you, sad.  and that goes for all races by the way, bunch of fucking losers in the US of A permalink award report block reply SavingPrivateGrace 5 points 1 day ago We need SNAP reform.  Thanks to the Schumer shutdown.  Looking forward to when the 20 hour work or volunteer requirements start. permalink award report block reply bratt 5 points 1 day ago No. I'd prefer that criminals pay all the expenses of their incarceration. If not, they can try to work it off or they can sell some organs. permalink award report block reply Greenhills 5 points 1 day ago Gross. permalink award report block reply YoopersGodsCountry 4 points 1 day ago NO SUCH THING AS A FREE LUNCH DARKIE permalink award report block reply DingleBalls 4 points 1 day ago Or, maybe stop thinking you should \"eat for free\"? The S in SNAP stands for SUPPLEMENTAL. Meaning, you are using it to SUPPLEMENT the fact your current income from the JOB you're supposed to have, doesn't cover enough for you to meet nutritional needs for you or your family. Its not a \"eat free for life\" card. permalink award report block reply HumblePepe 3 points 1 day ago This is a fun parody account. permalink award report block reply Eros789 3 points 1 day ago Reverend Ray Cistman? Clicks follow permalink award report block reply RetardIsMyMiddleName 3 points 1 day ago It's a parody account... permalink award report block reply LostElf 3 points 1 day ago Rev Ray strikes again. Like Babylon Bee, 100% plausible. The stupidity and victim pride is all over the place. permalink award report block reply RealmanPwns 3 points 1 day ago Yeah Rev Ray-Cist Man permalink award report block reply Schweddynadzbackup 3 points 1 day ago I love that parody account. Some real bangers! permalink award report block reply buckeyeminuteman 2 points 1 day ago From the picture, the prison staff member serving the food is also black. That alone makes this argument absurd. permalink award report block reply SnowSnake 2 points 1 day ago Your terms are acceptable. permalink award report block reply I_Love_45-70_Gov 2 points 1 day ago I was expecting one to get a job. I guess serving prison food to your fellow inmates is, ttechnically, a job. permalink award report block reply Feddny 2 points 1 day ago Parody my man permalink award report block reply GodIsPerfect 2 points 1 day ago Nope. We expect you to work in there. Nothing is free. permalink award report block reply greatishthen 2 points 1 day ago Even animals in nature don't 'eat for free' they WORK. Every living being MUST WORK. Otherwise they are useless to nature and there is nothing more that 'nature' hates. permalink award report block reply HoganP 2 points 1 day ago I wasn't aware anyone was supposed to eat for free. permalink award report block reply Michalusmichalus 2 points 1 day ago Kids. That used to be a tag line at restaurants. Kids eat free. It was a sad day for my wallet when my kids didn't want kids meals. permalink parent award report block reply HoganP 2 points 1 day ago Ha. I'll eat a bunch of hotdogs and nugs if they are free. permalink parent award report block reply Michalusmichalus 2 points 1 day ago IKR?! As if that's not what they wanted if they were at home. permalink parent award report block reply RobinNet 2 points 1 day ago Works for me. In El Salvador- right? permalink award report block reply MAGABOND 2 points 1 day ago How do I, as a White man eat for free? permalink award report block reply Lol_Garrus 2 points 1 day ago Parody account permalink award report block reply PhantomShield72 2 points 1 day ago Parody?  Yes. Terms Acceptable?  Yes. permalink award report block reply vongregormench 2 points 1 day ago READ THE NAME permalink award report block reply Crappydatum 2 points 1 day ago Raycist man🤣 permalink parent award report block reply knnbccb 2 points 1 day ago 'Reverend' with a clenched black fist emoji... that's a red flag. I consider black churches where most of the preaching is about fighting back against 'the white man's oppression' are no less dangerous than mosques. Watchlist-worthy. permalink award report block reply Crappydatum 1 points 1 day ago Dude, what's his name? Say it out loud permalink parent award report block reply yarg 2 points 1 day ago One of the more obvious trolls. permalink award report block reply JoeBidensDementia1 2 points 1 day ago I'd expect that 2% of you wouldn't commit 54% of crime. But what do I know? permalink award report block reply BigIgloo 2 points 1 day ago Boomers cannot detect satire permalink award report block reply Ryan282 2 points 22 hours ago I've noticed this a lot. permalink parent award report block reply VanDeKoik 1 points 1 day ago You are a pastor. Spend less in flashy suits and that Cadillac, and have the sisters make meals for your congregation. And that goes for the mega churches in the burbs too! permalink award report block reply MOLON-LABE 1 points 1 day ago Well, its kind of true. permalink award report block reply Getelectedordietryin 1 points 1 day ago He’s right though permalink award report block reply Trad_Americans_Only 1 points 21 hours ago 3 hots and a cot. Then a free boat ride to Liberia permalink award report block reply bluntedaffect 1 points 1 day ago Terms: Acceptable permalink award report block reply GreyKnight 1 points 1 day ago That’s one way to say they have a high violent crime rate while letting it seem like a parody even though many might not notice and believe it… permalink award report block reply ImpressiveTriceps 1 points 1 day ago That's the moderate solution permalink award report block reply heavyD 1 points 1 day ago Correct, thats where we expect you will eventually be. permalink award report block reply Pappy_Gunn 1 points 1 day ago It's spelled whypipo permalink award report block reply patrioticwinning3 1 points 1 day ago ....Words escape me XD permalink award report block reply OmegaBird 1 points 1 day ago Very telling that a back man would confirm crime is their only option. Rather than getting a job. permalink award report block reply MisprisionIsEvil 1 points 22 hours ago Eating for free is a right? permalink award report block reply rebuildingMyself 1 points 1 day ago Could always get a fucking job, God forbid permalink award report block reply Steve56775 1 points 1 day ago Job? Their job is multiplying for future generations of takers. permalink parent award report block reply RedditStillSucks 1 points 1 day ago Why should you be able to eat for free? permalink award report block reply 181degrees 1 points 1 day ago My sympathy for blacks dried up decades ago permalink award report block reply Creepy_Joe 1 points 1 day ago Yes. permalink award report block reply Amway 1 points 1 day ago Some people know only know how to steal to eat, tap the government to eat, panhandle to eat and go to prison to eat. The rest of us just work to eat. permalink award report block reply 16BeatsAOne 1 points 1 day ago Eventually, you will . . . permalink award report block reply JanxyJet 1 points 1 day ago Hints too much at self-awareness to not be a meme. True, though. permalink award report block reply Sunnybats2 1 points 1 day ago It's called a FOOD BANK permalink award report block reply EastTexasMadLad 1 points 1 day ago Yes, exactly permalink award report block reply Smurfection 1 points 1 day ago Being poor isn't a crime.  Most poor people aren't criminals ,except for illegal alien invaders. Are blacks who actually don't commit crimes ever going to get sick of lefty black leaders assuming all blacks are criminals? permalink award report block reply Crappydatum 1 points 1 day ago Why should they eat for free again? permalink award report block reply johnfist2 1 points 1 day ago The irony that he doesn't see it, is disgusting.  Leeches. permalink award report block reply WeaponizedSmirk 2 points 1 day ago Hey man, read his name again. Slowly, out loud. permalink parent award report block reply TearsAficionado 1 points 1 day ago Lol with two black prisoners in the background...being served by gloved black hands. Checks out. Kek. permalink award report block reply HKFan 1 points 1 day ago Tbh it’s not a bad idea to just lock them all up and let them out after they’ve proven they can behave permalink award report block reply MegoThor 1 points 1 day ago Relatives on the outside should have to pay for prisoner’s meals instead of taxpayers. permalink award report block reply DontTreadOnLego 1 points 1 day ago And slave labor called prison labor :D permalink award report block reply PearlyGaits57 1 points 1 day ago Looks like all four food groups are represented. Bonappetite! permalink award report block reply Kael 1 points 1 day ago I prefer the worms eat for free permalink award report block reply Cop-Morty 1 points 1 day ago I don't want to be racists. I say, we stop feeding prisoners  too. permalink award report block reply cptkloss5 1 points 1 day ago i don't want you to eat at all, unless you work for it permalink award report block reply fullpotato1776 1 points 1 day ago That's the real Soul Food permalink award report block reply johnparker 1 points 1 day ago Why do you get to eat for free? permalink award report block reply Easzq8 1 points 1 day ago Quoth Jim Carrey, “STOP BREAKING THE LAW ASSHOLE!” permalink award report block reply rivetjoint2 1 points 1 day ago Why should anyone eat for free? permalink award report block reply TooBright 1 points 1 day ago Someone yearns for some chains and everything provided for them again. permalink award report block reply Trump454748 1 points 1 day ago Fuck off, I don’t eat for free. permalink award report block reply South_Florida_Guy -1 points 1 day ago Get a fucking job! permalink award report block reply Michalusmichalus -3 points 1 day ago The man has Reverend in his name. I do not fault a Reverend for thinking like Jesus. permalink award report block reply\nSHILL_DETECTOR 200 points 1 day ago RayCist Man  lol *its parody guys permalink award report block reply White-tailed_Eagle 45 points 1 day ago Ah, I did not see that at first. But I imagine there are some EBT recipiants who think this way. permalink parent award report block reply Rydanovich 28 points 1 day ago There genuinely are. The homeless camp where I live is packed with them. permalink parent award report block reply mikethemarine 9 points 1 day ago see, they even think they deserve to eat for free, Try getting a job and buying it at the grocery store like the rest of us have to and also want to. Nothing in this world is free, so when you commit a crime and steal it, you have to pay for it with your time in prison, your payment becomes time in your life which can NEVER be recovered. permalink parent award report block reply The_Return_of_User_x 4 points 1 day ago EBT was used as reparations. Slave boat times are over. No one alive today was ever a slave. Go to work. permalink parent award report block reply view 1 more comments... TrumpsBigBalls 2 points 1 day ago How people didn't instantly know this was parady is pretty scary yet telling about many on our side and it's embarrasing at times. permalink parent award report block reply view 1 more comments... Standingoak 1 points 1 day ago Animals just following their training.  Remove our trainers , then train them without the hearts of EVIL in our current trainers. permalink parent award report block reply view 2 more comments... BaldyGull 5 points 1 day ago By homeless camp, do you mean the cities of Portland or San Francisco, or like you actually live in a tent somewhere? permalink parent award report block reply Rydanovich 2 points 1 day ago I don't. I was homeless a couple years back. The homeless camp is little more than a section of land the city set out for people to legally tent down. Previously they were set up beneath the overpass, but the department of transportation took issue with it, so they were made to move. I didn't stay like that. First thing I did was hit the streets for job options, got working, filed with the housing authority, got an apartment. permalink parent award report block reply view 2 more comments... deleted 2 points 1 day ago Rydanovich 2 points 1 day ago I was homeless a couple years back. I'm not currently. permalink parent award report block reply TXPatriot_73 10 points 1 day ago I imagine it's the same reason they think white people don't season their food. permalink parent award report block reply lul_cheto 3 points 1 day ago Yeh, tell a French, Spanish or Italian person they dont know how to season their food.. see how that works out. permalink parent award report block reply 4444444444444 2 points 1 day ago That's an old boomer thing.  All my boomer family eats things bland as fuck.   And way over cooked. permalink parent award report block reply BaldyGull 3 points 1 day ago That is a bad cooking thing. I know some old people that cook great. My parents think season salt is a little too razzle dazzle for most dishes, and think boiling is an acceptable way to cook chicken breast, even if you aren't shredding it. permalink parent award report block reply view 4 more comments... RetardIsMyMiddleName 3 points 1 day ago So when faced with a lie, instead of admitting to yourself you got fooled, you decide to make up a story about how the lie may still be real... permalink parent award report block reply White-tailed_Eagle 1 points 1 day ago What? I do not live in the US but imagine there are some people who have been on EBT for a long time. Some of those people would have no plans to get  off EBT so would be looking for other welfare to keep their (parasitic) lifestyle. I did think the twitter account was real at first until I reread it. I am just assuming that out of the millions of  people on EBT right now, some of them just watnt the government to feed them forever. But who knows, maybe I am wrong and 100% of EBT recepients are people who genuinly need it and will leave the program when they no longer need it. permalink parent award report block reply minttea2 2 points 1 day ago https://x.com/TheOnlyDSC/status/1988066729797546429 permalink parent award report block reply patrioticwinning3 -2 points 1 day ago He's a Reverend too!  This guy is telling Church goers this shit! permalink parent award report block reply deleted 11 points 1 day ago Region 8 points 1 day ago I don’t know how much experience you have being around ghetto blacks, but this post was 100% believable. permalink parent award report block reply alfredbester 8 points 1 day ago Ha, I like the idea but a year is way too much. Maybe a little flair next to your screen name for a couple weeks. permalink parent award report block reply BaldyGull 6 points 1 day ago Dunce cap where the handshake gets displayed. permalink parent award report block reply CyanScales 4 points 1 day ago Parody Account 100% https://x.com/RevRayCistman permalink parent award report block reply Run_over_Antifa 3 points 1 day ago Just need Covered Income ;) permalink parent award report block reply DCSucks 1 points 1 day ago Parody, BUT millions agree. permalink parent award report block reply load 6 more comments...\nWhite-tailed_Eagle 45 points 1 day ago Ah, I did not see that at first. But I imagine there are some EBT recipiants who think this way. permalink parent award report block reply Rydanovich 28 points 1 day ago There genuinely are. The homeless camp where I live is packed with them. permalink parent award report block reply mikethemarine 9 points 1 day ago see, they even think they deserve to eat for free, Try getting a job and buying it at the grocery store like the rest of us have to and also want to. Nothing in this world is free, so when you commit a crime and steal it, you have to pay for it with your time in prison, your payment becomes time in your life which can NEVER be recovered. permalink parent award report block reply The_Return_of_User_x 4 points 1 day ago EBT was used as reparations. Slave boat times are over. No one alive today was ever a slave. Go to work. permalink parent award report block reply view 1 more comments... TrumpsBigBalls 2 points 1 day ago How people didn't instantly know this was parady is pretty scary yet telling about many on our side and it's embarrasing at times. permalink parent award report block reply view 1 more comments... Standingoak 1 points 1 day ago Animals just following their training.  Remove our trainers , then train them without the hearts of EVIL in our current trainers. permalink parent award report block reply view 2 more comments... BaldyGull 5 points 1 day ago By homeless camp, do you mean the cities of Portland or San Francisco, or like you actually live in a tent somewhere? permalink parent award report block reply Rydanovich 2 points 1 day ago I don't. I was homeless a couple years back. The homeless camp is little more than a section of land the city set out for people to legally tent down. Previously they were set up beneath the overpass, but the department of transportation took issue with it, so they were made to move. I didn't stay like that. First thing I did was hit the streets for job options, got working, filed with the housing authority, got an apartment. permalink parent award report block reply view 2 more comments... deleted 2 points 1 day ago Rydanovich 2 points 1 day ago I was homeless a couple years back. I'm not currently. permalink parent award report block reply TXPatriot_73 10 points 1 day ago I imagine it's the same reason they think white people don't season their food. permalink parent award report block reply lul_cheto 3 points 1 day ago Yeh, tell a French, Spanish or Italian person they dont know how to season their food.. see how that works out. permalink parent award report block reply 4444444444444 2 points 1 day ago That's an old boomer thing.  All my boomer family eats things bland as fuck.   And way over cooked. permalink parent award report block reply BaldyGull 3 points 1 day ago That is a bad cooking thing. I know some old people that cook great. My parents think season salt is a little too razzle dazzle for most dishes, and think boiling is an acceptable way to cook chicken breast, even if you aren't shredding it. permalink parent award report block reply view 4 more comments... RetardIsMyMiddleName 3 points 1 day ago So when faced with a lie, instead of admitting to yourself you got fooled, you decide to make up a story about how the lie may still be real... permalink parent award report block reply White-tailed_Eagle 1 points 1 day ago What? I do not live in the US but imagine there are some people who have been on EBT for a long time. Some of those people would have no plans to get  off EBT so would be looking for other welfare to keep their (parasitic) lifestyle. I did think the twitter account was real at first until I reread it. I am just assuming that out of the millions of  people on EBT right now, some of them just watnt the government to feed them forever. But who knows, maybe I am wrong and 100% of EBT recepients are people who genuinly need it and will leave the program when they no longer need it. permalink parent award report block reply minttea2 2 points 1 day ago https://x.com/TheOnlyDSC/status/1988066729797546429 permalink parent award report block reply patrioticwinning3 -2 points 1 day ago He's a Reverend too!  This guy is telling Church goers this shit! permalink parent award report block reply\nRydanovich 28 points 1 day ago There genuinely are. The homeless camp where I live is packed with them. permalink parent award report block reply mikethemarine 9 points 1 day ago see, they even think they deserve to eat for free, Try getting a job and buying it at the grocery store like the rest of us have to and also want to. Nothing in this world is free, so when you commit a crime and steal it, you have to pay for it with your time in prison, your payment becomes time in your life which can NEVER be recovered. permalink parent award report block reply The_Return_of_User_x 4 points 1 day ago EBT was used as reparations. Slave boat times are over. No one alive today was ever a slave. Go to work. permalink parent award report block reply view 1 more comments... TrumpsBigBalls 2 points 1 day ago How people didn't instantly know this was parady is pretty scary yet telling about many on our side and it's embarrasing at times. permalink parent award report block reply view 1 more comments... Standingoak 1 points 1 day ago Animals just following their training.  Remove our trainers , then train them without the hearts of EVIL in our current trainers. permalink parent award report block reply view 2 more comments... BaldyGull 5 points 1 day ago By homeless camp, do you mean the cities of Portland or San Francisco, or like you actually live in a tent somewhere? permalink parent award report block reply Rydanovich 2 points 1 day ago I don't. I was homeless a couple years back. The homeless camp is little more than a section of land the city set out for people to legally tent down. Previously they were set up beneath the overpass, but the department of transportation took issue with it, so they were made to move. I didn't stay like that. First thing I did was hit the streets for job options, got working, filed with the housing authority, got an apartment. permalink parent award report block reply view 2 more comments... deleted 2 points 1 day ago Rydanovich 2 points 1 day ago I was homeless a couple years back. I'm not currently. permalink parent award report block reply\nmikethemarine 9 points 1 day ago see, they even think they deserve to eat for free, Try getting a job and buying it at the grocery store like the rest of us have to and also want to. Nothing in this world is free, so when you commit a crime and steal it, you have to pay for it with your time in prison, your payment becomes time in your life which can NEVER be recovered. permalink parent award report block reply The_Return_of_User_x 4 points 1 day ago EBT was used as reparations. Slave boat times are over. No one alive today was ever a slave. Go to work. permalink parent award report block reply view 1 more comments... TrumpsBigBalls 2 points 1 day ago How people didn't instantly know this was parady is pretty scary yet telling about many on our side and it's embarrasing at times. permalink parent award report block reply view 1 more comments... Standingoak 1 points 1 day ago Animals just following their training.  Remove our trainers , then train them without the hearts of EVIL in our current trainers. permalink parent award report block reply view 2 more comments...\nThe_Return_of_User_x 4 points 1 day ago EBT was used as reparations. Slave boat times are over. No one alive today was ever a slave. Go to work. permalink parent award report block reply view 1 more comments...\nTrumpsBigBalls 2 points 1 day ago How people didn't instantly know this was parady is pretty scary yet telling about many on our side and it's embarrasing at times. permalink parent award report block reply view 1 more comments...\nStandingoak 1 points 1 day ago Animals just following their training.  Remove our trainers , then train them without the hearts of EVIL in our current trainers. permalink parent award report block reply view 2 more comments...\nBaldyGull 5 points 1 day ago By homeless camp, do you mean the cities of Portland or San Francisco, or like you actually live in a tent somewhere? permalink parent award report block reply Rydanovich 2 points 1 day ago I don't. I was homeless a couple years back. The homeless camp is little more than a section of land the city set out for people to legally tent down. Previously they were set up beneath the overpass, but the department of transportation took issue with it, so they were made to move. I didn't stay like that. First thing I did was hit the streets for job options, got working, filed with the housing authority, got an apartment. permalink parent award report block reply view 2 more comments...\nRydanovich 2 points 1 day ago I don't. I was homeless a couple years back. The homeless camp is little more than a section of land the city set out for people to legally tent down. Previously they were set up beneath the overpass, but the department of transportation took issue with it, so they were made to move. I didn't stay like that. First thing I did was hit the streets for job options, got working, filed with the housing authority, got an apartment. permalink parent award report block reply view 2 more comments...\ndeleted 2 points 1 day ago Rydanovich 2 points 1 day ago I was homeless a couple years back. I'm not currently. permalink parent award report block reply\nRydanovich 2 points 1 day ago I was homeless a couple years back. I'm not currently. permalink parent award report block reply\nTXPatriot_73 10 points 1 day ago I imagine it's the same reason they think white people don't season their food. permalink parent award report block reply lul_cheto 3 points 1 day ago Yeh, tell a French, Spanish or Italian person they dont know how to season their food.. see how that works out. permalink parent award report block reply 4444444444444 2 points 1 day ago That's an old boomer thing.  All my boomer family eats things bland as fuck.   And way over cooked. permalink parent award report block reply BaldyGull 3 points 1 day ago That is a bad cooking thing. I know some old people that cook great. My parents think season salt is a little too razzle dazzle for most dishes, and think boiling is an acceptable way to cook chicken breast, even if you aren't shredding it. permalink parent award report block reply view 4 more comments...\nlul_cheto 3 points 1 day ago Yeh, tell a French, Spanish or Italian person they dont know how to season their food.. see how that works out. permalink parent award report block reply\n4444444444444 2 points 1 day ago That's an old boomer thing.  All my boomer family eats things bland as fuck.   And way over cooked. permalink parent award report block reply BaldyGull 3 points 1 day ago That is a bad cooking thing. I know some old people that cook great. My parents think season salt is a little too razzle dazzle for most dishes, and think boiling is an acceptable way to cook chicken breast, even if you aren't shredding it. permalink parent award report block reply view 4 more comments...\nBaldyGull 3 points 1 day ago That is a bad cooking thing. I know some old people that cook great. My parents think season salt is a little too razzle dazzle for most dishes, and think boiling is an acceptable way to cook chicken breast, even if you aren't shredding it. permalink parent award report block reply view 4 more comments...\nRetardIsMyMiddleName 3 points 1 day ago So when faced with a lie, instead of admitting to yourself you got fooled, you decide to make up a story about how the lie may still be real... permalink parent award report block reply White-tailed_Eagle 1 points 1 day ago What? I do not live in the US but imagine there are some people who have been on EBT for a long time. Some of those people would have no plans to get  off EBT so would be looking for other welfare to keep their (parasitic) lifestyle. I did think the twitter account was real at first until I reread it. I am just assuming that out of the millions of  people on EBT right now, some of them just watnt the government to feed them forever. But who knows, maybe I am wrong and 100% of EBT recepients are people who genuinly need it and will leave the program when they no longer need it. permalink parent award report block reply\nWhite-tailed_Eagle 1 points 1 day ago What? I do not live in the US but imagine there are some people who have been on EBT for a long time. Some of those people would have no plans to get  off EBT so would be looking for other welfare to keep their (parasitic) lifestyle. I did think the twitter account was real at first until I reread it. I am just assuming that out of the millions of  people on EBT right now, some of them just watnt the government to feed them forever. But who knows, maybe I am wrong and 100% of EBT recepients are people who genuinly need it and will leave the program when they no longer need it. permalink parent award report block reply\nminttea2 2 points 1 day ago https://x.com/TheOnlyDSC/status/1988066729797546429 permalink parent award report block reply\npatrioticwinning3 -2 points 1 day ago He's a Reverend too!  This guy is telling Church goers this shit! permalink parent award report block reply\ndeleted 11 points 1 day ago Region 8 points 1 day ago I don’t know how much experience you have being around ghetto blacks, but this post was 100% believable. permalink parent award report block reply alfredbester 8 points 1 day ago Ha, I like the idea but a year is way too much. Maybe a little flair next to your screen name for a couple weeks. permalink parent award report block reply BaldyGull 6 points 1 day ago Dunce cap where the handshake gets displayed. permalink parent award report block reply\nRegion 8 points 1 day ago I don’t know how much experience you have being around ghetto blacks, but this post was 100% believable. permalink parent award report block reply\nalfredbester 8 points 1 day ago Ha, I like the idea but a year is way too much. Maybe a little flair next to your screen name for a couple weeks. permalink parent award report block reply BaldyGull 6 points 1 day ago Dunce cap where the handshake gets displayed. permalink parent award report block reply\nBaldyGull 6 points 1 day ago Dunce cap where the handshake gets displayed. permalink parent award report block reply\nCyanScales 4 points 1 day ago Parody Account 100% https://x.com/RevRayCistman permalink parent award report block reply\nRun_over_Antifa 3 points 1 day ago Just need Covered Income ;) permalink parent award report block reply\nDCSucks 1 points 1 day ago Parody, BUT millions agree. permalink parent award report block reply\nmaverick202 61 points 1 day ago Parody account.. Read meltdown in the comments for some of his race baiting. It's hilarious. permalink award report block reply TheAftermath 25 points 1 day ago RayCist man. Good catch. permalink parent award report block reply DManthey 16 points 1 day ago Parody account, but the point still stands lol. permalink parent award report block reply TheAftermath 8 points 1 day ago Very true. permalink parent award report block reply maverick202 5 points 1 day ago 💯 permalink parent award report block reply snoopy3210 2 points 1 day ago Yep thanks to elon 8$ verification permalink parent award report block reply\nTheAftermath 25 points 1 day ago RayCist man. Good catch. permalink parent award report block reply\nDManthey 16 points 1 day ago Parody account, but the point still stands lol. permalink parent award report block reply TheAftermath 8 points 1 day ago Very true. permalink parent award report block reply maverick202 5 points 1 day ago 💯 permalink parent award report block reply\nTheAftermath 8 points 1 day ago Very true. permalink parent award report block reply\nmaverick202 5 points 1 day ago 💯 permalink parent award report block reply\nsnoopy3210 2 points 1 day ago Yep thanks to elon 8$ verification permalink parent award report block reply\nRaetchel 35 points 1 day ago as it should be i don't 'eat for free' you shouldn't eat at my table uninvited permalink award report block reply BlackCrimesMatter 12 points 1 day ago How dare you! They built tha cuntriiii n sheiiit. Their culcha is cancer. They glorify violence, theft, drugs, prostitution, welfare culture, scams, and hating whitey. A lot of them are also arguing that EBT is simply reparations that must be paid. Seriously, just look: https://patriots.win/p/1ARK0Q4JSS/so-glad-we-are-rewarding-these-w/c permalink parent award report block reply HunterBidensPC 6 points 1 day ago But ThATs rAciSt! permalink parent award report block reply\nBlackCrimesMatter 12 points 1 day ago How dare you! They built tha cuntriiii n sheiiit. Their culcha is cancer. They glorify violence, theft, drugs, prostitution, welfare culture, scams, and hating whitey. A lot of them are also arguing that EBT is simply reparations that must be paid. Seriously, just look: https://patriots.win/p/1ARK0Q4JSS/so-glad-we-are-rewarding-these-w/c permalink parent award report block reply\nHunterBidensPC 6 points 1 day ago But ThATs rAciSt! permalink parent award report block reply\nskuts 18 points 1 day ago Why do you expect to eat for free, my Negro? permalink award report block reply\njaeger 12 points 1 day ago Show me in the Constitution where it says we have to keep pets. permalink award report block reply\nScot 11 points 1 day ago Rev \"racist man\".\nGood parody account. permalink award report block reply DarthEP 5 points 1 day ago The Greatest! permalink parent award report block reply monkadelic 2 points 1 day ago The sentence he wrote is absolute perfection.  I don't think we are giving enough credit to the genius behind it. permalink parent award report block reply\nDarthEP 5 points 1 day ago The Greatest! permalink parent award report block reply\nmonkadelic 2 points 1 day ago The sentence he wrote is absolute perfection.  I don't think we are giving enough credit to the genius behind it. permalink parent award report block reply\nAstroLonghorn 7 points 1 day ago The most holy reverend has spoken. His will be done 🙏 permalink award report block reply\nMike_Hoxbigg 6 points 1 day ago Even though it's parody, statistically... permalink award report block reply\nMount_10_ear 5 points 1 day ago Excuse me rev its White people with a capital W. permalink award report block reply\nYodaBannon 5 points 1 day ago programmed to depend on the government to feed you, sad.  and that goes for all races by the way, bunch of fucking losers in the US of A permalink award report block reply\nSavingPrivateGrace 5 points 1 day ago We need SNAP reform.  Thanks to the Schumer shutdown.  Looking forward to when the 20 hour work or volunteer requirements start. permalink award report block reply\nbratt 5 points 1 day ago No. I'd prefer that criminals pay all the expenses of their incarceration. If not, they can try to work it off or they can sell some organs. permalink award report block reply\nGreenhills 5 points 1 day ago Gross. permalink award report block reply\nYoopersGodsCountry 4 points 1 day ago NO SUCH THING AS A FREE LUNCH DARKIE permalink award report block reply\nDingleBalls 4 points 1 day ago Or, maybe stop thinking you should \"eat for free\"? The S in SNAP stands for SUPPLEMENTAL. Meaning, you are using it to SUPPLEMENT the fact your current income from the JOB you're supposed to have, doesn't cover enough for you to meet nutritional needs for you or your family. Its not a \"eat free for life\" card. permalink award report block reply\nHumblePepe 3 points 1 day ago This is a fun parody account. permalink award report block reply\nEros789 3 points 1 day ago Reverend Ray Cistman? Clicks follow permalink award report block reply\nRetardIsMyMiddleName 3 points 1 day ago It's a parody account... permalink award report block reply\nLostElf 3 points 1 day ago Rev Ray strikes again. Like Babylon Bee, 100% plausible. The stupidity and victim pride is all over the place. permalink award report block reply\nRealmanPwns 3 points 1 day ago Yeah Rev Ray-Cist Man permalink award report block reply\nSchweddynadzbackup 3 points 1 day ago I love that parody account. Some real bangers! permalink award report block reply\nbuckeyeminuteman 2 points 1 day ago From the picture, the prison staff member serving the food is also black. That alone makes this argument absurd. permalink award report block reply\nSnowSnake 2 points 1 day ago Your terms are acceptable. permalink award report block reply\nI_Love_45-70_Gov 2 points 1 day ago I was expecting one to get a job. I guess serving prison food to your fellow inmates is, ttechnically, a job. permalink award report block reply\nFeddny 2 points 1 day ago Parody my man permalink award report block reply\nGodIsPerfect 2 points 1 day ago Nope. We expect you to work in there. Nothing is free. permalink award report block reply\ngreatishthen 2 points 1 day ago Even animals in nature don't 'eat for free' they WORK. Every living being MUST WORK. Otherwise they are useless to nature and there is nothing more that 'nature' hates. permalink award report block reply\nHoganP 2 points 1 day ago I wasn't aware anyone was supposed to eat for free. permalink award report block reply Michalusmichalus 2 points 1 day ago Kids. That used to be a tag line at restaurants. Kids eat free. It was a sad day for my wallet when my kids didn't want kids meals. permalink parent award report block reply HoganP 2 points 1 day ago Ha. I'll eat a bunch of hotdogs and nugs if they are free. permalink parent award report block reply Michalusmichalus 2 points 1 day ago IKR?! As if that's not what they wanted if they were at home. permalink parent award report block reply\nMichalusmichalus 2 points 1 day ago Kids. That used to be a tag line at restaurants. Kids eat free. It was a sad day for my wallet when my kids didn't want kids meals. permalink parent award report block reply HoganP 2 points 1 day ago Ha. I'll eat a bunch of hotdogs and nugs if they are free. permalink parent award report block reply Michalusmichalus 2 points 1 day ago IKR?! As if that's not what they wanted if they were at home. permalink parent award report block reply\nHoganP 2 points 1 day ago Ha. I'll eat a bunch of hotdogs and nugs if they are free. permalink parent award report block reply Michalusmichalus 2 points 1 day ago IKR?! As if that's not what they wanted if they were at home. permalink parent award report block reply\nMichalusmichalus 2 points 1 day ago IKR?! As if that's not what they wanted if they were at home. permalink parent award report block reply\nRobinNet 2 points 1 day ago Works for me. In El Salvador- right? permalink award report block reply\nMAGABOND 2 points 1 day ago How do I, as a White man eat for free? permalink award report block reply\nLol_Garrus 2 points 1 day ago Parody account permalink award report block reply\nPhantomShield72 2 points 1 day ago Parody?  Yes. Terms Acceptable?  Yes. permalink award report block reply\nvongregormench 2 points 1 day ago READ THE NAME permalink award report block reply Crappydatum 2 points 1 day ago Raycist man🤣 permalink parent award report block reply\nCrappydatum 2 points 1 day ago Raycist man🤣 permalink parent award report block reply\nknnbccb 2 points 1 day ago 'Reverend' with a clenched black fist emoji... that's a red flag. I consider black churches where most of the preaching is about fighting back against 'the white man's oppression' are no less dangerous than mosques. Watchlist-worthy. permalink award report block reply Crappydatum 1 points 1 day ago Dude, what's his name? Say it out loud permalink parent award report block reply\nCrappydatum 1 points 1 day ago Dude, what's his name? Say it out loud permalink parent award report block reply\nyarg 2 points 1 day ago One of the more obvious trolls. permalink award report block reply\nJoeBidensDementia1 2 points 1 day ago I'd expect that 2% of you wouldn't commit 54% of crime. But what do I know? permalink award report block reply\nBigIgloo 2 points 1 day ago Boomers cannot detect satire permalink award report block reply Ryan282 2 points 22 hours ago I've noticed this a lot. permalink parent award report block reply\nRyan282 2 points 22 hours ago I've noticed this a lot. permalink parent award report block reply\nVanDeKoik 1 points 1 day ago You are a pastor. Spend less in flashy suits and that Cadillac, and have the sisters make meals for your congregation. And that goes for the mega churches in the burbs too! permalink award report block reply\nMOLON-LABE 1 points 1 day ago Well, its kind of true. permalink award report block reply\nGetelectedordietryin 1 points 1 day ago He’s right though permalink award report block reply\nTrad_Americans_Only 1 points 21 hours ago 3 hots and a cot. Then a free boat ride to Liberia permalink award report block reply\nbluntedaffect 1 points 1 day ago Terms: Acceptable permalink award report block reply\nGreyKnight 1 points 1 day ago That’s one way to say they have a high violent crime rate while letting it seem like a parody even though many might not notice and believe it… permalink award report block reply\nImpressiveTriceps 1 points 1 day ago That's the moderate solution permalink award report block reply\nheavyD 1 points 1 day ago Correct, thats where we expect you will eventually be. permalink award report block reply\nPappy_Gunn 1 points 1 day ago It's spelled whypipo permalink award report block reply\npatrioticwinning3 1 points 1 day ago ....Words escape me XD permalink award report block reply\nOmegaBird 1 points 1 day ago Very telling that a back man would confirm crime is their only option. Rather than getting a job. permalink award report block reply\nMisprisionIsEvil 1 points 22 hours ago Eating for free is a right? permalink award report block reply\nrebuildingMyself 1 points 1 day ago Could always get a fucking job, God forbid permalink award report block reply Steve56775 1 points 1 day ago Job? Their job is multiplying for future generations of takers. permalink parent award report block reply\nSteve56775 1 points 1 day ago Job? Their job is multiplying for future generations of takers. permalink parent award report block reply\nRedditStillSucks 1 points 1 day ago Why should you be able to eat for free? permalink award report block reply\n181degrees 1 points 1 day ago My sympathy for blacks dried up decades ago permalink award report block reply\nCreepy_Joe 1 points 1 day ago Yes. permalink award report block reply\nAmway 1 points 1 day ago Some people know only know how to steal to eat, tap the government to eat, panhandle to eat and go to prison to eat. The rest of us just work to eat. permalink award report block reply\n16BeatsAOne 1 points 1 day ago Eventually, you will . . . permalink award report block reply\nJanxyJet 1 points 1 day ago Hints too much at self-awareness to not be a meme. True, though. permalink award report block reply\nSunnybats2 1 points 1 day ago It's called a FOOD BANK permalink award report block reply\nEastTexasMadLad 1 points 1 day ago Yes, exactly permalink award report block reply\nSmurfection 1 points 1 day ago Being poor isn't a crime.  Most poor people aren't criminals ,except for illegal alien invaders. Are blacks who actually don't commit crimes ever going to get sick of lefty black leaders assuming all blacks are criminals? permalink award report block reply\nCrappydatum 1 points 1 day ago Why should they eat for free again? permalink award report block reply\njohnfist2 1 points 1 day ago The irony that he doesn't see it, is disgusting.  Leeches. permalink award report block reply WeaponizedSmirk 2 points 1 day ago Hey man, read his name again. Slowly, out loud. permalink parent award report block reply\nWeaponizedSmirk 2 points 1 day ago Hey man, read his name again. Slowly, out loud. permalink parent award report block reply\nTearsAficionado 1 points 1 day ago Lol with two black prisoners in the background...being served by gloved black hands. Checks out. Kek. permalink award report block reply\nHKFan 1 points 1 day ago Tbh it’s not a bad idea to just lock them all up and let them out after they’ve proven they can behave permalink award report block reply\nMegoThor 1 points 1 day ago Relatives on the outside should have to pay for prisoner’s meals instead of taxpayers. permalink award report block reply\nDontTreadOnLego 1 points 1 day ago And slave labor called prison labor :D permalink award report block reply\nPearlyGaits57 1 points 1 day ago Looks like all four food groups are represented. Bonappetite! permalink award report block reply\nKael 1 points 1 day ago I prefer the worms eat for free permalink award report block reply\nCop-Morty 1 points 1 day ago I don't want to be racists. I say, we stop feeding prisoners  too. permalink award report block reply\ncptkloss5 1 points 1 day ago i don't want you to eat at all, unless you work for it permalink award report block reply\nfullpotato1776 1 points 1 day ago That's the real Soul Food permalink award report block reply\njohnparker 1 points 1 day ago Why do you get to eat for free? permalink award report block reply\nEaszq8 1 points 1 day ago Quoth Jim Carrey, “STOP BREAKING THE LAW ASSHOLE!” permalink award report block reply\nrivetjoint2 1 points 1 day ago Why should anyone eat for free? permalink award report block reply\nTooBright 1 points 1 day ago Someone yearns for some chains and everything provided for them again. permalink award report block reply\nTrump454748 1 points 1 day ago Fuck off, I don’t eat for free. permalink award report block reply\nSouth_Florida_Guy -1 points 1 day ago Get a fucking job! permalink award report block reply\nMichalusmichalus -3 points 1 day ago The man has Reverend in his name. I do not fault a Reverend for thinking like Jesus. permalink award report block reply"}