{"id": "1ARK9oWNgl", "contents": "62 JUSSIE SMOLLET 2.0: Jewish French woman Nancy Szejnberg drew swastikas and slurs outside her own house claiming she was a victim of anti-Semitism. She's been sentenced to 2.5 years in prison. posted 2 hours ago by China4Biden 19 comments award share report block Paul-Éric Blanrue @PBlanrue • 6M Nancy Szejnberg, 51 ans, vient d'être condamnée ce mercredi 14 mai par le tribunal judiciaire de Paris à deux ans et demi de prison — dont un an et demi probatoire — pour dégradation à caractère antisémite et dénonciation mensongère, pour une série de tags et menaces antisémites\n19 comments Sort by Top Top New Worst Old Save loooooof 11 points 2 hours ago They shriek in agony as they attack themselves. permalink award report block reply Porkbut -1 points 1 hour ago What does this have to do with America on this America only website though? What does france have to do with America? permalink parent award report block reply Trump4Infinity 3 points 1 hour ago common enemy permalink parent award report block reply Porkbut -1 points 1 hour ago Who? Will you stop being such a pussy and trying to act coy, or are you just a widdle scaredy cat afraid to say what you mean? permalink parent award report block reply Trump4Infinity 3 points 59 minutes ago oy vey permalink parent award report block reply view 1 more comments... Callsign_Fox1 7 points 2 hours ago 100% of anti-whatever attacks are perpetrated by themselves in order to try to gin up sympathy from the host. Reject their hoaxes. Steady boys, steady. permalink award report block reply shadypollster 6 points 2 hours ago What a dumb bitch. permalink award report block reply BidenShowerDrool 1 points 22 minutes ago she is obviously  not of the Ashkenazi variant. permalink parent award report block reply Mhmm2MoreWeeks 4 points 2 hours ago Jewish Marxists like all Marxists have no problem lying. Im Jewish. She is not acting like a Jewish person should based on our faith or history. Jew Haters love things like this of course, and for the obvious reasons. On one hand you say fuck Islam, then you fault Israel for wanting to beat Islam back with a stick. This is kind of similar. The issue here is she is a FRAUDSTER. It would not matter if she was another Race or Jewish. She is a criminal first and foremost. This does not make other Jews guilty just as if she was White it does not make you guilty. permalink award report block reply MAG-n-KAG 2 points 52 minutes ago no one gives a shit if you wipe every pisslamic goat fucker off the face of the earth.  just do it on your own time and your own dime.  leave us out of it. permalink parent award report block reply Brownwaterboys 3 points 46 minutes ago she should be in jail for 25 years not 2.5 :( permalink award report block reply MAG-n-KAG 3 points 54 minutes ago the most surprising part about this story is that they sentenced her to any jail at all.  i mean, she's a chozen one aint she?  they're not supposed to be punished. permalink award report block reply _Liberty_Prime_ 2 points 2 hours ago May 16th. Are you trying to present this as a BREAKING story? permalink award report block reply Taqiyya_Mockingbird 1 points 37 minutes ago Some may not have seen the story then. Is that a problem for you? permalink parent award report block reply Ligersrule1 2 points 1 hour ago Demand vastly exceeds available supply permalink award report block reply IPFreely 2 points 2 hours ago Must be Qatar or Hamas… 🥸 permalink award report block reply yepyep 1 points 32 minutes ago She should have used Jessie’s lawyer. permalink award report block reply ColonelKlink 1 points 49 minutes ago Destructive idiots. permalink award report block reply\nloooooof 11 points 2 hours ago They shriek in agony as they attack themselves. permalink award report block reply Porkbut -1 points 1 hour ago What does this have to do with America on this America only website though? What does france have to do with America? permalink parent award report block reply Trump4Infinity 3 points 1 hour ago common enemy permalink parent award report block reply Porkbut -1 points 1 hour ago Who? Will you stop being such a pussy and trying to act coy, or are you just a widdle scaredy cat afraid to say what you mean? permalink parent award report block reply Trump4Infinity 3 points 59 minutes ago oy vey permalink parent award report block reply view 1 more comments...\nPorkbut -1 points 1 hour ago What does this have to do with America on this America only website though? What does france have to do with America? permalink parent award report block reply Trump4Infinity 3 points 1 hour ago common enemy permalink parent award report block reply Porkbut -1 points 1 hour ago Who? Will you stop being such a pussy and trying to act coy, or are you just a widdle scaredy cat afraid to say what you mean? permalink parent award report block reply Trump4Infinity 3 points 59 minutes ago oy vey permalink parent award report block reply view 1 more comments...\nTrump4Infinity 3 points 1 hour ago common enemy permalink parent award report block reply Porkbut -1 points 1 hour ago Who? Will you stop being such a pussy and trying to act coy, or are you just a widdle scaredy cat afraid to say what you mean? permalink parent award report block reply Trump4Infinity 3 points 59 minutes ago oy vey permalink parent award report block reply view 1 more comments...\nPorkbut -1 points 1 hour ago Who? Will you stop being such a pussy and trying to act coy, or are you just a widdle scaredy cat afraid to say what you mean? permalink parent award report block reply Trump4Infinity 3 points 59 minutes ago oy vey permalink parent award report block reply view 1 more comments...\nTrump4Infinity 3 points 59 minutes ago oy vey permalink parent award report block reply view 1 more comments...\nCallsign_Fox1 7 points 2 hours ago 100% of anti-whatever attacks are perpetrated by themselves in order to try to gin up sympathy from the host. Reject their hoaxes. Steady boys, steady. permalink award report block reply\nshadypollster 6 points 2 hours ago What a dumb bitch. permalink award report block reply BidenShowerDrool 1 points 22 minutes ago she is obviously  not of the Ashkenazi variant. permalink parent award report block reply\nBidenShowerDrool 1 points 22 minutes ago she is obviously  not of the Ashkenazi variant. permalink parent award report block reply\nMhmm2MoreWeeks 4 points 2 hours ago Jewish Marxists like all Marxists have no problem lying. Im Jewish. She is not acting like a Jewish person should based on our faith or history. Jew Haters love things like this of course, and for the obvious reasons. On one hand you say fuck Islam, then you fault Israel for wanting to beat Islam back with a stick. This is kind of similar. The issue here is she is a FRAUDSTER. It would not matter if she was another Race or Jewish. She is a criminal first and foremost. This does not make other Jews guilty just as if she was White it does not make you guilty. permalink award report block reply MAG-n-KAG 2 points 52 minutes ago no one gives a shit if you wipe every pisslamic goat fucker off the face of the earth.  just do it on your own time and your own dime.  leave us out of it. permalink parent award report block reply\nMAG-n-KAG 2 points 52 minutes ago no one gives a shit if you wipe every pisslamic goat fucker off the face of the earth.  just do it on your own time and your own dime.  leave us out of it. permalink parent award report block reply\nBrownwaterboys 3 points 46 minutes ago she should be in jail for 25 years not 2.5 :( permalink award report block reply\nMAG-n-KAG 3 points 54 minutes ago the most surprising part about this story is that they sentenced her to any jail at all.  i mean, she's a chozen one aint she?  they're not supposed to be punished. permalink award report block reply\n_Liberty_Prime_ 2 points 2 hours ago May 16th. Are you trying to present this as a BREAKING story? permalink award report block reply Taqiyya_Mockingbird 1 points 37 minutes ago Some may not have seen the story then. Is that a problem for you? permalink parent award report block reply\nTaqiyya_Mockingbird 1 points 37 minutes ago Some may not have seen the story then. Is that a problem for you? permalink parent award report block reply\nLigersrule1 2 points 1 hour ago Demand vastly exceeds available supply permalink award report block reply\nIPFreely 2 points 2 hours ago Must be Qatar or Hamas… 🥸 permalink award report block reply\nyepyep 1 points 32 minutes ago She should have used Jessie’s lawyer. permalink award report block reply\nColonelKlink 1 points 49 minutes ago Destructive idiots. permalink award report block reply"}