{"id": "1ARK591SI0", "contents": "292 @mirandadevine: Why don't you? You hate America so much. Why don't you leave? posted 3 days ago by blue5707 7 comments award share report block Miranda Devine @mirandadevine • 4d Why don't you? You hate America so much. Why don't you leave? Breaking911 @Breaking911 • 4d Ilhan Omar said she doesn’t mind being deported. “I’m grown; I can live wherever.”\n7 comments Sort by Top Top New Worst Old Save billybaldwin2 9 points 3 days ago Because she maken dat munny! permalink award report block reply NotYourMan 8 points 3 days ago Ilhan Omar is here getting fabulously wealthy by complaining and hating on America.  She isn't going anywhere.  Where else on the planet Earth can she get rich by bad mouthing the country she lives in? permalink award report block reply EnforcerDesu 3 points 3 days ago Tired of \"If you hate the US why don't you leave?\" Because they want to destroy the US and turn us into a shit hole. permalink award report block reply KungFlu4u 2 points 3 days ago Now that’s she’s stuffed herself full of taxpayer money, sure she can go anywhere. Inbred wench. permalink award report block reply DCYR66 1 points 3 days ago Then get the fuck out bitch!!! permalink award report block reply hackinthebox 1 points 3 days ago Because she’s not done destroying it permalink award report block reply the-new-style 1 points 3 days ago \"I'm here to steal it\" permalink award report block reply\nbillybaldwin2 9 points 3 days ago Because she maken dat munny! permalink award report block reply\nNotYourMan 8 points 3 days ago Ilhan Omar is here getting fabulously wealthy by complaining and hating on America.  She isn't going anywhere.  Where else on the planet Earth can she get rich by bad mouthing the country she lives in? permalink award report block reply\nEnforcerDesu 3 points 3 days ago Tired of \"If you hate the US why don't you leave?\" Because they want to destroy the US and turn us into a shit hole. permalink award report block reply\nKungFlu4u 2 points 3 days ago Now that’s she’s stuffed herself full of taxpayer money, sure she can go anywhere. Inbred wench. permalink award report block reply\nDCYR66 1 points 3 days ago Then get the fuck out bitch!!! permalink award report block reply\nhackinthebox 1 points 3 days ago Because she’s not done destroying it permalink award report block reply\nthe-new-style 1 points 3 days ago \"I'm here to steal it\" permalink award report block reply"}