{"id": "1ARK9nOnup", "contents": "122 WTF: Trump says H-1B immigrants are necessary because there aren’t enough talented Americans to fill jobs. BE  LESS  RETARDED posted 5 hours ago by RonPaulWasRight 31 comments award share report block Hodgetwins @hodgetwins • 16h Wtf AF Post @AFpost • 20h Trump says H-1B immigrants are necessary because there aren’t enough talented Americans to fill jobs. Follow: @AFpost\n31 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style FUSnowflake 17 points 5 hours ago Who turned him into a WEF flunkie on this topic?\nWas it Elon or Larry Ellison (who he thinks he needs for the AI bubble)? permalink award report block reply RonPaulWasRight OP 12 points 5 hours ago The forgotten men and women of our country have been forgotten once again. permalink parent award report block reply Wexit-Delecto 9 points 5 hours ago Remember how mad the shills got when we were opposed to all these pro mass legal immigration n iggers whispering in President Trump's ear? permalink parent award report block reply ParmesanCartel 1 points 5 hours ago always has been permalink parent award report block reply boogeyman420 14 points 5 hours ago He went full ((retard)) permalink award report block reply Wexit-Delecto 11 points 5 hours ago Lol. MAGA is about being replaced by second and third worlders now. FFS. permalink award report block reply mty_green_go 3 points 4 hours ago Make america gibs again permalink parent award report block reply kamalas_knees 9 points 5 hours ago Trump sounds vaxxed. permalink award report block reply mty_green_go 2 points 4 hours ago fucking toolbag on this one, for real permalink parent award report block reply captflerbus 8 points 5 hours ago if they are that important and really want to work here then they can give up their former citizenship and become americans they will get paid like americans,  protected by american laws no discounts for renting foreigners let's see how much they are really needed when they don't help the bottom line permalink award report block reply fskfsk 1 points 1 hour ago The H1b visa intentionally keeps them in indentured servant status, which is one of the main attractions of the H1b visa in the first place.  If they get fired, they have 60 days to find a new job or leave the country, which gives the employer tremendous leverage. Many of the abuses of H1b would go away if they were given full greencards instead of H1b visas. permalink parent award report block reply covfefe77 5 points 5 hours ago rsbn just booted me for saying this in their chat. bible-thumping censors permalink award report block reply RonPaulWasRight OP 4 points 5 hours ago Everybody's favorite Bill Mitchell defending it, lol https://x.com/mitchellvii/status/1988558693873397911 permalink award report block reply Zskills 3 points 4 hours ago Tell that to the people graduating with computer science degrees who can't even get an interview permalink award report block reply RonPaulWasRight OP 2 points 3 hours ago When Trump said Microsoft, Amazon etc. were on board with his H1B plan, that's when we knew it was absolute shit. permalink parent award report block reply notsuicidalatall 3 points 5 hours ago from Grok: Donald Trump made the statement during an interview with Fox News host Laura Ingraham that aired on November 11, 2025.\nIn the exchange, Ingraham pressed Trump on whether restricting H-1B visas would be a priority for his administration to avoid flooding the job market with foreign workers and suppressing American wages. Trump replied, \"I agree — but you also do have to bring in talent,\" before elaborating that the U.S. lacks \"certain talents\" domestically. When Ingraham countered, \"We have plenty of talented people here,\" Trump responded: \"No, you don’t, no you don’t … you don’t have certain talents, and people have to learn. You can’t take people off an unemployment line and say, ‘I’m going to put you into a factory where we’re going to make missiles.’\" He cited a September 2025 ICE raid at a Hyundai battery plant in Georgia—where South Korean workers with specialized skills were deported—as an example of why such immigrants are sometimes necessary. permalink award report block reply bidensmissingbrain -1 points 5 hours ago Ragebait media gonna ragebait. permalink parent award report block reply notsuicidalatall 0 points 5 hours ago right, him commenting isn't an advertisement of his 'policy', he's playing on a playing field with multiple 'teams' and 'fans'.\nMAGA gets butthurt easily.  I'm not saying to free-pass this, but understand who he is speaking to here. permalink parent award report block reply Zskills 1 points 4 hours ago we are dooming right now so either get on board or take your facts and optimism elsewhere permalink parent award report block reply notsuicidalatall 2 points 4 hours ago :-)\n;-)\n;-| permalink parent award report block reply keeptherepublic1776 2 points 4 hours ago Fuck you trump. He's a joke and will his legacy will be a joke. He's a fucking liar permalink award report block reply 62jawbill 2 points 5 hours ago Less than a year ...this is not what I voted for..I'm so happy him and his golf buddies are making bank..America first my ass.. permalink award report block reply mty_green_go 2 points 4 hours ago Scam Blondi will be on fox news pronto to talk trash about their opponents. dont worry permalink parent award report block reply Madnote1984 2 points 4 hours ago Just an absolutely horrible argument. Even if he is right. Let's just assume Americans are too stupid for the job, why then, isn't he trying to bring investment in for jobs Americans can actually do??! Isn't that the point...to employ Americans? Or are we just letting everyone set up fucking shop here and import the third world to do the work? permalink award report block reply UntakenUsername 2 points 4 hours ago Maybe there actually is something compromising about him and the Epstein files that he is being blackmailed/extorted about. The Epstein debacle is when the admin starting going tits-up. permalink award report block reply YouEssAye 2 points 4 hours ago I still doubt he's implicated, but from the start I've been saying the reason he's so adamant about keeping them concealed is to protect Israel/Mossad.   Epstein was a Mossad op. permalink parent award report block reply MAGALADON9 2 points 4 hours ago GET ON THESE GUYS RADAR. CONTACT DIRECTLY. DJT OBSERVES THEM. LET THEM KNOW YOUR STRONG DISAPPOINTMENT AND DISAPPROVAL  - EXAGGERATE A BIT. Rasmussen Reports Email: info@rasmussenreports.com ; Web form at rasmussenreports.com/contact_us Trump tweets their data weekly; say \"For Scott Rasmussen: My take on [issue].\" Trafalgar Group Form: thetrafalgargroup.org/contact; Phone: 202-810-2123 Robert Cahaly (lead) briefs Trump allies; emphasize GOP alignment. John McLaughlin Email: info@mclaughlinonline.com ; Phone: 305-894-1020 Trump's go-to; reference \"for John McLaughlin re: Trump priorities.\" TIPP Form: tippingpointpolls.com/contact; Email: info@tippingpointpolls.com ... if you actually give a fuck make a call. Send emails. permalink award report block reply blitzkrieg1 1 points 3 hours ago For all of your smooth brains. This might help. Might. https://patriots.win/p/1ARK9nP4pY/trumps-remarks-explained/c permalink award report block reply RonPaulWasRight OP 2 points 3 hours ago That's a decent argument. Unfortunately, an H1B deal Microsoft and Amazon approve of is the opposite of what we need. Nobody is hiring American grads if they can get a Patel for 20%+ less. permalink parent award report block reply deeluna 1 points 1 hour ago Maybe, and this is a big Maybe here. He's doing his usual say one thing to motivate something different to prove him wrong. No I'm not trying to defend, it's a Devils Advocate moment. permalink award report block reply\nFUSnowflake 17 points 5 hours ago Who turned him into a WEF flunkie on this topic?\nWas it Elon or Larry Ellison (who he thinks he needs for the AI bubble)? permalink award report block reply RonPaulWasRight OP 12 points 5 hours ago The forgotten men and women of our country have been forgotten once again. permalink parent award report block reply Wexit-Delecto 9 points 5 hours ago Remember how mad the shills got when we were opposed to all these pro mass legal immigration n iggers whispering in President Trump's ear? permalink parent award report block reply ParmesanCartel 1 points 5 hours ago always has been permalink parent award report block reply\nRonPaulWasRight OP 12 points 5 hours ago The forgotten men and women of our country have been forgotten once again. permalink parent award report block reply\nWexit-Delecto 9 points 5 hours ago Remember how mad the shills got when we were opposed to all these pro mass legal immigration n iggers whispering in President Trump's ear? permalink parent award report block reply\nParmesanCartel 1 points 5 hours ago always has been permalink parent award report block reply\nboogeyman420 14 points 5 hours ago He went full ((retard)) permalink award report block reply\nWexit-Delecto 11 points 5 hours ago Lol. MAGA is about being replaced by second and third worlders now. FFS. permalink award report block reply mty_green_go 3 points 4 hours ago Make america gibs again permalink parent award report block reply\nmty_green_go 3 points 4 hours ago Make america gibs again permalink parent award report block reply\nkamalas_knees 9 points 5 hours ago Trump sounds vaxxed. permalink award report block reply mty_green_go 2 points 4 hours ago fucking toolbag on this one, for real permalink parent award report block reply\nmty_green_go 2 points 4 hours ago fucking toolbag on this one, for real permalink parent award report block reply\ncaptflerbus 8 points 5 hours ago if they are that important and really want to work here then they can give up their former citizenship and become americans they will get paid like americans,  protected by american laws no discounts for renting foreigners let's see how much they are really needed when they don't help the bottom line permalink award report block reply fskfsk 1 points 1 hour ago The H1b visa intentionally keeps them in indentured servant status, which is one of the main attractions of the H1b visa in the first place.  If they get fired, they have 60 days to find a new job or leave the country, which gives the employer tremendous leverage. Many of the abuses of H1b would go away if they were given full greencards instead of H1b visas. permalink parent award report block reply\nfskfsk 1 points 1 hour ago The H1b visa intentionally keeps them in indentured servant status, which is one of the main attractions of the H1b visa in the first place.  If they get fired, they have 60 days to find a new job or leave the country, which gives the employer tremendous leverage. Many of the abuses of H1b would go away if they were given full greencards instead of H1b visas. permalink parent award report block reply\ncovfefe77 5 points 5 hours ago rsbn just booted me for saying this in their chat. bible-thumping censors permalink award report block reply\nRonPaulWasRight OP 4 points 5 hours ago Everybody's favorite Bill Mitchell defending it, lol https://x.com/mitchellvii/status/1988558693873397911 permalink award report block reply\nZskills 3 points 4 hours ago Tell that to the people graduating with computer science degrees who can't even get an interview permalink award report block reply RonPaulWasRight OP 2 points 3 hours ago When Trump said Microsoft, Amazon etc. were on board with his H1B plan, that's when we knew it was absolute shit. permalink parent award report block reply\nRonPaulWasRight OP 2 points 3 hours ago When Trump said Microsoft, Amazon etc. were on board with his H1B plan, that's when we knew it was absolute shit. permalink parent award report block reply\nnotsuicidalatall 3 points 5 hours ago from Grok: Donald Trump made the statement during an interview with Fox News host Laura Ingraham that aired on November 11, 2025.\nIn the exchange, Ingraham pressed Trump on whether restricting H-1B visas would be a priority for his administration to avoid flooding the job market with foreign workers and suppressing American wages. Trump replied, \"I agree — but you also do have to bring in talent,\" before elaborating that the U.S. lacks \"certain talents\" domestically. When Ingraham countered, \"We have plenty of talented people here,\" Trump responded: \"No, you don’t, no you don’t … you don’t have certain talents, and people have to learn. You can’t take people off an unemployment line and say, ‘I’m going to put you into a factory where we’re going to make missiles.’\" He cited a September 2025 ICE raid at a Hyundai battery plant in Georgia—where South Korean workers with specialized skills were deported—as an example of why such immigrants are sometimes necessary. permalink award report block reply bidensmissingbrain -1 points 5 hours ago Ragebait media gonna ragebait. permalink parent award report block reply notsuicidalatall 0 points 5 hours ago right, him commenting isn't an advertisement of his 'policy', he's playing on a playing field with multiple 'teams' and 'fans'.\nMAGA gets butthurt easily.  I'm not saying to free-pass this, but understand who he is speaking to here. permalink parent award report block reply Zskills 1 points 4 hours ago we are dooming right now so either get on board or take your facts and optimism elsewhere permalink parent award report block reply notsuicidalatall 2 points 4 hours ago :-)\n;-)\n;-| permalink parent award report block reply\nbidensmissingbrain -1 points 5 hours ago Ragebait media gonna ragebait. permalink parent award report block reply notsuicidalatall 0 points 5 hours ago right, him commenting isn't an advertisement of his 'policy', he's playing on a playing field with multiple 'teams' and 'fans'.\nMAGA gets butthurt easily.  I'm not saying to free-pass this, but understand who he is speaking to here. permalink parent award report block reply Zskills 1 points 4 hours ago we are dooming right now so either get on board or take your facts and optimism elsewhere permalink parent award report block reply notsuicidalatall 2 points 4 hours ago :-)\n;-)\n;-| permalink parent award report block reply\nnotsuicidalatall 0 points 5 hours ago right, him commenting isn't an advertisement of his 'policy', he's playing on a playing field with multiple 'teams' and 'fans'.\nMAGA gets butthurt easily.  I'm not saying to free-pass this, but understand who he is speaking to here. permalink parent award report block reply Zskills 1 points 4 hours ago we are dooming right now so either get on board or take your facts and optimism elsewhere permalink parent award report block reply notsuicidalatall 2 points 4 hours ago :-)\n;-)\n;-| permalink parent award report block reply\nZskills 1 points 4 hours ago we are dooming right now so either get on board or take your facts and optimism elsewhere permalink parent award report block reply notsuicidalatall 2 points 4 hours ago :-)\n;-)\n;-| permalink parent award report block reply\nnotsuicidalatall 2 points 4 hours ago :-)\n;-)\n;-| permalink parent award report block reply\nkeeptherepublic1776 2 points 4 hours ago Fuck you trump. He's a joke and will his legacy will be a joke. He's a fucking liar permalink award report block reply\n62jawbill 2 points 5 hours ago Less than a year ...this is not what I voted for..I'm so happy him and his golf buddies are making bank..America first my ass.. permalink award report block reply mty_green_go 2 points 4 hours ago Scam Blondi will be on fox news pronto to talk trash about their opponents. dont worry permalink parent award report block reply\nmty_green_go 2 points 4 hours ago Scam Blondi will be on fox news pronto to talk trash about their opponents. dont worry permalink parent award report block reply\nMadnote1984 2 points 4 hours ago Just an absolutely horrible argument. Even if he is right. Let's just assume Americans are too stupid for the job, why then, isn't he trying to bring investment in for jobs Americans can actually do??! Isn't that the point...to employ Americans? Or are we just letting everyone set up fucking shop here and import the third world to do the work? permalink award report block reply\nUntakenUsername 2 points 4 hours ago Maybe there actually is something compromising about him and the Epstein files that he is being blackmailed/extorted about. The Epstein debacle is when the admin starting going tits-up. permalink award report block reply YouEssAye 2 points 4 hours ago I still doubt he's implicated, but from the start I've been saying the reason he's so adamant about keeping them concealed is to protect Israel/Mossad.   Epstein was a Mossad op. permalink parent award report block reply\nYouEssAye 2 points 4 hours ago I still doubt he's implicated, but from the start I've been saying the reason he's so adamant about keeping them concealed is to protect Israel/Mossad.   Epstein was a Mossad op. permalink parent award report block reply\nMAGALADON9 2 points 4 hours ago GET ON THESE GUYS RADAR. CONTACT DIRECTLY. DJT OBSERVES THEM. LET THEM KNOW YOUR STRONG DISAPPOINTMENT AND DISAPPROVAL  - EXAGGERATE A BIT. Rasmussen Reports Email: info@rasmussenreports.com ; Web form at rasmussenreports.com/contact_us Trump tweets their data weekly; say \"For Scott Rasmussen: My take on [issue].\" Trafalgar Group Form: thetrafalgargroup.org/contact; Phone: 202-810-2123 Robert Cahaly (lead) briefs Trump allies; emphasize GOP alignment. John McLaughlin Email: info@mclaughlinonline.com ; Phone: 305-894-1020 Trump's go-to; reference \"for John McLaughlin re: Trump priorities.\" TIPP Form: tippingpointpolls.com/contact; Email: info@tippingpointpolls.com ... if you actually give a fuck make a call. Send emails. permalink award report block reply\nblitzkrieg1 1 points 3 hours ago For all of your smooth brains. This might help. Might. https://patriots.win/p/1ARK9nP4pY/trumps-remarks-explained/c permalink award report block reply RonPaulWasRight OP 2 points 3 hours ago That's a decent argument. Unfortunately, an H1B deal Microsoft and Amazon approve of is the opposite of what we need. Nobody is hiring American grads if they can get a Patel for 20%+ less. permalink parent award report block reply\nRonPaulWasRight OP 2 points 3 hours ago That's a decent argument. Unfortunately, an H1B deal Microsoft and Amazon approve of is the opposite of what we need. Nobody is hiring American grads if they can get a Patel for 20%+ less. permalink parent award report block reply\ndeeluna 1 points 1 hour ago Maybe, and this is a big Maybe here. He's doing his usual say one thing to motivate something different to prove him wrong. No I'm not trying to defend, it's a Devils Advocate moment. permalink award report block reply"}