{"id": "1ARK9mHViy", "contents": "22 Pentagon Wants to Buy Weapons Faster. What Will It Cost? (www.airandspaceforces.com) posted 13 hours ago by raptoris2 3 comments award share report block The Pentagon Wants to Buy Weapons Faster. What Will It Cost? The emphasis on speed in the Pentagon’s newly unveiled slate of acquisition reforms may come with increased near-term cost increases. www.airandspaceforces.com\n3 comments Sort by Top Top New Worst Old Save justinkayz 1 points 13 hours ago When did we start worrying about cost? permalink award report block reply SuperDuperBasedMD 1 points 13 hours ago This sounds like bureaucratic defense of future paymasters, i.e., current defense procurement officials talking on background to protect their future lobbying clients when they get out. It's like Boeing and Lockheed Martin saying Space X will never get off the ground. Look how that worked out for them. They, like many incumbents, protect themselves with regulations and arcane procurement rules. Instead, the goal is to innovate and iterate faster, so that we become cheaper and more deadly.\nNot attempt to engineer perfection on a cost plus basis where the more money you spend, the more money you make and the  longer it takes the more predictable the earnings.. permalink award report block reply AynRand22 1 points 12 hours ago The Pentagon needs to be audited first permalink award report block reply\njustinkayz 1 points 13 hours ago When did we start worrying about cost? permalink award report block reply\nSuperDuperBasedMD 1 points 13 hours ago This sounds like bureaucratic defense of future paymasters, i.e., current defense procurement officials talking on background to protect their future lobbying clients when they get out. It's like Boeing and Lockheed Martin saying Space X will never get off the ground. Look how that worked out for them. They, like many incumbents, protect themselves with regulations and arcane procurement rules. Instead, the goal is to innovate and iterate faster, so that we become cheaper and more deadly.\nNot attempt to engineer perfection on a cost plus basis where the more money you spend, the more money you make and the  longer it takes the more predictable the earnings.. permalink award report block reply\nAynRand22 1 points 12 hours ago The Pentagon needs to be audited first permalink award report block reply"}