{"id": "1ARK9mHmVT", "contents": "37 This clearly works, since Trump is not doing anything to stop Antifa... Maybe if WE start dancing, he'll stop selling us out to foreigners. posted 12 hours ago by Goozmania 6 comments award share report block Libs of TikTok @libsoftiktok • 19h I regret to inform you that the liberals are dancing again to protest ICE. How will Trump ever recover from this?\n6 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style ahamrbond 3 points 11 hours ago Apparently they raised money for food banks. And they are actually doing exercise. I'm sorry guys but I can't hate these people based on this video. They are against ICE, and that's allowed. If their response is caring for others and caring for their own bodies, then I'll disagree with them but I'll applaud them for actually doing something positive about it. They are Americans after all. permalink award report block reply White-tailed_Eagle 1 points 8 hours ago When you put it like that, I can understand. permalink parent award report block reply Goozmania OP 1 points 10 hours ago I'm merely asking if we dance, as well, will we scare Trump into not selling us out. permalink parent award report block reply MADASHELLNEWS 2 points 12 hours ago That's probably at least 100 million dollars of tax payer money to fund this threw USAID permalink award report block reply Justjayce 1 points 10 hours ago Faggots without jobs dancing in dirt. permalink award report block reply VanDeKoik 0 points 11 hours ago You cant just call anyone you don't like ANTIFA just so can demand they be arrested. People doing dumb shit like this isnt an arrestable offense. He clearly isnt doing anything  = my TikTok brain isnt entertained enough so me crash-out. permalink award report block reply\nahamrbond 3 points 11 hours ago Apparently they raised money for food banks. And they are actually doing exercise. I'm sorry guys but I can't hate these people based on this video. They are against ICE, and that's allowed. If their response is caring for others and caring for their own bodies, then I'll disagree with them but I'll applaud them for actually doing something positive about it. They are Americans after all. permalink award report block reply White-tailed_Eagle 1 points 8 hours ago When you put it like that, I can understand. permalink parent award report block reply Goozmania OP 1 points 10 hours ago I'm merely asking if we dance, as well, will we scare Trump into not selling us out. permalink parent award report block reply\nWhite-tailed_Eagle 1 points 8 hours ago When you put it like that, I can understand. permalink parent award report block reply\nGoozmania OP 1 points 10 hours ago I'm merely asking if we dance, as well, will we scare Trump into not selling us out. permalink parent award report block reply\nMADASHELLNEWS 2 points 12 hours ago That's probably at least 100 million dollars of tax payer money to fund this threw USAID permalink award report block reply\nJustjayce 1 points 10 hours ago Faggots without jobs dancing in dirt. permalink award report block reply\nVanDeKoik 0 points 11 hours ago You cant just call anyone you don't like ANTIFA just so can demand they be arrested. People doing dumb shit like this isnt an arrestable offense. He clearly isnt doing anything  = my TikTok brain isnt entertained enough so me crash-out. permalink award report block reply"}