{"id": "1ARK9pelsP", "contents": "474 We won’t always have such a perfectly shaped golden coif. Clean up elections now before we go bald! posted 12 hours ago by Mintap 13 comments award share download report block\n13 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style drmrboy 12 points 11 hours ago Fucking do something for Americans for God's sake.  😐 permalink award report block reply Donger-Lord 6 points 11 hours ago No more h-1b visas, no talk about 50 year mortgages, no bullshit. What America needs is to be freed of our israeli overlords. permalink parent award report block reply SimaYi 7 points 9 hours ago And all foreigners deported. permalink parent award report block reply SimaYi 1 points 9 hours ago Judendrumpf never intended to help White people. He played us. permalink parent award report block reply SavingPrivateGrace 6 points 11 hours ago Comb through things on Pam's desk. permalink award report block reply keeman 2 points 8 hours ago That is a black hole from which nothing escapes. permalink parent award report block reply guywholikesDjtof2024 4 points 11 hours ago Notice the red spot on his ear. Notice the red scar on Charlie's neck. CHARLIE'S. NECK..... Abolish antifa, palantir, the fed, irs, Microsoft, etc.... permalink award report block reply 1777 3 points 11 hours ago BREAKING permalink award report block reply Hanging_Chad 2 points 11 hours ago let’s flatten those right angle curves permalink award report block reply Mintap OP 3 points 11 hours ago two weeks to flatten the curve permalink parent award report block reply guywholikesDjtof2024 2 points 11 hours ago MESA permalink parent award report block reply bluebahloo 1 points 10 hours ago This meme is pretty weird but I'll allow it. permalink award report block reply greenrabbit 1 points 52 minutes ago Comment removed by community filter, pending further review. permalink award report block reply\ndrmrboy 12 points 11 hours ago Fucking do something for Americans for God's sake.  😐 permalink award report block reply Donger-Lord 6 points 11 hours ago No more h-1b visas, no talk about 50 year mortgages, no bullshit. What America needs is to be freed of our israeli overlords. permalink parent award report block reply SimaYi 7 points 9 hours ago And all foreigners deported. permalink parent award report block reply SimaYi 1 points 9 hours ago Judendrumpf never intended to help White people. He played us. permalink parent award report block reply\nDonger-Lord 6 points 11 hours ago No more h-1b visas, no talk about 50 year mortgages, no bullshit. What America needs is to be freed of our israeli overlords. permalink parent award report block reply SimaYi 7 points 9 hours ago And all foreigners deported. permalink parent award report block reply\nSimaYi 7 points 9 hours ago And all foreigners deported. permalink parent award report block reply\nSimaYi 1 points 9 hours ago Judendrumpf never intended to help White people. He played us. permalink parent award report block reply\nSavingPrivateGrace 6 points 11 hours ago Comb through things on Pam's desk. permalink award report block reply keeman 2 points 8 hours ago That is a black hole from which nothing escapes. permalink parent award report block reply\nkeeman 2 points 8 hours ago That is a black hole from which nothing escapes. permalink parent award report block reply\nguywholikesDjtof2024 4 points 11 hours ago Notice the red spot on his ear. Notice the red scar on Charlie's neck. CHARLIE'S. NECK..... Abolish antifa, palantir, the fed, irs, Microsoft, etc.... permalink award report block reply\n1777 3 points 11 hours ago BREAKING permalink award report block reply\nHanging_Chad 2 points 11 hours ago let’s flatten those right angle curves permalink award report block reply Mintap OP 3 points 11 hours ago two weeks to flatten the curve permalink parent award report block reply guywholikesDjtof2024 2 points 11 hours ago MESA permalink parent award report block reply\nMintap OP 3 points 11 hours ago two weeks to flatten the curve permalink parent award report block reply\nguywholikesDjtof2024 2 points 11 hours ago MESA permalink parent award report block reply\nbluebahloo 1 points 10 hours ago This meme is pretty weird but I'll allow it. permalink award report block reply\ngreenrabbit 1 points 52 minutes ago Comment removed by community filter, pending further review. permalink award report block reply"}