{"id": "1ARK54T3C6", "contents": "251 Who was the January 6th pipe bomber talking to here and how did they not track this person? posted 5 days ago by Clabber 21 comments award share report block Gain of Fauci @DschlopesIsBack • 6d Who was the January 6th pipe bomber talking to here and how did they not track him?\n21 comments Sort by Top Top New Worst Old Save lifeisahologram 15 points 5 days ago It’s 100% a woman. permalink award report block reply gofishoregon 12 points 5 days ago You mean \"how did they not track HER? permalink award report block reply TonyTreehouse 4 points 5 days ago Always looked like a woman to me, too.  Particularly in video when she's moving. permalink parent award report block reply Formerlurker92 8 points 5 days ago If they can geotag the phones walking the capital grounds, they can get this guy. The fact that they didn't makes me confident he was a fed permalink award report block reply HumblePepe 5 points 5 days ago 100% permalink parent award report block reply GodIsPerfect 4 points 5 days ago Capitol Police!!! These friggin unconstitutional armies are such attacks on humanity!!! … since their inception!!!! permalink parent award report block reply anotherthing 3 points 5 days ago Still thinking it was a politician's kid. Feds would have made a more convincing pipe bomb. permalink parent award report block reply HocusLocus 1 points 5 days ago It was a prop room or training item. Not convincing but recognizable.  Oven timers are crap for this purpose.  You have to put a piece of paper or a toggle switch between the hot wires while you build it and chances are you'll lose at least an arm when you arm it. permalink parent award report block reply PatriotSkorzeny 5 points 5 days ago The handler? Has a the handler ever been nabbed? permalink award report block reply gofishoregon 3 points 5 days ago Oh. You changed it to PERSON. permalink award report block reply HumblePepe 3 points 5 days ago It's A fed. He's talking to another fed. The feds covered it up. permalink award report block reply 1776freedomheit 2 points 5 days ago The NSA has it all.  If they can 702 Gen. Flynn, they can certainly 702 this POS. permalink award report block reply FKH2 2 points 5 days ago They know exactly who this person is and who they were talking to permalink award report block reply DeanGus2 2 points 5 days ago The fbi agent's name is Shauni Kerkoff. She is a traitor and the whole agency needs disbanded. permalink award report block reply Friar_Pede 2 points 5 days ago Bongino is on it lol permalink award report block reply FKH2 1 points 5 days ago In on it permalink parent award report block reply Suckitreddit 2 points 5 days ago I read someone propose it was Nancy Pelosi’s daughter, 2ho was filming the documentary… can you imagine how delicious that would be. permalink award report block reply Suckitreddit 2 points 5 days ago I remember something about the shoes…that they weren’t a huge number sold. Wonder if they were purchase in San Francisco. permalink parent award report block reply Transparency 3 points 5 days ago About 25,000 permalink parent award report block reply pbarnett865 2 points 5 days ago Because it's a secure satellite phone owned by the CIA? permalink award report block reply\nlifeisahologram 15 points 5 days ago It’s 100% a woman. permalink award report block reply\ngofishoregon 12 points 5 days ago You mean \"how did they not track HER? permalink award report block reply TonyTreehouse 4 points 5 days ago Always looked like a woman to me, too.  Particularly in video when she's moving. permalink parent award report block reply\nTonyTreehouse 4 points 5 days ago Always looked like a woman to me, too.  Particularly in video when she's moving. permalink parent award report block reply\nFormerlurker92 8 points 5 days ago If they can geotag the phones walking the capital grounds, they can get this guy. The fact that they didn't makes me confident he was a fed permalink award report block reply HumblePepe 5 points 5 days ago 100% permalink parent award report block reply GodIsPerfect 4 points 5 days ago Capitol Police!!! These friggin unconstitutional armies are such attacks on humanity!!! … since their inception!!!! permalink parent award report block reply anotherthing 3 points 5 days ago Still thinking it was a politician's kid. Feds would have made a more convincing pipe bomb. permalink parent award report block reply HocusLocus 1 points 5 days ago It was a prop room or training item. Not convincing but recognizable.  Oven timers are crap for this purpose.  You have to put a piece of paper or a toggle switch between the hot wires while you build it and chances are you'll lose at least an arm when you arm it. permalink parent award report block reply\nHumblePepe 5 points 5 days ago 100% permalink parent award report block reply\nGodIsPerfect 4 points 5 days ago Capitol Police!!! These friggin unconstitutional armies are such attacks on humanity!!! … since their inception!!!! permalink parent award report block reply\nanotherthing 3 points 5 days ago Still thinking it was a politician's kid. Feds would have made a more convincing pipe bomb. permalink parent award report block reply HocusLocus 1 points 5 days ago It was a prop room or training item. Not convincing but recognizable.  Oven timers are crap for this purpose.  You have to put a piece of paper or a toggle switch between the hot wires while you build it and chances are you'll lose at least an arm when you arm it. permalink parent award report block reply\nHocusLocus 1 points 5 days ago It was a prop room or training item. Not convincing but recognizable.  Oven timers are crap for this purpose.  You have to put a piece of paper or a toggle switch between the hot wires while you build it and chances are you'll lose at least an arm when you arm it. permalink parent award report block reply\nPatriotSkorzeny 5 points 5 days ago The handler? Has a the handler ever been nabbed? permalink award report block reply\ngofishoregon 3 points 5 days ago Oh. You changed it to PERSON. permalink award report block reply\nHumblePepe 3 points 5 days ago It's A fed. He's talking to another fed. The feds covered it up. permalink award report block reply\n1776freedomheit 2 points 5 days ago The NSA has it all.  If they can 702 Gen. Flynn, they can certainly 702 this POS. permalink award report block reply\nFKH2 2 points 5 days ago They know exactly who this person is and who they were talking to permalink award report block reply\nDeanGus2 2 points 5 days ago The fbi agent's name is Shauni Kerkoff. She is a traitor and the whole agency needs disbanded. permalink award report block reply\nFriar_Pede 2 points 5 days ago Bongino is on it lol permalink award report block reply FKH2 1 points 5 days ago In on it permalink parent award report block reply\nFKH2 1 points 5 days ago In on it permalink parent award report block reply\nSuckitreddit 2 points 5 days ago I read someone propose it was Nancy Pelosi’s daughter, 2ho was filming the documentary… can you imagine how delicious that would be. permalink award report block reply Suckitreddit 2 points 5 days ago I remember something about the shoes…that they weren’t a huge number sold. Wonder if they were purchase in San Francisco. permalink parent award report block reply Transparency 3 points 5 days ago About 25,000 permalink parent award report block reply\nSuckitreddit 2 points 5 days ago I remember something about the shoes…that they weren’t a huge number sold. Wonder if they were purchase in San Francisco. permalink parent award report block reply Transparency 3 points 5 days ago About 25,000 permalink parent award report block reply\nTransparency 3 points 5 days ago About 25,000 permalink parent award report block reply\npbarnett865 2 points 5 days ago Because it's a secure satellite phone owned by the CIA? permalink award report block reply"}