{"id": "1ARK9pg9Js", "contents": "109 Justice Department Launches Investigation Into Security Failures At Berkeley TPUSA Event. Many were threatened, spat on, and shoved by protesters... This was not some flash mob but an organized effort to try to cancel the free speech event. (www.zerohedge.com) posted 3 hours ago by rdvs34283 5 comments award share report block Justice Department Launches Investigation Into Security Failures At Berkeley TPUSA Event ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero www.zerohedge.com\n5 comments Sort by Top Top New Worst Old Save Around the Web 5 Parasite Causing Foods You Should Stop Eating Right Now Paratoxil ElevenMile 3 points 2 hours ago They don't even know what they're angry about.  They're pissed about stuff they THINK Charlie said, that he never said. permalink award report block reply SpaceWizard 3 points 2 hours ago You would be mad if you cut your dick off too permalink parent award report block reply ElevenMile 3 points 2 hours ago They're not cut off, bro. They're dissected, turned inside out, and stuffed back into the body cavity to make a mangina.  Totally normal! permalink parent award report block reply Aggrieved03 2 points 3 hours ago Security failures? How about violent leftwing groups funded by our tax dollars? permalink award report block reply\nElevenMile 3 points 2 hours ago They don't even know what they're angry about.  They're pissed about stuff they THINK Charlie said, that he never said. permalink award report block reply SpaceWizard 3 points 2 hours ago You would be mad if you cut your dick off too permalink parent award report block reply ElevenMile 3 points 2 hours ago They're not cut off, bro. They're dissected, turned inside out, and stuffed back into the body cavity to make a mangina.  Totally normal! permalink parent award report block reply\nSpaceWizard 3 points 2 hours ago You would be mad if you cut your dick off too permalink parent award report block reply ElevenMile 3 points 2 hours ago They're not cut off, bro. They're dissected, turned inside out, and stuffed back into the body cavity to make a mangina.  Totally normal! permalink parent award report block reply\nElevenMile 3 points 2 hours ago They're not cut off, bro. They're dissected, turned inside out, and stuffed back into the body cavity to make a mangina.  Totally normal! permalink parent award report block reply\nAggrieved03 2 points 3 hours ago Security failures? How about violent leftwing groups funded by our tax dollars? permalink award report block reply"}