{"id": "1ARK9mHVag", "contents": "83 🚨🚨🚨 SUNDANCE OUTLINES THE DIVIDE AND CONQUER STRATEGY BY RINOS / DESANTIS / LEVIN / CRUZ / SHAPIRO TAKING PLACE RIGHT NOW 🚨🚨🚨 (theconservativetreehouse.com) posted 13 hours ago by hellohellohellohell 26 comments award share report block The 2025 MAGA Fracture and the Benefactors Behind It - The Last Refuge On March 3rd through March 6th 2016, the Republican presidential primary was at the precipice of a key inflection point (Super Tuesday) when a large group of political leadership, tech titans, bankers and political influence agents assembled at the AEI sum... theconservativetreehouse.com\n26 comments Sort by Top Top New Worst Old Save Around the Web Scumbag-reddit 8 points 13 hours ago Just like all the fag shills here posting about abandoning Trump and maga. Anything to stop the movement....its so obvious. Anyone that says this was never on the train to begin with permalink award report block reply SuperDuperBasedMD 3 points 12 hours ago exactly. If you see someone trying to consensus crack or split the community, post a quote and a link to this article, so others see what's going on. permalink parent award report block reply MickHigan2 5 points 11 hours ago This is pure copium. It's not hard to satiate hardline nationalists because it only requires focusing on America. Trump is importing 600k Chinese and setting up a base in Gaza for \"assistance\". You both are either misinformed or were never AF / MAGA in the first place. permalink parent award report block reply LatitudeofMind 3 points 10 hours ago Been here a while. Not liking how the admin has been tracking. Dont like Shapiro and those fags either. Feeling a little black pilled. We need to figure out what comes next permalink parent award report block reply possibletower -2 points 9 hours ago So typical from you DeFaggot cocksuckers. We have seen these type of brigade gaslighted operations before. Won't ever work and DeFaggot will never be your POTUS. permalink parent award report block reply view 1 more comments... possibletower -1 points 9 hours ago So typical from you DeFaggot cocksuckers. We have seen these type of brigade gaslighted operations before. Won't ever work and DeFaggot will never be your POTUS. Fuentes is not America First btw. He is Hitler/Stalin First. permalink parent award report block reply YouEssAye 1 points 11 hours ago Trump is the one who has abandoned MAGA, not us who've been fighting for him since the escalator. permalink parent award report block reply possibletower -2 points 9 hours ago So typical from you DeFaggot cocksuckers. We have seen these type of brigade gaslighted operations before. Won't ever work and DeFaggot will never be your POTUS. permalink parent award report block reply YouEssAye 3 points 9 hours ago Holy fuck you're out of touch if you think anyone who is turning on Trump is actually a DeSantis supporter. DeSantis is the same Israel first faux populist that Trump turned out to be. Try to be less retarded. permalink parent award report block reply hellohellohellohell OP 8 points 13 hours ago Those of us who were here throughout 2023 remember all the Alligator Emoji types, with their upvote bots and constant consensus cracking and forum sliding. The race for '28 has already started, and their techniques remain the same. permalink award report block reply FORMERCHILDSTAR 7 points 11 hours ago Reject NECONS!!! DON'T ABANDON MAGA. permalink award report block reply SpeekFreely 5 points 11 hours ago How does the divide benefit either group, one will not vote for the other at the end of the day. Besides, Trump is doing enough damage on his own promoting these anti-MAGA policies. permalink award report block reply hellohellohellohell OP 8 points 11 hours ago The assumption is the party will coalesce around the nominee for the general (which historically happens in both parties), and if they don't, they would rather the Dems win anyway and MAGA be dead and buried once and for all. They don't call it the Uniparty for nothing. permalink parent award report block reply SpeekFreely 5 points 11 hours ago Roger that, i should have seen that one coming. permalink parent award report block reply possibletower -1 points 9 hours ago So typical from you DeFaggot cocksuckers. We have seen these type of brigade gaslighted operations before. Won't ever work and DeFaggot will never be your POTUS. permalink parent award report block reply SuperDuperBasedMD 4 points 13 hours ago \"This effort to split the MAGA base, using Israel or (insert_next_thing_here) as a wedge issue within the America First movement – only benefits one larger apparatus, the Sea Island billionaire control system.\" permalink award report block reply DT170x 5 points 13 hours ago Rage and Doom at the [CURRENT_THING] and get Excited at the [NEXT_THING]. It literally NPC logic. permalink parent award report block reply possibletower -1 points 9 hours ago They are bitching about Trump being right about our companies neutering our tech and manufacturing jobs overseas since the 1980s that we don't have any living Americans who can train Americans for the jobs these companies are bringing back to America...and bringing them back here thanks to Trump. The same faggots who mock Antifa and BLM Americans want us to also believe that those types of leftist faggot Americans can train Americans to work in jobs that haven't been in America since the 1980s? 🤣🤣🤣🤣🤣 permalink parent award report block reply Badfinz_FL -5 points 13 hours ago Lol you mean the dude who is wrong about everything he posts? permalink award report block reply hellohellohellohell OP 10 points 12 hours ago Aren't you the guy who swore up and down on here for a year that Ron wasn't running in '24, even though it was entirely obvious to everyone that he was? And then, after Ron inevitably went down in flames, you maintained that Ron wasn't a bad guy, but he just got manipulated into running by the true bad actors in the GOP? Huh... permalink parent award report block reply YouEssAye 5 points 11 hours ago Lol yes, Badfinz absolutely was the guy that swore DeSantis wouldn't run. I'm a fellow Floridaman who notices Badfinz being consistently wrong when it comes to Florida politics. permalink parent award report block reply possibletower -2 points 9 hours ago It becomes obvious with the brigades against Trump in every post on the front page that DeFaggot is making his move for 2028 due to his wife Jill who will fail to win the governor election for Ron's 3rd term so his 2028 campaign starts now. That involves trying to portray Trump as if he is some Bush RINO type while Ron is the real MAGA patriot 🤣 permalink parent award report block reply YouEssAye 2 points 9 hours ago Dude, nobody is voting for DeSantis, sit this conversation out, you have no clue what you're talking about. Sit down and shut up, you've done enough damage to the country. permalink parent award report block reply possibletower 0 points 9 hours ago It becomes obvious with the brigades against Trump in every post on the front page that DeFaggot is making his move for 2028 due to his wife Jill who will fail to win the governor election for Ron's 3rd term so his 2028 campaign starts now. That involves trying to portray Trump as if he is some Bush RINO type while Ron is the real MAGA patriot 🤣 permalink parent award report block reply SuperDuperBasedMD 5 points 12 hours ago like what? I think Sundance has been very insightful. permalink parent award report block reply possibletower -1 points 9 hours ago It becomes obvious with the brigades against Trump in every post on the front page that DeFaggot is making his move for 2028 due to his wife Jill who will fail to win the governor election for Ron's 3rd term so his 2028 campaign starts now. That involves trying to portray Trump as if he is some Bush RINO type while Ron is the real MAGA patriot 🤣 permalink parent award report block reply possibletower -1 points 9 hours ago Fuck Ron DeFaggot. It is obvious all the bitching about Trump comes from you DeSimps. DeFaggot will NEVER be your POTUS permalink parent award report block reply\nScumbag-reddit 8 points 13 hours ago Just like all the fag shills here posting about abandoning Trump and maga. Anything to stop the movement....its so obvious. Anyone that says this was never on the train to begin with permalink award report block reply SuperDuperBasedMD 3 points 12 hours ago exactly. If you see someone trying to consensus crack or split the community, post a quote and a link to this article, so others see what's going on. permalink parent award report block reply MickHigan2 5 points 11 hours ago This is pure copium. It's not hard to satiate hardline nationalists because it only requires focusing on America. Trump is importing 600k Chinese and setting up a base in Gaza for \"assistance\". You both are either misinformed or were never AF / MAGA in the first place. permalink parent award report block reply LatitudeofMind 3 points 10 hours ago Been here a while. Not liking how the admin has been tracking. Dont like Shapiro and those fags either. Feeling a little black pilled. We need to figure out what comes next permalink parent award report block reply possibletower -2 points 9 hours ago So typical from you DeFaggot cocksuckers. We have seen these type of brigade gaslighted operations before. Won't ever work and DeFaggot will never be your POTUS. permalink parent award report block reply view 1 more comments... possibletower -1 points 9 hours ago So typical from you DeFaggot cocksuckers. We have seen these type of brigade gaslighted operations before. Won't ever work and DeFaggot will never be your POTUS. Fuentes is not America First btw. He is Hitler/Stalin First. permalink parent award report block reply YouEssAye 1 points 11 hours ago Trump is the one who has abandoned MAGA, not us who've been fighting for him since the escalator. permalink parent award report block reply possibletower -2 points 9 hours ago So typical from you DeFaggot cocksuckers. We have seen these type of brigade gaslighted operations before. Won't ever work and DeFaggot will never be your POTUS. permalink parent award report block reply YouEssAye 3 points 9 hours ago Holy fuck you're out of touch if you think anyone who is turning on Trump is actually a DeSantis supporter. DeSantis is the same Israel first faux populist that Trump turned out to be. Try to be less retarded. permalink parent award report block reply\nSuperDuperBasedMD 3 points 12 hours ago exactly. If you see someone trying to consensus crack or split the community, post a quote and a link to this article, so others see what's going on. permalink parent award report block reply MickHigan2 5 points 11 hours ago This is pure copium. It's not hard to satiate hardline nationalists because it only requires focusing on America. Trump is importing 600k Chinese and setting up a base in Gaza for \"assistance\". You both are either misinformed or were never AF / MAGA in the first place. permalink parent award report block reply LatitudeofMind 3 points 10 hours ago Been here a while. Not liking how the admin has been tracking. Dont like Shapiro and those fags either. Feeling a little black pilled. We need to figure out what comes next permalink parent award report block reply possibletower -2 points 9 hours ago So typical from you DeFaggot cocksuckers. We have seen these type of brigade gaslighted operations before. Won't ever work and DeFaggot will never be your POTUS. permalink parent award report block reply view 1 more comments... possibletower -1 points 9 hours ago So typical from you DeFaggot cocksuckers. We have seen these type of brigade gaslighted operations before. Won't ever work and DeFaggot will never be your POTUS. Fuentes is not America First btw. He is Hitler/Stalin First. permalink parent award report block reply\nMickHigan2 5 points 11 hours ago This is pure copium. It's not hard to satiate hardline nationalists because it only requires focusing on America. Trump is importing 600k Chinese and setting up a base in Gaza for \"assistance\". You both are either misinformed or were never AF / MAGA in the first place. permalink parent award report block reply LatitudeofMind 3 points 10 hours ago Been here a while. Not liking how the admin has been tracking. Dont like Shapiro and those fags either. Feeling a little black pilled. We need to figure out what comes next permalink parent award report block reply possibletower -2 points 9 hours ago So typical from you DeFaggot cocksuckers. We have seen these type of brigade gaslighted operations before. Won't ever work and DeFaggot will never be your POTUS. permalink parent award report block reply view 1 more comments... possibletower -1 points 9 hours ago So typical from you DeFaggot cocksuckers. We have seen these type of brigade gaslighted operations before. Won't ever work and DeFaggot will never be your POTUS. Fuentes is not America First btw. He is Hitler/Stalin First. permalink parent award report block reply\nLatitudeofMind 3 points 10 hours ago Been here a while. Not liking how the admin has been tracking. Dont like Shapiro and those fags either. Feeling a little black pilled. We need to figure out what comes next permalink parent award report block reply possibletower -2 points 9 hours ago So typical from you DeFaggot cocksuckers. We have seen these type of brigade gaslighted operations before. Won't ever work and DeFaggot will never be your POTUS. permalink parent award report block reply view 1 more comments...\npossibletower -2 points 9 hours ago So typical from you DeFaggot cocksuckers. We have seen these type of brigade gaslighted operations before. Won't ever work and DeFaggot will never be your POTUS. permalink parent award report block reply view 1 more comments...\npossibletower -1 points 9 hours ago So typical from you DeFaggot cocksuckers. We have seen these type of brigade gaslighted operations before. Won't ever work and DeFaggot will never be your POTUS. Fuentes is not America First btw. He is Hitler/Stalin First. permalink parent award report block reply\nYouEssAye 1 points 11 hours ago Trump is the one who has abandoned MAGA, not us who've been fighting for him since the escalator. permalink parent award report block reply possibletower -2 points 9 hours ago So typical from you DeFaggot cocksuckers. We have seen these type of brigade gaslighted operations before. Won't ever work and DeFaggot will never be your POTUS. permalink parent award report block reply YouEssAye 3 points 9 hours ago Holy fuck you're out of touch if you think anyone who is turning on Trump is actually a DeSantis supporter. DeSantis is the same Israel first faux populist that Trump turned out to be. Try to be less retarded. permalink parent award report block reply\npossibletower -2 points 9 hours ago So typical from you DeFaggot cocksuckers. We have seen these type of brigade gaslighted operations before. Won't ever work and DeFaggot will never be your POTUS. permalink parent award report block reply YouEssAye 3 points 9 hours ago Holy fuck you're out of touch if you think anyone who is turning on Trump is actually a DeSantis supporter. DeSantis is the same Israel first faux populist that Trump turned out to be. Try to be less retarded. permalink parent award report block reply\nYouEssAye 3 points 9 hours ago Holy fuck you're out of touch if you think anyone who is turning on Trump is actually a DeSantis supporter. DeSantis is the same Israel first faux populist that Trump turned out to be. Try to be less retarded. permalink parent award report block reply\nhellohellohellohell OP 8 points 13 hours ago Those of us who were here throughout 2023 remember all the Alligator Emoji types, with their upvote bots and constant consensus cracking and forum sliding. The race for '28 has already started, and their techniques remain the same. permalink award report block reply\nFORMERCHILDSTAR 7 points 11 hours ago Reject NECONS!!! DON'T ABANDON MAGA. permalink award report block reply\nSpeekFreely 5 points 11 hours ago How does the divide benefit either group, one will not vote for the other at the end of the day. Besides, Trump is doing enough damage on his own promoting these anti-MAGA policies. permalink award report block reply hellohellohellohell OP 8 points 11 hours ago The assumption is the party will coalesce around the nominee for the general (which historically happens in both parties), and if they don't, they would rather the Dems win anyway and MAGA be dead and buried once and for all. They don't call it the Uniparty for nothing. permalink parent award report block reply SpeekFreely 5 points 11 hours ago Roger that, i should have seen that one coming. permalink parent award report block reply possibletower -1 points 9 hours ago So typical from you DeFaggot cocksuckers. We have seen these type of brigade gaslighted operations before. Won't ever work and DeFaggot will never be your POTUS. permalink parent award report block reply\nhellohellohellohell OP 8 points 11 hours ago The assumption is the party will coalesce around the nominee for the general (which historically happens in both parties), and if they don't, they would rather the Dems win anyway and MAGA be dead and buried once and for all. They don't call it the Uniparty for nothing. permalink parent award report block reply SpeekFreely 5 points 11 hours ago Roger that, i should have seen that one coming. permalink parent award report block reply\nSpeekFreely 5 points 11 hours ago Roger that, i should have seen that one coming. permalink parent award report block reply\npossibletower -1 points 9 hours ago So typical from you DeFaggot cocksuckers. We have seen these type of brigade gaslighted operations before. Won't ever work and DeFaggot will never be your POTUS. permalink parent award report block reply\nSuperDuperBasedMD 4 points 13 hours ago \"This effort to split the MAGA base, using Israel or (insert_next_thing_here) as a wedge issue within the America First movement – only benefits one larger apparatus, the Sea Island billionaire control system.\" permalink award report block reply DT170x 5 points 13 hours ago Rage and Doom at the [CURRENT_THING] and get Excited at the [NEXT_THING]. It literally NPC logic. permalink parent award report block reply possibletower -1 points 9 hours ago They are bitching about Trump being right about our companies neutering our tech and manufacturing jobs overseas since the 1980s that we don't have any living Americans who can train Americans for the jobs these companies are bringing back to America...and bringing them back here thanks to Trump. The same faggots who mock Antifa and BLM Americans want us to also believe that those types of leftist faggot Americans can train Americans to work in jobs that haven't been in America since the 1980s? 🤣🤣🤣🤣🤣 permalink parent award report block reply\nDT170x 5 points 13 hours ago Rage and Doom at the [CURRENT_THING] and get Excited at the [NEXT_THING]. It literally NPC logic. permalink parent award report block reply\npossibletower -1 points 9 hours ago They are bitching about Trump being right about our companies neutering our tech and manufacturing jobs overseas since the 1980s that we don't have any living Americans who can train Americans for the jobs these companies are bringing back to America...and bringing them back here thanks to Trump. The same faggots who mock Antifa and BLM Americans want us to also believe that those types of leftist faggot Americans can train Americans to work in jobs that haven't been in America since the 1980s? 🤣🤣🤣🤣🤣 permalink parent award report block reply\nBadfinz_FL -5 points 13 hours ago Lol you mean the dude who is wrong about everything he posts? permalink award report block reply hellohellohellohell OP 10 points 12 hours ago Aren't you the guy who swore up and down on here for a year that Ron wasn't running in '24, even though it was entirely obvious to everyone that he was? And then, after Ron inevitably went down in flames, you maintained that Ron wasn't a bad guy, but he just got manipulated into running by the true bad actors in the GOP? Huh... permalink parent award report block reply YouEssAye 5 points 11 hours ago Lol yes, Badfinz absolutely was the guy that swore DeSantis wouldn't run. I'm a fellow Floridaman who notices Badfinz being consistently wrong when it comes to Florida politics. permalink parent award report block reply possibletower -2 points 9 hours ago It becomes obvious with the brigades against Trump in every post on the front page that DeFaggot is making his move for 2028 due to his wife Jill who will fail to win the governor election for Ron's 3rd term so his 2028 campaign starts now. That involves trying to portray Trump as if he is some Bush RINO type while Ron is the real MAGA patriot 🤣 permalink parent award report block reply YouEssAye 2 points 9 hours ago Dude, nobody is voting for DeSantis, sit this conversation out, you have no clue what you're talking about. Sit down and shut up, you've done enough damage to the country. permalink parent award report block reply possibletower 0 points 9 hours ago It becomes obvious with the brigades against Trump in every post on the front page that DeFaggot is making his move for 2028 due to his wife Jill who will fail to win the governor election for Ron's 3rd term so his 2028 campaign starts now. That involves trying to portray Trump as if he is some Bush RINO type while Ron is the real MAGA patriot 🤣 permalink parent award report block reply SuperDuperBasedMD 5 points 12 hours ago like what? I think Sundance has been very insightful. permalink parent award report block reply possibletower -1 points 9 hours ago It becomes obvious with the brigades against Trump in every post on the front page that DeFaggot is making his move for 2028 due to his wife Jill who will fail to win the governor election for Ron's 3rd term so his 2028 campaign starts now. That involves trying to portray Trump as if he is some Bush RINO type while Ron is the real MAGA patriot 🤣 permalink parent award report block reply possibletower -1 points 9 hours ago Fuck Ron DeFaggot. It is obvious all the bitching about Trump comes from you DeSimps. DeFaggot will NEVER be your POTUS permalink parent award report block reply\nhellohellohellohell OP 10 points 12 hours ago Aren't you the guy who swore up and down on here for a year that Ron wasn't running in '24, even though it was entirely obvious to everyone that he was? And then, after Ron inevitably went down in flames, you maintained that Ron wasn't a bad guy, but he just got manipulated into running by the true bad actors in the GOP? Huh... permalink parent award report block reply YouEssAye 5 points 11 hours ago Lol yes, Badfinz absolutely was the guy that swore DeSantis wouldn't run. I'm a fellow Floridaman who notices Badfinz being consistently wrong when it comes to Florida politics. permalink parent award report block reply possibletower -2 points 9 hours ago It becomes obvious with the brigades against Trump in every post on the front page that DeFaggot is making his move for 2028 due to his wife Jill who will fail to win the governor election for Ron's 3rd term so his 2028 campaign starts now. That involves trying to portray Trump as if he is some Bush RINO type while Ron is the real MAGA patriot 🤣 permalink parent award report block reply YouEssAye 2 points 9 hours ago Dude, nobody is voting for DeSantis, sit this conversation out, you have no clue what you're talking about. Sit down and shut up, you've done enough damage to the country. permalink parent award report block reply possibletower 0 points 9 hours ago It becomes obvious with the brigades against Trump in every post on the front page that DeFaggot is making his move for 2028 due to his wife Jill who will fail to win the governor election for Ron's 3rd term so his 2028 campaign starts now. That involves trying to portray Trump as if he is some Bush RINO type while Ron is the real MAGA patriot 🤣 permalink parent award report block reply\nYouEssAye 5 points 11 hours ago Lol yes, Badfinz absolutely was the guy that swore DeSantis wouldn't run. I'm a fellow Floridaman who notices Badfinz being consistently wrong when it comes to Florida politics. permalink parent award report block reply possibletower -2 points 9 hours ago It becomes obvious with the brigades against Trump in every post on the front page that DeFaggot is making his move for 2028 due to his wife Jill who will fail to win the governor election for Ron's 3rd term so his 2028 campaign starts now. That involves trying to portray Trump as if he is some Bush RINO type while Ron is the real MAGA patriot 🤣 permalink parent award report block reply YouEssAye 2 points 9 hours ago Dude, nobody is voting for DeSantis, sit this conversation out, you have no clue what you're talking about. Sit down and shut up, you've done enough damage to the country. permalink parent award report block reply\npossibletower -2 points 9 hours ago It becomes obvious with the brigades against Trump in every post on the front page that DeFaggot is making his move for 2028 due to his wife Jill who will fail to win the governor election for Ron's 3rd term so his 2028 campaign starts now. That involves trying to portray Trump as if he is some Bush RINO type while Ron is the real MAGA patriot 🤣 permalink parent award report block reply YouEssAye 2 points 9 hours ago Dude, nobody is voting for DeSantis, sit this conversation out, you have no clue what you're talking about. Sit down and shut up, you've done enough damage to the country. permalink parent award report block reply\nYouEssAye 2 points 9 hours ago Dude, nobody is voting for DeSantis, sit this conversation out, you have no clue what you're talking about. Sit down and shut up, you've done enough damage to the country. permalink parent award report block reply\npossibletower 0 points 9 hours ago It becomes obvious with the brigades against Trump in every post on the front page that DeFaggot is making his move for 2028 due to his wife Jill who will fail to win the governor election for Ron's 3rd term so his 2028 campaign starts now. That involves trying to portray Trump as if he is some Bush RINO type while Ron is the real MAGA patriot 🤣 permalink parent award report block reply\nSuperDuperBasedMD 5 points 12 hours ago like what? I think Sundance has been very insightful. permalink parent award report block reply possibletower -1 points 9 hours ago It becomes obvious with the brigades against Trump in every post on the front page that DeFaggot is making his move for 2028 due to his wife Jill who will fail to win the governor election for Ron's 3rd term so his 2028 campaign starts now. That involves trying to portray Trump as if he is some Bush RINO type while Ron is the real MAGA patriot 🤣 permalink parent award report block reply\npossibletower -1 points 9 hours ago It becomes obvious with the brigades against Trump in every post on the front page that DeFaggot is making his move for 2028 due to his wife Jill who will fail to win the governor election for Ron's 3rd term so his 2028 campaign starts now. That involves trying to portray Trump as if he is some Bush RINO type while Ron is the real MAGA patriot 🤣 permalink parent award report block reply\npossibletower -1 points 9 hours ago Fuck Ron DeFaggot. It is obvious all the bitching about Trump comes from you DeSimps. DeFaggot will NEVER be your POTUS permalink parent award report block reply"}