{"id": "1ARK53JYTh", "contents": "255 Mamdani will be Mayor of NYC at the 25th anniversary of 9/11 ... Let That Sink In posted 6 days ago by JackStraw1021 16 comments award share download report block\n16 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style equiv222 8 points 6 days ago YOUR DATE IS WRONG, CLOSE.. BUT NOT CORRECT.. EITHER WAY , THAT SHITBAG NEEDS A BULLET  IN HIS HEAD. THERE I SAID IT.HE'S A COMMIE, THIS IS AMERICA, WE CAN SAY THAT ABOUT COMMIES. permalink award report block reply JoeBidensDementia1 7 points 6 days ago Sept 11, 2001 was the 2nd step in defeating the US. Next year will mark the 3rd and final step that will take 4 long years. permalink award report block reply MemoryHoleyeO 4 points 6 days ago Obama was 3rd, COVID was 4th. NAFTA was 1st permalink parent award report block reply Stanwyk74 5 points 6 days ago London fell now New York permalink award report block reply Jimboslice73 3 points 6 days ago I keep seeing reports he lied on immigration forms or something similar which could cause him to be deported. Will Trump be proactive to make that happen? Or is Trump waiting after the midterms to open a massive can of whoop-ass on EVERYTHING and I mean EVERYTHING! permalink award report block reply cyberrigger 3 points 6 days ago Dancing Israelis have entered the chat. permalink award report block reply PunishedSnek 4 points 6 days ago Yeah 33 percent of Jews voted for this guy. I don't think they are upset about it. I think they are basking in the dawn of a new victim narrative. permalink parent award report block reply Mungo 3 points 6 days ago 🤡🌎 permalink award report block reply FullyDilated 2 points 6 days ago they deserve it. hopefully more muslims crash into more buildings permalink award report block reply Pnw4gotpwd 1 points 6 days ago The problem isn't that he is a Muslim. The problem is his politics and his association with terrorist sympathizers and apologists. If he were hard core capitalist who wanted to get crime under control and do something about the drug problem in a city, we would be all for the guy. He isn't any of these good / decent things though. He is a criminal pandering communist. permalink award report block reply Tacitus1963 5 points 6 days ago He is a virulent Marxist who embraces the same ideology as the ANC and EFF in South Africa.\nBoth he and his father did their theses on another über-racist, Frantz Fanon. https://youtu.be/KvnUIfvYV_E?si=O0BElYYCjGj8eGjO permalink parent award report block reply Pnw4gotpwd 2 points 6 days ago Exactly. Thank you for making my point. If he was friends with prince bandar, and a successful Muslim businessman who demanded clean streets, an end of toleration of public drug use, police to actually enforce laws, letting people keep more of their own money and so forth, he would actually find a lot of support from the right - we'd be trotting him out as a \"look at us we aren't racist, we love this guy\" candidate. permalink parent award report block reply kamalas_knees 1 points 5 days ago Memorial or celebration?  That's going to be an awkward speech for the muslim. permalink award report block reply 1DontTreadOnMe1 1 points 6 days ago You need a history lesson. permalink award report block reply Getelectedordietryin 1 points 6 days ago On the anniversary I promise he will honor the terrorist as hero’s who died permalink award report block reply newdaynewname9 0 points 6 days ago Comment removed upon the user being banned. permalink award report block reply\nequiv222 8 points 6 days ago YOUR DATE IS WRONG, CLOSE.. BUT NOT CORRECT.. EITHER WAY , THAT SHITBAG NEEDS A BULLET  IN HIS HEAD. THERE I SAID IT.HE'S A COMMIE, THIS IS AMERICA, WE CAN SAY THAT ABOUT COMMIES. permalink award report block reply\nJoeBidensDementia1 7 points 6 days ago Sept 11, 2001 was the 2nd step in defeating the US. Next year will mark the 3rd and final step that will take 4 long years. permalink award report block reply MemoryHoleyeO 4 points 6 days ago Obama was 3rd, COVID was 4th. NAFTA was 1st permalink parent award report block reply\nMemoryHoleyeO 4 points 6 days ago Obama was 3rd, COVID was 4th. NAFTA was 1st permalink parent award report block reply\nStanwyk74 5 points 6 days ago London fell now New York permalink award report block reply\nJimboslice73 3 points 6 days ago I keep seeing reports he lied on immigration forms or something similar which could cause him to be deported. Will Trump be proactive to make that happen? Or is Trump waiting after the midterms to open a massive can of whoop-ass on EVERYTHING and I mean EVERYTHING! permalink award report block reply\ncyberrigger 3 points 6 days ago Dancing Israelis have entered the chat. permalink award report block reply PunishedSnek 4 points 6 days ago Yeah 33 percent of Jews voted for this guy. I don't think they are upset about it. I think they are basking in the dawn of a new victim narrative. permalink parent award report block reply\nPunishedSnek 4 points 6 days ago Yeah 33 percent of Jews voted for this guy. I don't think they are upset about it. I think they are basking in the dawn of a new victim narrative. permalink parent award report block reply\nMungo 3 points 6 days ago 🤡🌎 permalink award report block reply\nFullyDilated 2 points 6 days ago they deserve it. hopefully more muslims crash into more buildings permalink award report block reply\nPnw4gotpwd 1 points 6 days ago The problem isn't that he is a Muslim. The problem is his politics and his association with terrorist sympathizers and apologists. If he were hard core capitalist who wanted to get crime under control and do something about the drug problem in a city, we would be all for the guy. He isn't any of these good / decent things though. He is a criminal pandering communist. permalink award report block reply Tacitus1963 5 points 6 days ago He is a virulent Marxist who embraces the same ideology as the ANC and EFF in South Africa.\nBoth he and his father did their theses on another über-racist, Frantz Fanon. https://youtu.be/KvnUIfvYV_E?si=O0BElYYCjGj8eGjO permalink parent award report block reply Pnw4gotpwd 2 points 6 days ago Exactly. Thank you for making my point. If he was friends with prince bandar, and a successful Muslim businessman who demanded clean streets, an end of toleration of public drug use, police to actually enforce laws, letting people keep more of their own money and so forth, he would actually find a lot of support from the right - we'd be trotting him out as a \"look at us we aren't racist, we love this guy\" candidate. permalink parent award report block reply\nTacitus1963 5 points 6 days ago He is a virulent Marxist who embraces the same ideology as the ANC and EFF in South Africa.\nBoth he and his father did their theses on another über-racist, Frantz Fanon. https://youtu.be/KvnUIfvYV_E?si=O0BElYYCjGj8eGjO permalink parent award report block reply Pnw4gotpwd 2 points 6 days ago Exactly. Thank you for making my point. If he was friends with prince bandar, and a successful Muslim businessman who demanded clean streets, an end of toleration of public drug use, police to actually enforce laws, letting people keep more of their own money and so forth, he would actually find a lot of support from the right - we'd be trotting him out as a \"look at us we aren't racist, we love this guy\" candidate. permalink parent award report block reply\nPnw4gotpwd 2 points 6 days ago Exactly. Thank you for making my point. If he was friends with prince bandar, and a successful Muslim businessman who demanded clean streets, an end of toleration of public drug use, police to actually enforce laws, letting people keep more of their own money and so forth, he would actually find a lot of support from the right - we'd be trotting him out as a \"look at us we aren't racist, we love this guy\" candidate. permalink parent award report block reply\nkamalas_knees 1 points 5 days ago Memorial or celebration?  That's going to be an awkward speech for the muslim. permalink award report block reply\n1DontTreadOnMe1 1 points 6 days ago You need a history lesson. permalink award report block reply\nGetelectedordietryin 1 points 6 days ago On the anniversary I promise he will honor the terrorist as hero’s who died permalink award report block reply\nnewdaynewname9 0 points 6 days ago Comment removed upon the user being banned. permalink award report block reply"}