{"id": "1ARK56k7Hk", "contents": "387 This person who interviewed Sydney Sweeney locked her account. posted 5 days ago by Taraa 17 comments award share download report block\n17 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style EastTexasMadLad 14 points 4 days ago How does this fugly leftist Karen write for GQ?  No wonder print has failed. permalink award report block reply they-see-me-trollin 13 points 4 days ago because GQ is owned by conde nast, which was colonized by marxists long ago.  GQ has been for faggots for decades. permalink parent award report block reply booblitchutz 11 points 4 days ago GQ is neither for gentlemen nor is it quarterly. It’s been monthly since the 70s and it’s been for women and faggots since the 00s. permalink parent award report block reply 2016TrumpMAGA 2 points 4 days ago GQ used to be a great men's magazine, now it's a hundred pages of ads for faggots. Side note:  That woman has the most punchable face ever. permalink parent award report block reply ColonelKlink 2 points 4 days ago She's a propagandist for magazines. A dumb commie. permalink parent award report block reply anotherthing 2 points 4 days ago She wrote this: https://www.romper.com/parenting/drag-queens-parents-story-hour-why-kids-love-drag permalink parent award report block reply goat_nebula 14 points 4 days ago I hate the school of thought she mentioned, “in today’s political climate, white people aren’t really supposed to talk about having superior genes.” But everyone else can, right? Fuck off lady. permalink award report block reply Justjayce 8 points 4 days ago Fivehead locks account permalink award report block reply Lunk 7 points 4 days ago Juwe permalink award report block reply YaharaRiver 5 points 4 days ago i’m so proud of our Patriots 😆💪 permalink award report block reply WeWillRideAgain 5 points 5 days ago huh? permalink award report block reply Taraa OP 13 points 4 days ago https://www.youtube.com/watch?v=sB3b8XN79t0 https://www.dailywire.com/news/sydney-sweeney-praised-for-keeping-her-cool-as-gq-reporter-tries-to-shame-her permalink parent award report block reply WeWillRideAgain 12 points 4 days ago Thank you for the link. Explains it perfectly. \"A tone policing karen\" He's 100% right. permalink parent award report block reply hoodar 4 points 4 days ago Thank you, the commie feminazis are so butthurt that I can only hope this keeps happening. permalink parent award report block reply ChyNahAzzWhole1 5 points 4 days ago When did Justin Bateman transition? permalink award report block reply VirtusHonos 3 points 4 days ago She wasn't a particularly persuasive interviewer. All that face mugging and trigger phrasing was a tell that she was performing for her narrow audience. permalink award report block reply God-is-good 2 points 4 days ago Couldn’t handle the response to her vile grin eh? smiles a soft knowing smile permalink award report block reply WarGreymon77 2 points 4 days ago I thought Sydney was hot before, but that footage of her at the gun range made her even sexier, ya know? permalink award report block reply\nEastTexasMadLad 14 points 4 days ago How does this fugly leftist Karen write for GQ?  No wonder print has failed. permalink award report block reply they-see-me-trollin 13 points 4 days ago because GQ is owned by conde nast, which was colonized by marxists long ago.  GQ has been for faggots for decades. permalink parent award report block reply booblitchutz 11 points 4 days ago GQ is neither for gentlemen nor is it quarterly. It’s been monthly since the 70s and it’s been for women and faggots since the 00s. permalink parent award report block reply 2016TrumpMAGA 2 points 4 days ago GQ used to be a great men's magazine, now it's a hundred pages of ads for faggots. Side note:  That woman has the most punchable face ever. permalink parent award report block reply ColonelKlink 2 points 4 days ago She's a propagandist for magazines. A dumb commie. permalink parent award report block reply anotherthing 2 points 4 days ago She wrote this: https://www.romper.com/parenting/drag-queens-parents-story-hour-why-kids-love-drag permalink parent award report block reply\nthey-see-me-trollin 13 points 4 days ago because GQ is owned by conde nast, which was colonized by marxists long ago.  GQ has been for faggots for decades. permalink parent award report block reply\nbooblitchutz 11 points 4 days ago GQ is neither for gentlemen nor is it quarterly. It’s been monthly since the 70s and it’s been for women and faggots since the 00s. permalink parent award report block reply\n2016TrumpMAGA 2 points 4 days ago GQ used to be a great men's magazine, now it's a hundred pages of ads for faggots. Side note:  That woman has the most punchable face ever. permalink parent award report block reply\nColonelKlink 2 points 4 days ago She's a propagandist for magazines. A dumb commie. permalink parent award report block reply\nanotherthing 2 points 4 days ago She wrote this: https://www.romper.com/parenting/drag-queens-parents-story-hour-why-kids-love-drag permalink parent award report block reply\ngoat_nebula 14 points 4 days ago I hate the school of thought she mentioned, “in today’s political climate, white people aren’t really supposed to talk about having superior genes.” But everyone else can, right? Fuck off lady. permalink award report block reply\nJustjayce 8 points 4 days ago Fivehead locks account permalink award report block reply\nLunk 7 points 4 days ago Juwe permalink award report block reply\nYaharaRiver 5 points 4 days ago i’m so proud of our Patriots 😆💪 permalink award report block reply\nWeWillRideAgain 5 points 5 days ago huh? permalink award report block reply Taraa OP 13 points 4 days ago https://www.youtube.com/watch?v=sB3b8XN79t0 https://www.dailywire.com/news/sydney-sweeney-praised-for-keeping-her-cool-as-gq-reporter-tries-to-shame-her permalink parent award report block reply WeWillRideAgain 12 points 4 days ago Thank you for the link. Explains it perfectly. \"A tone policing karen\" He's 100% right. permalink parent award report block reply hoodar 4 points 4 days ago Thank you, the commie feminazis are so butthurt that I can only hope this keeps happening. permalink parent award report block reply\nTaraa OP 13 points 4 days ago https://www.youtube.com/watch?v=sB3b8XN79t0 https://www.dailywire.com/news/sydney-sweeney-praised-for-keeping-her-cool-as-gq-reporter-tries-to-shame-her permalink parent award report block reply WeWillRideAgain 12 points 4 days ago Thank you for the link. Explains it perfectly. \"A tone policing karen\" He's 100% right. permalink parent award report block reply hoodar 4 points 4 days ago Thank you, the commie feminazis are so butthurt that I can only hope this keeps happening. permalink parent award report block reply\nWeWillRideAgain 12 points 4 days ago Thank you for the link. Explains it perfectly. \"A tone policing karen\" He's 100% right. permalink parent award report block reply\nhoodar 4 points 4 days ago Thank you, the commie feminazis are so butthurt that I can only hope this keeps happening. permalink parent award report block reply\nChyNahAzzWhole1 5 points 4 days ago When did Justin Bateman transition? permalink award report block reply\nVirtusHonos 3 points 4 days ago She wasn't a particularly persuasive interviewer. All that face mugging and trigger phrasing was a tell that she was performing for her narrow audience. permalink award report block reply\nGod-is-good 2 points 4 days ago Couldn’t handle the response to her vile grin eh? smiles a soft knowing smile permalink award report block reply\nWarGreymon77 2 points 4 days ago I thought Sydney was hot before, but that footage of her at the gun range made her even sexier, ya know? permalink award report block reply"}