{"id": "1ARK9nPd3x", "contents": "10 (www.thegatewaypundit.com) posted 6 hours ago by thegatewaybandit 7 comments award share report block HORROR: Pharmacy Student Gunned Down by 'Friend' During Birthday Celebration - Suspect Says it Was an Accident and Blames Mariju... A Wisconsin woman is facing a lengthy prison sentence following an unforgivable act of betrayal, but she has a ready-made excuse for her actions that does not add up. www.thegatewaypundit.com\n7 comments Sort by Top Top New Worst Old Save AfterGlow 4 points 6 hours ago What caliber was the bong? permalink award report block reply redditadminssuckit 3 points 5 hours ago \"Wisconsin woman\" is not the way you spell feral subhuman ape permalink award report block reply shadypollster 2 points 5 hours ago Weird how \"they\" nearly always seem to kill young White people who are worth more than a nickel. permalink award report block reply airborne3502 1 points 5 hours ago Guess which one shot the other one? Give you a hint: The one named Jamica. permalink award report block reply CheeseAndOnion 1 points 5 hours ago Have human friends and dont worry about being killed.  She mad her choice and must now RIP for them. permalink award report block reply Shaffro 1 points 4 hours ago Well, well, well... another usual suspect. permalink award report block reply t-bone 1 points 5 hours ago another bong rip that led to a shooting spree… Such a shame. permalink award report block reply\nAfterGlow 4 points 6 hours ago What caliber was the bong? permalink award report block reply\nredditadminssuckit 3 points 5 hours ago \"Wisconsin woman\" is not the way you spell feral subhuman ape permalink award report block reply\nshadypollster 2 points 5 hours ago Weird how \"they\" nearly always seem to kill young White people who are worth more than a nickel. permalink award report block reply\nairborne3502 1 points 5 hours ago Guess which one shot the other one? Give you a hint: The one named Jamica. permalink award report block reply\nCheeseAndOnion 1 points 5 hours ago Have human friends and dont worry about being killed.  She mad her choice and must now RIP for them. permalink award report block reply\nShaffro 1 points 4 hours ago Well, well, well... another usual suspect. permalink award report block reply\nt-bone 1 points 5 hours ago another bong rip that led to a shooting spree… Such a shame. permalink award report block reply"}