{"id": "1ARK9nPcvd", "contents": "39 Contact Trump to express disapproval of the \"needing Chinese students\" and \"needing H1B workers because Americans lack talent\" statements. He needs to hear it from his voter base that these sentiments are anti-MAGA and NOT okay. (www.whitehouse.gov) posted 3 hours ago by TheJakeFroggy 8 comments award share report block Contact Us Share your thoughts with President Donald J. Trump and Vice President JD Vance. www.whitehouse.gov\n8 comments Sort by Top Top New Worst Old Save ReallyGayMods 9 points 3 hours ago This should be stickied permalink award report block reply MemeWarsVet 1 points 2 hours ago You kidding? We have GP stuff for that! permalink parent award report block reply GatoradeJeb 1 points 3 hours ago But it wont because we have anti White mods who want us replaced by browns permalink parent award report block reply Appeal2Heaven98 1 points 1 hour ago Another post saying this exact same thing was stickied. Key word being \"was.\" permalink parent award report block reply Tweedlethree 1 points 29 minutes ago I have shared my disapproval with the White House and encourage everyone to do the same. It may be time for the America First movement to get better organized because we are obviously being betrayed. permalink award report block reply blitzkrieg1 1 points 3 hours ago There are around 1.2 million foreign students here already. permalink award report block reply BannedAccount 1 points 2 hours ago Unfortunately his voter base is Indians and chinese permalink award report block reply Female 0 points 3 hours ago We all know it's vance. https://scored.co/p/1ARK9nP5IR permalink award report block reply\nReallyGayMods 9 points 3 hours ago This should be stickied permalink award report block reply MemeWarsVet 1 points 2 hours ago You kidding? We have GP stuff for that! permalink parent award report block reply GatoradeJeb 1 points 3 hours ago But it wont because we have anti White mods who want us replaced by browns permalink parent award report block reply Appeal2Heaven98 1 points 1 hour ago Another post saying this exact same thing was stickied. Key word being \"was.\" permalink parent award report block reply\nMemeWarsVet 1 points 2 hours ago You kidding? We have GP stuff for that! permalink parent award report block reply\nGatoradeJeb 1 points 3 hours ago But it wont because we have anti White mods who want us replaced by browns permalink parent award report block reply\nAppeal2Heaven98 1 points 1 hour ago Another post saying this exact same thing was stickied. Key word being \"was.\" permalink parent award report block reply\nTweedlethree 1 points 29 minutes ago I have shared my disapproval with the White House and encourage everyone to do the same. It may be time for the America First movement to get better organized because we are obviously being betrayed. permalink award report block reply\nblitzkrieg1 1 points 3 hours ago There are around 1.2 million foreign students here already. permalink award report block reply\nBannedAccount 1 points 2 hours ago Unfortunately his voter base is Indians and chinese permalink award report block reply\nFemale 0 points 3 hours ago We all know it's vance. https://scored.co/p/1ARK9nP5IR permalink award report block reply"}