{"id": "1ARK9oYZsf", "contents": "1411 Secretary Brooke Rollins uncovers SNAP fraud:\n\n“5,000 dead people getting SNAP. And 500,000 people getting SNAP twice under the same name.\" posted 13 hours ago by Looniz74 PRO 87 comments award share report block The Post Millennial @TPostMillennial • 13h Secretary Brooke Rollins uncovers SNAP fraud: “5,000 dead people getting SNAP. And 500,000 people getting SNAP twice under the same name.\"\n87 comments Sort by Top Top New Worst Old Save Wupta PRO 79 points 13 hours ago At this point what’s the benefit of having any government programs?? permalink award report block reply Patriot4TN 33 points 13 hours ago If they have no goberment programs, how can they rob the American citizen? They need your money to funnel kickbacks into their coffers... permalink parent award report block reply guywholikesDjtof2024 14 points 12 hours ago ALL public service government programs have dead people on them. So do voting rolls. Prove me wrong permalink parent award report block reply Hanging_Chad 2 points 11 hours ago at least 2 voters will have died by the time all of the rolls have been checked tho permalink parent award report block reply MemoryHoleyeO 8 points 12 hours ago To perpetuate fraud and buy votes permalink parent award report block reply Zskills 7 points 12 hours ago Subsidizing the Walton Family permalink parent award report block reply negative_entropy 4 points 10 hours ago Rockefellers too permalink parent award report block reply SimaYi 1 points 9 hours ago Have to feed the third world and our resident feral blacks. permalink parent award report block reply load 2 more comments... deleted 50 points 13 hours ago IllIllIll 18 points 13 hours ago Yes I agree the Federal Government is too corrupt to fix. So far I haven't even noticed they're shut down. Of course, whether or not the government works, I'm still not getting any discount on my taxes. permalink parent award report block reply josiborg 25 points 13 hours ago The only way I believe this is if those numbers are from one county. Fraud is way bigger than this. permalink award report block reply IncredibleMrE1 31 points 13 hours ago We're talking about the 30 states that complied and turned over the data. The fact that they did so means they likely don't have as much fraud as the other 20 that refused and are having to be sued. But yeah, there's no chance the fraud is this small. permalink parent award report block reply Hanging_Chad 4 points 11 hours ago there's no chance the fraud is this small and definitely not exactly 5,000 / 500,000 permalink parent award report block reply OutlawPurpleHairDye 22 points 13 hours ago Double gibs?  Is that why so many need huge SUVs with tinted windows to haul all the extra food? permalink award report block reply LookFatty 4 points 11 hours ago And extra fat sow's ? permalink parent award report block reply TheRedPilledArtist 4 points 13 hours ago Aw, snap permalink parent award report block reply DustyGoose 14 points 13 hours ago Wtf, I'm paying taxes and can't do anything without buying a permit, how are people defrauding the government so prolifically? permalink award report block reply Formerlurker92 8 points 12 hours ago The government wants it this way permalink parent award report block reply birdgator 1 points 1 hour ago Comment removed by community filter, pending further review. permalink parent award report block reply TDAF 11 points 13 hours ago Tell me again about no widespread voter fraud. permalink award report block reply SaltyKrakenBalls 10 points 13 hours ago Justice is dead when Fraud is everywhere. permalink award report block reply DontTreadOnLego 9 points 13 hours ago Thank you demo-rats for causing us to be able to locate SNAP fraud by shutting down government for a month a change. permalink award report block reply LookFatty 3 points 11 hours ago This guy gets it !!! permalink parent award report block reply MythArcana 9 points 13 hours ago Sometimes we eat, sometimes we eat twice.    💸🐷 permalink award report block reply Nomad899 5 points 12 hours ago Second breakfast permalink parent award report block reply Alaskan 3 points 12 hours ago But I did eat breakfast. Twice. permalink parent award report block reply guywholikesDjtof2024 1 points 12 hours ago MONEY PIG!!!!! permalink parent award report block reply MEME-SUPREME 8 points 12 hours ago Arrests when? permalink award report block reply SimaYi 2 points 9 hours ago Right after Obama. permalink parent award report block reply guywholikesDjtof2024 2 points 12 hours ago 2mw permalink parent award report block reply prisoner_of_funk 2 points 9 hours ago Suing for repayment of benefits when?  Cutting off fraud accounts when? permalink parent award report block reply SavingPrivateGrace 7 points 12 hours ago I would love to see more data that's been uncovered by DOGE.  Why is it such a secret.  Show us how many got on SNAP from 2020, how many military age men with 1 kid (we saw them walking in).  It's not just about the fraud she's talking about, double dipping and dead are from 20 years, what about the last 5 years. permalink award report block reply LearnAboutRoaches 6 points 11 hours ago Notice how she says.. how they all say \"There are 5,000 dead people getting snap and\" .. etc etc. Notice they never say: We found 5,000 cases of fraud that have now had their benefits removed.. It's always the same bs, hey did you know they are all getting this, right now Why the fuck isn't it shut off the second they \"find it\"? Because it's bullshit. All of them sound 100% full of shit permalink award report block reply justicein2020 2 points 7 hours ago Pedo appointed judge in some random blue state says you gotta keep paying the dead people. permalink parent award report block reply birdgator 1 points 1 hour ago Comment removed by community filter, pending further review. permalink parent award report block reply Spawnlingman 5 points 12 hours ago Im not paying taxes.  Come shoot me.  I dont care anymore.  Fuck the government. permalink award report block reply Ey3sOpen 2 points 7 hours ago Oh, but YOU will go to jail, just not the SNAP fraudsters and illegal voters. It's selective prosecution in this country permalink parent award report block reply learntocode 4 points 12 hours ago 1/3 of my \"paycheck\" is deducted each fucking check. 1/3rd!!! And the streets have human shit everywhere, the street lights are out, trash strewn everywhere, and nobody in office fuckin cares we just get more tyranny. permalink award report block reply ViagraFalls 3 points 12 hours ago You’re figuring out full democracy is a scam. It doesn’t do any of the things democracy is supposed to do but instead ensures we get tyranny and corruption. Full democracies can always be bought, and the banker class has all the money in the world. permalink parent award report block reply SimaYi 3 points 9 hours ago Democracy only works in White ethnostates. permalink parent award report block reply ViagraFalls 1 points 8 hours ago Where only land-owning white men can vote. We tried that once, but that most vital rule was not made into unalterable law. I think we need to learn from history and acknowledge that propaganda and subversion are a huge threat and will be used to alter the most important foundations of a sane governance. permalink parent award report block reply learntocode 1 points 9 hours ago It gets flustering. They can be rich, go ahead. Just stop making everything so shitty! But they cannot help themselves. They just have to make everything ugly and shitty. As soon as we start talking about central banks lending us our currency another terror attack or som dumb shit pops off. permalink parent award report block reply ViagraFalls 1 points 8 hours ago It’s also antisemitism to talk about such things. 👃 permalink parent award report block reply birdgator 1 points 1 hour ago Comment removed by community filter, pending further review. permalink parent award report block reply PatriotSkorzeny 3 points 12 hours ago Nursing homes and dead SSN’s. Have a look. 🤣🤣 permalink award report block reply LurkNoMore 3 points 13 hours ago Well... they gotta eat before they go vote D. permalink award report block reply SquirreleeDan 2 points 11 hours ago I should have went down the evil path in life I realize more and more. permalink award report block reply SimaYi 3 points 9 hours ago Yup. I sit here wondering why I'm still the schmuck playing by the rules. All those USAID packages worth millions, run by nappy headed black women and \"Brazillians\". Driving around in nice cars and living in nice homes. And what do I get for paying taxes and not lying and cheating at every opportunity? Jack shit. This country is run by criminals, and only criminals make it. Why? 50% white population and dropping. This is the state of the world everywhere that White people aren't. And now it's here too. permalink parent award report block reply Beachhead 2 points 6 hours ago Force people to pay them back or throw them on a chain gang. permalink award report block reply Formerlurker92 1 points 12 hours ago Shoot the guilty permalink award report block reply JoeMcCarthyWasRight 1 points 13 hours ago For decades. permalink award report block reply YaharaRiver 0 points 12 hours ago Not really.  This is quite new! permalink parent award report block reply PatriotDescendant 1 points 3 hours ago For Christ sakes, I noticed problems back in 2005: The classic two piles of food, the basics paid with coupons (food stamps), luxury or excluded items with cash, and then they climb into a brand new pickup truck. (Rural Cleveland, TX!) Trump is getting a lot done. By God, this country has millions of assholes leeching our tax dollars, all aided and abetted by feckless dems AND RHINOS!!!! permalink award report block reply cyberwar 1 points 9 hours ago how is this even possible permalink award report block reply Necrovoter 1 points 6 hours ago I hope people aren't suggesting that previously alive citizens don't deserve much needed benefits like SNAP.   George Washington can't hold a job anymore, and probably doesn't get any social security money either.  How is he supposed to afford groceries?\nEspecially now that one Porterhouse steak costs more than a full cow did in his day. Next thing you know, people will be trying to take away our voting rights! permalink award report block reply ChyNahAzzWhole1 1 points 2 hours ago Scrap it. They need to reapply and who doesn't reapply get turned off. permalink award report block reply TNgirl4Trump 1 points 1 hour ago I hope she and someone on RFK Jr’s team are following the x account EBT of TIKTOK. The entitlement and abuse is disgusting. Hard working Americans should not be funding so much fraud. Where is DOGE???? permalink award report block reply Looniz74 OP PRO 1 points 13 hours ago https://x.com/TPostMillennial/status/1988787369915601050?s=20 permalink award report block reply vongregormench 1 points 11 hours ago We obviously can’t jail 500k people. Gonna have to fine them. permalink award report block reply Fangerang 1 points 11 hours ago Almost like it should all be canceled.... permalink award report block reply Tiberius1 1 points 12 hours ago Enough talk.  Purge and prosecute these motherfuckers. permalink award report block reply guywholikesDjtof2024 1 points 12 hours ago these mothe** If your slur was correct, they would be in jail. permalink parent award report block reply Tiberius1 1 points 12 hours ago If my slur was correct your commie faggot ass would elect them to positions of power. permalink parent award report block reply guywholikesDjtof2024 1 points 12 hours ago you must be a commie because you love Ephesians 4:29 what They hate that Verse. And they say it too. permalink parent award report block reply emorphia 1 points 4 hours ago wake me up when something is done about it.. permalink award report block reply MonolitoVeritas 1 points 12 hours ago the states get the money from the feds.  When the states are found corrupt, the feds, who represent tax paying citizens, MUST be held accountable.  If it means sending the governors to prison and or fines and other penalties ...then that the way it must be.   Without accountability and punishment our laws are meaningless. permalink award report block reply SimaYi 2 points 9 hours ago Best we can do is infinity H1B from India. More fucking scammers and fraudsters. permalink parent award report block reply cook_does 1 points 11 hours ago Double portion Negros permalink award report block reply throttlejohnson 1 points 11 hours ago so sick of this bullshit...shut it the fuck down already. permalink award report block reply Wrexxis780 1 points 12 hours ago Make whoever is getting it pay it back. Either with cash or labor permalink award report block reply SimaYi 1 points 9 hours ago In a just world. permalink parent award report block reply cherokeepeople 1 points 10 hours ago and who is using those snap cards of dead people they need to be prosecuted for welfare fraud. permalink award report block reply SimaYi 1 points 9 hours ago Bring back hard labor camps. permalink parent award report block reply SisterCovfefeToo 1 points 11 hours ago Are they really getting paid SNAP twice or is it just two records with different addresses etc? If they are getting paid twice, why doesn't the govt have processes in place to prevent it? Is someone spending the SNAP of the 5000 dead people bc of fraud or is it that the govt hasn't had a chance to cut the money off bc no one reported them dead? Five thousand seems too low for fraud. I'd like to know if this is hyperbole before I react. permalink award report block reply SimaYi 0 points 9 hours ago Don't worry your pretty little head about it. I'm sure it's all legit. I mean, why would anyone defraud the government at the taxpayers expense? Probably never happens. People are way too honorable for such misdeeds. And even if they did, nothing would be done about it anyway. So why worry? Just surf the Kali Yuga. permalink parent award report block reply SisterCovfefeToo 1 points 5 hours ago You're right, of course. The government has NEVER exaggerated or omitted information in order to sell a talking point. permalink parent award report block reply OrangeManBadasss 1 points 3 hours ago 5000 and 500,000 so far.... permalink award report block reply GoldwaterVoter 1 points 11 hours ago SNAP! Well-named program. permalink award report block reply projectarcturus1 1 points 12 hours ago It is so much more than that. permalink award report block reply The_RedWolf 1 points 11 hours ago 5,000 is pretty low given how many people have been on the program at some point That 500,000 problem is 5000x worse permalink award report block reply Kiowa4Trump 1 points 11 hours ago Am I the only one that thinks that if 5,000 dead people are on SNAP, then that’s pretty good. Likely that is missing 2 or 3 zeros! permalink award report block reply 20FREEDOMLIBERTY20 1 points 2 hours ago Shut it down and make people show up in person for benefits. This fraud affects all US taxpayers. And many of the recipients don’t pay taxes. permalink award report block reply HockeyMom4Trump 1 points 8 hours ago SUPPLEMENTAL NUTRITION not pay for all your junk… permalink award report block reply Klown_Kutz 0 points 5 hours ago You really have no idea just how much fraud is going on on in da black comroonity. permalink award report block reply Obambi 0 points 3 hours ago And no arrests permalink award report block reply birdgator 1 points 1 hour ago Comment removed by community filter, pending further review. permalink award report block reply\nWupta PRO 79 points 13 hours ago At this point what’s the benefit of having any government programs?? permalink award report block reply Patriot4TN 33 points 13 hours ago If they have no goberment programs, how can they rob the American citizen? They need your money to funnel kickbacks into their coffers... permalink parent award report block reply guywholikesDjtof2024 14 points 12 hours ago ALL public service government programs have dead people on them. So do voting rolls. Prove me wrong permalink parent award report block reply Hanging_Chad 2 points 11 hours ago at least 2 voters will have died by the time all of the rolls have been checked tho permalink parent award report block reply MemoryHoleyeO 8 points 12 hours ago To perpetuate fraud and buy votes permalink parent award report block reply Zskills 7 points 12 hours ago Subsidizing the Walton Family permalink parent award report block reply negative_entropy 4 points 10 hours ago Rockefellers too permalink parent award report block reply SimaYi 1 points 9 hours ago Have to feed the third world and our resident feral blacks. permalink parent award report block reply load 2 more comments...\nPatriot4TN 33 points 13 hours ago If they have no goberment programs, how can they rob the American citizen? They need your money to funnel kickbacks into their coffers... permalink parent award report block reply\nguywholikesDjtof2024 14 points 12 hours ago ALL public service government programs have dead people on them. So do voting rolls. Prove me wrong permalink parent award report block reply Hanging_Chad 2 points 11 hours ago at least 2 voters will have died by the time all of the rolls have been checked tho permalink parent award report block reply\nHanging_Chad 2 points 11 hours ago at least 2 voters will have died by the time all of the rolls have been checked tho permalink parent award report block reply\nMemoryHoleyeO 8 points 12 hours ago To perpetuate fraud and buy votes permalink parent award report block reply\nZskills 7 points 12 hours ago Subsidizing the Walton Family permalink parent award report block reply negative_entropy 4 points 10 hours ago Rockefellers too permalink parent award report block reply\nnegative_entropy 4 points 10 hours ago Rockefellers too permalink parent award report block reply\nSimaYi 1 points 9 hours ago Have to feed the third world and our resident feral blacks. permalink parent award report block reply\ndeleted 50 points 13 hours ago IllIllIll 18 points 13 hours ago Yes I agree the Federal Government is too corrupt to fix. So far I haven't even noticed they're shut down. Of course, whether or not the government works, I'm still not getting any discount on my taxes. permalink parent award report block reply\nIllIllIll 18 points 13 hours ago Yes I agree the Federal Government is too corrupt to fix. So far I haven't even noticed they're shut down. Of course, whether or not the government works, I'm still not getting any discount on my taxes. permalink parent award report block reply\njosiborg 25 points 13 hours ago The only way I believe this is if those numbers are from one county. Fraud is way bigger than this. permalink award report block reply IncredibleMrE1 31 points 13 hours ago We're talking about the 30 states that complied and turned over the data. The fact that they did so means they likely don't have as much fraud as the other 20 that refused and are having to be sued. But yeah, there's no chance the fraud is this small. permalink parent award report block reply Hanging_Chad 4 points 11 hours ago there's no chance the fraud is this small and definitely not exactly 5,000 / 500,000 permalink parent award report block reply\nIncredibleMrE1 31 points 13 hours ago We're talking about the 30 states that complied and turned over the data. The fact that they did so means they likely don't have as much fraud as the other 20 that refused and are having to be sued. But yeah, there's no chance the fraud is this small. permalink parent award report block reply Hanging_Chad 4 points 11 hours ago there's no chance the fraud is this small and definitely not exactly 5,000 / 500,000 permalink parent award report block reply\nHanging_Chad 4 points 11 hours ago there's no chance the fraud is this small and definitely not exactly 5,000 / 500,000 permalink parent award report block reply\nOutlawPurpleHairDye 22 points 13 hours ago Double gibs?  Is that why so many need huge SUVs with tinted windows to haul all the extra food? permalink award report block reply LookFatty 4 points 11 hours ago And extra fat sow's ? permalink parent award report block reply TheRedPilledArtist 4 points 13 hours ago Aw, snap permalink parent award report block reply\nLookFatty 4 points 11 hours ago And extra fat sow's ? permalink parent award report block reply\nTheRedPilledArtist 4 points 13 hours ago Aw, snap permalink parent award report block reply\nDustyGoose 14 points 13 hours ago Wtf, I'm paying taxes and can't do anything without buying a permit, how are people defrauding the government so prolifically? permalink award report block reply Formerlurker92 8 points 12 hours ago The government wants it this way permalink parent award report block reply birdgator 1 points 1 hour ago Comment removed by community filter, pending further review. permalink parent award report block reply\nFormerlurker92 8 points 12 hours ago The government wants it this way permalink parent award report block reply\nbirdgator 1 points 1 hour ago Comment removed by community filter, pending further review. permalink parent award report block reply\nTDAF 11 points 13 hours ago Tell me again about no widespread voter fraud. permalink award report block reply\nSaltyKrakenBalls 10 points 13 hours ago Justice is dead when Fraud is everywhere. permalink award report block reply\nDontTreadOnLego 9 points 13 hours ago Thank you demo-rats for causing us to be able to locate SNAP fraud by shutting down government for a month a change. permalink award report block reply LookFatty 3 points 11 hours ago This guy gets it !!! permalink parent award report block reply\nLookFatty 3 points 11 hours ago This guy gets it !!! permalink parent award report block reply\nMythArcana 9 points 13 hours ago Sometimes we eat, sometimes we eat twice.    💸🐷 permalink award report block reply Nomad899 5 points 12 hours ago Second breakfast permalink parent award report block reply Alaskan 3 points 12 hours ago But I did eat breakfast. Twice. permalink parent award report block reply guywholikesDjtof2024 1 points 12 hours ago MONEY PIG!!!!! permalink parent award report block reply\nNomad899 5 points 12 hours ago Second breakfast permalink parent award report block reply Alaskan 3 points 12 hours ago But I did eat breakfast. Twice. permalink parent award report block reply\nAlaskan 3 points 12 hours ago But I did eat breakfast. Twice. permalink parent award report block reply\nguywholikesDjtof2024 1 points 12 hours ago MONEY PIG!!!!! permalink parent award report block reply\nMEME-SUPREME 8 points 12 hours ago Arrests when? permalink award report block reply SimaYi 2 points 9 hours ago Right after Obama. permalink parent award report block reply guywholikesDjtof2024 2 points 12 hours ago 2mw permalink parent award report block reply prisoner_of_funk 2 points 9 hours ago Suing for repayment of benefits when?  Cutting off fraud accounts when? permalink parent award report block reply\nSimaYi 2 points 9 hours ago Right after Obama. permalink parent award report block reply\nguywholikesDjtof2024 2 points 12 hours ago 2mw permalink parent award report block reply\nprisoner_of_funk 2 points 9 hours ago Suing for repayment of benefits when?  Cutting off fraud accounts when? permalink parent award report block reply\nSavingPrivateGrace 7 points 12 hours ago I would love to see more data that's been uncovered by DOGE.  Why is it such a secret.  Show us how many got on SNAP from 2020, how many military age men with 1 kid (we saw them walking in).  It's not just about the fraud she's talking about, double dipping and dead are from 20 years, what about the last 5 years. permalink award report block reply\nLearnAboutRoaches 6 points 11 hours ago Notice how she says.. how they all say \"There are 5,000 dead people getting snap and\" .. etc etc. Notice they never say: We found 5,000 cases of fraud that have now had their benefits removed.. It's always the same bs, hey did you know they are all getting this, right now Why the fuck isn't it shut off the second they \"find it\"? Because it's bullshit. All of them sound 100% full of shit permalink award report block reply justicein2020 2 points 7 hours ago Pedo appointed judge in some random blue state says you gotta keep paying the dead people. permalink parent award report block reply birdgator 1 points 1 hour ago Comment removed by community filter, pending further review. permalink parent award report block reply\njusticein2020 2 points 7 hours ago Pedo appointed judge in some random blue state says you gotta keep paying the dead people. permalink parent award report block reply\nbirdgator 1 points 1 hour ago Comment removed by community filter, pending further review. permalink parent award report block reply\nSpawnlingman 5 points 12 hours ago Im not paying taxes.  Come shoot me.  I dont care anymore.  Fuck the government. permalink award report block reply Ey3sOpen 2 points 7 hours ago Oh, but YOU will go to jail, just not the SNAP fraudsters and illegal voters. It's selective prosecution in this country permalink parent award report block reply\nEy3sOpen 2 points 7 hours ago Oh, but YOU will go to jail, just not the SNAP fraudsters and illegal voters. It's selective prosecution in this country permalink parent award report block reply\nlearntocode 4 points 12 hours ago 1/3 of my \"paycheck\" is deducted each fucking check. 1/3rd!!! And the streets have human shit everywhere, the street lights are out, trash strewn everywhere, and nobody in office fuckin cares we just get more tyranny. permalink award report block reply ViagraFalls 3 points 12 hours ago You’re figuring out full democracy is a scam. It doesn’t do any of the things democracy is supposed to do but instead ensures we get tyranny and corruption. Full democracies can always be bought, and the banker class has all the money in the world. permalink parent award report block reply SimaYi 3 points 9 hours ago Democracy only works in White ethnostates. permalink parent award report block reply ViagraFalls 1 points 8 hours ago Where only land-owning white men can vote. We tried that once, but that most vital rule was not made into unalterable law. I think we need to learn from history and acknowledge that propaganda and subversion are a huge threat and will be used to alter the most important foundations of a sane governance. permalink parent award report block reply learntocode 1 points 9 hours ago It gets flustering. They can be rich, go ahead. Just stop making everything so shitty! But they cannot help themselves. They just have to make everything ugly and shitty. As soon as we start talking about central banks lending us our currency another terror attack or som dumb shit pops off. permalink parent award report block reply ViagraFalls 1 points 8 hours ago It’s also antisemitism to talk about such things. 👃 permalink parent award report block reply birdgator 1 points 1 hour ago Comment removed by community filter, pending further review. permalink parent award report block reply\nViagraFalls 3 points 12 hours ago You’re figuring out full democracy is a scam. It doesn’t do any of the things democracy is supposed to do but instead ensures we get tyranny and corruption. Full democracies can always be bought, and the banker class has all the money in the world. permalink parent award report block reply SimaYi 3 points 9 hours ago Democracy only works in White ethnostates. permalink parent award report block reply ViagraFalls 1 points 8 hours ago Where only land-owning white men can vote. We tried that once, but that most vital rule was not made into unalterable law. I think we need to learn from history and acknowledge that propaganda and subversion are a huge threat and will be used to alter the most important foundations of a sane governance. permalink parent award report block reply learntocode 1 points 9 hours ago It gets flustering. They can be rich, go ahead. Just stop making everything so shitty! But they cannot help themselves. They just have to make everything ugly and shitty. As soon as we start talking about central banks lending us our currency another terror attack or som dumb shit pops off. permalink parent award report block reply ViagraFalls 1 points 8 hours ago It’s also antisemitism to talk about such things. 👃 permalink parent award report block reply birdgator 1 points 1 hour ago Comment removed by community filter, pending further review. permalink parent award report block reply\nSimaYi 3 points 9 hours ago Democracy only works in White ethnostates. permalink parent award report block reply ViagraFalls 1 points 8 hours ago Where only land-owning white men can vote. We tried that once, but that most vital rule was not made into unalterable law. I think we need to learn from history and acknowledge that propaganda and subversion are a huge threat and will be used to alter the most important foundations of a sane governance. permalink parent award report block reply\nViagraFalls 1 points 8 hours ago Where only land-owning white men can vote. We tried that once, but that most vital rule was not made into unalterable law. I think we need to learn from history and acknowledge that propaganda and subversion are a huge threat and will be used to alter the most important foundations of a sane governance. permalink parent award report block reply\nlearntocode 1 points 9 hours ago It gets flustering. They can be rich, go ahead. Just stop making everything so shitty! But they cannot help themselves. They just have to make everything ugly and shitty. As soon as we start talking about central banks lending us our currency another terror attack or som dumb shit pops off. permalink parent award report block reply ViagraFalls 1 points 8 hours ago It’s also antisemitism to talk about such things. 👃 permalink parent award report block reply birdgator 1 points 1 hour ago Comment removed by community filter, pending further review. permalink parent award report block reply\nViagraFalls 1 points 8 hours ago It’s also antisemitism to talk about such things. 👃 permalink parent award report block reply\nbirdgator 1 points 1 hour ago Comment removed by community filter, pending further review. permalink parent award report block reply\nPatriotSkorzeny 3 points 12 hours ago Nursing homes and dead SSN’s. Have a look. 🤣🤣 permalink award report block reply\nLurkNoMore 3 points 13 hours ago Well... they gotta eat before they go vote D. permalink award report block reply\nSquirreleeDan 2 points 11 hours ago I should have went down the evil path in life I realize more and more. permalink award report block reply SimaYi 3 points 9 hours ago Yup. I sit here wondering why I'm still the schmuck playing by the rules. All those USAID packages worth millions, run by nappy headed black women and \"Brazillians\". Driving around in nice cars and living in nice homes. And what do I get for paying taxes and not lying and cheating at every opportunity? Jack shit. This country is run by criminals, and only criminals make it. Why? 50% white population and dropping. This is the state of the world everywhere that White people aren't. And now it's here too. permalink parent award report block reply\nSimaYi 3 points 9 hours ago Yup. I sit here wondering why I'm still the schmuck playing by the rules. All those USAID packages worth millions, run by nappy headed black women and \"Brazillians\". Driving around in nice cars and living in nice homes. And what do I get for paying taxes and not lying and cheating at every opportunity? Jack shit. This country is run by criminals, and only criminals make it. Why? 50% white population and dropping. This is the state of the world everywhere that White people aren't. And now it's here too. permalink parent award report block reply\nBeachhead 2 points 6 hours ago Force people to pay them back or throw them on a chain gang. permalink award report block reply\nFormerlurker92 1 points 12 hours ago Shoot the guilty permalink award report block reply\nJoeMcCarthyWasRight 1 points 13 hours ago For decades. permalink award report block reply YaharaRiver 0 points 12 hours ago Not really.  This is quite new! permalink parent award report block reply\nYaharaRiver 0 points 12 hours ago Not really.  This is quite new! permalink parent award report block reply\nPatriotDescendant 1 points 3 hours ago For Christ sakes, I noticed problems back in 2005: The classic two piles of food, the basics paid with coupons (food stamps), luxury or excluded items with cash, and then they climb into a brand new pickup truck. (Rural Cleveland, TX!) Trump is getting a lot done. By God, this country has millions of assholes leeching our tax dollars, all aided and abetted by feckless dems AND RHINOS!!!! permalink award report block reply\ncyberwar 1 points 9 hours ago how is this even possible permalink award report block reply\nNecrovoter 1 points 6 hours ago I hope people aren't suggesting that previously alive citizens don't deserve much needed benefits like SNAP.   George Washington can't hold a job anymore, and probably doesn't get any social security money either.  How is he supposed to afford groceries?\nEspecially now that one Porterhouse steak costs more than a full cow did in his day. Next thing you know, people will be trying to take away our voting rights! permalink award report block reply\nChyNahAzzWhole1 1 points 2 hours ago Scrap it. They need to reapply and who doesn't reapply get turned off. permalink award report block reply\nTNgirl4Trump 1 points 1 hour ago I hope she and someone on RFK Jr’s team are following the x account EBT of TIKTOK. The entitlement and abuse is disgusting. Hard working Americans should not be funding so much fraud. Where is DOGE???? permalink award report block reply\nLooniz74 OP PRO 1 points 13 hours ago https://x.com/TPostMillennial/status/1988787369915601050?s=20 permalink award report block reply\nvongregormench 1 points 11 hours ago We obviously can’t jail 500k people. Gonna have to fine them. permalink award report block reply\nFangerang 1 points 11 hours ago Almost like it should all be canceled.... permalink award report block reply\nTiberius1 1 points 12 hours ago Enough talk.  Purge and prosecute these motherfuckers. permalink award report block reply guywholikesDjtof2024 1 points 12 hours ago these mothe** If your slur was correct, they would be in jail. permalink parent award report block reply Tiberius1 1 points 12 hours ago If my slur was correct your commie faggot ass would elect them to positions of power. permalink parent award report block reply guywholikesDjtof2024 1 points 12 hours ago you must be a commie because you love Ephesians 4:29 what They hate that Verse. And they say it too. permalink parent award report block reply\nguywholikesDjtof2024 1 points 12 hours ago these mothe** If your slur was correct, they would be in jail. permalink parent award report block reply Tiberius1 1 points 12 hours ago If my slur was correct your commie faggot ass would elect them to positions of power. permalink parent award report block reply guywholikesDjtof2024 1 points 12 hours ago you must be a commie because you love Ephesians 4:29 what They hate that Verse. And they say it too. permalink parent award report block reply\nTiberius1 1 points 12 hours ago If my slur was correct your commie faggot ass would elect them to positions of power. permalink parent award report block reply guywholikesDjtof2024 1 points 12 hours ago you must be a commie because you love Ephesians 4:29 what They hate that Verse. And they say it too. permalink parent award report block reply\nguywholikesDjtof2024 1 points 12 hours ago you must be a commie because you love Ephesians 4:29 what They hate that Verse. And they say it too. permalink parent award report block reply\nemorphia 1 points 4 hours ago wake me up when something is done about it.. permalink award report block reply\nMonolitoVeritas 1 points 12 hours ago the states get the money from the feds.  When the states are found corrupt, the feds, who represent tax paying citizens, MUST be held accountable.  If it means sending the governors to prison and or fines and other penalties ...then that the way it must be.   Without accountability and punishment our laws are meaningless. permalink award report block reply SimaYi 2 points 9 hours ago Best we can do is infinity H1B from India. More fucking scammers and fraudsters. permalink parent award report block reply\nSimaYi 2 points 9 hours ago Best we can do is infinity H1B from India. More fucking scammers and fraudsters. permalink parent award report block reply\ncook_does 1 points 11 hours ago Double portion Negros permalink award report block reply\nthrottlejohnson 1 points 11 hours ago so sick of this bullshit...shut it the fuck down already. permalink award report block reply\nWrexxis780 1 points 12 hours ago Make whoever is getting it pay it back. Either with cash or labor permalink award report block reply SimaYi 1 points 9 hours ago In a just world. permalink parent award report block reply\nSimaYi 1 points 9 hours ago In a just world. permalink parent award report block reply\ncherokeepeople 1 points 10 hours ago and who is using those snap cards of dead people they need to be prosecuted for welfare fraud. permalink award report block reply SimaYi 1 points 9 hours ago Bring back hard labor camps. permalink parent award report block reply\nSimaYi 1 points 9 hours ago Bring back hard labor camps. permalink parent award report block reply\nSisterCovfefeToo 1 points 11 hours ago Are they really getting paid SNAP twice or is it just two records with different addresses etc? If they are getting paid twice, why doesn't the govt have processes in place to prevent it? Is someone spending the SNAP of the 5000 dead people bc of fraud or is it that the govt hasn't had a chance to cut the money off bc no one reported them dead? Five thousand seems too low for fraud. I'd like to know if this is hyperbole before I react. permalink award report block reply SimaYi 0 points 9 hours ago Don't worry your pretty little head about it. I'm sure it's all legit. I mean, why would anyone defraud the government at the taxpayers expense? Probably never happens. People are way too honorable for such misdeeds. And even if they did, nothing would be done about it anyway. So why worry? Just surf the Kali Yuga. permalink parent award report block reply SisterCovfefeToo 1 points 5 hours ago You're right, of course. The government has NEVER exaggerated or omitted information in order to sell a talking point. permalink parent award report block reply\nSimaYi 0 points 9 hours ago Don't worry your pretty little head about it. I'm sure it's all legit. I mean, why would anyone defraud the government at the taxpayers expense? Probably never happens. People are way too honorable for such misdeeds. And even if they did, nothing would be done about it anyway. So why worry? Just surf the Kali Yuga. permalink parent award report block reply SisterCovfefeToo 1 points 5 hours ago You're right, of course. The government has NEVER exaggerated or omitted information in order to sell a talking point. permalink parent award report block reply\nSisterCovfefeToo 1 points 5 hours ago You're right, of course. The government has NEVER exaggerated or omitted information in order to sell a talking point. permalink parent award report block reply\nOrangeManBadasss 1 points 3 hours ago 5000 and 500,000 so far.... permalink award report block reply\nGoldwaterVoter 1 points 11 hours ago SNAP! Well-named program. permalink award report block reply\nprojectarcturus1 1 points 12 hours ago It is so much more than that. permalink award report block reply\nThe_RedWolf 1 points 11 hours ago 5,000 is pretty low given how many people have been on the program at some point That 500,000 problem is 5000x worse permalink award report block reply\nKiowa4Trump 1 points 11 hours ago Am I the only one that thinks that if 5,000 dead people are on SNAP, then that’s pretty good. Likely that is missing 2 or 3 zeros! permalink award report block reply\n20FREEDOMLIBERTY20 1 points 2 hours ago Shut it down and make people show up in person for benefits. This fraud affects all US taxpayers. And many of the recipients don’t pay taxes. permalink award report block reply\nHockeyMom4Trump 1 points 8 hours ago SUPPLEMENTAL NUTRITION not pay for all your junk… permalink award report block reply\nKlown_Kutz 0 points 5 hours ago You really have no idea just how much fraud is going on on in da black comroonity. permalink award report block reply\nObambi 0 points 3 hours ago And no arrests permalink award report block reply\nbirdgator 1 points 1 hour ago Comment removed by community filter, pending further review. permalink award report block reply"}