{"id": "1ARK9pgQMz", "contents": "153 Ironic. DIDN'T  EARN  IT posted 2 hours ago by dirtysanchez69 26 comments award share download report block\n26 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style Jesko603 13 points 2 hours ago Articulate, sounds accurate.  There is very little articulate about an angry Black women. permalink award report block reply entwickelnden 5 points 36 minutes ago That was my thought, the constant screeching and chomping out isn't articulate. Wow, I agree with big mike here. permalink parent award report block reply kaduh 6 points 2 hours ago Fuck that guy. permalink award report block reply jamesm56 5 points 53 minutes ago They probably do think they're holding back. Maybe one reason they think they have it so bad is because everyone else doesn't complain as much, so they think everyone else is better off. permalink award report block reply mygovisacommie 5 points 1 hour ago And as a black man, he should know that. permalink award report block reply Jack_NC 5 points 2 hours ago If you want a laugh, go to Google.com and enter Why are black women so The suggested queries are... let's just say \"incomplete\" permalink award report block reply South_Florida_Guy 3 points 1 hour ago OMG I just did and wow the only accurate one is \"muscular\" And when you put why are white women so....\nThere's almost no results permalink parent award report block reply ModernKnight 1 points 10 minutes ago Comment removed by community filter. permalink parent award report block reply PhantomShield72 5 points 1 hour ago I've seen much - too much - \"articulating\" of pain. In Walmart. In a Spirit Airlines Terminal. On a Carnival cruise. In a convenience store. In a McDonalds. On public transportation. On TikTok. Nah - I'm good, Mike - I'm good... permalink award report block reply Muzzah 4 points 37 minutes ago “woman” permalink award report block reply 26magarat 3 points 44 minutes ago From the woman who wrote two memoirs. permalink award report block reply CleanUpPhillyTrump24 2 points 44 minutes ago Pretty much no one things that Big Mike is a woman anymore. Ask anyone in the black community, and they'll quietly mutter disgust. The Obama sheen has turned into an oil slick in a mud puddle. permalink award report block reply airborne3502 1 points 2 hours ago Yeah, like when that white woman asked you to get something off the top shelf for her. Surprised Alex Haley didn't put that one in Roots. permalink award report block reply here2red 1 points 42 minutes ago If I get anymore \"articulation\" i'll kill myself. permalink award report block reply NotYourMan 1 points 1 hour ago Maybe a bit of a change, \"Fabulously wealthy black woman complains about oppression of her race and sex.\" permalink award report block reply someguy7738 1 points 1 hour ago Yes, they certainly don't articulate. Rather they hoot and holler. permalink award report block reply booblitchutz 1 points 25 minutes ago She said on a 2 hour weekly podcast where she spends the entire time complaining (brought to you by Ford and Procter & Gamble). permalink award report block reply NotVladimirPutin 1 points 1 minute ago Lol permalink award report block reply WanderingStar 1 points 1 minute ago Clearly, s/he doesn't shop at Walmart. permalink award report block reply cosmos411 1 points 11 minutes ago She's not lying. Black women don't articulate their pain, they scream it like an angry simian while tearing shit apart. permalink award report block reply MAG-n-KAG 1 points 46 minutes ago reminds of how they articulated their pain after one of theirs got shot up and died in the streets.  they started twerking on the the ambulance and firetrucks.  it was so touching to see such raw emotion displayed.  i put my hand on my heart and cried. permalink award report block reply RoninIV 1 points 21 minutes ago Solid proof right there that he's not a black woman permalink award report block reply vote_for_MAGA_2020 1 points 33 minutes ago They never ever shut up ever permalink award report block reply TheLivingExample 1 points 32 minutes ago Battlefield Earth. permalink award report block reply KewMan 1 points 2 hours ago Does Big Mike even know what that word means? Do black women know? permalink award report block reply South_Florida_Guy 0 points 1 hour ago Well tbf he's not one permalink award report block reply\nJesko603 13 points 2 hours ago Articulate, sounds accurate.  There is very little articulate about an angry Black women. permalink award report block reply entwickelnden 5 points 36 minutes ago That was my thought, the constant screeching and chomping out isn't articulate. Wow, I agree with big mike here. permalink parent award report block reply\nentwickelnden 5 points 36 minutes ago That was my thought, the constant screeching and chomping out isn't articulate. Wow, I agree with big mike here. permalink parent award report block reply\nkaduh 6 points 2 hours ago Fuck that guy. permalink award report block reply\njamesm56 5 points 53 minutes ago They probably do think they're holding back. Maybe one reason they think they have it so bad is because everyone else doesn't complain as much, so they think everyone else is better off. permalink award report block reply\nmygovisacommie 5 points 1 hour ago And as a black man, he should know that. permalink award report block reply\nJack_NC 5 points 2 hours ago If you want a laugh, go to Google.com and enter Why are black women so The suggested queries are... let's just say \"incomplete\" permalink award report block reply South_Florida_Guy 3 points 1 hour ago OMG I just did and wow the only accurate one is \"muscular\" And when you put why are white women so....\nThere's almost no results permalink parent award report block reply ModernKnight 1 points 10 minutes ago Comment removed by community filter. permalink parent award report block reply\nSouth_Florida_Guy 3 points 1 hour ago OMG I just did and wow the only accurate one is \"muscular\" And when you put why are white women so....\nThere's almost no results permalink parent award report block reply\nModernKnight 1 points 10 minutes ago Comment removed by community filter. permalink parent award report block reply\nPhantomShield72 5 points 1 hour ago I've seen much - too much - \"articulating\" of pain. In Walmart. In a Spirit Airlines Terminal. On a Carnival cruise. In a convenience store. In a McDonalds. On public transportation. On TikTok. Nah - I'm good, Mike - I'm good... permalink award report block reply\nMuzzah 4 points 37 minutes ago “woman” permalink award report block reply\n26magarat 3 points 44 minutes ago From the woman who wrote two memoirs. permalink award report block reply\nCleanUpPhillyTrump24 2 points 44 minutes ago Pretty much no one things that Big Mike is a woman anymore. Ask anyone in the black community, and they'll quietly mutter disgust. The Obama sheen has turned into an oil slick in a mud puddle. permalink award report block reply\nairborne3502 1 points 2 hours ago Yeah, like when that white woman asked you to get something off the top shelf for her. Surprised Alex Haley didn't put that one in Roots. permalink award report block reply\nhere2red 1 points 42 minutes ago If I get anymore \"articulation\" i'll kill myself. permalink award report block reply\nNotYourMan 1 points 1 hour ago Maybe a bit of a change, \"Fabulously wealthy black woman complains about oppression of her race and sex.\" permalink award report block reply\nsomeguy7738 1 points 1 hour ago Yes, they certainly don't articulate. Rather they hoot and holler. permalink award report block reply\nbooblitchutz 1 points 25 minutes ago She said on a 2 hour weekly podcast where she spends the entire time complaining (brought to you by Ford and Procter & Gamble). permalink award report block reply\nNotVladimirPutin 1 points 1 minute ago Lol permalink award report block reply\nWanderingStar 1 points 1 minute ago Clearly, s/he doesn't shop at Walmart. permalink award report block reply\ncosmos411 1 points 11 minutes ago She's not lying. Black women don't articulate their pain, they scream it like an angry simian while tearing shit apart. permalink award report block reply\nMAG-n-KAG 1 points 46 minutes ago reminds of how they articulated their pain after one of theirs got shot up and died in the streets.  they started twerking on the the ambulance and firetrucks.  it was so touching to see such raw emotion displayed.  i put my hand on my heart and cried. permalink award report block reply\nRoninIV 1 points 21 minutes ago Solid proof right there that he's not a black woman permalink award report block reply\nvote_for_MAGA_2020 1 points 33 minutes ago They never ever shut up ever permalink award report block reply\nTheLivingExample 1 points 32 minutes ago Battlefield Earth. permalink award report block reply\nKewMan 1 points 2 hours ago Does Big Mike even know what that word means? Do black women know? permalink award report block reply\nSouth_Florida_Guy 0 points 1 hour ago Well tbf he's not one permalink award report block reply"}