{"id": "1ARK58zFxx", "contents": "500 America whipped the British (twice), we whipped the Spanish, the Germans, the Japanese, the Italians and anyone else who threatened our way of life in this country. If domestic Communists are the next challenge, we'll whip them as well. No fear. No surrender. Never back down. posted 4 days ago by MEME-SUPREME 35 comments award share report block John Rich🇺🇸 @johnrich • 4d America whipped the British (twice), we whipped the Spanish, the Germans, the Japanese, the Italians and anyone else who threatened our way of life in this country. If domestic Communists are the next challenge, we'll whip them as well. No fear. No surrender. Never back down.\n35 comments Sort by Top Top New Worst Old Save Jaybone86 21 points 4 days ago Communists aren’t people. permalink award report block reply Standingoak 6 points 4 days ago And , unlike the Mooslimes , they are also not the problem just a symptom. permalink parent award report block reply HOSEQ 1 points 3 days ago Nope, Wrong, Incorrect, I have no idea which FILTER you used, but Muslims and Communists are very much alike, the only Difference is that Communists don't for other Communists to pray Five Times a Day.... And without that Prayer thing, they look Exactly alike.... permalink parent award report block reply Standingoak 2 points 3 days ago Muslims and Communists are very much alike, No one suggested they weren't except Communists are users while the slime are abusers.  Every hear of Master / Blaster? Take away Blaster and \"Master\" is just an annoyance. permalink parent award report block reply HOSEQ 1 points 3 days ago The evil is in the Details and Semantics.... When you strip off the Religious part, Islam looks exactly like Communism... permalink parent award report block reply view 4 more comments... HoodooOperator 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply IAmRetard 11 points 4 days ago No mercy. No quarter. No prisoners. permalink award report block reply MeMargie 7 points 4 days ago Godspeed. permalink award report block reply Alphahorizon 7 points 4 days ago Lets throw some goat fuckers in that mix as well. permalink award report block reply Deplorable_Citizen 7 points 4 days ago I dunno, the commies seem to be winning so far: Their fundraisers and financiers of Antifa and other such chaos nationwide (Open Societies Foundation, Clinton Foundation, scumbags at the WHO and WEF, etc.) haven't been mass-arrested and put on trial yet. The Epstein victims are having to out their own client list together because Trump refuses to do it for whatever reason. Antifa has not been sufficiently been snuffed out and ground into dust, despite drive-bys and other attempts at attacking ICE/DHS/Border Patrol RINOs still refuse to end the Filibuster, despite Trump's warning that the Dems will do the same thing Day 1 when they retake power in both houses in Congress and the Presidency. Mamdani and Dems win because Rs give no counters (other than \"muh communism bad\") despite Capitalism being vastly superior and not promoting Capitalism's good qualities (via TV, radio, social media and internet ad blitzes, etc.) while Main Street struggles with debts and lack of capital wealth build-up despite the gains made on Wall Street. Anthony Fauci and his ilk are still allowed to walk free after they committed global genocide and got rich from it. Trump still refuses to do what Nayib Bukele did to free El Salvador from tyranny (aka mass-arrest activist judges who seem to self-appoint themselves as gods). permalink award report block reply keeman 4 points 3 days ago We have been on the slow road to communism since 1930s.  Still waiting for some swamp draining (or anything remotely useful to stop the communist takeover). permalink parent award report block reply staroframphansbhole 6 points 4 days ago Yeah I don’t think we should brag about participating in a war in which we explicitly allied with communists and which literally propagated communism for nearly a century, but if you’re a retarded faggot who drinks boomer armchair twitter tough guy posts as much as you drink synagogue semen, it makes sense why you would post something so retarded permalink award report block reply keeman 5 points 3 days ago Don't forget, we also gave China to Mao in WW2.  It was a perfect sweep for communism. permalink parent award report block reply skuts 5 points 4 days ago War can only be delayed to the benefit of your enemy. permalink award report block reply keeman 1 points 3 days ago The best way to avoid a stupid war is not to engage in it. permalink parent award report block reply I_Love_45-70_Gov 3 points 4 days ago RINOs in Congress: Never not be affraid. permalink award report block reply TD_Covfefe_Crusader 3 points 4 days ago There's no \"if\" about it. Domestic communists are the greatest threat to our republic by far, and they are definitely the next challenge. permalink award report block reply Framus 3 points 4 days ago Um, what about the Muslim problem? permalink award report block reply TrumpAndGodWin 4 points 4 days ago What about the elites that send the problem here. permalink parent award report block reply Framus 2 points 4 days ago Yes, exactly.  Just like I said. permalink parent award report block reply keeman 2 points 3 days ago This type doesn't consider it a problem. permalink parent award report block reply Shitsbrokeyo 2 points 3 days ago We haven't whipped the illegals or the Muslims. You can be at war without bullets permalink award report block reply Trump454748 1 points 4 days ago To quote private John Winger; “We’ve been kicking ass for 200 years, we’re ten and one!” permalink award report block reply learntocode 1 points 3 days ago Bro, look it up: Communism (Marx and Engeld) is a weapon developed and used by the British. permalink award report block reply keeman 1 points 3 days ago The reason we are currently as fucked as we are is that we have changed from a republic to an empire.  Empires measure themselves against how they fare against other nations.  Republics don't spend any time on this crap. permalink award report block reply godgoldnguns 1 points 4 days ago We will not defeat them unless we repent.  God will not reward a nation who calls evil good, mocks God, and murders the unborn. permalink award report block reply Psalm-118_24 1 points 3 days ago \"NO WEAPON FORMED AGAINST US WILL PROSPER\"  CHRIST IS KING! permalink award report block reply War_Hamster 1 points 4 days ago To be fair, the War of 1812 was a stalemate, but we held our own against the most powerful navy in history. permalink award report block reply keeman 3 points 3 days ago The British burned the capitol.  So no so much a spanking of the Brits.  We barely survived. permalink parent award report block reply War_Hamster 1 points 3 days ago Yeah, and I mourn the loss of some of those burned papers. permalink parent award report block reply patrioticwinning3 1 points 4 days ago I wish I shared his optimism... permalink award report block reply HoodooOperator 1 points 3 days ago Comment removed by community moderators. permalink award report block reply\nJaybone86 21 points 4 days ago Communists aren’t people. permalink award report block reply Standingoak 6 points 4 days ago And , unlike the Mooslimes , they are also not the problem just a symptom. permalink parent award report block reply HOSEQ 1 points 3 days ago Nope, Wrong, Incorrect, I have no idea which FILTER you used, but Muslims and Communists are very much alike, the only Difference is that Communists don't for other Communists to pray Five Times a Day.... And without that Prayer thing, they look Exactly alike.... permalink parent award report block reply Standingoak 2 points 3 days ago Muslims and Communists are very much alike, No one suggested they weren't except Communists are users while the slime are abusers.  Every hear of Master / Blaster? Take away Blaster and \"Master\" is just an annoyance. permalink parent award report block reply HOSEQ 1 points 3 days ago The evil is in the Details and Semantics.... When you strip off the Religious part, Islam looks exactly like Communism... permalink parent award report block reply view 4 more comments... HoodooOperator 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply\nStandingoak 6 points 4 days ago And , unlike the Mooslimes , they are also not the problem just a symptom. permalink parent award report block reply HOSEQ 1 points 3 days ago Nope, Wrong, Incorrect, I have no idea which FILTER you used, but Muslims and Communists are very much alike, the only Difference is that Communists don't for other Communists to pray Five Times a Day.... And without that Prayer thing, they look Exactly alike.... permalink parent award report block reply Standingoak 2 points 3 days ago Muslims and Communists are very much alike, No one suggested they weren't except Communists are users while the slime are abusers.  Every hear of Master / Blaster? Take away Blaster and \"Master\" is just an annoyance. permalink parent award report block reply HOSEQ 1 points 3 days ago The evil is in the Details and Semantics.... When you strip off the Religious part, Islam looks exactly like Communism... permalink parent award report block reply view 4 more comments... HoodooOperator 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply\nHOSEQ 1 points 3 days ago Nope, Wrong, Incorrect, I have no idea which FILTER you used, but Muslims and Communists are very much alike, the only Difference is that Communists don't for other Communists to pray Five Times a Day.... And without that Prayer thing, they look Exactly alike.... permalink parent award report block reply Standingoak 2 points 3 days ago Muslims and Communists are very much alike, No one suggested they weren't except Communists are users while the slime are abusers.  Every hear of Master / Blaster? Take away Blaster and \"Master\" is just an annoyance. permalink parent award report block reply HOSEQ 1 points 3 days ago The evil is in the Details and Semantics.... When you strip off the Religious part, Islam looks exactly like Communism... permalink parent award report block reply view 4 more comments... HoodooOperator 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply\nStandingoak 2 points 3 days ago Muslims and Communists are very much alike, No one suggested they weren't except Communists are users while the slime are abusers.  Every hear of Master / Blaster? Take away Blaster and \"Master\" is just an annoyance. permalink parent award report block reply HOSEQ 1 points 3 days ago The evil is in the Details and Semantics.... When you strip off the Religious part, Islam looks exactly like Communism... permalink parent award report block reply view 4 more comments...\nHOSEQ 1 points 3 days ago The evil is in the Details and Semantics.... When you strip off the Religious part, Islam looks exactly like Communism... permalink parent award report block reply view 4 more comments...\nHoodooOperator 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply\nIAmRetard 11 points 4 days ago No mercy. No quarter. No prisoners. permalink award report block reply\nMeMargie 7 points 4 days ago Godspeed. permalink award report block reply\nAlphahorizon 7 points 4 days ago Lets throw some goat fuckers in that mix as well. permalink award report block reply\nDeplorable_Citizen 7 points 4 days ago I dunno, the commies seem to be winning so far: Their fundraisers and financiers of Antifa and other such chaos nationwide (Open Societies Foundation, Clinton Foundation, scumbags at the WHO and WEF, etc.) haven't been mass-arrested and put on trial yet. The Epstein victims are having to out their own client list together because Trump refuses to do it for whatever reason. Antifa has not been sufficiently been snuffed out and ground into dust, despite drive-bys and other attempts at attacking ICE/DHS/Border Patrol RINOs still refuse to end the Filibuster, despite Trump's warning that the Dems will do the same thing Day 1 when they retake power in both houses in Congress and the Presidency. Mamdani and Dems win because Rs give no counters (other than \"muh communism bad\") despite Capitalism being vastly superior and not promoting Capitalism's good qualities (via TV, radio, social media and internet ad blitzes, etc.) while Main Street struggles with debts and lack of capital wealth build-up despite the gains made on Wall Street. Anthony Fauci and his ilk are still allowed to walk free after they committed global genocide and got rich from it. Trump still refuses to do what Nayib Bukele did to free El Salvador from tyranny (aka mass-arrest activist judges who seem to self-appoint themselves as gods). permalink award report block reply keeman 4 points 3 days ago We have been on the slow road to communism since 1930s.  Still waiting for some swamp draining (or anything remotely useful to stop the communist takeover). permalink parent award report block reply\nkeeman 4 points 3 days ago We have been on the slow road to communism since 1930s.  Still waiting for some swamp draining (or anything remotely useful to stop the communist takeover). permalink parent award report block reply\nstaroframphansbhole 6 points 4 days ago Yeah I don’t think we should brag about participating in a war in which we explicitly allied with communists and which literally propagated communism for nearly a century, but if you’re a retarded faggot who drinks boomer armchair twitter tough guy posts as much as you drink synagogue semen, it makes sense why you would post something so retarded permalink award report block reply keeman 5 points 3 days ago Don't forget, we also gave China to Mao in WW2.  It was a perfect sweep for communism. permalink parent award report block reply\nkeeman 5 points 3 days ago Don't forget, we also gave China to Mao in WW2.  It was a perfect sweep for communism. permalink parent award report block reply\nskuts 5 points 4 days ago War can only be delayed to the benefit of your enemy. permalink award report block reply keeman 1 points 3 days ago The best way to avoid a stupid war is not to engage in it. permalink parent award report block reply\nkeeman 1 points 3 days ago The best way to avoid a stupid war is not to engage in it. permalink parent award report block reply\nI_Love_45-70_Gov 3 points 4 days ago RINOs in Congress: Never not be affraid. permalink award report block reply\nTD_Covfefe_Crusader 3 points 4 days ago There's no \"if\" about it. Domestic communists are the greatest threat to our republic by far, and they are definitely the next challenge. permalink award report block reply\nFramus 3 points 4 days ago Um, what about the Muslim problem? permalink award report block reply TrumpAndGodWin 4 points 4 days ago What about the elites that send the problem here. permalink parent award report block reply Framus 2 points 4 days ago Yes, exactly.  Just like I said. permalink parent award report block reply keeman 2 points 3 days ago This type doesn't consider it a problem. permalink parent award report block reply\nTrumpAndGodWin 4 points 4 days ago What about the elites that send the problem here. permalink parent award report block reply Framus 2 points 4 days ago Yes, exactly.  Just like I said. permalink parent award report block reply\nFramus 2 points 4 days ago Yes, exactly.  Just like I said. permalink parent award report block reply\nkeeman 2 points 3 days ago This type doesn't consider it a problem. permalink parent award report block reply\nShitsbrokeyo 2 points 3 days ago We haven't whipped the illegals or the Muslims. You can be at war without bullets permalink award report block reply\nTrump454748 1 points 4 days ago To quote private John Winger; “We’ve been kicking ass for 200 years, we’re ten and one!” permalink award report block reply\nlearntocode 1 points 3 days ago Bro, look it up: Communism (Marx and Engeld) is a weapon developed and used by the British. permalink award report block reply\nkeeman 1 points 3 days ago The reason we are currently as fucked as we are is that we have changed from a republic to an empire.  Empires measure themselves against how they fare against other nations.  Republics don't spend any time on this crap. permalink award report block reply\ngodgoldnguns 1 points 4 days ago We will not defeat them unless we repent.  God will not reward a nation who calls evil good, mocks God, and murders the unborn. permalink award report block reply\nPsalm-118_24 1 points 3 days ago \"NO WEAPON FORMED AGAINST US WILL PROSPER\"  CHRIST IS KING! permalink award report block reply\nWar_Hamster 1 points 4 days ago To be fair, the War of 1812 was a stalemate, but we held our own against the most powerful navy in history. permalink award report block reply keeman 3 points 3 days ago The British burned the capitol.  So no so much a spanking of the Brits.  We barely survived. permalink parent award report block reply War_Hamster 1 points 3 days ago Yeah, and I mourn the loss of some of those burned papers. permalink parent award report block reply\nkeeman 3 points 3 days ago The British burned the capitol.  So no so much a spanking of the Brits.  We barely survived. permalink parent award report block reply War_Hamster 1 points 3 days ago Yeah, and I mourn the loss of some of those burned papers. permalink parent award report block reply\nWar_Hamster 1 points 3 days ago Yeah, and I mourn the loss of some of those burned papers. permalink parent award report block reply\npatrioticwinning3 1 points 4 days ago I wish I shared his optimism... permalink award report block reply\nHoodooOperator 1 points 3 days ago Comment removed by community moderators. permalink award report block reply"}