{"id": "1ARK9pg9O5", "contents": "13 Compare posted 3 hours ago by wst4 9 comments award share download report block\n9 comments Sort by Top Top New Worst Old Save Around the Web Salt Lake City's Hair Growth Method Breaks All Records! HaloGrow Kamalas_Cankles 9 points 2 hours ago Don't group Judaism and Christianity together. permalink award report block reply Kmdub2 8 points 2 hours ago Excuuuuuuse me, but ummmm.....\nJews do NOT believe that ALL people are equal. Their Torah explicitly tells them that they are God's chosen people and Christians are disgusting immoral people who are only useful as their slaves or dead. muslims and jews BOTH hate Christians and that is a fact.\nChristians who go to Israel are spit on and cursed at permalink award report block reply FUSnowflake 7 points 2 hours ago I think you mean the Talmud. The Torah is the five Mosaic (Moses-related) books. The Talmud has two main pieces, one written around 200 AD, the other 500-600 AD. permalink parent award report block reply BrokenWolf2022 5 points 3 hours ago Those of us who've been there and fought them can tell you sandpeople aren't human. permalink award report block reply 0illuminated1 4 points 3 hours ago Regardless if this was accurate or not, most followers do what they want anyways, and hide behind their religion as to appear holy and righteous permalink award report block reply Schweddynadzbackup 1 points 25 minutes ago MY religion drives home the fact that I am a hopeless broken wretch without my savior. \"Appearing\" righteous holds no value to true believers. Only by faith in my savior and through his sacrifice am I worthy of the kingdom of heaven. Therefore, it's liberated me from trying to fool anyone. I know I'm a sinful soul. He died so that I may live. permalink parent award report block reply DefinitelyNotFed 4 points 2 hours ago Lol. Smells like more big nose propaganda. permalink award report block reply snakeoil 3 points 2 hours ago Just ...stop permalink award report block reply Schweddynadzbackup 1 points 23 minutes ago \"Lying to your fellow ___ is a moral crime.\" Lying to the goyim or infidels is perfectly acceptable. permalink award report block reply\nKamalas_Cankles 9 points 2 hours ago Don't group Judaism and Christianity together. permalink award report block reply\nKmdub2 8 points 2 hours ago Excuuuuuuse me, but ummmm.....\nJews do NOT believe that ALL people are equal. Their Torah explicitly tells them that they are God's chosen people and Christians are disgusting immoral people who are only useful as their slaves or dead. muslims and jews BOTH hate Christians and that is a fact.\nChristians who go to Israel are spit on and cursed at permalink award report block reply FUSnowflake 7 points 2 hours ago I think you mean the Talmud. The Torah is the five Mosaic (Moses-related) books. The Talmud has two main pieces, one written around 200 AD, the other 500-600 AD. permalink parent award report block reply\nFUSnowflake 7 points 2 hours ago I think you mean the Talmud. The Torah is the five Mosaic (Moses-related) books. The Talmud has two main pieces, one written around 200 AD, the other 500-600 AD. permalink parent award report block reply\nBrokenWolf2022 5 points 3 hours ago Those of us who've been there and fought them can tell you sandpeople aren't human. permalink award report block reply\n0illuminated1 4 points 3 hours ago Regardless if this was accurate or not, most followers do what they want anyways, and hide behind their religion as to appear holy and righteous permalink award report block reply Schweddynadzbackup 1 points 25 minutes ago MY religion drives home the fact that I am a hopeless broken wretch without my savior. \"Appearing\" righteous holds no value to true believers. Only by faith in my savior and through his sacrifice am I worthy of the kingdom of heaven. Therefore, it's liberated me from trying to fool anyone. I know I'm a sinful soul. He died so that I may live. permalink parent award report block reply\nSchweddynadzbackup 1 points 25 minutes ago MY religion drives home the fact that I am a hopeless broken wretch without my savior. \"Appearing\" righteous holds no value to true believers. Only by faith in my savior and through his sacrifice am I worthy of the kingdom of heaven. Therefore, it's liberated me from trying to fool anyone. I know I'm a sinful soul. He died so that I may live. permalink parent award report block reply\nDefinitelyNotFed 4 points 2 hours ago Lol. Smells like more big nose propaganda. permalink award report block reply\nsnakeoil 3 points 2 hours ago Just ...stop permalink award report block reply\nSchweddynadzbackup 1 points 23 minutes ago \"Lying to your fellow ___ is a moral crime.\" Lying to the goyim or infidels is perfectly acceptable. permalink award report block reply"}