{"id": "1ARK9nOoJV", "contents": "47 Last night's view of Northern Lights [Aurora Borealis] in FL Panhandle. \n\n\"Another event is predicted for tonight. A Major Geomagnetic Storm Is About To Hit Earth\" [link in comments] posted 5 hours ago by ncswicn 11 comments award share download report block\n11 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno rivetjoint2 3 points 5 hours ago Errr that's pretty far south.   Must be spectacular up north. permalink award report block reply ncswicn OP 1 points 5 hours ago Yeah, I was amazed we were able to get a glimpse. Supposed to be even better tonight. https://www.youtube.com/watch?v=JjVE-0DLfCc permalink parent award report block reply TrumpVoter1 2 points 4 hours ago Yeah it was good but the last one in 2024 was more spectacular in Georgia. permalink parent award report block reply ncswicn OP 2 points 3 hours ago Thanks for sharing. I missed the one in 2024; hopefully, I will get to see more tonight. :) permalink parent award report block reply TrumpVoter1 1 points 49 minutes ago same.  need to pull my camera and tripod out and see if i can get some good pics tonight. permalink parent award report block reply view 1 more comments... notsuicidalatall 3 points 5 hours ago only visible with an iphone camera in 'night mode'. permalink award report block reply DingleBalls 3 points 5 hours ago If you got android, download an app called  \"Expert RAW\". You can take tome exposures and even \"astrophotos\", it will project the starmap  on the screen so you can see what you're looking at. I used it last night and with a 3 min exposure got some decent shots permalink parent award report block reply notsuicidalatall 2 points 5 hours ago nice!  i have android and will try this tonight. permalink parent award report block reply k-doe3 1 points 5 hours ago I live in Alberta and the red glow was right above us permalink parent award report block reply DuesImperator 2 points 3 hours ago Same. I was driving home down country roads last night and the sky was red right above me. I pulled over and took some pictures. There was a guy further down the road parked, standing on the side flying a drone. permalink parent award report block reply edxzxz 2 points 4 hours ago Northern lights is what you see when coronal mass ejection radiation hits the Van Allen belts that surround the Earth.  The guy who discovered these magnetic belts, Van Allen, went into his boss's office to tell him what he'd discovered, his boss immediately tells him 'now go back to work and figure out what would happen if we nuked them'.  Van Allen developed a plan to nuke them, 'operation starfish' was executed, and thor missiles were launched and detonated in the Van Allen belt.  Kind of funny that as a scientist you discover some astronomical phenomena and first thing your boss says is now let's nuke it. https://www.upi.com/Archives/2000/12/08/US-physics-blunder-almost-ended-space-programs/4311976251600/ permalink award report block reply ncswicn OP 1 points 5 hours ago https://www.youtube.com/watch?v=JjVE-0DLfCc permalink award report block reply\nrivetjoint2 3 points 5 hours ago Errr that's pretty far south.   Must be spectacular up north. permalink award report block reply ncswicn OP 1 points 5 hours ago Yeah, I was amazed we were able to get a glimpse. Supposed to be even better tonight. https://www.youtube.com/watch?v=JjVE-0DLfCc permalink parent award report block reply TrumpVoter1 2 points 4 hours ago Yeah it was good but the last one in 2024 was more spectacular in Georgia. permalink parent award report block reply ncswicn OP 2 points 3 hours ago Thanks for sharing. I missed the one in 2024; hopefully, I will get to see more tonight. :) permalink parent award report block reply TrumpVoter1 1 points 49 minutes ago same.  need to pull my camera and tripod out and see if i can get some good pics tonight. permalink parent award report block reply view 1 more comments...\nncswicn OP 1 points 5 hours ago Yeah, I was amazed we were able to get a glimpse. Supposed to be even better tonight. https://www.youtube.com/watch?v=JjVE-0DLfCc permalink parent award report block reply TrumpVoter1 2 points 4 hours ago Yeah it was good but the last one in 2024 was more spectacular in Georgia. permalink parent award report block reply ncswicn OP 2 points 3 hours ago Thanks for sharing. I missed the one in 2024; hopefully, I will get to see more tonight. :) permalink parent award report block reply TrumpVoter1 1 points 49 minutes ago same.  need to pull my camera and tripod out and see if i can get some good pics tonight. permalink parent award report block reply view 1 more comments...\nTrumpVoter1 2 points 4 hours ago Yeah it was good but the last one in 2024 was more spectacular in Georgia. permalink parent award report block reply ncswicn OP 2 points 3 hours ago Thanks for sharing. I missed the one in 2024; hopefully, I will get to see more tonight. :) permalink parent award report block reply TrumpVoter1 1 points 49 minutes ago same.  need to pull my camera and tripod out and see if i can get some good pics tonight. permalink parent award report block reply view 1 more comments...\nncswicn OP 2 points 3 hours ago Thanks for sharing. I missed the one in 2024; hopefully, I will get to see more tonight. :) permalink parent award report block reply TrumpVoter1 1 points 49 minutes ago same.  need to pull my camera and tripod out and see if i can get some good pics tonight. permalink parent award report block reply view 1 more comments...\nTrumpVoter1 1 points 49 minutes ago same.  need to pull my camera and tripod out and see if i can get some good pics tonight. permalink parent award report block reply view 1 more comments...\nnotsuicidalatall 3 points 5 hours ago only visible with an iphone camera in 'night mode'. permalink award report block reply DingleBalls 3 points 5 hours ago If you got android, download an app called  \"Expert RAW\". You can take tome exposures and even \"astrophotos\", it will project the starmap  on the screen so you can see what you're looking at. I used it last night and with a 3 min exposure got some decent shots permalink parent award report block reply notsuicidalatall 2 points 5 hours ago nice!  i have android and will try this tonight. permalink parent award report block reply k-doe3 1 points 5 hours ago I live in Alberta and the red glow was right above us permalink parent award report block reply DuesImperator 2 points 3 hours ago Same. I was driving home down country roads last night and the sky was red right above me. I pulled over and took some pictures. There was a guy further down the road parked, standing on the side flying a drone. permalink parent award report block reply\nDingleBalls 3 points 5 hours ago If you got android, download an app called  \"Expert RAW\". You can take tome exposures and even \"astrophotos\", it will project the starmap  on the screen so you can see what you're looking at. I used it last night and with a 3 min exposure got some decent shots permalink parent award report block reply notsuicidalatall 2 points 5 hours ago nice!  i have android and will try this tonight. permalink parent award report block reply\nnotsuicidalatall 2 points 5 hours ago nice!  i have android and will try this tonight. permalink parent award report block reply\nk-doe3 1 points 5 hours ago I live in Alberta and the red glow was right above us permalink parent award report block reply DuesImperator 2 points 3 hours ago Same. I was driving home down country roads last night and the sky was red right above me. I pulled over and took some pictures. There was a guy further down the road parked, standing on the side flying a drone. permalink parent award report block reply\nDuesImperator 2 points 3 hours ago Same. I was driving home down country roads last night and the sky was red right above me. I pulled over and took some pictures. There was a guy further down the road parked, standing on the side flying a drone. permalink parent award report block reply\nedxzxz 2 points 4 hours ago Northern lights is what you see when coronal mass ejection radiation hits the Van Allen belts that surround the Earth.  The guy who discovered these magnetic belts, Van Allen, went into his boss's office to tell him what he'd discovered, his boss immediately tells him 'now go back to work and figure out what would happen if we nuked them'.  Van Allen developed a plan to nuke them, 'operation starfish' was executed, and thor missiles were launched and detonated in the Van Allen belt.  Kind of funny that as a scientist you discover some astronomical phenomena and first thing your boss says is now let's nuke it. https://www.upi.com/Archives/2000/12/08/US-physics-blunder-almost-ended-space-programs/4311976251600/ permalink award report block reply\nncswicn OP 1 points 5 hours ago https://www.youtube.com/watch?v=JjVE-0DLfCc permalink award report block reply"}