{"id": "1ARK5A9ZlH", "contents": "468 I’m very proud to be White. I will strive to be more White, our culture did more to make the world a better place than any culture on earth. I am so very proud of my culture which literally everyone in America appropriates. I am very (VERY) proud of my White ancestors and their accomplishments posted 3 days ago by TRUTH_BE_OUR_DOGMA 22 comments award share download report block\n22 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style SoldierOnFire 10 points 3 days ago So what you’re saying is, you’re going to continue to work and support your family, follow the law, and serve your community? permalink award report block reply Gnometard 3 points 3 days ago What about white democrats? Why do we conveniently forget about them? permalink parent award report block reply Worlox 2 points 3 days ago They’re crackers permalink parent award report block reply MAGA_mantis 7 points 3 days ago Where ever white people are, life expectancy goes up. Bigots. permalink award report block reply MAGALADON9 6 points 3 days ago Important note:\nWe are not just sitting back enjoying the wins. We see them as much more.\nWhen many of us say we are proud of our white ancestors this has a kind of push or  inspirational motivation to do great things.  There are times in my life when I was having a hard time and I thought back on all of the struggles and pain of all of my ancestors and what they went through perhaps they imagined some descendant would also think back and of them, and so I push on - like they did - through wars and plagues and injustice on a scale we hardly could conceive of it. Then I think to wallow in my misery is an insult to all of them. permalink award report block reply HanginChad 3 points 3 days ago I see things a little differenty. I can really only be proud of the things I accomplish, maybe something a family member accomplished. But I'm happy I'm white, and the things other white people accomplished are awesome and obviously things they should proud of. One criticism I would have of us is that we spent way too much time fighting with each other over dumb shit. All the wars throughout history, pretty much every one of them. If we actually put all that effort into colonization the world would have been better off. We'd probably have colonies in Mars by now. We wouldn't be such a minority on earth if we didn't kill off our brothers. permalink award report block reply Gnometard -2 points 3 days ago My race has nothing to do with my life, so it's not even a thought. Only through constant exposure to CRT and communist brainwashing is race a consideration for people. I'm glad to see someone else isn't a faggot when it comes to pride. Taking pride in something that isn't an accomplishment just shows you've never actually accomplished something worth pride permalink parent award report block reply HanginChad 3 points 3 days ago That's cool. Not saying you're wrong or you don't have a right to feel that way. White people are generally pretty awesome except for the commies. We're on the same awesome side. permalink parent award report block reply Nezock_theKnight 3 points 3 days ago I agree and support this 1,000,000,000,000,000% permalink award report block reply deleted 2 points 3 days ago MAGALADON9 5 points 3 days ago Lol.  Stahp...  we wuz Celtic kangs now too. Brian Boru aka Damarqeous permalink parent award report block reply RedCapNation 2 points 3 days ago Haha it must be hard to be so gay but you nailed it permalink parent award report block reply Citizen12 1 points 3 days ago Fun fact:  in 1960, 30% of the world's population was white.  In 2020, 8% of the population was white. permalink award report block reply Gnometard -4 points 3 days ago Pride in something you didn't work for is called faggotry. That's a sin. White women are the biggest voting block for democrats. Is that white culture? You're playing into the hands of the communists, because you lack sufficient testosterone to think logically. Biden is white.  Pelosi is white. Schumer is white.  Trudeau is white. Hillary Clinton is white. You don't get to ignore them because it's inconvenient, like how the left ignores Larry elder or Ben Carson. If you get to take credit for those people because skin color, it would be the same with reparations (which would happen next time white women vote in democrats, if the filibuster is done away with) permalink award report block reply RedCapNation 2 points 3 days ago White people have bad actors amongst them that’s for sure. But we’re the superior race and culture hands down. Nobody can argue that. Our problem is sharing technology. We should have won the world in the 40’s but balked. We won’t the next time. The other planets will be white only…and there’s little to nothing the other races can do to stop us. permalink parent award report block reply israelworst -5 points 3 days ago Is it also okay to be ambivalent about being White? Truthfully I would rather not give a shit, just so I could say that others should follow the example in their races. You see, if I go around pretending my pigments are better, whichever color that they may be, that's gay. Its just skin and most everything else in your life matters more. permalink award report block reply vote_for_MAGA_2020 6 points 3 days ago Try not to be a faggot your entire life. White is Right. permalink parent award report block reply Gnometard -3 points 3 days ago Biden? Is right because white? permalink parent award report block reply vote_for_MAGA_2020 2 points 3 days ago You also....try not to be a faggot your entire life. permalink parent award report block reply MAGALADON9 2 points 3 days ago Well it's much more than skin. In fact to have such an ambivalent attitude requires some smug elitism on a racial level.  Everyone else cares and cares deeply  - white people often feel badly for being the world champion winners in the game of civilization. So we act like we don't care about our people This is called OIKOPHOBIA  normally an adolescent phase where you \"hate home\" eg. \"My parents are like so lame\".  There is a sibling to this and it is ETHNO-MASOCHISM and this is that white \"super ally - the good one - the white savior\" and when a white person hits that pipe - well, as this old black man said \"nothing makes white folk feel so good as feeling bad\" permalink parent award report block reply Gnometard -1 points 3 days ago If you don't prescribe to CRT, you don't have those views on race. permalink parent award report block reply MAGALADON9 1 points 3 days ago You haven't read CRT or specifically it's CT origins and how it is popularly applied to race. People are different and that's ok. To intentionally want the erasure of black people and Japanese people as you're suggesting is what is called ethnocide. People are physiologically different in many ways and not just appearances but mentally in terms of intelligence and psychologically.  And that's OK too. People should be happy with who they are and where they came from. And our natural tribalism is part of nature too. permalink parent award report block reply BenDoverAssho 1 points 3 days ago Comment removed by community filter. permalink award report block reply\nSoldierOnFire 10 points 3 days ago So what you’re saying is, you’re going to continue to work and support your family, follow the law, and serve your community? permalink award report block reply Gnometard 3 points 3 days ago What about white democrats? Why do we conveniently forget about them? permalink parent award report block reply Worlox 2 points 3 days ago They’re crackers permalink parent award report block reply\nGnometard 3 points 3 days ago What about white democrats? Why do we conveniently forget about them? permalink parent award report block reply Worlox 2 points 3 days ago They’re crackers permalink parent award report block reply\nWorlox 2 points 3 days ago They’re crackers permalink parent award report block reply\nMAGA_mantis 7 points 3 days ago Where ever white people are, life expectancy goes up. Bigots. permalink award report block reply\nMAGALADON9 6 points 3 days ago Important note:\nWe are not just sitting back enjoying the wins. We see them as much more.\nWhen many of us say we are proud of our white ancestors this has a kind of push or  inspirational motivation to do great things.  There are times in my life when I was having a hard time and I thought back on all of the struggles and pain of all of my ancestors and what they went through perhaps they imagined some descendant would also think back and of them, and so I push on - like they did - through wars and plagues and injustice on a scale we hardly could conceive of it. Then I think to wallow in my misery is an insult to all of them. permalink award report block reply\nHanginChad 3 points 3 days ago I see things a little differenty. I can really only be proud of the things I accomplish, maybe something a family member accomplished. But I'm happy I'm white, and the things other white people accomplished are awesome and obviously things they should proud of. One criticism I would have of us is that we spent way too much time fighting with each other over dumb shit. All the wars throughout history, pretty much every one of them. If we actually put all that effort into colonization the world would have been better off. We'd probably have colonies in Mars by now. We wouldn't be such a minority on earth if we didn't kill off our brothers. permalink award report block reply Gnometard -2 points 3 days ago My race has nothing to do with my life, so it's not even a thought. Only through constant exposure to CRT and communist brainwashing is race a consideration for people. I'm glad to see someone else isn't a faggot when it comes to pride. Taking pride in something that isn't an accomplishment just shows you've never actually accomplished something worth pride permalink parent award report block reply HanginChad 3 points 3 days ago That's cool. Not saying you're wrong or you don't have a right to feel that way. White people are generally pretty awesome except for the commies. We're on the same awesome side. permalink parent award report block reply\nGnometard -2 points 3 days ago My race has nothing to do with my life, so it's not even a thought. Only through constant exposure to CRT and communist brainwashing is race a consideration for people. I'm glad to see someone else isn't a faggot when it comes to pride. Taking pride in something that isn't an accomplishment just shows you've never actually accomplished something worth pride permalink parent award report block reply HanginChad 3 points 3 days ago That's cool. Not saying you're wrong or you don't have a right to feel that way. White people are generally pretty awesome except for the commies. We're on the same awesome side. permalink parent award report block reply\nHanginChad 3 points 3 days ago That's cool. Not saying you're wrong or you don't have a right to feel that way. White people are generally pretty awesome except for the commies. We're on the same awesome side. permalink parent award report block reply\nNezock_theKnight 3 points 3 days ago I agree and support this 1,000,000,000,000,000% permalink award report block reply\ndeleted 2 points 3 days ago MAGALADON9 5 points 3 days ago Lol.  Stahp...  we wuz Celtic kangs now too. Brian Boru aka Damarqeous permalink parent award report block reply RedCapNation 2 points 3 days ago Haha it must be hard to be so gay but you nailed it permalink parent award report block reply\nMAGALADON9 5 points 3 days ago Lol.  Stahp...  we wuz Celtic kangs now too. Brian Boru aka Damarqeous permalink parent award report block reply\nRedCapNation 2 points 3 days ago Haha it must be hard to be so gay but you nailed it permalink parent award report block reply\nCitizen12 1 points 3 days ago Fun fact:  in 1960, 30% of the world's population was white.  In 2020, 8% of the population was white. permalink award report block reply\nGnometard -4 points 3 days ago Pride in something you didn't work for is called faggotry. That's a sin. White women are the biggest voting block for democrats. Is that white culture? You're playing into the hands of the communists, because you lack sufficient testosterone to think logically. Biden is white.  Pelosi is white. Schumer is white.  Trudeau is white. Hillary Clinton is white. You don't get to ignore them because it's inconvenient, like how the left ignores Larry elder or Ben Carson. If you get to take credit for those people because skin color, it would be the same with reparations (which would happen next time white women vote in democrats, if the filibuster is done away with) permalink award report block reply RedCapNation 2 points 3 days ago White people have bad actors amongst them that’s for sure. But we’re the superior race and culture hands down. Nobody can argue that. Our problem is sharing technology. We should have won the world in the 40’s but balked. We won’t the next time. The other planets will be white only…and there’s little to nothing the other races can do to stop us. permalink parent award report block reply\nRedCapNation 2 points 3 days ago White people have bad actors amongst them that’s for sure. But we’re the superior race and culture hands down. Nobody can argue that. Our problem is sharing technology. We should have won the world in the 40’s but balked. We won’t the next time. The other planets will be white only…and there’s little to nothing the other races can do to stop us. permalink parent award report block reply\nisraelworst -5 points 3 days ago Is it also okay to be ambivalent about being White? Truthfully I would rather not give a shit, just so I could say that others should follow the example in their races. You see, if I go around pretending my pigments are better, whichever color that they may be, that's gay. Its just skin and most everything else in your life matters more. permalink award report block reply vote_for_MAGA_2020 6 points 3 days ago Try not to be a faggot your entire life. White is Right. permalink parent award report block reply Gnometard -3 points 3 days ago Biden? Is right because white? permalink parent award report block reply vote_for_MAGA_2020 2 points 3 days ago You also....try not to be a faggot your entire life. permalink parent award report block reply MAGALADON9 2 points 3 days ago Well it's much more than skin. In fact to have such an ambivalent attitude requires some smug elitism on a racial level.  Everyone else cares and cares deeply  - white people often feel badly for being the world champion winners in the game of civilization. So we act like we don't care about our people This is called OIKOPHOBIA  normally an adolescent phase where you \"hate home\" eg. \"My parents are like so lame\".  There is a sibling to this and it is ETHNO-MASOCHISM and this is that white \"super ally - the good one - the white savior\" and when a white person hits that pipe - well, as this old black man said \"nothing makes white folk feel so good as feeling bad\" permalink parent award report block reply Gnometard -1 points 3 days ago If you don't prescribe to CRT, you don't have those views on race. permalink parent award report block reply MAGALADON9 1 points 3 days ago You haven't read CRT or specifically it's CT origins and how it is popularly applied to race. People are different and that's ok. To intentionally want the erasure of black people and Japanese people as you're suggesting is what is called ethnocide. People are physiologically different in many ways and not just appearances but mentally in terms of intelligence and psychologically.  And that's OK too. People should be happy with who they are and where they came from. And our natural tribalism is part of nature too. permalink parent award report block reply\nvote_for_MAGA_2020 6 points 3 days ago Try not to be a faggot your entire life. White is Right. permalink parent award report block reply Gnometard -3 points 3 days ago Biden? Is right because white? permalink parent award report block reply vote_for_MAGA_2020 2 points 3 days ago You also....try not to be a faggot your entire life. permalink parent award report block reply\nGnometard -3 points 3 days ago Biden? Is right because white? permalink parent award report block reply vote_for_MAGA_2020 2 points 3 days ago You also....try not to be a faggot your entire life. permalink parent award report block reply\nvote_for_MAGA_2020 2 points 3 days ago You also....try not to be a faggot your entire life. permalink parent award report block reply\nMAGALADON9 2 points 3 days ago Well it's much more than skin. In fact to have such an ambivalent attitude requires some smug elitism on a racial level.  Everyone else cares and cares deeply  - white people often feel badly for being the world champion winners in the game of civilization. So we act like we don't care about our people This is called OIKOPHOBIA  normally an adolescent phase where you \"hate home\" eg. \"My parents are like so lame\".  There is a sibling to this and it is ETHNO-MASOCHISM and this is that white \"super ally - the good one - the white savior\" and when a white person hits that pipe - well, as this old black man said \"nothing makes white folk feel so good as feeling bad\" permalink parent award report block reply Gnometard -1 points 3 days ago If you don't prescribe to CRT, you don't have those views on race. permalink parent award report block reply MAGALADON9 1 points 3 days ago You haven't read CRT or specifically it's CT origins and how it is popularly applied to race. People are different and that's ok. To intentionally want the erasure of black people and Japanese people as you're suggesting is what is called ethnocide. People are physiologically different in many ways and not just appearances but mentally in terms of intelligence and psychologically.  And that's OK too. People should be happy with who they are and where they came from. And our natural tribalism is part of nature too. permalink parent award report block reply\nGnometard -1 points 3 days ago If you don't prescribe to CRT, you don't have those views on race. permalink parent award report block reply MAGALADON9 1 points 3 days ago You haven't read CRT or specifically it's CT origins and how it is popularly applied to race. People are different and that's ok. To intentionally want the erasure of black people and Japanese people as you're suggesting is what is called ethnocide. People are physiologically different in many ways and not just appearances but mentally in terms of intelligence and psychologically.  And that's OK too. People should be happy with who they are and where they came from. And our natural tribalism is part of nature too. permalink parent award report block reply\nMAGALADON9 1 points 3 days ago You haven't read CRT or specifically it's CT origins and how it is popularly applied to race. People are different and that's ok. To intentionally want the erasure of black people and Japanese people as you're suggesting is what is called ethnocide. People are physiologically different in many ways and not just appearances but mentally in terms of intelligence and psychologically.  And that's OK too. People should be happy with who they are and where they came from. And our natural tribalism is part of nature too. permalink parent award report block reply\nBenDoverAssho 1 points 3 days ago Comment removed by community filter. permalink award report block reply"}