{"id": "1ARK9pfb9c", "contents": "75 Me: “We don’t need more H-1Bs from India!”\n\nMy replies: posted 8 hours ago by PiratePatriotParrot 5 comments award share report block David Santa Carla 🦇 @TheOnlyDSC • 19h Me: “We don’t need more H-1Bs from India!” My replies:\n5 comments Sort by Top Top New Worst Old Save Around the Web patrioticwinning3 7 points 8 hours ago \"Hello my fellow MAGA Sarrrs!  Ve need more H1Bs because us Americans are so stupid and lazy!  Amirite my fellow MAGA!?\"  :p permalink award report block reply BKav 3 points 8 hours ago But we do need more “ bobs and vagene!” permalink award report block reply SmallestShil 3 points 6 hours ago \"Let me explain your countries culture to you and how it includes me\" permalink award report block reply BidenShowerDrool 2 points 7 hours ago i can smell the stench from here already. I bet these are the Mumbai millionaire grifters who make bank moving their street shitting, fake degree slaves from India to America. permalink award report block reply JeetPoopDo 1 points 4 hours ago Comment removed by community filter, pending further review. permalink award report block reply\npatrioticwinning3 7 points 8 hours ago \"Hello my fellow MAGA Sarrrs!  Ve need more H1Bs because us Americans are so stupid and lazy!  Amirite my fellow MAGA!?\"  :p permalink award report block reply\nBKav 3 points 8 hours ago But we do need more “ bobs and vagene!” permalink award report block reply\nSmallestShil 3 points 6 hours ago \"Let me explain your countries culture to you and how it includes me\" permalink award report block reply\nBidenShowerDrool 2 points 7 hours ago i can smell the stench from here already. I bet these are the Mumbai millionaire grifters who make bank moving their street shitting, fake degree slaves from India to America. permalink award report block reply\nJeetPoopDo 1 points 4 hours ago Comment removed by community filter, pending further review. permalink award report block reply"}