{"id": "1ARK9hiH9M", "contents": "431 She Was The Pride Of The American Side - Edmund Fitzgerald Sinks Today November 10th, 1975 posted 2 days ago by Restore_Sanity_alt 46 comments award share download report block\n46 comments Sort by Top Top New Worst Old Save Bullet3250 35 points 2 days ago The legend lives on from the Chippewa on down Of the big lake they called Gitche Gumee The lake, it is said, never gives up her dead When the skies of November turn gloomy With a load of iron ore twenty-six thousand tons more Than the Edmund Fitzgerald weighed empty That good ship and true was a bone to be chewed When the gales of November came early They just won't write songs like that anymore. permalink award report block reply deleted 1 points 2 days ago Bullet3250 1 points 1 day ago so true. permalink parent award report block reply NamendaBiden -5 points 2 days ago I came to post about how this event spawned one of the WORST songs of all time.  🤣 permalink parent award report block reply Logan051361 21 points 2 days ago This song was very big in the 70s. Its a story telling song. was not made to make you happy. permalink parent award report block reply NamendaBiden -15 points 2 days ago Its almost 7 minutes of droning.  Its bad.  I do feel bad for the families or those who died and the entire Great Lakes shipping industry at the time.  But, Gordon Lightfoot sucks and this song is a bore. permalink parent award report block reply 45isthebomb 14 points 2 days ago It's a fantastic ballad honoring the dead and you should go pound some sand up your ass. permalink parent award report block reply view 1 more comments... edxzxz 6 points 2 days ago This only got airtime on radio because Canada had a rule for broadcasting that required 25% of air time be given to Canadians, and since there were so few Canadian musicians, they played the bejeezus out of this song. permalink parent award report block reply view 6 more comments... PubliusRex 4 points 2 days ago He makes us feel their pain  and envy the dead. permalink parent award report block reply view 1 more comments... Fren20 4 points 2 days ago Loved it the song truly explains the sad plight..just beautiful ❤️❤️❤️ permalink parent award report block reply Major_Nutt 2 points 2 days ago Found the Swiftie. permalink parent award report block reply LostElf 13 points 2 days ago Aw, come on! It's great for belting out at the top of your lungs while on a riding lawnmower. I mean what other song lists the Great Lakes and mentions the Maritime Sailors' Cathedral? permalink parent award report block reply RentedMule 12 points 2 days ago This song is obviously very polarizing.  Either people love it, or they hate it.  Put me in the love category.  I think that haunting guitar wail is just right for telling this story. permalink parent award report block reply Toobin247 4 points 2 days ago I’ve never heard of anyone saying the song was bad until know and I think this person has zero understanding about story ballads. Roland the Headless Thompson Gunner is another great one that hits me deep when I hear it. permalink parent award report block reply Nellie_the_Beaut 3 points 2 days ago lol, just like “The Day the Music Died” by Don McClaine.  Another long, story telling American ballad that’s part of American lexicon. People either love it or hate it - no in between when that chorus comes on “bye-bye, Mr. American pie. I took my Chevy to the levee…” permalink parent award report block reply THELEADERSOFMEN 1 points 2 days ago This song came out when I was four or five and I was OBSESSED with it, I wanted that K-tel record it was on soooo bad. permalink parent award report block reply fervordanbek 0 points 2 days ago It's a good song, I just wish it were more accurate. Finding information was more difficult in the 70s and he took some literary license. permalink parent award report block reply Eatinglue 6 points 2 days ago I enjoy listening to it when I’m driving around the Great Lakes north woods. permalink parent award report block reply hatredcopter 6 points 2 days ago I will fucking fight you lol permalink parent award report block reply load 2 more comments... Oldman1234 19 points 2 days ago They did retrieve the ship's bell and restored it to near new condition.  The bell is on permanent display at the Great Lakes Shipwreck Museum in Michigan and is used each November 10th in the bell-ringing ceremony in memory of the 29 crewmen of the Edmund Fitzgerald. https://ssedmundfitzgerald.org/bell-restoration permalink award report block reply LostElf 9 points 2 days ago The Big Fitz. Too bad she didn't put fifteen more miles behind her. RIP 29....likely still crewing her to this day. permalink award report block reply Logan051361 8 points 2 days ago I grew up in Michigan and can tell you I would not go anywhere near these Lakes. They are all scary as fuck. permalink award report block reply bull_in_a_china_shop 4 points 2 days ago On fair weather days the lakes are quite nice, but during inclement weather they can certainly be dangerous. permalink parent award report block reply RoosterCrow 7 points 2 days ago Mother Superior is no joke in the fall. permalink award report block reply starjello 4 points 2 days ago If you grew up in the Great Lakes region,  this song is ingrained into as much as apple pie is to America. RIP, Gordon…you gave dignity and homage to the crew of the Fitzgerald Ernest M. McSorley - Captain\nJohn H. McCarthy - 1st Mate\nJames A. Pratt - 2nd Mate\nMichael E. Armagost - 3rd Mate\nRussell J. Holl - Chief Engineer\nEdward F. Bindon - 1st Assistant Engineer\nThomas E. Edwards - 2nd Assistant Engineer\nRussell G. Haskell - 2nd Assistant Engineer\nOliver J. Champeau - 3rd Assistant Engineer\nEugene W. O'Brien - Wheelsman\nJohn J. Poviach - Wheelsman\nJohn D. Simmons - Wheelsman\nDavid E. Weiss - Cadet\nRobert C. Rafferty - Cook\nAllen G. Kalmon - 2nd Cook\nFrederick J. Beetcher - Porter\nNolan F. Church - Porter\nRansom E. Cundy - Watchman\nKarl A. Peckol - Watchman\nWilliam J. Spengler - Watchman\nThomas D. Borgeson - Maintenance\nJoseph W. Mazes - Maintenance\nGordon F. MacLellan - Wiper\nThomas D. Bentsen - Oiler\nRalph G. Walton - Oiler\nBlaine H. Wilhelm - Oiler\nMark A. Thomas - Deck Hand\nPaul M. Riippa - Deck Hand\nBruce L. Hudson - Deck Hand Rest in Peace permalink award report block reply PillarOfWisdom 4 points 2 days ago I love Edmond Fitzgerald's voice.  I think he was piloting the SS Cat Stevens when it crashed. https://www.youtube.com/watch?v=zOaFHmMYikc permalink award report block reply edxzxz 3 points 2 days ago There's an interview Larry King did with Cat Stevens (Yusef Islam) after he got deported for supporting terrorist organizations, your comment triggered me to go look it up.  They edited the original interview, in which retard Larry King argues endlessly with Cat Stevens about his song 'Morning Has Broken' where Cat Stevens explains he did not write that song, it's a hymn, and Larry King presses him over and over with 'yeah, but WHO WROTE IT?' Now the edited version cuts all the stupid badgering about who wrote it out. permalink parent award report block reply PillarOfWisdom 2 points 2 days ago Woah...Larry King was a functional retard. permalink parent award report block reply FreedomLubber 4 points 2 days ago Split Rock lighthouse in Minnesota does a yearly memorial service for the Edmond Fitzgerald. permalink award report block reply Realassman 3 points 2 days ago It’s a scary lake. permalink award report block reply journalist 3 points 2 days ago https://www.youtube.com/watch?v=tV9PoWQVga0&list=RDtV9PoWQVga0&start_radio=1 permalink award report block reply YoopersGodsCountry 3 points 2 days ago We listen to this tome daily permalink award report block reply TaxDollarsHardAtWork 2 points 2 days ago What's crazy is that the ship sank in waters that aren't as deep as the ship was long. permalink award report block reply Red_Ensign 3 points 2 days ago Thats why sailing on the lakes is so dangerous. In a big sea state the waves can smash a ship on the lake bottom. Or the bow can plunge into the bottom coming off the top of a swell. Its the shallows that make it hazardous. permalink parent award report block reply Dudemanfoo 2 points 2 days ago what a boat. permalink award report block reply NewPoppi 1 points 2 days ago https://youtu.be/9vST6hVRj2A?si=NUDkrQWazzA-M8B1 permalink award report block reply\nBullet3250 35 points 2 days ago The legend lives on from the Chippewa on down Of the big lake they called Gitche Gumee The lake, it is said, never gives up her dead When the skies of November turn gloomy With a load of iron ore twenty-six thousand tons more Than the Edmund Fitzgerald weighed empty That good ship and true was a bone to be chewed When the gales of November came early They just won't write songs like that anymore. permalink award report block reply deleted 1 points 2 days ago Bullet3250 1 points 1 day ago so true. permalink parent award report block reply NamendaBiden -5 points 2 days ago I came to post about how this event spawned one of the WORST songs of all time.  🤣 permalink parent award report block reply Logan051361 21 points 2 days ago This song was very big in the 70s. Its a story telling song. was not made to make you happy. permalink parent award report block reply NamendaBiden -15 points 2 days ago Its almost 7 minutes of droning.  Its bad.  I do feel bad for the families or those who died and the entire Great Lakes shipping industry at the time.  But, Gordon Lightfoot sucks and this song is a bore. permalink parent award report block reply 45isthebomb 14 points 2 days ago It's a fantastic ballad honoring the dead and you should go pound some sand up your ass. permalink parent award report block reply view 1 more comments... edxzxz 6 points 2 days ago This only got airtime on radio because Canada had a rule for broadcasting that required 25% of air time be given to Canadians, and since there were so few Canadian musicians, they played the bejeezus out of this song. permalink parent award report block reply view 6 more comments... PubliusRex 4 points 2 days ago He makes us feel their pain  and envy the dead. permalink parent award report block reply view 1 more comments... Fren20 4 points 2 days ago Loved it the song truly explains the sad plight..just beautiful ❤️❤️❤️ permalink parent award report block reply Major_Nutt 2 points 2 days ago Found the Swiftie. permalink parent award report block reply LostElf 13 points 2 days ago Aw, come on! It's great for belting out at the top of your lungs while on a riding lawnmower. I mean what other song lists the Great Lakes and mentions the Maritime Sailors' Cathedral? permalink parent award report block reply RentedMule 12 points 2 days ago This song is obviously very polarizing.  Either people love it, or they hate it.  Put me in the love category.  I think that haunting guitar wail is just right for telling this story. permalink parent award report block reply Toobin247 4 points 2 days ago I’ve never heard of anyone saying the song was bad until know and I think this person has zero understanding about story ballads. Roland the Headless Thompson Gunner is another great one that hits me deep when I hear it. permalink parent award report block reply Nellie_the_Beaut 3 points 2 days ago lol, just like “The Day the Music Died” by Don McClaine.  Another long, story telling American ballad that’s part of American lexicon. People either love it or hate it - no in between when that chorus comes on “bye-bye, Mr. American pie. I took my Chevy to the levee…” permalink parent award report block reply THELEADERSOFMEN 1 points 2 days ago This song came out when I was four or five and I was OBSESSED with it, I wanted that K-tel record it was on soooo bad. permalink parent award report block reply fervordanbek 0 points 2 days ago It's a good song, I just wish it were more accurate. Finding information was more difficult in the 70s and he took some literary license. permalink parent award report block reply Eatinglue 6 points 2 days ago I enjoy listening to it when I’m driving around the Great Lakes north woods. permalink parent award report block reply hatredcopter 6 points 2 days ago I will fucking fight you lol permalink parent award report block reply load 2 more comments...\ndeleted 1 points 2 days ago Bullet3250 1 points 1 day ago so true. permalink parent award report block reply\nBullet3250 1 points 1 day ago so true. permalink parent award report block reply\nNamendaBiden -5 points 2 days ago I came to post about how this event spawned one of the WORST songs of all time.  🤣 permalink parent award report block reply Logan051361 21 points 2 days ago This song was very big in the 70s. Its a story telling song. was not made to make you happy. permalink parent award report block reply NamendaBiden -15 points 2 days ago Its almost 7 minutes of droning.  Its bad.  I do feel bad for the families or those who died and the entire Great Lakes shipping industry at the time.  But, Gordon Lightfoot sucks and this song is a bore. permalink parent award report block reply 45isthebomb 14 points 2 days ago It's a fantastic ballad honoring the dead and you should go pound some sand up your ass. permalink parent award report block reply view 1 more comments... edxzxz 6 points 2 days ago This only got airtime on radio because Canada had a rule for broadcasting that required 25% of air time be given to Canadians, and since there were so few Canadian musicians, they played the bejeezus out of this song. permalink parent award report block reply view 6 more comments... PubliusRex 4 points 2 days ago He makes us feel their pain  and envy the dead. permalink parent award report block reply view 1 more comments... Fren20 4 points 2 days ago Loved it the song truly explains the sad plight..just beautiful ❤️❤️❤️ permalink parent award report block reply Major_Nutt 2 points 2 days ago Found the Swiftie. permalink parent award report block reply LostElf 13 points 2 days ago Aw, come on! It's great for belting out at the top of your lungs while on a riding lawnmower. I mean what other song lists the Great Lakes and mentions the Maritime Sailors' Cathedral? permalink parent award report block reply RentedMule 12 points 2 days ago This song is obviously very polarizing.  Either people love it, or they hate it.  Put me in the love category.  I think that haunting guitar wail is just right for telling this story. permalink parent award report block reply Toobin247 4 points 2 days ago I’ve never heard of anyone saying the song was bad until know and I think this person has zero understanding about story ballads. Roland the Headless Thompson Gunner is another great one that hits me deep when I hear it. permalink parent award report block reply Nellie_the_Beaut 3 points 2 days ago lol, just like “The Day the Music Died” by Don McClaine.  Another long, story telling American ballad that’s part of American lexicon. People either love it or hate it - no in between when that chorus comes on “bye-bye, Mr. American pie. I took my Chevy to the levee…” permalink parent award report block reply THELEADERSOFMEN 1 points 2 days ago This song came out when I was four or five and I was OBSESSED with it, I wanted that K-tel record it was on soooo bad. permalink parent award report block reply fervordanbek 0 points 2 days ago It's a good song, I just wish it were more accurate. Finding information was more difficult in the 70s and he took some literary license. permalink parent award report block reply Eatinglue 6 points 2 days ago I enjoy listening to it when I’m driving around the Great Lakes north woods. permalink parent award report block reply hatredcopter 6 points 2 days ago I will fucking fight you lol permalink parent award report block reply load 2 more comments...\nLogan051361 21 points 2 days ago This song was very big in the 70s. Its a story telling song. was not made to make you happy. permalink parent award report block reply NamendaBiden -15 points 2 days ago Its almost 7 minutes of droning.  Its bad.  I do feel bad for the families or those who died and the entire Great Lakes shipping industry at the time.  But, Gordon Lightfoot sucks and this song is a bore. permalink parent award report block reply 45isthebomb 14 points 2 days ago It's a fantastic ballad honoring the dead and you should go pound some sand up your ass. permalink parent award report block reply view 1 more comments... edxzxz 6 points 2 days ago This only got airtime on radio because Canada had a rule for broadcasting that required 25% of air time be given to Canadians, and since there were so few Canadian musicians, they played the bejeezus out of this song. permalink parent award report block reply view 6 more comments... PubliusRex 4 points 2 days ago He makes us feel their pain  and envy the dead. permalink parent award report block reply view 1 more comments... Fren20 4 points 2 days ago Loved it the song truly explains the sad plight..just beautiful ❤️❤️❤️ permalink parent award report block reply Major_Nutt 2 points 2 days ago Found the Swiftie. permalink parent award report block reply\nNamendaBiden -15 points 2 days ago Its almost 7 minutes of droning.  Its bad.  I do feel bad for the families or those who died and the entire Great Lakes shipping industry at the time.  But, Gordon Lightfoot sucks and this song is a bore. permalink parent award report block reply 45isthebomb 14 points 2 days ago It's a fantastic ballad honoring the dead and you should go pound some sand up your ass. permalink parent award report block reply view 1 more comments... edxzxz 6 points 2 days ago This only got airtime on radio because Canada had a rule for broadcasting that required 25% of air time be given to Canadians, and since there were so few Canadian musicians, they played the bejeezus out of this song. permalink parent award report block reply view 6 more comments... PubliusRex 4 points 2 days ago He makes us feel their pain  and envy the dead. permalink parent award report block reply view 1 more comments... Fren20 4 points 2 days ago Loved it the song truly explains the sad plight..just beautiful ❤️❤️❤️ permalink parent award report block reply Major_Nutt 2 points 2 days ago Found the Swiftie. permalink parent award report block reply\n45isthebomb 14 points 2 days ago It's a fantastic ballad honoring the dead and you should go pound some sand up your ass. permalink parent award report block reply view 1 more comments...\nedxzxz 6 points 2 days ago This only got airtime on radio because Canada had a rule for broadcasting that required 25% of air time be given to Canadians, and since there were so few Canadian musicians, they played the bejeezus out of this song. permalink parent award report block reply view 6 more comments...\nPubliusRex 4 points 2 days ago He makes us feel their pain  and envy the dead. permalink parent award report block reply view 1 more comments...\nFren20 4 points 2 days ago Loved it the song truly explains the sad plight..just beautiful ❤️❤️❤️ permalink parent award report block reply\nMajor_Nutt 2 points 2 days ago Found the Swiftie. permalink parent award report block reply\nLostElf 13 points 2 days ago Aw, come on! It's great for belting out at the top of your lungs while on a riding lawnmower. I mean what other song lists the Great Lakes and mentions the Maritime Sailors' Cathedral? permalink parent award report block reply\nRentedMule 12 points 2 days ago This song is obviously very polarizing.  Either people love it, or they hate it.  Put me in the love category.  I think that haunting guitar wail is just right for telling this story. permalink parent award report block reply Toobin247 4 points 2 days ago I’ve never heard of anyone saying the song was bad until know and I think this person has zero understanding about story ballads. Roland the Headless Thompson Gunner is another great one that hits me deep when I hear it. permalink parent award report block reply Nellie_the_Beaut 3 points 2 days ago lol, just like “The Day the Music Died” by Don McClaine.  Another long, story telling American ballad that’s part of American lexicon. People either love it or hate it - no in between when that chorus comes on “bye-bye, Mr. American pie. I took my Chevy to the levee…” permalink parent award report block reply THELEADERSOFMEN 1 points 2 days ago This song came out when I was four or five and I was OBSESSED with it, I wanted that K-tel record it was on soooo bad. permalink parent award report block reply fervordanbek 0 points 2 days ago It's a good song, I just wish it were more accurate. Finding information was more difficult in the 70s and he took some literary license. permalink parent award report block reply\nToobin247 4 points 2 days ago I’ve never heard of anyone saying the song was bad until know and I think this person has zero understanding about story ballads. Roland the Headless Thompson Gunner is another great one that hits me deep when I hear it. permalink parent award report block reply\nNellie_the_Beaut 3 points 2 days ago lol, just like “The Day the Music Died” by Don McClaine.  Another long, story telling American ballad that’s part of American lexicon. People either love it or hate it - no in between when that chorus comes on “bye-bye, Mr. American pie. I took my Chevy to the levee…” permalink parent award report block reply\nTHELEADERSOFMEN 1 points 2 days ago This song came out when I was four or five and I was OBSESSED with it, I wanted that K-tel record it was on soooo bad. permalink parent award report block reply\nfervordanbek 0 points 2 days ago It's a good song, I just wish it were more accurate. Finding information was more difficult in the 70s and he took some literary license. permalink parent award report block reply\nEatinglue 6 points 2 days ago I enjoy listening to it when I’m driving around the Great Lakes north woods. permalink parent award report block reply\nhatredcopter 6 points 2 days ago I will fucking fight you lol permalink parent award report block reply\nOldman1234 19 points 2 days ago They did retrieve the ship's bell and restored it to near new condition.  The bell is on permanent display at the Great Lakes Shipwreck Museum in Michigan and is used each November 10th in the bell-ringing ceremony in memory of the 29 crewmen of the Edmund Fitzgerald. https://ssedmundfitzgerald.org/bell-restoration permalink award report block reply\nLostElf 9 points 2 days ago The Big Fitz. Too bad she didn't put fifteen more miles behind her. RIP 29....likely still crewing her to this day. permalink award report block reply\nLogan051361 8 points 2 days ago I grew up in Michigan and can tell you I would not go anywhere near these Lakes. They are all scary as fuck. permalink award report block reply bull_in_a_china_shop 4 points 2 days ago On fair weather days the lakes are quite nice, but during inclement weather they can certainly be dangerous. permalink parent award report block reply\nbull_in_a_china_shop 4 points 2 days ago On fair weather days the lakes are quite nice, but during inclement weather they can certainly be dangerous. permalink parent award report block reply\nRoosterCrow 7 points 2 days ago Mother Superior is no joke in the fall. permalink award report block reply\nstarjello 4 points 2 days ago If you grew up in the Great Lakes region,  this song is ingrained into as much as apple pie is to America. RIP, Gordon…you gave dignity and homage to the crew of the Fitzgerald Ernest M. McSorley - Captain\nJohn H. McCarthy - 1st Mate\nJames A. Pratt - 2nd Mate\nMichael E. Armagost - 3rd Mate\nRussell J. Holl - Chief Engineer\nEdward F. Bindon - 1st Assistant Engineer\nThomas E. Edwards - 2nd Assistant Engineer\nRussell G. Haskell - 2nd Assistant Engineer\nOliver J. Champeau - 3rd Assistant Engineer\nEugene W. O'Brien - Wheelsman\nJohn J. Poviach - Wheelsman\nJohn D. Simmons - Wheelsman\nDavid E. Weiss - Cadet\nRobert C. Rafferty - Cook\nAllen G. Kalmon - 2nd Cook\nFrederick J. Beetcher - Porter\nNolan F. Church - Porter\nRansom E. Cundy - Watchman\nKarl A. Peckol - Watchman\nWilliam J. Spengler - Watchman\nThomas D. Borgeson - Maintenance\nJoseph W. Mazes - Maintenance\nGordon F. MacLellan - Wiper\nThomas D. Bentsen - Oiler\nRalph G. Walton - Oiler\nBlaine H. Wilhelm - Oiler\nMark A. Thomas - Deck Hand\nPaul M. Riippa - Deck Hand\nBruce L. Hudson - Deck Hand Rest in Peace permalink award report block reply\nPillarOfWisdom 4 points 2 days ago I love Edmond Fitzgerald's voice.  I think he was piloting the SS Cat Stevens when it crashed. https://www.youtube.com/watch?v=zOaFHmMYikc permalink award report block reply edxzxz 3 points 2 days ago There's an interview Larry King did with Cat Stevens (Yusef Islam) after he got deported for supporting terrorist organizations, your comment triggered me to go look it up.  They edited the original interview, in which retard Larry King argues endlessly with Cat Stevens about his song 'Morning Has Broken' where Cat Stevens explains he did not write that song, it's a hymn, and Larry King presses him over and over with 'yeah, but WHO WROTE IT?' Now the edited version cuts all the stupid badgering about who wrote it out. permalink parent award report block reply PillarOfWisdom 2 points 2 days ago Woah...Larry King was a functional retard. permalink parent award report block reply\nedxzxz 3 points 2 days ago There's an interview Larry King did with Cat Stevens (Yusef Islam) after he got deported for supporting terrorist organizations, your comment triggered me to go look it up.  They edited the original interview, in which retard Larry King argues endlessly with Cat Stevens about his song 'Morning Has Broken' where Cat Stevens explains he did not write that song, it's a hymn, and Larry King presses him over and over with 'yeah, but WHO WROTE IT?' Now the edited version cuts all the stupid badgering about who wrote it out. permalink parent award report block reply PillarOfWisdom 2 points 2 days ago Woah...Larry King was a functional retard. permalink parent award report block reply\nPillarOfWisdom 2 points 2 days ago Woah...Larry King was a functional retard. permalink parent award report block reply\nFreedomLubber 4 points 2 days ago Split Rock lighthouse in Minnesota does a yearly memorial service for the Edmond Fitzgerald. permalink award report block reply\nRealassman 3 points 2 days ago It’s a scary lake. permalink award report block reply\njournalist 3 points 2 days ago https://www.youtube.com/watch?v=tV9PoWQVga0&list=RDtV9PoWQVga0&start_radio=1 permalink award report block reply\nYoopersGodsCountry 3 points 2 days ago We listen to this tome daily permalink award report block reply\nTaxDollarsHardAtWork 2 points 2 days ago What's crazy is that the ship sank in waters that aren't as deep as the ship was long. permalink award report block reply Red_Ensign 3 points 2 days ago Thats why sailing on the lakes is so dangerous. In a big sea state the waves can smash a ship on the lake bottom. Or the bow can plunge into the bottom coming off the top of a swell. Its the shallows that make it hazardous. permalink parent award report block reply\nRed_Ensign 3 points 2 days ago Thats why sailing on the lakes is so dangerous. In a big sea state the waves can smash a ship on the lake bottom. Or the bow can plunge into the bottom coming off the top of a swell. Its the shallows that make it hazardous. permalink parent award report block reply\nDudemanfoo 2 points 2 days ago what a boat. permalink award report block reply\nNewPoppi 1 points 2 days ago https://youtu.be/9vST6hVRj2A?si=NUDkrQWazzA-M8B1 permalink award report block reply"}