{"id": "1ARK9pfsPB", "contents": "97 \"...obviously, IF there was something there about Trump, they would have released it.\" YES posted 5 hours ago by blue5707 5 comments award share report block Eric Daugherty @EricLDaugh • 17h 🚨 BREAKING: THERE IT IS! Democrats BLOCK Rep. Tim Burchett's motion to bring the Epstein Files to an immediate House floor vote. Can you imagine that? They don't care. \"I just made a motion to bring it straight to the dadgum floor and they blocked it. They blocked it!\" \"I\n5 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Matehmateh 4 points 5 hours ago Strange how they didn’t use this as evidence against Trump when he first ran for office over 8 years ago permalink award report block reply kmillz 2 points 3 hours ago I agree with the sentiment but WHY is the Trump administration's Justice department not releasing the files?? permalink award report block reply HeatherSwanson 2 points 4 hours ago Then release the fucking Epstein files! I'm tired of this shit. I want Bill Clinton and Prince Andrew exposed as the pedophiles they are permalink award report block reply CanadianMeathead 2 points 4 hours ago You can literally see the Republican block it, he is the chair. permalink award report block reply FusionBlack 1 points 22 minutes ago There is nothing there so by releasing it it will show that. Then they have nothing to manipulate. permalink award report block reply\nMatehmateh 4 points 5 hours ago Strange how they didn’t use this as evidence against Trump when he first ran for office over 8 years ago permalink award report block reply\nkmillz 2 points 3 hours ago I agree with the sentiment but WHY is the Trump administration's Justice department not releasing the files?? permalink award report block reply\nHeatherSwanson 2 points 4 hours ago Then release the fucking Epstein files! I'm tired of this shit. I want Bill Clinton and Prince Andrew exposed as the pedophiles they are permalink award report block reply\nCanadianMeathead 2 points 4 hours ago You can literally see the Republican block it, he is the chair. permalink award report block reply\nFusionBlack 1 points 22 minutes ago There is nothing there so by releasing it it will show that. Then they have nothing to manipulate. permalink award report block reply"}