{"id": "1ARK9l8Z6W", "contents": "369 Theyre trying to invent a new \"suckers and losers\" scandal. 🙄 GRAY LIVES MATTER posted 23 hours ago by DingleBalls 7 comments award share report block Dries Van Langenhove @DVanLangenhove • 2d They were part of a temporary exhibit that started in ‘24 and changes every year. Accounts that repeatedly lie should lose their golden checkmark. NewsWire @NewsWire_US • 3d U.S. quietly removes memorial to Black WWII soldiers at Netherlands American Cemetery\n7 comments Sort by Top Top New Worst Old Save Greenhills 9 points 22 hours ago Another garbage fake thing we probably were 37 trillion dollars in debt paying for. permalink award report block reply RINO_fatigue 8 points 23 hours ago Based removers of memorials to blacks permalink award report block reply WhatUCan 2 points 14 hours ago Its only based becuased there were like none permalink parent award report block reply JohnN 5 points 21 hours ago There were a grand total of... {drum roll}... 708 American blacks killed in action in all of WW2. permalink award report block reply Standingoak 2 points 16 hours ago \"African-American casualties totaled 202 dead and 233 injured, which accounted for 15% of all African-American casualties during World War II.\" \"a deadly munitions explosion of the ship SS E. A. Bryan on July 17, 1944, at the Port Chicago Naval Magazine in Port Chicago, California...killing 320 sailors and civilians and injuring at least 390 others.\" https://en.wikipedia.org/wiki/Port_Chicago_disaster permalink parent award report block reply LC1775 2 points 19 hours ago Lolol remember when the military was finally fully desegregated and the quality of the US Army tanked? That was during Vietnam and insubordination, drug use and fragging was rampant. Should have kept those fucks as truck drivers and orderlies permalink award report block reply Standingoak 2 points 16 hours ago https://en.wikipedia.org/wiki/Port_Chicago_disaster permalink parent award report block reply\nGreenhills 9 points 22 hours ago Another garbage fake thing we probably were 37 trillion dollars in debt paying for. permalink award report block reply\nRINO_fatigue 8 points 23 hours ago Based removers of memorials to blacks permalink award report block reply WhatUCan 2 points 14 hours ago Its only based becuased there were like none permalink parent award report block reply\nWhatUCan 2 points 14 hours ago Its only based becuased there were like none permalink parent award report block reply\nJohnN 5 points 21 hours ago There were a grand total of... {drum roll}... 708 American blacks killed in action in all of WW2. permalink award report block reply Standingoak 2 points 16 hours ago \"African-American casualties totaled 202 dead and 233 injured, which accounted for 15% of all African-American casualties during World War II.\" \"a deadly munitions explosion of the ship SS E. A. Bryan on July 17, 1944, at the Port Chicago Naval Magazine in Port Chicago, California...killing 320 sailors and civilians and injuring at least 390 others.\" https://en.wikipedia.org/wiki/Port_Chicago_disaster permalink parent award report block reply\nStandingoak 2 points 16 hours ago \"African-American casualties totaled 202 dead and 233 injured, which accounted for 15% of all African-American casualties during World War II.\" \"a deadly munitions explosion of the ship SS E. A. Bryan on July 17, 1944, at the Port Chicago Naval Magazine in Port Chicago, California...killing 320 sailors and civilians and injuring at least 390 others.\" https://en.wikipedia.org/wiki/Port_Chicago_disaster permalink parent award report block reply\nLC1775 2 points 19 hours ago Lolol remember when the military was finally fully desegregated and the quality of the US Army tanked? That was during Vietnam and insubordination, drug use and fragging was rampant. Should have kept those fucks as truck drivers and orderlies permalink award report block reply Standingoak 2 points 16 hours ago https://en.wikipedia.org/wiki/Port_Chicago_disaster permalink parent award report block reply\nStandingoak 2 points 16 hours ago https://en.wikipedia.org/wiki/Port_Chicago_disaster permalink parent award report block reply"}