{"id": "1ARK9nOo35", "contents": "9 \"NEW - Trump sends a letter to President Herzog formally asking him to pardon Netanyahu, saying the case against him is \"a political, unjustified prosecution.\"\" posted 8 hours ago by bleeje 7 comments award share report block Disclose.tv @disclosetv • 12h NEW - Trump sends a letter to President Herzog formally asking him to pardon Netanyahu, saying the case against him is \"a political, unjustified prosecution.\"\n7 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style TrumpWonByALandslide 8 points 8 hours ago Trump admin certainly has their priorities straight permalink award report block reply Nezmith 7 points 7 hours ago MIGA! permalink award report block reply 62jawbill 7 points 7 hours ago Anything for Israel. permalink award report block reply LordCommissarYarrick 6 points 7 hours ago Funding a known terrorist group and taking bribes should absolutely be grounds for imprisonment. permalink award report block reply Ostia 3 points 7 hours ago Being prosecuted for taking bribes isn't political motivated lawfare. permalink award report block reply rivetjoint2 -2 points 8 hours ago I like this move.   A pardon for BB would mean the end of his rule.  And that guy needs to go. permalink award report block reply maga_espada 5 points 7 hours ago Being hung as a war criminal also works for me. Preferred in fact. permalink parent award report block reply\nTrumpWonByALandslide 8 points 8 hours ago Trump admin certainly has their priorities straight permalink award report block reply\nNezmith 7 points 7 hours ago MIGA! permalink award report block reply\n62jawbill 7 points 7 hours ago Anything for Israel. permalink award report block reply\nLordCommissarYarrick 6 points 7 hours ago Funding a known terrorist group and taking bribes should absolutely be grounds for imprisonment. permalink award report block reply\nOstia 3 points 7 hours ago Being prosecuted for taking bribes isn't political motivated lawfare. permalink award report block reply\nrivetjoint2 -2 points 8 hours ago I like this move.   A pardon for BB would mean the end of his rule.  And that guy needs to go. permalink award report block reply maga_espada 5 points 7 hours ago Being hung as a war criminal also works for me. Preferred in fact. permalink parent award report block reply\nmaga_espada 5 points 7 hours ago Being hung as a war criminal also works for me. Preferred in fact. permalink parent award report block reply"}