{"id": "1ARK513JKt", "contents": "368 Candace Owens - \" I believe Zelenskyy is just as corrupt. I believe he's criminal. He's shut down churches, dragging Christian men with crosses around their neck to their death. He sickens me.\" posted 6 days ago by Royall 19 comments award share report block\n19 comments Sort by Top Top New Worst Old Save Around the Web Stop Eating These 3 Foods That Are Known to Cause Parasites Paratoxil ahamrbond 6 points 6 days ago Piers loves being wrong. It makes people angry. And angry people give him the attention he craves. What Candace is saying is just normal. This viewpoint should be mainstream. permalink award report block reply DJT4MoreYears 4 points 6 days ago Piers Morgan telling Candace what SHE thinks. lol What a faggot he is. Candace is right. Zelenskyy is a complete criminal. Ukraine is nothing more than a safe house for all the globalist's assets, money laundering, child exploitation, bio weapons labs and any other criminal sick shit there probably is. The regime change that needs to happen is in Ukraine..NOT Russia. permalink award report block reply TheLawofOne- 4 points 6 days ago Australia study discovers massive \"bot army\" providing 80% of pro Ukraine propaganda https://worldfreedomalliance.org/au/news/massive-anti-russian-bot-army-exposed-by-australian-researchers/ permalink award report block reply Frociaggine 2 points 6 days ago True permalink award report block reply Wingnuttery 2 points 6 days ago Momentary return to sanity for Candace permalink award report block reply Zarlino 1 points 6 days ago Fuck off candace you retarded cunt permalink award report block reply PatriotCoreUSA 1 points 6 days ago What a pair of cunts. permalink award report block reply sordfysh PRO 1 points 6 days ago Piers Morgan is a globalist stooge. He should be deported. permalink award report block reply 5DchessWatch 1 points 6 days ago In support of what Candace says here https://patriots.win/p/1ARK512lEr/ukrainian-security-personnel-att/c permalink award report block reply Mhmm2MoreWeeks 0 points 6 days ago Grifting Cunt. What kind of losers follow this POS anyhow? Assuming the JEW HATERS. She makes good money on Jew Hate. permalink award report block reply thelastlast 1 points 6 days ago i hate people that hate Candace.  they're basically liberals. permalink parent award report block reply 5DchessWatch 0 points 6 days ago cry more, wrong side o history and totally offtopic permalink parent award report block reply BBvarn 0 points 6 days ago Okay Omarosa. permalink award report block reply TheLawofOne- 1 points 6 days ago No The real cause of this war: https://web.archive.org/web/20221101053638/https://twitter.com/RnaudBertrand/status/1498491107902062592 permalink parent award report block reply thelastlast 1 points 6 days ago jesus.  long list of people saying not to do it. so why did victoria nuland and the vindman chowthieves destroy their own country? permalink parent award report block reply 5DchessWatch 1 points 6 days ago You JIDF fags need to go back home and focus on removing the training wheels of your country that is the US giving you money and military support you are fucking state sponsored toddlers on the internet, harassing people produce actual useful work, rather than blackmailing people, planting pedo and parasitizing other countries permalink parent award report block reply BBvarn 1 points 6 days ago Fuck you reddit pieces of shit, get off of this site bitches. permalink parent award report block reply SteveBannonsNckbeard 0 points 6 days ago Why are we even posting this crazy cunt. She thinks Elon and Peter Theil arealien hybrids who “dont bleed” permalink award report block reply\nahamrbond 6 points 6 days ago Piers loves being wrong. It makes people angry. And angry people give him the attention he craves. What Candace is saying is just normal. This viewpoint should be mainstream. permalink award report block reply\nDJT4MoreYears 4 points 6 days ago Piers Morgan telling Candace what SHE thinks. lol What a faggot he is. Candace is right. Zelenskyy is a complete criminal. Ukraine is nothing more than a safe house for all the globalist's assets, money laundering, child exploitation, bio weapons labs and any other criminal sick shit there probably is. The regime change that needs to happen is in Ukraine..NOT Russia. permalink award report block reply\nTheLawofOne- 4 points 6 days ago Australia study discovers massive \"bot army\" providing 80% of pro Ukraine propaganda https://worldfreedomalliance.org/au/news/massive-anti-russian-bot-army-exposed-by-australian-researchers/ permalink award report block reply\nFrociaggine 2 points 6 days ago True permalink award report block reply\nWingnuttery 2 points 6 days ago Momentary return to sanity for Candace permalink award report block reply\nZarlino 1 points 6 days ago Fuck off candace you retarded cunt permalink award report block reply\nPatriotCoreUSA 1 points 6 days ago What a pair of cunts. permalink award report block reply\nsordfysh PRO 1 points 6 days ago Piers Morgan is a globalist stooge. He should be deported. permalink award report block reply\n5DchessWatch 1 points 6 days ago In support of what Candace says here https://patriots.win/p/1ARK512lEr/ukrainian-security-personnel-att/c permalink award report block reply\nMhmm2MoreWeeks 0 points 6 days ago Grifting Cunt. What kind of losers follow this POS anyhow? Assuming the JEW HATERS. She makes good money on Jew Hate. permalink award report block reply thelastlast 1 points 6 days ago i hate people that hate Candace.  they're basically liberals. permalink parent award report block reply 5DchessWatch 0 points 6 days ago cry more, wrong side o history and totally offtopic permalink parent award report block reply\nthelastlast 1 points 6 days ago i hate people that hate Candace.  they're basically liberals. permalink parent award report block reply\n5DchessWatch 0 points 6 days ago cry more, wrong side o history and totally offtopic permalink parent award report block reply\nBBvarn 0 points 6 days ago Okay Omarosa. permalink award report block reply TheLawofOne- 1 points 6 days ago No The real cause of this war: https://web.archive.org/web/20221101053638/https://twitter.com/RnaudBertrand/status/1498491107902062592 permalink parent award report block reply thelastlast 1 points 6 days ago jesus.  long list of people saying not to do it. so why did victoria nuland and the vindman chowthieves destroy their own country? permalink parent award report block reply 5DchessWatch 1 points 6 days ago You JIDF fags need to go back home and focus on removing the training wheels of your country that is the US giving you money and military support you are fucking state sponsored toddlers on the internet, harassing people produce actual useful work, rather than blackmailing people, planting pedo and parasitizing other countries permalink parent award report block reply BBvarn 1 points 6 days ago Fuck you reddit pieces of shit, get off of this site bitches. permalink parent award report block reply\nTheLawofOne- 1 points 6 days ago No The real cause of this war: https://web.archive.org/web/20221101053638/https://twitter.com/RnaudBertrand/status/1498491107902062592 permalink parent award report block reply thelastlast 1 points 6 days ago jesus.  long list of people saying not to do it. so why did victoria nuland and the vindman chowthieves destroy their own country? permalink parent award report block reply\nthelastlast 1 points 6 days ago jesus.  long list of people saying not to do it. so why did victoria nuland and the vindman chowthieves destroy their own country? permalink parent award report block reply\n5DchessWatch 1 points 6 days ago You JIDF fags need to go back home and focus on removing the training wheels of your country that is the US giving you money and military support you are fucking state sponsored toddlers on the internet, harassing people produce actual useful work, rather than blackmailing people, planting pedo and parasitizing other countries permalink parent award report block reply BBvarn 1 points 6 days ago Fuck you reddit pieces of shit, get off of this site bitches. permalink parent award report block reply\nBBvarn 1 points 6 days ago Fuck you reddit pieces of shit, get off of this site bitches. permalink parent award report block reply\nSteveBannonsNckbeard 0 points 6 days ago Why are we even posting this crazy cunt. She thinks Elon and Peter Theil arealien hybrids who “dont bleed” permalink award report block reply"}