{"id": "1ARK5A8ThL", "contents": "881 @SecScottBessent low-key cooks George Slopodopolous on the Democrat Shutdown: \"You were involved in a lot of these in the 90s.\"... posted 3 days ago by duehuckleberry 30 comments award share report block Rapid Response 47 @RapidResponse47 • 3d .@SecScottBessent low-key cooks George Slopodopolous on the Democrat Shutdown: \"You were involved in a lot of these in the 90s. You basically called the Republicans 'terrorists.' You said that it is not the responsible party that keeps the government closed.\"\n30 comments Sort by Top Top New Worst Old Save here2red 26 points 3 days ago why does the admin keep going on this guy's show? permalink award report block reply Viewer01 19 points 3 days ago Sam Hyde probably spoke prophetic words in one of his videos. Conservatives will give leftists all due consideration in a debate. We will evaluate their ideas and adopt if proof tested. Leftists have no interest in this. They inherently do not argue in good faith. You will receive no consideration. Their only goal is trickery and then eventually subjugation. Bessent would have been more productive pissing into a hurricane. The only productive discussions are with the young as they are still forming their identity. permalink parent award report block reply ProtestantPatriot777 6 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply Nate_Higgersalot 6 points 3 days ago To embarrass him. permalink parent award report block reply Kraken_V_Algorithm 5 points 3 days ago Opportunity for more lawsuits.  He actually has to be careful what he says now. permalink parent award report block reply AcAirman 2 points 3 days ago Watch the vid. It is obvious to most. permalink parent award report block reply corporateshizer -3 points 3 days ago Same team, different flavors. They're trading one-liners and 'oh-snaps' all day, while everyday Americans are getting crushed by 100 million foreign invaders. It's a big club and you aren't in it. permalink parent award report block reply mohel 18 points 3 days ago One purchase on amazon xD permalink award report block reply FusionBlack 12 points 3 days ago That was a beat down. permalink parent award report block reply Patrick_Bateman 5 points 3 days ago Certainly wasn't low-key. More like Colonel's extra crispy. permalink parent award report block reply SicSemperTyrannis2 -2 points 3 days ago I was hoping to see a literal beat down. This faggot deserves it! permalink parent award report block reply CrackerSmurf2 3 points 3 days ago and a thumbs down. permalink parent award report block reply rocco_saint 1 points 3 days ago Make them live by their own rules. permalink parent award report block reply unotrumpcard 11 points 3 days ago Scott Bessent should grill George Slopodopolous on his ties to Soros. permalink award report block reply MacheteSanta 2 points 3 days ago Scott is acting like he turned on Soros.  I don't know of anything he's done against Trump.  Is it possible he would leak insider info to Trump, culminating in Soros' deportation to Guantanamo Bay for a daily dose of waterboarding? permalink parent award report block reply unotrumpcard 1 points 3 days ago In what Q drop did you read that? permalink parent award report block reply MacheteSanta 2 points 3 days ago I don't navigate 4chan.  Answer my question.  Did Scott do anything against Trump yet?  I KNOW he used to work for Soros.  \"Keep your enemies closer\" kind of chess?  And yes, Soros absolutely can get waterboarded in Guantanamo Bay if someone had the balls to prosecute him permalink parent award report block reply unotrumpcard -3 points 3 days ago He is forcing Bessent to leak insider information to him with the threat that he will throw Bessent in prison like he did with Hillary. permalink parent award report block reply Hairytacofanatic 5 points 3 days ago “How dare you quote me!” permalink award report block reply Patrick_Bateman 4 points 3 days ago \"We can disagree on the history....\" No, we can't. It either happened or it didn't. 😂 permalink parent award report block reply goodguy 5 points 3 days ago George is  a snake that just keeps on slithering. permalink award report block reply HockeyMom4Trump 5 points 3 days ago George can whimper home to his weird wacky wife Ali Wentworth. permalink award report block reply behemoth887 3 points 3 days ago that desperate under the breath deflection into subject change attempt. libs are so disgusting and filthy it's unbelievable. his viewers definitely all bought into that denial and ignored the truth though so it's effective on libs despite humans easily seeing through it. permalink award report block reply chahn1138 3 points 3 days ago You got one purchase on Amazon this week, and that is very much what you said. What's that smell??!?!!  Is that Burnt Flesh?!?   YOW!!! permalink award report block reply SanityGumby 2 points 3 days ago We have the best gays permalink award report block reply asiatrails 2 points 3 days ago The slow, calm, and steady delivery by a master wedgie provider delivers the wedgie and causes democrat frothing that would make a rabid dog jealous permalink award report block reply spinometer2 1 points 3 days ago YOU GOT ONE PURCHASE ON AMAZON THIS WEEK Bessent is savage permalink award report block reply Brock_Shithouse 1 points 3 days ago Disrupting? How many people feel disrupted by the shutdown? How many have noticed? permalink award report block reply AwShitHereWeGoAgain 1 points 3 days ago I hate that commie Clinton-fellating faggot. permalink award report block reply Ronaldus -3 points 3 days ago They don't even need any democrats for the vote. There is no filibuster. The whole thing is a sham. permalink award report block reply\nhere2red 26 points 3 days ago why does the admin keep going on this guy's show? permalink award report block reply Viewer01 19 points 3 days ago Sam Hyde probably spoke prophetic words in one of his videos. Conservatives will give leftists all due consideration in a debate. We will evaluate their ideas and adopt if proof tested. Leftists have no interest in this. They inherently do not argue in good faith. You will receive no consideration. Their only goal is trickery and then eventually subjugation. Bessent would have been more productive pissing into a hurricane. The only productive discussions are with the young as they are still forming their identity. permalink parent award report block reply ProtestantPatriot777 6 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply Nate_Higgersalot 6 points 3 days ago To embarrass him. permalink parent award report block reply Kraken_V_Algorithm 5 points 3 days ago Opportunity for more lawsuits.  He actually has to be careful what he says now. permalink parent award report block reply AcAirman 2 points 3 days ago Watch the vid. It is obvious to most. permalink parent award report block reply corporateshizer -3 points 3 days ago Same team, different flavors. They're trading one-liners and 'oh-snaps' all day, while everyday Americans are getting crushed by 100 million foreign invaders. It's a big club and you aren't in it. permalink parent award report block reply\nViewer01 19 points 3 days ago Sam Hyde probably spoke prophetic words in one of his videos. Conservatives will give leftists all due consideration in a debate. We will evaluate their ideas and adopt if proof tested. Leftists have no interest in this. They inherently do not argue in good faith. You will receive no consideration. Their only goal is trickery and then eventually subjugation. Bessent would have been more productive pissing into a hurricane. The only productive discussions are with the young as they are still forming their identity. permalink parent award report block reply ProtestantPatriot777 6 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply\nProtestantPatriot777 6 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply\nNate_Higgersalot 6 points 3 days ago To embarrass him. permalink parent award report block reply\nKraken_V_Algorithm 5 points 3 days ago Opportunity for more lawsuits.  He actually has to be careful what he says now. permalink parent award report block reply\nAcAirman 2 points 3 days ago Watch the vid. It is obvious to most. permalink parent award report block reply\ncorporateshizer -3 points 3 days ago Same team, different flavors. They're trading one-liners and 'oh-snaps' all day, while everyday Americans are getting crushed by 100 million foreign invaders. It's a big club and you aren't in it. permalink parent award report block reply\nmohel 18 points 3 days ago One purchase on amazon xD permalink award report block reply FusionBlack 12 points 3 days ago That was a beat down. permalink parent award report block reply Patrick_Bateman 5 points 3 days ago Certainly wasn't low-key. More like Colonel's extra crispy. permalink parent award report block reply SicSemperTyrannis2 -2 points 3 days ago I was hoping to see a literal beat down. This faggot deserves it! permalink parent award report block reply CrackerSmurf2 3 points 3 days ago and a thumbs down. permalink parent award report block reply rocco_saint 1 points 3 days ago Make them live by their own rules. permalink parent award report block reply\nFusionBlack 12 points 3 days ago That was a beat down. permalink parent award report block reply Patrick_Bateman 5 points 3 days ago Certainly wasn't low-key. More like Colonel's extra crispy. permalink parent award report block reply SicSemperTyrannis2 -2 points 3 days ago I was hoping to see a literal beat down. This faggot deserves it! permalink parent award report block reply\nPatrick_Bateman 5 points 3 days ago Certainly wasn't low-key. More like Colonel's extra crispy. permalink parent award report block reply\nSicSemperTyrannis2 -2 points 3 days ago I was hoping to see a literal beat down. This faggot deserves it! permalink parent award report block reply\nCrackerSmurf2 3 points 3 days ago and a thumbs down. permalink parent award report block reply\nrocco_saint 1 points 3 days ago Make them live by their own rules. permalink parent award report block reply\nunotrumpcard 11 points 3 days ago Scott Bessent should grill George Slopodopolous on his ties to Soros. permalink award report block reply MacheteSanta 2 points 3 days ago Scott is acting like he turned on Soros.  I don't know of anything he's done against Trump.  Is it possible he would leak insider info to Trump, culminating in Soros' deportation to Guantanamo Bay for a daily dose of waterboarding? permalink parent award report block reply unotrumpcard 1 points 3 days ago In what Q drop did you read that? permalink parent award report block reply MacheteSanta 2 points 3 days ago I don't navigate 4chan.  Answer my question.  Did Scott do anything against Trump yet?  I KNOW he used to work for Soros.  \"Keep your enemies closer\" kind of chess?  And yes, Soros absolutely can get waterboarded in Guantanamo Bay if someone had the balls to prosecute him permalink parent award report block reply unotrumpcard -3 points 3 days ago He is forcing Bessent to leak insider information to him with the threat that he will throw Bessent in prison like he did with Hillary. permalink parent award report block reply\nMacheteSanta 2 points 3 days ago Scott is acting like he turned on Soros.  I don't know of anything he's done against Trump.  Is it possible he would leak insider info to Trump, culminating in Soros' deportation to Guantanamo Bay for a daily dose of waterboarding? permalink parent award report block reply unotrumpcard 1 points 3 days ago In what Q drop did you read that? permalink parent award report block reply MacheteSanta 2 points 3 days ago I don't navigate 4chan.  Answer my question.  Did Scott do anything against Trump yet?  I KNOW he used to work for Soros.  \"Keep your enemies closer\" kind of chess?  And yes, Soros absolutely can get waterboarded in Guantanamo Bay if someone had the balls to prosecute him permalink parent award report block reply unotrumpcard -3 points 3 days ago He is forcing Bessent to leak insider information to him with the threat that he will throw Bessent in prison like he did with Hillary. permalink parent award report block reply\nunotrumpcard 1 points 3 days ago In what Q drop did you read that? permalink parent award report block reply MacheteSanta 2 points 3 days ago I don't navigate 4chan.  Answer my question.  Did Scott do anything against Trump yet?  I KNOW he used to work for Soros.  \"Keep your enemies closer\" kind of chess?  And yes, Soros absolutely can get waterboarded in Guantanamo Bay if someone had the balls to prosecute him permalink parent award report block reply unotrumpcard -3 points 3 days ago He is forcing Bessent to leak insider information to him with the threat that he will throw Bessent in prison like he did with Hillary. permalink parent award report block reply\nMacheteSanta 2 points 3 days ago I don't navigate 4chan.  Answer my question.  Did Scott do anything against Trump yet?  I KNOW he used to work for Soros.  \"Keep your enemies closer\" kind of chess?  And yes, Soros absolutely can get waterboarded in Guantanamo Bay if someone had the balls to prosecute him permalink parent award report block reply unotrumpcard -3 points 3 days ago He is forcing Bessent to leak insider information to him with the threat that he will throw Bessent in prison like he did with Hillary. permalink parent award report block reply\nunotrumpcard -3 points 3 days ago He is forcing Bessent to leak insider information to him with the threat that he will throw Bessent in prison like he did with Hillary. permalink parent award report block reply\nHairytacofanatic 5 points 3 days ago “How dare you quote me!” permalink award report block reply Patrick_Bateman 4 points 3 days ago \"We can disagree on the history....\" No, we can't. It either happened or it didn't. 😂 permalink parent award report block reply\nPatrick_Bateman 4 points 3 days ago \"We can disagree on the history....\" No, we can't. It either happened or it didn't. 😂 permalink parent award report block reply\ngoodguy 5 points 3 days ago George is  a snake that just keeps on slithering. permalink award report block reply\nHockeyMom4Trump 5 points 3 days ago George can whimper home to his weird wacky wife Ali Wentworth. permalink award report block reply\nbehemoth887 3 points 3 days ago that desperate under the breath deflection into subject change attempt. libs are so disgusting and filthy it's unbelievable. his viewers definitely all bought into that denial and ignored the truth though so it's effective on libs despite humans easily seeing through it. permalink award report block reply\nchahn1138 3 points 3 days ago You got one purchase on Amazon this week, and that is very much what you said. What's that smell??!?!!  Is that Burnt Flesh?!?   YOW!!! permalink award report block reply\nSanityGumby 2 points 3 days ago We have the best gays permalink award report block reply\nasiatrails 2 points 3 days ago The slow, calm, and steady delivery by a master wedgie provider delivers the wedgie and causes democrat frothing that would make a rabid dog jealous permalink award report block reply\nspinometer2 1 points 3 days ago YOU GOT ONE PURCHASE ON AMAZON THIS WEEK Bessent is savage permalink award report block reply\nBrock_Shithouse 1 points 3 days ago Disrupting? How many people feel disrupted by the shutdown? How many have noticed? permalink award report block reply\nAwShitHereWeGoAgain 1 points 3 days ago I hate that commie Clinton-fellating faggot. permalink award report block reply\nRonaldus -3 points 3 days ago They don't even need any democrats for the vote. There is no filibuster. The whole thing is a sham. permalink award report block reply"}