{"id": "1ARK9oWvSA", "contents": "438 NOW - Rubio: \"The Chinese are undertaking the most rapid military buildup in human history, and part of that is their expansion of their nuclear capabilities... I think everybody's concerned about that.\" posted 1 hour ago by -Evspra 91 comments award share report block Disclose.tv @disclosetv • 2h NOW - Rubio: \"The Chinese are undertaking the most rapid military buildup in human history, and part of that is their expansion of their nuclear capabilities... I think everybody's concerned about that.\"\n91 comments Sort by Top Top New Worst Old Save -Evspra OP 102 points 1 hour ago You're right, Rubio. That does sound concerning. Anyways, let's import half a billion of these people to continue stealing our technology. permalink award report block reply M-m-m-my-corona 55 points 1 hour ago Yeah because we're all idiots and if we don't import them, the Universities will go out of business.  You know those institutions that teach our kids to hate us?  Yeah, they're too important.  MAGA! permalink parent award report block reply ThisTrainHasNoBrakes -1 points 9 minutes ago This sounds like you know what MAGA means better than the rest of us! 🤨👌 permalink parent award report block reply zigZag590 17 points 37 minutes ago Trump has turned out to be a huge disappointment. He's a GDP nationalist, so I expect the selling out of our future to only accelerate... Only thing he cares about is GDP and cucking for Israel. permalink parent award report block reply LeRiverDanube 10 points 1 hour ago it's a race on who underdelivers, and who undercuts the hardest. And I don't want to live in this planet anymore. permalink parent award report block reply MySidesGoUp 4 points 50 minutes ago There is a place for us here.  We just can’t give in to such demonic garbage.  I say that for myself as well. permalink parent award report block reply LeRiverDanube 5 points 48 minutes ago if the us government ceased to exist. This country would burn down in flames, and then flourish even harder. permalink parent award report block reply Patriot5TN 10 points 42 minutes ago Deport them all forever and move more jobs to the beautiful Tax Haven of Tennessee where electricity is Cheap thanks to TVA! permalink parent award report block reply flashersenpai 3 points 56 minutes ago damn permalink parent award report block reply load 11 more comments... josiborg 39 points 1 hour ago We should take in 600,000 of them as students to learn how to kill us and go back to do it. permalink award report block reply breadbaker 11 points 1 hour ago Why yes, that sounds like a brilliant strategy, little Marco. Brilliant. We call that the big f' u America strategy. - Papa Trump permalink parent award report block reply champdog 6 points 50 minutes ago And while we're at it lets cut those tariffs in half. permalink parent award report block reply breadbaker 3 points 47 minutes ago And while we're at it lets cut those tariffs in half. Nooo, little Marco, the most brilliant strategy was by George W. Bush in 2001 when he let China into the world Trade Organization and shafted hundreds of thousands of those American manufacturing jobs, so a few RICH on Wall Street could get even richer by floating an IPO of a Chinese company that may or may not exist. Brilliant Stuff. - Papa Trump permalink parent award report block reply josiborg 1 points 10 minutes ago It's the strategy that got us 9/11. We gave them pell grants to embry riddle to learn to fly through the buildings. A USF finance teacher was arrested for being the CFO of some terrorist organization in the Midwest, teaching other mooslimz to do the same. permalink parent award report block reply AlmostFullyDilated 2 points 44 minutes ago it would be hilarious to train them all wrong permalink parent award report block reply YouEssAye 1 points 3 minutes ago Lmao awesome idea. I guess depending on the degree they get, there's a good chance they'll be trained wrong anyways. Regardless of the degree the prereqs will include leftist brainwashing classes anyways. Why did I need Psychology and Philosophy for my BS in accounting? It's no coincidence both of my professors in those classes brown short haired atheist fat dykes. My philosophy prof spent more time lecturing us on how Christianity is the most evil retarded force on the planet than she did on the works of Plato. permalink parent award report block reply Awakened 1 points 53 minutes ago This idea is so crazy it's gotta work. permalink parent award report block reply I_Am_John_Galt 29 points 1 hour ago So uhh...let's keep educating their next generation in Nuclear Engineering?  I'm so confused permalink award report block reply Patriot4TN 10 points 1 hour ago You are not supposed to notice! permalink parent award report block reply Brandon1776 19 points 1 hour ago So let's bring in 600k spys to speed up that process! Fuck this administration permalink award report block reply DirtyDiaperJoe 10 points 1 hour ago Well if their new military build up is as successful as their bridge building skills are, I'm not sure we have much to worry about. permalink award report block reply Ugh3rdaccount 8 points 53 minutes ago Bwahaha have you seen our dei military!??! Besides I can walk down the street in Beijing without being murdered by violent blacks and jihadists. I can’t say the same about dozens and dozens of American cities. You gonna fight for that? permalink parent award report block reply LeRiverDanube 3 points 47 minutes ago on the flipside you might step and slip on pee and poop, and hobos and aunties trying to steal your shit in broad daylight. permalink parent award report block reply hungryfreaksdaddy 2 points 28 minutes ago Wait are we talking Beijing or San Francisco? I can't tell the difference. permalink parent award report block reply LeRiverDanube 1 points 26 minutes ago if the buildings are trying to kill you. you're in china. permalink parent award report block reply Yawnz13 0 points 52 minutes ago You gonna shill for the Chinks?  If their military was legit, they would've already taken a tiny island. permalink parent award report block reply LeRiverDanube 2 points 45 minutes ago the only reason china got succesful is every other government is just letting them be succesful at the cost of betraying their own country. Ours included. permalink parent award report block reply MySidesGoUp 1 points 49 minutes ago Pointing out how cucked our military is, isnt shilling for China. Maybe get your staff sarges dick out your mouth and read the room. permalink parent award report block reply Yawnz13 0 points 34 minutes ago Pointing out how cucked our military is, isnt shilling for China. But you didn't only do that, ignoring that you're incorrect on that fact anyway. Maybe get your staff sarges dick out your mouth and read the room. Sounds like you need to take your own advice.  Nigga acting like China's military \"build-up\" is anything more than theater.  Why can't they take Taiwan?  Why can't they provide their troops with basic armaments? permalink parent award report block reply LeRiverDanube 6 points 1 hour ago fallout wasn't caused by nukes. It was caused by chink hardware failures. permalink parent award report block reply DirtyDiaperJoe 2 points 32 minutes ago You literally just made my point for me. permalink parent award report block reply Viewer01 0 points 56 minutes ago Their navy will forever be shit, but if they get decent at drones then their Zerg rush won’t be stopped. Insert zap brannigan meme. permalink parent award report block reply Yawnz13 2 points 52 minutes ago Drones aren't hard to stop. permalink parent award report block reply Viewer01 1 points 26 minutes ago You dated yourself boomer. permalink parent award report block reply Yawnz13 1 points 19 minutes ago Ironic coming from the dude that thinks that drones are hard to stop.  Go look at Ukraine.  The reason why they are so prevalent in that war is because both countries have shit for ECM, are manned by cross-eyed alcoholics, and have lost a great deal of manpower. permalink parent award report block reply view 1 more comments... GlorpLorp -2 points 1 hour ago Keep on laughing. Stupid fucks like you need to stop talking on military matters. permalink parent award report block reply mikejones 3 points 1 hour ago Imagine thinking the currently military will stop all future strikes. Imagine a 50 mile radius of a strike site is not able to be visited. permalink parent award report block reply flp999 10 points 56 minutes ago Not concerned about China. Am concerned about domestic enemies. Pro tip: if you arrest everyone in the U.S. government that’s been collaborating with them, there is no China threat. And it’s simple as. permalink award report block reply MySidesGoUp 3 points 48 minutes ago That’s exactly the solution and why they will always lionize others. permalink parent award report block reply guywholikesDjtof2024 0 points 35 minutes ago We cannot focus on multiple things. We are single issue. Like the dems are. permalink parent award report block reply SupFrens 8 points 54 minutes ago Quick, lets import 500,000 Chinese. Surely this is a great strategy. FFS. permalink award report block reply buster2209 6 points 54 minutes ago I'm amazed they can do that without importing Indians to do the work permalink award report block reply Wildwind 6 points 1 hour ago Dont worry about Russia. Its china that everyone should be looking at. permalink award report block reply Simple_Doot 4 points 49 minutes ago I actually dont really care about Russia.  And China does have an espionage problem that is of concern.  But what if...we spent our time and money...ON OURSELVES? permalink parent award report block reply ShadowInv 1 points 27 minutes ago The russia ukraine conflict was just to kill more white men. ukraine leadership has passports to israel, russian oligarchs have passports to israel. White boy dead permalink parent award report block reply 603taco 5 points 44 minutes ago I’m  just worried this is gonna put a negative picture on all those 600k CCP students in our country. permalink award report block reply Awakened 3 points 51 minutes ago When the economy goes to complete shit you can expect war shortly there after. permalink award report block reply ParmesanCartel -1 points 41 minutes ago Imagine what the big retard will do for a distraction now that the Epstein thing is moving along permalink parent award report block reply Alphahorizon 2 points 1 hour ago Give me more tax money. permalink award report block reply Throwingway22 2 points 51 minutes ago So let's bring in 600k spies a year and educate them instead of Americans permalink award report block reply Riehlpissed 2 points 56 minutes ago Keep with the Joneses as they say. permalink award report block reply FateOfNorns 2 points 41 minutes ago No shit. Let's encourage more to infest our universities. permalink award report block reply Sicsempertyrannis76 1 points 40 minutes ago The Battle of Armageddon isn't going to fight itself permalink award report block reply Than0sIII 1 points 1 hour ago Could've sworn folks have been saying that China's been going downhill internally regardless of their posturing. permalink award report block reply SwedishChainsaw2 1 points 8 minutes ago Has anyone ever seen evidence of China and Israel having beef with each other? permalink award report block reply foom 1 points 21 minutes ago Quick, let’s teach them everything we know! permalink award report block reply freebirdie 1 points 1 hour ago Better bring 600k of them here for safety sake. 🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄 permalink award report block reply henri_derelicte 1 points 20 minutes ago China needs to be weakened internally. That can be through US propaganda meant to stoke division or US-sponsored terrorism like biological and chemical weapons attacks permalink award report block reply auntjemima 1 points 33 minutes ago We should be safe with half of them over here permalink award report block reply alucard13mmfmj 1 points 1 hour ago I say.. let china start shit. Itll clear up some population imo. Like we shouldve let pakistan and india fight to thin out some numbers. If china fights india.. that alone would clear out 40% of the worlds population lol. All we gotta do is not be retarded and accept rapefugees. permalink award report block reply Yawnz13 1 points 33 minutes ago People failing the A/B testing again. permalink award report block reply Wexit-Delecto 1 points 3 minutes ago Maybe stop pulling the punch on tariffs on Chinese imports then? Hit them with a 200%+ tariff and (here's the trick) don't fucking lift it a few days later. President Trump already correctly pointed out that he could destroy the CCP with tariffs. So why not do it? Why let them continue building up? permalink award report block reply JimmyRussler 1 points 1 hour ago Good thing we left countless numbers of them to cross our borders unvetted. Brandon's legacy is going to be the destruction he caused. permalink award report block reply GhostOfMyFormerSelf 1 points 46 minutes ago When China's economy implodes their military won't matter much. permalink award report block reply JayKay1776 1 points 45 minutes ago Did you not see their bridge that came down days after they opened. This is a common theme because of corruption nothing that Chinese built is worth a goddamn. Half their weapon systems don't even fire what are they building up people because of the one child policy they're in worse shape than we are they going to call up all the 60 and 70 year olds. permalink award report block reply ParmesanCartel -1 points 40 minutes ago 50 year old norincos are more reliable than 80 percent of the shit made here nowadays. permalink parent award report block reply AlmostFullyDilated 1 points 45 minutes ago lol the Chinese will end up nuking themselves because that shit was made in China permalink award report block reply FatigueIsReal 1 points 43 minutes ago And Trump has been ahead of this since before he took office in 2025. permalink award report block reply DITTOPatriot 1 points 28 minutes ago New spending bill at 7: permalink award report block reply donteatthat 1 points 13 minutes ago So bring in about 600k of them. Fucking retarded. permalink award report block reply Psalm-118_24 1 points 13 minutes ago So let's let 600K CCP \"students\" into the US. permalink award report block reply MEME-SUPREME 0 points 1 hour ago Vance / Rubio 2028 permalink award report block reply ShadowInv 2 points 26 minutes ago Rubio is israel cuck. He was the first to attack tiktok after they paid him permalink parent award report block reply flashersenpai 1 points 52 minutes ago ew might as well be Vance / Graham who do you think keeps wanting to instigate Russia and Venezuela? permalink parent award report block reply ramennov 1 points 4 minutes ago Why would Vance make a good President? permalink parent award report block reply mikejones 0 points 1 hour ago Only a matter of time before numerous strikes hit us as they return the favor. permalink award report block reply JPZY 1 points 25 minutes ago Comment removed by community filter, pending further review. permalink award report block reply clearasabell 1 points 50 minutes ago Comment removed by community filter, pending further review. permalink award report block reply Ralphusthegreatus 1 points 1 hour ago Comment removed by community moderators. permalink award report block reply AFPede 0 points 57 minutes ago Comment removed by community moderators. permalink award report block reply\n-Evspra OP 102 points 1 hour ago You're right, Rubio. That does sound concerning. Anyways, let's import half a billion of these people to continue stealing our technology. permalink award report block reply M-m-m-my-corona 55 points 1 hour ago Yeah because we're all idiots and if we don't import them, the Universities will go out of business.  You know those institutions that teach our kids to hate us?  Yeah, they're too important.  MAGA! permalink parent award report block reply ThisTrainHasNoBrakes -1 points 9 minutes ago This sounds like you know what MAGA means better than the rest of us! 🤨👌 permalink parent award report block reply zigZag590 17 points 37 minutes ago Trump has turned out to be a huge disappointment. He's a GDP nationalist, so I expect the selling out of our future to only accelerate... Only thing he cares about is GDP and cucking for Israel. permalink parent award report block reply LeRiverDanube 10 points 1 hour ago it's a race on who underdelivers, and who undercuts the hardest. And I don't want to live in this planet anymore. permalink parent award report block reply MySidesGoUp 4 points 50 minutes ago There is a place for us here.  We just can’t give in to such demonic garbage.  I say that for myself as well. permalink parent award report block reply LeRiverDanube 5 points 48 minutes ago if the us government ceased to exist. This country would burn down in flames, and then flourish even harder. permalink parent award report block reply Patriot5TN 10 points 42 minutes ago Deport them all forever and move more jobs to the beautiful Tax Haven of Tennessee where electricity is Cheap thanks to TVA! permalink parent award report block reply flashersenpai 3 points 56 minutes ago damn permalink parent award report block reply load 11 more comments...\nM-m-m-my-corona 55 points 1 hour ago Yeah because we're all idiots and if we don't import them, the Universities will go out of business.  You know those institutions that teach our kids to hate us?  Yeah, they're too important.  MAGA! permalink parent award report block reply ThisTrainHasNoBrakes -1 points 9 minutes ago This sounds like you know what MAGA means better than the rest of us! 🤨👌 permalink parent award report block reply\nThisTrainHasNoBrakes -1 points 9 minutes ago This sounds like you know what MAGA means better than the rest of us! 🤨👌 permalink parent award report block reply\nzigZag590 17 points 37 minutes ago Trump has turned out to be a huge disappointment. He's a GDP nationalist, so I expect the selling out of our future to only accelerate... Only thing he cares about is GDP and cucking for Israel. permalink parent award report block reply\nLeRiverDanube 10 points 1 hour ago it's a race on who underdelivers, and who undercuts the hardest. And I don't want to live in this planet anymore. permalink parent award report block reply MySidesGoUp 4 points 50 minutes ago There is a place for us here.  We just can’t give in to such demonic garbage.  I say that for myself as well. permalink parent award report block reply LeRiverDanube 5 points 48 minutes ago if the us government ceased to exist. This country would burn down in flames, and then flourish even harder. permalink parent award report block reply\nMySidesGoUp 4 points 50 minutes ago There is a place for us here.  We just can’t give in to such demonic garbage.  I say that for myself as well. permalink parent award report block reply LeRiverDanube 5 points 48 minutes ago if the us government ceased to exist. This country would burn down in flames, and then flourish even harder. permalink parent award report block reply\nLeRiverDanube 5 points 48 minutes ago if the us government ceased to exist. This country would burn down in flames, and then flourish even harder. permalink parent award report block reply\nPatriot5TN 10 points 42 minutes ago Deport them all forever and move more jobs to the beautiful Tax Haven of Tennessee where electricity is Cheap thanks to TVA! permalink parent award report block reply\nflashersenpai 3 points 56 minutes ago damn permalink parent award report block reply\njosiborg 39 points 1 hour ago We should take in 600,000 of them as students to learn how to kill us and go back to do it. permalink award report block reply breadbaker 11 points 1 hour ago Why yes, that sounds like a brilliant strategy, little Marco. Brilliant. We call that the big f' u America strategy. - Papa Trump permalink parent award report block reply champdog 6 points 50 minutes ago And while we're at it lets cut those tariffs in half. permalink parent award report block reply breadbaker 3 points 47 minutes ago And while we're at it lets cut those tariffs in half. Nooo, little Marco, the most brilliant strategy was by George W. Bush in 2001 when he let China into the world Trade Organization and shafted hundreds of thousands of those American manufacturing jobs, so a few RICH on Wall Street could get even richer by floating an IPO of a Chinese company that may or may not exist. Brilliant Stuff. - Papa Trump permalink parent award report block reply josiborg 1 points 10 minutes ago It's the strategy that got us 9/11. We gave them pell grants to embry riddle to learn to fly through the buildings. A USF finance teacher was arrested for being the CFO of some terrorist organization in the Midwest, teaching other mooslimz to do the same. permalink parent award report block reply AlmostFullyDilated 2 points 44 minutes ago it would be hilarious to train them all wrong permalink parent award report block reply YouEssAye 1 points 3 minutes ago Lmao awesome idea. I guess depending on the degree they get, there's a good chance they'll be trained wrong anyways. Regardless of the degree the prereqs will include leftist brainwashing classes anyways. Why did I need Psychology and Philosophy for my BS in accounting? It's no coincidence both of my professors in those classes brown short haired atheist fat dykes. My philosophy prof spent more time lecturing us on how Christianity is the most evil retarded force on the planet than she did on the works of Plato. permalink parent award report block reply Awakened 1 points 53 minutes ago This idea is so crazy it's gotta work. permalink parent award report block reply\nbreadbaker 11 points 1 hour ago Why yes, that sounds like a brilliant strategy, little Marco. Brilliant. We call that the big f' u America strategy. - Papa Trump permalink parent award report block reply champdog 6 points 50 minutes ago And while we're at it lets cut those tariffs in half. permalink parent award report block reply breadbaker 3 points 47 minutes ago And while we're at it lets cut those tariffs in half. Nooo, little Marco, the most brilliant strategy was by George W. Bush in 2001 when he let China into the world Trade Organization and shafted hundreds of thousands of those American manufacturing jobs, so a few RICH on Wall Street could get even richer by floating an IPO of a Chinese company that may or may not exist. Brilliant Stuff. - Papa Trump permalink parent award report block reply josiborg 1 points 10 minutes ago It's the strategy that got us 9/11. We gave them pell grants to embry riddle to learn to fly through the buildings. A USF finance teacher was arrested for being the CFO of some terrorist organization in the Midwest, teaching other mooslimz to do the same. permalink parent award report block reply\nchampdog 6 points 50 minutes ago And while we're at it lets cut those tariffs in half. permalink parent award report block reply breadbaker 3 points 47 minutes ago And while we're at it lets cut those tariffs in half. Nooo, little Marco, the most brilliant strategy was by George W. Bush in 2001 when he let China into the world Trade Organization and shafted hundreds of thousands of those American manufacturing jobs, so a few RICH on Wall Street could get even richer by floating an IPO of a Chinese company that may or may not exist. Brilliant Stuff. - Papa Trump permalink parent award report block reply\nbreadbaker 3 points 47 minutes ago And while we're at it lets cut those tariffs in half. Nooo, little Marco, the most brilliant strategy was by George W. Bush in 2001 when he let China into the world Trade Organization and shafted hundreds of thousands of those American manufacturing jobs, so a few RICH on Wall Street could get even richer by floating an IPO of a Chinese company that may or may not exist. Brilliant Stuff. - Papa Trump permalink parent award report block reply\njosiborg 1 points 10 minutes ago It's the strategy that got us 9/11. We gave them pell grants to embry riddle to learn to fly through the buildings. A USF finance teacher was arrested for being the CFO of some terrorist organization in the Midwest, teaching other mooslimz to do the same. permalink parent award report block reply\nAlmostFullyDilated 2 points 44 minutes ago it would be hilarious to train them all wrong permalink parent award report block reply YouEssAye 1 points 3 minutes ago Lmao awesome idea. I guess depending on the degree they get, there's a good chance they'll be trained wrong anyways. Regardless of the degree the prereqs will include leftist brainwashing classes anyways. Why did I need Psychology and Philosophy for my BS in accounting? It's no coincidence both of my professors in those classes brown short haired atheist fat dykes. My philosophy prof spent more time lecturing us on how Christianity is the most evil retarded force on the planet than she did on the works of Plato. permalink parent award report block reply\nYouEssAye 1 points 3 minutes ago Lmao awesome idea. I guess depending on the degree they get, there's a good chance they'll be trained wrong anyways. Regardless of the degree the prereqs will include leftist brainwashing classes anyways. Why did I need Psychology and Philosophy for my BS in accounting? It's no coincidence both of my professors in those classes brown short haired atheist fat dykes. My philosophy prof spent more time lecturing us on how Christianity is the most evil retarded force on the planet than she did on the works of Plato. permalink parent award report block reply\nAwakened 1 points 53 minutes ago This idea is so crazy it's gotta work. permalink parent award report block reply\nI_Am_John_Galt 29 points 1 hour ago So uhh...let's keep educating their next generation in Nuclear Engineering?  I'm so confused permalink award report block reply Patriot4TN 10 points 1 hour ago You are not supposed to notice! permalink parent award report block reply\nPatriot4TN 10 points 1 hour ago You are not supposed to notice! permalink parent award report block reply\nBrandon1776 19 points 1 hour ago So let's bring in 600k spys to speed up that process! Fuck this administration permalink award report block reply\nDirtyDiaperJoe 10 points 1 hour ago Well if their new military build up is as successful as their bridge building skills are, I'm not sure we have much to worry about. permalink award report block reply Ugh3rdaccount 8 points 53 minutes ago Bwahaha have you seen our dei military!??! Besides I can walk down the street in Beijing without being murdered by violent blacks and jihadists. I can’t say the same about dozens and dozens of American cities. You gonna fight for that? permalink parent award report block reply LeRiverDanube 3 points 47 minutes ago on the flipside you might step and slip on pee and poop, and hobos and aunties trying to steal your shit in broad daylight. permalink parent award report block reply hungryfreaksdaddy 2 points 28 minutes ago Wait are we talking Beijing or San Francisco? I can't tell the difference. permalink parent award report block reply LeRiverDanube 1 points 26 minutes ago if the buildings are trying to kill you. you're in china. permalink parent award report block reply Yawnz13 0 points 52 minutes ago You gonna shill for the Chinks?  If their military was legit, they would've already taken a tiny island. permalink parent award report block reply LeRiverDanube 2 points 45 minutes ago the only reason china got succesful is every other government is just letting them be succesful at the cost of betraying their own country. Ours included. permalink parent award report block reply MySidesGoUp 1 points 49 minutes ago Pointing out how cucked our military is, isnt shilling for China. Maybe get your staff sarges dick out your mouth and read the room. permalink parent award report block reply Yawnz13 0 points 34 minutes ago Pointing out how cucked our military is, isnt shilling for China. But you didn't only do that, ignoring that you're incorrect on that fact anyway. Maybe get your staff sarges dick out your mouth and read the room. Sounds like you need to take your own advice.  Nigga acting like China's military \"build-up\" is anything more than theater.  Why can't they take Taiwan?  Why can't they provide their troops with basic armaments? permalink parent award report block reply LeRiverDanube 6 points 1 hour ago fallout wasn't caused by nukes. It was caused by chink hardware failures. permalink parent award report block reply DirtyDiaperJoe 2 points 32 minutes ago You literally just made my point for me. permalink parent award report block reply Viewer01 0 points 56 minutes ago Their navy will forever be shit, but if they get decent at drones then their Zerg rush won’t be stopped. Insert zap brannigan meme. permalink parent award report block reply Yawnz13 2 points 52 minutes ago Drones aren't hard to stop. permalink parent award report block reply Viewer01 1 points 26 minutes ago You dated yourself boomer. permalink parent award report block reply Yawnz13 1 points 19 minutes ago Ironic coming from the dude that thinks that drones are hard to stop.  Go look at Ukraine.  The reason why they are so prevalent in that war is because both countries have shit for ECM, are manned by cross-eyed alcoholics, and have lost a great deal of manpower. permalink parent award report block reply view 1 more comments... GlorpLorp -2 points 1 hour ago Keep on laughing. Stupid fucks like you need to stop talking on military matters. permalink parent award report block reply mikejones 3 points 1 hour ago Imagine thinking the currently military will stop all future strikes. Imagine a 50 mile radius of a strike site is not able to be visited. permalink parent award report block reply\nUgh3rdaccount 8 points 53 minutes ago Bwahaha have you seen our dei military!??! Besides I can walk down the street in Beijing without being murdered by violent blacks and jihadists. I can’t say the same about dozens and dozens of American cities. You gonna fight for that? permalink parent award report block reply LeRiverDanube 3 points 47 minutes ago on the flipside you might step and slip on pee and poop, and hobos and aunties trying to steal your shit in broad daylight. permalink parent award report block reply hungryfreaksdaddy 2 points 28 minutes ago Wait are we talking Beijing or San Francisco? I can't tell the difference. permalink parent award report block reply LeRiverDanube 1 points 26 minutes ago if the buildings are trying to kill you. you're in china. permalink parent award report block reply Yawnz13 0 points 52 minutes ago You gonna shill for the Chinks?  If their military was legit, they would've already taken a tiny island. permalink parent award report block reply LeRiverDanube 2 points 45 minutes ago the only reason china got succesful is every other government is just letting them be succesful at the cost of betraying their own country. Ours included. permalink parent award report block reply MySidesGoUp 1 points 49 minutes ago Pointing out how cucked our military is, isnt shilling for China. Maybe get your staff sarges dick out your mouth and read the room. permalink parent award report block reply Yawnz13 0 points 34 minutes ago Pointing out how cucked our military is, isnt shilling for China. But you didn't only do that, ignoring that you're incorrect on that fact anyway. Maybe get your staff sarges dick out your mouth and read the room. Sounds like you need to take your own advice.  Nigga acting like China's military \"build-up\" is anything more than theater.  Why can't they take Taiwan?  Why can't they provide their troops with basic armaments? permalink parent award report block reply\nLeRiverDanube 3 points 47 minutes ago on the flipside you might step and slip on pee and poop, and hobos and aunties trying to steal your shit in broad daylight. permalink parent award report block reply hungryfreaksdaddy 2 points 28 minutes ago Wait are we talking Beijing or San Francisco? I can't tell the difference. permalink parent award report block reply LeRiverDanube 1 points 26 minutes ago if the buildings are trying to kill you. you're in china. permalink parent award report block reply\nhungryfreaksdaddy 2 points 28 minutes ago Wait are we talking Beijing or San Francisco? I can't tell the difference. permalink parent award report block reply LeRiverDanube 1 points 26 minutes ago if the buildings are trying to kill you. you're in china. permalink parent award report block reply\nLeRiverDanube 1 points 26 minutes ago if the buildings are trying to kill you. you're in china. permalink parent award report block reply\nYawnz13 0 points 52 minutes ago You gonna shill for the Chinks?  If their military was legit, they would've already taken a tiny island. permalink parent award report block reply LeRiverDanube 2 points 45 minutes ago the only reason china got succesful is every other government is just letting them be succesful at the cost of betraying their own country. Ours included. permalink parent award report block reply MySidesGoUp 1 points 49 minutes ago Pointing out how cucked our military is, isnt shilling for China. Maybe get your staff sarges dick out your mouth and read the room. permalink parent award report block reply Yawnz13 0 points 34 minutes ago Pointing out how cucked our military is, isnt shilling for China. But you didn't only do that, ignoring that you're incorrect on that fact anyway. Maybe get your staff sarges dick out your mouth and read the room. Sounds like you need to take your own advice.  Nigga acting like China's military \"build-up\" is anything more than theater.  Why can't they take Taiwan?  Why can't they provide their troops with basic armaments? permalink parent award report block reply\nLeRiverDanube 2 points 45 minutes ago the only reason china got succesful is every other government is just letting them be succesful at the cost of betraying their own country. Ours included. permalink parent award report block reply\nMySidesGoUp 1 points 49 minutes ago Pointing out how cucked our military is, isnt shilling for China. Maybe get your staff sarges dick out your mouth and read the room. permalink parent award report block reply Yawnz13 0 points 34 minutes ago Pointing out how cucked our military is, isnt shilling for China. But you didn't only do that, ignoring that you're incorrect on that fact anyway. Maybe get your staff sarges dick out your mouth and read the room. Sounds like you need to take your own advice.  Nigga acting like China's military \"build-up\" is anything more than theater.  Why can't they take Taiwan?  Why can't they provide their troops with basic armaments? permalink parent award report block reply\nYawnz13 0 points 34 minutes ago Pointing out how cucked our military is, isnt shilling for China. But you didn't only do that, ignoring that you're incorrect on that fact anyway. Maybe get your staff sarges dick out your mouth and read the room. Sounds like you need to take your own advice.  Nigga acting like China's military \"build-up\" is anything more than theater.  Why can't they take Taiwan?  Why can't they provide their troops with basic armaments? permalink parent award report block reply\nLeRiverDanube 6 points 1 hour ago fallout wasn't caused by nukes. It was caused by chink hardware failures. permalink parent award report block reply DirtyDiaperJoe 2 points 32 minutes ago You literally just made my point for me. permalink parent award report block reply\nDirtyDiaperJoe 2 points 32 minutes ago You literally just made my point for me. permalink parent award report block reply\nViewer01 0 points 56 minutes ago Their navy will forever be shit, but if they get decent at drones then their Zerg rush won’t be stopped. Insert zap brannigan meme. permalink parent award report block reply Yawnz13 2 points 52 minutes ago Drones aren't hard to stop. permalink parent award report block reply Viewer01 1 points 26 minutes ago You dated yourself boomer. permalink parent award report block reply Yawnz13 1 points 19 minutes ago Ironic coming from the dude that thinks that drones are hard to stop.  Go look at Ukraine.  The reason why they are so prevalent in that war is because both countries have shit for ECM, are manned by cross-eyed alcoholics, and have lost a great deal of manpower. permalink parent award report block reply view 1 more comments...\nYawnz13 2 points 52 minutes ago Drones aren't hard to stop. permalink parent award report block reply Viewer01 1 points 26 minutes ago You dated yourself boomer. permalink parent award report block reply Yawnz13 1 points 19 minutes ago Ironic coming from the dude that thinks that drones are hard to stop.  Go look at Ukraine.  The reason why they are so prevalent in that war is because both countries have shit for ECM, are manned by cross-eyed alcoholics, and have lost a great deal of manpower. permalink parent award report block reply view 1 more comments...\nViewer01 1 points 26 minutes ago You dated yourself boomer. permalink parent award report block reply Yawnz13 1 points 19 minutes ago Ironic coming from the dude that thinks that drones are hard to stop.  Go look at Ukraine.  The reason why they are so prevalent in that war is because both countries have shit for ECM, are manned by cross-eyed alcoholics, and have lost a great deal of manpower. permalink parent award report block reply view 1 more comments...\nYawnz13 1 points 19 minutes ago Ironic coming from the dude that thinks that drones are hard to stop.  Go look at Ukraine.  The reason why they are so prevalent in that war is because both countries have shit for ECM, are manned by cross-eyed alcoholics, and have lost a great deal of manpower. permalink parent award report block reply view 1 more comments...\nGlorpLorp -2 points 1 hour ago Keep on laughing. Stupid fucks like you need to stop talking on military matters. permalink parent award report block reply mikejones 3 points 1 hour ago Imagine thinking the currently military will stop all future strikes. Imagine a 50 mile radius of a strike site is not able to be visited. permalink parent award report block reply\nmikejones 3 points 1 hour ago Imagine thinking the currently military will stop all future strikes. Imagine a 50 mile radius of a strike site is not able to be visited. permalink parent award report block reply\nflp999 10 points 56 minutes ago Not concerned about China. Am concerned about domestic enemies. Pro tip: if you arrest everyone in the U.S. government that’s been collaborating with them, there is no China threat. And it’s simple as. permalink award report block reply MySidesGoUp 3 points 48 minutes ago That’s exactly the solution and why they will always lionize others. permalink parent award report block reply guywholikesDjtof2024 0 points 35 minutes ago We cannot focus on multiple things. We are single issue. Like the dems are. permalink parent award report block reply\nMySidesGoUp 3 points 48 minutes ago That’s exactly the solution and why they will always lionize others. permalink parent award report block reply\nguywholikesDjtof2024 0 points 35 minutes ago We cannot focus on multiple things. We are single issue. Like the dems are. permalink parent award report block reply\nSupFrens 8 points 54 minutes ago Quick, lets import 500,000 Chinese. Surely this is a great strategy. FFS. permalink award report block reply\nbuster2209 6 points 54 minutes ago I'm amazed they can do that without importing Indians to do the work permalink award report block reply\nWildwind 6 points 1 hour ago Dont worry about Russia. Its china that everyone should be looking at. permalink award report block reply Simple_Doot 4 points 49 minutes ago I actually dont really care about Russia.  And China does have an espionage problem that is of concern.  But what if...we spent our time and money...ON OURSELVES? permalink parent award report block reply ShadowInv 1 points 27 minutes ago The russia ukraine conflict was just to kill more white men. ukraine leadership has passports to israel, russian oligarchs have passports to israel. White boy dead permalink parent award report block reply\nSimple_Doot 4 points 49 minutes ago I actually dont really care about Russia.  And China does have an espionage problem that is of concern.  But what if...we spent our time and money...ON OURSELVES? permalink parent award report block reply\nShadowInv 1 points 27 minutes ago The russia ukraine conflict was just to kill more white men. ukraine leadership has passports to israel, russian oligarchs have passports to israel. White boy dead permalink parent award report block reply\n603taco 5 points 44 minutes ago I’m  just worried this is gonna put a negative picture on all those 600k CCP students in our country. permalink award report block reply\nAwakened 3 points 51 minutes ago When the economy goes to complete shit you can expect war shortly there after. permalink award report block reply ParmesanCartel -1 points 41 minutes ago Imagine what the big retard will do for a distraction now that the Epstein thing is moving along permalink parent award report block reply\nParmesanCartel -1 points 41 minutes ago Imagine what the big retard will do for a distraction now that the Epstein thing is moving along permalink parent award report block reply\nAlphahorizon 2 points 1 hour ago Give me more tax money. permalink award report block reply\nThrowingway22 2 points 51 minutes ago So let's bring in 600k spies a year and educate them instead of Americans permalink award report block reply\nRiehlpissed 2 points 56 minutes ago Keep with the Joneses as they say. permalink award report block reply\nFateOfNorns 2 points 41 minutes ago No shit. Let's encourage more to infest our universities. permalink award report block reply\nSicsempertyrannis76 1 points 40 minutes ago The Battle of Armageddon isn't going to fight itself permalink award report block reply\nThan0sIII 1 points 1 hour ago Could've sworn folks have been saying that China's been going downhill internally regardless of their posturing. permalink award report block reply\nSwedishChainsaw2 1 points 8 minutes ago Has anyone ever seen evidence of China and Israel having beef with each other? permalink award report block reply\nfoom 1 points 21 minutes ago Quick, let’s teach them everything we know! permalink award report block reply\nfreebirdie 1 points 1 hour ago Better bring 600k of them here for safety sake. 🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄 permalink award report block reply\nhenri_derelicte 1 points 20 minutes ago China needs to be weakened internally. That can be through US propaganda meant to stoke division or US-sponsored terrorism like biological and chemical weapons attacks permalink award report block reply\nauntjemima 1 points 33 minutes ago We should be safe with half of them over here permalink award report block reply\nalucard13mmfmj 1 points 1 hour ago I say.. let china start shit. Itll clear up some population imo. Like we shouldve let pakistan and india fight to thin out some numbers. If china fights india.. that alone would clear out 40% of the worlds population lol. All we gotta do is not be retarded and accept rapefugees. permalink award report block reply\nYawnz13 1 points 33 minutes ago People failing the A/B testing again. permalink award report block reply\nWexit-Delecto 1 points 3 minutes ago Maybe stop pulling the punch on tariffs on Chinese imports then? Hit them with a 200%+ tariff and (here's the trick) don't fucking lift it a few days later. President Trump already correctly pointed out that he could destroy the CCP with tariffs. So why not do it? Why let them continue building up? permalink award report block reply\nJimmyRussler 1 points 1 hour ago Good thing we left countless numbers of them to cross our borders unvetted. Brandon's legacy is going to be the destruction he caused. permalink award report block reply\nGhostOfMyFormerSelf 1 points 46 minutes ago When China's economy implodes their military won't matter much. permalink award report block reply\nJayKay1776 1 points 45 minutes ago Did you not see their bridge that came down days after they opened. This is a common theme because of corruption nothing that Chinese built is worth a goddamn. Half their weapon systems don't even fire what are they building up people because of the one child policy they're in worse shape than we are they going to call up all the 60 and 70 year olds. permalink award report block reply ParmesanCartel -1 points 40 minutes ago 50 year old norincos are more reliable than 80 percent of the shit made here nowadays. permalink parent award report block reply\nParmesanCartel -1 points 40 minutes ago 50 year old norincos are more reliable than 80 percent of the shit made here nowadays. permalink parent award report block reply\nAlmostFullyDilated 1 points 45 minutes ago lol the Chinese will end up nuking themselves because that shit was made in China permalink award report block reply\nFatigueIsReal 1 points 43 minutes ago And Trump has been ahead of this since before he took office in 2025. permalink award report block reply\nDITTOPatriot 1 points 28 minutes ago New spending bill at 7: permalink award report block reply\ndonteatthat 1 points 13 minutes ago So bring in about 600k of them. Fucking retarded. permalink award report block reply\nPsalm-118_24 1 points 13 minutes ago So let's let 600K CCP \"students\" into the US. permalink award report block reply\nMEME-SUPREME 0 points 1 hour ago Vance / Rubio 2028 permalink award report block reply ShadowInv 2 points 26 minutes ago Rubio is israel cuck. He was the first to attack tiktok after they paid him permalink parent award report block reply flashersenpai 1 points 52 minutes ago ew might as well be Vance / Graham who do you think keeps wanting to instigate Russia and Venezuela? permalink parent award report block reply ramennov 1 points 4 minutes ago Why would Vance make a good President? permalink parent award report block reply\nShadowInv 2 points 26 minutes ago Rubio is israel cuck. He was the first to attack tiktok after they paid him permalink parent award report block reply\nflashersenpai 1 points 52 minutes ago ew might as well be Vance / Graham who do you think keeps wanting to instigate Russia and Venezuela? permalink parent award report block reply\nramennov 1 points 4 minutes ago Why would Vance make a good President? permalink parent award report block reply\nmikejones 0 points 1 hour ago Only a matter of time before numerous strikes hit us as they return the favor. permalink award report block reply\nJPZY 1 points 25 minutes ago Comment removed by community filter, pending further review. permalink award report block reply\nclearasabell 1 points 50 minutes ago Comment removed by community filter, pending further review. permalink award report block reply\nRalphusthegreatus 1 points 1 hour ago Comment removed by community moderators. permalink award report block reply\nAFPede 0 points 57 minutes ago Comment removed by community moderators. permalink award report block reply"}