{"id": "1ARK9nPMHO", "contents": "23 Nick Fuentes goes on an EPIC 10 minute rant confirming that the Trump Administration is over & says \"I TOLD YOU exactly what would happen! But you didn't listen.\" posted 6 hours ago by Addos 8 comments award share report block KaizerRev @Kaizerrev • 18h \"Israel First & Trump are going down together.\" Nick Fuentes goes on an EPIC 10 minute rant confirming that the Trump Administration is over & says \"I TOLD YOU exactly what would happen! But you didn't listen.\" \"You think JD Vance is any different!? He'll be the same or worse.\"\n8 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget SHILL_DETECTOR 9 points 6 hours ago seems like theres zero momentum on anything anymore wtf is trump doing permalink award report block reply IPFreely 3 points 5 hours ago Not a fan of Nick Fuentes but he’s got a point. Trump is not done though and he’s still damn good. But people are dumb for patting themselves on the back like the democrats have lost. They won that election with the shutdown and I think we’re poised to lose the midterms. We need to be unsatisfied and demand more results. Deportations, Epstein, America First first policy, Trump needs to refocus. permalink award report block reply flopperdog 2 points 5 hours ago My hope is still with JD... *JD's roots are with the working class (Trump's aren't)) **JD pays attention to Tulsi/RFK (Trump doesn't) ***JD pays attention to Barnes/Baris (Trump doesn't) Fuentes has some good points, but he's NOT trustworthy. permalink award report block reply genericamerican69 2 points 3 hours ago JD is a globalist married to a punjab. Bible thumping bullshit won't stop the country from becoming India. Only an explicit \"this isn't india\" will do that. And JD is not the guy permalink parent award report block reply Nonyer 1 points 4 hours ago Not happy at all with Trump's latest offerings, but Fuentes seems to be the far right's answer to Shapiro. Both are detestable humans. permalink award report block reply Mulletgunning -1 points 5 hours ago Miller/ Zeldin 2028.MAGA AF Both are brilliant,roast media and commies plus are MAGA to the bone. permalink award report block reply cusp-of-carabelli -7 points 6 hours ago Faggot shakes fist at the sky.  Nick who? permalink award report block reply BerettaStroker 7 points 6 hours ago Keep pretending, lol. permalink parent award report block reply\nSHILL_DETECTOR 9 points 6 hours ago seems like theres zero momentum on anything anymore wtf is trump doing permalink award report block reply\nIPFreely 3 points 5 hours ago Not a fan of Nick Fuentes but he’s got a point. Trump is not done though and he’s still damn good. But people are dumb for patting themselves on the back like the democrats have lost. They won that election with the shutdown and I think we’re poised to lose the midterms. We need to be unsatisfied and demand more results. Deportations, Epstein, America First first policy, Trump needs to refocus. permalink award report block reply\nflopperdog 2 points 5 hours ago My hope is still with JD... *JD's roots are with the working class (Trump's aren't)) **JD pays attention to Tulsi/RFK (Trump doesn't) ***JD pays attention to Barnes/Baris (Trump doesn't) Fuentes has some good points, but he's NOT trustworthy. permalink award report block reply genericamerican69 2 points 3 hours ago JD is a globalist married to a punjab. Bible thumping bullshit won't stop the country from becoming India. Only an explicit \"this isn't india\" will do that. And JD is not the guy permalink parent award report block reply\ngenericamerican69 2 points 3 hours ago JD is a globalist married to a punjab. Bible thumping bullshit won't stop the country from becoming India. Only an explicit \"this isn't india\" will do that. And JD is not the guy permalink parent award report block reply\nNonyer 1 points 4 hours ago Not happy at all with Trump's latest offerings, but Fuentes seems to be the far right's answer to Shapiro. Both are detestable humans. permalink award report block reply\nMulletgunning -1 points 5 hours ago Miller/ Zeldin 2028.MAGA AF Both are brilliant,roast media and commies plus are MAGA to the bone. permalink award report block reply\ncusp-of-carabelli -7 points 6 hours ago Faggot shakes fist at the sky.  Nick who? permalink award report block reply BerettaStroker 7 points 6 hours ago Keep pretending, lol. permalink parent award report block reply\nBerettaStroker 7 points 6 hours ago Keep pretending, lol. permalink parent award report block reply"}