{"id": "1ARK9pgQMr", "contents": "30 Crockett of Shit is just jealous because MAGA women actually look...like women posted 2 hours ago by DingleBalls 7 comments award share report block Collin Rugg @CollinRugg • 16h NEW: Democrat Rep. Jasmine Crockett makes fun of how MAGA women look while standing next to a 6-foot-5 dude wearing a dress. \"You know a MAGA woman when you see one. They all have a look, right? Like, they lips be up to... anyway.\" \"But yeah, they don't even know.\"\n7 comments Sort by Top Top New Worst Old Save SpaceWizard 3 points 2 hours ago MAGA women are hot, liberal women are dudes permalink award report block reply Jack_NC 3 points 2 hours ago Another one of those articulate black women Michelle Obama keeps talking about? Flanked by two fags. permalink award report block reply airborne3502 2 points 2 hours ago Of course you know a MAGA woman when you see one, because 9 times out of 10 they are more attractive than liberals. permalink award report block reply DeplorableLA 2 points 46 minutes ago Yo Jasmine, whose hair are you wearing today? And the caterpillars? They are mad at you for killing them in record numbers for your eye doodads.  Rude. permalink award report block reply cyberwar 2 points 2 hours ago wigga what? permalink award report block reply RudeFrog 1 points 9 minutes ago Haha she's short and fat permalink award report block reply MagaJay02 1 points 2 hours ago Comment removed by community filter. permalink award report block reply\nSpaceWizard 3 points 2 hours ago MAGA women are hot, liberal women are dudes permalink award report block reply\nJack_NC 3 points 2 hours ago Another one of those articulate black women Michelle Obama keeps talking about? Flanked by two fags. permalink award report block reply\nairborne3502 2 points 2 hours ago Of course you know a MAGA woman when you see one, because 9 times out of 10 they are more attractive than liberals. permalink award report block reply\nDeplorableLA 2 points 46 minutes ago Yo Jasmine, whose hair are you wearing today? And the caterpillars? They are mad at you for killing them in record numbers for your eye doodads.  Rude. permalink award report block reply\ncyberwar 2 points 2 hours ago wigga what? permalink award report block reply\nRudeFrog 1 points 9 minutes ago Haha she's short and fat permalink award report block reply\nMagaJay02 1 points 2 hours ago Comment removed by community filter. permalink award report block reply"}