{"id": "1ARK9jzcUJ", "contents": "295 What a novel concept! Extra work to feed his kids!!! posted 2 days ago by Giant_Schwartz 12 comments award share download report block\n12 comments Sort by Top Top New Worst Old Save lifeisahologram 12 points 1 day ago “We weren’t getting no mo free food, so I had to work!” So much fatigue permalink award report block reply GuerillaYourDreams 8 points 1 day ago Jacksonville is such an incredibly fucked up town. permalink award report block reply Giant_Schwartz OP 4 points 1 day ago Parts of it are really decent. Some parts are ghetto trash. The food all sucks, everyone drives like an asshole. permalink parent award report block reply Jimboslice73 6 points 1 day ago But, but, but what about \"WoRk LiFe BaLaNcE\"? permalink award report block reply PMSocks 4 points 1 day ago But are you a father or m9re of a sperm donor permalink award report block reply Sunnywindows 4 points 1 day ago How is an able bodies man getting any SNAP benefits in the first place?  The whole system needs to be stopped and start over.  I suspect the government employees who “process the applications” are a big part of the scam.  These are the people that need to be replaced with AI. permalink award report block reply MAGABOND 2 points 1 day ago Because he doesn’t make any money. Seriously, that is a sure fire way to get welfare is by having zero income. I have seen people that make $100 more than some arbitrary amount that can’t get help because they actually do work. permalink parent award report block reply Comanche_Moon 4 points 1 day ago Does he have any clue where children come from and how to stop them from appearing? permalink award report block reply Steve56775 3 points 1 day ago If you can’t feed them, don’t breed them. permalink award report block reply greatishthen 2 points 1 day ago maybe the fattest minority can lose some weight finally fat chance it will happen though permalink award report block reply Bearing51 2 points 1 day ago This parasite spawned 6 more parasites. permalink award report block reply Atlis34 1 points 1 day ago There used to be shame associated with not being able to feed yourself, and having others do it for you. permalink award report block reply\nlifeisahologram 12 points 1 day ago “We weren’t getting no mo free food, so I had to work!” So much fatigue permalink award report block reply\nGuerillaYourDreams 8 points 1 day ago Jacksonville is such an incredibly fucked up town. permalink award report block reply Giant_Schwartz OP 4 points 1 day ago Parts of it are really decent. Some parts are ghetto trash. The food all sucks, everyone drives like an asshole. permalink parent award report block reply\nGiant_Schwartz OP 4 points 1 day ago Parts of it are really decent. Some parts are ghetto trash. The food all sucks, everyone drives like an asshole. permalink parent award report block reply\nJimboslice73 6 points 1 day ago But, but, but what about \"WoRk LiFe BaLaNcE\"? permalink award report block reply\nPMSocks 4 points 1 day ago But are you a father or m9re of a sperm donor permalink award report block reply\nSunnywindows 4 points 1 day ago How is an able bodies man getting any SNAP benefits in the first place?  The whole system needs to be stopped and start over.  I suspect the government employees who “process the applications” are a big part of the scam.  These are the people that need to be replaced with AI. permalink award report block reply MAGABOND 2 points 1 day ago Because he doesn’t make any money. Seriously, that is a sure fire way to get welfare is by having zero income. I have seen people that make $100 more than some arbitrary amount that can’t get help because they actually do work. permalink parent award report block reply\nMAGABOND 2 points 1 day ago Because he doesn’t make any money. Seriously, that is a sure fire way to get welfare is by having zero income. I have seen people that make $100 more than some arbitrary amount that can’t get help because they actually do work. permalink parent award report block reply\nComanche_Moon 4 points 1 day ago Does he have any clue where children come from and how to stop them from appearing? permalink award report block reply\nSteve56775 3 points 1 day ago If you can’t feed them, don’t breed them. permalink award report block reply\ngreatishthen 2 points 1 day ago maybe the fattest minority can lose some weight finally fat chance it will happen though permalink award report block reply\nBearing51 2 points 1 day ago This parasite spawned 6 more parasites. permalink award report block reply\nAtlis34 1 points 1 day ago There used to be shame associated with not being able to feed yourself, and having others do it for you. permalink award report block reply"}