{"id": "1ARK9oWeCf", "contents": "29 The push to divide MAGA by influencers and the latest Epstein emails was obviously a coordinated attack. Be aware and don't fall for it. Some on \"our side\" in the influencer space are involved in taking down MAGA, not just Trump. posted 2 hours ago by tylersfarley 9 comments award share report block Don't be stupid and fall for this obviously coordinated attack. It will only increase as we get closer to the elections.\n9 comments Sort by Top Top New Worst Old Save _Liberty_Prime_ 4 points 2 hours ago They also want to sow doubt with Vance. Desperate to have MAGA end with Trump. permalink award report block reply patrioticwinning3 4 points 2 hours ago To be fair Trump is doing a great job of driving his base away himself.  50 year mortgages, importing 600k chicom spies, saying we need to import cheap foreign labor because Americans are too stupid and lazy to do the work.... It's like he's turning INTO the globohomos he has said he was against! permalink parent award report block reply loooooof 3 points 2 hours ago Curious, what \"influencers\" are you speaking of? permalink award report block reply FusionBlack 2 points 2 hours ago Paid influencers. Wasn't there a country recently that had a meeting with several and pays them to relay talking points? Who was that?...... permalink award report block reply M-m-m-my-corona 1 points 1 hour ago Don't believe your lying eyes.  Trump did NOT say Americans are retarded and we should import infinity indians.  Fake news, I tell you! permalink award report block reply JBlaze056 1 points 45 minutes ago No doubt.  Shapiro, Levin, Beck and all the Zionists are not going to be successful with their calls to cancel.  They keep it up and they will be removed from the party - America First. permalink award report block reply SpeekFreely 1 points 2 hours ago MAGA is already cooked, you can thank the Khazarians for that. Next up is the America Only movement. permalink award report block reply Cville123 1 points 2 hours ago True, but there’s also substance.  Israel First; Their solution to H1B crowding out Americans is to make them citizens? So they can vote?; tariffing over Ukraine.  This is becoming a joke. permalink award report block reply henri_derelicte -1 points 2 hours ago It’s a tug of war, especially trying to fill the void after Charlie Kirk. The Tucker Carlson/Nick Fuentes faction of groypers is trying to expand their influence permalink award report block reply\n_Liberty_Prime_ 4 points 2 hours ago They also want to sow doubt with Vance. Desperate to have MAGA end with Trump. permalink award report block reply patrioticwinning3 4 points 2 hours ago To be fair Trump is doing a great job of driving his base away himself.  50 year mortgages, importing 600k chicom spies, saying we need to import cheap foreign labor because Americans are too stupid and lazy to do the work.... It's like he's turning INTO the globohomos he has said he was against! permalink parent award report block reply\npatrioticwinning3 4 points 2 hours ago To be fair Trump is doing a great job of driving his base away himself.  50 year mortgages, importing 600k chicom spies, saying we need to import cheap foreign labor because Americans are too stupid and lazy to do the work.... It's like he's turning INTO the globohomos he has said he was against! permalink parent award report block reply\nloooooof 3 points 2 hours ago Curious, what \"influencers\" are you speaking of? permalink award report block reply\nFusionBlack 2 points 2 hours ago Paid influencers. Wasn't there a country recently that had a meeting with several and pays them to relay talking points? Who was that?...... permalink award report block reply\nM-m-m-my-corona 1 points 1 hour ago Don't believe your lying eyes.  Trump did NOT say Americans are retarded and we should import infinity indians.  Fake news, I tell you! permalink award report block reply\nJBlaze056 1 points 45 minutes ago No doubt.  Shapiro, Levin, Beck and all the Zionists are not going to be successful with their calls to cancel.  They keep it up and they will be removed from the party - America First. permalink award report block reply\nSpeekFreely 1 points 2 hours ago MAGA is already cooked, you can thank the Khazarians for that. Next up is the America Only movement. permalink award report block reply\nCville123 1 points 2 hours ago True, but there’s also substance.  Israel First; Their solution to H1B crowding out Americans is to make them citizens? So they can vote?; tariffing over Ukraine.  This is becoming a joke. permalink award report block reply\nhenri_derelicte -1 points 2 hours ago It’s a tug of war, especially trying to fill the void after Charlie Kirk. The Tucker Carlson/Nick Fuentes faction of groypers is trying to expand their influence permalink award report block reply"}