{"id": "1ARK54U9OJ", "contents": "884 If Republicans kill the Filibuster, they sail to Victory for many years to come. If they don’t, DISASTER waiting to happen! TRUMP  TRUTH posted 5 days ago by I-am-Orlando PRO 58 comments award share download report block\n58 comments Sort by Top Top New Worst Old Save henri_derelicte 34 points 5 days ago This strategy of getting rid of the filibuster only works if everyone’s on board. There’s no room for error. Mandatory voter ID and eliminating mail in ballots will screw the Dems in 2026, which can expand the GOP lead to help push through other legislative goals permalink award report block reply dukeofdoorcounty 28 points 5 days ago Trump should say he's FOR the filibuster, then RINOs will end it. permalink parent award report block reply ThorsonTT 6 points 5 days ago Ding ding ding winning comment! permalink parent award report block reply Awakened 19 points 5 days ago When the democrats get power again, and they will, one of the first thing they will do is nuke the filibuster whether Trump does it now or not. permalink parent award report block reply theDialecticalPlaya 5 points 5 days ago And the Recucklicans are either too stupid, too craven, or too controlled by the Democrats to see that. permalink parent award report block reply Awakened 3 points 5 days ago D - all the above. permalink parent award report block reply Tacitus1963 1 points 5 days ago Most of the RINOs are compromised and are paid not to help advance PDJT's agenda through their share of our laundered tax dollars.\nHow do you think that Congressmen become multi millionaires on a $174k salary in a short time? permalink parent award report block reply NotYourMan 4 points 5 days ago If Gavin is president in 2028 then I expect to go to jail and end up in a prison camp until I die for my posts.  In that sense, I will join all the other great Irish people that have fought against Tyrants over the past 1200 years since the Brits starting taking Irish people and making them into slaves. permalink parent award report block reply EastTexasMadLad 1 points 5 days ago Lotta brass on the ground before that happens to me…. permalink parent award report block reply chickeninoven 2 points 5 days ago They have plenty of cannon fodder to absorb it all. permalink parent award report block reply EyesSewnShut 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply Dizzy77 3 points 5 days ago Mandatory voter ID and eliminating mail in ballots Not enough.  Electronic voting machines have to go. permalink parent award report block reply JLoonacy 3 points 5 days ago That's the thing. Not everyone is onboard. As such, ending the filibuster would be a major misstep on the part of Trump. permalink parent award report block reply load 4 more comments... TheJakeFroggy 16 points 5 days ago Trump understands that this is literally for the survival of the country. If the Republicans refuse to listen to him, then that might force him to see the writing on the wall and that he'll have no other choice but to invoke the Insurrection Act. permalink award report block reply HumblePepe 8 points 5 days ago The GOP does not understand this and thinks it's business as usual 1990s style permalink parent award report block reply JBlaze056 4 points 5 days ago That is because all representatives are immune from their bad decisions. permalink parent award report block reply chickeninoven 2 points 5 days ago They think they'll have a seat at the dinner table in the new world order. permalink parent award report block reply EyesSewnShut 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply tjohnson107 2 points 5 days ago Sadly, he won't. Hes too trusting permalink parent award report block reply JerryNadlerBeltFund 6 points 5 days ago And too patient! In a couple months it will be all about midterms, and squishy faggot RINOs won't want to do anything bold to support MAGA, as they appear to be in the \"let's just wait him out another year\" mode, tank in the midterms, setting up a two-year impeachment season. I hope he's just keeping IA as a last resort.   It would be wonderful to see a mega dose of justice for these traitors.   Backlash would be massive in the MSM, but I think his supporters would be 100% behind him on the \"REEEE - Autharitarian!!!!\" move. permalink parent award report block reply TheJakeFroggy 1 points 5 days ago It would make sense to keep the IA as a last resort. I'd understand if he was just keeping it as a last resort and that he's just wanted to try and exhaust all other options first. But I do think we've gotten to that point already. Pam Bondi and Kash Patel should've done mass arrests on deep staters, and haven't, and I don't trust them to do it because if they were gonna do it then you'd think they would've already started on it. If they and the Republicans in Congress were to actually do their damn jobs, then we wouldn't even have to think about the IA. But they've all failed to properly act, and as we've blown too much time and don't have much time remaining to stop the left, it's getting desperate. And I can trust Trump just enough to see the writing on the wall if there's no other choice. Also ngl I've grown to be cynical and spiteful enough that I would get big amounts of dopamine over the MSM and all the fanatical leftists losing their shit over Trump invoking the IA. They celebrated Charlie Kirk's assassination, shamelessly voted Jay Jones into itself and many other things, I would love nothing more than to watch them cry like overgrown babies when Trump crosses the rubicon and crushes them with the US military. permalink parent award report block reply JerryNadlerBeltFund 2 points 5 days ago The difference between us and them:  They celebrate our death, and the death of America.   We celebrate thier DEMISE. IF (HUUUUGE IF) John Soloman's reporting is accurate - expect many (up to 150) Russisgate grand jury subpoenas by the end of the year.  I hear Brennan and a few others are imminent.   (LOL - \"3000 sealed indictments\" memories from 2017 - I'm cynical as hell, too, so it's a little embarrassing to have any hope in this type of news).  My optimism comes from my belief that DJT is a VSG, and that he is fully aware that the deep state, if not crushed, will absolutely destrory him, his family and anyone who's openly supported him. The stakes are immeasurable for him, and that knowledge keeps the doom at bay. Using the IA is a drastic measure.  It should be an absolute last resort, but from what I understand, it could be very fast and effective.  In his shoes I probably would have lost patience by the end of Jan and invoked it. permalink parent award report block reply fskfsk 14 points 5 days ago The most likely outcome is that Republicans cuck and keep the filibuster, but Democrats remove it the next time they're a majority. permalink award report block reply HumblePepe 3 points 5 days ago I would bet within seconds of them getting in power and the next session starting, they end the filibuster and then begin tearing apart the country. permalink parent award report block reply ReleasetheList 3 points 5 days ago It's not the most likely outcome, it's the guaranteed outcome. What is also guaranteed is that the GOP will give the dems most of what they want to reopen the govt. permalink parent award report block reply fskfsk 1 points 5 days ago It sounds like the Republicans are prepared to make concessions to the Democrats.  Prediction markets now say they make a deal next week. permalink parent award report block reply HoganT 3 points 5 days ago They were never going to let people's insurance go up by 100's of percent. They know full well that is a mid term death sentence. They've just been trying to tarnish the dems with it by framing it as about illegals instead of about your health insurance costs and have run out of runway. It didn't work. permalink parent award report block reply lash 0 points 5 days ago Only if they want to be part of a military tribuna (their own). People like Rand Paul can get more involved for example. He should be the fucking leader there now, BUT HE SOLD OUT when he did not back Trump 2020. He should have seen the steal just as clear as we have! Military seems to be only way. permalink parent award report block reply perma-maga 1 points 5 days ago It will be their final pulling defeat from the jaws of victory. permalink parent award report block reply Awakened 1 points 5 days ago It's like you're psychic or something. permalink parent award report block reply I-am-Orlando OP PRO 6 points 5 days ago Link https://truthsocial.com/@realDonaldTrump/115509306635941834 permalink award report block reply c_programmer 6 points 5 days ago Unfortunately, teaching them how to win only works if winning is their goal. permalink award report block reply booblitchutz 3 points 5 days ago Oh, they are winning alright. We aren’t, but THEY certainly are. permalink parent award report block reply JLoonacy 3 points 5 days ago Exactly. The GOP doesn't give a shit about winning anything for the People. permalink parent award report block reply corporateshizer 5 points 5 days ago The uniparty keeps the filibuster because it gives them an excuse for not delivering results for their voters. Issue voter cares about: \"52-48, too bad, won't pass a filibuster so we scrapped it. Better win more seats next election!\" Sending money to Ukraine: 86-11, no filibuster at play. permalink award report block reply booblitchutz 1 points 5 days ago Correctamundo. permalink parent award report block reply HumblePepe 5 points 5 days ago We all know what the Republicans will choose. They'd rather kick the can down the road and make a future deal with the devil potentially losing some of their own numbers, but keeping a comfortable weak lifestyle permalink award report block reply ACActual 4 points 5 days ago We all know how much Republicans like winning.   We're fucked permalink award report block reply WalkerStemmons 3 points 5 days ago Could they feasibly kill the filibuster and then restore after everything is taken care of? permalink award report block reply Jimmyprawns 3 points 5 days ago \"well, since you put it that way Mr president, I guess we better not kill the filibuster.\" -republicans, probably. permalink award report block reply possibletower 2 points 5 days ago He needs to veto the shitty upcoming \"deal\" made by RINO Thune. Also Speaker Johnson needs to kill any attempt to pass a Thune \"deal\" bill in the House so Trump isn't forced to veto. permalink award report block reply knnbccb 2 points 5 days ago This will be irrelevant if you outlaw the Democratic Party, and anyone who donates even a dime to it gets thrown into jail indefinitely without trial. Trump is still too kind, too soft-hearted. permalink award report block reply WeWillRideAgain 2 points 5 days ago Just revert the filibuster to  how it USED to be.. Standing on the floor talking endlessly. permalink award report block reply Protonboy 2 points 5 days ago Breaking: \"The Republicans Don't Kill the Filibuster...\" permalink award report block reply BannedAccount 1 points 5 days ago Lol why would the GOP ever want to win when they get rich losing? permalink award report block reply HumblePig 1 points 5 days ago No. The Democrats will have power again. Let them eat cake. permalink award report block reply Megaboom2025 1 points 5 days ago Except the 3 republicans that vote against everything? permalink award report block reply FuckU/Spez 1 points 5 days ago That's the point. Republicans don't win because they are for the same thing democrats are. they just don't go as fast, but all corrupt and part of the elites. we are the Proles. 1984! permalink award report block reply MajorClark 1 points 5 days ago Rino's don't want to lose their cut of insurance lobby payoffs. permalink award report block reply Advhawk 1 points 5 days ago Don't you worry they will choose disaster it's the only thing they know permalink award report block reply SanityGumby 0 points 5 days ago If they did it and reopened the government I am sure it would please the nigs enough to shave some of them off voting democrat until they lose their benefits for being worthless and lazy. permalink award report block reply billybaldwin2 0 points 5 days ago Sure, some could worry \"what if GOP gets out of power?\" But I worry about \"what if nobody obeys?\" Go on. Ban mail in voting federally. What then? California does mail-in voting anyway? Gonna send postal workers from Texas to take over the California post offices? Will they come from the Austin, TX post offices? permalink award report block reply corntortilla -1 points 5 days ago Then disaster it is. permalink award report block reply EyesSewnShut 1 points 5 days ago Comment removed by community moderators. permalink award report block reply\nhenri_derelicte 34 points 5 days ago This strategy of getting rid of the filibuster only works if everyone’s on board. There’s no room for error. Mandatory voter ID and eliminating mail in ballots will screw the Dems in 2026, which can expand the GOP lead to help push through other legislative goals permalink award report block reply dukeofdoorcounty 28 points 5 days ago Trump should say he's FOR the filibuster, then RINOs will end it. permalink parent award report block reply ThorsonTT 6 points 5 days ago Ding ding ding winning comment! permalink parent award report block reply Awakened 19 points 5 days ago When the democrats get power again, and they will, one of the first thing they will do is nuke the filibuster whether Trump does it now or not. permalink parent award report block reply theDialecticalPlaya 5 points 5 days ago And the Recucklicans are either too stupid, too craven, or too controlled by the Democrats to see that. permalink parent award report block reply Awakened 3 points 5 days ago D - all the above. permalink parent award report block reply Tacitus1963 1 points 5 days ago Most of the RINOs are compromised and are paid not to help advance PDJT's agenda through their share of our laundered tax dollars.\nHow do you think that Congressmen become multi millionaires on a $174k salary in a short time? permalink parent award report block reply NotYourMan 4 points 5 days ago If Gavin is president in 2028 then I expect to go to jail and end up in a prison camp until I die for my posts.  In that sense, I will join all the other great Irish people that have fought against Tyrants over the past 1200 years since the Brits starting taking Irish people and making them into slaves. permalink parent award report block reply EastTexasMadLad 1 points 5 days ago Lotta brass on the ground before that happens to me…. permalink parent award report block reply chickeninoven 2 points 5 days ago They have plenty of cannon fodder to absorb it all. permalink parent award report block reply EyesSewnShut 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply Dizzy77 3 points 5 days ago Mandatory voter ID and eliminating mail in ballots Not enough.  Electronic voting machines have to go. permalink parent award report block reply JLoonacy 3 points 5 days ago That's the thing. Not everyone is onboard. As such, ending the filibuster would be a major misstep on the part of Trump. permalink parent award report block reply load 4 more comments...\ndukeofdoorcounty 28 points 5 days ago Trump should say he's FOR the filibuster, then RINOs will end it. permalink parent award report block reply ThorsonTT 6 points 5 days ago Ding ding ding winning comment! permalink parent award report block reply\nThorsonTT 6 points 5 days ago Ding ding ding winning comment! permalink parent award report block reply\nAwakened 19 points 5 days ago When the democrats get power again, and they will, one of the first thing they will do is nuke the filibuster whether Trump does it now or not. permalink parent award report block reply theDialecticalPlaya 5 points 5 days ago And the Recucklicans are either too stupid, too craven, or too controlled by the Democrats to see that. permalink parent award report block reply Awakened 3 points 5 days ago D - all the above. permalink parent award report block reply Tacitus1963 1 points 5 days ago Most of the RINOs are compromised and are paid not to help advance PDJT's agenda through their share of our laundered tax dollars.\nHow do you think that Congressmen become multi millionaires on a $174k salary in a short time? permalink parent award report block reply\ntheDialecticalPlaya 5 points 5 days ago And the Recucklicans are either too stupid, too craven, or too controlled by the Democrats to see that. permalink parent award report block reply Awakened 3 points 5 days ago D - all the above. permalink parent award report block reply Tacitus1963 1 points 5 days ago Most of the RINOs are compromised and are paid not to help advance PDJT's agenda through their share of our laundered tax dollars.\nHow do you think that Congressmen become multi millionaires on a $174k salary in a short time? permalink parent award report block reply\nAwakened 3 points 5 days ago D - all the above. permalink parent award report block reply\nTacitus1963 1 points 5 days ago Most of the RINOs are compromised and are paid not to help advance PDJT's agenda through their share of our laundered tax dollars.\nHow do you think that Congressmen become multi millionaires on a $174k salary in a short time? permalink parent award report block reply\nNotYourMan 4 points 5 days ago If Gavin is president in 2028 then I expect to go to jail and end up in a prison camp until I die for my posts.  In that sense, I will join all the other great Irish people that have fought against Tyrants over the past 1200 years since the Brits starting taking Irish people and making them into slaves. permalink parent award report block reply EastTexasMadLad 1 points 5 days ago Lotta brass on the ground before that happens to me…. permalink parent award report block reply chickeninoven 2 points 5 days ago They have plenty of cannon fodder to absorb it all. permalink parent award report block reply EyesSewnShut 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply\nEastTexasMadLad 1 points 5 days ago Lotta brass on the ground before that happens to me…. permalink parent award report block reply chickeninoven 2 points 5 days ago They have plenty of cannon fodder to absorb it all. permalink parent award report block reply\nchickeninoven 2 points 5 days ago They have plenty of cannon fodder to absorb it all. permalink parent award report block reply\nEyesSewnShut 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply\nDizzy77 3 points 5 days ago Mandatory voter ID and eliminating mail in ballots Not enough.  Electronic voting machines have to go. permalink parent award report block reply\nJLoonacy 3 points 5 days ago That's the thing. Not everyone is onboard. As such, ending the filibuster would be a major misstep on the part of Trump. permalink parent award report block reply\nTheJakeFroggy 16 points 5 days ago Trump understands that this is literally for the survival of the country. If the Republicans refuse to listen to him, then that might force him to see the writing on the wall and that he'll have no other choice but to invoke the Insurrection Act. permalink award report block reply HumblePepe 8 points 5 days ago The GOP does not understand this and thinks it's business as usual 1990s style permalink parent award report block reply JBlaze056 4 points 5 days ago That is because all representatives are immune from their bad decisions. permalink parent award report block reply chickeninoven 2 points 5 days ago They think they'll have a seat at the dinner table in the new world order. permalink parent award report block reply EyesSewnShut 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply tjohnson107 2 points 5 days ago Sadly, he won't. Hes too trusting permalink parent award report block reply JerryNadlerBeltFund 6 points 5 days ago And too patient! In a couple months it will be all about midterms, and squishy faggot RINOs won't want to do anything bold to support MAGA, as they appear to be in the \"let's just wait him out another year\" mode, tank in the midterms, setting up a two-year impeachment season. I hope he's just keeping IA as a last resort.   It would be wonderful to see a mega dose of justice for these traitors.   Backlash would be massive in the MSM, but I think his supporters would be 100% behind him on the \"REEEE - Autharitarian!!!!\" move. permalink parent award report block reply TheJakeFroggy 1 points 5 days ago It would make sense to keep the IA as a last resort. I'd understand if he was just keeping it as a last resort and that he's just wanted to try and exhaust all other options first. But I do think we've gotten to that point already. Pam Bondi and Kash Patel should've done mass arrests on deep staters, and haven't, and I don't trust them to do it because if they were gonna do it then you'd think they would've already started on it. If they and the Republicans in Congress were to actually do their damn jobs, then we wouldn't even have to think about the IA. But they've all failed to properly act, and as we've blown too much time and don't have much time remaining to stop the left, it's getting desperate. And I can trust Trump just enough to see the writing on the wall if there's no other choice. Also ngl I've grown to be cynical and spiteful enough that I would get big amounts of dopamine over the MSM and all the fanatical leftists losing their shit over Trump invoking the IA. They celebrated Charlie Kirk's assassination, shamelessly voted Jay Jones into itself and many other things, I would love nothing more than to watch them cry like overgrown babies when Trump crosses the rubicon and crushes them with the US military. permalink parent award report block reply JerryNadlerBeltFund 2 points 5 days ago The difference between us and them:  They celebrate our death, and the death of America.   We celebrate thier DEMISE. IF (HUUUUGE IF) John Soloman's reporting is accurate - expect many (up to 150) Russisgate grand jury subpoenas by the end of the year.  I hear Brennan and a few others are imminent.   (LOL - \"3000 sealed indictments\" memories from 2017 - I'm cynical as hell, too, so it's a little embarrassing to have any hope in this type of news).  My optimism comes from my belief that DJT is a VSG, and that he is fully aware that the deep state, if not crushed, will absolutely destrory him, his family and anyone who's openly supported him. The stakes are immeasurable for him, and that knowledge keeps the doom at bay. Using the IA is a drastic measure.  It should be an absolute last resort, but from what I understand, it could be very fast and effective.  In his shoes I probably would have lost patience by the end of Jan and invoked it. permalink parent award report block reply\nHumblePepe 8 points 5 days ago The GOP does not understand this and thinks it's business as usual 1990s style permalink parent award report block reply JBlaze056 4 points 5 days ago That is because all representatives are immune from their bad decisions. permalink parent award report block reply chickeninoven 2 points 5 days ago They think they'll have a seat at the dinner table in the new world order. permalink parent award report block reply EyesSewnShut 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply\nJBlaze056 4 points 5 days ago That is because all representatives are immune from their bad decisions. permalink parent award report block reply chickeninoven 2 points 5 days ago They think they'll have a seat at the dinner table in the new world order. permalink parent award report block reply\nchickeninoven 2 points 5 days ago They think they'll have a seat at the dinner table in the new world order. permalink parent award report block reply\nEyesSewnShut 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply\ntjohnson107 2 points 5 days ago Sadly, he won't. Hes too trusting permalink parent award report block reply JerryNadlerBeltFund 6 points 5 days ago And too patient! In a couple months it will be all about midterms, and squishy faggot RINOs won't want to do anything bold to support MAGA, as they appear to be in the \"let's just wait him out another year\" mode, tank in the midterms, setting up a two-year impeachment season. I hope he's just keeping IA as a last resort.   It would be wonderful to see a mega dose of justice for these traitors.   Backlash would be massive in the MSM, but I think his supporters would be 100% behind him on the \"REEEE - Autharitarian!!!!\" move. permalink parent award report block reply TheJakeFroggy 1 points 5 days ago It would make sense to keep the IA as a last resort. I'd understand if he was just keeping it as a last resort and that he's just wanted to try and exhaust all other options first. But I do think we've gotten to that point already. Pam Bondi and Kash Patel should've done mass arrests on deep staters, and haven't, and I don't trust them to do it because if they were gonna do it then you'd think they would've already started on it. If they and the Republicans in Congress were to actually do their damn jobs, then we wouldn't even have to think about the IA. But they've all failed to properly act, and as we've blown too much time and don't have much time remaining to stop the left, it's getting desperate. And I can trust Trump just enough to see the writing on the wall if there's no other choice. Also ngl I've grown to be cynical and spiteful enough that I would get big amounts of dopamine over the MSM and all the fanatical leftists losing their shit over Trump invoking the IA. They celebrated Charlie Kirk's assassination, shamelessly voted Jay Jones into itself and many other things, I would love nothing more than to watch them cry like overgrown babies when Trump crosses the rubicon and crushes them with the US military. permalink parent award report block reply JerryNadlerBeltFund 2 points 5 days ago The difference between us and them:  They celebrate our death, and the death of America.   We celebrate thier DEMISE. IF (HUUUUGE IF) John Soloman's reporting is accurate - expect many (up to 150) Russisgate grand jury subpoenas by the end of the year.  I hear Brennan and a few others are imminent.   (LOL - \"3000 sealed indictments\" memories from 2017 - I'm cynical as hell, too, so it's a little embarrassing to have any hope in this type of news).  My optimism comes from my belief that DJT is a VSG, and that he is fully aware that the deep state, if not crushed, will absolutely destrory him, his family and anyone who's openly supported him. The stakes are immeasurable for him, and that knowledge keeps the doom at bay. Using the IA is a drastic measure.  It should be an absolute last resort, but from what I understand, it could be very fast and effective.  In his shoes I probably would have lost patience by the end of Jan and invoked it. permalink parent award report block reply\nJerryNadlerBeltFund 6 points 5 days ago And too patient! In a couple months it will be all about midterms, and squishy faggot RINOs won't want to do anything bold to support MAGA, as they appear to be in the \"let's just wait him out another year\" mode, tank in the midterms, setting up a two-year impeachment season. I hope he's just keeping IA as a last resort.   It would be wonderful to see a mega dose of justice for these traitors.   Backlash would be massive in the MSM, but I think his supporters would be 100% behind him on the \"REEEE - Autharitarian!!!!\" move. permalink parent award report block reply TheJakeFroggy 1 points 5 days ago It would make sense to keep the IA as a last resort. I'd understand if he was just keeping it as a last resort and that he's just wanted to try and exhaust all other options first. But I do think we've gotten to that point already. Pam Bondi and Kash Patel should've done mass arrests on deep staters, and haven't, and I don't trust them to do it because if they were gonna do it then you'd think they would've already started on it. If they and the Republicans in Congress were to actually do their damn jobs, then we wouldn't even have to think about the IA. But they've all failed to properly act, and as we've blown too much time and don't have much time remaining to stop the left, it's getting desperate. And I can trust Trump just enough to see the writing on the wall if there's no other choice. Also ngl I've grown to be cynical and spiteful enough that I would get big amounts of dopamine over the MSM and all the fanatical leftists losing their shit over Trump invoking the IA. They celebrated Charlie Kirk's assassination, shamelessly voted Jay Jones into itself and many other things, I would love nothing more than to watch them cry like overgrown babies when Trump crosses the rubicon and crushes them with the US military. permalink parent award report block reply JerryNadlerBeltFund 2 points 5 days ago The difference between us and them:  They celebrate our death, and the death of America.   We celebrate thier DEMISE. IF (HUUUUGE IF) John Soloman's reporting is accurate - expect many (up to 150) Russisgate grand jury subpoenas by the end of the year.  I hear Brennan and a few others are imminent.   (LOL - \"3000 sealed indictments\" memories from 2017 - I'm cynical as hell, too, so it's a little embarrassing to have any hope in this type of news).  My optimism comes from my belief that DJT is a VSG, and that he is fully aware that the deep state, if not crushed, will absolutely destrory him, his family and anyone who's openly supported him. The stakes are immeasurable for him, and that knowledge keeps the doom at bay. Using the IA is a drastic measure.  It should be an absolute last resort, but from what I understand, it could be very fast and effective.  In his shoes I probably would have lost patience by the end of Jan and invoked it. permalink parent award report block reply\nTheJakeFroggy 1 points 5 days ago It would make sense to keep the IA as a last resort. I'd understand if he was just keeping it as a last resort and that he's just wanted to try and exhaust all other options first. But I do think we've gotten to that point already. Pam Bondi and Kash Patel should've done mass arrests on deep staters, and haven't, and I don't trust them to do it because if they were gonna do it then you'd think they would've already started on it. If they and the Republicans in Congress were to actually do their damn jobs, then we wouldn't even have to think about the IA. But they've all failed to properly act, and as we've blown too much time and don't have much time remaining to stop the left, it's getting desperate. And I can trust Trump just enough to see the writing on the wall if there's no other choice. Also ngl I've grown to be cynical and spiteful enough that I would get big amounts of dopamine over the MSM and all the fanatical leftists losing their shit over Trump invoking the IA. They celebrated Charlie Kirk's assassination, shamelessly voted Jay Jones into itself and many other things, I would love nothing more than to watch them cry like overgrown babies when Trump crosses the rubicon and crushes them with the US military. permalink parent award report block reply JerryNadlerBeltFund 2 points 5 days ago The difference between us and them:  They celebrate our death, and the death of America.   We celebrate thier DEMISE. IF (HUUUUGE IF) John Soloman's reporting is accurate - expect many (up to 150) Russisgate grand jury subpoenas by the end of the year.  I hear Brennan and a few others are imminent.   (LOL - \"3000 sealed indictments\" memories from 2017 - I'm cynical as hell, too, so it's a little embarrassing to have any hope in this type of news).  My optimism comes from my belief that DJT is a VSG, and that he is fully aware that the deep state, if not crushed, will absolutely destrory him, his family and anyone who's openly supported him. The stakes are immeasurable for him, and that knowledge keeps the doom at bay. Using the IA is a drastic measure.  It should be an absolute last resort, but from what I understand, it could be very fast and effective.  In his shoes I probably would have lost patience by the end of Jan and invoked it. permalink parent award report block reply\nJerryNadlerBeltFund 2 points 5 days ago The difference between us and them:  They celebrate our death, and the death of America.   We celebrate thier DEMISE. IF (HUUUUGE IF) John Soloman's reporting is accurate - expect many (up to 150) Russisgate grand jury subpoenas by the end of the year.  I hear Brennan and a few others are imminent.   (LOL - \"3000 sealed indictments\" memories from 2017 - I'm cynical as hell, too, so it's a little embarrassing to have any hope in this type of news).  My optimism comes from my belief that DJT is a VSG, and that he is fully aware that the deep state, if not crushed, will absolutely destrory him, his family and anyone who's openly supported him. The stakes are immeasurable for him, and that knowledge keeps the doom at bay. Using the IA is a drastic measure.  It should be an absolute last resort, but from what I understand, it could be very fast and effective.  In his shoes I probably would have lost patience by the end of Jan and invoked it. permalink parent award report block reply\nfskfsk 14 points 5 days ago The most likely outcome is that Republicans cuck and keep the filibuster, but Democrats remove it the next time they're a majority. permalink award report block reply HumblePepe 3 points 5 days ago I would bet within seconds of them getting in power and the next session starting, they end the filibuster and then begin tearing apart the country. permalink parent award report block reply ReleasetheList 3 points 5 days ago It's not the most likely outcome, it's the guaranteed outcome. What is also guaranteed is that the GOP will give the dems most of what they want to reopen the govt. permalink parent award report block reply fskfsk 1 points 5 days ago It sounds like the Republicans are prepared to make concessions to the Democrats.  Prediction markets now say they make a deal next week. permalink parent award report block reply HoganT 3 points 5 days ago They were never going to let people's insurance go up by 100's of percent. They know full well that is a mid term death sentence. They've just been trying to tarnish the dems with it by framing it as about illegals instead of about your health insurance costs and have run out of runway. It didn't work. permalink parent award report block reply lash 0 points 5 days ago Only if they want to be part of a military tribuna (their own). People like Rand Paul can get more involved for example. He should be the fucking leader there now, BUT HE SOLD OUT when he did not back Trump 2020. He should have seen the steal just as clear as we have! Military seems to be only way. permalink parent award report block reply perma-maga 1 points 5 days ago It will be their final pulling defeat from the jaws of victory. permalink parent award report block reply Awakened 1 points 5 days ago It's like you're psychic or something. permalink parent award report block reply\nHumblePepe 3 points 5 days ago I would bet within seconds of them getting in power and the next session starting, they end the filibuster and then begin tearing apart the country. permalink parent award report block reply\nReleasetheList 3 points 5 days ago It's not the most likely outcome, it's the guaranteed outcome. What is also guaranteed is that the GOP will give the dems most of what they want to reopen the govt. permalink parent award report block reply fskfsk 1 points 5 days ago It sounds like the Republicans are prepared to make concessions to the Democrats.  Prediction markets now say they make a deal next week. permalink parent award report block reply HoganT 3 points 5 days ago They were never going to let people's insurance go up by 100's of percent. They know full well that is a mid term death sentence. They've just been trying to tarnish the dems with it by framing it as about illegals instead of about your health insurance costs and have run out of runway. It didn't work. permalink parent award report block reply lash 0 points 5 days ago Only if they want to be part of a military tribuna (their own). People like Rand Paul can get more involved for example. He should be the fucking leader there now, BUT HE SOLD OUT when he did not back Trump 2020. He should have seen the steal just as clear as we have! Military seems to be only way. permalink parent award report block reply\nfskfsk 1 points 5 days ago It sounds like the Republicans are prepared to make concessions to the Democrats.  Prediction markets now say they make a deal next week. permalink parent award report block reply HoganT 3 points 5 days ago They were never going to let people's insurance go up by 100's of percent. They know full well that is a mid term death sentence. They've just been trying to tarnish the dems with it by framing it as about illegals instead of about your health insurance costs and have run out of runway. It didn't work. permalink parent award report block reply\nHoganT 3 points 5 days ago They were never going to let people's insurance go up by 100's of percent. They know full well that is a mid term death sentence. They've just been trying to tarnish the dems with it by framing it as about illegals instead of about your health insurance costs and have run out of runway. It didn't work. permalink parent award report block reply\nlash 0 points 5 days ago Only if they want to be part of a military tribuna (their own). People like Rand Paul can get more involved for example. He should be the fucking leader there now, BUT HE SOLD OUT when he did not back Trump 2020. He should have seen the steal just as clear as we have! Military seems to be only way. permalink parent award report block reply\nperma-maga 1 points 5 days ago It will be their final pulling defeat from the jaws of victory. permalink parent award report block reply\nAwakened 1 points 5 days ago It's like you're psychic or something. permalink parent award report block reply\nI-am-Orlando OP PRO 6 points 5 days ago Link https://truthsocial.com/@realDonaldTrump/115509306635941834 permalink award report block reply\nc_programmer 6 points 5 days ago Unfortunately, teaching them how to win only works if winning is their goal. permalink award report block reply booblitchutz 3 points 5 days ago Oh, they are winning alright. We aren’t, but THEY certainly are. permalink parent award report block reply JLoonacy 3 points 5 days ago Exactly. The GOP doesn't give a shit about winning anything for the People. permalink parent award report block reply\nbooblitchutz 3 points 5 days ago Oh, they are winning alright. We aren’t, but THEY certainly are. permalink parent award report block reply\nJLoonacy 3 points 5 days ago Exactly. The GOP doesn't give a shit about winning anything for the People. permalink parent award report block reply\ncorporateshizer 5 points 5 days ago The uniparty keeps the filibuster because it gives them an excuse for not delivering results for their voters. Issue voter cares about: \"52-48, too bad, won't pass a filibuster so we scrapped it. Better win more seats next election!\" Sending money to Ukraine: 86-11, no filibuster at play. permalink award report block reply booblitchutz 1 points 5 days ago Correctamundo. permalink parent award report block reply\nbooblitchutz 1 points 5 days ago Correctamundo. permalink parent award report block reply\nHumblePepe 5 points 5 days ago We all know what the Republicans will choose. They'd rather kick the can down the road and make a future deal with the devil potentially losing some of their own numbers, but keeping a comfortable weak lifestyle permalink award report block reply\nACActual 4 points 5 days ago We all know how much Republicans like winning.   We're fucked permalink award report block reply\nWalkerStemmons 3 points 5 days ago Could they feasibly kill the filibuster and then restore after everything is taken care of? permalink award report block reply\nJimmyprawns 3 points 5 days ago \"well, since you put it that way Mr president, I guess we better not kill the filibuster.\" -republicans, probably. permalink award report block reply\npossibletower 2 points 5 days ago He needs to veto the shitty upcoming \"deal\" made by RINO Thune. Also Speaker Johnson needs to kill any attempt to pass a Thune \"deal\" bill in the House so Trump isn't forced to veto. permalink award report block reply\nknnbccb 2 points 5 days ago This will be irrelevant if you outlaw the Democratic Party, and anyone who donates even a dime to it gets thrown into jail indefinitely without trial. Trump is still too kind, too soft-hearted. permalink award report block reply\nWeWillRideAgain 2 points 5 days ago Just revert the filibuster to  how it USED to be.. Standing on the floor talking endlessly. permalink award report block reply\nProtonboy 2 points 5 days ago Breaking: \"The Republicans Don't Kill the Filibuster...\" permalink award report block reply\nBannedAccount 1 points 5 days ago Lol why would the GOP ever want to win when they get rich losing? permalink award report block reply\nHumblePig 1 points 5 days ago No. The Democrats will have power again. Let them eat cake. permalink award report block reply\nMegaboom2025 1 points 5 days ago Except the 3 republicans that vote against everything? permalink award report block reply\nFuckU/Spez 1 points 5 days ago That's the point. Republicans don't win because they are for the same thing democrats are. they just don't go as fast, but all corrupt and part of the elites. we are the Proles. 1984! permalink award report block reply\nMajorClark 1 points 5 days ago Rino's don't want to lose their cut of insurance lobby payoffs. permalink award report block reply\nAdvhawk 1 points 5 days ago Don't you worry they will choose disaster it's the only thing they know permalink award report block reply\nSanityGumby 0 points 5 days ago If they did it and reopened the government I am sure it would please the nigs enough to shave some of them off voting democrat until they lose their benefits for being worthless and lazy. permalink award report block reply\nbillybaldwin2 0 points 5 days ago Sure, some could worry \"what if GOP gets out of power?\" But I worry about \"what if nobody obeys?\" Go on. Ban mail in voting federally. What then? California does mail-in voting anyway? Gonna send postal workers from Texas to take over the California post offices? Will they come from the Austin, TX post offices? permalink award report block reply\ncorntortilla -1 points 5 days ago Then disaster it is. permalink award report block reply\nEyesSewnShut 1 points 5 days ago Comment removed by community moderators. permalink award report block reply"}