{"id": "1ARK9pgPy6", "contents": "147 \"Why isn’t China importing Indians to beat us then?\" posted 3 hours ago by bleeje 9 comments award share report block Kitler @Kitler512 • 20h @mitchellvii Why isn’t China importing Indians to beat us then?\n9 comments Sort by Top Top New Worst Old Save cyberrigger 8 points 2 hours ago China's winning strategy ------ get the US to import Indians. permalink award report block reply NotYourMan 4 points 1 hour ago This is how China wins.  They have a homogeneous society where everybody works for Chinese people.  On average Chinese people are higher IQ than the US due to our diverse population.  The Chinese government spent 30 years learning from US professors how to build world class universities.  They are not importing from all over the world.  They don't have the burden of millions living off the system for decades who never make a contribution to the GDP. permalink award report block reply WhoMeTwo 3 points 29 minutes ago Bill Mitchell is a faggot. permalink award report block reply FusionBlack 3 points 1 hour ago There sending thier own here just to go back with our data. permalink award report block reply PatriotDescendant -3 points 2 hours ago Well, for one reason, their schools are superior to ours in terms of core STEM. Our kids are more creative, but STEM deficient. STEM is our weak spot. permalink award report block reply Here_we_go 4 points 1 hour ago So why are we importing 600000 spy students? permalink parent award report block reply PatriotDescendant -1 points 34 minutes ago Channeling my inner Charlie Kirk, I'll be kind. Doesn't my base comment make it easy for you to infer your answer? permalink parent award report block reply Here_we_go 1 points 24 minutes ago Nobody gives a shit. permalink parent award report block reply PatriotDescendant 1 points 13 minutes ago About you? Or me? Absolutely. permalink parent award report block reply\ncyberrigger 8 points 2 hours ago China's winning strategy ------ get the US to import Indians. permalink award report block reply\nNotYourMan 4 points 1 hour ago This is how China wins.  They have a homogeneous society where everybody works for Chinese people.  On average Chinese people are higher IQ than the US due to our diverse population.  The Chinese government spent 30 years learning from US professors how to build world class universities.  They are not importing from all over the world.  They don't have the burden of millions living off the system for decades who never make a contribution to the GDP. permalink award report block reply\nWhoMeTwo 3 points 29 minutes ago Bill Mitchell is a faggot. permalink award report block reply\nFusionBlack 3 points 1 hour ago There sending thier own here just to go back with our data. permalink award report block reply\nPatriotDescendant -3 points 2 hours ago Well, for one reason, their schools are superior to ours in terms of core STEM. Our kids are more creative, but STEM deficient. STEM is our weak spot. permalink award report block reply Here_we_go 4 points 1 hour ago So why are we importing 600000 spy students? permalink parent award report block reply PatriotDescendant -1 points 34 minutes ago Channeling my inner Charlie Kirk, I'll be kind. Doesn't my base comment make it easy for you to infer your answer? permalink parent award report block reply Here_we_go 1 points 24 minutes ago Nobody gives a shit. permalink parent award report block reply PatriotDescendant 1 points 13 minutes ago About you? Or me? Absolutely. permalink parent award report block reply\nHere_we_go 4 points 1 hour ago So why are we importing 600000 spy students? permalink parent award report block reply PatriotDescendant -1 points 34 minutes ago Channeling my inner Charlie Kirk, I'll be kind. Doesn't my base comment make it easy for you to infer your answer? permalink parent award report block reply Here_we_go 1 points 24 minutes ago Nobody gives a shit. permalink parent award report block reply PatriotDescendant 1 points 13 minutes ago About you? Or me? Absolutely. permalink parent award report block reply\nPatriotDescendant -1 points 34 minutes ago Channeling my inner Charlie Kirk, I'll be kind. Doesn't my base comment make it easy for you to infer your answer? permalink parent award report block reply Here_we_go 1 points 24 minutes ago Nobody gives a shit. permalink parent award report block reply PatriotDescendant 1 points 13 minutes ago About you? Or me? Absolutely. permalink parent award report block reply\nHere_we_go 1 points 24 minutes ago Nobody gives a shit. permalink parent award report block reply PatriotDescendant 1 points 13 minutes ago About you? Or me? Absolutely. permalink parent award report block reply\nPatriotDescendant 1 points 13 minutes ago About you? Or me? Absolutely. permalink parent award report block reply"}