{"id": "1ARK55acAS", "contents": "247 Just one night after Zohran Mamdani won the race for New York City Mayor, Muslim street vendors are already blasting the Islam ‘Sound of the Quran’ through the streets\n\nThis is the beginning of the end posted 5 days ago by PiratePatriotParrot 15 comments award share report block Wall Street Apes @WallStreetApes • 6d Just one night after Zohran Mamdani won the race for New York City Mayor, Muslim street vendors are already blasting the Islam ‘Sound of the Quran’ through the streets This is the beginning of the end\n15 comments Sort by Top Top New Worst Old Save Around the Web One Piece Kills All Parasites in Your Body! Paratoxil Toobigtorig1234 14 points 5 days ago Time to blast Gregorian Chants....and Christmas Music permalink award report block reply OTher55 10 points 5 days ago You voted for this New York. Enjoy it. permalink award report block reply HoodooOperator 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply Nellie_the_Beaut 6 points 5 days ago Adams is still in charge for 2 more months. What is he doing about this violation of noise ordinance? permalink award report block reply Billbuttlickerr 4 points 5 days ago NYC has always been a shit hole that smells like piss since I was a kid. People stopped fighting for that city a long time ago. permalink award report block reply jsphere256 3 points 5 days ago Release the Carolers permalink award report block reply mydogma8yourkarma 3 points 5 days ago Set up a nice juicy Pig Roast right next door and give it away for free. permalink award report block reply Nomad899 2 points 5 days ago Walk through tossing bacon like confetti permalink award report block reply FrankDuncan 2 points 5 days ago I give it a week before the winter of sam starts. Too many people that don't want to hear that shit permalink award report block reply SicSemperTyrannis2 1 points 4 days ago Winter of Sam?!? permalink parent award report block reply Run_over_Antifa 2 points 5 days ago Has to get wayyyyyyyy worse before it will get better, sorry but this has to happen. permalink award report block reply SimaYi 2 points 5 days ago It's not the beginning of the end. It's a culmination of the last 30 years. permalink award report block reply goatnuts 2 points 5 days ago Did I just see 2 fucking rickshaws? permalink award report block reply FlgPole 1 points 5 days ago Money. Everyone needs access to food so. Obviously they will sell out the country. morality, humanity, and everything else. permalink award report block reply Tacoboutit 1 points 4 days ago Blast rock and roll back at them....Ya know...like Panama with Noriega. permalink award report block reply\nToobigtorig1234 14 points 5 days ago Time to blast Gregorian Chants....and Christmas Music permalink award report block reply\nOTher55 10 points 5 days ago You voted for this New York. Enjoy it. permalink award report block reply HoodooOperator 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply\nHoodooOperator 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply\nNellie_the_Beaut 6 points 5 days ago Adams is still in charge for 2 more months. What is he doing about this violation of noise ordinance? permalink award report block reply\nBillbuttlickerr 4 points 5 days ago NYC has always been a shit hole that smells like piss since I was a kid. People stopped fighting for that city a long time ago. permalink award report block reply\njsphere256 3 points 5 days ago Release the Carolers permalink award report block reply\nmydogma8yourkarma 3 points 5 days ago Set up a nice juicy Pig Roast right next door and give it away for free. permalink award report block reply\nNomad899 2 points 5 days ago Walk through tossing bacon like confetti permalink award report block reply\nFrankDuncan 2 points 5 days ago I give it a week before the winter of sam starts. Too many people that don't want to hear that shit permalink award report block reply SicSemperTyrannis2 1 points 4 days ago Winter of Sam?!? permalink parent award report block reply\nSicSemperTyrannis2 1 points 4 days ago Winter of Sam?!? permalink parent award report block reply\nRun_over_Antifa 2 points 5 days ago Has to get wayyyyyyyy worse before it will get better, sorry but this has to happen. permalink award report block reply\nSimaYi 2 points 5 days ago It's not the beginning of the end. It's a culmination of the last 30 years. permalink award report block reply\ngoatnuts 2 points 5 days ago Did I just see 2 fucking rickshaws? permalink award report block reply\nFlgPole 1 points 5 days ago Money. Everyone needs access to food so. Obviously they will sell out the country. morality, humanity, and everything else. permalink award report block reply\nTacoboutit 1 points 4 days ago Blast rock and roll back at them....Ya know...like Panama with Noriega. permalink award report block reply"}