{"id": "1ARK9pgyKk", "contents": "10 Speaker Johnson says he was surprised and \"very angry\" about the provision that was added to the funding deal allowing Senators to sue the government if their phone records are investigated without notifying them.\n\nWe had no idea, that was dropped in at the last minute, and I did not appreciate that posted 21 minutes ago by Eruditio 5 comments award share report block Amber Jo Cooper @AmberJoCooper • 13h NOW: @SpeakerJohnson says he was surprised and \"very angry\" about the provision that was added to the funding deal allowing Senators to sue the government if their phone records are investigated without notifying them. \"We had no idea, that was dropped in at the last minute, and\n5 comments Sort by Top Top New Worst Old Save Around the Web Salt Lake City's Hair Growth Method Breaks All Records! HaloGrow MrMcGreenGenes 2 points 11 minutes ago Lies upon lies heaped on lies. I fucking hate liars. permalink award report block reply NadlersNads 1 points 3 minutes ago I've got bad news fer ya then permalink parent award report block reply JoePlumber 2 points 17 minutes ago Retard doesn't even read the bills he brings to a vote. permalink award report block reply lostmyoldpassword 1 points 17 minutes ago Shoving anything into anything they vote on - is literally tearing our fucking country apart.  Anti - rider, anti - lobbying shit is the only thing that could save any fragment of this once great nation.  And it might be 30 years too late, dunno.  Acting like I should get ANYTHING else out of this story is where YOU seem to be fucking up. permalink award report block reply WasNDStateOfMind 1 points 16 minutes ago I don't believe anything Speaker Johnson aka 'Polly Pockets ' says. He had to be aware this was buried in the revised bill. Congress is not America  First and are doing everything in their power to throttle down any improvements that would ease the economic burdens of American taxpayers. permalink award report block reply\nMrMcGreenGenes 2 points 11 minutes ago Lies upon lies heaped on lies. I fucking hate liars. permalink award report block reply NadlersNads 1 points 3 minutes ago I've got bad news fer ya then permalink parent award report block reply\nNadlersNads 1 points 3 minutes ago I've got bad news fer ya then permalink parent award report block reply\nJoePlumber 2 points 17 minutes ago Retard doesn't even read the bills he brings to a vote. permalink award report block reply\nlostmyoldpassword 1 points 17 minutes ago Shoving anything into anything they vote on - is literally tearing our fucking country apart.  Anti - rider, anti - lobbying shit is the only thing that could save any fragment of this once great nation.  And it might be 30 years too late, dunno.  Acting like I should get ANYTHING else out of this story is where YOU seem to be fucking up. permalink award report block reply\nWasNDStateOfMind 1 points 16 minutes ago I don't believe anything Speaker Johnson aka 'Polly Pockets ' says. He had to be aware this was buried in the revised bill. Congress is not America  First and are doing everything in their power to throttle down any improvements that would ease the economic burdens of American taxpayers. permalink award report block reply"}