{"id": "1ARK9nQB9s", "contents": "14 The U.S. NOT on the way to a civil war and the very idea that it is is a 100% deliberately planted psyop. However many people think they hate Trump, 80-90% of people agree with the policies. The few people that don’t are completely lacking in basic competence in any domain. So, no “civil war.” (thehill.com) posted 1 hour ago by flp999 7 comments award share report block Joe Rogan: US ‘on the way to a bona fide civil war’ Podcaster Joe Rogan worried out loud about the possibility of the U.S. inching further toward violent civil conflict during an episode of his talk show this week. “The ultimate expression of … thehill.com\n7 comments Sort by Top Top New Worst Old Save Magma_Biscuit 6 points 1 hour ago Well the way things are going a CW is the only way to clean this mess up, and that ain’t no fucking psyop. permalink award report block reply fskfsk 4 points 1 hour ago When the violent rioters are allowed to do whatever they want without consequences, it makes it seem like there are more of them.  If there were consequences, a lot of them would fold and give up quick. There's a 2nd looming civil war threat, which is much closer in Europe: Muslim takeover.  Once Muslims gain power in government, violence by Muslims against non-Muslims becomes de facto legal.  It might be against the written law, but no longer enforced. permalink award report block reply RadicalCovfefe 2 points 1 hour ago I am fine with it.  Whatever God wills to happen.  I want to live with something worth dying for in this world.  Honor above all. permalink award report block reply genericamerican69 2 points 52 minutes ago The way things are now and are headed is completely unsustainable. Your retirement plans are not more important than preventing the country from turning into India. Sorry. permalink award report block reply BadManOrange 2 points 1 hour ago If 80-90% of people agree with Trump then our elections are a lie. permalink award report block reply Realassman 1 points 1 hour ago Establishment is egging for conflict permalink award report block reply Magma_Biscuit 2 points 53 minutes ago Establishment will be one of the first things eliminated 😁 permalink parent award report block reply\nMagma_Biscuit 6 points 1 hour ago Well the way things are going a CW is the only way to clean this mess up, and that ain’t no fucking psyop. permalink award report block reply\nfskfsk 4 points 1 hour ago When the violent rioters are allowed to do whatever they want without consequences, it makes it seem like there are more of them.  If there were consequences, a lot of them would fold and give up quick. There's a 2nd looming civil war threat, which is much closer in Europe: Muslim takeover.  Once Muslims gain power in government, violence by Muslims against non-Muslims becomes de facto legal.  It might be against the written law, but no longer enforced. permalink award report block reply\nRadicalCovfefe 2 points 1 hour ago I am fine with it.  Whatever God wills to happen.  I want to live with something worth dying for in this world.  Honor above all. permalink award report block reply\ngenericamerican69 2 points 52 minutes ago The way things are now and are headed is completely unsustainable. Your retirement plans are not more important than preventing the country from turning into India. Sorry. permalink award report block reply\nBadManOrange 2 points 1 hour ago If 80-90% of people agree with Trump then our elections are a lie. permalink award report block reply\nRealassman 1 points 1 hour ago Establishment is egging for conflict permalink award report block reply Magma_Biscuit 2 points 53 minutes ago Establishment will be one of the first things eliminated 😁 permalink parent award report block reply\nMagma_Biscuit 2 points 53 minutes ago Establishment will be one of the first things eliminated 😁 permalink parent award report block reply"}