{"id": "1ARK52BhSR", "contents": "783 Tons Of Mamdani Supporters Don’t Actually Know Why They Voted For Him (dailycaller.com) posted 6 days ago by TaxDollarsHardAtWork 143 comments award share report block Tons Of Mamdani Supporters Don't Actually Know Why They Voted For Him Several supporters of Democratic New York City Mayor-elect Zohran Mamdani could not come up with a single reason why they voted for him. dailycaller.com\n143 comments Sort by Top Top New Worst Old Save Hanging_Chad 92 points 6 days ago vote bloo no matter hoo permalink award report block reply YakBak 31 points 6 days ago You might just get a joo! permalink parent award report block reply Beardholder 14 points 6 days ago Their brains are full of poo permalink parent award report block reply Valiazaner 8 points 6 days ago watch out! The muslim filth may try and Soo permalink parent award report block reply DeportThemAllForever 3 points 6 days ago We should deport them to their zoo permalink parent award report block reply view 1 more comments... MedicallyReddit 2 points 6 days ago Just like Joe’s diaper permalink parent award report block reply Sunnybat2 12 points 6 days ago BOO HOO permalink parent award report block reply loveshock 5 points 6 days ago As much as we hate Mamdani, at least he didn't pledge to go to Israel first as first act of Mayor of NYC like the rest of the cast...I mean...candidates did. permalink parent award report block reply BidenShowerDrool 2 points 6 days ago i don't think he'll visiting the wailing wall or be mesmerized with a  Holocaust  museum tour anytime soon. permalink parent award report block reply rebuildingMyself 86 points 6 days ago It's pretty obvious if they aren't coming in with a political position. They were brainwashed to hate Trump, Americans, White men, Capitalism and accountability. And this smirking foreigner validated every one of those views while promising free shit. permalink award report block reply Iremembermypassword 19 points 6 days ago Bullseye! permalink parent award report block reply _Sully_ 8 points 6 days ago Yep, because it makes them feel superior and resolute. permalink parent award report block reply UCantStumpTheTrump 12 points 6 days ago Unresolved daddy issues. Trump is the ultimate male authority figure and that’s why they hate him. They also hate the truth permalink parent award report block reply onesummerdream 7 points 6 days ago They ARE superior and resolute, they went to university! permalink parent award report block reply Grimarr 3 points 6 days ago That and they just want the government to take care of them and tell them what to do.  They don't want to think or take care of themselves.  Country is failing badly. permalink parent award report block reply rebuildingMyself 5 points 6 days ago Yes agreed. Many women never matured past the age of 18 and feminism taught them to marry the state rather than a man. permalink parent award report block reply Cetera 2 points 6 days ago It is cute how people still think voting is a good idea, or that it works at all. Or that actual policy positions have influenced any non-whites' voting preferences, ever. permalink parent award report block reply Pickles76 2 points 6 days ago Yup. He interviewed women and faggots. permalink parent award report block reply load 5 more comments... Dev404 39 points 6 days ago Of course they don't. I can tell you, though. Social media told them to. Women are easily led by their emotions, and social media is the perfect tool to manipulate women into believing anything, like killing her own baby is a great idea, empowering, and makes her a good person. Voting for a commie muslim is a great idea, or else you're a racist who wants poor people to starve to death. See how that works? It works on women very effectively and most don't even realize it decade after decade, generation after generation. permalink award report block reply _Sully_ 13 points 6 days ago They'd change their vote the instant it isn't convenient for them too. So telling them the truth or forming well thought-out impassioned arguments is a total waste. Just make them feel something and that's that. permalink parent award report block reply UCantStumpTheTrump 16 points 6 days ago Above all women fear ostracization. They will ALWAYS vote whichever way is deemed “socially acceptable” by the herd. If it was en vogue to vote for Trump, women would be doing that permalink parent award report block reply thisisatestof2 29 points 6 days ago “Um, I don’t really know. I just do,” one girl said. “Yeah, because I keep seeing all of these like cute TikTok’s of him like partying and clubbing and honestly he’s like, one for the people, you know.” So, no different than middle school class president elections.  Got it. permalink award report block reply Jimmyprawns 8 points 6 days ago You joke but that student council bullshit is a big part of how we got to this point. Student council this, that or the other thing carries no real responsibility.  The teachers and the admin run the school.  But the titles have social value for some unknown reason.  And supposedly indicate to people who see it on a resume or college application some level of responsibility and maturity.  When it doesn't indicate shit.  Except maybe ambition and a propensity for performative bullshit. The whole process is supposed to teach kids about governments and elections but it does the opposite.  Every one learns about titles and that granting a title to someone marks them as a better.  So it isn't about giving a job to someone who can do it.  It's about selecting a person to be anointed as a better.  And the campaign process is about deciding who to give this status and privilege to.  Who 'deserves' to be the holder of a title that comes with advantages.  Who has 'earned' it. And who gives a shit if the students choose to grant 'knighthood' to a village idiot.  The administrators run the school anyway.  Enter the deep state bureaucracy and everyone having been conditioned to accept it while voting for a series of golden child dipshits running for student council bullshit. Student council elections and study body president bullshit has done more to fuck up our Republic than people realize. permalink parent award report block reply thisisatestof2 1 points 6 days ago About the only time student council is when they have some sort of impact is at the college level. Even then, it’s very minimal and more of a provide suggestions to the administration, not make any major decisions. When I was in college, most of the council things were brought up for basic quality of life issues, such as, healthy parking lot shuttle surface operates. Things like that just got passed on to an effort department was handling it to see what they could do and they made the final call. permalink parent award report block reply cornpop_1988 4 points 6 days ago Simple propaganda to fool idiots like this and not knowing anything about his political background. permalink parent award report block reply RudeFrog 26 points 6 days ago If liberals knew what they were voting for they wouldn't be liberals permalink award report block reply keeptherepublic1776 6 points 6 days ago LMAO.  Sad but true permalink parent award report block reply Magma_Biscuit 22 points 6 days ago they will soon learn the consequences of not knowing why. permalink award report block reply IsrorOrca 42 points 6 days ago No they won't - they'll NEVER admit it - no matter how 3rd world the city goes, they will never ever admit it. They'll continue to call you a racist/bigot/capitalist/insert insult here for even questioning their voting. permalink parent award report block reply Irrevincible 17 points 6 days ago They'll call it out by asking \"Why did Trump do this to New York?\". permalink parent award report block reply rebuildingMyself 7 points 6 days ago And while they pack up their shit and move to a red state because of a better job offering or more affordable housing they will never ever make the connection permalink parent award report block reply _Sully_ 4 points 6 days ago You're absolutely right. The fact is most of them aren't even gonna be the beneficiaries of the policies they sorta think he will implement. They'll be fine and that's why they vote that way. They do you a favor by making the absolute worse decisions on your behalf but their Dad will bail them out and they always know where their next meal is coming from, doordash. permalink parent award report block reply SimaYi 3 points 6 days ago Just like how we will never know what it was like to live in 1930s 95% White America, future generations will not know what it was like to live in a free country that wasn't run by third world foreigners. They will just assume that life sucks, and always has sucked. This is the insidious nature of generational decline. Just look at how many people don't believe we went to the moon. It is inconceivable to them that there once existed a generation of White men who could achieve the impossible. We're entering into a long period of decline that will probably mark the end of White dominance over the world that lasted 6 centuries. These past 6 centuries have been the greatest centuries of mankind, and marked its highest achievements, and greatest rise in living standards in history. It was a golden age of humanity, and it was brought low because White people lost WW2, and it ushered in the age of Judeo-Communism, an age where nothing matters but money. Nation, country, and race are \"problematic\", God is dead, and culture is nothing but types of food or some quaint dance. Everyone is now a part of the this new culture, a culture of consumption, with the values of a Walmart, your life measured in iphone iterations and subscription services. The foreigners who will come to be the majority in the country in 10 years won't care, and the White children we've left behind won't know any better, or more likely, have been programmed to believe that Whites never had a homeland, never deserved one of their own, where it was just them. The foreigners have always been with you, White man, and how dare you not seek their tribal wisdom in every aspect of your society? They will be told they are our betters, and always have been. It will take generations of suffering before White people feel the call of the blood and realize they are the masters of this world. It will take a dying away of the insidious propaganda that has poisoned our culture and a return to the thought of our people, not what the jew has told us about them. permalink parent award report block reply user2827 1 points 6 days ago Not trying to shit on your point because I agree with most of it. We wouldn't know what it was like to have lived through the 30s, and while society was far more high trust for the reason you mentioned. My grandparents lived through the depression and dust bowl, and even into their 80s still insisted on keeping a stocked pantry of canned food that could keep the family fed for several months... something about living through a period where the desperation for food had people hunting gophers or whatever might cross their path. It's hard to disagree with the dooming position that we are on a downward path that is inevitable... it's not too late for things to turn around, even though the odds that it will only be achievable through violence. The part that sparked my response is : Just look at how many people don't believe we went to the moon. It is inconceivable to them that there once existed a generation of White men who could achieve the impossible. Without making the positive claim whether or not people did go to the moon, there are many legitimate reasons to be suspicious. Even in the time of the moon landings, there was a segment of scientists who argued that it wouldn't work. The entire space race was a contrivance; pitting communism vs capitalism and technological supremacy... when the outcome was such that both sides could claim a victory in terms of firsts. There was intense national pride tied to the outcomes, on both sides. So, now people look at the circumstances and what remains and there's sufficient reason to doubt. permalink parent award report block reply SimaYi 1 points 5 days ago there are many legitimate reasons to be suspicious. You can see the lander, the rover, and it's tracks from low orbit. https://skyandtelescope.org/observing/how-to-see-all-six-apollo-moon-landing-sites/ The reason nobody believes (and it's going to get worse, like Planet of the Apes), is because it is such a monumental accomplishment that in today's world of \"supply chain issues\", 50% White population, and other retarded fuckery, it seems impossible. Even back then, blacks protested against it because they wanted that money spent on gibs, not human achievement of the grandest order. The moon was worshiped as a goddess by tribes people who now control our culture, and White men put a flag on it. If White nations had stayed White, we would be on Mars by now. I remember as a kid in the 80s the boomer docents at the museum of science and industry telling me we would have colonies on the moon by 2000. And we probably would have if we didn't have an neverending handout to thirdworld people who have literally sucked the lifeblood out of the United States with their foreign invasion. permalink parent award report block reply view 3 more comments... load 1 more comments... actlikewewon 9 points 6 days ago Some call that popcorn time. permalink parent award report block reply maltese-poodle 3 points 6 days ago It's a bunch of retarded leftist white women who did it just to \"look cool\" - it's all over Tiktok the level of mental retardation of these faggots. permalink parent award report block reply Kingofthehill11 4 points 6 days ago After Covid I don't think they will learn. There are just some people that are stuck always blaming others for their own poor choices. permalink parent award report block reply Karpus 2 points 6 days ago They will continue to blame anyone but themselves even as the roof collapses permalink parent award report block reply Kricket 1 points 6 days ago Well, they may “experience” or “feel”\nthe consequences, but I doubt they’ll learn anything. permalink parent award report block reply load 2 more comments... spez_this 18 points 6 days ago Society has gotten dumber and lazier. I propose: Raise the voting age back to 21. Impose competency testing to vote. No voting if on government assistance. Remove party affiliation from ballots. No mail-in ballots. Paper ballots only. permalink award report block reply UCantStumpTheTrump 7 points 6 days ago That would fix most of our problems instantly permalink parent award report block reply LaptopDied 5 points 6 days ago This. All just good sense. Ted Kennedy lowered the voting age. It was always 21. permalink parent award report block reply Major_Nutt 4 points 6 days ago Voting age needs to be 25. Brain doesn't stop developing until then. permalink parent award report block reply Get_Off_Big_Tech 3 points 6 days ago Net taxpayer voting system. permalink parent award report block reply 0111000001100101 1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply MrMcGreenGenes 15 points 6 days ago Dude, where's my ballot? permalink award report block reply Ifeargovtmorethan 2 points 6 days ago How do you do fellow libs,,,,, permalink parent award report block reply HankScorpio 11 points 6 days ago The women voted for him because they think he's cute. And he's not a  fascist nazi. Repeal the 19th. permalink award report block reply 0111000001100101 1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply RememberCharlieKirk 0 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply seattlerunner 9 points 6 days ago “It was always the women, and above all the young ones, who were the most bigoted adherents of the Party, the swallowers of slogans, the amateur spies and nosers-out of unorthodoxy.” permalink award report block reply Constantin2024 9 points 6 days ago God works in mysterious ways. Read your Bible, folks. This is going to be a wild ride. permalink award report block reply BillyBobJimmyJoe 8 points 6 days ago President Nick Fuentes would never have endorsed killer cuomo or ran a black sheboon for governor of virginia.  Republicans need to lose, and lose badly, if they are really that stupid.  Fuentes and Gen Z are going to own the republican party by catering to white young christian men.  Sadly, Trump and Vance are both wall humpers. permalink award report block reply Iremembermypassword 6 points 6 days ago Nick would have been crushed by the media machine. permalink parent award report block reply UCantStumpTheTrump 7 points 6 days ago Yeah he doesn’t have the skills yet, like Trump, to withstand a full on frontal 5th-generation warfare assault. That’s why it chaps my ass when I see shills here shitting on Trump. Dude risked his entire life and legacy and his families lives just to run for POTUS and get rid of the Biden regime permalink parent award report block reply 10MeV 2 points 6 days ago Absolutely.  It's infuriating that Trump is so denigrated for doing what is right for the country. permalink parent award report block reply RememberCharlieKirk 0 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply FlyinHeadlock 8 points 6 days ago He has no money to implement any of his commie crap. There was a cash bar at his victory party. Going after the wealthy also never works. Look at CA. Can't even film a movie there anymore due to all the taxes. The studios look like a ghost town. permalink award report block reply FORMERCHILDSTAR 7 points 6 days ago An uninformed electorate is destructive to a representative republic. We're in uncharted waters with the amount of voters who are illiterate in civics and history. permalink award report block reply Krat 2 points 6 days ago Thats because 80% of them arent suppose to be here and arent allowed their own opinions... they are foot soldiers in an invasion permalink parent award report block reply RememberCharlieKirk 0 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply emorphia 7 points 6 days ago whatever happens to them.. they will blame Trump.  these people  have no logic.  they think like : \"i am a good person so if anything bad happens to me it is because of what OTHERS do to me, never is it me because i am a good person\".   that is why i stopped talking to these people, there is no reason or logic. just a drone-hive-mind. permalink award report block reply auntjemima 7 points 6 days ago 19th strikes again. permalink award report block reply Formerlurker92 6 points 6 days ago Vote blue no matter who jihads you permalink award report block reply KernalMustard 6 points 6 days ago Hes got a D by his name and promises free shit. This isnt rocket surgery. permalink award report block reply thisaintitchief76 5 points 6 days ago Breaking news: women are retarded cattle and destroy nations. More at 11 permalink award report block reply SavingPrivateGrace 5 points 6 days ago How soon they forget they wanted free bus rides, groceries and housing. permalink award report block reply terribletwos 4 points 6 days ago They voted for him because they think they oppose Republicans, but they don't realize that they just voted in a foreign actor who will steal everything from NYC and create a beachhead for further incursions. What I don't think people are seeing is how this redefines the democratic party. AOC was right. Pelosi's out and the new foreign infiltrators party is born and every retard American that doesn't understand that their party has been over taken (again) will help them. permalink award report block reply PhantomShield72 4 points 6 days ago Who's surprised by this??? permalink award report block reply Iremembermypassword 4 points 6 days ago They voted for vibes and the propaganda which created these vibes. permalink award report block reply Grindelwald 4 points 6 days ago And tons of voters, don’t know they voted for him permalink award report block reply y_do_i_need_to_hide 4 points 6 days ago Many of them dont know they voted for him. FTFY permalink award report block reply Redpilled2Depression 4 points 6 days ago Liberal Democracy is a failed ideology that preys on stupid people, which is why the Founding Fathers only allowed land owners to vote originally. permalink award report block reply realsolidsnakeoil 4 points 6 days ago We really got to stop allowing women to vote. permalink award report block reply The_Yakuza 3 points 6 days ago Well no shit lol. They have zero self reflection or awareness. They would sit in labor camps or face the wall for not contributing enough to the communist party and think to themselves “how did I get here”. permalink award report block reply Remember_the_Alamo 3 points 6 days ago Liberals are motivated by spite. That is why. permalink award report block reply hey_spike 3 points 6 days ago They will soon discover what the hammer and sickle really mean. permalink award report block reply Aggrieved03 3 points 6 days ago Because TikTok said it was cool. Duh! permalink award report block reply StruggleSession 3 points 6 days ago Because Socialists promise to fix their problems while the Republicans argue about who supports Ukraine, minorities, and Israel more and how fast should we import more legal and illegal immigrants to take American jobs. Meanwhile, people who actually want to fix this country and have proven solutions are attacked by both side of the political aisle. permalink award report block reply 10MeV 2 points 6 days ago Well, sure!  Neither side wants the problems fixed.  Both sides profit greatly from having the problems! permalink parent award report block reply Squentin 3 points 6 days ago It's based a lot on physical appearance , demeanor and media support. permalink award report block reply Beardholder 3 points 6 days ago I really want to make voting something that you have a right to do if you pass a basic 10 question test right before. Like\nDo you know who the two party representatives are? Do you know which one is a communist and the other a Capitalist? Do you know what the first , second amendment are? Of you can't get all right then you should not be allowed to vote . Period. To vote unknowingly is not only evil but should be held up as high treason. permalink award report block reply keeptherepublic1776 3 points 6 days ago They will find out soon enough permalink award report block reply Kavantar 3 points 6 days ago If you think they will learn from this... Consider San Fransicko, Portlandia, Seaddle, Detwat, Shitcaggo, Sinsinnatti, Boughtawhore, etc... permalink award report block reply Bidensmellslikepiss 3 points 6 days ago \"Cuz my friends like totally did too and I just feel like that's like who I should vote for. Like, he seems like a good guy and I don't like pay attention to politics you know? Literally, I just vote for the democrat cuz the other guys are like evil, like actual nazis.\" permalink award report block reply explodejoystick 3 points 6 days ago But we know this.  They did the same thing as far back as Obama.  It won't stop them from voting this way, and apparently people aren't persuaded by holding up the mirror or using these idiots as a foil.  So, what's the point? permalink award report block reply IvIA6A 3 points 6 days ago Cult of personality. It will be the same thing when they vote for Newsom, even though he's destroyed the state permalink award report block reply JoeBidensDementia1 3 points 6 days ago Liberal. Females. permalink award report block reply 2scoops2peachmints 3 points 6 days ago Cause they’re fucking retarded? permalink award report block reply Tom94 3 points 6 days ago Wasn't it like 54 percent consisting of only mmigrants who voted him and white women it seems like immigrants will take over if they keep being imported in permalink award report block reply MAGASquatch 2 points 6 days ago Tons of Mamdani voters don't know they voted for him. permalink award report block reply TheDoppelgamer 2 points 6 days ago Correct answer is that they don't want to say is publicly - he was the only anti Israel vote but if they said it they would be called anti-semetic and fired/cancelled permalink award report block reply 26magarat 2 points 6 days ago Ok, I thought this was the Bee. permalink award report block reply SurferOnTheRhye 2 points 6 days ago \"What does he say he’s gonna do that you hope he does?” Higby asked. “Affordable housing, I guess? That’s my biggest one right now,” the supporter said. So, these people see the vote as a way to buy the solution to a single personal problem they currently have. What could go wrong? permalink award report block reply john9985 2 points 6 days ago Cause he called the orange man bad permalink award report block reply Crapachino 1 points 6 days ago But the orange man said he wants to \"work\" with him 🙄 permalink parent award report block reply Mike_Hoxbigg 2 points 6 days ago Because they're retarded faggots. permalink award report block reply SweetSpot2020 2 points 6 days ago Probably paid. permalink award report block reply PeregrineFalcon 2 points 6 days ago They voted for cheap talk and false promises. permalink award report block reply 45fan 2 points 6 days ago Mamdami voters: \"I have a cunt and he's a cunt too. We have a lot in common.\" permalink award report block reply magaspif 2 points 6 days ago Because they are angry at the status quo - which is understandable.  But the cure will be worse than the disease permalink award report block reply Tookens 2 points 6 days ago Democrats are ignorant dumbasses?  Tell me something I haven't known for 50 years. permalink award report block reply BirthHole 2 points 6 days ago All this manufactured internet outrage. Unit 8200 on the offense.   Type harder Moshe permalink award report block reply Tophat9000 2 points 6 days ago You're about to find out You brain dead burka bitch permalink award report block reply Ryoten 2 points 6 days ago I live in upstate NY, and i cant wait to watch this shit show.  NYC deserves everything it gets. permalink award report block reply AmerikaUberAlles 2 points 6 days ago Fucking idiot I work with said he would \"move to NYC and vote for him\" if he could because \"he's not afraid of being called a socialist\" and \"he's going to make all of the buses free\".  I was tempted to debate him but it's impossible to have an actual conversation with most leftists like that. This isn't a kid out of college either, it's a 29 year old man.  Just, the absolute depths of nievity wanting to elect a wolf in wolf's clothing. permalink award report block reply duddenmadder 2 points 6 days ago https://imgflip.com/i/2mbmwi permalink award report block reply GallowsTime 2 points 6 days ago They're fixin to find out!  Lotsa bitches soon be ballin'! permalink award report block reply FatigueIsReal 2 points 6 days ago Foreigners voted for foreigners. Women vote for foreigners. Simple as that. Its the exact reason Obama won.  Black people vote for black people. To try to use logic or policy-based reasoning doesn't work with these people. permalink award report block reply TooHotToFrost 2 points 6 days ago They do know. They voted for him because you didn't want them to. permalink award report block reply cd3dog 2 points 6 days ago I’d say they were pathetic but they’re going to have to raise the bar a good bit to get to that point. permalink award report block reply thisguy883 2 points 6 days ago Its a sad state of affairs when the city has to choose between a guy who was responsible for the thousands of deaths of people, a guy who no one knows, and a young guy who says a bunch of shit young people like to hear, but will turn around and enslave them. permalink award report block reply NebraskanPatriot 2 points 6 days ago Runaway inflation has a way of doing just that. permalink award report block reply Side_o_beef_curtains 2 points 6 days ago \"Because he was less unattractive than the other 2 options\" -every AWFL ever permalink award report block reply FusionBlack 2 points 6 days ago I am starting to think Roe V Way should have been left intact.Prodomitly young women. I am so glad I am past the dating stage of my life. permalink award report block reply Jack_HinsonTN 2 points 6 days ago Trump said not to vote for him. That it. That's the reason. permalink award report block reply ItsUsvstheelite 2 points 6 days ago Everyone's laughing at whats about to happen to NYC but won't be laughing when it becomes Newyorkistan. permalink award report block reply Magma_Biscuit 1 points 6 days ago No I’ll still be laughing because everyone knows that’s what’s going to happen except for the idiots that voted for it apparently. permalink parent award report block reply Bramage 2 points 6 days ago Libtards cant think...nothing new. permalink award report block reply Hanrahan 2 points 6 days ago Lord, if you send an asteroid, please aim for Manhattan permalink award report block reply RolandDelacroix 2 points 6 days ago Women vote for who looks better permalink award report block reply Live_free_or_die_55 2 points 6 days ago Typical brainwashed newyorkers!!! permalink award report block reply 19American62Woman 2 points 6 days ago You should have to pass a test before given the privilege of voting. permalink award report block reply hey_spike 1 points 6 days ago Mamdani has a pretty smile. permalink award report block reply SERP-SERP 1 points 6 days ago Orange Man Bad permalink award report block reply cltr1 1 points 6 days ago Its too late now, let's move on. permalink award report block reply YearninNation 1 points 6 days ago Its going to be embarrassing if he does more tangible things for people that Trump. permalink award report block reply Friar_Pede 1 points 6 days ago Tons? What's that like 5 of them? permalink award report block reply Mhmm2MoreWeeks 0 points 6 days ago Hitler called these people 'Useful Idiots'. permalink award report block reply\nHanging_Chad 92 points 6 days ago vote bloo no matter hoo permalink award report block reply YakBak 31 points 6 days ago You might just get a joo! permalink parent award report block reply Beardholder 14 points 6 days ago Their brains are full of poo permalink parent award report block reply Valiazaner 8 points 6 days ago watch out! The muslim filth may try and Soo permalink parent award report block reply DeportThemAllForever 3 points 6 days ago We should deport them to their zoo permalink parent award report block reply view 1 more comments... MedicallyReddit 2 points 6 days ago Just like Joe’s diaper permalink parent award report block reply Sunnybat2 12 points 6 days ago BOO HOO permalink parent award report block reply loveshock 5 points 6 days ago As much as we hate Mamdani, at least he didn't pledge to go to Israel first as first act of Mayor of NYC like the rest of the cast...I mean...candidates did. permalink parent award report block reply BidenShowerDrool 2 points 6 days ago i don't think he'll visiting the wailing wall or be mesmerized with a  Holocaust  museum tour anytime soon. permalink parent award report block reply\nYakBak 31 points 6 days ago You might just get a joo! permalink parent award report block reply Beardholder 14 points 6 days ago Their brains are full of poo permalink parent award report block reply Valiazaner 8 points 6 days ago watch out! The muslim filth may try and Soo permalink parent award report block reply DeportThemAllForever 3 points 6 days ago We should deport them to their zoo permalink parent award report block reply view 1 more comments... MedicallyReddit 2 points 6 days ago Just like Joe’s diaper permalink parent award report block reply Sunnybat2 12 points 6 days ago BOO HOO permalink parent award report block reply loveshock 5 points 6 days ago As much as we hate Mamdani, at least he didn't pledge to go to Israel first as first act of Mayor of NYC like the rest of the cast...I mean...candidates did. permalink parent award report block reply BidenShowerDrool 2 points 6 days ago i don't think he'll visiting the wailing wall or be mesmerized with a  Holocaust  museum tour anytime soon. permalink parent award report block reply\nBeardholder 14 points 6 days ago Their brains are full of poo permalink parent award report block reply Valiazaner 8 points 6 days ago watch out! The muslim filth may try and Soo permalink parent award report block reply DeportThemAllForever 3 points 6 days ago We should deport them to their zoo permalink parent award report block reply view 1 more comments... MedicallyReddit 2 points 6 days ago Just like Joe’s diaper permalink parent award report block reply\nValiazaner 8 points 6 days ago watch out! The muslim filth may try and Soo permalink parent award report block reply DeportThemAllForever 3 points 6 days ago We should deport them to their zoo permalink parent award report block reply view 1 more comments...\nDeportThemAllForever 3 points 6 days ago We should deport them to their zoo permalink parent award report block reply view 1 more comments...\nMedicallyReddit 2 points 6 days ago Just like Joe’s diaper permalink parent award report block reply\nSunnybat2 12 points 6 days ago BOO HOO permalink parent award report block reply\nloveshock 5 points 6 days ago As much as we hate Mamdani, at least he didn't pledge to go to Israel first as first act of Mayor of NYC like the rest of the cast...I mean...candidates did. permalink parent award report block reply BidenShowerDrool 2 points 6 days ago i don't think he'll visiting the wailing wall or be mesmerized with a  Holocaust  museum tour anytime soon. permalink parent award report block reply\nBidenShowerDrool 2 points 6 days ago i don't think he'll visiting the wailing wall or be mesmerized with a  Holocaust  museum tour anytime soon. permalink parent award report block reply\nrebuildingMyself 86 points 6 days ago It's pretty obvious if they aren't coming in with a political position. They were brainwashed to hate Trump, Americans, White men, Capitalism and accountability. And this smirking foreigner validated every one of those views while promising free shit. permalink award report block reply Iremembermypassword 19 points 6 days ago Bullseye! permalink parent award report block reply _Sully_ 8 points 6 days ago Yep, because it makes them feel superior and resolute. permalink parent award report block reply UCantStumpTheTrump 12 points 6 days ago Unresolved daddy issues. Trump is the ultimate male authority figure and that’s why they hate him. They also hate the truth permalink parent award report block reply onesummerdream 7 points 6 days ago They ARE superior and resolute, they went to university! permalink parent award report block reply Grimarr 3 points 6 days ago That and they just want the government to take care of them and tell them what to do.  They don't want to think or take care of themselves.  Country is failing badly. permalink parent award report block reply rebuildingMyself 5 points 6 days ago Yes agreed. Many women never matured past the age of 18 and feminism taught them to marry the state rather than a man. permalink parent award report block reply Cetera 2 points 6 days ago It is cute how people still think voting is a good idea, or that it works at all. Or that actual policy positions have influenced any non-whites' voting preferences, ever. permalink parent award report block reply Pickles76 2 points 6 days ago Yup. He interviewed women and faggots. permalink parent award report block reply load 5 more comments...\nIremembermypassword 19 points 6 days ago Bullseye! permalink parent award report block reply\n_Sully_ 8 points 6 days ago Yep, because it makes them feel superior and resolute. permalink parent award report block reply UCantStumpTheTrump 12 points 6 days ago Unresolved daddy issues. Trump is the ultimate male authority figure and that’s why they hate him. They also hate the truth permalink parent award report block reply onesummerdream 7 points 6 days ago They ARE superior and resolute, they went to university! permalink parent award report block reply\nUCantStumpTheTrump 12 points 6 days ago Unresolved daddy issues. Trump is the ultimate male authority figure and that’s why they hate him. They also hate the truth permalink parent award report block reply\nonesummerdream 7 points 6 days ago They ARE superior and resolute, they went to university! permalink parent award report block reply\nGrimarr 3 points 6 days ago That and they just want the government to take care of them and tell them what to do.  They don't want to think or take care of themselves.  Country is failing badly. permalink parent award report block reply rebuildingMyself 5 points 6 days ago Yes agreed. Many women never matured past the age of 18 and feminism taught them to marry the state rather than a man. permalink parent award report block reply\nrebuildingMyself 5 points 6 days ago Yes agreed. Many women never matured past the age of 18 and feminism taught them to marry the state rather than a man. permalink parent award report block reply\nCetera 2 points 6 days ago It is cute how people still think voting is a good idea, or that it works at all. Or that actual policy positions have influenced any non-whites' voting preferences, ever. permalink parent award report block reply\nPickles76 2 points 6 days ago Yup. He interviewed women and faggots. permalink parent award report block reply\nDev404 39 points 6 days ago Of course they don't. I can tell you, though. Social media told them to. Women are easily led by their emotions, and social media is the perfect tool to manipulate women into believing anything, like killing her own baby is a great idea, empowering, and makes her a good person. Voting for a commie muslim is a great idea, or else you're a racist who wants poor people to starve to death. See how that works? It works on women very effectively and most don't even realize it decade after decade, generation after generation. permalink award report block reply _Sully_ 13 points 6 days ago They'd change their vote the instant it isn't convenient for them too. So telling them the truth or forming well thought-out impassioned arguments is a total waste. Just make them feel something and that's that. permalink parent award report block reply UCantStumpTheTrump 16 points 6 days ago Above all women fear ostracization. They will ALWAYS vote whichever way is deemed “socially acceptable” by the herd. If it was en vogue to vote for Trump, women would be doing that permalink parent award report block reply\n_Sully_ 13 points 6 days ago They'd change their vote the instant it isn't convenient for them too. So telling them the truth or forming well thought-out impassioned arguments is a total waste. Just make them feel something and that's that. permalink parent award report block reply UCantStumpTheTrump 16 points 6 days ago Above all women fear ostracization. They will ALWAYS vote whichever way is deemed “socially acceptable” by the herd. If it was en vogue to vote for Trump, women would be doing that permalink parent award report block reply\nUCantStumpTheTrump 16 points 6 days ago Above all women fear ostracization. They will ALWAYS vote whichever way is deemed “socially acceptable” by the herd. If it was en vogue to vote for Trump, women would be doing that permalink parent award report block reply\nthisisatestof2 29 points 6 days ago “Um, I don’t really know. I just do,” one girl said. “Yeah, because I keep seeing all of these like cute TikTok’s of him like partying and clubbing and honestly he’s like, one for the people, you know.” So, no different than middle school class president elections.  Got it. permalink award report block reply Jimmyprawns 8 points 6 days ago You joke but that student council bullshit is a big part of how we got to this point. Student council this, that or the other thing carries no real responsibility.  The teachers and the admin run the school.  But the titles have social value for some unknown reason.  And supposedly indicate to people who see it on a resume or college application some level of responsibility and maturity.  When it doesn't indicate shit.  Except maybe ambition and a propensity for performative bullshit. The whole process is supposed to teach kids about governments and elections but it does the opposite.  Every one learns about titles and that granting a title to someone marks them as a better.  So it isn't about giving a job to someone who can do it.  It's about selecting a person to be anointed as a better.  And the campaign process is about deciding who to give this status and privilege to.  Who 'deserves' to be the holder of a title that comes with advantages.  Who has 'earned' it. And who gives a shit if the students choose to grant 'knighthood' to a village idiot.  The administrators run the school anyway.  Enter the deep state bureaucracy and everyone having been conditioned to accept it while voting for a series of golden child dipshits running for student council bullshit. Student council elections and study body president bullshit has done more to fuck up our Republic than people realize. permalink parent award report block reply thisisatestof2 1 points 6 days ago About the only time student council is when they have some sort of impact is at the college level. Even then, it’s very minimal and more of a provide suggestions to the administration, not make any major decisions. When I was in college, most of the council things were brought up for basic quality of life issues, such as, healthy parking lot shuttle surface operates. Things like that just got passed on to an effort department was handling it to see what they could do and they made the final call. permalink parent award report block reply cornpop_1988 4 points 6 days ago Simple propaganda to fool idiots like this and not knowing anything about his political background. permalink parent award report block reply\nJimmyprawns 8 points 6 days ago You joke but that student council bullshit is a big part of how we got to this point. Student council this, that or the other thing carries no real responsibility.  The teachers and the admin run the school.  But the titles have social value for some unknown reason.  And supposedly indicate to people who see it on a resume or college application some level of responsibility and maturity.  When it doesn't indicate shit.  Except maybe ambition and a propensity for performative bullshit. The whole process is supposed to teach kids about governments and elections but it does the opposite.  Every one learns about titles and that granting a title to someone marks them as a better.  So it isn't about giving a job to someone who can do it.  It's about selecting a person to be anointed as a better.  And the campaign process is about deciding who to give this status and privilege to.  Who 'deserves' to be the holder of a title that comes with advantages.  Who has 'earned' it. And who gives a shit if the students choose to grant 'knighthood' to a village idiot.  The administrators run the school anyway.  Enter the deep state bureaucracy and everyone having been conditioned to accept it while voting for a series of golden child dipshits running for student council bullshit. Student council elections and study body president bullshit has done more to fuck up our Republic than people realize. permalink parent award report block reply thisisatestof2 1 points 6 days ago About the only time student council is when they have some sort of impact is at the college level. Even then, it’s very minimal and more of a provide suggestions to the administration, not make any major decisions. When I was in college, most of the council things were brought up for basic quality of life issues, such as, healthy parking lot shuttle surface operates. Things like that just got passed on to an effort department was handling it to see what they could do and they made the final call. permalink parent award report block reply\nthisisatestof2 1 points 6 days ago About the only time student council is when they have some sort of impact is at the college level. Even then, it’s very minimal and more of a provide suggestions to the administration, not make any major decisions. When I was in college, most of the council things were brought up for basic quality of life issues, such as, healthy parking lot shuttle surface operates. Things like that just got passed on to an effort department was handling it to see what they could do and they made the final call. permalink parent award report block reply\ncornpop_1988 4 points 6 days ago Simple propaganda to fool idiots like this and not knowing anything about his political background. permalink parent award report block reply\nRudeFrog 26 points 6 days ago If liberals knew what they were voting for they wouldn't be liberals permalink award report block reply keeptherepublic1776 6 points 6 days ago LMAO.  Sad but true permalink parent award report block reply\nkeeptherepublic1776 6 points 6 days ago LMAO.  Sad but true permalink parent award report block reply\nMagma_Biscuit 22 points 6 days ago they will soon learn the consequences of not knowing why. permalink award report block reply IsrorOrca 42 points 6 days ago No they won't - they'll NEVER admit it - no matter how 3rd world the city goes, they will never ever admit it. They'll continue to call you a racist/bigot/capitalist/insert insult here for even questioning their voting. permalink parent award report block reply Irrevincible 17 points 6 days ago They'll call it out by asking \"Why did Trump do this to New York?\". permalink parent award report block reply rebuildingMyself 7 points 6 days ago And while they pack up their shit and move to a red state because of a better job offering or more affordable housing they will never ever make the connection permalink parent award report block reply _Sully_ 4 points 6 days ago You're absolutely right. The fact is most of them aren't even gonna be the beneficiaries of the policies they sorta think he will implement. They'll be fine and that's why they vote that way. They do you a favor by making the absolute worse decisions on your behalf but their Dad will bail them out and they always know where their next meal is coming from, doordash. permalink parent award report block reply SimaYi 3 points 6 days ago Just like how we will never know what it was like to live in 1930s 95% White America, future generations will not know what it was like to live in a free country that wasn't run by third world foreigners. They will just assume that life sucks, and always has sucked. This is the insidious nature of generational decline. Just look at how many people don't believe we went to the moon. It is inconceivable to them that there once existed a generation of White men who could achieve the impossible. We're entering into a long period of decline that will probably mark the end of White dominance over the world that lasted 6 centuries. These past 6 centuries have been the greatest centuries of mankind, and marked its highest achievements, and greatest rise in living standards in history. It was a golden age of humanity, and it was brought low because White people lost WW2, and it ushered in the age of Judeo-Communism, an age where nothing matters but money. Nation, country, and race are \"problematic\", God is dead, and culture is nothing but types of food or some quaint dance. Everyone is now a part of the this new culture, a culture of consumption, with the values of a Walmart, your life measured in iphone iterations and subscription services. The foreigners who will come to be the majority in the country in 10 years won't care, and the White children we've left behind won't know any better, or more likely, have been programmed to believe that Whites never had a homeland, never deserved one of their own, where it was just them. The foreigners have always been with you, White man, and how dare you not seek their tribal wisdom in every aspect of your society? They will be told they are our betters, and always have been. It will take generations of suffering before White people feel the call of the blood and realize they are the masters of this world. It will take a dying away of the insidious propaganda that has poisoned our culture and a return to the thought of our people, not what the jew has told us about them. permalink parent award report block reply user2827 1 points 6 days ago Not trying to shit on your point because I agree with most of it. We wouldn't know what it was like to have lived through the 30s, and while society was far more high trust for the reason you mentioned. My grandparents lived through the depression and dust bowl, and even into their 80s still insisted on keeping a stocked pantry of canned food that could keep the family fed for several months... something about living through a period where the desperation for food had people hunting gophers or whatever might cross their path. It's hard to disagree with the dooming position that we are on a downward path that is inevitable... it's not too late for things to turn around, even though the odds that it will only be achievable through violence. The part that sparked my response is : Just look at how many people don't believe we went to the moon. It is inconceivable to them that there once existed a generation of White men who could achieve the impossible. Without making the positive claim whether or not people did go to the moon, there are many legitimate reasons to be suspicious. Even in the time of the moon landings, there was a segment of scientists who argued that it wouldn't work. The entire space race was a contrivance; pitting communism vs capitalism and technological supremacy... when the outcome was such that both sides could claim a victory in terms of firsts. There was intense national pride tied to the outcomes, on both sides. So, now people look at the circumstances and what remains and there's sufficient reason to doubt. permalink parent award report block reply SimaYi 1 points 5 days ago there are many legitimate reasons to be suspicious. You can see the lander, the rover, and it's tracks from low orbit. https://skyandtelescope.org/observing/how-to-see-all-six-apollo-moon-landing-sites/ The reason nobody believes (and it's going to get worse, like Planet of the Apes), is because it is such a monumental accomplishment that in today's world of \"supply chain issues\", 50% White population, and other retarded fuckery, it seems impossible. Even back then, blacks protested against it because they wanted that money spent on gibs, not human achievement of the grandest order. The moon was worshiped as a goddess by tribes people who now control our culture, and White men put a flag on it. If White nations had stayed White, we would be on Mars by now. I remember as a kid in the 80s the boomer docents at the museum of science and industry telling me we would have colonies on the moon by 2000. And we probably would have if we didn't have an neverending handout to thirdworld people who have literally sucked the lifeblood out of the United States with their foreign invasion. permalink parent award report block reply view 3 more comments... load 1 more comments... actlikewewon 9 points 6 days ago Some call that popcorn time. permalink parent award report block reply maltese-poodle 3 points 6 days ago It's a bunch of retarded leftist white women who did it just to \"look cool\" - it's all over Tiktok the level of mental retardation of these faggots. permalink parent award report block reply Kingofthehill11 4 points 6 days ago After Covid I don't think they will learn. There are just some people that are stuck always blaming others for their own poor choices. permalink parent award report block reply Karpus 2 points 6 days ago They will continue to blame anyone but themselves even as the roof collapses permalink parent award report block reply Kricket 1 points 6 days ago Well, they may “experience” or “feel”\nthe consequences, but I doubt they’ll learn anything. permalink parent award report block reply load 2 more comments...\nIsrorOrca 42 points 6 days ago No they won't - they'll NEVER admit it - no matter how 3rd world the city goes, they will never ever admit it. They'll continue to call you a racist/bigot/capitalist/insert insult here for even questioning their voting. permalink parent award report block reply Irrevincible 17 points 6 days ago They'll call it out by asking \"Why did Trump do this to New York?\". permalink parent award report block reply rebuildingMyself 7 points 6 days ago And while they pack up their shit and move to a red state because of a better job offering or more affordable housing they will never ever make the connection permalink parent award report block reply _Sully_ 4 points 6 days ago You're absolutely right. The fact is most of them aren't even gonna be the beneficiaries of the policies they sorta think he will implement. They'll be fine and that's why they vote that way. They do you a favor by making the absolute worse decisions on your behalf but their Dad will bail them out and they always know where their next meal is coming from, doordash. permalink parent award report block reply SimaYi 3 points 6 days ago Just like how we will never know what it was like to live in 1930s 95% White America, future generations will not know what it was like to live in a free country that wasn't run by third world foreigners. They will just assume that life sucks, and always has sucked. This is the insidious nature of generational decline. Just look at how many people don't believe we went to the moon. It is inconceivable to them that there once existed a generation of White men who could achieve the impossible. We're entering into a long period of decline that will probably mark the end of White dominance over the world that lasted 6 centuries. These past 6 centuries have been the greatest centuries of mankind, and marked its highest achievements, and greatest rise in living standards in history. It was a golden age of humanity, and it was brought low because White people lost WW2, and it ushered in the age of Judeo-Communism, an age where nothing matters but money. Nation, country, and race are \"problematic\", God is dead, and culture is nothing but types of food or some quaint dance. Everyone is now a part of the this new culture, a culture of consumption, with the values of a Walmart, your life measured in iphone iterations and subscription services. The foreigners who will come to be the majority in the country in 10 years won't care, and the White children we've left behind won't know any better, or more likely, have been programmed to believe that Whites never had a homeland, never deserved one of their own, where it was just them. The foreigners have always been with you, White man, and how dare you not seek their tribal wisdom in every aspect of your society? They will be told they are our betters, and always have been. It will take generations of suffering before White people feel the call of the blood and realize they are the masters of this world. It will take a dying away of the insidious propaganda that has poisoned our culture and a return to the thought of our people, not what the jew has told us about them. permalink parent award report block reply user2827 1 points 6 days ago Not trying to shit on your point because I agree with most of it. We wouldn't know what it was like to have lived through the 30s, and while society was far more high trust for the reason you mentioned. My grandparents lived through the depression and dust bowl, and even into their 80s still insisted on keeping a stocked pantry of canned food that could keep the family fed for several months... something about living through a period where the desperation for food had people hunting gophers or whatever might cross their path. It's hard to disagree with the dooming position that we are on a downward path that is inevitable... it's not too late for things to turn around, even though the odds that it will only be achievable through violence. The part that sparked my response is : Just look at how many people don't believe we went to the moon. It is inconceivable to them that there once existed a generation of White men who could achieve the impossible. Without making the positive claim whether or not people did go to the moon, there are many legitimate reasons to be suspicious. Even in the time of the moon landings, there was a segment of scientists who argued that it wouldn't work. The entire space race was a contrivance; pitting communism vs capitalism and technological supremacy... when the outcome was such that both sides could claim a victory in terms of firsts. There was intense national pride tied to the outcomes, on both sides. So, now people look at the circumstances and what remains and there's sufficient reason to doubt. permalink parent award report block reply SimaYi 1 points 5 days ago there are many legitimate reasons to be suspicious. You can see the lander, the rover, and it's tracks from low orbit. https://skyandtelescope.org/observing/how-to-see-all-six-apollo-moon-landing-sites/ The reason nobody believes (and it's going to get worse, like Planet of the Apes), is because it is such a monumental accomplishment that in today's world of \"supply chain issues\", 50% White population, and other retarded fuckery, it seems impossible. Even back then, blacks protested against it because they wanted that money spent on gibs, not human achievement of the grandest order. The moon was worshiped as a goddess by tribes people who now control our culture, and White men put a flag on it. If White nations had stayed White, we would be on Mars by now. I remember as a kid in the 80s the boomer docents at the museum of science and industry telling me we would have colonies on the moon by 2000. And we probably would have if we didn't have an neverending handout to thirdworld people who have literally sucked the lifeblood out of the United States with their foreign invasion. permalink parent award report block reply view 3 more comments... load 1 more comments...\nIrrevincible 17 points 6 days ago They'll call it out by asking \"Why did Trump do this to New York?\". permalink parent award report block reply\nrebuildingMyself 7 points 6 days ago And while they pack up their shit and move to a red state because of a better job offering or more affordable housing they will never ever make the connection permalink parent award report block reply\n_Sully_ 4 points 6 days ago You're absolutely right. The fact is most of them aren't even gonna be the beneficiaries of the policies they sorta think he will implement. They'll be fine and that's why they vote that way. They do you a favor by making the absolute worse decisions on your behalf but their Dad will bail them out and they always know where their next meal is coming from, doordash. permalink parent award report block reply\nSimaYi 3 points 6 days ago Just like how we will never know what it was like to live in 1930s 95% White America, future generations will not know what it was like to live in a free country that wasn't run by third world foreigners. They will just assume that life sucks, and always has sucked. This is the insidious nature of generational decline. Just look at how many people don't believe we went to the moon. It is inconceivable to them that there once existed a generation of White men who could achieve the impossible. We're entering into a long period of decline that will probably mark the end of White dominance over the world that lasted 6 centuries. These past 6 centuries have been the greatest centuries of mankind, and marked its highest achievements, and greatest rise in living standards in history. It was a golden age of humanity, and it was brought low because White people lost WW2, and it ushered in the age of Judeo-Communism, an age where nothing matters but money. Nation, country, and race are \"problematic\", God is dead, and culture is nothing but types of food or some quaint dance. Everyone is now a part of the this new culture, a culture of consumption, with the values of a Walmart, your life measured in iphone iterations and subscription services. The foreigners who will come to be the majority in the country in 10 years won't care, and the White children we've left behind won't know any better, or more likely, have been programmed to believe that Whites never had a homeland, never deserved one of their own, where it was just them. The foreigners have always been with you, White man, and how dare you not seek their tribal wisdom in every aspect of your society? They will be told they are our betters, and always have been. It will take generations of suffering before White people feel the call of the blood and realize they are the masters of this world. It will take a dying away of the insidious propaganda that has poisoned our culture and a return to the thought of our people, not what the jew has told us about them. permalink parent award report block reply user2827 1 points 6 days ago Not trying to shit on your point because I agree with most of it. We wouldn't know what it was like to have lived through the 30s, and while society was far more high trust for the reason you mentioned. My grandparents lived through the depression and dust bowl, and even into their 80s still insisted on keeping a stocked pantry of canned food that could keep the family fed for several months... something about living through a period where the desperation for food had people hunting gophers or whatever might cross their path. It's hard to disagree with the dooming position that we are on a downward path that is inevitable... it's not too late for things to turn around, even though the odds that it will only be achievable through violence. The part that sparked my response is : Just look at how many people don't believe we went to the moon. It is inconceivable to them that there once existed a generation of White men who could achieve the impossible. Without making the positive claim whether or not people did go to the moon, there are many legitimate reasons to be suspicious. Even in the time of the moon landings, there was a segment of scientists who argued that it wouldn't work. The entire space race was a contrivance; pitting communism vs capitalism and technological supremacy... when the outcome was such that both sides could claim a victory in terms of firsts. There was intense national pride tied to the outcomes, on both sides. So, now people look at the circumstances and what remains and there's sufficient reason to doubt. permalink parent award report block reply SimaYi 1 points 5 days ago there are many legitimate reasons to be suspicious. You can see the lander, the rover, and it's tracks from low orbit. https://skyandtelescope.org/observing/how-to-see-all-six-apollo-moon-landing-sites/ The reason nobody believes (and it's going to get worse, like Planet of the Apes), is because it is such a monumental accomplishment that in today's world of \"supply chain issues\", 50% White population, and other retarded fuckery, it seems impossible. Even back then, blacks protested against it because they wanted that money spent on gibs, not human achievement of the grandest order. The moon was worshiped as a goddess by tribes people who now control our culture, and White men put a flag on it. If White nations had stayed White, we would be on Mars by now. I remember as a kid in the 80s the boomer docents at the museum of science and industry telling me we would have colonies on the moon by 2000. And we probably would have if we didn't have an neverending handout to thirdworld people who have literally sucked the lifeblood out of the United States with their foreign invasion. permalink parent award report block reply view 3 more comments...\nuser2827 1 points 6 days ago Not trying to shit on your point because I agree with most of it. We wouldn't know what it was like to have lived through the 30s, and while society was far more high trust for the reason you mentioned. My grandparents lived through the depression and dust bowl, and even into their 80s still insisted on keeping a stocked pantry of canned food that could keep the family fed for several months... something about living through a period where the desperation for food had people hunting gophers or whatever might cross their path. It's hard to disagree with the dooming position that we are on a downward path that is inevitable... it's not too late for things to turn around, even though the odds that it will only be achievable through violence. The part that sparked my response is : Just look at how many people don't believe we went to the moon. It is inconceivable to them that there once existed a generation of White men who could achieve the impossible. Without making the positive claim whether or not people did go to the moon, there are many legitimate reasons to be suspicious. Even in the time of the moon landings, there was a segment of scientists who argued that it wouldn't work. The entire space race was a contrivance; pitting communism vs capitalism and technological supremacy... when the outcome was such that both sides could claim a victory in terms of firsts. There was intense national pride tied to the outcomes, on both sides. So, now people look at the circumstances and what remains and there's sufficient reason to doubt. permalink parent award report block reply SimaYi 1 points 5 days ago there are many legitimate reasons to be suspicious. You can see the lander, the rover, and it's tracks from low orbit. https://skyandtelescope.org/observing/how-to-see-all-six-apollo-moon-landing-sites/ The reason nobody believes (and it's going to get worse, like Planet of the Apes), is because it is such a monumental accomplishment that in today's world of \"supply chain issues\", 50% White population, and other retarded fuckery, it seems impossible. Even back then, blacks protested against it because they wanted that money spent on gibs, not human achievement of the grandest order. The moon was worshiped as a goddess by tribes people who now control our culture, and White men put a flag on it. If White nations had stayed White, we would be on Mars by now. I remember as a kid in the 80s the boomer docents at the museum of science and industry telling me we would have colonies on the moon by 2000. And we probably would have if we didn't have an neverending handout to thirdworld people who have literally sucked the lifeblood out of the United States with their foreign invasion. permalink parent award report block reply view 3 more comments...\nSimaYi 1 points 5 days ago there are many legitimate reasons to be suspicious. You can see the lander, the rover, and it's tracks from low orbit. https://skyandtelescope.org/observing/how-to-see-all-six-apollo-moon-landing-sites/ The reason nobody believes (and it's going to get worse, like Planet of the Apes), is because it is such a monumental accomplishment that in today's world of \"supply chain issues\", 50% White population, and other retarded fuckery, it seems impossible. Even back then, blacks protested against it because they wanted that money spent on gibs, not human achievement of the grandest order. The moon was worshiped as a goddess by tribes people who now control our culture, and White men put a flag on it. If White nations had stayed White, we would be on Mars by now. I remember as a kid in the 80s the boomer docents at the museum of science and industry telling me we would have colonies on the moon by 2000. And we probably would have if we didn't have an neverending handout to thirdworld people who have literally sucked the lifeblood out of the United States with their foreign invasion. permalink parent award report block reply view 3 more comments...\nactlikewewon 9 points 6 days ago Some call that popcorn time. permalink parent award report block reply maltese-poodle 3 points 6 days ago It's a bunch of retarded leftist white women who did it just to \"look cool\" - it's all over Tiktok the level of mental retardation of these faggots. permalink parent award report block reply\nmaltese-poodle 3 points 6 days ago It's a bunch of retarded leftist white women who did it just to \"look cool\" - it's all over Tiktok the level of mental retardation of these faggots. permalink parent award report block reply\nKingofthehill11 4 points 6 days ago After Covid I don't think they will learn. There are just some people that are stuck always blaming others for their own poor choices. permalink parent award report block reply\nKarpus 2 points 6 days ago They will continue to blame anyone but themselves even as the roof collapses permalink parent award report block reply\nKricket 1 points 6 days ago Well, they may “experience” or “feel”\nthe consequences, but I doubt they’ll learn anything. permalink parent award report block reply\nspez_this 18 points 6 days ago Society has gotten dumber and lazier. I propose: Raise the voting age back to 21. Impose competency testing to vote. No voting if on government assistance. Remove party affiliation from ballots. No mail-in ballots. Paper ballots only. permalink award report block reply UCantStumpTheTrump 7 points 6 days ago That would fix most of our problems instantly permalink parent award report block reply LaptopDied 5 points 6 days ago This. All just good sense. Ted Kennedy lowered the voting age. It was always 21. permalink parent award report block reply Major_Nutt 4 points 6 days ago Voting age needs to be 25. Brain doesn't stop developing until then. permalink parent award report block reply Get_Off_Big_Tech 3 points 6 days ago Net taxpayer voting system. permalink parent award report block reply 0111000001100101 1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nUCantStumpTheTrump 7 points 6 days ago That would fix most of our problems instantly permalink parent award report block reply\nLaptopDied 5 points 6 days ago This. All just good sense. Ted Kennedy lowered the voting age. It was always 21. permalink parent award report block reply\nMajor_Nutt 4 points 6 days ago Voting age needs to be 25. Brain doesn't stop developing until then. permalink parent award report block reply\nGet_Off_Big_Tech 3 points 6 days ago Net taxpayer voting system. permalink parent award report block reply\n0111000001100101 1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nMrMcGreenGenes 15 points 6 days ago Dude, where's my ballot? permalink award report block reply Ifeargovtmorethan 2 points 6 days ago How do you do fellow libs,,,,, permalink parent award report block reply\nIfeargovtmorethan 2 points 6 days ago How do you do fellow libs,,,,, permalink parent award report block reply\nHankScorpio 11 points 6 days ago The women voted for him because they think he's cute. And he's not a  fascist nazi. Repeal the 19th. permalink award report block reply 0111000001100101 1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply RememberCharlieKirk 0 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\n0111000001100101 1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nRememberCharlieKirk 0 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nseattlerunner 9 points 6 days ago “It was always the women, and above all the young ones, who were the most bigoted adherents of the Party, the swallowers of slogans, the amateur spies and nosers-out of unorthodoxy.” permalink award report block reply\nConstantin2024 9 points 6 days ago God works in mysterious ways. Read your Bible, folks. This is going to be a wild ride. permalink award report block reply\nBillyBobJimmyJoe 8 points 6 days ago President Nick Fuentes would never have endorsed killer cuomo or ran a black sheboon for governor of virginia.  Republicans need to lose, and lose badly, if they are really that stupid.  Fuentes and Gen Z are going to own the republican party by catering to white young christian men.  Sadly, Trump and Vance are both wall humpers. permalink award report block reply Iremembermypassword 6 points 6 days ago Nick would have been crushed by the media machine. permalink parent award report block reply UCantStumpTheTrump 7 points 6 days ago Yeah he doesn’t have the skills yet, like Trump, to withstand a full on frontal 5th-generation warfare assault. That’s why it chaps my ass when I see shills here shitting on Trump. Dude risked his entire life and legacy and his families lives just to run for POTUS and get rid of the Biden regime permalink parent award report block reply 10MeV 2 points 6 days ago Absolutely.  It's infuriating that Trump is so denigrated for doing what is right for the country. permalink parent award report block reply RememberCharlieKirk 0 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nIremembermypassword 6 points 6 days ago Nick would have been crushed by the media machine. permalink parent award report block reply UCantStumpTheTrump 7 points 6 days ago Yeah he doesn’t have the skills yet, like Trump, to withstand a full on frontal 5th-generation warfare assault. That’s why it chaps my ass when I see shills here shitting on Trump. Dude risked his entire life and legacy and his families lives just to run for POTUS and get rid of the Biden regime permalink parent award report block reply 10MeV 2 points 6 days ago Absolutely.  It's infuriating that Trump is so denigrated for doing what is right for the country. permalink parent award report block reply\nUCantStumpTheTrump 7 points 6 days ago Yeah he doesn’t have the skills yet, like Trump, to withstand a full on frontal 5th-generation warfare assault. That’s why it chaps my ass when I see shills here shitting on Trump. Dude risked his entire life and legacy and his families lives just to run for POTUS and get rid of the Biden regime permalink parent award report block reply 10MeV 2 points 6 days ago Absolutely.  It's infuriating that Trump is so denigrated for doing what is right for the country. permalink parent award report block reply\n10MeV 2 points 6 days ago Absolutely.  It's infuriating that Trump is so denigrated for doing what is right for the country. permalink parent award report block reply\nRememberCharlieKirk 0 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nFlyinHeadlock 8 points 6 days ago He has no money to implement any of his commie crap. There was a cash bar at his victory party. Going after the wealthy also never works. Look at CA. Can't even film a movie there anymore due to all the taxes. The studios look like a ghost town. permalink award report block reply\nFORMERCHILDSTAR 7 points 6 days ago An uninformed electorate is destructive to a representative republic. We're in uncharted waters with the amount of voters who are illiterate in civics and history. permalink award report block reply Krat 2 points 6 days ago Thats because 80% of them arent suppose to be here and arent allowed their own opinions... they are foot soldiers in an invasion permalink parent award report block reply RememberCharlieKirk 0 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nKrat 2 points 6 days ago Thats because 80% of them arent suppose to be here and arent allowed their own opinions... they are foot soldiers in an invasion permalink parent award report block reply\nRememberCharlieKirk 0 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nemorphia 7 points 6 days ago whatever happens to them.. they will blame Trump.  these people  have no logic.  they think like : \"i am a good person so if anything bad happens to me it is because of what OTHERS do to me, never is it me because i am a good person\".   that is why i stopped talking to these people, there is no reason or logic. just a drone-hive-mind. permalink award report block reply\nauntjemima 7 points 6 days ago 19th strikes again. permalink award report block reply\nFormerlurker92 6 points 6 days ago Vote blue no matter who jihads you permalink award report block reply\nKernalMustard 6 points 6 days ago Hes got a D by his name and promises free shit. This isnt rocket surgery. permalink award report block reply\nthisaintitchief76 5 points 6 days ago Breaking news: women are retarded cattle and destroy nations. More at 11 permalink award report block reply\nSavingPrivateGrace 5 points 6 days ago How soon they forget they wanted free bus rides, groceries and housing. permalink award report block reply\nterribletwos 4 points 6 days ago They voted for him because they think they oppose Republicans, but they don't realize that they just voted in a foreign actor who will steal everything from NYC and create a beachhead for further incursions. What I don't think people are seeing is how this redefines the democratic party. AOC was right. Pelosi's out and the new foreign infiltrators party is born and every retard American that doesn't understand that their party has been over taken (again) will help them. permalink award report block reply\nPhantomShield72 4 points 6 days ago Who's surprised by this??? permalink award report block reply\nIremembermypassword 4 points 6 days ago They voted for vibes and the propaganda which created these vibes. permalink award report block reply\nGrindelwald 4 points 6 days ago And tons of voters, don’t know they voted for him permalink award report block reply\ny_do_i_need_to_hide 4 points 6 days ago Many of them dont know they voted for him. FTFY permalink award report block reply\nRedpilled2Depression 4 points 6 days ago Liberal Democracy is a failed ideology that preys on stupid people, which is why the Founding Fathers only allowed land owners to vote originally. permalink award report block reply\nrealsolidsnakeoil 4 points 6 days ago We really got to stop allowing women to vote. permalink award report block reply\nThe_Yakuza 3 points 6 days ago Well no shit lol. They have zero self reflection or awareness. They would sit in labor camps or face the wall for not contributing enough to the communist party and think to themselves “how did I get here”. permalink award report block reply\nRemember_the_Alamo 3 points 6 days ago Liberals are motivated by spite. That is why. permalink award report block reply\nhey_spike 3 points 6 days ago They will soon discover what the hammer and sickle really mean. permalink award report block reply\nAggrieved03 3 points 6 days ago Because TikTok said it was cool. Duh! permalink award report block reply\nStruggleSession 3 points 6 days ago Because Socialists promise to fix their problems while the Republicans argue about who supports Ukraine, minorities, and Israel more and how fast should we import more legal and illegal immigrants to take American jobs. Meanwhile, people who actually want to fix this country and have proven solutions are attacked by both side of the political aisle. permalink award report block reply 10MeV 2 points 6 days ago Well, sure!  Neither side wants the problems fixed.  Both sides profit greatly from having the problems! permalink parent award report block reply\n10MeV 2 points 6 days ago Well, sure!  Neither side wants the problems fixed.  Both sides profit greatly from having the problems! permalink parent award report block reply\nSquentin 3 points 6 days ago It's based a lot on physical appearance , demeanor and media support. permalink award report block reply\nBeardholder 3 points 6 days ago I really want to make voting something that you have a right to do if you pass a basic 10 question test right before. Like\nDo you know who the two party representatives are? Do you know which one is a communist and the other a Capitalist? Do you know what the first , second amendment are? Of you can't get all right then you should not be allowed to vote . Period. To vote unknowingly is not only evil but should be held up as high treason. permalink award report block reply\nkeeptherepublic1776 3 points 6 days ago They will find out soon enough permalink award report block reply\nKavantar 3 points 6 days ago If you think they will learn from this... Consider San Fransicko, Portlandia, Seaddle, Detwat, Shitcaggo, Sinsinnatti, Boughtawhore, etc... permalink award report block reply\nBidensmellslikepiss 3 points 6 days ago \"Cuz my friends like totally did too and I just feel like that's like who I should vote for. Like, he seems like a good guy and I don't like pay attention to politics you know? Literally, I just vote for the democrat cuz the other guys are like evil, like actual nazis.\" permalink award report block reply\nexplodejoystick 3 points 6 days ago But we know this.  They did the same thing as far back as Obama.  It won't stop them from voting this way, and apparently people aren't persuaded by holding up the mirror or using these idiots as a foil.  So, what's the point? permalink award report block reply\nIvIA6A 3 points 6 days ago Cult of personality. It will be the same thing when they vote for Newsom, even though he's destroyed the state permalink award report block reply\nJoeBidensDementia1 3 points 6 days ago Liberal. Females. permalink award report block reply\n2scoops2peachmints 3 points 6 days ago Cause they’re fucking retarded? permalink award report block reply\nTom94 3 points 6 days ago Wasn't it like 54 percent consisting of only mmigrants who voted him and white women it seems like immigrants will take over if they keep being imported in permalink award report block reply\nMAGASquatch 2 points 6 days ago Tons of Mamdani voters don't know they voted for him. permalink award report block reply\nTheDoppelgamer 2 points 6 days ago Correct answer is that they don't want to say is publicly - he was the only anti Israel vote but if they said it they would be called anti-semetic and fired/cancelled permalink award report block reply\n26magarat 2 points 6 days ago Ok, I thought this was the Bee. permalink award report block reply\nSurferOnTheRhye 2 points 6 days ago \"What does he say he’s gonna do that you hope he does?” Higby asked. “Affordable housing, I guess? That’s my biggest one right now,” the supporter said. So, these people see the vote as a way to buy the solution to a single personal problem they currently have. What could go wrong? permalink award report block reply\njohn9985 2 points 6 days ago Cause he called the orange man bad permalink award report block reply Crapachino 1 points 6 days ago But the orange man said he wants to \"work\" with him 🙄 permalink parent award report block reply\nCrapachino 1 points 6 days ago But the orange man said he wants to \"work\" with him 🙄 permalink parent award report block reply\nMike_Hoxbigg 2 points 6 days ago Because they're retarded faggots. permalink award report block reply\nSweetSpot2020 2 points 6 days ago Probably paid. permalink award report block reply\nPeregrineFalcon 2 points 6 days ago They voted for cheap talk and false promises. permalink award report block reply\n45fan 2 points 6 days ago Mamdami voters: \"I have a cunt and he's a cunt too. We have a lot in common.\" permalink award report block reply\nmagaspif 2 points 6 days ago Because they are angry at the status quo - which is understandable.  But the cure will be worse than the disease permalink award report block reply\nTookens 2 points 6 days ago Democrats are ignorant dumbasses?  Tell me something I haven't known for 50 years. permalink award report block reply\nBirthHole 2 points 6 days ago All this manufactured internet outrage. Unit 8200 on the offense.   Type harder Moshe permalink award report block reply\nTophat9000 2 points 6 days ago You're about to find out You brain dead burka bitch permalink award report block reply\nRyoten 2 points 6 days ago I live in upstate NY, and i cant wait to watch this shit show.  NYC deserves everything it gets. permalink award report block reply\nAmerikaUberAlles 2 points 6 days ago Fucking idiot I work with said he would \"move to NYC and vote for him\" if he could because \"he's not afraid of being called a socialist\" and \"he's going to make all of the buses free\".  I was tempted to debate him but it's impossible to have an actual conversation with most leftists like that. This isn't a kid out of college either, it's a 29 year old man.  Just, the absolute depths of nievity wanting to elect a wolf in wolf's clothing. permalink award report block reply\nduddenmadder 2 points 6 days ago https://imgflip.com/i/2mbmwi permalink award report block reply\nGallowsTime 2 points 6 days ago They're fixin to find out!  Lotsa bitches soon be ballin'! permalink award report block reply\nFatigueIsReal 2 points 6 days ago Foreigners voted for foreigners. Women vote for foreigners. Simple as that. Its the exact reason Obama won.  Black people vote for black people. To try to use logic or policy-based reasoning doesn't work with these people. permalink award report block reply\nTooHotToFrost 2 points 6 days ago They do know. They voted for him because you didn't want them to. permalink award report block reply\ncd3dog 2 points 6 days ago I’d say they were pathetic but they’re going to have to raise the bar a good bit to get to that point. permalink award report block reply\nthisguy883 2 points 6 days ago Its a sad state of affairs when the city has to choose between a guy who was responsible for the thousands of deaths of people, a guy who no one knows, and a young guy who says a bunch of shit young people like to hear, but will turn around and enslave them. permalink award report block reply\nNebraskanPatriot 2 points 6 days ago Runaway inflation has a way of doing just that. permalink award report block reply\nSide_o_beef_curtains 2 points 6 days ago \"Because he was less unattractive than the other 2 options\" -every AWFL ever permalink award report block reply\nFusionBlack 2 points 6 days ago I am starting to think Roe V Way should have been left intact.Prodomitly young women. I am so glad I am past the dating stage of my life. permalink award report block reply\nJack_HinsonTN 2 points 6 days ago Trump said not to vote for him. That it. That's the reason. permalink award report block reply\nItsUsvstheelite 2 points 6 days ago Everyone's laughing at whats about to happen to NYC but won't be laughing when it becomes Newyorkistan. permalink award report block reply Magma_Biscuit 1 points 6 days ago No I’ll still be laughing because everyone knows that’s what’s going to happen except for the idiots that voted for it apparently. permalink parent award report block reply\nMagma_Biscuit 1 points 6 days ago No I’ll still be laughing because everyone knows that’s what’s going to happen except for the idiots that voted for it apparently. permalink parent award report block reply\nBramage 2 points 6 days ago Libtards cant think...nothing new. permalink award report block reply\nHanrahan 2 points 6 days ago Lord, if you send an asteroid, please aim for Manhattan permalink award report block reply\nRolandDelacroix 2 points 6 days ago Women vote for who looks better permalink award report block reply\nLive_free_or_die_55 2 points 6 days ago Typical brainwashed newyorkers!!! permalink award report block reply\n19American62Woman 2 points 6 days ago You should have to pass a test before given the privilege of voting. permalink award report block reply\nhey_spike 1 points 6 days ago Mamdani has a pretty smile. permalink award report block reply\nSERP-SERP 1 points 6 days ago Orange Man Bad permalink award report block reply\ncltr1 1 points 6 days ago Its too late now, let's move on. permalink award report block reply\nYearninNation 1 points 6 days ago Its going to be embarrassing if he does more tangible things for people that Trump. permalink award report block reply\nFriar_Pede 1 points 6 days ago Tons? What's that like 5 of them? permalink award report block reply\nMhmm2MoreWeeks 0 points 6 days ago Hitler called these people 'Useful Idiots'. permalink award report block reply"}