{"id": "1ARK9mFaRn", "contents": "786 🌉🌁 758-meter-long Hongqi bridge collapses in southwest PRC 🇨🇳, months after opening 🤡🌎  HONK  HONK  🌎🤡 posted 19 hours ago by Hanging_Chad 119 comments award share report block Magills @magills_ • 1d AHHHHHHHHJHH I CHINESE INFRASTRUCTURE AHHHHHHHH ROOK OUT BEROWE AHHHHHHHH Insider Paper @TheInsiderPaper • 1d BREAKING: 758-metre-long Hongqi bridge collapses in southwest China, months after opening\n119 comments Sort by Top Top New Worst Old Save RuprechtThaMonkeyBoy 37 points 19 hours ago Sum ting Wong permalink award report block reply DelendaEstMarxismo 21 points 19 hours ago Bang Ding Ow permalink parent award report block reply zerk0021 12 points 19 hours ago Was that bridge one of the CCP's infamous  Tofu-Dreg Projects(豆腐渣工程)? permalink parent award report block reply YT45 8 points 18 hours ago Evidently yes. permalink parent award report block reply Standingoak 2 points 16 hours ago Tofu Mountain ,  American trained engineer OK.  Geologist SumTing  Wong to brame. permalink parent award report block reply Mintap 6 points 18 hours ago Wi tu lo permalink parent award report block reply TrumpYe2023 8 points 19 hours ago This is what happens to anything that bears the marking of MADE IN CHINA. permalink parent award report block reply Haiti_kid 7 points 19 hours ago Thats Capt. Sum Ting Wong mister! permalink parent award report block reply doodaddy 6 points 18 hours ago Ho Lee Fuk! permalink parent award report block reply SmartyPants 3 points 18 hours ago Wi tu lo permalink parent award report block reply Nate_Higgersalot 5 points 17 hours ago Ho Lee Fook Honorable mention: Wong Wei. permalink parent award report block reply here2red 33 points 19 hours ago thats what happens when you build outta cheap plastic permalink award report block reply nmipede 46 points 19 hours ago 100% pure Chinesium. permalink parent award report block reply YT45 17 points 18 hours ago The Chinese even have their own word for chinesium shit now.  It translates to “tofu dregs.” permalink parent award report block reply Pied-Trumper 3 points 18 hours ago I love tofu permalink parent award report block reply alfredbester 7 points 18 hours ago While good for soaking up flavor, it's probably not the first choice for bridge building among qualified engineers. permalink parent award report block reply XlDEN 14 points 18 hours ago “Made in China.” permalink parent award report block reply utfanx2 19 points 19 hours ago Garbage in; garbage out. Pot metal and slave labor is hot garbage. permalink parent award report block reply RuprechtThaMonkeyBoy 15 points 19 hours ago But it was a sidewalk sale and coupon was 20%. permalink parent award report block reply DeportThemAllForever 11 points 19 hours ago Most American products are China made, at best assembled in US.  That’s why everything sucks. permalink parent award report block reply ColonelKlink 5 points 18 hours ago Smartest people on the planet. /s permalink parent award report block reply load 2 more comments... slangin_paint 31 points 19 hours ago Me rubble rong time permalink award report block reply Sea_Still 31 points 19 hours ago temu bridges perform as expected permalink award report block reply Reefay 7 points 19 hours ago When you buy your bridge from wish.com permalink parent award report block reply KungPaoMcChicken 3 points 18 hours ago The bridge that Temu built... permalink parent award report block reply Flataxandmaga 17 points 19 hours ago Funniest meme I've seen in days.  \"Rook out berowe\" permalink award report block reply wartooth6 16 points 19 hours ago A relative of mine was one of the engineers from the USA that was sent to China to help survey the area where the 3 Gorges Dam was to be built.  The pleaded with the CCP not to build it there because of how unstable the rock is in the area.   Of course they didn't listen.  If it ever fails, millions will be doomed. permalink award report block reply SanityGumby 7 points 17 hours ago It’s been on the brink of failure for a while now. Eventually it’s just a pile of rocks and will wash away permalink parent award report block reply Zelda 5 points 17 hours ago Protip: it will fail permalink parent award report block reply Nerdrem3 5 points 13 hours ago I think the estimate is 3-500 million dead. permalink parent award report block reply CDean 15 points 19 hours ago Behold the superpower. permalink award report block reply SanityGumby 7 points 17 hours ago I love that talking point when they built a nuclear sub and it sank to the bottom as soon as it left port permalink parent award report block reply Powdered_Sugar 3 points 18 hours ago They're gonna overtake us any day now I tells ya. /s permalink parent award report block reply TearsAficionado 2 points 15 hours ago Oh! Deyuh havuh berry powufur astealtuh fighteruh...Mighty Dragon! permalink parent award report block reply OldZilla 14 points 19 hours ago Ho lee Fuk\nI took my ruv, I took it down\nCrimed a mountain and I tuhned awound\nAnd I saaaaawwww my refrection in the snow covuhd hirrs\n'Til the randsride brought me down🎶 permalink award report block reply Dcokes 6 points 18 hours ago Ahhhhh I rike Freetwood Mac permalink parent award report block reply Hanging_Chad OP 6 points 19 hours ago ‘Tir permalink parent award report block reply Haiti_kid 5 points 19 hours ago Exerrrent. permalink parent award report block reply Imthebest 13 points 18 hours ago It was a landslide... They closed it the day before it happened. permalink award report block reply stargunner 8 points 16 hours ago it was showing signs of failure before this. it was doomed to collapse. the landslide was just the nail in the coffin. permalink parent award report block reply breadbaker 7 points 16 hours ago Exactly. They built it on unstable soil. Only question is if the geotechnical people missed that or the engineers were ordered by politicians to ignore the issues. permalink parent award report block reply splink 6 points 15 hours ago Bribery and skimming are pretty rampant. permalink parent award report block reply monkadelic 3 points 16 hours ago Thats not as fun. permalink parent award report block reply fazaman 1 points 8 hours ago If only there was some way to tell that the ground there was unsuitable for a bridge to be built there, or at least in that fashion. Oh well! permalink parent award report block reply Aambrick 7 points 18 hours ago Was there anybody on it? permalink award report block reply Hanging_Chad OP 6 points 18 hours ago https://patriots.win/p/1ARK9mFaRn/x/c/4eXuKkzpHIP permalink parent award report block reply Aambrick 7 points 18 hours ago Thanks. At least no one was killed or hurt. permalink parent award report block reply Nibba2 6 points 18 hours ago I remember watching a documentary on this recently. The engineer in charge of anchoring the bridge I guess said the ground on both ends of it were terrible ground for a bridge. He said it was very soft and spongy and would fall apart easily. This is why they decided to use those towers at each end with cables that went far out behind them. I don’t remember them showing how they were anchored in the back. Looks like it wasn’t good there either, or sufficient. Or the pillars holding the initial bridge didn’t have such a good time on the soft ground. permalink award report block reply Zelda 3 points 17 hours ago Reminds me of Frank Lloyd’s falling waters. The contractor said f this and added extra rebar. FLW was pissed, but that rebar is the only reason it didn’t fall in already. permalink parent award report block reply Xahnel 6 points 18 hours ago Never ever trust the Chinese. permalink award report block reply GunsWithGooglyEyes 6 points 18 hours ago The bridge had covid. permalink award report block reply bobbacringo 6 points 17 hours ago They fail for the same reasons that India fails. Their culture is all about saving face, not producing results. permalink award report block reply Ryker 5 points 18 hours ago Maybe they need to go back to zip-lines like in Nepal. permalink award report block reply Mintap 5 points 18 hours ago Infrastructure is not for use in China, it is for money laundering. permalink award report block reply HillarysFUPA 5 points 19 hours ago They ordered it from temu permalink award report block reply TheFozz 5 points 14 hours ago Chinee Enginereee is Garbeeeeege. permalink award report block reply Steve1 4 points 18 hours ago Is that the one they just opened permalink award report block reply stargunner 3 points 16 hours ago yes it was only a few months old. and it was showing signs of failure before this. it was doomed to collapse. permalink parent award report block reply Urinetensions 4 points 18 hours ago DAAAAAAMMMMMNNNN Hongqui! permalink award report block reply Hanging_Chad OP 3 points 18 hours ago HONGQ HONGQ permalink parent award report block reply Reefay 4 points 19 hours ago That picture made me cry 🤣 permalink award report block reply The_Emperor 2 points 17 hours ago The music made me cry. permalink parent award report block reply Aggrieved03 4 points 17 hours ago That’s why we gotta bring them here cause we aren’t skilled enough to do shit. permalink award report block reply Aquamine-Amarine 4 points 18 hours ago Definitely not built by whoever built the Great Wall. permalink award report block reply splink 3 points 15 hours ago That would actually be the Mongolians. permalink parent award report block reply Powdered_Sugar 4 points 18 hours ago Chinesium strikes again. I hope no one was on the bridge when it collapsed. permalink award report block reply MAGAPlenty 4 points 17 hours ago Temu Bridge permalink award report block reply PhantomShield72 4 points 19 hours ago Sum Ting Wong permalink award report block reply MAGAnificent700 1 points 18 hours ago Ho Lee Shet permalink parent award report block reply MakeFloridaRed 4 points 19 hours ago City bridge, as (maybe) seen in south park. permalink award report block reply RYTHMICRIOT 4 points 15 hours ago https://x.com/LughSpear/status/1988261146890023190?t=BWhRm-FvUyJJwy8oSG7HHg&s=19 permalink award report block reply Hanging_Chad OP 3 points 15 hours ago very nice aqueduct bridge permalink parent award report block reply My2SonsAreMarines 3 points 17 hours ago The bridge is ~ a half mile long and looks like they lost about a third of it right there permalink award report block reply WhatsFappening 3 points 18 hours ago Oopsie. permalink award report block reply ImmaculateDeception 3 points 14 hours ago Strictly speaking, this is fake news...\nIt collapsed 44 days after opening, not months. permalink award report block reply Hanging_Chad OP 2 points 14 hours ago 1.5 months permalink parent award report block reply SavingPrivateGrace 3 points 19 hours ago Communism imploding. permalink award report block reply DeeeDay 3 points 18 hours ago The CCP can't stand the embarrassment, and you know people are gonna get clipped. permalink award report block reply wisconsingunner 3 points 13 hours ago Honky Bridge 🤣 permalink award report block reply WassermanSchultz 3 points 18 hours ago Fyi this isn't their new \"world's tallest bridge\" that just opened.  It's a different new bridge. permalink award report block reply Trumpy_Bear 3 points 18 hours ago So, this was a Chinese \"Lao-zi\" style bridge in the province of Guangdong. The authorities have already started investigating the Woo-Shu engineering agency responsible for the initial surveys and geo-statistical analysis. They're pointing out that one particular engineer Ching Chong failed to use the official General Tso Chicken logs for landslide probability. He was taken to Moo-Shu prison for interrogation. permalink award report block reply cd3dog 3 points 18 hours ago Oops.  A few more for the gulag. permalink award report block reply Pepbrandt 2 points 10 hours ago Videos like this are dangerous, they make us complacent. Visit China, you won't be laughing at what they've accomplished. permalink award report block reply Hanging_Chad OP 1 points 8 hours ago do they still have ghost cities? permalink parent award report block reply SBOJ_JOBS 1 points 5 hours ago Phrases like \"ghost cities\"  are dishonest and make us complacent. Yes there are \"cities\" filled with miles of huge building shells which remain unfinished and totally empty, but no ghosts live in them. Meanwhile, this bridge merely \"reconfigured\" itself. Pretty amazing, actually. Can your local bridge do that this quickly? permalink parent award report block reply Truth_Will_Prevail_2 2 points 11 hours ago What'd that boondoggle cost? permalink award report block reply FartOnLibtards 2 points 18 hours ago I know what MAGA wants... MAGA wants Chinese bridges in the USA! permalink award report block reply Hanging_Chad OP 4 points 18 hours ago tariff those bridges 9,001% permalink parent award report block reply QSWO1 2 points 15 hours ago Mexican built? permalink award report block reply tt777 2 points 8 hours ago And we're supposed to want 600,000 more of the type of people that create these bridges. permalink award report block reply chahn1138 2 points 9 hours ago TOFU! permalink award report block reply JanOctSept 2 points 18 hours ago The Hongqi bridge eh? Ok China I see your game. We should rename a bridge to Ching Chong Ding Dong bridge. permalink award report block reply Crapachino 2 points 12 hours ago Wasn't there another brand-new Chinese bridge collapsing just a few months ago... permalink award report block reply CareBear42 2 points 10 hours ago Yep, it is not the first bridge to collapse in the world, but having something as big as this to go down couple of months after it was finished, is not a good ad for the chinese construction industry. Too bad probably will never get the info of what the corruption:incompetance:bad luck proportions here. Knowing the chineese, officially it will be \"nothing wrong happened\", unofficially some mid level heads will roll, and the top dogs responsible may get scot-free Hope all the belt and road partners are taking notes. permalink award report block reply AR_MAGA 2 points 9 hours ago Another huge source of H1Bs that we forgot to mention here. permalink award report block reply freebirdie 1 points 4 hours ago Better bring 600k young ones over here to learn exactly what makes American bridges fail. 🙄 permalink award report block reply ltbadpuppy 1 points 7 hours ago Called it permalink award report block reply corntortilla 1 points 3 hours ago Fuck China and all that, but if you want to talk shit about their construction failures, you might want to remember we’ve had plenty of our own. permalink award report block reply Maximumheight 1 points 12 hours ago Caused by landslides due to a freak natural disaster unrelated to its engineering. Everyone settle down. permalink award report block reply RogueLeaderX 1 points 19 hours ago Not a Chinamans chance then? permalink award report block reply MAGAnificent700 1 points 18 hours ago Built by Sum Ting Wong. permalink award report block reply Mhmm2MoreWeeks 0 points 18 hours ago China has no Jews. permalink award report block reply JanOctSept 2 points 18 hours ago They’ll claim white people built it because it was named Hongqi bridge. permalink parent award report block reply NADSAQ 1 points 18 hours ago there were some in Mao’s inner circle permalink parent award report block reply An0n01A4 -3 points 18 hours ago Condolences to anyone who might have been caught up in that. I'm starting to get disappointed in the Morality of this place. This isn't exactly the type of moment to make jokes about. Flip it around and imagine China making fun of our airplane designs in regards to the UPS accident. permalink award report block reply Hanging_Chad OP 4 points 18 hours ago bridge was closed permalink parent award report block reply JoinTheDiscussion 1 points 15 hours ago An airplane design from almost the 60s?! Decades before China was even industrialized?! permalink parent award report block reply An0n01A4 1 points 5 hours ago And that changes the tragedy how?\nForget about the planes.\nImagine any one of our infrastructure builds crumbling due to any reason.  Then imagine other countries laughing at us for it. \"But, our infrastructure is...\" Yeah, whatever. I'm with everyone else on deporting and wanting to MAGA.  But taking joy and making comedy of things like this this errs on the side of evil.   There is no legitimate reason any of you have to hold so much personal hate against their attempts to improve their cities and living conditions, of which improving traffic falls squarely under those categories. While you on the other hand make fun of civilizations that still live in mud huts. You can't have it both ways.  Either you want other countries to improve and raise themselves up to the modern world or you don't.  Which is it? Success = People stay in their own countries. Failure = Lets invade America So laugh it up. https://en.wikipedia.org/wiki/List_of_building_and_structure_collapses You'll notice that the US is in that list... a few times. permalink parent award report block reply semsem 1 points 10 hours ago That, and the fact that- despite the press- the DC-10 and the MD-11 actually have a pretty unremarkable accident rate. The press has had a hard-on for tri-jet crashes for more than fifty years, for some damn reason- sort of like their breathless coverage of shark attacks. In the ocean. Near sandbars and river mouths. Where the sharks live and hunt. I'll spitball that it's down to there being lots of pictures and video of tri-jet crashes rather than any specific fixation on tri-jets themselves or any actual glut of tri-jet incidents. If Tenerife weren't in fog, or Northwest didn't manage to land their 74 with hard-over rudder, or the JAL that lost its whole vertical stab had flown into- say- Rainier instead of Fuji, or Pan Am 103 had blown up and rained debris in daylight instead of nighttime, the press would probably shit on the 747 as a  death trap instead to this day. Just depends on what can be endlessly looped for shock value and thoroughly ignorant voice-over commentary. It's telling that even on this last incident, press had on lawyers as experts, and consulted with pilots decades out of proficiency to the point that they claimed the MD-11 has a flight engineer. (For who don't get it, that's like going to a mechanic with your 2022 Toyota Camry and being told you need a new distributor and a carburetor rebuild, and he wants to teach you how to use the choke- for a nominal fee, of course. Instantly reveals he's either brazenly full of shit, or such a damn outdated graybeard that he hasn't kept up with current engineering and operation since before AMC ceased to be.) permalink parent award report block reply ciaramella_is_gay -7 points 19 hours ago LoL talk shit all you want but China has built out their country at a pretty fucking amazing pace. WHEN they want to build something to last, they can, but yeah, a lot of their shit is held together by some pretty sketchy ass construction. This country puts out more honor students than all students in america. You fucking love to talk shit, but they're kicking our asses because we're too busy trying to keep troons from killing us. permalink award report block reply mlp67 9 points 18 hours ago They cheat at everything,  especially school permalink parent award report block reply flashersenpai 7 points 19 hours ago This country puts out more honor students than all students in america. Construction quality is fatal, but education is top notch? Not true at all. permalink parent award report block reply 24601 6 points 18 hours ago Massive empty cities..... https://allthatsinteresting.com/chinese-ghost-cities China has done absolutely nothing useful on its own in the last 150 years.  Everything it has or has built is due to theft of technology, massive influx of foreign cash, and enslaved portions of the population based on party and religious affiliation. permalink parent award report block reply papagiorgio-g 6 points 19 hours ago For the last 35 years of my life, white American boys have been passed over for affirmative action hires in higher education and corporate hiring.   Look at what's happened to companies like Boeing?   Can't make anything decent now. America went to the moon with white engineers, white machinists, and white metallurgy. There is an intentional global white genocide going on right now. permalink parent award report block reply Hanging_Chad OP 4 points 19 hours ago send all troons to Pooh permalink parent award report block reply load 2 more comments...\nRuprechtThaMonkeyBoy 37 points 19 hours ago Sum ting Wong permalink award report block reply DelendaEstMarxismo 21 points 19 hours ago Bang Ding Ow permalink parent award report block reply zerk0021 12 points 19 hours ago Was that bridge one of the CCP's infamous  Tofu-Dreg Projects(豆腐渣工程)? permalink parent award report block reply YT45 8 points 18 hours ago Evidently yes. permalink parent award report block reply Standingoak 2 points 16 hours ago Tofu Mountain ,  American trained engineer OK.  Geologist SumTing  Wong to brame. permalink parent award report block reply Mintap 6 points 18 hours ago Wi tu lo permalink parent award report block reply TrumpYe2023 8 points 19 hours ago This is what happens to anything that bears the marking of MADE IN CHINA. permalink parent award report block reply Haiti_kid 7 points 19 hours ago Thats Capt. Sum Ting Wong mister! permalink parent award report block reply doodaddy 6 points 18 hours ago Ho Lee Fuk! permalink parent award report block reply SmartyPants 3 points 18 hours ago Wi tu lo permalink parent award report block reply Nate_Higgersalot 5 points 17 hours ago Ho Lee Fook Honorable mention: Wong Wei. permalink parent award report block reply\nDelendaEstMarxismo 21 points 19 hours ago Bang Ding Ow permalink parent award report block reply zerk0021 12 points 19 hours ago Was that bridge one of the CCP's infamous  Tofu-Dreg Projects(豆腐渣工程)? permalink parent award report block reply YT45 8 points 18 hours ago Evidently yes. permalink parent award report block reply Standingoak 2 points 16 hours ago Tofu Mountain ,  American trained engineer OK.  Geologist SumTing  Wong to brame. permalink parent award report block reply Mintap 6 points 18 hours ago Wi tu lo permalink parent award report block reply\nzerk0021 12 points 19 hours ago Was that bridge one of the CCP's infamous  Tofu-Dreg Projects(豆腐渣工程)? permalink parent award report block reply YT45 8 points 18 hours ago Evidently yes. permalink parent award report block reply Standingoak 2 points 16 hours ago Tofu Mountain ,  American trained engineer OK.  Geologist SumTing  Wong to brame. permalink parent award report block reply\nYT45 8 points 18 hours ago Evidently yes. permalink parent award report block reply\nStandingoak 2 points 16 hours ago Tofu Mountain ,  American trained engineer OK.  Geologist SumTing  Wong to brame. permalink parent award report block reply\nMintap 6 points 18 hours ago Wi tu lo permalink parent award report block reply\nTrumpYe2023 8 points 19 hours ago This is what happens to anything that bears the marking of MADE IN CHINA. permalink parent award report block reply\nHaiti_kid 7 points 19 hours ago Thats Capt. Sum Ting Wong mister! permalink parent award report block reply doodaddy 6 points 18 hours ago Ho Lee Fuk! permalink parent award report block reply SmartyPants 3 points 18 hours ago Wi tu lo permalink parent award report block reply\ndoodaddy 6 points 18 hours ago Ho Lee Fuk! permalink parent award report block reply SmartyPants 3 points 18 hours ago Wi tu lo permalink parent award report block reply\nSmartyPants 3 points 18 hours ago Wi tu lo permalink parent award report block reply\nNate_Higgersalot 5 points 17 hours ago Ho Lee Fook Honorable mention: Wong Wei. permalink parent award report block reply\nhere2red 33 points 19 hours ago thats what happens when you build outta cheap plastic permalink award report block reply nmipede 46 points 19 hours ago 100% pure Chinesium. permalink parent award report block reply YT45 17 points 18 hours ago The Chinese even have their own word for chinesium shit now.  It translates to “tofu dregs.” permalink parent award report block reply Pied-Trumper 3 points 18 hours ago I love tofu permalink parent award report block reply alfredbester 7 points 18 hours ago While good for soaking up flavor, it's probably not the first choice for bridge building among qualified engineers. permalink parent award report block reply XlDEN 14 points 18 hours ago “Made in China.” permalink parent award report block reply utfanx2 19 points 19 hours ago Garbage in; garbage out. Pot metal and slave labor is hot garbage. permalink parent award report block reply RuprechtThaMonkeyBoy 15 points 19 hours ago But it was a sidewalk sale and coupon was 20%. permalink parent award report block reply DeportThemAllForever 11 points 19 hours ago Most American products are China made, at best assembled in US.  That’s why everything sucks. permalink parent award report block reply ColonelKlink 5 points 18 hours ago Smartest people on the planet. /s permalink parent award report block reply load 2 more comments...\nnmipede 46 points 19 hours ago 100% pure Chinesium. permalink parent award report block reply YT45 17 points 18 hours ago The Chinese even have their own word for chinesium shit now.  It translates to “tofu dregs.” permalink parent award report block reply Pied-Trumper 3 points 18 hours ago I love tofu permalink parent award report block reply alfredbester 7 points 18 hours ago While good for soaking up flavor, it's probably not the first choice for bridge building among qualified engineers. permalink parent award report block reply XlDEN 14 points 18 hours ago “Made in China.” permalink parent award report block reply\nYT45 17 points 18 hours ago The Chinese even have their own word for chinesium shit now.  It translates to “tofu dregs.” permalink parent award report block reply Pied-Trumper 3 points 18 hours ago I love tofu permalink parent award report block reply alfredbester 7 points 18 hours ago While good for soaking up flavor, it's probably not the first choice for bridge building among qualified engineers. permalink parent award report block reply\nPied-Trumper 3 points 18 hours ago I love tofu permalink parent award report block reply alfredbester 7 points 18 hours ago While good for soaking up flavor, it's probably not the first choice for bridge building among qualified engineers. permalink parent award report block reply\nalfredbester 7 points 18 hours ago While good for soaking up flavor, it's probably not the first choice for bridge building among qualified engineers. permalink parent award report block reply\nXlDEN 14 points 18 hours ago “Made in China.” permalink parent award report block reply\nutfanx2 19 points 19 hours ago Garbage in; garbage out. Pot metal and slave labor is hot garbage. permalink parent award report block reply\nRuprechtThaMonkeyBoy 15 points 19 hours ago But it was a sidewalk sale and coupon was 20%. permalink parent award report block reply\nDeportThemAllForever 11 points 19 hours ago Most American products are China made, at best assembled in US.  That’s why everything sucks. permalink parent award report block reply\nColonelKlink 5 points 18 hours ago Smartest people on the planet. /s permalink parent award report block reply\nslangin_paint 31 points 19 hours ago Me rubble rong time permalink award report block reply\nSea_Still 31 points 19 hours ago temu bridges perform as expected permalink award report block reply Reefay 7 points 19 hours ago When you buy your bridge from wish.com permalink parent award report block reply KungPaoMcChicken 3 points 18 hours ago The bridge that Temu built... permalink parent award report block reply\nReefay 7 points 19 hours ago When you buy your bridge from wish.com permalink parent award report block reply\nKungPaoMcChicken 3 points 18 hours ago The bridge that Temu built... permalink parent award report block reply\nFlataxandmaga 17 points 19 hours ago Funniest meme I've seen in days.  \"Rook out berowe\" permalink award report block reply\nwartooth6 16 points 19 hours ago A relative of mine was one of the engineers from the USA that was sent to China to help survey the area where the 3 Gorges Dam was to be built.  The pleaded with the CCP not to build it there because of how unstable the rock is in the area.   Of course they didn't listen.  If it ever fails, millions will be doomed. permalink award report block reply SanityGumby 7 points 17 hours ago It’s been on the brink of failure for a while now. Eventually it’s just a pile of rocks and will wash away permalink parent award report block reply Zelda 5 points 17 hours ago Protip: it will fail permalink parent award report block reply Nerdrem3 5 points 13 hours ago I think the estimate is 3-500 million dead. permalink parent award report block reply\nSanityGumby 7 points 17 hours ago It’s been on the brink of failure for a while now. Eventually it’s just a pile of rocks and will wash away permalink parent award report block reply\nZelda 5 points 17 hours ago Protip: it will fail permalink parent award report block reply\nNerdrem3 5 points 13 hours ago I think the estimate is 3-500 million dead. permalink parent award report block reply\nCDean 15 points 19 hours ago Behold the superpower. permalink award report block reply SanityGumby 7 points 17 hours ago I love that talking point when they built a nuclear sub and it sank to the bottom as soon as it left port permalink parent award report block reply Powdered_Sugar 3 points 18 hours ago They're gonna overtake us any day now I tells ya. /s permalink parent award report block reply TearsAficionado 2 points 15 hours ago Oh! Deyuh havuh berry powufur astealtuh fighteruh...Mighty Dragon! permalink parent award report block reply\nSanityGumby 7 points 17 hours ago I love that talking point when they built a nuclear sub and it sank to the bottom as soon as it left port permalink parent award report block reply\nPowdered_Sugar 3 points 18 hours ago They're gonna overtake us any day now I tells ya. /s permalink parent award report block reply TearsAficionado 2 points 15 hours ago Oh! Deyuh havuh berry powufur astealtuh fighteruh...Mighty Dragon! permalink parent award report block reply\nTearsAficionado 2 points 15 hours ago Oh! Deyuh havuh berry powufur astealtuh fighteruh...Mighty Dragon! permalink parent award report block reply\nOldZilla 14 points 19 hours ago Ho lee Fuk\nI took my ruv, I took it down\nCrimed a mountain and I tuhned awound\nAnd I saaaaawwww my refrection in the snow covuhd hirrs\n'Til the randsride brought me down🎶 permalink award report block reply Dcokes 6 points 18 hours ago Ahhhhh I rike Freetwood Mac permalink parent award report block reply Hanging_Chad OP 6 points 19 hours ago ‘Tir permalink parent award report block reply Haiti_kid 5 points 19 hours ago Exerrrent. permalink parent award report block reply\nDcokes 6 points 18 hours ago Ahhhhh I rike Freetwood Mac permalink parent award report block reply\nHanging_Chad OP 6 points 19 hours ago ‘Tir permalink parent award report block reply\nHaiti_kid 5 points 19 hours ago Exerrrent. permalink parent award report block reply\nImthebest 13 points 18 hours ago It was a landslide... They closed it the day before it happened. permalink award report block reply stargunner 8 points 16 hours ago it was showing signs of failure before this. it was doomed to collapse. the landslide was just the nail in the coffin. permalink parent award report block reply breadbaker 7 points 16 hours ago Exactly. They built it on unstable soil. Only question is if the geotechnical people missed that or the engineers were ordered by politicians to ignore the issues. permalink parent award report block reply splink 6 points 15 hours ago Bribery and skimming are pretty rampant. permalink parent award report block reply monkadelic 3 points 16 hours ago Thats not as fun. permalink parent award report block reply fazaman 1 points 8 hours ago If only there was some way to tell that the ground there was unsuitable for a bridge to be built there, or at least in that fashion. Oh well! permalink parent award report block reply\nstargunner 8 points 16 hours ago it was showing signs of failure before this. it was doomed to collapse. the landslide was just the nail in the coffin. permalink parent award report block reply\nbreadbaker 7 points 16 hours ago Exactly. They built it on unstable soil. Only question is if the geotechnical people missed that or the engineers were ordered by politicians to ignore the issues. permalink parent award report block reply splink 6 points 15 hours ago Bribery and skimming are pretty rampant. permalink parent award report block reply\nsplink 6 points 15 hours ago Bribery and skimming are pretty rampant. permalink parent award report block reply\nmonkadelic 3 points 16 hours ago Thats not as fun. permalink parent award report block reply\nfazaman 1 points 8 hours ago If only there was some way to tell that the ground there was unsuitable for a bridge to be built there, or at least in that fashion. Oh well! permalink parent award report block reply\nAambrick 7 points 18 hours ago Was there anybody on it? permalink award report block reply Hanging_Chad OP 6 points 18 hours ago https://patriots.win/p/1ARK9mFaRn/x/c/4eXuKkzpHIP permalink parent award report block reply Aambrick 7 points 18 hours ago Thanks. At least no one was killed or hurt. permalink parent award report block reply\nHanging_Chad OP 6 points 18 hours ago https://patriots.win/p/1ARK9mFaRn/x/c/4eXuKkzpHIP permalink parent award report block reply Aambrick 7 points 18 hours ago Thanks. At least no one was killed or hurt. permalink parent award report block reply\nAambrick 7 points 18 hours ago Thanks. At least no one was killed or hurt. permalink parent award report block reply\nNibba2 6 points 18 hours ago I remember watching a documentary on this recently. The engineer in charge of anchoring the bridge I guess said the ground on both ends of it were terrible ground for a bridge. He said it was very soft and spongy and would fall apart easily. This is why they decided to use those towers at each end with cables that went far out behind them. I don’t remember them showing how they were anchored in the back. Looks like it wasn’t good there either, or sufficient. Or the pillars holding the initial bridge didn’t have such a good time on the soft ground. permalink award report block reply Zelda 3 points 17 hours ago Reminds me of Frank Lloyd’s falling waters. The contractor said f this and added extra rebar. FLW was pissed, but that rebar is the only reason it didn’t fall in already. permalink parent award report block reply\nZelda 3 points 17 hours ago Reminds me of Frank Lloyd’s falling waters. The contractor said f this and added extra rebar. FLW was pissed, but that rebar is the only reason it didn’t fall in already. permalink parent award report block reply\nXahnel 6 points 18 hours ago Never ever trust the Chinese. permalink award report block reply\nGunsWithGooglyEyes 6 points 18 hours ago The bridge had covid. permalink award report block reply\nbobbacringo 6 points 17 hours ago They fail for the same reasons that India fails. Their culture is all about saving face, not producing results. permalink award report block reply\nRyker 5 points 18 hours ago Maybe they need to go back to zip-lines like in Nepal. permalink award report block reply\nMintap 5 points 18 hours ago Infrastructure is not for use in China, it is for money laundering. permalink award report block reply\nHillarysFUPA 5 points 19 hours ago They ordered it from temu permalink award report block reply\nTheFozz 5 points 14 hours ago Chinee Enginereee is Garbeeeeege. permalink award report block reply\nSteve1 4 points 18 hours ago Is that the one they just opened permalink award report block reply stargunner 3 points 16 hours ago yes it was only a few months old. and it was showing signs of failure before this. it was doomed to collapse. permalink parent award report block reply\nstargunner 3 points 16 hours ago yes it was only a few months old. and it was showing signs of failure before this. it was doomed to collapse. permalink parent award report block reply\nUrinetensions 4 points 18 hours ago DAAAAAAMMMMMNNNN Hongqui! permalink award report block reply Hanging_Chad OP 3 points 18 hours ago HONGQ HONGQ permalink parent award report block reply\nHanging_Chad OP 3 points 18 hours ago HONGQ HONGQ permalink parent award report block reply\nReefay 4 points 19 hours ago That picture made me cry 🤣 permalink award report block reply The_Emperor 2 points 17 hours ago The music made me cry. permalink parent award report block reply\nThe_Emperor 2 points 17 hours ago The music made me cry. permalink parent award report block reply\nAggrieved03 4 points 17 hours ago That’s why we gotta bring them here cause we aren’t skilled enough to do shit. permalink award report block reply\nAquamine-Amarine 4 points 18 hours ago Definitely not built by whoever built the Great Wall. permalink award report block reply splink 3 points 15 hours ago That would actually be the Mongolians. permalink parent award report block reply\nsplink 3 points 15 hours ago That would actually be the Mongolians. permalink parent award report block reply\nPowdered_Sugar 4 points 18 hours ago Chinesium strikes again. I hope no one was on the bridge when it collapsed. permalink award report block reply\nMAGAPlenty 4 points 17 hours ago Temu Bridge permalink award report block reply\nPhantomShield72 4 points 19 hours ago Sum Ting Wong permalink award report block reply MAGAnificent700 1 points 18 hours ago Ho Lee Shet permalink parent award report block reply\nMAGAnificent700 1 points 18 hours ago Ho Lee Shet permalink parent award report block reply\nMakeFloridaRed 4 points 19 hours ago City bridge, as (maybe) seen in south park. permalink award report block reply\nRYTHMICRIOT 4 points 15 hours ago https://x.com/LughSpear/status/1988261146890023190?t=BWhRm-FvUyJJwy8oSG7HHg&s=19 permalink award report block reply Hanging_Chad OP 3 points 15 hours ago very nice aqueduct bridge permalink parent award report block reply\nHanging_Chad OP 3 points 15 hours ago very nice aqueduct bridge permalink parent award report block reply\nMy2SonsAreMarines 3 points 17 hours ago The bridge is ~ a half mile long and looks like they lost about a third of it right there permalink award report block reply\nWhatsFappening 3 points 18 hours ago Oopsie. permalink award report block reply\nImmaculateDeception 3 points 14 hours ago Strictly speaking, this is fake news...\nIt collapsed 44 days after opening, not months. permalink award report block reply Hanging_Chad OP 2 points 14 hours ago 1.5 months permalink parent award report block reply\nHanging_Chad OP 2 points 14 hours ago 1.5 months permalink parent award report block reply\nSavingPrivateGrace 3 points 19 hours ago Communism imploding. permalink award report block reply\nDeeeDay 3 points 18 hours ago The CCP can't stand the embarrassment, and you know people are gonna get clipped. permalink award report block reply\nwisconsingunner 3 points 13 hours ago Honky Bridge 🤣 permalink award report block reply\nWassermanSchultz 3 points 18 hours ago Fyi this isn't their new \"world's tallest bridge\" that just opened.  It's a different new bridge. permalink award report block reply\nTrumpy_Bear 3 points 18 hours ago So, this was a Chinese \"Lao-zi\" style bridge in the province of Guangdong. The authorities have already started investigating the Woo-Shu engineering agency responsible for the initial surveys and geo-statistical analysis. They're pointing out that one particular engineer Ching Chong failed to use the official General Tso Chicken logs for landslide probability. He was taken to Moo-Shu prison for interrogation. permalink award report block reply\ncd3dog 3 points 18 hours ago Oops.  A few more for the gulag. permalink award report block reply\nPepbrandt 2 points 10 hours ago Videos like this are dangerous, they make us complacent. Visit China, you won't be laughing at what they've accomplished. permalink award report block reply Hanging_Chad OP 1 points 8 hours ago do they still have ghost cities? permalink parent award report block reply SBOJ_JOBS 1 points 5 hours ago Phrases like \"ghost cities\"  are dishonest and make us complacent. Yes there are \"cities\" filled with miles of huge building shells which remain unfinished and totally empty, but no ghosts live in them. Meanwhile, this bridge merely \"reconfigured\" itself. Pretty amazing, actually. Can your local bridge do that this quickly? permalink parent award report block reply\nHanging_Chad OP 1 points 8 hours ago do they still have ghost cities? permalink parent award report block reply SBOJ_JOBS 1 points 5 hours ago Phrases like \"ghost cities\"  are dishonest and make us complacent. Yes there are \"cities\" filled with miles of huge building shells which remain unfinished and totally empty, but no ghosts live in them. Meanwhile, this bridge merely \"reconfigured\" itself. Pretty amazing, actually. Can your local bridge do that this quickly? permalink parent award report block reply\nSBOJ_JOBS 1 points 5 hours ago Phrases like \"ghost cities\"  are dishonest and make us complacent. Yes there are \"cities\" filled with miles of huge building shells which remain unfinished and totally empty, but no ghosts live in them. Meanwhile, this bridge merely \"reconfigured\" itself. Pretty amazing, actually. Can your local bridge do that this quickly? permalink parent award report block reply\nTruth_Will_Prevail_2 2 points 11 hours ago What'd that boondoggle cost? permalink award report block reply\nFartOnLibtards 2 points 18 hours ago I know what MAGA wants... MAGA wants Chinese bridges in the USA! permalink award report block reply Hanging_Chad OP 4 points 18 hours ago tariff those bridges 9,001% permalink parent award report block reply\nHanging_Chad OP 4 points 18 hours ago tariff those bridges 9,001% permalink parent award report block reply\nQSWO1 2 points 15 hours ago Mexican built? permalink award report block reply\ntt777 2 points 8 hours ago And we're supposed to want 600,000 more of the type of people that create these bridges. permalink award report block reply\nchahn1138 2 points 9 hours ago TOFU! permalink award report block reply\nJanOctSept 2 points 18 hours ago The Hongqi bridge eh? Ok China I see your game. We should rename a bridge to Ching Chong Ding Dong bridge. permalink award report block reply\nCrapachino 2 points 12 hours ago Wasn't there another brand-new Chinese bridge collapsing just a few months ago... permalink award report block reply\nCareBear42 2 points 10 hours ago Yep, it is not the first bridge to collapse in the world, but having something as big as this to go down couple of months after it was finished, is not a good ad for the chinese construction industry. Too bad probably will never get the info of what the corruption:incompetance:bad luck proportions here. Knowing the chineese, officially it will be \"nothing wrong happened\", unofficially some mid level heads will roll, and the top dogs responsible may get scot-free Hope all the belt and road partners are taking notes. permalink award report block reply\nAR_MAGA 2 points 9 hours ago Another huge source of H1Bs that we forgot to mention here. permalink award report block reply\nfreebirdie 1 points 4 hours ago Better bring 600k young ones over here to learn exactly what makes American bridges fail. 🙄 permalink award report block reply\nltbadpuppy 1 points 7 hours ago Called it permalink award report block reply\ncorntortilla 1 points 3 hours ago Fuck China and all that, but if you want to talk shit about their construction failures, you might want to remember we’ve had plenty of our own. permalink award report block reply\nMaximumheight 1 points 12 hours ago Caused by landslides due to a freak natural disaster unrelated to its engineering. Everyone settle down. permalink award report block reply\nRogueLeaderX 1 points 19 hours ago Not a Chinamans chance then? permalink award report block reply\nMAGAnificent700 1 points 18 hours ago Built by Sum Ting Wong. permalink award report block reply\nMhmm2MoreWeeks 0 points 18 hours ago China has no Jews. permalink award report block reply JanOctSept 2 points 18 hours ago They’ll claim white people built it because it was named Hongqi bridge. permalink parent award report block reply NADSAQ 1 points 18 hours ago there were some in Mao’s inner circle permalink parent award report block reply\nJanOctSept 2 points 18 hours ago They’ll claim white people built it because it was named Hongqi bridge. permalink parent award report block reply\nNADSAQ 1 points 18 hours ago there were some in Mao’s inner circle permalink parent award report block reply\nAn0n01A4 -3 points 18 hours ago Condolences to anyone who might have been caught up in that. I'm starting to get disappointed in the Morality of this place. This isn't exactly the type of moment to make jokes about. Flip it around and imagine China making fun of our airplane designs in regards to the UPS accident. permalink award report block reply Hanging_Chad OP 4 points 18 hours ago bridge was closed permalink parent award report block reply JoinTheDiscussion 1 points 15 hours ago An airplane design from almost the 60s?! Decades before China was even industrialized?! permalink parent award report block reply An0n01A4 1 points 5 hours ago And that changes the tragedy how?\nForget about the planes.\nImagine any one of our infrastructure builds crumbling due to any reason.  Then imagine other countries laughing at us for it. \"But, our infrastructure is...\" Yeah, whatever. I'm with everyone else on deporting and wanting to MAGA.  But taking joy and making comedy of things like this this errs on the side of evil.   There is no legitimate reason any of you have to hold so much personal hate against their attempts to improve their cities and living conditions, of which improving traffic falls squarely under those categories. While you on the other hand make fun of civilizations that still live in mud huts. You can't have it both ways.  Either you want other countries to improve and raise themselves up to the modern world or you don't.  Which is it? Success = People stay in their own countries. Failure = Lets invade America So laugh it up. https://en.wikipedia.org/wiki/List_of_building_and_structure_collapses You'll notice that the US is in that list... a few times. permalink parent award report block reply semsem 1 points 10 hours ago That, and the fact that- despite the press- the DC-10 and the MD-11 actually have a pretty unremarkable accident rate. The press has had a hard-on for tri-jet crashes for more than fifty years, for some damn reason- sort of like their breathless coverage of shark attacks. In the ocean. Near sandbars and river mouths. Where the sharks live and hunt. I'll spitball that it's down to there being lots of pictures and video of tri-jet crashes rather than any specific fixation on tri-jets themselves or any actual glut of tri-jet incidents. If Tenerife weren't in fog, or Northwest didn't manage to land their 74 with hard-over rudder, or the JAL that lost its whole vertical stab had flown into- say- Rainier instead of Fuji, or Pan Am 103 had blown up and rained debris in daylight instead of nighttime, the press would probably shit on the 747 as a  death trap instead to this day. Just depends on what can be endlessly looped for shock value and thoroughly ignorant voice-over commentary. It's telling that even on this last incident, press had on lawyers as experts, and consulted with pilots decades out of proficiency to the point that they claimed the MD-11 has a flight engineer. (For who don't get it, that's like going to a mechanic with your 2022 Toyota Camry and being told you need a new distributor and a carburetor rebuild, and he wants to teach you how to use the choke- for a nominal fee, of course. Instantly reveals he's either brazenly full of shit, or such a damn outdated graybeard that he hasn't kept up with current engineering and operation since before AMC ceased to be.) permalink parent award report block reply\nHanging_Chad OP 4 points 18 hours ago bridge was closed permalink parent award report block reply\nJoinTheDiscussion 1 points 15 hours ago An airplane design from almost the 60s?! Decades before China was even industrialized?! permalink parent award report block reply An0n01A4 1 points 5 hours ago And that changes the tragedy how?\nForget about the planes.\nImagine any one of our infrastructure builds crumbling due to any reason.  Then imagine other countries laughing at us for it. \"But, our infrastructure is...\" Yeah, whatever. I'm with everyone else on deporting and wanting to MAGA.  But taking joy and making comedy of things like this this errs on the side of evil.   There is no legitimate reason any of you have to hold so much personal hate against their attempts to improve their cities and living conditions, of which improving traffic falls squarely under those categories. While you on the other hand make fun of civilizations that still live in mud huts. You can't have it both ways.  Either you want other countries to improve and raise themselves up to the modern world or you don't.  Which is it? Success = People stay in their own countries. Failure = Lets invade America So laugh it up. https://en.wikipedia.org/wiki/List_of_building_and_structure_collapses You'll notice that the US is in that list... a few times. permalink parent award report block reply semsem 1 points 10 hours ago That, and the fact that- despite the press- the DC-10 and the MD-11 actually have a pretty unremarkable accident rate. The press has had a hard-on for tri-jet crashes for more than fifty years, for some damn reason- sort of like their breathless coverage of shark attacks. In the ocean. Near sandbars and river mouths. Where the sharks live and hunt. I'll spitball that it's down to there being lots of pictures and video of tri-jet crashes rather than any specific fixation on tri-jets themselves or any actual glut of tri-jet incidents. If Tenerife weren't in fog, or Northwest didn't manage to land their 74 with hard-over rudder, or the JAL that lost its whole vertical stab had flown into- say- Rainier instead of Fuji, or Pan Am 103 had blown up and rained debris in daylight instead of nighttime, the press would probably shit on the 747 as a  death trap instead to this day. Just depends on what can be endlessly looped for shock value and thoroughly ignorant voice-over commentary. It's telling that even on this last incident, press had on lawyers as experts, and consulted with pilots decades out of proficiency to the point that they claimed the MD-11 has a flight engineer. (For who don't get it, that's like going to a mechanic with your 2022 Toyota Camry and being told you need a new distributor and a carburetor rebuild, and he wants to teach you how to use the choke- for a nominal fee, of course. Instantly reveals he's either brazenly full of shit, or such a damn outdated graybeard that he hasn't kept up with current engineering and operation since before AMC ceased to be.) permalink parent award report block reply\nAn0n01A4 1 points 5 hours ago And that changes the tragedy how?\nForget about the planes.\nImagine any one of our infrastructure builds crumbling due to any reason.  Then imagine other countries laughing at us for it. \"But, our infrastructure is...\" Yeah, whatever. I'm with everyone else on deporting and wanting to MAGA.  But taking joy and making comedy of things like this this errs on the side of evil.   There is no legitimate reason any of you have to hold so much personal hate against their attempts to improve their cities and living conditions, of which improving traffic falls squarely under those categories. While you on the other hand make fun of civilizations that still live in mud huts. You can't have it both ways.  Either you want other countries to improve and raise themselves up to the modern world or you don't.  Which is it? Success = People stay in their own countries. Failure = Lets invade America So laugh it up. https://en.wikipedia.org/wiki/List_of_building_and_structure_collapses You'll notice that the US is in that list... a few times. permalink parent award report block reply\nsemsem 1 points 10 hours ago That, and the fact that- despite the press- the DC-10 and the MD-11 actually have a pretty unremarkable accident rate. The press has had a hard-on for tri-jet crashes for more than fifty years, for some damn reason- sort of like their breathless coverage of shark attacks. In the ocean. Near sandbars and river mouths. Where the sharks live and hunt. I'll spitball that it's down to there being lots of pictures and video of tri-jet crashes rather than any specific fixation on tri-jets themselves or any actual glut of tri-jet incidents. If Tenerife weren't in fog, or Northwest didn't manage to land their 74 with hard-over rudder, or the JAL that lost its whole vertical stab had flown into- say- Rainier instead of Fuji, or Pan Am 103 had blown up and rained debris in daylight instead of nighttime, the press would probably shit on the 747 as a  death trap instead to this day. Just depends on what can be endlessly looped for shock value and thoroughly ignorant voice-over commentary. It's telling that even on this last incident, press had on lawyers as experts, and consulted with pilots decades out of proficiency to the point that they claimed the MD-11 has a flight engineer. (For who don't get it, that's like going to a mechanic with your 2022 Toyota Camry and being told you need a new distributor and a carburetor rebuild, and he wants to teach you how to use the choke- for a nominal fee, of course. Instantly reveals he's either brazenly full of shit, or such a damn outdated graybeard that he hasn't kept up with current engineering and operation since before AMC ceased to be.) permalink parent award report block reply\nciaramella_is_gay -7 points 19 hours ago LoL talk shit all you want but China has built out their country at a pretty fucking amazing pace. WHEN they want to build something to last, they can, but yeah, a lot of their shit is held together by some pretty sketchy ass construction. This country puts out more honor students than all students in america. You fucking love to talk shit, but they're kicking our asses because we're too busy trying to keep troons from killing us. permalink award report block reply mlp67 9 points 18 hours ago They cheat at everything,  especially school permalink parent award report block reply flashersenpai 7 points 19 hours ago This country puts out more honor students than all students in america. Construction quality is fatal, but education is top notch? Not true at all. permalink parent award report block reply 24601 6 points 18 hours ago Massive empty cities..... https://allthatsinteresting.com/chinese-ghost-cities China has done absolutely nothing useful on its own in the last 150 years.  Everything it has or has built is due to theft of technology, massive influx of foreign cash, and enslaved portions of the population based on party and religious affiliation. permalink parent award report block reply papagiorgio-g 6 points 19 hours ago For the last 35 years of my life, white American boys have been passed over for affirmative action hires in higher education and corporate hiring.   Look at what's happened to companies like Boeing?   Can't make anything decent now. America went to the moon with white engineers, white machinists, and white metallurgy. There is an intentional global white genocide going on right now. permalink parent award report block reply Hanging_Chad OP 4 points 19 hours ago send all troons to Pooh permalink parent award report block reply load 2 more comments...\nmlp67 9 points 18 hours ago They cheat at everything,  especially school permalink parent award report block reply\nflashersenpai 7 points 19 hours ago This country puts out more honor students than all students in america. Construction quality is fatal, but education is top notch? Not true at all. permalink parent award report block reply\n24601 6 points 18 hours ago Massive empty cities..... https://allthatsinteresting.com/chinese-ghost-cities China has done absolutely nothing useful on its own in the last 150 years.  Everything it has or has built is due to theft of technology, massive influx of foreign cash, and enslaved portions of the population based on party and religious affiliation. permalink parent award report block reply\npapagiorgio-g 6 points 19 hours ago For the last 35 years of my life, white American boys have been passed over for affirmative action hires in higher education and corporate hiring.   Look at what's happened to companies like Boeing?   Can't make anything decent now. America went to the moon with white engineers, white machinists, and white metallurgy. There is an intentional global white genocide going on right now. permalink parent award report block reply\nHanging_Chad OP 4 points 19 hours ago send all troons to Pooh permalink parent award report block reply"}