{"id": "1ARK9pghDZ", "contents": "53 Thomas Massie demands release of sexual abuse files....just not these Congressional slush fund files used to protect his friends (nypost.com) posted 1 hour ago by Whoopies_tds 4 comments award share report block GOP lawmakers demand release of $17M ‘congressional sexual slush fund list’ Since 1997, the Office of Congressional Workplace Rights has paid out more than $17 million in public money to settle nearly 300 cases of workplace disputes at the US Capitol – including claims rel… nypost.com\n4 comments Sort by Top Top New Worst Old Save Around the Web 5 Parasite Causing Foods You Should Stop Eating Right Now Paratoxil OrangeManNotBad 3 points 50 minutes ago Must be getting close to midterm elections.  This topic again and nothing will happen. permalink award report block reply Bullet3250 3 points 44 minutes ago It's not like they are Trump and Stormy D. permalink award report block reply Throwingway22 2 points 10 minutes ago If only Massie wasn't an insufferable shit. He might have allies. He might be able to get anything, even just one thing in his entire career, accomplished. But then he wouldn't be Thomas Massie. permalink award report block reply TakingCoatsWIN 1 points 2 minutes ago Where does Massie stand on H1b? Libertarians are mass migration globalists. permalink award report block reply\nOrangeManNotBad 3 points 50 minutes ago Must be getting close to midterm elections.  This topic again and nothing will happen. permalink award report block reply\nBullet3250 3 points 44 minutes ago It's not like they are Trump and Stormy D. permalink award report block reply\nThrowingway22 2 points 10 minutes ago If only Massie wasn't an insufferable shit. He might have allies. He might be able to get anything, even just one thing in his entire career, accomplished. But then he wouldn't be Thomas Massie. permalink award report block reply\nTakingCoatsWIN 1 points 2 minutes ago Where does Massie stand on H1b? Libertarians are mass migration globalists. permalink award report block reply"}