{"id": "1ARK9oYZsW", "contents": "71 \"13% of Incoming College Freshman CANNOT DO MATH at even a 1st Grade Level\" so how are they getting into college at all? Time for admissions to have integrity again (halturnerradioshow.com) SAVE AMERICA posted 13 hours ago by CleanUpPhillyTrump24 17 comments award share report block 13% of Incoming College Freshman CANNOT DO MATH at even a 1st Grade Level! The University of California at San Diego has released a new report documenting a “steep decline in the academic preparedness” of its freshmen. The... halturnerradioshow.com\n17 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Raetchel 15 points 13 hours ago 13% you say permalink award report block reply imnotdeadyet 4 points 12 hours ago And they are all probably on free rides. permalink parent award report block reply Raetchel 2 points 12 hours ago they do basketball and football though permalink parent award report block reply possibletower -2 points 11 hours ago Yet retarded faggots here are outraged when Trump says many young Americans are not talented enough to do the factory and tech jobs that will be coming back to America for the first time since the 1980s-90s. Why do these retarded faggots laugh at young Americans for factually being illiterate in math/science/reading but get faux outraged at Trump for fucking spilling facts on the state of our youth today? permalink parent award report block reply Jack_NC 2 points 11 hours ago well, well, well... permalink parent award report block reply possibletower 0 points 11 hours ago Yet retarded faggots here are outraged when Trump says many young Americans are not talented enough to do the factory and tech jobs that will be coming back to America for the first time since the 1980s-90s. Why do these retarded faggots laugh at young Americans for factually being illiterate in math/science/reading but get faux outraged at Trump for fucking spilling facts on the state of our youth today? permalink parent award report block reply Filo76 9 points 13 hours ago No idea why college$ are doing thi$. I’m $tumped. $eriously. permalink award report block reply Whoopies_tds 8 points 13 hours ago The K-12 education system has been turned into a DEI tranny factory. Now push them into college and wonder why companies need to hire foreigners permalink award report block reply possibletower 1 points 11 hours ago Yet retarded faggots here are outraged when Trump says many young Americans are not talented enough to do the factory and tech jobs that will be coming back to America for the first time since the 1980s-90s. Why do these retarded faggots laugh at young Americans for factually being illiterate in math/science/reading but get faux outraged at Trump for fucking spilling facts on the state of our youth today? permalink parent award report block reply mykillk 6 points 12 hours ago That's shocking. Might even be more shocking that 59% of college freshmen don't reach 7th grade level math. My recollection is that 7th grade level still hasn't even reached basic pre-algebra. 59% of college students can't solve something as simple as 1x + 2 = 4. Mindblowing. permalink award report block reply possibletower -2 points 11 hours ago Yet retarded faggots here are outraged when Trump says many young Americans are not talented enough to do the factory and tech jobs that will be coming back to America for the first time since the 1980s-90s. Why do these retarded faggots laugh at young Americans for factually being illiterate in math/science/reading but get faux outraged at Trump for fucking spilling facts on the state of our youth today? permalink parent award report block reply Ronaldus 6 points 13 hours ago 13% sounds familiar. permalink award report block reply Shmioighan 2 points 11 hours ago If you have a pulse, a college will gladly take a few tens of thousands of dollars to entertain you before you drop out or they print you a piece of paper that'll do you no good. permalink award report block reply MasterChief 2 points 12 hours ago ask them to read an analog clock permalink award report block reply CaliBlonde 4 points 12 hours ago Drawing the time on an analog clock is part of the \"wellness check\" for seniors. permalink parent award report block reply HillarysBeaverMunch 1 points 10 hours ago Maybe black people should focus more on the trades, and less on raping blonde chicks. permalink award report block reply onesummerdream 1 points 2 hours ago It’s no real surprise since I found out that 2+2=4 is racist. permalink award report block reply possibletower -1 points 11 hours ago Yet retarded faggots here are outraged when Trump says many young Americans are not talented enough to do the factory and tech jobs that will be coming back to America for the first time since the 1980s-90s. Why do these retarded faggots laugh at young Americans for factually being illiterate in math/science/reading but get faux outraged at Trump for fucking spilling facts on the state of our youth today? permalink award report block reply\nRaetchel 15 points 13 hours ago 13% you say permalink award report block reply imnotdeadyet 4 points 12 hours ago And they are all probably on free rides. permalink parent award report block reply Raetchel 2 points 12 hours ago they do basketball and football though permalink parent award report block reply possibletower -2 points 11 hours ago Yet retarded faggots here are outraged when Trump says many young Americans are not talented enough to do the factory and tech jobs that will be coming back to America for the first time since the 1980s-90s. Why do these retarded faggots laugh at young Americans for factually being illiterate in math/science/reading but get faux outraged at Trump for fucking spilling facts on the state of our youth today? permalink parent award report block reply Jack_NC 2 points 11 hours ago well, well, well... permalink parent award report block reply possibletower 0 points 11 hours ago Yet retarded faggots here are outraged when Trump says many young Americans are not talented enough to do the factory and tech jobs that will be coming back to America for the first time since the 1980s-90s. Why do these retarded faggots laugh at young Americans for factually being illiterate in math/science/reading but get faux outraged at Trump for fucking spilling facts on the state of our youth today? permalink parent award report block reply\nimnotdeadyet 4 points 12 hours ago And they are all probably on free rides. permalink parent award report block reply Raetchel 2 points 12 hours ago they do basketball and football though permalink parent award report block reply possibletower -2 points 11 hours ago Yet retarded faggots here are outraged when Trump says many young Americans are not talented enough to do the factory and tech jobs that will be coming back to America for the first time since the 1980s-90s. Why do these retarded faggots laugh at young Americans for factually being illiterate in math/science/reading but get faux outraged at Trump for fucking spilling facts on the state of our youth today? permalink parent award report block reply\nRaetchel 2 points 12 hours ago they do basketball and football though permalink parent award report block reply\npossibletower -2 points 11 hours ago Yet retarded faggots here are outraged when Trump says many young Americans are not talented enough to do the factory and tech jobs that will be coming back to America for the first time since the 1980s-90s. Why do these retarded faggots laugh at young Americans for factually being illiterate in math/science/reading but get faux outraged at Trump for fucking spilling facts on the state of our youth today? permalink parent award report block reply\nJack_NC 2 points 11 hours ago well, well, well... permalink parent award report block reply\npossibletower 0 points 11 hours ago Yet retarded faggots here are outraged when Trump says many young Americans are not talented enough to do the factory and tech jobs that will be coming back to America for the first time since the 1980s-90s. Why do these retarded faggots laugh at young Americans for factually being illiterate in math/science/reading but get faux outraged at Trump for fucking spilling facts on the state of our youth today? permalink parent award report block reply\nFilo76 9 points 13 hours ago No idea why college$ are doing thi$. I’m $tumped. $eriously. permalink award report block reply\nWhoopies_tds 8 points 13 hours ago The K-12 education system has been turned into a DEI tranny factory. Now push them into college and wonder why companies need to hire foreigners permalink award report block reply possibletower 1 points 11 hours ago Yet retarded faggots here are outraged when Trump says many young Americans are not talented enough to do the factory and tech jobs that will be coming back to America for the first time since the 1980s-90s. Why do these retarded faggots laugh at young Americans for factually being illiterate in math/science/reading but get faux outraged at Trump for fucking spilling facts on the state of our youth today? permalink parent award report block reply\npossibletower 1 points 11 hours ago Yet retarded faggots here are outraged when Trump says many young Americans are not talented enough to do the factory and tech jobs that will be coming back to America for the first time since the 1980s-90s. Why do these retarded faggots laugh at young Americans for factually being illiterate in math/science/reading but get faux outraged at Trump for fucking spilling facts on the state of our youth today? permalink parent award report block reply\nmykillk 6 points 12 hours ago That's shocking. Might even be more shocking that 59% of college freshmen don't reach 7th grade level math. My recollection is that 7th grade level still hasn't even reached basic pre-algebra. 59% of college students can't solve something as simple as 1x + 2 = 4. Mindblowing. permalink award report block reply possibletower -2 points 11 hours ago Yet retarded faggots here are outraged when Trump says many young Americans are not talented enough to do the factory and tech jobs that will be coming back to America for the first time since the 1980s-90s. Why do these retarded faggots laugh at young Americans for factually being illiterate in math/science/reading but get faux outraged at Trump for fucking spilling facts on the state of our youth today? permalink parent award report block reply\npossibletower -2 points 11 hours ago Yet retarded faggots here are outraged when Trump says many young Americans are not talented enough to do the factory and tech jobs that will be coming back to America for the first time since the 1980s-90s. Why do these retarded faggots laugh at young Americans for factually being illiterate in math/science/reading but get faux outraged at Trump for fucking spilling facts on the state of our youth today? permalink parent award report block reply\nRonaldus 6 points 13 hours ago 13% sounds familiar. permalink award report block reply\nShmioighan 2 points 11 hours ago If you have a pulse, a college will gladly take a few tens of thousands of dollars to entertain you before you drop out or they print you a piece of paper that'll do you no good. permalink award report block reply\nMasterChief 2 points 12 hours ago ask them to read an analog clock permalink award report block reply CaliBlonde 4 points 12 hours ago Drawing the time on an analog clock is part of the \"wellness check\" for seniors. permalink parent award report block reply\nCaliBlonde 4 points 12 hours ago Drawing the time on an analog clock is part of the \"wellness check\" for seniors. permalink parent award report block reply\nHillarysBeaverMunch 1 points 10 hours ago Maybe black people should focus more on the trades, and less on raping blonde chicks. permalink award report block reply\nonesummerdream 1 points 2 hours ago It’s no real surprise since I found out that 2+2=4 is racist. permalink award report block reply\npossibletower -1 points 11 hours ago Yet retarded faggots here are outraged when Trump says many young Americans are not talented enough to do the factory and tech jobs that will be coming back to America for the first time since the 1980s-90s. Why do these retarded faggots laugh at young Americans for factually being illiterate in math/science/reading but get faux outraged at Trump for fucking spilling facts on the state of our youth today? permalink award report block reply"}