{"id": "1ARK9pfatE", "contents": "50 There isn't any part of America that isn't affected posted 9 hours ago by PiratePatriotParrot 3 comments award share report block AlphaFox @alphafox • 22h Always check the 'country of origin' on your Christmas cookie tin: 👀🤢\n3 comments Sort by Top Top New Worst Old Save TwoArizonaPedes 6 points 9 hours ago Always check the country of origin on everything you buy. permalink award report block reply BidenShowerDrool 3 points 7 hours ago Learn to bake biscuits .....that way you know who and where it was made. and it makes the house smell amazing. permalink parent award report block reply TrumpAndGodWin 2 points 5 hours ago Best we can do meme \"bwcd is distributed by x USA. Certified organic by quality assurance international.\" And no you're not allowed to know which shitholes it came from. Companies like Costco trick consumers with things like \"product of USA\" when all the ingredients are from China etc. permalink parent award report block reply\nTwoArizonaPedes 6 points 9 hours ago Always check the country of origin on everything you buy. permalink award report block reply BidenShowerDrool 3 points 7 hours ago Learn to bake biscuits .....that way you know who and where it was made. and it makes the house smell amazing. permalink parent award report block reply TrumpAndGodWin 2 points 5 hours ago Best we can do meme \"bwcd is distributed by x USA. Certified organic by quality assurance international.\" And no you're not allowed to know which shitholes it came from. Companies like Costco trick consumers with things like \"product of USA\" when all the ingredients are from China etc. permalink parent award report block reply\nBidenShowerDrool 3 points 7 hours ago Learn to bake biscuits .....that way you know who and where it was made. and it makes the house smell amazing. permalink parent award report block reply\nTrumpAndGodWin 2 points 5 hours ago Best we can do meme \"bwcd is distributed by x USA. Certified organic by quality assurance international.\" And no you're not allowed to know which shitholes it came from. Companies like Costco trick consumers with things like \"product of USA\" when all the ingredients are from China etc. permalink parent award report block reply"}