{"id": "1ARK514PCN", "contents": "940 President of Poland, Karol Nawrock: “In Poland, we don’t build migrant integration centres. We build deportation centers for those who threaten our nation.” 🔥🔥 🖕   FUCK  CHINA   🖕 posted 6 days ago by basedboston 14 comments award share report block Based Hungary 🇭🇺 @HungaryBased • 8d 🚨 SHOCKING: 🇵🇱 Polish President Karol Nawrocki EXCLUDES Poland from the EU Migration Pact: “In Poland, we don’t build migrant integration centres. We build deportation centres for those who threaten our nation.\"\n14 comments Sort by Top Top New Worst Old Save Shitsbrokeyo 12 points 6 days ago I want that in my country. permalink award report block reply MeMargie 7 points 6 days ago And to think they use to mock the Polish here  :) permalink parent award report block reply KarameloKamala 5 points 6 days ago Only because you were scared we were competent.  Turns out we are. We thrive. permalink parent award report block reply MeMargie 4 points 6 days ago I am an educated Polish Princess 🥳 permalink parent award report block reply KarameloKamala 2 points 6 days ago w takim razie życzę błogosławionego dnia, moja siostro permalink parent award report block reply view 2 more comments... Godan 2 points 6 days ago Because of what our country went through, we're very based. permalink parent award report block reply KarameloKamala 1 points 6 days ago Exactly.  We bled for this knwoledge and mindset.  Until other bleed the same, they wont see it. permalink parent award report block reply FusionBlack 1 points 6 days ago The way it may go with another Democrat president and Congress it maybe my country. permalink parent award report block reply basedboston OP 9 points 6 days ago Based Flair permalink award report block reply rebuildingMyself 5 points 6 days ago And they'll be one of the last remaining holdout of western civilization for such forward thinking permalink award report block reply Midsouth 3 points 6 days ago Well wouldn't that be nice! I'm jealous. permalink award report block reply\nShitsbrokeyo 12 points 6 days ago I want that in my country. permalink award report block reply MeMargie 7 points 6 days ago And to think they use to mock the Polish here  :) permalink parent award report block reply KarameloKamala 5 points 6 days ago Only because you were scared we were competent.  Turns out we are. We thrive. permalink parent award report block reply MeMargie 4 points 6 days ago I am an educated Polish Princess 🥳 permalink parent award report block reply KarameloKamala 2 points 6 days ago w takim razie życzę błogosławionego dnia, moja siostro permalink parent award report block reply view 2 more comments... Godan 2 points 6 days ago Because of what our country went through, we're very based. permalink parent award report block reply KarameloKamala 1 points 6 days ago Exactly.  We bled for this knwoledge and mindset.  Until other bleed the same, they wont see it. permalink parent award report block reply FusionBlack 1 points 6 days ago The way it may go with another Democrat president and Congress it maybe my country. permalink parent award report block reply\nMeMargie 7 points 6 days ago And to think they use to mock the Polish here  :) permalink parent award report block reply KarameloKamala 5 points 6 days ago Only because you were scared we were competent.  Turns out we are. We thrive. permalink parent award report block reply MeMargie 4 points 6 days ago I am an educated Polish Princess 🥳 permalink parent award report block reply KarameloKamala 2 points 6 days ago w takim razie życzę błogosławionego dnia, moja siostro permalink parent award report block reply view 2 more comments... Godan 2 points 6 days ago Because of what our country went through, we're very based. permalink parent award report block reply KarameloKamala 1 points 6 days ago Exactly.  We bled for this knwoledge and mindset.  Until other bleed the same, they wont see it. permalink parent award report block reply\nKarameloKamala 5 points 6 days ago Only because you were scared we were competent.  Turns out we are. We thrive. permalink parent award report block reply MeMargie 4 points 6 days ago I am an educated Polish Princess 🥳 permalink parent award report block reply KarameloKamala 2 points 6 days ago w takim razie życzę błogosławionego dnia, moja siostro permalink parent award report block reply view 2 more comments... Godan 2 points 6 days ago Because of what our country went through, we're very based. permalink parent award report block reply KarameloKamala 1 points 6 days ago Exactly.  We bled for this knwoledge and mindset.  Until other bleed the same, they wont see it. permalink parent award report block reply\nMeMargie 4 points 6 days ago I am an educated Polish Princess 🥳 permalink parent award report block reply KarameloKamala 2 points 6 days ago w takim razie życzę błogosławionego dnia, moja siostro permalink parent award report block reply view 2 more comments...\nKarameloKamala 2 points 6 days ago w takim razie życzę błogosławionego dnia, moja siostro permalink parent award report block reply view 2 more comments...\nGodan 2 points 6 days ago Because of what our country went through, we're very based. permalink parent award report block reply KarameloKamala 1 points 6 days ago Exactly.  We bled for this knwoledge and mindset.  Until other bleed the same, they wont see it. permalink parent award report block reply\nKarameloKamala 1 points 6 days ago Exactly.  We bled for this knwoledge and mindset.  Until other bleed the same, they wont see it. permalink parent award report block reply\nFusionBlack 1 points 6 days ago The way it may go with another Democrat president and Congress it maybe my country. permalink parent award report block reply\nbasedboston OP 9 points 6 days ago Based Flair permalink award report block reply\nrebuildingMyself 5 points 6 days ago And they'll be one of the last remaining holdout of western civilization for such forward thinking permalink award report block reply\nMidsouth 3 points 6 days ago Well wouldn't that be nice! I'm jealous. permalink award report block reply"}