{"id": "1ARK9l978T", "contents": "1123 “Clinton Corruption Files” – Bondi, Patel Give Congress New Evidence Detailing Clinton Foundation Corruption (www.thegatewaypundit.com) posted 24 hours ago by PiratePatriotParrot 89 comments award share report block \"Clinton Corruption Files\" - Bondi, Patel Give Congress New Evidence Detailing Clinton Foundation Corruption | The Gateway Pundi... US Attorney General Pam Bondi and FBI Director Kash Patel have provided Congress with new evidence detailing Clinton Foundation corruption. www.thegatewaypundit.com\n89 comments Sort by Top Top New Worst Old Save DoMe22 74 points 23 hours ago I'll get excited once we actually see an arrest. permalink award report block reply IncredibleMrE1 53 points 23 hours ago If there was going to be an arrest or charges, they would have presented the evidence in court, not to Congress. permalink parent award report block reply Spindle-spin 26 points 23 hours ago Hearings are happening in two weeks permalink parent award report block reply Scumbag-reddit 6 points 22 hours ago I somehow knew which gif it was before opening permalink parent award report block reply 1776take2 12 points 22 hours ago I’m guessing the statute of limitations has run out….yesterday permalink parent award report block reply SomeGuyOnTheInternet 3 points 22 hours ago If it wasn't rigged and they aren't all going to walk, since the cover-up is on-going the statute of limitations wouldn't apply. permalink parent award report block reply Hanging_Chad 1 points 22 hours ago is it covered up or uncovered? permalink parent award report block reply saltyviewer123 3 points 22 hours ago FUCK!  Why isn't DJT taking the gloves off already !!! permalink parent award report block reply KernalMustard 2 points 21 hours ago Butler. permalink parent award report block reply ImYourHuckleberry24 2 points 23 hours ago This permalink parent award report block reply Mikespenis123 3 points 22 hours ago They should have read this over ten years ago: https://www.regnery.com/9781621575450/clinton-cash-a-graphic-novel/ permalink parent award report block reply Bidensmellslikepiss 2 points 10 hours ago For real. This slow drip of Pam Bondi fucking around is meant to keep us excited and talking but it's just pissing me off. Quit wasting time you idiots in the admin. Go back to the drawing board on the 50 year mortgage, double down on deportation and put Homan and Miller back on the airwaves. They actually get it and are motivated to MAGA. Edit: And outright ignore the judges. How long are you going to let them drag you through the courts and lawfare before you get wise? Trying to drag Hillary and Obama through the courts won't work because Soros owns the courts. Wake up, God dammit! permalink parent award report block reply Run_over_Antifa 1 points 22 hours ago A single arrest and the judge is not an obama judge. permalink parent award report block reply FUCK_TYLER 1 points 23 hours ago 👆🏻 This permalink parent award report block reply load 5 more comments... Ricky_CIA 25 points 23 hours ago My government should not ever be funding NON-government organizations. permalink award report block reply fluffykitten 18 points 23 hours ago So DOJ & FBI give evidence to Congress, so that Congress can send evidence to DOJ & FBI? permalink award report block reply starjello 7 points 22 hours ago Congress isn't going to do anything with it but sit there with their thumbs up their ass permalink parent award report block reply ArchRespawnsAgain 3 points 21 hours ago They are also going to suck those thumbs once they're nice and chocolatey. permalink parent award report block reply Rock9Head 3 points 22 hours ago Only after they corrupt the evidence. permalink parent award report block reply ADAM_SCHITT 1 points 21 hours ago Congress can send strongly worded letters of referral to the DOJ and then the DOJ will do nothing. permalink parent award report block reply TooTrue-translation 16 points 23 hours ago ARREST THE CLINTONS ALREADY permalink award report block reply AwShitHereWeGoAgain 13 points 23 hours ago Best I can do is a Fox News appearance. permalink parent award report block reply ingrowntoenail 2 points 23 hours ago If either of them ever get convicted they'll be Arkanicided before they have to report to prison. permalink parent award report block reply LineInTheSand 0 points 22 hours ago They're old and unlikely to affect politics.  It wouldn't make a difference. What would make a difference is arresting the pedos who went to Epstein's island.  Letting those people go without consequences just enables more pedos. permalink parent award report block reply KernalMustard 1 points 21 hours ago Hahaha. Sycophants will do their bidding.  I said long ago that the Dems are made of different factions. The Obamas, The Clintons, people part of Pelosi circle of power. Its all shared but if you take on the Clintons know that their people are behind every tree permalink parent award report block reply AR_MAGA 12 points 23 hours ago Just wait two more weeks. permalink award report block reply Grond999 1 points 23 hours ago I can wait that long. I can wait forever. I've even forgotten about Epstein forever. permalink parent award report block reply champdog 7 points 23 hours ago The slow drip..... permalink award report block reply ImYourHuckleberry24 13 points 23 hours ago No. The slow demoralization process. As these things always end in a slap on the wrist, if anything at all. It's working as intended. permalink parent award report block reply PhoneBandit 7 points 22 hours ago Trump will be leaving the office campaigning on, \"keep Maga going! Elect maga conservatives so we can finally get the crooked dems!\" permalink parent award report block reply starjello 4 points 22 hours ago Your comment is much more accurate than the guy you're replying to permalink parent award report block reply Awakened 3 points 22 hours ago Yep. The other guy is still in the fantasy land they hope the whole base is in. The poor sod that this bullshit theater still works on. permalink parent award report block reply POTUS_DonnieJ 6 points 22 hours ago Why does Bondi need to give Congress the evidence? She is the top law enforcement office in the country. She can make any arrests she needs. permalink award report block reply Build_Back_Bankrupt 5 points 23 hours ago Doyle and Moynihan, those two testified to congress in 2017 or 2018, very interesting hearing. The article labels them \"whistleblowers\", which is technically not the case, they are attorneys who conduct financial audits/analysis of charity organizations for fraud and violations. They do this for profit, basically bounty hunters for the IRS.  In this case they sent their findings to the FBI and the IRS, and if the foundation is prosecuted these guys stand to make 10's of millions in reward money as a % of the damages claimed by the IRS. With that much reward cash on the line my guess is that these guys have been hammering Trump's DOJ to reopen this thing. permalink award report block reply TEXinLA 3 points 22 hours ago No Statute of Limitations for the IRS. They can audit whatever and whenever they want. For the typical taxpayer, keeping 10 years of records tends to suffice. permalink parent award report block reply f_bastiat 4 points 23 hours ago Epstein files or gtfo permalink award report block reply Grond999 3 points 23 hours ago \"Excuse me, are you still asking about Epstein?\" permalink parent award report block reply PhilipeNegro 3 points 22 hours ago Too much big Jewbs for Kashie - bobs shown, much denial permalink parent award report block reply Trump2020or4eva 4 points 23 hours ago I'm sure we will see justice swiftly and dished out appropriately. 🤡🤡🤡🤡🤡 permalink award report block reply SupaMegaBen 4 points 22 hours ago Why the fuck is it going to Congress instead of a grand jury? FFS I hate Bondi. permalink award report block reply JoinTheDiscussion 3 points 22 hours ago Picked for that reason.. Sooner you see the theater play the better permalink parent award report block reply SupaMegaBen 2 points 22 hours ago Wiles is the real issue. Get rid of her, and get rid of the bubble that Trump is in. permalink parent award report block reply TheTelltaleFly 4 points 23 hours ago Did they arrest the pipe bomber yet? Wonder if The Blaze will get the $500k reward. permalink award report block reply starjello 1 points 22 hours ago No they haven't arrested the pipe bomber yet. You might just as well keep it in your pants permalink parent award report block reply BidenSniffsLittleKid 4 points 23 hours ago Oh good more red meat with strongly worded letter two weeks from now.\nEdit: tick tock permalink award report block reply DiamondDroid 3 points 22 hours ago It's on Pam's desk. Two more weeks. permalink award report block reply JoinTheDiscussion 3 points 22 hours ago Kash has to come shit on her desk first permalink parent award report block reply ArchRespawnsAgain 2 points 21 hours ago \"Kash! This isn't the loo!\" permalink parent award report block reply Trump2024 1 points 21 hours ago And it's sickening permalink parent award report block reply Awakened 3 points 22 hours ago This is totally backwards. Congress sends the DOJ and FBI evidence to investigate. If the DOJ or FBI has the evidence already, they can proceed with arrests. This is such obvious fucking theater at this point. To Hell with the whole lot of them. permalink award report block reply JoinTheDiscussion 3 points 22 hours ago Blondie and street shitter doing something.. Not holding my breath permalink award report block reply Tacitus1963 3 points 15 hours ago Bondi and Patel just throwing bones because\na. Trump publicly called her out a few weeks back\nb. Because she knows most of us are mega-pissed at her and Patel.\nc. They stupidly think we will forget about the Epstein Lists\nNothing is really going to happen.\nUnless the RINO party develop massive testicular fortitude, they are going to purposely lose the midterms so that we will be back to peachmints. permalink award report block reply birddogz 2 points 22 hours ago Sternly worded letters, oh my permalink award report block reply Eurpoean 2 points 23 hours ago FFS arrest someone. permalink award report block reply plasticglock 2 points 21 hours ago We DO NOT need to hear about more crimes. We need to hear about some consequences. The FUCKING AROUND part is well documented to say the least. We need to get to the FINDING OUT part already!!! permalink award report block reply plasticglock 1 points 21 hours ago I'm so black pilled I'm gonna steal someone's bike!!! permalink parent award report block reply waste 2 points 23 hours ago ... and Congress will do ABSOLUTELY NOTHING! because its on Pam's desk. Where are the arrests???? Tonight on Hannity. permalink award report block reply Oodles 2 points 12 hours ago Bondi and Patel seem pretty good at telling us shit we already know and then doing nothing about it permalink award report block reply iamimaginos 2 points 22 hours ago Literally everyone on the planet knows the Clintons are as corrupt as they come.  No one in Congress gives a shit.  Tweedle Dee and Tweedle Dum can go back to whatever it was they werent doing permalink award report block reply MemeLawd 2 points 23 hours ago Wow lets talk about something that happened 50 years ago RATHER THAN DO SOMETHING ABOUT SHIT ACTUALLY FUCKING HAPPENING TODAY! permalink award report block reply ParticleCannon 2 points 22 hours ago Many days late, many millions overbudget permalink award report block reply RBFace 1 points 12 hours ago Why are Kash and bondi giving it to congress? Why don't they prosecute? permalink award report block reply Harvestsmiles 1 points 23 hours ago Clinton Chronicles film still available. Get a copy before it gets Arkancided. permalink award report block reply MySidesGoUp 1 points 22 hours ago I like how Sessions and Durham were mentioned.  Some real butch cassidy’s… permalink award report block reply Justjayce 1 points 21 hours ago 3...2..1... Nothing will be done permalink award report block reply Somedaygrl 1 points 19 hours ago ALL THIS SHIT STARTED WITHTHE CLINTONS!  TAKE THEM ALL DOWN KASH & BONDI! permalink award report block reply DCYR66 1 points 12 hours ago The  evidence is sitting on their desks. permalink award report block reply Nate_Higgersalot 1 points 19 hours ago Epstein files when? permalink award report block reply JDVance4President28 1 points 19 hours ago Okay. Add it to the EVIDENCE pile. Soooooo much evidence, yet never any consequences. permalink award report block reply Formerlurker92 1 points 23 hours ago I'm tired of finding out new things and having no one go to prison. Without punishment, who cares what they got away with permalink award report block reply Aggrieved03 1 points 22 hours ago I’m always told Congress has no arrest power so those who do are doing what? permalink award report block reply TheMustacheBandit 1 points 22 hours ago I think Bondi has no clue who is in charge of the DOJ. permalink award report block reply SomeGuyOnTheInternet 1 points 22 hours ago Wait, why go to Congress?  I thought they were supposed to go to the judiciary branch with this kind of thing, not the legislative. permalink award report block reply I_Love_45-70_Gov 1 points 22 hours ago HELL YES!  SO MANY CORRUPT, TREASONOUS ASSHATS BEING ARRSTED AND JAILED THESE DAYS. INCREDIBLY STOKED!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! permalink award report block reply GoneViking 1 points 21 hours ago Oh, wow! Bondi and Patel, guys! Bondi and Patel are on it! All our hopes and dreams are realized! permalink award report block reply KernalMustard 1 points 21 hours ago Did they both forget they are ones who persecute this? No wonder we're fucked. permalink award report block reply mass55th 1 points 20 hours ago They should have been investigated while they were still in the White House taking money from the Chi-coms. Their asian bundlers got charged and went to prison, but somehow the Clintons weren't held responsible for taking foreign cash. Terry McAuliffe was involved in that as well, but he walked, then ran for Governor of Virginia, and got elected. In 2016, while he was still Governor, he was being investigated by the Feds for accepting illegal contributions. In 2018, he was involved in a lawsuit brought by 32 Chinese investors in McAuliffe's start-up Greentech Automotive Inc. that went bust. He was CEO of the company. The investments were made under a federal program that let foreign nationals receive U.S. residency visas if they invest in companies that create U.S. jobs. The 32 investors each put up $500,000. The company received millions in subsidies to build a factory in Mississippi, but the company never got off the ground and went bankrupt. The plaintiffs filed suit, saying Greentech’s failure threatens their ability to remain in the U.S. The old bait and switch routine. I take your money under false pretenses, and then you get it stuck up your ass. In 2017, Virginia state’s auditor demanded the firm repay $6.4 million in public funds. I see no record of that money ever being paid back. What's even worse, Judge Claude Hilton, a Reagan appointee hearing the lawsuit brought forth by the Chinese investors dismissed McAuliffe from the suit, along with his buddy Anthony Rodham...Hillary Clinton's brother. He was alleged to have played a role in recruiting investors and misrepresenting Greentech’s viability. Two big scam artists. Rodham died in 2019 permalink award report block reply 27Sandino 1 points 23 hours ago No reasonable prosecutor... But they arrest Trump and his lawyers permalink award report block reply FusionBlack 1 points 21 hours ago And in other my news.... permalink award report block reply AmericanWoman23 1 points 22 hours ago Suddenly Congress members will be committing Arkancide. permalink award report block reply Purple_Drank 1 points 13 hours ago Why are they giving the evidence to Congress?  Why don’t Bondi and Patel arrest them? permalink award report block reply Protonboy 1 points 16 hours ago Since Congress is the branch of government that files charges, this will finally get the Deep State to stop their monkey shines. permalink award report block reply justinkayz 1 points 15 hours ago Congress can make criminal referrals to the DOJ. The DOJ can then have the FBI arrest them. But in the case of the Clintons, the DOJ sends their findings to Congress to get buried in the swamp muck...committees, hearings, investigations that lead nowhere, sternly written letters, etc., etc. permalink parent award report block reply Ralphusthegreatus 1 points 22 hours ago Comment removed by community moderators. permalink award report block reply\nDoMe22 74 points 23 hours ago I'll get excited once we actually see an arrest. permalink award report block reply IncredibleMrE1 53 points 23 hours ago If there was going to be an arrest or charges, they would have presented the evidence in court, not to Congress. permalink parent award report block reply Spindle-spin 26 points 23 hours ago Hearings are happening in two weeks permalink parent award report block reply Scumbag-reddit 6 points 22 hours ago I somehow knew which gif it was before opening permalink parent award report block reply 1776take2 12 points 22 hours ago I’m guessing the statute of limitations has run out….yesterday permalink parent award report block reply SomeGuyOnTheInternet 3 points 22 hours ago If it wasn't rigged and they aren't all going to walk, since the cover-up is on-going the statute of limitations wouldn't apply. permalink parent award report block reply Hanging_Chad 1 points 22 hours ago is it covered up or uncovered? permalink parent award report block reply saltyviewer123 3 points 22 hours ago FUCK!  Why isn't DJT taking the gloves off already !!! permalink parent award report block reply KernalMustard 2 points 21 hours ago Butler. permalink parent award report block reply ImYourHuckleberry24 2 points 23 hours ago This permalink parent award report block reply Mikespenis123 3 points 22 hours ago They should have read this over ten years ago: https://www.regnery.com/9781621575450/clinton-cash-a-graphic-novel/ permalink parent award report block reply Bidensmellslikepiss 2 points 10 hours ago For real. This slow drip of Pam Bondi fucking around is meant to keep us excited and talking but it's just pissing me off. Quit wasting time you idiots in the admin. Go back to the drawing board on the 50 year mortgage, double down on deportation and put Homan and Miller back on the airwaves. They actually get it and are motivated to MAGA. Edit: And outright ignore the judges. How long are you going to let them drag you through the courts and lawfare before you get wise? Trying to drag Hillary and Obama through the courts won't work because Soros owns the courts. Wake up, God dammit! permalink parent award report block reply Run_over_Antifa 1 points 22 hours ago A single arrest and the judge is not an obama judge. permalink parent award report block reply FUCK_TYLER 1 points 23 hours ago 👆🏻 This permalink parent award report block reply load 5 more comments...\nIncredibleMrE1 53 points 23 hours ago If there was going to be an arrest or charges, they would have presented the evidence in court, not to Congress. permalink parent award report block reply Spindle-spin 26 points 23 hours ago Hearings are happening in two weeks permalink parent award report block reply Scumbag-reddit 6 points 22 hours ago I somehow knew which gif it was before opening permalink parent award report block reply 1776take2 12 points 22 hours ago I’m guessing the statute of limitations has run out….yesterday permalink parent award report block reply SomeGuyOnTheInternet 3 points 22 hours ago If it wasn't rigged and they aren't all going to walk, since the cover-up is on-going the statute of limitations wouldn't apply. permalink parent award report block reply Hanging_Chad 1 points 22 hours ago is it covered up or uncovered? permalink parent award report block reply saltyviewer123 3 points 22 hours ago FUCK!  Why isn't DJT taking the gloves off already !!! permalink parent award report block reply KernalMustard 2 points 21 hours ago Butler. permalink parent award report block reply ImYourHuckleberry24 2 points 23 hours ago This permalink parent award report block reply\nSpindle-spin 26 points 23 hours ago Hearings are happening in two weeks permalink parent award report block reply Scumbag-reddit 6 points 22 hours ago I somehow knew which gif it was before opening permalink parent award report block reply\nScumbag-reddit 6 points 22 hours ago I somehow knew which gif it was before opening permalink parent award report block reply\n1776take2 12 points 22 hours ago I’m guessing the statute of limitations has run out….yesterday permalink parent award report block reply SomeGuyOnTheInternet 3 points 22 hours ago If it wasn't rigged and they aren't all going to walk, since the cover-up is on-going the statute of limitations wouldn't apply. permalink parent award report block reply Hanging_Chad 1 points 22 hours ago is it covered up or uncovered? permalink parent award report block reply\nSomeGuyOnTheInternet 3 points 22 hours ago If it wasn't rigged and they aren't all going to walk, since the cover-up is on-going the statute of limitations wouldn't apply. permalink parent award report block reply Hanging_Chad 1 points 22 hours ago is it covered up or uncovered? permalink parent award report block reply\nHanging_Chad 1 points 22 hours ago is it covered up or uncovered? permalink parent award report block reply\nsaltyviewer123 3 points 22 hours ago FUCK!  Why isn't DJT taking the gloves off already !!! permalink parent award report block reply KernalMustard 2 points 21 hours ago Butler. permalink parent award report block reply\nKernalMustard 2 points 21 hours ago Butler. permalink parent award report block reply\nImYourHuckleberry24 2 points 23 hours ago This permalink parent award report block reply\nMikespenis123 3 points 22 hours ago They should have read this over ten years ago: https://www.regnery.com/9781621575450/clinton-cash-a-graphic-novel/ permalink parent award report block reply\nBidensmellslikepiss 2 points 10 hours ago For real. This slow drip of Pam Bondi fucking around is meant to keep us excited and talking but it's just pissing me off. Quit wasting time you idiots in the admin. Go back to the drawing board on the 50 year mortgage, double down on deportation and put Homan and Miller back on the airwaves. They actually get it and are motivated to MAGA. Edit: And outright ignore the judges. How long are you going to let them drag you through the courts and lawfare before you get wise? Trying to drag Hillary and Obama through the courts won't work because Soros owns the courts. Wake up, God dammit! permalink parent award report block reply\nRun_over_Antifa 1 points 22 hours ago A single arrest and the judge is not an obama judge. permalink parent award report block reply\nFUCK_TYLER 1 points 23 hours ago 👆🏻 This permalink parent award report block reply\nRicky_CIA 25 points 23 hours ago My government should not ever be funding NON-government organizations. permalink award report block reply\nfluffykitten 18 points 23 hours ago So DOJ & FBI give evidence to Congress, so that Congress can send evidence to DOJ & FBI? permalink award report block reply starjello 7 points 22 hours ago Congress isn't going to do anything with it but sit there with their thumbs up their ass permalink parent award report block reply ArchRespawnsAgain 3 points 21 hours ago They are also going to suck those thumbs once they're nice and chocolatey. permalink parent award report block reply Rock9Head 3 points 22 hours ago Only after they corrupt the evidence. permalink parent award report block reply ADAM_SCHITT 1 points 21 hours ago Congress can send strongly worded letters of referral to the DOJ and then the DOJ will do nothing. permalink parent award report block reply\nstarjello 7 points 22 hours ago Congress isn't going to do anything with it but sit there with their thumbs up their ass permalink parent award report block reply ArchRespawnsAgain 3 points 21 hours ago They are also going to suck those thumbs once they're nice and chocolatey. permalink parent award report block reply\nArchRespawnsAgain 3 points 21 hours ago They are also going to suck those thumbs once they're nice and chocolatey. permalink parent award report block reply\nRock9Head 3 points 22 hours ago Only after they corrupt the evidence. permalink parent award report block reply\nADAM_SCHITT 1 points 21 hours ago Congress can send strongly worded letters of referral to the DOJ and then the DOJ will do nothing. permalink parent award report block reply\nTooTrue-translation 16 points 23 hours ago ARREST THE CLINTONS ALREADY permalink award report block reply AwShitHereWeGoAgain 13 points 23 hours ago Best I can do is a Fox News appearance. permalink parent award report block reply ingrowntoenail 2 points 23 hours ago If either of them ever get convicted they'll be Arkanicided before they have to report to prison. permalink parent award report block reply LineInTheSand 0 points 22 hours ago They're old and unlikely to affect politics.  It wouldn't make a difference. What would make a difference is arresting the pedos who went to Epstein's island.  Letting those people go without consequences just enables more pedos. permalink parent award report block reply KernalMustard 1 points 21 hours ago Hahaha. Sycophants will do their bidding.  I said long ago that the Dems are made of different factions. The Obamas, The Clintons, people part of Pelosi circle of power. Its all shared but if you take on the Clintons know that their people are behind every tree permalink parent award report block reply\nAwShitHereWeGoAgain 13 points 23 hours ago Best I can do is a Fox News appearance. permalink parent award report block reply\ningrowntoenail 2 points 23 hours ago If either of them ever get convicted they'll be Arkanicided before they have to report to prison. permalink parent award report block reply\nLineInTheSand 0 points 22 hours ago They're old and unlikely to affect politics.  It wouldn't make a difference. What would make a difference is arresting the pedos who went to Epstein's island.  Letting those people go without consequences just enables more pedos. permalink parent award report block reply KernalMustard 1 points 21 hours ago Hahaha. Sycophants will do their bidding.  I said long ago that the Dems are made of different factions. The Obamas, The Clintons, people part of Pelosi circle of power. Its all shared but if you take on the Clintons know that their people are behind every tree permalink parent award report block reply\nKernalMustard 1 points 21 hours ago Hahaha. Sycophants will do their bidding.  I said long ago that the Dems are made of different factions. The Obamas, The Clintons, people part of Pelosi circle of power. Its all shared but if you take on the Clintons know that their people are behind every tree permalink parent award report block reply\nAR_MAGA 12 points 23 hours ago Just wait two more weeks. permalink award report block reply Grond999 1 points 23 hours ago I can wait that long. I can wait forever. I've even forgotten about Epstein forever. permalink parent award report block reply\nGrond999 1 points 23 hours ago I can wait that long. I can wait forever. I've even forgotten about Epstein forever. permalink parent award report block reply\nchampdog 7 points 23 hours ago The slow drip..... permalink award report block reply ImYourHuckleberry24 13 points 23 hours ago No. The slow demoralization process. As these things always end in a slap on the wrist, if anything at all. It's working as intended. permalink parent award report block reply PhoneBandit 7 points 22 hours ago Trump will be leaving the office campaigning on, \"keep Maga going! Elect maga conservatives so we can finally get the crooked dems!\" permalink parent award report block reply starjello 4 points 22 hours ago Your comment is much more accurate than the guy you're replying to permalink parent award report block reply Awakened 3 points 22 hours ago Yep. The other guy is still in the fantasy land they hope the whole base is in. The poor sod that this bullshit theater still works on. permalink parent award report block reply\nImYourHuckleberry24 13 points 23 hours ago No. The slow demoralization process. As these things always end in a slap on the wrist, if anything at all. It's working as intended. permalink parent award report block reply PhoneBandit 7 points 22 hours ago Trump will be leaving the office campaigning on, \"keep Maga going! Elect maga conservatives so we can finally get the crooked dems!\" permalink parent award report block reply starjello 4 points 22 hours ago Your comment is much more accurate than the guy you're replying to permalink parent award report block reply Awakened 3 points 22 hours ago Yep. The other guy is still in the fantasy land they hope the whole base is in. The poor sod that this bullshit theater still works on. permalink parent award report block reply\nPhoneBandit 7 points 22 hours ago Trump will be leaving the office campaigning on, \"keep Maga going! Elect maga conservatives so we can finally get the crooked dems!\" permalink parent award report block reply\nstarjello 4 points 22 hours ago Your comment is much more accurate than the guy you're replying to permalink parent award report block reply Awakened 3 points 22 hours ago Yep. The other guy is still in the fantasy land they hope the whole base is in. The poor sod that this bullshit theater still works on. permalink parent award report block reply\nAwakened 3 points 22 hours ago Yep. The other guy is still in the fantasy land they hope the whole base is in. The poor sod that this bullshit theater still works on. permalink parent award report block reply\nPOTUS_DonnieJ 6 points 22 hours ago Why does Bondi need to give Congress the evidence? She is the top law enforcement office in the country. She can make any arrests she needs. permalink award report block reply\nBuild_Back_Bankrupt 5 points 23 hours ago Doyle and Moynihan, those two testified to congress in 2017 or 2018, very interesting hearing. The article labels them \"whistleblowers\", which is technically not the case, they are attorneys who conduct financial audits/analysis of charity organizations for fraud and violations. They do this for profit, basically bounty hunters for the IRS.  In this case they sent their findings to the FBI and the IRS, and if the foundation is prosecuted these guys stand to make 10's of millions in reward money as a % of the damages claimed by the IRS. With that much reward cash on the line my guess is that these guys have been hammering Trump's DOJ to reopen this thing. permalink award report block reply TEXinLA 3 points 22 hours ago No Statute of Limitations for the IRS. They can audit whatever and whenever they want. For the typical taxpayer, keeping 10 years of records tends to suffice. permalink parent award report block reply\nTEXinLA 3 points 22 hours ago No Statute of Limitations for the IRS. They can audit whatever and whenever they want. For the typical taxpayer, keeping 10 years of records tends to suffice. permalink parent award report block reply\nf_bastiat 4 points 23 hours ago Epstein files or gtfo permalink award report block reply Grond999 3 points 23 hours ago \"Excuse me, are you still asking about Epstein?\" permalink parent award report block reply PhilipeNegro 3 points 22 hours ago Too much big Jewbs for Kashie - bobs shown, much denial permalink parent award report block reply\nGrond999 3 points 23 hours ago \"Excuse me, are you still asking about Epstein?\" permalink parent award report block reply\nPhilipeNegro 3 points 22 hours ago Too much big Jewbs for Kashie - bobs shown, much denial permalink parent award report block reply\nTrump2020or4eva 4 points 23 hours ago I'm sure we will see justice swiftly and dished out appropriately. 🤡🤡🤡🤡🤡 permalink award report block reply\nSupaMegaBen 4 points 22 hours ago Why the fuck is it going to Congress instead of a grand jury? FFS I hate Bondi. permalink award report block reply JoinTheDiscussion 3 points 22 hours ago Picked for that reason.. Sooner you see the theater play the better permalink parent award report block reply SupaMegaBen 2 points 22 hours ago Wiles is the real issue. Get rid of her, and get rid of the bubble that Trump is in. permalink parent award report block reply\nJoinTheDiscussion 3 points 22 hours ago Picked for that reason.. Sooner you see the theater play the better permalink parent award report block reply SupaMegaBen 2 points 22 hours ago Wiles is the real issue. Get rid of her, and get rid of the bubble that Trump is in. permalink parent award report block reply\nSupaMegaBen 2 points 22 hours ago Wiles is the real issue. Get rid of her, and get rid of the bubble that Trump is in. permalink parent award report block reply\nTheTelltaleFly 4 points 23 hours ago Did they arrest the pipe bomber yet? Wonder if The Blaze will get the $500k reward. permalink award report block reply starjello 1 points 22 hours ago No they haven't arrested the pipe bomber yet. You might just as well keep it in your pants permalink parent award report block reply\nstarjello 1 points 22 hours ago No they haven't arrested the pipe bomber yet. You might just as well keep it in your pants permalink parent award report block reply\nBidenSniffsLittleKid 4 points 23 hours ago Oh good more red meat with strongly worded letter two weeks from now.\nEdit: tick tock permalink award report block reply\nDiamondDroid 3 points 22 hours ago It's on Pam's desk. Two more weeks. permalink award report block reply JoinTheDiscussion 3 points 22 hours ago Kash has to come shit on her desk first permalink parent award report block reply ArchRespawnsAgain 2 points 21 hours ago \"Kash! This isn't the loo!\" permalink parent award report block reply Trump2024 1 points 21 hours ago And it's sickening permalink parent award report block reply\nJoinTheDiscussion 3 points 22 hours ago Kash has to come shit on her desk first permalink parent award report block reply ArchRespawnsAgain 2 points 21 hours ago \"Kash! This isn't the loo!\" permalink parent award report block reply\nArchRespawnsAgain 2 points 21 hours ago \"Kash! This isn't the loo!\" permalink parent award report block reply\nTrump2024 1 points 21 hours ago And it's sickening permalink parent award report block reply\nAwakened 3 points 22 hours ago This is totally backwards. Congress sends the DOJ and FBI evidence to investigate. If the DOJ or FBI has the evidence already, they can proceed with arrests. This is such obvious fucking theater at this point. To Hell with the whole lot of them. permalink award report block reply\nJoinTheDiscussion 3 points 22 hours ago Blondie and street shitter doing something.. Not holding my breath permalink award report block reply\nTacitus1963 3 points 15 hours ago Bondi and Patel just throwing bones because\na. Trump publicly called her out a few weeks back\nb. Because she knows most of us are mega-pissed at her and Patel.\nc. They stupidly think we will forget about the Epstein Lists\nNothing is really going to happen.\nUnless the RINO party develop massive testicular fortitude, they are going to purposely lose the midterms so that we will be back to peachmints. permalink award report block reply\nbirddogz 2 points 22 hours ago Sternly worded letters, oh my permalink award report block reply\nEurpoean 2 points 23 hours ago FFS arrest someone. permalink award report block reply\nplasticglock 2 points 21 hours ago We DO NOT need to hear about more crimes. We need to hear about some consequences. The FUCKING AROUND part is well documented to say the least. We need to get to the FINDING OUT part already!!! permalink award report block reply plasticglock 1 points 21 hours ago I'm so black pilled I'm gonna steal someone's bike!!! permalink parent award report block reply\nplasticglock 1 points 21 hours ago I'm so black pilled I'm gonna steal someone's bike!!! permalink parent award report block reply\nwaste 2 points 23 hours ago ... and Congress will do ABSOLUTELY NOTHING! because its on Pam's desk. Where are the arrests???? Tonight on Hannity. permalink award report block reply\nOodles 2 points 12 hours ago Bondi and Patel seem pretty good at telling us shit we already know and then doing nothing about it permalink award report block reply\niamimaginos 2 points 22 hours ago Literally everyone on the planet knows the Clintons are as corrupt as they come.  No one in Congress gives a shit.  Tweedle Dee and Tweedle Dum can go back to whatever it was they werent doing permalink award report block reply\nMemeLawd 2 points 23 hours ago Wow lets talk about something that happened 50 years ago RATHER THAN DO SOMETHING ABOUT SHIT ACTUALLY FUCKING HAPPENING TODAY! permalink award report block reply\nParticleCannon 2 points 22 hours ago Many days late, many millions overbudget permalink award report block reply\nRBFace 1 points 12 hours ago Why are Kash and bondi giving it to congress? Why don't they prosecute? permalink award report block reply\nHarvestsmiles 1 points 23 hours ago Clinton Chronicles film still available. Get a copy before it gets Arkancided. permalink award report block reply\nMySidesGoUp 1 points 22 hours ago I like how Sessions and Durham were mentioned.  Some real butch cassidy’s… permalink award report block reply\nJustjayce 1 points 21 hours ago 3...2..1... Nothing will be done permalink award report block reply\nSomedaygrl 1 points 19 hours ago ALL THIS SHIT STARTED WITHTHE CLINTONS!  TAKE THEM ALL DOWN KASH & BONDI! permalink award report block reply\nDCYR66 1 points 12 hours ago The  evidence is sitting on their desks. permalink award report block reply\nNate_Higgersalot 1 points 19 hours ago Epstein files when? permalink award report block reply\nJDVance4President28 1 points 19 hours ago Okay. Add it to the EVIDENCE pile. Soooooo much evidence, yet never any consequences. permalink award report block reply\nFormerlurker92 1 points 23 hours ago I'm tired of finding out new things and having no one go to prison. Without punishment, who cares what they got away with permalink award report block reply\nAggrieved03 1 points 22 hours ago I’m always told Congress has no arrest power so those who do are doing what? permalink award report block reply\nTheMustacheBandit 1 points 22 hours ago I think Bondi has no clue who is in charge of the DOJ. permalink award report block reply\nSomeGuyOnTheInternet 1 points 22 hours ago Wait, why go to Congress?  I thought they were supposed to go to the judiciary branch with this kind of thing, not the legislative. permalink award report block reply\nI_Love_45-70_Gov 1 points 22 hours ago HELL YES!  SO MANY CORRUPT, TREASONOUS ASSHATS BEING ARRSTED AND JAILED THESE DAYS. INCREDIBLY STOKED!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! permalink award report block reply\nGoneViking 1 points 21 hours ago Oh, wow! Bondi and Patel, guys! Bondi and Patel are on it! All our hopes and dreams are realized! permalink award report block reply\nKernalMustard 1 points 21 hours ago Did they both forget they are ones who persecute this? No wonder we're fucked. permalink award report block reply\nmass55th 1 points 20 hours ago They should have been investigated while they were still in the White House taking money from the Chi-coms. Their asian bundlers got charged and went to prison, but somehow the Clintons weren't held responsible for taking foreign cash. Terry McAuliffe was involved in that as well, but he walked, then ran for Governor of Virginia, and got elected. In 2016, while he was still Governor, he was being investigated by the Feds for accepting illegal contributions. In 2018, he was involved in a lawsuit brought by 32 Chinese investors in McAuliffe's start-up Greentech Automotive Inc. that went bust. He was CEO of the company. The investments were made under a federal program that let foreign nationals receive U.S. residency visas if they invest in companies that create U.S. jobs. The 32 investors each put up $500,000. The company received millions in subsidies to build a factory in Mississippi, but the company never got off the ground and went bankrupt. The plaintiffs filed suit, saying Greentech’s failure threatens their ability to remain in the U.S. The old bait and switch routine. I take your money under false pretenses, and then you get it stuck up your ass. In 2017, Virginia state’s auditor demanded the firm repay $6.4 million in public funds. I see no record of that money ever being paid back. What's even worse, Judge Claude Hilton, a Reagan appointee hearing the lawsuit brought forth by the Chinese investors dismissed McAuliffe from the suit, along with his buddy Anthony Rodham...Hillary Clinton's brother. He was alleged to have played a role in recruiting investors and misrepresenting Greentech’s viability. Two big scam artists. Rodham died in 2019 permalink award report block reply\n27Sandino 1 points 23 hours ago No reasonable prosecutor... But they arrest Trump and his lawyers permalink award report block reply\nFusionBlack 1 points 21 hours ago And in other my news.... permalink award report block reply\nAmericanWoman23 1 points 22 hours ago Suddenly Congress members will be committing Arkancide. permalink award report block reply\nPurple_Drank 1 points 13 hours ago Why are they giving the evidence to Congress?  Why don’t Bondi and Patel arrest them? permalink award report block reply\nProtonboy 1 points 16 hours ago Since Congress is the branch of government that files charges, this will finally get the Deep State to stop their monkey shines. permalink award report block reply justinkayz 1 points 15 hours ago Congress can make criminal referrals to the DOJ. The DOJ can then have the FBI arrest them. But in the case of the Clintons, the DOJ sends their findings to Congress to get buried in the swamp muck...committees, hearings, investigations that lead nowhere, sternly written letters, etc., etc. permalink parent award report block reply\njustinkayz 1 points 15 hours ago Congress can make criminal referrals to the DOJ. The DOJ can then have the FBI arrest them. But in the case of the Clintons, the DOJ sends their findings to Congress to get buried in the swamp muck...committees, hearings, investigations that lead nowhere, sternly written letters, etc., etc. permalink parent award report block reply\nRalphusthegreatus 1 points 22 hours ago Comment removed by community moderators. permalink award report block reply"}