{"id": "1ARK9hipmK", "contents": "579 How can anyone take this insufferable douche seriously? posted 2 days ago by Crucible 46 comments award share download report block\n46 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno SALTYinSeattle 36 points 2 days ago He's the worst! Ben and Tel Aviv Levin. Ick. permalink award report block reply YaharaRiver -3 points 2 days ago Worst at what? Saying he won’t eat their ice cream in Israel because he can’t? ya, that’s mighty serious 🙄🤣🤣🤣 Should probably make a mountain out of that molehill permalink parent award report block reply Standingoak 2 points 2 days ago At least you didn't say he isn't  \"a vindictive a-hole\" permalink parent award report block reply Mungo 19 points 2 days ago Who really cares what this Israel first POS thinks? permalink award report block reply EuphoricTrillby 18 points 2 days ago Apparently boomers do. And Ben knows it. That’s why he’s panicking— his grip on conservative culture is dying of old age. permalink parent award report block reply Secondrun007 -18 points 2 days ago He’s correct most of the time.  You just hate Jesus. permalink parent award report block reply EuphoricTrillby 16 points 2 days ago You do realize Ben openly calls Jesus a false prophet, right? permalink parent award report block reply ConfusedAngryArmed 2 points 2 days ago He also doesn't give a damn about the browning of America. permalink parent award report block reply Secondrun007 0 points 2 days ago That’s his opinion.  I believe that he spoke truthfully, but we all are the children of god. permalink parent award report block reply Secondrun007 -1 points 2 days ago He’s correct permalink parent award report block reply fadelio 8 points 2 days ago Vaccine.\nCandace.\n9/11.\nTrump.\nJust off the top of my head things lil Ben was wrong about. permalink parent award report block reply imnotdeadyet 5 points 2 days ago But, but, his sister has big tits! permalink parent award report block reply Secondrun007 1 points 2 days ago Candice is a nazi.  9/11 was a Muslim terror event.  So you’re not exactly 100% permalink parent award report block reply lifeisahologram 7 points 2 days ago Ask Ben what he believes his religion teaches is happening to Jesus right now. permalink parent award report block reply ConfusedAngryArmed 2 points 2 days ago No need, I'll tell the speds here; they believe Jesus is boiling in a pit of excrement in Hell. permalink parent award report block reply 4886Battery 15 points 2 days ago He values Israel more than he values conservatism, not a surprise. Side note: Ben and Jerry's was sold to Unilever more than ten years ago, I believe, and is now sold under their spin off, the Magnum Ice Cream Company.  Now, I boycotted Ben and Jerry's way back when and it pretty much stuck with me after learning Ben and Jerry were no longer receiving any of my pennies if I was to buy it, mostly because I'm also not a fan of Unilever and their DEI policies.  I will say, however, that Unilever has scaled back their DEI promotion and policies recently, booted their social activist CEO, told Ben and Jerry to forget it when they offered a buy-back, and now appear to be mostly neutral, even defending themselves ina lawsuit against Ben and Jerry for exactly this, so I might buy a pint of Dublin Mudslide is it's on sale. permalink award report block reply Honkey_McCracker 9 points 2 days ago Never ate it anyway. Bluebell is a thing. permalink award report block reply DingleBalls 7 points 2 days ago TBH Ben & Jerry's is disgusting. STORE BRAND is better permalink award report block reply Major_Nutt 7 points 2 days ago Let's not be delusional here just to attempt to make a statement. No way in hell does anyone's ass thing Great Value or Best Choice, or even Kirkland's ice cream is better than B&J. permalink parent award report block reply fadelio -1 points 2 days ago Talking about good grocery stores, pleb. permalink parent award report block reply Major_Nutt -1 points 2 days ago Name them. permalink parent award report block reply lifeisahologram 4 points 2 days ago It’s not disgusting imo, but it’s definitely overpriced and isn’t worth it and there are definitely as good or better brands, even for less. permalink parent award report block reply Mungo 4 points 2 days ago Hagen daz permalink parent award report block reply ConfusedAngryArmed 1 points 2 days ago Blue Bell is better. Fight me! permalink parent award report block reply GdotLee 6 points 2 days ago VINDICTIVE ASSHOLE permalink award report block reply fightfightfightx 6 points 2 days ago ben is vehemently racist and vicdictive he's a wolf in sheeps clothing among conservatives, pretending to be something he is not the reason he's okay with the ice cream initially is because they were anti-American and anti-white. The moment he thinks they question Israel though, NO MORE ICE CREAM! ben is a genocidal and evil, just like the rest of his Synagogue of Satan permalink award report block reply MagaJay02 5 points 2 days ago Ben Shapiro is the definition of a twat permalink award report block reply 45fan 4 points 2 days ago \"Hi folks, my bosses in the IDF say to support Israel first!\" -Ben Shapiro permalink award report block reply JDVance4President28 4 points 2 days ago Reject MIGA Support MAGA Never stop the noticing and never stop pointing out where Israel is putting people and money to influence Americans. permalink award report block reply TrustYourself 3 points 2 days ago Ben and Jerry's also getting a big dose of \"you can never be woke enough\" permalink award report block reply Wildwind 3 points 2 days ago Their ice cream is shit. permalink award report block reply YaharaRiver 1 points 2 days ago it is pretty heavy, I like ice cream to be light, like mint choc chip permalink parent award report block reply DiscountFedoras 2 points 2 days ago 13 years apart Purity test permalink award report block reply YaharaRiver 2 points 2 days ago ty, i was wondering why the date on the bottom wasn’t given, lol. permalink parent award report block reply patrioticwinning3 2 points 2 days ago Because they are MIGA :p permalink award report block reply OneTypoComment 2 points 2 days ago and the Nazi party had very stylish uniforms and their salute was tight af. permalink award report block reply Agent_86 1 points 2 days ago He said this back in 2012? AYFKM? permalink award report block reply Secondrun007 1 points 2 days ago Who’s the worst?  Not Ben alone, but Ben & Jerry are retarded Stormfaggy Jew haters like 60% of this site permalink award report block reply sordfysh PRO 1 points 2 days ago So it's okay to hate white people, but just questioning Israel makes someone evil? Is this what they teach you in Tel Aviv? permalink parent award report block reply Agent_86 0 points 2 days ago Deleted from view. permalink award report block reply Smurfection 0 points 2 days ago Israel First is all over media and I am livid about the way they treated the American Heritage Foundation.  LIVID! permalink award report block reply TheSwampThang 0 points 2 days ago He should make another rap song with Tom McDonald permalink award report block reply votedforthe45th -9 points 2 days ago way to pull out 2012 tweets just to stick it to the conservative jew ... when your ideology aligns with your jihadist masters makes you wonder what the fuck are you doing on this site ...  christians slaves are the worst ... they are the ultimate flutters of their Qatar masters .. permalink award report block reply rebuildingMyself 2 points 2 days ago Hit a nerve, Ben? permalink parent award report block reply HoodooOperator 1 points 2 days ago Comment removed by community moderators. permalink award report block reply\nSALTYinSeattle 36 points 2 days ago He's the worst! Ben and Tel Aviv Levin. Ick. permalink award report block reply YaharaRiver -3 points 2 days ago Worst at what? Saying he won’t eat their ice cream in Israel because he can’t? ya, that’s mighty serious 🙄🤣🤣🤣 Should probably make a mountain out of that molehill permalink parent award report block reply Standingoak 2 points 2 days ago At least you didn't say he isn't  \"a vindictive a-hole\" permalink parent award report block reply\nYaharaRiver -3 points 2 days ago Worst at what? Saying he won’t eat their ice cream in Israel because he can’t? ya, that’s mighty serious 🙄🤣🤣🤣 Should probably make a mountain out of that molehill permalink parent award report block reply Standingoak 2 points 2 days ago At least you didn't say he isn't  \"a vindictive a-hole\" permalink parent award report block reply\nStandingoak 2 points 2 days ago At least you didn't say he isn't  \"a vindictive a-hole\" permalink parent award report block reply\nMungo 19 points 2 days ago Who really cares what this Israel first POS thinks? permalink award report block reply EuphoricTrillby 18 points 2 days ago Apparently boomers do. And Ben knows it. That’s why he’s panicking— his grip on conservative culture is dying of old age. permalink parent award report block reply Secondrun007 -18 points 2 days ago He’s correct most of the time.  You just hate Jesus. permalink parent award report block reply EuphoricTrillby 16 points 2 days ago You do realize Ben openly calls Jesus a false prophet, right? permalink parent award report block reply ConfusedAngryArmed 2 points 2 days ago He also doesn't give a damn about the browning of America. permalink parent award report block reply Secondrun007 0 points 2 days ago That’s his opinion.  I believe that he spoke truthfully, but we all are the children of god. permalink parent award report block reply Secondrun007 -1 points 2 days ago He’s correct permalink parent award report block reply fadelio 8 points 2 days ago Vaccine.\nCandace.\n9/11.\nTrump.\nJust off the top of my head things lil Ben was wrong about. permalink parent award report block reply imnotdeadyet 5 points 2 days ago But, but, his sister has big tits! permalink parent award report block reply Secondrun007 1 points 2 days ago Candice is a nazi.  9/11 was a Muslim terror event.  So you’re not exactly 100% permalink parent award report block reply lifeisahologram 7 points 2 days ago Ask Ben what he believes his religion teaches is happening to Jesus right now. permalink parent award report block reply ConfusedAngryArmed 2 points 2 days ago No need, I'll tell the speds here; they believe Jesus is boiling in a pit of excrement in Hell. permalink parent award report block reply\nEuphoricTrillby 18 points 2 days ago Apparently boomers do. And Ben knows it. That’s why he’s panicking— his grip on conservative culture is dying of old age. permalink parent award report block reply Secondrun007 -18 points 2 days ago He’s correct most of the time.  You just hate Jesus. permalink parent award report block reply EuphoricTrillby 16 points 2 days ago You do realize Ben openly calls Jesus a false prophet, right? permalink parent award report block reply ConfusedAngryArmed 2 points 2 days ago He also doesn't give a damn about the browning of America. permalink parent award report block reply Secondrun007 0 points 2 days ago That’s his opinion.  I believe that he spoke truthfully, but we all are the children of god. permalink parent award report block reply Secondrun007 -1 points 2 days ago He’s correct permalink parent award report block reply fadelio 8 points 2 days ago Vaccine.\nCandace.\n9/11.\nTrump.\nJust off the top of my head things lil Ben was wrong about. permalink parent award report block reply imnotdeadyet 5 points 2 days ago But, but, his sister has big tits! permalink parent award report block reply Secondrun007 1 points 2 days ago Candice is a nazi.  9/11 was a Muslim terror event.  So you’re not exactly 100% permalink parent award report block reply lifeisahologram 7 points 2 days ago Ask Ben what he believes his religion teaches is happening to Jesus right now. permalink parent award report block reply ConfusedAngryArmed 2 points 2 days ago No need, I'll tell the speds here; they believe Jesus is boiling in a pit of excrement in Hell. permalink parent award report block reply\nSecondrun007 -18 points 2 days ago He’s correct most of the time.  You just hate Jesus. permalink parent award report block reply EuphoricTrillby 16 points 2 days ago You do realize Ben openly calls Jesus a false prophet, right? permalink parent award report block reply ConfusedAngryArmed 2 points 2 days ago He also doesn't give a damn about the browning of America. permalink parent award report block reply Secondrun007 0 points 2 days ago That’s his opinion.  I believe that he spoke truthfully, but we all are the children of god. permalink parent award report block reply Secondrun007 -1 points 2 days ago He’s correct permalink parent award report block reply fadelio 8 points 2 days ago Vaccine.\nCandace.\n9/11.\nTrump.\nJust off the top of my head things lil Ben was wrong about. permalink parent award report block reply imnotdeadyet 5 points 2 days ago But, but, his sister has big tits! permalink parent award report block reply Secondrun007 1 points 2 days ago Candice is a nazi.  9/11 was a Muslim terror event.  So you’re not exactly 100% permalink parent award report block reply lifeisahologram 7 points 2 days ago Ask Ben what he believes his religion teaches is happening to Jesus right now. permalink parent award report block reply ConfusedAngryArmed 2 points 2 days ago No need, I'll tell the speds here; they believe Jesus is boiling in a pit of excrement in Hell. permalink parent award report block reply\nEuphoricTrillby 16 points 2 days ago You do realize Ben openly calls Jesus a false prophet, right? permalink parent award report block reply ConfusedAngryArmed 2 points 2 days ago He also doesn't give a damn about the browning of America. permalink parent award report block reply Secondrun007 0 points 2 days ago That’s his opinion.  I believe that he spoke truthfully, but we all are the children of god. permalink parent award report block reply Secondrun007 -1 points 2 days ago He’s correct permalink parent award report block reply\nConfusedAngryArmed 2 points 2 days ago He also doesn't give a damn about the browning of America. permalink parent award report block reply\nSecondrun007 0 points 2 days ago That’s his opinion.  I believe that he spoke truthfully, but we all are the children of god. permalink parent award report block reply\nSecondrun007 -1 points 2 days ago He’s correct permalink parent award report block reply\nfadelio 8 points 2 days ago Vaccine.\nCandace.\n9/11.\nTrump.\nJust off the top of my head things lil Ben was wrong about. permalink parent award report block reply imnotdeadyet 5 points 2 days ago But, but, his sister has big tits! permalink parent award report block reply Secondrun007 1 points 2 days ago Candice is a nazi.  9/11 was a Muslim terror event.  So you’re not exactly 100% permalink parent award report block reply\nimnotdeadyet 5 points 2 days ago But, but, his sister has big tits! permalink parent award report block reply\nSecondrun007 1 points 2 days ago Candice is a nazi.  9/11 was a Muslim terror event.  So you’re not exactly 100% permalink parent award report block reply\nlifeisahologram 7 points 2 days ago Ask Ben what he believes his religion teaches is happening to Jesus right now. permalink parent award report block reply ConfusedAngryArmed 2 points 2 days ago No need, I'll tell the speds here; they believe Jesus is boiling in a pit of excrement in Hell. permalink parent award report block reply\nConfusedAngryArmed 2 points 2 days ago No need, I'll tell the speds here; they believe Jesus is boiling in a pit of excrement in Hell. permalink parent award report block reply\n4886Battery 15 points 2 days ago He values Israel more than he values conservatism, not a surprise. Side note: Ben and Jerry's was sold to Unilever more than ten years ago, I believe, and is now sold under their spin off, the Magnum Ice Cream Company.  Now, I boycotted Ben and Jerry's way back when and it pretty much stuck with me after learning Ben and Jerry were no longer receiving any of my pennies if I was to buy it, mostly because I'm also not a fan of Unilever and their DEI policies.  I will say, however, that Unilever has scaled back their DEI promotion and policies recently, booted their social activist CEO, told Ben and Jerry to forget it when they offered a buy-back, and now appear to be mostly neutral, even defending themselves ina lawsuit against Ben and Jerry for exactly this, so I might buy a pint of Dublin Mudslide is it's on sale. permalink award report block reply\nHonkey_McCracker 9 points 2 days ago Never ate it anyway. Bluebell is a thing. permalink award report block reply\nDingleBalls 7 points 2 days ago TBH Ben & Jerry's is disgusting. STORE BRAND is better permalink award report block reply Major_Nutt 7 points 2 days ago Let's not be delusional here just to attempt to make a statement. No way in hell does anyone's ass thing Great Value or Best Choice, or even Kirkland's ice cream is better than B&J. permalink parent award report block reply fadelio -1 points 2 days ago Talking about good grocery stores, pleb. permalink parent award report block reply Major_Nutt -1 points 2 days ago Name them. permalink parent award report block reply lifeisahologram 4 points 2 days ago It’s not disgusting imo, but it’s definitely overpriced and isn’t worth it and there are definitely as good or better brands, even for less. permalink parent award report block reply Mungo 4 points 2 days ago Hagen daz permalink parent award report block reply ConfusedAngryArmed 1 points 2 days ago Blue Bell is better. Fight me! permalink parent award report block reply\nMajor_Nutt 7 points 2 days ago Let's not be delusional here just to attempt to make a statement. No way in hell does anyone's ass thing Great Value or Best Choice, or even Kirkland's ice cream is better than B&J. permalink parent award report block reply fadelio -1 points 2 days ago Talking about good grocery stores, pleb. permalink parent award report block reply Major_Nutt -1 points 2 days ago Name them. permalink parent award report block reply\nfadelio -1 points 2 days ago Talking about good grocery stores, pleb. permalink parent award report block reply Major_Nutt -1 points 2 days ago Name them. permalink parent award report block reply\nMajor_Nutt -1 points 2 days ago Name them. permalink parent award report block reply\nlifeisahologram 4 points 2 days ago It’s not disgusting imo, but it’s definitely overpriced and isn’t worth it and there are definitely as good or better brands, even for less. permalink parent award report block reply\nMungo 4 points 2 days ago Hagen daz permalink parent award report block reply\nConfusedAngryArmed 1 points 2 days ago Blue Bell is better. Fight me! permalink parent award report block reply\nGdotLee 6 points 2 days ago VINDICTIVE ASSHOLE permalink award report block reply\nfightfightfightx 6 points 2 days ago ben is vehemently racist and vicdictive he's a wolf in sheeps clothing among conservatives, pretending to be something he is not the reason he's okay with the ice cream initially is because they were anti-American and anti-white. The moment he thinks they question Israel though, NO MORE ICE CREAM! ben is a genocidal and evil, just like the rest of his Synagogue of Satan permalink award report block reply\nMagaJay02 5 points 2 days ago Ben Shapiro is the definition of a twat permalink award report block reply\n45fan 4 points 2 days ago \"Hi folks, my bosses in the IDF say to support Israel first!\" -Ben Shapiro permalink award report block reply\nJDVance4President28 4 points 2 days ago Reject MIGA Support MAGA Never stop the noticing and never stop pointing out where Israel is putting people and money to influence Americans. permalink award report block reply\nTrustYourself 3 points 2 days ago Ben and Jerry's also getting a big dose of \"you can never be woke enough\" permalink award report block reply\nWildwind 3 points 2 days ago Their ice cream is shit. permalink award report block reply YaharaRiver 1 points 2 days ago it is pretty heavy, I like ice cream to be light, like mint choc chip permalink parent award report block reply\nYaharaRiver 1 points 2 days ago it is pretty heavy, I like ice cream to be light, like mint choc chip permalink parent award report block reply\nDiscountFedoras 2 points 2 days ago 13 years apart Purity test permalink award report block reply YaharaRiver 2 points 2 days ago ty, i was wondering why the date on the bottom wasn’t given, lol. permalink parent award report block reply\nYaharaRiver 2 points 2 days ago ty, i was wondering why the date on the bottom wasn’t given, lol. permalink parent award report block reply\npatrioticwinning3 2 points 2 days ago Because they are MIGA :p permalink award report block reply\nOneTypoComment 2 points 2 days ago and the Nazi party had very stylish uniforms and their salute was tight af. permalink award report block reply\nAgent_86 1 points 2 days ago He said this back in 2012? AYFKM? permalink award report block reply\nSecondrun007 1 points 2 days ago Who’s the worst?  Not Ben alone, but Ben & Jerry are retarded Stormfaggy Jew haters like 60% of this site permalink award report block reply sordfysh PRO 1 points 2 days ago So it's okay to hate white people, but just questioning Israel makes someone evil? Is this what they teach you in Tel Aviv? permalink parent award report block reply\nsordfysh PRO 1 points 2 days ago So it's okay to hate white people, but just questioning Israel makes someone evil? Is this what they teach you in Tel Aviv? permalink parent award report block reply\nAgent_86 0 points 2 days ago Deleted from view. permalink award report block reply\nSmurfection 0 points 2 days ago Israel First is all over media and I am livid about the way they treated the American Heritage Foundation.  LIVID! permalink award report block reply\nTheSwampThang 0 points 2 days ago He should make another rap song with Tom McDonald permalink award report block reply\nvotedforthe45th -9 points 2 days ago way to pull out 2012 tweets just to stick it to the conservative jew ... when your ideology aligns with your jihadist masters makes you wonder what the fuck are you doing on this site ...  christians slaves are the worst ... they are the ultimate flutters of their Qatar masters .. permalink award report block reply rebuildingMyself 2 points 2 days ago Hit a nerve, Ben? permalink parent award report block reply\nrebuildingMyself 2 points 2 days ago Hit a nerve, Ben? permalink parent award report block reply\nHoodooOperator 1 points 2 days ago Comment removed by community moderators. permalink award report block reply"}