{"id": "1ARK9oWvS7", "contents": "33 Better than EBT posted 1 hour ago by rdvs34283 9 comments award share report block Wall Street Apes @WallStreetApes • 8h This is what the state of Louisiana gives with their “commodities supplemental food program” where they give the elderly one box of food a month The entire nation’s food stamps program should be changed over to this No more EBT payments for fast food, junk and fraud\n9 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Rerun1Central 5 points 1 hour ago throw in some cigarettes and a fifth of whiskey and some matches permalink award report block reply Awakened 1 points 40 minutes ago At least gramma would have a reason to get out of bed. permalink parent award report block reply CleanUpPhillyTrump24 2 points 23 minutes ago American kids would be so much healthier. Also the IQ of kids would rise vastly on average if their developing brains got real food instead of junk, candy, cakes, and soda. I don't think good people realize that this is really all most kids get on SNAP. They get meat when there's a BBQ or mom fries up something but there are no veggies at all and no real no-sugar-added fruit of any kind. Might be the rare bananas and that's it. IQs of American children have plummeted. We have to reverse that and yes the EBTishas will screech, all races, creeds, and colors. permalink award report block reply LaptopDied 1 points 1 hour ago Very good! permalink award report block reply CleanUpPhillyTrump24 2 points 17 minutes ago Love it. permalink parent award report block reply Wildwind 0 points 47 minutes ago My God, just  poison them. Look at what your feeding them. The can of beef alone shouldnt even be gifted to 3rd world countries. Let alone the can vegs. Filled with shit chemicals and loaded with salt. If you as a daughter really cared about what your mother is eating then go buy her some good organic  food.  Do the research of what a can of corn really has inside it. Stop poisoning her. permalink award report block reply CleanUpPhillyTrump24 1 points 18 minutes ago That box is far more nutritious than what people buy with SNAP now. Kids will be healthier, Medicaid/care costs will drop off, kids won't be Type II diabetics before they're 9 years old. GTFO here. If American kids ate that now, they'd be healthier, and their brains would grow normally. Right now welfare is a pussy-to-prison pipeline because moms buy what will shut the kids up not what they need to grow. Since SNAP was cut, there are no more chips bags, sugary cake packages like Little Debbies, no more candy wrappers, gum, soda cans, malt liquor bottles, cigarette and cigarillo packs, and crack baggies in front of my rental properties. I went from ONE BAG a DAY to NOTHING. One malt liquor bottle, and one little pie pan. Not only are people eating trash and selling their yamps (urban slang for stamps), they have zero respect for the people paying for it. Now that ends. People will eat better, kids will be more healthy, and the dividend will be greatly reduced fraud and healthcare costs to the taxpayer. permalink parent award report block reply YaharaRiver 0 points 59 minutes ago I could not get through a month on just that. :( Swap out ALL those lame canned veg for tuna and mayo, swap the cereal for Triscuits, drop the cherry drink and add a pound of coffee.  Daughter, bring her a pint of good brandy and the hits from 1955-1965 if you have not already done so. Seniors eat like birds, and they should have top quality. This is food for a 40 yr old STREET BUM. permalink award report block reply CleanUpPhillyTrump24 1 points 17 minutes ago This is so much more nutritious than chips, soda, cake, cookies, processed frozen junk, and what SNAPpers buy now. Vast improvement. You might not like humble food but your body does. permalink parent award report block reply\nRerun1Central 5 points 1 hour ago throw in some cigarettes and a fifth of whiskey and some matches permalink award report block reply Awakened 1 points 40 minutes ago At least gramma would have a reason to get out of bed. permalink parent award report block reply\nAwakened 1 points 40 minutes ago At least gramma would have a reason to get out of bed. permalink parent award report block reply\nCleanUpPhillyTrump24 2 points 23 minutes ago American kids would be so much healthier. Also the IQ of kids would rise vastly on average if their developing brains got real food instead of junk, candy, cakes, and soda. I don't think good people realize that this is really all most kids get on SNAP. They get meat when there's a BBQ or mom fries up something but there are no veggies at all and no real no-sugar-added fruit of any kind. Might be the rare bananas and that's it. IQs of American children have plummeted. We have to reverse that and yes the EBTishas will screech, all races, creeds, and colors. permalink award report block reply\nLaptopDied 1 points 1 hour ago Very good! permalink award report block reply CleanUpPhillyTrump24 2 points 17 minutes ago Love it. permalink parent award report block reply\nCleanUpPhillyTrump24 2 points 17 minutes ago Love it. permalink parent award report block reply\nWildwind 0 points 47 minutes ago My God, just  poison them. Look at what your feeding them. The can of beef alone shouldnt even be gifted to 3rd world countries. Let alone the can vegs. Filled with shit chemicals and loaded with salt. If you as a daughter really cared about what your mother is eating then go buy her some good organic  food.  Do the research of what a can of corn really has inside it. Stop poisoning her. permalink award report block reply CleanUpPhillyTrump24 1 points 18 minutes ago That box is far more nutritious than what people buy with SNAP now. Kids will be healthier, Medicaid/care costs will drop off, kids won't be Type II diabetics before they're 9 years old. GTFO here. If American kids ate that now, they'd be healthier, and their brains would grow normally. Right now welfare is a pussy-to-prison pipeline because moms buy what will shut the kids up not what they need to grow. Since SNAP was cut, there are no more chips bags, sugary cake packages like Little Debbies, no more candy wrappers, gum, soda cans, malt liquor bottles, cigarette and cigarillo packs, and crack baggies in front of my rental properties. I went from ONE BAG a DAY to NOTHING. One malt liquor bottle, and one little pie pan. Not only are people eating trash and selling their yamps (urban slang for stamps), they have zero respect for the people paying for it. Now that ends. People will eat better, kids will be more healthy, and the dividend will be greatly reduced fraud and healthcare costs to the taxpayer. permalink parent award report block reply\nCleanUpPhillyTrump24 1 points 18 minutes ago That box is far more nutritious than what people buy with SNAP now. Kids will be healthier, Medicaid/care costs will drop off, kids won't be Type II diabetics before they're 9 years old. GTFO here. If American kids ate that now, they'd be healthier, and their brains would grow normally. Right now welfare is a pussy-to-prison pipeline because moms buy what will shut the kids up not what they need to grow. Since SNAP was cut, there are no more chips bags, sugary cake packages like Little Debbies, no more candy wrappers, gum, soda cans, malt liquor bottles, cigarette and cigarillo packs, and crack baggies in front of my rental properties. I went from ONE BAG a DAY to NOTHING. One malt liquor bottle, and one little pie pan. Not only are people eating trash and selling their yamps (urban slang for stamps), they have zero respect for the people paying for it. Now that ends. People will eat better, kids will be more healthy, and the dividend will be greatly reduced fraud and healthcare costs to the taxpayer. permalink parent award report block reply\nYaharaRiver 0 points 59 minutes ago I could not get through a month on just that. :( Swap out ALL those lame canned veg for tuna and mayo, swap the cereal for Triscuits, drop the cherry drink and add a pound of coffee.  Daughter, bring her a pint of good brandy and the hits from 1955-1965 if you have not already done so. Seniors eat like birds, and they should have top quality. This is food for a 40 yr old STREET BUM. permalink award report block reply CleanUpPhillyTrump24 1 points 17 minutes ago This is so much more nutritious than chips, soda, cake, cookies, processed frozen junk, and what SNAPpers buy now. Vast improvement. You might not like humble food but your body does. permalink parent award report block reply\nCleanUpPhillyTrump24 1 points 17 minutes ago This is so much more nutritious than chips, soda, cake, cookies, processed frozen junk, and what SNAPpers buy now. Vast improvement. You might not like humble food but your body does. permalink parent award report block reply"}