{"id": "1ARK9pelwS", "contents": "81 Jesse Jackson has been hospitalized in Chicago. He is 84 years old. posted 11 hours ago by Mr_Rightside 19 comments award share download report block\n19 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style JoeBidensDementia1 11 points 11 hours ago Racism finally gonna kill dis negro. permalink award report block reply BillGateCanSuckIt 6 points 11 hours ago Netflix in 3, 2, 1.... permalink parent award report block reply Taylor3006 9 points 11 hours ago <insert shrug here> Anyone else just find out that Jesse Jackson was still alive? Who knew? permalink award report block reply RINO_fatigue 6 points 11 hours ago I bet he has all White male doctors and doesn't trust any of those DEI posers permalink award report block reply HanginChad 5 points 11 hours ago I never thought I'd have something in common with him. Thanks for messing up my day. permalink parent award report block reply Tikk 5 points 11 hours ago The point is moot. permalink award report block reply Piglips 2 points 11 hours ago Winner permalink parent award report block reply ramennov 3 points 11 hours ago Bye nigga permalink award report block reply Piglips 2 points 11 hours ago Ugly, too. permalink award report block reply BlackJack1776 2 points 11 hours ago Oh no... So anyway. permalink award report block reply Wrexxis780 2 points 11 hours ago The fuck happened to his face? permalink award report block reply schism 1 points 10 hours ago He wears his grift. permalink parent award report block reply MasterChief 1 points 11 hours ago wuts wrong with his face? https://en.wikipedia.org/wiki/Lori_Lightfoot#/media/File:Lori_Lightfoot_(52676468649)_(3x4).jpg permalink parent award report block reply Wrexxis780 1 points 11 hours ago Ugh double vomits permalink parent award report block reply Trump454748 1 points 3 hours ago So the crooked race hustling grifter is finally gonna get the chance to meet his maker. Buh bye. permalink award report block reply Mr_Rightside OP 1 points 11 hours ago https://x.com/TheCalvinCooli1/status/1988808487363874960 permalink award report block reply maleitch 1 points 10 hours ago Wonder how many of you were alive to see this race grifter invent the Marxist term African-American permalink award report block reply HillarysBeaverMunch 1 points 11 hours ago I dislike him personally,  for obvious reasons, but I picked up a truism from him several decades ago: \"Just because a cat has kittens in an oven, that don't make 'em biscuits \". permalink award report block reply SCHULTZ 1 points 11 hours ago Comment removed by community moderators. permalink award report block reply\nJoeBidensDementia1 11 points 11 hours ago Racism finally gonna kill dis negro. permalink award report block reply BillGateCanSuckIt 6 points 11 hours ago Netflix in 3, 2, 1.... permalink parent award report block reply\nBillGateCanSuckIt 6 points 11 hours ago Netflix in 3, 2, 1.... permalink parent award report block reply\nTaylor3006 9 points 11 hours ago <insert shrug here> Anyone else just find out that Jesse Jackson was still alive? Who knew? permalink award report block reply\nRINO_fatigue 6 points 11 hours ago I bet he has all White male doctors and doesn't trust any of those DEI posers permalink award report block reply HanginChad 5 points 11 hours ago I never thought I'd have something in common with him. Thanks for messing up my day. permalink parent award report block reply\nHanginChad 5 points 11 hours ago I never thought I'd have something in common with him. Thanks for messing up my day. permalink parent award report block reply\nTikk 5 points 11 hours ago The point is moot. permalink award report block reply Piglips 2 points 11 hours ago Winner permalink parent award report block reply\nPiglips 2 points 11 hours ago Winner permalink parent award report block reply\nramennov 3 points 11 hours ago Bye nigga permalink award report block reply\nPiglips 2 points 11 hours ago Ugly, too. permalink award report block reply\nBlackJack1776 2 points 11 hours ago Oh no... So anyway. permalink award report block reply\nWrexxis780 2 points 11 hours ago The fuck happened to his face? permalink award report block reply schism 1 points 10 hours ago He wears his grift. permalink parent award report block reply MasterChief 1 points 11 hours ago wuts wrong with his face? https://en.wikipedia.org/wiki/Lori_Lightfoot#/media/File:Lori_Lightfoot_(52676468649)_(3x4).jpg permalink parent award report block reply Wrexxis780 1 points 11 hours ago Ugh double vomits permalink parent award report block reply\nschism 1 points 10 hours ago He wears his grift. permalink parent award report block reply\nMasterChief 1 points 11 hours ago wuts wrong with his face? https://en.wikipedia.org/wiki/Lori_Lightfoot#/media/File:Lori_Lightfoot_(52676468649)_(3x4).jpg permalink parent award report block reply Wrexxis780 1 points 11 hours ago Ugh double vomits permalink parent award report block reply\nWrexxis780 1 points 11 hours ago Ugh double vomits permalink parent award report block reply\nTrump454748 1 points 3 hours ago So the crooked race hustling grifter is finally gonna get the chance to meet his maker. Buh bye. permalink award report block reply\nMr_Rightside OP 1 points 11 hours ago https://x.com/TheCalvinCooli1/status/1988808487363874960 permalink award report block reply\nmaleitch 1 points 10 hours ago Wonder how many of you were alive to see this race grifter invent the Marxist term African-American permalink award report block reply\nHillarysBeaverMunch 1 points 11 hours ago I dislike him personally,  for obvious reasons, but I picked up a truism from him several decades ago: \"Just because a cat has kittens in an oven, that don't make 'em biscuits \". permalink award report block reply\nSCHULTZ 1 points 11 hours ago Comment removed by community moderators. permalink award report block reply"}