{"id": "1ARK9jzts1", "contents": "269 JOLT! - It's not just an energy drink any more! posted 1 day ago by nufosmatic 15 comments award share report block Attorney General Ken Paxton @KenPaxtonTX • 2d BREAKING: I'm suing a radical organization for unlawfully registering illegals to vote in Texas. Any organization attempting to register illegals, who are all criminals, must be completely crushed and shut down immediately.\n15 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget Crucial8GB 4 points 1 day ago Do they still sell Jolt cola? permalink award report block reply midwestdeplorable 4 points 1 day ago Not sure but that was some nasty shit back in the day. permalink parent award report block reply you_know_GOAT 2 points 24 hours ago Jolt was nasty. I can't believe how much Mountain Dew I used to drink back in the day. Haven't touched any soda's in 10+ years. Nasty shit. Quit soda and now do not have sugar drops and pre-diabetes bullshit. Used to think I had to carry Beef Jerky because my body was having sugar/protein drops. No, it was all the sodas/sugar and my body craving them. Nasty shit. permalink parent award report block reply midwestdeplorable 1 points 23 hours ago I drank 4 or 5 cans a day there for awhile back in my younger years, and ended up with 12 cavities over the span of about 6 years. Can't even stand the taste of most soda these days and rarely drink it, even then it's a small serving. permalink parent award report block reply South_Florida_Guy 2 points 1 day ago You could clean engine parts with it! permalink parent award report block reply midwestdeplorable 1 points 1 day ago Yep! Did wonders on rusty bolts too lol. permalink parent award report block reply nufosmatic OP 2 points 1 day ago https://www.joltcola.com/store-finder/ Might explain the recent election of The Karenburger in Richmond... (zoom in on Richmond, Virginia...) permalink parent award report block reply South_Florida_Guy 2 points 1 day ago Used to love that stuff in high school! permalink parent award report block reply Perseverant 2 points 1 day ago I used to drink some then play Unreal Tournament on my top of the line 19\" Samsung CRT that could do 100hz at 1024x768 😁 permalink parent award report block reply Sunnywindows 2 points 1 day ago Suing???  It’s time to start arresting, conviction and incarcerating these people.  Get them off the streets. permalink award report block reply Sunnywindows 2 points 1 day ago So…. Where is this radical organization getting its funding…?  American taxpayers probably.  So this AG is using taxpayer money to sue an organization that will be using taxpayer money to defend itself.  Huh. permalink award report block reply TerryBibble 2 points 1 day ago Unless they're muslim. Texas dgaf about muslims permalink award report block reply Perseverant 1 points 1 day ago He is at least messaging it right.  \"Illegals, who are all criminals.\" I am so tired of the phrase \"criminal illegal aliens\" to distinguish dangerous illegals from docile illegals. permalink award report block reply nufosmatic OP 1 points 4 hours ago CRIMINAL ALIENS. permalink parent award report block reply MastaJoda 1 points 1 day ago So, your faggot ass isnt seeking criminal charges just money? How very RINO Party of you. You'll fill in well for Cornyn... permalink award report block reply\nCrucial8GB 4 points 1 day ago Do they still sell Jolt cola? permalink award report block reply midwestdeplorable 4 points 1 day ago Not sure but that was some nasty shit back in the day. permalink parent award report block reply you_know_GOAT 2 points 24 hours ago Jolt was nasty. I can't believe how much Mountain Dew I used to drink back in the day. Haven't touched any soda's in 10+ years. Nasty shit. Quit soda and now do not have sugar drops and pre-diabetes bullshit. Used to think I had to carry Beef Jerky because my body was having sugar/protein drops. No, it was all the sodas/sugar and my body craving them. Nasty shit. permalink parent award report block reply midwestdeplorable 1 points 23 hours ago I drank 4 or 5 cans a day there for awhile back in my younger years, and ended up with 12 cavities over the span of about 6 years. Can't even stand the taste of most soda these days and rarely drink it, even then it's a small serving. permalink parent award report block reply South_Florida_Guy 2 points 1 day ago You could clean engine parts with it! permalink parent award report block reply midwestdeplorable 1 points 1 day ago Yep! Did wonders on rusty bolts too lol. permalink parent award report block reply nufosmatic OP 2 points 1 day ago https://www.joltcola.com/store-finder/ Might explain the recent election of The Karenburger in Richmond... (zoom in on Richmond, Virginia...) permalink parent award report block reply South_Florida_Guy 2 points 1 day ago Used to love that stuff in high school! permalink parent award report block reply Perseverant 2 points 1 day ago I used to drink some then play Unreal Tournament on my top of the line 19\" Samsung CRT that could do 100hz at 1024x768 😁 permalink parent award report block reply\nmidwestdeplorable 4 points 1 day ago Not sure but that was some nasty shit back in the day. permalink parent award report block reply you_know_GOAT 2 points 24 hours ago Jolt was nasty. I can't believe how much Mountain Dew I used to drink back in the day. Haven't touched any soda's in 10+ years. Nasty shit. Quit soda and now do not have sugar drops and pre-diabetes bullshit. Used to think I had to carry Beef Jerky because my body was having sugar/protein drops. No, it was all the sodas/sugar and my body craving them. Nasty shit. permalink parent award report block reply midwestdeplorable 1 points 23 hours ago I drank 4 or 5 cans a day there for awhile back in my younger years, and ended up with 12 cavities over the span of about 6 years. Can't even stand the taste of most soda these days and rarely drink it, even then it's a small serving. permalink parent award report block reply South_Florida_Guy 2 points 1 day ago You could clean engine parts with it! permalink parent award report block reply midwestdeplorable 1 points 1 day ago Yep! Did wonders on rusty bolts too lol. permalink parent award report block reply\nyou_know_GOAT 2 points 24 hours ago Jolt was nasty. I can't believe how much Mountain Dew I used to drink back in the day. Haven't touched any soda's in 10+ years. Nasty shit. Quit soda and now do not have sugar drops and pre-diabetes bullshit. Used to think I had to carry Beef Jerky because my body was having sugar/protein drops. No, it was all the sodas/sugar and my body craving them. Nasty shit. permalink parent award report block reply midwestdeplorable 1 points 23 hours ago I drank 4 or 5 cans a day there for awhile back in my younger years, and ended up with 12 cavities over the span of about 6 years. Can't even stand the taste of most soda these days and rarely drink it, even then it's a small serving. permalink parent award report block reply\nmidwestdeplorable 1 points 23 hours ago I drank 4 or 5 cans a day there for awhile back in my younger years, and ended up with 12 cavities over the span of about 6 years. Can't even stand the taste of most soda these days and rarely drink it, even then it's a small serving. permalink parent award report block reply\nSouth_Florida_Guy 2 points 1 day ago You could clean engine parts with it! permalink parent award report block reply midwestdeplorable 1 points 1 day ago Yep! Did wonders on rusty bolts too lol. permalink parent award report block reply\nmidwestdeplorable 1 points 1 day ago Yep! Did wonders on rusty bolts too lol. permalink parent award report block reply\nnufosmatic OP 2 points 1 day ago https://www.joltcola.com/store-finder/ Might explain the recent election of The Karenburger in Richmond... (zoom in on Richmond, Virginia...) permalink parent award report block reply\nSouth_Florida_Guy 2 points 1 day ago Used to love that stuff in high school! permalink parent award report block reply Perseverant 2 points 1 day ago I used to drink some then play Unreal Tournament on my top of the line 19\" Samsung CRT that could do 100hz at 1024x768 😁 permalink parent award report block reply\nPerseverant 2 points 1 day ago I used to drink some then play Unreal Tournament on my top of the line 19\" Samsung CRT that could do 100hz at 1024x768 😁 permalink parent award report block reply\nSunnywindows 2 points 1 day ago Suing???  It’s time to start arresting, conviction and incarcerating these people.  Get them off the streets. permalink award report block reply\nSunnywindows 2 points 1 day ago So…. Where is this radical organization getting its funding…?  American taxpayers probably.  So this AG is using taxpayer money to sue an organization that will be using taxpayer money to defend itself.  Huh. permalink award report block reply\nTerryBibble 2 points 1 day ago Unless they're muslim. Texas dgaf about muslims permalink award report block reply\nPerseverant 1 points 1 day ago He is at least messaging it right.  \"Illegals, who are all criminals.\" I am so tired of the phrase \"criminal illegal aliens\" to distinguish dangerous illegals from docile illegals. permalink award report block reply nufosmatic OP 1 points 4 hours ago CRIMINAL ALIENS. permalink parent award report block reply\nnufosmatic OP 1 points 4 hours ago CRIMINAL ALIENS. permalink parent award report block reply\nMastaJoda 1 points 1 day ago So, your faggot ass isnt seeking criminal charges just money? How very RINO Party of you. You'll fill in well for Cornyn... permalink award report block reply"}