{"id": "1ARK5BIFSr", "contents": "616 BREAKING: Trump just pardoned dozens of people who were targeted by Biden’s DOJ for trying to expose election fraud following the 2020 election including Mark Meadows, Rudy Giuliani, and Sidney Powell posted 3 days ago by ALT26 11 comments award share report block Libs of TikTok @libsoftiktok • 3d BREAKING: Trump just pardoned dozens of people who were targeted by Biden’s DOJ for trying to expose election fraud following the 2020 election including Mark Meadows, Rudy Giuliani, and Sidney Powell\n11 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style AgnesDomini 11 points 3 days ago No Tina Peters yet? permalink award report block reply Tacitus1963 18 points 3 days ago He doesn't have the power to release Tina Peters because she has been jailed as part of a state crime which we know was never a crime. She was just doing her job to protect election integrity in CO. My understanding is that he can only pardon those charged with federal crimes.\nWhat he could do, though, is stop federal funds to that Demtard fag governor Jared Polis, until Ms. Peters is freed. permalink parent award report block reply okboomer59 6 points 2 days ago He can ask a Federal court to spring her on civil rights grounds. permalink parent award report block reply AgnesDomini 2 points 2 days ago Yes, this is true. But word is Trump is working on ger release, possibly getting her remanded to federal custody and then released. permalink parent award report block reply gorilla_grip 7 points 3 days ago Release the kraken!!!!!!! permalink award report block reply weltallic 5 points 3 days ago And when the Dems win, they'll just arrest Trump's team again. Dems do bad things when they win; Repubs undo SOME of the damage when they win. Rinse, repeat. permalink award report block reply Jonald_Trump 4 points 2 days ago Nah, he will do the same thing Biden’s autopen did for everyone.  Pardon anything in past.  They set the precedent and will eat it. permalink parent award report block reply Italianshamrock 1 points 2 days ago Also their licenses should be restored. permalink award report block reply plateowner2024 1 points 2 days ago Dozens? Who all? AI: President Donald Trump has issued a sweeping pardon on November 10, 2025, for 77 individuals, including Rudy Giuliani, Mark Meadows, John Eastman, Sidney Powell, Boris Epshteyn, and Kenneth Chesebro, for their roles in efforts related to the 2020 election. The pardons are described as \"full, complete, and unconditional\" and cover actions tied to advising, creating, organizing, or advocating for alternate slates of presidential electors, as well as efforts to expose alleged voting fraud. Rudy Giuliani, former personal lawyer to Trump, was pardoned for his role in pressuring state legislatures to reject Joe Biden’s victories in key swing states. Mark Meadows, Trump’s former chief of staff, was pardoned for being a key intermediary between Trump and state officials during the 2020 election period. John Eastman and Kenneth Chesebro, attorneys who helped devise a strategy to pressure then-Vice President Mike Pence to overturn the election on January 6, 2021, were among those pardoned. Sidney Powell, a conservative attorney who launched a legal challenge on election fraud claims, received a pardon.\nBoris Epshteyn, a longtime Trump adviser, was also pardoned. The pardon also includes 72 others, such as state GOP chairs and activists involved in the \"fake elector\" scheme, including David Shafer (Georgia), Kelli Ward (Arizona), Michael McDonald (Nevada), and James Troupos (Wisconsin). permalink award report block reply flp999 -4 points 3 days ago muh tina peters tho... where my tina? permalink award report block reply ADAM_SCHITT 5 points 3 days ago He can't pardon state crimes permalink parent award report block reply\nAgnesDomini 11 points 3 days ago No Tina Peters yet? permalink award report block reply Tacitus1963 18 points 3 days ago He doesn't have the power to release Tina Peters because she has been jailed as part of a state crime which we know was never a crime. She was just doing her job to protect election integrity in CO. My understanding is that he can only pardon those charged with federal crimes.\nWhat he could do, though, is stop federal funds to that Demtard fag governor Jared Polis, until Ms. Peters is freed. permalink parent award report block reply okboomer59 6 points 2 days ago He can ask a Federal court to spring her on civil rights grounds. permalink parent award report block reply AgnesDomini 2 points 2 days ago Yes, this is true. But word is Trump is working on ger release, possibly getting her remanded to federal custody and then released. permalink parent award report block reply\nTacitus1963 18 points 3 days ago He doesn't have the power to release Tina Peters because she has been jailed as part of a state crime which we know was never a crime. She was just doing her job to protect election integrity in CO. My understanding is that he can only pardon those charged with federal crimes.\nWhat he could do, though, is stop federal funds to that Demtard fag governor Jared Polis, until Ms. Peters is freed. permalink parent award report block reply okboomer59 6 points 2 days ago He can ask a Federal court to spring her on civil rights grounds. permalink parent award report block reply AgnesDomini 2 points 2 days ago Yes, this is true. But word is Trump is working on ger release, possibly getting her remanded to federal custody and then released. permalink parent award report block reply\nokboomer59 6 points 2 days ago He can ask a Federal court to spring her on civil rights grounds. permalink parent award report block reply\nAgnesDomini 2 points 2 days ago Yes, this is true. But word is Trump is working on ger release, possibly getting her remanded to federal custody and then released. permalink parent award report block reply\ngorilla_grip 7 points 3 days ago Release the kraken!!!!!!! permalink award report block reply\nweltallic 5 points 3 days ago And when the Dems win, they'll just arrest Trump's team again. Dems do bad things when they win; Repubs undo SOME of the damage when they win. Rinse, repeat. permalink award report block reply Jonald_Trump 4 points 2 days ago Nah, he will do the same thing Biden’s autopen did for everyone.  Pardon anything in past.  They set the precedent and will eat it. permalink parent award report block reply\nJonald_Trump 4 points 2 days ago Nah, he will do the same thing Biden’s autopen did for everyone.  Pardon anything in past.  They set the precedent and will eat it. permalink parent award report block reply\nItalianshamrock 1 points 2 days ago Also their licenses should be restored. permalink award report block reply\nplateowner2024 1 points 2 days ago Dozens? Who all? AI: President Donald Trump has issued a sweeping pardon on November 10, 2025, for 77 individuals, including Rudy Giuliani, Mark Meadows, John Eastman, Sidney Powell, Boris Epshteyn, and Kenneth Chesebro, for their roles in efforts related to the 2020 election. The pardons are described as \"full, complete, and unconditional\" and cover actions tied to advising, creating, organizing, or advocating for alternate slates of presidential electors, as well as efforts to expose alleged voting fraud. Rudy Giuliani, former personal lawyer to Trump, was pardoned for his role in pressuring state legislatures to reject Joe Biden’s victories in key swing states. Mark Meadows, Trump’s former chief of staff, was pardoned for being a key intermediary between Trump and state officials during the 2020 election period. John Eastman and Kenneth Chesebro, attorneys who helped devise a strategy to pressure then-Vice President Mike Pence to overturn the election on January 6, 2021, were among those pardoned. Sidney Powell, a conservative attorney who launched a legal challenge on election fraud claims, received a pardon.\nBoris Epshteyn, a longtime Trump adviser, was also pardoned. The pardon also includes 72 others, such as state GOP chairs and activists involved in the \"fake elector\" scheme, including David Shafer (Georgia), Kelli Ward (Arizona), Michael McDonald (Nevada), and James Troupos (Wisconsin). permalink award report block reply\nflp999 -4 points 3 days ago muh tina peters tho... where my tina? permalink award report block reply ADAM_SCHITT 5 points 3 days ago He can't pardon state crimes permalink parent award report block reply\nADAM_SCHITT 5 points 3 days ago He can't pardon state crimes permalink parent award report block reply"}