{"id": "1ARK9pg9Jp", "contents": "63 RFK Jr. Exposes Big Pharma's Stranglehold On American Media.\nThe evening news isn’t just a broadcast - it’s a billion-dollar echo chamber for corporate interests. (www.zerohedge.com) posted 3 hours ago by rdvs34283 3 comments award share report block RFK Jr. Exposes Big Pharma's Stranglehold On American Media ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero www.zerohedge.com\n3 comments Sort by Top Top New Worst Old Save CloudNine 2 points 3 hours ago Back in my day \"Welcome to Marlboro country\" \"See the USA in your Chevrolet\" \"Timex takes a licking and keeps on ticking\" 'Winston tastes good like a cigarette should\" \"Parliament- with the filter thats IN, recessed in!\" 'Look out for the BULL! The Schlitz Malt Liquor Bull!\" \"The TWO fisted burger from Burger King\" \"Us Tareyton smokers would rather fight, than switch!\" permalink award report block reply SBOJ_JOBS 1 points 2 hours ago At least all of those were truth-based permalink parent award report block reply Lunk 1 points 3 hours ago I cant stand any type of commercials but ones for medical are the worse. permalink award report block reply\nCloudNine 2 points 3 hours ago Back in my day \"Welcome to Marlboro country\" \"See the USA in your Chevrolet\" \"Timex takes a licking and keeps on ticking\" 'Winston tastes good like a cigarette should\" \"Parliament- with the filter thats IN, recessed in!\" 'Look out for the BULL! The Schlitz Malt Liquor Bull!\" \"The TWO fisted burger from Burger King\" \"Us Tareyton smokers would rather fight, than switch!\" permalink award report block reply SBOJ_JOBS 1 points 2 hours ago At least all of those were truth-based permalink parent award report block reply\nSBOJ_JOBS 1 points 2 hours ago At least all of those were truth-based permalink parent award report block reply\nLunk 1 points 3 hours ago I cant stand any type of commercials but ones for medical are the worse. permalink award report block reply"}