{"id": "1ARK9nPuB7", "contents": "14 WH Press Secretary Karoline Leavitt answers reporter's question of \"Why not just release the full Epstein files and get this all over with?\" posted 5 hours ago by CatalystForChange 5 comments award share report block Eric Daugherty @EricLDaugh • 5h 🚨 Q: Why not just release the full Epstein files and get this all over with? WH PRESS SEC. LEAVITT: \"When Biden was sitting in there, the Democrats never brought this up! This wasn't an issue that they cared about, because they actually don't CARE about the victims in these\n5 comments Sort by Top Top New Worst Old Save Around the Web One Piece Kills All Parasites in Your Body! Paratoxil Awakened 4 points 5 hours ago Her dancing around the issue is a bad look. permalink award report block reply CatalystForChange OP 4 points 5 hours ago Well, she's doing her best while keeping poker face. permalink parent award report block reply Awakened 2 points 4 hours ago It only makes it worse. Everyone can tell she's dancing and avoiding the subject head on. It makes Trump seem complicit. permalink parent award report block reply 0Sum 2 points 4 hours ago For a second there I could have swore I saw her eyelids flutter and her hair turn into an afro. permalink award report block reply BonginosRac1stCowboy 1 points 4 hours ago Comment removed by community moderators. permalink parent award report block reply\nAwakened 4 points 5 hours ago Her dancing around the issue is a bad look. permalink award report block reply CatalystForChange OP 4 points 5 hours ago Well, she's doing her best while keeping poker face. permalink parent award report block reply Awakened 2 points 4 hours ago It only makes it worse. Everyone can tell she's dancing and avoiding the subject head on. It makes Trump seem complicit. permalink parent award report block reply\nCatalystForChange OP 4 points 5 hours ago Well, she's doing her best while keeping poker face. permalink parent award report block reply Awakened 2 points 4 hours ago It only makes it worse. Everyone can tell she's dancing and avoiding the subject head on. It makes Trump seem complicit. permalink parent award report block reply\nAwakened 2 points 4 hours ago It only makes it worse. Everyone can tell she's dancing and avoiding the subject head on. It makes Trump seem complicit. permalink parent award report block reply\n0Sum 2 points 4 hours ago For a second there I could have swore I saw her eyelids flutter and her hair turn into an afro. permalink award report block reply BonginosRac1stCowboy 1 points 4 hours ago Comment removed by community moderators. permalink parent award report block reply\nBonginosRac1stCowboy 1 points 4 hours ago Comment removed by community moderators. permalink parent award report block reply"}