{"id": "1ARK9pgh1C", "contents": "293 US Flight-Cuts Frozen At 6% As More Controllers Show Up For Work (www.zerohedge.com) posted 1 hour ago by TateDemarcus 16 comments award share report block US Flight-Cuts Frozen At 6% As More Controllers Show Up For Work ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero www.zerohedge.com\n16 comments Sort by Top Top New Worst Old Save Around the Web Hair Grows Back in A Few Days! At Any Stage of Baldness HaloGrow Here_we_go 10 points 1 hour ago This gets stickied but fannie may throwing out credit scores on Monday isnt. permalink award report block reply Mamapedia 4 points 58 minutes ago Yup permalink parent award report block reply newestofnew 1 points 51 minutes ago I hate to break it to you but 620 didn't mean they were credit worthy to begin with permalink parent award report block reply Here_we_go 2 points 47 minutes ago I agree but this is another no doc mortgage prop up. permalink parent award report block reply newestofnew 3 points 39 minutes ago it is, I guess 0% down didn't work cause those who had no money for a down payment still didn't meet the other reqs lol permalink parent award report block reply STRONGLYWORDEDLETTER 1 points 54 minutes ago Context? permalink parent award report block reply Here_we_go 1 points 45 minutes ago https://www.newsweek.com/mortgage-market-fannie-mae-new-credit-score-requirements-11032607 permalink parent award report block reply _Liberty_Prime_ 1 points 44 minutes ago Nothingburger. They're changing the way they assess loans to include more things. https://www.mpamag.com/us/mortgage-industry/industry-trends/fannie-mae-scraps-minimum-credit-score-for-du-loans/555870 permalink parent award report block reply f_bastiat 4 points 1 hour ago Can someone explain why ATCs are not hired by the airport? I feel like if the airport had control of the towers they wouldn't be so antiquated. Government and inefficiency go hand in hand. Honestly it seems like the entire role could be automated. permalink award report block reply RedStoneDeepState 2 points 53 minutes ago Because a series of crashes under FDR's administration were used to justify nationalization. permalink parent award report block reply BarrysOFace 2 points 1 hour ago Atc is a nationwide system. permalink parent award report block reply Badfinz_FL 1 points 51 minutes ago In some places, usually at smaller airports that operate control towers with no TRACONs, they are private.  They still have to be former FAA certified or Military certified controllers though. permalink parent award report block reply SBOJ_JOBS 1 points 53 minutes ago Large airports are run by governmental agencies just as corrupt as federal agencies. Some medium-to-small airports have privately operated towers but that industry, totally dependent upon the favors of the Fed, is almost as corrupt and DEI as any Federal agency. permalink parent award report block reply SBOJ_JOBS 4 points 1 hour ago Airlines cut their least profitable flights and switch to larger airplanes on key routes. Crocodile tears all around. permalink award report block reply Badfinz_FL 2 points 52 minutes ago My question is are the ones who did not show up for work, because they are whiny faggots, are they going to get their back pay? permalink award report block reply Assault-Covfefe 1 points 33 minutes ago yup. permalink parent award report block reply\nHere_we_go 10 points 1 hour ago This gets stickied but fannie may throwing out credit scores on Monday isnt. permalink award report block reply Mamapedia 4 points 58 minutes ago Yup permalink parent award report block reply newestofnew 1 points 51 minutes ago I hate to break it to you but 620 didn't mean they were credit worthy to begin with permalink parent award report block reply Here_we_go 2 points 47 minutes ago I agree but this is another no doc mortgage prop up. permalink parent award report block reply newestofnew 3 points 39 minutes ago it is, I guess 0% down didn't work cause those who had no money for a down payment still didn't meet the other reqs lol permalink parent award report block reply STRONGLYWORDEDLETTER 1 points 54 minutes ago Context? permalink parent award report block reply Here_we_go 1 points 45 minutes ago https://www.newsweek.com/mortgage-market-fannie-mae-new-credit-score-requirements-11032607 permalink parent award report block reply _Liberty_Prime_ 1 points 44 minutes ago Nothingburger. They're changing the way they assess loans to include more things. https://www.mpamag.com/us/mortgage-industry/industry-trends/fannie-mae-scraps-minimum-credit-score-for-du-loans/555870 permalink parent award report block reply\nMamapedia 4 points 58 minutes ago Yup permalink parent award report block reply\nnewestofnew 1 points 51 minutes ago I hate to break it to you but 620 didn't mean they were credit worthy to begin with permalink parent award report block reply Here_we_go 2 points 47 minutes ago I agree but this is another no doc mortgage prop up. permalink parent award report block reply newestofnew 3 points 39 minutes ago it is, I guess 0% down didn't work cause those who had no money for a down payment still didn't meet the other reqs lol permalink parent award report block reply\nHere_we_go 2 points 47 minutes ago I agree but this is another no doc mortgage prop up. permalink parent award report block reply newestofnew 3 points 39 minutes ago it is, I guess 0% down didn't work cause those who had no money for a down payment still didn't meet the other reqs lol permalink parent award report block reply\nnewestofnew 3 points 39 minutes ago it is, I guess 0% down didn't work cause those who had no money for a down payment still didn't meet the other reqs lol permalink parent award report block reply\nSTRONGLYWORDEDLETTER 1 points 54 minutes ago Context? permalink parent award report block reply Here_we_go 1 points 45 minutes ago https://www.newsweek.com/mortgage-market-fannie-mae-new-credit-score-requirements-11032607 permalink parent award report block reply _Liberty_Prime_ 1 points 44 minutes ago Nothingburger. They're changing the way they assess loans to include more things. https://www.mpamag.com/us/mortgage-industry/industry-trends/fannie-mae-scraps-minimum-credit-score-for-du-loans/555870 permalink parent award report block reply\nHere_we_go 1 points 45 minutes ago https://www.newsweek.com/mortgage-market-fannie-mae-new-credit-score-requirements-11032607 permalink parent award report block reply\n_Liberty_Prime_ 1 points 44 minutes ago Nothingburger. They're changing the way they assess loans to include more things. https://www.mpamag.com/us/mortgage-industry/industry-trends/fannie-mae-scraps-minimum-credit-score-for-du-loans/555870 permalink parent award report block reply\nf_bastiat 4 points 1 hour ago Can someone explain why ATCs are not hired by the airport? I feel like if the airport had control of the towers they wouldn't be so antiquated. Government and inefficiency go hand in hand. Honestly it seems like the entire role could be automated. permalink award report block reply RedStoneDeepState 2 points 53 minutes ago Because a series of crashes under FDR's administration were used to justify nationalization. permalink parent award report block reply BarrysOFace 2 points 1 hour ago Atc is a nationwide system. permalink parent award report block reply Badfinz_FL 1 points 51 minutes ago In some places, usually at smaller airports that operate control towers with no TRACONs, they are private.  They still have to be former FAA certified or Military certified controllers though. permalink parent award report block reply SBOJ_JOBS 1 points 53 minutes ago Large airports are run by governmental agencies just as corrupt as federal agencies. Some medium-to-small airports have privately operated towers but that industry, totally dependent upon the favors of the Fed, is almost as corrupt and DEI as any Federal agency. permalink parent award report block reply\nRedStoneDeepState 2 points 53 minutes ago Because a series of crashes under FDR's administration were used to justify nationalization. permalink parent award report block reply\nBarrysOFace 2 points 1 hour ago Atc is a nationwide system. permalink parent award report block reply\nBadfinz_FL 1 points 51 minutes ago In some places, usually at smaller airports that operate control towers with no TRACONs, they are private.  They still have to be former FAA certified or Military certified controllers though. permalink parent award report block reply\nSBOJ_JOBS 1 points 53 minutes ago Large airports are run by governmental agencies just as corrupt as federal agencies. Some medium-to-small airports have privately operated towers but that industry, totally dependent upon the favors of the Fed, is almost as corrupt and DEI as any Federal agency. permalink parent award report block reply\nSBOJ_JOBS 4 points 1 hour ago Airlines cut their least profitable flights and switch to larger airplanes on key routes. Crocodile tears all around. permalink award report block reply\nBadfinz_FL 2 points 52 minutes ago My question is are the ones who did not show up for work, because they are whiny faggots, are they going to get their back pay? permalink award report block reply Assault-Covfefe 1 points 33 minutes ago yup. permalink parent award report block reply\nAssault-Covfefe 1 points 33 minutes ago yup. permalink parent award report block reply"}