{"id": "1ARK9is3JZ", "contents": "889 Kash Patel’s Big Test: How He Handles the Government's J6 Pipe Bomb Suspect (townhall.com) posted 2 days ago by 5DchessWatch 144 comments award share report block Kash Patel’s Big Test: How He Handles the Government's J6 Pipe Bomb Suspect A critical look at Kash Patel's handling of the J6 pipe bomb suspect case. townhall.com\n144 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Thomm 95 points 2 days ago He’s already failed permalink award report block reply guywholikesDjtof2024 36 points 2 days ago He is a hindu. Worldview matters. Never expect a hindu to carry out Justice, because Justice is primarily a Christian value. And he gave an award to a bad person, I recall. permalink parent award report block reply Patriots4TN 3 points 2 days ago Bongino is a Catholic though. He has been the one who has been pushing this in spite of the system trying to bury it. permalink parent award report block reply guywholikesDjtof2024 1 points 2 days ago pushing this Pushing what? system What system? Vague comment. permalink parent award report block reply 2scoops2peachmints 7 points 2 days ago Then pipe bomber stuff was Bongino’s biggest wish in his wish list, if nothing comes of this it’s all theater. permalink parent award report block reply snoopy3210 -11 points 2 days ago Close minded piece of shits must have been frustrated when Trump endorsed Vivek this week permalink parent award report block reply Doritalos 5 points 2 days ago He's another, H1B party member permalink parent award report block reply GoodMorningDystopia 3 points 1 day ago filthy  jeet hands typed this. permalink parent award report block reply BigMikesChef 2 points 1 day ago Who's up for a poop fight!?! permalink parent award report block reply DeltaSierra -29 points 2 days ago I never knew what he was and I don’t care about his religion.  What are you some kind of bigoted freak? That is what is wrong with this place.  Very few can just argue the facts.  It has always got to be some big conspiracy of non-white people or people not christian.  Bunch of fuckin losers in the Donald.  You are fuckin scumbag.  Own it. permalink parent award report block reply 1776er 23 points 2 days ago Justice as a western value is a fact permalink parent award report block reply DeltaSierra -26 points 2 days ago Tell that to the Christian slave owners that treated God’s people worse than animals.  You are using the logic of a moron permalink parent award report block reply view 24 more comments... LegacyOfWinning 5 points 2 days ago Jesus Christ is King of the United States of America and the World. permalink parent award report block reply GoodMorningDystopia 1 points 1 day ago Another filthy jeet who thinks they are wanted or needed by Americans. permalink parent award report block reply USDMaga 13 points 2 days ago He offered the $500k reward knowing who the bomber was and knowing that no one would be able to turn her in. His bluff got called in 2 days.  He will do nothing, not even question the bomber. permalink parent award report block reply UCantStumpTheTrump 5 points 2 days ago The only way ANYONE will trust our institutions is for Kash to address this serious rot to the American public, we are owed an explanation permalink parent award report block reply snoopy3210 -4 points 2 days ago You’re just a troll farm pushing this latest lie, it’s not her she doesn’t match at all.. and you can go die somewhere permalink parent award report block reply IvotedforTrumptwice 5 points 2 days ago I believe the RICO case they are building is so massive that, in order to carry it out, it would have to involve about 8 first world country’s militaries and a couple world wars and some money to Israel. permalink parent award report block reply UCantStumpTheTrump 3 points 2 days ago At this point the Trump DOJ has indicted Comey, Letitia James, and Bolton, and now is expected to indict Schiff and Brennan. I don't think it's just stopping there either permalink parent award report block reply Metal4Freedom 3 points 2 days ago Ever heard the phrase \"you can indict a ham sandwich\"? Unless you see arrests, it's just Kabuki. permalink parent award report block reply UCantStumpTheTrump -1 points 2 days ago Arrest comes before indictment, dummy. thats how i know you have no clue what you are talking about permalink parent award report block reply view 2 more comments... keeman 1 points 2 days ago These are but small players.  It is good that accountability is being applied in these cases, but to actually fix this shit you need to utterly end the FBI, NSA, etc.  When you have kudzu you don't bring out the hand pruners.  You get the flamethrower. permalink parent award report block reply mohel 3 points 2 days ago 4D chess? permalink parent award report block reply Snek_Plissken 2 points 2 days ago The question is does the FBI have jurisdiction over Capitol police. DC is weird legally speaking. In terms of how Biden handled it everything was a federal charge, but is that really how it works? In my understanding of how things work there I've discovered not everything is what you would think. DC is fucking weird. Under 18 criminal offences go to the antifa equivalent attorney general and over 18 crimes go to the federal state attorney. Again, DC is fucking weird and people shouldn't be living there. Why is this a low income cesspool? Why hasn't anyone fix this? It needs to be cleared out. permalink parent award report block reply NoticesBugleOWO 1 points 2 days ago Stop assuming the information YOU have is all the information there is. permalink parent award report block reply Ch3f4554551n 57 points 2 days ago Nope. His big test was Epstein and Maxwell. According to Mossad, he passed with flying colors. permalink award report block reply DrWeeGee 32 points 2 days ago This administration has been one big letdown after another permalink parent award report block reply UCantStumpTheTrump 8 points 2 days ago Don't get demoralized, we are still FAR better off than we would be right now if Kamala had \"won\" and Trump is doing a LOT of work to restore our energy and manufacturing base... Biden cancelled the wall construction and dozens of oil/gas projects, which Trump has opened back up. It will take some time for the prices to realistically come down permalink parent award report block reply ianpatrick1966 2 points 1 day ago Are we?  We need to cross the rubicon and water the tree of liberty.  We are not closer to that as so many hopium huffing retards are still “trusting the plan” Atlas needs to shrug permalink parent award report block reply MediaBro 2 points 2 days ago It's not happening, especially not after AI has been unleashed. Nothing stopping the detractors from saying their names were falsely put on that list. Musk also screwed the pooch by claiming on X that Trump is on the files himself. That was completely unhinged and only has made your side look legit insane. A governed ppl cannot be on constant anxiety, even when they win. If the economy doesn't get better and legal immigration halted to a trickle and illegal immigrants aren't sorted, there is no way the GOP is winning in 2026 and absolutely no way in 2028. At this current rate, I don't even see an election in 2028. permalink parent award report block reply Ch3f4554551n 2 points 2 days ago Trump is absolutely involved. Virginia Giuffre worked for him at Mar a Lago, and Trump is Roy Cohn's protege. He has had intimate knowledge of the Kompromat operation the entire time, and just plays dumb about Mossad's involvement. All of this is openly documented - I recommend Whitney Webb's book on the subject. AI is a moot point when travel logs and calendars are factored in. There is enough evidence to put Prince Andy away for life, but no one will take action on any of it, because all the Kompromat was commissioned by the CIA and Mossad. This is how the world's governments operate. Trump told us all he would end it to get elected, then simply assumed power to take the ring of sauron himself. He hoodwinked all of us, and now merely trickles out enough red meat to satiate the base. Nothing has changed. permalink parent award report block reply I_Am_John_Galt 31 points 2 days ago Between him and Bongino, who were two of the most vocal people on the subject before joining the admin, I'm really struggling to figure out how they haven't driven this to ground yet.  Yeah...I know...I'll be quiet now. permalink award report block reply 5DchessWatch OP 18 points 2 days ago They both wrote books about spygate.  Bonvaginos was called spygate.  I think Kash's was a kids book.  Oh wait he wrote government gangsters. They get in and immediately do nothing.  They are like the 2 dogs barking at each other thru the fence, until an owner opens the fence door and they stop barking and sit down staring at each other.  Owner shuts gate.  Barking resumes This describes the totality of their service permalink parent award report block reply KernalMustard 12 points 2 days ago Grifters, grift. For others its prestige. Thats why Bondi blows my mind. She worked all her adult life to get to this point. AG is top of her profession. Then for now 10 months does jack. It must be some bad shit they got on heror shes always been a bad apple. permalink parent award report block reply 1776er 7 points 2 days ago They don’t need dirt on you when they can show up at your door and tell you they will wipe your line from this earth if you cross them permalink parent award report block reply IPMang 3 points 2 days ago We've had many tens of thousands of people willing to give their life for this country. Why can't we get anyone like that to run these agencies? permalink parent award report block reply view 1 more comments... JoinTheDiscussion 2 points 2 days ago Have enough lead to counter that kind of threat.. Don't be that messenger permalink parent award report block reply Metal4Freedom 2 points 2 days ago Americans used to shoot people like that. Sometimes right at the door. Sometimes later that night at their house. permalink parent award report block reply UCantStumpTheTrump 3 points 2 days ago The only answer that makes sense to me is once they took office, somebody essentially threatened their lives or their families lives, if they went after certain individuals. There's really no other good explanation. Then usually the truth comes out years or decades later when someone finally spills the beans to the public or the conspiracy folks figure it out permalink parent award report block reply RedCalifornia 1 points 2 days ago Remember that book deals are also how the left pays off its own. permalink parent award report block reply Psarg 2 points 2 days ago I think they're worried about nuclear Armageddon. permalink parent award report block reply FuckCommies 24 points 2 days ago Pussy is the downfall of every ugly dude with power and influence. Oh, and the zionist lobby. Jeets gonna always take that money. Shit, his off-campaign \"logo\" merch he was shilling had a dollar sign through his name. permalink award report block reply TrumpAndGodWin 12 points 2 days ago Alex Jones' sources say that Kash is compromised and lives with a gay billionaire in Vegas. She's the beard or worse. permalink parent award report block reply 5DchessWatch OP 2 points 2 days ago Kash isn't ugly.  But he talks a bit like a nerd.  One notch above Shapiro tier nasality.  And sniffs WAY too much during interviews.  My impression is he's a cokehead.  But other than sniff doesn't act like one.  Sorry kash.  Maybe he's got a medical problem or is addicted to some shit snorty drug that will give him glaucoma, like Flonase. permalink parent award report block reply MediaBro 6 points 2 days ago His official photo looks like he's on crack tbh permalink parent award report block reply 5DchessWatch OP 2 points 1 day ago People have this idea that he has a glass eye that goes off looking the wrong direction.  I don't know , but he def is partially walleyed permalink parent award report block reply YouEssAye 21 points 2 days ago Sorry he's too busy suing right wingers who made fun of his honey pot girlfriend https://thegrayzone.com/2025/11/10/kash-patels-gf-lawsuit-podcasters-mossad/ permalink award report block reply navycuda 12 points 2 days ago Not surprised.  Guess he really is a street shitter after all. permalink parent award report block reply JoeMcCarthyWasRight 18 points 2 days ago Fuck him. Talked all that shit and then got put in the greatest possible position to put his money where his mouth is and totally shows what a fucking con man he is. Another terrible Trump hire. permalink award report block reply JoinTheDiscussion 5 points 2 days ago Was it an \"accident\"? permalink parent award report block reply deleted 12 points 2 days ago lynxxyarly 6 points 2 days ago the walls are finally coming together permalink parent award report block reply OnceADroplet 6 points 2 days ago he's got them right in the crosseyes permalink parent award report block reply Songofsixpence 3 points 2 days ago Half a fortnight? permalink parent award report block reply XlDEN 7 points 2 days ago Half a fortnight was called a septnight, but we stopped using that word for “week.” permalink parent award report block reply DeaduponArousal 11 points 2 days ago Let’s ask his completely organic girlfriend how he’s going to handle it…yeah I bet she loves to stare into those crossed eyes through out the night. permalink award report block reply shrbrn 11 points 2 days ago This Patel fellow is one giant disappointment. Seems to be an Israeli cock sucker! permalink award report block reply Hyperlight381 10 points 2 days ago I was such a big advocate of his originally. The giant sized crow i have to eat is substantial. He was compromised from the start which is why he was allowed to take the position permalink award report block reply Metal4Freedom 2 points 2 days ago Thanksgiving is coming. It can't taste worse than turkey. Just slather it with enough gravy and nobody will notice. permalink parent award report block reply Ralphusthegreatus 9 points 2 days ago Is there really people here who think anything is going to happen? permalink award report block reply DanIsSwell 4 points 2 days ago I know this is the off limits question; but is anyone starting to wonder about the validity of Trump himself? permalink parent award report block reply IPMang 5 points 2 days ago I was just thinking about that... But getting shot in the ear really makes it hard to believe. It's almost like we'd need to believe that was faked if we're to believe Trump isn't legit. permalink parent award report block reply UCantStumpTheTrump 3 points 2 days ago He was already President for 4 years. If you haven't learned to trust Trump (which is the nice thing about his Presidency... you know he has competent people working for him) then you haven't learned anything. It's much worse living with a Dem POTUS and hearing shitty news every day like record numbers of illegals crossing the border (over 3 MILLION in 2023 alone, more than an entire army). Meanwhile the Trump admin has released ZERO illegal aliens inside the US for the last 6 month, a historically low number. Biden was releasing them on parole and flying/bussing them across the country on taxpayers' dime permalink parent award report block reply JoinTheDiscussion 1 points 2 days ago That was enough to make him compromised and then fill his admin with do-nothings permalink parent award report block reply DanIsSwell 1 points 1 day ago That’s true, and that assassination attempt is always the thing that wrangles me back in. It’s just hard to understand a lot of what he does and doesn’t do. I can’t blame it on ignorance or stupidity, because Trump is not those things. permalink parent award report block reply UCantStumpTheTrump 4 points 2 days ago Nah dude this is a forum for Trump supporters, speaking badly about Trump breaks rule #1. And keep this in mind, so far Comey, Bolton and Letitia James have been indicted by a federal grand jury, and Schiff and Brennan are coming up. I think Trump's DOJ has made a good start at going against these evil plotters permalink parent award report block reply Txiribiton 2 points 2 days ago Obviously, you only have to value actions. permalink parent award report block reply MediaBro -3 points 2 days ago Look, Trump can only go so far. You'll are expecting miracles. The man is on his last few years on this Earth and has been fighting on your side and taken so much shit as it is. If this is the way you'll treat the man, with this much disdain, do you honestly think anyone will ever again, from your side, want to take the reigns of the GOP leadership?? Even Vance, a literal war veteran and a guy who worked his way from poverty and married a Hindu woman, whilst being a nominal Christian and became a convert to Catholicism gets flak from you pissants for being married to a Hindu woman. Your current First Lady has done nude photo ops when she was young and she is celebrated but a smart, educated, American born, Indian woman who married her college sweetheart gets shit upon? And that too by the side that is supposedly her husband's ally?? If this is the way you'll treat your own, even your own will walk away. You'll will find yourselves with fewer and fewer friends and even more scattered and destroyed. It is embarrassing to watch on the world stage and you'll cannot continue this behaviour and think this is a winning strategy. permalink parent award report block reply JoinTheDiscussion 1 points 2 days ago Bondi, Kash, Bongino.. He's NOT by himself but is it a wonder that he's surrounded himself with do-nothings ONCE AGAIN.. permalink parent award report block reply Cacciali_Via 1 points 2 days ago Your party lost to Trump twice. What do you know about winning strategies? There is nothing wrong with not normalizing race mixing. I've not seen anyone say personal things about Vance's wife. People just wish he had more wisdom in his youth to go along with his brains. permalink parent award report block reply Ralphusthegreatus 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply HazelHen 9 points 2 days ago Epstein files permalink award report block reply SpellingContable 8 points 2 days ago I predict Kash and Bongino doing another 'Freakout Vid\" interview together. I reckon just before they went on air last time they were sent a vid of a person who resembles one of their loved ones being chopped up alive, with the vid title 'Guess Whos Next' permalink award report block reply UCantStumpTheTrump 8 points 2 days ago Nah someone from the intel community (including foreign agencies) probably credibly threatened them and their families with death if they went after certain individuals or organizations. hence the look of terror on their faces. someone got to them early on and neutralized them. Trump needs to realize this and tell them to get with the program or get lost. Put in some dude with nothing to lose who will make the right decisions permalink parent award report block reply SpellingContable 5 points 2 days ago Yeah, I previously said they sent a photo of an agency assassin at their kids school at pickup time, or some similar interaction. But now I like the theory \"Hey, this woman looks like your wife. Watch me chop her up.\"  video theory. Or they were in Dans home videoing his wife while she slept. permalink parent award report block reply JoeFromHR 7 points 2 days ago No, his big test was how he handled the Epstein case. He not only failed, he betrayed everyone. permalink award report block reply Liberalism_is_mental 7 points 2 days ago The fact that she wasn't immediately arrested and questioned shows that we're back to the deepstate in charge.  Even if they arrested her, questioned her and then cleared her name, would show they're serious about it.  Total crickets is a very bad and telling sign. permalink award report block reply TrumpAndGodWin 5 points 2 days ago Apparently she or Zhe is in a CIA safe house. alexjonesapp dot com permalink parent award report block reply Cacciali_Via 1 points 2 days ago Why do you think she isn't a cooperating witness? permalink parent award report block reply learntocode 6 points 2 days ago I can think of a bunch of other shit. The Oswald communication prior to the assassination. Anthony Weiners laptop. Seth Rich files. ID of guy who shorted airlines prior to 9-11. permalink award report block reply Beaverstatemilitia 5 points 2 days ago He will fail as he always has! permalink award report block reply MajJamesMcFarlane 1 points 2 days ago Fall? Sounds like he's successful at what he was told to do permalink parent award report block reply hey_spike 5 points 2 days ago I want the chain of command above the bomber. permalink award report block reply Tabascocat12 4 points 2 days ago Anyone who had to get approved by Congress(under Trump) for a position is not going to do anything except talk and serve platitudes.  Sure, there will be some arrests but none of it related to what needs to be done.  The political criminals are fully in control. permalink award report block reply orange_kek_great 4 points 2 days ago He won't do shit. permalink award report block reply Justjayce 3 points 2 days ago From burn bag to toilet paper I bet permalink award report block reply raptoris2 3 points 2 days ago Kash and Bondi need to be replaced. permalink award report block reply Obambi 3 points 2 days ago The problem with Trump rich inner circle people is that they’re loyal to Israel first and that fucks up MAGA for the middle income folks and why we see this giant let down. They don’t see it because they’re in this bubble. They don’t go to the grocery store or struggle with constant bills. permalink award report block reply Melodicgrog 3 points 2 days ago He’s failed every other test, but this OSS the big one I guess permalink award report block reply IPMang 2 points 2 days ago Has Trump spoken about this case at all or recently? I think that would be pretty telling permalink award report block reply HenkZeilstra 2 points 2 days ago Kash Patel more like Kash Pajeet, big boy talk but nothing absolutely NOTHING. permalink award report block reply Kilroy 2 points 2 days ago I thought Kash retired and moved to Bermuda. permalink award report block reply Spellmonger 2 points 1 day ago Get PATEL and BONDI out of there! They are singlehandedly destroying MAGA.  Appoint Matt Geatz as interim AG and let him pick the FBI director. permalink award report block reply Steve56775 1 points 1 day ago Trump has wasted a fourth of his presidency on these two traitors. He needs to put his boots on and show them the curb. permalink parent award report block reply Hanging_Chad 1 points 2 days ago for years, there’s been a far-right conspiracy theory that it’s an FBI training prop for bomb threats and such permalink award report block reply 5DchessWatch OP 2 points 2 days ago Maybe, but I think pipebombhoax was a gang initiation ritual for capuchinfaced policewoman to join the gang that is the CIA permalink parent award report block reply Hanging_Chad 2 points 2 days ago maybe, but I still think it’s an FBI training prop permalink parent award report block reply 5DchessWatch OP 2 points 1 day ago There is no reason it can't be both.  Just like the many many deepstate motivations and 'cui bonos' of 9/11/2001 permalink parent award report block reply SqRt7744 1 points 1 day ago Lol this is not his big test. Epstein was and he failed miserably. permalink award report block reply PiratePatriotParrot 1 points 2 days ago Fuck this bitch gimp limp lady permalink award report block reply guywholikesDjtof2024 1 points 2 days ago who? permalink parent award report block reply PiratePatriotParrot 2 points 2 days ago \"Ms. Kerkhoff had an added factor working against her in terms of the program’s ability to identify her gait. The severe soccer injury she suffered in college, which fractured her tibia, left her with a slight permanent limp.\" permalink parent award report block reply Calumet57 1 points 2 days ago It is a tiny test if a test at all. But I agree that no stone in J6 should be left unturned. permalink award report block reply GoodMorningDystopia 1 points 1 day ago The filthy jeet needs to go. permalink award report block reply BrionK 1 points 2 days ago Really?\nHow about he makes good on the list he published. permalink award report block reply AbrahamLincoln 1 points 1 day ago He's going to punt it to Bondi, and Bondi will punt it into the bottomless pit she calls her desk. permalink award report block reply ckover9000 1 points 1 day ago The Epstein Files was his big test, and he failed miserably. permalink award report block reply RiffFantastic 1 points 2 days ago Have they questioned this bitch yet? permalink award report block reply f_bastiat 1 points 1 day ago His biggest test was the Epstein files and he failed miserably. permalink award report block reply FlyCatcher94 1 points 1 day ago He’s already shilling for zionists . permalink award report block reply FusionBlack 1 points 2 days ago No very well. permalink award report block reply Protonboy 1 points 1 day ago Is there any doubt, really? permalink award report block reply RINOssuck 1 points 1 day ago What a ridiculous statement. permalink award report block reply SoldanoSlo 0 points 2 days ago Better have something more solid than \"gait analysis\" permalink award report block reply VoteThing 2 points 2 days ago There's not much need. The gait analysis is solid by itself. It's biometric information. But then once you have a suspect, it's easy to gather a bunch of other circumstantial evidence. permalink parent award report block reply FatigueIsReal 0 points 2 days ago I'll take record arrests for human trafficking and finding thousands of kids. The rest is just a bonus. permalink award report block reply LockNload 6 points 2 days ago Low hanging fruit is a great distraction. permalink parent award report block reply cherbui 0 points 2 days ago attempted murder = death penalty ? duh permalink award report block reply HoodooOperator 1 points 1 day ago Comment removed by community moderators. permalink award report block reply\nThomm 95 points 2 days ago He’s already failed permalink award report block reply guywholikesDjtof2024 36 points 2 days ago He is a hindu. Worldview matters. Never expect a hindu to carry out Justice, because Justice is primarily a Christian value. And he gave an award to a bad person, I recall. permalink parent award report block reply Patriots4TN 3 points 2 days ago Bongino is a Catholic though. He has been the one who has been pushing this in spite of the system trying to bury it. permalink parent award report block reply guywholikesDjtof2024 1 points 2 days ago pushing this Pushing what? system What system? Vague comment. permalink parent award report block reply 2scoops2peachmints 7 points 2 days ago Then pipe bomber stuff was Bongino’s biggest wish in his wish list, if nothing comes of this it’s all theater. permalink parent award report block reply snoopy3210 -11 points 2 days ago Close minded piece of shits must have been frustrated when Trump endorsed Vivek this week permalink parent award report block reply Doritalos 5 points 2 days ago He's another, H1B party member permalink parent award report block reply GoodMorningDystopia 3 points 1 day ago filthy  jeet hands typed this. permalink parent award report block reply BigMikesChef 2 points 1 day ago Who's up for a poop fight!?! permalink parent award report block reply DeltaSierra -29 points 2 days ago I never knew what he was and I don’t care about his religion.  What are you some kind of bigoted freak? That is what is wrong with this place.  Very few can just argue the facts.  It has always got to be some big conspiracy of non-white people or people not christian.  Bunch of fuckin losers in the Donald.  You are fuckin scumbag.  Own it. permalink parent award report block reply 1776er 23 points 2 days ago Justice as a western value is a fact permalink parent award report block reply DeltaSierra -26 points 2 days ago Tell that to the Christian slave owners that treated God’s people worse than animals.  You are using the logic of a moron permalink parent award report block reply view 24 more comments... LegacyOfWinning 5 points 2 days ago Jesus Christ is King of the United States of America and the World. permalink parent award report block reply GoodMorningDystopia 1 points 1 day ago Another filthy jeet who thinks they are wanted or needed by Americans. permalink parent award report block reply USDMaga 13 points 2 days ago He offered the $500k reward knowing who the bomber was and knowing that no one would be able to turn her in. His bluff got called in 2 days.  He will do nothing, not even question the bomber. permalink parent award report block reply UCantStumpTheTrump 5 points 2 days ago The only way ANYONE will trust our institutions is for Kash to address this serious rot to the American public, we are owed an explanation permalink parent award report block reply snoopy3210 -4 points 2 days ago You’re just a troll farm pushing this latest lie, it’s not her she doesn’t match at all.. and you can go die somewhere permalink parent award report block reply IvotedforTrumptwice 5 points 2 days ago I believe the RICO case they are building is so massive that, in order to carry it out, it would have to involve about 8 first world country’s militaries and a couple world wars and some money to Israel. permalink parent award report block reply UCantStumpTheTrump 3 points 2 days ago At this point the Trump DOJ has indicted Comey, Letitia James, and Bolton, and now is expected to indict Schiff and Brennan. I don't think it's just stopping there either permalink parent award report block reply Metal4Freedom 3 points 2 days ago Ever heard the phrase \"you can indict a ham sandwich\"? Unless you see arrests, it's just Kabuki. permalink parent award report block reply UCantStumpTheTrump -1 points 2 days ago Arrest comes before indictment, dummy. thats how i know you have no clue what you are talking about permalink parent award report block reply view 2 more comments... keeman 1 points 2 days ago These are but small players.  It is good that accountability is being applied in these cases, but to actually fix this shit you need to utterly end the FBI, NSA, etc.  When you have kudzu you don't bring out the hand pruners.  You get the flamethrower. permalink parent award report block reply mohel 3 points 2 days ago 4D chess? permalink parent award report block reply Snek_Plissken 2 points 2 days ago The question is does the FBI have jurisdiction over Capitol police. DC is weird legally speaking. In terms of how Biden handled it everything was a federal charge, but is that really how it works? In my understanding of how things work there I've discovered not everything is what you would think. DC is fucking weird. Under 18 criminal offences go to the antifa equivalent attorney general and over 18 crimes go to the federal state attorney. Again, DC is fucking weird and people shouldn't be living there. Why is this a low income cesspool? Why hasn't anyone fix this? It needs to be cleared out. permalink parent award report block reply NoticesBugleOWO 1 points 2 days ago Stop assuming the information YOU have is all the information there is. permalink parent award report block reply\nguywholikesDjtof2024 36 points 2 days ago He is a hindu. Worldview matters. Never expect a hindu to carry out Justice, because Justice is primarily a Christian value. And he gave an award to a bad person, I recall. permalink parent award report block reply Patriots4TN 3 points 2 days ago Bongino is a Catholic though. He has been the one who has been pushing this in spite of the system trying to bury it. permalink parent award report block reply guywholikesDjtof2024 1 points 2 days ago pushing this Pushing what? system What system? Vague comment. permalink parent award report block reply 2scoops2peachmints 7 points 2 days ago Then pipe bomber stuff was Bongino’s biggest wish in his wish list, if nothing comes of this it’s all theater. permalink parent award report block reply snoopy3210 -11 points 2 days ago Close minded piece of shits must have been frustrated when Trump endorsed Vivek this week permalink parent award report block reply Doritalos 5 points 2 days ago He's another, H1B party member permalink parent award report block reply GoodMorningDystopia 3 points 1 day ago filthy  jeet hands typed this. permalink parent award report block reply BigMikesChef 2 points 1 day ago Who's up for a poop fight!?! permalink parent award report block reply DeltaSierra -29 points 2 days ago I never knew what he was and I don’t care about his religion.  What are you some kind of bigoted freak? That is what is wrong with this place.  Very few can just argue the facts.  It has always got to be some big conspiracy of non-white people or people not christian.  Bunch of fuckin losers in the Donald.  You are fuckin scumbag.  Own it. permalink parent award report block reply 1776er 23 points 2 days ago Justice as a western value is a fact permalink parent award report block reply DeltaSierra -26 points 2 days ago Tell that to the Christian slave owners that treated God’s people worse than animals.  You are using the logic of a moron permalink parent award report block reply view 24 more comments... LegacyOfWinning 5 points 2 days ago Jesus Christ is King of the United States of America and the World. permalink parent award report block reply GoodMorningDystopia 1 points 1 day ago Another filthy jeet who thinks they are wanted or needed by Americans. permalink parent award report block reply\nPatriots4TN 3 points 2 days ago Bongino is a Catholic though. He has been the one who has been pushing this in spite of the system trying to bury it. permalink parent award report block reply guywholikesDjtof2024 1 points 2 days ago pushing this Pushing what? system What system? Vague comment. permalink parent award report block reply 2scoops2peachmints 7 points 2 days ago Then pipe bomber stuff was Bongino’s biggest wish in his wish list, if nothing comes of this it’s all theater. permalink parent award report block reply\nguywholikesDjtof2024 1 points 2 days ago pushing this Pushing what? system What system? Vague comment. permalink parent award report block reply 2scoops2peachmints 7 points 2 days ago Then pipe bomber stuff was Bongino’s biggest wish in his wish list, if nothing comes of this it’s all theater. permalink parent award report block reply\n2scoops2peachmints 7 points 2 days ago Then pipe bomber stuff was Bongino’s biggest wish in his wish list, if nothing comes of this it’s all theater. permalink parent award report block reply\nsnoopy3210 -11 points 2 days ago Close minded piece of shits must have been frustrated when Trump endorsed Vivek this week permalink parent award report block reply Doritalos 5 points 2 days ago He's another, H1B party member permalink parent award report block reply GoodMorningDystopia 3 points 1 day ago filthy  jeet hands typed this. permalink parent award report block reply BigMikesChef 2 points 1 day ago Who's up for a poop fight!?! permalink parent award report block reply\nDoritalos 5 points 2 days ago He's another, H1B party member permalink parent award report block reply\nGoodMorningDystopia 3 points 1 day ago filthy  jeet hands typed this. permalink parent award report block reply BigMikesChef 2 points 1 day ago Who's up for a poop fight!?! permalink parent award report block reply\nBigMikesChef 2 points 1 day ago Who's up for a poop fight!?! permalink parent award report block reply\nDeltaSierra -29 points 2 days ago I never knew what he was and I don’t care about his religion.  What are you some kind of bigoted freak? That is what is wrong with this place.  Very few can just argue the facts.  It has always got to be some big conspiracy of non-white people or people not christian.  Bunch of fuckin losers in the Donald.  You are fuckin scumbag.  Own it. permalink parent award report block reply 1776er 23 points 2 days ago Justice as a western value is a fact permalink parent award report block reply DeltaSierra -26 points 2 days ago Tell that to the Christian slave owners that treated God’s people worse than animals.  You are using the logic of a moron permalink parent award report block reply view 24 more comments... LegacyOfWinning 5 points 2 days ago Jesus Christ is King of the United States of America and the World. permalink parent award report block reply GoodMorningDystopia 1 points 1 day ago Another filthy jeet who thinks they are wanted or needed by Americans. permalink parent award report block reply\n1776er 23 points 2 days ago Justice as a western value is a fact permalink parent award report block reply DeltaSierra -26 points 2 days ago Tell that to the Christian slave owners that treated God’s people worse than animals.  You are using the logic of a moron permalink parent award report block reply view 24 more comments...\nDeltaSierra -26 points 2 days ago Tell that to the Christian slave owners that treated God’s people worse than animals.  You are using the logic of a moron permalink parent award report block reply view 24 more comments...\nLegacyOfWinning 5 points 2 days ago Jesus Christ is King of the United States of America and the World. permalink parent award report block reply\nGoodMorningDystopia 1 points 1 day ago Another filthy jeet who thinks they are wanted or needed by Americans. permalink parent award report block reply\nUSDMaga 13 points 2 days ago He offered the $500k reward knowing who the bomber was and knowing that no one would be able to turn her in. His bluff got called in 2 days.  He will do nothing, not even question the bomber. permalink parent award report block reply UCantStumpTheTrump 5 points 2 days ago The only way ANYONE will trust our institutions is for Kash to address this serious rot to the American public, we are owed an explanation permalink parent award report block reply snoopy3210 -4 points 2 days ago You’re just a troll farm pushing this latest lie, it’s not her she doesn’t match at all.. and you can go die somewhere permalink parent award report block reply\nUCantStumpTheTrump 5 points 2 days ago The only way ANYONE will trust our institutions is for Kash to address this serious rot to the American public, we are owed an explanation permalink parent award report block reply\nsnoopy3210 -4 points 2 days ago You’re just a troll farm pushing this latest lie, it’s not her she doesn’t match at all.. and you can go die somewhere permalink parent award report block reply\nIvotedforTrumptwice 5 points 2 days ago I believe the RICO case they are building is so massive that, in order to carry it out, it would have to involve about 8 first world country’s militaries and a couple world wars and some money to Israel. permalink parent award report block reply UCantStumpTheTrump 3 points 2 days ago At this point the Trump DOJ has indicted Comey, Letitia James, and Bolton, and now is expected to indict Schiff and Brennan. I don't think it's just stopping there either permalink parent award report block reply Metal4Freedom 3 points 2 days ago Ever heard the phrase \"you can indict a ham sandwich\"? Unless you see arrests, it's just Kabuki. permalink parent award report block reply UCantStumpTheTrump -1 points 2 days ago Arrest comes before indictment, dummy. thats how i know you have no clue what you are talking about permalink parent award report block reply view 2 more comments... keeman 1 points 2 days ago These are but small players.  It is good that accountability is being applied in these cases, but to actually fix this shit you need to utterly end the FBI, NSA, etc.  When you have kudzu you don't bring out the hand pruners.  You get the flamethrower. permalink parent award report block reply mohel 3 points 2 days ago 4D chess? permalink parent award report block reply\nUCantStumpTheTrump 3 points 2 days ago At this point the Trump DOJ has indicted Comey, Letitia James, and Bolton, and now is expected to indict Schiff and Brennan. I don't think it's just stopping there either permalink parent award report block reply Metal4Freedom 3 points 2 days ago Ever heard the phrase \"you can indict a ham sandwich\"? Unless you see arrests, it's just Kabuki. permalink parent award report block reply UCantStumpTheTrump -1 points 2 days ago Arrest comes before indictment, dummy. thats how i know you have no clue what you are talking about permalink parent award report block reply view 2 more comments... keeman 1 points 2 days ago These are but small players.  It is good that accountability is being applied in these cases, but to actually fix this shit you need to utterly end the FBI, NSA, etc.  When you have kudzu you don't bring out the hand pruners.  You get the flamethrower. permalink parent award report block reply\nMetal4Freedom 3 points 2 days ago Ever heard the phrase \"you can indict a ham sandwich\"? Unless you see arrests, it's just Kabuki. permalink parent award report block reply UCantStumpTheTrump -1 points 2 days ago Arrest comes before indictment, dummy. thats how i know you have no clue what you are talking about permalink parent award report block reply view 2 more comments...\nUCantStumpTheTrump -1 points 2 days ago Arrest comes before indictment, dummy. thats how i know you have no clue what you are talking about permalink parent award report block reply view 2 more comments...\nkeeman 1 points 2 days ago These are but small players.  It is good that accountability is being applied in these cases, but to actually fix this shit you need to utterly end the FBI, NSA, etc.  When you have kudzu you don't bring out the hand pruners.  You get the flamethrower. permalink parent award report block reply\nmohel 3 points 2 days ago 4D chess? permalink parent award report block reply\nSnek_Plissken 2 points 2 days ago The question is does the FBI have jurisdiction over Capitol police. DC is weird legally speaking. In terms of how Biden handled it everything was a federal charge, but is that really how it works? In my understanding of how things work there I've discovered not everything is what you would think. DC is fucking weird. Under 18 criminal offences go to the antifa equivalent attorney general and over 18 crimes go to the federal state attorney. Again, DC is fucking weird and people shouldn't be living there. Why is this a low income cesspool? Why hasn't anyone fix this? It needs to be cleared out. permalink parent award report block reply\nNoticesBugleOWO 1 points 2 days ago Stop assuming the information YOU have is all the information there is. permalink parent award report block reply\nCh3f4554551n 57 points 2 days ago Nope. His big test was Epstein and Maxwell. According to Mossad, he passed with flying colors. permalink award report block reply DrWeeGee 32 points 2 days ago This administration has been one big letdown after another permalink parent award report block reply UCantStumpTheTrump 8 points 2 days ago Don't get demoralized, we are still FAR better off than we would be right now if Kamala had \"won\" and Trump is doing a LOT of work to restore our energy and manufacturing base... Biden cancelled the wall construction and dozens of oil/gas projects, which Trump has opened back up. It will take some time for the prices to realistically come down permalink parent award report block reply ianpatrick1966 2 points 1 day ago Are we?  We need to cross the rubicon and water the tree of liberty.  We are not closer to that as so many hopium huffing retards are still “trusting the plan” Atlas needs to shrug permalink parent award report block reply MediaBro 2 points 2 days ago It's not happening, especially not after AI has been unleashed. Nothing stopping the detractors from saying their names were falsely put on that list. Musk also screwed the pooch by claiming on X that Trump is on the files himself. That was completely unhinged and only has made your side look legit insane. A governed ppl cannot be on constant anxiety, even when they win. If the economy doesn't get better and legal immigration halted to a trickle and illegal immigrants aren't sorted, there is no way the GOP is winning in 2026 and absolutely no way in 2028. At this current rate, I don't even see an election in 2028. permalink parent award report block reply Ch3f4554551n 2 points 2 days ago Trump is absolutely involved. Virginia Giuffre worked for him at Mar a Lago, and Trump is Roy Cohn's protege. He has had intimate knowledge of the Kompromat operation the entire time, and just plays dumb about Mossad's involvement. All of this is openly documented - I recommend Whitney Webb's book on the subject. AI is a moot point when travel logs and calendars are factored in. There is enough evidence to put Prince Andy away for life, but no one will take action on any of it, because all the Kompromat was commissioned by the CIA and Mossad. This is how the world's governments operate. Trump told us all he would end it to get elected, then simply assumed power to take the ring of sauron himself. He hoodwinked all of us, and now merely trickles out enough red meat to satiate the base. Nothing has changed. permalink parent award report block reply\nDrWeeGee 32 points 2 days ago This administration has been one big letdown after another permalink parent award report block reply UCantStumpTheTrump 8 points 2 days ago Don't get demoralized, we are still FAR better off than we would be right now if Kamala had \"won\" and Trump is doing a LOT of work to restore our energy and manufacturing base... Biden cancelled the wall construction and dozens of oil/gas projects, which Trump has opened back up. It will take some time for the prices to realistically come down permalink parent award report block reply ianpatrick1966 2 points 1 day ago Are we?  We need to cross the rubicon and water the tree of liberty.  We are not closer to that as so many hopium huffing retards are still “trusting the plan” Atlas needs to shrug permalink parent award report block reply\nUCantStumpTheTrump 8 points 2 days ago Don't get demoralized, we are still FAR better off than we would be right now if Kamala had \"won\" and Trump is doing a LOT of work to restore our energy and manufacturing base... Biden cancelled the wall construction and dozens of oil/gas projects, which Trump has opened back up. It will take some time for the prices to realistically come down permalink parent award report block reply ianpatrick1966 2 points 1 day ago Are we?  We need to cross the rubicon and water the tree of liberty.  We are not closer to that as so many hopium huffing retards are still “trusting the plan” Atlas needs to shrug permalink parent award report block reply\nianpatrick1966 2 points 1 day ago Are we?  We need to cross the rubicon and water the tree of liberty.  We are not closer to that as so many hopium huffing retards are still “trusting the plan” Atlas needs to shrug permalink parent award report block reply\nMediaBro 2 points 2 days ago It's not happening, especially not after AI has been unleashed. Nothing stopping the detractors from saying their names were falsely put on that list. Musk also screwed the pooch by claiming on X that Trump is on the files himself. That was completely unhinged and only has made your side look legit insane. A governed ppl cannot be on constant anxiety, even when they win. If the economy doesn't get better and legal immigration halted to a trickle and illegal immigrants aren't sorted, there is no way the GOP is winning in 2026 and absolutely no way in 2028. At this current rate, I don't even see an election in 2028. permalink parent award report block reply Ch3f4554551n 2 points 2 days ago Trump is absolutely involved. Virginia Giuffre worked for him at Mar a Lago, and Trump is Roy Cohn's protege. He has had intimate knowledge of the Kompromat operation the entire time, and just plays dumb about Mossad's involvement. All of this is openly documented - I recommend Whitney Webb's book on the subject. AI is a moot point when travel logs and calendars are factored in. There is enough evidence to put Prince Andy away for life, but no one will take action on any of it, because all the Kompromat was commissioned by the CIA and Mossad. This is how the world's governments operate. Trump told us all he would end it to get elected, then simply assumed power to take the ring of sauron himself. He hoodwinked all of us, and now merely trickles out enough red meat to satiate the base. Nothing has changed. permalink parent award report block reply\nCh3f4554551n 2 points 2 days ago Trump is absolutely involved. Virginia Giuffre worked for him at Mar a Lago, and Trump is Roy Cohn's protege. He has had intimate knowledge of the Kompromat operation the entire time, and just plays dumb about Mossad's involvement. All of this is openly documented - I recommend Whitney Webb's book on the subject. AI is a moot point when travel logs and calendars are factored in. There is enough evidence to put Prince Andy away for life, but no one will take action on any of it, because all the Kompromat was commissioned by the CIA and Mossad. This is how the world's governments operate. Trump told us all he would end it to get elected, then simply assumed power to take the ring of sauron himself. He hoodwinked all of us, and now merely trickles out enough red meat to satiate the base. Nothing has changed. permalink parent award report block reply\nI_Am_John_Galt 31 points 2 days ago Between him and Bongino, who were two of the most vocal people on the subject before joining the admin, I'm really struggling to figure out how they haven't driven this to ground yet.  Yeah...I know...I'll be quiet now. permalink award report block reply 5DchessWatch OP 18 points 2 days ago They both wrote books about spygate.  Bonvaginos was called spygate.  I think Kash's was a kids book.  Oh wait he wrote government gangsters. They get in and immediately do nothing.  They are like the 2 dogs barking at each other thru the fence, until an owner opens the fence door and they stop barking and sit down staring at each other.  Owner shuts gate.  Barking resumes This describes the totality of their service permalink parent award report block reply KernalMustard 12 points 2 days ago Grifters, grift. For others its prestige. Thats why Bondi blows my mind. She worked all her adult life to get to this point. AG is top of her profession. Then for now 10 months does jack. It must be some bad shit they got on heror shes always been a bad apple. permalink parent award report block reply 1776er 7 points 2 days ago They don’t need dirt on you when they can show up at your door and tell you they will wipe your line from this earth if you cross them permalink parent award report block reply IPMang 3 points 2 days ago We've had many tens of thousands of people willing to give their life for this country. Why can't we get anyone like that to run these agencies? permalink parent award report block reply view 1 more comments... JoinTheDiscussion 2 points 2 days ago Have enough lead to counter that kind of threat.. Don't be that messenger permalink parent award report block reply Metal4Freedom 2 points 2 days ago Americans used to shoot people like that. Sometimes right at the door. Sometimes later that night at their house. permalink parent award report block reply UCantStumpTheTrump 3 points 2 days ago The only answer that makes sense to me is once they took office, somebody essentially threatened their lives or their families lives, if they went after certain individuals. There's really no other good explanation. Then usually the truth comes out years or decades later when someone finally spills the beans to the public or the conspiracy folks figure it out permalink parent award report block reply RedCalifornia 1 points 2 days ago Remember that book deals are also how the left pays off its own. permalink parent award report block reply Psarg 2 points 2 days ago I think they're worried about nuclear Armageddon. permalink parent award report block reply\n5DchessWatch OP 18 points 2 days ago They both wrote books about spygate.  Bonvaginos was called spygate.  I think Kash's was a kids book.  Oh wait he wrote government gangsters. They get in and immediately do nothing.  They are like the 2 dogs barking at each other thru the fence, until an owner opens the fence door and they stop barking and sit down staring at each other.  Owner shuts gate.  Barking resumes This describes the totality of their service permalink parent award report block reply KernalMustard 12 points 2 days ago Grifters, grift. For others its prestige. Thats why Bondi blows my mind. She worked all her adult life to get to this point. AG is top of her profession. Then for now 10 months does jack. It must be some bad shit they got on heror shes always been a bad apple. permalink parent award report block reply 1776er 7 points 2 days ago They don’t need dirt on you when they can show up at your door and tell you they will wipe your line from this earth if you cross them permalink parent award report block reply IPMang 3 points 2 days ago We've had many tens of thousands of people willing to give their life for this country. Why can't we get anyone like that to run these agencies? permalink parent award report block reply view 1 more comments... JoinTheDiscussion 2 points 2 days ago Have enough lead to counter that kind of threat.. Don't be that messenger permalink parent award report block reply Metal4Freedom 2 points 2 days ago Americans used to shoot people like that. Sometimes right at the door. Sometimes later that night at their house. permalink parent award report block reply UCantStumpTheTrump 3 points 2 days ago The only answer that makes sense to me is once they took office, somebody essentially threatened their lives or their families lives, if they went after certain individuals. There's really no other good explanation. Then usually the truth comes out years or decades later when someone finally spills the beans to the public or the conspiracy folks figure it out permalink parent award report block reply RedCalifornia 1 points 2 days ago Remember that book deals are also how the left pays off its own. permalink parent award report block reply\nKernalMustard 12 points 2 days ago Grifters, grift. For others its prestige. Thats why Bondi blows my mind. She worked all her adult life to get to this point. AG is top of her profession. Then for now 10 months does jack. It must be some bad shit they got on heror shes always been a bad apple. permalink parent award report block reply 1776er 7 points 2 days ago They don’t need dirt on you when they can show up at your door and tell you they will wipe your line from this earth if you cross them permalink parent award report block reply IPMang 3 points 2 days ago We've had many tens of thousands of people willing to give their life for this country. Why can't we get anyone like that to run these agencies? permalink parent award report block reply view 1 more comments... JoinTheDiscussion 2 points 2 days ago Have enough lead to counter that kind of threat.. Don't be that messenger permalink parent award report block reply Metal4Freedom 2 points 2 days ago Americans used to shoot people like that. Sometimes right at the door. Sometimes later that night at their house. permalink parent award report block reply\n1776er 7 points 2 days ago They don’t need dirt on you when they can show up at your door and tell you they will wipe your line from this earth if you cross them permalink parent award report block reply IPMang 3 points 2 days ago We've had many tens of thousands of people willing to give their life for this country. Why can't we get anyone like that to run these agencies? permalink parent award report block reply view 1 more comments... JoinTheDiscussion 2 points 2 days ago Have enough lead to counter that kind of threat.. Don't be that messenger permalink parent award report block reply Metal4Freedom 2 points 2 days ago Americans used to shoot people like that. Sometimes right at the door. Sometimes later that night at their house. permalink parent award report block reply\nIPMang 3 points 2 days ago We've had many tens of thousands of people willing to give their life for this country. Why can't we get anyone like that to run these agencies? permalink parent award report block reply view 1 more comments...\nJoinTheDiscussion 2 points 2 days ago Have enough lead to counter that kind of threat.. Don't be that messenger permalink parent award report block reply\nMetal4Freedom 2 points 2 days ago Americans used to shoot people like that. Sometimes right at the door. Sometimes later that night at their house. permalink parent award report block reply\nUCantStumpTheTrump 3 points 2 days ago The only answer that makes sense to me is once they took office, somebody essentially threatened their lives or their families lives, if they went after certain individuals. There's really no other good explanation. Then usually the truth comes out years or decades later when someone finally spills the beans to the public or the conspiracy folks figure it out permalink parent award report block reply\nRedCalifornia 1 points 2 days ago Remember that book deals are also how the left pays off its own. permalink parent award report block reply\nPsarg 2 points 2 days ago I think they're worried about nuclear Armageddon. permalink parent award report block reply\nFuckCommies 24 points 2 days ago Pussy is the downfall of every ugly dude with power and influence. Oh, and the zionist lobby. Jeets gonna always take that money. Shit, his off-campaign \"logo\" merch he was shilling had a dollar sign through his name. permalink award report block reply TrumpAndGodWin 12 points 2 days ago Alex Jones' sources say that Kash is compromised and lives with a gay billionaire in Vegas. She's the beard or worse. permalink parent award report block reply 5DchessWatch OP 2 points 2 days ago Kash isn't ugly.  But he talks a bit like a nerd.  One notch above Shapiro tier nasality.  And sniffs WAY too much during interviews.  My impression is he's a cokehead.  But other than sniff doesn't act like one.  Sorry kash.  Maybe he's got a medical problem or is addicted to some shit snorty drug that will give him glaucoma, like Flonase. permalink parent award report block reply MediaBro 6 points 2 days ago His official photo looks like he's on crack tbh permalink parent award report block reply 5DchessWatch OP 2 points 1 day ago People have this idea that he has a glass eye that goes off looking the wrong direction.  I don't know , but he def is partially walleyed permalink parent award report block reply\nTrumpAndGodWin 12 points 2 days ago Alex Jones' sources say that Kash is compromised and lives with a gay billionaire in Vegas. She's the beard or worse. permalink parent award report block reply\n5DchessWatch OP 2 points 2 days ago Kash isn't ugly.  But he talks a bit like a nerd.  One notch above Shapiro tier nasality.  And sniffs WAY too much during interviews.  My impression is he's a cokehead.  But other than sniff doesn't act like one.  Sorry kash.  Maybe he's got a medical problem or is addicted to some shit snorty drug that will give him glaucoma, like Flonase. permalink parent award report block reply MediaBro 6 points 2 days ago His official photo looks like he's on crack tbh permalink parent award report block reply 5DchessWatch OP 2 points 1 day ago People have this idea that he has a glass eye that goes off looking the wrong direction.  I don't know , but he def is partially walleyed permalink parent award report block reply\nMediaBro 6 points 2 days ago His official photo looks like he's on crack tbh permalink parent award report block reply 5DchessWatch OP 2 points 1 day ago People have this idea that he has a glass eye that goes off looking the wrong direction.  I don't know , but he def is partially walleyed permalink parent award report block reply\n5DchessWatch OP 2 points 1 day ago People have this idea that he has a glass eye that goes off looking the wrong direction.  I don't know , but he def is partially walleyed permalink parent award report block reply\nYouEssAye 21 points 2 days ago Sorry he's too busy suing right wingers who made fun of his honey pot girlfriend https://thegrayzone.com/2025/11/10/kash-patels-gf-lawsuit-podcasters-mossad/ permalink award report block reply navycuda 12 points 2 days ago Not surprised.  Guess he really is a street shitter after all. permalink parent award report block reply\nnavycuda 12 points 2 days ago Not surprised.  Guess he really is a street shitter after all. permalink parent award report block reply\nJoeMcCarthyWasRight 18 points 2 days ago Fuck him. Talked all that shit and then got put in the greatest possible position to put his money where his mouth is and totally shows what a fucking con man he is. Another terrible Trump hire. permalink award report block reply JoinTheDiscussion 5 points 2 days ago Was it an \"accident\"? permalink parent award report block reply\nJoinTheDiscussion 5 points 2 days ago Was it an \"accident\"? permalink parent award report block reply\ndeleted 12 points 2 days ago lynxxyarly 6 points 2 days ago the walls are finally coming together permalink parent award report block reply OnceADroplet 6 points 2 days ago he's got them right in the crosseyes permalink parent award report block reply Songofsixpence 3 points 2 days ago Half a fortnight? permalink parent award report block reply XlDEN 7 points 2 days ago Half a fortnight was called a septnight, but we stopped using that word for “week.” permalink parent award report block reply\nlynxxyarly 6 points 2 days ago the walls are finally coming together permalink parent award report block reply OnceADroplet 6 points 2 days ago he's got them right in the crosseyes permalink parent award report block reply\nOnceADroplet 6 points 2 days ago he's got them right in the crosseyes permalink parent award report block reply\nSongofsixpence 3 points 2 days ago Half a fortnight? permalink parent award report block reply XlDEN 7 points 2 days ago Half a fortnight was called a septnight, but we stopped using that word for “week.” permalink parent award report block reply\nXlDEN 7 points 2 days ago Half a fortnight was called a septnight, but we stopped using that word for “week.” permalink parent award report block reply\nDeaduponArousal 11 points 2 days ago Let’s ask his completely organic girlfriend how he’s going to handle it…yeah I bet she loves to stare into those crossed eyes through out the night. permalink award report block reply\nshrbrn 11 points 2 days ago This Patel fellow is one giant disappointment. Seems to be an Israeli cock sucker! permalink award report block reply\nHyperlight381 10 points 2 days ago I was such a big advocate of his originally. The giant sized crow i have to eat is substantial. He was compromised from the start which is why he was allowed to take the position permalink award report block reply Metal4Freedom 2 points 2 days ago Thanksgiving is coming. It can't taste worse than turkey. Just slather it with enough gravy and nobody will notice. permalink parent award report block reply\nMetal4Freedom 2 points 2 days ago Thanksgiving is coming. It can't taste worse than turkey. Just slather it with enough gravy and nobody will notice. permalink parent award report block reply\nRalphusthegreatus 9 points 2 days ago Is there really people here who think anything is going to happen? permalink award report block reply DanIsSwell 4 points 2 days ago I know this is the off limits question; but is anyone starting to wonder about the validity of Trump himself? permalink parent award report block reply IPMang 5 points 2 days ago I was just thinking about that... But getting shot in the ear really makes it hard to believe. It's almost like we'd need to believe that was faked if we're to believe Trump isn't legit. permalink parent award report block reply UCantStumpTheTrump 3 points 2 days ago He was already President for 4 years. If you haven't learned to trust Trump (which is the nice thing about his Presidency... you know he has competent people working for him) then you haven't learned anything. It's much worse living with a Dem POTUS and hearing shitty news every day like record numbers of illegals crossing the border (over 3 MILLION in 2023 alone, more than an entire army). Meanwhile the Trump admin has released ZERO illegal aliens inside the US for the last 6 month, a historically low number. Biden was releasing them on parole and flying/bussing them across the country on taxpayers' dime permalink parent award report block reply JoinTheDiscussion 1 points 2 days ago That was enough to make him compromised and then fill his admin with do-nothings permalink parent award report block reply DanIsSwell 1 points 1 day ago That’s true, and that assassination attempt is always the thing that wrangles me back in. It’s just hard to understand a lot of what he does and doesn’t do. I can’t blame it on ignorance or stupidity, because Trump is not those things. permalink parent award report block reply UCantStumpTheTrump 4 points 2 days ago Nah dude this is a forum for Trump supporters, speaking badly about Trump breaks rule #1. And keep this in mind, so far Comey, Bolton and Letitia James have been indicted by a federal grand jury, and Schiff and Brennan are coming up. I think Trump's DOJ has made a good start at going against these evil plotters permalink parent award report block reply Txiribiton 2 points 2 days ago Obviously, you only have to value actions. permalink parent award report block reply MediaBro -3 points 2 days ago Look, Trump can only go so far. You'll are expecting miracles. The man is on his last few years on this Earth and has been fighting on your side and taken so much shit as it is. If this is the way you'll treat the man, with this much disdain, do you honestly think anyone will ever again, from your side, want to take the reigns of the GOP leadership?? Even Vance, a literal war veteran and a guy who worked his way from poverty and married a Hindu woman, whilst being a nominal Christian and became a convert to Catholicism gets flak from you pissants for being married to a Hindu woman. Your current First Lady has done nude photo ops when she was young and she is celebrated but a smart, educated, American born, Indian woman who married her college sweetheart gets shit upon? And that too by the side that is supposedly her husband's ally?? If this is the way you'll treat your own, even your own will walk away. You'll will find yourselves with fewer and fewer friends and even more scattered and destroyed. It is embarrassing to watch on the world stage and you'll cannot continue this behaviour and think this is a winning strategy. permalink parent award report block reply JoinTheDiscussion 1 points 2 days ago Bondi, Kash, Bongino.. He's NOT by himself but is it a wonder that he's surrounded himself with do-nothings ONCE AGAIN.. permalink parent award report block reply Cacciali_Via 1 points 2 days ago Your party lost to Trump twice. What do you know about winning strategies? There is nothing wrong with not normalizing race mixing. I've not seen anyone say personal things about Vance's wife. People just wish he had more wisdom in his youth to go along with his brains. permalink parent award report block reply Ralphusthegreatus 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nDanIsSwell 4 points 2 days ago I know this is the off limits question; but is anyone starting to wonder about the validity of Trump himself? permalink parent award report block reply IPMang 5 points 2 days ago I was just thinking about that... But getting shot in the ear really makes it hard to believe. It's almost like we'd need to believe that was faked if we're to believe Trump isn't legit. permalink parent award report block reply UCantStumpTheTrump 3 points 2 days ago He was already President for 4 years. If you haven't learned to trust Trump (which is the nice thing about his Presidency... you know he has competent people working for him) then you haven't learned anything. It's much worse living with a Dem POTUS and hearing shitty news every day like record numbers of illegals crossing the border (over 3 MILLION in 2023 alone, more than an entire army). Meanwhile the Trump admin has released ZERO illegal aliens inside the US for the last 6 month, a historically low number. Biden was releasing them on parole and flying/bussing them across the country on taxpayers' dime permalink parent award report block reply JoinTheDiscussion 1 points 2 days ago That was enough to make him compromised and then fill his admin with do-nothings permalink parent award report block reply DanIsSwell 1 points 1 day ago That’s true, and that assassination attempt is always the thing that wrangles me back in. It’s just hard to understand a lot of what he does and doesn’t do. I can’t blame it on ignorance or stupidity, because Trump is not those things. permalink parent award report block reply UCantStumpTheTrump 4 points 2 days ago Nah dude this is a forum for Trump supporters, speaking badly about Trump breaks rule #1. And keep this in mind, so far Comey, Bolton and Letitia James have been indicted by a federal grand jury, and Schiff and Brennan are coming up. I think Trump's DOJ has made a good start at going against these evil plotters permalink parent award report block reply Txiribiton 2 points 2 days ago Obviously, you only have to value actions. permalink parent award report block reply MediaBro -3 points 2 days ago Look, Trump can only go so far. You'll are expecting miracles. The man is on his last few years on this Earth and has been fighting on your side and taken so much shit as it is. If this is the way you'll treat the man, with this much disdain, do you honestly think anyone will ever again, from your side, want to take the reigns of the GOP leadership?? Even Vance, a literal war veteran and a guy who worked his way from poverty and married a Hindu woman, whilst being a nominal Christian and became a convert to Catholicism gets flak from you pissants for being married to a Hindu woman. Your current First Lady has done nude photo ops when she was young and she is celebrated but a smart, educated, American born, Indian woman who married her college sweetheart gets shit upon? And that too by the side that is supposedly her husband's ally?? If this is the way you'll treat your own, even your own will walk away. You'll will find yourselves with fewer and fewer friends and even more scattered and destroyed. It is embarrassing to watch on the world stage and you'll cannot continue this behaviour and think this is a winning strategy. permalink parent award report block reply JoinTheDiscussion 1 points 2 days ago Bondi, Kash, Bongino.. He's NOT by himself but is it a wonder that he's surrounded himself with do-nothings ONCE AGAIN.. permalink parent award report block reply Cacciali_Via 1 points 2 days ago Your party lost to Trump twice. What do you know about winning strategies? There is nothing wrong with not normalizing race mixing. I've not seen anyone say personal things about Vance's wife. People just wish he had more wisdom in his youth to go along with his brains. permalink parent award report block reply Ralphusthegreatus 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nIPMang 5 points 2 days ago I was just thinking about that... But getting shot in the ear really makes it hard to believe. It's almost like we'd need to believe that was faked if we're to believe Trump isn't legit. permalink parent award report block reply UCantStumpTheTrump 3 points 2 days ago He was already President for 4 years. If you haven't learned to trust Trump (which is the nice thing about his Presidency... you know he has competent people working for him) then you haven't learned anything. It's much worse living with a Dem POTUS and hearing shitty news every day like record numbers of illegals crossing the border (over 3 MILLION in 2023 alone, more than an entire army). Meanwhile the Trump admin has released ZERO illegal aliens inside the US for the last 6 month, a historically low number. Biden was releasing them on parole and flying/bussing them across the country on taxpayers' dime permalink parent award report block reply JoinTheDiscussion 1 points 2 days ago That was enough to make him compromised and then fill his admin with do-nothings permalink parent award report block reply DanIsSwell 1 points 1 day ago That’s true, and that assassination attempt is always the thing that wrangles me back in. It’s just hard to understand a lot of what he does and doesn’t do. I can’t blame it on ignorance or stupidity, because Trump is not those things. permalink parent award report block reply\nUCantStumpTheTrump 3 points 2 days ago He was already President for 4 years. If you haven't learned to trust Trump (which is the nice thing about his Presidency... you know he has competent people working for him) then you haven't learned anything. It's much worse living with a Dem POTUS and hearing shitty news every day like record numbers of illegals crossing the border (over 3 MILLION in 2023 alone, more than an entire army). Meanwhile the Trump admin has released ZERO illegal aliens inside the US for the last 6 month, a historically low number. Biden was releasing them on parole and flying/bussing them across the country on taxpayers' dime permalink parent award report block reply\nJoinTheDiscussion 1 points 2 days ago That was enough to make him compromised and then fill his admin with do-nothings permalink parent award report block reply\nDanIsSwell 1 points 1 day ago That’s true, and that assassination attempt is always the thing that wrangles me back in. It’s just hard to understand a lot of what he does and doesn’t do. I can’t blame it on ignorance or stupidity, because Trump is not those things. permalink parent award report block reply\nUCantStumpTheTrump 4 points 2 days ago Nah dude this is a forum for Trump supporters, speaking badly about Trump breaks rule #1. And keep this in mind, so far Comey, Bolton and Letitia James have been indicted by a federal grand jury, and Schiff and Brennan are coming up. I think Trump's DOJ has made a good start at going against these evil plotters permalink parent award report block reply\nTxiribiton 2 points 2 days ago Obviously, you only have to value actions. permalink parent award report block reply\nMediaBro -3 points 2 days ago Look, Trump can only go so far. You'll are expecting miracles. The man is on his last few years on this Earth and has been fighting on your side and taken so much shit as it is. If this is the way you'll treat the man, with this much disdain, do you honestly think anyone will ever again, from your side, want to take the reigns of the GOP leadership?? Even Vance, a literal war veteran and a guy who worked his way from poverty and married a Hindu woman, whilst being a nominal Christian and became a convert to Catholicism gets flak from you pissants for being married to a Hindu woman. Your current First Lady has done nude photo ops when she was young and she is celebrated but a smart, educated, American born, Indian woman who married her college sweetheart gets shit upon? And that too by the side that is supposedly her husband's ally?? If this is the way you'll treat your own, even your own will walk away. You'll will find yourselves with fewer and fewer friends and even more scattered and destroyed. It is embarrassing to watch on the world stage and you'll cannot continue this behaviour and think this is a winning strategy. permalink parent award report block reply JoinTheDiscussion 1 points 2 days ago Bondi, Kash, Bongino.. He's NOT by himself but is it a wonder that he's surrounded himself with do-nothings ONCE AGAIN.. permalink parent award report block reply Cacciali_Via 1 points 2 days ago Your party lost to Trump twice. What do you know about winning strategies? There is nothing wrong with not normalizing race mixing. I've not seen anyone say personal things about Vance's wife. People just wish he had more wisdom in his youth to go along with his brains. permalink parent award report block reply\nJoinTheDiscussion 1 points 2 days ago Bondi, Kash, Bongino.. He's NOT by himself but is it a wonder that he's surrounded himself with do-nothings ONCE AGAIN.. permalink parent award report block reply\nCacciali_Via 1 points 2 days ago Your party lost to Trump twice. What do you know about winning strategies? There is nothing wrong with not normalizing race mixing. I've not seen anyone say personal things about Vance's wife. People just wish he had more wisdom in his youth to go along with his brains. permalink parent award report block reply\nRalphusthegreatus 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nHazelHen 9 points 2 days ago Epstein files permalink award report block reply\nSpellingContable 8 points 2 days ago I predict Kash and Bongino doing another 'Freakout Vid\" interview together. I reckon just before they went on air last time they were sent a vid of a person who resembles one of their loved ones being chopped up alive, with the vid title 'Guess Whos Next' permalink award report block reply UCantStumpTheTrump 8 points 2 days ago Nah someone from the intel community (including foreign agencies) probably credibly threatened them and their families with death if they went after certain individuals or organizations. hence the look of terror on their faces. someone got to them early on and neutralized them. Trump needs to realize this and tell them to get with the program or get lost. Put in some dude with nothing to lose who will make the right decisions permalink parent award report block reply SpellingContable 5 points 2 days ago Yeah, I previously said they sent a photo of an agency assassin at their kids school at pickup time, or some similar interaction. But now I like the theory \"Hey, this woman looks like your wife. Watch me chop her up.\"  video theory. Or they were in Dans home videoing his wife while she slept. permalink parent award report block reply\nUCantStumpTheTrump 8 points 2 days ago Nah someone from the intel community (including foreign agencies) probably credibly threatened them and their families with death if they went after certain individuals or organizations. hence the look of terror on their faces. someone got to them early on and neutralized them. Trump needs to realize this and tell them to get with the program or get lost. Put in some dude with nothing to lose who will make the right decisions permalink parent award report block reply SpellingContable 5 points 2 days ago Yeah, I previously said they sent a photo of an agency assassin at their kids school at pickup time, or some similar interaction. But now I like the theory \"Hey, this woman looks like your wife. Watch me chop her up.\"  video theory. Or they were in Dans home videoing his wife while she slept. permalink parent award report block reply\nSpellingContable 5 points 2 days ago Yeah, I previously said they sent a photo of an agency assassin at their kids school at pickup time, or some similar interaction. But now I like the theory \"Hey, this woman looks like your wife. Watch me chop her up.\"  video theory. Or they were in Dans home videoing his wife while she slept. permalink parent award report block reply\nJoeFromHR 7 points 2 days ago No, his big test was how he handled the Epstein case. He not only failed, he betrayed everyone. permalink award report block reply\nLiberalism_is_mental 7 points 2 days ago The fact that she wasn't immediately arrested and questioned shows that we're back to the deepstate in charge.  Even if they arrested her, questioned her and then cleared her name, would show they're serious about it.  Total crickets is a very bad and telling sign. permalink award report block reply TrumpAndGodWin 5 points 2 days ago Apparently she or Zhe is in a CIA safe house. alexjonesapp dot com permalink parent award report block reply Cacciali_Via 1 points 2 days ago Why do you think she isn't a cooperating witness? permalink parent award report block reply\nTrumpAndGodWin 5 points 2 days ago Apparently she or Zhe is in a CIA safe house. alexjonesapp dot com permalink parent award report block reply\nCacciali_Via 1 points 2 days ago Why do you think she isn't a cooperating witness? permalink parent award report block reply\nlearntocode 6 points 2 days ago I can think of a bunch of other shit. The Oswald communication prior to the assassination. Anthony Weiners laptop. Seth Rich files. ID of guy who shorted airlines prior to 9-11. permalink award report block reply\nBeaverstatemilitia 5 points 2 days ago He will fail as he always has! permalink award report block reply MajJamesMcFarlane 1 points 2 days ago Fall? Sounds like he's successful at what he was told to do permalink parent award report block reply\nMajJamesMcFarlane 1 points 2 days ago Fall? Sounds like he's successful at what he was told to do permalink parent award report block reply\nhey_spike 5 points 2 days ago I want the chain of command above the bomber. permalink award report block reply\nTabascocat12 4 points 2 days ago Anyone who had to get approved by Congress(under Trump) for a position is not going to do anything except talk and serve platitudes.  Sure, there will be some arrests but none of it related to what needs to be done.  The political criminals are fully in control. permalink award report block reply\norange_kek_great 4 points 2 days ago He won't do shit. permalink award report block reply\nJustjayce 3 points 2 days ago From burn bag to toilet paper I bet permalink award report block reply\nraptoris2 3 points 2 days ago Kash and Bondi need to be replaced. permalink award report block reply\nObambi 3 points 2 days ago The problem with Trump rich inner circle people is that they’re loyal to Israel first and that fucks up MAGA for the middle income folks and why we see this giant let down. They don’t see it because they’re in this bubble. They don’t go to the grocery store or struggle with constant bills. permalink award report block reply\nMelodicgrog 3 points 2 days ago He’s failed every other test, but this OSS the big one I guess permalink award report block reply\nIPMang 2 points 2 days ago Has Trump spoken about this case at all or recently? I think that would be pretty telling permalink award report block reply\nHenkZeilstra 2 points 2 days ago Kash Patel more like Kash Pajeet, big boy talk but nothing absolutely NOTHING. permalink award report block reply\nKilroy 2 points 2 days ago I thought Kash retired and moved to Bermuda. permalink award report block reply\nSpellmonger 2 points 1 day ago Get PATEL and BONDI out of there! They are singlehandedly destroying MAGA.  Appoint Matt Geatz as interim AG and let him pick the FBI director. permalink award report block reply Steve56775 1 points 1 day ago Trump has wasted a fourth of his presidency on these two traitors. He needs to put his boots on and show them the curb. permalink parent award report block reply\nSteve56775 1 points 1 day ago Trump has wasted a fourth of his presidency on these two traitors. He needs to put his boots on and show them the curb. permalink parent award report block reply\nHanging_Chad 1 points 2 days ago for years, there’s been a far-right conspiracy theory that it’s an FBI training prop for bomb threats and such permalink award report block reply 5DchessWatch OP 2 points 2 days ago Maybe, but I think pipebombhoax was a gang initiation ritual for capuchinfaced policewoman to join the gang that is the CIA permalink parent award report block reply Hanging_Chad 2 points 2 days ago maybe, but I still think it’s an FBI training prop permalink parent award report block reply 5DchessWatch OP 2 points 1 day ago There is no reason it can't be both.  Just like the many many deepstate motivations and 'cui bonos' of 9/11/2001 permalink parent award report block reply\n5DchessWatch OP 2 points 2 days ago Maybe, but I think pipebombhoax was a gang initiation ritual for capuchinfaced policewoman to join the gang that is the CIA permalink parent award report block reply Hanging_Chad 2 points 2 days ago maybe, but I still think it’s an FBI training prop permalink parent award report block reply 5DchessWatch OP 2 points 1 day ago There is no reason it can't be both.  Just like the many many deepstate motivations and 'cui bonos' of 9/11/2001 permalink parent award report block reply\nHanging_Chad 2 points 2 days ago maybe, but I still think it’s an FBI training prop permalink parent award report block reply 5DchessWatch OP 2 points 1 day ago There is no reason it can't be both.  Just like the many many deepstate motivations and 'cui bonos' of 9/11/2001 permalink parent award report block reply\n5DchessWatch OP 2 points 1 day ago There is no reason it can't be both.  Just like the many many deepstate motivations and 'cui bonos' of 9/11/2001 permalink parent award report block reply\nSqRt7744 1 points 1 day ago Lol this is not his big test. Epstein was and he failed miserably. permalink award report block reply\nPiratePatriotParrot 1 points 2 days ago Fuck this bitch gimp limp lady permalink award report block reply guywholikesDjtof2024 1 points 2 days ago who? permalink parent award report block reply PiratePatriotParrot 2 points 2 days ago \"Ms. Kerkhoff had an added factor working against her in terms of the program’s ability to identify her gait. The severe soccer injury she suffered in college, which fractured her tibia, left her with a slight permanent limp.\" permalink parent award report block reply\nguywholikesDjtof2024 1 points 2 days ago who? permalink parent award report block reply PiratePatriotParrot 2 points 2 days ago \"Ms. Kerkhoff had an added factor working against her in terms of the program’s ability to identify her gait. The severe soccer injury she suffered in college, which fractured her tibia, left her with a slight permanent limp.\" permalink parent award report block reply\nPiratePatriotParrot 2 points 2 days ago \"Ms. Kerkhoff had an added factor working against her in terms of the program’s ability to identify her gait. The severe soccer injury she suffered in college, which fractured her tibia, left her with a slight permanent limp.\" permalink parent award report block reply\nCalumet57 1 points 2 days ago It is a tiny test if a test at all. But I agree that no stone in J6 should be left unturned. permalink award report block reply\nGoodMorningDystopia 1 points 1 day ago The filthy jeet needs to go. permalink award report block reply\nBrionK 1 points 2 days ago Really?\nHow about he makes good on the list he published. permalink award report block reply\nAbrahamLincoln 1 points 1 day ago He's going to punt it to Bondi, and Bondi will punt it into the bottomless pit she calls her desk. permalink award report block reply\nckover9000 1 points 1 day ago The Epstein Files was his big test, and he failed miserably. permalink award report block reply\nRiffFantastic 1 points 2 days ago Have they questioned this bitch yet? permalink award report block reply\nf_bastiat 1 points 1 day ago His biggest test was the Epstein files and he failed miserably. permalink award report block reply\nFlyCatcher94 1 points 1 day ago He’s already shilling for zionists . permalink award report block reply\nFusionBlack 1 points 2 days ago No very well. permalink award report block reply\nProtonboy 1 points 1 day ago Is there any doubt, really? permalink award report block reply\nRINOssuck 1 points 1 day ago What a ridiculous statement. permalink award report block reply\nSoldanoSlo 0 points 2 days ago Better have something more solid than \"gait analysis\" permalink award report block reply VoteThing 2 points 2 days ago There's not much need. The gait analysis is solid by itself. It's biometric information. But then once you have a suspect, it's easy to gather a bunch of other circumstantial evidence. permalink parent award report block reply\nVoteThing 2 points 2 days ago There's not much need. The gait analysis is solid by itself. It's biometric information. But then once you have a suspect, it's easy to gather a bunch of other circumstantial evidence. permalink parent award report block reply\nFatigueIsReal 0 points 2 days ago I'll take record arrests for human trafficking and finding thousands of kids. The rest is just a bonus. permalink award report block reply LockNload 6 points 2 days ago Low hanging fruit is a great distraction. permalink parent award report block reply\nLockNload 6 points 2 days ago Low hanging fruit is a great distraction. permalink parent award report block reply\ncherbui 0 points 2 days ago attempted murder = death penalty ? duh permalink award report block reply\nHoodooOperator 1 points 1 day ago Comment removed by community moderators. permalink award report block reply"}