{"id": "1ARK55biUq", "contents": "329 Brennan, Strzok, Page subpoenaed as part of federal Russiagate probe: Sources (www.foxnews.com) posted 5 days ago by Beat_to_Quarters 11 comments award share report block Brennan, Strzok, Page subpoenaed as part of federal Russiagate probe: Sources Former CIA Director John Brennan and ex-FBI officials Peter Strzok and Lisa Page were subpoenaed by a federal grand jury in the Trump-Russia investigation. www.foxnews.com\n11 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno Say_what_again 7 points 5 days ago Have fun spending those million dollar pay-offs on your criminal defense cases, traitors permalink award report block reply UCantStumpTheTrump 3 points 5 days ago Bingo, punish them with the process just like they did Trump permalink parent award report block reply Stars-n-Stripes 3 points 5 days ago I agree - - if you can't jail them, bleed them dry financially. Drag out those legal billable hours for months and months. permalink parent award report block reply Tradstew 1 points 5 days ago Ok, next? permalink award report block reply starjello 1 points 5 days ago Arrests?  LOLOLOL permalink parent award report block reply UCantStumpTheTrump 0 points 5 days ago James Comey, Letitia James, and John Bolton have all been indicted and charged with crimes. Did you miss that? permalink parent award report block reply Blackmore 3 points 5 days ago What’s going on with LetItia James? The facts are that she did the crime, now we want her to do the time. Simple enough, if that was me, I would be in jail. permalink parent award report block reply starjello 0 points 4 days ago LOL get back to me when they are convicted. Comey's charges are basically a jay walking charge. James will get black bitch privilege. Bolten was in the Trump administration and will go down and the media will bring Trump into it. Justice has been a joke, have you missed that?\nNo, New York Attorney General Letitia James was not arrested, but she was indicted on federal charges of bank fraud and making false statements to a financial institution. She appeared for an arraignment on October 24, 2025, where she pleaded not guilty and was released with no special conditions. A trial date has been set for January 26, 2026. permalink parent award report block reply UCantStumpTheTrump 0 points 4 days ago An arrest is a formality, what matters are the charges. Letitia James has been caught dead to rights, so I'm interested in what legal theory makes you think she will avoid punishment (maximum of 30 years per felony count) permalink parent award report block reply view 2 more comments...\nSay_what_again 7 points 5 days ago Have fun spending those million dollar pay-offs on your criminal defense cases, traitors permalink award report block reply UCantStumpTheTrump 3 points 5 days ago Bingo, punish them with the process just like they did Trump permalink parent award report block reply Stars-n-Stripes 3 points 5 days ago I agree - - if you can't jail them, bleed them dry financially. Drag out those legal billable hours for months and months. permalink parent award report block reply\nUCantStumpTheTrump 3 points 5 days ago Bingo, punish them with the process just like they did Trump permalink parent award report block reply\nStars-n-Stripes 3 points 5 days ago I agree - - if you can't jail them, bleed them dry financially. Drag out those legal billable hours for months and months. permalink parent award report block reply\nTradstew 1 points 5 days ago Ok, next? permalink award report block reply starjello 1 points 5 days ago Arrests?  LOLOLOL permalink parent award report block reply UCantStumpTheTrump 0 points 5 days ago James Comey, Letitia James, and John Bolton have all been indicted and charged with crimes. Did you miss that? permalink parent award report block reply Blackmore 3 points 5 days ago What’s going on with LetItia James? The facts are that she did the crime, now we want her to do the time. Simple enough, if that was me, I would be in jail. permalink parent award report block reply starjello 0 points 4 days ago LOL get back to me when they are convicted. Comey's charges are basically a jay walking charge. James will get black bitch privilege. Bolten was in the Trump administration and will go down and the media will bring Trump into it. Justice has been a joke, have you missed that?\nNo, New York Attorney General Letitia James was not arrested, but she was indicted on federal charges of bank fraud and making false statements to a financial institution. She appeared for an arraignment on October 24, 2025, where she pleaded not guilty and was released with no special conditions. A trial date has been set for January 26, 2026. permalink parent award report block reply UCantStumpTheTrump 0 points 4 days ago An arrest is a formality, what matters are the charges. Letitia James has been caught dead to rights, so I'm interested in what legal theory makes you think she will avoid punishment (maximum of 30 years per felony count) permalink parent award report block reply view 2 more comments...\nstarjello 1 points 5 days ago Arrests?  LOLOLOL permalink parent award report block reply UCantStumpTheTrump 0 points 5 days ago James Comey, Letitia James, and John Bolton have all been indicted and charged with crimes. Did you miss that? permalink parent award report block reply Blackmore 3 points 5 days ago What’s going on with LetItia James? The facts are that she did the crime, now we want her to do the time. Simple enough, if that was me, I would be in jail. permalink parent award report block reply starjello 0 points 4 days ago LOL get back to me when they are convicted. Comey's charges are basically a jay walking charge. James will get black bitch privilege. Bolten was in the Trump administration and will go down and the media will bring Trump into it. Justice has been a joke, have you missed that?\nNo, New York Attorney General Letitia James was not arrested, but she was indicted on federal charges of bank fraud and making false statements to a financial institution. She appeared for an arraignment on October 24, 2025, where she pleaded not guilty and was released with no special conditions. A trial date has been set for January 26, 2026. permalink parent award report block reply UCantStumpTheTrump 0 points 4 days ago An arrest is a formality, what matters are the charges. Letitia James has been caught dead to rights, so I'm interested in what legal theory makes you think she will avoid punishment (maximum of 30 years per felony count) permalink parent award report block reply view 2 more comments...\nUCantStumpTheTrump 0 points 5 days ago James Comey, Letitia James, and John Bolton have all been indicted and charged with crimes. Did you miss that? permalink parent award report block reply Blackmore 3 points 5 days ago What’s going on with LetItia James? The facts are that she did the crime, now we want her to do the time. Simple enough, if that was me, I would be in jail. permalink parent award report block reply starjello 0 points 4 days ago LOL get back to me when they are convicted. Comey's charges are basically a jay walking charge. James will get black bitch privilege. Bolten was in the Trump administration and will go down and the media will bring Trump into it. Justice has been a joke, have you missed that?\nNo, New York Attorney General Letitia James was not arrested, but she was indicted on federal charges of bank fraud and making false statements to a financial institution. She appeared for an arraignment on October 24, 2025, where she pleaded not guilty and was released with no special conditions. A trial date has been set for January 26, 2026. permalink parent award report block reply UCantStumpTheTrump 0 points 4 days ago An arrest is a formality, what matters are the charges. Letitia James has been caught dead to rights, so I'm interested in what legal theory makes you think she will avoid punishment (maximum of 30 years per felony count) permalink parent award report block reply view 2 more comments...\nBlackmore 3 points 5 days ago What’s going on with LetItia James? The facts are that she did the crime, now we want her to do the time. Simple enough, if that was me, I would be in jail. permalink parent award report block reply\nstarjello 0 points 4 days ago LOL get back to me when they are convicted. Comey's charges are basically a jay walking charge. James will get black bitch privilege. Bolten was in the Trump administration and will go down and the media will bring Trump into it. Justice has been a joke, have you missed that?\nNo, New York Attorney General Letitia James was not arrested, but she was indicted on federal charges of bank fraud and making false statements to a financial institution. She appeared for an arraignment on October 24, 2025, where she pleaded not guilty and was released with no special conditions. A trial date has been set for January 26, 2026. permalink parent award report block reply UCantStumpTheTrump 0 points 4 days ago An arrest is a formality, what matters are the charges. Letitia James has been caught dead to rights, so I'm interested in what legal theory makes you think she will avoid punishment (maximum of 30 years per felony count) permalink parent award report block reply view 2 more comments...\nUCantStumpTheTrump 0 points 4 days ago An arrest is a formality, what matters are the charges. Letitia James has been caught dead to rights, so I'm interested in what legal theory makes you think she will avoid punishment (maximum of 30 years per felony count) permalink parent award report block reply view 2 more comments..."}