{"id": "1ARK9nPtyi", "contents": "99 Nope posted 2 hours ago by neosin 9 comments award share download report block\n9 comments Sort by Top Top New Worst Old Save FromNC 6 points 1 hour ago $2k check if you already qualify for other government handouts ** permalink award report block reply Comanche 4 points 2 hours ago THIS! permalink award report block reply happyfave 4 points 2 hours ago I mean, ill take a 2000 tariff check.   All you complaining faggots today probably would have loved everything right now if Kamala won. permalink award report block reply TiggerLovingPooh 4 points 1 hour ago Yeah, gotta say.... always open to the idea of government giving back the money they've stolen from us. permalink parent award report block reply KnighTshade 2 points 50 minutes ago Same, idk why the 2k check is controversial. Reward those who trusted Trump with the economy. permalink parent award report block reply Elencher 2 points 42 minutes ago Because with the cap on it its basically going to the leech class. permalink parent award report block reply MAG-n-KAG 1 points 19 minutes ago and theres better shit to spend the money on, like paying down the debt. permalink parent award report block reply Morokei 2 points 52 minutes ago Trump already caved to a black and brown only disbursement permalink award report block reply utfanx2 1 points 36 minutes ago Don't need a check, just take it out of next years taxes. permalink award report block reply\nFromNC 6 points 1 hour ago $2k check if you already qualify for other government handouts ** permalink award report block reply\nComanche 4 points 2 hours ago THIS! permalink award report block reply\nhappyfave 4 points 2 hours ago I mean, ill take a 2000 tariff check.   All you complaining faggots today probably would have loved everything right now if Kamala won. permalink award report block reply TiggerLovingPooh 4 points 1 hour ago Yeah, gotta say.... always open to the idea of government giving back the money they've stolen from us. permalink parent award report block reply KnighTshade 2 points 50 minutes ago Same, idk why the 2k check is controversial. Reward those who trusted Trump with the economy. permalink parent award report block reply Elencher 2 points 42 minutes ago Because with the cap on it its basically going to the leech class. permalink parent award report block reply MAG-n-KAG 1 points 19 minutes ago and theres better shit to spend the money on, like paying down the debt. permalink parent award report block reply\nTiggerLovingPooh 4 points 1 hour ago Yeah, gotta say.... always open to the idea of government giving back the money they've stolen from us. permalink parent award report block reply KnighTshade 2 points 50 minutes ago Same, idk why the 2k check is controversial. Reward those who trusted Trump with the economy. permalink parent award report block reply Elencher 2 points 42 minutes ago Because with the cap on it its basically going to the leech class. permalink parent award report block reply MAG-n-KAG 1 points 19 minutes ago and theres better shit to spend the money on, like paying down the debt. permalink parent award report block reply\nKnighTshade 2 points 50 minutes ago Same, idk why the 2k check is controversial. Reward those who trusted Trump with the economy. permalink parent award report block reply Elencher 2 points 42 minutes ago Because with the cap on it its basically going to the leech class. permalink parent award report block reply MAG-n-KAG 1 points 19 minutes ago and theres better shit to spend the money on, like paying down the debt. permalink parent award report block reply\nElencher 2 points 42 minutes ago Because with the cap on it its basically going to the leech class. permalink parent award report block reply MAG-n-KAG 1 points 19 minutes ago and theres better shit to spend the money on, like paying down the debt. permalink parent award report block reply\nMAG-n-KAG 1 points 19 minutes ago and theres better shit to spend the money on, like paying down the debt. permalink parent award report block reply\nMorokei 2 points 52 minutes ago Trump already caved to a black and brown only disbursement permalink award report block reply\nutfanx2 1 points 36 minutes ago Don't need a check, just take it out of next years taxes. permalink award report block reply"}