{"id": "1ARK9pgyKf", "contents": "10 How do we scream and get the attention \"Stop the H1B flood !!!!  Now!!! posted 24 minutes ago by Tophat9000 3 comments award share report block The illegals flooded the manual labor market and undercut American workers H1B floods the entry level technical markets and undercut the American workers.. It's all the same The whole logic of tariffs is about stopping the importation of cheap foreign products undercutting American product Illegals and H1B is the importing of cheap foreign product ...foreign labor is the product I work in tech I've seen companies that have bought whole apartment building complexes to house their H1B imported workers What the hell is going on Trump understood this in 2016 ?... Somehow we got to get the attention on this fast because this pivot a focus will destroy everything.... This is Trump's COVID shot of the second term... This is making me sick at heart\n3 comments Sort by Top Top New Worst Old Save Tophat9000 OP 1 points 12 minutes ago .... Here's the problem with foreign workers... They have their original home country..... But instead of working to move their original home country up....they are moving here to try and move UP... But we the Americans born here....We don't have a second home country We don't have a second place to go to to move UP....... Everyone from a foreign country comes here to move UP... Moves the American born DOWN permalink award report block reply lostmyoldpassword 1 points 11 minutes ago He seems to have jumped ship, and is fighting the good fight, on someone else's fucking team.  That's what it feels like anyway.  The constant blind copypaste vile attacks on anything even remotely questioning of him or his increasingly contradictory policy changes from 2016 - well, that's just kind of the final nail in the coffin no?  I'm not going to be gaslit by a bunch of fucking bots, and/or actual humans who stopped paying attention, and think this shit is a football game they have on in the background. permalink award report block reply CommanderComadant 1 points 22 minutes ago I tried to leave early for the office this morning, but I turned around traffic is so terrible our infrastructure is completely overwhelmed. Everyone is foreign. permalink award report block reply\nTophat9000 OP 1 points 12 minutes ago .... Here's the problem with foreign workers... They have their original home country..... But instead of working to move their original home country up....they are moving here to try and move UP... But we the Americans born here....We don't have a second home country We don't have a second place to go to to move UP....... Everyone from a foreign country comes here to move UP... Moves the American born DOWN permalink award report block reply\nlostmyoldpassword 1 points 11 minutes ago He seems to have jumped ship, and is fighting the good fight, on someone else's fucking team.  That's what it feels like anyway.  The constant blind copypaste vile attacks on anything even remotely questioning of him or his increasingly contradictory policy changes from 2016 - well, that's just kind of the final nail in the coffin no?  I'm not going to be gaslit by a bunch of fucking bots, and/or actual humans who stopped paying attention, and think this shit is a football game they have on in the background. permalink award report block reply\nCommanderComadant 1 points 22 minutes ago I tried to leave early for the office this morning, but I turned around traffic is so terrible our infrastructure is completely overwhelmed. Everyone is foreign. permalink award report block reply"}