{"id": "1ARK9isbHL", "contents": "1055 UC Berkeley (Nov. 10) — A TPUSA supporter and a far-left militant got into a fight. A leftist racially mocks the conservative. Masked militants tried to pull their violent comrade away from police. posted 2 days ago by PiratePatriotParrot 114 comments award share report block Andy Ngo @MrAndyNgo • 2d “You’re bleeding, white boy!” UC Berkeley (Nov. 10) — A TPUSA supporter and a far-left militant got into a fight. A leftist racially mocks the conservative. Masked militants tried to pull their violent comrade away from police. Video by @Savsays:\n114 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget Beat_to_Quarters 151 points 2 days ago Kirk gets assassinated at a college campus, antifa is declared a domestic terrorist organization, and TPUSA gets attacked on college campuses like nothing's changed. permalink award report block reply Prandogolio 66 points 2 days ago Nothing has changed.  The commies have killed their opponents for over a century. permalink parent award report block reply Bohemyth_2 17 points 2 days ago @0:42 begins some strange camera avoidance behavior. The commie was very eager to have the arresting officer get him away from the camera ASAP permalink parent award report block reply fforgotpasswordagain 12 points 2 days ago probably in usa on a student visa. this should be enough to send him back permalink parent award report block reply SupFrens 2 points 2 days ago Fascism is the appropriate response to communism. permalink parent award report block reply lostremote- 9 points 1 day ago 30.06 is the best response to communism. permalink parent award report block reply Prandogolio 1 points 1 day ago Well it's one appropriate response. permalink parent award report block reply Viewer01 52 points 2 days ago Yet people wonder why zoomers are turning out the way they are. permalink parent award report block reply TarHeelMAGA 2 points 2 days ago Comment removed by community moderators. permalink parent award report block reply HoodooOperator 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply IncredibleMrE1 31 points 2 days ago Because nothing has changed. Best you'll get out of Bill Barrbie is some Fox performances, and Kash is busy polishing the turd that is the FBI. Even if he wasn't, the FBI still wouldn't give up its shock troops. permalink parent award report block reply militantnationalist6 16 points 2 days ago Yep. What you’re witnessing is the standard boomer conservatism that’s dying. What you want is nationalism. That’s when this shit gets stomped out. We’re progressing nicely to this, it’s inevitable. permalink parent award report block reply Metal4Freedom 8 points 2 days ago I'm all good for Christian Nationalism. America was great when our people loved and obeyed God. permalink parent award report block reply PiratePatriotParrot OP 8 points 2 days ago It's California. Enemy territory. There's no federal troops for justice. permalink parent award report block reply load 3 more comments... JoeMcCarthyWasRight 90 points 2 days ago “Hey white boy!” President Trump better get involved and start going after these anti-white terrorists. He won’t like the alternative where we curb stomp these fucking mutts. permalink award report block reply TheJakeFroggy 32 points 2 days ago Antifa is lucky that they have police and judge protection. If it weren't for that, I'm sure there are lots of people who would love to kill these ghouls if there weren't any consequences for doing so. permalink parent award report block reply BlackPilledMAGA 8 points 1 day ago You'd think the cops would arrest the domestic terrorists and not the guy defending himself from them. We've been sold a bill of bullshit goods. permalink parent award report block reply MySidesGoUp 3 points 1 day ago You forgot you writes the checks. permalink parent award report block reply michealr24 1 points 1 day ago Ready and willing. permalink parent award report block reply MySidesGoUp 1 points 1 day ago And lucky the opposition has families and jobs. At some point, those same authorities will have to deal with actual agrarian, heterosexuals…and when that moment comes, god bless their souls…. permalink parent award report block reply Bubbahax 26 points 2 days ago \"Hey white boy\" is pretty much all you need to know about Antifa. permalink parent award report block reply MehNahMehNah 3 points 1 day ago Self hating fags. permalink parent award report block reply Prandogolio 12 points 2 days ago We're definitely going to start doing that any day now! permalink parent award report block reply Seatacjoe 20 points 2 days ago To be fair, I already let Andy Ngo know that if he ever needs someone to back him up when he comes up to Seattle that I would gladly help defend him so he can do his journalistic work.   He replied and told me that it is very dangerous, I am mid age where my wrists are as big around as most of these fucks necks and sure I would be sore in the morning, takes longer to heal but all of you that have been in a worthy fight knows, it heals the soul. permalink parent award report block reply m0ntsta 13 points 2 days ago A man after my own heart. USA Boxer from 14-17. Jail time from 19-21. Hard working 43 year old man now with a sore back. But always down for a good spar. You’re doing the Lord’s work, friend. permalink parent award report block reply TheRPatriot 9 points 2 days ago We need more like yourself! I have often thought of reaching out to other conservative activists and doing the same. I don’t see why not. It’s the only way permalink parent award report block reply PiratePatriot 1 points 2 days ago \" it heals the soul\" permalink parent award report block reply Wtf_socialismreally 4 points 2 days ago I do believe the dam will burst at some point. It's just a matter of if that dam is repaired first (putting AntiFA down), if it happens under our own people, or if it happens under people who would hunt down everyone that so much as posted in a similar forum as anyone who stepped up. The best outcome is that Trump's DoJ handles it. But despite the labels, I remain unmoved and unimpressed. permalink parent award report block reply anotherthing 2 points 1 day ago Those terrorists are just lucky they didn't say anything bad about Israel. They'd be in for some real justice then! permalink parent award report block reply HoodooOperator 2 points 1 day ago Comment removed by community moderators. permalink parent award report block reply MakeAmericaGreat9 49 points 2 days ago I'm blaming republican leadership all the way to trump for this. You can't start the war we started, then not do everything necessary to protect the troops. Enough is enough, invade with the national guard or declare the insurrection act and get going. permalink award report block reply m0ntsta 19 points 2 days ago The way our side half asses everything is maddening. We talk shit and go punch someone in the stomach but are not prepared to finish the fight and then when the pendulum swings back the other way we get beaten the fuck down. permalink parent award report block reply MySidesGoUp 7 points 1 day ago Look at Covid. We were all punched in the mouth. Best we could do was dismiss their cancer vaccines. Well, we’re gonna have to do better. permalink parent award report block reply ConsrvspkgNJ 0 points 1 day ago Oh hell no!!! Fuck that!!! We won that fight!!! Don't undersell that bullshit and give those commie fucks a win they didn't earn. They meant for every fucking one of us to die of the Covid vax, they meant for us to still be in masks today, they meant to put us resistors in camps. I fought the war in NJ, enemy territory and we got them to back down. They opened schools totally unwillingly, they gave up the mask mandate totally unwillingly and they abandoned the vax mandate totally unwillingly. Fuck that, I was giving Governor Goofy the finger at a rally in his front yard as the NJ State Police were telling us \"you have had enough First Amendment for the day\" proving they were nothing but pension whores. Fuck that, we won that fight. permalink parent award report block reply Appeal2Heaven98 -3 points 23 hours ago How you can spin the handling of the Covid pandemic as a win for us is beyond me. Congratulations. You avoided getting a vaccine and gave your governor the bird. Here's a gold star for participating in doing the absolute bare minimum. They did it as a test run to see how far they could go with taking away our rights. They shut down the world for months, if not years, and we let them do it. permalink parent award report block reply view 1 more comments... Emodius -14 points 2 days ago Oh shut the fuck up this isn't Trump's fault you insufferable faggot. permalink parent award report block reply MakeAmericaGreat9 13 points 2 days ago Get fucked faggot. You don't throw the troops in halfway. You either support them, or stfu. You are fine with complacency. In 3 years democrats are coming for everyone that has a R next to their name PERIOD. permalink parent award report block reply SicilianOmega 22 points 2 days ago Looks like the zogs arrested both the leftist and his victim. permalink award report block reply Nomad899 13 points 2 days ago Cops just arrest…sometimes to protect the victim…. Likely in this case based on all the commies present, someone would attacked him again.   Would like to see what charges come out of it permalink parent award report block reply HillarysFUPA 9 points 2 days ago If you are being arrested, go with it .. you sort out the details later. If you fight it, you will surely lose any ground you had. permalink parent award report block reply OnceADroplet 4 points 2 days ago \"I pay your salary\" is always the most ironic retort of the Karen. Why else would they be there? permalink parent award report block reply booblitchutz 1 points 1 day ago I think this dudes blood was up from the fight. It’s hard to just chill and cooperate instantly. permalink parent award report block reply A_Colostomy_Bag 1 points 2 days ago I don't get why people think they're going to resolve legal issues with a police officer arresting them yet they so often do.  Save the argument for the court, they only hurt their cause by fighting the police. permalink parent award report block reply HillarysFUPA 1 points 1 day ago Ok, you can resist is you want, even if you are innocent. It won't help your case, and it make you look guilty, but at least you'll feel like you fought the system while getting raped on prison. permalink parent award report block reply view 1 more comments... Agent_Orange 19 points 2 days ago \"You're bleeding, White boy!\". Says the frail White boy who thinks he's a badass. permalink award report block reply Spicy_cat 4 points 1 day ago Probably Jew permalink parent award report block reply ConsrvspkgNJ 2 points 1 day ago I had the same thought looking at him. permalink parent award report block reply EDDIT_IS_CUCKED 1 points 1 day ago Comment removed by community filter. permalink parent award report block reply FORMERCHILDSTAR 17 points 2 days ago Racist hate crime. Charge them appropriately. permalink award report block reply PiratePatriotParrot OP 9 points 2 days ago I agree permalink parent award report block reply Taqiyya_Mockingbird 16 points 2 days ago Didn’t we declare these people as terrorists? Where’s Delta Force? permalink award report block reply USNVET71 15 points 2 days ago I want go and fuck up some antifa faggots, where do I sign up permalink award report block reply ConsrvspkgNJ 3 points 1 day ago As I am not a Fed, I am not encouraging you but if you are so inclined Find the Antifa social media sites and monitor their accounts for marches and protests Find other like minded patriots who wish to do the same vet them to ensure you aren't linking up with Ray Epps V2.0 Ensure that everyone in your circle can scrap Locate next protest site Recon it and plan Show up and blow up permalink parent award report block reply ianpatrick1966 3 points 1 day ago It would be better to do it one on one.  Find the leader camp outside their house wait until they’re alone then… the thing permalink parent award report block reply ConsrvspkgNJ 1 points 1 day ago Yeah, being from NJ, I get what you are saying but that is a recon mission that may be difficult to conduct and not blow cover. It's just easier to watch for the latest \"Antifa Day of Gay Sex and Outrage\" and bring your friends so as to dispense the beneficial ass whooping. permalink parent award report block reply Maga_Gator 13 points 2 days ago if they were jewish,  this shit would be put down immediately permalink award report block reply Deplorable_Citizen 9 points 2 days ago This will sadly continue because conservatives are seen as weak and unwilling to put the shackles of morality aside to fight against an existential threat.  The left already has tried to assassinate Trump, succeeded with Kirk, and have outright cheered and voted on the New Democrat platform of \"vote for me and I will kill your political opponents.\" And what has the right collectively done in response?  Nothing but an internal civil war between MAGA and Establishment Neo-Con Inc. that has further fragmented the base into too many shards of the greater whole. And if this trend continues, we will just end up just like China did in Mao's Cultural Revolution. permalink award report block reply Alldayeveryday 8 points 2 days ago People seriously need to learn how to fight permalink award report block reply SteveRogers42 1 points 1 day ago Active Clubs. permalink parent award report block reply PatriotSam 8 points 2 days ago The longer I live the more I understand what the term silent majority means. Most people will never stick their head out this way because of these lunatics. All we have is the ballot box. permalink award report block reply Metal4Freedom 3 points 2 days ago All we have is the ballot box. Not without election integrity being restored. permalink parent award report block reply Retardloserimsogay 3 points 2 days ago That's a fact, and it's by design. Don't give into their terror. (Not you, I'm sure you don't, but others) permalink parent award report block reply SimaYi 1 points 2 days ago You aren't voting your way out of this. permalink parent award report block reply redditadminssuckit 8 points 2 days ago DEADLY DEFENSIVE FORCE AUTHORIZED permalink award report block reply YT45 6 points 2 days ago The cop hitting the fag with a bike was a nice touch. permalink award report block reply zerk0021 1 points 2 days ago Those are City of Berkeley Police rather than UC Police. Where the brick paving is around the trees is UC property and from there south to the street is City sidewalk,  though UC police have primary  jurisdiction within a  one mile  radius of a UC campus. And UC Police headquarters is maybe 300 feet east in the basement of Sproul Hall. permalink parent award report block reply Badstate 5 points 2 days ago They hate the police, but love hiding behind the police. permalink award report block reply Hangemh1gh 5 points 2 days ago Just fucking nuke California south of Sacramento already. permalink award report block reply FrankDuncan 4 points 2 days ago Lex Luthor had the right idea on the Superman movie.. permalink parent award report block reply SteveRogers42 1 points 1 day ago OTISBURG??? permalink parent award report block reply BoomShtick 2 points 2 days ago then nuke Sacramento permalink parent award report block reply Tabascocat12 2 points 2 days ago Please just leave my little pocket North of Santa Barbara alone 😎 permalink parent award report block reply Metal4Freedom 3 points 2 days ago Beautiful rocky beaches there. I used to stop at El Capitan beach  when I was driving up or down from the Bay Area. permalink parent award report block reply booblitchutz 1 points 1 day ago Oh that area is so nice. It’s  it a secret anymore though. permalink parent award report block reply PiratePatriotParrot OP 0 points 2 days ago The only good parts are south of LA haha. And even those areas are fucked. Then there's the dirt no name areas full of Mexican people but that seem to vote for Trump. permalink parent award report block reply TheRPatriot 5 points 2 days ago So sick of these violent, fish-mouthed, methed-out LOSERS! permalink award report block reply RiffFantastic 4 points 2 days ago Protest is one thing, but this is all about intimidation. Nobody in this country should be afraid to go see anybody speak. I was there and it was pretty tense leaving. They funneled us all out to one spot and the mob was waiting for us screaming at us there. At least they had a line of riot police there, but it felt like things might get violent at any second. permalink award report block reply dissledat 3 points 2 days ago Here's some more details/video from the (very biased) Berkeleyside: https://www.berkeleyside.org/2025/11/10/turning-point-usa-uc-berkeley-zellerbach-hall It is ironic that leftists at berkeley try so hard to silence the opposition, considering Berkeley's reputation as the birthplace of the Free Speech movement. I suspect that most of the protestors there are not actually Cal students, but local activists/antifa from nearby berkeley/oakland/sf. The leftist who got arrested in the video looked way too old to be a student. permalink parent award report block reply booblitchutz 1 points 1 day ago It’s as organic as the vegan prepared food they microwave. permalink parent award report block reply zerk0021 1 points 2 days ago Was it in Zellerbach? Were there any UC police, or only city police? Were city police in lower Sproul? permalink parent award report block reply RiffFantastic 2 points 2 days ago Yes it was in Zellerbach Hall. Rob was talking shit about the chancellor limiting tickets for the event so a lot of students couldn’t get in. I think the venue was at capacity so maybe he was griping that they didn’t put it in a bigger venue like Haas Pavilion. I think there were city police, UC Police and private security. The whole lower sproul was cordoned off. You could only get in if you had a ticket. I was able to slip in a quiet entrance to the plaza by Strawberry Creek. There I saw most of the police and protesters were on the Bancroft side of the plaza. There were also riot police staged in the MLK building. When I got out those riot police were the barrier between us and the protesters at the top of the stairs on upper sproul. permalink parent award report block reply zerk0021 1 points 2 days ago 'It boggles my mind  they  even care  TPUSA holds an event at Zellerbach. I think Zellerbach seats around 2,000 and Haas  around 12,000. Greek Theater around 8,000. permalink parent award report block reply SimaYi 4 points 2 days ago It's going to take a lot of blood to take our country back. Better get used to it. permalink award report block reply FusionBlack 4 points 1 day ago I imagine Berkeley would be one of those schools shut down if the Chinese students weren't allowed in. What a shame. It's a disgrace we let these forgien scum into our country. permalink award report block reply A_Colostomy_Bag 3 points 2 days ago I wish someone would deliver justice to the terrorists where law enforcement is broken.  It seems street justice is unfortunately a necessity sometimes. permalink award report block reply knnbccb 3 points 1 day ago Call them communists. They are not 'far left'... they are too far gone . permalink award report block reply panic_scam 2 points 2 days ago If California is the asshole of America, Berkeley is the hemorrhoid. permalink award report block reply Coin-Op 2 points 2 days ago I will say this again, we need to legalize citizen-based militias and vigilantes right now. permalink award report block reply BrionK 2 points 1 day ago That's a Monday at Berkeley. It's why Americans haven't sent their kids to that place since the 70's. permalink award report block reply MySidesGoUp 2 points 1 day ago Faggots. What a faggoted nation.  Lead by single mother cancer.   Such a shame. permalink award report block reply jadepoemm 2 points 2 days ago Hopefully that beaner shouting showed enough face to get a home address. permalink award report block reply jermzdeejd 1 points 1 day ago Sucks to be held like that a taunted. permalink award report block reply 123breadman 1 points 2 days ago Where are the crackheads who love the police? permalink award report block reply presticus 1 points 1 day ago Why wasn't the guy trying to pull the one free also arrested? permalink award report block reply wbarmy 1 points 1 day ago As much as I want the ability to use a recording device if my rights are being trampled, I am almost to the point of voting for hickory stick shampoos for all these social justice warriors who flip out a camera and start trying to take close in photos of the police. permalink award report block reply GeneticsGuy 1 points 1 day ago So when do we start seeing arrests and people charged with domestic terrorism and facing 20+ year sentencing? permalink award report block reply knnbccb 1 points 2 days ago So many communists need to be put down. You need to strike fear into their hearts. permalink award report block reply Metal4Freedom 2 points 2 days ago Striking lead into their hearts is a more successful solution long term. permalink parent award report block reply Protonboy 1 points 2 days ago Let me guess: Police push the Leftists and then ran off. No? permalink award report block reply rivetjoint2 1 points 1 day ago Yet another data point.  The left can't defend it's ideas in open debate.  If it could it would just let TP-USA peacefully speak and have its public conversations.  Either that or it's demonic, and the demons can't have 'The Good Word' spread. permalink award report block reply BahamaDon 1 points 1 day ago How odd this is that this shit regularly happens where the people getting attacked have zero rights to use a firearm to defend themselves.  Not so much in  Florida, Texas, Arizona. permalink award report block reply Parodee123 1 points 2 days ago Sick of these antiwhite retards permalink award report block reply upupandaway 1 points 2 days ago Hey, sometimes you do get a punch on the face. No worries, brother permalink award report block reply jml1997 1 points 2 days ago Make batons great again permalink award report block reply Metal4Freedom 2 points 2 days ago And flamethrowers! permalink parent award report block reply PiratePatriot 0 points 2 days ago will be interesting to see ample video footage from before this fight started. Erika Kirk needs to be all over this. If it turns out the Turning Point USA guy did not start throwing hands until he was taken to the ground, Erika need to go full throttle publicising this attack on their staff. if it turns out the Turning Point guy started any fighting, they need to disown him immediately. there is no in between. even the headline here on Patriots reports it as turning point employee in fight, not as a defensive. permalink award report block reply RiffFantastic 0 points 1 day ago Was he a TP employee? I thought ihe was a fan wearing a shirt. Totally agree other than that. permalink parent award report block reply HoodooOperator 1 points 1 day ago Comment removed by community moderators. permalink award report block reply EDDIT_IS_CUCKED 1 points 1 day ago Comment removed by community filter. permalink award report block reply Shanoodle1 1 points 1 day ago Comment removed by community filter, pending further review. permalink award report block reply\nBeat_to_Quarters 151 points 2 days ago Kirk gets assassinated at a college campus, antifa is declared a domestic terrorist organization, and TPUSA gets attacked on college campuses like nothing's changed. permalink award report block reply Prandogolio 66 points 2 days ago Nothing has changed.  The commies have killed their opponents for over a century. permalink parent award report block reply Bohemyth_2 17 points 2 days ago @0:42 begins some strange camera avoidance behavior. The commie was very eager to have the arresting officer get him away from the camera ASAP permalink parent award report block reply fforgotpasswordagain 12 points 2 days ago probably in usa on a student visa. this should be enough to send him back permalink parent award report block reply SupFrens 2 points 2 days ago Fascism is the appropriate response to communism. permalink parent award report block reply lostremote- 9 points 1 day ago 30.06 is the best response to communism. permalink parent award report block reply Prandogolio 1 points 1 day ago Well it's one appropriate response. permalink parent award report block reply Viewer01 52 points 2 days ago Yet people wonder why zoomers are turning out the way they are. permalink parent award report block reply TarHeelMAGA 2 points 2 days ago Comment removed by community moderators. permalink parent award report block reply HoodooOperator 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply IncredibleMrE1 31 points 2 days ago Because nothing has changed. Best you'll get out of Bill Barrbie is some Fox performances, and Kash is busy polishing the turd that is the FBI. Even if he wasn't, the FBI still wouldn't give up its shock troops. permalink parent award report block reply militantnationalist6 16 points 2 days ago Yep. What you’re witnessing is the standard boomer conservatism that’s dying. What you want is nationalism. That’s when this shit gets stomped out. We’re progressing nicely to this, it’s inevitable. permalink parent award report block reply Metal4Freedom 8 points 2 days ago I'm all good for Christian Nationalism. America was great when our people loved and obeyed God. permalink parent award report block reply PiratePatriotParrot OP 8 points 2 days ago It's California. Enemy territory. There's no federal troops for justice. permalink parent award report block reply load 3 more comments...\nPrandogolio 66 points 2 days ago Nothing has changed.  The commies have killed their opponents for over a century. permalink parent award report block reply Bohemyth_2 17 points 2 days ago @0:42 begins some strange camera avoidance behavior. The commie was very eager to have the arresting officer get him away from the camera ASAP permalink parent award report block reply fforgotpasswordagain 12 points 2 days ago probably in usa on a student visa. this should be enough to send him back permalink parent award report block reply SupFrens 2 points 2 days ago Fascism is the appropriate response to communism. permalink parent award report block reply lostremote- 9 points 1 day ago 30.06 is the best response to communism. permalink parent award report block reply Prandogolio 1 points 1 day ago Well it's one appropriate response. permalink parent award report block reply\nBohemyth_2 17 points 2 days ago @0:42 begins some strange camera avoidance behavior. The commie was very eager to have the arresting officer get him away from the camera ASAP permalink parent award report block reply fforgotpasswordagain 12 points 2 days ago probably in usa on a student visa. this should be enough to send him back permalink parent award report block reply\nfforgotpasswordagain 12 points 2 days ago probably in usa on a student visa. this should be enough to send him back permalink parent award report block reply\nSupFrens 2 points 2 days ago Fascism is the appropriate response to communism. permalink parent award report block reply lostremote- 9 points 1 day ago 30.06 is the best response to communism. permalink parent award report block reply Prandogolio 1 points 1 day ago Well it's one appropriate response. permalink parent award report block reply\nlostremote- 9 points 1 day ago 30.06 is the best response to communism. permalink parent award report block reply\nPrandogolio 1 points 1 day ago Well it's one appropriate response. permalink parent award report block reply\nViewer01 52 points 2 days ago Yet people wonder why zoomers are turning out the way they are. permalink parent award report block reply TarHeelMAGA 2 points 2 days ago Comment removed by community moderators. permalink parent award report block reply HoodooOperator 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nTarHeelMAGA 2 points 2 days ago Comment removed by community moderators. permalink parent award report block reply\nHoodooOperator 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nIncredibleMrE1 31 points 2 days ago Because nothing has changed. Best you'll get out of Bill Barrbie is some Fox performances, and Kash is busy polishing the turd that is the FBI. Even if he wasn't, the FBI still wouldn't give up its shock troops. permalink parent award report block reply\nmilitantnationalist6 16 points 2 days ago Yep. What you’re witnessing is the standard boomer conservatism that’s dying. What you want is nationalism. That’s when this shit gets stomped out. We’re progressing nicely to this, it’s inevitable. permalink parent award report block reply Metal4Freedom 8 points 2 days ago I'm all good for Christian Nationalism. America was great when our people loved and obeyed God. permalink parent award report block reply\nMetal4Freedom 8 points 2 days ago I'm all good for Christian Nationalism. America was great when our people loved and obeyed God. permalink parent award report block reply\nPiratePatriotParrot OP 8 points 2 days ago It's California. Enemy territory. There's no federal troops for justice. permalink parent award report block reply\nJoeMcCarthyWasRight 90 points 2 days ago “Hey white boy!” President Trump better get involved and start going after these anti-white terrorists. He won’t like the alternative where we curb stomp these fucking mutts. permalink award report block reply TheJakeFroggy 32 points 2 days ago Antifa is lucky that they have police and judge protection. If it weren't for that, I'm sure there are lots of people who would love to kill these ghouls if there weren't any consequences for doing so. permalink parent award report block reply BlackPilledMAGA 8 points 1 day ago You'd think the cops would arrest the domestic terrorists and not the guy defending himself from them. We've been sold a bill of bullshit goods. permalink parent award report block reply MySidesGoUp 3 points 1 day ago You forgot you writes the checks. permalink parent award report block reply michealr24 1 points 1 day ago Ready and willing. permalink parent award report block reply MySidesGoUp 1 points 1 day ago And lucky the opposition has families and jobs. At some point, those same authorities will have to deal with actual agrarian, heterosexuals…and when that moment comes, god bless their souls…. permalink parent award report block reply Bubbahax 26 points 2 days ago \"Hey white boy\" is pretty much all you need to know about Antifa. permalink parent award report block reply MehNahMehNah 3 points 1 day ago Self hating fags. permalink parent award report block reply Prandogolio 12 points 2 days ago We're definitely going to start doing that any day now! permalink parent award report block reply Seatacjoe 20 points 2 days ago To be fair, I already let Andy Ngo know that if he ever needs someone to back him up when he comes up to Seattle that I would gladly help defend him so he can do his journalistic work.   He replied and told me that it is very dangerous, I am mid age where my wrists are as big around as most of these fucks necks and sure I would be sore in the morning, takes longer to heal but all of you that have been in a worthy fight knows, it heals the soul. permalink parent award report block reply m0ntsta 13 points 2 days ago A man after my own heart. USA Boxer from 14-17. Jail time from 19-21. Hard working 43 year old man now with a sore back. But always down for a good spar. You’re doing the Lord’s work, friend. permalink parent award report block reply TheRPatriot 9 points 2 days ago We need more like yourself! I have often thought of reaching out to other conservative activists and doing the same. I don’t see why not. It’s the only way permalink parent award report block reply PiratePatriot 1 points 2 days ago \" it heals the soul\" permalink parent award report block reply Wtf_socialismreally 4 points 2 days ago I do believe the dam will burst at some point. It's just a matter of if that dam is repaired first (putting AntiFA down), if it happens under our own people, or if it happens under people who would hunt down everyone that so much as posted in a similar forum as anyone who stepped up. The best outcome is that Trump's DoJ handles it. But despite the labels, I remain unmoved and unimpressed. permalink parent award report block reply anotherthing 2 points 1 day ago Those terrorists are just lucky they didn't say anything bad about Israel. They'd be in for some real justice then! permalink parent award report block reply HoodooOperator 2 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nTheJakeFroggy 32 points 2 days ago Antifa is lucky that they have police and judge protection. If it weren't for that, I'm sure there are lots of people who would love to kill these ghouls if there weren't any consequences for doing so. permalink parent award report block reply BlackPilledMAGA 8 points 1 day ago You'd think the cops would arrest the domestic terrorists and not the guy defending himself from them. We've been sold a bill of bullshit goods. permalink parent award report block reply MySidesGoUp 3 points 1 day ago You forgot you writes the checks. permalink parent award report block reply michealr24 1 points 1 day ago Ready and willing. permalink parent award report block reply MySidesGoUp 1 points 1 day ago And lucky the opposition has families and jobs. At some point, those same authorities will have to deal with actual agrarian, heterosexuals…and when that moment comes, god bless their souls…. permalink parent award report block reply\nBlackPilledMAGA 8 points 1 day ago You'd think the cops would arrest the domestic terrorists and not the guy defending himself from them. We've been sold a bill of bullshit goods. permalink parent award report block reply MySidesGoUp 3 points 1 day ago You forgot you writes the checks. permalink parent award report block reply\nMySidesGoUp 3 points 1 day ago You forgot you writes the checks. permalink parent award report block reply\nmichealr24 1 points 1 day ago Ready and willing. permalink parent award report block reply\nMySidesGoUp 1 points 1 day ago And lucky the opposition has families and jobs. At some point, those same authorities will have to deal with actual agrarian, heterosexuals…and when that moment comes, god bless their souls…. permalink parent award report block reply\nBubbahax 26 points 2 days ago \"Hey white boy\" is pretty much all you need to know about Antifa. permalink parent award report block reply MehNahMehNah 3 points 1 day ago Self hating fags. permalink parent award report block reply\nMehNahMehNah 3 points 1 day ago Self hating fags. permalink parent award report block reply\nPrandogolio 12 points 2 days ago We're definitely going to start doing that any day now! permalink parent award report block reply Seatacjoe 20 points 2 days ago To be fair, I already let Andy Ngo know that if he ever needs someone to back him up when he comes up to Seattle that I would gladly help defend him so he can do his journalistic work.   He replied and told me that it is very dangerous, I am mid age where my wrists are as big around as most of these fucks necks and sure I would be sore in the morning, takes longer to heal but all of you that have been in a worthy fight knows, it heals the soul. permalink parent award report block reply m0ntsta 13 points 2 days ago A man after my own heart. USA Boxer from 14-17. Jail time from 19-21. Hard working 43 year old man now with a sore back. But always down for a good spar. You’re doing the Lord’s work, friend. permalink parent award report block reply TheRPatriot 9 points 2 days ago We need more like yourself! I have often thought of reaching out to other conservative activists and doing the same. I don’t see why not. It’s the only way permalink parent award report block reply PiratePatriot 1 points 2 days ago \" it heals the soul\" permalink parent award report block reply Wtf_socialismreally 4 points 2 days ago I do believe the dam will burst at some point. It's just a matter of if that dam is repaired first (putting AntiFA down), if it happens under our own people, or if it happens under people who would hunt down everyone that so much as posted in a similar forum as anyone who stepped up. The best outcome is that Trump's DoJ handles it. But despite the labels, I remain unmoved and unimpressed. permalink parent award report block reply\nSeatacjoe 20 points 2 days ago To be fair, I already let Andy Ngo know that if he ever needs someone to back him up when he comes up to Seattle that I would gladly help defend him so he can do his journalistic work.   He replied and told me that it is very dangerous, I am mid age where my wrists are as big around as most of these fucks necks and sure I would be sore in the morning, takes longer to heal but all of you that have been in a worthy fight knows, it heals the soul. permalink parent award report block reply m0ntsta 13 points 2 days ago A man after my own heart. USA Boxer from 14-17. Jail time from 19-21. Hard working 43 year old man now with a sore back. But always down for a good spar. You’re doing the Lord’s work, friend. permalink parent award report block reply TheRPatriot 9 points 2 days ago We need more like yourself! I have often thought of reaching out to other conservative activists and doing the same. I don’t see why not. It’s the only way permalink parent award report block reply PiratePatriot 1 points 2 days ago \" it heals the soul\" permalink parent award report block reply\nm0ntsta 13 points 2 days ago A man after my own heart. USA Boxer from 14-17. Jail time from 19-21. Hard working 43 year old man now with a sore back. But always down for a good spar. You’re doing the Lord’s work, friend. permalink parent award report block reply\nTheRPatriot 9 points 2 days ago We need more like yourself! I have often thought of reaching out to other conservative activists and doing the same. I don’t see why not. It’s the only way permalink parent award report block reply\nPiratePatriot 1 points 2 days ago \" it heals the soul\" permalink parent award report block reply\nWtf_socialismreally 4 points 2 days ago I do believe the dam will burst at some point. It's just a matter of if that dam is repaired first (putting AntiFA down), if it happens under our own people, or if it happens under people who would hunt down everyone that so much as posted in a similar forum as anyone who stepped up. The best outcome is that Trump's DoJ handles it. But despite the labels, I remain unmoved and unimpressed. permalink parent award report block reply\nanotherthing 2 points 1 day ago Those terrorists are just lucky they didn't say anything bad about Israel. They'd be in for some real justice then! permalink parent award report block reply\nHoodooOperator 2 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nMakeAmericaGreat9 49 points 2 days ago I'm blaming republican leadership all the way to trump for this. You can't start the war we started, then not do everything necessary to protect the troops. Enough is enough, invade with the national guard or declare the insurrection act and get going. permalink award report block reply m0ntsta 19 points 2 days ago The way our side half asses everything is maddening. We talk shit and go punch someone in the stomach but are not prepared to finish the fight and then when the pendulum swings back the other way we get beaten the fuck down. permalink parent award report block reply MySidesGoUp 7 points 1 day ago Look at Covid. We were all punched in the mouth. Best we could do was dismiss their cancer vaccines. Well, we’re gonna have to do better. permalink parent award report block reply ConsrvspkgNJ 0 points 1 day ago Oh hell no!!! Fuck that!!! We won that fight!!! Don't undersell that bullshit and give those commie fucks a win they didn't earn. They meant for every fucking one of us to die of the Covid vax, they meant for us to still be in masks today, they meant to put us resistors in camps. I fought the war in NJ, enemy territory and we got them to back down. They opened schools totally unwillingly, they gave up the mask mandate totally unwillingly and they abandoned the vax mandate totally unwillingly. Fuck that, I was giving Governor Goofy the finger at a rally in his front yard as the NJ State Police were telling us \"you have had enough First Amendment for the day\" proving they were nothing but pension whores. Fuck that, we won that fight. permalink parent award report block reply Appeal2Heaven98 -3 points 23 hours ago How you can spin the handling of the Covid pandemic as a win for us is beyond me. Congratulations. You avoided getting a vaccine and gave your governor the bird. Here's a gold star for participating in doing the absolute bare minimum. They did it as a test run to see how far they could go with taking away our rights. They shut down the world for months, if not years, and we let them do it. permalink parent award report block reply view 1 more comments... Emodius -14 points 2 days ago Oh shut the fuck up this isn't Trump's fault you insufferable faggot. permalink parent award report block reply MakeAmericaGreat9 13 points 2 days ago Get fucked faggot. You don't throw the troops in halfway. You either support them, or stfu. You are fine with complacency. In 3 years democrats are coming for everyone that has a R next to their name PERIOD. permalink parent award report block reply\nm0ntsta 19 points 2 days ago The way our side half asses everything is maddening. We talk shit and go punch someone in the stomach but are not prepared to finish the fight and then when the pendulum swings back the other way we get beaten the fuck down. permalink parent award report block reply MySidesGoUp 7 points 1 day ago Look at Covid. We were all punched in the mouth. Best we could do was dismiss their cancer vaccines. Well, we’re gonna have to do better. permalink parent award report block reply ConsrvspkgNJ 0 points 1 day ago Oh hell no!!! Fuck that!!! We won that fight!!! Don't undersell that bullshit and give those commie fucks a win they didn't earn. They meant for every fucking one of us to die of the Covid vax, they meant for us to still be in masks today, they meant to put us resistors in camps. I fought the war in NJ, enemy territory and we got them to back down. They opened schools totally unwillingly, they gave up the mask mandate totally unwillingly and they abandoned the vax mandate totally unwillingly. Fuck that, I was giving Governor Goofy the finger at a rally in his front yard as the NJ State Police were telling us \"you have had enough First Amendment for the day\" proving they were nothing but pension whores. Fuck that, we won that fight. permalink parent award report block reply Appeal2Heaven98 -3 points 23 hours ago How you can spin the handling of the Covid pandemic as a win for us is beyond me. Congratulations. You avoided getting a vaccine and gave your governor the bird. Here's a gold star for participating in doing the absolute bare minimum. They did it as a test run to see how far they could go with taking away our rights. They shut down the world for months, if not years, and we let them do it. permalink parent award report block reply view 1 more comments...\nMySidesGoUp 7 points 1 day ago Look at Covid. We were all punched in the mouth. Best we could do was dismiss their cancer vaccines. Well, we’re gonna have to do better. permalink parent award report block reply ConsrvspkgNJ 0 points 1 day ago Oh hell no!!! Fuck that!!! We won that fight!!! Don't undersell that bullshit and give those commie fucks a win they didn't earn. They meant for every fucking one of us to die of the Covid vax, they meant for us to still be in masks today, they meant to put us resistors in camps. I fought the war in NJ, enemy territory and we got them to back down. They opened schools totally unwillingly, they gave up the mask mandate totally unwillingly and they abandoned the vax mandate totally unwillingly. Fuck that, I was giving Governor Goofy the finger at a rally in his front yard as the NJ State Police were telling us \"you have had enough First Amendment for the day\" proving they were nothing but pension whores. Fuck that, we won that fight. permalink parent award report block reply Appeal2Heaven98 -3 points 23 hours ago How you can spin the handling of the Covid pandemic as a win for us is beyond me. Congratulations. You avoided getting a vaccine and gave your governor the bird. Here's a gold star for participating in doing the absolute bare minimum. They did it as a test run to see how far they could go with taking away our rights. They shut down the world for months, if not years, and we let them do it. permalink parent award report block reply view 1 more comments...\nConsrvspkgNJ 0 points 1 day ago Oh hell no!!! Fuck that!!! We won that fight!!! Don't undersell that bullshit and give those commie fucks a win they didn't earn. They meant for every fucking one of us to die of the Covid vax, they meant for us to still be in masks today, they meant to put us resistors in camps. I fought the war in NJ, enemy territory and we got them to back down. They opened schools totally unwillingly, they gave up the mask mandate totally unwillingly and they abandoned the vax mandate totally unwillingly. Fuck that, I was giving Governor Goofy the finger at a rally in his front yard as the NJ State Police were telling us \"you have had enough First Amendment for the day\" proving they were nothing but pension whores. Fuck that, we won that fight. permalink parent award report block reply Appeal2Heaven98 -3 points 23 hours ago How you can spin the handling of the Covid pandemic as a win for us is beyond me. Congratulations. You avoided getting a vaccine and gave your governor the bird. Here's a gold star for participating in doing the absolute bare minimum. They did it as a test run to see how far they could go with taking away our rights. They shut down the world for months, if not years, and we let them do it. permalink parent award report block reply view 1 more comments...\nAppeal2Heaven98 -3 points 23 hours ago How you can spin the handling of the Covid pandemic as a win for us is beyond me. Congratulations. You avoided getting a vaccine and gave your governor the bird. Here's a gold star for participating in doing the absolute bare minimum. They did it as a test run to see how far they could go with taking away our rights. They shut down the world for months, if not years, and we let them do it. permalink parent award report block reply view 1 more comments...\nEmodius -14 points 2 days ago Oh shut the fuck up this isn't Trump's fault you insufferable faggot. permalink parent award report block reply MakeAmericaGreat9 13 points 2 days ago Get fucked faggot. You don't throw the troops in halfway. You either support them, or stfu. You are fine with complacency. In 3 years democrats are coming for everyone that has a R next to their name PERIOD. permalink parent award report block reply\nMakeAmericaGreat9 13 points 2 days ago Get fucked faggot. You don't throw the troops in halfway. You either support them, or stfu. You are fine with complacency. In 3 years democrats are coming for everyone that has a R next to their name PERIOD. permalink parent award report block reply\nSicilianOmega 22 points 2 days ago Looks like the zogs arrested both the leftist and his victim. permalink award report block reply Nomad899 13 points 2 days ago Cops just arrest…sometimes to protect the victim…. Likely in this case based on all the commies present, someone would attacked him again.   Would like to see what charges come out of it permalink parent award report block reply HillarysFUPA 9 points 2 days ago If you are being arrested, go with it .. you sort out the details later. If you fight it, you will surely lose any ground you had. permalink parent award report block reply OnceADroplet 4 points 2 days ago \"I pay your salary\" is always the most ironic retort of the Karen. Why else would they be there? permalink parent award report block reply booblitchutz 1 points 1 day ago I think this dudes blood was up from the fight. It’s hard to just chill and cooperate instantly. permalink parent award report block reply A_Colostomy_Bag 1 points 2 days ago I don't get why people think they're going to resolve legal issues with a police officer arresting them yet they so often do.  Save the argument for the court, they only hurt their cause by fighting the police. permalink parent award report block reply HillarysFUPA 1 points 1 day ago Ok, you can resist is you want, even if you are innocent. It won't help your case, and it make you look guilty, but at least you'll feel like you fought the system while getting raped on prison. permalink parent award report block reply view 1 more comments...\nNomad899 13 points 2 days ago Cops just arrest…sometimes to protect the victim…. Likely in this case based on all the commies present, someone would attacked him again.   Would like to see what charges come out of it permalink parent award report block reply HillarysFUPA 9 points 2 days ago If you are being arrested, go with it .. you sort out the details later. If you fight it, you will surely lose any ground you had. permalink parent award report block reply OnceADroplet 4 points 2 days ago \"I pay your salary\" is always the most ironic retort of the Karen. Why else would they be there? permalink parent award report block reply booblitchutz 1 points 1 day ago I think this dudes blood was up from the fight. It’s hard to just chill and cooperate instantly. permalink parent award report block reply A_Colostomy_Bag 1 points 2 days ago I don't get why people think they're going to resolve legal issues with a police officer arresting them yet they so often do.  Save the argument for the court, they only hurt their cause by fighting the police. permalink parent award report block reply HillarysFUPA 1 points 1 day ago Ok, you can resist is you want, even if you are innocent. It won't help your case, and it make you look guilty, but at least you'll feel like you fought the system while getting raped on prison. permalink parent award report block reply view 1 more comments...\nHillarysFUPA 9 points 2 days ago If you are being arrested, go with it .. you sort out the details later. If you fight it, you will surely lose any ground you had. permalink parent award report block reply OnceADroplet 4 points 2 days ago \"I pay your salary\" is always the most ironic retort of the Karen. Why else would they be there? permalink parent award report block reply booblitchutz 1 points 1 day ago I think this dudes blood was up from the fight. It’s hard to just chill and cooperate instantly. permalink parent award report block reply A_Colostomy_Bag 1 points 2 days ago I don't get why people think they're going to resolve legal issues with a police officer arresting them yet they so often do.  Save the argument for the court, they only hurt their cause by fighting the police. permalink parent award report block reply HillarysFUPA 1 points 1 day ago Ok, you can resist is you want, even if you are innocent. It won't help your case, and it make you look guilty, but at least you'll feel like you fought the system while getting raped on prison. permalink parent award report block reply view 1 more comments...\nOnceADroplet 4 points 2 days ago \"I pay your salary\" is always the most ironic retort of the Karen. Why else would they be there? permalink parent award report block reply\nbooblitchutz 1 points 1 day ago I think this dudes blood was up from the fight. It’s hard to just chill and cooperate instantly. permalink parent award report block reply\nA_Colostomy_Bag 1 points 2 days ago I don't get why people think they're going to resolve legal issues with a police officer arresting them yet they so often do.  Save the argument for the court, they only hurt their cause by fighting the police. permalink parent award report block reply HillarysFUPA 1 points 1 day ago Ok, you can resist is you want, even if you are innocent. It won't help your case, and it make you look guilty, but at least you'll feel like you fought the system while getting raped on prison. permalink parent award report block reply view 1 more comments...\nHillarysFUPA 1 points 1 day ago Ok, you can resist is you want, even if you are innocent. It won't help your case, and it make you look guilty, but at least you'll feel like you fought the system while getting raped on prison. permalink parent award report block reply view 1 more comments...\nAgent_Orange 19 points 2 days ago \"You're bleeding, White boy!\". Says the frail White boy who thinks he's a badass. permalink award report block reply Spicy_cat 4 points 1 day ago Probably Jew permalink parent award report block reply ConsrvspkgNJ 2 points 1 day ago I had the same thought looking at him. permalink parent award report block reply EDDIT_IS_CUCKED 1 points 1 day ago Comment removed by community filter. permalink parent award report block reply\nSpicy_cat 4 points 1 day ago Probably Jew permalink parent award report block reply ConsrvspkgNJ 2 points 1 day ago I had the same thought looking at him. permalink parent award report block reply EDDIT_IS_CUCKED 1 points 1 day ago Comment removed by community filter. permalink parent award report block reply\nConsrvspkgNJ 2 points 1 day ago I had the same thought looking at him. permalink parent award report block reply EDDIT_IS_CUCKED 1 points 1 day ago Comment removed by community filter. permalink parent award report block reply\nEDDIT_IS_CUCKED 1 points 1 day ago Comment removed by community filter. permalink parent award report block reply\nFORMERCHILDSTAR 17 points 2 days ago Racist hate crime. Charge them appropriately. permalink award report block reply PiratePatriotParrot OP 9 points 2 days ago I agree permalink parent award report block reply\nPiratePatriotParrot OP 9 points 2 days ago I agree permalink parent award report block reply\nTaqiyya_Mockingbird 16 points 2 days ago Didn’t we declare these people as terrorists? Where’s Delta Force? permalink award report block reply\nUSNVET71 15 points 2 days ago I want go and fuck up some antifa faggots, where do I sign up permalink award report block reply ConsrvspkgNJ 3 points 1 day ago As I am not a Fed, I am not encouraging you but if you are so inclined Find the Antifa social media sites and monitor their accounts for marches and protests Find other like minded patriots who wish to do the same vet them to ensure you aren't linking up with Ray Epps V2.0 Ensure that everyone in your circle can scrap Locate next protest site Recon it and plan Show up and blow up permalink parent award report block reply ianpatrick1966 3 points 1 day ago It would be better to do it one on one.  Find the leader camp outside their house wait until they’re alone then… the thing permalink parent award report block reply ConsrvspkgNJ 1 points 1 day ago Yeah, being from NJ, I get what you are saying but that is a recon mission that may be difficult to conduct and not blow cover. It's just easier to watch for the latest \"Antifa Day of Gay Sex and Outrage\" and bring your friends so as to dispense the beneficial ass whooping. permalink parent award report block reply\nConsrvspkgNJ 3 points 1 day ago As I am not a Fed, I am not encouraging you but if you are so inclined Find the Antifa social media sites and monitor their accounts for marches and protests Find other like minded patriots who wish to do the same vet them to ensure you aren't linking up with Ray Epps V2.0 Ensure that everyone in your circle can scrap Locate next protest site Recon it and plan Show up and blow up permalink parent award report block reply ianpatrick1966 3 points 1 day ago It would be better to do it one on one.  Find the leader camp outside their house wait until they’re alone then… the thing permalink parent award report block reply ConsrvspkgNJ 1 points 1 day ago Yeah, being from NJ, I get what you are saying but that is a recon mission that may be difficult to conduct and not blow cover. It's just easier to watch for the latest \"Antifa Day of Gay Sex and Outrage\" and bring your friends so as to dispense the beneficial ass whooping. permalink parent award report block reply\nianpatrick1966 3 points 1 day ago It would be better to do it one on one.  Find the leader camp outside their house wait until they’re alone then… the thing permalink parent award report block reply ConsrvspkgNJ 1 points 1 day ago Yeah, being from NJ, I get what you are saying but that is a recon mission that may be difficult to conduct and not blow cover. It's just easier to watch for the latest \"Antifa Day of Gay Sex and Outrage\" and bring your friends so as to dispense the beneficial ass whooping. permalink parent award report block reply\nConsrvspkgNJ 1 points 1 day ago Yeah, being from NJ, I get what you are saying but that is a recon mission that may be difficult to conduct and not blow cover. It's just easier to watch for the latest \"Antifa Day of Gay Sex and Outrage\" and bring your friends so as to dispense the beneficial ass whooping. permalink parent award report block reply\nMaga_Gator 13 points 2 days ago if they were jewish,  this shit would be put down immediately permalink award report block reply\nDeplorable_Citizen 9 points 2 days ago This will sadly continue because conservatives are seen as weak and unwilling to put the shackles of morality aside to fight against an existential threat.  The left already has tried to assassinate Trump, succeeded with Kirk, and have outright cheered and voted on the New Democrat platform of \"vote for me and I will kill your political opponents.\" And what has the right collectively done in response?  Nothing but an internal civil war between MAGA and Establishment Neo-Con Inc. that has further fragmented the base into too many shards of the greater whole. And if this trend continues, we will just end up just like China did in Mao's Cultural Revolution. permalink award report block reply\nAlldayeveryday 8 points 2 days ago People seriously need to learn how to fight permalink award report block reply SteveRogers42 1 points 1 day ago Active Clubs. permalink parent award report block reply\nSteveRogers42 1 points 1 day ago Active Clubs. permalink parent award report block reply\nPatriotSam 8 points 2 days ago The longer I live the more I understand what the term silent majority means. Most people will never stick their head out this way because of these lunatics. All we have is the ballot box. permalink award report block reply Metal4Freedom 3 points 2 days ago All we have is the ballot box. Not without election integrity being restored. permalink parent award report block reply Retardloserimsogay 3 points 2 days ago That's a fact, and it's by design. Don't give into their terror. (Not you, I'm sure you don't, but others) permalink parent award report block reply SimaYi 1 points 2 days ago You aren't voting your way out of this. permalink parent award report block reply\nMetal4Freedom 3 points 2 days ago All we have is the ballot box. Not without election integrity being restored. permalink parent award report block reply\nRetardloserimsogay 3 points 2 days ago That's a fact, and it's by design. Don't give into their terror. (Not you, I'm sure you don't, but others) permalink parent award report block reply\nSimaYi 1 points 2 days ago You aren't voting your way out of this. permalink parent award report block reply\nredditadminssuckit 8 points 2 days ago DEADLY DEFENSIVE FORCE AUTHORIZED permalink award report block reply\nYT45 6 points 2 days ago The cop hitting the fag with a bike was a nice touch. permalink award report block reply zerk0021 1 points 2 days ago Those are City of Berkeley Police rather than UC Police. Where the brick paving is around the trees is UC property and from there south to the street is City sidewalk,  though UC police have primary  jurisdiction within a  one mile  radius of a UC campus. And UC Police headquarters is maybe 300 feet east in the basement of Sproul Hall. permalink parent award report block reply\nzerk0021 1 points 2 days ago Those are City of Berkeley Police rather than UC Police. Where the brick paving is around the trees is UC property and from there south to the street is City sidewalk,  though UC police have primary  jurisdiction within a  one mile  radius of a UC campus. And UC Police headquarters is maybe 300 feet east in the basement of Sproul Hall. permalink parent award report block reply\nBadstate 5 points 2 days ago They hate the police, but love hiding behind the police. permalink award report block reply\nHangemh1gh 5 points 2 days ago Just fucking nuke California south of Sacramento already. permalink award report block reply FrankDuncan 4 points 2 days ago Lex Luthor had the right idea on the Superman movie.. permalink parent award report block reply SteveRogers42 1 points 1 day ago OTISBURG??? permalink parent award report block reply BoomShtick 2 points 2 days ago then nuke Sacramento permalink parent award report block reply Tabascocat12 2 points 2 days ago Please just leave my little pocket North of Santa Barbara alone 😎 permalink parent award report block reply Metal4Freedom 3 points 2 days ago Beautiful rocky beaches there. I used to stop at El Capitan beach  when I was driving up or down from the Bay Area. permalink parent award report block reply booblitchutz 1 points 1 day ago Oh that area is so nice. It’s  it a secret anymore though. permalink parent award report block reply PiratePatriotParrot OP 0 points 2 days ago The only good parts are south of LA haha. And even those areas are fucked. Then there's the dirt no name areas full of Mexican people but that seem to vote for Trump. permalink parent award report block reply\nFrankDuncan 4 points 2 days ago Lex Luthor had the right idea on the Superman movie.. permalink parent award report block reply SteveRogers42 1 points 1 day ago OTISBURG??? permalink parent award report block reply\nSteveRogers42 1 points 1 day ago OTISBURG??? permalink parent award report block reply\nBoomShtick 2 points 2 days ago then nuke Sacramento permalink parent award report block reply\nTabascocat12 2 points 2 days ago Please just leave my little pocket North of Santa Barbara alone 😎 permalink parent award report block reply Metal4Freedom 3 points 2 days ago Beautiful rocky beaches there. I used to stop at El Capitan beach  when I was driving up or down from the Bay Area. permalink parent award report block reply booblitchutz 1 points 1 day ago Oh that area is so nice. It’s  it a secret anymore though. permalink parent award report block reply\nMetal4Freedom 3 points 2 days ago Beautiful rocky beaches there. I used to stop at El Capitan beach  when I was driving up or down from the Bay Area. permalink parent award report block reply\nbooblitchutz 1 points 1 day ago Oh that area is so nice. It’s  it a secret anymore though. permalink parent award report block reply\nPiratePatriotParrot OP 0 points 2 days ago The only good parts are south of LA haha. And even those areas are fucked. Then there's the dirt no name areas full of Mexican people but that seem to vote for Trump. permalink parent award report block reply\nTheRPatriot 5 points 2 days ago So sick of these violent, fish-mouthed, methed-out LOSERS! permalink award report block reply\nRiffFantastic 4 points 2 days ago Protest is one thing, but this is all about intimidation. Nobody in this country should be afraid to go see anybody speak. I was there and it was pretty tense leaving. They funneled us all out to one spot and the mob was waiting for us screaming at us there. At least they had a line of riot police there, but it felt like things might get violent at any second. permalink award report block reply dissledat 3 points 2 days ago Here's some more details/video from the (very biased) Berkeleyside: https://www.berkeleyside.org/2025/11/10/turning-point-usa-uc-berkeley-zellerbach-hall It is ironic that leftists at berkeley try so hard to silence the opposition, considering Berkeley's reputation as the birthplace of the Free Speech movement. I suspect that most of the protestors there are not actually Cal students, but local activists/antifa from nearby berkeley/oakland/sf. The leftist who got arrested in the video looked way too old to be a student. permalink parent award report block reply booblitchutz 1 points 1 day ago It’s as organic as the vegan prepared food they microwave. permalink parent award report block reply zerk0021 1 points 2 days ago Was it in Zellerbach? Were there any UC police, or only city police? Were city police in lower Sproul? permalink parent award report block reply RiffFantastic 2 points 2 days ago Yes it was in Zellerbach Hall. Rob was talking shit about the chancellor limiting tickets for the event so a lot of students couldn’t get in. I think the venue was at capacity so maybe he was griping that they didn’t put it in a bigger venue like Haas Pavilion. I think there were city police, UC Police and private security. The whole lower sproul was cordoned off. You could only get in if you had a ticket. I was able to slip in a quiet entrance to the plaza by Strawberry Creek. There I saw most of the police and protesters were on the Bancroft side of the plaza. There were also riot police staged in the MLK building. When I got out those riot police were the barrier between us and the protesters at the top of the stairs on upper sproul. permalink parent award report block reply zerk0021 1 points 2 days ago 'It boggles my mind  they  even care  TPUSA holds an event at Zellerbach. I think Zellerbach seats around 2,000 and Haas  around 12,000. Greek Theater around 8,000. permalink parent award report block reply\ndissledat 3 points 2 days ago Here's some more details/video from the (very biased) Berkeleyside: https://www.berkeleyside.org/2025/11/10/turning-point-usa-uc-berkeley-zellerbach-hall It is ironic that leftists at berkeley try so hard to silence the opposition, considering Berkeley's reputation as the birthplace of the Free Speech movement. I suspect that most of the protestors there are not actually Cal students, but local activists/antifa from nearby berkeley/oakland/sf. The leftist who got arrested in the video looked way too old to be a student. permalink parent award report block reply booblitchutz 1 points 1 day ago It’s as organic as the vegan prepared food they microwave. permalink parent award report block reply\nbooblitchutz 1 points 1 day ago It’s as organic as the vegan prepared food they microwave. permalink parent award report block reply\nzerk0021 1 points 2 days ago Was it in Zellerbach? Were there any UC police, or only city police? Were city police in lower Sproul? permalink parent award report block reply RiffFantastic 2 points 2 days ago Yes it was in Zellerbach Hall. Rob was talking shit about the chancellor limiting tickets for the event so a lot of students couldn’t get in. I think the venue was at capacity so maybe he was griping that they didn’t put it in a bigger venue like Haas Pavilion. I think there were city police, UC Police and private security. The whole lower sproul was cordoned off. You could only get in if you had a ticket. I was able to slip in a quiet entrance to the plaza by Strawberry Creek. There I saw most of the police and protesters were on the Bancroft side of the plaza. There were also riot police staged in the MLK building. When I got out those riot police were the barrier between us and the protesters at the top of the stairs on upper sproul. permalink parent award report block reply zerk0021 1 points 2 days ago 'It boggles my mind  they  even care  TPUSA holds an event at Zellerbach. I think Zellerbach seats around 2,000 and Haas  around 12,000. Greek Theater around 8,000. permalink parent award report block reply\nRiffFantastic 2 points 2 days ago Yes it was in Zellerbach Hall. Rob was talking shit about the chancellor limiting tickets for the event so a lot of students couldn’t get in. I think the venue was at capacity so maybe he was griping that they didn’t put it in a bigger venue like Haas Pavilion. I think there were city police, UC Police and private security. The whole lower sproul was cordoned off. You could only get in if you had a ticket. I was able to slip in a quiet entrance to the plaza by Strawberry Creek. There I saw most of the police and protesters were on the Bancroft side of the plaza. There were also riot police staged in the MLK building. When I got out those riot police were the barrier between us and the protesters at the top of the stairs on upper sproul. permalink parent award report block reply zerk0021 1 points 2 days ago 'It boggles my mind  they  even care  TPUSA holds an event at Zellerbach. I think Zellerbach seats around 2,000 and Haas  around 12,000. Greek Theater around 8,000. permalink parent award report block reply\nzerk0021 1 points 2 days ago 'It boggles my mind  they  even care  TPUSA holds an event at Zellerbach. I think Zellerbach seats around 2,000 and Haas  around 12,000. Greek Theater around 8,000. permalink parent award report block reply\nSimaYi 4 points 2 days ago It's going to take a lot of blood to take our country back. Better get used to it. permalink award report block reply\nFusionBlack 4 points 1 day ago I imagine Berkeley would be one of those schools shut down if the Chinese students weren't allowed in. What a shame. It's a disgrace we let these forgien scum into our country. permalink award report block reply\nA_Colostomy_Bag 3 points 2 days ago I wish someone would deliver justice to the terrorists where law enforcement is broken.  It seems street justice is unfortunately a necessity sometimes. permalink award report block reply\nknnbccb 3 points 1 day ago Call them communists. They are not 'far left'... they are too far gone . permalink award report block reply\npanic_scam 2 points 2 days ago If California is the asshole of America, Berkeley is the hemorrhoid. permalink award report block reply\nCoin-Op 2 points 2 days ago I will say this again, we need to legalize citizen-based militias and vigilantes right now. permalink award report block reply\nBrionK 2 points 1 day ago That's a Monday at Berkeley. It's why Americans haven't sent their kids to that place since the 70's. permalink award report block reply\nMySidesGoUp 2 points 1 day ago Faggots. What a faggoted nation.  Lead by single mother cancer.   Such a shame. permalink award report block reply\njadepoemm 2 points 2 days ago Hopefully that beaner shouting showed enough face to get a home address. permalink award report block reply\njermzdeejd 1 points 1 day ago Sucks to be held like that a taunted. permalink award report block reply\n123breadman 1 points 2 days ago Where are the crackheads who love the police? permalink award report block reply\npresticus 1 points 1 day ago Why wasn't the guy trying to pull the one free also arrested? permalink award report block reply\nwbarmy 1 points 1 day ago As much as I want the ability to use a recording device if my rights are being trampled, I am almost to the point of voting for hickory stick shampoos for all these social justice warriors who flip out a camera and start trying to take close in photos of the police. permalink award report block reply\nGeneticsGuy 1 points 1 day ago So when do we start seeing arrests and people charged with domestic terrorism and facing 20+ year sentencing? permalink award report block reply\nknnbccb 1 points 2 days ago So many communists need to be put down. You need to strike fear into their hearts. permalink award report block reply Metal4Freedom 2 points 2 days ago Striking lead into their hearts is a more successful solution long term. permalink parent award report block reply\nMetal4Freedom 2 points 2 days ago Striking lead into their hearts is a more successful solution long term. permalink parent award report block reply\nProtonboy 1 points 2 days ago Let me guess: Police push the Leftists and then ran off. No? permalink award report block reply\nrivetjoint2 1 points 1 day ago Yet another data point.  The left can't defend it's ideas in open debate.  If it could it would just let TP-USA peacefully speak and have its public conversations.  Either that or it's demonic, and the demons can't have 'The Good Word' spread. permalink award report block reply\nBahamaDon 1 points 1 day ago How odd this is that this shit regularly happens where the people getting attacked have zero rights to use a firearm to defend themselves.  Not so much in  Florida, Texas, Arizona. permalink award report block reply\nParodee123 1 points 2 days ago Sick of these antiwhite retards permalink award report block reply\nupupandaway 1 points 2 days ago Hey, sometimes you do get a punch on the face. No worries, brother permalink award report block reply\njml1997 1 points 2 days ago Make batons great again permalink award report block reply Metal4Freedom 2 points 2 days ago And flamethrowers! permalink parent award report block reply\nMetal4Freedom 2 points 2 days ago And flamethrowers! permalink parent award report block reply\nPiratePatriot 0 points 2 days ago will be interesting to see ample video footage from before this fight started. Erika Kirk needs to be all over this. If it turns out the Turning Point USA guy did not start throwing hands until he was taken to the ground, Erika need to go full throttle publicising this attack on their staff. if it turns out the Turning Point guy started any fighting, they need to disown him immediately. there is no in between. even the headline here on Patriots reports it as turning point employee in fight, not as a defensive. permalink award report block reply RiffFantastic 0 points 1 day ago Was he a TP employee? I thought ihe was a fan wearing a shirt. Totally agree other than that. permalink parent award report block reply\nRiffFantastic 0 points 1 day ago Was he a TP employee? I thought ihe was a fan wearing a shirt. Totally agree other than that. permalink parent award report block reply\nHoodooOperator 1 points 1 day ago Comment removed by community moderators. permalink award report block reply\nEDDIT_IS_CUCKED 1 points 1 day ago Comment removed by community filter. permalink award report block reply\nShanoodle1 1 points 1 day ago Comment removed by community filter, pending further review. permalink award report block reply"}