{"id": "1ARK9pfaxF", "contents": "78 This is heartwarming DEPORT posted 9 hours ago by SALTYinSeattle 6 comments award share report block Katie Daviscourt 📸 @KatieDaviscourt • 22h Just in — Border Patrol released a video announcing the arrest of an illegal alien who recently protested outside the ICE facility in Portland. Jesus Calletano, of Mexico, had mocked ICE agents in a video, saying “don’t try to stop me because I’m not going to leave.” Border\n6 comments Sort by Top Top New Worst Old Save Around the Web yukondave 2 points 8 hours ago Now go protest in his home country and see how that goes.  Look at how his home country handles illegal border crossers permalink award report block reply projectarcturus1 1 points 6 hours ago Iq = 40. Ban him from coming back. permalink award report block reply iamstadter 1 points 59 minutes ago Adiós, muchacho. permalink award report block reply SALTYinSeattle OP 1 points 9 hours ago https://x.com/KatieDaviscourt/status/1988647482293973031 permalink award report block reply Seatacjoe 1 points 3 hours ago Adios faggot permalink award report block reply shockpurseyell 1 points 2 hours ago Border Patrol has the right mindset; ICE does not. For example, in the Arizona sector, ICE leadership in Phoenix is loathe to find, arrest and deport any illegals who haven’t committed crimes in the US other than illegal entry. Constantly moaning that it’s wrong to arrest and detain/deport “non crim” aliens (those whose only crime is illegal entry itself).  This is one big reason deportations are lower than expected. It’s why changes by DHS are needed in regional ICE leadership. permalink award report block reply PlantTrees 1 points 6 hours ago Guess they showed him the error of his ways :D permalink award report block reply\nyukondave 2 points 8 hours ago Now go protest in his home country and see how that goes.  Look at how his home country handles illegal border crossers permalink award report block reply\nprojectarcturus1 1 points 6 hours ago Iq = 40. Ban him from coming back. permalink award report block reply\niamstadter 1 points 59 minutes ago Adiós, muchacho. permalink award report block reply\nSALTYinSeattle OP 1 points 9 hours ago https://x.com/KatieDaviscourt/status/1988647482293973031 permalink award report block reply\nSeatacjoe 1 points 3 hours ago Adios faggot permalink award report block reply\nshockpurseyell 1 points 2 hours ago Border Patrol has the right mindset; ICE does not. For example, in the Arizona sector, ICE leadership in Phoenix is loathe to find, arrest and deport any illegals who haven’t committed crimes in the US other than illegal entry. Constantly moaning that it’s wrong to arrest and detain/deport “non crim” aliens (those whose only crime is illegal entry itself).  This is one big reason deportations are lower than expected. It’s why changes by DHS are needed in regional ICE leadership. permalink award report block reply\nPlantTrees 1 points 6 hours ago Guess they showed him the error of his ways :D permalink award report block reply"}