{"id": "1ARK9pfsTF", "contents": "33 Pepe Farms remember: 2015 Trump said Epstein island was a Cesspool. so yes, Democrats, Trump knew what was going on AND SPOKE OUT ABOUT IT (www.youtube.com) posted 5 hours ago by MolochHunter 4 comments award share report block\n4 comments Sort by Top Top New Worst Old Save Darkpoisonousshaddow 2 points 4 hours ago But now he's doing his best to shut it down, why? permalink award report block reply MolochHunter OP 2 points 4 hours ago i dont know. It doesnt make any more sense than the notion that Trump would admit the island was a cesspool if he was a participant himself permalink parent award report block reply Darkpoisonousshaddow 2 points 4 hours ago Nothing makes sense to me anymore. All I know is, the things we were promised have not happened. permalink parent award report block reply justinkayz 1 points 4 hours ago Are you still talking about Epstein? permalink award report block reply\nDarkpoisonousshaddow 2 points 4 hours ago But now he's doing his best to shut it down, why? permalink award report block reply MolochHunter OP 2 points 4 hours ago i dont know. It doesnt make any more sense than the notion that Trump would admit the island was a cesspool if he was a participant himself permalink parent award report block reply Darkpoisonousshaddow 2 points 4 hours ago Nothing makes sense to me anymore. All I know is, the things we were promised have not happened. permalink parent award report block reply\nMolochHunter OP 2 points 4 hours ago i dont know. It doesnt make any more sense than the notion that Trump would admit the island was a cesspool if he was a participant himself permalink parent award report block reply Darkpoisonousshaddow 2 points 4 hours ago Nothing makes sense to me anymore. All I know is, the things we were promised have not happened. permalink parent award report block reply\nDarkpoisonousshaddow 2 points 4 hours ago Nothing makes sense to me anymore. All I know is, the things we were promised have not happened. permalink parent award report block reply\njustinkayz 1 points 4 hours ago Are you still talking about Epstein? permalink award report block reply"}