{"id": "1ARK55atU0", "contents": "534 It's Okay To Be White posted 5 days ago by Lol_Garrus 71 comments award share download report block\n71 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style Wizard_Glick 43 points 5 days ago Not only is it OK, it's fucking awesome! permalink award report block reply mydogma8yourkarma 20 points 5 days ago In the 80's we had a fun saying when things were going your way, \"It's good to be young and white in America!\".  Today you would be called a racist for that by the people that hate you.  Good thing IDGAF anymore. Let's make racial insensitivity fun again! permalink parent award report block reply booblitchutz 14 points 5 days ago I remember the saying “that’s mighty White of ya!” permalink parent award report block reply Patriot_Dave 2 points 4 days ago Still say it. permalink parent award report block reply SicSemperTyrannis2 1 points 4 days ago Got you covered, Fren: https://m.youtube.com/watch?v=4T2qQPJjhUs&pp=ygUQQ2FybG9zIERlIFNhbnRvIA%3D%3D permalink parent award report block reply IroWide 2 points 4 days ago It is preferrable. permalink parent award report block reply Shinydenim 27 points 5 days ago It’s okay to like titties too permalink award report block reply Protonboy 17 points 5 days ago It's OK to be Stacked permalink parent award report block reply gorilla_grip 9 points 5 days ago Amen permalink parent award report block reply Necrovoter 4 points 5 days ago The original fast food suppliers. permalink parent award report block reply iamimaginos 1 points 4 days ago 2 things, that have never let me down permalink parent award report block reply AfterGlow 17 points 5 days ago Young and beautiful helps too. permalink award report block reply FattyWatt 7 points 5 days ago without that Woke shit.  They're just LG-Bonkers! permalink parent award report block reply Shitsbrokeyo 11 points 5 days ago I like how they message is more important than the view.  Yet the same time, \"look at these genes\" permalink award report block reply blockchain-the-vote 8 points 5 days ago whispers : It's better than OK permalink award report block reply RedFoxOnFire 6 points 5 days ago They're real, and they're spectacular. permalink award report block reply CANATIVE 4 points 5 days ago What wizard said. I have 0 regrets.\nIt’s also awesome to be unvaccinated. permalink award report block reply The_Emperor 4 points 5 days ago Momma Mia!  That's excellent! permalink award report block reply Rango 4 points 5 days ago Thanks for the mammaries. permalink award report block reply Firepit 4 points 5 days ago It’s okay to be modest, too. permalink award report block reply SimaYi 3 points 5 days ago Fight for your people. permalink award report block reply Frenchie619 2 points 3 days ago There's that view of cookie monster eating cookies again.  Can't not think about it,  every single time I see a great picture of her. BTW, most pictures are great. permalink award report block reply journalist 2 points 5 days ago Black gurls be jelly. permalink award report block reply tdtech9 2 points 5 days ago Big improvement over my plain text version.\nThanks!! permalink award report block reply RobinNet 2 points 5 days ago Playing gif of Vince Vaughn motorboating tay-tays in my head. permalink award report block reply thp2034 2 points 5 days ago Oh My...it sure is! permalink award report block reply yodayoda -6 points 5 days ago simp permalink award report block reply booblitchutz 3 points 5 days ago Oh fuck off permalink parent award report block reply MediaBro -8 points 5 days ago It's ok to be White is one thing.\nBut having pride in oneself and then spending all day shitting on every other race does not come from having pride in oneself.\nIt shows a high level of insecurity and you'll need to address this.\nAlso, being proud to be White and elevating Hollywood whores up as standard bearers for White women isn't the win you'll think it is.\nThis woman attends award shows without a bra and you fks brag about her tits.\nShe has brothers. A father. This isn't you'll winning.\nAnd remember, All Pride Comes Before The Fall.\nCheck yourselves. permalink award report block reply Shih_Tabed 8 points 5 days ago \"spending all day shitting on every other race\"  Completely backwards.  Every other race gets to shit on us.  We get to match you.  You don't just get to roam free without clapbacks. permalink parent award report block reply MediaBro 0 points 4 days ago Every other race gets to shit on you because you Americans have adopted \"self hating\" as a sport. Now, you'll are back at shittin on the rest of the globe. It's boring and asinine. Get back to loving yourselves and don't even bother about the other races and what they think of you. permalink parent award report block reply Shih_Tabed 0 points 4 days ago No, every other race gets a free pass.  Whites have to pay the bills.  Most every other culture, including yours, shits in the streets they walk in.  We do love ourselves because we have become more civilized than the rest of the feral world.  We don't care what they think of us.  Just come to our doorsteps if you want to talk about it. permalink parent award report block reply MediaBro 1 points 3 days ago They get a free pass because you'll have given it to them. Stop doing that and stop putting anyone down. permalink parent award report block reply view 4 more comments... FrenOrFoe 7 points 5 days ago You told on yourself that you hate whites. permalink parent award report block reply MediaBro 0 points 4 days ago Why would I hate Whites?? Unlike you, I don't hate on entire groups of human beings for the colour of their skin. What a weird thing to do. You sound like a woke libtard. permalink parent award report block reply FrenOrFoe 0 points 4 days ago You’ve shown your cards that you aren’t American. I recognize patterns and operate accordingly. permalink parent award report block reply MediaBro 0 points 3 days ago Oh no! Mr Pattern Recognition recognized patterns. So according to you, an American is someone who hates all ppl for the colour of their skin? Is that what you are implying? Jeez, no wonder an Islamist Commie won in NY, if this is what an American is supposed to be permalink parent award report block reply view 6 more comments... JetJocky 6 points 5 days ago You don't like beautiful women ? She is a whore because she doesn't wear a bra sometimes ? How pathetically judgmental and insecure you are. You're the one that needs to check yourself. permalink parent award report block reply MediaBro 1 points 4 days ago I didn't call her specifically a whore. But c'mon, before this girl became a MAGA darling, she was in the series Euphoria. You really think she got her role for her acting chops?? permalink parent award report block reply SimplyRedPills 2 points 4 days ago Fuck off back to reddit permalink parent award report block reply MediaBro 1 points 4 days ago Why? So you wankers can masturbate each other off without anyone calling you fags, gay? permalink parent award report block reply RejectRedditization 2 points 4 days ago \"Wankers\" permalink parent award report block reply Meathe 1 points 4 days ago Likely a Brit or Aussie….  Both of which are in the shit. permalink parent award report block reply view 1 more comments... Necrovoter 0 points 5 days ago This woman attends award shows without a bra Is that worse than all the male celebrities who attend award shows without a jockstrap and cup? If you take a look at a lot of the older TV shows permalink parent award report block reply deleted -26 points 5 days ago Datamancer 30 points 5 days ago Except saying it's okay to be white is considered hate speech.   Dick. permalink parent award report block reply deleted -7 points 5 days ago Datamancer 9 points 5 days ago Oh really,  so you never saw the backlash against people who said that?  Not at all?  Never?  Let me guess they never demonized people who wouldn't get the vovid shot either.  Let me guess that never happened. permalink parent award report block reply MaoHadOnly1Testicle 4 points 4 days ago It’s amazing how much leftist discourse is just them pretending not to understand things, thus making discourse impossible. permalink parent award report block reply Lol_Garrus OP 25 points 5 days ago \"It's okay to be white.\" \"\"yOu'Re aN aSshOLe!\" anti-white faggot detected permalink parent award report block reply Zskills 11 points 5 days ago Exposed.  Tell us more about how it's not okay to be white. permalink parent award report block reply HumblePepe 10 points 5 days ago You let your mask slip in less than 3 sentences. permalink parent award report block reply Blackmore 6 points 5 days ago Ok,ok, calling names isn’t being a dick? permalink parent award report block reply load 3 more comments... TheGoyimWhisperer 3 points 5 days ago Comment removed upon the user being banned. permalink award report block reply HoodooOperator 1 points 5 days ago Comment removed by community moderators. permalink award report block reply\nWizard_Glick 43 points 5 days ago Not only is it OK, it's fucking awesome! permalink award report block reply mydogma8yourkarma 20 points 5 days ago In the 80's we had a fun saying when things were going your way, \"It's good to be young and white in America!\".  Today you would be called a racist for that by the people that hate you.  Good thing IDGAF anymore. Let's make racial insensitivity fun again! permalink parent award report block reply booblitchutz 14 points 5 days ago I remember the saying “that’s mighty White of ya!” permalink parent award report block reply Patriot_Dave 2 points 4 days ago Still say it. permalink parent award report block reply SicSemperTyrannis2 1 points 4 days ago Got you covered, Fren: https://m.youtube.com/watch?v=4T2qQPJjhUs&pp=ygUQQ2FybG9zIERlIFNhbnRvIA%3D%3D permalink parent award report block reply IroWide 2 points 4 days ago It is preferrable. permalink parent award report block reply\nmydogma8yourkarma 20 points 5 days ago In the 80's we had a fun saying when things were going your way, \"It's good to be young and white in America!\".  Today you would be called a racist for that by the people that hate you.  Good thing IDGAF anymore. Let's make racial insensitivity fun again! permalink parent award report block reply booblitchutz 14 points 5 days ago I remember the saying “that’s mighty White of ya!” permalink parent award report block reply Patriot_Dave 2 points 4 days ago Still say it. permalink parent award report block reply SicSemperTyrannis2 1 points 4 days ago Got you covered, Fren: https://m.youtube.com/watch?v=4T2qQPJjhUs&pp=ygUQQ2FybG9zIERlIFNhbnRvIA%3D%3D permalink parent award report block reply\nbooblitchutz 14 points 5 days ago I remember the saying “that’s mighty White of ya!” permalink parent award report block reply Patriot_Dave 2 points 4 days ago Still say it. permalink parent award report block reply\nPatriot_Dave 2 points 4 days ago Still say it. permalink parent award report block reply\nSicSemperTyrannis2 1 points 4 days ago Got you covered, Fren: https://m.youtube.com/watch?v=4T2qQPJjhUs&pp=ygUQQ2FybG9zIERlIFNhbnRvIA%3D%3D permalink parent award report block reply\nIroWide 2 points 4 days ago It is preferrable. permalink parent award report block reply\nShinydenim 27 points 5 days ago It’s okay to like titties too permalink award report block reply Protonboy 17 points 5 days ago It's OK to be Stacked permalink parent award report block reply gorilla_grip 9 points 5 days ago Amen permalink parent award report block reply Necrovoter 4 points 5 days ago The original fast food suppliers. permalink parent award report block reply iamimaginos 1 points 4 days ago 2 things, that have never let me down permalink parent award report block reply\nProtonboy 17 points 5 days ago It's OK to be Stacked permalink parent award report block reply\ngorilla_grip 9 points 5 days ago Amen permalink parent award report block reply\nNecrovoter 4 points 5 days ago The original fast food suppliers. permalink parent award report block reply\niamimaginos 1 points 4 days ago 2 things, that have never let me down permalink parent award report block reply\nAfterGlow 17 points 5 days ago Young and beautiful helps too. permalink award report block reply FattyWatt 7 points 5 days ago without that Woke shit.  They're just LG-Bonkers! permalink parent award report block reply\nFattyWatt 7 points 5 days ago without that Woke shit.  They're just LG-Bonkers! permalink parent award report block reply\nShitsbrokeyo 11 points 5 days ago I like how they message is more important than the view.  Yet the same time, \"look at these genes\" permalink award report block reply\nblockchain-the-vote 8 points 5 days ago whispers : It's better than OK permalink award report block reply\nRedFoxOnFire 6 points 5 days ago They're real, and they're spectacular. permalink award report block reply\nCANATIVE 4 points 5 days ago What wizard said. I have 0 regrets.\nIt’s also awesome to be unvaccinated. permalink award report block reply\nThe_Emperor 4 points 5 days ago Momma Mia!  That's excellent! permalink award report block reply\nRango 4 points 5 days ago Thanks for the mammaries. permalink award report block reply\nFirepit 4 points 5 days ago It’s okay to be modest, too. permalink award report block reply\nSimaYi 3 points 5 days ago Fight for your people. permalink award report block reply\nFrenchie619 2 points 3 days ago There's that view of cookie monster eating cookies again.  Can't not think about it,  every single time I see a great picture of her. BTW, most pictures are great. permalink award report block reply\njournalist 2 points 5 days ago Black gurls be jelly. permalink award report block reply\ntdtech9 2 points 5 days ago Big improvement over my plain text version.\nThanks!! permalink award report block reply\nRobinNet 2 points 5 days ago Playing gif of Vince Vaughn motorboating tay-tays in my head. permalink award report block reply\nthp2034 2 points 5 days ago Oh My...it sure is! permalink award report block reply\nyodayoda -6 points 5 days ago simp permalink award report block reply booblitchutz 3 points 5 days ago Oh fuck off permalink parent award report block reply\nbooblitchutz 3 points 5 days ago Oh fuck off permalink parent award report block reply\nMediaBro -8 points 5 days ago It's ok to be White is one thing.\nBut having pride in oneself and then spending all day shitting on every other race does not come from having pride in oneself.\nIt shows a high level of insecurity and you'll need to address this.\nAlso, being proud to be White and elevating Hollywood whores up as standard bearers for White women isn't the win you'll think it is.\nThis woman attends award shows without a bra and you fks brag about her tits.\nShe has brothers. A father. This isn't you'll winning.\nAnd remember, All Pride Comes Before The Fall.\nCheck yourselves. permalink award report block reply Shih_Tabed 8 points 5 days ago \"spending all day shitting on every other race\"  Completely backwards.  Every other race gets to shit on us.  We get to match you.  You don't just get to roam free without clapbacks. permalink parent award report block reply MediaBro 0 points 4 days ago Every other race gets to shit on you because you Americans have adopted \"self hating\" as a sport. Now, you'll are back at shittin on the rest of the globe. It's boring and asinine. Get back to loving yourselves and don't even bother about the other races and what they think of you. permalink parent award report block reply Shih_Tabed 0 points 4 days ago No, every other race gets a free pass.  Whites have to pay the bills.  Most every other culture, including yours, shits in the streets they walk in.  We do love ourselves because we have become more civilized than the rest of the feral world.  We don't care what they think of us.  Just come to our doorsteps if you want to talk about it. permalink parent award report block reply MediaBro 1 points 3 days ago They get a free pass because you'll have given it to them. Stop doing that and stop putting anyone down. permalink parent award report block reply view 4 more comments... FrenOrFoe 7 points 5 days ago You told on yourself that you hate whites. permalink parent award report block reply MediaBro 0 points 4 days ago Why would I hate Whites?? Unlike you, I don't hate on entire groups of human beings for the colour of their skin. What a weird thing to do. You sound like a woke libtard. permalink parent award report block reply FrenOrFoe 0 points 4 days ago You’ve shown your cards that you aren’t American. I recognize patterns and operate accordingly. permalink parent award report block reply MediaBro 0 points 3 days ago Oh no! Mr Pattern Recognition recognized patterns. So according to you, an American is someone who hates all ppl for the colour of their skin? Is that what you are implying? Jeez, no wonder an Islamist Commie won in NY, if this is what an American is supposed to be permalink parent award report block reply view 6 more comments... JetJocky 6 points 5 days ago You don't like beautiful women ? She is a whore because she doesn't wear a bra sometimes ? How pathetically judgmental and insecure you are. You're the one that needs to check yourself. permalink parent award report block reply MediaBro 1 points 4 days ago I didn't call her specifically a whore. But c'mon, before this girl became a MAGA darling, she was in the series Euphoria. You really think she got her role for her acting chops?? permalink parent award report block reply SimplyRedPills 2 points 4 days ago Fuck off back to reddit permalink parent award report block reply MediaBro 1 points 4 days ago Why? So you wankers can masturbate each other off without anyone calling you fags, gay? permalink parent award report block reply RejectRedditization 2 points 4 days ago \"Wankers\" permalink parent award report block reply Meathe 1 points 4 days ago Likely a Brit or Aussie….  Both of which are in the shit. permalink parent award report block reply view 1 more comments... Necrovoter 0 points 5 days ago This woman attends award shows without a bra Is that worse than all the male celebrities who attend award shows without a jockstrap and cup? If you take a look at a lot of the older TV shows permalink parent award report block reply\nShih_Tabed 8 points 5 days ago \"spending all day shitting on every other race\"  Completely backwards.  Every other race gets to shit on us.  We get to match you.  You don't just get to roam free without clapbacks. permalink parent award report block reply MediaBro 0 points 4 days ago Every other race gets to shit on you because you Americans have adopted \"self hating\" as a sport. Now, you'll are back at shittin on the rest of the globe. It's boring and asinine. Get back to loving yourselves and don't even bother about the other races and what they think of you. permalink parent award report block reply Shih_Tabed 0 points 4 days ago No, every other race gets a free pass.  Whites have to pay the bills.  Most every other culture, including yours, shits in the streets they walk in.  We do love ourselves because we have become more civilized than the rest of the feral world.  We don't care what they think of us.  Just come to our doorsteps if you want to talk about it. permalink parent award report block reply MediaBro 1 points 3 days ago They get a free pass because you'll have given it to them. Stop doing that and stop putting anyone down. permalink parent award report block reply view 4 more comments...\nMediaBro 0 points 4 days ago Every other race gets to shit on you because you Americans have adopted \"self hating\" as a sport. Now, you'll are back at shittin on the rest of the globe. It's boring and asinine. Get back to loving yourselves and don't even bother about the other races and what they think of you. permalink parent award report block reply Shih_Tabed 0 points 4 days ago No, every other race gets a free pass.  Whites have to pay the bills.  Most every other culture, including yours, shits in the streets they walk in.  We do love ourselves because we have become more civilized than the rest of the feral world.  We don't care what they think of us.  Just come to our doorsteps if you want to talk about it. permalink parent award report block reply MediaBro 1 points 3 days ago They get a free pass because you'll have given it to them. Stop doing that and stop putting anyone down. permalink parent award report block reply view 4 more comments...\nShih_Tabed 0 points 4 days ago No, every other race gets a free pass.  Whites have to pay the bills.  Most every other culture, including yours, shits in the streets they walk in.  We do love ourselves because we have become more civilized than the rest of the feral world.  We don't care what they think of us.  Just come to our doorsteps if you want to talk about it. permalink parent award report block reply MediaBro 1 points 3 days ago They get a free pass because you'll have given it to them. Stop doing that and stop putting anyone down. permalink parent award report block reply view 4 more comments...\nMediaBro 1 points 3 days ago They get a free pass because you'll have given it to them. Stop doing that and stop putting anyone down. permalink parent award report block reply view 4 more comments...\nFrenOrFoe 7 points 5 days ago You told on yourself that you hate whites. permalink parent award report block reply MediaBro 0 points 4 days ago Why would I hate Whites?? Unlike you, I don't hate on entire groups of human beings for the colour of their skin. What a weird thing to do. You sound like a woke libtard. permalink parent award report block reply FrenOrFoe 0 points 4 days ago You’ve shown your cards that you aren’t American. I recognize patterns and operate accordingly. permalink parent award report block reply MediaBro 0 points 3 days ago Oh no! Mr Pattern Recognition recognized patterns. So according to you, an American is someone who hates all ppl for the colour of their skin? Is that what you are implying? Jeez, no wonder an Islamist Commie won in NY, if this is what an American is supposed to be permalink parent award report block reply view 6 more comments...\nMediaBro 0 points 4 days ago Why would I hate Whites?? Unlike you, I don't hate on entire groups of human beings for the colour of their skin. What a weird thing to do. You sound like a woke libtard. permalink parent award report block reply FrenOrFoe 0 points 4 days ago You’ve shown your cards that you aren’t American. I recognize patterns and operate accordingly. permalink parent award report block reply MediaBro 0 points 3 days ago Oh no! Mr Pattern Recognition recognized patterns. So according to you, an American is someone who hates all ppl for the colour of their skin? Is that what you are implying? Jeez, no wonder an Islamist Commie won in NY, if this is what an American is supposed to be permalink parent award report block reply view 6 more comments...\nFrenOrFoe 0 points 4 days ago You’ve shown your cards that you aren’t American. I recognize patterns and operate accordingly. permalink parent award report block reply MediaBro 0 points 3 days ago Oh no! Mr Pattern Recognition recognized patterns. So according to you, an American is someone who hates all ppl for the colour of their skin? Is that what you are implying? Jeez, no wonder an Islamist Commie won in NY, if this is what an American is supposed to be permalink parent award report block reply view 6 more comments...\nMediaBro 0 points 3 days ago Oh no! Mr Pattern Recognition recognized patterns. So according to you, an American is someone who hates all ppl for the colour of their skin? Is that what you are implying? Jeez, no wonder an Islamist Commie won in NY, if this is what an American is supposed to be permalink parent award report block reply view 6 more comments...\nJetJocky 6 points 5 days ago You don't like beautiful women ? She is a whore because she doesn't wear a bra sometimes ? How pathetically judgmental and insecure you are. You're the one that needs to check yourself. permalink parent award report block reply MediaBro 1 points 4 days ago I didn't call her specifically a whore. But c'mon, before this girl became a MAGA darling, she was in the series Euphoria. You really think she got her role for her acting chops?? permalink parent award report block reply\nMediaBro 1 points 4 days ago I didn't call her specifically a whore. But c'mon, before this girl became a MAGA darling, she was in the series Euphoria. You really think she got her role for her acting chops?? permalink parent award report block reply\nSimplyRedPills 2 points 4 days ago Fuck off back to reddit permalink parent award report block reply MediaBro 1 points 4 days ago Why? So you wankers can masturbate each other off without anyone calling you fags, gay? permalink parent award report block reply RejectRedditization 2 points 4 days ago \"Wankers\" permalink parent award report block reply Meathe 1 points 4 days ago Likely a Brit or Aussie….  Both of which are in the shit. permalink parent award report block reply view 1 more comments...\nMediaBro 1 points 4 days ago Why? So you wankers can masturbate each other off without anyone calling you fags, gay? permalink parent award report block reply RejectRedditization 2 points 4 days ago \"Wankers\" permalink parent award report block reply Meathe 1 points 4 days ago Likely a Brit or Aussie….  Both of which are in the shit. permalink parent award report block reply view 1 more comments...\nRejectRedditization 2 points 4 days ago \"Wankers\" permalink parent award report block reply Meathe 1 points 4 days ago Likely a Brit or Aussie….  Both of which are in the shit. permalink parent award report block reply view 1 more comments...\nMeathe 1 points 4 days ago Likely a Brit or Aussie….  Both of which are in the shit. permalink parent award report block reply view 1 more comments...\nNecrovoter 0 points 5 days ago This woman attends award shows without a bra Is that worse than all the male celebrities who attend award shows without a jockstrap and cup? If you take a look at a lot of the older TV shows permalink parent award report block reply\ndeleted -26 points 5 days ago Datamancer 30 points 5 days ago Except saying it's okay to be white is considered hate speech.   Dick. permalink parent award report block reply deleted -7 points 5 days ago Datamancer 9 points 5 days ago Oh really,  so you never saw the backlash against people who said that?  Not at all?  Never?  Let me guess they never demonized people who wouldn't get the vovid shot either.  Let me guess that never happened. permalink parent award report block reply MaoHadOnly1Testicle 4 points 4 days ago It’s amazing how much leftist discourse is just them pretending not to understand things, thus making discourse impossible. permalink parent award report block reply Lol_Garrus OP 25 points 5 days ago \"It's okay to be white.\" \"\"yOu'Re aN aSshOLe!\" anti-white faggot detected permalink parent award report block reply Zskills 11 points 5 days ago Exposed.  Tell us more about how it's not okay to be white. permalink parent award report block reply HumblePepe 10 points 5 days ago You let your mask slip in less than 3 sentences. permalink parent award report block reply Blackmore 6 points 5 days ago Ok,ok, calling names isn’t being a dick? permalink parent award report block reply load 3 more comments...\nDatamancer 30 points 5 days ago Except saying it's okay to be white is considered hate speech.   Dick. permalink parent award report block reply deleted -7 points 5 days ago Datamancer 9 points 5 days ago Oh really,  so you never saw the backlash against people who said that?  Not at all?  Never?  Let me guess they never demonized people who wouldn't get the vovid shot either.  Let me guess that never happened. permalink parent award report block reply MaoHadOnly1Testicle 4 points 4 days ago It’s amazing how much leftist discourse is just them pretending not to understand things, thus making discourse impossible. permalink parent award report block reply\ndeleted -7 points 5 days ago Datamancer 9 points 5 days ago Oh really,  so you never saw the backlash against people who said that?  Not at all?  Never?  Let me guess they never demonized people who wouldn't get the vovid shot either.  Let me guess that never happened. permalink parent award report block reply MaoHadOnly1Testicle 4 points 4 days ago It’s amazing how much leftist discourse is just them pretending not to understand things, thus making discourse impossible. permalink parent award report block reply\nDatamancer 9 points 5 days ago Oh really,  so you never saw the backlash against people who said that?  Not at all?  Never?  Let me guess they never demonized people who wouldn't get the vovid shot either.  Let me guess that never happened. permalink parent award report block reply MaoHadOnly1Testicle 4 points 4 days ago It’s amazing how much leftist discourse is just them pretending not to understand things, thus making discourse impossible. permalink parent award report block reply\nMaoHadOnly1Testicle 4 points 4 days ago It’s amazing how much leftist discourse is just them pretending not to understand things, thus making discourse impossible. permalink parent award report block reply\nLol_Garrus OP 25 points 5 days ago \"It's okay to be white.\" \"\"yOu'Re aN aSshOLe!\" anti-white faggot detected permalink parent award report block reply\nZskills 11 points 5 days ago Exposed.  Tell us more about how it's not okay to be white. permalink parent award report block reply\nHumblePepe 10 points 5 days ago You let your mask slip in less than 3 sentences. permalink parent award report block reply\nBlackmore 6 points 5 days ago Ok,ok, calling names isn’t being a dick? permalink parent award report block reply\nTheGoyimWhisperer 3 points 5 days ago Comment removed upon the user being banned. permalink award report block reply\nHoodooOperator 1 points 5 days ago Comment removed by community moderators. permalink award report block reply"}