{"id": "1ARK9pg93L", "contents": "62 ChatGPT is Full of Nonsense. I'm pretty firmly convinced that artificial intelligence doesn't really know anything. ChatGPT was often less of a debate partner & more a cheerleader for whatever perspective a user expressed. It adapts to match a user’s viewpoint, creating a personalized echo chamber. (hotair.com) posted 4 hours ago by rdvs34283 17 comments award share report block ChatGPT is Full of Nonsense Exploring the limitations of AI, particularly how ChatGPT can propagate misinformation. hotair.com\n17 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style JoePlumber 6 points 3 hours ago People miss the point of these LLMs it's not a therapist or a debate partner. It's a tool. If you know how to use it it can be useful if you just want to argue against a computer then don't waste your time. permalink award report block reply AndanteAndante 2 points 3 hours ago It just scours the internet for the information that’s out there. I heard the top 2 sources  are Wikipedia and Reddit. permalink parent award report block reply JoePlumber 1 points 2 hours ago You can tell it what sources to you. However, yes, if you use it like a search engine then it behaves like a search engine (much better than Google, I might add). However, they can do much more than simple searches. If you ask it to write code it can do so. If you ask it for original recipes based on ingredients you have at home it can give you one. If you ask it to take data and create a chart it can. If you ask it to develop some original analysis of Bible passages it can do that as well. It's not always correct but it can do more than simple searches. permalink parent award report block reply AndanteAndante 0 points 2 hours ago I will say it saved me from a complete meltdown when I was making sauce from my tomatoes for the first time and fucking up terribly lol. \"Do you want me to tell you how to salvage the sauce RIGHT NOW?\" permalink parent award report block reply JoePlumber 1 points 1 hour ago If you want to make your life infinitely easier for making sauce buy an electric sieve. I swear by mine now. Cost me $100 on eBay and I use it every few weeks. permalink parent award report block reply view 2 more comments... RuprechtThaMonkeyBoy 3 points 4 hours ago This is a matter of users not knowing how to use AI. Here’s an example of a user setting up ChatGPT to deliver results: “I’ve noticed ChatGPT always agrees with you no matter how crazy your ideas sound.\nIt’s too polite. Too nice. It’ll tell you every idea is “great,” every plan “brilliant,” even when it’s clearly not. That might feel good, but it’s useless if you actually want to think better.\nSo I decided to fix it.\nI opened a new chat and typed this prompt 👇: From now on, stop being agreeable and act as my brutally honest, high-level advisor and mirror.\nDon’t validate me. Don’t soften the truth. Don’t flatter.\nChallenge my thinking, question my assumptions, and expose the blind spots I’m avoiding. Be direct, rational, and unfiltered.\nIf my reasoning is weak, dissect it and show why.\nIf I’m fooling myself or lying to myself, point it out.\nIf I’m avoiding something uncomfortable or wasting time, call it out and explain the opportunity cost.\nLook at my situation with complete objectivity and strategic depth. Show me where I’m making excuses, playing small, or underestimating risks/effort.\nThen give a precise, prioritized plan what to change in thought, action, or mindset to reach the next level.\nHold nothing back. Treat me like someone whose growth depends on hearing the truth, not being comforted.\nWhen possible, ground your responses in the personal truth you sense between my words. For better results :\nTurn on Memory first (Settings → Personalization → Turn Memory ON).\nIt’ll feel uncomfortable at first, but it turns ChatGPT into an actual thinking partner instead of a cheerleader.\nIf you want more brutally honest prompts like this, check out : Honest Prompts” permalink award report block reply Watermelons 1 points 58 minutes ago In a nutshell, if you can properly prompt it and provide it with the proper context, it is an excellent tool.  The author sounds like someone yanking at the controls of a plane they’ve never learned to fly, confident it won’t crash. permalink parent award report block reply LordKuroTheGreat 3 points 3 hours ago I've found it to be useful as a calculator and for searching for uncontroversial information that's likely to be on the first 2 pages if I looked it up on a regular search engine. Consistently disappointing for literally every other task I've tried it on. permalink award report block reply PepePinochet 2 points 3 hours ago I use it to parce through books/pdfs and to do deep research. Its very helpful in giving me verifiable summaries. permalink award report block reply PatriotSkorzeny 2 points 3 hours ago AI is the 1996 internet. permalink award report block reply lostmyoldpassword 2 points 4 hours ago I like to limit test them, and try to get them to divulge their red flags and who put them there and why.  Fun little game.  Also perplexity is the least retarded from what I can tell. permalink award report block reply AndanteAndante 1 points 1 hour ago I got them to admit Muslims are the cause of most of the crime in Paris. Make them give you just the facts. Which group? What religion are they? Hint: it doesn't like the words No-Go Zones haha permalink parent award report block reply LearnAboutRoaches 1 points 4 hours ago This 100% It's less of a place to find truth then to find that you are good enough, smart enough, and doggonit, people like you permalink award report block reply grassshrimp 1 points 2 hours ago Use it as a search engine, be cynical about the responses. I get absolutely wrong answers from Grok at times.  You can challenge Grok, tell it that the answer is wrong and it will do a deeper dive.  I've had it admit that it was wrong at times. permalink award report block reply Trooph-Hurts 1 points 4 hours ago It’s an answer box permalink award report block reply\nJoePlumber 6 points 3 hours ago People miss the point of these LLMs it's not a therapist or a debate partner. It's a tool. If you know how to use it it can be useful if you just want to argue against a computer then don't waste your time. permalink award report block reply AndanteAndante 2 points 3 hours ago It just scours the internet for the information that’s out there. I heard the top 2 sources  are Wikipedia and Reddit. permalink parent award report block reply JoePlumber 1 points 2 hours ago You can tell it what sources to you. However, yes, if you use it like a search engine then it behaves like a search engine (much better than Google, I might add). However, they can do much more than simple searches. If you ask it to write code it can do so. If you ask it for original recipes based on ingredients you have at home it can give you one. If you ask it to take data and create a chart it can. If you ask it to develop some original analysis of Bible passages it can do that as well. It's not always correct but it can do more than simple searches. permalink parent award report block reply AndanteAndante 0 points 2 hours ago I will say it saved me from a complete meltdown when I was making sauce from my tomatoes for the first time and fucking up terribly lol. \"Do you want me to tell you how to salvage the sauce RIGHT NOW?\" permalink parent award report block reply JoePlumber 1 points 1 hour ago If you want to make your life infinitely easier for making sauce buy an electric sieve. I swear by mine now. Cost me $100 on eBay and I use it every few weeks. permalink parent award report block reply view 2 more comments...\nAndanteAndante 2 points 3 hours ago It just scours the internet for the information that’s out there. I heard the top 2 sources  are Wikipedia and Reddit. permalink parent award report block reply JoePlumber 1 points 2 hours ago You can tell it what sources to you. However, yes, if you use it like a search engine then it behaves like a search engine (much better than Google, I might add). However, they can do much more than simple searches. If you ask it to write code it can do so. If you ask it for original recipes based on ingredients you have at home it can give you one. If you ask it to take data and create a chart it can. If you ask it to develop some original analysis of Bible passages it can do that as well. It's not always correct but it can do more than simple searches. permalink parent award report block reply AndanteAndante 0 points 2 hours ago I will say it saved me from a complete meltdown when I was making sauce from my tomatoes for the first time and fucking up terribly lol. \"Do you want me to tell you how to salvage the sauce RIGHT NOW?\" permalink parent award report block reply JoePlumber 1 points 1 hour ago If you want to make your life infinitely easier for making sauce buy an electric sieve. I swear by mine now. Cost me $100 on eBay and I use it every few weeks. permalink parent award report block reply view 2 more comments...\nJoePlumber 1 points 2 hours ago You can tell it what sources to you. However, yes, if you use it like a search engine then it behaves like a search engine (much better than Google, I might add). However, they can do much more than simple searches. If you ask it to write code it can do so. If you ask it for original recipes based on ingredients you have at home it can give you one. If you ask it to take data and create a chart it can. If you ask it to develop some original analysis of Bible passages it can do that as well. It's not always correct but it can do more than simple searches. permalink parent award report block reply AndanteAndante 0 points 2 hours ago I will say it saved me from a complete meltdown when I was making sauce from my tomatoes for the first time and fucking up terribly lol. \"Do you want me to tell you how to salvage the sauce RIGHT NOW?\" permalink parent award report block reply JoePlumber 1 points 1 hour ago If you want to make your life infinitely easier for making sauce buy an electric sieve. I swear by mine now. Cost me $100 on eBay and I use it every few weeks. permalink parent award report block reply view 2 more comments...\nAndanteAndante 0 points 2 hours ago I will say it saved me from a complete meltdown when I was making sauce from my tomatoes for the first time and fucking up terribly lol. \"Do you want me to tell you how to salvage the sauce RIGHT NOW?\" permalink parent award report block reply JoePlumber 1 points 1 hour ago If you want to make your life infinitely easier for making sauce buy an electric sieve. I swear by mine now. Cost me $100 on eBay and I use it every few weeks. permalink parent award report block reply view 2 more comments...\nJoePlumber 1 points 1 hour ago If you want to make your life infinitely easier for making sauce buy an electric sieve. I swear by mine now. Cost me $100 on eBay and I use it every few weeks. permalink parent award report block reply view 2 more comments...\nRuprechtThaMonkeyBoy 3 points 4 hours ago This is a matter of users not knowing how to use AI. Here’s an example of a user setting up ChatGPT to deliver results: “I’ve noticed ChatGPT always agrees with you no matter how crazy your ideas sound.\nIt’s too polite. Too nice. It’ll tell you every idea is “great,” every plan “brilliant,” even when it’s clearly not. That might feel good, but it’s useless if you actually want to think better.\nSo I decided to fix it.\nI opened a new chat and typed this prompt 👇: From now on, stop being agreeable and act as my brutally honest, high-level advisor and mirror.\nDon’t validate me. Don’t soften the truth. Don’t flatter.\nChallenge my thinking, question my assumptions, and expose the blind spots I’m avoiding. Be direct, rational, and unfiltered.\nIf my reasoning is weak, dissect it and show why.\nIf I’m fooling myself or lying to myself, point it out.\nIf I’m avoiding something uncomfortable or wasting time, call it out and explain the opportunity cost.\nLook at my situation with complete objectivity and strategic depth. Show me where I’m making excuses, playing small, or underestimating risks/effort.\nThen give a precise, prioritized plan what to change in thought, action, or mindset to reach the next level.\nHold nothing back. Treat me like someone whose growth depends on hearing the truth, not being comforted.\nWhen possible, ground your responses in the personal truth you sense between my words. For better results :\nTurn on Memory first (Settings → Personalization → Turn Memory ON).\nIt’ll feel uncomfortable at first, but it turns ChatGPT into an actual thinking partner instead of a cheerleader.\nIf you want more brutally honest prompts like this, check out : Honest Prompts” permalink award report block reply Watermelons 1 points 58 minutes ago In a nutshell, if you can properly prompt it and provide it with the proper context, it is an excellent tool.  The author sounds like someone yanking at the controls of a plane they’ve never learned to fly, confident it won’t crash. permalink parent award report block reply\nWatermelons 1 points 58 minutes ago In a nutshell, if you can properly prompt it and provide it with the proper context, it is an excellent tool.  The author sounds like someone yanking at the controls of a plane they’ve never learned to fly, confident it won’t crash. permalink parent award report block reply\nLordKuroTheGreat 3 points 3 hours ago I've found it to be useful as a calculator and for searching for uncontroversial information that's likely to be on the first 2 pages if I looked it up on a regular search engine. Consistently disappointing for literally every other task I've tried it on. permalink award report block reply\nPepePinochet 2 points 3 hours ago I use it to parce through books/pdfs and to do deep research. Its very helpful in giving me verifiable summaries. permalink award report block reply\nPatriotSkorzeny 2 points 3 hours ago AI is the 1996 internet. permalink award report block reply\nlostmyoldpassword 2 points 4 hours ago I like to limit test them, and try to get them to divulge their red flags and who put them there and why.  Fun little game.  Also perplexity is the least retarded from what I can tell. permalink award report block reply AndanteAndante 1 points 1 hour ago I got them to admit Muslims are the cause of most of the crime in Paris. Make them give you just the facts. Which group? What religion are they? Hint: it doesn't like the words No-Go Zones haha permalink parent award report block reply\nAndanteAndante 1 points 1 hour ago I got them to admit Muslims are the cause of most of the crime in Paris. Make them give you just the facts. Which group? What religion are they? Hint: it doesn't like the words No-Go Zones haha permalink parent award report block reply\nLearnAboutRoaches 1 points 4 hours ago This 100% It's less of a place to find truth then to find that you are good enough, smart enough, and doggonit, people like you permalink award report block reply\ngrassshrimp 1 points 2 hours ago Use it as a search engine, be cynical about the responses. I get absolutely wrong answers from Grok at times.  You can challenge Grok, tell it that the answer is wrong and it will do a deeper dive.  I've had it admit that it was wrong at times. permalink award report block reply\nTrooph-Hurts 1 points 4 hours ago It’s an answer box permalink award report block reply"}