{"id": "1ARK9oWNDm", "contents": "8 🙏Enoch's Daily News Blast Tuesday Nov. 11th🙏 posted 3 hours ago by Slechta5614 3 comments award share download report block\n3 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Slechta5614 OP 2 points 3 hours ago TUESDAY NOVEMBER 11TH    NEWS BLAST Trump calls H-1B visas necessary to bring in 'certain talents' - that he says the U.S. lacks House panel advances Senate-passed funding bill Turkish military plane with 20 on board crashes in Georgia JFK's grandson Jack Schlossberg to run for Congress Protesters break into COP30 venue in Brazil Top diplomats from G7 countries meet in Canada Northern Lights visible as far south as Texas and Alabama Flight cancellations up to 6% as FAA airport delays linger China bridge partially collapses after recent opening Victims' families sue Camp Mystic over deadly Texas floods Dominican Republic hit with widespread power outage Trump says Chicago crime has fallen dramatically UK sentences Chinese scammer after record-breaking Bitcoin seizure Reagan-appointed judge resigns in protest of Trump Suicide bomber kills 12 outside Islamabad court as Pakistan violence rises Psalm 143:6 What is something you rushed to your window to watch? permalink award report block reply Covfefebrulee 2 points 3 hours ago One thing that I rushed to my window to watch was the space shuttle piggybacked on a jet airliner coming in over Pacific Palisades from the ocean. I have a picture of it somewhere. I think Felix was jumping from the high altitude pod around that same time maybe even that same day. Anyway…since you asked. permalink parent award report block reply Slechta5614 OP 2 points 3 hours ago Wow I bet that was a sight to see. Space shuttles are cool I would love to see a launch someday. Great comment. Appreciate you going down memory lane for me.  God bless permalink parent award report block reply\nSlechta5614 OP 2 points 3 hours ago TUESDAY NOVEMBER 11TH    NEWS BLAST Trump calls H-1B visas necessary to bring in 'certain talents' - that he says the U.S. lacks House panel advances Senate-passed funding bill Turkish military plane with 20 on board crashes in Georgia JFK's grandson Jack Schlossberg to run for Congress Protesters break into COP30 venue in Brazil Top diplomats from G7 countries meet in Canada Northern Lights visible as far south as Texas and Alabama Flight cancellations up to 6% as FAA airport delays linger China bridge partially collapses after recent opening Victims' families sue Camp Mystic over deadly Texas floods Dominican Republic hit with widespread power outage Trump says Chicago crime has fallen dramatically UK sentences Chinese scammer after record-breaking Bitcoin seizure Reagan-appointed judge resigns in protest of Trump Suicide bomber kills 12 outside Islamabad court as Pakistan violence rises Psalm 143:6 What is something you rushed to your window to watch? permalink award report block reply Covfefebrulee 2 points 3 hours ago One thing that I rushed to my window to watch was the space shuttle piggybacked on a jet airliner coming in over Pacific Palisades from the ocean. I have a picture of it somewhere. I think Felix was jumping from the high altitude pod around that same time maybe even that same day. Anyway…since you asked. permalink parent award report block reply Slechta5614 OP 2 points 3 hours ago Wow I bet that was a sight to see. Space shuttles are cool I would love to see a launch someday. Great comment. Appreciate you going down memory lane for me.  God bless permalink parent award report block reply\nCovfefebrulee 2 points 3 hours ago One thing that I rushed to my window to watch was the space shuttle piggybacked on a jet airliner coming in over Pacific Palisades from the ocean. I have a picture of it somewhere. I think Felix was jumping from the high altitude pod around that same time maybe even that same day. Anyway…since you asked. permalink parent award report block reply Slechta5614 OP 2 points 3 hours ago Wow I bet that was a sight to see. Space shuttles are cool I would love to see a launch someday. Great comment. Appreciate you going down memory lane for me.  God bless permalink parent award report block reply\nSlechta5614 OP 2 points 3 hours ago Wow I bet that was a sight to see. Space shuttles are cool I would love to see a launch someday. Great comment. Appreciate you going down memory lane for me.  God bless permalink parent award report block reply"}