{"id": "1ARK9pg9Fn", "contents": "324 VP just went FULL AMERICA FIRST:  \"You want to talk about people being pissed off? People are pissed off when they feel like other countries are being prioritized over the United States of America.\" Take that Zelensky! posted 3 hours ago by Bidensuckscocks 31 comments award share report block\n31 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno RedCapNation 25 points 3 hours ago Says the guy with a pajeet wife, half breed kids and a pajeet best friend billionaire who’s super pro h1b for India. permalink award report block reply IvotedforTrumptwice 5 points 1 hour ago I have been praying for leadership like his for a long time. A leadership that has an intimate relationship with the struggles of impoverished people. A man that has experienced the world of toil and hardship and has the empathy and compassion for the people still in it. This is akin to President Andrew Jackson. He was the only president to kill the central bank and eliminate our national debt. Because of him, 1776 was extended for another 100 years until the asswipe Woodrow Wilson. Whoever his wife is, is a personal choice, that requires a lot of different influences. Man is not as simple as to just classify them from race, ethnicity, and nationality. Would it have looked better for him to marry a white American super model? Sure. But he met this woman just like any other man and fell in love with her. I could care less that his wife is pajeet. He also met her years before the pajeets started to become a problem. Vance is a VP that I’ve wanted since I was a young teenager, I’ll take what I can get. He could have been another Mike pence who is married to an American white woman. Also, do you see how bad the hoeflation is in America with white women? permalink parent award report block reply CocaineNewsome 2 points 55 minutes ago I like that he understands but that will make it hurt so much worse if he does uniparty stuff anyway. Fuck Ukraine. They are some military industrial complex grifting. We go and save like $1B throwing people off food stamps, maybe we cut 40B from Ukraine.. but those are drops in a bucket. Where is the rest? The real structural stuff. The time for just saying what we wanna hear has run out. That's my gripe. permalink parent award report block reply BigMikesChef 2 points 37 minutes ago They've let us down on everything thus far, why would that change? permalink parent award report block reply BigMikesChef 2 points 38 minutes ago The issue isn't her race. She's a democrat and a pagan. Pretty terrible influence to have in your leader's house. His next greatest influence is Thiel...not good omens. permalink parent award report block reply NonbinaryPotatohead 1 points 29 minutes ago He didn't write his book btw, its manufactured permalink parent award report block reply RedStoneDeepState -16 points 2 hours ago Racist incel permalink parent award report block reply TPMJB 7 points 2 hours ago Do you think your words have power over us, golem? permalink parent award report block reply RedStoneDeepState -13 points 1 hour ago Yes you fucking loser. permalink parent award report block reply TPMJB 4 points 1 hour ago I make more than you and your AIPAC/JIDF bucks. So if I'm a loser, that makes you...lower than that? permalink parent award report block reply view 3 more comments... RizzlieDoodad 2 points 39 minutes ago I've been called a Nazi by my own father. You think this means anything? permalink parent award report block reply RedStoneDeepState 1 points 26 minutes ago Lol permalink parent award report block reply AgnosticTemplar 9 points 3 hours ago Ukraine is just a grift politicans use to launder money, none of them give a shit about the actual country or it's people. Israel, on the other hand, we have politicans who have sworn fealty to that country and place its security and prosperity well above that of the US. permalink award report block reply SwedishChainsaw2 2 points 2 hours ago Ukraine is the actual homeland of the modern \"jew\". We should returm them there. permalink parent award report block reply AgnosticTemplar 0 points 2 hours ago No, they don't deserve a homeland. permalink parent award report block reply TPMJB 8 points 1 hour ago Lol okay Vance, now do the H1B program. permalink award report block reply nakedjay 5 points 1 hour ago He's talking about Isreal right? permalink award report block reply magamagamaga123 5 points 3 hours ago Democrat response to claims of being left behind:  learn to code. permalink award report block reply keeptherepublic1776 5 points 2 hours ago I don't trust Vance. permalink award report block reply f_bastiat 1 points 1 hour ago He speaks well and has the verifiable backstory like Trump. I'm 80% sure we know what we are getting and if anything he is holding back being more MAGA for the sake of appearing less chaotic than Trump when 2028 rolls around. He really seems like someone who after enough beers would be hosting an impromptu episode of InfoWars at the bar. permalink parent award report block reply IvotedforTrumptwice 4 points 1 hour ago If he’s not MAGA, then he’s an incredible actor and has done a great job of covering up and making up his true history. permalink parent award report block reply Imnotnorm 0 points 29 minutes ago Yes those things are true unfortunately.  He's savvy. He gets the internet. He'll know the right thing to say. He won't get the trust back. He's toast already permalink parent award report block reply EyesSewnShut 1 points 22 minutes ago Comment removed by community moderators. permalink parent award report block reply SteveRogers42 4 points 58 minutes ago Is he talking about India? Or Israel? Just asking. permalink award report block reply WanderingStar 1 points 6 minutes ago If he means by \"other countries\" - H1B's, work visas and foreign aid, I'm good with that but nothing less. permalink award report block reply PillarOfWisdom 0 points 22 minutes ago Zelensky?  He pales in comparison to Netanyahu. permalink award report block reply Imnotnorm -1 points 31 minutes ago There's nothing vance can do at this point to win in 2028. We know he's savvy. We know that he gets the internet and knows the right things to say. Not enough people will believe he's sincere about it. Shouldnt have licked the wall bro. permalink award report block reply Darkpoisonousshaddow 2 points 3 hours ago Comment removed by community moderators. permalink award report block reply EyesSewnShut 1 points 24 minutes ago Comment removed by community moderators. permalink award report block reply\nRedCapNation 25 points 3 hours ago Says the guy with a pajeet wife, half breed kids and a pajeet best friend billionaire who’s super pro h1b for India. permalink award report block reply IvotedforTrumptwice 5 points 1 hour ago I have been praying for leadership like his for a long time. A leadership that has an intimate relationship with the struggles of impoverished people. A man that has experienced the world of toil and hardship and has the empathy and compassion for the people still in it. This is akin to President Andrew Jackson. He was the only president to kill the central bank and eliminate our national debt. Because of him, 1776 was extended for another 100 years until the asswipe Woodrow Wilson. Whoever his wife is, is a personal choice, that requires a lot of different influences. Man is not as simple as to just classify them from race, ethnicity, and nationality. Would it have looked better for him to marry a white American super model? Sure. But he met this woman just like any other man and fell in love with her. I could care less that his wife is pajeet. He also met her years before the pajeets started to become a problem. Vance is a VP that I’ve wanted since I was a young teenager, I’ll take what I can get. He could have been another Mike pence who is married to an American white woman. Also, do you see how bad the hoeflation is in America with white women? permalink parent award report block reply CocaineNewsome 2 points 55 minutes ago I like that he understands but that will make it hurt so much worse if he does uniparty stuff anyway. Fuck Ukraine. They are some military industrial complex grifting. We go and save like $1B throwing people off food stamps, maybe we cut 40B from Ukraine.. but those are drops in a bucket. Where is the rest? The real structural stuff. The time for just saying what we wanna hear has run out. That's my gripe. permalink parent award report block reply BigMikesChef 2 points 37 minutes ago They've let us down on everything thus far, why would that change? permalink parent award report block reply BigMikesChef 2 points 38 minutes ago The issue isn't her race. She's a democrat and a pagan. Pretty terrible influence to have in your leader's house. His next greatest influence is Thiel...not good omens. permalink parent award report block reply NonbinaryPotatohead 1 points 29 minutes ago He didn't write his book btw, its manufactured permalink parent award report block reply RedStoneDeepState -16 points 2 hours ago Racist incel permalink parent award report block reply TPMJB 7 points 2 hours ago Do you think your words have power over us, golem? permalink parent award report block reply RedStoneDeepState -13 points 1 hour ago Yes you fucking loser. permalink parent award report block reply TPMJB 4 points 1 hour ago I make more than you and your AIPAC/JIDF bucks. So if I'm a loser, that makes you...lower than that? permalink parent award report block reply view 3 more comments... RizzlieDoodad 2 points 39 minutes ago I've been called a Nazi by my own father. You think this means anything? permalink parent award report block reply RedStoneDeepState 1 points 26 minutes ago Lol permalink parent award report block reply\nIvotedforTrumptwice 5 points 1 hour ago I have been praying for leadership like his for a long time. A leadership that has an intimate relationship with the struggles of impoverished people. A man that has experienced the world of toil and hardship and has the empathy and compassion for the people still in it. This is akin to President Andrew Jackson. He was the only president to kill the central bank and eliminate our national debt. Because of him, 1776 was extended for another 100 years until the asswipe Woodrow Wilson. Whoever his wife is, is a personal choice, that requires a lot of different influences. Man is not as simple as to just classify them from race, ethnicity, and nationality. Would it have looked better for him to marry a white American super model? Sure. But he met this woman just like any other man and fell in love with her. I could care less that his wife is pajeet. He also met her years before the pajeets started to become a problem. Vance is a VP that I’ve wanted since I was a young teenager, I’ll take what I can get. He could have been another Mike pence who is married to an American white woman. Also, do you see how bad the hoeflation is in America with white women? permalink parent award report block reply CocaineNewsome 2 points 55 minutes ago I like that he understands but that will make it hurt so much worse if he does uniparty stuff anyway. Fuck Ukraine. They are some military industrial complex grifting. We go and save like $1B throwing people off food stamps, maybe we cut 40B from Ukraine.. but those are drops in a bucket. Where is the rest? The real structural stuff. The time for just saying what we wanna hear has run out. That's my gripe. permalink parent award report block reply BigMikesChef 2 points 37 minutes ago They've let us down on everything thus far, why would that change? permalink parent award report block reply BigMikesChef 2 points 38 minutes ago The issue isn't her race. She's a democrat and a pagan. Pretty terrible influence to have in your leader's house. His next greatest influence is Thiel...not good omens. permalink parent award report block reply NonbinaryPotatohead 1 points 29 minutes ago He didn't write his book btw, its manufactured permalink parent award report block reply\nCocaineNewsome 2 points 55 minutes ago I like that he understands but that will make it hurt so much worse if he does uniparty stuff anyway. Fuck Ukraine. They are some military industrial complex grifting. We go and save like $1B throwing people off food stamps, maybe we cut 40B from Ukraine.. but those are drops in a bucket. Where is the rest? The real structural stuff. The time for just saying what we wanna hear has run out. That's my gripe. permalink parent award report block reply BigMikesChef 2 points 37 minutes ago They've let us down on everything thus far, why would that change? permalink parent award report block reply\nBigMikesChef 2 points 37 minutes ago They've let us down on everything thus far, why would that change? permalink parent award report block reply\nBigMikesChef 2 points 38 minutes ago The issue isn't her race. She's a democrat and a pagan. Pretty terrible influence to have in your leader's house. His next greatest influence is Thiel...not good omens. permalink parent award report block reply\nNonbinaryPotatohead 1 points 29 minutes ago He didn't write his book btw, its manufactured permalink parent award report block reply\nRedStoneDeepState -16 points 2 hours ago Racist incel permalink parent award report block reply TPMJB 7 points 2 hours ago Do you think your words have power over us, golem? permalink parent award report block reply RedStoneDeepState -13 points 1 hour ago Yes you fucking loser. permalink parent award report block reply TPMJB 4 points 1 hour ago I make more than you and your AIPAC/JIDF bucks. So if I'm a loser, that makes you...lower than that? permalink parent award report block reply view 3 more comments... RizzlieDoodad 2 points 39 minutes ago I've been called a Nazi by my own father. You think this means anything? permalink parent award report block reply RedStoneDeepState 1 points 26 minutes ago Lol permalink parent award report block reply\nTPMJB 7 points 2 hours ago Do you think your words have power over us, golem? permalink parent award report block reply RedStoneDeepState -13 points 1 hour ago Yes you fucking loser. permalink parent award report block reply TPMJB 4 points 1 hour ago I make more than you and your AIPAC/JIDF bucks. So if I'm a loser, that makes you...lower than that? permalink parent award report block reply view 3 more comments...\nRedStoneDeepState -13 points 1 hour ago Yes you fucking loser. permalink parent award report block reply TPMJB 4 points 1 hour ago I make more than you and your AIPAC/JIDF bucks. So if I'm a loser, that makes you...lower than that? permalink parent award report block reply view 3 more comments...\nTPMJB 4 points 1 hour ago I make more than you and your AIPAC/JIDF bucks. So if I'm a loser, that makes you...lower than that? permalink parent award report block reply view 3 more comments...\nRizzlieDoodad 2 points 39 minutes ago I've been called a Nazi by my own father. You think this means anything? permalink parent award report block reply RedStoneDeepState 1 points 26 minutes ago Lol permalink parent award report block reply\nRedStoneDeepState 1 points 26 minutes ago Lol permalink parent award report block reply\nAgnosticTemplar 9 points 3 hours ago Ukraine is just a grift politicans use to launder money, none of them give a shit about the actual country or it's people. Israel, on the other hand, we have politicans who have sworn fealty to that country and place its security and prosperity well above that of the US. permalink award report block reply SwedishChainsaw2 2 points 2 hours ago Ukraine is the actual homeland of the modern \"jew\". We should returm them there. permalink parent award report block reply AgnosticTemplar 0 points 2 hours ago No, they don't deserve a homeland. permalink parent award report block reply\nSwedishChainsaw2 2 points 2 hours ago Ukraine is the actual homeland of the modern \"jew\". We should returm them there. permalink parent award report block reply AgnosticTemplar 0 points 2 hours ago No, they don't deserve a homeland. permalink parent award report block reply\nAgnosticTemplar 0 points 2 hours ago No, they don't deserve a homeland. permalink parent award report block reply\nTPMJB 8 points 1 hour ago Lol okay Vance, now do the H1B program. permalink award report block reply\nnakedjay 5 points 1 hour ago He's talking about Isreal right? permalink award report block reply\nmagamagamaga123 5 points 3 hours ago Democrat response to claims of being left behind:  learn to code. permalink award report block reply\nkeeptherepublic1776 5 points 2 hours ago I don't trust Vance. permalink award report block reply f_bastiat 1 points 1 hour ago He speaks well and has the verifiable backstory like Trump. I'm 80% sure we know what we are getting and if anything he is holding back being more MAGA for the sake of appearing less chaotic than Trump when 2028 rolls around. He really seems like someone who after enough beers would be hosting an impromptu episode of InfoWars at the bar. permalink parent award report block reply IvotedforTrumptwice 4 points 1 hour ago If he’s not MAGA, then he’s an incredible actor and has done a great job of covering up and making up his true history. permalink parent award report block reply Imnotnorm 0 points 29 minutes ago Yes those things are true unfortunately.  He's savvy. He gets the internet. He'll know the right thing to say. He won't get the trust back. He's toast already permalink parent award report block reply EyesSewnShut 1 points 22 minutes ago Comment removed by community moderators. permalink parent award report block reply\nf_bastiat 1 points 1 hour ago He speaks well and has the verifiable backstory like Trump. I'm 80% sure we know what we are getting and if anything he is holding back being more MAGA for the sake of appearing less chaotic than Trump when 2028 rolls around. He really seems like someone who after enough beers would be hosting an impromptu episode of InfoWars at the bar. permalink parent award report block reply IvotedforTrumptwice 4 points 1 hour ago If he’s not MAGA, then he’s an incredible actor and has done a great job of covering up and making up his true history. permalink parent award report block reply Imnotnorm 0 points 29 minutes ago Yes those things are true unfortunately.  He's savvy. He gets the internet. He'll know the right thing to say. He won't get the trust back. He's toast already permalink parent award report block reply EyesSewnShut 1 points 22 minutes ago Comment removed by community moderators. permalink parent award report block reply\nIvotedforTrumptwice 4 points 1 hour ago If he’s not MAGA, then he’s an incredible actor and has done a great job of covering up and making up his true history. permalink parent award report block reply Imnotnorm 0 points 29 minutes ago Yes those things are true unfortunately.  He's savvy. He gets the internet. He'll know the right thing to say. He won't get the trust back. He's toast already permalink parent award report block reply EyesSewnShut 1 points 22 minutes ago Comment removed by community moderators. permalink parent award report block reply\nImnotnorm 0 points 29 minutes ago Yes those things are true unfortunately.  He's savvy. He gets the internet. He'll know the right thing to say. He won't get the trust back. He's toast already permalink parent award report block reply\nEyesSewnShut 1 points 22 minutes ago Comment removed by community moderators. permalink parent award report block reply\nSteveRogers42 4 points 58 minutes ago Is he talking about India? Or Israel? Just asking. permalink award report block reply\nWanderingStar 1 points 6 minutes ago If he means by \"other countries\" - H1B's, work visas and foreign aid, I'm good with that but nothing less. permalink award report block reply\nPillarOfWisdom 0 points 22 minutes ago Zelensky?  He pales in comparison to Netanyahu. permalink award report block reply\nImnotnorm -1 points 31 minutes ago There's nothing vance can do at this point to win in 2028. We know he's savvy. We know that he gets the internet and knows the right things to say. Not enough people will believe he's sincere about it. Shouldnt have licked the wall bro. permalink award report block reply\nDarkpoisonousshaddow 2 points 3 hours ago Comment removed by community moderators. permalink award report block reply\nEyesSewnShut 1 points 24 minutes ago Comment removed by community moderators. permalink award report block reply"}