{"id": "1ARK54SUZ1", "contents": "411 🎖️ 100-Year-Old Veteran on Live TV: We Fought WW2 for Nothing, Britain Less Free Than in 1945 ⛓️ YES posted 5 days ago by MythArcana 8 comments award share download report block\n8 comments Sort by Top Top New Worst Old Save DManthey 12 points 5 days ago He is completely correct. permalink award report block reply Cuetardian 8 points 5 days ago It's your king and  your prime minister, sir. They are both fully supportive of the muslim takeover of the UK. permalink award report block reply TheGoyimWhisperer 1 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply Awakened 4 points 5 days ago Hitler pointing and laughing at Churchill right now as their daily demon ass rape in Hell continues. permalink award report block reply MythArcana OP 3 points 5 days ago Archive Link : https://archive.ph/TGv1L Direct Link : https://www.breitbart.com/europe/2025/11/07/100-year-old-veteran-on-live-tv-we-fought-ww2-for-nothing/ Pepe Link : 🐸👌 permalink award report block reply SubmarineGuy 2 points 5 days ago Enoch Powell saw it all coming in his 1968 Rivers Of Blood speech. https://en.wikipedia.org/wiki/Rivers_of_Blood_speech permalink award report block reply Front_Line_Assembly 2 points 5 days ago When does his hate-speech trial begin? permalink award report block reply TheGoyimWhisperer 4 points 5 days ago Comment removed upon the user being banned. permalink award report block reply\nDManthey 12 points 5 days ago He is completely correct. permalink award report block reply\nCuetardian 8 points 5 days ago It's your king and  your prime minister, sir. They are both fully supportive of the muslim takeover of the UK. permalink award report block reply TheGoyimWhisperer 1 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply\nTheGoyimWhisperer 1 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply\nAwakened 4 points 5 days ago Hitler pointing and laughing at Churchill right now as their daily demon ass rape in Hell continues. permalink award report block reply\nMythArcana OP 3 points 5 days ago Archive Link : https://archive.ph/TGv1L Direct Link : https://www.breitbart.com/europe/2025/11/07/100-year-old-veteran-on-live-tv-we-fought-ww2-for-nothing/ Pepe Link : 🐸👌 permalink award report block reply\nSubmarineGuy 2 points 5 days ago Enoch Powell saw it all coming in his 1968 Rivers Of Blood speech. https://en.wikipedia.org/wiki/Rivers_of_Blood_speech permalink award report block reply\nFront_Line_Assembly 2 points 5 days ago When does his hate-speech trial begin? permalink award report block reply\nTheGoyimWhisperer 4 points 5 days ago Comment removed upon the user being banned. permalink award report block reply"}