{"id": "1ARK9hiYGV", "contents": "949 The Handmaid’s Tale women are no longer just protesting for abortion. They’re now carrying Mexican flags at ICE detention facilities. 🤡🌎  HONK  HONK  🌎🤡 posted 2 days ago by deletedandreacted 132 comments award share report block johnny maga @_johnnymaga • 2d The Handmaid’s Tale women are no longer just protesting for abortion. They’re now carrying Mexican flags at ICE detention facilities. Please make it stop.\n132 comments Sort by Top Top New Worst Old Save TheRedPike 64 points 2 days ago So their performative erotic fiction is now about immigration?  Did they even read the book or just skip to the warm bath, candles and personal time part? permalink award report block reply SteelBallRun1890 60 points 2 days ago I've said it on here before, it's 100% a sexual fetish to these people. Part of it is even the protesting against it, the fantasy of being forced into sex and pregnancy. They pretend to hate it but secretly crave it. It's also why most of the woman that read the book and do these odd displays are over 50, they know they will never actually get the chance for it to happen. permalink parent award report block reply TheMostUselessFeeder 32 points 2 days ago I like how every single one just assumes they would actually be the handmaidens instead of the grey-wearing furniture tier caste of menials too, kek permalink parent award report block reply Apersonofinterest 18 points 2 days ago Ain’t nobody wanna put a baby in you you fat nasty cankle sore. permalink parent award report block reply goldkeyboardwarrior 13 points 2 days ago The fertile women were the ones forced into being handmaids so the ones with their eggs dried up are fooling themselves when they wear that costume. permalink parent award report block reply imnotdeadyet 10 points 2 days ago Ugly bitch Cosplay! permalink parent award report block reply view 1 more comments... AmericanJawa 7 points 2 days ago How many of them have ever actually read any of those books they base their propaganda off of? permalink parent award report block reply mikethemarine 23 points 2 days ago Funny that the media says 30 people protesting is a sea of people, and when we protested the 2020 election with 2 million people, it was just a few thousand people causing an insurrection in D.C. on J6th. We don't hate the propaganda media enough permalink parent award report block reply yukondave 5 points 2 days ago It is time for Trump to hold another rally on January 6th in D.C. this year on the steps of the Capital again.  We need to show we can be back in the streets again. permalink parent award report block reply SaltyTitties4 4 points 2 days ago True, and it’s even worse than that, bc most people on here will suddenly believe the media when it says something they want. permalink parent award report block reply glow-operator-2-0 1 points 2 days ago Liars are potent, until their tongues are removed. permalink parent award report block reply SaltyPyrate 8 points 2 days ago Hm, that seems to explain the bizarre anti-survival instincts to support letting in infinite 3rd worlders from countries with actual rape cultures. permalink parent award report block reply Transparency 1 points 2 days ago Black Pigeon Speaks: \"Why women destroy nations and civilizations\" Well worth the 19mins. 2016, but you'll think it was published yesterday. permalink parent award report block reply GatoradeJeb 7 points 2 days ago Its more so hatred of White man driving this. Its why there are so many race traitor White woman mudsharking permalink parent award report block reply Transparency 3 points 2 days ago Partially true. It's hate of men, generally, but it is currently \"White\" men, because White men are the actual power-base. They are out to destroy the power and take it for themselves. Yet as overgrown children they cannot handle actually having the power (as we see everywhere everyday). Black Pigeon Speaks: \"Why women destroy nations and civilizations\" Well worth the 19mins. 2016, but you'll think it was published yesterday. permalink parent award report block reply Friendly_B 3 points 2 days ago overgrown children Well God made women to be half-man, half-child on purpose.  It is for the positive perpetuation of mankind.\nBut if you mean \"intentionally developmentally stunted\" then that's a separate also true matter. permalink parent award report block reply goatnuts 5 points 2 days ago I'd be willing to bet most of these women have never read the book and only watched that shitty TV show that went on forever for no reason. \"Ooooh I almost excaped again!!\" permalink parent award report block reply load 3 more comments... booblitchutz 14 points 2 days ago The Handmaids Tale is rape fantasy erotica for deeply self loathing liberal women. permalink parent award report block reply Transparency 3 points 2 days ago The Handmaids Tale is rape fantasy erotica for deeply self loathing liberal women. BINGO!, but it's for MOST women, not just \"deeply self loathing liberal women\". Rape/forced sex is the #1 female fantasy. permalink parent award report block reply booblitchutz 3 points 2 days ago But the context of this fantasy appeals particularly to liberal woman. A well adjusted conservative woman would not get off on the idea of being a forced baby maker for rich white christian men. permalink parent award report block reply Transparency 0 points 2 days ago Yeah, uh, you're wrong. Keep your little fantasy, but it's not reality. 🤦‍♂️ permalink parent award report block reply view 3 more comments... GatoradeJeb 0 points 2 days ago And race traitor White woman who racemix/nudshakr with browns/blacks is theme enqcting this garbage irl permalink parent award report block reply NotYourMan 9 points 2 days ago This is the feminist cult at work.  The feminist cult is a group of women loyal to the democrat party and they do what the party tells them.  They will always vote democrat because its part of the cult. permalink parent award report block reply Rockfish 2 points 2 days ago I thought it was the Democratic Party? permalink parent award report block reply Spiritof2015 4 points 2 days ago The Handmaid’s Tale could be about Islam. permalink parent award report block reply Transparency 2 points 2 days ago The Handmaid’s Tale could be about Islam. The White man's version of the burka IS too kind. permalink parent award report block reply Transparency 1 points 2 days ago Did they even read the book or just skip to the warm bath, candles and personal time part? They just skipped to the part where they're brood mares for the State. permalink parent award report block reply load 3 more comments... FORMERCHILDSTAR 37 points 2 days ago They're getting acclimated to wearing a burka, I see. permalink award report block reply VanStiggles 13 points 2 days ago The irony is they think it's about Christianity, but I'm pretty sure the author based it on islam and the fall of Iran. permalink parent award report block reply Transparency 3 points 2 days ago The White man's version of the burka IS too kind. permalink parent award report block reply PenguinOfDoom 20 points 2 days ago End all school Drama programs now. permalink award report block reply booblitchutz 5 points 2 days ago Restart the bullying programs now. permalink parent award report block reply AmericanJawa 1 points 2 days ago Restart the bullying programs now. You don't need bullying programs, kids find reasons to be mean to each other on their own. permalink parent award report block reply booblitchutz 2 points 2 days ago You may not have a child in public school, or you grew up in a time after the \"zero tolerance for bullying\" push started so it just seems normal to you. I grew up in the 80s and have a kid in high school now. I assure you the difference between bullying then and \"bullying\" now is pretty stark. Bullying in the 80s was mostly physical. In very rare circumstances, the violence was severe - but most of the time it was minor. Nowadays it's all \"virtual\" bullying and it never stops. I'd argue it is worse. permalink parent award report block reply Transparency -1 points 2 days ago That is what it is going to take, but today they are still way too protected by all the White Knight pussy-begging simps. (+ the Law, Courts, media, etc) permalink parent award report block reply Callsign_Fox1 1 points 2 days ago Comment removed by community filter, pending further review. permalink parent award report block reply 0111000001100101 2 points 2 days ago Actors were considered lacking of the human spirit when they first emerged in the ancient world. permalink parent award report block reply OldGloryUnfurled 16 points 2 days ago Hur durr... we have a uniform together. We are mimicking some irrelevancy from history. We are making a difference. permalink award report block reply rebuildingMyself 6 points 2 days ago What's more cringe. This or the pussy hat marches permalink parent award report block reply OldGloryUnfurled 1 points 2 days ago Why not both? permalink parent award report block reply Transparency 1 points 2 days ago Why not both? It is both, just in opposite directions, yet they are both still 2-sides of the exact same coin. permalink parent award report block reply DingleBalls 15 points 2 days ago Well now we know who they have fantasies about being ravished by permalink award report block reply booblitchutz 8 points 2 days ago That’s the whole point of the book. It’s a rape fantasy. The author plays into liberal women’s hate of religion and creates a fantasy world where they are sex slaves for wealthy white Christian men, whom they hate most. The fantasy of being humiliated so deeply while being held down by the man’s older (and supposedly less attractive) wife is extremely titillating for them. It’s the same impulse as men who fantasize about being sexually dominated in the most humiliating way: in the butt while dressed as a woman. permalink parent award report block reply Burneraccountno4 4 points 2 days ago while being held down by the man’s older (and supposedly less attractive) wife They are that wife. The low fertility rate among white liberal women proves it. permalink parent award report block reply Lurker6 2 points 2 days ago I don't even think I could impregnate my beautiful wife if one of these chuds was even in the same room as us and I've done it 6 times. permalink parent award report block reply GatoradeJeb 3 points 2 days ago Its also why white woman oush rwcemixing propaganda in hollyworf so hard with White woman with jogger/wetback in all tv/movies/ads. Its to humiliate White man as we are forced to watch our own woman betray us to racemix with brown turds permalink parent award report block reply Seeker_17 11 points 2 days ago LOL. Send in the muzzie rape gangs. permalink award report block reply Transparency 4 points 2 days ago You'll NOT threaten THEM with a Good Time! permalink parent award report block reply TooBright 6 points 2 days ago Jokes on them, I never read their beloved fiction. permalink award report block reply lifeisahologram 11 points 2 days ago They didn’t either, they bought the book, read a chapter at a coffee shop, took some selfies reading it, posted it on Instagram, then watched the tv show, and then tell people it’s their favorite book. permalink parent award report block reply indigo_truther 5 points 2 days ago I didn't either but I doubt there is anything there about protesting for illegal aliens permalink parent award report block reply GallowsTime 3 points 2 days ago A Modest Proposal is much more worth your time. permalink parent award report block reply coinneach007 6 points 2 days ago And yet they will gladly side with the religion that is the most oppressive against women! permalink award report block reply Transparency 6 points 2 days ago That's all the evidence you need to know that women belong in the kitchen. permalink parent award report block reply GatoradeJeb 5 points 2 days ago Worse they will racemix woth the brown scum while attacking White man permalink parent award report block reply Lightning 5 points 2 days ago The “Uni-Cause.” They don’t actually have any truly held beliefs. They just protest what they’re told to protest. permalink award report block reply ChrisSuperDude 5 points 2 days ago Within the lore of Handmaidens Tale, the handmaidens were young, fertile and beautiful women. You women have absolutely nothing to worry about and would not be wearing those red burkas if we lived in that world. permalink award report block reply PapaPepe 5 points 2 days ago The neo KKK permalink award report block reply RuprechtThaMonkeyBoy 4 points 2 days ago Red KKK Commies permalink parent award report block reply GatoradeJeb 1 points 2 days ago Stop insulting the KKK like that. They wouldnt have been defending blm or mexicans, nor would kkk have endorsed racemix.\nThese are racetraitor communists permalink parent award report block reply Oodles 5 points 2 days ago Women are driven by emotion and are easily manipulated via threat of ostracism by other women They should not be allowed to vote or be put in charge of anything permalink award report block reply Aquamine-Amarine 1 points 2 days ago Why doesn't the right manipulate them into voting conservatively then? Instead of trying to steal their right to vote. If they're so easily manipulated, then it shouldn't be hard. permalink parent award report block reply Transparency 4 points 2 days ago Their nature is conformance (security) combined with being anti-establishment (rebellion). First thing to understand about women is that their brains can easily hold disassociated thought processes without any cognitive dissonance. That's why they often don't make sense and frequently fail at logic. Plus, conformance + scatterbrained leads them to think too much while not actually thinking at all. The more women that go in 1 direction... the more women that follow. So, say the muslims took over, killed all these White Knight pussy-begging simps, and started harassing and beating the women to get them inline... in short order: more and more women would start getting inline without having to be harassed or beaten. Of course, they would not be allowed to vote, but that is irrelevant to the point. Just look at Afghanistan after  the US withdrawal: Women complained and cried out for help, but, ultimately, they got their asses inline and obeyed. Why doesn't the right manipulate them into voting conservatively then? The short answer is: Because men let feminism go waaaaaay too far. Why? Because with prosperity men were more focused on fucking the women, than running and protecting the culture/society. permalink parent award report block reply Oodles 3 points 2 days ago Because they are also gullible, emotional, innumerate, and filled with suicidal empathy, whereas the right runs on logic and facts The right pitches You have to work hard to get what you want and people who do not work hard will not get everything they want The left pitches The government will give everything to everyone, so even the dumbest, laziest, criminal will get everything they want so they won’t be a criminal anymore Which pitch do you think is the most attractive to the emotionally manipulatable demographic? permalink parent award report block reply GatoradeJeb 1 points 2 days ago If trump was real and not controlled he would have banned racemixing permalink parent award report block reply BecauseYoudBeInJail 5 points 2 days ago RAPE ME HARDER PAPI permalink award report block reply Psarg 5 points 2 days ago I can smell the cat piss permalink award report block reply MythArcana 5 points 2 days ago So, they want more rape is what they're saying. permalink award report block reply Transparency 2 points 2 days ago Yes. permalink parent award report block reply DlanOdcammron 4 points 2 days ago TIL Sydney Sweeney was on that show 🤣 permalink award report block reply lifeisahologram 7 points 2 days ago Damn was she one of the characters that the government assigns you to breed? Sign me up. permalink parent award report block reply IvIA6A 4 points 2 days ago So dumb, 😂 It's like gays for Palestine. permalink award report block reply Bullwinkle 4 points 2 days ago Truly AWFL permalink award report block reply aloha_snackbar22 3 points 2 days ago These retarded cunts vote. permalink award report block reply XXNNOES 3 points 2 days ago Needs more \"Islam is right about women\" counter protesters just to blow their gaskets and break their brains. LOL permalink award report block reply CocaineNewsome 3 points 2 days ago What's keeping them from moving? permalink award report block reply SaltyTitties4 3 points 2 days ago We’ve already been through this one.  Remember when everyone forgot about the blue and yellow flag and suddenly took up the Mexican flag? permalink award report block reply rebuildingMyself 3 points 2 days ago And they happily vote for Muslims to come in and, with enough numbers, put women in black cloaks instead of red. permalink award report block reply thisisatestof2 3 points 2 days ago All NPCs permalink award report block reply True_Curmudgeon 3 points 2 days ago Then he said to the woman, “I will sharpen the pain of your pregnancy, and in pain you will give birth. And you will desire to control your husband, but he will rule over you.” It's right there in the second half of that verse women being so damn contrary is written right into the curse. It's right there in a woman's psychology to destroy her man and embrace that which destroys him unless he rules over her in a godly manner. permalink award report block reply Transparency 2 points 2 days ago Women are hard wired for it. Feminism does not create these monsters, it merely removes their shackles and opens their cages allowing them to be what they truly are. All with the help of their White Knight pussy-begging simps. permalink parent award report block reply True_Curmudgeon 2 points 2 days ago Exactly my man! And a culture where good men can rule over them in a godly manner this would be prevented. However in our culture these things are illegal and in no way supported by society. permalink parent award report block reply Stormeyworld13 3 points 2 days ago Deport them to Mexico with the drug cartels and don't let them come back! They love their illegals then let them go live with them. permalink award report block reply brutustyberius 2 points 2 days ago Glad to see patriotfront back in the mix. I love the new unit’s! permalink award report block reply Unboosted 2 points 2 days ago I wonder how many are eggless or single mothers permalink award report block reply orangelineman 2 points 2 days ago This is like the \"LGBTQ for Palestine\" movement. Do they know that the dystopia of Handmaid's Tale most closely resembles countries that are ruled by a certain Religion of Peace? permalink award report block reply elgordo 2 points 2 days ago Dammit! I was going to go to this protest but Amazon was all sold out of the XXXX-Large costumes! permalink award report block reply deleted 2 points 2 days ago Transparency 2 points 2 days ago Attention It IS female currency. permalink parent award report block reply DJT_MFers1 2 points 2 days ago Cool red burkas!! permalink award report block reply GallowsTime 2 points 2 days ago I don't remember that in the book.  Talk about losing the plot. permalink award report block reply RustySheckelford 2 points 2 days ago I'm so sick of these cringey ass traitors fighting for foreigners instead of  their fellow Americans permalink award report block reply wmmiv2016v2 2 points 2 days ago Liberal women are retarded and/or insane. permalink award report block reply FusionBlack 2 points 2 days ago This sums this insanity up nicely. https://www.youtube.com/watch?v=QVTiRVbdIxA permalink award report block reply Owmyballz 2 points 2 days ago Figure out what NGO is paying for their uniforms.  Then figure out how much China is funding the NGO and shut it down as a foreign actor, which it damn well fucking is. permalink award report block reply Chickapede 2 points 2 days ago Ahh Mexico.  I remember living there and being told that poor women on the delivery table had pain killers withheld until they signed permission to be sterilized after delivery.  Such choice!  So respectful of women!  Eye roll.... permalink award report block reply Oldman1234 2 points 2 days ago Proving once again that some people will do anything for money. permalink award report block reply Chickapede 2 points 2 days ago I remember back in about 1984 or 1985 when that stupid book started being forced on new students at the state college I went to for their compulsory introductory Freshman English class.  I purposefully never read it.  This has been a long slow curve coming. permalink award report block reply Transparency 2 points 2 days ago The White man's version of the burka IS too kind. permalink award report block reply ParadigmShift2070 2 points 2 days ago I support their cause of aborting Mexicans. permalink award report block reply jiminycricket1941 2 points 2 days ago I’ve never watched the show but at this point I’m starting to believe whatever the people inside the show were making the women do, it was probably a good thing. So without even knowing anything about this show, I’ll bet we should do it. permalink award report block reply Smurfection 1 points 2 days ago Margaret Atwood denies it now but in the 1980's she said that Gilead (The dysfunction nation controlling the former U.S. in the book)  wasn't based on what Christians believe or do to women but rather on the Iranian regime.    She started saying after the show came out that Gilead is reflective of what Trump and MAGA want.  The left literally told itself a horror story based on a fundamentalist regime that rose up after a leftist Soviet backed revolution and tried to blame it on people who opposed the leftist revolution, opposed the USSR Breshnev doctrine, opposed gender apartheid in from  totally different country with a totally different civilization and now play theatrics based on a total reversal of objective reality. permalink award report block reply Freedomnuggs 1 points 2 days ago Women on the left are cringelords permalink award report block reply Gildoom 1 points 2 days ago Is this the left's version of the Patriot Front?  I mean it is so optically retarded it just what huh what? permalink award report block reply boomerbutnotOKBoomer 1 points 2 days ago Still don't understand how they don't realize this was a fictional story that was actually partly about MUSLIM WOMEN IN BURKAS!!!! They pretend this is what Republican/Conservative women want. Yah, no. Hell no. Unless it will help me conceal a gun larger than my 45. I guess I could conceal a 30 ought six or my 20 ga. This really just shows that liberal women are really really really stupid and don't understand the world. I say we pull up a bus, load them all on it and drive the bus right into a 747 Dreamlifter and take them to Mogadishu or Liberia for a weeklong \"training\" on the realities of the world they think is so much better than the US. Question for Libtards: If the US is so bad, why are so many people trying to sneak in? And why aren't they sneaking in to Me-Hee-ko? permalink award report block reply Metriz77 1 points 2 days ago Send them to El Salvador. permalink award report block reply AmericanJawa 1 points 2 days ago The \"Handmaid’s Tale women\" were never anything more than propaganda. permalink award report block reply Trump454748 1 points 2 days ago Since they are against deportations, each of these “women” should be assigned their very own “migrant” which they will be 100% responsible for, and l will stock up on popcorn. permalink award report block reply Viewer01 1 points 2 days ago How do we convince these hoes to abort illegals? Seems self solving problem. permalink award report block reply Dev404 1 points 2 days ago Deport them all to the destination those illegals are going. They can be with their beloved criminals and get culturally enriched over there. permalink award report block reply f_bastiat 1 points 2 days ago Gay, completely gay. permalink award report block reply NonbinaryPotatohead 1 points 2 days ago What about Guatemala? permalink award report block reply 26magarat 1 points 2 days ago I wonder what Margaret Atwood thinks? If she's still alive. permalink award report block reply Transparency 1 points 2 days ago https://communities.win/c/TheDonald/p/1ARK9hiYGV/the-handmaids-tale-women-are-no-/c/4eXu1vd21yc permalink parent award report block reply FrankDuncan 1 points 2 days ago I will punch these bitches if I see them.. so tired of this dumb shit permalink award report block reply PhantomShield72 1 points 2 days ago Will they change to black hoods & robes when they travel to NYC? permalink award report block reply bluewhiteandred 1 points 2 days ago rebels without a cause permalink award report block reply Skabliggum2 1 points 2 days ago Wow, Patriot Front looking way different permalink award report block reply worldowedexplanation 1 points 2 days ago Stop giving these retards attention and just arrest them permalink award report block reply donteatthat 1 points 2 days ago Fucking clowns. permalink award report block reply Keep_on_winning_kag 1 points 2 days ago They just need the gold hammer and sickles on the backs and they are good for NYC. permalink award report block reply Aquamine-Amarine -1 points 2 days ago 18+ years of public school brainwashing. Are you people going to fix it? No, you'll just keep bitching about it and conveniently not mention the stupid stuff leftist men do, who also vote by the way. Almost like sex isn't the issue, it's leftism. But no, let's not talk about that... women bad. permalink award report block reply MasterChief08 2 points 2 days ago 70% of women under 25 are Democrats. permalink parent award report block reply Transparency 1 points 2 days ago Well, they say that if you are young and not Liberal you do not have a heart (the curse of youthful idealism), but if you are old and are not Conservative, then you do not have a brain permalink parent award report block reply Transparency 1 points 2 days ago the stupid stuff leftist men do \"The stupid[est] [thing] leftist men do\" is support feminism. permalink parent award report block reply\nTheRedPike 64 points 2 days ago So their performative erotic fiction is now about immigration?  Did they even read the book or just skip to the warm bath, candles and personal time part? permalink award report block reply SteelBallRun1890 60 points 2 days ago I've said it on here before, it's 100% a sexual fetish to these people. Part of it is even the protesting against it, the fantasy of being forced into sex and pregnancy. They pretend to hate it but secretly crave it. It's also why most of the woman that read the book and do these odd displays are over 50, they know they will never actually get the chance for it to happen. permalink parent award report block reply TheMostUselessFeeder 32 points 2 days ago I like how every single one just assumes they would actually be the handmaidens instead of the grey-wearing furniture tier caste of menials too, kek permalink parent award report block reply Apersonofinterest 18 points 2 days ago Ain’t nobody wanna put a baby in you you fat nasty cankle sore. permalink parent award report block reply goldkeyboardwarrior 13 points 2 days ago The fertile women were the ones forced into being handmaids so the ones with their eggs dried up are fooling themselves when they wear that costume. permalink parent award report block reply imnotdeadyet 10 points 2 days ago Ugly bitch Cosplay! permalink parent award report block reply view 1 more comments... AmericanJawa 7 points 2 days ago How many of them have ever actually read any of those books they base their propaganda off of? permalink parent award report block reply mikethemarine 23 points 2 days ago Funny that the media says 30 people protesting is a sea of people, and when we protested the 2020 election with 2 million people, it was just a few thousand people causing an insurrection in D.C. on J6th. We don't hate the propaganda media enough permalink parent award report block reply yukondave 5 points 2 days ago It is time for Trump to hold another rally on January 6th in D.C. this year on the steps of the Capital again.  We need to show we can be back in the streets again. permalink parent award report block reply SaltyTitties4 4 points 2 days ago True, and it’s even worse than that, bc most people on here will suddenly believe the media when it says something they want. permalink parent award report block reply glow-operator-2-0 1 points 2 days ago Liars are potent, until their tongues are removed. permalink parent award report block reply SaltyPyrate 8 points 2 days ago Hm, that seems to explain the bizarre anti-survival instincts to support letting in infinite 3rd worlders from countries with actual rape cultures. permalink parent award report block reply Transparency 1 points 2 days ago Black Pigeon Speaks: \"Why women destroy nations and civilizations\" Well worth the 19mins. 2016, but you'll think it was published yesterday. permalink parent award report block reply GatoradeJeb 7 points 2 days ago Its more so hatred of White man driving this. Its why there are so many race traitor White woman mudsharking permalink parent award report block reply Transparency 3 points 2 days ago Partially true. It's hate of men, generally, but it is currently \"White\" men, because White men are the actual power-base. They are out to destroy the power and take it for themselves. Yet as overgrown children they cannot handle actually having the power (as we see everywhere everyday). Black Pigeon Speaks: \"Why women destroy nations and civilizations\" Well worth the 19mins. 2016, but you'll think it was published yesterday. permalink parent award report block reply Friendly_B 3 points 2 days ago overgrown children Well God made women to be half-man, half-child on purpose.  It is for the positive perpetuation of mankind.\nBut if you mean \"intentionally developmentally stunted\" then that's a separate also true matter. permalink parent award report block reply goatnuts 5 points 2 days ago I'd be willing to bet most of these women have never read the book and only watched that shitty TV show that went on forever for no reason. \"Ooooh I almost excaped again!!\" permalink parent award report block reply load 3 more comments... booblitchutz 14 points 2 days ago The Handmaids Tale is rape fantasy erotica for deeply self loathing liberal women. permalink parent award report block reply Transparency 3 points 2 days ago The Handmaids Tale is rape fantasy erotica for deeply self loathing liberal women. BINGO!, but it's for MOST women, not just \"deeply self loathing liberal women\". Rape/forced sex is the #1 female fantasy. permalink parent award report block reply booblitchutz 3 points 2 days ago But the context of this fantasy appeals particularly to liberal woman. A well adjusted conservative woman would not get off on the idea of being a forced baby maker for rich white christian men. permalink parent award report block reply Transparency 0 points 2 days ago Yeah, uh, you're wrong. Keep your little fantasy, but it's not reality. 🤦‍♂️ permalink parent award report block reply view 3 more comments... GatoradeJeb 0 points 2 days ago And race traitor White woman who racemix/nudshakr with browns/blacks is theme enqcting this garbage irl permalink parent award report block reply NotYourMan 9 points 2 days ago This is the feminist cult at work.  The feminist cult is a group of women loyal to the democrat party and they do what the party tells them.  They will always vote democrat because its part of the cult. permalink parent award report block reply Rockfish 2 points 2 days ago I thought it was the Democratic Party? permalink parent award report block reply Spiritof2015 4 points 2 days ago The Handmaid’s Tale could be about Islam. permalink parent award report block reply Transparency 2 points 2 days ago The Handmaid’s Tale could be about Islam. The White man's version of the burka IS too kind. permalink parent award report block reply Transparency 1 points 2 days ago Did they even read the book or just skip to the warm bath, candles and personal time part? They just skipped to the part where they're brood mares for the State. permalink parent award report block reply load 3 more comments...\nSteelBallRun1890 60 points 2 days ago I've said it on here before, it's 100% a sexual fetish to these people. Part of it is even the protesting against it, the fantasy of being forced into sex and pregnancy. They pretend to hate it but secretly crave it. It's also why most of the woman that read the book and do these odd displays are over 50, they know they will never actually get the chance for it to happen. permalink parent award report block reply TheMostUselessFeeder 32 points 2 days ago I like how every single one just assumes they would actually be the handmaidens instead of the grey-wearing furniture tier caste of menials too, kek permalink parent award report block reply Apersonofinterest 18 points 2 days ago Ain’t nobody wanna put a baby in you you fat nasty cankle sore. permalink parent award report block reply goldkeyboardwarrior 13 points 2 days ago The fertile women were the ones forced into being handmaids so the ones with their eggs dried up are fooling themselves when they wear that costume. permalink parent award report block reply imnotdeadyet 10 points 2 days ago Ugly bitch Cosplay! permalink parent award report block reply view 1 more comments... AmericanJawa 7 points 2 days ago How many of them have ever actually read any of those books they base their propaganda off of? permalink parent award report block reply mikethemarine 23 points 2 days ago Funny that the media says 30 people protesting is a sea of people, and when we protested the 2020 election with 2 million people, it was just a few thousand people causing an insurrection in D.C. on J6th. We don't hate the propaganda media enough permalink parent award report block reply yukondave 5 points 2 days ago It is time for Trump to hold another rally on January 6th in D.C. this year on the steps of the Capital again.  We need to show we can be back in the streets again. permalink parent award report block reply SaltyTitties4 4 points 2 days ago True, and it’s even worse than that, bc most people on here will suddenly believe the media when it says something they want. permalink parent award report block reply glow-operator-2-0 1 points 2 days ago Liars are potent, until their tongues are removed. permalink parent award report block reply SaltyPyrate 8 points 2 days ago Hm, that seems to explain the bizarre anti-survival instincts to support letting in infinite 3rd worlders from countries with actual rape cultures. permalink parent award report block reply Transparency 1 points 2 days ago Black Pigeon Speaks: \"Why women destroy nations and civilizations\" Well worth the 19mins. 2016, but you'll think it was published yesterday. permalink parent award report block reply GatoradeJeb 7 points 2 days ago Its more so hatred of White man driving this. Its why there are so many race traitor White woman mudsharking permalink parent award report block reply Transparency 3 points 2 days ago Partially true. It's hate of men, generally, but it is currently \"White\" men, because White men are the actual power-base. They are out to destroy the power and take it for themselves. Yet as overgrown children they cannot handle actually having the power (as we see everywhere everyday). Black Pigeon Speaks: \"Why women destroy nations and civilizations\" Well worth the 19mins. 2016, but you'll think it was published yesterday. permalink parent award report block reply Friendly_B 3 points 2 days ago overgrown children Well God made women to be half-man, half-child on purpose.  It is for the positive perpetuation of mankind.\nBut if you mean \"intentionally developmentally stunted\" then that's a separate also true matter. permalink parent award report block reply goatnuts 5 points 2 days ago I'd be willing to bet most of these women have never read the book and only watched that shitty TV show that went on forever for no reason. \"Ooooh I almost excaped again!!\" permalink parent award report block reply load 3 more comments...\nTheMostUselessFeeder 32 points 2 days ago I like how every single one just assumes they would actually be the handmaidens instead of the grey-wearing furniture tier caste of menials too, kek permalink parent award report block reply Apersonofinterest 18 points 2 days ago Ain’t nobody wanna put a baby in you you fat nasty cankle sore. permalink parent award report block reply goldkeyboardwarrior 13 points 2 days ago The fertile women were the ones forced into being handmaids so the ones with their eggs dried up are fooling themselves when they wear that costume. permalink parent award report block reply imnotdeadyet 10 points 2 days ago Ugly bitch Cosplay! permalink parent award report block reply view 1 more comments... AmericanJawa 7 points 2 days ago How many of them have ever actually read any of those books they base their propaganda off of? permalink parent award report block reply\nApersonofinterest 18 points 2 days ago Ain’t nobody wanna put a baby in you you fat nasty cankle sore. permalink parent award report block reply goldkeyboardwarrior 13 points 2 days ago The fertile women were the ones forced into being handmaids so the ones with their eggs dried up are fooling themselves when they wear that costume. permalink parent award report block reply imnotdeadyet 10 points 2 days ago Ugly bitch Cosplay! permalink parent award report block reply view 1 more comments...\ngoldkeyboardwarrior 13 points 2 days ago The fertile women were the ones forced into being handmaids so the ones with their eggs dried up are fooling themselves when they wear that costume. permalink parent award report block reply\nimnotdeadyet 10 points 2 days ago Ugly bitch Cosplay! permalink parent award report block reply view 1 more comments...\nAmericanJawa 7 points 2 days ago How many of them have ever actually read any of those books they base their propaganda off of? permalink parent award report block reply\nmikethemarine 23 points 2 days ago Funny that the media says 30 people protesting is a sea of people, and when we protested the 2020 election with 2 million people, it was just a few thousand people causing an insurrection in D.C. on J6th. We don't hate the propaganda media enough permalink parent award report block reply yukondave 5 points 2 days ago It is time for Trump to hold another rally on January 6th in D.C. this year on the steps of the Capital again.  We need to show we can be back in the streets again. permalink parent award report block reply SaltyTitties4 4 points 2 days ago True, and it’s even worse than that, bc most people on here will suddenly believe the media when it says something they want. permalink parent award report block reply glow-operator-2-0 1 points 2 days ago Liars are potent, until their tongues are removed. permalink parent award report block reply\nyukondave 5 points 2 days ago It is time for Trump to hold another rally on January 6th in D.C. this year on the steps of the Capital again.  We need to show we can be back in the streets again. permalink parent award report block reply\nSaltyTitties4 4 points 2 days ago True, and it’s even worse than that, bc most people on here will suddenly believe the media when it says something they want. permalink parent award report block reply glow-operator-2-0 1 points 2 days ago Liars are potent, until their tongues are removed. permalink parent award report block reply\nglow-operator-2-0 1 points 2 days ago Liars are potent, until their tongues are removed. permalink parent award report block reply\nSaltyPyrate 8 points 2 days ago Hm, that seems to explain the bizarre anti-survival instincts to support letting in infinite 3rd worlders from countries with actual rape cultures. permalink parent award report block reply Transparency 1 points 2 days ago Black Pigeon Speaks: \"Why women destroy nations and civilizations\" Well worth the 19mins. 2016, but you'll think it was published yesterday. permalink parent award report block reply\nTransparency 1 points 2 days ago Black Pigeon Speaks: \"Why women destroy nations and civilizations\" Well worth the 19mins. 2016, but you'll think it was published yesterday. permalink parent award report block reply\nGatoradeJeb 7 points 2 days ago Its more so hatred of White man driving this. Its why there are so many race traitor White woman mudsharking permalink parent award report block reply Transparency 3 points 2 days ago Partially true. It's hate of men, generally, but it is currently \"White\" men, because White men are the actual power-base. They are out to destroy the power and take it for themselves. Yet as overgrown children they cannot handle actually having the power (as we see everywhere everyday). Black Pigeon Speaks: \"Why women destroy nations and civilizations\" Well worth the 19mins. 2016, but you'll think it was published yesterday. permalink parent award report block reply Friendly_B 3 points 2 days ago overgrown children Well God made women to be half-man, half-child on purpose.  It is for the positive perpetuation of mankind.\nBut if you mean \"intentionally developmentally stunted\" then that's a separate also true matter. permalink parent award report block reply\nTransparency 3 points 2 days ago Partially true. It's hate of men, generally, but it is currently \"White\" men, because White men are the actual power-base. They are out to destroy the power and take it for themselves. Yet as overgrown children they cannot handle actually having the power (as we see everywhere everyday). Black Pigeon Speaks: \"Why women destroy nations and civilizations\" Well worth the 19mins. 2016, but you'll think it was published yesterday. permalink parent award report block reply Friendly_B 3 points 2 days ago overgrown children Well God made women to be half-man, half-child on purpose.  It is for the positive perpetuation of mankind.\nBut if you mean \"intentionally developmentally stunted\" then that's a separate also true matter. permalink parent award report block reply\nFriendly_B 3 points 2 days ago overgrown children Well God made women to be half-man, half-child on purpose.  It is for the positive perpetuation of mankind.\nBut if you mean \"intentionally developmentally stunted\" then that's a separate also true matter. permalink parent award report block reply\ngoatnuts 5 points 2 days ago I'd be willing to bet most of these women have never read the book and only watched that shitty TV show that went on forever for no reason. \"Ooooh I almost excaped again!!\" permalink parent award report block reply\nbooblitchutz 14 points 2 days ago The Handmaids Tale is rape fantasy erotica for deeply self loathing liberal women. permalink parent award report block reply Transparency 3 points 2 days ago The Handmaids Tale is rape fantasy erotica for deeply self loathing liberal women. BINGO!, but it's for MOST women, not just \"deeply self loathing liberal women\". Rape/forced sex is the #1 female fantasy. permalink parent award report block reply booblitchutz 3 points 2 days ago But the context of this fantasy appeals particularly to liberal woman. A well adjusted conservative woman would not get off on the idea of being a forced baby maker for rich white christian men. permalink parent award report block reply Transparency 0 points 2 days ago Yeah, uh, you're wrong. Keep your little fantasy, but it's not reality. 🤦‍♂️ permalink parent award report block reply view 3 more comments... GatoradeJeb 0 points 2 days ago And race traitor White woman who racemix/nudshakr with browns/blacks is theme enqcting this garbage irl permalink parent award report block reply\nTransparency 3 points 2 days ago The Handmaids Tale is rape fantasy erotica for deeply self loathing liberal women. BINGO!, but it's for MOST women, not just \"deeply self loathing liberal women\". Rape/forced sex is the #1 female fantasy. permalink parent award report block reply booblitchutz 3 points 2 days ago But the context of this fantasy appeals particularly to liberal woman. A well adjusted conservative woman would not get off on the idea of being a forced baby maker for rich white christian men. permalink parent award report block reply Transparency 0 points 2 days ago Yeah, uh, you're wrong. Keep your little fantasy, but it's not reality. 🤦‍♂️ permalink parent award report block reply view 3 more comments...\nbooblitchutz 3 points 2 days ago But the context of this fantasy appeals particularly to liberal woman. A well adjusted conservative woman would not get off on the idea of being a forced baby maker for rich white christian men. permalink parent award report block reply Transparency 0 points 2 days ago Yeah, uh, you're wrong. Keep your little fantasy, but it's not reality. 🤦‍♂️ permalink parent award report block reply view 3 more comments...\nTransparency 0 points 2 days ago Yeah, uh, you're wrong. Keep your little fantasy, but it's not reality. 🤦‍♂️ permalink parent award report block reply view 3 more comments...\nGatoradeJeb 0 points 2 days ago And race traitor White woman who racemix/nudshakr with browns/blacks is theme enqcting this garbage irl permalink parent award report block reply\nNotYourMan 9 points 2 days ago This is the feminist cult at work.  The feminist cult is a group of women loyal to the democrat party and they do what the party tells them.  They will always vote democrat because its part of the cult. permalink parent award report block reply Rockfish 2 points 2 days ago I thought it was the Democratic Party? permalink parent award report block reply\nRockfish 2 points 2 days ago I thought it was the Democratic Party? permalink parent award report block reply\nSpiritof2015 4 points 2 days ago The Handmaid’s Tale could be about Islam. permalink parent award report block reply Transparency 2 points 2 days ago The Handmaid’s Tale could be about Islam. The White man's version of the burka IS too kind. permalink parent award report block reply\nTransparency 2 points 2 days ago The Handmaid’s Tale could be about Islam. The White man's version of the burka IS too kind. permalink parent award report block reply\nTransparency 1 points 2 days ago Did they even read the book or just skip to the warm bath, candles and personal time part? They just skipped to the part where they're brood mares for the State. permalink parent award report block reply\nFORMERCHILDSTAR 37 points 2 days ago They're getting acclimated to wearing a burka, I see. permalink award report block reply VanStiggles 13 points 2 days ago The irony is they think it's about Christianity, but I'm pretty sure the author based it on islam and the fall of Iran. permalink parent award report block reply Transparency 3 points 2 days ago The White man's version of the burka IS too kind. permalink parent award report block reply\nVanStiggles 13 points 2 days ago The irony is they think it's about Christianity, but I'm pretty sure the author based it on islam and the fall of Iran. permalink parent award report block reply\nTransparency 3 points 2 days ago The White man's version of the burka IS too kind. permalink parent award report block reply\nPenguinOfDoom 20 points 2 days ago End all school Drama programs now. permalink award report block reply booblitchutz 5 points 2 days ago Restart the bullying programs now. permalink parent award report block reply AmericanJawa 1 points 2 days ago Restart the bullying programs now. You don't need bullying programs, kids find reasons to be mean to each other on their own. permalink parent award report block reply booblitchutz 2 points 2 days ago You may not have a child in public school, or you grew up in a time after the \"zero tolerance for bullying\" push started so it just seems normal to you. I grew up in the 80s and have a kid in high school now. I assure you the difference between bullying then and \"bullying\" now is pretty stark. Bullying in the 80s was mostly physical. In very rare circumstances, the violence was severe - but most of the time it was minor. Nowadays it's all \"virtual\" bullying and it never stops. I'd argue it is worse. permalink parent award report block reply Transparency -1 points 2 days ago That is what it is going to take, but today they are still way too protected by all the White Knight pussy-begging simps. (+ the Law, Courts, media, etc) permalink parent award report block reply Callsign_Fox1 1 points 2 days ago Comment removed by community filter, pending further review. permalink parent award report block reply 0111000001100101 2 points 2 days ago Actors were considered lacking of the human spirit when they first emerged in the ancient world. permalink parent award report block reply\nbooblitchutz 5 points 2 days ago Restart the bullying programs now. permalink parent award report block reply AmericanJawa 1 points 2 days ago Restart the bullying programs now. You don't need bullying programs, kids find reasons to be mean to each other on their own. permalink parent award report block reply booblitchutz 2 points 2 days ago You may not have a child in public school, or you grew up in a time after the \"zero tolerance for bullying\" push started so it just seems normal to you. I grew up in the 80s and have a kid in high school now. I assure you the difference between bullying then and \"bullying\" now is pretty stark. Bullying in the 80s was mostly physical. In very rare circumstances, the violence was severe - but most of the time it was minor. Nowadays it's all \"virtual\" bullying and it never stops. I'd argue it is worse. permalink parent award report block reply Transparency -1 points 2 days ago That is what it is going to take, but today they are still way too protected by all the White Knight pussy-begging simps. (+ the Law, Courts, media, etc) permalink parent award report block reply Callsign_Fox1 1 points 2 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nAmericanJawa 1 points 2 days ago Restart the bullying programs now. You don't need bullying programs, kids find reasons to be mean to each other on their own. permalink parent award report block reply booblitchutz 2 points 2 days ago You may not have a child in public school, or you grew up in a time after the \"zero tolerance for bullying\" push started so it just seems normal to you. I grew up in the 80s and have a kid in high school now. I assure you the difference between bullying then and \"bullying\" now is pretty stark. Bullying in the 80s was mostly physical. In very rare circumstances, the violence was severe - but most of the time it was minor. Nowadays it's all \"virtual\" bullying and it never stops. I'd argue it is worse. permalink parent award report block reply\nbooblitchutz 2 points 2 days ago You may not have a child in public school, or you grew up in a time after the \"zero tolerance for bullying\" push started so it just seems normal to you. I grew up in the 80s and have a kid in high school now. I assure you the difference between bullying then and \"bullying\" now is pretty stark. Bullying in the 80s was mostly physical. In very rare circumstances, the violence was severe - but most of the time it was minor. Nowadays it's all \"virtual\" bullying and it never stops. I'd argue it is worse. permalink parent award report block reply\nTransparency -1 points 2 days ago That is what it is going to take, but today they are still way too protected by all the White Knight pussy-begging simps. (+ the Law, Courts, media, etc) permalink parent award report block reply Callsign_Fox1 1 points 2 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nCallsign_Fox1 1 points 2 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\n0111000001100101 2 points 2 days ago Actors were considered lacking of the human spirit when they first emerged in the ancient world. permalink parent award report block reply\nOldGloryUnfurled 16 points 2 days ago Hur durr... we have a uniform together. We are mimicking some irrelevancy from history. We are making a difference. permalink award report block reply rebuildingMyself 6 points 2 days ago What's more cringe. This or the pussy hat marches permalink parent award report block reply OldGloryUnfurled 1 points 2 days ago Why not both? permalink parent award report block reply Transparency 1 points 2 days ago Why not both? It is both, just in opposite directions, yet they are both still 2-sides of the exact same coin. permalink parent award report block reply\nrebuildingMyself 6 points 2 days ago What's more cringe. This or the pussy hat marches permalink parent award report block reply OldGloryUnfurled 1 points 2 days ago Why not both? permalink parent award report block reply Transparency 1 points 2 days ago Why not both? It is both, just in opposite directions, yet they are both still 2-sides of the exact same coin. permalink parent award report block reply\nOldGloryUnfurled 1 points 2 days ago Why not both? permalink parent award report block reply Transparency 1 points 2 days ago Why not both? It is both, just in opposite directions, yet they are both still 2-sides of the exact same coin. permalink parent award report block reply\nTransparency 1 points 2 days ago Why not both? It is both, just in opposite directions, yet they are both still 2-sides of the exact same coin. permalink parent award report block reply\nDingleBalls 15 points 2 days ago Well now we know who they have fantasies about being ravished by permalink award report block reply booblitchutz 8 points 2 days ago That’s the whole point of the book. It’s a rape fantasy. The author plays into liberal women’s hate of religion and creates a fantasy world where they are sex slaves for wealthy white Christian men, whom they hate most. The fantasy of being humiliated so deeply while being held down by the man’s older (and supposedly less attractive) wife is extremely titillating for them. It’s the same impulse as men who fantasize about being sexually dominated in the most humiliating way: in the butt while dressed as a woman. permalink parent award report block reply Burneraccountno4 4 points 2 days ago while being held down by the man’s older (and supposedly less attractive) wife They are that wife. The low fertility rate among white liberal women proves it. permalink parent award report block reply Lurker6 2 points 2 days ago I don't even think I could impregnate my beautiful wife if one of these chuds was even in the same room as us and I've done it 6 times. permalink parent award report block reply GatoradeJeb 3 points 2 days ago Its also why white woman oush rwcemixing propaganda in hollyworf so hard with White woman with jogger/wetback in all tv/movies/ads. Its to humiliate White man as we are forced to watch our own woman betray us to racemix with brown turds permalink parent award report block reply\nbooblitchutz 8 points 2 days ago That’s the whole point of the book. It’s a rape fantasy. The author plays into liberal women’s hate of religion and creates a fantasy world where they are sex slaves for wealthy white Christian men, whom they hate most. The fantasy of being humiliated so deeply while being held down by the man’s older (and supposedly less attractive) wife is extremely titillating for them. It’s the same impulse as men who fantasize about being sexually dominated in the most humiliating way: in the butt while dressed as a woman. permalink parent award report block reply Burneraccountno4 4 points 2 days ago while being held down by the man’s older (and supposedly less attractive) wife They are that wife. The low fertility rate among white liberal women proves it. permalink parent award report block reply Lurker6 2 points 2 days ago I don't even think I could impregnate my beautiful wife if one of these chuds was even in the same room as us and I've done it 6 times. permalink parent award report block reply\nBurneraccountno4 4 points 2 days ago while being held down by the man’s older (and supposedly less attractive) wife They are that wife. The low fertility rate among white liberal women proves it. permalink parent award report block reply Lurker6 2 points 2 days ago I don't even think I could impregnate my beautiful wife if one of these chuds was even in the same room as us and I've done it 6 times. permalink parent award report block reply\nLurker6 2 points 2 days ago I don't even think I could impregnate my beautiful wife if one of these chuds was even in the same room as us and I've done it 6 times. permalink parent award report block reply\nGatoradeJeb 3 points 2 days ago Its also why white woman oush rwcemixing propaganda in hollyworf so hard with White woman with jogger/wetback in all tv/movies/ads. Its to humiliate White man as we are forced to watch our own woman betray us to racemix with brown turds permalink parent award report block reply\nSeeker_17 11 points 2 days ago LOL. Send in the muzzie rape gangs. permalink award report block reply Transparency 4 points 2 days ago You'll NOT threaten THEM with a Good Time! permalink parent award report block reply\nTransparency 4 points 2 days ago You'll NOT threaten THEM with a Good Time! permalink parent award report block reply\nTooBright 6 points 2 days ago Jokes on them, I never read their beloved fiction. permalink award report block reply lifeisahologram 11 points 2 days ago They didn’t either, they bought the book, read a chapter at a coffee shop, took some selfies reading it, posted it on Instagram, then watched the tv show, and then tell people it’s their favorite book. permalink parent award report block reply indigo_truther 5 points 2 days ago I didn't either but I doubt there is anything there about protesting for illegal aliens permalink parent award report block reply GallowsTime 3 points 2 days ago A Modest Proposal is much more worth your time. permalink parent award report block reply\nlifeisahologram 11 points 2 days ago They didn’t either, they bought the book, read a chapter at a coffee shop, took some selfies reading it, posted it on Instagram, then watched the tv show, and then tell people it’s their favorite book. permalink parent award report block reply\nindigo_truther 5 points 2 days ago I didn't either but I doubt there is anything there about protesting for illegal aliens permalink parent award report block reply\nGallowsTime 3 points 2 days ago A Modest Proposal is much more worth your time. permalink parent award report block reply\ncoinneach007 6 points 2 days ago And yet they will gladly side with the religion that is the most oppressive against women! permalink award report block reply Transparency 6 points 2 days ago That's all the evidence you need to know that women belong in the kitchen. permalink parent award report block reply GatoradeJeb 5 points 2 days ago Worse they will racemix woth the brown scum while attacking White man permalink parent award report block reply\nTransparency 6 points 2 days ago That's all the evidence you need to know that women belong in the kitchen. permalink parent award report block reply\nGatoradeJeb 5 points 2 days ago Worse they will racemix woth the brown scum while attacking White man permalink parent award report block reply\nLightning 5 points 2 days ago The “Uni-Cause.” They don’t actually have any truly held beliefs. They just protest what they’re told to protest. permalink award report block reply\nChrisSuperDude 5 points 2 days ago Within the lore of Handmaidens Tale, the handmaidens were young, fertile and beautiful women. You women have absolutely nothing to worry about and would not be wearing those red burkas if we lived in that world. permalink award report block reply\nPapaPepe 5 points 2 days ago The neo KKK permalink award report block reply RuprechtThaMonkeyBoy 4 points 2 days ago Red KKK Commies permalink parent award report block reply GatoradeJeb 1 points 2 days ago Stop insulting the KKK like that. They wouldnt have been defending blm or mexicans, nor would kkk have endorsed racemix.\nThese are racetraitor communists permalink parent award report block reply\nRuprechtThaMonkeyBoy 4 points 2 days ago Red KKK Commies permalink parent award report block reply\nGatoradeJeb 1 points 2 days ago Stop insulting the KKK like that. They wouldnt have been defending blm or mexicans, nor would kkk have endorsed racemix.\nThese are racetraitor communists permalink parent award report block reply\nOodles 5 points 2 days ago Women are driven by emotion and are easily manipulated via threat of ostracism by other women They should not be allowed to vote or be put in charge of anything permalink award report block reply Aquamine-Amarine 1 points 2 days ago Why doesn't the right manipulate them into voting conservatively then? Instead of trying to steal their right to vote. If they're so easily manipulated, then it shouldn't be hard. permalink parent award report block reply Transparency 4 points 2 days ago Their nature is conformance (security) combined with being anti-establishment (rebellion). First thing to understand about women is that their brains can easily hold disassociated thought processes without any cognitive dissonance. That's why they often don't make sense and frequently fail at logic. Plus, conformance + scatterbrained leads them to think too much while not actually thinking at all. The more women that go in 1 direction... the more women that follow. So, say the muslims took over, killed all these White Knight pussy-begging simps, and started harassing and beating the women to get them inline... in short order: more and more women would start getting inline without having to be harassed or beaten. Of course, they would not be allowed to vote, but that is irrelevant to the point. Just look at Afghanistan after  the US withdrawal: Women complained and cried out for help, but, ultimately, they got their asses inline and obeyed. Why doesn't the right manipulate them into voting conservatively then? The short answer is: Because men let feminism go waaaaaay too far. Why? Because with prosperity men were more focused on fucking the women, than running and protecting the culture/society. permalink parent award report block reply Oodles 3 points 2 days ago Because they are also gullible, emotional, innumerate, and filled with suicidal empathy, whereas the right runs on logic and facts The right pitches You have to work hard to get what you want and people who do not work hard will not get everything they want The left pitches The government will give everything to everyone, so even the dumbest, laziest, criminal will get everything they want so they won’t be a criminal anymore Which pitch do you think is the most attractive to the emotionally manipulatable demographic? permalink parent award report block reply GatoradeJeb 1 points 2 days ago If trump was real and not controlled he would have banned racemixing permalink parent award report block reply\nAquamine-Amarine 1 points 2 days ago Why doesn't the right manipulate them into voting conservatively then? Instead of trying to steal their right to vote. If they're so easily manipulated, then it shouldn't be hard. permalink parent award report block reply Transparency 4 points 2 days ago Their nature is conformance (security) combined with being anti-establishment (rebellion). First thing to understand about women is that their brains can easily hold disassociated thought processes without any cognitive dissonance. That's why they often don't make sense and frequently fail at logic. Plus, conformance + scatterbrained leads them to think too much while not actually thinking at all. The more women that go in 1 direction... the more women that follow. So, say the muslims took over, killed all these White Knight pussy-begging simps, and started harassing and beating the women to get them inline... in short order: more and more women would start getting inline without having to be harassed or beaten. Of course, they would not be allowed to vote, but that is irrelevant to the point. Just look at Afghanistan after  the US withdrawal: Women complained and cried out for help, but, ultimately, they got their asses inline and obeyed. Why doesn't the right manipulate them into voting conservatively then? The short answer is: Because men let feminism go waaaaaay too far. Why? Because with prosperity men were more focused on fucking the women, than running and protecting the culture/society. permalink parent award report block reply Oodles 3 points 2 days ago Because they are also gullible, emotional, innumerate, and filled with suicidal empathy, whereas the right runs on logic and facts The right pitches You have to work hard to get what you want and people who do not work hard will not get everything they want The left pitches The government will give everything to everyone, so even the dumbest, laziest, criminal will get everything they want so they won’t be a criminal anymore Which pitch do you think is the most attractive to the emotionally manipulatable demographic? permalink parent award report block reply\nTransparency 4 points 2 days ago Their nature is conformance (security) combined with being anti-establishment (rebellion). First thing to understand about women is that their brains can easily hold disassociated thought processes without any cognitive dissonance. That's why they often don't make sense and frequently fail at logic. Plus, conformance + scatterbrained leads them to think too much while not actually thinking at all. The more women that go in 1 direction... the more women that follow. So, say the muslims took over, killed all these White Knight pussy-begging simps, and started harassing and beating the women to get them inline... in short order: more and more women would start getting inline without having to be harassed or beaten. Of course, they would not be allowed to vote, but that is irrelevant to the point. Just look at Afghanistan after  the US withdrawal: Women complained and cried out for help, but, ultimately, they got their asses inline and obeyed. Why doesn't the right manipulate them into voting conservatively then? The short answer is: Because men let feminism go waaaaaay too far. Why? Because with prosperity men were more focused on fucking the women, than running and protecting the culture/society. permalink parent award report block reply\nOodles 3 points 2 days ago Because they are also gullible, emotional, innumerate, and filled with suicidal empathy, whereas the right runs on logic and facts The right pitches You have to work hard to get what you want and people who do not work hard will not get everything they want The left pitches The government will give everything to everyone, so even the dumbest, laziest, criminal will get everything they want so they won’t be a criminal anymore Which pitch do you think is the most attractive to the emotionally manipulatable demographic? permalink parent award report block reply\nGatoradeJeb 1 points 2 days ago If trump was real and not controlled he would have banned racemixing permalink parent award report block reply\nBecauseYoudBeInJail 5 points 2 days ago RAPE ME HARDER PAPI permalink award report block reply\nPsarg 5 points 2 days ago I can smell the cat piss permalink award report block reply\nMythArcana 5 points 2 days ago So, they want more rape is what they're saying. permalink award report block reply Transparency 2 points 2 days ago Yes. permalink parent award report block reply\nTransparency 2 points 2 days ago Yes. permalink parent award report block reply\nDlanOdcammron 4 points 2 days ago TIL Sydney Sweeney was on that show 🤣 permalink award report block reply lifeisahologram 7 points 2 days ago Damn was she one of the characters that the government assigns you to breed? Sign me up. permalink parent award report block reply\nlifeisahologram 7 points 2 days ago Damn was she one of the characters that the government assigns you to breed? Sign me up. permalink parent award report block reply\nIvIA6A 4 points 2 days ago So dumb, 😂 It's like gays for Palestine. permalink award report block reply\nBullwinkle 4 points 2 days ago Truly AWFL permalink award report block reply\naloha_snackbar22 3 points 2 days ago These retarded cunts vote. permalink award report block reply\nXXNNOES 3 points 2 days ago Needs more \"Islam is right about women\" counter protesters just to blow their gaskets and break their brains. LOL permalink award report block reply\nCocaineNewsome 3 points 2 days ago What's keeping them from moving? permalink award report block reply\nSaltyTitties4 3 points 2 days ago We’ve already been through this one.  Remember when everyone forgot about the blue and yellow flag and suddenly took up the Mexican flag? permalink award report block reply\nrebuildingMyself 3 points 2 days ago And they happily vote for Muslims to come in and, with enough numbers, put women in black cloaks instead of red. permalink award report block reply\nthisisatestof2 3 points 2 days ago All NPCs permalink award report block reply\nTrue_Curmudgeon 3 points 2 days ago Then he said to the woman, “I will sharpen the pain of your pregnancy, and in pain you will give birth. And you will desire to control your husband, but he will rule over you.” It's right there in the second half of that verse women being so damn contrary is written right into the curse. It's right there in a woman's psychology to destroy her man and embrace that which destroys him unless he rules over her in a godly manner. permalink award report block reply Transparency 2 points 2 days ago Women are hard wired for it. Feminism does not create these monsters, it merely removes their shackles and opens their cages allowing them to be what they truly are. All with the help of their White Knight pussy-begging simps. permalink parent award report block reply True_Curmudgeon 2 points 2 days ago Exactly my man! And a culture where good men can rule over them in a godly manner this would be prevented. However in our culture these things are illegal and in no way supported by society. permalink parent award report block reply\nTransparency 2 points 2 days ago Women are hard wired for it. Feminism does not create these monsters, it merely removes their shackles and opens their cages allowing them to be what they truly are. All with the help of their White Knight pussy-begging simps. permalink parent award report block reply True_Curmudgeon 2 points 2 days ago Exactly my man! And a culture where good men can rule over them in a godly manner this would be prevented. However in our culture these things are illegal and in no way supported by society. permalink parent award report block reply\nTrue_Curmudgeon 2 points 2 days ago Exactly my man! And a culture where good men can rule over them in a godly manner this would be prevented. However in our culture these things are illegal and in no way supported by society. permalink parent award report block reply\nStormeyworld13 3 points 2 days ago Deport them to Mexico with the drug cartels and don't let them come back! They love their illegals then let them go live with them. permalink award report block reply\nbrutustyberius 2 points 2 days ago Glad to see patriotfront back in the mix. I love the new unit’s! permalink award report block reply\nUnboosted 2 points 2 days ago I wonder how many are eggless or single mothers permalink award report block reply\norangelineman 2 points 2 days ago This is like the \"LGBTQ for Palestine\" movement. Do they know that the dystopia of Handmaid's Tale most closely resembles countries that are ruled by a certain Religion of Peace? permalink award report block reply\nelgordo 2 points 2 days ago Dammit! I was going to go to this protest but Amazon was all sold out of the XXXX-Large costumes! permalink award report block reply\ndeleted 2 points 2 days ago Transparency 2 points 2 days ago Attention It IS female currency. permalink parent award report block reply\nTransparency 2 points 2 days ago Attention It IS female currency. permalink parent award report block reply\nDJT_MFers1 2 points 2 days ago Cool red burkas!! permalink award report block reply\nGallowsTime 2 points 2 days ago I don't remember that in the book.  Talk about losing the plot. permalink award report block reply\nRustySheckelford 2 points 2 days ago I'm so sick of these cringey ass traitors fighting for foreigners instead of  their fellow Americans permalink award report block reply\nwmmiv2016v2 2 points 2 days ago Liberal women are retarded and/or insane. permalink award report block reply\nFusionBlack 2 points 2 days ago This sums this insanity up nicely. https://www.youtube.com/watch?v=QVTiRVbdIxA permalink award report block reply\nOwmyballz 2 points 2 days ago Figure out what NGO is paying for their uniforms.  Then figure out how much China is funding the NGO and shut it down as a foreign actor, which it damn well fucking is. permalink award report block reply\nChickapede 2 points 2 days ago Ahh Mexico.  I remember living there and being told that poor women on the delivery table had pain killers withheld until they signed permission to be sterilized after delivery.  Such choice!  So respectful of women!  Eye roll.... permalink award report block reply\nOldman1234 2 points 2 days ago Proving once again that some people will do anything for money. permalink award report block reply\nChickapede 2 points 2 days ago I remember back in about 1984 or 1985 when that stupid book started being forced on new students at the state college I went to for their compulsory introductory Freshman English class.  I purposefully never read it.  This has been a long slow curve coming. permalink award report block reply\nTransparency 2 points 2 days ago The White man's version of the burka IS too kind. permalink award report block reply\nParadigmShift2070 2 points 2 days ago I support their cause of aborting Mexicans. permalink award report block reply\njiminycricket1941 2 points 2 days ago I’ve never watched the show but at this point I’m starting to believe whatever the people inside the show were making the women do, it was probably a good thing. So without even knowing anything about this show, I’ll bet we should do it. permalink award report block reply\nSmurfection 1 points 2 days ago Margaret Atwood denies it now but in the 1980's she said that Gilead (The dysfunction nation controlling the former U.S. in the book)  wasn't based on what Christians believe or do to women but rather on the Iranian regime.    She started saying after the show came out that Gilead is reflective of what Trump and MAGA want.  The left literally told itself a horror story based on a fundamentalist regime that rose up after a leftist Soviet backed revolution and tried to blame it on people who opposed the leftist revolution, opposed the USSR Breshnev doctrine, opposed gender apartheid in from  totally different country with a totally different civilization and now play theatrics based on a total reversal of objective reality. permalink award report block reply\nFreedomnuggs 1 points 2 days ago Women on the left are cringelords permalink award report block reply\nGildoom 1 points 2 days ago Is this the left's version of the Patriot Front?  I mean it is so optically retarded it just what huh what? permalink award report block reply\nboomerbutnotOKBoomer 1 points 2 days ago Still don't understand how they don't realize this was a fictional story that was actually partly about MUSLIM WOMEN IN BURKAS!!!! They pretend this is what Republican/Conservative women want. Yah, no. Hell no. Unless it will help me conceal a gun larger than my 45. I guess I could conceal a 30 ought six or my 20 ga. This really just shows that liberal women are really really really stupid and don't understand the world. I say we pull up a bus, load them all on it and drive the bus right into a 747 Dreamlifter and take them to Mogadishu or Liberia for a weeklong \"training\" on the realities of the world they think is so much better than the US. Question for Libtards: If the US is so bad, why are so many people trying to sneak in? And why aren't they sneaking in to Me-Hee-ko? permalink award report block reply\nMetriz77 1 points 2 days ago Send them to El Salvador. permalink award report block reply\nAmericanJawa 1 points 2 days ago The \"Handmaid’s Tale women\" were never anything more than propaganda. permalink award report block reply\nTrump454748 1 points 2 days ago Since they are against deportations, each of these “women” should be assigned their very own “migrant” which they will be 100% responsible for, and l will stock up on popcorn. permalink award report block reply\nViewer01 1 points 2 days ago How do we convince these hoes to abort illegals? Seems self solving problem. permalink award report block reply\nDev404 1 points 2 days ago Deport them all to the destination those illegals are going. They can be with their beloved criminals and get culturally enriched over there. permalink award report block reply\nf_bastiat 1 points 2 days ago Gay, completely gay. permalink award report block reply\nNonbinaryPotatohead 1 points 2 days ago What about Guatemala? permalink award report block reply\n26magarat 1 points 2 days ago I wonder what Margaret Atwood thinks? If she's still alive. permalink award report block reply Transparency 1 points 2 days ago https://communities.win/c/TheDonald/p/1ARK9hiYGV/the-handmaids-tale-women-are-no-/c/4eXu1vd21yc permalink parent award report block reply\nTransparency 1 points 2 days ago https://communities.win/c/TheDonald/p/1ARK9hiYGV/the-handmaids-tale-women-are-no-/c/4eXu1vd21yc permalink parent award report block reply\nFrankDuncan 1 points 2 days ago I will punch these bitches if I see them.. so tired of this dumb shit permalink award report block reply\nPhantomShield72 1 points 2 days ago Will they change to black hoods & robes when they travel to NYC? permalink award report block reply\nbluewhiteandred 1 points 2 days ago rebels without a cause permalink award report block reply\nSkabliggum2 1 points 2 days ago Wow, Patriot Front looking way different permalink award report block reply\nworldowedexplanation 1 points 2 days ago Stop giving these retards attention and just arrest them permalink award report block reply\ndonteatthat 1 points 2 days ago Fucking clowns. permalink award report block reply\nKeep_on_winning_kag 1 points 2 days ago They just need the gold hammer and sickles on the backs and they are good for NYC. permalink award report block reply\nAquamine-Amarine -1 points 2 days ago 18+ years of public school brainwashing. Are you people going to fix it? No, you'll just keep bitching about it and conveniently not mention the stupid stuff leftist men do, who also vote by the way. Almost like sex isn't the issue, it's leftism. But no, let's not talk about that... women bad. permalink award report block reply MasterChief08 2 points 2 days ago 70% of women under 25 are Democrats. permalink parent award report block reply Transparency 1 points 2 days ago Well, they say that if you are young and not Liberal you do not have a heart (the curse of youthful idealism), but if you are old and are not Conservative, then you do not have a brain permalink parent award report block reply Transparency 1 points 2 days ago the stupid stuff leftist men do \"The stupid[est] [thing] leftist men do\" is support feminism. permalink parent award report block reply\nMasterChief08 2 points 2 days ago 70% of women under 25 are Democrats. permalink parent award report block reply Transparency 1 points 2 days ago Well, they say that if you are young and not Liberal you do not have a heart (the curse of youthful idealism), but if you are old and are not Conservative, then you do not have a brain permalink parent award report block reply\nTransparency 1 points 2 days ago Well, they say that if you are young and not Liberal you do not have a heart (the curse of youthful idealism), but if you are old and are not Conservative, then you do not have a brain permalink parent award report block reply\nTransparency 1 points 2 days ago the stupid stuff leftist men do \"The stupid[est] [thing] leftist men do\" is support feminism. permalink parent award report block reply"}