{"id": "1ARK9oYItk", "contents": "360 BREAKING - IT'S OFFICIAL: U.S. House gives final passage to reopen the federal government, now en route to the desk of President Trump, 222-209. No Obamacare credits in the bill. 6 Democrats voted with the Republicans, Thomas Massie and Greg Steube voted with the Democrats. posted 13 hours ago by Mr_Rightside 34 comments award share report block Eric Daugherty @EricLDaugh • 14h 🚨 BREAKING - IT'S OFFICIAL: U.S. House gives FINAL PASSAGE to reopen the federal government, now en route to the desk of PRESIDENT TRUMP. 222-209 Signing is imminent, 9:45PM. NO Obamacare credits in the bill. WE HELD THE LINE! 👏 By stroke of 47's pen, the Schumer Shutdown\n34 comments Sort by Top Top New Worst Old Save Around the Web perma-maga 19 points 13 hours ago All Theater. We get Biden's budget because Mike Johnson failed - again - to produce 12 budgets. GOP: optics over substance permalink award report block reply Scumbag-reddit 1 points 4 hours ago Show me how we're getting bidens budget instead of a clean bill... permalink parent award report block reply Meathe 2 points 3 hours ago The clean bill is a straight continuance of the biden budget.  The temporary ACA expired, Schumer and crew wanted to reanimate it at extra cost.   Of course, the expiry of a temporary program is called a “cut” by the opposition, because there is nothing so permanent as a temporary Government program - see Income Tax. permalink parent award report block reply grassshrimp -3 points 12 hours ago Can it be any more obvious that you are a leftist shill here to pretend and demoralize. How in the fuck are you and your alts not cancelled. permalink parent award report block reply possibletower -7 points 12 hours ago Cope, Ron DeFaggot cocksucker 🤣 Ron DeFaggot will never be your POTUS. You fags were hoping chaos would happen and were hoping EBT riots would happen so you could get your \"Boris Yeltsin on a tank\" moment where Ronnie Boy would call out Trump (like Gorbachev) as being out of touch and unpopular with the people so everybody would blame Trump for the EBT riots and Meatball would position himself in a propaganda style \"getting on top of a tank\" equivalent to tell everybody that he will be the one who will save us in 2028. Now that no EBT rioting will happen you fags are nitpicking every thing he says and hoping that will divide and conquer MAGA country. permalink parent award report block reply bigmikesbulge 7 points 12 hours ago Banning hemp-derived THC has got to be one of the most retarded things R's have done in recent history. If they're looking to lose the midterms, this is how you do it. permalink award report block reply sully 3 points 8 hours ago I don’t smoke weed nor do I give a flying fuck about it, but the whole deal around federally banning hemp and marijuana as a whole solely because of William R. Hearst is such a ridiculous and embarrassing story for our country lol. permalink parent award report block reply bigmikesbulge 1 points 4 hours ago To be clear I haven’t smoked in well over a decade. I personally have no dog in that fight. I’ll have to look into Hearst, not familiar with that bit of history. permalink parent award report block reply grassshrimp 0 points 12 hours ago Sure, the entire country is pissed off about hemp.  LOL.  Nobody cares. permalink parent award report block reply bigmikesbulge 7 points 12 hours ago You're right, Gen Z totally doesn't care about their THC. This sort of attitude is why the reason R's will lose the midterms. Nothing done about election fraud, DOGE has virtually ceased to exist... but they're concerned with closing a weed loophole most are in favor of. Beyond incompetent. permalink parent award report block reply grassshrimp -8 points 12 hours ago Fuck off shill. permalink parent award report block reply bigmikesbulge 3 points 12 hours ago I've been on this forum since pre-reddit quarantine, eat a dick. permalink parent award report block reply view 2 more comments... Bythrfruitsyknow 2 points 10 hours ago lol you smoothbrained faggot. Even the Republican Governor of Texas went against his own party who tried to ban Delta-8/Delta-9 products and veto'd their bill because he knew it would be the end of his career, and how much damage the job losses and the businesses shutting down would cause. permalink parent award report block reply IbleedOrange 1 points 2 hours ago I do. It's a $28 billion industry with 300k jobs. I don't use any of the products,  but am involved with the HVAC side of that industry.\nThis was supposed to be a \"Clean C.R.\" The human turtle snuck this in. So yeah, I care. permalink parent award report block reply Southernwhitebread2 7 points 13 hours ago Jack Smith probies gon get paid and anyone getting relief from hemp gets screwed! Got it permalink award report block reply PatriotSkorzeny 5 points 13 hours ago Veto!! Single issue bills! permalink award report block reply SisterCovfefeToo 5 points 13 hours ago After forcing the country to endure the longest government shutdown in history, the Senate's response is the furthest thing from a ‘clean’ CR. I could not in good conscience support a resolution that creates a self-indulgent legal provision for certain senators to enrich themselves by suing the Justice Department using taxpayer dollars. There is no reason the House should have been forced to eat this garbage to end the Schumer Shutdown. Greg Steube's reasons permalink award report block reply JLoonacy 6 points 12 hours ago These are absolutely valid reasons. The House has \"promised\" (read: offered their word which has absolutely no value) to pass separate legislation after reopening the government that will specifically repeal this portion of the CR. Who wants to bet that that separate legislation will fail to pass? permalink parent award report block reply Skabliggum2 4 points 13 hours ago Lots of people on the live feed were crying that this bill will destroy the hemp industry. 😆 permalink award report block reply Nerdrem3 2 points 10 hours ago Yep. I think that more than anything tanks our chances for the midterms, shit's mainstream at this point even old people use CBD. After Trump hinting at rescheduling or even decriminalizing weed to wide approval this about face by Republicans in Congress is an idiotic move which puts them squarely on the wrong side of a big 80/20 issue. permalink parent award report block reply Bythrfruitsyknow 2 points 9 hours ago Even Governor Abbot saw banning CBD/Delta-8/9 products as a third-rail and veto'd it. President Trump has talked numerous times about descheduling marijuana and the old republican guard are trying to tank him again. Make no mistake Glitch McConnell did this knowing it would hurt them in the midterms. The GOPe want President Trump to be a lame duck. permalink parent award report block reply HighenergyGearhead 3 points 12 hours ago Massie always votes w democrats permalink award report block reply Skabliggum2 3 points 13 hours ago 6 Dem yes, and 2 GOP no 🤔 permalink award report block reply JoeMcCarthyWasRight 2 points 12 hours ago Just change this side from patriots.win to ericdaugherty.shill already. permalink award report block reply MAGALADON9 2 points 13 hours ago I'd have preferred nuking the filibuster permalink award report block reply Aggrieved03 1 points 12 hours ago Yay! We get Biden level spending with some garbage attachments I'm sure. permalink award report block reply Maga305_47 1 points 12 hours ago Postinga cunt is an auto downvote permalink award report block reply Moose_Antlers 0 points 7 hours ago Why are we acting like this is a victory? It's just a routine CR. All it does is give the Congresscritters more time to make backroom deals and consult their AIPAC handlers for approval. It preserves the Biden era spending through January 30, 2026. It codifies none of the DOGE cuts, none of Trump's priorities. All of that is still being debated. It's literally just a standard CR that should have passed with a unanimous vote in a couple of hours from start to finish. This is nothing. The battle's still going on in a bunch of lawyer's offices where they're actually writing the bill. This budget should have been done months ago, but of course it's not. Johnson was too busy kissing the Wailing Wall and figuring out how to keep that tiny hat on his head to do his job. permalink award report block reply SquirreleeDan 0 points 13 hours ago I’m going to lose everything. permalink award report block reply utfanx2 0 points 13 hours ago Trump promised to never sign another omnibus. Veto it anyways. permalink award report block reply Bythrfruitsyknow 2 points 9 hours ago Got to spend 3 trillion dollars more, then we'll start cutting government spending. Pinky promise permalink parent award report block reply\nperma-maga 19 points 13 hours ago All Theater. We get Biden's budget because Mike Johnson failed - again - to produce 12 budgets. GOP: optics over substance permalink award report block reply Scumbag-reddit 1 points 4 hours ago Show me how we're getting bidens budget instead of a clean bill... permalink parent award report block reply Meathe 2 points 3 hours ago The clean bill is a straight continuance of the biden budget.  The temporary ACA expired, Schumer and crew wanted to reanimate it at extra cost.   Of course, the expiry of a temporary program is called a “cut” by the opposition, because there is nothing so permanent as a temporary Government program - see Income Tax. permalink parent award report block reply grassshrimp -3 points 12 hours ago Can it be any more obvious that you are a leftist shill here to pretend and demoralize. How in the fuck are you and your alts not cancelled. permalink parent award report block reply possibletower -7 points 12 hours ago Cope, Ron DeFaggot cocksucker 🤣 Ron DeFaggot will never be your POTUS. You fags were hoping chaos would happen and were hoping EBT riots would happen so you could get your \"Boris Yeltsin on a tank\" moment where Ronnie Boy would call out Trump (like Gorbachev) as being out of touch and unpopular with the people so everybody would blame Trump for the EBT riots and Meatball would position himself in a propaganda style \"getting on top of a tank\" equivalent to tell everybody that he will be the one who will save us in 2028. Now that no EBT rioting will happen you fags are nitpicking every thing he says and hoping that will divide and conquer MAGA country. permalink parent award report block reply\nScumbag-reddit 1 points 4 hours ago Show me how we're getting bidens budget instead of a clean bill... permalink parent award report block reply Meathe 2 points 3 hours ago The clean bill is a straight continuance of the biden budget.  The temporary ACA expired, Schumer and crew wanted to reanimate it at extra cost.   Of course, the expiry of a temporary program is called a “cut” by the opposition, because there is nothing so permanent as a temporary Government program - see Income Tax. permalink parent award report block reply\nMeathe 2 points 3 hours ago The clean bill is a straight continuance of the biden budget.  The temporary ACA expired, Schumer and crew wanted to reanimate it at extra cost.   Of course, the expiry of a temporary program is called a “cut” by the opposition, because there is nothing so permanent as a temporary Government program - see Income Tax. permalink parent award report block reply\ngrassshrimp -3 points 12 hours ago Can it be any more obvious that you are a leftist shill here to pretend and demoralize. How in the fuck are you and your alts not cancelled. permalink parent award report block reply\npossibletower -7 points 12 hours ago Cope, Ron DeFaggot cocksucker 🤣 Ron DeFaggot will never be your POTUS. You fags were hoping chaos would happen and were hoping EBT riots would happen so you could get your \"Boris Yeltsin on a tank\" moment where Ronnie Boy would call out Trump (like Gorbachev) as being out of touch and unpopular with the people so everybody would blame Trump for the EBT riots and Meatball would position himself in a propaganda style \"getting on top of a tank\" equivalent to tell everybody that he will be the one who will save us in 2028. Now that no EBT rioting will happen you fags are nitpicking every thing he says and hoping that will divide and conquer MAGA country. permalink parent award report block reply\nbigmikesbulge 7 points 12 hours ago Banning hemp-derived THC has got to be one of the most retarded things R's have done in recent history. If they're looking to lose the midterms, this is how you do it. permalink award report block reply sully 3 points 8 hours ago I don’t smoke weed nor do I give a flying fuck about it, but the whole deal around federally banning hemp and marijuana as a whole solely because of William R. Hearst is such a ridiculous and embarrassing story for our country lol. permalink parent award report block reply bigmikesbulge 1 points 4 hours ago To be clear I haven’t smoked in well over a decade. I personally have no dog in that fight. I’ll have to look into Hearst, not familiar with that bit of history. permalink parent award report block reply grassshrimp 0 points 12 hours ago Sure, the entire country is pissed off about hemp.  LOL.  Nobody cares. permalink parent award report block reply bigmikesbulge 7 points 12 hours ago You're right, Gen Z totally doesn't care about their THC. This sort of attitude is why the reason R's will lose the midterms. Nothing done about election fraud, DOGE has virtually ceased to exist... but they're concerned with closing a weed loophole most are in favor of. Beyond incompetent. permalink parent award report block reply grassshrimp -8 points 12 hours ago Fuck off shill. permalink parent award report block reply bigmikesbulge 3 points 12 hours ago I've been on this forum since pre-reddit quarantine, eat a dick. permalink parent award report block reply view 2 more comments... Bythrfruitsyknow 2 points 10 hours ago lol you smoothbrained faggot. Even the Republican Governor of Texas went against his own party who tried to ban Delta-8/Delta-9 products and veto'd their bill because he knew it would be the end of his career, and how much damage the job losses and the businesses shutting down would cause. permalink parent award report block reply IbleedOrange 1 points 2 hours ago I do. It's a $28 billion industry with 300k jobs. I don't use any of the products,  but am involved with the HVAC side of that industry.\nThis was supposed to be a \"Clean C.R.\" The human turtle snuck this in. So yeah, I care. permalink parent award report block reply\nsully 3 points 8 hours ago I don’t smoke weed nor do I give a flying fuck about it, but the whole deal around federally banning hemp and marijuana as a whole solely because of William R. Hearst is such a ridiculous and embarrassing story for our country lol. permalink parent award report block reply bigmikesbulge 1 points 4 hours ago To be clear I haven’t smoked in well over a decade. I personally have no dog in that fight. I’ll have to look into Hearst, not familiar with that bit of history. permalink parent award report block reply\nbigmikesbulge 1 points 4 hours ago To be clear I haven’t smoked in well over a decade. I personally have no dog in that fight. I’ll have to look into Hearst, not familiar with that bit of history. permalink parent award report block reply\ngrassshrimp 0 points 12 hours ago Sure, the entire country is pissed off about hemp.  LOL.  Nobody cares. permalink parent award report block reply bigmikesbulge 7 points 12 hours ago You're right, Gen Z totally doesn't care about their THC. This sort of attitude is why the reason R's will lose the midterms. Nothing done about election fraud, DOGE has virtually ceased to exist... but they're concerned with closing a weed loophole most are in favor of. Beyond incompetent. permalink parent award report block reply grassshrimp -8 points 12 hours ago Fuck off shill. permalink parent award report block reply bigmikesbulge 3 points 12 hours ago I've been on this forum since pre-reddit quarantine, eat a dick. permalink parent award report block reply view 2 more comments... Bythrfruitsyknow 2 points 10 hours ago lol you smoothbrained faggot. Even the Republican Governor of Texas went against his own party who tried to ban Delta-8/Delta-9 products and veto'd their bill because he knew it would be the end of his career, and how much damage the job losses and the businesses shutting down would cause. permalink parent award report block reply IbleedOrange 1 points 2 hours ago I do. It's a $28 billion industry with 300k jobs. I don't use any of the products,  but am involved with the HVAC side of that industry.\nThis was supposed to be a \"Clean C.R.\" The human turtle snuck this in. So yeah, I care. permalink parent award report block reply\nbigmikesbulge 7 points 12 hours ago You're right, Gen Z totally doesn't care about their THC. This sort of attitude is why the reason R's will lose the midterms. Nothing done about election fraud, DOGE has virtually ceased to exist... but they're concerned with closing a weed loophole most are in favor of. Beyond incompetent. permalink parent award report block reply grassshrimp -8 points 12 hours ago Fuck off shill. permalink parent award report block reply bigmikesbulge 3 points 12 hours ago I've been on this forum since pre-reddit quarantine, eat a dick. permalink parent award report block reply view 2 more comments...\ngrassshrimp -8 points 12 hours ago Fuck off shill. permalink parent award report block reply bigmikesbulge 3 points 12 hours ago I've been on this forum since pre-reddit quarantine, eat a dick. permalink parent award report block reply view 2 more comments...\nbigmikesbulge 3 points 12 hours ago I've been on this forum since pre-reddit quarantine, eat a dick. permalink parent award report block reply view 2 more comments...\nBythrfruitsyknow 2 points 10 hours ago lol you smoothbrained faggot. Even the Republican Governor of Texas went against his own party who tried to ban Delta-8/Delta-9 products and veto'd their bill because he knew it would be the end of his career, and how much damage the job losses and the businesses shutting down would cause. permalink parent award report block reply\nIbleedOrange 1 points 2 hours ago I do. It's a $28 billion industry with 300k jobs. I don't use any of the products,  but am involved with the HVAC side of that industry.\nThis was supposed to be a \"Clean C.R.\" The human turtle snuck this in. So yeah, I care. permalink parent award report block reply\nSouthernwhitebread2 7 points 13 hours ago Jack Smith probies gon get paid and anyone getting relief from hemp gets screwed! Got it permalink award report block reply\nPatriotSkorzeny 5 points 13 hours ago Veto!! Single issue bills! permalink award report block reply\nSisterCovfefeToo 5 points 13 hours ago After forcing the country to endure the longest government shutdown in history, the Senate's response is the furthest thing from a ‘clean’ CR. I could not in good conscience support a resolution that creates a self-indulgent legal provision for certain senators to enrich themselves by suing the Justice Department using taxpayer dollars. There is no reason the House should have been forced to eat this garbage to end the Schumer Shutdown. Greg Steube's reasons permalink award report block reply JLoonacy 6 points 12 hours ago These are absolutely valid reasons. The House has \"promised\" (read: offered their word which has absolutely no value) to pass separate legislation after reopening the government that will specifically repeal this portion of the CR. Who wants to bet that that separate legislation will fail to pass? permalink parent award report block reply\nJLoonacy 6 points 12 hours ago These are absolutely valid reasons. The House has \"promised\" (read: offered their word which has absolutely no value) to pass separate legislation after reopening the government that will specifically repeal this portion of the CR. Who wants to bet that that separate legislation will fail to pass? permalink parent award report block reply\nSkabliggum2 4 points 13 hours ago Lots of people on the live feed were crying that this bill will destroy the hemp industry. 😆 permalink award report block reply Nerdrem3 2 points 10 hours ago Yep. I think that more than anything tanks our chances for the midterms, shit's mainstream at this point even old people use CBD. After Trump hinting at rescheduling or even decriminalizing weed to wide approval this about face by Republicans in Congress is an idiotic move which puts them squarely on the wrong side of a big 80/20 issue. permalink parent award report block reply Bythrfruitsyknow 2 points 9 hours ago Even Governor Abbot saw banning CBD/Delta-8/9 products as a third-rail and veto'd it. President Trump has talked numerous times about descheduling marijuana and the old republican guard are trying to tank him again. Make no mistake Glitch McConnell did this knowing it would hurt them in the midterms. The GOPe want President Trump to be a lame duck. permalink parent award report block reply\nNerdrem3 2 points 10 hours ago Yep. I think that more than anything tanks our chances for the midterms, shit's mainstream at this point even old people use CBD. After Trump hinting at rescheduling or even decriminalizing weed to wide approval this about face by Republicans in Congress is an idiotic move which puts them squarely on the wrong side of a big 80/20 issue. permalink parent award report block reply Bythrfruitsyknow 2 points 9 hours ago Even Governor Abbot saw banning CBD/Delta-8/9 products as a third-rail and veto'd it. President Trump has talked numerous times about descheduling marijuana and the old republican guard are trying to tank him again. Make no mistake Glitch McConnell did this knowing it would hurt them in the midterms. The GOPe want President Trump to be a lame duck. permalink parent award report block reply\nBythrfruitsyknow 2 points 9 hours ago Even Governor Abbot saw banning CBD/Delta-8/9 products as a third-rail and veto'd it. President Trump has talked numerous times about descheduling marijuana and the old republican guard are trying to tank him again. Make no mistake Glitch McConnell did this knowing it would hurt them in the midterms. The GOPe want President Trump to be a lame duck. permalink parent award report block reply\nHighenergyGearhead 3 points 12 hours ago Massie always votes w democrats permalink award report block reply\nSkabliggum2 3 points 13 hours ago 6 Dem yes, and 2 GOP no 🤔 permalink award report block reply\nJoeMcCarthyWasRight 2 points 12 hours ago Just change this side from patriots.win to ericdaugherty.shill already. permalink award report block reply\nMAGALADON9 2 points 13 hours ago I'd have preferred nuking the filibuster permalink award report block reply\nAggrieved03 1 points 12 hours ago Yay! We get Biden level spending with some garbage attachments I'm sure. permalink award report block reply\nMaga305_47 1 points 12 hours ago Postinga cunt is an auto downvote permalink award report block reply\nMoose_Antlers 0 points 7 hours ago Why are we acting like this is a victory? It's just a routine CR. All it does is give the Congresscritters more time to make backroom deals and consult their AIPAC handlers for approval. It preserves the Biden era spending through January 30, 2026. It codifies none of the DOGE cuts, none of Trump's priorities. All of that is still being debated. It's literally just a standard CR that should have passed with a unanimous vote in a couple of hours from start to finish. This is nothing. The battle's still going on in a bunch of lawyer's offices where they're actually writing the bill. This budget should have been done months ago, but of course it's not. Johnson was too busy kissing the Wailing Wall and figuring out how to keep that tiny hat on his head to do his job. permalink award report block reply\nSquirreleeDan 0 points 13 hours ago I’m going to lose everything. permalink award report block reply\nutfanx2 0 points 13 hours ago Trump promised to never sign another omnibus. Veto it anyways. permalink award report block reply Bythrfruitsyknow 2 points 9 hours ago Got to spend 3 trillion dollars more, then we'll start cutting government spending. Pinky promise permalink parent award report block reply\nBythrfruitsyknow 2 points 9 hours ago Got to spend 3 trillion dollars more, then we'll start cutting government spending. Pinky promise permalink parent award report block reply"}