{"id": "1ARK9pg9SB", "contents": "95 Fuck Mitch McConnell, if anything should be allowed it is the hemp gummies and drinks vs. people running around smoking blunts. posted 3 hours ago by footinmouth 9 comments award share report block Unfortunate Reality @thinkB4belief • 1d 2018: Mitch McConnell stands in a Kentucky hemp field. \"This is the future of Kentucky agriculture,\" he tells farmers. \"Plant hemp. Trust me.\" 2025: Those same farmers are about to lose everything. Because McConnell took $73,000 from a whiskey executive. This is what betrayal\n9 comments Sort by Top Top New Worst Old Save BrokenWolf2022 8 points 3 hours ago Can't wait to see what happens when all those combat vets with PTSD get cut off. permalink award report block reply UltraFrogMan 7 points 3 hours ago Hes old old like.. Weed will make u want to rape and murder green scare old permalink award report block reply Shitsbrokeyo 6 points 2 hours ago The gummies are the only thing that touch my back pain. permalink award report block reply tralbolh 5 points 2 hours ago He might fear it will bring down demand for cocaine. permalink award report block reply footinmouth OP 4 points 1 hour ago Alcohol, he was bribed. permalink parent award report block reply leanpocket 5 points 2 hours ago I am annoyed when I go to family friendly events and smell burning weed. There's a time and place for all that. It is also always the same crowd of people who are ashamed of nothing but offended by everything. permalink award report block reply SpaceWizard 3 points 2 hours ago Primary that bastard already permalink award report block reply footinmouth OP 3 points 1 hour ago He's not seeking re-election, hence the bribe from Kentucky alcohol producers. permalink parent award report block reply FreedomFlowerDelta 3 points 2 hours ago Stop it with the \"I guess the gummies and drinks are okay\".  That is what Big alcohol what's you to think. Their plan is to crush all the small businesses and suck all of the money up into your jew pockets permalink award report block reply\nBrokenWolf2022 8 points 3 hours ago Can't wait to see what happens when all those combat vets with PTSD get cut off. permalink award report block reply\nUltraFrogMan 7 points 3 hours ago Hes old old like.. Weed will make u want to rape and murder green scare old permalink award report block reply\nShitsbrokeyo 6 points 2 hours ago The gummies are the only thing that touch my back pain. permalink award report block reply\ntralbolh 5 points 2 hours ago He might fear it will bring down demand for cocaine. permalink award report block reply footinmouth OP 4 points 1 hour ago Alcohol, he was bribed. permalink parent award report block reply\nfootinmouth OP 4 points 1 hour ago Alcohol, he was bribed. permalink parent award report block reply\nleanpocket 5 points 2 hours ago I am annoyed when I go to family friendly events and smell burning weed. There's a time and place for all that. It is also always the same crowd of people who are ashamed of nothing but offended by everything. permalink award report block reply\nSpaceWizard 3 points 2 hours ago Primary that bastard already permalink award report block reply footinmouth OP 3 points 1 hour ago He's not seeking re-election, hence the bribe from Kentucky alcohol producers. permalink parent award report block reply\nfootinmouth OP 3 points 1 hour ago He's not seeking re-election, hence the bribe from Kentucky alcohol producers. permalink parent award report block reply\nFreedomFlowerDelta 3 points 2 hours ago Stop it with the \"I guess the gummies and drinks are okay\".  That is what Big alcohol what's you to think. Their plan is to crush all the small businesses and suck all of the money up into your jew pockets permalink award report block reply"}