{"id": "1ARK9pfs0J", "contents": "57 I did my time. posted 7 hours ago by FearGodTheAlmighty 4 comments award share download report block\n4 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style MarshallB 4 points 7 hours ago There is NOBODY more removed from REALITY than the modern educational establishment from day care to PHD. permalink award report block reply FearGodTheAlmighty OP 3 points 6 hours ago It's a fantasy world permalink parent award report block reply patrioticwinning3 1 points 7 hours ago LMFAO XD  I did my time to Fren o7 permalink award report block reply MarshallB 2 points 7 hours ago To be accurate, all that was done was to replace Black Slavery with Universal Slavery when the Experiment with Government of the People was destroyed by Universal Tyranny in 1861. It wasn't complete yet, so it was replaced with UNIVERSAL SUBSERVIENCE. permalink parent award report block reply MarshallB 1 points 2 hours ago Key Points Secession is NOT Insurrection. The Constitution was silent about secession. The Constitution mentioned in both Amendments 9 & 10 that there were other rights and those were reserved to the States or to the People. I personally get nauseous every time I hear the word INDIVISIBLE in an oath. permalink parent award report block reply FearGodTheAlmighty OP 1 points 6 hours ago o7 brother permalink parent award report block reply\nMarshallB 4 points 7 hours ago There is NOBODY more removed from REALITY than the modern educational establishment from day care to PHD. permalink award report block reply FearGodTheAlmighty OP 3 points 6 hours ago It's a fantasy world permalink parent award report block reply\nFearGodTheAlmighty OP 3 points 6 hours ago It's a fantasy world permalink parent award report block reply\npatrioticwinning3 1 points 7 hours ago LMFAO XD  I did my time to Fren o7 permalink award report block reply MarshallB 2 points 7 hours ago To be accurate, all that was done was to replace Black Slavery with Universal Slavery when the Experiment with Government of the People was destroyed by Universal Tyranny in 1861. It wasn't complete yet, so it was replaced with UNIVERSAL SUBSERVIENCE. permalink parent award report block reply MarshallB 1 points 2 hours ago Key Points Secession is NOT Insurrection. The Constitution was silent about secession. The Constitution mentioned in both Amendments 9 & 10 that there were other rights and those were reserved to the States or to the People. I personally get nauseous every time I hear the word INDIVISIBLE in an oath. permalink parent award report block reply FearGodTheAlmighty OP 1 points 6 hours ago o7 brother permalink parent award report block reply\nMarshallB 2 points 7 hours ago To be accurate, all that was done was to replace Black Slavery with Universal Slavery when the Experiment with Government of the People was destroyed by Universal Tyranny in 1861. It wasn't complete yet, so it was replaced with UNIVERSAL SUBSERVIENCE. permalink parent award report block reply MarshallB 1 points 2 hours ago Key Points Secession is NOT Insurrection. The Constitution was silent about secession. The Constitution mentioned in both Amendments 9 & 10 that there were other rights and those were reserved to the States or to the People. I personally get nauseous every time I hear the word INDIVISIBLE in an oath. permalink parent award report block reply\nMarshallB 1 points 2 hours ago Key Points Secession is NOT Insurrection. The Constitution was silent about secession. The Constitution mentioned in both Amendments 9 & 10 that there were other rights and those were reserved to the States or to the People. I personally get nauseous every time I hear the word INDIVISIBLE in an oath. permalink parent award report block reply\nFearGodTheAlmighty OP 1 points 6 hours ago o7 brother permalink parent award report block reply"}