{"id": "1ARK55biQq", "contents": "284 I love the birth of a new meme posted 5 days ago by grandfather_nurgle 16 comments award share download report block\n16 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget KennyKetchem 11 points 5 days ago Without makeup she is hot as fuck. permalink award report block reply grandfather_nurgle OP 1 points 5 days ago Chaeyoung? I agree. permalink parent award report block reply x79q3pb 5 points 5 days ago Wtf there's no meat on them bones. Pass. permalink parent award report block reply grandfather_nurgle OP 3 points 5 days ago https://youtu.be/8vhhTUvRSZM It’s kind of like whiskey. Bitter at first but after a while you’ll crave it. permalink parent award report block reply deleted 6 points 5 days ago Necrovoter 5 points 5 days ago When she was THE face of Victoria's Secret, Stephanie Seymour was the equivalent of Mona Lisa, or Venus de Milo.   Such a classic beauty. permalink parent award report block reply IncredibleMrE1 1 points 5 days ago Don't worry, I won't tell Chaeyoung. permalink award report block reply grandfather_nurgle OP 2 points 5 days ago She is sick and missing dates. I am worried. permalink parent award report block reply IncredibleMrE1 1 points 5 days ago Not good. :( permalink parent award report block reply goatnuts -6 points 5 days ago Anyone simping for a celebrity is an idol worshipper being manipulated with kaballah by hollyweird change my mind. permalink award report block reply The_Emperor 4 points 5 days ago Do you go home and cover your head Iin ashes everyday?  Go enjoy the beautiful things in life that God made for us. permalink parent award report block reply grandfather_nurgle OP 2 points 5 days ago I like you. Let’s hang out sometime and talk about MAGA stuff. permalink parent award report block reply goatnuts 0 points 4 days ago Yes, the beautiful things, like the cover of TMZ and the latest news of whos fucking who, and the latest pro tranny propaganda from the big Steinberg intellectual property corporation who created your culture for you. I do enjoy the beautiful things. Family, outdoors, creativity, friendships. permalink parent award report block reply TrumpVoter1 0 points 4 days ago Found the incel.  Sydney is fucking hot whether a celebrity or not permalink parent award report block reply goatnuts 0 points 4 days ago There are plenty of real women in the world that are gorgeous, simping for a some chick on TV that literally feeds on attention is peak incel. permalink parent award report block reply TrumpVoter1 0 points 4 days ago Thinking someone is hot is not simping fool. permalink parent award report block reply\nKennyKetchem 11 points 5 days ago Without makeup she is hot as fuck. permalink award report block reply grandfather_nurgle OP 1 points 5 days ago Chaeyoung? I agree. permalink parent award report block reply x79q3pb 5 points 5 days ago Wtf there's no meat on them bones. Pass. permalink parent award report block reply grandfather_nurgle OP 3 points 5 days ago https://youtu.be/8vhhTUvRSZM It’s kind of like whiskey. Bitter at first but after a while you’ll crave it. permalink parent award report block reply\ngrandfather_nurgle OP 1 points 5 days ago Chaeyoung? I agree. permalink parent award report block reply x79q3pb 5 points 5 days ago Wtf there's no meat on them bones. Pass. permalink parent award report block reply grandfather_nurgle OP 3 points 5 days ago https://youtu.be/8vhhTUvRSZM It’s kind of like whiskey. Bitter at first but after a while you’ll crave it. permalink parent award report block reply\nx79q3pb 5 points 5 days ago Wtf there's no meat on them bones. Pass. permalink parent award report block reply grandfather_nurgle OP 3 points 5 days ago https://youtu.be/8vhhTUvRSZM It’s kind of like whiskey. Bitter at first but after a while you’ll crave it. permalink parent award report block reply\ngrandfather_nurgle OP 3 points 5 days ago https://youtu.be/8vhhTUvRSZM It’s kind of like whiskey. Bitter at first but after a while you’ll crave it. permalink parent award report block reply\ndeleted 6 points 5 days ago Necrovoter 5 points 5 days ago When she was THE face of Victoria's Secret, Stephanie Seymour was the equivalent of Mona Lisa, or Venus de Milo.   Such a classic beauty. permalink parent award report block reply\nNecrovoter 5 points 5 days ago When she was THE face of Victoria's Secret, Stephanie Seymour was the equivalent of Mona Lisa, or Venus de Milo.   Such a classic beauty. permalink parent award report block reply\nIncredibleMrE1 1 points 5 days ago Don't worry, I won't tell Chaeyoung. permalink award report block reply grandfather_nurgle OP 2 points 5 days ago She is sick and missing dates. I am worried. permalink parent award report block reply IncredibleMrE1 1 points 5 days ago Not good. :( permalink parent award report block reply\ngrandfather_nurgle OP 2 points 5 days ago She is sick and missing dates. I am worried. permalink parent award report block reply IncredibleMrE1 1 points 5 days ago Not good. :( permalink parent award report block reply\nIncredibleMrE1 1 points 5 days ago Not good. :( permalink parent award report block reply\ngoatnuts -6 points 5 days ago Anyone simping for a celebrity is an idol worshipper being manipulated with kaballah by hollyweird change my mind. permalink award report block reply The_Emperor 4 points 5 days ago Do you go home and cover your head Iin ashes everyday?  Go enjoy the beautiful things in life that God made for us. permalink parent award report block reply grandfather_nurgle OP 2 points 5 days ago I like you. Let’s hang out sometime and talk about MAGA stuff. permalink parent award report block reply goatnuts 0 points 4 days ago Yes, the beautiful things, like the cover of TMZ and the latest news of whos fucking who, and the latest pro tranny propaganda from the big Steinberg intellectual property corporation who created your culture for you. I do enjoy the beautiful things. Family, outdoors, creativity, friendships. permalink parent award report block reply TrumpVoter1 0 points 4 days ago Found the incel.  Sydney is fucking hot whether a celebrity or not permalink parent award report block reply goatnuts 0 points 4 days ago There are plenty of real women in the world that are gorgeous, simping for a some chick on TV that literally feeds on attention is peak incel. permalink parent award report block reply TrumpVoter1 0 points 4 days ago Thinking someone is hot is not simping fool. permalink parent award report block reply\nThe_Emperor 4 points 5 days ago Do you go home and cover your head Iin ashes everyday?  Go enjoy the beautiful things in life that God made for us. permalink parent award report block reply grandfather_nurgle OP 2 points 5 days ago I like you. Let’s hang out sometime and talk about MAGA stuff. permalink parent award report block reply goatnuts 0 points 4 days ago Yes, the beautiful things, like the cover of TMZ and the latest news of whos fucking who, and the latest pro tranny propaganda from the big Steinberg intellectual property corporation who created your culture for you. I do enjoy the beautiful things. Family, outdoors, creativity, friendships. permalink parent award report block reply\ngrandfather_nurgle OP 2 points 5 days ago I like you. Let’s hang out sometime and talk about MAGA stuff. permalink parent award report block reply\ngoatnuts 0 points 4 days ago Yes, the beautiful things, like the cover of TMZ and the latest news of whos fucking who, and the latest pro tranny propaganda from the big Steinberg intellectual property corporation who created your culture for you. I do enjoy the beautiful things. Family, outdoors, creativity, friendships. permalink parent award report block reply\nTrumpVoter1 0 points 4 days ago Found the incel.  Sydney is fucking hot whether a celebrity or not permalink parent award report block reply goatnuts 0 points 4 days ago There are plenty of real women in the world that are gorgeous, simping for a some chick on TV that literally feeds on attention is peak incel. permalink parent award report block reply TrumpVoter1 0 points 4 days ago Thinking someone is hot is not simping fool. permalink parent award report block reply\ngoatnuts 0 points 4 days ago There are plenty of real women in the world that are gorgeous, simping for a some chick on TV that literally feeds on attention is peak incel. permalink parent award report block reply TrumpVoter1 0 points 4 days ago Thinking someone is hot is not simping fool. permalink parent award report block reply\nTrumpVoter1 0 points 4 days ago Thinking someone is hot is not simping fool. permalink parent award report block reply"}