{"id": "1ARK9pemH8", "contents": "700 Throw in the towel, guys… a bunch of incels on the internet repeated a three word string of nonsense in an attempt to remain relevant. posted 11 hours ago by DeusVult1096 252 comments award share download report block\n252 comments Sort by Top Top New Worst Old Save magapatriot_pa 90 points 11 hours ago For as long as I draw breath, MAGA is not dead. I'll MAGA all by my damn self if I have to permalink award report block reply Lelleck 54 points 11 hours ago I don‘t even know what they are reffering to? I don‘t have the chance to follow every step of these people since I work and have a life outside of the internet… permalink parent award report block reply AppalachianTactical 93 points 10 hours ago Trump saying we need to import millions of Indian H1Bs because Americans aren't smart enough to do the job. permalink parent award report block reply Hangemh1gh 73 points 10 hours ago The whole fifty year mortgage thing hasn't helped either. permalink parent award report block reply AppalachianTactical 33 points 10 hours ago Yeah, and I dont even think its that big of a deal, but when you are talking 50 year mortgages on top of getting rid of the penny and americans arent smart enough to do the tech jobs, it just looks hackney. 50 year mortgage could have its place maybe helping 20 year olds get a house, but whats scary is the elite are thinking raise retirement age too. Nothing for us. Everything for the leeches. permalink parent award report block reply view 7 more comments... tiller 14 points 10 hours ago I suspect it's about the Epstein names or the trillions wasted on lsraeI and the billions we gave away to Argentina and Ukraine. None of it was an investment. Ask any struggling American family and they'll tell you those nations are not our friends - they are our parasites. permalink parent award report block reply JimmyJ 5 points 10 hours ago Agreed that a 50 year mortgage is insane, but so is paying 50 years of property tax, however, I do believe Daddy Trump thinks this is at least a way to help young people afford a home at this point.  There is no reason to not refinance.  However, again, property and wood are way overpriced. permalink parent award report block reply view 1 more comments... Kingoftheroad 3 points 5 hours ago And the recent elections all over where democrat candidates are stomping republican ones which has been a predictor for who wins the following midterms is a bad sign for whats coming for us if it holds true again like it has for 20 years permalink parent award report block reply view 1 more comments... vegaspatriot1776 8 points 3 hours ago And also wanting 600,000 chinese to attend our universities because somehow harvard needs it! Plus the 50 year mortgage. MAGA? permalink parent award report block reply behemoth887 6 points 7 hours ago idk how he still has this h1jeet stance when he had that interaction with a jeet and all he could say was \"i can't understand you\" over and over that wasn't just one jeet who couldn't speak english, that's all of them. and the bad news is they think they're fluent and speak really well. permalink parent award report block reply bumpman 0 points 10 hours ago Not millions, he lowered it to 25,000 and it costs $100k fee for each one permalink parent award report block reply 7PC_Principle 13 points 10 hours ago 🤣🤣 pay attention to things beyond bullshit propaganda that is coming out of Trump's mouth. $100k fee only applies to brand NEW applications and not the existing ones.\nNext, they processed H1B applications in mass numbers even through the shutdown. So in a sense companies aren't getting rid of H1Bs ... Plus this is why I don't follow bullshit political accounts on X or anything for that matter. It's all bullshit propaganda and engagement farming to stay relevant. It's all crap. Look that that stupid dumbass cat-retard for example..or that binder brigade DC darino moron. It's all propaganda engagement farming bullshit... permalink parent award report block reply view 1 more comments... AppalachianTactical 12 points 10 hours ago You believe that?\nAt the same time he is saying Americans are too stupid to do tech jobs, you think he will limit the number of them to 25k? permalink parent award report block reply view 1 more comments... LearnAboutRoaches -4 points 10 hours ago Stop making sense .. WE hate the brown people! Regardless of what he says Trump really is going to import 500 million street shitters and you sheep are letting him! Lol permalink parent award report block reply LearnAboutRoaches -11 points 10 hours ago He didn't say millions and he was not talking about all Americans. Idiot. Are you actually trying to say there are no low iq, low energy uneducated white people in America? What an idiot. permalink parent award report block reply vegaspatriot1776 2 points 3 hours ago He didn't say it, Trump said it. permalink parent award report block reply view 2 more comments... TwoWords 2 points 1 hour ago ok shitskin permalink parent award report block reply view 1 more comments... ReallyGayMods 63 points 10 hours ago The outrage isnt unreasonable. Trump said americans don't have the talent in a lot of areas so we gotta import people who don't speak English and shit in the street to take good paying jobs from us. Itll be easier to train and reward them, than Americans. Which is objectively an awful, anti maga stance. If I would have told you a year ago that trump would be saying this, you wouldn't have believed it. We all would have believed biden and the democrats said it permalink parent award report block reply PROCIsAsshoe 19 points 10 hours ago Yeah it's an insanely retarded take from DJT and worthy of condemnation. Additionally, declaring \"MAGA dead\" is just the shills trying to amplify and sow disharmony. MAGA as a movement isn't dead, we just need to continue to push back in areas where disagreements arises. Almost as if that's what the representative form of government requires, ideas and feedback. Regardless of wtf kind of mistake he has made, MAGA isn't dead unless you're into high school theatrics. permalink parent award report block reply ReallyGayMods 21 points 10 hours ago I agree but we need to figure out what the fuck is going on The Epstein 180 really did kill our momentum, even though like half of this website doesn't wanna believe it. Pam bondi is so useless trump makes posts begging her to do something like he did with sessions and Barr. 50 year mortgage is one of the worst things I've ever heard of. Hes much more aligned with isreal this term than last. And I just saw a post that he wants to rename veterans day to victory day, like a lib rewriting history and changing \"offensive\" holiday names Something changed and its on us to put pressure on him and say what the fuck are you doing. Not bootlick and say yea give me the 75 year mortgage daddy permalink parent award report block reply view 2 more comments... KernalMustard 8 points 9 hours ago It is dead. It died the day we bombed Iran for Israel. Everything I predicted is coming true because you all were too fuck8ng blind to see it. I'm MAGA I sure as fuck dont support Trump anymore. permalink parent award report block reply view 1 more comments... Faintlight 2 points 9 hours ago When he's fucking up this bad, what do you recommend to get his attention? permalink parent award report block reply DeportThemAllForever 2 points 2 hours ago 50 year mortgage is worse.  Let’s pawn all risk onto taxpayers as lenders and builders go party collecting massive cash windfalls. It’ll turn everyone into bank tenants. Part of that you’ll own nothing. permalink parent award report block reply CaptainCuomo 16 points 10 hours ago \"I don‘t even know what they are referring to?\" Headline: Donald Trump's \"Insane\" Comment About American Workers Having No Talent Is Going Viral, And People Are Saying MAGA Has \"Officially Imploded\" Better to watch President Trump actually speaking, than rely on an interpretation: https://youtu.be/D9IU6xYC2gs?si=byZA9h9FXv6Jp2WK&t=320 permalink parent award report block reply CaptainRumington 2 points 22 minutes ago Posted by Fox News, a Disney owned corporation with the ability to edit releases. permalink parent award report block reply CaptainCuomo 1 points 2 minutes ago Do you think they manufactured that clip, to make it look like President Trump said super-retarded shit-- even though his real answer was actually better? permalink parent award report block reply American-Free-Man -6 points 5 hours ago \"Well, we have plenty of talented people,\" Ingraham said. Key word he was responding to is \"plenty\" and than Ingraham shoots back with \"we don't have talented people here?\" Stupid Bitch!!! and now TDS infected anti-trumpers are running with what she said and not what POTUS was saying is that we won't have ENOUGH people in certain areas. I know, I know..... he could have spelled it out better but hearing him talk about the trillions of dollars in investments pouring into our country what like $20 trillion by the end of the year. I've been wondering  myself how the hell are we going to fill all the high tech positions coming. Surely not with a whole generation of entitled children that don't want to work. Believe me I want as little H1B's as possible, if any, but I'm sure they've been crunching the numbers and they need 2+2 to equal 4 and not 5 to make the coming high tech industrial boom not fail before it's even off the ground. Without more information I'm in the same boat as most people, No H1B's but I also want America to be at the fore front of the next high tech industrial revolution regardless. The next few years could make or break this Country. permalink parent award report block reply CaptainCuomo 3 points 4 hours ago \"$20 Trillion by the end of the year\". That's a crazy number. The US GDP has been above $20 Trillion every year-- since 2017.  So that's not some new record being broken. There is NOT another $20 Trillion in foreign investments arriving by the end of the year. Nor is there $20 Trillion in tariffs being collected-- not even close. So... no... there is not $20 Trillion dollars of Demand pouring into US high-tech labor markets/ with no American workers to fill those spots. \"Stupid Bitch!!!\" You want her to be like the Dem FAKE NEWS-- and not ask our President the real, obvious questions on MAGA voters' minds?! I have a couple of \"white pill\" beliefs about Trump & the economy-- which pretty-much bail him out of trouble (in my mind) on nearly-any occasion:   1.) Whenever Trump makes an unconventional move, it-- by definition-- defies conventional opinion.  So it's super-easy to complain, on conventional grounds.  But conventional thinking is the wrong way to judge unconventional actions.   2.)  US economic policy has been so mindlessly conventional-- for So Long!-- that ANY move away from the Same Old Shit-- will have at-least a momentary \"Change Dividend\".     For example, taking the flippers off your feet & using them to paddle with your hands is-- in general-- a bad idea.  EXCEPT, if you've been using only your legs to swim 50 miles... then, yeah, your legs are probably exhausted & your arms Will Be better (temporarily).    That applies to things like Tariffs.   I think they're good.  I may be wrong.  But the US has been SO anti-tariff... for So Long... that switching to tariffs provides Short Term relief.  EVEN IF tariffs are (perhaps) bad policy In The Long Run. That said--  it's not good-- when Trump's pronouncements and policies don't clearly make sense On Their Own...   causing me to have to dip into my bottle of White Pills. permalink parent award report block reply Faintlight 4 points 9 hours ago Too much support for Bibi. permalink parent award report block reply RyanKeyOh 2 points 9 hours ago H1B permalink parent award report block reply load 1 more comments... DebunkTheLeft 12 points 11 hours ago FYI this was started by Nick Fuentes, who cares more about basking in his newfound celebrity status, than his country. permalink parent award report block reply Wexit-Delecto 22 points 10 hours ago Nick Fuentes, who cares more about basking in his newfound celebrity status, than his country Dude should just accept the H1Bs for his country. But is it still his country if it’s full of pajeets? permalink parent award report block reply sun_wolf 5 points 8 hours ago Nick Fuentes attacks Owen Benjamin for “betraying” the white race, yet Owen has made four new white children (and I think is aiming for twelve), and Fuentes has had zero. permalink parent award report block reply YouEssAye 3 points 2 hours ago Be sure to leave out the part where Owen is 18 years older and didn't have any kids yet or even marry his wife until he was a few years older than Nick is now. permalink parent award report block reply AmericanJawa 2 points 8 hours ago What does Fuentes hate this Mr. Benjamin for? permalink parent award report block reply view 1 more comments... Wexit-Delecto 0 points 1 hour ago DGAF about the celebrity gossip. Legal immigration is still replacement immigration. Including H1Bs. permalink parent award report block reply EyesSewnShut 1 points 10 minutes ago Comment removed by community moderators. permalink parent award report block reply TheRPatriot 9 points 10 hours ago Never got into him. He comes off as a self-loathing d-bag permalink parent award report block reply wartooth6 -4 points 10 hours ago His political personality will end the moment he finally experiences a woman's embrace.  He's way too uptight for his age. permalink parent award report block reply EyesSewnShut 1 points 10 minutes ago Comment removed by community moderators. permalink parent award report block reply Friendly_B -5 points 10 hours ago It's the snarling which is the first red flag.  He doesn't know God, you can just see it on his face and hear it in his voice. permalink parent award report block reply HeavyMetalPatriot 5 points 9 hours ago Nick is very openly religious and speaks regularly about his faith. We should all be snarling at anything threatening America. permalink parent award report block reply view 2 more comments... ParadigmShift2070 3 points 7 hours ago But enough about mark Levin and Ben Shapiro permalink parent award report block reply EyesSewnShut 1 points 9 minutes ago Comment removed by community moderators. permalink parent award report block reply maleitch 5 points 10 hours ago Yeah kid has risked more pointing out inconvenient facts and fighting for his generation of Americans. What the fuck have you down?  Did you ever leave your bedroom or reddit for maga? permalink parent award report block reply DebunkTheLeft 4 points 10 hours ago Nick wanted Kamala to be president. That's not exactly America First. Unless you're a deranged psycho. permalink parent award report block reply PROCIsAsshoe 3 points 10 hours ago wtf did he really? I hardly even know who he is but his name  gets mentioned far too often around here if that's the case. permalink parent award report block reply view 2 more comments... EyesSewnShut 1 points 8 minutes ago Comment removed by community moderators. permalink parent award report block reply TallestSkill -4 points 10 hours ago Good to know you condone Nick Fuentes and Ali Alexander grooming underage fanboys. It's only innocent foreplay to ask minors for nudes in your sick perverted sex cult. permalink parent award report block reply EyesSewnShut 1 points 5 minutes ago Comment removed by community moderators. permalink parent award report block reply AmericanJawa 5 points 10 hours ago FYI this was started by Nick Fuentes, who cares more about basking in his newfound celebrity status, than his country. Hacks gunna hack. permalink parent award report block reply patrioticwinning3 -4 points 10 hours ago OP is and H1B shill.  Just sayin'! permalink parent award report block reply AmericanJawa 8 points 10 hours ago OP is and H1B shill. Source? permalink parent award report block reply view 1 more comments... DebunkTheLeft 3 points 10 hours ago What's this: https://x.com/NickJFuentes/status/1988697670190526602 permalink parent award report block reply view 1 more comments... YT45 -6 points 10 hours ago Fuentes is almost as gay as Hasan Piker. permalink parent award report block reply HeavyMetalPatriot 5 points 9 hours ago Funny how much hate there's on PDW for anyone actually America First and not kneeling to the neocon MIGA bullshit. permalink parent award report block reply view 5 more comments... BlackJack1776 -5 points 10 hours ago Did Hasan also swap dick juice with Destiny? SPEZ: Yeah. This bitter truth is something fanbois of Twink Fuentes find hard to swallow. Cope and seethe. permalink parent award report block reply It_takes_10_years 2 points 2 hours ago Dude is right about everything. Why would anyone apologize for being correct? It’s like this: the boat is sinking, and he says, \"Hey, you idiots, stop patching the hull with printer paper  you need actual marine epoxy or we’re going under.\" Then the leak gets worse, the boat tilts harder, water pours in… and instead of admitting he was right, you all start shrieking:\n\"OMG why are you basking in your celebrity status in being right!?\" No he’s not basking.\nYou’re just embarrassed he called it before it collapsed.\nPeople who point out obvious failures aren’t the problem the people who refuse to fix them are. There is not a single fucking issue Nick Fuentes has been wrong on or did not predict correctly. Not a single fucking issue in 10 years.  His ideas are now mainstream conversative talking points now.  Imagine saying \"NO IMMIGRATION NOT EVEN LEGAL\" 10 years ago to republicans. permalink parent award report block reply load 9 more comments... awsure 10 points 10 hours ago MAGA is America First permalink parent award report block reply maleitch 22 points 10 hours ago On paper only it seems permalink parent award report block reply CrispyCracker2 5 points 9 hours ago At least that's what we all thought. It is for us, just not this administration apparently. permalink parent award report block reply EyesSewnShut 1 points 4 minutes ago Comment removed by community moderators. permalink parent award report block reply Than0sIII 2 points 10 hours ago It's all power play bullshit by people wanting to become thought leaders and take control of the greater \"right\" for 2028+. That and intentional sabotage for 2026. permalink parent award report block reply NotYourMan 2 points 4 hours ago This is exactly like 2020.  The same thing happened on reddit back then.  The rift over affordability and the 50 year mortgage thing is a psyop to beat us down.  Stay strong with Trump (because we really don't want democrats in power). permalink parent award report block reply load 11 more comments... MemeLawd 51 points 10 hours ago \"MAGA\" was dead when Israel convinced Trump to not release the Epstein Files and bomb Iran instead. permalink award report block reply Donger-Lord 17 points 9 hours ago We had a good run. The first few months were looking good until Trump got “the call”. Can’t have America being successful now, can we? permalink parent award report block reply Awakened 48 points 11 hours ago MAGA is America first and niether are going anywhere. permalink award report block reply maleitch 67 points 10 hours ago Then Trump needs a reminder permalink parent award report block reply Awakened 9 points 10 hours ago Keep screaming and don't stop. It's worked before. permalink parent award report block reply ReallyGayMods 14 points 10 hours ago Is a 50 year mortgage really exciting for you though? Can you really not admit that things have been really off lately? Do you really its better for America to have a retard from India who doesn't speak English make missles instead of a generic American? permalink parent award report block reply Awakened -3 points 10 hours ago You are accidentally responding to the wrong person or you're the worst troll on this board because I have no idea what you are going on about. permalink parent award report block reply view 1 more comments... MehNahMehNah 1 points 17 minutes ago Especially since it was his signature catchphrase. permalink parent award report block reply UsernameChexOut 17 points 10 hours ago That's correct. We are the movement now. Sadly, it's starting to look more and more like Trump is no longer the person to lead this movement. It's now up to us frens. permalink parent award report block reply SwedishChainsaw2 5 points 2 hours ago We always were the movement. Trump was our proxy. We always knew his tenure would not be forever and we'd have to find another. I personally was hoping it would be at the end ofnhis term, not 10 months into it. permalink parent award report block reply entwickelnden 1 points 46 minutes ago I wonder, having been shot already, if there are substantial threats to his family, by the deep state, that's fomenting the change as well. And he's probably seeing these compromises as a way of preventing an implosion his first year into it. Im happy about some of the things he's done and more importantly, how many ppl have woken up, I will be forever great full to him, and will give him the benefit of the doubt until his 3rd year. I'm not saying I won't voice my opinion and disagree, he needs to hear it from us, but I'm not about to bail on the guy who took a bullet and keeps fighting. permalink parent award report block reply Girthquakes -10 points 9 hours ago Wrong forum fag, c/mypussyhurts is 👉 that way. permalink parent award report block reply RyanKeyOh 6 points 9 hours ago No. MAGA is now MIGA. AF is still AF permalink parent award report block reply NotLikeThis 42 points 10 hours ago This is a boomer take. Almost every gen z conservative is \"America First\". Trump's fucking up with the H1B, 50 year mortgage, Israel worship. Circle jerking instead of pushing back on Trump will, in fact, kill MAGA. permalink award report block reply DEUSVEULT232 38 points 10 hours ago Its not doomerism to point out that importing foreigners into our country at the detriment of our own workers is wrong. Trump implying, we can't train our own people because we are stupid is absurd and will fracture this movement. All the BS the last couple months over foreign policy won't stop the MAGA movement, but this H1B issue will. The sad thing is the Dems will win and undue everything Trump accomplished and usher in communism. permalink award report block reply OneTypoComment 34 points 11 hours ago current psyop is fatiguing permalink award report block reply Repentnow 14 points 11 hours ago And there seems to be an endless amount of them here too, as of late. permalink parent award report block reply OneTypoComment 10 points 10 hours ago Yup, but they're not all in on it; some simply fell for it. The media is an outrage driven machine. Nearly everything is meant to outrage and drive engagement. The frothier people get, they more the click and share permalink parent award report block reply Wexit-Delecto 5 points 10 hours ago Thank goodness President Trump isn’t actually pro H1B! Phew! permalink parent award report block reply OneTypoComment -1 points 10 hours ago did he claim at any time he was going to end H1B completely? permalink parent award report block reply view 7 more comments... Helly 1 points 3 hours ago Woke right permalink parent award report block reply lizardo221 1 points 7 hours ago I couldn't agree more. permalink parent award report block reply bumpman -2 points 10 hours ago It happens every year after the election, the never trumpers and paid shills come out in full force to counter signal MAGA and trump, then trump comes back stronger than ever and they start apologizing and trying to crawl back in. In 17/18 it was Russia Russia and Charlottesville hoax In 2021/22 it was Jan 6, mass censorship and the “desantis train” Now it’s Israel and H1B permalink parent award report block reply seeling0 1 points 10 hours ago Remember when the same whores were crawling about here during the election reminding everyone that voting was pointless and Trump would never ever in a million years get a second term? Good times. permalink parent award report block reply CaptainCuomo 30 points 10 hours ago Christ is King. permalink award report block reply Doctornirgon 26 points 10 hours ago Not sure I'm qualified enough to vote, better bring in an H1B permalink award report block reply BadBrainsBuzzcocks 22 points 10 hours ago Oh let's see, asking us to accept 50 fucking year mortgages with astronomical interest and deferred equity along with 15yr car loans, $2000 inflation inducing stimulus, telling us we need to educate 600k chinese spies and that failing Marxist colleges shouldn't crash and burn and then ARGUING we aren't talented enough to do the jobs shit throwers can do is certainly NOT America first. I'm pretty fucking pissed. permalink award report block reply JesusTheOnlyWay 7 points 6 hours ago Precisely. Maga is dead? I don't know. Maga is dying? Yes, absolutely. At least the version of it that relied on Trump. permalink parent award report block reply AppalachianTactical 19 points 10 hours ago Whatever is next, everyone should have learned that there can be no thought leader. The right needs to follow beliefs that cannot be undermined like people can. I dont just mean the constitution, but a list for americans in our time. I dont disagree that maga is on its last legs if not dead. Trump has three years to prove he was loyal to Americans rather than Israel, but he has given me zero faith this term. permalink award report block reply RyanKeyOh 8 points 9 hours ago he has LESS THAN ONE If Dems sweep the midterms the impeachment BS will start again and we will lose all momentum permalink parent award report block reply eclectic22 17 points 11 hours ago Long live MAGA! permalink award report block reply Wexit-Delecto 22 points 10 hours ago 2016 MAGA. Not this nu-MAGA that begs for more replacements as long as they come legally. permalink parent award report block reply ParadigmShift2070 12 points 9 hours ago Judeo-maga permalink parent award report block reply RyanKeyOh 3 points 9 hours ago Kek permalink parent award report block reply ArchRespawnsAgain 15 points 10 hours ago Why did you post this same screenshot three times? https://scored.co/c/TheDonald/p/1ARK9pelsH/the-latest-totally-organic-scrip/c https://scored.co/c/TheDonald/p/1ARK9peUgy/democratic-national-committee-is/c permalink award report block reply YouEssAye 15 points 10 hours ago Are we making America great again yet, or is that gonna be in two more weeks? I'll just trust the plan. Q will save us. Edit: The stickies from the late night through early morning(EST time) are always pushing a certain narrative. It's uncanny once you notice it. It's almost like the mod is in a different time zone. permalink award report block reply heightnoise 11 points 10 hours ago It's almost like the mod is in a different time zone. Isn't it incredible? Its almost like the hours of 11:00pm to 8:00am EST coincide with the workday hours of a...certain part of the world. permalink parent award report block reply Wexit-Delecto 11 points 10 hours ago We can definitely count on this site to keep MAGA’s dream of being replaced by H1V third worlders alive. permalink award report block reply M-m-m-my-corona 11 points 10 hours ago And Trump killed it.  The sooner you guys realize that and  come over to our side, the better.  Or go die for Israel.  Your choice. permalink award report block reply AmericanJawa 8 points 10 hours ago MAGA is America First. permalink award report block reply maleitch 9 points 10 hours ago Yeah nothing says America first like replacing Americans with foreigners. permalink parent award report block reply AmericanJawa 1 points 8 hours ago Yeah nothing says America first like replacing Americans with foreigners. \"replacing Americans with foreigners\" isn't MAGA. permalink parent award report block reply NancyPeloci 7 points 11 hours ago Why are we dead this time?  Net neutrality?  Global Warming? permalink award report block reply ReallyGayMods 12 points 10 hours ago Trump said americans don't have the talent in a lot of areas so we gotta import people who don't speak English and shit in the street to take good paying jobs from us permalink parent award report block reply lizardo221 4 points 5 hours ago People are misquoting the president and pretending our manufacturing industries were not bored out over the last half century by globalization. Where I think the administration could do a better job is explaining the process of getting Americans back up to speed, and making sure that ones qualified - actually qualified - are in fact getting jobs over foreigners. Some of this is also on the republicans in Congress to figure out these visa programs, structuring them better and more clearly. permalink parent award report block reply barwhack 7 points 11 hours ago Hmm. I don't feel dead... permalink award report block reply MagaJay02 6 points 11 hours ago We've heard thos hundreds of times over the years. Yeah, things are rough currently, we aren't 1 year in. Nobody said things wouldn't be rocky! permalink award report block reply ReallyGayMods 16 points 10 hours ago Nobody expected the rockiness to come from our guy though permalink parent award report block reply MagaJay02 1 points 10 hours ago Meh. I've seen it go in circles over the years. I think Trumps biggest issue right now is he's bragging about the economy and other things. It'd feel way better if she showed the wins, without embellishments, but also point out we have a long road to go down to solve a ton lf issues that are still plaguing Americans. permalink parent award report block reply ReallyGayMods 5 points 10 hours ago 1000%. Telling me the economy is doing so good reminds me of the 4 years the biden admin told me that. permalink parent award report block reply Litterboxer1 0 points 10 hours ago What makes you think it isn't? permalink parent award report block reply view 1 more comments... lizardo221 1 points 5 hours ago I think part of the problem is that he is far more focused on long term than short term, and most people are very bad at long term thinking. You have energy unleashed, massive amounts of investment for producing all kind of things on our shores, RFK taking an axe to the bad medical system, and far more control over the flow of people than we have had in a long time - all examples of things that can take many years to fully produce results. The seeds have all been planted for these things and more, but many Americans are hurting in the immediate right now, and that cannot be ignored. Not just Trump, but Republicans as a whole have to come up with better short term measures to buy time. That includes the Tuckers and Mark Levin's of the world - everyone needs to stop wasting their time on bullshit and think of real solutions. With regards to the H1B topic,  it is very complicated and I don't think it is as simple as Trump thinks Americans are too stupid. I can get into the weeds, but my view is that he has a relaxed attitude towards it largely because it's one of the few ways he can brute force prices down in some areas. It's not something that matters long term because a ton of those jobs will get replaced by ai anyway. permalink parent award report block reply Apersonofinterest 11 points 10 hours ago As Bannon likes to say, they aren’t just going to give up and hand us the keys. We have to fight them and take the motherfuckers. permalink parent award report block reply ReallyGayMods 7 points 10 hours ago But we elected trump for that.. now he's having democrat opinions on foreign labor permalink parent award report block reply Apersonofinterest 1 points 7 hours ago I don’t think it’s the mods that are gay… permalink parent award report block reply Wexit-Delecto 2 points 10 hours ago Fight them… with H1Bs! permalink parent award report block reply altYPNeT 4 points 9 hours ago Trump should stop shooting himself in the foot. Maybe then the boat will stop rocking. permalink parent award report block reply Scumbag-reddit 5 points 4 hours ago These faggots are trying to claim they're starting america first? MAGA is America First permalink award report block reply Ghost_Division 5 points 10 hours ago This isn't the first time trump has said something then gotten bodied by the base. permalink award report block reply TooBright 5 points 9 hours ago Trump is still your president. permalink award report block reply FerkenBlerkin 5 points 10 hours ago All Fuentes does lately is make me understand why people call him a faggot. permalink award report block reply hairless_ap3 4 points 3 hours ago Bunch of paid faggots And if you're one of the faggots that sits around all day listening to faggots like this thinking you need them to tell you how to live your life fuck off permalink award report block reply Roadpower 4 points 11 hours ago For the Horde! permalink award report block reply Dev404 4 points 10 hours ago Exactly what has made MAGA dead? MAGA isn't this administration, nor is it just Trump. If it's gone, what took over? A vague statement like that doesn't actually mean a damn thing. This looks like more attention-seeking drama queen mentality. permalink award report block reply Snek_Plissken 4 points 9 hours ago Oh no, some bots said some things on twitter!\nAnyway. permalink award report block reply MAGA-Fett 3 points 10 hours ago So what are they sperging out about? permalink award report block reply Paxvobiscum 3 points 10 hours ago While they're being dramatic, we all know we disagree with these moves permalink award report block reply 5121313 3 points 11 hours ago 🤣 The Brain Dead Shall Speak when Told... permalink award report block reply TexasBeer 3 points 10 hours ago “America First” is the natural path forward. In the order of first loves, funding Israel and wasting tax dollars on foreigners won’t cut it anymore. permalink award report block reply jiujiujiu 3 points 7 hours ago Uh what’s the difference between making America great again and America first? Seems the same to me permalink award report block reply Dallasguy 3 points 10 hours ago I don't understand. When is MAGA not America First? permalink award report block reply ParadigmShift2070 1 points 9 hours ago When the Judeo-cons say it's un-American if you don't support Israel permalink parent award report block reply AmericanJawa 1 points 8 hours ago When the Judeo-cons say it's un-American if you don't support Israel People trying to hijack MAGA for their own personal agendas means MAGA is dead? permalink parent award report block reply CaliAli 3 points 10 hours ago I thought  America First = MAGA - what am I missing? permalink award report block reply lizardo221 3 points 5 hours ago It has been, but a handful of nuts are trying to splinter the right and make America First something else. We have a lot of bots floating around here lately pushing all kinds of weird crap. permalink parent award report block reply Haz85 3 points 4 hours ago All the bots are saying it though, so it must be true permalink award report block reply LaMigraEspecial 3 points 10 hours ago Dead Internet Theory strikes again! permalink award report block reply Minn2000 3 points 10 hours ago I only recognize 2 of the accounts above and both of them are retarded. permalink award report block reply Kricket 3 points 10 hours ago They post here too lol permalink award report block reply f_bastiat 2 points 9 hours ago MAGA will be dead when our national debt is 0, so basically MAGA is forever. permalink award report block reply keeman 2 points 8 hours ago I'd really like it if MAGA could start actually acting like America First.  Seeing a lot of Isreal First.  Seeing a lot of big business first.  Seeing a lot of focus on fixing other countries' problems.  Seeing a lot of defense or H1B and ridiculous levels of foreign students. permalink award report block reply pedeypete 2 points 4 hours ago Give them a little slack, their weak little minds don't want to be MAGA but America First is the same fucking thing. When we make American interest First, we know what it is. permalink award report block reply knnbccb 2 points 10 hours ago Remember when Elon Musk was about to acquire Twitter and there was a concern about the number of bots (vs real users) in Twitter? You're witnessing this now. permalink award report block reply lizardo221 1 points 5 hours ago Christ, you're right. permalink parent award report block reply sir_rockness 2 points 2 hours ago Trump said the economy is doing great and we're crazy if we disagree... sorry I haven't seen shit done for main street USA.  Lots of great datacenter deals though.   Then he said we're too dumb to perform highly skilled jobs... even though I've been in that industry for around 30 years DOING IT... largely self taught... and watching FUCKING PAJEETS and greedy CEOS destroy this industry for at least 15 of them. Then add on the Israel first bullshit (which is absolutely true) I love the guy but he seriously needs to get his head out of his ass now because he's starting to look about like the sons of bitches in congress who hate us and only exist to steal our wealth. permalink award report block reply RobinNet 2 points 10 hours ago turn on my smart watch... nope- still got a pulse. permalink award report block reply presticus 2 points 11 hours ago If Nick Fuentes & Dean Withers agree on something you know they're both retarded. permalink award report block reply ThatsGold 2 points 10 hours ago It was a good run permalink award report block reply PatriotDescendant 2 points 2 hours ago Trump's thoughts on H1Bs is asinine/naive/misinformed, as is the 50 year mortgage thing. But I won't turn. permalink award report block reply KungPaoMcChicken 2 points 10 hours ago Maybe if more of you were on X to counter this nonsense. Oh right, we are here instead. Right.. permalink award report block reply lizardo221 2 points 5 hours ago I wonder sometimes if I should bail on this website. It doesn't function at all like it did years ago. I almost stay here simply to defend MAGA at this point. permalink parent award report block reply Wexit-Delecto 1 points 10 hours ago X never unbanned most of us. permalink parent award report block reply KungPaoMcChicken 2 points 9 hours ago I got banned from X after Elon was going through his anti censorship phase for trying to trigger mens rights activists. permalink parent award report block reply CalMagaMan 2 points 10 hours ago We are MAGA and we are Legion. They clearly don’t understand this yet. They still think MAGA is a single man. permalink award report block reply bluewhiteandred 2 points 10 hours ago maga dead for the umpteenth time... somehow keeps finding ways to revive! edit: I like how we were just celebrating a shutdown reopening win and then suddenly \"M@G@ 1Z D3D!!!\" becomes a meme... just like a rollercoaster of people getting irrationally optimistic and dooming over and over. and then just before that \"it was all over\" because of the fake blue wave elections last week. and in 2020 it was \"all over\" because of the stolen election. What will cause the insane optimism next week? permalink award report block reply DomTullipso 1 points 4 hours ago And Trump killed it by saying \"Epstein who? You stupid weaklings\" permalink award report block reply NeoDragoon 1 points 10 hours ago Fuentes isn't an incel, he's just a faggot that gets fucked by Destiny. permalink award report block reply how_could 1 points 2 hours ago NGL I always thought MAGA was an America First agenda but its not right now. We need to evolve toward America First or we will never be great again, importing endless Indians to take the white collar jobs and Mexicans to take the manual labor and chjn3se students to become the future ph.Ds. permalink award report block reply It_takes_10_years 1 points 2 hours ago Nick Fuentes is right about everything. permalink award report block reply CocaineNewsome 1 points 3 hours ago Turns out we were the MAGA all along. permalink award report block reply Than0sIII 1 points 11 hours ago Retarded purity testing.  Yeah Trump is weirdly fumbling the ball but ultimately we wouldn't be here without MAGA, and the alternative to here is way worse. permalink award report block reply NotLikeThis 7 points 10 hours ago term 1 repeat permalink parent award report block reply ReallyGayMods 4 points 10 hours ago I agree with your sentiment- this is beyond purity testing though permalink parent award report block reply YodaBannon 1 points 11 hours ago MAGA polls will be YUGE tomorrow permalink award report block reply Tartakovsky 1 points 10 hours ago I’m a zombie? permalink award report block reply GallowsTime 1 points 2 hours ago Who cares what a bunch of commie bots say? permalink award report block reply Txiribiton 1 points 4 hours ago People are MAGA. Government and dual citizens are MIGA. permalink award report block reply MehNahMehNah 1 points 20 minutes ago Nietzche said God is Dead way back when, and he was misunderstood. And Nietzche is now actually dead. permalink award report block reply taytaytay 1 points 10 hours ago Sounds like some of the slack jawed faggots that hang around PDW permalink award report block reply thisperson 1 points 2 hours ago America first makes sense, if H1-B is MaGA. permalink award report block reply XxxRDTPRNxxX 1 points 10 hours ago If they actually follow \"America First\" I don't care what they call themselves. permalink award report block reply 5DchessWatch 1 points 10 hours ago mafia affiliates get attenuated permalink award report block reply PiratePatriotParrot 1 points 10 hours ago If they don't fix the H1-B permalink award report block reply PillarOfWisdom 1 points 16 minutes ago What's wrong with America being first? Over the past couple of weeks, we've learned that MAGA is: 50 year mortgages 600k communist Chinese students More and more H-1Bs permalink award report block reply booblitchutz 1 points 3 minutes ago Hm and I was thrown off X so this kind of shit could proliferate unchallenged, I can only assume. They said I was “spamming” which is completely bogus. I never repeated a fucking thing or used any kind of platform manipulation, just posted my own authentic opinions. permalink award report block reply Easzq8 1 points 8 hours ago Botty botto blyat bot permalink award report block reply boogeyman420 1 points 2 hours ago Nothing wrong with demanding results from your government permalink award report block reply maleitch 0 points 10 hours ago Jesus why don't call them antisemitic while you are challenging your full Marxists debate tactic. Maga is bigger than one man, and I hope he has some grand plan because at the moment he is losing people who stuck but him.  You can go full reddit faggot and demand tribal loyalty over conviction but that just proves you were never maga to begin with. permalink award report block reply Bacha_Bazi_Biden 0 points 1 hour ago Israel’s actions in the Middle East have brought Trump’s relationship with Israel and their influence over our government into question. You’re now called “Anti-Semitic” by people that claim they’re MAGA for any criticisms of Israel. Only 400,000 illegal aliens have been deported since his second term starts. Only 49,600,000 left. 50 year mortgages that our children or grandchildren will have to pay off sounds retarded at face value. H1B scam hasn’t been nipped in the bud, with Elon being a big beneficiary of the loophole. You can disagree like what I’m saying, but everything above is dividing the base, especially Israel. permalink award report block reply Mhmm2MoreWeeks 0 points 10 hours ago MAGA is not dead. Its just splitting in Two. Jew Haters, and NOT Jew Haters. By Design. permalink award report block reply DeplorableNeandertal 0 points 7 hours ago Nah just booting the zio bros and jeets permalink award report block reply grannylovestrump -1 points 10 hours ago Death where is they sting. permalink award report block reply SavingPrivateGrace -1 points 10 hours ago This was because of the election sweep of voted D win commies. permalink award report block reply Bball-gurl -1 points 4 hours ago MAGA has BEEN dead, change my mind. You guys are a cult if you can't realize it. If we plan on reviving MAGA, Trump will NOT be the guy for the job. permalink award report block reply ohpleaseuhhelpame -2 points 10 hours ago Its either MAGA and America First or its Socialism, Communism and the takeover by Muslims..take your pick. I'm sticking with MAGA! These people are stirring up crap and are not MAGA! permalink award report block reply Brandon1776 -2 points 10 hours ago The jew is afraid. It sould be. MAGA is dead, dear leader sold us out to Modi and Xi permalink award report block reply MondayCoupleIsDead -2 points 6 hours ago Incels? Are you a leftist woman, OP? Gay fuck. permalink award report block reply CrispyCracker2 -2 points 9 hours ago Well, it IS if Trump doesn't see what's going on and wakes the FUCK UP. permalink award report block reply EyesSewnShut 1 points 15 minutes ago Comment removed by community moderators. permalink award report block reply AlmostFullyDilated 0 points 7 hours ago Comment removed by community moderators. permalink award report block reply\nmagapatriot_pa 90 points 11 hours ago For as long as I draw breath, MAGA is not dead. I'll MAGA all by my damn self if I have to permalink award report block reply Lelleck 54 points 11 hours ago I don‘t even know what they are reffering to? I don‘t have the chance to follow every step of these people since I work and have a life outside of the internet… permalink parent award report block reply AppalachianTactical 93 points 10 hours ago Trump saying we need to import millions of Indian H1Bs because Americans aren't smart enough to do the job. permalink parent award report block reply Hangemh1gh 73 points 10 hours ago The whole fifty year mortgage thing hasn't helped either. permalink parent award report block reply AppalachianTactical 33 points 10 hours ago Yeah, and I dont even think its that big of a deal, but when you are talking 50 year mortgages on top of getting rid of the penny and americans arent smart enough to do the tech jobs, it just looks hackney. 50 year mortgage could have its place maybe helping 20 year olds get a house, but whats scary is the elite are thinking raise retirement age too. Nothing for us. Everything for the leeches. permalink parent award report block reply view 7 more comments... tiller 14 points 10 hours ago I suspect it's about the Epstein names or the trillions wasted on lsraeI and the billions we gave away to Argentina and Ukraine. None of it was an investment. Ask any struggling American family and they'll tell you those nations are not our friends - they are our parasites. permalink parent award report block reply JimmyJ 5 points 10 hours ago Agreed that a 50 year mortgage is insane, but so is paying 50 years of property tax, however, I do believe Daddy Trump thinks this is at least a way to help young people afford a home at this point.  There is no reason to not refinance.  However, again, property and wood are way overpriced. permalink parent award report block reply view 1 more comments... Kingoftheroad 3 points 5 hours ago And the recent elections all over where democrat candidates are stomping republican ones which has been a predictor for who wins the following midterms is a bad sign for whats coming for us if it holds true again like it has for 20 years permalink parent award report block reply view 1 more comments... vegaspatriot1776 8 points 3 hours ago And also wanting 600,000 chinese to attend our universities because somehow harvard needs it! Plus the 50 year mortgage. MAGA? permalink parent award report block reply behemoth887 6 points 7 hours ago idk how he still has this h1jeet stance when he had that interaction with a jeet and all he could say was \"i can't understand you\" over and over that wasn't just one jeet who couldn't speak english, that's all of them. and the bad news is they think they're fluent and speak really well. permalink parent award report block reply bumpman 0 points 10 hours ago Not millions, he lowered it to 25,000 and it costs $100k fee for each one permalink parent award report block reply 7PC_Principle 13 points 10 hours ago 🤣🤣 pay attention to things beyond bullshit propaganda that is coming out of Trump's mouth. $100k fee only applies to brand NEW applications and not the existing ones.\nNext, they processed H1B applications in mass numbers even through the shutdown. So in a sense companies aren't getting rid of H1Bs ... Plus this is why I don't follow bullshit political accounts on X or anything for that matter. It's all bullshit propaganda and engagement farming to stay relevant. It's all crap. Look that that stupid dumbass cat-retard for example..or that binder brigade DC darino moron. It's all propaganda engagement farming bullshit... permalink parent award report block reply view 1 more comments... AppalachianTactical 12 points 10 hours ago You believe that?\nAt the same time he is saying Americans are too stupid to do tech jobs, you think he will limit the number of them to 25k? permalink parent award report block reply view 1 more comments... LearnAboutRoaches -4 points 10 hours ago Stop making sense .. WE hate the brown people! Regardless of what he says Trump really is going to import 500 million street shitters and you sheep are letting him! Lol permalink parent award report block reply LearnAboutRoaches -11 points 10 hours ago He didn't say millions and he was not talking about all Americans. Idiot. Are you actually trying to say there are no low iq, low energy uneducated white people in America? What an idiot. permalink parent award report block reply vegaspatriot1776 2 points 3 hours ago He didn't say it, Trump said it. permalink parent award report block reply view 2 more comments... TwoWords 2 points 1 hour ago ok shitskin permalink parent award report block reply view 1 more comments... ReallyGayMods 63 points 10 hours ago The outrage isnt unreasonable. Trump said americans don't have the talent in a lot of areas so we gotta import people who don't speak English and shit in the street to take good paying jobs from us. Itll be easier to train and reward them, than Americans. Which is objectively an awful, anti maga stance. If I would have told you a year ago that trump would be saying this, you wouldn't have believed it. We all would have believed biden and the democrats said it permalink parent award report block reply PROCIsAsshoe 19 points 10 hours ago Yeah it's an insanely retarded take from DJT and worthy of condemnation. Additionally, declaring \"MAGA dead\" is just the shills trying to amplify and sow disharmony. MAGA as a movement isn't dead, we just need to continue to push back in areas where disagreements arises. Almost as if that's what the representative form of government requires, ideas and feedback. Regardless of wtf kind of mistake he has made, MAGA isn't dead unless you're into high school theatrics. permalink parent award report block reply ReallyGayMods 21 points 10 hours ago I agree but we need to figure out what the fuck is going on The Epstein 180 really did kill our momentum, even though like half of this website doesn't wanna believe it. Pam bondi is so useless trump makes posts begging her to do something like he did with sessions and Barr. 50 year mortgage is one of the worst things I've ever heard of. Hes much more aligned with isreal this term than last. And I just saw a post that he wants to rename veterans day to victory day, like a lib rewriting history and changing \"offensive\" holiday names Something changed and its on us to put pressure on him and say what the fuck are you doing. Not bootlick and say yea give me the 75 year mortgage daddy permalink parent award report block reply view 2 more comments... KernalMustard 8 points 9 hours ago It is dead. It died the day we bombed Iran for Israel. Everything I predicted is coming true because you all were too fuck8ng blind to see it. I'm MAGA I sure as fuck dont support Trump anymore. permalink parent award report block reply view 1 more comments... Faintlight 2 points 9 hours ago When he's fucking up this bad, what do you recommend to get his attention? permalink parent award report block reply DeportThemAllForever 2 points 2 hours ago 50 year mortgage is worse.  Let’s pawn all risk onto taxpayers as lenders and builders go party collecting massive cash windfalls. It’ll turn everyone into bank tenants. Part of that you’ll own nothing. permalink parent award report block reply CaptainCuomo 16 points 10 hours ago \"I don‘t even know what they are referring to?\" Headline: Donald Trump's \"Insane\" Comment About American Workers Having No Talent Is Going Viral, And People Are Saying MAGA Has \"Officially Imploded\" Better to watch President Trump actually speaking, than rely on an interpretation: https://youtu.be/D9IU6xYC2gs?si=byZA9h9FXv6Jp2WK&t=320 permalink parent award report block reply CaptainRumington 2 points 22 minutes ago Posted by Fox News, a Disney owned corporation with the ability to edit releases. permalink parent award report block reply CaptainCuomo 1 points 2 minutes ago Do you think they manufactured that clip, to make it look like President Trump said super-retarded shit-- even though his real answer was actually better? permalink parent award report block reply American-Free-Man -6 points 5 hours ago \"Well, we have plenty of talented people,\" Ingraham said. Key word he was responding to is \"plenty\" and than Ingraham shoots back with \"we don't have talented people here?\" Stupid Bitch!!! and now TDS infected anti-trumpers are running with what she said and not what POTUS was saying is that we won't have ENOUGH people in certain areas. I know, I know..... he could have spelled it out better but hearing him talk about the trillions of dollars in investments pouring into our country what like $20 trillion by the end of the year. I've been wondering  myself how the hell are we going to fill all the high tech positions coming. Surely not with a whole generation of entitled children that don't want to work. Believe me I want as little H1B's as possible, if any, but I'm sure they've been crunching the numbers and they need 2+2 to equal 4 and not 5 to make the coming high tech industrial boom not fail before it's even off the ground. Without more information I'm in the same boat as most people, No H1B's but I also want America to be at the fore front of the next high tech industrial revolution regardless. The next few years could make or break this Country. permalink parent award report block reply CaptainCuomo 3 points 4 hours ago \"$20 Trillion by the end of the year\". That's a crazy number. The US GDP has been above $20 Trillion every year-- since 2017.  So that's not some new record being broken. There is NOT another $20 Trillion in foreign investments arriving by the end of the year. Nor is there $20 Trillion in tariffs being collected-- not even close. So... no... there is not $20 Trillion dollars of Demand pouring into US high-tech labor markets/ with no American workers to fill those spots. \"Stupid Bitch!!!\" You want her to be like the Dem FAKE NEWS-- and not ask our President the real, obvious questions on MAGA voters' minds?! I have a couple of \"white pill\" beliefs about Trump & the economy-- which pretty-much bail him out of trouble (in my mind) on nearly-any occasion:   1.) Whenever Trump makes an unconventional move, it-- by definition-- defies conventional opinion.  So it's super-easy to complain, on conventional grounds.  But conventional thinking is the wrong way to judge unconventional actions.   2.)  US economic policy has been so mindlessly conventional-- for So Long!-- that ANY move away from the Same Old Shit-- will have at-least a momentary \"Change Dividend\".     For example, taking the flippers off your feet & using them to paddle with your hands is-- in general-- a bad idea.  EXCEPT, if you've been using only your legs to swim 50 miles... then, yeah, your legs are probably exhausted & your arms Will Be better (temporarily).    That applies to things like Tariffs.   I think they're good.  I may be wrong.  But the US has been SO anti-tariff... for So Long... that switching to tariffs provides Short Term relief.  EVEN IF tariffs are (perhaps) bad policy In The Long Run. That said--  it's not good-- when Trump's pronouncements and policies don't clearly make sense On Their Own...   causing me to have to dip into my bottle of White Pills. permalink parent award report block reply Faintlight 4 points 9 hours ago Too much support for Bibi. permalink parent award report block reply RyanKeyOh 2 points 9 hours ago H1B permalink parent award report block reply load 1 more comments... DebunkTheLeft 12 points 11 hours ago FYI this was started by Nick Fuentes, who cares more about basking in his newfound celebrity status, than his country. permalink parent award report block reply Wexit-Delecto 22 points 10 hours ago Nick Fuentes, who cares more about basking in his newfound celebrity status, than his country Dude should just accept the H1Bs for his country. But is it still his country if it’s full of pajeets? permalink parent award report block reply sun_wolf 5 points 8 hours ago Nick Fuentes attacks Owen Benjamin for “betraying” the white race, yet Owen has made four new white children (and I think is aiming for twelve), and Fuentes has had zero. permalink parent award report block reply YouEssAye 3 points 2 hours ago Be sure to leave out the part where Owen is 18 years older and didn't have any kids yet or even marry his wife until he was a few years older than Nick is now. permalink parent award report block reply AmericanJawa 2 points 8 hours ago What does Fuentes hate this Mr. Benjamin for? permalink parent award report block reply view 1 more comments... Wexit-Delecto 0 points 1 hour ago DGAF about the celebrity gossip. Legal immigration is still replacement immigration. Including H1Bs. permalink parent award report block reply EyesSewnShut 1 points 10 minutes ago Comment removed by community moderators. permalink parent award report block reply TheRPatriot 9 points 10 hours ago Never got into him. He comes off as a self-loathing d-bag permalink parent award report block reply wartooth6 -4 points 10 hours ago His political personality will end the moment he finally experiences a woman's embrace.  He's way too uptight for his age. permalink parent award report block reply EyesSewnShut 1 points 10 minutes ago Comment removed by community moderators. permalink parent award report block reply Friendly_B -5 points 10 hours ago It's the snarling which is the first red flag.  He doesn't know God, you can just see it on his face and hear it in his voice. permalink parent award report block reply HeavyMetalPatriot 5 points 9 hours ago Nick is very openly religious and speaks regularly about his faith. We should all be snarling at anything threatening America. permalink parent award report block reply view 2 more comments... ParadigmShift2070 3 points 7 hours ago But enough about mark Levin and Ben Shapiro permalink parent award report block reply EyesSewnShut 1 points 9 minutes ago Comment removed by community moderators. permalink parent award report block reply maleitch 5 points 10 hours ago Yeah kid has risked more pointing out inconvenient facts and fighting for his generation of Americans. What the fuck have you down?  Did you ever leave your bedroom or reddit for maga? permalink parent award report block reply DebunkTheLeft 4 points 10 hours ago Nick wanted Kamala to be president. That's not exactly America First. Unless you're a deranged psycho. permalink parent award report block reply PROCIsAsshoe 3 points 10 hours ago wtf did he really? I hardly even know who he is but his name  gets mentioned far too often around here if that's the case. permalink parent award report block reply view 2 more comments... EyesSewnShut 1 points 8 minutes ago Comment removed by community moderators. permalink parent award report block reply TallestSkill -4 points 10 hours ago Good to know you condone Nick Fuentes and Ali Alexander grooming underage fanboys. It's only innocent foreplay to ask minors for nudes in your sick perverted sex cult. permalink parent award report block reply EyesSewnShut 1 points 5 minutes ago Comment removed by community moderators. permalink parent award report block reply AmericanJawa 5 points 10 hours ago FYI this was started by Nick Fuentes, who cares more about basking in his newfound celebrity status, than his country. Hacks gunna hack. permalink parent award report block reply patrioticwinning3 -4 points 10 hours ago OP is and H1B shill.  Just sayin'! permalink parent award report block reply AmericanJawa 8 points 10 hours ago OP is and H1B shill. Source? permalink parent award report block reply view 1 more comments... DebunkTheLeft 3 points 10 hours ago What's this: https://x.com/NickJFuentes/status/1988697670190526602 permalink parent award report block reply view 1 more comments... YT45 -6 points 10 hours ago Fuentes is almost as gay as Hasan Piker. permalink parent award report block reply HeavyMetalPatriot 5 points 9 hours ago Funny how much hate there's on PDW for anyone actually America First and not kneeling to the neocon MIGA bullshit. permalink parent award report block reply view 5 more comments... BlackJack1776 -5 points 10 hours ago Did Hasan also swap dick juice with Destiny? SPEZ: Yeah. This bitter truth is something fanbois of Twink Fuentes find hard to swallow. Cope and seethe. permalink parent award report block reply It_takes_10_years 2 points 2 hours ago Dude is right about everything. Why would anyone apologize for being correct? It’s like this: the boat is sinking, and he says, \"Hey, you idiots, stop patching the hull with printer paper  you need actual marine epoxy or we’re going under.\" Then the leak gets worse, the boat tilts harder, water pours in… and instead of admitting he was right, you all start shrieking:\n\"OMG why are you basking in your celebrity status in being right!?\" No he’s not basking.\nYou’re just embarrassed he called it before it collapsed.\nPeople who point out obvious failures aren’t the problem the people who refuse to fix them are. There is not a single fucking issue Nick Fuentes has been wrong on or did not predict correctly. Not a single fucking issue in 10 years.  His ideas are now mainstream conversative talking points now.  Imagine saying \"NO IMMIGRATION NOT EVEN LEGAL\" 10 years ago to republicans. permalink parent award report block reply load 9 more comments... awsure 10 points 10 hours ago MAGA is America First permalink parent award report block reply maleitch 22 points 10 hours ago On paper only it seems permalink parent award report block reply CrispyCracker2 5 points 9 hours ago At least that's what we all thought. It is for us, just not this administration apparently. permalink parent award report block reply EyesSewnShut 1 points 4 minutes ago Comment removed by community moderators. permalink parent award report block reply Than0sIII 2 points 10 hours ago It's all power play bullshit by people wanting to become thought leaders and take control of the greater \"right\" for 2028+. That and intentional sabotage for 2026. permalink parent award report block reply NotYourMan 2 points 4 hours ago This is exactly like 2020.  The same thing happened on reddit back then.  The rift over affordability and the 50 year mortgage thing is a psyop to beat us down.  Stay strong with Trump (because we really don't want democrats in power). permalink parent award report block reply load 11 more comments...\nLelleck 54 points 11 hours ago I don‘t even know what they are reffering to? I don‘t have the chance to follow every step of these people since I work and have a life outside of the internet… permalink parent award report block reply AppalachianTactical 93 points 10 hours ago Trump saying we need to import millions of Indian H1Bs because Americans aren't smart enough to do the job. permalink parent award report block reply Hangemh1gh 73 points 10 hours ago The whole fifty year mortgage thing hasn't helped either. permalink parent award report block reply AppalachianTactical 33 points 10 hours ago Yeah, and I dont even think its that big of a deal, but when you are talking 50 year mortgages on top of getting rid of the penny and americans arent smart enough to do the tech jobs, it just looks hackney. 50 year mortgage could have its place maybe helping 20 year olds get a house, but whats scary is the elite are thinking raise retirement age too. Nothing for us. Everything for the leeches. permalink parent award report block reply view 7 more comments... tiller 14 points 10 hours ago I suspect it's about the Epstein names or the trillions wasted on lsraeI and the billions we gave away to Argentina and Ukraine. None of it was an investment. Ask any struggling American family and they'll tell you those nations are not our friends - they are our parasites. permalink parent award report block reply JimmyJ 5 points 10 hours ago Agreed that a 50 year mortgage is insane, but so is paying 50 years of property tax, however, I do believe Daddy Trump thinks this is at least a way to help young people afford a home at this point.  There is no reason to not refinance.  However, again, property and wood are way overpriced. permalink parent award report block reply view 1 more comments... Kingoftheroad 3 points 5 hours ago And the recent elections all over where democrat candidates are stomping republican ones which has been a predictor for who wins the following midterms is a bad sign for whats coming for us if it holds true again like it has for 20 years permalink parent award report block reply view 1 more comments... vegaspatriot1776 8 points 3 hours ago And also wanting 600,000 chinese to attend our universities because somehow harvard needs it! Plus the 50 year mortgage. MAGA? permalink parent award report block reply behemoth887 6 points 7 hours ago idk how he still has this h1jeet stance when he had that interaction with a jeet and all he could say was \"i can't understand you\" over and over that wasn't just one jeet who couldn't speak english, that's all of them. and the bad news is they think they're fluent and speak really well. permalink parent award report block reply bumpman 0 points 10 hours ago Not millions, he lowered it to 25,000 and it costs $100k fee for each one permalink parent award report block reply 7PC_Principle 13 points 10 hours ago 🤣🤣 pay attention to things beyond bullshit propaganda that is coming out of Trump's mouth. $100k fee only applies to brand NEW applications and not the existing ones.\nNext, they processed H1B applications in mass numbers even through the shutdown. So in a sense companies aren't getting rid of H1Bs ... Plus this is why I don't follow bullshit political accounts on X or anything for that matter. It's all bullshit propaganda and engagement farming to stay relevant. It's all crap. Look that that stupid dumbass cat-retard for example..or that binder brigade DC darino moron. It's all propaganda engagement farming bullshit... permalink parent award report block reply view 1 more comments... AppalachianTactical 12 points 10 hours ago You believe that?\nAt the same time he is saying Americans are too stupid to do tech jobs, you think he will limit the number of them to 25k? permalink parent award report block reply view 1 more comments... LearnAboutRoaches -4 points 10 hours ago Stop making sense .. WE hate the brown people! Regardless of what he says Trump really is going to import 500 million street shitters and you sheep are letting him! Lol permalink parent award report block reply LearnAboutRoaches -11 points 10 hours ago He didn't say millions and he was not talking about all Americans. Idiot. Are you actually trying to say there are no low iq, low energy uneducated white people in America? What an idiot. permalink parent award report block reply vegaspatriot1776 2 points 3 hours ago He didn't say it, Trump said it. permalink parent award report block reply view 2 more comments... TwoWords 2 points 1 hour ago ok shitskin permalink parent award report block reply view 1 more comments... ReallyGayMods 63 points 10 hours ago The outrage isnt unreasonable. Trump said americans don't have the talent in a lot of areas so we gotta import people who don't speak English and shit in the street to take good paying jobs from us. Itll be easier to train and reward them, than Americans. Which is objectively an awful, anti maga stance. If I would have told you a year ago that trump would be saying this, you wouldn't have believed it. We all would have believed biden and the democrats said it permalink parent award report block reply PROCIsAsshoe 19 points 10 hours ago Yeah it's an insanely retarded take from DJT and worthy of condemnation. Additionally, declaring \"MAGA dead\" is just the shills trying to amplify and sow disharmony. MAGA as a movement isn't dead, we just need to continue to push back in areas where disagreements arises. Almost as if that's what the representative form of government requires, ideas and feedback. Regardless of wtf kind of mistake he has made, MAGA isn't dead unless you're into high school theatrics. permalink parent award report block reply ReallyGayMods 21 points 10 hours ago I agree but we need to figure out what the fuck is going on The Epstein 180 really did kill our momentum, even though like half of this website doesn't wanna believe it. Pam bondi is so useless trump makes posts begging her to do something like he did with sessions and Barr. 50 year mortgage is one of the worst things I've ever heard of. Hes much more aligned with isreal this term than last. And I just saw a post that he wants to rename veterans day to victory day, like a lib rewriting history and changing \"offensive\" holiday names Something changed and its on us to put pressure on him and say what the fuck are you doing. Not bootlick and say yea give me the 75 year mortgage daddy permalink parent award report block reply view 2 more comments... KernalMustard 8 points 9 hours ago It is dead. It died the day we bombed Iran for Israel. Everything I predicted is coming true because you all were too fuck8ng blind to see it. I'm MAGA I sure as fuck dont support Trump anymore. permalink parent award report block reply view 1 more comments... Faintlight 2 points 9 hours ago When he's fucking up this bad, what do you recommend to get his attention? permalink parent award report block reply DeportThemAllForever 2 points 2 hours ago 50 year mortgage is worse.  Let’s pawn all risk onto taxpayers as lenders and builders go party collecting massive cash windfalls. It’ll turn everyone into bank tenants. Part of that you’ll own nothing. permalink parent award report block reply CaptainCuomo 16 points 10 hours ago \"I don‘t even know what they are referring to?\" Headline: Donald Trump's \"Insane\" Comment About American Workers Having No Talent Is Going Viral, And People Are Saying MAGA Has \"Officially Imploded\" Better to watch President Trump actually speaking, than rely on an interpretation: https://youtu.be/D9IU6xYC2gs?si=byZA9h9FXv6Jp2WK&t=320 permalink parent award report block reply CaptainRumington 2 points 22 minutes ago Posted by Fox News, a Disney owned corporation with the ability to edit releases. permalink parent award report block reply CaptainCuomo 1 points 2 minutes ago Do you think they manufactured that clip, to make it look like President Trump said super-retarded shit-- even though his real answer was actually better? permalink parent award report block reply American-Free-Man -6 points 5 hours ago \"Well, we have plenty of talented people,\" Ingraham said. Key word he was responding to is \"plenty\" and than Ingraham shoots back with \"we don't have talented people here?\" Stupid Bitch!!! and now TDS infected anti-trumpers are running with what she said and not what POTUS was saying is that we won't have ENOUGH people in certain areas. I know, I know..... he could have spelled it out better but hearing him talk about the trillions of dollars in investments pouring into our country what like $20 trillion by the end of the year. I've been wondering  myself how the hell are we going to fill all the high tech positions coming. Surely not with a whole generation of entitled children that don't want to work. Believe me I want as little H1B's as possible, if any, but I'm sure they've been crunching the numbers and they need 2+2 to equal 4 and not 5 to make the coming high tech industrial boom not fail before it's even off the ground. Without more information I'm in the same boat as most people, No H1B's but I also want America to be at the fore front of the next high tech industrial revolution regardless. The next few years could make or break this Country. permalink parent award report block reply CaptainCuomo 3 points 4 hours ago \"$20 Trillion by the end of the year\". That's a crazy number. The US GDP has been above $20 Trillion every year-- since 2017.  So that's not some new record being broken. There is NOT another $20 Trillion in foreign investments arriving by the end of the year. Nor is there $20 Trillion in tariffs being collected-- not even close. So... no... there is not $20 Trillion dollars of Demand pouring into US high-tech labor markets/ with no American workers to fill those spots. \"Stupid Bitch!!!\" You want her to be like the Dem FAKE NEWS-- and not ask our President the real, obvious questions on MAGA voters' minds?! I have a couple of \"white pill\" beliefs about Trump & the economy-- which pretty-much bail him out of trouble (in my mind) on nearly-any occasion:   1.) Whenever Trump makes an unconventional move, it-- by definition-- defies conventional opinion.  So it's super-easy to complain, on conventional grounds.  But conventional thinking is the wrong way to judge unconventional actions.   2.)  US economic policy has been so mindlessly conventional-- for So Long!-- that ANY move away from the Same Old Shit-- will have at-least a momentary \"Change Dividend\".     For example, taking the flippers off your feet & using them to paddle with your hands is-- in general-- a bad idea.  EXCEPT, if you've been using only your legs to swim 50 miles... then, yeah, your legs are probably exhausted & your arms Will Be better (temporarily).    That applies to things like Tariffs.   I think they're good.  I may be wrong.  But the US has been SO anti-tariff... for So Long... that switching to tariffs provides Short Term relief.  EVEN IF tariffs are (perhaps) bad policy In The Long Run. That said--  it's not good-- when Trump's pronouncements and policies don't clearly make sense On Their Own...   causing me to have to dip into my bottle of White Pills. permalink parent award report block reply Faintlight 4 points 9 hours ago Too much support for Bibi. permalink parent award report block reply RyanKeyOh 2 points 9 hours ago H1B permalink parent award report block reply load 1 more comments...\nAppalachianTactical 93 points 10 hours ago Trump saying we need to import millions of Indian H1Bs because Americans aren't smart enough to do the job. permalink parent award report block reply Hangemh1gh 73 points 10 hours ago The whole fifty year mortgage thing hasn't helped either. permalink parent award report block reply AppalachianTactical 33 points 10 hours ago Yeah, and I dont even think its that big of a deal, but when you are talking 50 year mortgages on top of getting rid of the penny and americans arent smart enough to do the tech jobs, it just looks hackney. 50 year mortgage could have its place maybe helping 20 year olds get a house, but whats scary is the elite are thinking raise retirement age too. Nothing for us. Everything for the leeches. permalink parent award report block reply view 7 more comments... tiller 14 points 10 hours ago I suspect it's about the Epstein names or the trillions wasted on lsraeI and the billions we gave away to Argentina and Ukraine. None of it was an investment. Ask any struggling American family and they'll tell you those nations are not our friends - they are our parasites. permalink parent award report block reply JimmyJ 5 points 10 hours ago Agreed that a 50 year mortgage is insane, but so is paying 50 years of property tax, however, I do believe Daddy Trump thinks this is at least a way to help young people afford a home at this point.  There is no reason to not refinance.  However, again, property and wood are way overpriced. permalink parent award report block reply view 1 more comments... Kingoftheroad 3 points 5 hours ago And the recent elections all over where democrat candidates are stomping republican ones which has been a predictor for who wins the following midterms is a bad sign for whats coming for us if it holds true again like it has for 20 years permalink parent award report block reply view 1 more comments... vegaspatriot1776 8 points 3 hours ago And also wanting 600,000 chinese to attend our universities because somehow harvard needs it! Plus the 50 year mortgage. MAGA? permalink parent award report block reply behemoth887 6 points 7 hours ago idk how he still has this h1jeet stance when he had that interaction with a jeet and all he could say was \"i can't understand you\" over and over that wasn't just one jeet who couldn't speak english, that's all of them. and the bad news is they think they're fluent and speak really well. permalink parent award report block reply bumpman 0 points 10 hours ago Not millions, he lowered it to 25,000 and it costs $100k fee for each one permalink parent award report block reply 7PC_Principle 13 points 10 hours ago 🤣🤣 pay attention to things beyond bullshit propaganda that is coming out of Trump's mouth. $100k fee only applies to brand NEW applications and not the existing ones.\nNext, they processed H1B applications in mass numbers even through the shutdown. So in a sense companies aren't getting rid of H1Bs ... Plus this is why I don't follow bullshit political accounts on X or anything for that matter. It's all bullshit propaganda and engagement farming to stay relevant. It's all crap. Look that that stupid dumbass cat-retard for example..or that binder brigade DC darino moron. It's all propaganda engagement farming bullshit... permalink parent award report block reply view 1 more comments... AppalachianTactical 12 points 10 hours ago You believe that?\nAt the same time he is saying Americans are too stupid to do tech jobs, you think he will limit the number of them to 25k? permalink parent award report block reply view 1 more comments... LearnAboutRoaches -4 points 10 hours ago Stop making sense .. WE hate the brown people! Regardless of what he says Trump really is going to import 500 million street shitters and you sheep are letting him! Lol permalink parent award report block reply LearnAboutRoaches -11 points 10 hours ago He didn't say millions and he was not talking about all Americans. Idiot. Are you actually trying to say there are no low iq, low energy uneducated white people in America? What an idiot. permalink parent award report block reply vegaspatriot1776 2 points 3 hours ago He didn't say it, Trump said it. permalink parent award report block reply view 2 more comments... TwoWords 2 points 1 hour ago ok shitskin permalink parent award report block reply view 1 more comments...\nHangemh1gh 73 points 10 hours ago The whole fifty year mortgage thing hasn't helped either. permalink parent award report block reply AppalachianTactical 33 points 10 hours ago Yeah, and I dont even think its that big of a deal, but when you are talking 50 year mortgages on top of getting rid of the penny and americans arent smart enough to do the tech jobs, it just looks hackney. 50 year mortgage could have its place maybe helping 20 year olds get a house, but whats scary is the elite are thinking raise retirement age too. Nothing for us. Everything for the leeches. permalink parent award report block reply view 7 more comments... tiller 14 points 10 hours ago I suspect it's about the Epstein names or the trillions wasted on lsraeI and the billions we gave away to Argentina and Ukraine. None of it was an investment. Ask any struggling American family and they'll tell you those nations are not our friends - they are our parasites. permalink parent award report block reply JimmyJ 5 points 10 hours ago Agreed that a 50 year mortgage is insane, but so is paying 50 years of property tax, however, I do believe Daddy Trump thinks this is at least a way to help young people afford a home at this point.  There is no reason to not refinance.  However, again, property and wood are way overpriced. permalink parent award report block reply view 1 more comments... Kingoftheroad 3 points 5 hours ago And the recent elections all over where democrat candidates are stomping republican ones which has been a predictor for who wins the following midterms is a bad sign for whats coming for us if it holds true again like it has for 20 years permalink parent award report block reply view 1 more comments...\nAppalachianTactical 33 points 10 hours ago Yeah, and I dont even think its that big of a deal, but when you are talking 50 year mortgages on top of getting rid of the penny and americans arent smart enough to do the tech jobs, it just looks hackney. 50 year mortgage could have its place maybe helping 20 year olds get a house, but whats scary is the elite are thinking raise retirement age too. Nothing for us. Everything for the leeches. permalink parent award report block reply view 7 more comments...\ntiller 14 points 10 hours ago I suspect it's about the Epstein names or the trillions wasted on lsraeI and the billions we gave away to Argentina and Ukraine. None of it was an investment. Ask any struggling American family and they'll tell you those nations are not our friends - they are our parasites. permalink parent award report block reply\nJimmyJ 5 points 10 hours ago Agreed that a 50 year mortgage is insane, but so is paying 50 years of property tax, however, I do believe Daddy Trump thinks this is at least a way to help young people afford a home at this point.  There is no reason to not refinance.  However, again, property and wood are way overpriced. permalink parent award report block reply view 1 more comments...\nKingoftheroad 3 points 5 hours ago And the recent elections all over where democrat candidates are stomping republican ones which has been a predictor for who wins the following midterms is a bad sign for whats coming for us if it holds true again like it has for 20 years permalink parent award report block reply view 1 more comments...\nvegaspatriot1776 8 points 3 hours ago And also wanting 600,000 chinese to attend our universities because somehow harvard needs it! Plus the 50 year mortgage. MAGA? permalink parent award report block reply\nbehemoth887 6 points 7 hours ago idk how he still has this h1jeet stance when he had that interaction with a jeet and all he could say was \"i can't understand you\" over and over that wasn't just one jeet who couldn't speak english, that's all of them. and the bad news is they think they're fluent and speak really well. permalink parent award report block reply\nbumpman 0 points 10 hours ago Not millions, he lowered it to 25,000 and it costs $100k fee for each one permalink parent award report block reply 7PC_Principle 13 points 10 hours ago 🤣🤣 pay attention to things beyond bullshit propaganda that is coming out of Trump's mouth. $100k fee only applies to brand NEW applications and not the existing ones.\nNext, they processed H1B applications in mass numbers even through the shutdown. So in a sense companies aren't getting rid of H1Bs ... Plus this is why I don't follow bullshit political accounts on X or anything for that matter. It's all bullshit propaganda and engagement farming to stay relevant. It's all crap. Look that that stupid dumbass cat-retard for example..or that binder brigade DC darino moron. It's all propaganda engagement farming bullshit... permalink parent award report block reply view 1 more comments... AppalachianTactical 12 points 10 hours ago You believe that?\nAt the same time he is saying Americans are too stupid to do tech jobs, you think he will limit the number of them to 25k? permalink parent award report block reply view 1 more comments... LearnAboutRoaches -4 points 10 hours ago Stop making sense .. WE hate the brown people! Regardless of what he says Trump really is going to import 500 million street shitters and you sheep are letting him! Lol permalink parent award report block reply\n7PC_Principle 13 points 10 hours ago 🤣🤣 pay attention to things beyond bullshit propaganda that is coming out of Trump's mouth. $100k fee only applies to brand NEW applications and not the existing ones.\nNext, they processed H1B applications in mass numbers even through the shutdown. So in a sense companies aren't getting rid of H1Bs ... Plus this is why I don't follow bullshit political accounts on X or anything for that matter. It's all bullshit propaganda and engagement farming to stay relevant. It's all crap. Look that that stupid dumbass cat-retard for example..or that binder brigade DC darino moron. It's all propaganda engagement farming bullshit... permalink parent award report block reply view 1 more comments...\nAppalachianTactical 12 points 10 hours ago You believe that?\nAt the same time he is saying Americans are too stupid to do tech jobs, you think he will limit the number of them to 25k? permalink parent award report block reply view 1 more comments...\nLearnAboutRoaches -4 points 10 hours ago Stop making sense .. WE hate the brown people! Regardless of what he says Trump really is going to import 500 million street shitters and you sheep are letting him! Lol permalink parent award report block reply\nLearnAboutRoaches -11 points 10 hours ago He didn't say millions and he was not talking about all Americans. Idiot. Are you actually trying to say there are no low iq, low energy uneducated white people in America? What an idiot. permalink parent award report block reply vegaspatriot1776 2 points 3 hours ago He didn't say it, Trump said it. permalink parent award report block reply view 2 more comments... TwoWords 2 points 1 hour ago ok shitskin permalink parent award report block reply view 1 more comments...\nvegaspatriot1776 2 points 3 hours ago He didn't say it, Trump said it. permalink parent award report block reply view 2 more comments...\nTwoWords 2 points 1 hour ago ok shitskin permalink parent award report block reply view 1 more comments...\nReallyGayMods 63 points 10 hours ago The outrage isnt unreasonable. Trump said americans don't have the talent in a lot of areas so we gotta import people who don't speak English and shit in the street to take good paying jobs from us. Itll be easier to train and reward them, than Americans. Which is objectively an awful, anti maga stance. If I would have told you a year ago that trump would be saying this, you wouldn't have believed it. We all would have believed biden and the democrats said it permalink parent award report block reply PROCIsAsshoe 19 points 10 hours ago Yeah it's an insanely retarded take from DJT and worthy of condemnation. Additionally, declaring \"MAGA dead\" is just the shills trying to amplify and sow disharmony. MAGA as a movement isn't dead, we just need to continue to push back in areas where disagreements arises. Almost as if that's what the representative form of government requires, ideas and feedback. Regardless of wtf kind of mistake he has made, MAGA isn't dead unless you're into high school theatrics. permalink parent award report block reply ReallyGayMods 21 points 10 hours ago I agree but we need to figure out what the fuck is going on The Epstein 180 really did kill our momentum, even though like half of this website doesn't wanna believe it. Pam bondi is so useless trump makes posts begging her to do something like he did with sessions and Barr. 50 year mortgage is one of the worst things I've ever heard of. Hes much more aligned with isreal this term than last. And I just saw a post that he wants to rename veterans day to victory day, like a lib rewriting history and changing \"offensive\" holiday names Something changed and its on us to put pressure on him and say what the fuck are you doing. Not bootlick and say yea give me the 75 year mortgage daddy permalink parent award report block reply view 2 more comments... KernalMustard 8 points 9 hours ago It is dead. It died the day we bombed Iran for Israel. Everything I predicted is coming true because you all were too fuck8ng blind to see it. I'm MAGA I sure as fuck dont support Trump anymore. permalink parent award report block reply view 1 more comments... Faintlight 2 points 9 hours ago When he's fucking up this bad, what do you recommend to get his attention? permalink parent award report block reply DeportThemAllForever 2 points 2 hours ago 50 year mortgage is worse.  Let’s pawn all risk onto taxpayers as lenders and builders go party collecting massive cash windfalls. It’ll turn everyone into bank tenants. Part of that you’ll own nothing. permalink parent award report block reply\nPROCIsAsshoe 19 points 10 hours ago Yeah it's an insanely retarded take from DJT and worthy of condemnation. Additionally, declaring \"MAGA dead\" is just the shills trying to amplify and sow disharmony. MAGA as a movement isn't dead, we just need to continue to push back in areas where disagreements arises. Almost as if that's what the representative form of government requires, ideas and feedback. Regardless of wtf kind of mistake he has made, MAGA isn't dead unless you're into high school theatrics. permalink parent award report block reply ReallyGayMods 21 points 10 hours ago I agree but we need to figure out what the fuck is going on The Epstein 180 really did kill our momentum, even though like half of this website doesn't wanna believe it. Pam bondi is so useless trump makes posts begging her to do something like he did with sessions and Barr. 50 year mortgage is one of the worst things I've ever heard of. Hes much more aligned with isreal this term than last. And I just saw a post that he wants to rename veterans day to victory day, like a lib rewriting history and changing \"offensive\" holiday names Something changed and its on us to put pressure on him and say what the fuck are you doing. Not bootlick and say yea give me the 75 year mortgage daddy permalink parent award report block reply view 2 more comments... KernalMustard 8 points 9 hours ago It is dead. It died the day we bombed Iran for Israel. Everything I predicted is coming true because you all were too fuck8ng blind to see it. I'm MAGA I sure as fuck dont support Trump anymore. permalink parent award report block reply view 1 more comments... Faintlight 2 points 9 hours ago When he's fucking up this bad, what do you recommend to get his attention? permalink parent award report block reply\nReallyGayMods 21 points 10 hours ago I agree but we need to figure out what the fuck is going on The Epstein 180 really did kill our momentum, even though like half of this website doesn't wanna believe it. Pam bondi is so useless trump makes posts begging her to do something like he did with sessions and Barr. 50 year mortgage is one of the worst things I've ever heard of. Hes much more aligned with isreal this term than last. And I just saw a post that he wants to rename veterans day to victory day, like a lib rewriting history and changing \"offensive\" holiday names Something changed and its on us to put pressure on him and say what the fuck are you doing. Not bootlick and say yea give me the 75 year mortgage daddy permalink parent award report block reply view 2 more comments...\nKernalMustard 8 points 9 hours ago It is dead. It died the day we bombed Iran for Israel. Everything I predicted is coming true because you all were too fuck8ng blind to see it. I'm MAGA I sure as fuck dont support Trump anymore. permalink parent award report block reply view 1 more comments...\nFaintlight 2 points 9 hours ago When he's fucking up this bad, what do you recommend to get his attention? permalink parent award report block reply\nDeportThemAllForever 2 points 2 hours ago 50 year mortgage is worse.  Let’s pawn all risk onto taxpayers as lenders and builders go party collecting massive cash windfalls. It’ll turn everyone into bank tenants. Part of that you’ll own nothing. permalink parent award report block reply\nCaptainCuomo 16 points 10 hours ago \"I don‘t even know what they are referring to?\" Headline: Donald Trump's \"Insane\" Comment About American Workers Having No Talent Is Going Viral, And People Are Saying MAGA Has \"Officially Imploded\" Better to watch President Trump actually speaking, than rely on an interpretation: https://youtu.be/D9IU6xYC2gs?si=byZA9h9FXv6Jp2WK&t=320 permalink parent award report block reply CaptainRumington 2 points 22 minutes ago Posted by Fox News, a Disney owned corporation with the ability to edit releases. permalink parent award report block reply CaptainCuomo 1 points 2 minutes ago Do you think they manufactured that clip, to make it look like President Trump said super-retarded shit-- even though his real answer was actually better? permalink parent award report block reply American-Free-Man -6 points 5 hours ago \"Well, we have plenty of talented people,\" Ingraham said. Key word he was responding to is \"plenty\" and than Ingraham shoots back with \"we don't have talented people here?\" Stupid Bitch!!! and now TDS infected anti-trumpers are running with what she said and not what POTUS was saying is that we won't have ENOUGH people in certain areas. I know, I know..... he could have spelled it out better but hearing him talk about the trillions of dollars in investments pouring into our country what like $20 trillion by the end of the year. I've been wondering  myself how the hell are we going to fill all the high tech positions coming. Surely not with a whole generation of entitled children that don't want to work. Believe me I want as little H1B's as possible, if any, but I'm sure they've been crunching the numbers and they need 2+2 to equal 4 and not 5 to make the coming high tech industrial boom not fail before it's even off the ground. Without more information I'm in the same boat as most people, No H1B's but I also want America to be at the fore front of the next high tech industrial revolution regardless. The next few years could make or break this Country. permalink parent award report block reply CaptainCuomo 3 points 4 hours ago \"$20 Trillion by the end of the year\". That's a crazy number. The US GDP has been above $20 Trillion every year-- since 2017.  So that's not some new record being broken. There is NOT another $20 Trillion in foreign investments arriving by the end of the year. Nor is there $20 Trillion in tariffs being collected-- not even close. So... no... there is not $20 Trillion dollars of Demand pouring into US high-tech labor markets/ with no American workers to fill those spots. \"Stupid Bitch!!!\" You want her to be like the Dem FAKE NEWS-- and not ask our President the real, obvious questions on MAGA voters' minds?! I have a couple of \"white pill\" beliefs about Trump & the economy-- which pretty-much bail him out of trouble (in my mind) on nearly-any occasion:   1.) Whenever Trump makes an unconventional move, it-- by definition-- defies conventional opinion.  So it's super-easy to complain, on conventional grounds.  But conventional thinking is the wrong way to judge unconventional actions.   2.)  US economic policy has been so mindlessly conventional-- for So Long!-- that ANY move away from the Same Old Shit-- will have at-least a momentary \"Change Dividend\".     For example, taking the flippers off your feet & using them to paddle with your hands is-- in general-- a bad idea.  EXCEPT, if you've been using only your legs to swim 50 miles... then, yeah, your legs are probably exhausted & your arms Will Be better (temporarily).    That applies to things like Tariffs.   I think they're good.  I may be wrong.  But the US has been SO anti-tariff... for So Long... that switching to tariffs provides Short Term relief.  EVEN IF tariffs are (perhaps) bad policy In The Long Run. That said--  it's not good-- when Trump's pronouncements and policies don't clearly make sense On Their Own...   causing me to have to dip into my bottle of White Pills. permalink parent award report block reply\nCaptainRumington 2 points 22 minutes ago Posted by Fox News, a Disney owned corporation with the ability to edit releases. permalink parent award report block reply CaptainCuomo 1 points 2 minutes ago Do you think they manufactured that clip, to make it look like President Trump said super-retarded shit-- even though his real answer was actually better? permalink parent award report block reply\nCaptainCuomo 1 points 2 minutes ago Do you think they manufactured that clip, to make it look like President Trump said super-retarded shit-- even though his real answer was actually better? permalink parent award report block reply\nAmerican-Free-Man -6 points 5 hours ago \"Well, we have plenty of talented people,\" Ingraham said. Key word he was responding to is \"plenty\" and than Ingraham shoots back with \"we don't have talented people here?\" Stupid Bitch!!! and now TDS infected anti-trumpers are running with what she said and not what POTUS was saying is that we won't have ENOUGH people in certain areas. I know, I know..... he could have spelled it out better but hearing him talk about the trillions of dollars in investments pouring into our country what like $20 trillion by the end of the year. I've been wondering  myself how the hell are we going to fill all the high tech positions coming. Surely not with a whole generation of entitled children that don't want to work. Believe me I want as little H1B's as possible, if any, but I'm sure they've been crunching the numbers and they need 2+2 to equal 4 and not 5 to make the coming high tech industrial boom not fail before it's even off the ground. Without more information I'm in the same boat as most people, No H1B's but I also want America to be at the fore front of the next high tech industrial revolution regardless. The next few years could make or break this Country. permalink parent award report block reply CaptainCuomo 3 points 4 hours ago \"$20 Trillion by the end of the year\". That's a crazy number. The US GDP has been above $20 Trillion every year-- since 2017.  So that's not some new record being broken. There is NOT another $20 Trillion in foreign investments arriving by the end of the year. Nor is there $20 Trillion in tariffs being collected-- not even close. So... no... there is not $20 Trillion dollars of Demand pouring into US high-tech labor markets/ with no American workers to fill those spots. \"Stupid Bitch!!!\" You want her to be like the Dem FAKE NEWS-- and not ask our President the real, obvious questions on MAGA voters' minds?! I have a couple of \"white pill\" beliefs about Trump & the economy-- which pretty-much bail him out of trouble (in my mind) on nearly-any occasion:   1.) Whenever Trump makes an unconventional move, it-- by definition-- defies conventional opinion.  So it's super-easy to complain, on conventional grounds.  But conventional thinking is the wrong way to judge unconventional actions.   2.)  US economic policy has been so mindlessly conventional-- for So Long!-- that ANY move away from the Same Old Shit-- will have at-least a momentary \"Change Dividend\".     For example, taking the flippers off your feet & using them to paddle with your hands is-- in general-- a bad idea.  EXCEPT, if you've been using only your legs to swim 50 miles... then, yeah, your legs are probably exhausted & your arms Will Be better (temporarily).    That applies to things like Tariffs.   I think they're good.  I may be wrong.  But the US has been SO anti-tariff... for So Long... that switching to tariffs provides Short Term relief.  EVEN IF tariffs are (perhaps) bad policy In The Long Run. That said--  it's not good-- when Trump's pronouncements and policies don't clearly make sense On Their Own...   causing me to have to dip into my bottle of White Pills. permalink parent award report block reply\nCaptainCuomo 3 points 4 hours ago \"$20 Trillion by the end of the year\". That's a crazy number. The US GDP has been above $20 Trillion every year-- since 2017.  So that's not some new record being broken. There is NOT another $20 Trillion in foreign investments arriving by the end of the year. Nor is there $20 Trillion in tariffs being collected-- not even close. So... no... there is not $20 Trillion dollars of Demand pouring into US high-tech labor markets/ with no American workers to fill those spots. \"Stupid Bitch!!!\" You want her to be like the Dem FAKE NEWS-- and not ask our President the real, obvious questions on MAGA voters' minds?! I have a couple of \"white pill\" beliefs about Trump & the economy-- which pretty-much bail him out of trouble (in my mind) on nearly-any occasion:   1.) Whenever Trump makes an unconventional move, it-- by definition-- defies conventional opinion.  So it's super-easy to complain, on conventional grounds.  But conventional thinking is the wrong way to judge unconventional actions.   2.)  US economic policy has been so mindlessly conventional-- for So Long!-- that ANY move away from the Same Old Shit-- will have at-least a momentary \"Change Dividend\".     For example, taking the flippers off your feet & using them to paddle with your hands is-- in general-- a bad idea.  EXCEPT, if you've been using only your legs to swim 50 miles... then, yeah, your legs are probably exhausted & your arms Will Be better (temporarily).    That applies to things like Tariffs.   I think they're good.  I may be wrong.  But the US has been SO anti-tariff... for So Long... that switching to tariffs provides Short Term relief.  EVEN IF tariffs are (perhaps) bad policy In The Long Run. That said--  it's not good-- when Trump's pronouncements and policies don't clearly make sense On Their Own...   causing me to have to dip into my bottle of White Pills. permalink parent award report block reply\nFaintlight 4 points 9 hours ago Too much support for Bibi. permalink parent award report block reply\nRyanKeyOh 2 points 9 hours ago H1B permalink parent award report block reply\nDebunkTheLeft 12 points 11 hours ago FYI this was started by Nick Fuentes, who cares more about basking in his newfound celebrity status, than his country. permalink parent award report block reply Wexit-Delecto 22 points 10 hours ago Nick Fuentes, who cares more about basking in his newfound celebrity status, than his country Dude should just accept the H1Bs for his country. But is it still his country if it’s full of pajeets? permalink parent award report block reply sun_wolf 5 points 8 hours ago Nick Fuentes attacks Owen Benjamin for “betraying” the white race, yet Owen has made four new white children (and I think is aiming for twelve), and Fuentes has had zero. permalink parent award report block reply YouEssAye 3 points 2 hours ago Be sure to leave out the part where Owen is 18 years older and didn't have any kids yet or even marry his wife until he was a few years older than Nick is now. permalink parent award report block reply AmericanJawa 2 points 8 hours ago What does Fuentes hate this Mr. Benjamin for? permalink parent award report block reply view 1 more comments... Wexit-Delecto 0 points 1 hour ago DGAF about the celebrity gossip. Legal immigration is still replacement immigration. Including H1Bs. permalink parent award report block reply EyesSewnShut 1 points 10 minutes ago Comment removed by community moderators. permalink parent award report block reply TheRPatriot 9 points 10 hours ago Never got into him. He comes off as a self-loathing d-bag permalink parent award report block reply wartooth6 -4 points 10 hours ago His political personality will end the moment he finally experiences a woman's embrace.  He's way too uptight for his age. permalink parent award report block reply EyesSewnShut 1 points 10 minutes ago Comment removed by community moderators. permalink parent award report block reply Friendly_B -5 points 10 hours ago It's the snarling which is the first red flag.  He doesn't know God, you can just see it on his face and hear it in his voice. permalink parent award report block reply HeavyMetalPatriot 5 points 9 hours ago Nick is very openly religious and speaks regularly about his faith. We should all be snarling at anything threatening America. permalink parent award report block reply view 2 more comments... ParadigmShift2070 3 points 7 hours ago But enough about mark Levin and Ben Shapiro permalink parent award report block reply EyesSewnShut 1 points 9 minutes ago Comment removed by community moderators. permalink parent award report block reply maleitch 5 points 10 hours ago Yeah kid has risked more pointing out inconvenient facts and fighting for his generation of Americans. What the fuck have you down?  Did you ever leave your bedroom or reddit for maga? permalink parent award report block reply DebunkTheLeft 4 points 10 hours ago Nick wanted Kamala to be president. That's not exactly America First. Unless you're a deranged psycho. permalink parent award report block reply PROCIsAsshoe 3 points 10 hours ago wtf did he really? I hardly even know who he is but his name  gets mentioned far too often around here if that's the case. permalink parent award report block reply view 2 more comments... EyesSewnShut 1 points 8 minutes ago Comment removed by community moderators. permalink parent award report block reply TallestSkill -4 points 10 hours ago Good to know you condone Nick Fuentes and Ali Alexander grooming underage fanboys. It's only innocent foreplay to ask minors for nudes in your sick perverted sex cult. permalink parent award report block reply EyesSewnShut 1 points 5 minutes ago Comment removed by community moderators. permalink parent award report block reply AmericanJawa 5 points 10 hours ago FYI this was started by Nick Fuentes, who cares more about basking in his newfound celebrity status, than his country. Hacks gunna hack. permalink parent award report block reply patrioticwinning3 -4 points 10 hours ago OP is and H1B shill.  Just sayin'! permalink parent award report block reply AmericanJawa 8 points 10 hours ago OP is and H1B shill. Source? permalink parent award report block reply view 1 more comments... DebunkTheLeft 3 points 10 hours ago What's this: https://x.com/NickJFuentes/status/1988697670190526602 permalink parent award report block reply view 1 more comments... YT45 -6 points 10 hours ago Fuentes is almost as gay as Hasan Piker. permalink parent award report block reply HeavyMetalPatriot 5 points 9 hours ago Funny how much hate there's on PDW for anyone actually America First and not kneeling to the neocon MIGA bullshit. permalink parent award report block reply view 5 more comments... BlackJack1776 -5 points 10 hours ago Did Hasan also swap dick juice with Destiny? SPEZ: Yeah. This bitter truth is something fanbois of Twink Fuentes find hard to swallow. Cope and seethe. permalink parent award report block reply It_takes_10_years 2 points 2 hours ago Dude is right about everything. Why would anyone apologize for being correct? It’s like this: the boat is sinking, and he says, \"Hey, you idiots, stop patching the hull with printer paper  you need actual marine epoxy or we’re going under.\" Then the leak gets worse, the boat tilts harder, water pours in… and instead of admitting he was right, you all start shrieking:\n\"OMG why are you basking in your celebrity status in being right!?\" No he’s not basking.\nYou’re just embarrassed he called it before it collapsed.\nPeople who point out obvious failures aren’t the problem the people who refuse to fix them are. There is not a single fucking issue Nick Fuentes has been wrong on or did not predict correctly. Not a single fucking issue in 10 years.  His ideas are now mainstream conversative talking points now.  Imagine saying \"NO IMMIGRATION NOT EVEN LEGAL\" 10 years ago to republicans. permalink parent award report block reply load 9 more comments...\nWexit-Delecto 22 points 10 hours ago Nick Fuentes, who cares more about basking in his newfound celebrity status, than his country Dude should just accept the H1Bs for his country. But is it still his country if it’s full of pajeets? permalink parent award report block reply sun_wolf 5 points 8 hours ago Nick Fuentes attacks Owen Benjamin for “betraying” the white race, yet Owen has made four new white children (and I think is aiming for twelve), and Fuentes has had zero. permalink parent award report block reply YouEssAye 3 points 2 hours ago Be sure to leave out the part where Owen is 18 years older and didn't have any kids yet or even marry his wife until he was a few years older than Nick is now. permalink parent award report block reply AmericanJawa 2 points 8 hours ago What does Fuentes hate this Mr. Benjamin for? permalink parent award report block reply view 1 more comments... Wexit-Delecto 0 points 1 hour ago DGAF about the celebrity gossip. Legal immigration is still replacement immigration. Including H1Bs. permalink parent award report block reply EyesSewnShut 1 points 10 minutes ago Comment removed by community moderators. permalink parent award report block reply\nsun_wolf 5 points 8 hours ago Nick Fuentes attacks Owen Benjamin for “betraying” the white race, yet Owen has made four new white children (and I think is aiming for twelve), and Fuentes has had zero. permalink parent award report block reply YouEssAye 3 points 2 hours ago Be sure to leave out the part where Owen is 18 years older and didn't have any kids yet or even marry his wife until he was a few years older than Nick is now. permalink parent award report block reply AmericanJawa 2 points 8 hours ago What does Fuentes hate this Mr. Benjamin for? permalink parent award report block reply view 1 more comments... Wexit-Delecto 0 points 1 hour ago DGAF about the celebrity gossip. Legal immigration is still replacement immigration. Including H1Bs. permalink parent award report block reply EyesSewnShut 1 points 10 minutes ago Comment removed by community moderators. permalink parent award report block reply\nYouEssAye 3 points 2 hours ago Be sure to leave out the part where Owen is 18 years older and didn't have any kids yet or even marry his wife until he was a few years older than Nick is now. permalink parent award report block reply\nAmericanJawa 2 points 8 hours ago What does Fuentes hate this Mr. Benjamin for? permalink parent award report block reply view 1 more comments...\nWexit-Delecto 0 points 1 hour ago DGAF about the celebrity gossip. Legal immigration is still replacement immigration. Including H1Bs. permalink parent award report block reply\nEyesSewnShut 1 points 10 minutes ago Comment removed by community moderators. permalink parent award report block reply\nTheRPatriot 9 points 10 hours ago Never got into him. He comes off as a self-loathing d-bag permalink parent award report block reply wartooth6 -4 points 10 hours ago His political personality will end the moment he finally experiences a woman's embrace.  He's way too uptight for his age. permalink parent award report block reply EyesSewnShut 1 points 10 minutes ago Comment removed by community moderators. permalink parent award report block reply Friendly_B -5 points 10 hours ago It's the snarling which is the first red flag.  He doesn't know God, you can just see it on his face and hear it in his voice. permalink parent award report block reply HeavyMetalPatriot 5 points 9 hours ago Nick is very openly religious and speaks regularly about his faith. We should all be snarling at anything threatening America. permalink parent award report block reply view 2 more comments... ParadigmShift2070 3 points 7 hours ago But enough about mark Levin and Ben Shapiro permalink parent award report block reply EyesSewnShut 1 points 9 minutes ago Comment removed by community moderators. permalink parent award report block reply\nwartooth6 -4 points 10 hours ago His political personality will end the moment he finally experiences a woman's embrace.  He's way too uptight for his age. permalink parent award report block reply EyesSewnShut 1 points 10 minutes ago Comment removed by community moderators. permalink parent award report block reply\nEyesSewnShut 1 points 10 minutes ago Comment removed by community moderators. permalink parent award report block reply\nFriendly_B -5 points 10 hours ago It's the snarling which is the first red flag.  He doesn't know God, you can just see it on his face and hear it in his voice. permalink parent award report block reply HeavyMetalPatriot 5 points 9 hours ago Nick is very openly religious and speaks regularly about his faith. We should all be snarling at anything threatening America. permalink parent award report block reply view 2 more comments... ParadigmShift2070 3 points 7 hours ago But enough about mark Levin and Ben Shapiro permalink parent award report block reply EyesSewnShut 1 points 9 minutes ago Comment removed by community moderators. permalink parent award report block reply\nHeavyMetalPatriot 5 points 9 hours ago Nick is very openly religious and speaks regularly about his faith. We should all be snarling at anything threatening America. permalink parent award report block reply view 2 more comments...\nParadigmShift2070 3 points 7 hours ago But enough about mark Levin and Ben Shapiro permalink parent award report block reply\nEyesSewnShut 1 points 9 minutes ago Comment removed by community moderators. permalink parent award report block reply\nmaleitch 5 points 10 hours ago Yeah kid has risked more pointing out inconvenient facts and fighting for his generation of Americans. What the fuck have you down?  Did you ever leave your bedroom or reddit for maga? permalink parent award report block reply DebunkTheLeft 4 points 10 hours ago Nick wanted Kamala to be president. That's not exactly America First. Unless you're a deranged psycho. permalink parent award report block reply PROCIsAsshoe 3 points 10 hours ago wtf did he really? I hardly even know who he is but his name  gets mentioned far too often around here if that's the case. permalink parent award report block reply view 2 more comments... EyesSewnShut 1 points 8 minutes ago Comment removed by community moderators. permalink parent award report block reply TallestSkill -4 points 10 hours ago Good to know you condone Nick Fuentes and Ali Alexander grooming underage fanboys. It's only innocent foreplay to ask minors for nudes in your sick perverted sex cult. permalink parent award report block reply EyesSewnShut 1 points 5 minutes ago Comment removed by community moderators. permalink parent award report block reply\nDebunkTheLeft 4 points 10 hours ago Nick wanted Kamala to be president. That's not exactly America First. Unless you're a deranged psycho. permalink parent award report block reply PROCIsAsshoe 3 points 10 hours ago wtf did he really? I hardly even know who he is but his name  gets mentioned far too often around here if that's the case. permalink parent award report block reply view 2 more comments... EyesSewnShut 1 points 8 minutes ago Comment removed by community moderators. permalink parent award report block reply\nPROCIsAsshoe 3 points 10 hours ago wtf did he really? I hardly even know who he is but his name  gets mentioned far too often around here if that's the case. permalink parent award report block reply view 2 more comments...\nEyesSewnShut 1 points 8 minutes ago Comment removed by community moderators. permalink parent award report block reply\nTallestSkill -4 points 10 hours ago Good to know you condone Nick Fuentes and Ali Alexander grooming underage fanboys. It's only innocent foreplay to ask minors for nudes in your sick perverted sex cult. permalink parent award report block reply EyesSewnShut 1 points 5 minutes ago Comment removed by community moderators. permalink parent award report block reply\nEyesSewnShut 1 points 5 minutes ago Comment removed by community moderators. permalink parent award report block reply\nAmericanJawa 5 points 10 hours ago FYI this was started by Nick Fuentes, who cares more about basking in his newfound celebrity status, than his country. Hacks gunna hack. permalink parent award report block reply patrioticwinning3 -4 points 10 hours ago OP is and H1B shill.  Just sayin'! permalink parent award report block reply AmericanJawa 8 points 10 hours ago OP is and H1B shill. Source? permalink parent award report block reply view 1 more comments... DebunkTheLeft 3 points 10 hours ago What's this: https://x.com/NickJFuentes/status/1988697670190526602 permalink parent award report block reply view 1 more comments... YT45 -6 points 10 hours ago Fuentes is almost as gay as Hasan Piker. permalink parent award report block reply HeavyMetalPatriot 5 points 9 hours ago Funny how much hate there's on PDW for anyone actually America First and not kneeling to the neocon MIGA bullshit. permalink parent award report block reply view 5 more comments... BlackJack1776 -5 points 10 hours ago Did Hasan also swap dick juice with Destiny? SPEZ: Yeah. This bitter truth is something fanbois of Twink Fuentes find hard to swallow. Cope and seethe. permalink parent award report block reply\npatrioticwinning3 -4 points 10 hours ago OP is and H1B shill.  Just sayin'! permalink parent award report block reply AmericanJawa 8 points 10 hours ago OP is and H1B shill. Source? permalink parent award report block reply view 1 more comments... DebunkTheLeft 3 points 10 hours ago What's this: https://x.com/NickJFuentes/status/1988697670190526602 permalink parent award report block reply view 1 more comments...\nAmericanJawa 8 points 10 hours ago OP is and H1B shill. Source? permalink parent award report block reply view 1 more comments...\nDebunkTheLeft 3 points 10 hours ago What's this: https://x.com/NickJFuentes/status/1988697670190526602 permalink parent award report block reply view 1 more comments...\nYT45 -6 points 10 hours ago Fuentes is almost as gay as Hasan Piker. permalink parent award report block reply HeavyMetalPatriot 5 points 9 hours ago Funny how much hate there's on PDW for anyone actually America First and not kneeling to the neocon MIGA bullshit. permalink parent award report block reply view 5 more comments... BlackJack1776 -5 points 10 hours ago Did Hasan also swap dick juice with Destiny? SPEZ: Yeah. This bitter truth is something fanbois of Twink Fuentes find hard to swallow. Cope and seethe. permalink parent award report block reply\nHeavyMetalPatriot 5 points 9 hours ago Funny how much hate there's on PDW for anyone actually America First and not kneeling to the neocon MIGA bullshit. permalink parent award report block reply view 5 more comments...\nBlackJack1776 -5 points 10 hours ago Did Hasan also swap dick juice with Destiny? SPEZ: Yeah. This bitter truth is something fanbois of Twink Fuentes find hard to swallow. Cope and seethe. permalink parent award report block reply\nIt_takes_10_years 2 points 2 hours ago Dude is right about everything. Why would anyone apologize for being correct? It’s like this: the boat is sinking, and he says, \"Hey, you idiots, stop patching the hull with printer paper  you need actual marine epoxy or we’re going under.\" Then the leak gets worse, the boat tilts harder, water pours in… and instead of admitting he was right, you all start shrieking:\n\"OMG why are you basking in your celebrity status in being right!?\" No he’s not basking.\nYou’re just embarrassed he called it before it collapsed.\nPeople who point out obvious failures aren’t the problem the people who refuse to fix them are. There is not a single fucking issue Nick Fuentes has been wrong on or did not predict correctly. Not a single fucking issue in 10 years.  His ideas are now mainstream conversative talking points now.  Imagine saying \"NO IMMIGRATION NOT EVEN LEGAL\" 10 years ago to republicans. permalink parent award report block reply\nawsure 10 points 10 hours ago MAGA is America First permalink parent award report block reply maleitch 22 points 10 hours ago On paper only it seems permalink parent award report block reply CrispyCracker2 5 points 9 hours ago At least that's what we all thought. It is for us, just not this administration apparently. permalink parent award report block reply EyesSewnShut 1 points 4 minutes ago Comment removed by community moderators. permalink parent award report block reply\nmaleitch 22 points 10 hours ago On paper only it seems permalink parent award report block reply\nCrispyCracker2 5 points 9 hours ago At least that's what we all thought. It is for us, just not this administration apparently. permalink parent award report block reply\nEyesSewnShut 1 points 4 minutes ago Comment removed by community moderators. permalink parent award report block reply\nThan0sIII 2 points 10 hours ago It's all power play bullshit by people wanting to become thought leaders and take control of the greater \"right\" for 2028+. That and intentional sabotage for 2026. permalink parent award report block reply\nNotYourMan 2 points 4 hours ago This is exactly like 2020.  The same thing happened on reddit back then.  The rift over affordability and the 50 year mortgage thing is a psyop to beat us down.  Stay strong with Trump (because we really don't want democrats in power). permalink parent award report block reply\nMemeLawd 51 points 10 hours ago \"MAGA\" was dead when Israel convinced Trump to not release the Epstein Files and bomb Iran instead. permalink award report block reply Donger-Lord 17 points 9 hours ago We had a good run. The first few months were looking good until Trump got “the call”. Can’t have America being successful now, can we? permalink parent award report block reply\nDonger-Lord 17 points 9 hours ago We had a good run. The first few months were looking good until Trump got “the call”. Can’t have America being successful now, can we? permalink parent award report block reply\nAwakened 48 points 11 hours ago MAGA is America first and niether are going anywhere. permalink award report block reply maleitch 67 points 10 hours ago Then Trump needs a reminder permalink parent award report block reply Awakened 9 points 10 hours ago Keep screaming and don't stop. It's worked before. permalink parent award report block reply ReallyGayMods 14 points 10 hours ago Is a 50 year mortgage really exciting for you though? Can you really not admit that things have been really off lately? Do you really its better for America to have a retard from India who doesn't speak English make missles instead of a generic American? permalink parent award report block reply Awakened -3 points 10 hours ago You are accidentally responding to the wrong person or you're the worst troll on this board because I have no idea what you are going on about. permalink parent award report block reply view 1 more comments... MehNahMehNah 1 points 17 minutes ago Especially since it was his signature catchphrase. permalink parent award report block reply UsernameChexOut 17 points 10 hours ago That's correct. We are the movement now. Sadly, it's starting to look more and more like Trump is no longer the person to lead this movement. It's now up to us frens. permalink parent award report block reply SwedishChainsaw2 5 points 2 hours ago We always were the movement. Trump was our proxy. We always knew his tenure would not be forever and we'd have to find another. I personally was hoping it would be at the end ofnhis term, not 10 months into it. permalink parent award report block reply entwickelnden 1 points 46 minutes ago I wonder, having been shot already, if there are substantial threats to his family, by the deep state, that's fomenting the change as well. And he's probably seeing these compromises as a way of preventing an implosion his first year into it. Im happy about some of the things he's done and more importantly, how many ppl have woken up, I will be forever great full to him, and will give him the benefit of the doubt until his 3rd year. I'm not saying I won't voice my opinion and disagree, he needs to hear it from us, but I'm not about to bail on the guy who took a bullet and keeps fighting. permalink parent award report block reply Girthquakes -10 points 9 hours ago Wrong forum fag, c/mypussyhurts is 👉 that way. permalink parent award report block reply RyanKeyOh 6 points 9 hours ago No. MAGA is now MIGA. AF is still AF permalink parent award report block reply\nmaleitch 67 points 10 hours ago Then Trump needs a reminder permalink parent award report block reply Awakened 9 points 10 hours ago Keep screaming and don't stop. It's worked before. permalink parent award report block reply ReallyGayMods 14 points 10 hours ago Is a 50 year mortgage really exciting for you though? Can you really not admit that things have been really off lately? Do you really its better for America to have a retard from India who doesn't speak English make missles instead of a generic American? permalink parent award report block reply Awakened -3 points 10 hours ago You are accidentally responding to the wrong person or you're the worst troll on this board because I have no idea what you are going on about. permalink parent award report block reply view 1 more comments... MehNahMehNah 1 points 17 minutes ago Especially since it was his signature catchphrase. permalink parent award report block reply\nAwakened 9 points 10 hours ago Keep screaming and don't stop. It's worked before. permalink parent award report block reply ReallyGayMods 14 points 10 hours ago Is a 50 year mortgage really exciting for you though? Can you really not admit that things have been really off lately? Do you really its better for America to have a retard from India who doesn't speak English make missles instead of a generic American? permalink parent award report block reply Awakened -3 points 10 hours ago You are accidentally responding to the wrong person or you're the worst troll on this board because I have no idea what you are going on about. permalink parent award report block reply view 1 more comments...\nReallyGayMods 14 points 10 hours ago Is a 50 year mortgage really exciting for you though? Can you really not admit that things have been really off lately? Do you really its better for America to have a retard from India who doesn't speak English make missles instead of a generic American? permalink parent award report block reply Awakened -3 points 10 hours ago You are accidentally responding to the wrong person or you're the worst troll on this board because I have no idea what you are going on about. permalink parent award report block reply view 1 more comments...\nAwakened -3 points 10 hours ago You are accidentally responding to the wrong person or you're the worst troll on this board because I have no idea what you are going on about. permalink parent award report block reply view 1 more comments...\nMehNahMehNah 1 points 17 minutes ago Especially since it was his signature catchphrase. permalink parent award report block reply\nUsernameChexOut 17 points 10 hours ago That's correct. We are the movement now. Sadly, it's starting to look more and more like Trump is no longer the person to lead this movement. It's now up to us frens. permalink parent award report block reply SwedishChainsaw2 5 points 2 hours ago We always were the movement. Trump was our proxy. We always knew his tenure would not be forever and we'd have to find another. I personally was hoping it would be at the end ofnhis term, not 10 months into it. permalink parent award report block reply entwickelnden 1 points 46 minutes ago I wonder, having been shot already, if there are substantial threats to his family, by the deep state, that's fomenting the change as well. And he's probably seeing these compromises as a way of preventing an implosion his first year into it. Im happy about some of the things he's done and more importantly, how many ppl have woken up, I will be forever great full to him, and will give him the benefit of the doubt until his 3rd year. I'm not saying I won't voice my opinion and disagree, he needs to hear it from us, but I'm not about to bail on the guy who took a bullet and keeps fighting. permalink parent award report block reply Girthquakes -10 points 9 hours ago Wrong forum fag, c/mypussyhurts is 👉 that way. permalink parent award report block reply\nSwedishChainsaw2 5 points 2 hours ago We always were the movement. Trump was our proxy. We always knew his tenure would not be forever and we'd have to find another. I personally was hoping it would be at the end ofnhis term, not 10 months into it. permalink parent award report block reply entwickelnden 1 points 46 minutes ago I wonder, having been shot already, if there are substantial threats to his family, by the deep state, that's fomenting the change as well. And he's probably seeing these compromises as a way of preventing an implosion his first year into it. Im happy about some of the things he's done and more importantly, how many ppl have woken up, I will be forever great full to him, and will give him the benefit of the doubt until his 3rd year. I'm not saying I won't voice my opinion and disagree, he needs to hear it from us, but I'm not about to bail on the guy who took a bullet and keeps fighting. permalink parent award report block reply\nentwickelnden 1 points 46 minutes ago I wonder, having been shot already, if there are substantial threats to his family, by the deep state, that's fomenting the change as well. And he's probably seeing these compromises as a way of preventing an implosion his first year into it. Im happy about some of the things he's done and more importantly, how many ppl have woken up, I will be forever great full to him, and will give him the benefit of the doubt until his 3rd year. I'm not saying I won't voice my opinion and disagree, he needs to hear it from us, but I'm not about to bail on the guy who took a bullet and keeps fighting. permalink parent award report block reply\nGirthquakes -10 points 9 hours ago Wrong forum fag, c/mypussyhurts is 👉 that way. permalink parent award report block reply\nRyanKeyOh 6 points 9 hours ago No. MAGA is now MIGA. AF is still AF permalink parent award report block reply\nNotLikeThis 42 points 10 hours ago This is a boomer take. Almost every gen z conservative is \"America First\". Trump's fucking up with the H1B, 50 year mortgage, Israel worship. Circle jerking instead of pushing back on Trump will, in fact, kill MAGA. permalink award report block reply\nDEUSVEULT232 38 points 10 hours ago Its not doomerism to point out that importing foreigners into our country at the detriment of our own workers is wrong. Trump implying, we can't train our own people because we are stupid is absurd and will fracture this movement. All the BS the last couple months over foreign policy won't stop the MAGA movement, but this H1B issue will. The sad thing is the Dems will win and undue everything Trump accomplished and usher in communism. permalink award report block reply\nOneTypoComment 34 points 11 hours ago current psyop is fatiguing permalink award report block reply Repentnow 14 points 11 hours ago And there seems to be an endless amount of them here too, as of late. permalink parent award report block reply OneTypoComment 10 points 10 hours ago Yup, but they're not all in on it; some simply fell for it. The media is an outrage driven machine. Nearly everything is meant to outrage and drive engagement. The frothier people get, they more the click and share permalink parent award report block reply Wexit-Delecto 5 points 10 hours ago Thank goodness President Trump isn’t actually pro H1B! Phew! permalink parent award report block reply OneTypoComment -1 points 10 hours ago did he claim at any time he was going to end H1B completely? permalink parent award report block reply view 7 more comments... Helly 1 points 3 hours ago Woke right permalink parent award report block reply lizardo221 1 points 7 hours ago I couldn't agree more. permalink parent award report block reply bumpman -2 points 10 hours ago It happens every year after the election, the never trumpers and paid shills come out in full force to counter signal MAGA and trump, then trump comes back stronger than ever and they start apologizing and trying to crawl back in. In 17/18 it was Russia Russia and Charlottesville hoax In 2021/22 it was Jan 6, mass censorship and the “desantis train” Now it’s Israel and H1B permalink parent award report block reply seeling0 1 points 10 hours ago Remember when the same whores were crawling about here during the election reminding everyone that voting was pointless and Trump would never ever in a million years get a second term? Good times. permalink parent award report block reply\nRepentnow 14 points 11 hours ago And there seems to be an endless amount of them here too, as of late. permalink parent award report block reply OneTypoComment 10 points 10 hours ago Yup, but they're not all in on it; some simply fell for it. The media is an outrage driven machine. Nearly everything is meant to outrage and drive engagement. The frothier people get, they more the click and share permalink parent award report block reply Wexit-Delecto 5 points 10 hours ago Thank goodness President Trump isn’t actually pro H1B! Phew! permalink parent award report block reply OneTypoComment -1 points 10 hours ago did he claim at any time he was going to end H1B completely? permalink parent award report block reply view 7 more comments... Helly 1 points 3 hours ago Woke right permalink parent award report block reply\nOneTypoComment 10 points 10 hours ago Yup, but they're not all in on it; some simply fell for it. The media is an outrage driven machine. Nearly everything is meant to outrage and drive engagement. The frothier people get, they more the click and share permalink parent award report block reply Wexit-Delecto 5 points 10 hours ago Thank goodness President Trump isn’t actually pro H1B! Phew! permalink parent award report block reply OneTypoComment -1 points 10 hours ago did he claim at any time he was going to end H1B completely? permalink parent award report block reply view 7 more comments...\nWexit-Delecto 5 points 10 hours ago Thank goodness President Trump isn’t actually pro H1B! Phew! permalink parent award report block reply OneTypoComment -1 points 10 hours ago did he claim at any time he was going to end H1B completely? permalink parent award report block reply view 7 more comments...\nOneTypoComment -1 points 10 hours ago did he claim at any time he was going to end H1B completely? permalink parent award report block reply view 7 more comments...\nHelly 1 points 3 hours ago Woke right permalink parent award report block reply\nlizardo221 1 points 7 hours ago I couldn't agree more. permalink parent award report block reply\nbumpman -2 points 10 hours ago It happens every year after the election, the never trumpers and paid shills come out in full force to counter signal MAGA and trump, then trump comes back stronger than ever and they start apologizing and trying to crawl back in. In 17/18 it was Russia Russia and Charlottesville hoax In 2021/22 it was Jan 6, mass censorship and the “desantis train” Now it’s Israel and H1B permalink parent award report block reply seeling0 1 points 10 hours ago Remember when the same whores were crawling about here during the election reminding everyone that voting was pointless and Trump would never ever in a million years get a second term? Good times. permalink parent award report block reply\nseeling0 1 points 10 hours ago Remember when the same whores were crawling about here during the election reminding everyone that voting was pointless and Trump would never ever in a million years get a second term? Good times. permalink parent award report block reply\nCaptainCuomo 30 points 10 hours ago Christ is King. permalink award report block reply\nDoctornirgon 26 points 10 hours ago Not sure I'm qualified enough to vote, better bring in an H1B permalink award report block reply\nBadBrainsBuzzcocks 22 points 10 hours ago Oh let's see, asking us to accept 50 fucking year mortgages with astronomical interest and deferred equity along with 15yr car loans, $2000 inflation inducing stimulus, telling us we need to educate 600k chinese spies and that failing Marxist colleges shouldn't crash and burn and then ARGUING we aren't talented enough to do the jobs shit throwers can do is certainly NOT America first. I'm pretty fucking pissed. permalink award report block reply JesusTheOnlyWay 7 points 6 hours ago Precisely. Maga is dead? I don't know. Maga is dying? Yes, absolutely. At least the version of it that relied on Trump. permalink parent award report block reply\nJesusTheOnlyWay 7 points 6 hours ago Precisely. Maga is dead? I don't know. Maga is dying? Yes, absolutely. At least the version of it that relied on Trump. permalink parent award report block reply\nAppalachianTactical 19 points 10 hours ago Whatever is next, everyone should have learned that there can be no thought leader. The right needs to follow beliefs that cannot be undermined like people can. I dont just mean the constitution, but a list for americans in our time. I dont disagree that maga is on its last legs if not dead. Trump has three years to prove he was loyal to Americans rather than Israel, but he has given me zero faith this term. permalink award report block reply RyanKeyOh 8 points 9 hours ago he has LESS THAN ONE If Dems sweep the midterms the impeachment BS will start again and we will lose all momentum permalink parent award report block reply\nRyanKeyOh 8 points 9 hours ago he has LESS THAN ONE If Dems sweep the midterms the impeachment BS will start again and we will lose all momentum permalink parent award report block reply\neclectic22 17 points 11 hours ago Long live MAGA! permalink award report block reply Wexit-Delecto 22 points 10 hours ago 2016 MAGA. Not this nu-MAGA that begs for more replacements as long as they come legally. permalink parent award report block reply ParadigmShift2070 12 points 9 hours ago Judeo-maga permalink parent award report block reply RyanKeyOh 3 points 9 hours ago Kek permalink parent award report block reply\nWexit-Delecto 22 points 10 hours ago 2016 MAGA. Not this nu-MAGA that begs for more replacements as long as they come legally. permalink parent award report block reply ParadigmShift2070 12 points 9 hours ago Judeo-maga permalink parent award report block reply RyanKeyOh 3 points 9 hours ago Kek permalink parent award report block reply\nParadigmShift2070 12 points 9 hours ago Judeo-maga permalink parent award report block reply RyanKeyOh 3 points 9 hours ago Kek permalink parent award report block reply\nRyanKeyOh 3 points 9 hours ago Kek permalink parent award report block reply\nArchRespawnsAgain 15 points 10 hours ago Why did you post this same screenshot three times? https://scored.co/c/TheDonald/p/1ARK9pelsH/the-latest-totally-organic-scrip/c https://scored.co/c/TheDonald/p/1ARK9peUgy/democratic-national-committee-is/c permalink award report block reply\nYouEssAye 15 points 10 hours ago Are we making America great again yet, or is that gonna be in two more weeks? I'll just trust the plan. Q will save us. Edit: The stickies from the late night through early morning(EST time) are always pushing a certain narrative. It's uncanny once you notice it. It's almost like the mod is in a different time zone. permalink award report block reply heightnoise 11 points 10 hours ago It's almost like the mod is in a different time zone. Isn't it incredible? Its almost like the hours of 11:00pm to 8:00am EST coincide with the workday hours of a...certain part of the world. permalink parent award report block reply\nheightnoise 11 points 10 hours ago It's almost like the mod is in a different time zone. Isn't it incredible? Its almost like the hours of 11:00pm to 8:00am EST coincide with the workday hours of a...certain part of the world. permalink parent award report block reply\nWexit-Delecto 11 points 10 hours ago We can definitely count on this site to keep MAGA’s dream of being replaced by H1V third worlders alive. permalink award report block reply\nM-m-m-my-corona 11 points 10 hours ago And Trump killed it.  The sooner you guys realize that and  come over to our side, the better.  Or go die for Israel.  Your choice. permalink award report block reply\nAmericanJawa 8 points 10 hours ago MAGA is America First. permalink award report block reply maleitch 9 points 10 hours ago Yeah nothing says America first like replacing Americans with foreigners. permalink parent award report block reply AmericanJawa 1 points 8 hours ago Yeah nothing says America first like replacing Americans with foreigners. \"replacing Americans with foreigners\" isn't MAGA. permalink parent award report block reply\nmaleitch 9 points 10 hours ago Yeah nothing says America first like replacing Americans with foreigners. permalink parent award report block reply AmericanJawa 1 points 8 hours ago Yeah nothing says America first like replacing Americans with foreigners. \"replacing Americans with foreigners\" isn't MAGA. permalink parent award report block reply\nAmericanJawa 1 points 8 hours ago Yeah nothing says America first like replacing Americans with foreigners. \"replacing Americans with foreigners\" isn't MAGA. permalink parent award report block reply\nNancyPeloci 7 points 11 hours ago Why are we dead this time?  Net neutrality?  Global Warming? permalink award report block reply ReallyGayMods 12 points 10 hours ago Trump said americans don't have the talent in a lot of areas so we gotta import people who don't speak English and shit in the street to take good paying jobs from us permalink parent award report block reply lizardo221 4 points 5 hours ago People are misquoting the president and pretending our manufacturing industries were not bored out over the last half century by globalization. Where I think the administration could do a better job is explaining the process of getting Americans back up to speed, and making sure that ones qualified - actually qualified - are in fact getting jobs over foreigners. Some of this is also on the republicans in Congress to figure out these visa programs, structuring them better and more clearly. permalink parent award report block reply\nReallyGayMods 12 points 10 hours ago Trump said americans don't have the talent in a lot of areas so we gotta import people who don't speak English and shit in the street to take good paying jobs from us permalink parent award report block reply\nlizardo221 4 points 5 hours ago People are misquoting the president and pretending our manufacturing industries were not bored out over the last half century by globalization. Where I think the administration could do a better job is explaining the process of getting Americans back up to speed, and making sure that ones qualified - actually qualified - are in fact getting jobs over foreigners. Some of this is also on the republicans in Congress to figure out these visa programs, structuring them better and more clearly. permalink parent award report block reply\nbarwhack 7 points 11 hours ago Hmm. I don't feel dead... permalink award report block reply\nMagaJay02 6 points 11 hours ago We've heard thos hundreds of times over the years. Yeah, things are rough currently, we aren't 1 year in. Nobody said things wouldn't be rocky! permalink award report block reply ReallyGayMods 16 points 10 hours ago Nobody expected the rockiness to come from our guy though permalink parent award report block reply MagaJay02 1 points 10 hours ago Meh. I've seen it go in circles over the years. I think Trumps biggest issue right now is he's bragging about the economy and other things. It'd feel way better if she showed the wins, without embellishments, but also point out we have a long road to go down to solve a ton lf issues that are still plaguing Americans. permalink parent award report block reply ReallyGayMods 5 points 10 hours ago 1000%. Telling me the economy is doing so good reminds me of the 4 years the biden admin told me that. permalink parent award report block reply Litterboxer1 0 points 10 hours ago What makes you think it isn't? permalink parent award report block reply view 1 more comments... lizardo221 1 points 5 hours ago I think part of the problem is that he is far more focused on long term than short term, and most people are very bad at long term thinking. You have energy unleashed, massive amounts of investment for producing all kind of things on our shores, RFK taking an axe to the bad medical system, and far more control over the flow of people than we have had in a long time - all examples of things that can take many years to fully produce results. The seeds have all been planted for these things and more, but many Americans are hurting in the immediate right now, and that cannot be ignored. Not just Trump, but Republicans as a whole have to come up with better short term measures to buy time. That includes the Tuckers and Mark Levin's of the world - everyone needs to stop wasting their time on bullshit and think of real solutions. With regards to the H1B topic,  it is very complicated and I don't think it is as simple as Trump thinks Americans are too stupid. I can get into the weeds, but my view is that he has a relaxed attitude towards it largely because it's one of the few ways he can brute force prices down in some areas. It's not something that matters long term because a ton of those jobs will get replaced by ai anyway. permalink parent award report block reply Apersonofinterest 11 points 10 hours ago As Bannon likes to say, they aren’t just going to give up and hand us the keys. We have to fight them and take the motherfuckers. permalink parent award report block reply ReallyGayMods 7 points 10 hours ago But we elected trump for that.. now he's having democrat opinions on foreign labor permalink parent award report block reply Apersonofinterest 1 points 7 hours ago I don’t think it’s the mods that are gay… permalink parent award report block reply Wexit-Delecto 2 points 10 hours ago Fight them… with H1Bs! permalink parent award report block reply altYPNeT 4 points 9 hours ago Trump should stop shooting himself in the foot. Maybe then the boat will stop rocking. permalink parent award report block reply\nReallyGayMods 16 points 10 hours ago Nobody expected the rockiness to come from our guy though permalink parent award report block reply MagaJay02 1 points 10 hours ago Meh. I've seen it go in circles over the years. I think Trumps biggest issue right now is he's bragging about the economy and other things. It'd feel way better if she showed the wins, without embellishments, but also point out we have a long road to go down to solve a ton lf issues that are still plaguing Americans. permalink parent award report block reply ReallyGayMods 5 points 10 hours ago 1000%. Telling me the economy is doing so good reminds me of the 4 years the biden admin told me that. permalink parent award report block reply Litterboxer1 0 points 10 hours ago What makes you think it isn't? permalink parent award report block reply view 1 more comments... lizardo221 1 points 5 hours ago I think part of the problem is that he is far more focused on long term than short term, and most people are very bad at long term thinking. You have energy unleashed, massive amounts of investment for producing all kind of things on our shores, RFK taking an axe to the bad medical system, and far more control over the flow of people than we have had in a long time - all examples of things that can take many years to fully produce results. The seeds have all been planted for these things and more, but many Americans are hurting in the immediate right now, and that cannot be ignored. Not just Trump, but Republicans as a whole have to come up with better short term measures to buy time. That includes the Tuckers and Mark Levin's of the world - everyone needs to stop wasting their time on bullshit and think of real solutions. With regards to the H1B topic,  it is very complicated and I don't think it is as simple as Trump thinks Americans are too stupid. I can get into the weeds, but my view is that he has a relaxed attitude towards it largely because it's one of the few ways he can brute force prices down in some areas. It's not something that matters long term because a ton of those jobs will get replaced by ai anyway. permalink parent award report block reply\nMagaJay02 1 points 10 hours ago Meh. I've seen it go in circles over the years. I think Trumps biggest issue right now is he's bragging about the economy and other things. It'd feel way better if she showed the wins, without embellishments, but also point out we have a long road to go down to solve a ton lf issues that are still plaguing Americans. permalink parent award report block reply ReallyGayMods 5 points 10 hours ago 1000%. Telling me the economy is doing so good reminds me of the 4 years the biden admin told me that. permalink parent award report block reply Litterboxer1 0 points 10 hours ago What makes you think it isn't? permalink parent award report block reply view 1 more comments... lizardo221 1 points 5 hours ago I think part of the problem is that he is far more focused on long term than short term, and most people are very bad at long term thinking. You have energy unleashed, massive amounts of investment for producing all kind of things on our shores, RFK taking an axe to the bad medical system, and far more control over the flow of people than we have had in a long time - all examples of things that can take many years to fully produce results. The seeds have all been planted for these things and more, but many Americans are hurting in the immediate right now, and that cannot be ignored. Not just Trump, but Republicans as a whole have to come up with better short term measures to buy time. That includes the Tuckers and Mark Levin's of the world - everyone needs to stop wasting their time on bullshit and think of real solutions. With regards to the H1B topic,  it is very complicated and I don't think it is as simple as Trump thinks Americans are too stupid. I can get into the weeds, but my view is that he has a relaxed attitude towards it largely because it's one of the few ways he can brute force prices down in some areas. It's not something that matters long term because a ton of those jobs will get replaced by ai anyway. permalink parent award report block reply\nReallyGayMods 5 points 10 hours ago 1000%. Telling me the economy is doing so good reminds me of the 4 years the biden admin told me that. permalink parent award report block reply Litterboxer1 0 points 10 hours ago What makes you think it isn't? permalink parent award report block reply view 1 more comments...\nLitterboxer1 0 points 10 hours ago What makes you think it isn't? permalink parent award report block reply view 1 more comments...\nlizardo221 1 points 5 hours ago I think part of the problem is that he is far more focused on long term than short term, and most people are very bad at long term thinking. You have energy unleashed, massive amounts of investment for producing all kind of things on our shores, RFK taking an axe to the bad medical system, and far more control over the flow of people than we have had in a long time - all examples of things that can take many years to fully produce results. The seeds have all been planted for these things and more, but many Americans are hurting in the immediate right now, and that cannot be ignored. Not just Trump, but Republicans as a whole have to come up with better short term measures to buy time. That includes the Tuckers and Mark Levin's of the world - everyone needs to stop wasting their time on bullshit and think of real solutions. With regards to the H1B topic,  it is very complicated and I don't think it is as simple as Trump thinks Americans are too stupid. I can get into the weeds, but my view is that he has a relaxed attitude towards it largely because it's one of the few ways he can brute force prices down in some areas. It's not something that matters long term because a ton of those jobs will get replaced by ai anyway. permalink parent award report block reply\nApersonofinterest 11 points 10 hours ago As Bannon likes to say, they aren’t just going to give up and hand us the keys. We have to fight them and take the motherfuckers. permalink parent award report block reply ReallyGayMods 7 points 10 hours ago But we elected trump for that.. now he's having democrat opinions on foreign labor permalink parent award report block reply Apersonofinterest 1 points 7 hours ago I don’t think it’s the mods that are gay… permalink parent award report block reply Wexit-Delecto 2 points 10 hours ago Fight them… with H1Bs! permalink parent award report block reply\nReallyGayMods 7 points 10 hours ago But we elected trump for that.. now he's having democrat opinions on foreign labor permalink parent award report block reply Apersonofinterest 1 points 7 hours ago I don’t think it’s the mods that are gay… permalink parent award report block reply\nApersonofinterest 1 points 7 hours ago I don’t think it’s the mods that are gay… permalink parent award report block reply\nWexit-Delecto 2 points 10 hours ago Fight them… with H1Bs! permalink parent award report block reply\naltYPNeT 4 points 9 hours ago Trump should stop shooting himself in the foot. Maybe then the boat will stop rocking. permalink parent award report block reply\nScumbag-reddit 5 points 4 hours ago These faggots are trying to claim they're starting america first? MAGA is America First permalink award report block reply\nGhost_Division 5 points 10 hours ago This isn't the first time trump has said something then gotten bodied by the base. permalink award report block reply\nTooBright 5 points 9 hours ago Trump is still your president. permalink award report block reply\nFerkenBlerkin 5 points 10 hours ago All Fuentes does lately is make me understand why people call him a faggot. permalink award report block reply\nhairless_ap3 4 points 3 hours ago Bunch of paid faggots And if you're one of the faggots that sits around all day listening to faggots like this thinking you need them to tell you how to live your life fuck off permalink award report block reply\nRoadpower 4 points 11 hours ago For the Horde! permalink award report block reply\nDev404 4 points 10 hours ago Exactly what has made MAGA dead? MAGA isn't this administration, nor is it just Trump. If it's gone, what took over? A vague statement like that doesn't actually mean a damn thing. This looks like more attention-seeking drama queen mentality. permalink award report block reply\nSnek_Plissken 4 points 9 hours ago Oh no, some bots said some things on twitter!\nAnyway. permalink award report block reply\nMAGA-Fett 3 points 10 hours ago So what are they sperging out about? permalink award report block reply\nPaxvobiscum 3 points 10 hours ago While they're being dramatic, we all know we disagree with these moves permalink award report block reply\n5121313 3 points 11 hours ago 🤣 The Brain Dead Shall Speak when Told... permalink award report block reply\nTexasBeer 3 points 10 hours ago “America First” is the natural path forward. In the order of first loves, funding Israel and wasting tax dollars on foreigners won’t cut it anymore. permalink award report block reply\njiujiujiu 3 points 7 hours ago Uh what’s the difference between making America great again and America first? Seems the same to me permalink award report block reply\nDallasguy 3 points 10 hours ago I don't understand. When is MAGA not America First? permalink award report block reply ParadigmShift2070 1 points 9 hours ago When the Judeo-cons say it's un-American if you don't support Israel permalink parent award report block reply AmericanJawa 1 points 8 hours ago When the Judeo-cons say it's un-American if you don't support Israel People trying to hijack MAGA for their own personal agendas means MAGA is dead? permalink parent award report block reply\nParadigmShift2070 1 points 9 hours ago When the Judeo-cons say it's un-American if you don't support Israel permalink parent award report block reply AmericanJawa 1 points 8 hours ago When the Judeo-cons say it's un-American if you don't support Israel People trying to hijack MAGA for their own personal agendas means MAGA is dead? permalink parent award report block reply\nAmericanJawa 1 points 8 hours ago When the Judeo-cons say it's un-American if you don't support Israel People trying to hijack MAGA for their own personal agendas means MAGA is dead? permalink parent award report block reply\nCaliAli 3 points 10 hours ago I thought  America First = MAGA - what am I missing? permalink award report block reply lizardo221 3 points 5 hours ago It has been, but a handful of nuts are trying to splinter the right and make America First something else. We have a lot of bots floating around here lately pushing all kinds of weird crap. permalink parent award report block reply\nlizardo221 3 points 5 hours ago It has been, but a handful of nuts are trying to splinter the right and make America First something else. We have a lot of bots floating around here lately pushing all kinds of weird crap. permalink parent award report block reply\nHaz85 3 points 4 hours ago All the bots are saying it though, so it must be true permalink award report block reply\nLaMigraEspecial 3 points 10 hours ago Dead Internet Theory strikes again! permalink award report block reply\nMinn2000 3 points 10 hours ago I only recognize 2 of the accounts above and both of them are retarded. permalink award report block reply\nKricket 3 points 10 hours ago They post here too lol permalink award report block reply\nf_bastiat 2 points 9 hours ago MAGA will be dead when our national debt is 0, so basically MAGA is forever. permalink award report block reply\nkeeman 2 points 8 hours ago I'd really like it if MAGA could start actually acting like America First.  Seeing a lot of Isreal First.  Seeing a lot of big business first.  Seeing a lot of focus on fixing other countries' problems.  Seeing a lot of defense or H1B and ridiculous levels of foreign students. permalink award report block reply\npedeypete 2 points 4 hours ago Give them a little slack, their weak little minds don't want to be MAGA but America First is the same fucking thing. When we make American interest First, we know what it is. permalink award report block reply\nknnbccb 2 points 10 hours ago Remember when Elon Musk was about to acquire Twitter and there was a concern about the number of bots (vs real users) in Twitter? You're witnessing this now. permalink award report block reply lizardo221 1 points 5 hours ago Christ, you're right. permalink parent award report block reply\nlizardo221 1 points 5 hours ago Christ, you're right. permalink parent award report block reply\nsir_rockness 2 points 2 hours ago Trump said the economy is doing great and we're crazy if we disagree... sorry I haven't seen shit done for main street USA.  Lots of great datacenter deals though.   Then he said we're too dumb to perform highly skilled jobs... even though I've been in that industry for around 30 years DOING IT... largely self taught... and watching FUCKING PAJEETS and greedy CEOS destroy this industry for at least 15 of them. Then add on the Israel first bullshit (which is absolutely true) I love the guy but he seriously needs to get his head out of his ass now because he's starting to look about like the sons of bitches in congress who hate us and only exist to steal our wealth. permalink award report block reply\nRobinNet 2 points 10 hours ago turn on my smart watch... nope- still got a pulse. permalink award report block reply\npresticus 2 points 11 hours ago If Nick Fuentes & Dean Withers agree on something you know they're both retarded. permalink award report block reply\nThatsGold 2 points 10 hours ago It was a good run permalink award report block reply\nPatriotDescendant 2 points 2 hours ago Trump's thoughts on H1Bs is asinine/naive/misinformed, as is the 50 year mortgage thing. But I won't turn. permalink award report block reply\nKungPaoMcChicken 2 points 10 hours ago Maybe if more of you were on X to counter this nonsense. Oh right, we are here instead. Right.. permalink award report block reply lizardo221 2 points 5 hours ago I wonder sometimes if I should bail on this website. It doesn't function at all like it did years ago. I almost stay here simply to defend MAGA at this point. permalink parent award report block reply Wexit-Delecto 1 points 10 hours ago X never unbanned most of us. permalink parent award report block reply KungPaoMcChicken 2 points 9 hours ago I got banned from X after Elon was going through his anti censorship phase for trying to trigger mens rights activists. permalink parent award report block reply\nlizardo221 2 points 5 hours ago I wonder sometimes if I should bail on this website. It doesn't function at all like it did years ago. I almost stay here simply to defend MAGA at this point. permalink parent award report block reply\nWexit-Delecto 1 points 10 hours ago X never unbanned most of us. permalink parent award report block reply KungPaoMcChicken 2 points 9 hours ago I got banned from X after Elon was going through his anti censorship phase for trying to trigger mens rights activists. permalink parent award report block reply\nKungPaoMcChicken 2 points 9 hours ago I got banned from X after Elon was going through his anti censorship phase for trying to trigger mens rights activists. permalink parent award report block reply\nCalMagaMan 2 points 10 hours ago We are MAGA and we are Legion. They clearly don’t understand this yet. They still think MAGA is a single man. permalink award report block reply\nbluewhiteandred 2 points 10 hours ago maga dead for the umpteenth time... somehow keeps finding ways to revive! edit: I like how we were just celebrating a shutdown reopening win and then suddenly \"M@G@ 1Z D3D!!!\" becomes a meme... just like a rollercoaster of people getting irrationally optimistic and dooming over and over. and then just before that \"it was all over\" because of the fake blue wave elections last week. and in 2020 it was \"all over\" because of the stolen election. What will cause the insane optimism next week? permalink award report block reply\nDomTullipso 1 points 4 hours ago And Trump killed it by saying \"Epstein who? You stupid weaklings\" permalink award report block reply\nNeoDragoon 1 points 10 hours ago Fuentes isn't an incel, he's just a faggot that gets fucked by Destiny. permalink award report block reply\nhow_could 1 points 2 hours ago NGL I always thought MAGA was an America First agenda but its not right now. We need to evolve toward America First or we will never be great again, importing endless Indians to take the white collar jobs and Mexicans to take the manual labor and chjn3se students to become the future ph.Ds. permalink award report block reply\nIt_takes_10_years 1 points 2 hours ago Nick Fuentes is right about everything. permalink award report block reply\nCocaineNewsome 1 points 3 hours ago Turns out we were the MAGA all along. permalink award report block reply\nThan0sIII 1 points 11 hours ago Retarded purity testing.  Yeah Trump is weirdly fumbling the ball but ultimately we wouldn't be here without MAGA, and the alternative to here is way worse. permalink award report block reply NotLikeThis 7 points 10 hours ago term 1 repeat permalink parent award report block reply ReallyGayMods 4 points 10 hours ago I agree with your sentiment- this is beyond purity testing though permalink parent award report block reply\nNotLikeThis 7 points 10 hours ago term 1 repeat permalink parent award report block reply\nReallyGayMods 4 points 10 hours ago I agree with your sentiment- this is beyond purity testing though permalink parent award report block reply\nYodaBannon 1 points 11 hours ago MAGA polls will be YUGE tomorrow permalink award report block reply\nTartakovsky 1 points 10 hours ago I’m a zombie? permalink award report block reply\nGallowsTime 1 points 2 hours ago Who cares what a bunch of commie bots say? permalink award report block reply\nTxiribiton 1 points 4 hours ago People are MAGA. Government and dual citizens are MIGA. permalink award report block reply\nMehNahMehNah 1 points 20 minutes ago Nietzche said God is Dead way back when, and he was misunderstood. And Nietzche is now actually dead. permalink award report block reply\ntaytaytay 1 points 10 hours ago Sounds like some of the slack jawed faggots that hang around PDW permalink award report block reply\nthisperson 1 points 2 hours ago America first makes sense, if H1-B is MaGA. permalink award report block reply\nXxxRDTPRNxxX 1 points 10 hours ago If they actually follow \"America First\" I don't care what they call themselves. permalink award report block reply\n5DchessWatch 1 points 10 hours ago mafia affiliates get attenuated permalink award report block reply\nPiratePatriotParrot 1 points 10 hours ago If they don't fix the H1-B permalink award report block reply\nPillarOfWisdom 1 points 16 minutes ago What's wrong with America being first? Over the past couple of weeks, we've learned that MAGA is: 50 year mortgages 600k communist Chinese students More and more H-1Bs permalink award report block reply\nbooblitchutz 1 points 3 minutes ago Hm and I was thrown off X so this kind of shit could proliferate unchallenged, I can only assume. They said I was “spamming” which is completely bogus. I never repeated a fucking thing or used any kind of platform manipulation, just posted my own authentic opinions. permalink award report block reply\nEaszq8 1 points 8 hours ago Botty botto blyat bot permalink award report block reply\nboogeyman420 1 points 2 hours ago Nothing wrong with demanding results from your government permalink award report block reply\nmaleitch 0 points 10 hours ago Jesus why don't call them antisemitic while you are challenging your full Marxists debate tactic. Maga is bigger than one man, and I hope he has some grand plan because at the moment he is losing people who stuck but him.  You can go full reddit faggot and demand tribal loyalty over conviction but that just proves you were never maga to begin with. permalink award report block reply\nBacha_Bazi_Biden 0 points 1 hour ago Israel’s actions in the Middle East have brought Trump’s relationship with Israel and their influence over our government into question. You’re now called “Anti-Semitic” by people that claim they’re MAGA for any criticisms of Israel. Only 400,000 illegal aliens have been deported since his second term starts. Only 49,600,000 left. 50 year mortgages that our children or grandchildren will have to pay off sounds retarded at face value. H1B scam hasn’t been nipped in the bud, with Elon being a big beneficiary of the loophole. You can disagree like what I’m saying, but everything above is dividing the base, especially Israel. permalink award report block reply\nMhmm2MoreWeeks 0 points 10 hours ago MAGA is not dead. Its just splitting in Two. Jew Haters, and NOT Jew Haters. By Design. permalink award report block reply\nDeplorableNeandertal 0 points 7 hours ago Nah just booting the zio bros and jeets permalink award report block reply\ngrannylovestrump -1 points 10 hours ago Death where is they sting. permalink award report block reply\nSavingPrivateGrace -1 points 10 hours ago This was because of the election sweep of voted D win commies. permalink award report block reply\nBball-gurl -1 points 4 hours ago MAGA has BEEN dead, change my mind. You guys are a cult if you can't realize it. If we plan on reviving MAGA, Trump will NOT be the guy for the job. permalink award report block reply\nohpleaseuhhelpame -2 points 10 hours ago Its either MAGA and America First or its Socialism, Communism and the takeover by Muslims..take your pick. I'm sticking with MAGA! These people are stirring up crap and are not MAGA! permalink award report block reply\nBrandon1776 -2 points 10 hours ago The jew is afraid. It sould be. MAGA is dead, dear leader sold us out to Modi and Xi permalink award report block reply\nMondayCoupleIsDead -2 points 6 hours ago Incels? Are you a leftist woman, OP? Gay fuck. permalink award report block reply\nCrispyCracker2 -2 points 9 hours ago Well, it IS if Trump doesn't see what's going on and wakes the FUCK UP. permalink award report block reply\nEyesSewnShut 1 points 15 minutes ago Comment removed by community moderators. permalink award report block reply\nAlmostFullyDilated 0 points 7 hours ago Comment removed by community moderators. permalink award report block reply"}