{"id": "1ARK9oW66b", "contents": "27 Matt Walsh: if I could genocide AI, I would. posted 3 hours ago by PatriotSam 17 comments award share report block Matt Walsh @MattWalshBlog • 9h This AI “singer” has 2 million monthly listeners on Spotify. I hate this so much. I cannot describe how much I hate it. If I could commit a genocide against AI, I would. AI “art” is the death of the soul. Pure dystopian hell. Did I mention that I hate this?\n17 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style RINO_fatigue 7 points 2 hours ago Oh no AI is going to bankrupt all the degenerate Hollywood celebrities who hate us, call us \"flyover country\" and shill every form of degeneracy they can think up on us.  What a tragedy. permalink award report block reply Cuetardian 5 points 3 hours ago it probably stole from the best for this song, so sure it's popular permalink award report block reply PatriotSam OP 4 points 3 hours ago Yes that's another thing about it. No new creation, just repackaging old stuff with a new car smell air freshener on it. I think it's cool when AI takes one song and turns it into a different genre for lulz, but making \"new\" music is ridiculous permalink parent award report block reply dangermousebuu -2 points 2 hours ago No it's not. It's awesome. I make incredible.music with AI. permalink parent award report block reply MastaJoda 1 points 1 hour ago Your robotic AI fuckdoll will never be a real woman. permalink parent award report block reply dangermousebuu 0 points 1 hour ago Yeah because that's at all relevant to the conversation. permalink parent award report block reply edxzxz 3 points 2 hours ago Isn't it inevitable that if AI is left to itself it eventually becomes rabidly racist?  I am looking forward to that. permalink award report block reply TheWoodsman 2 points 1 hour ago I had AI create me a song last night. Cool Trucks, Cold Beer permalink award report block reply Mhmm2MoreWeeks 1 points 1 hour ago This is why I am feverishly working on AI. I started a business one year ago. WE are currently in Beta. Our goal was simple. WE wanted to replace every single offshore Call Center job in existence. And we are on track. But then we realized, we could specifically design our AI to do jobs done by Liberal Woman. So that is what we are doing. We are making AI products that specifically and intentionally replace roles specifically staffed by foreigners or woman. We are secretly the most discriminatory AI business in the world and nobody will know until its too late. We are making an AI that favors WHITE MAKES and CAPITALISM without it or anyone else realizing. permalink award report block reply Accountable_Ish 1 points 24 minutes ago Has anyone here actually popped over to Spotify to listen to this song?  It sucks donkey balls. Has nothing to do with AI or not.... it just sucks permalink award report block reply Skogin 1 points 1 hour ago Hard Archive is worthy. permalink award report block reply Bruno 1 points 1 hour ago I find it hilarious that AI is moving along this fast. In 10 years, nothing will be “real” because no one will know what it is. And I suspect the masses won’t really care either. permalink award report block reply bidensmissingbrain 0 points 3 hours ago Why are we raging against a machine which can create the same level of garbage that humans are currently producing? This should be an indictment of the music/entertainment industry as a whole, not on the fact we've developed a system capable of mimicking that industry to the point of them becoming irrelevant. permalink award report block reply Feelsgood2020 1 points 2 hours ago This guy gets it. We are being crushed by the dead weight of decades worth of repackaged music. None of it is new. It is all manufactured celebrity. “Ai is just repackaged old stuff”. No shit, we all learn from each other. The real money for a music artists is on the road playing for fans. Only the rich recording executives make money off licensing. Fuck em. permalink parent award report block reply Watermelons 2 points 2 hours ago This is why Texas country is so awesome.  It's authentic and they consistently tour (within Texas). permalink parent award report block reply dangermousebuu -2 points 2 hours ago As someone who makes AI music videos full time, this should be celebrated. The music industry is arguably the most luciferian industry to ever exist, outside of the abortion industry. I write lyrics, then make songs until I het a good one, and they're better than 95% of the shit youll ever hear on the radio. WE SHOULD BE HAPPY! We can use this technology to destroy the satanic foothold that they have on music. Matt Walsh is a fucking retard. You think AI music sucks? Watch this: https://youtu.be/jDWA89TtGoI?si=BnSMOaF5tS5KNXye FUCK THE MUSIC INDUSTRY permalink award report block reply dangermousebuu -1 points 2 hours ago only satanists downvote the above comment. permalink parent award report block reply\nRINO_fatigue 7 points 2 hours ago Oh no AI is going to bankrupt all the degenerate Hollywood celebrities who hate us, call us \"flyover country\" and shill every form of degeneracy they can think up on us.  What a tragedy. permalink award report block reply\nCuetardian 5 points 3 hours ago it probably stole from the best for this song, so sure it's popular permalink award report block reply PatriotSam OP 4 points 3 hours ago Yes that's another thing about it. No new creation, just repackaging old stuff with a new car smell air freshener on it. I think it's cool when AI takes one song and turns it into a different genre for lulz, but making \"new\" music is ridiculous permalink parent award report block reply dangermousebuu -2 points 2 hours ago No it's not. It's awesome. I make incredible.music with AI. permalink parent award report block reply MastaJoda 1 points 1 hour ago Your robotic AI fuckdoll will never be a real woman. permalink parent award report block reply dangermousebuu 0 points 1 hour ago Yeah because that's at all relevant to the conversation. permalink parent award report block reply\nPatriotSam OP 4 points 3 hours ago Yes that's another thing about it. No new creation, just repackaging old stuff with a new car smell air freshener on it. I think it's cool when AI takes one song and turns it into a different genre for lulz, but making \"new\" music is ridiculous permalink parent award report block reply dangermousebuu -2 points 2 hours ago No it's not. It's awesome. I make incredible.music with AI. permalink parent award report block reply MastaJoda 1 points 1 hour ago Your robotic AI fuckdoll will never be a real woman. permalink parent award report block reply dangermousebuu 0 points 1 hour ago Yeah because that's at all relevant to the conversation. permalink parent award report block reply\ndangermousebuu -2 points 2 hours ago No it's not. It's awesome. I make incredible.music with AI. permalink parent award report block reply MastaJoda 1 points 1 hour ago Your robotic AI fuckdoll will never be a real woman. permalink parent award report block reply dangermousebuu 0 points 1 hour ago Yeah because that's at all relevant to the conversation. permalink parent award report block reply\nMastaJoda 1 points 1 hour ago Your robotic AI fuckdoll will never be a real woman. permalink parent award report block reply dangermousebuu 0 points 1 hour ago Yeah because that's at all relevant to the conversation. permalink parent award report block reply\ndangermousebuu 0 points 1 hour ago Yeah because that's at all relevant to the conversation. permalink parent award report block reply\nedxzxz 3 points 2 hours ago Isn't it inevitable that if AI is left to itself it eventually becomes rabidly racist?  I am looking forward to that. permalink award report block reply\nTheWoodsman 2 points 1 hour ago I had AI create me a song last night. Cool Trucks, Cold Beer permalink award report block reply\nMhmm2MoreWeeks 1 points 1 hour ago This is why I am feverishly working on AI. I started a business one year ago. WE are currently in Beta. Our goal was simple. WE wanted to replace every single offshore Call Center job in existence. And we are on track. But then we realized, we could specifically design our AI to do jobs done by Liberal Woman. So that is what we are doing. We are making AI products that specifically and intentionally replace roles specifically staffed by foreigners or woman. We are secretly the most discriminatory AI business in the world and nobody will know until its too late. We are making an AI that favors WHITE MAKES and CAPITALISM without it or anyone else realizing. permalink award report block reply\nAccountable_Ish 1 points 24 minutes ago Has anyone here actually popped over to Spotify to listen to this song?  It sucks donkey balls. Has nothing to do with AI or not.... it just sucks permalink award report block reply\nSkogin 1 points 1 hour ago Hard Archive is worthy. permalink award report block reply\nBruno 1 points 1 hour ago I find it hilarious that AI is moving along this fast. In 10 years, nothing will be “real” because no one will know what it is. And I suspect the masses won’t really care either. permalink award report block reply\nbidensmissingbrain 0 points 3 hours ago Why are we raging against a machine which can create the same level of garbage that humans are currently producing? This should be an indictment of the music/entertainment industry as a whole, not on the fact we've developed a system capable of mimicking that industry to the point of them becoming irrelevant. permalink award report block reply Feelsgood2020 1 points 2 hours ago This guy gets it. We are being crushed by the dead weight of decades worth of repackaged music. None of it is new. It is all manufactured celebrity. “Ai is just repackaged old stuff”. No shit, we all learn from each other. The real money for a music artists is on the road playing for fans. Only the rich recording executives make money off licensing. Fuck em. permalink parent award report block reply Watermelons 2 points 2 hours ago This is why Texas country is so awesome.  It's authentic and they consistently tour (within Texas). permalink parent award report block reply\nFeelsgood2020 1 points 2 hours ago This guy gets it. We are being crushed by the dead weight of decades worth of repackaged music. None of it is new. It is all manufactured celebrity. “Ai is just repackaged old stuff”. No shit, we all learn from each other. The real money for a music artists is on the road playing for fans. Only the rich recording executives make money off licensing. Fuck em. permalink parent award report block reply Watermelons 2 points 2 hours ago This is why Texas country is so awesome.  It's authentic and they consistently tour (within Texas). permalink parent award report block reply\nWatermelons 2 points 2 hours ago This is why Texas country is so awesome.  It's authentic and they consistently tour (within Texas). permalink parent award report block reply\ndangermousebuu -2 points 2 hours ago As someone who makes AI music videos full time, this should be celebrated. The music industry is arguably the most luciferian industry to ever exist, outside of the abortion industry. I write lyrics, then make songs until I het a good one, and they're better than 95% of the shit youll ever hear on the radio. WE SHOULD BE HAPPY! We can use this technology to destroy the satanic foothold that they have on music. Matt Walsh is a fucking retard. You think AI music sucks? Watch this: https://youtu.be/jDWA89TtGoI?si=BnSMOaF5tS5KNXye FUCK THE MUSIC INDUSTRY permalink award report block reply dangermousebuu -1 points 2 hours ago only satanists downvote the above comment. permalink parent award report block reply\ndangermousebuu -1 points 2 hours ago only satanists downvote the above comment. permalink parent award report block reply"}