{"id": "1ARK54SlXs", "contents": "829 @elonmusk: As soon as you understand that the government is just the DMV at large scale, it makes perfect sense... 🚂   NO  BRAKES   🚂 posted 5 days ago by blue5707 26 comments award share report block Elon Musk @elonmusk • 5d As soon as you understand that the government is just the DMV at large scale, it makes perfect sense Declaration of Memes @LibertyCappy • 6d Absolutely no lies told! 🎯💯\n26 comments Sort by Top Top New Worst Old Save GA_Logic 29 points 5 days ago Get the federal government out of the way and costs would return to normal. permalink award report block reply 45fan 14 points 5 days ago Yeah, but then how would lazy oligarchs get rich off Indian labor and chinesium metal substitution? permalink parent award report block reply 1True-translation 18 points 5 days ago He's right permalink award report block reply PatriotSkorzeny 15 points 5 days ago lol Elon caught up finally. permalink award report block reply NoahGav 1 points 5 days ago I remember him saying this exact thing years ago. permalink parent award report block reply War_Hamster 12 points 5 days ago No truer words have ever spoken. This goes all the way back to Hamilton's \"federally funded internal improvements\". permalink award report block reply PhantomShield72 6 points 5 days ago Effective - succinct - most importantly, demonstrably true. But it won't matter. The people clamoring for \"free shit\" and the utopia of socialism will never hear this or even accept it if they did. permalink award report block reply TwoArizonaPedes 6 points 5 days ago That's a good way of putting it. permalink award report block reply Lurker6 4 points 5 days ago Whenever people complain about having to work for someone under capitalism, I always inform them that the people who get to decide if you even eat under socialism are a cross between TSA agents, a DMV worker, and the most nosey HOA manager you can imagine. permalink award report block reply FattyWatt 4 points 5 days ago The Truth Hurts & I hate the DMV. I hate govt more. permalink award report block reply TooBright 3 points 5 days ago Watch the supermarkets in NYC. They're about to get more affordable and accessible. permalink award report block reply 2016TrumpMAGA 3 points 5 days ago You are waiting 6 hours in the ER because illegals. Dialysis machines cost $30,000 because they aren't selling 50 million dialysis machines, like they are 85 inch TVs. permalink award report block reply Dev404 2 points 5 days ago The retards of society think socialism is the answer to everything... until they starve to death. Again. permalink award report block reply RolandDelacroix 2 points 5 days ago I change Postal locks for people and they get mad when I tell them up to 2 weeks.  What do you expect, I'm govt, I'm gonna take whatever it takes, you gonna go to the private mail system instead? Or, as one economist put it, look at where the employees park at a store, way in the back. Look at where the judges and lawyers park at court, right up front while you walk a few blocks. permalink award report block reply WeaponizedSmirk 2 points 5 days ago I'm as anti-Socialist as they come, but this is fucking retarded. A dialysis machine is complicated technology and they are not mass-produced, while a TV is made by Chinese slave labor in hundreds of factories. I can get a plumber to my house at 2 in the morning if I pay through the nose. LASIK doesn't require anesthesia or several assisting doctors and nurses. Stop comparing things that aren't comparable. permalink award report block reply WeaponizedSmirk 1 points 5 days ago \"This cheeseburger costs 1 dollar, and this steak and lobster costs 100 dollars? Why? Because the government never tried to make cheeseburgers affordable.\" permalink parent award report block reply patrioticwinning3 1 points 5 days ago Accept for the federal law enforcement and tax collection.  Those parts of the government run like a highly tuned engine :p permalink award report block reply Dereliction 1 points 5 days ago Except the DMV isn't nearly as corrupt as all the rest of it. permalink award report block reply SaltyTitties4 1 points 5 days ago The government never tried to make health care affordable either, dodo bird. The government has been trying to make you believe that it has been trying to make health care affordable and accessible, and you fell for it. permalink award report block reply Formerlurker92 1 points 5 days ago That's a feature not a bug permalink award report block reply MAGA-2028 -2 points 5 days ago Why the fuck are we promoting Elon’s bullshit. He exposed Trump for being on the list and humiliated him in treasonous act of betrayal. You can’t be MAGA and still support that autistic shill. permalink award report block reply AlaskaBrO93 5 points 5 days ago We're honestly more tired of Trump and his faggot picks more than we are of Elon at this point..Trump is getting played like a fiddle until the mid-terms. permalink parent award report block reply MAGA-2028 0 points 5 days ago Elon exposed Trump for being on the list. I suppose you want the list released to expose him even more. If you’re tired of Trump then you need to leave and go back to the reddit circle jerk. permalink parent award report block reply AlaskaBrO93 9 points 5 days ago I don't give a fuck even if Trump was on the list, I want him to do what he said he was going to do. Sentiment is very low around here because Trump has NOT been doing what he needs to. I would happily pay 10 dollars a gallon for fuel to see the motherfuckers arrested that orchestrated the Russian Collusion Hoax, January 6, COVID etc. But no, we are still paying the same price for everything, deporting a couple thousands illegals etc. This is nothing but a replay of his first term that will be quickly undone the second the next faggot takes office or even before. permalink parent award report block reply Deplorable_Yankee 2 points 5 days ago Pretty much sums up my feelings and no, it’s not due to the orchestrated campaign to divide around here. This discontentment I’m feeling has been building. Where the heck are the arrests? permalink parent award report block reply TheGoyimWhisperer 1 points 5 days ago Comment removed upon the user being banned. permalink award report block reply\nGA_Logic 29 points 5 days ago Get the federal government out of the way and costs would return to normal. permalink award report block reply 45fan 14 points 5 days ago Yeah, but then how would lazy oligarchs get rich off Indian labor and chinesium metal substitution? permalink parent award report block reply\n45fan 14 points 5 days ago Yeah, but then how would lazy oligarchs get rich off Indian labor and chinesium metal substitution? permalink parent award report block reply\n1True-translation 18 points 5 days ago He's right permalink award report block reply\nPatriotSkorzeny 15 points 5 days ago lol Elon caught up finally. permalink award report block reply NoahGav 1 points 5 days ago I remember him saying this exact thing years ago. permalink parent award report block reply\nNoahGav 1 points 5 days ago I remember him saying this exact thing years ago. permalink parent award report block reply\nWar_Hamster 12 points 5 days ago No truer words have ever spoken. This goes all the way back to Hamilton's \"federally funded internal improvements\". permalink award report block reply\nPhantomShield72 6 points 5 days ago Effective - succinct - most importantly, demonstrably true. But it won't matter. The people clamoring for \"free shit\" and the utopia of socialism will never hear this or even accept it if they did. permalink award report block reply\nTwoArizonaPedes 6 points 5 days ago That's a good way of putting it. permalink award report block reply\nLurker6 4 points 5 days ago Whenever people complain about having to work for someone under capitalism, I always inform them that the people who get to decide if you even eat under socialism are a cross between TSA agents, a DMV worker, and the most nosey HOA manager you can imagine. permalink award report block reply\nFattyWatt 4 points 5 days ago The Truth Hurts & I hate the DMV. I hate govt more. permalink award report block reply\nTooBright 3 points 5 days ago Watch the supermarkets in NYC. They're about to get more affordable and accessible. permalink award report block reply\n2016TrumpMAGA 3 points 5 days ago You are waiting 6 hours in the ER because illegals. Dialysis machines cost $30,000 because they aren't selling 50 million dialysis machines, like they are 85 inch TVs. permalink award report block reply\nDev404 2 points 5 days ago The retards of society think socialism is the answer to everything... until they starve to death. Again. permalink award report block reply\nRolandDelacroix 2 points 5 days ago I change Postal locks for people and they get mad when I tell them up to 2 weeks.  What do you expect, I'm govt, I'm gonna take whatever it takes, you gonna go to the private mail system instead? Or, as one economist put it, look at where the employees park at a store, way in the back. Look at where the judges and lawyers park at court, right up front while you walk a few blocks. permalink award report block reply\nWeaponizedSmirk 2 points 5 days ago I'm as anti-Socialist as they come, but this is fucking retarded. A dialysis machine is complicated technology and they are not mass-produced, while a TV is made by Chinese slave labor in hundreds of factories. I can get a plumber to my house at 2 in the morning if I pay through the nose. LASIK doesn't require anesthesia or several assisting doctors and nurses. Stop comparing things that aren't comparable. permalink award report block reply WeaponizedSmirk 1 points 5 days ago \"This cheeseburger costs 1 dollar, and this steak and lobster costs 100 dollars? Why? Because the government never tried to make cheeseburgers affordable.\" permalink parent award report block reply\nWeaponizedSmirk 1 points 5 days ago \"This cheeseburger costs 1 dollar, and this steak and lobster costs 100 dollars? Why? Because the government never tried to make cheeseburgers affordable.\" permalink parent award report block reply\npatrioticwinning3 1 points 5 days ago Accept for the federal law enforcement and tax collection.  Those parts of the government run like a highly tuned engine :p permalink award report block reply\nDereliction 1 points 5 days ago Except the DMV isn't nearly as corrupt as all the rest of it. permalink award report block reply\nSaltyTitties4 1 points 5 days ago The government never tried to make health care affordable either, dodo bird. The government has been trying to make you believe that it has been trying to make health care affordable and accessible, and you fell for it. permalink award report block reply\nFormerlurker92 1 points 5 days ago That's a feature not a bug permalink award report block reply\nMAGA-2028 -2 points 5 days ago Why the fuck are we promoting Elon’s bullshit. He exposed Trump for being on the list and humiliated him in treasonous act of betrayal. You can’t be MAGA and still support that autistic shill. permalink award report block reply AlaskaBrO93 5 points 5 days ago We're honestly more tired of Trump and his faggot picks more than we are of Elon at this point..Trump is getting played like a fiddle until the mid-terms. permalink parent award report block reply MAGA-2028 0 points 5 days ago Elon exposed Trump for being on the list. I suppose you want the list released to expose him even more. If you’re tired of Trump then you need to leave and go back to the reddit circle jerk. permalink parent award report block reply AlaskaBrO93 9 points 5 days ago I don't give a fuck even if Trump was on the list, I want him to do what he said he was going to do. Sentiment is very low around here because Trump has NOT been doing what he needs to. I would happily pay 10 dollars a gallon for fuel to see the motherfuckers arrested that orchestrated the Russian Collusion Hoax, January 6, COVID etc. But no, we are still paying the same price for everything, deporting a couple thousands illegals etc. This is nothing but a replay of his first term that will be quickly undone the second the next faggot takes office or even before. permalink parent award report block reply Deplorable_Yankee 2 points 5 days ago Pretty much sums up my feelings and no, it’s not due to the orchestrated campaign to divide around here. This discontentment I’m feeling has been building. Where the heck are the arrests? permalink parent award report block reply\nAlaskaBrO93 5 points 5 days ago We're honestly more tired of Trump and his faggot picks more than we are of Elon at this point..Trump is getting played like a fiddle until the mid-terms. permalink parent award report block reply MAGA-2028 0 points 5 days ago Elon exposed Trump for being on the list. I suppose you want the list released to expose him even more. If you’re tired of Trump then you need to leave and go back to the reddit circle jerk. permalink parent award report block reply AlaskaBrO93 9 points 5 days ago I don't give a fuck even if Trump was on the list, I want him to do what he said he was going to do. Sentiment is very low around here because Trump has NOT been doing what he needs to. I would happily pay 10 dollars a gallon for fuel to see the motherfuckers arrested that orchestrated the Russian Collusion Hoax, January 6, COVID etc. But no, we are still paying the same price for everything, deporting a couple thousands illegals etc. This is nothing but a replay of his first term that will be quickly undone the second the next faggot takes office or even before. permalink parent award report block reply Deplorable_Yankee 2 points 5 days ago Pretty much sums up my feelings and no, it’s not due to the orchestrated campaign to divide around here. This discontentment I’m feeling has been building. Where the heck are the arrests? permalink parent award report block reply\nMAGA-2028 0 points 5 days ago Elon exposed Trump for being on the list. I suppose you want the list released to expose him even more. If you’re tired of Trump then you need to leave and go back to the reddit circle jerk. permalink parent award report block reply AlaskaBrO93 9 points 5 days ago I don't give a fuck even if Trump was on the list, I want him to do what he said he was going to do. Sentiment is very low around here because Trump has NOT been doing what he needs to. I would happily pay 10 dollars a gallon for fuel to see the motherfuckers arrested that orchestrated the Russian Collusion Hoax, January 6, COVID etc. But no, we are still paying the same price for everything, deporting a couple thousands illegals etc. This is nothing but a replay of his first term that will be quickly undone the second the next faggot takes office or even before. permalink parent award report block reply Deplorable_Yankee 2 points 5 days ago Pretty much sums up my feelings and no, it’s not due to the orchestrated campaign to divide around here. This discontentment I’m feeling has been building. Where the heck are the arrests? permalink parent award report block reply\nAlaskaBrO93 9 points 5 days ago I don't give a fuck even if Trump was on the list, I want him to do what he said he was going to do. Sentiment is very low around here because Trump has NOT been doing what he needs to. I would happily pay 10 dollars a gallon for fuel to see the motherfuckers arrested that orchestrated the Russian Collusion Hoax, January 6, COVID etc. But no, we are still paying the same price for everything, deporting a couple thousands illegals etc. This is nothing but a replay of his first term that will be quickly undone the second the next faggot takes office or even before. permalink parent award report block reply Deplorable_Yankee 2 points 5 days ago Pretty much sums up my feelings and no, it’s not due to the orchestrated campaign to divide around here. This discontentment I’m feeling has been building. Where the heck are the arrests? permalink parent award report block reply\nDeplorable_Yankee 2 points 5 days ago Pretty much sums up my feelings and no, it’s not due to the orchestrated campaign to divide around here. This discontentment I’m feeling has been building. Where the heck are the arrests? permalink parent award report block reply\nTheGoyimWhisperer 1 points 5 days ago Comment removed upon the user being banned. permalink award report block reply"}