{"id": "1ARK590tzb", "contents": "1173 Here it is…\n\nOpening an investigation into the POTUS based on a lie.  “First we F*ck Flynn, then we F*ck Trump.”  - Andy McCabe! This quote has to come back to haunt the traitors. posted 4 days ago by LightBeacons 58 comments award share report block C3 @C_3C_3 • 4d Here it is… Opening an investigation into the POTUS based on a lie. “First we F*ck Flynn, then we F*ck Trump.” - Andy McCabe This quote has to come back to haunt the traitors. Remember POTUS Trump was never supposed to be in power once let alone twice. Now they must pay.\n58 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style VanillaCupCake 32 points 4 days ago something is going on... this is taking way too long.. permalink award report block reply TheRedPilledArtist 41 points 4 days ago What did Dan Bongino learn this July that shook him to his core, which he subsequently never spoke about again? permalink parent award report block reply Hanging_Chad 14 points 4 days ago In July 2025, while serving as the Deputy Director of the FBI, Dan Bongino indicated that he had encountered something related to an ongoing case, possibly the Jeffrey Epstein investigation, that \"shook him to his core\". This was in the context of a Justice Department (DOJ) decision not to make any future public disclosures regarding the Epstein case review, which caused significant controversy at the time. The specific information he learned has not been publicly disclosed. He mentioned he was not speculating and \"knows something\" but did not elaborate further in public statements, leading to rumors and social media speculation about what the information entailed and why he went silent on the specifics. Reports at the time suggested he was considering resignation due to the controversy surrounding the handling of the case information. https://abcnews.go.com/Politics/live-updates/trump-admin-live-updates/?id=123527438 permalink parent award report block reply Lelleck 27 points 4 days ago It is sad to see that even the ones we trusted betray us by staying silent permalink parent award report block reply SuperHonkey 7 points 3 days ago That's okay he'll have a book just in time for the 2030 primaries when the demos are in control and nothing can be done about it permalink parent award report block reply fat50 4 points 4 days ago He saw the contents of the Weiner laptop. permalink parent award report block reply keeman 13 points 4 days ago Mossad told him they would kill his family if he didn't cuck.  Just guessing. permalink parent award report block reply Seatacjoe 8 points 4 days ago Honestly that's the type of shit that I believe is that they just have a private meeting and then just show them like four of their family members in real time they have cross hairs on them. permalink parent award report block reply VanillaCupCake 7 points 4 days ago is that when he wanted to quit? permalink parent award report block reply keeman 5 points 4 days ago Yes permalink parent award report block reply BartzFFV 2 points 4 days ago He learned that Big Mikes rod fits effortlessly into his mangina. permalink parent award report block reply PeterThielAntiChrist 1 points 3 days ago he was lying. permalink parent award report block reply load 1 more comments... Donger-Lord 21 points 4 days ago (((They))) have always been in control. permalink parent award report block reply PowerOfBlues -22 points 4 days ago ((((((((you're a nudnik)))))))) permalink parent award report block reply Donger-Lord 11 points 4 days ago They here you are, being a dirty jewish faggot. permalink parent award report block reply thevagabond 3 points 3 days ago just need a couple more weeks... permalink parent award report block reply groomofthestool 2 points 4 days ago What, you're expeccting any/immediate action?? permalink parent award report block reply AbrahamLincoln 11 points 4 days ago Only been waiting for 8 fucking years.... permalink parent award report block reply HeavyMetalPatriot 7 points 4 days ago Fortunately we only have to wait deuce more weeks! permalink parent award report block reply HOSEQ 4 points 3 days ago Hey, according to the original Paperwork, we only have to wait until December 31st of 2042 for the Declass, and then we can do something about it.... Just 17 more years.... Oh, another 17.... permalink parent award report block reply PeterThielAntiChrist 1 points 3 days ago its AI. permalink parent award report block reply load 2 more comments... Chickensaurus 20 points 4 days ago Bondi is a disappointment. permalink award report block reply xkgb 14 points 4 days ago So is Kash. permalink parent award report block reply makersmarx 11 points 4 days ago So is Bongino. permalink parent award report block reply tommygigantica 4 points 3 days ago so is Trump permalink parent award report block reply UCantStumpTheTrump -1 points 4 days ago Kash has been working extraordinarily hard, just look at the numbers for child sex trafficking and drug arrests, they are way up over the Biden regime, and don’t forget the Trump DOJ indicted Comey, Letitia James, and Bolton. Smells like shills in here! permalink parent award report block reply BaronFalcon 2 points 3 days ago Indicted. Lets see a trial and conviction of even one of those before claiming thats an accomplishment. Until then it's literally a shiny nothing burger. permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago Lmao would you be shrugging it off as a nothingburger if YOU were indicted on multiple felony counts by a federal grand jury?? permalink parent award report block reply BartzFFV 5 points 4 days ago Woman cop. 🤡 permalink parent award report block reply Womb___Raider 11 points 4 days ago This email was known years ago. permalink award report block reply chickeninoven 15 points 4 days ago Wellllllllll you know these things take time, and oops, what do you know, term's over. permalink parent award report block reply ChyNahAzzWhole1 8 points 4 days ago Pam is protecting the assain alliance. permalink award report block reply BaronFalcon 1 points 3 days ago the what? first time i've seen that name/label permalink parent award report block reply SoulSnipper 7 points 4 days ago Execution level sedition against an elected President. Long sentences aren't enough, these people need to swing. permalink award report block reply Bruno 7 points 4 days ago The lack of actual accountability is staggeringly stupid. permalink award report block reply keeman 5 points 4 days ago No, it is expected.  The main grift is to pretend that we have an elected representative government.  Then make sure that the elected representatives have no real power. permalink parent award report block reply DylanPatrick 6 points 4 days ago They need to be hung for treason. permalink award report block reply Covfefe_Commando 5 points 4 days ago hanged permalink parent award report block reply Counterwhat 6 points 3 days ago Why do you think Thune fuses to recess the government? He knows President Trump would intal no nonsense people that would totally fuck up their grift. Don't be fooled Thune is one of them that needs to be outed. permalink award report block reply Choppermagic 6 points 4 days ago 2 weeks! permalink award report block reply knnbccb 4 points 4 days ago Your taxpayer money was being used to feed these traitors. Please don't waste more taxpayer money by continuing to feed them while they're locked up in prison. Kill them. Kill first, ask questions later. permalink award report block reply Hanging_Chad 4 points 4 days ago that’s a lot of fucking permalink award report block reply yodayoda 3 points 4 days ago \"now they must pay\" HAHAHAHAHAHAHA! that's a good one! permalink award report block reply IlhansBrother 2 points 4 days ago Why did Trump never hire General Flynn again? He would be perfect in a senior role of the FBI permalink award report block reply Mulletgunning 2 points 4 days ago I bet Pam is chomping at the bit to prosecute these traitors immediately. Come on boys and goys ,be patient its only going to take two more weeks to get it done. That's reasonable fellas. Lol That fucking Trojan horse establishment bitch is worthless. If Trump doesn't fire her yesterday,the WWE scripted entertainment will continue and we will accept it. We need Stephen Commie Killer ,MAGA AF Thriller,All Meat No Filler Miller cloned and dispersed across every agency to completey destroy the establishment blob of psychos. That is who we should be pushing for POTUS 2028. He is one of two MAGA AF weapons the establishment hates . Him and Trump are irreplaceable when it comes down to slamming commies and their minions at every level of government. He is the most hated but effective weapon we have in MAGA AF bar none. I and many others nominate Stephen Miller for POTUS 2028 . A real asskicker is what is needed to continue MAGA AF. permalink award report block reply V4Baretta 2 points 3 days ago Sons of bithez permalink award report block reply LePEDES 2 points 4 days ago Two more weeks! permalink award report block reply gezadreamsheets2 1 points 3 days ago Dissapointing permalink award report block reply Seldom_Seen_Kid 1 points 3 days ago We think it should, but we know it won’t. permalink award report block reply emorphia 1 points 4 days ago yea, they must pay ... but if they will pay is the question.  (asking Bondi) permalink award report block reply shogun5000 0 points 4 days ago It won't permalink award report block reply DCYR66 -1 points 3 days ago And nothing will be done. permalink award report block reply DCYR66 1 points 3 days ago 🖕downvote this permalink parent award report block reply new_guy2 1 points 4 days ago Comment removed by community moderators. permalink award report block reply\nVanillaCupCake 32 points 4 days ago something is going on... this is taking way too long.. permalink award report block reply TheRedPilledArtist 41 points 4 days ago What did Dan Bongino learn this July that shook him to his core, which he subsequently never spoke about again? permalink parent award report block reply Hanging_Chad 14 points 4 days ago In July 2025, while serving as the Deputy Director of the FBI, Dan Bongino indicated that he had encountered something related to an ongoing case, possibly the Jeffrey Epstein investigation, that \"shook him to his core\". This was in the context of a Justice Department (DOJ) decision not to make any future public disclosures regarding the Epstein case review, which caused significant controversy at the time. The specific information he learned has not been publicly disclosed. He mentioned he was not speculating and \"knows something\" but did not elaborate further in public statements, leading to rumors and social media speculation about what the information entailed and why he went silent on the specifics. Reports at the time suggested he was considering resignation due to the controversy surrounding the handling of the case information. https://abcnews.go.com/Politics/live-updates/trump-admin-live-updates/?id=123527438 permalink parent award report block reply Lelleck 27 points 4 days ago It is sad to see that even the ones we trusted betray us by staying silent permalink parent award report block reply SuperHonkey 7 points 3 days ago That's okay he'll have a book just in time for the 2030 primaries when the demos are in control and nothing can be done about it permalink parent award report block reply fat50 4 points 4 days ago He saw the contents of the Weiner laptop. permalink parent award report block reply keeman 13 points 4 days ago Mossad told him they would kill his family if he didn't cuck.  Just guessing. permalink parent award report block reply Seatacjoe 8 points 4 days ago Honestly that's the type of shit that I believe is that they just have a private meeting and then just show them like four of their family members in real time they have cross hairs on them. permalink parent award report block reply VanillaCupCake 7 points 4 days ago is that when he wanted to quit? permalink parent award report block reply keeman 5 points 4 days ago Yes permalink parent award report block reply BartzFFV 2 points 4 days ago He learned that Big Mikes rod fits effortlessly into his mangina. permalink parent award report block reply PeterThielAntiChrist 1 points 3 days ago he was lying. permalink parent award report block reply load 1 more comments... Donger-Lord 21 points 4 days ago (((They))) have always been in control. permalink parent award report block reply PowerOfBlues -22 points 4 days ago ((((((((you're a nudnik)))))))) permalink parent award report block reply Donger-Lord 11 points 4 days ago They here you are, being a dirty jewish faggot. permalink parent award report block reply thevagabond 3 points 3 days ago just need a couple more weeks... permalink parent award report block reply groomofthestool 2 points 4 days ago What, you're expeccting any/immediate action?? permalink parent award report block reply AbrahamLincoln 11 points 4 days ago Only been waiting for 8 fucking years.... permalink parent award report block reply HeavyMetalPatriot 7 points 4 days ago Fortunately we only have to wait deuce more weeks! permalink parent award report block reply HOSEQ 4 points 3 days ago Hey, according to the original Paperwork, we only have to wait until December 31st of 2042 for the Declass, and then we can do something about it.... Just 17 more years.... Oh, another 17.... permalink parent award report block reply PeterThielAntiChrist 1 points 3 days ago its AI. permalink parent award report block reply load 2 more comments...\nTheRedPilledArtist 41 points 4 days ago What did Dan Bongino learn this July that shook him to his core, which he subsequently never spoke about again? permalink parent award report block reply Hanging_Chad 14 points 4 days ago In July 2025, while serving as the Deputy Director of the FBI, Dan Bongino indicated that he had encountered something related to an ongoing case, possibly the Jeffrey Epstein investigation, that \"shook him to his core\". This was in the context of a Justice Department (DOJ) decision not to make any future public disclosures regarding the Epstein case review, which caused significant controversy at the time. The specific information he learned has not been publicly disclosed. He mentioned he was not speculating and \"knows something\" but did not elaborate further in public statements, leading to rumors and social media speculation about what the information entailed and why he went silent on the specifics. Reports at the time suggested he was considering resignation due to the controversy surrounding the handling of the case information. https://abcnews.go.com/Politics/live-updates/trump-admin-live-updates/?id=123527438 permalink parent award report block reply Lelleck 27 points 4 days ago It is sad to see that even the ones we trusted betray us by staying silent permalink parent award report block reply SuperHonkey 7 points 3 days ago That's okay he'll have a book just in time for the 2030 primaries when the demos are in control and nothing can be done about it permalink parent award report block reply fat50 4 points 4 days ago He saw the contents of the Weiner laptop. permalink parent award report block reply keeman 13 points 4 days ago Mossad told him they would kill his family if he didn't cuck.  Just guessing. permalink parent award report block reply Seatacjoe 8 points 4 days ago Honestly that's the type of shit that I believe is that they just have a private meeting and then just show them like four of their family members in real time they have cross hairs on them. permalink parent award report block reply VanillaCupCake 7 points 4 days ago is that when he wanted to quit? permalink parent award report block reply keeman 5 points 4 days ago Yes permalink parent award report block reply BartzFFV 2 points 4 days ago He learned that Big Mikes rod fits effortlessly into his mangina. permalink parent award report block reply PeterThielAntiChrist 1 points 3 days ago he was lying. permalink parent award report block reply load 1 more comments...\nHanging_Chad 14 points 4 days ago In July 2025, while serving as the Deputy Director of the FBI, Dan Bongino indicated that he had encountered something related to an ongoing case, possibly the Jeffrey Epstein investigation, that \"shook him to his core\". This was in the context of a Justice Department (DOJ) decision not to make any future public disclosures regarding the Epstein case review, which caused significant controversy at the time. The specific information he learned has not been publicly disclosed. He mentioned he was not speculating and \"knows something\" but did not elaborate further in public statements, leading to rumors and social media speculation about what the information entailed and why he went silent on the specifics. Reports at the time suggested he was considering resignation due to the controversy surrounding the handling of the case information. https://abcnews.go.com/Politics/live-updates/trump-admin-live-updates/?id=123527438 permalink parent award report block reply Lelleck 27 points 4 days ago It is sad to see that even the ones we trusted betray us by staying silent permalink parent award report block reply SuperHonkey 7 points 3 days ago That's okay he'll have a book just in time for the 2030 primaries when the demos are in control and nothing can be done about it permalink parent award report block reply fat50 4 points 4 days ago He saw the contents of the Weiner laptop. permalink parent award report block reply\nLelleck 27 points 4 days ago It is sad to see that even the ones we trusted betray us by staying silent permalink parent award report block reply SuperHonkey 7 points 3 days ago That's okay he'll have a book just in time for the 2030 primaries when the demos are in control and nothing can be done about it permalink parent award report block reply\nSuperHonkey 7 points 3 days ago That's okay he'll have a book just in time for the 2030 primaries when the demos are in control and nothing can be done about it permalink parent award report block reply\nfat50 4 points 4 days ago He saw the contents of the Weiner laptop. permalink parent award report block reply\nkeeman 13 points 4 days ago Mossad told him they would kill his family if he didn't cuck.  Just guessing. permalink parent award report block reply Seatacjoe 8 points 4 days ago Honestly that's the type of shit that I believe is that they just have a private meeting and then just show them like four of their family members in real time they have cross hairs on them. permalink parent award report block reply\nSeatacjoe 8 points 4 days ago Honestly that's the type of shit that I believe is that they just have a private meeting and then just show them like four of their family members in real time they have cross hairs on them. permalink parent award report block reply\nVanillaCupCake 7 points 4 days ago is that when he wanted to quit? permalink parent award report block reply keeman 5 points 4 days ago Yes permalink parent award report block reply\nkeeman 5 points 4 days ago Yes permalink parent award report block reply\nBartzFFV 2 points 4 days ago He learned that Big Mikes rod fits effortlessly into his mangina. permalink parent award report block reply\nPeterThielAntiChrist 1 points 3 days ago he was lying. permalink parent award report block reply\nDonger-Lord 21 points 4 days ago (((They))) have always been in control. permalink parent award report block reply PowerOfBlues -22 points 4 days ago ((((((((you're a nudnik)))))))) permalink parent award report block reply Donger-Lord 11 points 4 days ago They here you are, being a dirty jewish faggot. permalink parent award report block reply\nPowerOfBlues -22 points 4 days ago ((((((((you're a nudnik)))))))) permalink parent award report block reply Donger-Lord 11 points 4 days ago They here you are, being a dirty jewish faggot. permalink parent award report block reply\nDonger-Lord 11 points 4 days ago They here you are, being a dirty jewish faggot. permalink parent award report block reply\nthevagabond 3 points 3 days ago just need a couple more weeks... permalink parent award report block reply\ngroomofthestool 2 points 4 days ago What, you're expeccting any/immediate action?? permalink parent award report block reply AbrahamLincoln 11 points 4 days ago Only been waiting for 8 fucking years.... permalink parent award report block reply HeavyMetalPatriot 7 points 4 days ago Fortunately we only have to wait deuce more weeks! permalink parent award report block reply HOSEQ 4 points 3 days ago Hey, according to the original Paperwork, we only have to wait until December 31st of 2042 for the Declass, and then we can do something about it.... Just 17 more years.... Oh, another 17.... permalink parent award report block reply\nAbrahamLincoln 11 points 4 days ago Only been waiting for 8 fucking years.... permalink parent award report block reply HeavyMetalPatriot 7 points 4 days ago Fortunately we only have to wait deuce more weeks! permalink parent award report block reply HOSEQ 4 points 3 days ago Hey, according to the original Paperwork, we only have to wait until December 31st of 2042 for the Declass, and then we can do something about it.... Just 17 more years.... Oh, another 17.... permalink parent award report block reply\nHeavyMetalPatriot 7 points 4 days ago Fortunately we only have to wait deuce more weeks! permalink parent award report block reply HOSEQ 4 points 3 days ago Hey, according to the original Paperwork, we only have to wait until December 31st of 2042 for the Declass, and then we can do something about it.... Just 17 more years.... Oh, another 17.... permalink parent award report block reply\nHOSEQ 4 points 3 days ago Hey, according to the original Paperwork, we only have to wait until December 31st of 2042 for the Declass, and then we can do something about it.... Just 17 more years.... Oh, another 17.... permalink parent award report block reply\nPeterThielAntiChrist 1 points 3 days ago its AI. permalink parent award report block reply\nChickensaurus 20 points 4 days ago Bondi is a disappointment. permalink award report block reply xkgb 14 points 4 days ago So is Kash. permalink parent award report block reply makersmarx 11 points 4 days ago So is Bongino. permalink parent award report block reply tommygigantica 4 points 3 days ago so is Trump permalink parent award report block reply UCantStumpTheTrump -1 points 4 days ago Kash has been working extraordinarily hard, just look at the numbers for child sex trafficking and drug arrests, they are way up over the Biden regime, and don’t forget the Trump DOJ indicted Comey, Letitia James, and Bolton. Smells like shills in here! permalink parent award report block reply BaronFalcon 2 points 3 days ago Indicted. Lets see a trial and conviction of even one of those before claiming thats an accomplishment. Until then it's literally a shiny nothing burger. permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago Lmao would you be shrugging it off as a nothingburger if YOU were indicted on multiple felony counts by a federal grand jury?? permalink parent award report block reply BartzFFV 5 points 4 days ago Woman cop. 🤡 permalink parent award report block reply\nxkgb 14 points 4 days ago So is Kash. permalink parent award report block reply makersmarx 11 points 4 days ago So is Bongino. permalink parent award report block reply tommygigantica 4 points 3 days ago so is Trump permalink parent award report block reply UCantStumpTheTrump -1 points 4 days ago Kash has been working extraordinarily hard, just look at the numbers for child sex trafficking and drug arrests, they are way up over the Biden regime, and don’t forget the Trump DOJ indicted Comey, Letitia James, and Bolton. Smells like shills in here! permalink parent award report block reply BaronFalcon 2 points 3 days ago Indicted. Lets see a trial and conviction of even one of those before claiming thats an accomplishment. Until then it's literally a shiny nothing burger. permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago Lmao would you be shrugging it off as a nothingburger if YOU were indicted on multiple felony counts by a federal grand jury?? permalink parent award report block reply\nmakersmarx 11 points 4 days ago So is Bongino. permalink parent award report block reply tommygigantica 4 points 3 days ago so is Trump permalink parent award report block reply\ntommygigantica 4 points 3 days ago so is Trump permalink parent award report block reply\nUCantStumpTheTrump -1 points 4 days ago Kash has been working extraordinarily hard, just look at the numbers for child sex trafficking and drug arrests, they are way up over the Biden regime, and don’t forget the Trump DOJ indicted Comey, Letitia James, and Bolton. Smells like shills in here! permalink parent award report block reply BaronFalcon 2 points 3 days ago Indicted. Lets see a trial and conviction of even one of those before claiming thats an accomplishment. Until then it's literally a shiny nothing burger. permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago Lmao would you be shrugging it off as a nothingburger if YOU were indicted on multiple felony counts by a federal grand jury?? permalink parent award report block reply\nBaronFalcon 2 points 3 days ago Indicted. Lets see a trial and conviction of even one of those before claiming thats an accomplishment. Until then it's literally a shiny nothing burger. permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago Lmao would you be shrugging it off as a nothingburger if YOU were indicted on multiple felony counts by a federal grand jury?? permalink parent award report block reply\nUCantStumpTheTrump 1 points 3 days ago Lmao would you be shrugging it off as a nothingburger if YOU were indicted on multiple felony counts by a federal grand jury?? permalink parent award report block reply\nBartzFFV 5 points 4 days ago Woman cop. 🤡 permalink parent award report block reply\nWomb___Raider 11 points 4 days ago This email was known years ago. permalink award report block reply chickeninoven 15 points 4 days ago Wellllllllll you know these things take time, and oops, what do you know, term's over. permalink parent award report block reply\nchickeninoven 15 points 4 days ago Wellllllllll you know these things take time, and oops, what do you know, term's over. permalink parent award report block reply\nChyNahAzzWhole1 8 points 4 days ago Pam is protecting the assain alliance. permalink award report block reply BaronFalcon 1 points 3 days ago the what? first time i've seen that name/label permalink parent award report block reply\nBaronFalcon 1 points 3 days ago the what? first time i've seen that name/label permalink parent award report block reply\nSoulSnipper 7 points 4 days ago Execution level sedition against an elected President. Long sentences aren't enough, these people need to swing. permalink award report block reply\nBruno 7 points 4 days ago The lack of actual accountability is staggeringly stupid. permalink award report block reply keeman 5 points 4 days ago No, it is expected.  The main grift is to pretend that we have an elected representative government.  Then make sure that the elected representatives have no real power. permalink parent award report block reply\nkeeman 5 points 4 days ago No, it is expected.  The main grift is to pretend that we have an elected representative government.  Then make sure that the elected representatives have no real power. permalink parent award report block reply\nDylanPatrick 6 points 4 days ago They need to be hung for treason. permalink award report block reply Covfefe_Commando 5 points 4 days ago hanged permalink parent award report block reply\nCovfefe_Commando 5 points 4 days ago hanged permalink parent award report block reply\nCounterwhat 6 points 3 days ago Why do you think Thune fuses to recess the government? He knows President Trump would intal no nonsense people that would totally fuck up their grift. Don't be fooled Thune is one of them that needs to be outed. permalink award report block reply\nChoppermagic 6 points 4 days ago 2 weeks! permalink award report block reply\nknnbccb 4 points 4 days ago Your taxpayer money was being used to feed these traitors. Please don't waste more taxpayer money by continuing to feed them while they're locked up in prison. Kill them. Kill first, ask questions later. permalink award report block reply\nHanging_Chad 4 points 4 days ago that’s a lot of fucking permalink award report block reply\nyodayoda 3 points 4 days ago \"now they must pay\" HAHAHAHAHAHAHA! that's a good one! permalink award report block reply\nIlhansBrother 2 points 4 days ago Why did Trump never hire General Flynn again? He would be perfect in a senior role of the FBI permalink award report block reply\nMulletgunning 2 points 4 days ago I bet Pam is chomping at the bit to prosecute these traitors immediately. Come on boys and goys ,be patient its only going to take two more weeks to get it done. That's reasonable fellas. Lol That fucking Trojan horse establishment bitch is worthless. If Trump doesn't fire her yesterday,the WWE scripted entertainment will continue and we will accept it. We need Stephen Commie Killer ,MAGA AF Thriller,All Meat No Filler Miller cloned and dispersed across every agency to completey destroy the establishment blob of psychos. That is who we should be pushing for POTUS 2028. He is one of two MAGA AF weapons the establishment hates . Him and Trump are irreplaceable when it comes down to slamming commies and their minions at every level of government. He is the most hated but effective weapon we have in MAGA AF bar none. I and many others nominate Stephen Miller for POTUS 2028 . A real asskicker is what is needed to continue MAGA AF. permalink award report block reply\nV4Baretta 2 points 3 days ago Sons of bithez permalink award report block reply\nLePEDES 2 points 4 days ago Two more weeks! permalink award report block reply\ngezadreamsheets2 1 points 3 days ago Dissapointing permalink award report block reply\nSeldom_Seen_Kid 1 points 3 days ago We think it should, but we know it won’t. permalink award report block reply\nemorphia 1 points 4 days ago yea, they must pay ... but if they will pay is the question.  (asking Bondi) permalink award report block reply\nshogun5000 0 points 4 days ago It won't permalink award report block reply\nDCYR66 -1 points 3 days ago And nothing will be done. permalink award report block reply DCYR66 1 points 3 days ago 🖕downvote this permalink parent award report block reply\nDCYR66 1 points 3 days ago 🖕downvote this permalink parent award report block reply\nnew_guy2 1 points 4 days ago Comment removed by community moderators. permalink award report block reply"}