{"id": "1ARK57tKU9", "contents": "524 The Key to Happiness posted 4 days ago by Trick 39 comments award share download report block\n39 comments Sort by Top Top New Worst Old Save guywholikesDjtof2024 23 points 4 days ago put Jesus first. All those good things are downstream permalink award report block reply TheDarkEmperor 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply guywholikesDjtof2024 2 points 4 days ago Trump is hated by the left and he never got a mortal wound. Only a weak sauce earshot, thankfully. And he is Too unpopular. The Bible says the AC will be super popular.  The AC will be more poular than Trump. Also, he literally wasn't in power. The AC would really give up power? So why didn't Trump proclaim he is god and demanded worship in his first term? WORST. ANTICHRIST. EVER!!!! permalink parent award report block reply TheDarkEmperor 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply Dallasguy 10 points 4 days ago A Bentley will drive you as far as a Ford Doesn't say much for Ford's quality the last few decades. permalink award report block reply Standingoak 2 points 4 days ago e F-150  : may be done?? permalink parent award report block reply lul_cheto 8 points 4 days ago This faggot shops at target? # deport permalink award report block reply MyDadLikedBiden 2 points 4 days ago Oh, the woke retailer! I was trying to figure out what a “target wallet” was, like a vanity bitcoin address or something. permalink parent award report block reply ProfHinsley 1 points 4 days ago Bist du faschistisch? permalink parent award report block reply Mulletgunning 8 points 4 days ago Abso-fucking-lutely! Saved. Spread that statement from coast to coast and everywhere in between . This should get STICKIED daily from now until forever. God,family and country ,our core American values are protected by this statement and hardware . All Americans should be reminded and required to keep this upfront and center to ensure and fortify our values,way of life and happiness against any who dare try and diminish or abolish our GOD given rights to life,liberty and the pursuit of happiness. Destroy tyranny with any and all means necessary . We are in it to win it,no exceptions. God Bless us all and God Bless the Greatest Country in the World bar none. MAGA AF MACO( Christian Only) . Make America Christian Only. Keep the best and kick out the rest. That's not too much to ask of any who have came here or are trying to get in. Assimilate or hit the road jack and don't come back. MAGA AF permalink award report block reply utfanx2 8 points 4 days ago Big difference in a $300 and $3000 NV though. permalink award report block reply Beachbum2023 4 points 4 days ago Thermal all the way permalink parent award report block reply Megaboom2025 1 points 4 days ago Don’t you walk into trees? permalink parent award report block reply Beachbum2023 2 points 3 days ago You can still see trees, but you can see birds hiding on the branches its amazing https://youtu.be/w1KB6kQ1GdI?si=4rOX08jDRAyifbwc permalink parent award report block reply dontdrinksoy 1 points 4 days ago IMO, if you can comfortably afford the richer things in life, then go ahead. What's the problem? Just don't get obsessed. permalink parent award report block reply FusionBlack 7 points 4 days ago As I approach my late 60s this rings true. After a bought of serious health issues all of the cars went along with the boat and motorcycles. All of the things I thought were more important than life itself. I am at peace for the first time in my life. It's not what you possess. It's what you have always had from the beginning. Life itself. permalink award report block reply KrebStar2000 6 points 4 days ago The sentiment of this message is spot on, but a $30 watch and an $800 watch most certainly do not keep the same time. If you’re in to guns, ammo, NVD’s, and being prepared then you better understand a quality time piece is not to be skimped on. permalink award report block reply NomadicKrow2 1 points 4 days ago I would actually push people toward FLIR devices. Less expensive, more rugged, see in the dark and have heat signatures highlighted, and the only way someone can hide is if they're behind a pane of glass. They come in scopes or nods, monocles too. Commercial Night Vision usually uses an infrared light and a a filter over a lens to give you night vision. If someone has IR or NV, that light is visible to them and you might as well be putting a gun to your own head. permalink parent award report block reply Bushwookiee07 6 points 4 days ago That’s a bold claim for a Ford. permalink award report block reply dontdrinksoy 2 points 4 days ago He should have put Toyota in the image instead. permalink parent award report block reply Skogin 5 points 4 days ago I swear, my retort was going to be quality bang sticks. permalink award report block reply Standingoak 2 points 4 days ago Lots of Ukrainians might still be alive if they had this old boy's skill and Drone Duster . permalink parent award report block reply ChyNahAzzWhole1 4 points 4 days ago Night optics... sunovabitch! I knew i needed something. permalink award report block reply Hantif 2 points 4 days ago Illumination flares for those on a budget or who served before NVGs were common. permalink parent award report block reply FusionBlack 1 points 4 days ago That's one thing I kept. permalink parent award report block reply Pelosi_Halitosis 3 points 4 days ago There are exceptions. Sure, I could buy some big-box Ryobi garbage. However, a commercial Stihl will outlast 10-15 Ryobis and still be worth something in 15-20 years. Plus, I trade sweat for tools. I had to learn a new trade last week. Rather than pay a dick $300+. I splurged on the proper tools for $40 and learned how to make a j-channel opening in vinyl for a vent. I might never cut vinyl siding again, but the mitres are clean. permalink award report block reply Donger-Lord 2 points 4 days ago Very sad to see what has happened to Glock, they set a bad precedent by discontinuing most of their old models. permalink award report block reply Hanrahan 2 points 4 days ago He ain't lyin permalink award report block reply citydwellertrumpfan 2 points 4 days ago Our opinions of what wealth and luxury are is socially derived (tv, peers, etc), and the pursuit of luxury has diminishing returns. Ignore the culture and find out what wealth truly means to you. permalink award report block reply dontdrinksoy 2 points 4 days ago $100,000 home? Give me! permalink award report block reply Feddny 1 points 3 days ago LOL! permalink award report block reply gorilla_grip 1 points 4 days ago This reminds me, I need some night vision goggles permalink award report block reply Get-The-Rope 1 points 4 days ago A quality pair of shoes is where you need to spend your money permalink award report block reply Stanwyk74 1 points 4 days ago Ford hahaha permalink award report block reply ViagraFalls 1 points 4 days ago Guns that aren’t being used permalink award report block reply BaldyGull 1 points 4 days ago In the wise words of Uncle Argyle, \"We shall have to remedy that\". permalink parent award report block reply BigE_123456 1 points 4 days ago I think this day and age, the Bently will make it farther. permalink award report block reply\nguywholikesDjtof2024 23 points 4 days ago put Jesus first. All those good things are downstream permalink award report block reply TheDarkEmperor 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply guywholikesDjtof2024 2 points 4 days ago Trump is hated by the left and he never got a mortal wound. Only a weak sauce earshot, thankfully. And he is Too unpopular. The Bible says the AC will be super popular.  The AC will be more poular than Trump. Also, he literally wasn't in power. The AC would really give up power? So why didn't Trump proclaim he is god and demanded worship in his first term? WORST. ANTICHRIST. EVER!!!! permalink parent award report block reply TheDarkEmperor 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply\nTheDarkEmperor 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply guywholikesDjtof2024 2 points 4 days ago Trump is hated by the left and he never got a mortal wound. Only a weak sauce earshot, thankfully. And he is Too unpopular. The Bible says the AC will be super popular.  The AC will be more poular than Trump. Also, he literally wasn't in power. The AC would really give up power? So why didn't Trump proclaim he is god and demanded worship in his first term? WORST. ANTICHRIST. EVER!!!! permalink parent award report block reply TheDarkEmperor 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply\nguywholikesDjtof2024 2 points 4 days ago Trump is hated by the left and he never got a mortal wound. Only a weak sauce earshot, thankfully. And he is Too unpopular. The Bible says the AC will be super popular.  The AC will be more poular than Trump. Also, he literally wasn't in power. The AC would really give up power? So why didn't Trump proclaim he is god and demanded worship in his first term? WORST. ANTICHRIST. EVER!!!! permalink parent award report block reply TheDarkEmperor 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply\nTheDarkEmperor 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply\nDallasguy 10 points 4 days ago A Bentley will drive you as far as a Ford Doesn't say much for Ford's quality the last few decades. permalink award report block reply Standingoak 2 points 4 days ago e F-150  : may be done?? permalink parent award report block reply\nStandingoak 2 points 4 days ago e F-150  : may be done?? permalink parent award report block reply\nlul_cheto 8 points 4 days ago This faggot shops at target? # deport permalink award report block reply MyDadLikedBiden 2 points 4 days ago Oh, the woke retailer! I was trying to figure out what a “target wallet” was, like a vanity bitcoin address or something. permalink parent award report block reply ProfHinsley 1 points 4 days ago Bist du faschistisch? permalink parent award report block reply\nMyDadLikedBiden 2 points 4 days ago Oh, the woke retailer! I was trying to figure out what a “target wallet” was, like a vanity bitcoin address or something. permalink parent award report block reply\nProfHinsley 1 points 4 days ago Bist du faschistisch? permalink parent award report block reply\nMulletgunning 8 points 4 days ago Abso-fucking-lutely! Saved. Spread that statement from coast to coast and everywhere in between . This should get STICKIED daily from now until forever. God,family and country ,our core American values are protected by this statement and hardware . All Americans should be reminded and required to keep this upfront and center to ensure and fortify our values,way of life and happiness against any who dare try and diminish or abolish our GOD given rights to life,liberty and the pursuit of happiness. Destroy tyranny with any and all means necessary . We are in it to win it,no exceptions. God Bless us all and God Bless the Greatest Country in the World bar none. MAGA AF MACO( Christian Only) . Make America Christian Only. Keep the best and kick out the rest. That's not too much to ask of any who have came here or are trying to get in. Assimilate or hit the road jack and don't come back. MAGA AF permalink award report block reply\nutfanx2 8 points 4 days ago Big difference in a $300 and $3000 NV though. permalink award report block reply Beachbum2023 4 points 4 days ago Thermal all the way permalink parent award report block reply Megaboom2025 1 points 4 days ago Don’t you walk into trees? permalink parent award report block reply Beachbum2023 2 points 3 days ago You can still see trees, but you can see birds hiding on the branches its amazing https://youtu.be/w1KB6kQ1GdI?si=4rOX08jDRAyifbwc permalink parent award report block reply dontdrinksoy 1 points 4 days ago IMO, if you can comfortably afford the richer things in life, then go ahead. What's the problem? Just don't get obsessed. permalink parent award report block reply\nBeachbum2023 4 points 4 days ago Thermal all the way permalink parent award report block reply Megaboom2025 1 points 4 days ago Don’t you walk into trees? permalink parent award report block reply Beachbum2023 2 points 3 days ago You can still see trees, but you can see birds hiding on the branches its amazing https://youtu.be/w1KB6kQ1GdI?si=4rOX08jDRAyifbwc permalink parent award report block reply\nMegaboom2025 1 points 4 days ago Don’t you walk into trees? permalink parent award report block reply Beachbum2023 2 points 3 days ago You can still see trees, but you can see birds hiding on the branches its amazing https://youtu.be/w1KB6kQ1GdI?si=4rOX08jDRAyifbwc permalink parent award report block reply\nBeachbum2023 2 points 3 days ago You can still see trees, but you can see birds hiding on the branches its amazing https://youtu.be/w1KB6kQ1GdI?si=4rOX08jDRAyifbwc permalink parent award report block reply\ndontdrinksoy 1 points 4 days ago IMO, if you can comfortably afford the richer things in life, then go ahead. What's the problem? Just don't get obsessed. permalink parent award report block reply\nFusionBlack 7 points 4 days ago As I approach my late 60s this rings true. After a bought of serious health issues all of the cars went along with the boat and motorcycles. All of the things I thought were more important than life itself. I am at peace for the first time in my life. It's not what you possess. It's what you have always had from the beginning. Life itself. permalink award report block reply\nKrebStar2000 6 points 4 days ago The sentiment of this message is spot on, but a $30 watch and an $800 watch most certainly do not keep the same time. If you’re in to guns, ammo, NVD’s, and being prepared then you better understand a quality time piece is not to be skimped on. permalink award report block reply NomadicKrow2 1 points 4 days ago I would actually push people toward FLIR devices. Less expensive, more rugged, see in the dark and have heat signatures highlighted, and the only way someone can hide is if they're behind a pane of glass. They come in scopes or nods, monocles too. Commercial Night Vision usually uses an infrared light and a a filter over a lens to give you night vision. If someone has IR or NV, that light is visible to them and you might as well be putting a gun to your own head. permalink parent award report block reply\nNomadicKrow2 1 points 4 days ago I would actually push people toward FLIR devices. Less expensive, more rugged, see in the dark and have heat signatures highlighted, and the only way someone can hide is if they're behind a pane of glass. They come in scopes or nods, monocles too. Commercial Night Vision usually uses an infrared light and a a filter over a lens to give you night vision. If someone has IR or NV, that light is visible to them and you might as well be putting a gun to your own head. permalink parent award report block reply\nBushwookiee07 6 points 4 days ago That’s a bold claim for a Ford. permalink award report block reply dontdrinksoy 2 points 4 days ago He should have put Toyota in the image instead. permalink parent award report block reply\ndontdrinksoy 2 points 4 days ago He should have put Toyota in the image instead. permalink parent award report block reply\nSkogin 5 points 4 days ago I swear, my retort was going to be quality bang sticks. permalink award report block reply Standingoak 2 points 4 days ago Lots of Ukrainians might still be alive if they had this old boy's skill and Drone Duster . permalink parent award report block reply\nStandingoak 2 points 4 days ago Lots of Ukrainians might still be alive if they had this old boy's skill and Drone Duster . permalink parent award report block reply\nChyNahAzzWhole1 4 points 4 days ago Night optics... sunovabitch! I knew i needed something. permalink award report block reply Hantif 2 points 4 days ago Illumination flares for those on a budget or who served before NVGs were common. permalink parent award report block reply FusionBlack 1 points 4 days ago That's one thing I kept. permalink parent award report block reply\nHantif 2 points 4 days ago Illumination flares for those on a budget or who served before NVGs were common. permalink parent award report block reply\nFusionBlack 1 points 4 days ago That's one thing I kept. permalink parent award report block reply\nPelosi_Halitosis 3 points 4 days ago There are exceptions. Sure, I could buy some big-box Ryobi garbage. However, a commercial Stihl will outlast 10-15 Ryobis and still be worth something in 15-20 years. Plus, I trade sweat for tools. I had to learn a new trade last week. Rather than pay a dick $300+. I splurged on the proper tools for $40 and learned how to make a j-channel opening in vinyl for a vent. I might never cut vinyl siding again, but the mitres are clean. permalink award report block reply\nDonger-Lord 2 points 4 days ago Very sad to see what has happened to Glock, they set a bad precedent by discontinuing most of their old models. permalink award report block reply\nHanrahan 2 points 4 days ago He ain't lyin permalink award report block reply\ncitydwellertrumpfan 2 points 4 days ago Our opinions of what wealth and luxury are is socially derived (tv, peers, etc), and the pursuit of luxury has diminishing returns. Ignore the culture and find out what wealth truly means to you. permalink award report block reply\ndontdrinksoy 2 points 4 days ago $100,000 home? Give me! permalink award report block reply\nFeddny 1 points 3 days ago LOL! permalink award report block reply\ngorilla_grip 1 points 4 days ago This reminds me, I need some night vision goggles permalink award report block reply\nGet-The-Rope 1 points 4 days ago A quality pair of shoes is where you need to spend your money permalink award report block reply\nStanwyk74 1 points 4 days ago Ford hahaha permalink award report block reply\nViagraFalls 1 points 4 days ago Guns that aren’t being used permalink award report block reply BaldyGull 1 points 4 days ago In the wise words of Uncle Argyle, \"We shall have to remedy that\". permalink parent award report block reply\nBaldyGull 1 points 4 days ago In the wise words of Uncle Argyle, \"We shall have to remedy that\". permalink parent award report block reply\nBigE_123456 1 points 4 days ago I think this day and age, the Bently will make it farther. permalink award report block reply"}