{"id": "1ARK9mFaJZ", "contents": "1073 Biden-Appointed Judge Poised to Order Mass Release of Illegal Aliens Detained in ICE’s “Operation Blitz” — Thousands Could Be Dumped Back onto Chicago Streets (www.thegatewaypundit.com) posted 22 hours ago by thegatewaybandit 167 comments award share report block Biden-Appointed Judge Poised to Order Mass Release of Illegal Aliens Detained in ICE’s “Operation Blitz” — Thousands Could Be Du... In yet another blow to immigration enforcement, a federal judge in Illinois is reportedly preparing to order the mass release of thousands of illegal aliens detained during ICE’s “Operation Blitz,” a nationwide crackdown on criminal and repeat im... www.thegatewaypundit.com\n167 comments Sort by Top Top New Worst Old Save Around the Web ChimpanzeeFatigue 170 points 21 hours ago I would prefer a civil war over Trump capitulating to these judges’ “orders” permalink award report block reply TommyLasordasBallBag 39 points 20 hours ago IF civil war happens,  activist judges have to go first. We don't have a chance at rebuilding a country afterwards if there are anti-constitutional judges. The communist representatives don't hold nearly as much power as these \"appointed\" benches do. I still don't think your average cookie cutter neighborhood family could stomach going to war though. It even pains me to think of it. permalink parent award report block reply Meddlesom 24 points 19 hours ago Propagandists have to be the first to go.  Judges don't matter during war, but propagandists do. permalink parent award report block reply Sig229 11 points 16 hours ago Time is running out. These America hating commie judges need removing fast. If the democrats get back into power through cheating, it is 100% game over this time. permalink parent award report block reply Shih_Tabed 1 points 17 hours ago Definitely don't need to wait for civil war to take care of activist judges.  They don't live at the courthouse.  They go out for drinks and dinner just like everyone else.  Just taking care of that problem would transform society.  Sure, they would reload with more activist judges, but they will figure out the pattern soon enough and there will be less people willing to take on that task.  Judges that remain untouched would signal what kind of judge the people actually want and they would be forced to fall in line.  If ever there were a first step in this operation it would be the activist judges.  DAs are a close second, but the judges are the ones that smack that hammer. permalink parent award report block reply BeauHD 3 points 20 hours ago Who is paying you to keep calling for war with all your alts? permalink parent award report block reply ChimpanzeeFatigue 6 points 19 hours ago Who is paying you to cuck yourself on the Internet? permalink parent award report block reply snoopy3210 2 points 18 hours ago What’s sure is bribery Biden is paying that judge permalink parent award report block reply MasterChief08 4 points 15 hours ago War is infinitely preferable to losing power permalink parent award report block reply Shih_Tabed 2 points 17 hours ago Probably the same people promising to pay people that say \"glow\" for FBI tips. permalink parent award report block reply Appeal2Heaven98 -3 points 20 hours ago IT GLOWS! IT GLOWSSSSS! 🚨 permalink parent award report block reply mikejones 3 points 20 hours ago Use the system against us. There is no winning then. permalink parent award report block reply Yawnz13 2 points 21 hours ago He's not though. permalink parent award report block reply Donger-Lord 22 points 21 hours ago Except he his. permalink parent award report block reply Yawnz13 -6 points 21 hours ago Except he isn't.  Go on and show me where he's released these detainees. permalink parent award report block reply _Eric_Ciaramella_ 13 points 21 hours ago Except he hasn't given these communist Kings a single middle finger once. permalink parent award report block reply view 10 more comments... 3-10 12 points 20 hours ago Trump brought back Garcia instead of telling the judge to fuck off. Trumps failings are he doesn’t tell the judges to stay out of Executive Powers and he has losers running the DOJ, they are doing jack and shit to the deep state and Antifa. Shouldn’t take this long to get the money and start arresting the Democrats donor class. permalink parent award report block reply view 4 more comments... lefty295 1 points 20 hours ago The order hasn’t even happened yet permalink parent award report block reply view 2 more comments... booblitchutz 6 points 21 hours ago Kilmar Abrego Garcia is not deported. permalink parent award report block reply Yawnz13 -1 points 19 hours ago Trump has no power over individual deportations anyway. permalink parent award report block reply Doritalos 2 points 20 hours ago I'll take \"Huge Cope\" for $500, Alex permalink parent award report block reply Yawnz13 1 points 15 hours ago Cool story, now actually show it. permalink parent award report block reply NotYourMan 1 points 10 hours ago Judicial insurrection against the executive branch is more lawfare from democrats. permalink parent award report block reply load 4 more comments... POTUS_DonnieJ 72 points 21 hours ago Let him order it. Then ignore it. permalink award report block reply Nomad899 34 points 21 hours ago Tell him to come down and look for the keys permalink parent award report block reply MAGABOND 13 points 20 hours ago Just release them into this niggnoggs neighborhood. permalink parent award report block reply Diezelnut 2 points 11 hours ago Right in front of his house. permalink parent award report block reply Coprolite 48 points 22 hours ago Can't release them if they're dead............. permalink award report block reply TrumpYe2023 13 points 21 hours ago Why is the judge wearing blush and eye liner check that judges hard drive. permalink parent award report block reply Coprolite 11 points 21 hours ago He's in the black eye club too permalink parent award report block reply Reefay 12 points 21 hours ago Oops they ded permalink parent award report block reply Lady_MaGa 7 points 21 hours ago Hawaiian judge orders God to bring back the criminal dead and for Trump to let the zombies to stay in the USA. permalink parent award report block reply bigdickhangsright 4 points 20 hours ago BREAKING: Rhode Island traffic court justice Vigor Shekelberg orders God to tear down Heaven's walls, citing an 1864 ruling in Yugoslavia. permalink parent award report block reply Dwoj 41 points 21 hours ago I mean this is just getting so ridiculous. You just need to move these people right away to red places red state red District read something where that’s not gonna happen and then these judges just won’t have a say so in these blue ass stupid ass districts. permalink award report block reply NADSAQ 11 points 20 hours ago red Uganda permalink parent award report block reply MasterChief08 3 points 15 hours ago Or we could just start arresting leftists like we all want. I didn't vote for moderation. I want revenge permalink parent award report block reply RogueLeaderX 36 points 21 hours ago Doesnt have any authority over a Federal Executive Operation. Tell him to “F#$& OFF”. permalink award report block reply Reefay 14 points 21 hours ago About as much authority as a beauty pageant judge permalink parent award report block reply Area82 22 points 21 hours ago Judge looks retarded. permalink award report block reply IvotedforTrumptwice 18 points 21 hours ago Looks can be deceiving, he’s actually a retarded faggot. permalink parent award report block reply Area82 8 points 21 hours ago Gay, black and retarded?  I am surprised Biden didn’t nominate him for SCOTUS. permalink parent award report block reply PhantomShield72 15 points 21 hours ago Most would prefer not to contemplate how bad the situation is and how utterly infiltrated all levels of our government is, but the number of stories lime this is almost overwhelming. The best aspect of the circumstances we see playing out right now is there are a lot of enemies within who would otherwise not be obvious that are exposing themselves. permalink award report block reply LibtardBusterMAGA 13 points 21 hours ago Ignore him permalink award report block reply MasterChief08 2 points 15 hours ago Arrest him. Then ship him to Gitmo permalink parent award report block reply Tookens 13 points 21 hours ago There's only one legitimate response to such a ruling.. \"Fuck you, judge\" permalink award report block reply brimshae 2 points 17 hours ago *ahem* \"[The Judge] has made his decision; now let him enforce it.\" permalink parent award report block reply MajorClark 12 points 21 hours ago Activist DEI judges like this scum need to be expelled and disbarred from every practicing law again.  Charge him with aiding & abetting illegal criminals. permalink award report block reply henri_derelicte 16 points 21 hours ago Insurrection act. Declare that the district court is waging an insurrection against the federal government by endangering public safety and blatantly disregarding constitution. Have the judges arrested, and the court disbanded. Replace the court with a military tribunal (which you are allowed to do when the civilian courts are no longer functioning). Rinse and repeat for Massachusetts, DC, California, Maryland, Virginia, New York, and the large majority of the lawfare comes to an end. permalink parent award report block reply MasterChief08 1 points 15 hours ago Trump is too moderate right now. We need far right solutions permalink parent award report block reply Patriot4TN 7 points 21 hours ago Dump them all off on his doorstep... permalink award report block reply Bythrfruitsyknow 7 points 21 hours ago Let's hope they get an immediate stay from the appellant court. permalink award report block reply 3-10 4 points 20 hours ago Or how bought he say it is a national security issue and be a man and tell them to pound sand? permalink parent award report block reply MasterChief08 3 points 15 hours ago Fuck this. Either Trump ignores this or I'm done. Fucking grow some balls, Republicans. permalink parent award report block reply SavingPrivateGrace 7 points 21 hours ago Corn Pop permalink award report block reply LogicalReasoning 6 points 21 hours ago When do we start charging these people with obstruction? Better yet, lets dragnet them into RICO since its very clear that they are all in the same boat, working in sync to subvert federal law and enforcement. permalink award report block reply Mortal_Wombat 1 points 14 hours ago I thought they were narrowing down on Soros' and Ilks NGO funny money movements. Maybe we'll see traction in a couple of weeks 🤷‍♂️ permalink parent award report block reply henri_derelicte 6 points 21 hours ago Fuck it. Keep them detained. I was promised that we’d be getting illegal aliens off the streets and I expect the administration to keep that promise permalink award report block reply USAisAOKay 6 points 21 hours ago Just send them home don't detain them. permalink award report block reply AVeryNakedMan 6 points 21 hours ago Just ignore it. permalink award report block reply ianpatrick1966 5 points 21 hours ago One word…. No permalink award report block reply BusterHyman99 5 points 21 hours ago Sorry federal law tops any judges order. How can they keep allowing this crap permalink award report block reply IvotedforTrumptwice 8 points 21 hours ago The real question is, how can WE keep allowing this crap? permalink parent award report block reply MasterChief08 3 points 15 hours ago Exactly. permalink parent award report block reply rastren 5 points 19 hours ago I'm in Chicago and feel like the only white person here. It's gotten worse. Maybe people are moving here because sanctuary status. I need to gtfo of here permalink award report block reply Nomad899 5 points 21 hours ago Dump them on syrian streets…. Oops sooorrrry permalink award report block reply Coprolite 5 points 21 hours ago From 10,000 feet. 😈 permalink parent award report block reply hannahb 5 points 20 hours ago If this guy wants to release thousands of criminals onto our streets and endanger all of our lives, then maybe we the people need to start endangering theirs. permalink award report block reply becomelions 4 points 21 hours ago how long are we going to pretend these people are judges? permalink award report block reply MeMargie 4 points 20 hours ago Rope for the Black Robes, a country of laws not Treason. permalink award report block reply ToniBahloni 4 points 21 hours ago Is the judge's name Nick Gurr? permalink award report block reply booblitchutz 4 points 21 hours ago His name is Judge G. Gabu permalink parent award report block reply FrankDuncan 4 points 20 hours ago Phil t. Kuhn permalink parent award report block reply panic_scam 4 points 21 hours ago How about just ignoring these useless “judges”? permalink award report block reply LightBeacons 4 points 21 hours ago Eyes and fake teeth Cheshire cat smile indicate retard! permalink award report block reply Quiznos585 4 points 21 hours ago Please I beg you start arresting these fucking judges. This is so demoralizing. permalink award report block reply Moebius 4 points 20 hours ago Well alrighty then.  'Probable cause' is established. Those 3000 Illegals already still in custody are in fact illegal. Administratively release them then re-arrest them on the spot if they now already KNOW they're Illegals. Pre- Determining whether someone is Illegally in the US w/o a warrant is the stupidest shit I ever heard.  Every second they're here is a 'crime in progress' whether they snuck in or overstayed their Visas 20 years ago. permalink award report block reply Hanging_Chad 4 points 21 hours ago release them a couple yards before international waters permalink award report block reply HeatherSwanson 4 points 20 hours ago A faggot and a naggerz. Obviously permalink award report block reply Sunnybats2 3 points 21 hours ago Move them to abother state first permalink award report block reply NoticesBugleOWO 3 points 21 hours ago No standing. permalink award report block reply Trump4Infinity 3 points 21 hours ago Hang the judge. This is the only way. Many will say \"oh no that's ridiculous\". In 10 years they'll say why didn't we hang people when we could have. permalink award report block reply America_No_1 3 points 21 hours ago Can we have another judge arrested? permalink award report block reply starjello 3 points 19 hours ago Yea what ever happened to that fat ass bitch judge in Wisconsin? permalink parent award report block reply America_No_1 2 points 18 hours ago Good fucking question permalink parent award report block reply Justjayce 3 points 21 hours ago Ignore permalink award report block reply Goozmania 3 points 20 hours ago If Trump caves to such an order, I'll never return to this forum. permalink award report block reply EffingWhiteMale 3 points 19 hours ago Sorry 'judge' but illegals aren't entitled to US citizen rights. permalink award report block reply darkmodeforgotpass 3 points 19 hours ago I was hoping to read it as if he was detained for being poised to order the release. But in America, it's never good news. permalink award report block reply knnbccb 3 points 20 hours ago The appointments of a president installed by a stolen election should be made null and void. If necessary, 'Scalia' these judicial cockroaches. There will be no more prolonged courtroom and media clown show. permalink award report block reply cd3dog 3 points 21 hours ago Nope.  Come make us flat foot. permalink award report block reply fightfightfightx 3 points 20 hours ago should arrest the judge for treason and not release potential terrorists into the country permalink award report block reply Overtaxed 3 points 20 hours ago Defy the judges or lose the country. permalink award report block reply America101 2 points 20 hours ago I always thought the president has the final word, not a judge. permalink award report block reply TearsAficionado 2 points 20 hours ago IGNORE that seditious terrorist. permalink award report block reply Snek_Plissken 2 points 21 hours ago No standing? This will just go up to the supreme court and enforce Trump's power. permalink award report block reply Tunk 2 points 21 hours ago If the judge does do it, honestly just arrest them on harboring or assisting charges prior to filing the appeal. At some point, the executive needs to exert executive power against the courts as a warning shot, that yes there will be consequences if they keep up fuck fuck games, and no, judges are not immune to being criminally charged. Balance of powers, welcome the judiciary is not king over congress and president. permalink award report block reply BitterRoots 2 points 17 hours ago President Trump does not have to comply. DOJ decides - not a judge. permalink award report block reply cyberwar 1 points 18 hours ago ignore these illegal judges permalink award report block reply Easzq8 1 points 19 hours ago Tell Troon Xerxes to kick rocks. permalink award report block reply DCYR66 1 points 12 hours ago Sadly Trump won’t ignore them. Which makes it another campaign promise broken. permalink award report block reply Hodeefuk123 1 points 20 hours ago CANT stop it permalink award report block reply Grakarion 1 points 15 hours ago I didn’t settle. Trump should not be beholden to previous administrations settlements for shitty outcomes that only benefit criminals. Fuck that and fuck this jusge permalink award report block reply Cuck_Slayer24 1 points 20 hours ago Yea thats not going to happen. Immediate emergency appeal, then the next court will side with the admin.  Like pretty much every other time so far permalink award report block reply NoMaskNoMaster 1 points 14 hours ago Isn't the judge eligible for deportation as well? permalink award report block reply Meddlesom 1 points 12 hours ago Looks demonic and retarded at the same time. permalink award report block reply Induceddrag 1 points 19 hours ago Move them out of town. permalink award report block reply Unboosted 1 points 8 hours ago If he does then disbar and arrest the judge. There MUST be a rule about helping criminals escape justice for personal political reasons. permalink award report block reply TearsAficionado 1 points 20 hours ago This judge definitely puts on a wig and makeup and dances for dollars in front of 3rd graders. permalink award report block reply brewser724 1 points 17 hours ago Ignore and continue and tell him to GFY permalink award report block reply SaxonRealm 1 points 19 hours ago It is beyond time to ignore these judges. Just start arresting them. permalink award report block reply DingleBalls 1 points 21 hours ago And since when does ICE have to listen to this \"judge\"??? permalink award report block reply 16BeatsAOne 1 points 21 hours ago No one will be released >> appeal all the way up to SCOTUS if needed. permalink award report block reply WalkerStemmons 1 points 18 hours ago No. permalink award report block reply Yawnz13 1 points 21 hours ago Retards keeping thinking that Trump is going with the orders. permalink award report block reply Pats5x 1 points 21 hours ago Can't stop winning permalink award report block reply Klown_Kutz 1 points 13 hours ago That monkey should be cleaning the fucking toilets, not sitting on the bench. permalink award report block reply Donger-Lord 1 points 21 hours ago Ignore. permalink award report block reply becomelions 1 points 21 hours ago Trump and congress need to reform the judiciary now (see \"Judiciary Act of 1802\") https://gingrich360.com/2025/03/18/an-intolerable-judicial-dictatorship/ permalink award report block reply DaayTerkErJerbs 1 points 18 hours ago Ignore the judge then arrest him permalink award report block reply JetJocky 1 points 19 hours ago The rulings from these left wing judges are becoming nothing more than symbolic at this point. permalink award report block reply HunterBidensPC 1 points 21 hours ago Add this judge to the lot and deport his ass before he makes the ruling. I don’t give a flying fuck anymore permalink award report block reply Goatboy66 1 points 20 hours ago Arrest the judge for overstepping his Authority. Disbar him. permalink award report block reply Shaffro 1 points 13 hours ago I know these judges are criminals.Follow the money and arrest and indict these crooks. permalink award report block reply CDean 1 points 21 hours ago Key word \"dumped.\" Only following judges orders 😂 permalink award report block reply henri_derelicte 1 points 21 hours ago Dumped from a plane into the ocean at 30,000 feet permalink parent award report block reply dres3 1 points 21 hours ago oh no the order forms for the release were lost in a boat accidnet. permalink award report block reply wookiebush 1 points 20 hours ago Uhm, how about NO. W. permalink award report block reply Deltamyass 1 points 21 hours ago Crazy how criminals and illegals get rewarded for breaking rules while rule followers get fucked while also having to deal with criminals and illegals.impeach and charge the judges. They are working for the devil. permalink award report block reply thisisatestof2 1 points 20 hours ago Make liberals take them in and fence them in.  Maybe a PPV. permalink award report block reply YouBuckingFitch 1 points 12 hours ago This \"judge\" looks like a crackhead... permalink award report block reply CaJuN-Polak 1 points 10 hours ago No. permalink award report block reply Smdlegend 1 points 13 hours ago Nope. permalink award report block reply emorphia 1 points 12 hours ago Trump keeps doing what these activist judges tell him to do.   all because the fear of optics.   fck optics , by now its a battle for survival. permalink award report block reply Wrexxis780 1 points 21 hours ago Bring them all out of his jurisdiction permalink award report block reply BurtMcGirt 1 points 20 hours ago Dump them in the middle of the ocean. Let the communist, pedophile judges try to fish them out. permalink award report block reply Cacciali_Via 1 points 20 hours ago It's time we told these Jew and nigga judges to fuck off. permalink award report block reply SuperDuperBasedMD 1 points 13 hours ago Destruction/delegitimization of the judiciary is one of the key steps to civil war. It can take the form of violence against judges or obviously politicized verdicts. Once the judiciary is no longer an effective arbiter/fair dealer, then naked force is the way decisions get made. We're getting closer to the edge. permalink award report block reply SaltyCamaro 1 points 11 hours ago No standing, ignore. permalink award report block reply MediaBro 1 points 16 hours ago If you'll don't hang this man, if he does this, you'll deserve getting screwed over. permalink award report block reply KungPaoMcChicken 1 points 21 hours ago Even if they are released, it's still fine. Remember people, it's the process that is the punishment. Allow these people to occasionally feel free. Trust me, when your waiting for something, it's horrible. permalink award report block reply Hikedelics 1 points 19 hours ago Well.. move their asses to Ohio. Quick! Better yet dump them somewhere outside of the country, I don’t care so long as it is 500+ miles away from any land boarder. permalink award report block reply General_Specific 1 points 12 hours ago Hopefully that border is aquatic. permalink parent award report block reply finnigan 1 points 10 hours ago Ignore him. permalink award report block reply DeaduponArousal 0 points 21 hours ago I’m done voting for anything other than local until someone comes along and their platform is shooting illegals on site, banning all immigration/dual citizens, and deporting rogue judges to Antarctica. permalink award report block reply IvotedforTrumptwice 2 points 21 hours ago I guess you’ll just never vote then? permalink parent award report block reply USNVET71 -5 points 21 hours ago Blah blah blah make all the judgments you want. You need to read the fucking constitution, my brother. permalink award report block reply new_guy2 1 points 21 hours ago Comment removed by community moderators. permalink award report block reply\nChimpanzeeFatigue 170 points 21 hours ago I would prefer a civil war over Trump capitulating to these judges’ “orders” permalink award report block reply TommyLasordasBallBag 39 points 20 hours ago IF civil war happens,  activist judges have to go first. We don't have a chance at rebuilding a country afterwards if there are anti-constitutional judges. The communist representatives don't hold nearly as much power as these \"appointed\" benches do. I still don't think your average cookie cutter neighborhood family could stomach going to war though. It even pains me to think of it. permalink parent award report block reply Meddlesom 24 points 19 hours ago Propagandists have to be the first to go.  Judges don't matter during war, but propagandists do. permalink parent award report block reply Sig229 11 points 16 hours ago Time is running out. These America hating commie judges need removing fast. If the democrats get back into power through cheating, it is 100% game over this time. permalink parent award report block reply Shih_Tabed 1 points 17 hours ago Definitely don't need to wait for civil war to take care of activist judges.  They don't live at the courthouse.  They go out for drinks and dinner just like everyone else.  Just taking care of that problem would transform society.  Sure, they would reload with more activist judges, but they will figure out the pattern soon enough and there will be less people willing to take on that task.  Judges that remain untouched would signal what kind of judge the people actually want and they would be forced to fall in line.  If ever there were a first step in this operation it would be the activist judges.  DAs are a close second, but the judges are the ones that smack that hammer. permalink parent award report block reply BeauHD 3 points 20 hours ago Who is paying you to keep calling for war with all your alts? permalink parent award report block reply ChimpanzeeFatigue 6 points 19 hours ago Who is paying you to cuck yourself on the Internet? permalink parent award report block reply snoopy3210 2 points 18 hours ago What’s sure is bribery Biden is paying that judge permalink parent award report block reply MasterChief08 4 points 15 hours ago War is infinitely preferable to losing power permalink parent award report block reply Shih_Tabed 2 points 17 hours ago Probably the same people promising to pay people that say \"glow\" for FBI tips. permalink parent award report block reply Appeal2Heaven98 -3 points 20 hours ago IT GLOWS! IT GLOWSSSSS! 🚨 permalink parent award report block reply mikejones 3 points 20 hours ago Use the system against us. There is no winning then. permalink parent award report block reply Yawnz13 2 points 21 hours ago He's not though. permalink parent award report block reply Donger-Lord 22 points 21 hours ago Except he his. permalink parent award report block reply Yawnz13 -6 points 21 hours ago Except he isn't.  Go on and show me where he's released these detainees. permalink parent award report block reply _Eric_Ciaramella_ 13 points 21 hours ago Except he hasn't given these communist Kings a single middle finger once. permalink parent award report block reply view 10 more comments... 3-10 12 points 20 hours ago Trump brought back Garcia instead of telling the judge to fuck off. Trumps failings are he doesn’t tell the judges to stay out of Executive Powers and he has losers running the DOJ, they are doing jack and shit to the deep state and Antifa. Shouldn’t take this long to get the money and start arresting the Democrats donor class. permalink parent award report block reply view 4 more comments... lefty295 1 points 20 hours ago The order hasn’t even happened yet permalink parent award report block reply view 2 more comments... booblitchutz 6 points 21 hours ago Kilmar Abrego Garcia is not deported. permalink parent award report block reply Yawnz13 -1 points 19 hours ago Trump has no power over individual deportations anyway. permalink parent award report block reply Doritalos 2 points 20 hours ago I'll take \"Huge Cope\" for $500, Alex permalink parent award report block reply Yawnz13 1 points 15 hours ago Cool story, now actually show it. permalink parent award report block reply NotYourMan 1 points 10 hours ago Judicial insurrection against the executive branch is more lawfare from democrats. permalink parent award report block reply load 4 more comments...\nTommyLasordasBallBag 39 points 20 hours ago IF civil war happens,  activist judges have to go first. We don't have a chance at rebuilding a country afterwards if there are anti-constitutional judges. The communist representatives don't hold nearly as much power as these \"appointed\" benches do. I still don't think your average cookie cutter neighborhood family could stomach going to war though. It even pains me to think of it. permalink parent award report block reply Meddlesom 24 points 19 hours ago Propagandists have to be the first to go.  Judges don't matter during war, but propagandists do. permalink parent award report block reply Sig229 11 points 16 hours ago Time is running out. These America hating commie judges need removing fast. If the democrats get back into power through cheating, it is 100% game over this time. permalink parent award report block reply Shih_Tabed 1 points 17 hours ago Definitely don't need to wait for civil war to take care of activist judges.  They don't live at the courthouse.  They go out for drinks and dinner just like everyone else.  Just taking care of that problem would transform society.  Sure, they would reload with more activist judges, but they will figure out the pattern soon enough and there will be less people willing to take on that task.  Judges that remain untouched would signal what kind of judge the people actually want and they would be forced to fall in line.  If ever there were a first step in this operation it would be the activist judges.  DAs are a close second, but the judges are the ones that smack that hammer. permalink parent award report block reply\nMeddlesom 24 points 19 hours ago Propagandists have to be the first to go.  Judges don't matter during war, but propagandists do. permalink parent award report block reply Sig229 11 points 16 hours ago Time is running out. These America hating commie judges need removing fast. If the democrats get back into power through cheating, it is 100% game over this time. permalink parent award report block reply\nSig229 11 points 16 hours ago Time is running out. These America hating commie judges need removing fast. If the democrats get back into power through cheating, it is 100% game over this time. permalink parent award report block reply\nShih_Tabed 1 points 17 hours ago Definitely don't need to wait for civil war to take care of activist judges.  They don't live at the courthouse.  They go out for drinks and dinner just like everyone else.  Just taking care of that problem would transform society.  Sure, they would reload with more activist judges, but they will figure out the pattern soon enough and there will be less people willing to take on that task.  Judges that remain untouched would signal what kind of judge the people actually want and they would be forced to fall in line.  If ever there were a first step in this operation it would be the activist judges.  DAs are a close second, but the judges are the ones that smack that hammer. permalink parent award report block reply\nBeauHD 3 points 20 hours ago Who is paying you to keep calling for war with all your alts? permalink parent award report block reply ChimpanzeeFatigue 6 points 19 hours ago Who is paying you to cuck yourself on the Internet? permalink parent award report block reply snoopy3210 2 points 18 hours ago What’s sure is bribery Biden is paying that judge permalink parent award report block reply MasterChief08 4 points 15 hours ago War is infinitely preferable to losing power permalink parent award report block reply Shih_Tabed 2 points 17 hours ago Probably the same people promising to pay people that say \"glow\" for FBI tips. permalink parent award report block reply Appeal2Heaven98 -3 points 20 hours ago IT GLOWS! IT GLOWSSSSS! 🚨 permalink parent award report block reply\nChimpanzeeFatigue 6 points 19 hours ago Who is paying you to cuck yourself on the Internet? permalink parent award report block reply snoopy3210 2 points 18 hours ago What’s sure is bribery Biden is paying that judge permalink parent award report block reply\nsnoopy3210 2 points 18 hours ago What’s sure is bribery Biden is paying that judge permalink parent award report block reply\nMasterChief08 4 points 15 hours ago War is infinitely preferable to losing power permalink parent award report block reply\nShih_Tabed 2 points 17 hours ago Probably the same people promising to pay people that say \"glow\" for FBI tips. permalink parent award report block reply\nAppeal2Heaven98 -3 points 20 hours ago IT GLOWS! IT GLOWSSSSS! 🚨 permalink parent award report block reply\nmikejones 3 points 20 hours ago Use the system against us. There is no winning then. permalink parent award report block reply\nYawnz13 2 points 21 hours ago He's not though. permalink parent award report block reply Donger-Lord 22 points 21 hours ago Except he his. permalink parent award report block reply Yawnz13 -6 points 21 hours ago Except he isn't.  Go on and show me where he's released these detainees. permalink parent award report block reply _Eric_Ciaramella_ 13 points 21 hours ago Except he hasn't given these communist Kings a single middle finger once. permalink parent award report block reply view 10 more comments... 3-10 12 points 20 hours ago Trump brought back Garcia instead of telling the judge to fuck off. Trumps failings are he doesn’t tell the judges to stay out of Executive Powers and he has losers running the DOJ, they are doing jack and shit to the deep state and Antifa. Shouldn’t take this long to get the money and start arresting the Democrats donor class. permalink parent award report block reply view 4 more comments... lefty295 1 points 20 hours ago The order hasn’t even happened yet permalink parent award report block reply view 2 more comments... booblitchutz 6 points 21 hours ago Kilmar Abrego Garcia is not deported. permalink parent award report block reply Yawnz13 -1 points 19 hours ago Trump has no power over individual deportations anyway. permalink parent award report block reply Doritalos 2 points 20 hours ago I'll take \"Huge Cope\" for $500, Alex permalink parent award report block reply Yawnz13 1 points 15 hours ago Cool story, now actually show it. permalink parent award report block reply\nDonger-Lord 22 points 21 hours ago Except he his. permalink parent award report block reply Yawnz13 -6 points 21 hours ago Except he isn't.  Go on and show me where he's released these detainees. permalink parent award report block reply _Eric_Ciaramella_ 13 points 21 hours ago Except he hasn't given these communist Kings a single middle finger once. permalink parent award report block reply view 10 more comments... 3-10 12 points 20 hours ago Trump brought back Garcia instead of telling the judge to fuck off. Trumps failings are he doesn’t tell the judges to stay out of Executive Powers and he has losers running the DOJ, they are doing jack and shit to the deep state and Antifa. Shouldn’t take this long to get the money and start arresting the Democrats donor class. permalink parent award report block reply view 4 more comments... lefty295 1 points 20 hours ago The order hasn’t even happened yet permalink parent award report block reply view 2 more comments...\nYawnz13 -6 points 21 hours ago Except he isn't.  Go on and show me where he's released these detainees. permalink parent award report block reply _Eric_Ciaramella_ 13 points 21 hours ago Except he hasn't given these communist Kings a single middle finger once. permalink parent award report block reply view 10 more comments... 3-10 12 points 20 hours ago Trump brought back Garcia instead of telling the judge to fuck off. Trumps failings are he doesn’t tell the judges to stay out of Executive Powers and he has losers running the DOJ, they are doing jack and shit to the deep state and Antifa. Shouldn’t take this long to get the money and start arresting the Democrats donor class. permalink parent award report block reply view 4 more comments... lefty295 1 points 20 hours ago The order hasn’t even happened yet permalink parent award report block reply view 2 more comments...\n_Eric_Ciaramella_ 13 points 21 hours ago Except he hasn't given these communist Kings a single middle finger once. permalink parent award report block reply view 10 more comments...\n3-10 12 points 20 hours ago Trump brought back Garcia instead of telling the judge to fuck off. Trumps failings are he doesn’t tell the judges to stay out of Executive Powers and he has losers running the DOJ, they are doing jack and shit to the deep state and Antifa. Shouldn’t take this long to get the money and start arresting the Democrats donor class. permalink parent award report block reply view 4 more comments...\nlefty295 1 points 20 hours ago The order hasn’t even happened yet permalink parent award report block reply view 2 more comments...\nbooblitchutz 6 points 21 hours ago Kilmar Abrego Garcia is not deported. permalink parent award report block reply Yawnz13 -1 points 19 hours ago Trump has no power over individual deportations anyway. permalink parent award report block reply\nYawnz13 -1 points 19 hours ago Trump has no power over individual deportations anyway. permalink parent award report block reply\nDoritalos 2 points 20 hours ago I'll take \"Huge Cope\" for $500, Alex permalink parent award report block reply Yawnz13 1 points 15 hours ago Cool story, now actually show it. permalink parent award report block reply\nYawnz13 1 points 15 hours ago Cool story, now actually show it. permalink parent award report block reply\nNotYourMan 1 points 10 hours ago Judicial insurrection against the executive branch is more lawfare from democrats. permalink parent award report block reply\nPOTUS_DonnieJ 72 points 21 hours ago Let him order it. Then ignore it. permalink award report block reply Nomad899 34 points 21 hours ago Tell him to come down and look for the keys permalink parent award report block reply MAGABOND 13 points 20 hours ago Just release them into this niggnoggs neighborhood. permalink parent award report block reply Diezelnut 2 points 11 hours ago Right in front of his house. permalink parent award report block reply\nNomad899 34 points 21 hours ago Tell him to come down and look for the keys permalink parent award report block reply MAGABOND 13 points 20 hours ago Just release them into this niggnoggs neighborhood. permalink parent award report block reply Diezelnut 2 points 11 hours ago Right in front of his house. permalink parent award report block reply\nMAGABOND 13 points 20 hours ago Just release them into this niggnoggs neighborhood. permalink parent award report block reply Diezelnut 2 points 11 hours ago Right in front of his house. permalink parent award report block reply\nDiezelnut 2 points 11 hours ago Right in front of his house. permalink parent award report block reply\nCoprolite 48 points 22 hours ago Can't release them if they're dead............. permalink award report block reply TrumpYe2023 13 points 21 hours ago Why is the judge wearing blush and eye liner check that judges hard drive. permalink parent award report block reply Coprolite 11 points 21 hours ago He's in the black eye club too permalink parent award report block reply Reefay 12 points 21 hours ago Oops they ded permalink parent award report block reply Lady_MaGa 7 points 21 hours ago Hawaiian judge orders God to bring back the criminal dead and for Trump to let the zombies to stay in the USA. permalink parent award report block reply bigdickhangsright 4 points 20 hours ago BREAKING: Rhode Island traffic court justice Vigor Shekelberg orders God to tear down Heaven's walls, citing an 1864 ruling in Yugoslavia. permalink parent award report block reply\nTrumpYe2023 13 points 21 hours ago Why is the judge wearing blush and eye liner check that judges hard drive. permalink parent award report block reply Coprolite 11 points 21 hours ago He's in the black eye club too permalink parent award report block reply\nCoprolite 11 points 21 hours ago He's in the black eye club too permalink parent award report block reply\nReefay 12 points 21 hours ago Oops they ded permalink parent award report block reply Lady_MaGa 7 points 21 hours ago Hawaiian judge orders God to bring back the criminal dead and for Trump to let the zombies to stay in the USA. permalink parent award report block reply bigdickhangsright 4 points 20 hours ago BREAKING: Rhode Island traffic court justice Vigor Shekelberg orders God to tear down Heaven's walls, citing an 1864 ruling in Yugoslavia. permalink parent award report block reply\nLady_MaGa 7 points 21 hours ago Hawaiian judge orders God to bring back the criminal dead and for Trump to let the zombies to stay in the USA. permalink parent award report block reply bigdickhangsright 4 points 20 hours ago BREAKING: Rhode Island traffic court justice Vigor Shekelberg orders God to tear down Heaven's walls, citing an 1864 ruling in Yugoslavia. permalink parent award report block reply\nbigdickhangsright 4 points 20 hours ago BREAKING: Rhode Island traffic court justice Vigor Shekelberg orders God to tear down Heaven's walls, citing an 1864 ruling in Yugoslavia. permalink parent award report block reply\nDwoj 41 points 21 hours ago I mean this is just getting so ridiculous. You just need to move these people right away to red places red state red District read something where that’s not gonna happen and then these judges just won’t have a say so in these blue ass stupid ass districts. permalink award report block reply NADSAQ 11 points 20 hours ago red Uganda permalink parent award report block reply MasterChief08 3 points 15 hours ago Or we could just start arresting leftists like we all want. I didn't vote for moderation. I want revenge permalink parent award report block reply\nNADSAQ 11 points 20 hours ago red Uganda permalink parent award report block reply\nMasterChief08 3 points 15 hours ago Or we could just start arresting leftists like we all want. I didn't vote for moderation. I want revenge permalink parent award report block reply\nRogueLeaderX 36 points 21 hours ago Doesnt have any authority over a Federal Executive Operation. Tell him to “F#$& OFF”. permalink award report block reply Reefay 14 points 21 hours ago About as much authority as a beauty pageant judge permalink parent award report block reply\nReefay 14 points 21 hours ago About as much authority as a beauty pageant judge permalink parent award report block reply\nArea82 22 points 21 hours ago Judge looks retarded. permalink award report block reply IvotedforTrumptwice 18 points 21 hours ago Looks can be deceiving, he’s actually a retarded faggot. permalink parent award report block reply Area82 8 points 21 hours ago Gay, black and retarded?  I am surprised Biden didn’t nominate him for SCOTUS. permalink parent award report block reply\nIvotedforTrumptwice 18 points 21 hours ago Looks can be deceiving, he’s actually a retarded faggot. permalink parent award report block reply Area82 8 points 21 hours ago Gay, black and retarded?  I am surprised Biden didn’t nominate him for SCOTUS. permalink parent award report block reply\nArea82 8 points 21 hours ago Gay, black and retarded?  I am surprised Biden didn’t nominate him for SCOTUS. permalink parent award report block reply\nPhantomShield72 15 points 21 hours ago Most would prefer not to contemplate how bad the situation is and how utterly infiltrated all levels of our government is, but the number of stories lime this is almost overwhelming. The best aspect of the circumstances we see playing out right now is there are a lot of enemies within who would otherwise not be obvious that are exposing themselves. permalink award report block reply\nLibtardBusterMAGA 13 points 21 hours ago Ignore him permalink award report block reply MasterChief08 2 points 15 hours ago Arrest him. Then ship him to Gitmo permalink parent award report block reply\nMasterChief08 2 points 15 hours ago Arrest him. Then ship him to Gitmo permalink parent award report block reply\nTookens 13 points 21 hours ago There's only one legitimate response to such a ruling.. \"Fuck you, judge\" permalink award report block reply brimshae 2 points 17 hours ago *ahem* \"[The Judge] has made his decision; now let him enforce it.\" permalink parent award report block reply\nbrimshae 2 points 17 hours ago *ahem* \"[The Judge] has made his decision; now let him enforce it.\" permalink parent award report block reply\nMajorClark 12 points 21 hours ago Activist DEI judges like this scum need to be expelled and disbarred from every practicing law again.  Charge him with aiding & abetting illegal criminals. permalink award report block reply henri_derelicte 16 points 21 hours ago Insurrection act. Declare that the district court is waging an insurrection against the federal government by endangering public safety and blatantly disregarding constitution. Have the judges arrested, and the court disbanded. Replace the court with a military tribunal (which you are allowed to do when the civilian courts are no longer functioning). Rinse and repeat for Massachusetts, DC, California, Maryland, Virginia, New York, and the large majority of the lawfare comes to an end. permalink parent award report block reply MasterChief08 1 points 15 hours ago Trump is too moderate right now. We need far right solutions permalink parent award report block reply\nhenri_derelicte 16 points 21 hours ago Insurrection act. Declare that the district court is waging an insurrection against the federal government by endangering public safety and blatantly disregarding constitution. Have the judges arrested, and the court disbanded. Replace the court with a military tribunal (which you are allowed to do when the civilian courts are no longer functioning). Rinse and repeat for Massachusetts, DC, California, Maryland, Virginia, New York, and the large majority of the lawfare comes to an end. permalink parent award report block reply\nMasterChief08 1 points 15 hours ago Trump is too moderate right now. We need far right solutions permalink parent award report block reply\nPatriot4TN 7 points 21 hours ago Dump them all off on his doorstep... permalink award report block reply\nBythrfruitsyknow 7 points 21 hours ago Let's hope they get an immediate stay from the appellant court. permalink award report block reply 3-10 4 points 20 hours ago Or how bought he say it is a national security issue and be a man and tell them to pound sand? permalink parent award report block reply MasterChief08 3 points 15 hours ago Fuck this. Either Trump ignores this or I'm done. Fucking grow some balls, Republicans. permalink parent award report block reply\n3-10 4 points 20 hours ago Or how bought he say it is a national security issue and be a man and tell them to pound sand? permalink parent award report block reply\nMasterChief08 3 points 15 hours ago Fuck this. Either Trump ignores this or I'm done. Fucking grow some balls, Republicans. permalink parent award report block reply\nSavingPrivateGrace 7 points 21 hours ago Corn Pop permalink award report block reply\nLogicalReasoning 6 points 21 hours ago When do we start charging these people with obstruction? Better yet, lets dragnet them into RICO since its very clear that they are all in the same boat, working in sync to subvert federal law and enforcement. permalink award report block reply Mortal_Wombat 1 points 14 hours ago I thought they were narrowing down on Soros' and Ilks NGO funny money movements. Maybe we'll see traction in a couple of weeks 🤷‍♂️ permalink parent award report block reply\nMortal_Wombat 1 points 14 hours ago I thought they were narrowing down on Soros' and Ilks NGO funny money movements. Maybe we'll see traction in a couple of weeks 🤷‍♂️ permalink parent award report block reply\nhenri_derelicte 6 points 21 hours ago Fuck it. Keep them detained. I was promised that we’d be getting illegal aliens off the streets and I expect the administration to keep that promise permalink award report block reply\nUSAisAOKay 6 points 21 hours ago Just send them home don't detain them. permalink award report block reply\nAVeryNakedMan 6 points 21 hours ago Just ignore it. permalink award report block reply\nianpatrick1966 5 points 21 hours ago One word…. No permalink award report block reply\nBusterHyman99 5 points 21 hours ago Sorry federal law tops any judges order. How can they keep allowing this crap permalink award report block reply IvotedforTrumptwice 8 points 21 hours ago The real question is, how can WE keep allowing this crap? permalink parent award report block reply MasterChief08 3 points 15 hours ago Exactly. permalink parent award report block reply\nIvotedforTrumptwice 8 points 21 hours ago The real question is, how can WE keep allowing this crap? permalink parent award report block reply MasterChief08 3 points 15 hours ago Exactly. permalink parent award report block reply\nMasterChief08 3 points 15 hours ago Exactly. permalink parent award report block reply\nrastren 5 points 19 hours ago I'm in Chicago and feel like the only white person here. It's gotten worse. Maybe people are moving here because sanctuary status. I need to gtfo of here permalink award report block reply\nNomad899 5 points 21 hours ago Dump them on syrian streets…. Oops sooorrrry permalink award report block reply Coprolite 5 points 21 hours ago From 10,000 feet. 😈 permalink parent award report block reply\nCoprolite 5 points 21 hours ago From 10,000 feet. 😈 permalink parent award report block reply\nhannahb 5 points 20 hours ago If this guy wants to release thousands of criminals onto our streets and endanger all of our lives, then maybe we the people need to start endangering theirs. permalink award report block reply\nbecomelions 4 points 21 hours ago how long are we going to pretend these people are judges? permalink award report block reply\nMeMargie 4 points 20 hours ago Rope for the Black Robes, a country of laws not Treason. permalink award report block reply\nToniBahloni 4 points 21 hours ago Is the judge's name Nick Gurr? permalink award report block reply booblitchutz 4 points 21 hours ago His name is Judge G. Gabu permalink parent award report block reply FrankDuncan 4 points 20 hours ago Phil t. Kuhn permalink parent award report block reply\nbooblitchutz 4 points 21 hours ago His name is Judge G. Gabu permalink parent award report block reply FrankDuncan 4 points 20 hours ago Phil t. Kuhn permalink parent award report block reply\nFrankDuncan 4 points 20 hours ago Phil t. Kuhn permalink parent award report block reply\npanic_scam 4 points 21 hours ago How about just ignoring these useless “judges”? permalink award report block reply\nLightBeacons 4 points 21 hours ago Eyes and fake teeth Cheshire cat smile indicate retard! permalink award report block reply\nQuiznos585 4 points 21 hours ago Please I beg you start arresting these fucking judges. This is so demoralizing. permalink award report block reply\nMoebius 4 points 20 hours ago Well alrighty then.  'Probable cause' is established. Those 3000 Illegals already still in custody are in fact illegal. Administratively release them then re-arrest them on the spot if they now already KNOW they're Illegals. Pre- Determining whether someone is Illegally in the US w/o a warrant is the stupidest shit I ever heard.  Every second they're here is a 'crime in progress' whether they snuck in or overstayed their Visas 20 years ago. permalink award report block reply\nHanging_Chad 4 points 21 hours ago release them a couple yards before international waters permalink award report block reply\nHeatherSwanson 4 points 20 hours ago A faggot and a naggerz. Obviously permalink award report block reply\nSunnybats2 3 points 21 hours ago Move them to abother state first permalink award report block reply\nNoticesBugleOWO 3 points 21 hours ago No standing. permalink award report block reply\nTrump4Infinity 3 points 21 hours ago Hang the judge. This is the only way. Many will say \"oh no that's ridiculous\". In 10 years they'll say why didn't we hang people when we could have. permalink award report block reply\nAmerica_No_1 3 points 21 hours ago Can we have another judge arrested? permalink award report block reply starjello 3 points 19 hours ago Yea what ever happened to that fat ass bitch judge in Wisconsin? permalink parent award report block reply America_No_1 2 points 18 hours ago Good fucking question permalink parent award report block reply\nstarjello 3 points 19 hours ago Yea what ever happened to that fat ass bitch judge in Wisconsin? permalink parent award report block reply America_No_1 2 points 18 hours ago Good fucking question permalink parent award report block reply\nAmerica_No_1 2 points 18 hours ago Good fucking question permalink parent award report block reply\nJustjayce 3 points 21 hours ago Ignore permalink award report block reply\nGoozmania 3 points 20 hours ago If Trump caves to such an order, I'll never return to this forum. permalink award report block reply\nEffingWhiteMale 3 points 19 hours ago Sorry 'judge' but illegals aren't entitled to US citizen rights. permalink award report block reply\ndarkmodeforgotpass 3 points 19 hours ago I was hoping to read it as if he was detained for being poised to order the release. But in America, it's never good news. permalink award report block reply\nknnbccb 3 points 20 hours ago The appointments of a president installed by a stolen election should be made null and void. If necessary, 'Scalia' these judicial cockroaches. There will be no more prolonged courtroom and media clown show. permalink award report block reply\ncd3dog 3 points 21 hours ago Nope.  Come make us flat foot. permalink award report block reply\nfightfightfightx 3 points 20 hours ago should arrest the judge for treason and not release potential terrorists into the country permalink award report block reply\nOvertaxed 3 points 20 hours ago Defy the judges or lose the country. permalink award report block reply\nAmerica101 2 points 20 hours ago I always thought the president has the final word, not a judge. permalink award report block reply\nTearsAficionado 2 points 20 hours ago IGNORE that seditious terrorist. permalink award report block reply\nSnek_Plissken 2 points 21 hours ago No standing? This will just go up to the supreme court and enforce Trump's power. permalink award report block reply\nTunk 2 points 21 hours ago If the judge does do it, honestly just arrest them on harboring or assisting charges prior to filing the appeal. At some point, the executive needs to exert executive power against the courts as a warning shot, that yes there will be consequences if they keep up fuck fuck games, and no, judges are not immune to being criminally charged. Balance of powers, welcome the judiciary is not king over congress and president. permalink award report block reply\nBitterRoots 2 points 17 hours ago President Trump does not have to comply. DOJ decides - not a judge. permalink award report block reply\ncyberwar 1 points 18 hours ago ignore these illegal judges permalink award report block reply\nEaszq8 1 points 19 hours ago Tell Troon Xerxes to kick rocks. permalink award report block reply\nDCYR66 1 points 12 hours ago Sadly Trump won’t ignore them. Which makes it another campaign promise broken. permalink award report block reply\nHodeefuk123 1 points 20 hours ago CANT stop it permalink award report block reply\nGrakarion 1 points 15 hours ago I didn’t settle. Trump should not be beholden to previous administrations settlements for shitty outcomes that only benefit criminals. Fuck that and fuck this jusge permalink award report block reply\nCuck_Slayer24 1 points 20 hours ago Yea thats not going to happen. Immediate emergency appeal, then the next court will side with the admin.  Like pretty much every other time so far permalink award report block reply\nNoMaskNoMaster 1 points 14 hours ago Isn't the judge eligible for deportation as well? permalink award report block reply\nMeddlesom 1 points 12 hours ago Looks demonic and retarded at the same time. permalink award report block reply\nInduceddrag 1 points 19 hours ago Move them out of town. permalink award report block reply\nUnboosted 1 points 8 hours ago If he does then disbar and arrest the judge. There MUST be a rule about helping criminals escape justice for personal political reasons. permalink award report block reply\nTearsAficionado 1 points 20 hours ago This judge definitely puts on a wig and makeup and dances for dollars in front of 3rd graders. permalink award report block reply\nbrewser724 1 points 17 hours ago Ignore and continue and tell him to GFY permalink award report block reply\nSaxonRealm 1 points 19 hours ago It is beyond time to ignore these judges. Just start arresting them. permalink award report block reply\nDingleBalls 1 points 21 hours ago And since when does ICE have to listen to this \"judge\"??? permalink award report block reply\n16BeatsAOne 1 points 21 hours ago No one will be released >> appeal all the way up to SCOTUS if needed. permalink award report block reply\nWalkerStemmons 1 points 18 hours ago No. permalink award report block reply\nYawnz13 1 points 21 hours ago Retards keeping thinking that Trump is going with the orders. permalink award report block reply\nPats5x 1 points 21 hours ago Can't stop winning permalink award report block reply\nKlown_Kutz 1 points 13 hours ago That monkey should be cleaning the fucking toilets, not sitting on the bench. permalink award report block reply\nDonger-Lord 1 points 21 hours ago Ignore. permalink award report block reply\nbecomelions 1 points 21 hours ago Trump and congress need to reform the judiciary now (see \"Judiciary Act of 1802\") https://gingrich360.com/2025/03/18/an-intolerable-judicial-dictatorship/ permalink award report block reply\nDaayTerkErJerbs 1 points 18 hours ago Ignore the judge then arrest him permalink award report block reply\nJetJocky 1 points 19 hours ago The rulings from these left wing judges are becoming nothing more than symbolic at this point. permalink award report block reply\nHunterBidensPC 1 points 21 hours ago Add this judge to the lot and deport his ass before he makes the ruling. I don’t give a flying fuck anymore permalink award report block reply\nGoatboy66 1 points 20 hours ago Arrest the judge for overstepping his Authority. Disbar him. permalink award report block reply\nShaffro 1 points 13 hours ago I know these judges are criminals.Follow the money and arrest and indict these crooks. permalink award report block reply\nCDean 1 points 21 hours ago Key word \"dumped.\" Only following judges orders 😂 permalink award report block reply henri_derelicte 1 points 21 hours ago Dumped from a plane into the ocean at 30,000 feet permalink parent award report block reply\nhenri_derelicte 1 points 21 hours ago Dumped from a plane into the ocean at 30,000 feet permalink parent award report block reply\ndres3 1 points 21 hours ago oh no the order forms for the release were lost in a boat accidnet. permalink award report block reply\nwookiebush 1 points 20 hours ago Uhm, how about NO. W. permalink award report block reply\nDeltamyass 1 points 21 hours ago Crazy how criminals and illegals get rewarded for breaking rules while rule followers get fucked while also having to deal with criminals and illegals.impeach and charge the judges. They are working for the devil. permalink award report block reply\nthisisatestof2 1 points 20 hours ago Make liberals take them in and fence them in.  Maybe a PPV. permalink award report block reply\nYouBuckingFitch 1 points 12 hours ago This \"judge\" looks like a crackhead... permalink award report block reply\nCaJuN-Polak 1 points 10 hours ago No. permalink award report block reply\nSmdlegend 1 points 13 hours ago Nope. permalink award report block reply\nemorphia 1 points 12 hours ago Trump keeps doing what these activist judges tell him to do.   all because the fear of optics.   fck optics , by now its a battle for survival. permalink award report block reply\nWrexxis780 1 points 21 hours ago Bring them all out of his jurisdiction permalink award report block reply\nBurtMcGirt 1 points 20 hours ago Dump them in the middle of the ocean. Let the communist, pedophile judges try to fish them out. permalink award report block reply\nCacciali_Via 1 points 20 hours ago It's time we told these Jew and nigga judges to fuck off. permalink award report block reply\nSuperDuperBasedMD 1 points 13 hours ago Destruction/delegitimization of the judiciary is one of the key steps to civil war. It can take the form of violence against judges or obviously politicized verdicts. Once the judiciary is no longer an effective arbiter/fair dealer, then naked force is the way decisions get made. We're getting closer to the edge. permalink award report block reply\nSaltyCamaro 1 points 11 hours ago No standing, ignore. permalink award report block reply\nMediaBro 1 points 16 hours ago If you'll don't hang this man, if he does this, you'll deserve getting screwed over. permalink award report block reply\nKungPaoMcChicken 1 points 21 hours ago Even if they are released, it's still fine. Remember people, it's the process that is the punishment. Allow these people to occasionally feel free. Trust me, when your waiting for something, it's horrible. permalink award report block reply\nHikedelics 1 points 19 hours ago Well.. move their asses to Ohio. Quick! Better yet dump them somewhere outside of the country, I don’t care so long as it is 500+ miles away from any land boarder. permalink award report block reply General_Specific 1 points 12 hours ago Hopefully that border is aquatic. permalink parent award report block reply\nGeneral_Specific 1 points 12 hours ago Hopefully that border is aquatic. permalink parent award report block reply\nfinnigan 1 points 10 hours ago Ignore him. permalink award report block reply\nDeaduponArousal 0 points 21 hours ago I’m done voting for anything other than local until someone comes along and their platform is shooting illegals on site, banning all immigration/dual citizens, and deporting rogue judges to Antarctica. permalink award report block reply IvotedforTrumptwice 2 points 21 hours ago I guess you’ll just never vote then? permalink parent award report block reply\nIvotedforTrumptwice 2 points 21 hours ago I guess you’ll just never vote then? permalink parent award report block reply\nUSNVET71 -5 points 21 hours ago Blah blah blah make all the judgments you want. You need to read the fucking constitution, my brother. permalink award report block reply\nnew_guy2 1 points 21 hours ago Comment removed by community moderators. permalink award report block reply"}