{"id": "1ARK5A7e5J", "contents": "363 Went to the casino last night posted 3 days ago by 2021is1776-2 51 comments award share report block It’s my brothers wife’s  birthday so we got the casino. On a Saturday night the place is always packed and getting a machine is usually a bit of a wait. The crowd is almost always 80% black 10% Hispanic 5% white and 5% Asian by about 11pm early evening is mostly white. Last night however it was only about 10% black if even that. The crowd was minimal maybe at 10% capacity and it was more even between white and Hispanic. I was sitting with my Brother while the girls were off gambling and it hit me, was this because of food stamps? Even if it were a slow night there would be a lot more people in the casino.  I am starting to think that welfare is holding up a lot of luxury industries. This is in Richmond VA\n51 comments Sort by Top Top New Worst Old Save empiretc 60 points 3 days ago yep.  they could not sell their food stamps for cash to go gamble.  sounds right. permalink award report block reply BloodElfSupporter 44 points 3 days ago That’s so fucked up. And here I am working two jobs to support my elderly parents. Fuck permalink parent award report block reply tarballs 25 points 3 days ago You can ruthlessly abuse the system in any way possible, too, but, you have that whole pesky honor/decency thing preventing that permalink parent award report block reply BloodElfSupporter 16 points 3 days ago Well I’m Asian American and proud to say no other Asian Americans I know in my immediate circle abuse the welfare system. We all work hard and contribute to the society. permalink parent award report block reply Husky 5 points 3 days ago Sounds like a pesky honor/decency thing permalink parent award report block reply view 1 more comments... 2021Is1776 6 points 3 days ago In my best libtard voice- People shouldn't have to work lo live don't be such a capitalist. permalink parent award report block reply MR__K 3 points 3 days ago Just trying to feed my kids and pay rent. Fuckers are selling my kids and mine future's. To sell and cheat and gamble. This shit needs to stop. permalink parent award report block reply justicein2020 8 points 3 days ago Not just that. They now have to spend their own cash money on food instead of stamps covering it. Instead of pissing the cash away at the casino and stamps covering food. Couldn't you have a lot of fun if you knew your food costs were zero? permalink parent award report block reply empiretc 5 points 3 days ago Exactly that. permalink parent award report block reply 2021Is1776 6 points 3 days ago I think thats part of it but I think its more gov subsidizing their life style. permalink parent award report block reply schnazzmizzle 2 points 3 days ago If I didn't have to budget 1600 a month for food I'd have 1600 more disposable income.. permalink parent award report block reply empiretc 3 points 3 days ago not shit.  spend about $800 here on groceries only.   going out to eat or getting takeout is extra. permalink parent award report block reply chinigga 27 points 3 days ago I was staying at the Bellagio last week.  It was 50% Arabs and 50% Whites at the tables.  I saw one group of Asians. Went to eat at The Steak House and only saw two Black people walking around at the 3rd world shithole that is Circus Circus. My Uber drivers all stated it was quiet in Vegas the entire past summer. permalink award report block reply 2021is1776-2 OP 24 points 3 days ago Vegas shot itself in the foot when it lowered prices in 2021. Videos of fights and shootings started coming out as ghetto trash flowed in from California. Vegas might have been expensive but it kept the worst of the trash out. Also casinos opened in damn near every state so that fucked em pretty hard too. permalink parent award report block reply imnotdeadyet 17 points 3 days ago That shit didn't happen when the mob ran Vegas.  You didn't commit a crime unless you were allowed too and got permission.  Street crime was minimal, because they pulled something and the mob would take care of them. permalink parent award report block reply Choomguy 13 points 3 days ago Fuck vegas.  Its right up there with the disney properties that are on my bucket list of places I’ll never visit… permalink parent award report block reply AndanteAndante 6 points 3 days ago And now they shot themselves in the head by raising the prices to unaffordable levels. permalink parent award report block reply The_Emperor 5 points 3 days ago That was COVID restrictions...ended foreign tourists...had to lure LA folks and gangs permalink parent award report block reply Kyro54111 5 points 3 days ago And online gaming. permalink parent award report block reply load 1 more comments... fluffykitten 8 points 3 days ago Used to go twice in the Fall/Winter every year..... I avoid it like the plague now because F1 ruins the entire Strip. Summer months are way too hot. The nickel & diming is wild. Comps are trash now. Paid parking on the Strip is stupid... you even have to pay it if you're staying on the property (except the Wynn/Encore, last I checked). permalink parent award report block reply dukeofdoorcounty 3 points 3 days ago Three months building the F1 track, and two months tearing it up.  Every year permalink parent award report block reply Stossels_stach 6 points 3 days ago I dont even stop in Vegas when i have to drive through the area. Flagstaff is more normal and less crime for travelers in cars permalink parent award report block reply GenWashington 19 points 3 days ago Keep on noticing - we have been paying for people to have luxury (what ever that means to you) - events, food etc. etc. I have noticed a huge change and now - more than ever you are going to see things turn around. Some items will be cheaper at the end of the day permalink award report block reply 2021is1776-2 OP 15 points 3 days ago Luxury is any non necessity spending. Cruises, gambling, theme parks etc etc. permalink parent award report block reply Oodles 9 points 3 days ago Exactly. The worst part about SNAP is not the criminal deadbeats it directly supports, but the much more numerous low-trust society organizations it supports indirectly permalink award report block reply Steve56775 8 points 3 days ago The grocery stores right now are awesome. Fully stocked shelves, clean, and no crowds or check out lines. All the employees are smiling and helpful. It’s like a different country or something. This is winning. permalink award report block reply RandoBudster 6 points 3 days ago Don't know the area but aren't their a lot of Fed workers there? They haven't been getting paid and huge numbers are black. permalink award report block reply 2021Is1776 5 points 3 days ago in Richmond? not really that would be the MGM in NOVA/Maryland permalink parent award report block reply Gnometard 5 points 3 days ago I love how the communists have folks on our side focusing race and making assumptions exactly like they do. It's almost like their revolution is working exactly as they want. I don't know about you folks, but I don't want to help the communists. I'm also not dumb enough to confuse mirroring someone as opposition to them. permalink award report block reply BoricuaPede -2 points 3 days ago This place has gone to hell, fren. permalink parent award report block reply tpactionchasethevote -3 points 3 days ago 👆 permalink parent award report block reply rivetjoint2 5 points 3 days ago You have a casino in Richmond?  Since when? permalink award report block reply zooty 10 points 3 days ago Since governments stopped having a moral imperative and tax money became everything. See also lotteries. permalink parent award report block reply Aggrieved03 10 points 3 days ago See also weed next to daycare. permalink parent award report block reply 2021Is1776 7 points 3 days ago Rosie's opened up maybe 3 years ago or so I think. Its a colonial downs property they built inside the old k-mart across from the strip club. The nicer one is in New Kent at the horse track. There's one opening in Petersburg but I expect it to fail due to the crime in that area. Rivers in Portsmouth is supposedly nice but its a drive to get there then you have the MGM in NOVA/ Maryland but its full of DC dwellers and they are fucking the worst. permalink parent award report block reply rivetjoint2 5 points 3 days ago Sounds nice LOL, a K-mart and a strip club.    I've been to the MGM, those of the best cloths that those PG county dwellers have for the big night out.   A friend of a friend is a high roller, he gets an escort and a casino private limo to and from, because the locals have been known to follow people home and roll them. permalink parent award report block reply 2021Is1776 3 points 3 days ago yeah I thought strippers made bank until we left the casino one night and there was a girl on the corner holding a sign begging for money, she was also the same girl they had on the sign as a one night event at the strip club. I think she was a former porn star or something I laughed my ass off. permalink parent award report block reply KennyKetchem 4 points 3 days ago This explains the government push for DEI hires and the constant shitting on of white people. Keep the EBT shut off forever and these companies would be on their knees kissing our feet for our money. permalink award report block reply suckmycorona 4 points 3 days ago Just buying votes that’s all. permalink award report block reply Ryan282 2 points 3 days ago Did you win anything? permalink award report block reply 2021Is1776 3 points 3 days ago i left 80 bucks up I dont really gamble But ill toss a 20 in while sitting with the wife. If they have tables I will play mostly for the social interaction. permalink parent award report block reply monkadelic 3 points 3 days ago I hit the full house on the flop sucker bet last night for 50 to 1 playing UTH.  I don't know about OP though. permalink parent award report block reply lul_cheto 2 points 3 days ago Whos going to pluck your eyebrows mr trump! permalink award report block reply Alexcoop1 2 points 3 days ago I had the same experience at a sit down restaurant last night. It was less packed on a Saturday night than it was on a weekday night a month ago. permalink award report block reply Crapachino 2 points 3 days ago Trump has now the mobsters pissed off... And the indians. permalink award report block reply npc_1234 2 points 3 days ago Damn, I need to make it down to AC before the shutdown ends. permalink award report block reply 2021Is1776 2 points 3 days ago went there once and hated it, people are rude which i get it thats the northern way. I am from the south so it caused a few tense standoffs. permalink parent award report block reply Greenblatts_4skin 2 points 3 days ago Richmond VA is at least 30% black permalink award report block reply NamendaBiden 2 points 3 days ago Rosie's? permalink award report block reply freebirdie 1 points 3 days ago The injun casinos in NorCal are almost all Asian. Asian employees, Asian dealers, Asian bartenders, and a ton of Asian degenerates glued to the slots. permalink award report block reply\nempiretc 60 points 3 days ago yep.  they could not sell their food stamps for cash to go gamble.  sounds right. permalink award report block reply BloodElfSupporter 44 points 3 days ago That’s so fucked up. And here I am working two jobs to support my elderly parents. Fuck permalink parent award report block reply tarballs 25 points 3 days ago You can ruthlessly abuse the system in any way possible, too, but, you have that whole pesky honor/decency thing preventing that permalink parent award report block reply BloodElfSupporter 16 points 3 days ago Well I’m Asian American and proud to say no other Asian Americans I know in my immediate circle abuse the welfare system. We all work hard and contribute to the society. permalink parent award report block reply Husky 5 points 3 days ago Sounds like a pesky honor/decency thing permalink parent award report block reply view 1 more comments... 2021Is1776 6 points 3 days ago In my best libtard voice- People shouldn't have to work lo live don't be such a capitalist. permalink parent award report block reply MR__K 3 points 3 days ago Just trying to feed my kids and pay rent. Fuckers are selling my kids and mine future's. To sell and cheat and gamble. This shit needs to stop. permalink parent award report block reply justicein2020 8 points 3 days ago Not just that. They now have to spend their own cash money on food instead of stamps covering it. Instead of pissing the cash away at the casino and stamps covering food. Couldn't you have a lot of fun if you knew your food costs were zero? permalink parent award report block reply empiretc 5 points 3 days ago Exactly that. permalink parent award report block reply 2021Is1776 6 points 3 days ago I think thats part of it but I think its more gov subsidizing their life style. permalink parent award report block reply schnazzmizzle 2 points 3 days ago If I didn't have to budget 1600 a month for food I'd have 1600 more disposable income.. permalink parent award report block reply empiretc 3 points 3 days ago not shit.  spend about $800 here on groceries only.   going out to eat or getting takeout is extra. permalink parent award report block reply\nBloodElfSupporter 44 points 3 days ago That’s so fucked up. And here I am working two jobs to support my elderly parents. Fuck permalink parent award report block reply tarballs 25 points 3 days ago You can ruthlessly abuse the system in any way possible, too, but, you have that whole pesky honor/decency thing preventing that permalink parent award report block reply BloodElfSupporter 16 points 3 days ago Well I’m Asian American and proud to say no other Asian Americans I know in my immediate circle abuse the welfare system. We all work hard and contribute to the society. permalink parent award report block reply Husky 5 points 3 days ago Sounds like a pesky honor/decency thing permalink parent award report block reply view 1 more comments... 2021Is1776 6 points 3 days ago In my best libtard voice- People shouldn't have to work lo live don't be such a capitalist. permalink parent award report block reply MR__K 3 points 3 days ago Just trying to feed my kids and pay rent. Fuckers are selling my kids and mine future's. To sell and cheat and gamble. This shit needs to stop. permalink parent award report block reply\ntarballs 25 points 3 days ago You can ruthlessly abuse the system in any way possible, too, but, you have that whole pesky honor/decency thing preventing that permalink parent award report block reply BloodElfSupporter 16 points 3 days ago Well I’m Asian American and proud to say no other Asian Americans I know in my immediate circle abuse the welfare system. We all work hard and contribute to the society. permalink parent award report block reply Husky 5 points 3 days ago Sounds like a pesky honor/decency thing permalink parent award report block reply view 1 more comments...\nBloodElfSupporter 16 points 3 days ago Well I’m Asian American and proud to say no other Asian Americans I know in my immediate circle abuse the welfare system. We all work hard and contribute to the society. permalink parent award report block reply Husky 5 points 3 days ago Sounds like a pesky honor/decency thing permalink parent award report block reply view 1 more comments...\nHusky 5 points 3 days ago Sounds like a pesky honor/decency thing permalink parent award report block reply view 1 more comments...\n2021Is1776 6 points 3 days ago In my best libtard voice- People shouldn't have to work lo live don't be such a capitalist. permalink parent award report block reply\nMR__K 3 points 3 days ago Just trying to feed my kids and pay rent. Fuckers are selling my kids and mine future's. To sell and cheat and gamble. This shit needs to stop. permalink parent award report block reply\njusticein2020 8 points 3 days ago Not just that. They now have to spend their own cash money on food instead of stamps covering it. Instead of pissing the cash away at the casino and stamps covering food. Couldn't you have a lot of fun if you knew your food costs were zero? permalink parent award report block reply empiretc 5 points 3 days ago Exactly that. permalink parent award report block reply\nempiretc 5 points 3 days ago Exactly that. permalink parent award report block reply\n2021Is1776 6 points 3 days ago I think thats part of it but I think its more gov subsidizing their life style. permalink parent award report block reply\nschnazzmizzle 2 points 3 days ago If I didn't have to budget 1600 a month for food I'd have 1600 more disposable income.. permalink parent award report block reply empiretc 3 points 3 days ago not shit.  spend about $800 here on groceries only.   going out to eat or getting takeout is extra. permalink parent award report block reply\nempiretc 3 points 3 days ago not shit.  spend about $800 here on groceries only.   going out to eat or getting takeout is extra. permalink parent award report block reply\nchinigga 27 points 3 days ago I was staying at the Bellagio last week.  It was 50% Arabs and 50% Whites at the tables.  I saw one group of Asians. Went to eat at The Steak House and only saw two Black people walking around at the 3rd world shithole that is Circus Circus. My Uber drivers all stated it was quiet in Vegas the entire past summer. permalink award report block reply 2021is1776-2 OP 24 points 3 days ago Vegas shot itself in the foot when it lowered prices in 2021. Videos of fights and shootings started coming out as ghetto trash flowed in from California. Vegas might have been expensive but it kept the worst of the trash out. Also casinos opened in damn near every state so that fucked em pretty hard too. permalink parent award report block reply imnotdeadyet 17 points 3 days ago That shit didn't happen when the mob ran Vegas.  You didn't commit a crime unless you were allowed too and got permission.  Street crime was minimal, because they pulled something and the mob would take care of them. permalink parent award report block reply Choomguy 13 points 3 days ago Fuck vegas.  Its right up there with the disney properties that are on my bucket list of places I’ll never visit… permalink parent award report block reply AndanteAndante 6 points 3 days ago And now they shot themselves in the head by raising the prices to unaffordable levels. permalink parent award report block reply The_Emperor 5 points 3 days ago That was COVID restrictions...ended foreign tourists...had to lure LA folks and gangs permalink parent award report block reply Kyro54111 5 points 3 days ago And online gaming. permalink parent award report block reply load 1 more comments... fluffykitten 8 points 3 days ago Used to go twice in the Fall/Winter every year..... I avoid it like the plague now because F1 ruins the entire Strip. Summer months are way too hot. The nickel & diming is wild. Comps are trash now. Paid parking on the Strip is stupid... you even have to pay it if you're staying on the property (except the Wynn/Encore, last I checked). permalink parent award report block reply dukeofdoorcounty 3 points 3 days ago Three months building the F1 track, and two months tearing it up.  Every year permalink parent award report block reply Stossels_stach 6 points 3 days ago I dont even stop in Vegas when i have to drive through the area. Flagstaff is more normal and less crime for travelers in cars permalink parent award report block reply\n2021is1776-2 OP 24 points 3 days ago Vegas shot itself in the foot when it lowered prices in 2021. Videos of fights and shootings started coming out as ghetto trash flowed in from California. Vegas might have been expensive but it kept the worst of the trash out. Also casinos opened in damn near every state so that fucked em pretty hard too. permalink parent award report block reply imnotdeadyet 17 points 3 days ago That shit didn't happen when the mob ran Vegas.  You didn't commit a crime unless you were allowed too and got permission.  Street crime was minimal, because they pulled something and the mob would take care of them. permalink parent award report block reply Choomguy 13 points 3 days ago Fuck vegas.  Its right up there with the disney properties that are on my bucket list of places I’ll never visit… permalink parent award report block reply AndanteAndante 6 points 3 days ago And now they shot themselves in the head by raising the prices to unaffordable levels. permalink parent award report block reply The_Emperor 5 points 3 days ago That was COVID restrictions...ended foreign tourists...had to lure LA folks and gangs permalink parent award report block reply Kyro54111 5 points 3 days ago And online gaming. permalink parent award report block reply load 1 more comments...\nimnotdeadyet 17 points 3 days ago That shit didn't happen when the mob ran Vegas.  You didn't commit a crime unless you were allowed too and got permission.  Street crime was minimal, because they pulled something and the mob would take care of them. permalink parent award report block reply\nChoomguy 13 points 3 days ago Fuck vegas.  Its right up there with the disney properties that are on my bucket list of places I’ll never visit… permalink parent award report block reply\nAndanteAndante 6 points 3 days ago And now they shot themselves in the head by raising the prices to unaffordable levels. permalink parent award report block reply\nThe_Emperor 5 points 3 days ago That was COVID restrictions...ended foreign tourists...had to lure LA folks and gangs permalink parent award report block reply\nKyro54111 5 points 3 days ago And online gaming. permalink parent award report block reply\nfluffykitten 8 points 3 days ago Used to go twice in the Fall/Winter every year..... I avoid it like the plague now because F1 ruins the entire Strip. Summer months are way too hot. The nickel & diming is wild. Comps are trash now. Paid parking on the Strip is stupid... you even have to pay it if you're staying on the property (except the Wynn/Encore, last I checked). permalink parent award report block reply dukeofdoorcounty 3 points 3 days ago Three months building the F1 track, and two months tearing it up.  Every year permalink parent award report block reply\ndukeofdoorcounty 3 points 3 days ago Three months building the F1 track, and two months tearing it up.  Every year permalink parent award report block reply\nStossels_stach 6 points 3 days ago I dont even stop in Vegas when i have to drive through the area. Flagstaff is more normal and less crime for travelers in cars permalink parent award report block reply\nGenWashington 19 points 3 days ago Keep on noticing - we have been paying for people to have luxury (what ever that means to you) - events, food etc. etc. I have noticed a huge change and now - more than ever you are going to see things turn around. Some items will be cheaper at the end of the day permalink award report block reply 2021is1776-2 OP 15 points 3 days ago Luxury is any non necessity spending. Cruises, gambling, theme parks etc etc. permalink parent award report block reply\n2021is1776-2 OP 15 points 3 days ago Luxury is any non necessity spending. Cruises, gambling, theme parks etc etc. permalink parent award report block reply\nOodles 9 points 3 days ago Exactly. The worst part about SNAP is not the criminal deadbeats it directly supports, but the much more numerous low-trust society organizations it supports indirectly permalink award report block reply\nSteve56775 8 points 3 days ago The grocery stores right now are awesome. Fully stocked shelves, clean, and no crowds or check out lines. All the employees are smiling and helpful. It’s like a different country or something. This is winning. permalink award report block reply\nRandoBudster 6 points 3 days ago Don't know the area but aren't their a lot of Fed workers there? They haven't been getting paid and huge numbers are black. permalink award report block reply 2021Is1776 5 points 3 days ago in Richmond? not really that would be the MGM in NOVA/Maryland permalink parent award report block reply\n2021Is1776 5 points 3 days ago in Richmond? not really that would be the MGM in NOVA/Maryland permalink parent award report block reply\nGnometard 5 points 3 days ago I love how the communists have folks on our side focusing race and making assumptions exactly like they do. It's almost like their revolution is working exactly as they want. I don't know about you folks, but I don't want to help the communists. I'm also not dumb enough to confuse mirroring someone as opposition to them. permalink award report block reply BoricuaPede -2 points 3 days ago This place has gone to hell, fren. permalink parent award report block reply tpactionchasethevote -3 points 3 days ago 👆 permalink parent award report block reply\nBoricuaPede -2 points 3 days ago This place has gone to hell, fren. permalink parent award report block reply\ntpactionchasethevote -3 points 3 days ago 👆 permalink parent award report block reply\nrivetjoint2 5 points 3 days ago You have a casino in Richmond?  Since when? permalink award report block reply zooty 10 points 3 days ago Since governments stopped having a moral imperative and tax money became everything. See also lotteries. permalink parent award report block reply Aggrieved03 10 points 3 days ago See also weed next to daycare. permalink parent award report block reply 2021Is1776 7 points 3 days ago Rosie's opened up maybe 3 years ago or so I think. Its a colonial downs property they built inside the old k-mart across from the strip club. The nicer one is in New Kent at the horse track. There's one opening in Petersburg but I expect it to fail due to the crime in that area. Rivers in Portsmouth is supposedly nice but its a drive to get there then you have the MGM in NOVA/ Maryland but its full of DC dwellers and they are fucking the worst. permalink parent award report block reply rivetjoint2 5 points 3 days ago Sounds nice LOL, a K-mart and a strip club.    I've been to the MGM, those of the best cloths that those PG county dwellers have for the big night out.   A friend of a friend is a high roller, he gets an escort and a casino private limo to and from, because the locals have been known to follow people home and roll them. permalink parent award report block reply 2021Is1776 3 points 3 days ago yeah I thought strippers made bank until we left the casino one night and there was a girl on the corner holding a sign begging for money, she was also the same girl they had on the sign as a one night event at the strip club. I think she was a former porn star or something I laughed my ass off. permalink parent award report block reply\nzooty 10 points 3 days ago Since governments stopped having a moral imperative and tax money became everything. See also lotteries. permalink parent award report block reply Aggrieved03 10 points 3 days ago See also weed next to daycare. permalink parent award report block reply\nAggrieved03 10 points 3 days ago See also weed next to daycare. permalink parent award report block reply\n2021Is1776 7 points 3 days ago Rosie's opened up maybe 3 years ago or so I think. Its a colonial downs property they built inside the old k-mart across from the strip club. The nicer one is in New Kent at the horse track. There's one opening in Petersburg but I expect it to fail due to the crime in that area. Rivers in Portsmouth is supposedly nice but its a drive to get there then you have the MGM in NOVA/ Maryland but its full of DC dwellers and they are fucking the worst. permalink parent award report block reply rivetjoint2 5 points 3 days ago Sounds nice LOL, a K-mart and a strip club.    I've been to the MGM, those of the best cloths that those PG county dwellers have for the big night out.   A friend of a friend is a high roller, he gets an escort and a casino private limo to and from, because the locals have been known to follow people home and roll them. permalink parent award report block reply 2021Is1776 3 points 3 days ago yeah I thought strippers made bank until we left the casino one night and there was a girl on the corner holding a sign begging for money, she was also the same girl they had on the sign as a one night event at the strip club. I think she was a former porn star or something I laughed my ass off. permalink parent award report block reply\nrivetjoint2 5 points 3 days ago Sounds nice LOL, a K-mart and a strip club.    I've been to the MGM, those of the best cloths that those PG county dwellers have for the big night out.   A friend of a friend is a high roller, he gets an escort and a casino private limo to and from, because the locals have been known to follow people home and roll them. permalink parent award report block reply 2021Is1776 3 points 3 days ago yeah I thought strippers made bank until we left the casino one night and there was a girl on the corner holding a sign begging for money, she was also the same girl they had on the sign as a one night event at the strip club. I think she was a former porn star or something I laughed my ass off. permalink parent award report block reply\n2021Is1776 3 points 3 days ago yeah I thought strippers made bank until we left the casino one night and there was a girl on the corner holding a sign begging for money, she was also the same girl they had on the sign as a one night event at the strip club. I think she was a former porn star or something I laughed my ass off. permalink parent award report block reply\nKennyKetchem 4 points 3 days ago This explains the government push for DEI hires and the constant shitting on of white people. Keep the EBT shut off forever and these companies would be on their knees kissing our feet for our money. permalink award report block reply\nsuckmycorona 4 points 3 days ago Just buying votes that’s all. permalink award report block reply\nRyan282 2 points 3 days ago Did you win anything? permalink award report block reply 2021Is1776 3 points 3 days ago i left 80 bucks up I dont really gamble But ill toss a 20 in while sitting with the wife. If they have tables I will play mostly for the social interaction. permalink parent award report block reply monkadelic 3 points 3 days ago I hit the full house on the flop sucker bet last night for 50 to 1 playing UTH.  I don't know about OP though. permalink parent award report block reply\n2021Is1776 3 points 3 days ago i left 80 bucks up I dont really gamble But ill toss a 20 in while sitting with the wife. If they have tables I will play mostly for the social interaction. permalink parent award report block reply\nmonkadelic 3 points 3 days ago I hit the full house on the flop sucker bet last night for 50 to 1 playing UTH.  I don't know about OP though. permalink parent award report block reply\nlul_cheto 2 points 3 days ago Whos going to pluck your eyebrows mr trump! permalink award report block reply\nAlexcoop1 2 points 3 days ago I had the same experience at a sit down restaurant last night. It was less packed on a Saturday night than it was on a weekday night a month ago. permalink award report block reply\nCrapachino 2 points 3 days ago Trump has now the mobsters pissed off... And the indians. permalink award report block reply\nnpc_1234 2 points 3 days ago Damn, I need to make it down to AC before the shutdown ends. permalink award report block reply 2021Is1776 2 points 3 days ago went there once and hated it, people are rude which i get it thats the northern way. I am from the south so it caused a few tense standoffs. permalink parent award report block reply\n2021Is1776 2 points 3 days ago went there once and hated it, people are rude which i get it thats the northern way. I am from the south so it caused a few tense standoffs. permalink parent award report block reply\nGreenblatts_4skin 2 points 3 days ago Richmond VA is at least 30% black permalink award report block reply\nNamendaBiden 2 points 3 days ago Rosie's? permalink award report block reply\nfreebirdie 1 points 3 days ago The injun casinos in NorCal are almost all Asian. Asian employees, Asian dealers, Asian bartenders, and a ton of Asian degenerates glued to the slots. permalink award report block reply"}