{"id": "1ARK9l7SuR", "contents": "246 NYC when JD Vance is elected president posted 1 day ago by Deportthemall23 15 comments award share download report block\n15 comments Sort by Top Top New Worst Old Save SHILL_DETECTOR 3 points 1 day ago kek permalink award report block reply Bullet3250 1 points 1 day ago top permalink parent award report block reply newestofnew 2 points 1 day ago JD is DOA unless he distances himself from a foreign preoccupation and the absurd economic policy encapsulated in 50 year loans. permalink award report block reply Deportthemall23 OP -3 points 1 day ago Gen z is retarded Gen z white bois will NEVER decide any elections permalink parent award report block reply newestofnew 3 points 1 day ago sure, that's why you're here permalink parent award report block reply Deportthemall23 OP -3 points 1 day ago I'm here to troll you 😂 White in general are already the minority of the population.. outnumbered by non-whites. Gen z is only one generation. And white bois only one part of that generation I know white bois are stupid but surely you can do the math? 😂😂 permalink parent award report block reply YouEssAye 1 points 1 day ago It's not just gen z, you're free to bury your head in the sand, but we're trying to tell you why the right is going to keep losing. Why would anyone vote for a Republican at this point, what have they done for us? That doesn't mean we'll vote for a leftist communist but that's exactly who's going to win when we stay home. permalink parent award report block reply view 4 more comments... you_know_GOAT 2 points 1 day ago Man this Meme has lasted so long. Does anybody know where she is now and how butthurt she is over being the REEeee face of the past many years? permalink award report block reply Aggrieved03 2 points 1 day ago Republicans are killing any chance of Vance every day. This administration was supposed to be our retribution but they've done little to nothing. permalink award report block reply Brandon1776 1 points 15 hours ago Not on my watch. JD ain't no different from trump permalink award report block reply\nSHILL_DETECTOR 3 points 1 day ago kek permalink award report block reply Bullet3250 1 points 1 day ago top permalink parent award report block reply\nBullet3250 1 points 1 day ago top permalink parent award report block reply\nnewestofnew 2 points 1 day ago JD is DOA unless he distances himself from a foreign preoccupation and the absurd economic policy encapsulated in 50 year loans. permalink award report block reply Deportthemall23 OP -3 points 1 day ago Gen z is retarded Gen z white bois will NEVER decide any elections permalink parent award report block reply newestofnew 3 points 1 day ago sure, that's why you're here permalink parent award report block reply Deportthemall23 OP -3 points 1 day ago I'm here to troll you 😂 White in general are already the minority of the population.. outnumbered by non-whites. Gen z is only one generation. And white bois only one part of that generation I know white bois are stupid but surely you can do the math? 😂😂 permalink parent award report block reply YouEssAye 1 points 1 day ago It's not just gen z, you're free to bury your head in the sand, but we're trying to tell you why the right is going to keep losing. Why would anyone vote for a Republican at this point, what have they done for us? That doesn't mean we'll vote for a leftist communist but that's exactly who's going to win when we stay home. permalink parent award report block reply view 4 more comments...\nDeportthemall23 OP -3 points 1 day ago Gen z is retarded Gen z white bois will NEVER decide any elections permalink parent award report block reply newestofnew 3 points 1 day ago sure, that's why you're here permalink parent award report block reply Deportthemall23 OP -3 points 1 day ago I'm here to troll you 😂 White in general are already the minority of the population.. outnumbered by non-whites. Gen z is only one generation. And white bois only one part of that generation I know white bois are stupid but surely you can do the math? 😂😂 permalink parent award report block reply YouEssAye 1 points 1 day ago It's not just gen z, you're free to bury your head in the sand, but we're trying to tell you why the right is going to keep losing. Why would anyone vote for a Republican at this point, what have they done for us? That doesn't mean we'll vote for a leftist communist but that's exactly who's going to win when we stay home. permalink parent award report block reply view 4 more comments...\nnewestofnew 3 points 1 day ago sure, that's why you're here permalink parent award report block reply Deportthemall23 OP -3 points 1 day ago I'm here to troll you 😂 White in general are already the minority of the population.. outnumbered by non-whites. Gen z is only one generation. And white bois only one part of that generation I know white bois are stupid but surely you can do the math? 😂😂 permalink parent award report block reply YouEssAye 1 points 1 day ago It's not just gen z, you're free to bury your head in the sand, but we're trying to tell you why the right is going to keep losing. Why would anyone vote for a Republican at this point, what have they done for us? That doesn't mean we'll vote for a leftist communist but that's exactly who's going to win when we stay home. permalink parent award report block reply view 4 more comments...\nDeportthemall23 OP -3 points 1 day ago I'm here to troll you 😂 White in general are already the minority of the population.. outnumbered by non-whites. Gen z is only one generation. And white bois only one part of that generation I know white bois are stupid but surely you can do the math? 😂😂 permalink parent award report block reply YouEssAye 1 points 1 day ago It's not just gen z, you're free to bury your head in the sand, but we're trying to tell you why the right is going to keep losing. Why would anyone vote for a Republican at this point, what have they done for us? That doesn't mean we'll vote for a leftist communist but that's exactly who's going to win when we stay home. permalink parent award report block reply view 4 more comments...\nYouEssAye 1 points 1 day ago It's not just gen z, you're free to bury your head in the sand, but we're trying to tell you why the right is going to keep losing. Why would anyone vote for a Republican at this point, what have they done for us? That doesn't mean we'll vote for a leftist communist but that's exactly who's going to win when we stay home. permalink parent award report block reply view 4 more comments...\nyou_know_GOAT 2 points 1 day ago Man this Meme has lasted so long. Does anybody know where she is now and how butthurt she is over being the REEeee face of the past many years? permalink award report block reply\nAggrieved03 2 points 1 day ago Republicans are killing any chance of Vance every day. This administration was supposed to be our retribution but they've done little to nothing. permalink award report block reply\nBrandon1776 1 points 15 hours ago Not on my watch. JD ain't no different from trump permalink award report block reply"}