{"id": "1ARK53JpC8", "contents": "318 Read \"Atlas Shrugged\", and mind your own fucking business, commie bastard. posted 6 days ago by KuzoKevin 55 comments award share report block Bernie Sanders @BernieSanders • 6d Musk, who spent $270 million to get Trump elected, is now in line to become a trillionaire. Meanwhile, 60% of our people are living paycheck to paycheck. Americans understand we're living in a rigged economy. Together, we can and must change that. CNN @CNN • 6d Tesla shareholders approve $1 trillion pay package for CEO Elon Musk\n55 comments Sort by Top Top New Worst Old Save Elon Walked Away – Now We Know Why Read More Ads by Ad.Style gillonba 14 points 6 days ago Don't subject yourself to that.  Ayn Rand is a terrible writer.  Like her ideas if you like, read the Cliff's notes, but her prose is terrible. permalink award report block reply magamagashii 15 points 6 days ago I liked Atlas Shrugged EXCEPT the radio speech which was just the same thing repeated again for 60 pages. permalink parent award report block reply user2827 9 points 6 days ago That segment was especially grueling, and serves as an example... he literally makes the same point said in multiple different ways through that speech, that speech could have been cut down to 10-15 pages and nothing would have been lost. permalink parent award report block reply tw0scoops 7 points 6 days ago Tbh. I got a few pages into his speech then skipped to the next chapter. I actually enjoyed the book otherwise. permalink parent award report block reply user2827 4 points 6 days ago I agree, the story is good. It's just hard to read through. Easily could have cut the book in half and not lost anything. permalink parent award report block reply AlmostFullyDilated 1 points 5 days ago Comment removed by community filter, pending further review. permalink parent award report block reply Valiazaner 3 points 6 days ago Ayn Rand had some good philosophical idea's but she really was a dreadful writer. Her characters are all so robotic. permalink parent award report block reply AlmostFullyDilated 1 points 5 days ago Comment removed by community filter, pending further review. permalink parent award report block reply uniformist 1 points 5 days ago This is John Galt speaking https://youtu.be/-UndgB3rqWc?si=peQbeQliXHV466Di permalink parent award report block reply CommanderOfCheese 8 points 6 days ago Her problem is that Atlas Shrugged is trying to be a manifesto with a story shoved into it. permalink parent award report block reply KuzoKevin OP 7 points 6 days ago I disagree.  She's no Dickens, but she's OK. permalink parent award report block reply Givesgunstogrannies 8 points 6 days ago I loved it, but I like The Fountainhead even more. permalink parent award report block reply KuzoKevin OP 5 points 6 days ago Agreed. permalink parent award report block reply user2827 6 points 6 days ago Atlas Shrugged was overall good, but holy crap was it slow, so slow.  It actually took me three tries before I was able to push through to the end. The book could easily have been half the length and you'd hardly miss anything...can't speak to the other books. permalink parent award report block reply Flubadub 5 points 6 days ago Anthem is a good book, way shorter than Atlas Shrugged and a much easier read. permalink parent award report block reply Givesgunstogrannies 4 points 6 days ago Great book!  Very short. permalink parent award report block reply Flubadub 3 points 6 days ago I think I read it in a day permalink parent award report block reply NomadicKrow2 2 points 5 days ago I love that we're the evil book burning Nazi cult to the left, but here we are discussing books. permalink parent award report block reply gillonba 1 points 2 days ago In Anthem the protagonist indulges in a lengthy monologue about how important it is for an individual to be able to choose his own name and then on the next page chooses a name for his girlfriend.  What could Ayn Rand mean by this? permalink parent award report block reply load 7 more comments... AstroLonghorn 13 points 6 days ago The shutdown, Trump, etc. have NOTHING to do with Teslas shareholders approving a trillion dollar pay package for Musk. But I get it, Democrat politics involves saying random shit to rile up your commie fanbase permalink award report block reply ChinchillaCapitalism 3 points 6 days ago They're trying to link Trump to the ultra rich to erode his populist cred and link him to frustrations over stagnant wages. By taking economic success from the GOP's playbook, they'll sweep the midterms like this year's vote. permalink parent award report block reply Patriot4TN 10 points 6 days ago So when are you going to empty out your bank account and turn over your multiple homes to \"we the people\"? Lead by example you fucking hypocrite. permalink award report block reply lifeisahologram 7 points 6 days ago Yeah and Elon is almost entirely responsible for the direction and performance of the company and deserves it. permalink award report block reply Patrick_Bateman 3 points 6 days ago I used both of my positions to vote for it. If he somehow actually hits all benchmarks, the stock price is estimated to increase in value by over 700% by the end of the year 2030. What logical reason would any investor have to object to that proposition? permalink parent award report block reply stylecouncilor 7 points 6 days ago He typed this from his beach house. permalink award report block reply perma-maga 4 points 6 days ago Sanders is a low IQ commie and moral degenerate who writes that women fantasize about being gang raped. https://www.motherjones.com/politics/2015/05/young-bernie-sanders-liberty-union-vermont/ permalink award report block reply Abovethefray 4 points 6 days ago Sure does worry about other people's money a lot, don't he? Also, it is hilarious Musk is getting a trillion dollars or whatever for selling battery powered cars to nerds. permalink award report block reply Protonboy 4 points 6 days ago Bernie got millions for his campaign. Why does one man get this much money??? permalink award report block reply Th3Cho0sing0ne 4 points 6 days ago Bernie jealous AF permalink award report block reply HanginChad 3 points 6 days ago A) Musk didn't steal it like politicians do B) Musk generates jobs and wealth including very high paying jobs, unlike politicians C) Because Musk has more, doesn't mean I have less. Or because he has more I somehow deserve more too. permalink award report block reply LaptopDied 2 points 6 days ago The Schmuck is right. This narrative must be seized. Singles night at the White House. Clubby Tik Tok videos. Sydney Sweeny. permalink award report block reply MAGA9428 2 points 6 days ago People don't understand how wealth works. Elon Musk doesn't have hundreds of billions of dollars just sitting in a bank somewhere. The reason he's worth all of that money is because he owns several businesses and his share of those companies amount to his net worth. So this idea that Elon Musk could just toss his money to people and solve world hunger is pure fantasy. permalink award report block reply Goozmania 2 points 6 days ago I know my position is not republican, but it shouldn't be feasible to become a trillionaire. It doesn't even make sense. I am curious what he intends to do with this wealth? Will he use it for good? evil? Self interest? Will he buy and free Reddit? or Habsro? Will he try to destroy MAGA? permalink award report block reply Dashmoomoo 1 points 5 days ago End the Federal Reserve. permalink parent award report block reply rumplestiltzkin2 2 points 6 days ago theres a tv mini series from the 80s that does the job permalink award report block reply Tacitus1963 2 points 6 days ago So says the professional grifter who has never really worked a day in his life.\nHe also ran for president several times so that he could keep the campaign $ from those stupid enough to contribute to his champagne socialist lifestyle  and then increase his real estate portfolio. permalink award report block reply onesummerdream 2 points 5 days ago “Together, we can and must change that.” So send me $50.00 or more and I’ll get right on that for you. permalink award report block reply Ndmand69 1 points 5 days ago Maybe he will make 4 trillion, I don’t fucking care.  Good for him!  Fuck you 3 house Bernie!!!  Communist bastard! permalink award report block reply uniformist 1 points 5 days ago Musk has achieve some very difficult financial targets to get that. permalink award report block reply Trump454748 1 points 5 days ago Bernie could easily give away one of his three houses, but I don’t think he will. permalink award report block reply BlackLabsMatter 1 points 5 days ago Yep.  Rigged.  Definitely rigged.  To fix it, let's start by doing some very simple things: Kick every last person who is not a citizen or of this country. Then, find and remove those who obtained citizenship fraudulently. End foreign work visas.  Completely. End other foreign visas that are not very short term tourism or business trip, ensure the validity of those visas 100% End immigration entirely.  We are full.  They are nearly universally a drag on everything. No government subsidies out bailouts.  To anyone.  For anything. End welfare.  It is not the job of government to act as a parent or babysitter.  Family, friends and community need to step up.  No free food, nofree housing, no free phones. End all foreign aid. Pass a budget funding only that portion of government thatis clearly delineated in the Constitution--as written in the context of when it was written.  No redefining words. Reign intyrannical activist judges. Replace them with literate citizens.  Words mean things and are clearly defined. Revoke all laws containing words that are not clearly defined.  This removes any and all ambiguity from law. End income tax.  That amendment was never legally ratified.  (Did that one up if you want to be really mad) End ambiguous regulatory tyranny.  End all rules and regulations not initiated and passed by congress, or at aside constitutionally to the executive branch. Any surplus federal governnemnt money must be distributed in equal amounts to all the citizens at the end of the year. Zero base budgets.  No automatic bloat. Representatives to be paid a small per diem, not a salary. Lock up or execute violent criminals.  Predatory behavior is inexcusable andneeds to bit be a burden on decent people. Let's start there.  That seems like a lot less rigged to me, and a system that won't crash because of sedition or treasonous actions by government representatives or officials. Mr. Sanders, the government--and people like you in it--are the problem. permalink award report block reply Psalm-118_24 1 points 5 days ago bernie sanders has done nothing his entire life but steal from the American taxpayer.  He needs to shut his commie pie hole. permalink award report block reply HockeyMom4Trump 1 points 5 days ago This cunt has several homes while some live in a tent! Give up your own shit Bernie. permalink award report block reply Belleoffreedom 1 points 6 days ago Elon Musk earned that money, and he has great plans for it.  He is a far greater benefactor to humanity than the genial, rich old commie. permalink award report block reply ConstitutionalRepub 1 points 5 days ago If the economy is rigged, the elections are rigged.  The snap and section 8 programs are rigged.  Immigration is rigged. The judicial system is rigged and so on. permalink award report block reply Eatinglue 1 points 6 days ago The rich don’t swim in their money like Scrooge mcduck. They invest it. That’s money that you and I can get for car loans or get a business loan. permalink award report block reply Covfefebrulee 1 points 6 days ago Yeah. permalink award report block reply AlmostFullyDilated 1 points 5 days ago Comment removed by community filter, pending further review. permalink award report block reply\ngillonba 14 points 6 days ago Don't subject yourself to that.  Ayn Rand is a terrible writer.  Like her ideas if you like, read the Cliff's notes, but her prose is terrible. permalink award report block reply magamagashii 15 points 6 days ago I liked Atlas Shrugged EXCEPT the radio speech which was just the same thing repeated again for 60 pages. permalink parent award report block reply user2827 9 points 6 days ago That segment was especially grueling, and serves as an example... he literally makes the same point said in multiple different ways through that speech, that speech could have been cut down to 10-15 pages and nothing would have been lost. permalink parent award report block reply tw0scoops 7 points 6 days ago Tbh. I got a few pages into his speech then skipped to the next chapter. I actually enjoyed the book otherwise. permalink parent award report block reply user2827 4 points 6 days ago I agree, the story is good. It's just hard to read through. Easily could have cut the book in half and not lost anything. permalink parent award report block reply AlmostFullyDilated 1 points 5 days ago Comment removed by community filter, pending further review. permalink parent award report block reply Valiazaner 3 points 6 days ago Ayn Rand had some good philosophical idea's but she really was a dreadful writer. Her characters are all so robotic. permalink parent award report block reply AlmostFullyDilated 1 points 5 days ago Comment removed by community filter, pending further review. permalink parent award report block reply uniformist 1 points 5 days ago This is John Galt speaking https://youtu.be/-UndgB3rqWc?si=peQbeQliXHV466Di permalink parent award report block reply CommanderOfCheese 8 points 6 days ago Her problem is that Atlas Shrugged is trying to be a manifesto with a story shoved into it. permalink parent award report block reply KuzoKevin OP 7 points 6 days ago I disagree.  She's no Dickens, but she's OK. permalink parent award report block reply Givesgunstogrannies 8 points 6 days ago I loved it, but I like The Fountainhead even more. permalink parent award report block reply KuzoKevin OP 5 points 6 days ago Agreed. permalink parent award report block reply user2827 6 points 6 days ago Atlas Shrugged was overall good, but holy crap was it slow, so slow.  It actually took me three tries before I was able to push through to the end. The book could easily have been half the length and you'd hardly miss anything...can't speak to the other books. permalink parent award report block reply Flubadub 5 points 6 days ago Anthem is a good book, way shorter than Atlas Shrugged and a much easier read. permalink parent award report block reply Givesgunstogrannies 4 points 6 days ago Great book!  Very short. permalink parent award report block reply Flubadub 3 points 6 days ago I think I read it in a day permalink parent award report block reply NomadicKrow2 2 points 5 days ago I love that we're the evil book burning Nazi cult to the left, but here we are discussing books. permalink parent award report block reply gillonba 1 points 2 days ago In Anthem the protagonist indulges in a lengthy monologue about how important it is for an individual to be able to choose his own name and then on the next page chooses a name for his girlfriend.  What could Ayn Rand mean by this? permalink parent award report block reply load 7 more comments...\nmagamagashii 15 points 6 days ago I liked Atlas Shrugged EXCEPT the radio speech which was just the same thing repeated again for 60 pages. permalink parent award report block reply user2827 9 points 6 days ago That segment was especially grueling, and serves as an example... he literally makes the same point said in multiple different ways through that speech, that speech could have been cut down to 10-15 pages and nothing would have been lost. permalink parent award report block reply tw0scoops 7 points 6 days ago Tbh. I got a few pages into his speech then skipped to the next chapter. I actually enjoyed the book otherwise. permalink parent award report block reply user2827 4 points 6 days ago I agree, the story is good. It's just hard to read through. Easily could have cut the book in half and not lost anything. permalink parent award report block reply AlmostFullyDilated 1 points 5 days ago Comment removed by community filter, pending further review. permalink parent award report block reply Valiazaner 3 points 6 days ago Ayn Rand had some good philosophical idea's but she really was a dreadful writer. Her characters are all so robotic. permalink parent award report block reply AlmostFullyDilated 1 points 5 days ago Comment removed by community filter, pending further review. permalink parent award report block reply uniformist 1 points 5 days ago This is John Galt speaking https://youtu.be/-UndgB3rqWc?si=peQbeQliXHV466Di permalink parent award report block reply\nuser2827 9 points 6 days ago That segment was especially grueling, and serves as an example... he literally makes the same point said in multiple different ways through that speech, that speech could have been cut down to 10-15 pages and nothing would have been lost. permalink parent award report block reply tw0scoops 7 points 6 days ago Tbh. I got a few pages into his speech then skipped to the next chapter. I actually enjoyed the book otherwise. permalink parent award report block reply user2827 4 points 6 days ago I agree, the story is good. It's just hard to read through. Easily could have cut the book in half and not lost anything. permalink parent award report block reply AlmostFullyDilated 1 points 5 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\ntw0scoops 7 points 6 days ago Tbh. I got a few pages into his speech then skipped to the next chapter. I actually enjoyed the book otherwise. permalink parent award report block reply user2827 4 points 6 days ago I agree, the story is good. It's just hard to read through. Easily could have cut the book in half and not lost anything. permalink parent award report block reply AlmostFullyDilated 1 points 5 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nuser2827 4 points 6 days ago I agree, the story is good. It's just hard to read through. Easily could have cut the book in half and not lost anything. permalink parent award report block reply\nAlmostFullyDilated 1 points 5 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nValiazaner 3 points 6 days ago Ayn Rand had some good philosophical idea's but she really was a dreadful writer. Her characters are all so robotic. permalink parent award report block reply AlmostFullyDilated 1 points 5 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nAlmostFullyDilated 1 points 5 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nuniformist 1 points 5 days ago This is John Galt speaking https://youtu.be/-UndgB3rqWc?si=peQbeQliXHV466Di permalink parent award report block reply\nCommanderOfCheese 8 points 6 days ago Her problem is that Atlas Shrugged is trying to be a manifesto with a story shoved into it. permalink parent award report block reply\nKuzoKevin OP 7 points 6 days ago I disagree.  She's no Dickens, but she's OK. permalink parent award report block reply Givesgunstogrannies 8 points 6 days ago I loved it, but I like The Fountainhead even more. permalink parent award report block reply KuzoKevin OP 5 points 6 days ago Agreed. permalink parent award report block reply\nGivesgunstogrannies 8 points 6 days ago I loved it, but I like The Fountainhead even more. permalink parent award report block reply KuzoKevin OP 5 points 6 days ago Agreed. permalink parent award report block reply\nKuzoKevin OP 5 points 6 days ago Agreed. permalink parent award report block reply\nuser2827 6 points 6 days ago Atlas Shrugged was overall good, but holy crap was it slow, so slow.  It actually took me three tries before I was able to push through to the end. The book could easily have been half the length and you'd hardly miss anything...can't speak to the other books. permalink parent award report block reply\nFlubadub 5 points 6 days ago Anthem is a good book, way shorter than Atlas Shrugged and a much easier read. permalink parent award report block reply Givesgunstogrannies 4 points 6 days ago Great book!  Very short. permalink parent award report block reply Flubadub 3 points 6 days ago I think I read it in a day permalink parent award report block reply NomadicKrow2 2 points 5 days ago I love that we're the evil book burning Nazi cult to the left, but here we are discussing books. permalink parent award report block reply gillonba 1 points 2 days ago In Anthem the protagonist indulges in a lengthy monologue about how important it is for an individual to be able to choose his own name and then on the next page chooses a name for his girlfriend.  What could Ayn Rand mean by this? permalink parent award report block reply\nGivesgunstogrannies 4 points 6 days ago Great book!  Very short. permalink parent award report block reply Flubadub 3 points 6 days ago I think I read it in a day permalink parent award report block reply\nFlubadub 3 points 6 days ago I think I read it in a day permalink parent award report block reply\nNomadicKrow2 2 points 5 days ago I love that we're the evil book burning Nazi cult to the left, but here we are discussing books. permalink parent award report block reply\ngillonba 1 points 2 days ago In Anthem the protagonist indulges in a lengthy monologue about how important it is for an individual to be able to choose his own name and then on the next page chooses a name for his girlfriend.  What could Ayn Rand mean by this? permalink parent award report block reply\nAstroLonghorn 13 points 6 days ago The shutdown, Trump, etc. have NOTHING to do with Teslas shareholders approving a trillion dollar pay package for Musk. But I get it, Democrat politics involves saying random shit to rile up your commie fanbase permalink award report block reply ChinchillaCapitalism 3 points 6 days ago They're trying to link Trump to the ultra rich to erode his populist cred and link him to frustrations over stagnant wages. By taking economic success from the GOP's playbook, they'll sweep the midterms like this year's vote. permalink parent award report block reply\nChinchillaCapitalism 3 points 6 days ago They're trying to link Trump to the ultra rich to erode his populist cred and link him to frustrations over stagnant wages. By taking economic success from the GOP's playbook, they'll sweep the midterms like this year's vote. permalink parent award report block reply\nPatriot4TN 10 points 6 days ago So when are you going to empty out your bank account and turn over your multiple homes to \"we the people\"? Lead by example you fucking hypocrite. permalink award report block reply\nlifeisahologram 7 points 6 days ago Yeah and Elon is almost entirely responsible for the direction and performance of the company and deserves it. permalink award report block reply Patrick_Bateman 3 points 6 days ago I used both of my positions to vote for it. If he somehow actually hits all benchmarks, the stock price is estimated to increase in value by over 700% by the end of the year 2030. What logical reason would any investor have to object to that proposition? permalink parent award report block reply\nPatrick_Bateman 3 points 6 days ago I used both of my positions to vote for it. If he somehow actually hits all benchmarks, the stock price is estimated to increase in value by over 700% by the end of the year 2030. What logical reason would any investor have to object to that proposition? permalink parent award report block reply\nstylecouncilor 7 points 6 days ago He typed this from his beach house. permalink award report block reply\nperma-maga 4 points 6 days ago Sanders is a low IQ commie and moral degenerate who writes that women fantasize about being gang raped. https://www.motherjones.com/politics/2015/05/young-bernie-sanders-liberty-union-vermont/ permalink award report block reply\nAbovethefray 4 points 6 days ago Sure does worry about other people's money a lot, don't he? Also, it is hilarious Musk is getting a trillion dollars or whatever for selling battery powered cars to nerds. permalink award report block reply\nProtonboy 4 points 6 days ago Bernie got millions for his campaign. Why does one man get this much money??? permalink award report block reply\nTh3Cho0sing0ne 4 points 6 days ago Bernie jealous AF permalink award report block reply\nHanginChad 3 points 6 days ago A) Musk didn't steal it like politicians do B) Musk generates jobs and wealth including very high paying jobs, unlike politicians C) Because Musk has more, doesn't mean I have less. Or because he has more I somehow deserve more too. permalink award report block reply\nLaptopDied 2 points 6 days ago The Schmuck is right. This narrative must be seized. Singles night at the White House. Clubby Tik Tok videos. Sydney Sweeny. permalink award report block reply\nMAGA9428 2 points 6 days ago People don't understand how wealth works. Elon Musk doesn't have hundreds of billions of dollars just sitting in a bank somewhere. The reason he's worth all of that money is because he owns several businesses and his share of those companies amount to his net worth. So this idea that Elon Musk could just toss his money to people and solve world hunger is pure fantasy. permalink award report block reply\nGoozmania 2 points 6 days ago I know my position is not republican, but it shouldn't be feasible to become a trillionaire. It doesn't even make sense. I am curious what he intends to do with this wealth? Will he use it for good? evil? Self interest? Will he buy and free Reddit? or Habsro? Will he try to destroy MAGA? permalink award report block reply Dashmoomoo 1 points 5 days ago End the Federal Reserve. permalink parent award report block reply\nDashmoomoo 1 points 5 days ago End the Federal Reserve. permalink parent award report block reply\nrumplestiltzkin2 2 points 6 days ago theres a tv mini series from the 80s that does the job permalink award report block reply\nTacitus1963 2 points 6 days ago So says the professional grifter who has never really worked a day in his life.\nHe also ran for president several times so that he could keep the campaign $ from those stupid enough to contribute to his champagne socialist lifestyle  and then increase his real estate portfolio. permalink award report block reply\nonesummerdream 2 points 5 days ago “Together, we can and must change that.” So send me $50.00 or more and I’ll get right on that for you. permalink award report block reply\nNdmand69 1 points 5 days ago Maybe he will make 4 trillion, I don’t fucking care.  Good for him!  Fuck you 3 house Bernie!!!  Communist bastard! permalink award report block reply\nuniformist 1 points 5 days ago Musk has achieve some very difficult financial targets to get that. permalink award report block reply\nTrump454748 1 points 5 days ago Bernie could easily give away one of his three houses, but I don’t think he will. permalink award report block reply\nBlackLabsMatter 1 points 5 days ago Yep.  Rigged.  Definitely rigged.  To fix it, let's start by doing some very simple things: Kick every last person who is not a citizen or of this country. Then, find and remove those who obtained citizenship fraudulently. End foreign work visas.  Completely. End other foreign visas that are not very short term tourism or business trip, ensure the validity of those visas 100% End immigration entirely.  We are full.  They are nearly universally a drag on everything. No government subsidies out bailouts.  To anyone.  For anything. End welfare.  It is not the job of government to act as a parent or babysitter.  Family, friends and community need to step up.  No free food, nofree housing, no free phones. End all foreign aid. Pass a budget funding only that portion of government thatis clearly delineated in the Constitution--as written in the context of when it was written.  No redefining words. Reign intyrannical activist judges. Replace them with literate citizens.  Words mean things and are clearly defined. Revoke all laws containing words that are not clearly defined.  This removes any and all ambiguity from law. End income tax.  That amendment was never legally ratified.  (Did that one up if you want to be really mad) End ambiguous regulatory tyranny.  End all rules and regulations not initiated and passed by congress, or at aside constitutionally to the executive branch. Any surplus federal governnemnt money must be distributed in equal amounts to all the citizens at the end of the year. Zero base budgets.  No automatic bloat. Representatives to be paid a small per diem, not a salary. Lock up or execute violent criminals.  Predatory behavior is inexcusable andneeds to bit be a burden on decent people. Let's start there.  That seems like a lot less rigged to me, and a system that won't crash because of sedition or treasonous actions by government representatives or officials. Mr. Sanders, the government--and people like you in it--are the problem. permalink award report block reply\nPsalm-118_24 1 points 5 days ago bernie sanders has done nothing his entire life but steal from the American taxpayer.  He needs to shut his commie pie hole. permalink award report block reply\nHockeyMom4Trump 1 points 5 days ago This cunt has several homes while some live in a tent! Give up your own shit Bernie. permalink award report block reply\nBelleoffreedom 1 points 6 days ago Elon Musk earned that money, and he has great plans for it.  He is a far greater benefactor to humanity than the genial, rich old commie. permalink award report block reply\nConstitutionalRepub 1 points 5 days ago If the economy is rigged, the elections are rigged.  The snap and section 8 programs are rigged.  Immigration is rigged. The judicial system is rigged and so on. permalink award report block reply\nEatinglue 1 points 6 days ago The rich don’t swim in their money like Scrooge mcduck. They invest it. That’s money that you and I can get for car loans or get a business loan. permalink award report block reply\nCovfefebrulee 1 points 6 days ago Yeah. permalink award report block reply\nAlmostFullyDilated 1 points 5 days ago Comment removed by community filter, pending further review. permalink award report block reply"}