{"id": "1ARK0Ub4vQ", "contents": "446 Turning Point Action endorsed candidate Dorean Taylor defeats Rino activist Julie Spilsbury (who endorsed Kamala) in Arizona for a rare recall election! Congrats to Conservatives in Mesa for a hard fought victory. posted 7 days ago by Mr_Rightside 9 comments award share download report block\n9 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style Nomad899 3 points 7 days ago Julie “CONservative” permalink award report block reply Mr_Rightside OP 3 points 7 days ago https://x.com/TPAction_/status/1986187877953515808 permalink award report block reply Awakened 3 points 7 days ago I could tell which side they were on by their smile. permalink award report block reply Nomad899 1 points 7 days ago Squinty eyes too permalink parent award report block reply Awakened 1 points 6 days ago Yep, that represents actual joy. When you smile with just your lips and not your eyes you just look fake and/or nuts. permalink parent award report block reply Burisma 2 points 7 days ago What a dumb bitch. \"Conservatives for harris\" permalink award report block reply eugenehkrabs 1 points 7 days ago Taylor earned it.  Her team was very busy. Spilsbury was awful. permalink award report block reply UltraMagaWA -2 points 7 days ago TPA is and has been used as a money laundering machine. Kirk started digging and wanted an audit, he found ties to the Jews. Then ded permalink award report block reply UltraMagaWA 1 points 6 days ago Look two Jews down voted lmao permalink parent award report block reply\nNomad899 3 points 7 days ago Julie “CONservative” permalink award report block reply\nMr_Rightside OP 3 points 7 days ago https://x.com/TPAction_/status/1986187877953515808 permalink award report block reply\nAwakened 3 points 7 days ago I could tell which side they were on by their smile. permalink award report block reply Nomad899 1 points 7 days ago Squinty eyes too permalink parent award report block reply Awakened 1 points 6 days ago Yep, that represents actual joy. When you smile with just your lips and not your eyes you just look fake and/or nuts. permalink parent award report block reply\nNomad899 1 points 7 days ago Squinty eyes too permalink parent award report block reply Awakened 1 points 6 days ago Yep, that represents actual joy. When you smile with just your lips and not your eyes you just look fake and/or nuts. permalink parent award report block reply\nAwakened 1 points 6 days ago Yep, that represents actual joy. When you smile with just your lips and not your eyes you just look fake and/or nuts. permalink parent award report block reply\nBurisma 2 points 7 days ago What a dumb bitch. \"Conservatives for harris\" permalink award report block reply\neugenehkrabs 1 points 7 days ago Taylor earned it.  Her team was very busy. Spilsbury was awful. permalink award report block reply\nUltraMagaWA -2 points 7 days ago TPA is and has been used as a money laundering machine. Kirk started digging and wanted an audit, he found ties to the Jews. Then ded permalink award report block reply UltraMagaWA 1 points 6 days ago Look two Jews down voted lmao permalink parent award report block reply\nUltraMagaWA 1 points 6 days ago Look two Jews down voted lmao permalink parent award report block reply"}