{"id": "1ARK9iqfjf", "contents": "326 2 Boxes of 2,000+ uncounted ballots found in Maricopa County, Arizona. posted 2 days ago by rdvs34283 11 comments award share report block Publius @OcrazioCornPop • 4d 🚨 BREAKING: 2 Boxes of at least 2,000 uncounted ballots found in Maricopa County, Arizona. HOW IS THIS POSSIBLE?\n11 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style Counterwhat 11 points 2 days ago That's odd. It almost never happens. permalink award report block reply clownworld30330 2 points 2 days ago It only happens in the rare cases of close elections. Nothing to worry about. permalink parent award report block reply TiggerLovingPooh 8 points 2 days ago \"been secured the whole time\"... says who? permalink award report block reply SBOJ_JOBS 5 points 2 days ago Two boxes FOUND. --- Homer Simpson, probably permalink award report block reply clownworld30330 3 points 2 days ago SO FAR permalink parent award report block reply redinmn 4 points 2 days ago Simple enough.  When the fix is in, nobody bothers to pay attention to whats happening with the real ballots. permalink award report block reply CaptainForehead 4 points 2 days ago When you create the count, do you even need ballots? permalink award report block reply Standingoak 3 points 2 days ago Don't want more votes than voters. permalink parent award report block reply clownworld30330 2 points 2 days ago Yes: to humiliate us. permalink parent award report block reply patrioticwinning3 3 points 2 days ago Let me guess, all for Republicans :p permalink award report block reply ohwell316 3 points 2 days ago How many weren't  found is the question permalink award report block reply\nCounterwhat 11 points 2 days ago That's odd. It almost never happens. permalink award report block reply clownworld30330 2 points 2 days ago It only happens in the rare cases of close elections. Nothing to worry about. permalink parent award report block reply\nclownworld30330 2 points 2 days ago It only happens in the rare cases of close elections. Nothing to worry about. permalink parent award report block reply\nTiggerLovingPooh 8 points 2 days ago \"been secured the whole time\"... says who? permalink award report block reply\nSBOJ_JOBS 5 points 2 days ago Two boxes FOUND. --- Homer Simpson, probably permalink award report block reply clownworld30330 3 points 2 days ago SO FAR permalink parent award report block reply\nclownworld30330 3 points 2 days ago SO FAR permalink parent award report block reply\nredinmn 4 points 2 days ago Simple enough.  When the fix is in, nobody bothers to pay attention to whats happening with the real ballots. permalink award report block reply\nCaptainForehead 4 points 2 days ago When you create the count, do you even need ballots? permalink award report block reply Standingoak 3 points 2 days ago Don't want more votes than voters. permalink parent award report block reply clownworld30330 2 points 2 days ago Yes: to humiliate us. permalink parent award report block reply\nStandingoak 3 points 2 days ago Don't want more votes than voters. permalink parent award report block reply\nclownworld30330 2 points 2 days ago Yes: to humiliate us. permalink parent award report block reply\npatrioticwinning3 3 points 2 days ago Let me guess, all for Republicans :p permalink award report block reply\nohwell316 3 points 2 days ago How many weren't  found is the question permalink award report block reply"}