{"id": "1ARK52CXCf", "contents": "783 🔴Supreme Court deals a major blow to LGBTQ madness by kicking transgenderism off the U.S. passport, a win for Donald Trump. Male, female. That’s it, folks. 2 posted 6 days ago by DeusVult1096 18 comments award share report block Eric Daugherty @EricLDaugh • 6d 🚨 JUST NOW: Supreme Court deals a major blow to LGBTQ madness by kicking transgenderism off the U.S. passport, a win for Donald Trump. Male, female. That’s it, folks. 2\n18 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Nutt_bugget 18 points 6 days ago This is a win, man.\nFor ages, up until about 20 minutes ago, the question only had those two answers: Male or Female Anything else is a psychosis.  You want to pretend, that's fine, I don't have to buy into that nonsense. permalink award report block reply STONKATRUCK 8 points 6 days ago Wake me up when all the illegals and h1B are gone permalink award report block reply Ligersrule1 1 points 6 days ago Sweet dreams! permalink parent award report block reply AwShitHereWeGoAgain 7 points 6 days ago I wish the 41% number was higher. permalink award report block reply 45fan 5 points 6 days ago The troon ship has set sail and left these fags on reality island. Just wait, we'll see this issue correct itself in time. permalink parent award report block reply DlanOdcammron 3 points 6 days ago And they’ll need to get a corrected passport if they ever want to come back. 🤣 permalink parent award report block reply ThisTrainHasNoBrakes 2 points 6 days ago 59% are creeps who want to invade women’s spaces. Or more. permalink parent award report block reply Megaboom2025 2 points 6 days ago It will be when people start ridiculing them instead of coddling them permalink parent award report block reply Goozmania 5 points 6 days ago Thanks for the low hanging fruit, SCOTUS... You can now terminate the president's actual important powers he's using to keep this country afloat. Oh and it's temporary lol. permalink award report block reply deleted 2 points 6 days ago Michalusmichalus 1 points 6 days ago They regularly change birth certificates. In 500 years historians are going to look at a birth certificate with two fathers, or two mothers, and just assume they're forged  because no one could possibly be that stupid. permalink parent award report block reply snoozeflu 1 points 6 days ago Good. Now reclassify transgenderism as a mental illness in the DSM-V. permalink award report block reply Darkheartisland 1 points 6 days ago imagine spending years in law to argue this permalink award report block reply GoGoGadgetGringo 1 points 6 days ago They them is going to be really mad about this permalink award report block reply imnotdeadyet 1 points 6 days ago Fuck/Them permalink parent award report block reply PatGarrett 1 points 6 days ago It’s been funny going through annual benefit enrollment at work because the verbiage in the health plans (UHC) very explicitly states ‘men’ when describing prostate exams, etc. and ‘women’ when describing mammograms, birth, etc. We had a meeting with a rep from UHC and she was using that [scientifically correct] language and I couldn’t help but giggle every time knowing there were raging libtards on the call probably on the verge of suicide because of it. permalink award report block reply fazaman 1 points 5 days ago The next Democrat will just reverse this. We need this shit codified in law. At least then it's harder to undo. Though, knowing the left, it probably already is in law, and they were just ignoring it. permalink award report block reply\nNutt_bugget 18 points 6 days ago This is a win, man.\nFor ages, up until about 20 minutes ago, the question only had those two answers: Male or Female Anything else is a psychosis.  You want to pretend, that's fine, I don't have to buy into that nonsense. permalink award report block reply\nSTONKATRUCK 8 points 6 days ago Wake me up when all the illegals and h1B are gone permalink award report block reply Ligersrule1 1 points 6 days ago Sweet dreams! permalink parent award report block reply\nLigersrule1 1 points 6 days ago Sweet dreams! permalink parent award report block reply\nAwShitHereWeGoAgain 7 points 6 days ago I wish the 41% number was higher. permalink award report block reply 45fan 5 points 6 days ago The troon ship has set sail and left these fags on reality island. Just wait, we'll see this issue correct itself in time. permalink parent award report block reply DlanOdcammron 3 points 6 days ago And they’ll need to get a corrected passport if they ever want to come back. 🤣 permalink parent award report block reply ThisTrainHasNoBrakes 2 points 6 days ago 59% are creeps who want to invade women’s spaces. Or more. permalink parent award report block reply Megaboom2025 2 points 6 days ago It will be when people start ridiculing them instead of coddling them permalink parent award report block reply\n45fan 5 points 6 days ago The troon ship has set sail and left these fags on reality island. Just wait, we'll see this issue correct itself in time. permalink parent award report block reply DlanOdcammron 3 points 6 days ago And they’ll need to get a corrected passport if they ever want to come back. 🤣 permalink parent award report block reply\nDlanOdcammron 3 points 6 days ago And they’ll need to get a corrected passport if they ever want to come back. 🤣 permalink parent award report block reply\nThisTrainHasNoBrakes 2 points 6 days ago 59% are creeps who want to invade women’s spaces. Or more. permalink parent award report block reply\nMegaboom2025 2 points 6 days ago It will be when people start ridiculing them instead of coddling them permalink parent award report block reply\nGoozmania 5 points 6 days ago Thanks for the low hanging fruit, SCOTUS... You can now terminate the president's actual important powers he's using to keep this country afloat. Oh and it's temporary lol. permalink award report block reply\ndeleted 2 points 6 days ago Michalusmichalus 1 points 6 days ago They regularly change birth certificates. In 500 years historians are going to look at a birth certificate with two fathers, or two mothers, and just assume they're forged  because no one could possibly be that stupid. permalink parent award report block reply\nMichalusmichalus 1 points 6 days ago They regularly change birth certificates. In 500 years historians are going to look at a birth certificate with two fathers, or two mothers, and just assume they're forged  because no one could possibly be that stupid. permalink parent award report block reply\nsnoozeflu 1 points 6 days ago Good. Now reclassify transgenderism as a mental illness in the DSM-V. permalink award report block reply\nDarkheartisland 1 points 6 days ago imagine spending years in law to argue this permalink award report block reply\nGoGoGadgetGringo 1 points 6 days ago They them is going to be really mad about this permalink award report block reply imnotdeadyet 1 points 6 days ago Fuck/Them permalink parent award report block reply\nimnotdeadyet 1 points 6 days ago Fuck/Them permalink parent award report block reply\nPatGarrett 1 points 6 days ago It’s been funny going through annual benefit enrollment at work because the verbiage in the health plans (UHC) very explicitly states ‘men’ when describing prostate exams, etc. and ‘women’ when describing mammograms, birth, etc. We had a meeting with a rep from UHC and she was using that [scientifically correct] language and I couldn’t help but giggle every time knowing there were raging libtards on the call probably on the verge of suicide because of it. permalink award report block reply\nfazaman 1 points 5 days ago The next Democrat will just reverse this. We need this shit codified in law. At least then it's harder to undo. Though, knowing the left, it probably already is in law, and they were just ignoring it. permalink award report block reply"}