{"id": "1ARK9hiHLi", "contents": "317 About those tins of Christmas Butter Cookies ... posted 2 days ago by rdvs34283 52 comments award share report block Rare, Exquisite, Alabaster @whois_John_Galt • 3d Guys. I have some bad news about the tins of Christmas butter cookies.\n52 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno MickHigan2 47 points 2 days ago I find it utterly hilarious that the indians of PDW always get mad at all the disgusting india videos. permalink award report block reply South_Florida_Guy 26 points 2 days ago Just by holding up a mirror to them permalink parent award report block reply magnokor 42 points 2 days ago The local store had some in the catalog, said they were Danish. Saw this, went and had a look, magnified the box picture, Made In China. Just had a look at ALDI, their Danish style Christmas Cookies are made in, maybe a surprise, in Denmark. permalink award report block reply God-is-good 13 points 2 days ago Gotta check every label these days.I ran into one last year that was an unexpected knock off. permalink parent award report block reply 26magarat 5 points 2 days ago Maybe it's like Danish pastries? permalink parent award report block reply Oback_Barama 5 points 2 days ago I’d trust ALDI before Walmart. permalink parent award report block reply Darkpoisonousshaddow 17 points 2 days ago Ooh saar I'm not dirty bastards, I'm just not clean bastards! permalink award report block reply Taliesin 6 points 2 days ago And I do the needful and swat away the rats, saar! permalink parent award report block reply MAGABOND 4 points 2 days ago We are respectable bastards. permalink parent award report block reply HOSEQ 2 points 2 days ago Yusd dond you dell me wad do do, bloody bastard you.... permalink parent award report block reply Trump454748 17 points 2 days ago We have laws in America that prohibit this but we can just import from overseas like that?.🤮 permalink award report block reply Prandogolio 15 points 2 days ago Stop being so fucking gullible.  There's zero evidence that this video has anything to do with those cookies. permalink parent award report block reply N0rds 9 points 2 days ago Yeah the jump cut to the store makes me think it wasn't even what the pajeets were baking permalink parent award report block reply learntocode 4 points 2 days ago They were making indian sweets. The jump cut is deceptive. permalink parent award report block reply Taliesin 4 points 2 days ago The tin says 'made in India.' It does not necessarily mean that these were the particular brand of cookies being made, but between street-shitting, asswiping with bare hands, and swatting rats off food being prepared, India definitely has a hygiene problem. permalink parent award report block reply Hantif 10 points 2 days ago Always check country of origin. Never buy food from India, China, or anywhere else you wouldn't eat from a street vendor. permalink award report block reply DrVSGGEOTUSPhD 7 points 2 days ago This song GOES HARD permalink award report block reply Taliesin 1 points 2 days ago Yes, indeed saar! permalink parent award report block reply Quidnunc 7 points 2 days ago Bake your own cookies. Unless you really like the taste of partially hydrogenated soy and all the alphabet chemicals to keep it from molding for a year or more. permalink award report block reply gillonba 1 points 2 days ago This is the correct answer.  Cookies made in the US and Europe are still trash, just a different sort of trash.  Any (unsealed) baked good that can sit on a shelf for weeks or even months without going bad should probably not be eaten permalink parent award report block reply Oldman1234 6 points 2 days ago Oh no!  I just bought one of those tins!  Is this real? permalink award report block reply Darkpoisonousshaddow 23 points 2 days ago Stay away from the chocolate chips permalink parent award report block reply Oldman1234 8 points 2 days ago Excellent advice. Thanks! permalink parent award report block reply Prandogolio 6 points 2 days ago Well there's absolutely no evidence presented in this video that it has anything to do with those cookies. Why don't you practice being a mega ultra genius super detective and look on the side of the cookie tin you just bought and read where they were made? permalink parent award report block reply Oldman1234 5 points 2 days ago The issue for me isn't really WHERE they're made but HOW they're made (as shown in the video). permalink parent award report block reply Litecola2 6 points 2 days ago If you are buying foods made in India you get what you deserve permalink parent award report block reply Prandogolio -1 points 2 days ago But what makes you think they're being made the way they're making them in the video?  They're made in a factory.  Calm down you gullible doofus. permalink parent award report block reply Littleirishmaid 5 points 2 days ago I could not read the back.  Where does it say they were made? permalink parent award report block reply Darkpoisonousshaddow 8 points 2 days ago India permalink parent award report block reply ChyNahAzzWhole1 6 points 2 days ago Watching on my phone I can magnify the screenshot. In d ia permalink parent award report block reply corntortilla 1 points 2 days ago Of course not. permalink parent award report block reply Kendoextendo 5 points 2 days ago All I ever find in those tins is sewing supplies. Now I'm thinking granny was just looking out for me. permalink award report block reply PepesJusticeBoner 4 points 2 days ago We have a local grandmother who bakes delicious cookies. The money she makes helps her keep up with inflation despite being on a fixed income. Hopefully every pede can find a local grandmother or struggling mom and buy cookies from them instead of disgusting store bought imported garbage cookies. permalink award report block reply Valiazaner 3 points 2 days ago Just make your own. It is dead simple and tastes better. permalink award report block reply Darkpoisonousshaddow 2 points 2 days ago Flour, butter and sugar. permalink parent award report block reply BannedAccount 3 points 2 days ago I dont even eat those gross ass cookies thankfully permalink award report block reply WeaponizedSmirk 2 points 2 days ago The ones I get are locally made. permalink award report block reply Smurfection 2 points 2 days ago This has the makings of those \"chicken nuggets are made from pink slime\" vids of the aughts.   Pink slime wasn't a thing in the U.S except in animal feed.  That being said Caveat Emptor, buyer beware. permalink award report block reply HOSEQ 1 points 2 days ago Carpe Carpets.... permalink parent award report block reply CharlesWilliams 2 points 2 days ago Holy crap, was eating these exact cookies while viewing this, now I can’t stop retching…. I may never eat anything I didn’t cook myself again. permalink award report block reply Keep_on_winning_kag 1 points 2 days ago Just eat the cookies you'll be fine. permalink parent award report block reply CharlesWilliams 1 points 18 hours ago No, I’m dead.  Now I’m haunting you for mocking my demise.  LOL. permalink parent award report block reply Froynlavenfroynlaven 2 points 2 days ago This would be more credible if the video showed any evidence of the molds for the different shapes they come in. permalink award report block reply rauschman 2 points 2 days ago I have a similar tin I've bought in the past in Bavaria. Its produced in Denmark, thank God. I watched this and immediately went and looked, lol. permalink award report block reply patrioticwinning3 1 points 2 days ago The first Time I have seen, \"Made in India\" on those.... permalink award report block reply Choppermagic 1 points 2 days ago I don't understand.  Why is there video of grandma's sewing supply tins at the end? permalink award report block reply Wildwind 1 points 2 days ago Its a damn funny fake video. permalink award report block reply truthjusticetruth 1 points 2 days ago This is fake. Multiple separate videos spliced together. FAKE NEWS. permalink award report block reply learntocode 1 points 2 days ago I still LOL all the same permalink parent award report block reply Keep_on_winning_kag 1 points 2 days ago Aldi sells a lot of shit thats made in india. Don't buy products made in india, simple as that. permalink award report block reply RyanKeyOh 1 points 2 days ago Fake permalink award report block reply greatpumpkin 1 points 2 days ago I need a shower just watching that. permalink award report block reply learntocode 1 points 2 days ago These cookies are ridiculously easy to make yourself. Shortbread - butter and flour. Boom done. WTF was I raised on magic tins of this shit? Because mom AND dad had to work full time. Sick of this shit. permalink award report block reply JanxyJet 0 points 2 days ago Fake, for those cookies. But  many are from China, now. They're smart enough to not allow outside cameras, donchaknow. Watch your labels! permalink award report block reply\nMickHigan2 47 points 2 days ago I find it utterly hilarious that the indians of PDW always get mad at all the disgusting india videos. permalink award report block reply South_Florida_Guy 26 points 2 days ago Just by holding up a mirror to them permalink parent award report block reply\nSouth_Florida_Guy 26 points 2 days ago Just by holding up a mirror to them permalink parent award report block reply\nmagnokor 42 points 2 days ago The local store had some in the catalog, said they were Danish. Saw this, went and had a look, magnified the box picture, Made In China. Just had a look at ALDI, their Danish style Christmas Cookies are made in, maybe a surprise, in Denmark. permalink award report block reply God-is-good 13 points 2 days ago Gotta check every label these days.I ran into one last year that was an unexpected knock off. permalink parent award report block reply 26magarat 5 points 2 days ago Maybe it's like Danish pastries? permalink parent award report block reply Oback_Barama 5 points 2 days ago I’d trust ALDI before Walmart. permalink parent award report block reply\nGod-is-good 13 points 2 days ago Gotta check every label these days.I ran into one last year that was an unexpected knock off. permalink parent award report block reply\n26magarat 5 points 2 days ago Maybe it's like Danish pastries? permalink parent award report block reply\nOback_Barama 5 points 2 days ago I’d trust ALDI before Walmart. permalink parent award report block reply\nDarkpoisonousshaddow 17 points 2 days ago Ooh saar I'm not dirty bastards, I'm just not clean bastards! permalink award report block reply Taliesin 6 points 2 days ago And I do the needful and swat away the rats, saar! permalink parent award report block reply MAGABOND 4 points 2 days ago We are respectable bastards. permalink parent award report block reply HOSEQ 2 points 2 days ago Yusd dond you dell me wad do do, bloody bastard you.... permalink parent award report block reply\nTaliesin 6 points 2 days ago And I do the needful and swat away the rats, saar! permalink parent award report block reply\nMAGABOND 4 points 2 days ago We are respectable bastards. permalink parent award report block reply HOSEQ 2 points 2 days ago Yusd dond you dell me wad do do, bloody bastard you.... permalink parent award report block reply\nHOSEQ 2 points 2 days ago Yusd dond you dell me wad do do, bloody bastard you.... permalink parent award report block reply\nTrump454748 17 points 2 days ago We have laws in America that prohibit this but we can just import from overseas like that?.🤮 permalink award report block reply Prandogolio 15 points 2 days ago Stop being so fucking gullible.  There's zero evidence that this video has anything to do with those cookies. permalink parent award report block reply N0rds 9 points 2 days ago Yeah the jump cut to the store makes me think it wasn't even what the pajeets were baking permalink parent award report block reply learntocode 4 points 2 days ago They were making indian sweets. The jump cut is deceptive. permalink parent award report block reply Taliesin 4 points 2 days ago The tin says 'made in India.' It does not necessarily mean that these were the particular brand of cookies being made, but between street-shitting, asswiping with bare hands, and swatting rats off food being prepared, India definitely has a hygiene problem. permalink parent award report block reply\nPrandogolio 15 points 2 days ago Stop being so fucking gullible.  There's zero evidence that this video has anything to do with those cookies. permalink parent award report block reply N0rds 9 points 2 days ago Yeah the jump cut to the store makes me think it wasn't even what the pajeets were baking permalink parent award report block reply learntocode 4 points 2 days ago They were making indian sweets. The jump cut is deceptive. permalink parent award report block reply Taliesin 4 points 2 days ago The tin says 'made in India.' It does not necessarily mean that these were the particular brand of cookies being made, but between street-shitting, asswiping with bare hands, and swatting rats off food being prepared, India definitely has a hygiene problem. permalink parent award report block reply\nN0rds 9 points 2 days ago Yeah the jump cut to the store makes me think it wasn't even what the pajeets were baking permalink parent award report block reply learntocode 4 points 2 days ago They were making indian sweets. The jump cut is deceptive. permalink parent award report block reply Taliesin 4 points 2 days ago The tin says 'made in India.' It does not necessarily mean that these were the particular brand of cookies being made, but between street-shitting, asswiping with bare hands, and swatting rats off food being prepared, India definitely has a hygiene problem. permalink parent award report block reply\nlearntocode 4 points 2 days ago They were making indian sweets. The jump cut is deceptive. permalink parent award report block reply\nTaliesin 4 points 2 days ago The tin says 'made in India.' It does not necessarily mean that these were the particular brand of cookies being made, but between street-shitting, asswiping with bare hands, and swatting rats off food being prepared, India definitely has a hygiene problem. permalink parent award report block reply\nHantif 10 points 2 days ago Always check country of origin. Never buy food from India, China, or anywhere else you wouldn't eat from a street vendor. permalink award report block reply\nDrVSGGEOTUSPhD 7 points 2 days ago This song GOES HARD permalink award report block reply Taliesin 1 points 2 days ago Yes, indeed saar! permalink parent award report block reply\nTaliesin 1 points 2 days ago Yes, indeed saar! permalink parent award report block reply\nQuidnunc 7 points 2 days ago Bake your own cookies. Unless you really like the taste of partially hydrogenated soy and all the alphabet chemicals to keep it from molding for a year or more. permalink award report block reply gillonba 1 points 2 days ago This is the correct answer.  Cookies made in the US and Europe are still trash, just a different sort of trash.  Any (unsealed) baked good that can sit on a shelf for weeks or even months without going bad should probably not be eaten permalink parent award report block reply\ngillonba 1 points 2 days ago This is the correct answer.  Cookies made in the US and Europe are still trash, just a different sort of trash.  Any (unsealed) baked good that can sit on a shelf for weeks or even months without going bad should probably not be eaten permalink parent award report block reply\nOldman1234 6 points 2 days ago Oh no!  I just bought one of those tins!  Is this real? permalink award report block reply Darkpoisonousshaddow 23 points 2 days ago Stay away from the chocolate chips permalink parent award report block reply Oldman1234 8 points 2 days ago Excellent advice. Thanks! permalink parent award report block reply Prandogolio 6 points 2 days ago Well there's absolutely no evidence presented in this video that it has anything to do with those cookies. Why don't you practice being a mega ultra genius super detective and look on the side of the cookie tin you just bought and read where they were made? permalink parent award report block reply Oldman1234 5 points 2 days ago The issue for me isn't really WHERE they're made but HOW they're made (as shown in the video). permalink parent award report block reply Litecola2 6 points 2 days ago If you are buying foods made in India you get what you deserve permalink parent award report block reply Prandogolio -1 points 2 days ago But what makes you think they're being made the way they're making them in the video?  They're made in a factory.  Calm down you gullible doofus. permalink parent award report block reply Littleirishmaid 5 points 2 days ago I could not read the back.  Where does it say they were made? permalink parent award report block reply Darkpoisonousshaddow 8 points 2 days ago India permalink parent award report block reply ChyNahAzzWhole1 6 points 2 days ago Watching on my phone I can magnify the screenshot. In d ia permalink parent award report block reply corntortilla 1 points 2 days ago Of course not. permalink parent award report block reply\nDarkpoisonousshaddow 23 points 2 days ago Stay away from the chocolate chips permalink parent award report block reply Oldman1234 8 points 2 days ago Excellent advice. Thanks! permalink parent award report block reply\nOldman1234 8 points 2 days ago Excellent advice. Thanks! permalink parent award report block reply\nPrandogolio 6 points 2 days ago Well there's absolutely no evidence presented in this video that it has anything to do with those cookies. Why don't you practice being a mega ultra genius super detective and look on the side of the cookie tin you just bought and read where they were made? permalink parent award report block reply Oldman1234 5 points 2 days ago The issue for me isn't really WHERE they're made but HOW they're made (as shown in the video). permalink parent award report block reply Litecola2 6 points 2 days ago If you are buying foods made in India you get what you deserve permalink parent award report block reply Prandogolio -1 points 2 days ago But what makes you think they're being made the way they're making them in the video?  They're made in a factory.  Calm down you gullible doofus. permalink parent award report block reply\nOldman1234 5 points 2 days ago The issue for me isn't really WHERE they're made but HOW they're made (as shown in the video). permalink parent award report block reply Litecola2 6 points 2 days ago If you are buying foods made in India you get what you deserve permalink parent award report block reply Prandogolio -1 points 2 days ago But what makes you think they're being made the way they're making them in the video?  They're made in a factory.  Calm down you gullible doofus. permalink parent award report block reply\nLitecola2 6 points 2 days ago If you are buying foods made in India you get what you deserve permalink parent award report block reply\nPrandogolio -1 points 2 days ago But what makes you think they're being made the way they're making them in the video?  They're made in a factory.  Calm down you gullible doofus. permalink parent award report block reply\nLittleirishmaid 5 points 2 days ago I could not read the back.  Where does it say they were made? permalink parent award report block reply Darkpoisonousshaddow 8 points 2 days ago India permalink parent award report block reply ChyNahAzzWhole1 6 points 2 days ago Watching on my phone I can magnify the screenshot. In d ia permalink parent award report block reply\nDarkpoisonousshaddow 8 points 2 days ago India permalink parent award report block reply\nChyNahAzzWhole1 6 points 2 days ago Watching on my phone I can magnify the screenshot. In d ia permalink parent award report block reply\ncorntortilla 1 points 2 days ago Of course not. permalink parent award report block reply\nKendoextendo 5 points 2 days ago All I ever find in those tins is sewing supplies. Now I'm thinking granny was just looking out for me. permalink award report block reply\nPepesJusticeBoner 4 points 2 days ago We have a local grandmother who bakes delicious cookies. The money she makes helps her keep up with inflation despite being on a fixed income. Hopefully every pede can find a local grandmother or struggling mom and buy cookies from them instead of disgusting store bought imported garbage cookies. permalink award report block reply\nValiazaner 3 points 2 days ago Just make your own. It is dead simple and tastes better. permalink award report block reply Darkpoisonousshaddow 2 points 2 days ago Flour, butter and sugar. permalink parent award report block reply\nDarkpoisonousshaddow 2 points 2 days ago Flour, butter and sugar. permalink parent award report block reply\nBannedAccount 3 points 2 days ago I dont even eat those gross ass cookies thankfully permalink award report block reply\nWeaponizedSmirk 2 points 2 days ago The ones I get are locally made. permalink award report block reply\nSmurfection 2 points 2 days ago This has the makings of those \"chicken nuggets are made from pink slime\" vids of the aughts.   Pink slime wasn't a thing in the U.S except in animal feed.  That being said Caveat Emptor, buyer beware. permalink award report block reply HOSEQ 1 points 2 days ago Carpe Carpets.... permalink parent award report block reply\nHOSEQ 1 points 2 days ago Carpe Carpets.... permalink parent award report block reply\nCharlesWilliams 2 points 2 days ago Holy crap, was eating these exact cookies while viewing this, now I can’t stop retching…. I may never eat anything I didn’t cook myself again. permalink award report block reply Keep_on_winning_kag 1 points 2 days ago Just eat the cookies you'll be fine. permalink parent award report block reply CharlesWilliams 1 points 18 hours ago No, I’m dead.  Now I’m haunting you for mocking my demise.  LOL. permalink parent award report block reply\nKeep_on_winning_kag 1 points 2 days ago Just eat the cookies you'll be fine. permalink parent award report block reply CharlesWilliams 1 points 18 hours ago No, I’m dead.  Now I’m haunting you for mocking my demise.  LOL. permalink parent award report block reply\nCharlesWilliams 1 points 18 hours ago No, I’m dead.  Now I’m haunting you for mocking my demise.  LOL. permalink parent award report block reply\nFroynlavenfroynlaven 2 points 2 days ago This would be more credible if the video showed any evidence of the molds for the different shapes they come in. permalink award report block reply\nrauschman 2 points 2 days ago I have a similar tin I've bought in the past in Bavaria. Its produced in Denmark, thank God. I watched this and immediately went and looked, lol. permalink award report block reply\npatrioticwinning3 1 points 2 days ago The first Time I have seen, \"Made in India\" on those.... permalink award report block reply\nChoppermagic 1 points 2 days ago I don't understand.  Why is there video of grandma's sewing supply tins at the end? permalink award report block reply\nWildwind 1 points 2 days ago Its a damn funny fake video. permalink award report block reply\ntruthjusticetruth 1 points 2 days ago This is fake. Multiple separate videos spliced together. FAKE NEWS. permalink award report block reply learntocode 1 points 2 days ago I still LOL all the same permalink parent award report block reply\nlearntocode 1 points 2 days ago I still LOL all the same permalink parent award report block reply\nKeep_on_winning_kag 1 points 2 days ago Aldi sells a lot of shit thats made in india. Don't buy products made in india, simple as that. permalink award report block reply\nRyanKeyOh 1 points 2 days ago Fake permalink award report block reply\ngreatpumpkin 1 points 2 days ago I need a shower just watching that. permalink award report block reply\nlearntocode 1 points 2 days ago These cookies are ridiculously easy to make yourself. Shortbread - butter and flour. Boom done. WTF was I raised on magic tins of this shit? Because mom AND dad had to work full time. Sick of this shit. permalink award report block reply\nJanxyJet 0 points 2 days ago Fake, for those cookies. But  many are from China, now. They're smart enough to not allow outside cameras, donchaknow. Watch your labels! permalink award report block reply"}