{"id": "1ARK9nOnmZ", "contents": "46 BENNY JOHNSON: BREAKING: AG Pam Bondi and FBI Director Kash Patel have reportedly submitted documents to Congress revealing the Clinton Foundation took donations from foreign and domestic sources seeking influence.\n“Officials told Just the News that the documents were transmitted to the Senate Judi posted 8 hours ago by Sunnybats2 17 comments award share report block Benny Johnson @bennyjohnson • 1d BREAKING: AG Pam Bondi and FBI Director Kash Patel have reportedly submitted documents to Congress revealing the Clinton Foundation took donations from foreign and domestic sources seeking influence. “Officials told Just the News that the documents were transmitted to the Senate\n17 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style BrokenWolf2022 4 points 8 hours ago Good idea. Turn it over to Congress so you don't have to actually charge or arrest anyone. permalink award report block reply Callsign_Fox1 1 points 8 hours ago Have faith. Let's form some sort of committee to look into all this stuff. permalink parent award report block reply BrokenWolf2022 2 points 8 hours ago Even better, let's go talk about it onFOX until the next news cycle. permalink parent award report block reply Callsign_Fox1 1 points 8 hours ago Slow down there kid. Let's get the facts straight first. permalink parent award report block reply BrokenWolf2022 2 points 8 hours ago Facts just get in the way of a good narrative. Are you new here? permalink parent award report block reply Gunmolester 3 points 8 hours ago Sigh....we all knew this years ago permalink award report block reply RandoBudster 2 points 8 hours ago Investigation to nowhere #3,602 permalink award report block reply Awakened 2 points 5 hours ago Um, the DOJ/FBI are the ones that arrest. Congress can submit someone for arrest, but they don't have to for DOJ and/or FBI to arrest. This is backwards and retarded and shows they are just doing the theater thing. We see through and are done with this bullshit. permalink award report block reply Wexit-Delecto 2 points 8 hours ago Oh WOW! \"Submitted to congress!\" I'm sure Congress will IMMEDIATELY deal with this problem. Fuck's sakes. permalink award report block reply BenDoverAssho 2 points 8 hours ago Is there a \" statute of limitations \" for these criminal acts? permalink award report block reply finnigan 1 points 50 minutes ago I don't care.  Deport them all, arrest anyone aiding and abetting.  Arrest congressmen for insider trading, deport congressmen who prefer their country of birth, deport all H1b visa holders only then can you tell us about anything else you are doing. permalink award report block reply TonyTreehouse 1 points 7 hours ago The DOJ is sending a referral to Congress? Pam is not even pretending anymore.  Trump really doesn't know how to pick AGs. permalink award report block reply Sunnybats2 OP 1 points 1 hour ago He picked GAETZ but jooz permalink parent award report block reply Sunnybats2 OP 1 points 8 hours ago BREAKING: AG Pam Bondi and FBI Director Kash Patel have reportedly submitted documents to Congress revealing the Clinton Foundation took donations from foreign and domestic sources seeking influence. “Officials told Just the News that the documents were transmitted to the Senate Judiciary Committee in recent days and detail numerous instances of foreigners and even a U.S. defense contractor seeking to curry favor with the Clintons through donations to their family charity, including when Hillary Clinton served as secretary of State. Bill Clinton was a U.S. president from 1993 to 2001.” “The officials said some of the evidence was flagged by whistleblowers who claimed such evidence was kept from a corruption investigation that was being conducted in 2015 by the Little Rock, Ark., U.S. attorney’s office before it was shut down by the Obama administration's Justice Department.” permalink award report block reply FusionBlack 1 points 8 hours ago Warrants have been issued when? permalink award report block reply SilentSniper 1 points 8 hours ago Yes. I think you are correct permalink parent award report block reply Callsign_Fox1 0 points 8 hours ago Nice! The walls are closing in. permalink award report block reply\nBrokenWolf2022 4 points 8 hours ago Good idea. Turn it over to Congress so you don't have to actually charge or arrest anyone. permalink award report block reply Callsign_Fox1 1 points 8 hours ago Have faith. Let's form some sort of committee to look into all this stuff. permalink parent award report block reply BrokenWolf2022 2 points 8 hours ago Even better, let's go talk about it onFOX until the next news cycle. permalink parent award report block reply Callsign_Fox1 1 points 8 hours ago Slow down there kid. Let's get the facts straight first. permalink parent award report block reply BrokenWolf2022 2 points 8 hours ago Facts just get in the way of a good narrative. Are you new here? permalink parent award report block reply\nCallsign_Fox1 1 points 8 hours ago Have faith. Let's form some sort of committee to look into all this stuff. permalink parent award report block reply BrokenWolf2022 2 points 8 hours ago Even better, let's go talk about it onFOX until the next news cycle. permalink parent award report block reply Callsign_Fox1 1 points 8 hours ago Slow down there kid. Let's get the facts straight first. permalink parent award report block reply BrokenWolf2022 2 points 8 hours ago Facts just get in the way of a good narrative. Are you new here? permalink parent award report block reply\nBrokenWolf2022 2 points 8 hours ago Even better, let's go talk about it onFOX until the next news cycle. permalink parent award report block reply Callsign_Fox1 1 points 8 hours ago Slow down there kid. Let's get the facts straight first. permalink parent award report block reply BrokenWolf2022 2 points 8 hours ago Facts just get in the way of a good narrative. Are you new here? permalink parent award report block reply\nCallsign_Fox1 1 points 8 hours ago Slow down there kid. Let's get the facts straight first. permalink parent award report block reply BrokenWolf2022 2 points 8 hours ago Facts just get in the way of a good narrative. Are you new here? permalink parent award report block reply\nBrokenWolf2022 2 points 8 hours ago Facts just get in the way of a good narrative. Are you new here? permalink parent award report block reply\nGunmolester 3 points 8 hours ago Sigh....we all knew this years ago permalink award report block reply\nRandoBudster 2 points 8 hours ago Investigation to nowhere #3,602 permalink award report block reply\nAwakened 2 points 5 hours ago Um, the DOJ/FBI are the ones that arrest. Congress can submit someone for arrest, but they don't have to for DOJ and/or FBI to arrest. This is backwards and retarded and shows they are just doing the theater thing. We see through and are done with this bullshit. permalink award report block reply\nWexit-Delecto 2 points 8 hours ago Oh WOW! \"Submitted to congress!\" I'm sure Congress will IMMEDIATELY deal with this problem. Fuck's sakes. permalink award report block reply\nBenDoverAssho 2 points 8 hours ago Is there a \" statute of limitations \" for these criminal acts? permalink award report block reply\nfinnigan 1 points 50 minutes ago I don't care.  Deport them all, arrest anyone aiding and abetting.  Arrest congressmen for insider trading, deport congressmen who prefer their country of birth, deport all H1b visa holders only then can you tell us about anything else you are doing. permalink award report block reply\nTonyTreehouse 1 points 7 hours ago The DOJ is sending a referral to Congress? Pam is not even pretending anymore.  Trump really doesn't know how to pick AGs. permalink award report block reply Sunnybats2 OP 1 points 1 hour ago He picked GAETZ but jooz permalink parent award report block reply\nSunnybats2 OP 1 points 1 hour ago He picked GAETZ but jooz permalink parent award report block reply\nSunnybats2 OP 1 points 8 hours ago BREAKING: AG Pam Bondi and FBI Director Kash Patel have reportedly submitted documents to Congress revealing the Clinton Foundation took donations from foreign and domestic sources seeking influence. “Officials told Just the News that the documents were transmitted to the Senate Judiciary Committee in recent days and detail numerous instances of foreigners and even a U.S. defense contractor seeking to curry favor with the Clintons through donations to their family charity, including when Hillary Clinton served as secretary of State. Bill Clinton was a U.S. president from 1993 to 2001.” “The officials said some of the evidence was flagged by whistleblowers who claimed such evidence was kept from a corruption investigation that was being conducted in 2015 by the Little Rock, Ark., U.S. attorney’s office before it was shut down by the Obama administration's Justice Department.” permalink award report block reply\nFusionBlack 1 points 8 hours ago Warrants have been issued when? permalink award report block reply SilentSniper 1 points 8 hours ago Yes. I think you are correct permalink parent award report block reply\nSilentSniper 1 points 8 hours ago Yes. I think you are correct permalink parent award report block reply\nCallsign_Fox1 0 points 8 hours ago Nice! The walls are closing in. permalink award report block reply"}