{"id": "1ARK9oWNI0", "contents": "9 New media attack says Trump \"knew\" about Epstein's underage girls, but they conveniently forgot to mention one important detail 🤔 (notthebee.com) posted 3 hours ago by hansgruber7 4 comments award share report block New media attack says Trump \"knew\" about Epstein's underage girls, but they conveniently forgot to mention one important detail ... The Democrats are getting to the bottom of the whole Epstein coverup! notthebee.com\n4 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget genericamerican69 3 points 2 hours ago When everywhere you turn is punejabs and shitskins,, its impossible to care about epstein I'm sorry. Make America a western country again first, then pursue criminals. permalink award report block reply friarfox 1 points 2 hours ago He was already implicated but the point is now that there is no one to back that up. Never mind Israel's control over the abusers , it's a question of action. So? You see that any 15 year old can put the pieces together. These girls were beaten , tortured and raped for the amusement of the tiny hat people. Everyone knows and no one will do a damn thing about it. I don't know if Trump was involved but I do know he is the one burying the story. Why? permalink award report block reply SHILL_DETECTOR 2 points 2 hours ago involved? i knew about epstein before these emails existed permalink parent award report block reply hansgruber7 OP 1 points 1 hour ago There is nothing for Trump to bury.  Anyone who thinks the Deep State just left incriminating files laying around for four years for Trump to find is a retard. permalink parent award report block reply\ngenericamerican69 3 points 2 hours ago When everywhere you turn is punejabs and shitskins,, its impossible to care about epstein I'm sorry. Make America a western country again first, then pursue criminals. permalink award report block reply\nfriarfox 1 points 2 hours ago He was already implicated but the point is now that there is no one to back that up. Never mind Israel's control over the abusers , it's a question of action. So? You see that any 15 year old can put the pieces together. These girls were beaten , tortured and raped for the amusement of the tiny hat people. Everyone knows and no one will do a damn thing about it. I don't know if Trump was involved but I do know he is the one burying the story. Why? permalink award report block reply SHILL_DETECTOR 2 points 2 hours ago involved? i knew about epstein before these emails existed permalink parent award report block reply hansgruber7 OP 1 points 1 hour ago There is nothing for Trump to bury.  Anyone who thinks the Deep State just left incriminating files laying around for four years for Trump to find is a retard. permalink parent award report block reply\nSHILL_DETECTOR 2 points 2 hours ago involved? i knew about epstein before these emails existed permalink parent award report block reply\nhansgruber7 OP 1 points 1 hour ago There is nothing for Trump to bury.  Anyone who thinks the Deep State just left incriminating files laying around for four years for Trump to find is a retard. permalink parent award report block reply"}