{"id": "1ARK513aJq", "contents": "884 Econ 101 - posted 6 days ago by KuzoKevin 26 comments award share report block Lauren Chen @TheLaurenChen • 6d EBT is absolutely part of why groceries are so expensive now. EBT is a government subsidy program, and it exploded under Biden. Whenever the government subsidizes something, prices shoot up because of increased demand. It's the same reason college became unaffordable. Among the Wildflowers @deaflibertarian • 6d It's weird how Walmart dropped food prices after SNAP benefits ended...\n26 comments Sort by Top Top New Worst Old Save OTher55 27 points 6 days ago Good time to stockpile foods before SNAP gets funded again permalink award report block reply BarronVonSaltzburg26 6 points 6 days ago Its like buying stocks on the dip, just with stale dates permalink parent award report block reply ianpatrick1966 5 points 6 days ago My entire pantry is now filled with dip. permalink parent award report block reply bidensmissingbrain 23 points 6 days ago Even if demand doesn’t increase, they’re still going to raise prices because SNAP/EBT is government gravy, and every company that exists tries to get as much of it as possible. permalink award report block reply PedeInADeepBlueSea 13 points 6 days ago And the higher food prices are across the board, the more the government will hand out. permalink parent award report block reply Foreign_Aid_is_Theft 9 points 6 days ago Same positive feedback loop in healthcare and higher Ed.  Oh, prices went up, we need to increase premiums/subsidies. Oh, premiums/subsidies went up, we should increase prices. permalink parent award report block reply snoopy3210 1 points 6 days ago The post is incorrect. That walmart cart price was followed for a year, if I remember the walmart CEO interview. Trump pumped gas ans imported eggs on day one. It worked until now. Now he just put sanctions on Russian gas and oil, at the same time than the EU did, so that will increase gas prices back a bit. There’s also a 10 % tariff on Canadian oil. Nothing to do with the one month shutdown permalink parent award report block reply tt777 9 points 6 days ago It's also why healthcare is so expensive. permalink award report block reply Oback_Barama 2 points 6 days ago And housing permalink parent award report block reply FromNC 9 points 6 days ago I’m enjoying $0.99 Gallon Milk, if only we could get beef that low. permalink award report block reply PurpleBanana 7 points 6 days ago Honestly....Ill be the wet blanket on this one issue. We have local family farms. By family I mean actual humans who are out in the patures hands 365. They do it all. They also work side hustles etc. We buy our beef from them at 4.50/lb to 5.50 lb. Including locallly processing. Thats all cuts from filet to stew. They are invested in the community. They make ends meet. 99 cents/lb is imported cattle rasied in ways that would make yoiur blood boil. And the flavor/quality is awsesome. I budget for the higher price each year and it lasts all year. Just my pocket lint\"s worth of input. permalink parent award report block reply MiyamotoHolliday 7 points 6 days ago I pay 10 a pound but its raised literally across the street. I know exactly what it eats, how its treated, and how little injections it gets. Even get to go feed it my excess pears and apples in the summers. Store bought beef, anything grain fed or finished, tastes like soap to me now. permalink parent award report block reply FromNC 3 points 6 days ago We have a local farmer that does 100% grass fed no grain. It’s closer to $9/lb for ground beef and he barely gets by on that. The cost of cattle not tainted by grains and the cost of processing make it a very cut throat side job for him. Sure there are some cheaper cuts and some more expensive but unless your local farm is self sustaining and processes their own cattle then I’m not sure how they get by. permalink parent award report block reply PurpleBanana 1 points 6 days ago Honestly. I have NO idea how they break even on the price. But the whole family work full time off the farms too. They do everythng except process but that is also done by another small family who raise amimals also. Like all the farmers they are having their shoes squeezed by local slimey politicians and developers to sell off land. Many have so they can affotd to keep the farm in the family. I am humbled by their fortitude. permalink parent award report block reply NecturusMaculosus 7 points 6 days ago Yep permalink award report block reply Brownwaterboys 5 points 6 days ago Rush the meat counter!!! permalink award report block reply TheArchAngel 4 points 6 days ago it's also the reason why healthcare is the dumpster fire that it is. permalink award report block reply BrookieDragon 4 points 6 days ago If they finally ditch soda off EBT, maybe they'll go back to a reasonable price from the $9 a 12 pack they want. It sucks that as middle class, that shit is luxury. permalink award report block reply SurveilThis 2 points 6 days ago Govt ruins all it manages: Healthcare, Medicare, Vaccines SNAP Affordable Housing Social Security College Loans K-12 Education Foreign Aid Immigration War Crime Control Homelessness Voting Process Economic Development permalink award report block reply KarenLukasik 2 points 6 days ago I hope they keep the government shut down until at least another 2 million invaders self deport permalink award report block reply RolandDelacroix 1 points 6 days ago Lauren is somewhat incorrect here.  Footstuffs are unique in that their consumption is very inelastic, the demand doesn't change much based on prices. The total population needs a certain amount of total calories and that doesn't change quickly.  Certain types of food are elastic, people may substitute chicken for steak, cereal for bacon and eggs, etc.  But staples are more effected by production cost changes. Rather, what we will see is slow adaption.  Home gardens, less children, cuts to elsewhere in the budget. permalink award report block reply ianpatrick1966 1 points 6 days ago This is true to an extent but if SNAP isn't funding an entire class of degenerate losers, then the demand will go down.  People with $0 wont be able to buy stuff, period, and will get it from food banks.  Since the suppliers are already diverting a portion to food banks (which frankly,historically has ended up in landfills because EBT) the actual demand WILL decrease. permalink parent award report block reply RomeIsFalling 1 points 6 days ago Literally bought some basic bitch coffee today at WalMart and it was rolled back 6 dollars. Loving this SNAP shutdown. permalink award report block reply edxzxz 1 points 6 days ago Another part of the reason why government involvement causes higher prices for everyone is that when the party paying gives no shits whatsoever about the price being paid, amazingly, prices go up.  Just like Obozocare. permalink award report block reply HockeyMom4Trump 1 points 6 days ago Get the government out of food and education permalink award report block reply\nOTher55 27 points 6 days ago Good time to stockpile foods before SNAP gets funded again permalink award report block reply BarronVonSaltzburg26 6 points 6 days ago Its like buying stocks on the dip, just with stale dates permalink parent award report block reply ianpatrick1966 5 points 6 days ago My entire pantry is now filled with dip. permalink parent award report block reply\nBarronVonSaltzburg26 6 points 6 days ago Its like buying stocks on the dip, just with stale dates permalink parent award report block reply ianpatrick1966 5 points 6 days ago My entire pantry is now filled with dip. permalink parent award report block reply\nianpatrick1966 5 points 6 days ago My entire pantry is now filled with dip. permalink parent award report block reply\nbidensmissingbrain 23 points 6 days ago Even if demand doesn’t increase, they’re still going to raise prices because SNAP/EBT is government gravy, and every company that exists tries to get as much of it as possible. permalink award report block reply PedeInADeepBlueSea 13 points 6 days ago And the higher food prices are across the board, the more the government will hand out. permalink parent award report block reply Foreign_Aid_is_Theft 9 points 6 days ago Same positive feedback loop in healthcare and higher Ed.  Oh, prices went up, we need to increase premiums/subsidies. Oh, premiums/subsidies went up, we should increase prices. permalink parent award report block reply snoopy3210 1 points 6 days ago The post is incorrect. That walmart cart price was followed for a year, if I remember the walmart CEO interview. Trump pumped gas ans imported eggs on day one. It worked until now. Now he just put sanctions on Russian gas and oil, at the same time than the EU did, so that will increase gas prices back a bit. There’s also a 10 % tariff on Canadian oil. Nothing to do with the one month shutdown permalink parent award report block reply\nPedeInADeepBlueSea 13 points 6 days ago And the higher food prices are across the board, the more the government will hand out. permalink parent award report block reply Foreign_Aid_is_Theft 9 points 6 days ago Same positive feedback loop in healthcare and higher Ed.  Oh, prices went up, we need to increase premiums/subsidies. Oh, premiums/subsidies went up, we should increase prices. permalink parent award report block reply\nForeign_Aid_is_Theft 9 points 6 days ago Same positive feedback loop in healthcare and higher Ed.  Oh, prices went up, we need to increase premiums/subsidies. Oh, premiums/subsidies went up, we should increase prices. permalink parent award report block reply\nsnoopy3210 1 points 6 days ago The post is incorrect. That walmart cart price was followed for a year, if I remember the walmart CEO interview. Trump pumped gas ans imported eggs on day one. It worked until now. Now he just put sanctions on Russian gas and oil, at the same time than the EU did, so that will increase gas prices back a bit. There’s also a 10 % tariff on Canadian oil. Nothing to do with the one month shutdown permalink parent award report block reply\ntt777 9 points 6 days ago It's also why healthcare is so expensive. permalink award report block reply Oback_Barama 2 points 6 days ago And housing permalink parent award report block reply\nOback_Barama 2 points 6 days ago And housing permalink parent award report block reply\nFromNC 9 points 6 days ago I’m enjoying $0.99 Gallon Milk, if only we could get beef that low. permalink award report block reply PurpleBanana 7 points 6 days ago Honestly....Ill be the wet blanket on this one issue. We have local family farms. By family I mean actual humans who are out in the patures hands 365. They do it all. They also work side hustles etc. We buy our beef from them at 4.50/lb to 5.50 lb. Including locallly processing. Thats all cuts from filet to stew. They are invested in the community. They make ends meet. 99 cents/lb is imported cattle rasied in ways that would make yoiur blood boil. And the flavor/quality is awsesome. I budget for the higher price each year and it lasts all year. Just my pocket lint\"s worth of input. permalink parent award report block reply MiyamotoHolliday 7 points 6 days ago I pay 10 a pound but its raised literally across the street. I know exactly what it eats, how its treated, and how little injections it gets. Even get to go feed it my excess pears and apples in the summers. Store bought beef, anything grain fed or finished, tastes like soap to me now. permalink parent award report block reply FromNC 3 points 6 days ago We have a local farmer that does 100% grass fed no grain. It’s closer to $9/lb for ground beef and he barely gets by on that. The cost of cattle not tainted by grains and the cost of processing make it a very cut throat side job for him. Sure there are some cheaper cuts and some more expensive but unless your local farm is self sustaining and processes their own cattle then I’m not sure how they get by. permalink parent award report block reply PurpleBanana 1 points 6 days ago Honestly. I have NO idea how they break even on the price. But the whole family work full time off the farms too. They do everythng except process but that is also done by another small family who raise amimals also. Like all the farmers they are having their shoes squeezed by local slimey politicians and developers to sell off land. Many have so they can affotd to keep the farm in the family. I am humbled by their fortitude. permalink parent award report block reply\nPurpleBanana 7 points 6 days ago Honestly....Ill be the wet blanket on this one issue. We have local family farms. By family I mean actual humans who are out in the patures hands 365. They do it all. They also work side hustles etc. We buy our beef from them at 4.50/lb to 5.50 lb. Including locallly processing. Thats all cuts from filet to stew. They are invested in the community. They make ends meet. 99 cents/lb is imported cattle rasied in ways that would make yoiur blood boil. And the flavor/quality is awsesome. I budget for the higher price each year and it lasts all year. Just my pocket lint\"s worth of input. permalink parent award report block reply MiyamotoHolliday 7 points 6 days ago I pay 10 a pound but its raised literally across the street. I know exactly what it eats, how its treated, and how little injections it gets. Even get to go feed it my excess pears and apples in the summers. Store bought beef, anything grain fed or finished, tastes like soap to me now. permalink parent award report block reply FromNC 3 points 6 days ago We have a local farmer that does 100% grass fed no grain. It’s closer to $9/lb for ground beef and he barely gets by on that. The cost of cattle not tainted by grains and the cost of processing make it a very cut throat side job for him. Sure there are some cheaper cuts and some more expensive but unless your local farm is self sustaining and processes their own cattle then I’m not sure how they get by. permalink parent award report block reply PurpleBanana 1 points 6 days ago Honestly. I have NO idea how they break even on the price. But the whole family work full time off the farms too. They do everythng except process but that is also done by another small family who raise amimals also. Like all the farmers they are having their shoes squeezed by local slimey politicians and developers to sell off land. Many have so they can affotd to keep the farm in the family. I am humbled by their fortitude. permalink parent award report block reply\nMiyamotoHolliday 7 points 6 days ago I pay 10 a pound but its raised literally across the street. I know exactly what it eats, how its treated, and how little injections it gets. Even get to go feed it my excess pears and apples in the summers. Store bought beef, anything grain fed or finished, tastes like soap to me now. permalink parent award report block reply\nFromNC 3 points 6 days ago We have a local farmer that does 100% grass fed no grain. It’s closer to $9/lb for ground beef and he barely gets by on that. The cost of cattle not tainted by grains and the cost of processing make it a very cut throat side job for him. Sure there are some cheaper cuts and some more expensive but unless your local farm is self sustaining and processes their own cattle then I’m not sure how they get by. permalink parent award report block reply PurpleBanana 1 points 6 days ago Honestly. I have NO idea how they break even on the price. But the whole family work full time off the farms too. They do everythng except process but that is also done by another small family who raise amimals also. Like all the farmers they are having their shoes squeezed by local slimey politicians and developers to sell off land. Many have so they can affotd to keep the farm in the family. I am humbled by their fortitude. permalink parent award report block reply\nPurpleBanana 1 points 6 days ago Honestly. I have NO idea how they break even on the price. But the whole family work full time off the farms too. They do everythng except process but that is also done by another small family who raise amimals also. Like all the farmers they are having their shoes squeezed by local slimey politicians and developers to sell off land. Many have so they can affotd to keep the farm in the family. I am humbled by their fortitude. permalink parent award report block reply\nNecturusMaculosus 7 points 6 days ago Yep permalink award report block reply\nBrownwaterboys 5 points 6 days ago Rush the meat counter!!! permalink award report block reply\nTheArchAngel 4 points 6 days ago it's also the reason why healthcare is the dumpster fire that it is. permalink award report block reply\nBrookieDragon 4 points 6 days ago If they finally ditch soda off EBT, maybe they'll go back to a reasonable price from the $9 a 12 pack they want. It sucks that as middle class, that shit is luxury. permalink award report block reply\nSurveilThis 2 points 6 days ago Govt ruins all it manages: Healthcare, Medicare, Vaccines SNAP Affordable Housing Social Security College Loans K-12 Education Foreign Aid Immigration War Crime Control Homelessness Voting Process Economic Development permalink award report block reply\nKarenLukasik 2 points 6 days ago I hope they keep the government shut down until at least another 2 million invaders self deport permalink award report block reply\nRolandDelacroix 1 points 6 days ago Lauren is somewhat incorrect here.  Footstuffs are unique in that their consumption is very inelastic, the demand doesn't change much based on prices. The total population needs a certain amount of total calories and that doesn't change quickly.  Certain types of food are elastic, people may substitute chicken for steak, cereal for bacon and eggs, etc.  But staples are more effected by production cost changes. Rather, what we will see is slow adaption.  Home gardens, less children, cuts to elsewhere in the budget. permalink award report block reply ianpatrick1966 1 points 6 days ago This is true to an extent but if SNAP isn't funding an entire class of degenerate losers, then the demand will go down.  People with $0 wont be able to buy stuff, period, and will get it from food banks.  Since the suppliers are already diverting a portion to food banks (which frankly,historically has ended up in landfills because EBT) the actual demand WILL decrease. permalink parent award report block reply\nianpatrick1966 1 points 6 days ago This is true to an extent but if SNAP isn't funding an entire class of degenerate losers, then the demand will go down.  People with $0 wont be able to buy stuff, period, and will get it from food banks.  Since the suppliers are already diverting a portion to food banks (which frankly,historically has ended up in landfills because EBT) the actual demand WILL decrease. permalink parent award report block reply\nRomeIsFalling 1 points 6 days ago Literally bought some basic bitch coffee today at WalMart and it was rolled back 6 dollars. Loving this SNAP shutdown. permalink award report block reply\nedxzxz 1 points 6 days ago Another part of the reason why government involvement causes higher prices for everyone is that when the party paying gives no shits whatsoever about the price being paid, amazingly, prices go up.  Just like Obozocare. permalink award report block reply\nHockeyMom4Trump 1 points 6 days ago Get the government out of food and education permalink award report block reply"}