{"id": "1ARK9oWveT", "contents": "29 Right wingers need to radicalize. It clearly worked for the left. Don't believe the Shapiro neocon moderates. We can deport any type of immigrants we want. posted 1 hour ago by MasterChief08 3 comments award share report block Firstly, it is still the policy of the US government that fraud revokes citizenship. Thousands of Muslim families likely committed some identity fraud. I want Somali and Syrian communities removed ASAP. I don't care how it's accomplished. Secondly, we have historically denaturalized Japanese, Italian and German immigrants. We've also denaturalized immigrants who later became communists. We can deport people for the exact same reasons as back then. Frankly I don't care what judges think. Once you've removed these people to foreign lands, there's not a single thing they can do to get them back. We want a leader who is willing to ignore the judiciary to save the country. We young conservatives don't care about civic nationalism. Ethnicity and culture dictate how stable a society is. We reject the consensus of the Boomers. Nelson Mandela was a terrorist. MLK was a hypocrite. Joseph McCarthy was an actual American hero. If Trump doesn't have the balls to give us what we want, then we need his successor to start coming up now and HE needs to be far more right wing. I don't care how much that destabilizes this country. I don't want this current version of the country to exist. I think a lot of us young male conservatives are fully aware the left won't let us get what we want without violence and frankly we have nothing to lose. If they initiate the violence, that's their fault\n3 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget Realassman 3 points 1 hour ago Oh they are. Today I saw a group of high schoolers . Probably 25 at a coffee shop discussing bible . And they were not from a church group. This was before school hours . It’s not Radical to discuss bible , but I think they are taking their future seriously. Warms my heart permalink award report block reply Oleander 1 points 58 minutes ago If Trump doesn't have the balls to give us what we want, then we need his successor to start coming up now and HE needs to be far more right wing. I'm not trying to be a doomer here but the odds that this happens with any sort of election or voting any time soon is slim to none. What likely happens is that Democrats take 26, wouldn't be surprised if they also take 28 since that's how things tend to go. It's possible that in 32 or 36 things might be so bad that people will give Republicans another chance, but you're going to need these invaders to vote the Republicans in, because by then there will be a mass amnesty deal, disbanded ICE, and open borders for 4/8 years. If the Republicans need the invaders (which they absolutely would by that point) then they aren't going to suddenly flip into a white nationalist party if they're ever able to get back into power again. I'm being realistic here. I don't see how a white nationalist gets elected in this country. It's possible that there could be some grassroot movement in this regard, but if it ever gains traction, the government (and if necessary, the military) will be used against them. But with all that said, if one somehow rose up through politics and became a candidate, I would vote for them. If you actually want to get back to pre-1965 demographics, it would require something like a modern day Hitler to get it done. Preferably it would be done as peacefully as possible repatriating the foreigners. It seems like a pipedream though. Unless you can explain to me a realistic roadmap of how something like that could happen here? We are literally one Democrat administration away from becoming unable to elect our own people without the help of the invaders. permalink award report block reply henri_derelicte 1 points 1 hour ago I think we need to radicalize in terms of our tactics. Imagine if we had DAs and judges in our pocket who would turn a blind eye as we intercepted and burned mail in ballots. Or eliminated left wing pundits and political operatives. Or having something like the BLM riots being violently suppressed. What if we got powerful and aggressive to the point where the left realized they couldn’t vote their way out of this mess? Where no amount of vote rigging could save them? And they know full well that our side is so heavily armed that they would lose a hot civil war quickly and decisively? permalink award report block reply\nRealassman 3 points 1 hour ago Oh they are. Today I saw a group of high schoolers . Probably 25 at a coffee shop discussing bible . And they were not from a church group. This was before school hours . It’s not Radical to discuss bible , but I think they are taking their future seriously. Warms my heart permalink award report block reply\nOleander 1 points 58 minutes ago If Trump doesn't have the balls to give us what we want, then we need his successor to start coming up now and HE needs to be far more right wing. I'm not trying to be a doomer here but the odds that this happens with any sort of election or voting any time soon is slim to none. What likely happens is that Democrats take 26, wouldn't be surprised if they also take 28 since that's how things tend to go. It's possible that in 32 or 36 things might be so bad that people will give Republicans another chance, but you're going to need these invaders to vote the Republicans in, because by then there will be a mass amnesty deal, disbanded ICE, and open borders for 4/8 years. If the Republicans need the invaders (which they absolutely would by that point) then they aren't going to suddenly flip into a white nationalist party if they're ever able to get back into power again. I'm being realistic here. I don't see how a white nationalist gets elected in this country. It's possible that there could be some grassroot movement in this regard, but if it ever gains traction, the government (and if necessary, the military) will be used against them. But with all that said, if one somehow rose up through politics and became a candidate, I would vote for them. If you actually want to get back to pre-1965 demographics, it would require something like a modern day Hitler to get it done. Preferably it would be done as peacefully as possible repatriating the foreigners. It seems like a pipedream though. Unless you can explain to me a realistic roadmap of how something like that could happen here? We are literally one Democrat administration away from becoming unable to elect our own people without the help of the invaders. permalink award report block reply\nhenri_derelicte 1 points 1 hour ago I think we need to radicalize in terms of our tactics. Imagine if we had DAs and judges in our pocket who would turn a blind eye as we intercepted and burned mail in ballots. Or eliminated left wing pundits and political operatives. Or having something like the BLM riots being violently suppressed. What if we got powerful and aggressive to the point where the left realized they couldn’t vote their way out of this mess? Where no amount of vote rigging could save them? And they know full well that our side is so heavily armed that they would lose a hot civil war quickly and decisively? permalink award report block reply"}