{"id": "1ARK590Lcx", "contents": "1033 Mamdani gives his muslim propaganda speech to a crowd of fellow pagans in New York City. posted 4 days ago by BreakfastGun 102 comments award share report block Gunther Eagleman™ @GuntherEagleman • 4d MAMDANI: “This is the first event I’ve done since I won the election last Tuesday” CROWD: “Allah Akbar” NYC is done.\n102 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget TheRedPilledArtist 73 points 4 days ago There will come a time when this will need to be dealt with. permalink award report block reply AbrahamLincoln 70 points 4 days ago That time was 631 AD. permalink parent award report block reply maltese-poodle 19 points 4 days ago These people need to be deported, period. Stop worrying about optics. Islam is a national security threat and must be dealt with as such. permalink parent award report block reply Meddlesom 9 points 4 days ago Deported from this plane of existence. permalink parent award report block reply Glory-Unto-God 3 points 4 days ago Simply deported? Sir you are still worrying about optics permalink parent award report block reply America_No_1 23 points 4 days ago Its being dealt with but slowly.  Their kids will get addicted to porn and gambling and drugs and sex too.  They've made a mistake. permalink parent award report block reply MagaJay02 13 points 4 days ago Good point. The majority of them will abandon their ways. permalink parent award report block reply mikethemarine 8 points 4 days ago nope, even their own parents will kill them from getting away from their faith, they will all starve soon enough and start a war to push their will on the country. THEN THE SHIT HITS THE FAN, no deportation necessary permalink parent award report block reply BidensPrisonWallet 4 points 4 days ago I really do want to see sharia morality police paroling Manhattan and whipping liberal white women with their horse switches. I witnessed this in Riyadh in the 90's and our liberal white women need to experience some of that. How often does a voter really get to reap the benefits of their vote? permalink parent award report block reply view 2 more comments... Fine_Kentucky_Jenkum 11 points 4 days ago You act as if Muslim men don’t engage in all that activity anyway. But they will always keep the “Muslim” identity, and will fight on that side over Americans all day long. permalink parent award report block reply America_No_1 2 points 4 days ago Yea permalink parent award report block reply fskfsk 2 points 3 days ago That is the rumor, that apostasy and Western culture will win out.  I'm skeptical, but other people claim it's working. This is why Muslims live in enclaves where they are close to 100% of the population.  That enables them to control and spy on people all the time, making sure they don't stray, killing them if necessary.  If there's a 100% Muslim enclave, it's a de facto Sharia Law zone, because no Muslim will report anything to the police.  You can honor kill your daughter for doubting Islam, bury the body, nobody calls the cops, nobody gets prosecuted, nobody will ever know. permalink parent award report block reply Tellman125 1 points 3 days ago Whose kids? Muslims' kids? permalink parent award report block reply Youngman1234 19 points 4 days ago Tactical nukes, my friend. permalink parent award report block reply TrumpMagaNoBama 5 points 4 days ago From orbit, it's the only way to be sure. permalink parent award report block reply TwoArizonaPedes 6 points 4 days ago We're fighting now. Join us! permalink parent award report block reply NotYourMan 2 points 3 days ago Lets remember that its not a religion of peace.  From 1000 AD to 1500 AD, Muslims invaded and colonized western India.  During that 500 years as many as 80 million Hindus were killed.  While doing this, Muslims took the most slaves in history.  This still continues to be the most people killed during conquest in history.  Anybody saying its the religion of peace is ignorant of history. permalink parent award report block reply load 5 more comments... Steelers-Fans-Suck 41 points 4 days ago Fuck \"Allah\" permalink award report block reply TrumpYe2023 25 points 4 days ago And that fucking snackbar. permalink parent award report block reply OldZilla 3 points 4 days ago Who? permalink parent award report block reply LineInTheSand 4 points 4 days ago Admiral Snackbar.  You know, the guy who said \"It's a trap!\" permalink parent award report block reply TrumpMagaNoBama 9 points 4 days ago SATAN. permalink parent award report block reply Easzq8 6 points 4 days ago Actually, Allah is Ba’al. permalink parent award report block reply TrumpMagaNoBama 5 points 4 days ago Evil by any other name, just as Evil! permalink parent award report block reply vote_for_MAGA_2020 8 points 4 days ago Are there any liberals screeching about separation of church and state now?? permalink parent award report block reply LandscaperJuan 2 points 3 days ago That is a SEVERELY UNDER-RATED POINT. permalink parent award report block reply utfanx2 26 points 4 days ago They forgot. permalink award report block reply snoopy3210 7 points 4 days ago The army also forgot because they did everything to NOT kill bin Laden too early, as they wanted their money making slush fund to continue..\nBin laden was spotted in early 2002 in Afghanistan by the French troops and they were told by the US to NOT kill him. That wasn’t part of the plan that the fat turd CIA advisor Joseph Cofer Black had in mind (the man who convinced Bush to go in with a large invasion rather than a targeted mission) permalink parent award report block reply TwoArizonaPedes 6 points 4 days ago We haven't. Join us! permalink parent award report block reply SimaYi 2 points 4 days ago They're all gone. New York is 20% White. permalink parent award report block reply Executarian2 -5 points 4 days ago Well, Israel did 9/11, so it seems like they're finally genuinely avenging it. permalink parent award report block reply schnazzmizzle 26 points 4 days ago Muhammad is a dead pedophile. permalink award report block reply NewGoldenAge 16 points 4 days ago How is his guard? Can he be shot like Charlie? They seemed to celebrate the murder of us. They should be cool with RETURN FUCKING FIRE permalink award report block reply RememberCharlieKirk 5 points 4 days ago Removing him by such manner would be a pyrrhic victory -- yes, that sentiment may channel the energy of \"If you kill your enemies, they win.\" However, as Scott Adams argues, the Democrats are safe from assassination attempts because they have no one who is irreplaceable. Do you really believe that NYC does not have another communist/foreigner ready to become mayor on the support of the massive demographic shift over the last twenty years? permalink parent award report block reply guywholikesDjtof2024 3 points 4 days ago is Jesus God? permalink parent award report block reply RememberCharlieKirk 3 points 4 days ago What an interesting, off-tangent comment. ...Yes, I am of the belief that Jesus is God. permalink parent award report block reply guywholikesDjtof2024 2 points 4 days ago Ultra hyperbased. https://AnswersinGenesis.org https://Creation.com Btw, LOVE your name. And also, why don't you post main posts? You know, like images or links and stuff? permalink parent award report block reply view 1 more comments... NewGoldenAge 1 points 3 days ago bANG permalink parent award report block reply SimaYi 0 points 4 days ago Why? Do you live in NYC? If not, who cares? You act like you have a country. You don't. The best you've got is a neighborhood. permalink parent award report block reply NewGoldenAge 1 points 3 days ago Comment removed by community filter. permalink parent award report block reply GoldwaterVoter 14 points 4 days ago Can't listen to his bullshit. permalink award report block reply SimaYi 2 points 4 days ago I think it's hilarious. Too many normies don't get that they don't have a country. Accelerate. permalink parent award report block reply Tellman125 1 points 3 days ago And then after things have accelerated, what happens? permalink parent award report block reply Hamadryad 13 points 4 days ago Someone should burn the Quran in NYC and see what he tries to do. permalink award report block reply Tellman125 1 points 3 days ago The only one with the power to do anything here is Trump, who has been posting about the guy for the past 5 months and told a crowd in Miami the other day \"we'll take care of it,\" so I'm just sitting here and watching for that for the next 7 weeks until the mayoral inauguration. This is the only video I can find of the clip itself - at 0:50 https://www.facebook.com/ABCNews/videos/trump-goes-after-mamdani-a-day-after-nyc-mayoral-election/1531268354726259/ permalink parent award report block reply FusionBlack 12 points 4 days ago Not just New York. They want us dead. Has 911 been forgotten entirely? permalink award report block reply TwoArizonaPedes 8 points 4 days ago We're fighting back. Join us! permalink parent award report block reply RememberCharlieKirk 2 points 4 days ago The current demographics of NYC are not the same as before the 9/11 terrorist attack. If the census and exit polls are to be believed, NYC is composed of roughly 60% foreign-born residents and many of whom have arrived in just the past few years. These new voters did not forget 9/11. Rather, they do not care about 9/11; they did not even live through 9/11. \"Some people did something.\" permalink parent award report block reply ThePatriotGames2016 1 points 4 days ago no. 911 was the catalyst and intentional and depended on 90s tolerance bullshit and (they) the government knows it and depended on it to work that way. they play the long game, and we can't sit through a fucking 20 minute tv show that they feed us for brain rot. permalink parent award report block reply Quiznos585 9 points 4 days ago He needs to be arrested. I don’t care anymore. Go full on Gestapo. That’s what they are doing to us. Mamdani, Omar, Talib, AOC, Pressley, Boasberg, …all of them. Arrest. permalink award report block reply SimaYi 1 points 4 days ago lol. The impotence on this site is hilarious. You don't have a country dude. You have diversity. Why can't a muslim be mayor of NYC? If a muslim can be a manager of a Walmart then why can't he be mayor? He won by merit, Trump's favorite thing. White people have lost the United States, and when you're a White minority in 10 years, it's just going to get worse. Elect 100 Trumps. It doesn't matter. The only way this country is saved is by deporting 100 million foreigners, which is basically impossible without the military, which will never be used. You also assume that they will go willingly. Why would they? There are 100 million of them, and plenty of miltary aged males. It's over. You are going to watch the United States disappear and there isn't a God damn thing you can do about it. Best thing, is it's all going to happen legally , and the great laws of the country and muh constitution and le democracy will prevent you from doing anything. You've lost before you even knew you were fighting. You were all tricked into \"equality\" and not being \"racist\". Now you don't have a country. They've already won. permalink parent award report block reply Tellman125 1 points 3 days ago Even posting that type of lengthy comment, where genuinely defeatist/doomist or just reverse-psychological (\"You're all impotent, we've already lost the country, nothing we do matters, it's over\") shows that you actually still believe in being political active and making a difference; you shows more concern and faith in your and OUR power through that act of speaking out (in writing, on social media) than what was shown by millions of New York City adults who choose not to vote in the mayoral election, despite having a week and half to do so. In the most recently presidential election, the conservative Republican won, and in the most recent Senate and House elections, a Republican majority prevailed. \"One shit city does not a shit country make.\" There are other urban shithole cities we have: combine Seattle, Portland, Los Angeles (where the crime has been affected fancy parts of WEST LA for years now, as I know from visiting there), and a big part of Chicago - that combined population (.781K + 635K + 3.8M + 2.7M = 7.9M) not far from that of NYC (8.4M), and THOSE 4 horrendous cities don't represent most of our country. If Kamala were president right now, I'd have a different view, but Biden only won because of the cheating, as Trump proved when he roared back into office by rightfully winning all 6 of the states that Biden stole. And speaking of elections, the fact that the NYC race had 3 candidates was something that split the vote in Scamdummy's favor--he won with 50.4% while the other two had to spend time fighting each other as well as fighting him. Conversely, in the 2021 Democrat primary, it was 4 stridently woke primary candidates who split the vote in favor of the non-woke candidate, Eric Adams, who only ever talked about law and order and didn't pander to wokeness; he won, absurdly, with 30.7% of the vote: https://en.wikipedia.org/wiki/2021_New_York_City_Democratic_mayoral_primary permalink parent award report block reply Anyone 8 points 4 days ago Americans are stupid... specially voting for moslem communists... you can't get any more stupider... permalink award report block reply FirstBorn 7 points 4 days ago Peeps should buy as many billboard spaces as possible in NYC and have it read:\n\"Allah Is Satan!\"\nand,\n\"Jesus Saves\"\nSee how long it takes for this POS to take it down. Aloha Snackbar, MF'er! 🤣 🤣 🤣 permalink award report block reply DiamondDroid 7 points 4 days ago Make bacon and pork great again permalink award report block reply cupocovfefe 7 points 4 days ago Reminds me,  I need to go buy some more deodorant. permalink award report block reply bn1856 7 points 4 days ago the enemy is inside the gate permalink award report block reply SimaYi 3 points 4 days ago Enemy on the throne. permalink parent award report block reply Tellman125 1 points 3 days ago Well, in NYC, but Trump assured that Miami crowd the other day \"We'll take care of it, don't worry about it.\" The mayoral inauguration is in 7 weeks from now, so that gives Trump 7 weeks to show us what he means by \"take care of it,\" because I hope it's NOT just to use Mamdani as the main Midterms talking-point - \"It's the Party of Mamdani now! Look at what's happened to New York this year!\" I HOPE he's not going to sacrifice NYC and can go after Scamdummy like he went after Bolton and Peekaboo, and SOON. permalink parent award report block reply AwShitHereWeGoAgain 7 points 4 days ago Wanna bet they won't prosecute any Aloha Snackbars in 2026???? permalink award report block reply Hanging_Chad 6 points 4 days ago prosecuting them could cause terrorisms, you bigot permalink parent award report block reply NewGoldenAge 7 points 4 days ago Did Charlie get shot? Yes. Can he? Yes. Yes he can. permalink award report block reply PapaPepe 6 points 4 days ago But, the media said he was the most christian guy ever permalink award report block reply HankScorpio 5 points 4 days ago Mohammad was white with red hair. He was a white Irish looking fucker. permalink award report block reply TrumpMagaNoBama 8 points 4 days ago He was Fake and Ghey!  Zutt! Zutt! permalink parent award report block reply TwoArizonaPedes 8 points 4 days ago For anyone who doesn't get that reference yet: \"Can Muslims Explain the Weirdest Story About Muhammad Ever?\" https://youtu.be/jtTYxxmVpvA?si=1O0pEDU8t7LZ113y 10-minute video by Dr. David Wood. Worth the watch! permalink parent award report block reply Lady_MaGa 4 points 4 days ago He was Harry? permalink parent award report block reply Psarg 3 points 4 days ago Harry is a descendant of Muhammed permalink parent award report block reply Lady_MaGa 1 points 4 days ago I thought Harry was a descendant of Vlad the Impaler.  King Charles said so when he was Prince Charles. permalink parent award report block reply MAGALADON9 4 points 3 days ago Technically not pagans. They are a monotheistic Abrahamic based system - now true it's 85% political and basicly picked and chose from Judaism and Christianity and added nothing new except leaned in on violence and such. permalink award report block reply ApprenticeParty 2 points 3 days ago The foundation of the religion is Arab paganism. They spackled over with some Unitarian Christian heresies and called it monotheistic and abrahamic, but it’s absolutely pagan at its root. permalink parent award report block reply MAGALADON9 1 points 3 days ago [Long pause, while looking down. Sighs* looks up] I have studied theology in actual universities and have lived and worked in the middle east north Africa (mena) region; i have studied the Quran the Hadiths all the Sunnah i have also studied archeology of the region and how various religions impacted cultures in different but significant ways. I've written several books on Islam specifically and have actually been to Mecca and all of the holy sites. I have poured over linguistic differences between arcaic Arabic and modern  Arabic; three types of Greek, Aramaic, and Hebrew and compared obscure letters and passages that even indirectly discuss Islam Christianity or Mithras or Zoroastrians and more. And....  Islam is not based on Arab paganism. I understand you think that's an \"own\" and you are dunking on them but it's just embarrassingly incorrect.  Islam has traces and bits of Arab paganism just as Christianity has echoes of European paganism, but to say it is a foundation is silly. permalink parent award report block reply ApprenticeParty 2 points 3 days ago Please link to your books, I’d love to read them. I’d hardly call one of the 5 pillars of the religion “echos”. You’ve personally been a historically pagan site, where Muslims partake in pagan rituals and worship one of the gods of the Arabian pantheon - Islamic history shows “Allah” as a pagan god, Muhammad’s father was named “slave of Allah” and Muhammad’s father died 4 years before Muhammad was born, let alone before any revelation. The pagan daughters of Allah are included in the religion. Any claims that this is not pagan is simply due to illegality of investigating such claims and the destruction of evidence starting in the 6th century when the other kabbas of different Arabian areas were destroyed. Borrowing stories from the infancy gospel and other gnostic works and from the Talmud ( especially the Talmud) doesn’t make a religion Abrahamic. If that were to be the case, true satanism worshipping Lucifer would be abrahamic as well. I’m presuming you would dispute that. permalink parent award report block reply MAGALADON9 1 points 3 days ago It's kind of like human genetic relationships at some point there may be some connection but I would say all religions including Christianity and perhaps more than most are \"tainted\" with paganism. But we have to define foundations Yes Arab pagans went to Mecca long before Islam and they new religion adopted customs of the past ones, but foundational no. Ancient Hebrews or the people.of them had many gods though most Christians will deny this but facts are stubborn things. Jewish folklore still refers to yhwh's wife as the comforter who would drape her cloak over the children of earth to shield them from \"arrows or spears\" thrown in rage. However socio-emotional necessity caused early jews to ditch much of this as their was too much overlap with neighbor's goddesses. In facts you can still see how \"harlot\" is in one example translated from a word that mean \"priestess\".  There are many other examples A solar God born shortly after the winter solstice (dec 25th ish) Had 12 followers Wandered around healing people. Known as the good Shepard and the lamb The list is endless. Jesus became popular because it was a story they were familiar with. Romans particularly liked mithras and fixated on blood sacrifice for atonement of sins, and it was not Jesus that fixated on \"the blood the blood  the blood.... washing over you...\" that was mithras and Paul and where did he come? Tarsus and what was Tarsus? Chief Capitol of mithras worship, naturally he was influenced  - this man who never walked with Jesus during his ministry and whose message has a different feel, but he wrote 2/3rds of the new testament- this man who claims to have walked with jesus' ghost alone with no witnesses....   im just sayin  if you want to go down the road of how religions merge and shift and combine you might not like what you find. Islam - which i loathe BTW-   is a monotheistic Abrahamic religion that explicitly builds on Judaism and Christianity as prior revelations from the same God (Allah). Its core theology—strict monotheism (tawhid), prophethood, angels, scriptures, and judgment—is directly derived from and reframes the Torah and Gospel. The Qur’an positions Muhammad as the final prophet in the same line as Abraham, Moses, and Jesus. While pre-Islamic Arab pagan practices (e.g., the Kaaba, pilgrimage rituals) were retained and repurposed, they were stripped of polytheism and subordinated to monotheistic worship. These are cultural forms, not foundational doctrines. The theological and legal foundation of Islam rests on Jewish and Christian scriptures (as understood and corrected by the Qur’an), not paganism. As for my books I will not dox myself as my feelings on Islam specifically are  tremendously dangerous. permalink parent award report block reply view 3 more comments... ThePatriotGames2016 4 points 4 days ago better get your guns and report to General Washington. permalink award report block reply WarlordObama 3 points 3 days ago Allahtifa permalink award report block reply cs21212 3 points 4 days ago Gunther took money from the India lobby a few months back. You should not be giving this traitor clicks permalink award report block reply Hanging_Chad 3 points 4 days ago boner protruding, very disrespectful permalink award report block reply Siteless_Vagrant 3 points 4 days ago Don’t insult Pagans. permalink award report block reply Patroklos_Maga 3 points 4 days ago What's the difference between New York and Dearborn now? permalink award report block reply SimaYi 2 points 4 days ago Do you like, not live in a big city? They are massively non-White. Whites are already a minority in them. Your country is gone. permalink parent award report block reply Tellman125 1 points 3 days ago But the whites who live in those cities live, work, and go out IN the white parts, and the cities are very racially divided up. I live in West Midtown Manhattan but have never been to Harlem, even though it's less than 4 short miles away from me and I could get there in literally 1 subway stop on the uptown A train. Likewise, the Upper East Side, which is the richest neighborhood in NYC and is very safe and clean, is right next to East Harlem (aka Spanish Harlem), which is dangerous and squalid and full of housing projects; the dividing line is East 96th Street. permalink parent award report block reply Tellman125 1 points 3 days ago Mayor-elect Moron Scamdummy doesn't take office until Jan 1, and Trump said the other day \"We lost a bit of sovereignty the other day [in NYC]. We'll take care of it, don't worry about it,\" and I wonder if that means he actually plans to DO anything in that time. It's been only 5 fuckin days since that guy was elected and the news cycle is already nonstop with him, hundreds of articles a day. permalink parent award report block reply OmegaBird 2 points 3 days ago NYC gets what it fucking deserves. permalink award report block reply BlockWorks 2 points 4 days ago All those fentanyl drug busts... all these saracens that love to hang out in large groups.... permalink award report block reply SimaYi 2 points 4 days ago lol permalink award report block reply AlmostFullyDilated 2 points 4 days ago all musmils must die permalink award report block reply Riehlpissed 2 points 3 days ago Hand to Koran to take the “oath” of fk everything up worse to finish the job. permalink award report block reply AppalachianTactical 1 points 4 days ago Have you ever seen a hardcore muslim wearing a yarmulke as much as this one? permalink award report block reply nice187 -1 points 4 days ago Hell yeah!  Europe finally starts in USA!  😂 permalink award report block reply throwaway29834751 1 points 4 days ago Comment removed by community moderators, pending further review. permalink award report block reply\nTheRedPilledArtist 73 points 4 days ago There will come a time when this will need to be dealt with. permalink award report block reply AbrahamLincoln 70 points 4 days ago That time was 631 AD. permalink parent award report block reply maltese-poodle 19 points 4 days ago These people need to be deported, period. Stop worrying about optics. Islam is a national security threat and must be dealt with as such. permalink parent award report block reply Meddlesom 9 points 4 days ago Deported from this plane of existence. permalink parent award report block reply Glory-Unto-God 3 points 4 days ago Simply deported? Sir you are still worrying about optics permalink parent award report block reply America_No_1 23 points 4 days ago Its being dealt with but slowly.  Their kids will get addicted to porn and gambling and drugs and sex too.  They've made a mistake. permalink parent award report block reply MagaJay02 13 points 4 days ago Good point. The majority of them will abandon their ways. permalink parent award report block reply mikethemarine 8 points 4 days ago nope, even their own parents will kill them from getting away from their faith, they will all starve soon enough and start a war to push their will on the country. THEN THE SHIT HITS THE FAN, no deportation necessary permalink parent award report block reply BidensPrisonWallet 4 points 4 days ago I really do want to see sharia morality police paroling Manhattan and whipping liberal white women with their horse switches. I witnessed this in Riyadh in the 90's and our liberal white women need to experience some of that. How often does a voter really get to reap the benefits of their vote? permalink parent award report block reply view 2 more comments... Fine_Kentucky_Jenkum 11 points 4 days ago You act as if Muslim men don’t engage in all that activity anyway. But they will always keep the “Muslim” identity, and will fight on that side over Americans all day long. permalink parent award report block reply America_No_1 2 points 4 days ago Yea permalink parent award report block reply fskfsk 2 points 3 days ago That is the rumor, that apostasy and Western culture will win out.  I'm skeptical, but other people claim it's working. This is why Muslims live in enclaves where they are close to 100% of the population.  That enables them to control and spy on people all the time, making sure they don't stray, killing them if necessary.  If there's a 100% Muslim enclave, it's a de facto Sharia Law zone, because no Muslim will report anything to the police.  You can honor kill your daughter for doubting Islam, bury the body, nobody calls the cops, nobody gets prosecuted, nobody will ever know. permalink parent award report block reply Tellman125 1 points 3 days ago Whose kids? Muslims' kids? permalink parent award report block reply Youngman1234 19 points 4 days ago Tactical nukes, my friend. permalink parent award report block reply TrumpMagaNoBama 5 points 4 days ago From orbit, it's the only way to be sure. permalink parent award report block reply TwoArizonaPedes 6 points 4 days ago We're fighting now. Join us! permalink parent award report block reply NotYourMan 2 points 3 days ago Lets remember that its not a religion of peace.  From 1000 AD to 1500 AD, Muslims invaded and colonized western India.  During that 500 years as many as 80 million Hindus were killed.  While doing this, Muslims took the most slaves in history.  This still continues to be the most people killed during conquest in history.  Anybody saying its the religion of peace is ignorant of history. permalink parent award report block reply load 5 more comments...\nAbrahamLincoln 70 points 4 days ago That time was 631 AD. permalink parent award report block reply maltese-poodle 19 points 4 days ago These people need to be deported, period. Stop worrying about optics. Islam is a national security threat and must be dealt with as such. permalink parent award report block reply Meddlesom 9 points 4 days ago Deported from this plane of existence. permalink parent award report block reply Glory-Unto-God 3 points 4 days ago Simply deported? Sir you are still worrying about optics permalink parent award report block reply\nmaltese-poodle 19 points 4 days ago These people need to be deported, period. Stop worrying about optics. Islam is a national security threat and must be dealt with as such. permalink parent award report block reply Meddlesom 9 points 4 days ago Deported from this plane of existence. permalink parent award report block reply Glory-Unto-God 3 points 4 days ago Simply deported? Sir you are still worrying about optics permalink parent award report block reply\nMeddlesom 9 points 4 days ago Deported from this plane of existence. permalink parent award report block reply\nGlory-Unto-God 3 points 4 days ago Simply deported? Sir you are still worrying about optics permalink parent award report block reply\nAmerica_No_1 23 points 4 days ago Its being dealt with but slowly.  Their kids will get addicted to porn and gambling and drugs and sex too.  They've made a mistake. permalink parent award report block reply MagaJay02 13 points 4 days ago Good point. The majority of them will abandon their ways. permalink parent award report block reply mikethemarine 8 points 4 days ago nope, even their own parents will kill them from getting away from their faith, they will all starve soon enough and start a war to push their will on the country. THEN THE SHIT HITS THE FAN, no deportation necessary permalink parent award report block reply BidensPrisonWallet 4 points 4 days ago I really do want to see sharia morality police paroling Manhattan and whipping liberal white women with their horse switches. I witnessed this in Riyadh in the 90's and our liberal white women need to experience some of that. How often does a voter really get to reap the benefits of their vote? permalink parent award report block reply view 2 more comments... Fine_Kentucky_Jenkum 11 points 4 days ago You act as if Muslim men don’t engage in all that activity anyway. But they will always keep the “Muslim” identity, and will fight on that side over Americans all day long. permalink parent award report block reply America_No_1 2 points 4 days ago Yea permalink parent award report block reply fskfsk 2 points 3 days ago That is the rumor, that apostasy and Western culture will win out.  I'm skeptical, but other people claim it's working. This is why Muslims live in enclaves where they are close to 100% of the population.  That enables them to control and spy on people all the time, making sure they don't stray, killing them if necessary.  If there's a 100% Muslim enclave, it's a de facto Sharia Law zone, because no Muslim will report anything to the police.  You can honor kill your daughter for doubting Islam, bury the body, nobody calls the cops, nobody gets prosecuted, nobody will ever know. permalink parent award report block reply Tellman125 1 points 3 days ago Whose kids? Muslims' kids? permalink parent award report block reply\nMagaJay02 13 points 4 days ago Good point. The majority of them will abandon their ways. permalink parent award report block reply mikethemarine 8 points 4 days ago nope, even their own parents will kill them from getting away from their faith, they will all starve soon enough and start a war to push their will on the country. THEN THE SHIT HITS THE FAN, no deportation necessary permalink parent award report block reply BidensPrisonWallet 4 points 4 days ago I really do want to see sharia morality police paroling Manhattan and whipping liberal white women with their horse switches. I witnessed this in Riyadh in the 90's and our liberal white women need to experience some of that. How often does a voter really get to reap the benefits of their vote? permalink parent award report block reply view 2 more comments...\nmikethemarine 8 points 4 days ago nope, even their own parents will kill them from getting away from their faith, they will all starve soon enough and start a war to push their will on the country. THEN THE SHIT HITS THE FAN, no deportation necessary permalink parent award report block reply BidensPrisonWallet 4 points 4 days ago I really do want to see sharia morality police paroling Manhattan and whipping liberal white women with their horse switches. I witnessed this in Riyadh in the 90's and our liberal white women need to experience some of that. How often does a voter really get to reap the benefits of their vote? permalink parent award report block reply view 2 more comments...\nBidensPrisonWallet 4 points 4 days ago I really do want to see sharia morality police paroling Manhattan and whipping liberal white women with their horse switches. I witnessed this in Riyadh in the 90's and our liberal white women need to experience some of that. How often does a voter really get to reap the benefits of their vote? permalink parent award report block reply view 2 more comments...\nFine_Kentucky_Jenkum 11 points 4 days ago You act as if Muslim men don’t engage in all that activity anyway. But they will always keep the “Muslim” identity, and will fight on that side over Americans all day long. permalink parent award report block reply America_No_1 2 points 4 days ago Yea permalink parent award report block reply\nAmerica_No_1 2 points 4 days ago Yea permalink parent award report block reply\nfskfsk 2 points 3 days ago That is the rumor, that apostasy and Western culture will win out.  I'm skeptical, but other people claim it's working. This is why Muslims live in enclaves where they are close to 100% of the population.  That enables them to control and spy on people all the time, making sure they don't stray, killing them if necessary.  If there's a 100% Muslim enclave, it's a de facto Sharia Law zone, because no Muslim will report anything to the police.  You can honor kill your daughter for doubting Islam, bury the body, nobody calls the cops, nobody gets prosecuted, nobody will ever know. permalink parent award report block reply\nTellman125 1 points 3 days ago Whose kids? Muslims' kids? permalink parent award report block reply\nYoungman1234 19 points 4 days ago Tactical nukes, my friend. permalink parent award report block reply TrumpMagaNoBama 5 points 4 days ago From orbit, it's the only way to be sure. permalink parent award report block reply\nTrumpMagaNoBama 5 points 4 days ago From orbit, it's the only way to be sure. permalink parent award report block reply\nTwoArizonaPedes 6 points 4 days ago We're fighting now. Join us! permalink parent award report block reply\nNotYourMan 2 points 3 days ago Lets remember that its not a religion of peace.  From 1000 AD to 1500 AD, Muslims invaded and colonized western India.  During that 500 years as many as 80 million Hindus were killed.  While doing this, Muslims took the most slaves in history.  This still continues to be the most people killed during conquest in history.  Anybody saying its the religion of peace is ignorant of history. permalink parent award report block reply\nSteelers-Fans-Suck 41 points 4 days ago Fuck \"Allah\" permalink award report block reply TrumpYe2023 25 points 4 days ago And that fucking snackbar. permalink parent award report block reply OldZilla 3 points 4 days ago Who? permalink parent award report block reply LineInTheSand 4 points 4 days ago Admiral Snackbar.  You know, the guy who said \"It's a trap!\" permalink parent award report block reply TrumpMagaNoBama 9 points 4 days ago SATAN. permalink parent award report block reply Easzq8 6 points 4 days ago Actually, Allah is Ba’al. permalink parent award report block reply TrumpMagaNoBama 5 points 4 days ago Evil by any other name, just as Evil! permalink parent award report block reply vote_for_MAGA_2020 8 points 4 days ago Are there any liberals screeching about separation of church and state now?? permalink parent award report block reply LandscaperJuan 2 points 3 days ago That is a SEVERELY UNDER-RATED POINT. permalink parent award report block reply\nTrumpYe2023 25 points 4 days ago And that fucking snackbar. permalink parent award report block reply OldZilla 3 points 4 days ago Who? permalink parent award report block reply LineInTheSand 4 points 4 days ago Admiral Snackbar.  You know, the guy who said \"It's a trap!\" permalink parent award report block reply\nOldZilla 3 points 4 days ago Who? permalink parent award report block reply LineInTheSand 4 points 4 days ago Admiral Snackbar.  You know, the guy who said \"It's a trap!\" permalink parent award report block reply\nLineInTheSand 4 points 4 days ago Admiral Snackbar.  You know, the guy who said \"It's a trap!\" permalink parent award report block reply\nTrumpMagaNoBama 9 points 4 days ago SATAN. permalink parent award report block reply Easzq8 6 points 4 days ago Actually, Allah is Ba’al. permalink parent award report block reply TrumpMagaNoBama 5 points 4 days ago Evil by any other name, just as Evil! permalink parent award report block reply\nEaszq8 6 points 4 days ago Actually, Allah is Ba’al. permalink parent award report block reply TrumpMagaNoBama 5 points 4 days ago Evil by any other name, just as Evil! permalink parent award report block reply\nTrumpMagaNoBama 5 points 4 days ago Evil by any other name, just as Evil! permalink parent award report block reply\nvote_for_MAGA_2020 8 points 4 days ago Are there any liberals screeching about separation of church and state now?? permalink parent award report block reply LandscaperJuan 2 points 3 days ago That is a SEVERELY UNDER-RATED POINT. permalink parent award report block reply\nLandscaperJuan 2 points 3 days ago That is a SEVERELY UNDER-RATED POINT. permalink parent award report block reply\nutfanx2 26 points 4 days ago They forgot. permalink award report block reply snoopy3210 7 points 4 days ago The army also forgot because they did everything to NOT kill bin Laden too early, as they wanted their money making slush fund to continue..\nBin laden was spotted in early 2002 in Afghanistan by the French troops and they were told by the US to NOT kill him. That wasn’t part of the plan that the fat turd CIA advisor Joseph Cofer Black had in mind (the man who convinced Bush to go in with a large invasion rather than a targeted mission) permalink parent award report block reply TwoArizonaPedes 6 points 4 days ago We haven't. Join us! permalink parent award report block reply SimaYi 2 points 4 days ago They're all gone. New York is 20% White. permalink parent award report block reply Executarian2 -5 points 4 days ago Well, Israel did 9/11, so it seems like they're finally genuinely avenging it. permalink parent award report block reply\nsnoopy3210 7 points 4 days ago The army also forgot because they did everything to NOT kill bin Laden too early, as they wanted their money making slush fund to continue..\nBin laden was spotted in early 2002 in Afghanistan by the French troops and they were told by the US to NOT kill him. That wasn’t part of the plan that the fat turd CIA advisor Joseph Cofer Black had in mind (the man who convinced Bush to go in with a large invasion rather than a targeted mission) permalink parent award report block reply\nTwoArizonaPedes 6 points 4 days ago We haven't. Join us! permalink parent award report block reply\nSimaYi 2 points 4 days ago They're all gone. New York is 20% White. permalink parent award report block reply\nExecutarian2 -5 points 4 days ago Well, Israel did 9/11, so it seems like they're finally genuinely avenging it. permalink parent award report block reply\nschnazzmizzle 26 points 4 days ago Muhammad is a dead pedophile. permalink award report block reply\nNewGoldenAge 16 points 4 days ago How is his guard? Can he be shot like Charlie? They seemed to celebrate the murder of us. They should be cool with RETURN FUCKING FIRE permalink award report block reply RememberCharlieKirk 5 points 4 days ago Removing him by such manner would be a pyrrhic victory -- yes, that sentiment may channel the energy of \"If you kill your enemies, they win.\" However, as Scott Adams argues, the Democrats are safe from assassination attempts because they have no one who is irreplaceable. Do you really believe that NYC does not have another communist/foreigner ready to become mayor on the support of the massive demographic shift over the last twenty years? permalink parent award report block reply guywholikesDjtof2024 3 points 4 days ago is Jesus God? permalink parent award report block reply RememberCharlieKirk 3 points 4 days ago What an interesting, off-tangent comment. ...Yes, I am of the belief that Jesus is God. permalink parent award report block reply guywholikesDjtof2024 2 points 4 days ago Ultra hyperbased. https://AnswersinGenesis.org https://Creation.com Btw, LOVE your name. And also, why don't you post main posts? You know, like images or links and stuff? permalink parent award report block reply view 1 more comments... NewGoldenAge 1 points 3 days ago bANG permalink parent award report block reply SimaYi 0 points 4 days ago Why? Do you live in NYC? If not, who cares? You act like you have a country. You don't. The best you've got is a neighborhood. permalink parent award report block reply NewGoldenAge 1 points 3 days ago Comment removed by community filter. permalink parent award report block reply\nRememberCharlieKirk 5 points 4 days ago Removing him by such manner would be a pyrrhic victory -- yes, that sentiment may channel the energy of \"If you kill your enemies, they win.\" However, as Scott Adams argues, the Democrats are safe from assassination attempts because they have no one who is irreplaceable. Do you really believe that NYC does not have another communist/foreigner ready to become mayor on the support of the massive demographic shift over the last twenty years? permalink parent award report block reply guywholikesDjtof2024 3 points 4 days ago is Jesus God? permalink parent award report block reply RememberCharlieKirk 3 points 4 days ago What an interesting, off-tangent comment. ...Yes, I am of the belief that Jesus is God. permalink parent award report block reply guywholikesDjtof2024 2 points 4 days ago Ultra hyperbased. https://AnswersinGenesis.org https://Creation.com Btw, LOVE your name. And also, why don't you post main posts? You know, like images or links and stuff? permalink parent award report block reply view 1 more comments... NewGoldenAge 1 points 3 days ago bANG permalink parent award report block reply\nguywholikesDjtof2024 3 points 4 days ago is Jesus God? permalink parent award report block reply RememberCharlieKirk 3 points 4 days ago What an interesting, off-tangent comment. ...Yes, I am of the belief that Jesus is God. permalink parent award report block reply guywholikesDjtof2024 2 points 4 days ago Ultra hyperbased. https://AnswersinGenesis.org https://Creation.com Btw, LOVE your name. And also, why don't you post main posts? You know, like images or links and stuff? permalink parent award report block reply view 1 more comments...\nRememberCharlieKirk 3 points 4 days ago What an interesting, off-tangent comment. ...Yes, I am of the belief that Jesus is God. permalink parent award report block reply guywholikesDjtof2024 2 points 4 days ago Ultra hyperbased. https://AnswersinGenesis.org https://Creation.com Btw, LOVE your name. And also, why don't you post main posts? You know, like images or links and stuff? permalink parent award report block reply view 1 more comments...\nguywholikesDjtof2024 2 points 4 days ago Ultra hyperbased. https://AnswersinGenesis.org https://Creation.com Btw, LOVE your name. And also, why don't you post main posts? You know, like images or links and stuff? permalink parent award report block reply view 1 more comments...\nNewGoldenAge 1 points 3 days ago bANG permalink parent award report block reply\nSimaYi 0 points 4 days ago Why? Do you live in NYC? If not, who cares? You act like you have a country. You don't. The best you've got is a neighborhood. permalink parent award report block reply NewGoldenAge 1 points 3 days ago Comment removed by community filter. permalink parent award report block reply\nNewGoldenAge 1 points 3 days ago Comment removed by community filter. permalink parent award report block reply\nGoldwaterVoter 14 points 4 days ago Can't listen to his bullshit. permalink award report block reply SimaYi 2 points 4 days ago I think it's hilarious. Too many normies don't get that they don't have a country. Accelerate. permalink parent award report block reply Tellman125 1 points 3 days ago And then after things have accelerated, what happens? permalink parent award report block reply\nSimaYi 2 points 4 days ago I think it's hilarious. Too many normies don't get that they don't have a country. Accelerate. permalink parent award report block reply Tellman125 1 points 3 days ago And then after things have accelerated, what happens? permalink parent award report block reply\nTellman125 1 points 3 days ago And then after things have accelerated, what happens? permalink parent award report block reply\nHamadryad 13 points 4 days ago Someone should burn the Quran in NYC and see what he tries to do. permalink award report block reply Tellman125 1 points 3 days ago The only one with the power to do anything here is Trump, who has been posting about the guy for the past 5 months and told a crowd in Miami the other day \"we'll take care of it,\" so I'm just sitting here and watching for that for the next 7 weeks until the mayoral inauguration. This is the only video I can find of the clip itself - at 0:50 https://www.facebook.com/ABCNews/videos/trump-goes-after-mamdani-a-day-after-nyc-mayoral-election/1531268354726259/ permalink parent award report block reply\nTellman125 1 points 3 days ago The only one with the power to do anything here is Trump, who has been posting about the guy for the past 5 months and told a crowd in Miami the other day \"we'll take care of it,\" so I'm just sitting here and watching for that for the next 7 weeks until the mayoral inauguration. This is the only video I can find of the clip itself - at 0:50 https://www.facebook.com/ABCNews/videos/trump-goes-after-mamdani-a-day-after-nyc-mayoral-election/1531268354726259/ permalink parent award report block reply\nFusionBlack 12 points 4 days ago Not just New York. They want us dead. Has 911 been forgotten entirely? permalink award report block reply TwoArizonaPedes 8 points 4 days ago We're fighting back. Join us! permalink parent award report block reply RememberCharlieKirk 2 points 4 days ago The current demographics of NYC are not the same as before the 9/11 terrorist attack. If the census and exit polls are to be believed, NYC is composed of roughly 60% foreign-born residents and many of whom have arrived in just the past few years. These new voters did not forget 9/11. Rather, they do not care about 9/11; they did not even live through 9/11. \"Some people did something.\" permalink parent award report block reply ThePatriotGames2016 1 points 4 days ago no. 911 was the catalyst and intentional and depended on 90s tolerance bullshit and (they) the government knows it and depended on it to work that way. they play the long game, and we can't sit through a fucking 20 minute tv show that they feed us for brain rot. permalink parent award report block reply\nTwoArizonaPedes 8 points 4 days ago We're fighting back. Join us! permalink parent award report block reply\nRememberCharlieKirk 2 points 4 days ago The current demographics of NYC are not the same as before the 9/11 terrorist attack. If the census and exit polls are to be believed, NYC is composed of roughly 60% foreign-born residents and many of whom have arrived in just the past few years. These new voters did not forget 9/11. Rather, they do not care about 9/11; they did not even live through 9/11. \"Some people did something.\" permalink parent award report block reply\nThePatriotGames2016 1 points 4 days ago no. 911 was the catalyst and intentional and depended on 90s tolerance bullshit and (they) the government knows it and depended on it to work that way. they play the long game, and we can't sit through a fucking 20 minute tv show that they feed us for brain rot. permalink parent award report block reply\nQuiznos585 9 points 4 days ago He needs to be arrested. I don’t care anymore. Go full on Gestapo. That’s what they are doing to us. Mamdani, Omar, Talib, AOC, Pressley, Boasberg, …all of them. Arrest. permalink award report block reply SimaYi 1 points 4 days ago lol. The impotence on this site is hilarious. You don't have a country dude. You have diversity. Why can't a muslim be mayor of NYC? If a muslim can be a manager of a Walmart then why can't he be mayor? He won by merit, Trump's favorite thing. White people have lost the United States, and when you're a White minority in 10 years, it's just going to get worse. Elect 100 Trumps. It doesn't matter. The only way this country is saved is by deporting 100 million foreigners, which is basically impossible without the military, which will never be used. You also assume that they will go willingly. Why would they? There are 100 million of them, and plenty of miltary aged males. It's over. You are going to watch the United States disappear and there isn't a God damn thing you can do about it. Best thing, is it's all going to happen legally , and the great laws of the country and muh constitution and le democracy will prevent you from doing anything. You've lost before you even knew you were fighting. You were all tricked into \"equality\" and not being \"racist\". Now you don't have a country. They've already won. permalink parent award report block reply Tellman125 1 points 3 days ago Even posting that type of lengthy comment, where genuinely defeatist/doomist or just reverse-psychological (\"You're all impotent, we've already lost the country, nothing we do matters, it's over\") shows that you actually still believe in being political active and making a difference; you shows more concern and faith in your and OUR power through that act of speaking out (in writing, on social media) than what was shown by millions of New York City adults who choose not to vote in the mayoral election, despite having a week and half to do so. In the most recently presidential election, the conservative Republican won, and in the most recent Senate and House elections, a Republican majority prevailed. \"One shit city does not a shit country make.\" There are other urban shithole cities we have: combine Seattle, Portland, Los Angeles (where the crime has been affected fancy parts of WEST LA for years now, as I know from visiting there), and a big part of Chicago - that combined population (.781K + 635K + 3.8M + 2.7M = 7.9M) not far from that of NYC (8.4M), and THOSE 4 horrendous cities don't represent most of our country. If Kamala were president right now, I'd have a different view, but Biden only won because of the cheating, as Trump proved when he roared back into office by rightfully winning all 6 of the states that Biden stole. And speaking of elections, the fact that the NYC race had 3 candidates was something that split the vote in Scamdummy's favor--he won with 50.4% while the other two had to spend time fighting each other as well as fighting him. Conversely, in the 2021 Democrat primary, it was 4 stridently woke primary candidates who split the vote in favor of the non-woke candidate, Eric Adams, who only ever talked about law and order and didn't pander to wokeness; he won, absurdly, with 30.7% of the vote: https://en.wikipedia.org/wiki/2021_New_York_City_Democratic_mayoral_primary permalink parent award report block reply\nSimaYi 1 points 4 days ago lol. The impotence on this site is hilarious. You don't have a country dude. You have diversity. Why can't a muslim be mayor of NYC? If a muslim can be a manager of a Walmart then why can't he be mayor? He won by merit, Trump's favorite thing. White people have lost the United States, and when you're a White minority in 10 years, it's just going to get worse. Elect 100 Trumps. It doesn't matter. The only way this country is saved is by deporting 100 million foreigners, which is basically impossible without the military, which will never be used. You also assume that they will go willingly. Why would they? There are 100 million of them, and plenty of miltary aged males. It's over. You are going to watch the United States disappear and there isn't a God damn thing you can do about it. Best thing, is it's all going to happen legally , and the great laws of the country and muh constitution and le democracy will prevent you from doing anything. You've lost before you even knew you were fighting. You were all tricked into \"equality\" and not being \"racist\". Now you don't have a country. They've already won. permalink parent award report block reply Tellman125 1 points 3 days ago Even posting that type of lengthy comment, where genuinely defeatist/doomist or just reverse-psychological (\"You're all impotent, we've already lost the country, nothing we do matters, it's over\") shows that you actually still believe in being political active and making a difference; you shows more concern and faith in your and OUR power through that act of speaking out (in writing, on social media) than what was shown by millions of New York City adults who choose not to vote in the mayoral election, despite having a week and half to do so. In the most recently presidential election, the conservative Republican won, and in the most recent Senate and House elections, a Republican majority prevailed. \"One shit city does not a shit country make.\" There are other urban shithole cities we have: combine Seattle, Portland, Los Angeles (where the crime has been affected fancy parts of WEST LA for years now, as I know from visiting there), and a big part of Chicago - that combined population (.781K + 635K + 3.8M + 2.7M = 7.9M) not far from that of NYC (8.4M), and THOSE 4 horrendous cities don't represent most of our country. If Kamala were president right now, I'd have a different view, but Biden only won because of the cheating, as Trump proved when he roared back into office by rightfully winning all 6 of the states that Biden stole. And speaking of elections, the fact that the NYC race had 3 candidates was something that split the vote in Scamdummy's favor--he won with 50.4% while the other two had to spend time fighting each other as well as fighting him. Conversely, in the 2021 Democrat primary, it was 4 stridently woke primary candidates who split the vote in favor of the non-woke candidate, Eric Adams, who only ever talked about law and order and didn't pander to wokeness; he won, absurdly, with 30.7% of the vote: https://en.wikipedia.org/wiki/2021_New_York_City_Democratic_mayoral_primary permalink parent award report block reply\nTellman125 1 points 3 days ago Even posting that type of lengthy comment, where genuinely defeatist/doomist or just reverse-psychological (\"You're all impotent, we've already lost the country, nothing we do matters, it's over\") shows that you actually still believe in being political active and making a difference; you shows more concern and faith in your and OUR power through that act of speaking out (in writing, on social media) than what was shown by millions of New York City adults who choose not to vote in the mayoral election, despite having a week and half to do so. In the most recently presidential election, the conservative Republican won, and in the most recent Senate and House elections, a Republican majority prevailed. \"One shit city does not a shit country make.\" There are other urban shithole cities we have: combine Seattle, Portland, Los Angeles (where the crime has been affected fancy parts of WEST LA for years now, as I know from visiting there), and a big part of Chicago - that combined population (.781K + 635K + 3.8M + 2.7M = 7.9M) not far from that of NYC (8.4M), and THOSE 4 horrendous cities don't represent most of our country. If Kamala were president right now, I'd have a different view, but Biden only won because of the cheating, as Trump proved when he roared back into office by rightfully winning all 6 of the states that Biden stole. And speaking of elections, the fact that the NYC race had 3 candidates was something that split the vote in Scamdummy's favor--he won with 50.4% while the other two had to spend time fighting each other as well as fighting him. Conversely, in the 2021 Democrat primary, it was 4 stridently woke primary candidates who split the vote in favor of the non-woke candidate, Eric Adams, who only ever talked about law and order and didn't pander to wokeness; he won, absurdly, with 30.7% of the vote: https://en.wikipedia.org/wiki/2021_New_York_City_Democratic_mayoral_primary permalink parent award report block reply\nAnyone 8 points 4 days ago Americans are stupid... specially voting for moslem communists... you can't get any more stupider... permalink award report block reply\nFirstBorn 7 points 4 days ago Peeps should buy as many billboard spaces as possible in NYC and have it read:\n\"Allah Is Satan!\"\nand,\n\"Jesus Saves\"\nSee how long it takes for this POS to take it down. Aloha Snackbar, MF'er! 🤣 🤣 🤣 permalink award report block reply\nDiamondDroid 7 points 4 days ago Make bacon and pork great again permalink award report block reply\ncupocovfefe 7 points 4 days ago Reminds me,  I need to go buy some more deodorant. permalink award report block reply\nbn1856 7 points 4 days ago the enemy is inside the gate permalink award report block reply SimaYi 3 points 4 days ago Enemy on the throne. permalink parent award report block reply Tellman125 1 points 3 days ago Well, in NYC, but Trump assured that Miami crowd the other day \"We'll take care of it, don't worry about it.\" The mayoral inauguration is in 7 weeks from now, so that gives Trump 7 weeks to show us what he means by \"take care of it,\" because I hope it's NOT just to use Mamdani as the main Midterms talking-point - \"It's the Party of Mamdani now! Look at what's happened to New York this year!\" I HOPE he's not going to sacrifice NYC and can go after Scamdummy like he went after Bolton and Peekaboo, and SOON. permalink parent award report block reply\nSimaYi 3 points 4 days ago Enemy on the throne. permalink parent award report block reply Tellman125 1 points 3 days ago Well, in NYC, but Trump assured that Miami crowd the other day \"We'll take care of it, don't worry about it.\" The mayoral inauguration is in 7 weeks from now, so that gives Trump 7 weeks to show us what he means by \"take care of it,\" because I hope it's NOT just to use Mamdani as the main Midterms talking-point - \"It's the Party of Mamdani now! Look at what's happened to New York this year!\" I HOPE he's not going to sacrifice NYC and can go after Scamdummy like he went after Bolton and Peekaboo, and SOON. permalink parent award report block reply\nTellman125 1 points 3 days ago Well, in NYC, but Trump assured that Miami crowd the other day \"We'll take care of it, don't worry about it.\" The mayoral inauguration is in 7 weeks from now, so that gives Trump 7 weeks to show us what he means by \"take care of it,\" because I hope it's NOT just to use Mamdani as the main Midterms talking-point - \"It's the Party of Mamdani now! Look at what's happened to New York this year!\" I HOPE he's not going to sacrifice NYC and can go after Scamdummy like he went after Bolton and Peekaboo, and SOON. permalink parent award report block reply\nAwShitHereWeGoAgain 7 points 4 days ago Wanna bet they won't prosecute any Aloha Snackbars in 2026???? permalink award report block reply Hanging_Chad 6 points 4 days ago prosecuting them could cause terrorisms, you bigot permalink parent award report block reply\nHanging_Chad 6 points 4 days ago prosecuting them could cause terrorisms, you bigot permalink parent award report block reply\nNewGoldenAge 7 points 4 days ago Did Charlie get shot? Yes. Can he? Yes. Yes he can. permalink award report block reply\nPapaPepe 6 points 4 days ago But, the media said he was the most christian guy ever permalink award report block reply\nHankScorpio 5 points 4 days ago Mohammad was white with red hair. He was a white Irish looking fucker. permalink award report block reply TrumpMagaNoBama 8 points 4 days ago He was Fake and Ghey!  Zutt! Zutt! permalink parent award report block reply TwoArizonaPedes 8 points 4 days ago For anyone who doesn't get that reference yet: \"Can Muslims Explain the Weirdest Story About Muhammad Ever?\" https://youtu.be/jtTYxxmVpvA?si=1O0pEDU8t7LZ113y 10-minute video by Dr. David Wood. Worth the watch! permalink parent award report block reply Lady_MaGa 4 points 4 days ago He was Harry? permalink parent award report block reply Psarg 3 points 4 days ago Harry is a descendant of Muhammed permalink parent award report block reply Lady_MaGa 1 points 4 days ago I thought Harry was a descendant of Vlad the Impaler.  King Charles said so when he was Prince Charles. permalink parent award report block reply\nTrumpMagaNoBama 8 points 4 days ago He was Fake and Ghey!  Zutt! Zutt! permalink parent award report block reply TwoArizonaPedes 8 points 4 days ago For anyone who doesn't get that reference yet: \"Can Muslims Explain the Weirdest Story About Muhammad Ever?\" https://youtu.be/jtTYxxmVpvA?si=1O0pEDU8t7LZ113y 10-minute video by Dr. David Wood. Worth the watch! permalink parent award report block reply\nTwoArizonaPedes 8 points 4 days ago For anyone who doesn't get that reference yet: \"Can Muslims Explain the Weirdest Story About Muhammad Ever?\" https://youtu.be/jtTYxxmVpvA?si=1O0pEDU8t7LZ113y 10-minute video by Dr. David Wood. Worth the watch! permalink parent award report block reply\nLady_MaGa 4 points 4 days ago He was Harry? permalink parent award report block reply Psarg 3 points 4 days ago Harry is a descendant of Muhammed permalink parent award report block reply Lady_MaGa 1 points 4 days ago I thought Harry was a descendant of Vlad the Impaler.  King Charles said so when he was Prince Charles. permalink parent award report block reply\nPsarg 3 points 4 days ago Harry is a descendant of Muhammed permalink parent award report block reply Lady_MaGa 1 points 4 days ago I thought Harry was a descendant of Vlad the Impaler.  King Charles said so when he was Prince Charles. permalink parent award report block reply\nLady_MaGa 1 points 4 days ago I thought Harry was a descendant of Vlad the Impaler.  King Charles said so when he was Prince Charles. permalink parent award report block reply\nMAGALADON9 4 points 3 days ago Technically not pagans. They are a monotheistic Abrahamic based system - now true it's 85% political and basicly picked and chose from Judaism and Christianity and added nothing new except leaned in on violence and such. permalink award report block reply ApprenticeParty 2 points 3 days ago The foundation of the religion is Arab paganism. They spackled over with some Unitarian Christian heresies and called it monotheistic and abrahamic, but it’s absolutely pagan at its root. permalink parent award report block reply MAGALADON9 1 points 3 days ago [Long pause, while looking down. Sighs* looks up] I have studied theology in actual universities and have lived and worked in the middle east north Africa (mena) region; i have studied the Quran the Hadiths all the Sunnah i have also studied archeology of the region and how various religions impacted cultures in different but significant ways. I've written several books on Islam specifically and have actually been to Mecca and all of the holy sites. I have poured over linguistic differences between arcaic Arabic and modern  Arabic; three types of Greek, Aramaic, and Hebrew and compared obscure letters and passages that even indirectly discuss Islam Christianity or Mithras or Zoroastrians and more. And....  Islam is not based on Arab paganism. I understand you think that's an \"own\" and you are dunking on them but it's just embarrassingly incorrect.  Islam has traces and bits of Arab paganism just as Christianity has echoes of European paganism, but to say it is a foundation is silly. permalink parent award report block reply ApprenticeParty 2 points 3 days ago Please link to your books, I’d love to read them. I’d hardly call one of the 5 pillars of the religion “echos”. You’ve personally been a historically pagan site, where Muslims partake in pagan rituals and worship one of the gods of the Arabian pantheon - Islamic history shows “Allah” as a pagan god, Muhammad’s father was named “slave of Allah” and Muhammad’s father died 4 years before Muhammad was born, let alone before any revelation. The pagan daughters of Allah are included in the religion. Any claims that this is not pagan is simply due to illegality of investigating such claims and the destruction of evidence starting in the 6th century when the other kabbas of different Arabian areas were destroyed. Borrowing stories from the infancy gospel and other gnostic works and from the Talmud ( especially the Talmud) doesn’t make a religion Abrahamic. If that were to be the case, true satanism worshipping Lucifer would be abrahamic as well. I’m presuming you would dispute that. permalink parent award report block reply MAGALADON9 1 points 3 days ago It's kind of like human genetic relationships at some point there may be some connection but I would say all religions including Christianity and perhaps more than most are \"tainted\" with paganism. But we have to define foundations Yes Arab pagans went to Mecca long before Islam and they new religion adopted customs of the past ones, but foundational no. Ancient Hebrews or the people.of them had many gods though most Christians will deny this but facts are stubborn things. Jewish folklore still refers to yhwh's wife as the comforter who would drape her cloak over the children of earth to shield them from \"arrows or spears\" thrown in rage. However socio-emotional necessity caused early jews to ditch much of this as their was too much overlap with neighbor's goddesses. In facts you can still see how \"harlot\" is in one example translated from a word that mean \"priestess\".  There are many other examples A solar God born shortly after the winter solstice (dec 25th ish) Had 12 followers Wandered around healing people. Known as the good Shepard and the lamb The list is endless. Jesus became popular because it was a story they were familiar with. Romans particularly liked mithras and fixated on blood sacrifice for atonement of sins, and it was not Jesus that fixated on \"the blood the blood  the blood.... washing over you...\" that was mithras and Paul and where did he come? Tarsus and what was Tarsus? Chief Capitol of mithras worship, naturally he was influenced  - this man who never walked with Jesus during his ministry and whose message has a different feel, but he wrote 2/3rds of the new testament- this man who claims to have walked with jesus' ghost alone with no witnesses....   im just sayin  if you want to go down the road of how religions merge and shift and combine you might not like what you find. Islam - which i loathe BTW-   is a monotheistic Abrahamic religion that explicitly builds on Judaism and Christianity as prior revelations from the same God (Allah). Its core theology—strict monotheism (tawhid), prophethood, angels, scriptures, and judgment—is directly derived from and reframes the Torah and Gospel. The Qur’an positions Muhammad as the final prophet in the same line as Abraham, Moses, and Jesus. While pre-Islamic Arab pagan practices (e.g., the Kaaba, pilgrimage rituals) were retained and repurposed, they were stripped of polytheism and subordinated to monotheistic worship. These are cultural forms, not foundational doctrines. The theological and legal foundation of Islam rests on Jewish and Christian scriptures (as understood and corrected by the Qur’an), not paganism. As for my books I will not dox myself as my feelings on Islam specifically are  tremendously dangerous. permalink parent award report block reply view 3 more comments...\nApprenticeParty 2 points 3 days ago The foundation of the religion is Arab paganism. They spackled over with some Unitarian Christian heresies and called it monotheistic and abrahamic, but it’s absolutely pagan at its root. permalink parent award report block reply MAGALADON9 1 points 3 days ago [Long pause, while looking down. Sighs* looks up] I have studied theology in actual universities and have lived and worked in the middle east north Africa (mena) region; i have studied the Quran the Hadiths all the Sunnah i have also studied archeology of the region and how various religions impacted cultures in different but significant ways. I've written several books on Islam specifically and have actually been to Mecca and all of the holy sites. I have poured over linguistic differences between arcaic Arabic and modern  Arabic; three types of Greek, Aramaic, and Hebrew and compared obscure letters and passages that even indirectly discuss Islam Christianity or Mithras or Zoroastrians and more. And....  Islam is not based on Arab paganism. I understand you think that's an \"own\" and you are dunking on them but it's just embarrassingly incorrect.  Islam has traces and bits of Arab paganism just as Christianity has echoes of European paganism, but to say it is a foundation is silly. permalink parent award report block reply ApprenticeParty 2 points 3 days ago Please link to your books, I’d love to read them. I’d hardly call one of the 5 pillars of the religion “echos”. You’ve personally been a historically pagan site, where Muslims partake in pagan rituals and worship one of the gods of the Arabian pantheon - Islamic history shows “Allah” as a pagan god, Muhammad’s father was named “slave of Allah” and Muhammad’s father died 4 years before Muhammad was born, let alone before any revelation. The pagan daughters of Allah are included in the religion. Any claims that this is not pagan is simply due to illegality of investigating such claims and the destruction of evidence starting in the 6th century when the other kabbas of different Arabian areas were destroyed. Borrowing stories from the infancy gospel and other gnostic works and from the Talmud ( especially the Talmud) doesn’t make a religion Abrahamic. If that were to be the case, true satanism worshipping Lucifer would be abrahamic as well. I’m presuming you would dispute that. permalink parent award report block reply MAGALADON9 1 points 3 days ago It's kind of like human genetic relationships at some point there may be some connection but I would say all religions including Christianity and perhaps more than most are \"tainted\" with paganism. But we have to define foundations Yes Arab pagans went to Mecca long before Islam and they new religion adopted customs of the past ones, but foundational no. Ancient Hebrews or the people.of them had many gods though most Christians will deny this but facts are stubborn things. Jewish folklore still refers to yhwh's wife as the comforter who would drape her cloak over the children of earth to shield them from \"arrows or spears\" thrown in rage. However socio-emotional necessity caused early jews to ditch much of this as their was too much overlap with neighbor's goddesses. In facts you can still see how \"harlot\" is in one example translated from a word that mean \"priestess\".  There are many other examples A solar God born shortly after the winter solstice (dec 25th ish) Had 12 followers Wandered around healing people. Known as the good Shepard and the lamb The list is endless. Jesus became popular because it was a story they were familiar with. Romans particularly liked mithras and fixated on blood sacrifice for atonement of sins, and it was not Jesus that fixated on \"the blood the blood  the blood.... washing over you...\" that was mithras and Paul and where did he come? Tarsus and what was Tarsus? Chief Capitol of mithras worship, naturally he was influenced  - this man who never walked with Jesus during his ministry and whose message has a different feel, but he wrote 2/3rds of the new testament- this man who claims to have walked with jesus' ghost alone with no witnesses....   im just sayin  if you want to go down the road of how religions merge and shift and combine you might not like what you find. Islam - which i loathe BTW-   is a monotheistic Abrahamic religion that explicitly builds on Judaism and Christianity as prior revelations from the same God (Allah). Its core theology—strict monotheism (tawhid), prophethood, angels, scriptures, and judgment—is directly derived from and reframes the Torah and Gospel. The Qur’an positions Muhammad as the final prophet in the same line as Abraham, Moses, and Jesus. While pre-Islamic Arab pagan practices (e.g., the Kaaba, pilgrimage rituals) were retained and repurposed, they were stripped of polytheism and subordinated to monotheistic worship. These are cultural forms, not foundational doctrines. The theological and legal foundation of Islam rests on Jewish and Christian scriptures (as understood and corrected by the Qur’an), not paganism. As for my books I will not dox myself as my feelings on Islam specifically are  tremendously dangerous. permalink parent award report block reply view 3 more comments...\nMAGALADON9 1 points 3 days ago [Long pause, while looking down. Sighs* looks up] I have studied theology in actual universities and have lived and worked in the middle east north Africa (mena) region; i have studied the Quran the Hadiths all the Sunnah i have also studied archeology of the region and how various religions impacted cultures in different but significant ways. I've written several books on Islam specifically and have actually been to Mecca and all of the holy sites. I have poured over linguistic differences between arcaic Arabic and modern  Arabic; three types of Greek, Aramaic, and Hebrew and compared obscure letters and passages that even indirectly discuss Islam Christianity or Mithras or Zoroastrians and more. And....  Islam is not based on Arab paganism. I understand you think that's an \"own\" and you are dunking on them but it's just embarrassingly incorrect.  Islam has traces and bits of Arab paganism just as Christianity has echoes of European paganism, but to say it is a foundation is silly. permalink parent award report block reply ApprenticeParty 2 points 3 days ago Please link to your books, I’d love to read them. I’d hardly call one of the 5 pillars of the religion “echos”. You’ve personally been a historically pagan site, where Muslims partake in pagan rituals and worship one of the gods of the Arabian pantheon - Islamic history shows “Allah” as a pagan god, Muhammad’s father was named “slave of Allah” and Muhammad’s father died 4 years before Muhammad was born, let alone before any revelation. The pagan daughters of Allah are included in the religion. Any claims that this is not pagan is simply due to illegality of investigating such claims and the destruction of evidence starting in the 6th century when the other kabbas of different Arabian areas were destroyed. Borrowing stories from the infancy gospel and other gnostic works and from the Talmud ( especially the Talmud) doesn’t make a religion Abrahamic. If that were to be the case, true satanism worshipping Lucifer would be abrahamic as well. I’m presuming you would dispute that. permalink parent award report block reply MAGALADON9 1 points 3 days ago It's kind of like human genetic relationships at some point there may be some connection but I would say all religions including Christianity and perhaps more than most are \"tainted\" with paganism. But we have to define foundations Yes Arab pagans went to Mecca long before Islam and they new religion adopted customs of the past ones, but foundational no. Ancient Hebrews or the people.of them had many gods though most Christians will deny this but facts are stubborn things. Jewish folklore still refers to yhwh's wife as the comforter who would drape her cloak over the children of earth to shield them from \"arrows or spears\" thrown in rage. However socio-emotional necessity caused early jews to ditch much of this as their was too much overlap with neighbor's goddesses. In facts you can still see how \"harlot\" is in one example translated from a word that mean \"priestess\".  There are many other examples A solar God born shortly after the winter solstice (dec 25th ish) Had 12 followers Wandered around healing people. Known as the good Shepard and the lamb The list is endless. Jesus became popular because it was a story they were familiar with. Romans particularly liked mithras and fixated on blood sacrifice for atonement of sins, and it was not Jesus that fixated on \"the blood the blood  the blood.... washing over you...\" that was mithras and Paul and where did he come? Tarsus and what was Tarsus? Chief Capitol of mithras worship, naturally he was influenced  - this man who never walked with Jesus during his ministry and whose message has a different feel, but he wrote 2/3rds of the new testament- this man who claims to have walked with jesus' ghost alone with no witnesses....   im just sayin  if you want to go down the road of how religions merge and shift and combine you might not like what you find. Islam - which i loathe BTW-   is a monotheistic Abrahamic religion that explicitly builds on Judaism and Christianity as prior revelations from the same God (Allah). Its core theology—strict monotheism (tawhid), prophethood, angels, scriptures, and judgment—is directly derived from and reframes the Torah and Gospel. The Qur’an positions Muhammad as the final prophet in the same line as Abraham, Moses, and Jesus. While pre-Islamic Arab pagan practices (e.g., the Kaaba, pilgrimage rituals) were retained and repurposed, they were stripped of polytheism and subordinated to monotheistic worship. These are cultural forms, not foundational doctrines. The theological and legal foundation of Islam rests on Jewish and Christian scriptures (as understood and corrected by the Qur’an), not paganism. As for my books I will not dox myself as my feelings on Islam specifically are  tremendously dangerous. permalink parent award report block reply view 3 more comments...\nApprenticeParty 2 points 3 days ago Please link to your books, I’d love to read them. I’d hardly call one of the 5 pillars of the religion “echos”. You’ve personally been a historically pagan site, where Muslims partake in pagan rituals and worship one of the gods of the Arabian pantheon - Islamic history shows “Allah” as a pagan god, Muhammad’s father was named “slave of Allah” and Muhammad’s father died 4 years before Muhammad was born, let alone before any revelation. The pagan daughters of Allah are included in the religion. Any claims that this is not pagan is simply due to illegality of investigating such claims and the destruction of evidence starting in the 6th century when the other kabbas of different Arabian areas were destroyed. Borrowing stories from the infancy gospel and other gnostic works and from the Talmud ( especially the Talmud) doesn’t make a religion Abrahamic. If that were to be the case, true satanism worshipping Lucifer would be abrahamic as well. I’m presuming you would dispute that. permalink parent award report block reply MAGALADON9 1 points 3 days ago It's kind of like human genetic relationships at some point there may be some connection but I would say all religions including Christianity and perhaps more than most are \"tainted\" with paganism. But we have to define foundations Yes Arab pagans went to Mecca long before Islam and they new religion adopted customs of the past ones, but foundational no. Ancient Hebrews or the people.of them had many gods though most Christians will deny this but facts are stubborn things. Jewish folklore still refers to yhwh's wife as the comforter who would drape her cloak over the children of earth to shield them from \"arrows or spears\" thrown in rage. However socio-emotional necessity caused early jews to ditch much of this as their was too much overlap with neighbor's goddesses. In facts you can still see how \"harlot\" is in one example translated from a word that mean \"priestess\".  There are many other examples A solar God born shortly after the winter solstice (dec 25th ish) Had 12 followers Wandered around healing people. Known as the good Shepard and the lamb The list is endless. Jesus became popular because it was a story they were familiar with. Romans particularly liked mithras and fixated on blood sacrifice for atonement of sins, and it was not Jesus that fixated on \"the blood the blood  the blood.... washing over you...\" that was mithras and Paul and where did he come? Tarsus and what was Tarsus? Chief Capitol of mithras worship, naturally he was influenced  - this man who never walked with Jesus during his ministry and whose message has a different feel, but he wrote 2/3rds of the new testament- this man who claims to have walked with jesus' ghost alone with no witnesses....   im just sayin  if you want to go down the road of how religions merge and shift and combine you might not like what you find. Islam - which i loathe BTW-   is a monotheistic Abrahamic religion that explicitly builds on Judaism and Christianity as prior revelations from the same God (Allah). Its core theology—strict monotheism (tawhid), prophethood, angels, scriptures, and judgment—is directly derived from and reframes the Torah and Gospel. The Qur’an positions Muhammad as the final prophet in the same line as Abraham, Moses, and Jesus. While pre-Islamic Arab pagan practices (e.g., the Kaaba, pilgrimage rituals) were retained and repurposed, they were stripped of polytheism and subordinated to monotheistic worship. These are cultural forms, not foundational doctrines. The theological and legal foundation of Islam rests on Jewish and Christian scriptures (as understood and corrected by the Qur’an), not paganism. As for my books I will not dox myself as my feelings on Islam specifically are  tremendously dangerous. permalink parent award report block reply view 3 more comments...\nMAGALADON9 1 points 3 days ago It's kind of like human genetic relationships at some point there may be some connection but I would say all religions including Christianity and perhaps more than most are \"tainted\" with paganism. But we have to define foundations Yes Arab pagans went to Mecca long before Islam and they new religion adopted customs of the past ones, but foundational no. Ancient Hebrews or the people.of them had many gods though most Christians will deny this but facts are stubborn things. Jewish folklore still refers to yhwh's wife as the comforter who would drape her cloak over the children of earth to shield them from \"arrows or spears\" thrown in rage. However socio-emotional necessity caused early jews to ditch much of this as their was too much overlap with neighbor's goddesses. In facts you can still see how \"harlot\" is in one example translated from a word that mean \"priestess\".  There are many other examples A solar God born shortly after the winter solstice (dec 25th ish) Had 12 followers Wandered around healing people. Known as the good Shepard and the lamb The list is endless. Jesus became popular because it was a story they were familiar with. Romans particularly liked mithras and fixated on blood sacrifice for atonement of sins, and it was not Jesus that fixated on \"the blood the blood  the blood.... washing over you...\" that was mithras and Paul and where did he come? Tarsus and what was Tarsus? Chief Capitol of mithras worship, naturally he was influenced  - this man who never walked with Jesus during his ministry and whose message has a different feel, but he wrote 2/3rds of the new testament- this man who claims to have walked with jesus' ghost alone with no witnesses....   im just sayin  if you want to go down the road of how religions merge and shift and combine you might not like what you find. Islam - which i loathe BTW-   is a monotheistic Abrahamic religion that explicitly builds on Judaism and Christianity as prior revelations from the same God (Allah). Its core theology—strict monotheism (tawhid), prophethood, angels, scriptures, and judgment—is directly derived from and reframes the Torah and Gospel. The Qur’an positions Muhammad as the final prophet in the same line as Abraham, Moses, and Jesus. While pre-Islamic Arab pagan practices (e.g., the Kaaba, pilgrimage rituals) were retained and repurposed, they were stripped of polytheism and subordinated to monotheistic worship. These are cultural forms, not foundational doctrines. The theological and legal foundation of Islam rests on Jewish and Christian scriptures (as understood and corrected by the Qur’an), not paganism. As for my books I will not dox myself as my feelings on Islam specifically are  tremendously dangerous. permalink parent award report block reply view 3 more comments...\nThePatriotGames2016 4 points 4 days ago better get your guns and report to General Washington. permalink award report block reply\nWarlordObama 3 points 3 days ago Allahtifa permalink award report block reply\ncs21212 3 points 4 days ago Gunther took money from the India lobby a few months back. You should not be giving this traitor clicks permalink award report block reply\nHanging_Chad 3 points 4 days ago boner protruding, very disrespectful permalink award report block reply\nSiteless_Vagrant 3 points 4 days ago Don’t insult Pagans. permalink award report block reply\nPatroklos_Maga 3 points 4 days ago What's the difference between New York and Dearborn now? permalink award report block reply SimaYi 2 points 4 days ago Do you like, not live in a big city? They are massively non-White. Whites are already a minority in them. Your country is gone. permalink parent award report block reply Tellman125 1 points 3 days ago But the whites who live in those cities live, work, and go out IN the white parts, and the cities are very racially divided up. I live in West Midtown Manhattan but have never been to Harlem, even though it's less than 4 short miles away from me and I could get there in literally 1 subway stop on the uptown A train. Likewise, the Upper East Side, which is the richest neighborhood in NYC and is very safe and clean, is right next to East Harlem (aka Spanish Harlem), which is dangerous and squalid and full of housing projects; the dividing line is East 96th Street. permalink parent award report block reply Tellman125 1 points 3 days ago Mayor-elect Moron Scamdummy doesn't take office until Jan 1, and Trump said the other day \"We lost a bit of sovereignty the other day [in NYC]. We'll take care of it, don't worry about it,\" and I wonder if that means he actually plans to DO anything in that time. It's been only 5 fuckin days since that guy was elected and the news cycle is already nonstop with him, hundreds of articles a day. permalink parent award report block reply\nSimaYi 2 points 4 days ago Do you like, not live in a big city? They are massively non-White. Whites are already a minority in them. Your country is gone. permalink parent award report block reply Tellman125 1 points 3 days ago But the whites who live in those cities live, work, and go out IN the white parts, and the cities are very racially divided up. I live in West Midtown Manhattan but have never been to Harlem, even though it's less than 4 short miles away from me and I could get there in literally 1 subway stop on the uptown A train. Likewise, the Upper East Side, which is the richest neighborhood in NYC and is very safe and clean, is right next to East Harlem (aka Spanish Harlem), which is dangerous and squalid and full of housing projects; the dividing line is East 96th Street. permalink parent award report block reply\nTellman125 1 points 3 days ago But the whites who live in those cities live, work, and go out IN the white parts, and the cities are very racially divided up. I live in West Midtown Manhattan but have never been to Harlem, even though it's less than 4 short miles away from me and I could get there in literally 1 subway stop on the uptown A train. Likewise, the Upper East Side, which is the richest neighborhood in NYC and is very safe and clean, is right next to East Harlem (aka Spanish Harlem), which is dangerous and squalid and full of housing projects; the dividing line is East 96th Street. permalink parent award report block reply\nTellman125 1 points 3 days ago Mayor-elect Moron Scamdummy doesn't take office until Jan 1, and Trump said the other day \"We lost a bit of sovereignty the other day [in NYC]. We'll take care of it, don't worry about it,\" and I wonder if that means he actually plans to DO anything in that time. It's been only 5 fuckin days since that guy was elected and the news cycle is already nonstop with him, hundreds of articles a day. permalink parent award report block reply\nOmegaBird 2 points 3 days ago NYC gets what it fucking deserves. permalink award report block reply\nBlockWorks 2 points 4 days ago All those fentanyl drug busts... all these saracens that love to hang out in large groups.... permalink award report block reply\nSimaYi 2 points 4 days ago lol permalink award report block reply\nAlmostFullyDilated 2 points 4 days ago all musmils must die permalink award report block reply\nRiehlpissed 2 points 3 days ago Hand to Koran to take the “oath” of fk everything up worse to finish the job. permalink award report block reply\nAppalachianTactical 1 points 4 days ago Have you ever seen a hardcore muslim wearing a yarmulke as much as this one? permalink award report block reply\nnice187 -1 points 4 days ago Hell yeah!  Europe finally starts in USA!  😂 permalink award report block reply\nthrowaway29834751 1 points 4 days ago Comment removed by community moderators, pending further review. permalink award report block reply"}