{"id": "1ARK9hj6IP", "contents": "389 Texans! Get Your Shit Together! Ban Islam Now!! Demand it Be Banned Or Bring Death To The Doors Of All Triator Who Are Allowing This! posted 2 days ago by Beardholder 17 comments award share download report block\n17 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Formerlurker92 12 points 2 days ago Deport 50 million foreigners and this sort of shit stops happening permalink award report block reply d003 4 points 2 days ago make the practice of islam punishable with a death sentence. permalink parent award report block reply greatpumpkin 4 points 2 days ago Texas has a pIslam problem.  Until pIslam is outlawed, it's not going away. Texas is off the retirement list. Good luck. permalink award report block reply njb425 2 points 2 days ago so dont trust people with an acronym of CCP? permalink award report block reply ApplyingForce 1 points 2 days ago Outlaw Islam? No need. Understand American law and stop being afraid of shadows. No American can diminish or breach another American's private or public estates. permalink award report block reply Repentnow 1 points 2 days ago This is so retarded. You can't outlaw a religion. Sure, you can rationalize that it's not a religion, but you're never going to make a legal case on that. We need to end all refugee and asylum visas. We need to end uncapped family and dependent visas. By law, we have a 25,000 immigrant cap per nation. We need to amend the statute to make that cap apply to dependents as well. This is how the undesirable immigration grows so rapidly. For every one person legally admitted to seek their green card, they are able to import a dozen relatives who do not count against the statutory cap. permalink award report block reply Beardholder OP 2 points 2 days ago Its not a religion that is allowed by the constitution.\nAnd it was outlawed before. Any ideology that out right fights the constitution and seeks it's destruction is categorized as a Foreign and Domestic threat to the nation. Period. Don't be fooled. permalink parent award report block reply Repentnow 1 points 2 days ago Please quote the line in the Constitution that forbids Islam. And the law that outlawed Islam in the US. permalink parent award report block reply Beardholder OP 1 points 17 hours ago The phrase \"support and defend the Constitution of the United States against all enemies, foreign and domestic\" is not in the main body of the Constitution, but it is part of the Oath of Office that U.S. officials and service members take, as required by law, according to the U.S. Senate. While the Constitution's text does not contain this exact sentence, the ** treason clause in Article III** defines treason as levying war against the U.S. or \"adhering to their enemies, giving them aid and comfort,\" which encompasses both domestic and foreign threats, permalink parent award report block reply Inukshuk 1 points 2 days ago Their marketing plan uses this tag line “You can fit many goats and sheep in a Meadow, inshallah.” permalink award report block reply RudeFrog 0 points 2 days ago If your constitution allows this, and it most certainly does, then of what use is your constitution? permalink award report block reply ApplyingForce 1 points 2 days ago If it allows what? permalink parent award report block reply HoganT -4 points 2 days ago So much for being constitutionalists, I guess. It’s literally the first amendment that was deemed absolutely essential to the nation. permalink award report block reply HoodooOperator 1 points 2 days ago Comment removed by community moderators. permalink award report block reply\nFormerlurker92 12 points 2 days ago Deport 50 million foreigners and this sort of shit stops happening permalink award report block reply d003 4 points 2 days ago make the practice of islam punishable with a death sentence. permalink parent award report block reply\nd003 4 points 2 days ago make the practice of islam punishable with a death sentence. permalink parent award report block reply\ngreatpumpkin 4 points 2 days ago Texas has a pIslam problem.  Until pIslam is outlawed, it's not going away. Texas is off the retirement list. Good luck. permalink award report block reply\nnjb425 2 points 2 days ago so dont trust people with an acronym of CCP? permalink award report block reply\nApplyingForce 1 points 2 days ago Outlaw Islam? No need. Understand American law and stop being afraid of shadows. No American can diminish or breach another American's private or public estates. permalink award report block reply\nRepentnow 1 points 2 days ago This is so retarded. You can't outlaw a religion. Sure, you can rationalize that it's not a religion, but you're never going to make a legal case on that. We need to end all refugee and asylum visas. We need to end uncapped family and dependent visas. By law, we have a 25,000 immigrant cap per nation. We need to amend the statute to make that cap apply to dependents as well. This is how the undesirable immigration grows so rapidly. For every one person legally admitted to seek their green card, they are able to import a dozen relatives who do not count against the statutory cap. permalink award report block reply Beardholder OP 2 points 2 days ago Its not a religion that is allowed by the constitution.\nAnd it was outlawed before. Any ideology that out right fights the constitution and seeks it's destruction is categorized as a Foreign and Domestic threat to the nation. Period. Don't be fooled. permalink parent award report block reply Repentnow 1 points 2 days ago Please quote the line in the Constitution that forbids Islam. And the law that outlawed Islam in the US. permalink parent award report block reply Beardholder OP 1 points 17 hours ago The phrase \"support and defend the Constitution of the United States against all enemies, foreign and domestic\" is not in the main body of the Constitution, but it is part of the Oath of Office that U.S. officials and service members take, as required by law, according to the U.S. Senate. While the Constitution's text does not contain this exact sentence, the ** treason clause in Article III** defines treason as levying war against the U.S. or \"adhering to their enemies, giving them aid and comfort,\" which encompasses both domestic and foreign threats, permalink parent award report block reply\nBeardholder OP 2 points 2 days ago Its not a religion that is allowed by the constitution.\nAnd it was outlawed before. Any ideology that out right fights the constitution and seeks it's destruction is categorized as a Foreign and Domestic threat to the nation. Period. Don't be fooled. permalink parent award report block reply Repentnow 1 points 2 days ago Please quote the line in the Constitution that forbids Islam. And the law that outlawed Islam in the US. permalink parent award report block reply Beardholder OP 1 points 17 hours ago The phrase \"support and defend the Constitution of the United States against all enemies, foreign and domestic\" is not in the main body of the Constitution, but it is part of the Oath of Office that U.S. officials and service members take, as required by law, according to the U.S. Senate. While the Constitution's text does not contain this exact sentence, the ** treason clause in Article III** defines treason as levying war against the U.S. or \"adhering to their enemies, giving them aid and comfort,\" which encompasses both domestic and foreign threats, permalink parent award report block reply\nRepentnow 1 points 2 days ago Please quote the line in the Constitution that forbids Islam. And the law that outlawed Islam in the US. permalink parent award report block reply Beardholder OP 1 points 17 hours ago The phrase \"support and defend the Constitution of the United States against all enemies, foreign and domestic\" is not in the main body of the Constitution, but it is part of the Oath of Office that U.S. officials and service members take, as required by law, according to the U.S. Senate. While the Constitution's text does not contain this exact sentence, the ** treason clause in Article III** defines treason as levying war against the U.S. or \"adhering to their enemies, giving them aid and comfort,\" which encompasses both domestic and foreign threats, permalink parent award report block reply\nBeardholder OP 1 points 17 hours ago The phrase \"support and defend the Constitution of the United States against all enemies, foreign and domestic\" is not in the main body of the Constitution, but it is part of the Oath of Office that U.S. officials and service members take, as required by law, according to the U.S. Senate. While the Constitution's text does not contain this exact sentence, the ** treason clause in Article III** defines treason as levying war against the U.S. or \"adhering to their enemies, giving them aid and comfort,\" which encompasses both domestic and foreign threats, permalink parent award report block reply\nInukshuk 1 points 2 days ago Their marketing plan uses this tag line “You can fit many goats and sheep in a Meadow, inshallah.” permalink award report block reply\nRudeFrog 0 points 2 days ago If your constitution allows this, and it most certainly does, then of what use is your constitution? permalink award report block reply ApplyingForce 1 points 2 days ago If it allows what? permalink parent award report block reply\nApplyingForce 1 points 2 days ago If it allows what? permalink parent award report block reply\nHoganT -4 points 2 days ago So much for being constitutionalists, I guess. It’s literally the first amendment that was deemed absolutely essential to the nation. permalink award report block reply\nHoodooOperator 1 points 2 days ago Comment removed by community moderators. permalink award report block reply"}