{"id": "1ARK9jzcQA", "contents": "354 Cool. Now deport 50-100 million or shut up. posted 1 day ago by MickHigan2 10 comments award share report block Joel Webbon @rightresponsem • 2d Cool. Now deport 50-100 million or shut up. I’m not interested in owning the libs, I’m only interested in my children having a country. Homeland Security @DHSgov • 4d The last best hope of man on Earth.\n10 comments Sort by Top Top New Worst Old Save SupFrens 16 points 1 day ago Amen. I still have yet to see ANY jeets get deported. permalink award report block reply Jorgemund 5 points 1 day ago That video was badass, though... Bitching at the social media manager doesn't do much. permalink award report block reply RINOssuck 4 points 1 day ago Enough of the fucking constant whining! permalink award report block reply TrumpDupedMAGA 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply Wildwind 2 points 1 day ago Deport all illegals  aliens plus the ones who came legal and became US citizens.  I just dont care anymore about others who are here at all. Lets move into other areas also. Say blacks who are repeat felons, rapists, murderers,  and big time stealing to Africa. If they want to act like some form of animal treat them as such. Send them back to ape land. If anyone calls me racist i dont care. I know that I was never a racist in my life and that they created a racist in me. Yes, there is a war against whites in this country. Just like what Africa blacks are doing to Africa  whites. Killing whites off while the mainstream news never reports on the slaughter of the white people born there. MAWA. permalink award report block reply Thesteelerfan181 1 points 1 day ago We’re not there yet, but doesn’t mean we can’t have fun moving the needle in the right direction permalink award report block reply Right0hio 1 points 1 day ago Did I see Big Mike in that montage’? permalink award report block reply patrioticwinning3 1 points 1 day ago Gotta get those rookie numbers up! permalink award report block reply covfefe77 1 points 1 day ago dude in a bigfoot costume in there ok permalink award report block reply Wexit-Delecto 0 points 1 day ago How about those arrests? permalink award report block reply\nSupFrens 16 points 1 day ago Amen. I still have yet to see ANY jeets get deported. permalink award report block reply\nJorgemund 5 points 1 day ago That video was badass, though... Bitching at the social media manager doesn't do much. permalink award report block reply\nRINOssuck 4 points 1 day ago Enough of the fucking constant whining! permalink award report block reply TrumpDupedMAGA 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nTrumpDupedMAGA 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nWildwind 2 points 1 day ago Deport all illegals  aliens plus the ones who came legal and became US citizens.  I just dont care anymore about others who are here at all. Lets move into other areas also. Say blacks who are repeat felons, rapists, murderers,  and big time stealing to Africa. If they want to act like some form of animal treat them as such. Send them back to ape land. If anyone calls me racist i dont care. I know that I was never a racist in my life and that they created a racist in me. Yes, there is a war against whites in this country. Just like what Africa blacks are doing to Africa  whites. Killing whites off while the mainstream news never reports on the slaughter of the white people born there. MAWA. permalink award report block reply\nThesteelerfan181 1 points 1 day ago We’re not there yet, but doesn’t mean we can’t have fun moving the needle in the right direction permalink award report block reply\nRight0hio 1 points 1 day ago Did I see Big Mike in that montage’? permalink award report block reply\npatrioticwinning3 1 points 1 day ago Gotta get those rookie numbers up! permalink award report block reply\ncovfefe77 1 points 1 day ago dude in a bigfoot costume in there ok permalink award report block reply\nWexit-Delecto 0 points 1 day ago How about those arrests? permalink award report block reply"}