{"id": "1ARK9hkCcr", "contents": "275 Ilhan Omar says she wouldn't mind being deported. The White House: 👋 TOP  KEK posted 2 days ago by SALTYinSeattle 11 comments award share download report block\n11 comments Sort by Top Top New Worst Old Save reversethefraud 8 points 2 days ago This is important. We are being governed shit-hole-ers who have zero attachment to our country. If it fails, they get to say \"fuck it, we out\" and they will go and get elected to govern some other country into a shit hole. They have no loyalty or fielty to our nation. Send them all back. permalink award report block reply SubmarineGuy 8 points 2 days ago Obama is the true villain here. He is the scumbag that imported all these America hating Somali's that elected Omar. permalink award report block reply TrumpCare 4 points 2 days ago Literally biological warfare permalink parent award report block reply dumb-but-not-stupid 7 points 2 days ago Start with her and do chain remigration permalink award report block reply duznmatter 5 points 2 days ago Yea she can live where ever off of all the US taxpayer dollars she has amassed in her short career. permalink award report block reply boomerbutnotOKBoomer 4 points 2 days ago ok permalink award report block reply patrioticwinning3 3 points 2 days ago That would only be funny IF THEY ACTUALLY DEPORTED HER!!!! permalink award report block reply GreyKnight 2 points 22 hours ago Seize her assets. She has 20 times the life earnings of the average American… of course she can live anywhere comfortable for the rest of her life… permalink award report block reply SALTYinSeattle OP 2 points 2 days ago https://x.com/WhiteHouse/status/1987920752054534439 permalink award report block reply KarenLukasik 1 points 2 days ago It’s certainly getting “hot” in America for her-I hope it’s a case of her seeing the writing on the wall because the walls are closing in…. permalink award report block reply\nreversethefraud 8 points 2 days ago This is important. We are being governed shit-hole-ers who have zero attachment to our country. If it fails, they get to say \"fuck it, we out\" and they will go and get elected to govern some other country into a shit hole. They have no loyalty or fielty to our nation. Send them all back. permalink award report block reply\nSubmarineGuy 8 points 2 days ago Obama is the true villain here. He is the scumbag that imported all these America hating Somali's that elected Omar. permalink award report block reply TrumpCare 4 points 2 days ago Literally biological warfare permalink parent award report block reply\nTrumpCare 4 points 2 days ago Literally biological warfare permalink parent award report block reply\ndumb-but-not-stupid 7 points 2 days ago Start with her and do chain remigration permalink award report block reply\nduznmatter 5 points 2 days ago Yea she can live where ever off of all the US taxpayer dollars she has amassed in her short career. permalink award report block reply\nboomerbutnotOKBoomer 4 points 2 days ago ok permalink award report block reply\npatrioticwinning3 3 points 2 days ago That would only be funny IF THEY ACTUALLY DEPORTED HER!!!! permalink award report block reply\nGreyKnight 2 points 22 hours ago Seize her assets. She has 20 times the life earnings of the average American… of course she can live anywhere comfortable for the rest of her life… permalink award report block reply\nSALTYinSeattle OP 2 points 2 days ago https://x.com/WhiteHouse/status/1987920752054534439 permalink award report block reply\nKarenLukasik 1 points 2 days ago It’s certainly getting “hot” in America for her-I hope it’s a case of her seeing the writing on the wall because the walls are closing in…. permalink award report block reply"}