{"id": "1ARK59056v", "contents": "379 MTG: 50 year mortgages will ultimately reward the banks, mortgage lenders. and home builders while people pay far more in interest over time and die before they ever pay off their home. In debt forever, in debt for life! Instead stop companies and asset managers from buying up single family homes. posted 4 days ago by goldwater4ever 44 comments award share report block Rep. Marjorie Taylor Greene🇺🇸 @RepMTG • 4d I don’t like 50 year mortgages as the solution to the housing affordability crisis. It will ultimately reward the banks, mortgage lenders. and home builders while people pay far more in interest over time and die before they ever pay off their home. In debt forever, in debt for\n44 comments Sort by Top Top New Worst Old Save JoePlumber 19 points 4 days ago PDW has been preaching these for months/years. It will be interesting to see if the MTG hate is greater than the Blackrock hate. permalink award report block reply ReallyGayMods 0 points 4 days ago Preaching what? permalink parent award report block reply JoePlumber 14 points 4 days ago Instead stop companies and asset managers from buying up single family homes. permalink parent award report block reply RandoBudster 13 points 4 days ago Where is the lie? permalink award report block reply BlockWorks 9 points 4 days ago FUCK THAT. 100 year mortgages. Just like minimum wages -- why stop at one number when another number is just a little further away? LFG! permalink award report block reply Retardloserimsogay 5 points 4 days ago Lmao! Love it permalink parent award report block reply Pede 7 points 4 days ago This is like when the government spent billions on student loans and everyone acted puzzled as to why tuition skyrocketed and decided the best solution was to give more student loans and scholarships. permalink award report block reply SpeekFreely 6 points 4 days ago More corporate socialism, how much is enough ? permalink award report block reply dr0id 6 points 4 days ago This kind of confirms there will be no mass deportations. This makes no sense if mass deportations were on the way, massively freeing up housing. This makes more sense if we are getting a massive increase in 'legal' immigration instead. permalink award report block reply mikethemarine 5 points 4 days ago YUP, just lower the interest rates to 4.25% and watch the country boom, if you want to go crazy put it at 2.8% permalink award report block reply BurtMcGirt 4 points 4 days ago \"The Noticing\" permalink award report block reply ReleasetheList 4 points 4 days ago Who is the absolute retard that suggested 50 year mortgages to Trump? He should be fired before the morning. permalink award report block reply Squentin 4 points 4 days ago If I'm paying 3% on the mortgage and getting 15% in the market, I'm coming out way ahead. permalink award report block reply chickeninoven 3 points 4 days ago You're indebted to the state via property taxes anyway, which constantly go up because of revals and levies passed by the parasite class. What's the fucking difference? permalink award report block reply keeman 2 points 4 days ago Fannie and Freddie ARE the swamp.  End them both and stop this retardation of 50 year mortgages. permalink award report block reply ForgotMyUsername424 2 points 4 days ago We need to shift money creation away from home loans and towards startup and small business loans. permalink award report block reply FlgPole 2 points 4 days ago Take the basic needs of survival out of the economy. Food, housing, and energy. permalink award report block reply Owmyballz 1 points 4 days ago Yes this. permalink award report block reply HuggableBear 1 points 3 days ago If only there were someone in a position to introduce some sort of governmental proposal to make that happen that she could talk to permalink award report block reply _Liberty_Prime_ 1 points 4 days ago Who suggested that? permalink award report block reply ReallyGayMods 4 points 4 days ago Comment removed by community moderators. permalink parent award report block reply patrioticwinning3 3 points 4 days ago This might be the most retarded thing that he has endorsed since the clot shots... If you look at the numbers a 50 year mortgage ONLY saves you about a $200 a month...and you get 20 more years of that shit! $300,000 30-year fixed: $1,529 principal and interest 40-year fixed: $1,418 principal and interest 50-year fixed: $1,366 principal and interest $400,000 30-year fixed: $2,038 principal and interest 40-year fixed: $1,891 principal and interest 50-year fixed: $1,822 principal and interest $500,000 30-year fixed: $2,548 principal and interest 40-year fixed: $2,363 principal and interest 50-year fixed: $2,277 principal and interest https://www.housingwire.com/articles/trump-proposes-50-year-mortgage-to-help-affordability/ permalink parent award report block reply _Liberty_Prime_ -6 points 4 days ago Did he? Because he also \"said neonazis were very fine people.\" /s 🙃 permalink parent award report block reply ReallyGayMods 2 points 4 days ago Yes. Our side doesn't repeat that lie. permalink parent award report block reply _Liberty_Prime_ -1 points 4 days ago We do sarcastically. It's the \"very fine people\" hoax. It's instructive to how lies propagate. permalink parent award report block reply view 3 more comments... ArtMandalay 1 points 3 days ago At least once you purchase the home, you now have a stable asset. Your pay will increase, but your home payment stays same (except maybe taxes). Rent will always go up & you never own a thing. Buy a home. You can borrow against the principal. Win-win. permalink award report block reply MorningFrost 2 points 2 days ago They need to stop hiring jeets for high income jobs that Americana are qualified for. permalink parent award report block reply Buildtheadytum -5 points 4 days ago This is bizarre to me, how just mentioning the option of 50 year mortgages has everyone's panties in a bunch.  It should be noted that American banks and home builders benefiting from this possibility isn't a bad thing. permalink award report block reply Retardloserimsogay 7 points 4 days ago I had a 30 year mortgage and somewhere around 23-24 years left I did a Refi to 20 years. Wouldn't that always be an option with a 50 as well? Keep the payments low enough so one can save for a Refi? permalink parent award report block reply MagaJay02 -1 points 4 days ago I'll say I'm interested to here more is all. permalink parent award report block reply ReallyGayMods 4 points 4 days ago If biden had this idea you wouldnt be saying this permalink parent award report block reply MagaJay02 2 points 4 days ago Interest doesn't mean support. I don't think I'd support it at all, but I'm interested to see what the full idea would be. I'm an open minded person, I always like to see a full idea, even if it's likely shit. As of now, a 50 year mortgage is crazy considering the average lifespan, age of adulthood, and so on. Just wouldn't make sense. Lifetime debt. permalink parent award report block reply ReallyGayMods 3 points 4 days ago What do you mean full idea? Its a 50 year mortgage. Thats it. No more to it permalink parent award report block reply view 3 more comments... julianReyes 0 points 4 days ago But he didn't. permalink parent award report block reply ReallyGayMods -2 points 4 days ago Yes and I agree with you; its worrying that even Bidens handlers couldn't come up with something this retarded permalink parent award report block reply julianReyes -3 points 4 days ago It's because a large portion of this site's userbase are leftist Redditors posing as MAGA, and they tend to slip in their act when big status quo shifts are proposed, despite supposedly supporting Trump for such actions. They tend to regurgitate whatever sociopathic media algorithms feed them (as an example, Ad Nauseam was an extension that was banned by Google in 2017 but is only being mentioned now because people saw a big YouTuber plugged it) and as it turns out Xitter was recently reprogrammed to push the WEF agenda... It's really really obvious by how entire comment sections bitching over this nontroversy are no different from the Marxist subreddits. Many of the site's posters also live in \"secretly red\" states like Commiefornia and Jew York. permalink parent award report block reply Pearcesarrow 1 points 3 days ago Comment removed by community filter, pending further review. permalink award report block reply TheDarkEmperor 0 points 4 days ago Comment removed by community moderators. permalink award report block reply\nJoePlumber 19 points 4 days ago PDW has been preaching these for months/years. It will be interesting to see if the MTG hate is greater than the Blackrock hate. permalink award report block reply ReallyGayMods 0 points 4 days ago Preaching what? permalink parent award report block reply JoePlumber 14 points 4 days ago Instead stop companies and asset managers from buying up single family homes. permalink parent award report block reply\nReallyGayMods 0 points 4 days ago Preaching what? permalink parent award report block reply JoePlumber 14 points 4 days ago Instead stop companies and asset managers from buying up single family homes. permalink parent award report block reply\nJoePlumber 14 points 4 days ago Instead stop companies and asset managers from buying up single family homes. permalink parent award report block reply\nRandoBudster 13 points 4 days ago Where is the lie? permalink award report block reply\nBlockWorks 9 points 4 days ago FUCK THAT. 100 year mortgages. Just like minimum wages -- why stop at one number when another number is just a little further away? LFG! permalink award report block reply Retardloserimsogay 5 points 4 days ago Lmao! Love it permalink parent award report block reply\nRetardloserimsogay 5 points 4 days ago Lmao! Love it permalink parent award report block reply\nPede 7 points 4 days ago This is like when the government spent billions on student loans and everyone acted puzzled as to why tuition skyrocketed and decided the best solution was to give more student loans and scholarships. permalink award report block reply\nSpeekFreely 6 points 4 days ago More corporate socialism, how much is enough ? permalink award report block reply\ndr0id 6 points 4 days ago This kind of confirms there will be no mass deportations. This makes no sense if mass deportations were on the way, massively freeing up housing. This makes more sense if we are getting a massive increase in 'legal' immigration instead. permalink award report block reply\nmikethemarine 5 points 4 days ago YUP, just lower the interest rates to 4.25% and watch the country boom, if you want to go crazy put it at 2.8% permalink award report block reply\nBurtMcGirt 4 points 4 days ago \"The Noticing\" permalink award report block reply\nReleasetheList 4 points 4 days ago Who is the absolute retard that suggested 50 year mortgages to Trump? He should be fired before the morning. permalink award report block reply\nSquentin 4 points 4 days ago If I'm paying 3% on the mortgage and getting 15% in the market, I'm coming out way ahead. permalink award report block reply\nchickeninoven 3 points 4 days ago You're indebted to the state via property taxes anyway, which constantly go up because of revals and levies passed by the parasite class. What's the fucking difference? permalink award report block reply\nkeeman 2 points 4 days ago Fannie and Freddie ARE the swamp.  End them both and stop this retardation of 50 year mortgages. permalink award report block reply\nForgotMyUsername424 2 points 4 days ago We need to shift money creation away from home loans and towards startup and small business loans. permalink award report block reply\nFlgPole 2 points 4 days ago Take the basic needs of survival out of the economy. Food, housing, and energy. permalink award report block reply\nOwmyballz 1 points 4 days ago Yes this. permalink award report block reply\nHuggableBear 1 points 3 days ago If only there were someone in a position to introduce some sort of governmental proposal to make that happen that she could talk to permalink award report block reply\n_Liberty_Prime_ 1 points 4 days ago Who suggested that? permalink award report block reply ReallyGayMods 4 points 4 days ago Comment removed by community moderators. permalink parent award report block reply patrioticwinning3 3 points 4 days ago This might be the most retarded thing that he has endorsed since the clot shots... If you look at the numbers a 50 year mortgage ONLY saves you about a $200 a month...and you get 20 more years of that shit! $300,000 30-year fixed: $1,529 principal and interest 40-year fixed: $1,418 principal and interest 50-year fixed: $1,366 principal and interest $400,000 30-year fixed: $2,038 principal and interest 40-year fixed: $1,891 principal and interest 50-year fixed: $1,822 principal and interest $500,000 30-year fixed: $2,548 principal and interest 40-year fixed: $2,363 principal and interest 50-year fixed: $2,277 principal and interest https://www.housingwire.com/articles/trump-proposes-50-year-mortgage-to-help-affordability/ permalink parent award report block reply _Liberty_Prime_ -6 points 4 days ago Did he? Because he also \"said neonazis were very fine people.\" /s 🙃 permalink parent award report block reply ReallyGayMods 2 points 4 days ago Yes. Our side doesn't repeat that lie. permalink parent award report block reply _Liberty_Prime_ -1 points 4 days ago We do sarcastically. It's the \"very fine people\" hoax. It's instructive to how lies propagate. permalink parent award report block reply view 3 more comments...\nReallyGayMods 4 points 4 days ago Comment removed by community moderators. permalink parent award report block reply patrioticwinning3 3 points 4 days ago This might be the most retarded thing that he has endorsed since the clot shots... If you look at the numbers a 50 year mortgage ONLY saves you about a $200 a month...and you get 20 more years of that shit! $300,000 30-year fixed: $1,529 principal and interest 40-year fixed: $1,418 principal and interest 50-year fixed: $1,366 principal and interest $400,000 30-year fixed: $2,038 principal and interest 40-year fixed: $1,891 principal and interest 50-year fixed: $1,822 principal and interest $500,000 30-year fixed: $2,548 principal and interest 40-year fixed: $2,363 principal and interest 50-year fixed: $2,277 principal and interest https://www.housingwire.com/articles/trump-proposes-50-year-mortgage-to-help-affordability/ permalink parent award report block reply _Liberty_Prime_ -6 points 4 days ago Did he? Because he also \"said neonazis were very fine people.\" /s 🙃 permalink parent award report block reply ReallyGayMods 2 points 4 days ago Yes. Our side doesn't repeat that lie. permalink parent award report block reply _Liberty_Prime_ -1 points 4 days ago We do sarcastically. It's the \"very fine people\" hoax. It's instructive to how lies propagate. permalink parent award report block reply view 3 more comments...\npatrioticwinning3 3 points 4 days ago This might be the most retarded thing that he has endorsed since the clot shots... If you look at the numbers a 50 year mortgage ONLY saves you about a $200 a month...and you get 20 more years of that shit! $300,000 30-year fixed: $1,529 principal and interest 40-year fixed: $1,418 principal and interest 50-year fixed: $1,366 principal and interest $400,000 30-year fixed: $2,038 principal and interest 40-year fixed: $1,891 principal and interest 50-year fixed: $1,822 principal and interest $500,000 30-year fixed: $2,548 principal and interest 40-year fixed: $2,363 principal and interest 50-year fixed: $2,277 principal and interest https://www.housingwire.com/articles/trump-proposes-50-year-mortgage-to-help-affordability/ permalink parent award report block reply\n_Liberty_Prime_ -6 points 4 days ago Did he? Because he also \"said neonazis were very fine people.\" /s 🙃 permalink parent award report block reply ReallyGayMods 2 points 4 days ago Yes. Our side doesn't repeat that lie. permalink parent award report block reply _Liberty_Prime_ -1 points 4 days ago We do sarcastically. It's the \"very fine people\" hoax. It's instructive to how lies propagate. permalink parent award report block reply view 3 more comments...\nReallyGayMods 2 points 4 days ago Yes. Our side doesn't repeat that lie. permalink parent award report block reply _Liberty_Prime_ -1 points 4 days ago We do sarcastically. It's the \"very fine people\" hoax. It's instructive to how lies propagate. permalink parent award report block reply view 3 more comments...\n_Liberty_Prime_ -1 points 4 days ago We do sarcastically. It's the \"very fine people\" hoax. It's instructive to how lies propagate. permalink parent award report block reply view 3 more comments...\nArtMandalay 1 points 3 days ago At least once you purchase the home, you now have a stable asset. Your pay will increase, but your home payment stays same (except maybe taxes). Rent will always go up & you never own a thing. Buy a home. You can borrow against the principal. Win-win. permalink award report block reply MorningFrost 2 points 2 days ago They need to stop hiring jeets for high income jobs that Americana are qualified for. permalink parent award report block reply\nMorningFrost 2 points 2 days ago They need to stop hiring jeets for high income jobs that Americana are qualified for. permalink parent award report block reply\nBuildtheadytum -5 points 4 days ago This is bizarre to me, how just mentioning the option of 50 year mortgages has everyone's panties in a bunch.  It should be noted that American banks and home builders benefiting from this possibility isn't a bad thing. permalink award report block reply Retardloserimsogay 7 points 4 days ago I had a 30 year mortgage and somewhere around 23-24 years left I did a Refi to 20 years. Wouldn't that always be an option with a 50 as well? Keep the payments low enough so one can save for a Refi? permalink parent award report block reply MagaJay02 -1 points 4 days ago I'll say I'm interested to here more is all. permalink parent award report block reply ReallyGayMods 4 points 4 days ago If biden had this idea you wouldnt be saying this permalink parent award report block reply MagaJay02 2 points 4 days ago Interest doesn't mean support. I don't think I'd support it at all, but I'm interested to see what the full idea would be. I'm an open minded person, I always like to see a full idea, even if it's likely shit. As of now, a 50 year mortgage is crazy considering the average lifespan, age of adulthood, and so on. Just wouldn't make sense. Lifetime debt. permalink parent award report block reply ReallyGayMods 3 points 4 days ago What do you mean full idea? Its a 50 year mortgage. Thats it. No more to it permalink parent award report block reply view 3 more comments... julianReyes 0 points 4 days ago But he didn't. permalink parent award report block reply ReallyGayMods -2 points 4 days ago Yes and I agree with you; its worrying that even Bidens handlers couldn't come up with something this retarded permalink parent award report block reply julianReyes -3 points 4 days ago It's because a large portion of this site's userbase are leftist Redditors posing as MAGA, and they tend to slip in their act when big status quo shifts are proposed, despite supposedly supporting Trump for such actions. They tend to regurgitate whatever sociopathic media algorithms feed them (as an example, Ad Nauseam was an extension that was banned by Google in 2017 but is only being mentioned now because people saw a big YouTuber plugged it) and as it turns out Xitter was recently reprogrammed to push the WEF agenda... It's really really obvious by how entire comment sections bitching over this nontroversy are no different from the Marxist subreddits. Many of the site's posters also live in \"secretly red\" states like Commiefornia and Jew York. permalink parent award report block reply\nRetardloserimsogay 7 points 4 days ago I had a 30 year mortgage and somewhere around 23-24 years left I did a Refi to 20 years. Wouldn't that always be an option with a 50 as well? Keep the payments low enough so one can save for a Refi? permalink parent award report block reply\nMagaJay02 -1 points 4 days ago I'll say I'm interested to here more is all. permalink parent award report block reply ReallyGayMods 4 points 4 days ago If biden had this idea you wouldnt be saying this permalink parent award report block reply MagaJay02 2 points 4 days ago Interest doesn't mean support. I don't think I'd support it at all, but I'm interested to see what the full idea would be. I'm an open minded person, I always like to see a full idea, even if it's likely shit. As of now, a 50 year mortgage is crazy considering the average lifespan, age of adulthood, and so on. Just wouldn't make sense. Lifetime debt. permalink parent award report block reply ReallyGayMods 3 points 4 days ago What do you mean full idea? Its a 50 year mortgage. Thats it. No more to it permalink parent award report block reply view 3 more comments... julianReyes 0 points 4 days ago But he didn't. permalink parent award report block reply ReallyGayMods -2 points 4 days ago Yes and I agree with you; its worrying that even Bidens handlers couldn't come up with something this retarded permalink parent award report block reply\nReallyGayMods 4 points 4 days ago If biden had this idea you wouldnt be saying this permalink parent award report block reply MagaJay02 2 points 4 days ago Interest doesn't mean support. I don't think I'd support it at all, but I'm interested to see what the full idea would be. I'm an open minded person, I always like to see a full idea, even if it's likely shit. As of now, a 50 year mortgage is crazy considering the average lifespan, age of adulthood, and so on. Just wouldn't make sense. Lifetime debt. permalink parent award report block reply ReallyGayMods 3 points 4 days ago What do you mean full idea? Its a 50 year mortgage. Thats it. No more to it permalink parent award report block reply view 3 more comments... julianReyes 0 points 4 days ago But he didn't. permalink parent award report block reply ReallyGayMods -2 points 4 days ago Yes and I agree with you; its worrying that even Bidens handlers couldn't come up with something this retarded permalink parent award report block reply\nMagaJay02 2 points 4 days ago Interest doesn't mean support. I don't think I'd support it at all, but I'm interested to see what the full idea would be. I'm an open minded person, I always like to see a full idea, even if it's likely shit. As of now, a 50 year mortgage is crazy considering the average lifespan, age of adulthood, and so on. Just wouldn't make sense. Lifetime debt. permalink parent award report block reply ReallyGayMods 3 points 4 days ago What do you mean full idea? Its a 50 year mortgage. Thats it. No more to it permalink parent award report block reply view 3 more comments...\nReallyGayMods 3 points 4 days ago What do you mean full idea? Its a 50 year mortgage. Thats it. No more to it permalink parent award report block reply view 3 more comments...\njulianReyes 0 points 4 days ago But he didn't. permalink parent award report block reply ReallyGayMods -2 points 4 days ago Yes and I agree with you; its worrying that even Bidens handlers couldn't come up with something this retarded permalink parent award report block reply\nReallyGayMods -2 points 4 days ago Yes and I agree with you; its worrying that even Bidens handlers couldn't come up with something this retarded permalink parent award report block reply\njulianReyes -3 points 4 days ago It's because a large portion of this site's userbase are leftist Redditors posing as MAGA, and they tend to slip in their act when big status quo shifts are proposed, despite supposedly supporting Trump for such actions. They tend to regurgitate whatever sociopathic media algorithms feed them (as an example, Ad Nauseam was an extension that was banned by Google in 2017 but is only being mentioned now because people saw a big YouTuber plugged it) and as it turns out Xitter was recently reprogrammed to push the WEF agenda... It's really really obvious by how entire comment sections bitching over this nontroversy are no different from the Marxist subreddits. Many of the site's posters also live in \"secretly red\" states like Commiefornia and Jew York. permalink parent award report block reply\nPearcesarrow 1 points 3 days ago Comment removed by community filter, pending further review. permalink award report block reply\nTheDarkEmperor 0 points 4 days ago Comment removed by community moderators. permalink award report block reply"}