{"id": "1ARK9oWent", "contents": "50 \"Boomers do not understand that 99% of H1B is not top tier AI tech talent. They manage servers for Bank of America in a basement in Charlotte.\" posted 2 hours ago by bleeje 9 comments award share report block Gary @plzbepatient • 5h Boomers do not understand that 99% of H1B is not top tier AI tech talent. They manage servers for Bank of America in a basement in Charlotte. Bill Mitchell @mitchellvii • 7h WHAT HAPPENS IF WE END H1-B's TOMORROW? Well we completely fall behind in AI.  The rest of the world eats our lunch and we have to go begging to them like Oliver hoping for AI support. Won't that be swell. OR, we could bring THEIR TALENT here and use it to build OUR tech.\n9 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style brutustyberius 8 points 1 hour ago Who is Bill Mitchell? Is he gay? permalink award report block reply Wrexxis780 8 points 34 minutes ago He’s a Faggot permalink parent award report block reply WashingtonIsNext 7 points 27 minutes ago Bill Mitchell is a faggot. permalink award report block reply Retardloserimsogay 1 points 5 minutes ago Now way man! He himself made Trump and he can destroy him! /s permalink parent award report block reply ThomasSowellisKing 4 points 40 minutes ago a shitload of them work in healthcare administration and don't know what the fuck they are doing. permalink award report block reply Belleoffreedom 4 points 1 hour ago We understand that H1-b scam just fine.  We also know that our children are going to work for the same money people in the US were making in 1979.  Thank you very much, we understand that our kids can't afford $400K for a house. Instead of taking swipes at us, you might look to the goddamn Fed, and the Congress, who can't think of anything better to do than ruin your futures and our retirements. permalink award report block reply happyfave -3 points 44 minutes ago It's not binary for fucks sake what is wrong with all you retarded people.   Bringing H1B doesn't have to be 50 million H1Bs permalink parent award report block reply Settin 2 points 7 minutes ago I would respect the pro pajeet stance if people would just admit it’s cheap labor. Bill Mitchell is a faggot. permalink award report block reply Wexit-Delecto 1 points 33 seconds ago Mass replacement immigration is NON NEGOTIABLE. If it's not happening illegally, it's going to happen legally, but make no mistake: it will happen. permalink award report block reply\nbrutustyberius 8 points 1 hour ago Who is Bill Mitchell? Is he gay? permalink award report block reply Wrexxis780 8 points 34 minutes ago He’s a Faggot permalink parent award report block reply\nWrexxis780 8 points 34 minutes ago He’s a Faggot permalink parent award report block reply\nWashingtonIsNext 7 points 27 minutes ago Bill Mitchell is a faggot. permalink award report block reply Retardloserimsogay 1 points 5 minutes ago Now way man! He himself made Trump and he can destroy him! /s permalink parent award report block reply\nRetardloserimsogay 1 points 5 minutes ago Now way man! He himself made Trump and he can destroy him! /s permalink parent award report block reply\nThomasSowellisKing 4 points 40 minutes ago a shitload of them work in healthcare administration and don't know what the fuck they are doing. permalink award report block reply\nBelleoffreedom 4 points 1 hour ago We understand that H1-b scam just fine.  We also know that our children are going to work for the same money people in the US were making in 1979.  Thank you very much, we understand that our kids can't afford $400K for a house. Instead of taking swipes at us, you might look to the goddamn Fed, and the Congress, who can't think of anything better to do than ruin your futures and our retirements. permalink award report block reply happyfave -3 points 44 minutes ago It's not binary for fucks sake what is wrong with all you retarded people.   Bringing H1B doesn't have to be 50 million H1Bs permalink parent award report block reply\nhappyfave -3 points 44 minutes ago It's not binary for fucks sake what is wrong with all you retarded people.   Bringing H1B doesn't have to be 50 million H1Bs permalink parent award report block reply\nSettin 2 points 7 minutes ago I would respect the pro pajeet stance if people would just admit it’s cheap labor. Bill Mitchell is a faggot. permalink award report block reply\nWexit-Delecto 1 points 33 seconds ago Mass replacement immigration is NON NEGOTIABLE. If it's not happening illegally, it's going to happen legally, but make no mistake: it will happen. permalink award report block reply"}