{"id": "1ARK55bihH", "contents": "279 🚨#BREAKING: A federal grand jury is now hearing evidence against JOHN BRENNAN on conspiracy to commit perjury, and OTHER CRIMES posted 5 days ago by LordStirling 12 comments award share report block Eric Deters @bulllaw • 6d 🚨#BREAKING: A federal grand jury is now hearing evidence against JOHN BRENNAN on conspiracy to commit perjury, and OTHER CRIMES\n12 comments Sort by Top Top New Worst Old Save Counterwhat 5 points 5 days ago It's about time! permalink award report block reply Purebloodsupreme 4 points 5 days ago He establishes the conspiracy and they all are fucked under RICO, just have to be named. Lol permalink award report block reply Ch3f4554551n 3 points 5 days ago John Brennan did 9/11. permalink award report block reply UCantStumpTheTrump 2 points 5 days ago Yeah now we are getting to the real orchestrators of Deep State plots against America permalink parent award report block reply Ch3f4554551n 1 points 5 days ago Not really, though. Brennan is a henchman. If the \"real orchestrators\" were exposed, the GOP would not survive. Just look at Roy Cohn... permalink parent award report block reply UCantStumpTheTrump 3 points 5 days ago Brennan is definitely more than just a henchman, he was personally responsible for kicking off Crossfire Hurricane and everything downstream from that hoax. He needs to pay, big time permalink parent award report block reply Ch3f4554551n 2 points 5 days ago He needs to pay, but he isn't working on behalf of John Brennan. He is following orders from the Cabal, which makes him a henchman. permalink parent award report block reply view 3 more comments... UCantStumpTheTrump 2 points 5 days ago So far, Comey, Bolton and Tish James have been indicted and charged with crimes. It’s a good start, BRENNAN is a central figure in numerous hoaxes and Deep State plots against Trump, he is a big fish and I hope they get charges to stick permalink award report block reply SoulSnipper 2 points 5 days ago It's great, but I'd really hope to see them go down for what they did, not just lying about what they did. permalink award report block reply\nCounterwhat 5 points 5 days ago It's about time! permalink award report block reply\nPurebloodsupreme 4 points 5 days ago He establishes the conspiracy and they all are fucked under RICO, just have to be named. Lol permalink award report block reply\nCh3f4554551n 3 points 5 days ago John Brennan did 9/11. permalink award report block reply UCantStumpTheTrump 2 points 5 days ago Yeah now we are getting to the real orchestrators of Deep State plots against America permalink parent award report block reply Ch3f4554551n 1 points 5 days ago Not really, though. Brennan is a henchman. If the \"real orchestrators\" were exposed, the GOP would not survive. Just look at Roy Cohn... permalink parent award report block reply UCantStumpTheTrump 3 points 5 days ago Brennan is definitely more than just a henchman, he was personally responsible for kicking off Crossfire Hurricane and everything downstream from that hoax. He needs to pay, big time permalink parent award report block reply Ch3f4554551n 2 points 5 days ago He needs to pay, but he isn't working on behalf of John Brennan. He is following orders from the Cabal, which makes him a henchman. permalink parent award report block reply view 3 more comments...\nUCantStumpTheTrump 2 points 5 days ago Yeah now we are getting to the real orchestrators of Deep State plots against America permalink parent award report block reply Ch3f4554551n 1 points 5 days ago Not really, though. Brennan is a henchman. If the \"real orchestrators\" were exposed, the GOP would not survive. Just look at Roy Cohn... permalink parent award report block reply UCantStumpTheTrump 3 points 5 days ago Brennan is definitely more than just a henchman, he was personally responsible for kicking off Crossfire Hurricane and everything downstream from that hoax. He needs to pay, big time permalink parent award report block reply Ch3f4554551n 2 points 5 days ago He needs to pay, but he isn't working on behalf of John Brennan. He is following orders from the Cabal, which makes him a henchman. permalink parent award report block reply view 3 more comments...\nCh3f4554551n 1 points 5 days ago Not really, though. Brennan is a henchman. If the \"real orchestrators\" were exposed, the GOP would not survive. Just look at Roy Cohn... permalink parent award report block reply UCantStumpTheTrump 3 points 5 days ago Brennan is definitely more than just a henchman, he was personally responsible for kicking off Crossfire Hurricane and everything downstream from that hoax. He needs to pay, big time permalink parent award report block reply Ch3f4554551n 2 points 5 days ago He needs to pay, but he isn't working on behalf of John Brennan. He is following orders from the Cabal, which makes him a henchman. permalink parent award report block reply view 3 more comments...\nUCantStumpTheTrump 3 points 5 days ago Brennan is definitely more than just a henchman, he was personally responsible for kicking off Crossfire Hurricane and everything downstream from that hoax. He needs to pay, big time permalink parent award report block reply Ch3f4554551n 2 points 5 days ago He needs to pay, but he isn't working on behalf of John Brennan. He is following orders from the Cabal, which makes him a henchman. permalink parent award report block reply view 3 more comments...\nCh3f4554551n 2 points 5 days ago He needs to pay, but he isn't working on behalf of John Brennan. He is following orders from the Cabal, which makes him a henchman. permalink parent award report block reply view 3 more comments...\nUCantStumpTheTrump 2 points 5 days ago So far, Comey, Bolton and Tish James have been indicted and charged with crimes. It’s a good start, BRENNAN is a central figure in numerous hoaxes and Deep State plots against Trump, he is a big fish and I hope they get charges to stick permalink award report block reply\nSoulSnipper 2 points 5 days ago It's great, but I'd really hope to see them go down for what they did, not just lying about what they did. permalink award report block reply"}