{"id": "1ARK52Co7Q", "contents": "708 Ted Nugent: The reason food is so expensive is because 42 million people get it for \"free.\" posted 6 days ago by Mr_Rightside 59 comments award share download report block\n59 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style DT170x 25 points 6 days ago If EBT is cut Off. I am going to short as many stocks that I can legally allow. Coke Cola is going to be my GOTO corp. permalink award report block reply cyberwar 15 points 6 days ago short all the name brands permalink parent award report block reply IncredibleMrE1 11 points 6 days ago 25% of SNAP money is spent at Walmart. permalink parent award report block reply NoahGav 3 points 6 days ago Which means 75% is spent elsewhere. permalink parent award report block reply NazisWereSocialist 4 points 6 days ago lol per capita strikes again, fr though the fact that gas stations can accept it is fucking wild permalink parent award report block reply view 1 more comments... Aambrick 1 points 6 days ago About 20%-55% are at gas stations, though, that depends on which state they are in. Blue states might average in the 45%-55% range. Combined it might be close to 37%-43%, but that is still guessing since 19-22 states don't provide concrete data. permalink parent award report block reply NotYourMan 2 points 6 days ago He is correct.  its because we are all competing with the government paying for food.  But its the same with apartment rents.  If we compete with the government then everything gets more expensive.  Home sales are the same way except we do compete with corporations buying single family homes and jacking up the prices to make profit.  I would vote for a law that didn't allow corporations to buy single family homes or but into certain districts. permalink parent award report block reply Modern_Times 1 points 6 days ago Medical care is the same. permalink parent award report block reply billybaldwin2 13 points 6 days ago True. You're more or less bidding on it. Not to mention taxes. My county raised taxes 2% a few months ago on everything but groceries. Now Trump has to fight against that sort of shenanigans. permalink award report block reply Spicy_cat 4 points 6 days ago Iirc Illinois passed a grocery bag tax.  Imagine a special tax on groceries and people went for it lol permalink parent award report block reply Electrocutioner 1 points 6 days ago There are a lot of places that have done this. The signal went out somewhere sometime ago that plastic bags were bad and paper is back in vogue. Guess we aren't trying to save the trees anymore now that we have filled everyone with microplastics. permalink parent award report block reply mateus 1 points 6 days ago And those paying via EBT DON'T pay for their bags. permalink parent award report block reply GodKingHarambe 10 points 6 days ago In the front row of a  1990  Bad Company/Damn Yankees tour, Ted Nugent called me a \"California Boy\" permalink award report block reply makersmarx 5 points 6 days ago Ha! 🎵Can you take me high enough🎵 permalink parent award report block reply ItsFunToSay-M-A-G-A 4 points 6 days ago 🎵 I don't wanna sear about it anymore 🎵 🎵 It's a shame I've got to grill without you anymore 🎵 🎵 There's a fire in my heart 🎵 🎵 A pounding in my brain 🎵 🎵 It's driving me crazy 🎵 🎵 We don't need to talk about it anymore 🎵 🎵 Yes, strip steak is just a memory 🎵 🎵 Can we close the door 🎵 🎵 I just crave one missed steak 🎵 🎵 I didn't know what to make 🎵 🎵 When you called me, baby 🎵 🎵 Don't say goodnight 🎵 🎵 Say you'll be my entrée forever 🎵 🎵 Oh, whoa, all the way 🎵 🎵 Can you steak me high enough 🎵 🎵 To supply me T-bone (supply me T-bone) every day 🎵 🎵 Can you steak me high enough 🎵 🎵 It's never over 🎵 🎵 Yesterday's just a petit filet 🎵 🎵 (Yesterday's just a petit filet) 🎵 permalink parent award report block reply makersmarx 2 points 6 days ago Lol too funny! I prefer this version 🥩 permalink parent award report block reply ItsFunToSay-M-A-G-A 3 points 6 days ago Thanks, glad you like it!! 😎 permalink parent award report block reply IncredibleMrE1 8 points 6 days ago Make steak and lobster affordable again permalink award report block reply KekistanPM 6 points 6 days ago Sorry, everyone on SNAP bought them all. permalink parent award report block reply ItsFunToSay-M-A-G-A 4 points 6 days ago 🎶 The steaks are high! Ain't none to buy! 🎶 🎶 It's all sold out to-ni-yi-yight! 🎶 🎶 It's a Free-For-All! 🎶 https://www.youtube.com/watch?v=veuABbzg1No permalink parent award report block reply lovemylibs 3 points 6 days ago Well done. Do you ever pretend your face is a mass of broccoli? permalink parent award report block reply ItsFunToSay-M-A-G-A 1 points 6 days ago Hahaha 😂 permalink parent award report block reply friedchicken 6 points 6 days ago 100000% Local butcher: it's all people on foodstamps buying extremely premium meat, and the prices reflect that.  Cuts of beef I've seen touch over $30/lb.  Fucking absurd.  Meanwhile those of us who pay out of pocket have to scrounge at the grocery store for terrible quality meat. permalink award report block reply mikejones 6 points 6 days ago Nothing I hate more than going into farmers markets or other premium beef spots and seeing they accept EBT and SNAP. Jacks the price up of everything. $13 for a pound of ground beef. permalink parent award report block reply Afeazo 3 points 6 days ago Its still wild to me that if we must hand out food to people, we are sending out funds for them to spend at private companies to buy this food rather than just collect the surplus and distributing that. permalink parent award report block reply Rerun1Central 6 points 6 days ago Fred Bear walk with me, down these trails again.. permalink award report block reply Winter_bow_huntress 4 points 6 days ago Based permalink parent award report block reply sorrytodisagree 5 points 6 days ago Because 42 million are getting it at government prices.  The government doesn't haggle very hard before throwing other peoples money around.  Healthcare, insurance, food, military hardware.  All overpriced thanks to idiots and corruption in government. permalink award report block reply LaVaughnRobinson 4 points 6 days ago Greed.  Stocks only go up!  How dare you take away the cattle they imported. permalink award report block reply HeavenlyTrumpets 3 points 6 days ago I'm sure that's part of it. Soda for $10 a dozen or whatever because ebt people don't care cause it isn't their money. permalink award report block reply Gregorina 3 points 6 days ago Does this mean that these food companies increase their prices based on how much money these freeloaders get from the government? permalink award report block reply MADASHELLNEWS 3 points 6 days ago Close but it's actually 48 million and who knows how many are illegal aliens permalink award report block reply Electrocutioner 2 points 6 days ago I'm calling bullshit on this. Trying to blame food stamps for the insane increase of prices since the lockdowns is retarded. How many meat processing plants have been relatively recently burned to the ground? How many farmers have been bankrupted and bought up by massive corporations? How much farmland has been paved over and filled with overpriced and shoddily built McMansions? There are plenty of other factors that can be attributed to just plain greed that is allowed to run rampant in our country that is hiking the prices on everything , not just food. permalink award report block reply Keep_on_winning_kag 2 points 6 days ago Three or four meat plants out of hundreds. It's 40 million welfare people and illegals buying whatever they want at the store that jacks up the prices. There's more demand so to say is what leads to high prices. permalink parent award report block reply IvIA6A 2 points 6 days ago If you think X is expensive now, wait until it's subsidized by the government permalink award report block reply Mr_Rightside OP 2 points 6 days ago https://x.com/TedNugent/status/1986269613286695354 permalink award report block reply BeauHD 2 points 6 days ago Why do you keep posting this Lisa Simpson regurgitated vomit? Lisa Simpson is a feminazi and is pro everything we are against. permalink parent award report block reply Dirk_Diggler 2 points 6 days ago It's called ironic humor? permalink parent award report block reply Mr_Rightside OP 0 points 6 days ago Why are you sperging out about a meme format that's been around for around a decade. Acting like we can only use memes of characters/celebrities that are only Conservative is retarded. The creator of Pepe is TDS libtard for fuck sakes, and Pepe memes are posted and stickied here daily. Leonardo DiCaprio is also a TDS libtard and both of these memes are posted here frequently. Wayne Knight is a TDS libtard and people post the \" See Nobody Cares \" meme here constantly. Also of course you're a commie faggot from Portland, Beau Hamilton. You: Clinton wiped the floor with Trump tonight. Say hello to your next president, America! #debatenight Steve Bannon, President Trump's chief strategist, has been removed from the National Security Council, official says.\nYou: Better late than never, but to think that Trump thought he was a good fit to begin with encapsulates the ignorance of this administration. President Trump: James Comey better hope that there are no \"tapes\" of our conversations before he starts leaking to the press! You: Ooh, the President of the \"free world\" is making threats now against a former FBI director in the middle of an investigation. IDIOT! You: The stock market is plunging, government is shut down, and Trump keeps tweeting gibberish... Merry Christmas everyone! 🎅🎄 You: This is a disgrace. I hope when shit hits the fan all of Trump's supporters get hosed first. You: Trump citing a couple murders/rapes committed by illegal immigrants is truly disgusting. The vast majority of crimes are committed by American citizens. Plain & simple. The vast majority of illegal immigrants simply want a better life for themselves & there family. You: What. A. Speech. I'm SO thankful to have a president that embodies hope and decency. We're rooting for you @JoeBiden!! permalink parent award report block reply LLP2 2 points 6 days ago Wow! Good thing you're on the right side! Bringin' the receipts! permalink parent award report block reply BeauHD 0 points 6 days ago tl;dr bot crap permalink parent award report block reply Mr_Rightside OP 0 points 6 days ago Logging into all of your sock accounts to downvote me, lmao. What a faggot. But that's a given with you being from Portland. permalink parent award report block reply Parabellum76 2 points 6 days ago The amount of this pattern extrapolated out to everything else is truly insane. The “handout tax” and “multiculturalism tax” makes everything else across the board FAR more expensive. permalink award report block reply carpetxparmesan 1 points 6 days ago That's part of it. But it's mostly because 90% of you EAT OUT. Read that again. 9 in 10 people don't cook at home. They mostly eat out. Makes sense. Why put in a 40k kitchen when you can just eat 40k of food for 6-7 years? Of course there are other factors. Like the 40 million (or more). But keep in mind there are other factors like... some foods are \"below price\" because of food being part of the US defense program and whether you like them or not (some are good, some are bad, the consequences are a mixed bag and often unintended) tariffs and subsidies are a thing. If I had to put my finger on both food and the housing market, other factors like government regulation and cartel-like behavior at high levels would rank #1 for me. But I'll admit I underestimated the effects of illegals a little bit. Still, they're not THE factor. They're a contributing factor. Don't take this as some kind of doompilling or argumentative shitposting. I just want to open your mind to certain realities: defense doctrine/policy, subsidies and tariffs, mostly-globohomo-us-backstabbing corpos. Just like with covid, don't let these people skate by saying oh it's not a real virus. Of course illegals and fraud IS A THING, unlike what democrats claim. Just don't go full retard in the excitement. permalink award report block reply Electrocutioner 2 points 6 days ago I can believe that 9 out of 10 order out each night or everyday. If you take into to account atleast 1 meal isn't home cooked it becomes really easy to reach that number. Like stopping to get a breakfast sandwich and coffee or something for lunch. permalink parent award report block reply Keep_on_winning_kag 2 points 6 days ago My neighbor across the hall leaves every day like clock work when he goes out to eat. permalink parent award report block reply projectarcturus1 1 points 6 days ago That is a really big part of it. permalink award report block reply MisterMAGA 1 points 6 days ago That’s a reason, one of many. permalink award report block reply pedespeed 1 points 6 days ago Is it possible Ted is wrong? Are people really getting it for free or are tax payers competing for food against their own government? permalink award report block reply carpetxparmesan 5 points 6 days ago He's not wrong. They are ADVERTISING to EBT. Companies don't advertise to people that don't make them money... at all. I don't know if you noticed, but whenever something good comes for free, at low cost, or is mostly for people who wouldn't otherwise afford it, it's either a government program behind the scenes (usually) or more rarely, people are bundling money to get it done. Things very rarely happen out of grassroots money pooling, to the point that it's almost not a thing that happens. He might be wrong about the degree to which it impacts. But, I would also guess, an area in which this might have a lot of impact is breakfast cereals for kids. Breakfast cereals are bad for kids. They're pretty much breakfast crack, legal, for kids. Legal to advertise, legal to hook them on it, it's pretty much both a physical sugar ADDICTION, yeah they go into withdrawal without it, try it sometime, and a psychological addiction. I would guess a lot of EBT kids eat a lot of expensive breakfast cereal. And parents who actually pay for those cereals are forced to buy them at the inflated, often 100-150% inflated prices. Neither the raw ingredients WHICH ARE SUBSIDIZED, btw, creating a whole other problem/dimension, nor the manufacturing techniques and cost of those cereals are as expensive as the supermarket price of \"cereals\" would suggest. They're not even cheap, like they used to be a long time ago, in BULK... which tells you a lot about pricing strategy. Also, comparing it to animal feed is another interesting approach to it. Yeah, your kid insn't a miniature pony, but.... as you learned in with the chink flu... There are some \"cheap\" alternatives now, 90% of the flavor and \"quality\" for 50% (or less) of the price from the likes of Aldis. Which tells you even more. There are also the profits. If you look at their profits and losses, you'll see the cereal companies pull a verizon/telecom on the government and the public. What do I mean by that? Money going to last line that never gets there (ebt-like). Complaining for 10 years they're losing money and then getting bailed out by the government for 2-3x their \"losses\" with the end result being every 20-30 years, MASSIVE profits off the back of these scams (both on consumers and on government). Hur dur losing money. But you're getting record profits? Oh ... oh... you just got bailed out! Maybe I'm not explaining this properly, but those who follow telecoms, you'll know what I'm talking about. You know where there's \"reality\"? Buckweat. Rice. Cornmeal. Shit people don't want to cook with because cooking from scratch doesnt taste as good, if we're being honest (don't @ me, I know how to make it taste better than store-bought or restaurant), and it takes way more work and planning. So the prices there reflect that reality. Which gives you an idea where these companies are screwing you or lying or getting some government money laundering or kickbacks or whatever the fuck. Beans, however, are not a great indicator, I think there's something else going on with beans. They're a little more expensive than they should be but whatever, not a big deal. Some people think beef really should be 20-30$/lb for the good stuff. I haven't made up my mind about that. I think there are places where he's 100% right (and you are too) and places where it's less accurate or predictive of the cost. Just thoughts, no anger. 🙂👑🪇 permalink parent award report block reply Citizen_Bob -1 points 6 days ago iirc 20m of them can be deported. permalink award report block reply RedStoneDeepState -4 points 6 days ago Food isnt expensive. Good meat and packaged junk is expensive. Get rid of EBT and you solve the former. permalink award report block reply drmrboy 4 points 6 days ago Yes it is.  Fuck off.  🤓 permalink parent award report block reply carpetxparmesan 3 points 6 days ago Idk, man, I've been \"putting my money where my mouth is\" with farm-to-table, made-in-america, local food, things like that and I regularly pay 2-3x the price of supermarket. Few people will admit it, but it's what actually happens when you walk the walk and you don't just bloviate platitudes. Anyway, not arguing with you, just thought I'd lay it out there. Yeah, I agree with you, just saying that post-walk, things might actually get more expensive. Which would also be fine, I guess. It might actually motivate people to OWN farmland or have big stakes in megacorpos that own the farmland. For the future, as a kind of 40,000ft overview of the future, we shouldn't rely on \"cheap food\". We should actually bite the bullet and eat the expense of OWNING all the farmland in the US. There's not that much of it. If each of us puts 30,000$ and owns ONE acre, we'd be okay. Of course, that's a \"wasted\" 30k to just... hoard stonks, as it were. Anyway, I won't confuse you any further. permalink parent award report block reply RedStoneDeepState 2 points 6 days ago Idk, man, I've been \"putting my money where my mouth is\" with farm-to-table, made-in-america, local food, things like that Dude, you are paying hippies. Virtually all grain, beans, chicken and pork in a supermarket is made in America. Once you go to the farmer and start paying for grain wholesale, you are paying a tiny fraction of retail prices. I personally boycott most imported/Californian food. About the only thing I buy that may be imported is Japanese beef or Argentine/Brazilian beef. But that is a minority of my food budget.  And imported rice, because my boycott on California is more important than boycotting foreign countries. Otherwise pretty much everything I eat is American. ...my food costs are lower than the average American because it means I have low effort vegetable gardens and I dont eat imported exotic shit. permalink parent award report block reply carpetxparmesan 1 points 5 days ago You have a valid perspective. It can be done that way, yes. I've also found that, as you say, my food habits (and spending) changed when I grow my own garden. permalink parent award report block reply\nDT170x 25 points 6 days ago If EBT is cut Off. I am going to short as many stocks that I can legally allow. Coke Cola is going to be my GOTO corp. permalink award report block reply cyberwar 15 points 6 days ago short all the name brands permalink parent award report block reply IncredibleMrE1 11 points 6 days ago 25% of SNAP money is spent at Walmart. permalink parent award report block reply NoahGav 3 points 6 days ago Which means 75% is spent elsewhere. permalink parent award report block reply NazisWereSocialist 4 points 6 days ago lol per capita strikes again, fr though the fact that gas stations can accept it is fucking wild permalink parent award report block reply view 1 more comments... Aambrick 1 points 6 days ago About 20%-55% are at gas stations, though, that depends on which state they are in. Blue states might average in the 45%-55% range. Combined it might be close to 37%-43%, but that is still guessing since 19-22 states don't provide concrete data. permalink parent award report block reply NotYourMan 2 points 6 days ago He is correct.  its because we are all competing with the government paying for food.  But its the same with apartment rents.  If we compete with the government then everything gets more expensive.  Home sales are the same way except we do compete with corporations buying single family homes and jacking up the prices to make profit.  I would vote for a law that didn't allow corporations to buy single family homes or but into certain districts. permalink parent award report block reply Modern_Times 1 points 6 days ago Medical care is the same. permalink parent award report block reply\ncyberwar 15 points 6 days ago short all the name brands permalink parent award report block reply IncredibleMrE1 11 points 6 days ago 25% of SNAP money is spent at Walmart. permalink parent award report block reply NoahGav 3 points 6 days ago Which means 75% is spent elsewhere. permalink parent award report block reply NazisWereSocialist 4 points 6 days ago lol per capita strikes again, fr though the fact that gas stations can accept it is fucking wild permalink parent award report block reply view 1 more comments... Aambrick 1 points 6 days ago About 20%-55% are at gas stations, though, that depends on which state they are in. Blue states might average in the 45%-55% range. Combined it might be close to 37%-43%, but that is still guessing since 19-22 states don't provide concrete data. permalink parent award report block reply\nIncredibleMrE1 11 points 6 days ago 25% of SNAP money is spent at Walmart. permalink parent award report block reply NoahGav 3 points 6 days ago Which means 75% is spent elsewhere. permalink parent award report block reply NazisWereSocialist 4 points 6 days ago lol per capita strikes again, fr though the fact that gas stations can accept it is fucking wild permalink parent award report block reply view 1 more comments... Aambrick 1 points 6 days ago About 20%-55% are at gas stations, though, that depends on which state they are in. Blue states might average in the 45%-55% range. Combined it might be close to 37%-43%, but that is still guessing since 19-22 states don't provide concrete data. permalink parent award report block reply\nNoahGav 3 points 6 days ago Which means 75% is spent elsewhere. permalink parent award report block reply NazisWereSocialist 4 points 6 days ago lol per capita strikes again, fr though the fact that gas stations can accept it is fucking wild permalink parent award report block reply view 1 more comments... Aambrick 1 points 6 days ago About 20%-55% are at gas stations, though, that depends on which state they are in. Blue states might average in the 45%-55% range. Combined it might be close to 37%-43%, but that is still guessing since 19-22 states don't provide concrete data. permalink parent award report block reply\nNazisWereSocialist 4 points 6 days ago lol per capita strikes again, fr though the fact that gas stations can accept it is fucking wild permalink parent award report block reply view 1 more comments...\nAambrick 1 points 6 days ago About 20%-55% are at gas stations, though, that depends on which state they are in. Blue states might average in the 45%-55% range. Combined it might be close to 37%-43%, but that is still guessing since 19-22 states don't provide concrete data. permalink parent award report block reply\nNotYourMan 2 points 6 days ago He is correct.  its because we are all competing with the government paying for food.  But its the same with apartment rents.  If we compete with the government then everything gets more expensive.  Home sales are the same way except we do compete with corporations buying single family homes and jacking up the prices to make profit.  I would vote for a law that didn't allow corporations to buy single family homes or but into certain districts. permalink parent award report block reply Modern_Times 1 points 6 days ago Medical care is the same. permalink parent award report block reply\nModern_Times 1 points 6 days ago Medical care is the same. permalink parent award report block reply\nbillybaldwin2 13 points 6 days ago True. You're more or less bidding on it. Not to mention taxes. My county raised taxes 2% a few months ago on everything but groceries. Now Trump has to fight against that sort of shenanigans. permalink award report block reply Spicy_cat 4 points 6 days ago Iirc Illinois passed a grocery bag tax.  Imagine a special tax on groceries and people went for it lol permalink parent award report block reply Electrocutioner 1 points 6 days ago There are a lot of places that have done this. The signal went out somewhere sometime ago that plastic bags were bad and paper is back in vogue. Guess we aren't trying to save the trees anymore now that we have filled everyone with microplastics. permalink parent award report block reply mateus 1 points 6 days ago And those paying via EBT DON'T pay for their bags. permalink parent award report block reply\nSpicy_cat 4 points 6 days ago Iirc Illinois passed a grocery bag tax.  Imagine a special tax on groceries and people went for it lol permalink parent award report block reply Electrocutioner 1 points 6 days ago There are a lot of places that have done this. The signal went out somewhere sometime ago that plastic bags were bad and paper is back in vogue. Guess we aren't trying to save the trees anymore now that we have filled everyone with microplastics. permalink parent award report block reply mateus 1 points 6 days ago And those paying via EBT DON'T pay for their bags. permalink parent award report block reply\nElectrocutioner 1 points 6 days ago There are a lot of places that have done this. The signal went out somewhere sometime ago that plastic bags were bad and paper is back in vogue. Guess we aren't trying to save the trees anymore now that we have filled everyone with microplastics. permalink parent award report block reply mateus 1 points 6 days ago And those paying via EBT DON'T pay for their bags. permalink parent award report block reply\nmateus 1 points 6 days ago And those paying via EBT DON'T pay for their bags. permalink parent award report block reply\nGodKingHarambe 10 points 6 days ago In the front row of a  1990  Bad Company/Damn Yankees tour, Ted Nugent called me a \"California Boy\" permalink award report block reply makersmarx 5 points 6 days ago Ha! 🎵Can you take me high enough🎵 permalink parent award report block reply ItsFunToSay-M-A-G-A 4 points 6 days ago 🎵 I don't wanna sear about it anymore 🎵 🎵 It's a shame I've got to grill without you anymore 🎵 🎵 There's a fire in my heart 🎵 🎵 A pounding in my brain 🎵 🎵 It's driving me crazy 🎵 🎵 We don't need to talk about it anymore 🎵 🎵 Yes, strip steak is just a memory 🎵 🎵 Can we close the door 🎵 🎵 I just crave one missed steak 🎵 🎵 I didn't know what to make 🎵 🎵 When you called me, baby 🎵 🎵 Don't say goodnight 🎵 🎵 Say you'll be my entrée forever 🎵 🎵 Oh, whoa, all the way 🎵 🎵 Can you steak me high enough 🎵 🎵 To supply me T-bone (supply me T-bone) every day 🎵 🎵 Can you steak me high enough 🎵 🎵 It's never over 🎵 🎵 Yesterday's just a petit filet 🎵 🎵 (Yesterday's just a petit filet) 🎵 permalink parent award report block reply makersmarx 2 points 6 days ago Lol too funny! I prefer this version 🥩 permalink parent award report block reply ItsFunToSay-M-A-G-A 3 points 6 days ago Thanks, glad you like it!! 😎 permalink parent award report block reply\nmakersmarx 5 points 6 days ago Ha! 🎵Can you take me high enough🎵 permalink parent award report block reply ItsFunToSay-M-A-G-A 4 points 6 days ago 🎵 I don't wanna sear about it anymore 🎵 🎵 It's a shame I've got to grill without you anymore 🎵 🎵 There's a fire in my heart 🎵 🎵 A pounding in my brain 🎵 🎵 It's driving me crazy 🎵 🎵 We don't need to talk about it anymore 🎵 🎵 Yes, strip steak is just a memory 🎵 🎵 Can we close the door 🎵 🎵 I just crave one missed steak 🎵 🎵 I didn't know what to make 🎵 🎵 When you called me, baby 🎵 🎵 Don't say goodnight 🎵 🎵 Say you'll be my entrée forever 🎵 🎵 Oh, whoa, all the way 🎵 🎵 Can you steak me high enough 🎵 🎵 To supply me T-bone (supply me T-bone) every day 🎵 🎵 Can you steak me high enough 🎵 🎵 It's never over 🎵 🎵 Yesterday's just a petit filet 🎵 🎵 (Yesterday's just a petit filet) 🎵 permalink parent award report block reply makersmarx 2 points 6 days ago Lol too funny! I prefer this version 🥩 permalink parent award report block reply ItsFunToSay-M-A-G-A 3 points 6 days ago Thanks, glad you like it!! 😎 permalink parent award report block reply\nItsFunToSay-M-A-G-A 4 points 6 days ago 🎵 I don't wanna sear about it anymore 🎵 🎵 It's a shame I've got to grill without you anymore 🎵 🎵 There's a fire in my heart 🎵 🎵 A pounding in my brain 🎵 🎵 It's driving me crazy 🎵 🎵 We don't need to talk about it anymore 🎵 🎵 Yes, strip steak is just a memory 🎵 🎵 Can we close the door 🎵 🎵 I just crave one missed steak 🎵 🎵 I didn't know what to make 🎵 🎵 When you called me, baby 🎵 🎵 Don't say goodnight 🎵 🎵 Say you'll be my entrée forever 🎵 🎵 Oh, whoa, all the way 🎵 🎵 Can you steak me high enough 🎵 🎵 To supply me T-bone (supply me T-bone) every day 🎵 🎵 Can you steak me high enough 🎵 🎵 It's never over 🎵 🎵 Yesterday's just a petit filet 🎵 🎵 (Yesterday's just a petit filet) 🎵 permalink parent award report block reply makersmarx 2 points 6 days ago Lol too funny! I prefer this version 🥩 permalink parent award report block reply ItsFunToSay-M-A-G-A 3 points 6 days ago Thanks, glad you like it!! 😎 permalink parent award report block reply\nmakersmarx 2 points 6 days ago Lol too funny! I prefer this version 🥩 permalink parent award report block reply ItsFunToSay-M-A-G-A 3 points 6 days ago Thanks, glad you like it!! 😎 permalink parent award report block reply\nItsFunToSay-M-A-G-A 3 points 6 days ago Thanks, glad you like it!! 😎 permalink parent award report block reply\nIncredibleMrE1 8 points 6 days ago Make steak and lobster affordable again permalink award report block reply KekistanPM 6 points 6 days ago Sorry, everyone on SNAP bought them all. permalink parent award report block reply ItsFunToSay-M-A-G-A 4 points 6 days ago 🎶 The steaks are high! Ain't none to buy! 🎶 🎶 It's all sold out to-ni-yi-yight! 🎶 🎶 It's a Free-For-All! 🎶 https://www.youtube.com/watch?v=veuABbzg1No permalink parent award report block reply lovemylibs 3 points 6 days ago Well done. Do you ever pretend your face is a mass of broccoli? permalink parent award report block reply ItsFunToSay-M-A-G-A 1 points 6 days ago Hahaha 😂 permalink parent award report block reply\nKekistanPM 6 points 6 days ago Sorry, everyone on SNAP bought them all. permalink parent award report block reply ItsFunToSay-M-A-G-A 4 points 6 days ago 🎶 The steaks are high! Ain't none to buy! 🎶 🎶 It's all sold out to-ni-yi-yight! 🎶 🎶 It's a Free-For-All! 🎶 https://www.youtube.com/watch?v=veuABbzg1No permalink parent award report block reply lovemylibs 3 points 6 days ago Well done. Do you ever pretend your face is a mass of broccoli? permalink parent award report block reply ItsFunToSay-M-A-G-A 1 points 6 days ago Hahaha 😂 permalink parent award report block reply\nItsFunToSay-M-A-G-A 4 points 6 days ago 🎶 The steaks are high! Ain't none to buy! 🎶 🎶 It's all sold out to-ni-yi-yight! 🎶 🎶 It's a Free-For-All! 🎶 https://www.youtube.com/watch?v=veuABbzg1No permalink parent award report block reply lovemylibs 3 points 6 days ago Well done. Do you ever pretend your face is a mass of broccoli? permalink parent award report block reply ItsFunToSay-M-A-G-A 1 points 6 days ago Hahaha 😂 permalink parent award report block reply\nlovemylibs 3 points 6 days ago Well done. Do you ever pretend your face is a mass of broccoli? permalink parent award report block reply ItsFunToSay-M-A-G-A 1 points 6 days ago Hahaha 😂 permalink parent award report block reply\nItsFunToSay-M-A-G-A 1 points 6 days ago Hahaha 😂 permalink parent award report block reply\nfriedchicken 6 points 6 days ago 100000% Local butcher: it's all people on foodstamps buying extremely premium meat, and the prices reflect that.  Cuts of beef I've seen touch over $30/lb.  Fucking absurd.  Meanwhile those of us who pay out of pocket have to scrounge at the grocery store for terrible quality meat. permalink award report block reply mikejones 6 points 6 days ago Nothing I hate more than going into farmers markets or other premium beef spots and seeing they accept EBT and SNAP. Jacks the price up of everything. $13 for a pound of ground beef. permalink parent award report block reply Afeazo 3 points 6 days ago Its still wild to me that if we must hand out food to people, we are sending out funds for them to spend at private companies to buy this food rather than just collect the surplus and distributing that. permalink parent award report block reply\nmikejones 6 points 6 days ago Nothing I hate more than going into farmers markets or other premium beef spots and seeing they accept EBT and SNAP. Jacks the price up of everything. $13 for a pound of ground beef. permalink parent award report block reply\nAfeazo 3 points 6 days ago Its still wild to me that if we must hand out food to people, we are sending out funds for them to spend at private companies to buy this food rather than just collect the surplus and distributing that. permalink parent award report block reply\nRerun1Central 6 points 6 days ago Fred Bear walk with me, down these trails again.. permalink award report block reply Winter_bow_huntress 4 points 6 days ago Based permalink parent award report block reply\nWinter_bow_huntress 4 points 6 days ago Based permalink parent award report block reply\nsorrytodisagree 5 points 6 days ago Because 42 million are getting it at government prices.  The government doesn't haggle very hard before throwing other peoples money around.  Healthcare, insurance, food, military hardware.  All overpriced thanks to idiots and corruption in government. permalink award report block reply\nLaVaughnRobinson 4 points 6 days ago Greed.  Stocks only go up!  How dare you take away the cattle they imported. permalink award report block reply\nHeavenlyTrumpets 3 points 6 days ago I'm sure that's part of it. Soda for $10 a dozen or whatever because ebt people don't care cause it isn't their money. permalink award report block reply\nGregorina 3 points 6 days ago Does this mean that these food companies increase their prices based on how much money these freeloaders get from the government? permalink award report block reply\nMADASHELLNEWS 3 points 6 days ago Close but it's actually 48 million and who knows how many are illegal aliens permalink award report block reply\nElectrocutioner 2 points 6 days ago I'm calling bullshit on this. Trying to blame food stamps for the insane increase of prices since the lockdowns is retarded. How many meat processing plants have been relatively recently burned to the ground? How many farmers have been bankrupted and bought up by massive corporations? How much farmland has been paved over and filled with overpriced and shoddily built McMansions? There are plenty of other factors that can be attributed to just plain greed that is allowed to run rampant in our country that is hiking the prices on everything , not just food. permalink award report block reply Keep_on_winning_kag 2 points 6 days ago Three or four meat plants out of hundreds. It's 40 million welfare people and illegals buying whatever they want at the store that jacks up the prices. There's more demand so to say is what leads to high prices. permalink parent award report block reply\nKeep_on_winning_kag 2 points 6 days ago Three or four meat plants out of hundreds. It's 40 million welfare people and illegals buying whatever they want at the store that jacks up the prices. There's more demand so to say is what leads to high prices. permalink parent award report block reply\nIvIA6A 2 points 6 days ago If you think X is expensive now, wait until it's subsidized by the government permalink award report block reply\nMr_Rightside OP 2 points 6 days ago https://x.com/TedNugent/status/1986269613286695354 permalink award report block reply BeauHD 2 points 6 days ago Why do you keep posting this Lisa Simpson regurgitated vomit? Lisa Simpson is a feminazi and is pro everything we are against. permalink parent award report block reply Dirk_Diggler 2 points 6 days ago It's called ironic humor? permalink parent award report block reply Mr_Rightside OP 0 points 6 days ago Why are you sperging out about a meme format that's been around for around a decade. Acting like we can only use memes of characters/celebrities that are only Conservative is retarded. The creator of Pepe is TDS libtard for fuck sakes, and Pepe memes are posted and stickied here daily. Leonardo DiCaprio is also a TDS libtard and both of these memes are posted here frequently. Wayne Knight is a TDS libtard and people post the \" See Nobody Cares \" meme here constantly. Also of course you're a commie faggot from Portland, Beau Hamilton. You: Clinton wiped the floor with Trump tonight. Say hello to your next president, America! #debatenight Steve Bannon, President Trump's chief strategist, has been removed from the National Security Council, official says.\nYou: Better late than never, but to think that Trump thought he was a good fit to begin with encapsulates the ignorance of this administration. President Trump: James Comey better hope that there are no \"tapes\" of our conversations before he starts leaking to the press! You: Ooh, the President of the \"free world\" is making threats now against a former FBI director in the middle of an investigation. IDIOT! You: The stock market is plunging, government is shut down, and Trump keeps tweeting gibberish... Merry Christmas everyone! 🎅🎄 You: This is a disgrace. I hope when shit hits the fan all of Trump's supporters get hosed first. You: Trump citing a couple murders/rapes committed by illegal immigrants is truly disgusting. The vast majority of crimes are committed by American citizens. Plain & simple. The vast majority of illegal immigrants simply want a better life for themselves & there family. You: What. A. Speech. I'm SO thankful to have a president that embodies hope and decency. We're rooting for you @JoeBiden!! permalink parent award report block reply LLP2 2 points 6 days ago Wow! Good thing you're on the right side! Bringin' the receipts! permalink parent award report block reply BeauHD 0 points 6 days ago tl;dr bot crap permalink parent award report block reply Mr_Rightside OP 0 points 6 days ago Logging into all of your sock accounts to downvote me, lmao. What a faggot. But that's a given with you being from Portland. permalink parent award report block reply\nBeauHD 2 points 6 days ago Why do you keep posting this Lisa Simpson regurgitated vomit? Lisa Simpson is a feminazi and is pro everything we are against. permalink parent award report block reply Dirk_Diggler 2 points 6 days ago It's called ironic humor? permalink parent award report block reply Mr_Rightside OP 0 points 6 days ago Why are you sperging out about a meme format that's been around for around a decade. Acting like we can only use memes of characters/celebrities that are only Conservative is retarded. The creator of Pepe is TDS libtard for fuck sakes, and Pepe memes are posted and stickied here daily. Leonardo DiCaprio is also a TDS libtard and both of these memes are posted here frequently. Wayne Knight is a TDS libtard and people post the \" See Nobody Cares \" meme here constantly. Also of course you're a commie faggot from Portland, Beau Hamilton. You: Clinton wiped the floor with Trump tonight. Say hello to your next president, America! #debatenight Steve Bannon, President Trump's chief strategist, has been removed from the National Security Council, official says.\nYou: Better late than never, but to think that Trump thought he was a good fit to begin with encapsulates the ignorance of this administration. President Trump: James Comey better hope that there are no \"tapes\" of our conversations before he starts leaking to the press! You: Ooh, the President of the \"free world\" is making threats now against a former FBI director in the middle of an investigation. IDIOT! You: The stock market is plunging, government is shut down, and Trump keeps tweeting gibberish... Merry Christmas everyone! 🎅🎄 You: This is a disgrace. I hope when shit hits the fan all of Trump's supporters get hosed first. You: Trump citing a couple murders/rapes committed by illegal immigrants is truly disgusting. The vast majority of crimes are committed by American citizens. Plain & simple. The vast majority of illegal immigrants simply want a better life for themselves & there family. You: What. A. Speech. I'm SO thankful to have a president that embodies hope and decency. We're rooting for you @JoeBiden!! permalink parent award report block reply LLP2 2 points 6 days ago Wow! Good thing you're on the right side! Bringin' the receipts! permalink parent award report block reply BeauHD 0 points 6 days ago tl;dr bot crap permalink parent award report block reply Mr_Rightside OP 0 points 6 days ago Logging into all of your sock accounts to downvote me, lmao. What a faggot. But that's a given with you being from Portland. permalink parent award report block reply\nDirk_Diggler 2 points 6 days ago It's called ironic humor? permalink parent award report block reply\nMr_Rightside OP 0 points 6 days ago Why are you sperging out about a meme format that's been around for around a decade. Acting like we can only use memes of characters/celebrities that are only Conservative is retarded. The creator of Pepe is TDS libtard for fuck sakes, and Pepe memes are posted and stickied here daily. Leonardo DiCaprio is also a TDS libtard and both of these memes are posted here frequently. Wayne Knight is a TDS libtard and people post the \" See Nobody Cares \" meme here constantly. Also of course you're a commie faggot from Portland, Beau Hamilton. You: Clinton wiped the floor with Trump tonight. Say hello to your next president, America! #debatenight Steve Bannon, President Trump's chief strategist, has been removed from the National Security Council, official says.\nYou: Better late than never, but to think that Trump thought he was a good fit to begin with encapsulates the ignorance of this administration. President Trump: James Comey better hope that there are no \"tapes\" of our conversations before he starts leaking to the press! You: Ooh, the President of the \"free world\" is making threats now against a former FBI director in the middle of an investigation. IDIOT! You: The stock market is plunging, government is shut down, and Trump keeps tweeting gibberish... Merry Christmas everyone! 🎅🎄 You: This is a disgrace. I hope when shit hits the fan all of Trump's supporters get hosed first. You: Trump citing a couple murders/rapes committed by illegal immigrants is truly disgusting. The vast majority of crimes are committed by American citizens. Plain & simple. The vast majority of illegal immigrants simply want a better life for themselves & there family. You: What. A. Speech. I'm SO thankful to have a president that embodies hope and decency. We're rooting for you @JoeBiden!! permalink parent award report block reply LLP2 2 points 6 days ago Wow! Good thing you're on the right side! Bringin' the receipts! permalink parent award report block reply BeauHD 0 points 6 days ago tl;dr bot crap permalink parent award report block reply Mr_Rightside OP 0 points 6 days ago Logging into all of your sock accounts to downvote me, lmao. What a faggot. But that's a given with you being from Portland. permalink parent award report block reply\nLLP2 2 points 6 days ago Wow! Good thing you're on the right side! Bringin' the receipts! permalink parent award report block reply\nBeauHD 0 points 6 days ago tl;dr bot crap permalink parent award report block reply Mr_Rightside OP 0 points 6 days ago Logging into all of your sock accounts to downvote me, lmao. What a faggot. But that's a given with you being from Portland. permalink parent award report block reply\nMr_Rightside OP 0 points 6 days ago Logging into all of your sock accounts to downvote me, lmao. What a faggot. But that's a given with you being from Portland. permalink parent award report block reply\nParabellum76 2 points 6 days ago The amount of this pattern extrapolated out to everything else is truly insane. The “handout tax” and “multiculturalism tax” makes everything else across the board FAR more expensive. permalink award report block reply\ncarpetxparmesan 1 points 6 days ago That's part of it. But it's mostly because 90% of you EAT OUT. Read that again. 9 in 10 people don't cook at home. They mostly eat out. Makes sense. Why put in a 40k kitchen when you can just eat 40k of food for 6-7 years? Of course there are other factors. Like the 40 million (or more). But keep in mind there are other factors like... some foods are \"below price\" because of food being part of the US defense program and whether you like them or not (some are good, some are bad, the consequences are a mixed bag and often unintended) tariffs and subsidies are a thing. If I had to put my finger on both food and the housing market, other factors like government regulation and cartel-like behavior at high levels would rank #1 for me. But I'll admit I underestimated the effects of illegals a little bit. Still, they're not THE factor. They're a contributing factor. Don't take this as some kind of doompilling or argumentative shitposting. I just want to open your mind to certain realities: defense doctrine/policy, subsidies and tariffs, mostly-globohomo-us-backstabbing corpos. Just like with covid, don't let these people skate by saying oh it's not a real virus. Of course illegals and fraud IS A THING, unlike what democrats claim. Just don't go full retard in the excitement. permalink award report block reply Electrocutioner 2 points 6 days ago I can believe that 9 out of 10 order out each night or everyday. If you take into to account atleast 1 meal isn't home cooked it becomes really easy to reach that number. Like stopping to get a breakfast sandwich and coffee or something for lunch. permalink parent award report block reply Keep_on_winning_kag 2 points 6 days ago My neighbor across the hall leaves every day like clock work when he goes out to eat. permalink parent award report block reply\nElectrocutioner 2 points 6 days ago I can believe that 9 out of 10 order out each night or everyday. If you take into to account atleast 1 meal isn't home cooked it becomes really easy to reach that number. Like stopping to get a breakfast sandwich and coffee or something for lunch. permalink parent award report block reply Keep_on_winning_kag 2 points 6 days ago My neighbor across the hall leaves every day like clock work when he goes out to eat. permalink parent award report block reply\nKeep_on_winning_kag 2 points 6 days ago My neighbor across the hall leaves every day like clock work when he goes out to eat. permalink parent award report block reply\nprojectarcturus1 1 points 6 days ago That is a really big part of it. permalink award report block reply\nMisterMAGA 1 points 6 days ago That’s a reason, one of many. permalink award report block reply\npedespeed 1 points 6 days ago Is it possible Ted is wrong? Are people really getting it for free or are tax payers competing for food against their own government? permalink award report block reply carpetxparmesan 5 points 6 days ago He's not wrong. They are ADVERTISING to EBT. Companies don't advertise to people that don't make them money... at all. I don't know if you noticed, but whenever something good comes for free, at low cost, or is mostly for people who wouldn't otherwise afford it, it's either a government program behind the scenes (usually) or more rarely, people are bundling money to get it done. Things very rarely happen out of grassroots money pooling, to the point that it's almost not a thing that happens. He might be wrong about the degree to which it impacts. But, I would also guess, an area in which this might have a lot of impact is breakfast cereals for kids. Breakfast cereals are bad for kids. They're pretty much breakfast crack, legal, for kids. Legal to advertise, legal to hook them on it, it's pretty much both a physical sugar ADDICTION, yeah they go into withdrawal without it, try it sometime, and a psychological addiction. I would guess a lot of EBT kids eat a lot of expensive breakfast cereal. And parents who actually pay for those cereals are forced to buy them at the inflated, often 100-150% inflated prices. Neither the raw ingredients WHICH ARE SUBSIDIZED, btw, creating a whole other problem/dimension, nor the manufacturing techniques and cost of those cereals are as expensive as the supermarket price of \"cereals\" would suggest. They're not even cheap, like they used to be a long time ago, in BULK... which tells you a lot about pricing strategy. Also, comparing it to animal feed is another interesting approach to it. Yeah, your kid insn't a miniature pony, but.... as you learned in with the chink flu... There are some \"cheap\" alternatives now, 90% of the flavor and \"quality\" for 50% (or less) of the price from the likes of Aldis. Which tells you even more. There are also the profits. If you look at their profits and losses, you'll see the cereal companies pull a verizon/telecom on the government and the public. What do I mean by that? Money going to last line that never gets there (ebt-like). Complaining for 10 years they're losing money and then getting bailed out by the government for 2-3x their \"losses\" with the end result being every 20-30 years, MASSIVE profits off the back of these scams (both on consumers and on government). Hur dur losing money. But you're getting record profits? Oh ... oh... you just got bailed out! Maybe I'm not explaining this properly, but those who follow telecoms, you'll know what I'm talking about. You know where there's \"reality\"? Buckweat. Rice. Cornmeal. Shit people don't want to cook with because cooking from scratch doesnt taste as good, if we're being honest (don't @ me, I know how to make it taste better than store-bought or restaurant), and it takes way more work and planning. So the prices there reflect that reality. Which gives you an idea where these companies are screwing you or lying or getting some government money laundering or kickbacks or whatever the fuck. Beans, however, are not a great indicator, I think there's something else going on with beans. They're a little more expensive than they should be but whatever, not a big deal. Some people think beef really should be 20-30$/lb for the good stuff. I haven't made up my mind about that. I think there are places where he's 100% right (and you are too) and places where it's less accurate or predictive of the cost. Just thoughts, no anger. 🙂👑🪇 permalink parent award report block reply\ncarpetxparmesan 5 points 6 days ago He's not wrong. They are ADVERTISING to EBT. Companies don't advertise to people that don't make them money... at all. I don't know if you noticed, but whenever something good comes for free, at low cost, or is mostly for people who wouldn't otherwise afford it, it's either a government program behind the scenes (usually) or more rarely, people are bundling money to get it done. Things very rarely happen out of grassroots money pooling, to the point that it's almost not a thing that happens. He might be wrong about the degree to which it impacts. But, I would also guess, an area in which this might have a lot of impact is breakfast cereals for kids. Breakfast cereals are bad for kids. They're pretty much breakfast crack, legal, for kids. Legal to advertise, legal to hook them on it, it's pretty much both a physical sugar ADDICTION, yeah they go into withdrawal without it, try it sometime, and a psychological addiction. I would guess a lot of EBT kids eat a lot of expensive breakfast cereal. And parents who actually pay for those cereals are forced to buy them at the inflated, often 100-150% inflated prices. Neither the raw ingredients WHICH ARE SUBSIDIZED, btw, creating a whole other problem/dimension, nor the manufacturing techniques and cost of those cereals are as expensive as the supermarket price of \"cereals\" would suggest. They're not even cheap, like they used to be a long time ago, in BULK... which tells you a lot about pricing strategy. Also, comparing it to animal feed is another interesting approach to it. Yeah, your kid insn't a miniature pony, but.... as you learned in with the chink flu... There are some \"cheap\" alternatives now, 90% of the flavor and \"quality\" for 50% (or less) of the price from the likes of Aldis. Which tells you even more. There are also the profits. If you look at their profits and losses, you'll see the cereal companies pull a verizon/telecom on the government and the public. What do I mean by that? Money going to last line that never gets there (ebt-like). Complaining for 10 years they're losing money and then getting bailed out by the government for 2-3x their \"losses\" with the end result being every 20-30 years, MASSIVE profits off the back of these scams (both on consumers and on government). Hur dur losing money. But you're getting record profits? Oh ... oh... you just got bailed out! Maybe I'm not explaining this properly, but those who follow telecoms, you'll know what I'm talking about. You know where there's \"reality\"? Buckweat. Rice. Cornmeal. Shit people don't want to cook with because cooking from scratch doesnt taste as good, if we're being honest (don't @ me, I know how to make it taste better than store-bought or restaurant), and it takes way more work and planning. So the prices there reflect that reality. Which gives you an idea where these companies are screwing you or lying or getting some government money laundering or kickbacks or whatever the fuck. Beans, however, are not a great indicator, I think there's something else going on with beans. They're a little more expensive than they should be but whatever, not a big deal. Some people think beef really should be 20-30$/lb for the good stuff. I haven't made up my mind about that. I think there are places where he's 100% right (and you are too) and places where it's less accurate or predictive of the cost. Just thoughts, no anger. 🙂👑🪇 permalink parent award report block reply\nCitizen_Bob -1 points 6 days ago iirc 20m of them can be deported. permalink award report block reply\nRedStoneDeepState -4 points 6 days ago Food isnt expensive. Good meat and packaged junk is expensive. Get rid of EBT and you solve the former. permalink award report block reply drmrboy 4 points 6 days ago Yes it is.  Fuck off.  🤓 permalink parent award report block reply carpetxparmesan 3 points 6 days ago Idk, man, I've been \"putting my money where my mouth is\" with farm-to-table, made-in-america, local food, things like that and I regularly pay 2-3x the price of supermarket. Few people will admit it, but it's what actually happens when you walk the walk and you don't just bloviate platitudes. Anyway, not arguing with you, just thought I'd lay it out there. Yeah, I agree with you, just saying that post-walk, things might actually get more expensive. Which would also be fine, I guess. It might actually motivate people to OWN farmland or have big stakes in megacorpos that own the farmland. For the future, as a kind of 40,000ft overview of the future, we shouldn't rely on \"cheap food\". We should actually bite the bullet and eat the expense of OWNING all the farmland in the US. There's not that much of it. If each of us puts 30,000$ and owns ONE acre, we'd be okay. Of course, that's a \"wasted\" 30k to just... hoard stonks, as it were. Anyway, I won't confuse you any further. permalink parent award report block reply RedStoneDeepState 2 points 6 days ago Idk, man, I've been \"putting my money where my mouth is\" with farm-to-table, made-in-america, local food, things like that Dude, you are paying hippies. Virtually all grain, beans, chicken and pork in a supermarket is made in America. Once you go to the farmer and start paying for grain wholesale, you are paying a tiny fraction of retail prices. I personally boycott most imported/Californian food. About the only thing I buy that may be imported is Japanese beef or Argentine/Brazilian beef. But that is a minority of my food budget.  And imported rice, because my boycott on California is more important than boycotting foreign countries. Otherwise pretty much everything I eat is American. ...my food costs are lower than the average American because it means I have low effort vegetable gardens and I dont eat imported exotic shit. permalink parent award report block reply carpetxparmesan 1 points 5 days ago You have a valid perspective. It can be done that way, yes. I've also found that, as you say, my food habits (and spending) changed when I grow my own garden. permalink parent award report block reply\ndrmrboy 4 points 6 days ago Yes it is.  Fuck off.  🤓 permalink parent award report block reply\ncarpetxparmesan 3 points 6 days ago Idk, man, I've been \"putting my money where my mouth is\" with farm-to-table, made-in-america, local food, things like that and I regularly pay 2-3x the price of supermarket. Few people will admit it, but it's what actually happens when you walk the walk and you don't just bloviate platitudes. Anyway, not arguing with you, just thought I'd lay it out there. Yeah, I agree with you, just saying that post-walk, things might actually get more expensive. Which would also be fine, I guess. It might actually motivate people to OWN farmland or have big stakes in megacorpos that own the farmland. For the future, as a kind of 40,000ft overview of the future, we shouldn't rely on \"cheap food\". We should actually bite the bullet and eat the expense of OWNING all the farmland in the US. There's not that much of it. If each of us puts 30,000$ and owns ONE acre, we'd be okay. Of course, that's a \"wasted\" 30k to just... hoard stonks, as it were. Anyway, I won't confuse you any further. permalink parent award report block reply RedStoneDeepState 2 points 6 days ago Idk, man, I've been \"putting my money where my mouth is\" with farm-to-table, made-in-america, local food, things like that Dude, you are paying hippies. Virtually all grain, beans, chicken and pork in a supermarket is made in America. Once you go to the farmer and start paying for grain wholesale, you are paying a tiny fraction of retail prices. I personally boycott most imported/Californian food. About the only thing I buy that may be imported is Japanese beef or Argentine/Brazilian beef. But that is a minority of my food budget.  And imported rice, because my boycott on California is more important than boycotting foreign countries. Otherwise pretty much everything I eat is American. ...my food costs are lower than the average American because it means I have low effort vegetable gardens and I dont eat imported exotic shit. permalink parent award report block reply carpetxparmesan 1 points 5 days ago You have a valid perspective. It can be done that way, yes. I've also found that, as you say, my food habits (and spending) changed when I grow my own garden. permalink parent award report block reply\nRedStoneDeepState 2 points 6 days ago Idk, man, I've been \"putting my money where my mouth is\" with farm-to-table, made-in-america, local food, things like that Dude, you are paying hippies. Virtually all grain, beans, chicken and pork in a supermarket is made in America. Once you go to the farmer and start paying for grain wholesale, you are paying a tiny fraction of retail prices. I personally boycott most imported/Californian food. About the only thing I buy that may be imported is Japanese beef or Argentine/Brazilian beef. But that is a minority of my food budget.  And imported rice, because my boycott on California is more important than boycotting foreign countries. Otherwise pretty much everything I eat is American. ...my food costs are lower than the average American because it means I have low effort vegetable gardens and I dont eat imported exotic shit. permalink parent award report block reply carpetxparmesan 1 points 5 days ago You have a valid perspective. It can be done that way, yes. I've also found that, as you say, my food habits (and spending) changed when I grow my own garden. permalink parent award report block reply\ncarpetxparmesan 1 points 5 days ago You have a valid perspective. It can be done that way, yes. I've also found that, as you say, my food habits (and spending) changed when I grow my own garden. permalink parent award report block reply"}