{"id": "1ARK9pfbM4", "contents": "33 Long article but eye-opening: Why Taiwan Really Matters to the U.S. (time.com) posted 8 hours ago by barronwin 6 comments award share report block Why Protecting Taiwan Really Matters to the U.S. Defending far-off Taiwan and our allies seems to many like yet another foolish military misadventure for our country. But it is not. time.com\n6 comments Sort by Top Top New Worst Old Save Around the Web From Hair Loss to Hair Boss in A Few Days. Try It! HaloGrow Taylor3006 4 points 7 hours ago LOL sure, sure.  Like Time magazine is some sort of reputable source of information.... Taiwan could sink into the fucking ocean and we wouldn't even notice except for maybe a shortage of computer chips. permalink award report block reply patrioticwinning3 1 points 7 hours ago True...but they put computer chips in fucking everything.... permalink parent award report block reply barronwin OP 0 points 7 hours ago Maybe read more carefully- this article barely mentions computer chips. Also, our entire military depends on Taiwan's chips - they go, and China can and will actually destroy us permalink parent award report block reply mykillk 1 points 7 hours ago This article seems like word soup for middle school level intellectuals. Having trouble understanding the point trying to be made. Some of it seems non-sensical. Take this for instance... First, Taiwan is vital to the defense of Japan, South Korea, and the Philippines. If China occupied Taiwan, it would pose a much greater threat to these countries and be able to project power deep into the Pacific, a very real possibility as we can see from China’s activities in Solomon Islands and its construction of an enormous oceangoing navy, including aircraft carriers. What nonsense. Taiwan is not \"deep Pacific\" in the least, it's just off the shore. China already has all the access and options it needs to attack South Korea, Japan, and the Philippines. Taiwan is not needed in the least for these goals. permalink award report block reply Ugh3rdaccount 1 points 6 hours ago Taiwan, Israel, Ukraine, etc., etc. Yawn. Meanwhile my parents American hometown is now completely filled with violent jihadist terrorists. permalink award report block reply barronwin OP 0 points 7 hours ago \"In this world, Americans might be physically secure, given our two oceans and our nuclear arsenal, but we would be much less prosperous and economically secure, and thus also much less free. Most Americans would effectively be working for Chinese companies or their subsidiaries in one way or another, answer to Chinese regulators, and read and consume information curated in Beijing. We’d all be compelled to dance to Beijing’s tune. To make it concrete: Many if not most Americans agree that there are huge problems with our social media companies and the way they are regulated today. But we are all assuming that Americans have the power to remedy the problem. But if Beijing is dominant over the world economy, that will not be the case. The social media companies will ultimately be answerable to Beijing.\" permalink award report block reply\nTaylor3006 4 points 7 hours ago LOL sure, sure.  Like Time magazine is some sort of reputable source of information.... Taiwan could sink into the fucking ocean and we wouldn't even notice except for maybe a shortage of computer chips. permalink award report block reply patrioticwinning3 1 points 7 hours ago True...but they put computer chips in fucking everything.... permalink parent award report block reply barronwin OP 0 points 7 hours ago Maybe read more carefully- this article barely mentions computer chips. Also, our entire military depends on Taiwan's chips - they go, and China can and will actually destroy us permalink parent award report block reply\npatrioticwinning3 1 points 7 hours ago True...but they put computer chips in fucking everything.... permalink parent award report block reply\nbarronwin OP 0 points 7 hours ago Maybe read more carefully- this article barely mentions computer chips. Also, our entire military depends on Taiwan's chips - they go, and China can and will actually destroy us permalink parent award report block reply\nmykillk 1 points 7 hours ago This article seems like word soup for middle school level intellectuals. Having trouble understanding the point trying to be made. Some of it seems non-sensical. Take this for instance... First, Taiwan is vital to the defense of Japan, South Korea, and the Philippines. If China occupied Taiwan, it would pose a much greater threat to these countries and be able to project power deep into the Pacific, a very real possibility as we can see from China’s activities in Solomon Islands and its construction of an enormous oceangoing navy, including aircraft carriers. What nonsense. Taiwan is not \"deep Pacific\" in the least, it's just off the shore. China already has all the access and options it needs to attack South Korea, Japan, and the Philippines. Taiwan is not needed in the least for these goals. permalink award report block reply\nUgh3rdaccount 1 points 6 hours ago Taiwan, Israel, Ukraine, etc., etc. Yawn. Meanwhile my parents American hometown is now completely filled with violent jihadist terrorists. permalink award report block reply\nbarronwin OP 0 points 7 hours ago \"In this world, Americans might be physically secure, given our two oceans and our nuclear arsenal, but we would be much less prosperous and economically secure, and thus also much less free. Most Americans would effectively be working for Chinese companies or their subsidiaries in one way or another, answer to Chinese regulators, and read and consume information curated in Beijing. We’d all be compelled to dance to Beijing’s tune. To make it concrete: Many if not most Americans agree that there are huge problems with our social media companies and the way they are regulated today. But we are all assuming that Americans have the power to remedy the problem. But if Beijing is dominant over the world economy, that will not be the case. The social media companies will ultimately be answerable to Beijing.\" permalink award report block reply"}