{"id": "1ARK57qr6y", "contents": "290 Did You Folks Know that Thune and the R's by a Simple Vote Can Force the D's to Hold the Floor to Continue the Filibuster posted 4 days ago by dataonly 6 comments award share report block That means a member will have to be on the Floor speaking continuously. Continuously actually means continuously. You all do realize how lazy politicos actually are, correct?\n6 comments Sort by Top Top New Worst Old Save RealmanPwns 10 points 4 days ago Republicans have already started the process. It requires these steps which Republicans have already done step 1 on Nov. 7th. Start with the Motion and Prolong the Legislative Day: Thune moves to proceed to the bill. The Senate recesses (instead of adjourning) during breaks, keeping everything on the same legislative day. This prevents the \"speech clock\" from resetting—Rule XIX limits each senator to two speeches per legislative day on the same question (e.g., the motion to proceed).\nEnforce Speaking Limits: Republicans stay mostly silent but raise points of order if Democrats go off-topic (debate must be germane for the first three hours daily). Violators must yield the floor, counting as one speech used. Any Democratic motions to delay (e.g., quorum calls) get tabled by simple majority vote (51-49 or whatever the tally is), blocking resets. Appeals of rulings? Also tabled by simple majority.\nDaily Cloture Filings to Accelerate Exhaustion: Republicans file cloture (to end debate) on the motion each day. When it \"ripens\" (after ~30 hours), it forces anyone speaking to yield, using up a speech. If cloture fails (as expected without 60 votes), Democrats must immediately use their second speech to keep filibustering—limiting them to ~5-10 hours total per senator before exhaustion.\nEndgame: Simple Majority Vote Once Speeches Run Out: With ~10-15 Democrats committed to filibustering, they'd burn through speeches in 50-100 hours (spread over calendar days but one legislative day). At that point, the presiding officer calls the question—no more debate—and Republicans pass the motion to proceed by simple majority (no 60-vote threshold needed for this step). permalink award report block reply dataonly OP 8 points 4 days ago Thanks for the details. That reply should be a thread of its own! permalink parent award report block reply Covfefebrulee 7 points 4 days ago This. permalink award report block reply TheAftermath 6 points 4 days ago They're not lazy, they're Deep State assets who have been paid to destroy Trump's Presidency. Thune is their C.I.A. installed ringleader. permalink award report block reply dataonly OP 6 points 4 days ago Both can be true. They are demonstrably lazy.  Check how many of them routinely miss votes. permalink parent award report block reply TheAftermath 5 points 4 days ago Yes, I guess you're right. Their moral turpitude could be seen as another aspect of their traitorous psyches. The bastards, along with the Dems (all of whom are C.I.A. assets) are effectively rendering Trump a lame duck President. permalink parent award report block reply 2016TrumpMAGA 2 points 4 days ago Yes, I knew that. What we call the 'filibuster' is not a filibuster, it is the threat of a filibuster. permalink award report block reply booblitchutz 1 points 4 days ago Yes but the virtual filibuster provides cover for RINOs. They will never get rid of it. permalink award report block reply\nRealmanPwns 10 points 4 days ago Republicans have already started the process. It requires these steps which Republicans have already done step 1 on Nov. 7th. Start with the Motion and Prolong the Legislative Day: Thune moves to proceed to the bill. The Senate recesses (instead of adjourning) during breaks, keeping everything on the same legislative day. This prevents the \"speech clock\" from resetting—Rule XIX limits each senator to two speeches per legislative day on the same question (e.g., the motion to proceed).\nEnforce Speaking Limits: Republicans stay mostly silent but raise points of order if Democrats go off-topic (debate must be germane for the first three hours daily). Violators must yield the floor, counting as one speech used. Any Democratic motions to delay (e.g., quorum calls) get tabled by simple majority vote (51-49 or whatever the tally is), blocking resets. Appeals of rulings? Also tabled by simple majority.\nDaily Cloture Filings to Accelerate Exhaustion: Republicans file cloture (to end debate) on the motion each day. When it \"ripens\" (after ~30 hours), it forces anyone speaking to yield, using up a speech. If cloture fails (as expected without 60 votes), Democrats must immediately use their second speech to keep filibustering—limiting them to ~5-10 hours total per senator before exhaustion.\nEndgame: Simple Majority Vote Once Speeches Run Out: With ~10-15 Democrats committed to filibustering, they'd burn through speeches in 50-100 hours (spread over calendar days but one legislative day). At that point, the presiding officer calls the question—no more debate—and Republicans pass the motion to proceed by simple majority (no 60-vote threshold needed for this step). permalink award report block reply dataonly OP 8 points 4 days ago Thanks for the details. That reply should be a thread of its own! permalink parent award report block reply\ndataonly OP 8 points 4 days ago Thanks for the details. That reply should be a thread of its own! permalink parent award report block reply\nCovfefebrulee 7 points 4 days ago This. permalink award report block reply\nTheAftermath 6 points 4 days ago They're not lazy, they're Deep State assets who have been paid to destroy Trump's Presidency. Thune is their C.I.A. installed ringleader. permalink award report block reply dataonly OP 6 points 4 days ago Both can be true. They are demonstrably lazy.  Check how many of them routinely miss votes. permalink parent award report block reply TheAftermath 5 points 4 days ago Yes, I guess you're right. Their moral turpitude could be seen as another aspect of their traitorous psyches. The bastards, along with the Dems (all of whom are C.I.A. assets) are effectively rendering Trump a lame duck President. permalink parent award report block reply\ndataonly OP 6 points 4 days ago Both can be true. They are demonstrably lazy.  Check how many of them routinely miss votes. permalink parent award report block reply TheAftermath 5 points 4 days ago Yes, I guess you're right. Their moral turpitude could be seen as another aspect of their traitorous psyches. The bastards, along with the Dems (all of whom are C.I.A. assets) are effectively rendering Trump a lame duck President. permalink parent award report block reply\nTheAftermath 5 points 4 days ago Yes, I guess you're right. Their moral turpitude could be seen as another aspect of their traitorous psyches. The bastards, along with the Dems (all of whom are C.I.A. assets) are effectively rendering Trump a lame duck President. permalink parent award report block reply\n2016TrumpMAGA 2 points 4 days ago Yes, I knew that. What we call the 'filibuster' is not a filibuster, it is the threat of a filibuster. permalink award report block reply\nbooblitchutz 1 points 4 days ago Yes but the virtual filibuster provides cover for RINOs. They will never get rid of it. permalink award report block reply"}