{"id": "1ARK9nOnqi", "contents": "1126 Secretary Sean Duffy: @CAGovernor & his state were caught red-handed after weeks of claiming they did nothing wrong. Now that we’ve exposed their lies, 17,000 illegally issued trucking licenses are being revoked.California must revoke every illegally issued CDL or I will pull $160M in federal funds. posted 5 hours ago by Mr_Rightside 73 comments award share download report block\n73 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style Krat 85 points 5 hours ago Did you get a liberal judges permission to pull that funding ?!? permalink award report block reply Grindelwald 25 points 5 hours ago Waiting for that. It seems that all these liberal judges are outing themselves and positioning to be impeached from office. permalink parent award report block reply MasterChief08 31 points 4 hours ago They'll never be impeached. We need other solutions permalink parent award report block reply glow-operator-2-0 4 points 2 hours ago laughs in #4 buckshot permalink parent award report block reply Krat 15 points 4 hours ago Still holding out for those arrests too ? permalink parent award report block reply UCantStumpTheTrump 1 points 57 minutes ago I see you posting the same bullshit dooming comments on every thread. James Comey, Letitia James and John Bolton have been indicted with more coming down the pipeline permalink parent award report block reply Doritalos 7 points 4 hours ago In two more weeks.... permalink parent award report block reply Seldom_Seen_Kid 5 points 4 hours ago Impeachment means fuck all to these people. Jailing or the rope for treason is the only way. permalink parent award report block reply Grindelwald 5 points 4 hours ago I do like the old ways permalink parent award report block reply mty_green_go 2 points 3 hours ago \"Safe and effective\"... just like new vaccines permalink parent award report block reply 0care 2 points 3 hours ago certainly no reoffending permalink parent award report block reply Standingoak 2 points 4 hours ago Did they allow so many licenses ? permalink parent award report block reply drattastic1 2 points 2 hours ago Yup injunction from activist judge in 3..2.. permalink parent award report block reply Scot 64 points 4 hours ago CDLs are the tip of the iceberg. They have been issuing regular licenses to MILLIONS of illegal invaders and registering them to vote. They don't actually vote themselves, the democrats do that for them. permalink award report block reply Get_Off_Big_Tech 27 points 4 hours ago This. They register you to vote at the DMV when you get a license. permalink parent award report block reply Reefay 14 points 4 hours ago Motor Voter permalink parent award report block reply SavingPrivateGrace 9 points 4 hours ago We couldn't out cheat them if we tried.  This is what we need to prove and stop hoping for same day voter ID. permalink parent award report block reply UCantStumpTheTrump 2 points 55 minutes ago Yep and then the DNC “harvests” your ballot and your vote is counted weeks after the election if the Dems need more votes permalink parent award report block reply RiffFantastic 8 points 4 hours ago The CA Drivers Licenses and IDs were so loosely issued that it basically rendered all of them void. Hence, they had to issue a new REAL ID product. The state is so massively corrupt. permalink parent award report block reply IncredibleMrE1 4 points 4 hours ago Absolutely correct. permalink parent award report block reply CrankyCrab 3 points 4 hours ago California is the mecca for fuckery! permalink parent award report block reply HunterBidensPC 35 points 5 hours ago I love how lying has no consequences anymore permalink award report block reply snoopy3210 7 points 4 hours ago Yeah but the 17000 number is probably a lie too, that’s way too fast. They are revoking much slower than that permalink parent award report block reply zaqwert45 -3 points 4 hours ago The number 17, I'm sure I have seen that somewhere before. Strange! permalink parent award report block reply UsernameChexOut 2 points 4 hours ago I mean, technically it does, just not the ones that we want. The consequences are all positive for the liars. permalink parent award report block reply redpirsig 2 points 2 hours ago \"Our Constitution was made only for a moral and religious people. It is wholly inadequate to the government of any other\" - John Adams permalink parent award report block reply Iremembermypassword 1 points 4 hours ago Sorry, but a district judge has ruled that lying is ok. permalink parent award report block reply highlandparker 1 points 1 hour ago if it helps brown gay or woman permalink parent award report block reply POTUS_DonnieJ 20 points 4 hours ago Can we please stop tweeting threats in response to gross violations of federal law that put all of us in danger and JUST DO IT?? permalink award report block reply SutopSutolf 1 points 1 hour ago They’re already doing shit that they don’t tweet. This is just optics. permalink parent award report block reply Covefefe 18 points 4 hours ago What do you mean OR? It’s time to indict, disbarred, fine, and imprison offenders.   Do what you would do to private citizen Joe Conservative. permalink award report block reply Iremembermypassword 6 points 4 hours ago Pull funding until they have revoked everything. Watch how quickly they fold. permalink parent award report block reply josiborg 11 points 4 hours ago STFU and pull it anyway. permalink award report block reply maverick202 8 points 4 hours ago You know nothing is going to happen when they send out strongly worded tweet. permalink parent award report block reply josiborg 3 points 4 hours ago I know it's all a continued choreographed show to the masses there's an actual America First platform while we get the Syrian president getting slobber jobbers in the oval office, 600,000 more Chinese university students, H1B visa trendline at an exponential curve, rehiring all with back pay worthless government employees to steal more taxes, bullshit deportation rates that put my children in higher danger of rape & honor killings, free healthcare to Ukraine & Israel, .. it's all a fucking a show man and we're just the same useful puppets to pillage. permalink parent award report block reply KernalMustard 3 points 3 hours ago I had faith. Its now on us. Prepare yourselves for the shitstorm permalink parent award report block reply Mr_Rightside OP 10 points 5 hours ago https://x.com/SecDuffy/status/1988626102722474277 permalink award report block reply Meddlesom 8 points 3 hours ago He's doing things in the wrong order. Pull the funding first, and tell them you'll only restore it once they comply... ...then once they comply, spend that money on deportations. permalink award report block reply Drekken- 1 points 45 minutes ago 160 million? Oh no! How will California survive? ARREST SOMEONE. ANYONE! DAMMIT permalink parent award report block reply ThisIsMethBeth 6 points 4 hours ago Anyone else find it hilarious that Newsom is obviously copying Trump’s tweeting style these days?? Using petty nicknames in this tweet, saw previous tweets where he used all caps in classic Trump style. It’s so transparent it’s hilarious. “Trump’s style must have worked because he’s President, so let’s just copy it.” Lollll permalink award report block reply Aquamine-Amarine 6 points 4 hours ago Those are really stupid nicknames. permalink award report block reply Parhelion12 5 points 4 hours ago The left can't meme. permalink parent award report block reply Classygasoline 5 points 4 hours ago Does the state of California get punished at all for issuing those licenses? Do the families that lost loved ones to those \"licensed\" truckers get to sue California? Something needs to be done or this shit will continue until the country is gone permalink award report block reply JBlaze056 5 points 4 hours ago How about punish them for their behavior right now and not after they do something else. permalink award report block reply ReleasetheList 4 points 3 hours ago How about some prison time for those responsible? Oh, I know that's way to much to ask. permalink award report block reply Formerlurker92 3 points 3 hours ago Just pull it. You're gonna need time to fight the district court judges permalink award report block reply Klaus73 2 points 2 hours ago Sounds like a breakdown between States. permalink award report block reply itspancakees 2 points 2 hours ago Just pull the funding now, why wait?! permalink award report block reply SavingPrivateGrace 2 points 4 hours ago The commies sure had a good time problem solving what to do with their new imported voters driving their elections. permalink award report block reply thisisatestof2 2 points 4 hours ago Can we just revoke their federal funding anyway? permalink award report block reply NoMoreShinesBilly 2 points 3 hours ago pull the funding first.  agree to reinstate later once the illegality is \"resolved.\" permalink award report block reply ActNow 2 points 4 hours ago 17K!?! I thought the roads were getting crazy. Thank you, Secretary Duffy. permalink award report block reply schiff_for_brains 2 points 4 hours ago The damage has already been done.  There are official plastic cards saying No Name Given is qualified to drive massive trucks on the road. permalink award report block reply scrubking 2 points 3 hours ago Another day, another empty Republican threat. permalink award report block reply Truth_Cipher 1 points 3 hours ago Just pull all funding and let things sort themselves out. Remove sanctuary states ability to issue CDLs and really anything past an ID card. That will force policy change. permalink award report block reply 67Vert 1 points 3 hours ago $160M doesn’t seem like much in this context. permalink award report block reply contender 1 points 2 hours ago and 17,000 new voters the DMV test terminal registers you to vote permalink award report block reply Morokei 1 points 4 hours ago At least Duffy has a concrete plan to actually do something. Instead of sending a memo to Congress like Blondie. permalink award report block reply gaijin_ronin 1 points 2 hours ago Lawsuits probably already filed against this. permalink award report block reply midgetpornrocks 1 points 1 hour ago Why can't we have both? permalink award report block reply Stormeyworld13 1 points 19 minutes ago Why can't we just arrest Gavin Newscum?! Really. Remove him from office. He stole his election. We recalled that evil bastard and he cheated to stay. Send him off to GITMO now! permalink award report block reply NoWorries77 1 points 53 minutes ago Enough talk. Pull the doggon money. permalink award report block reply lifeisahologram 1 points 1 hour ago How about we start DOING things first, as a consequence for what they already did, then they will have incentive to stop and comply so we stop? permalink award report block reply Goatboy66 1 points 3 hours ago Non-Citizens can be here Legally. It doesn't Mean Illegal Aliens. permalink award report block reply Michalusmichalus 1 points 2 hours ago It's a word game. Resident aliens would have been called just that. permalink parent award report block reply PhantomShield72 1 points 3 hours ago Social Media Posts and nothing more. Awesome. permalink award report block reply Tookens 1 points 1 hour ago That's nice but $160 million compared to CA's annual budget is nothing. permalink award report block reply IPMang 1 points 12 minutes ago Notice how when the government does something illegal, nobody gets sued or goes to jail or has literally anything bad happen? Weird. permalink award report block reply CrankyCrab 1 points 4 hours ago 17,000 illegal CDLs issued by Commiefornia!!!  That alone more than justifies pulling the funding! permalink award report block reply NonbinaryPotatohead 1 points 3 hours ago Do it and then talk about it for once permalink award report block reply YodaBannon 1 points 4 hours ago that’s it! I’m gettin grandma! permalink award report block reply slimcoat 1 points 1 hour ago No \"or\". Pull the funds NOW and reinstate them once they cooperate fully. permalink award report block reply edxzxz 1 points 2 hours ago Here's a crazy idea - instead of demanding they stop doing illegal shit or else you'll punish them, punish them for doing the illegal shit, and then they'll stop.  Because everyone knows if you actually intended to punish them, they'd already have been punished. permalink award report block reply iamherefortheluls 0 points 4 hours ago good, keep pressing forward permalink award report block reply\nKrat 85 points 5 hours ago Did you get a liberal judges permission to pull that funding ?!? permalink award report block reply Grindelwald 25 points 5 hours ago Waiting for that. It seems that all these liberal judges are outing themselves and positioning to be impeached from office. permalink parent award report block reply MasterChief08 31 points 4 hours ago They'll never be impeached. We need other solutions permalink parent award report block reply glow-operator-2-0 4 points 2 hours ago laughs in #4 buckshot permalink parent award report block reply Krat 15 points 4 hours ago Still holding out for those arrests too ? permalink parent award report block reply UCantStumpTheTrump 1 points 57 minutes ago I see you posting the same bullshit dooming comments on every thread. James Comey, Letitia James and John Bolton have been indicted with more coming down the pipeline permalink parent award report block reply Doritalos 7 points 4 hours ago In two more weeks.... permalink parent award report block reply Seldom_Seen_Kid 5 points 4 hours ago Impeachment means fuck all to these people. Jailing or the rope for treason is the only way. permalink parent award report block reply Grindelwald 5 points 4 hours ago I do like the old ways permalink parent award report block reply mty_green_go 2 points 3 hours ago \"Safe and effective\"... just like new vaccines permalink parent award report block reply 0care 2 points 3 hours ago certainly no reoffending permalink parent award report block reply Standingoak 2 points 4 hours ago Did they allow so many licenses ? permalink parent award report block reply drattastic1 2 points 2 hours ago Yup injunction from activist judge in 3..2.. permalink parent award report block reply\nGrindelwald 25 points 5 hours ago Waiting for that. It seems that all these liberal judges are outing themselves and positioning to be impeached from office. permalink parent award report block reply MasterChief08 31 points 4 hours ago They'll never be impeached. We need other solutions permalink parent award report block reply glow-operator-2-0 4 points 2 hours ago laughs in #4 buckshot permalink parent award report block reply Krat 15 points 4 hours ago Still holding out for those arrests too ? permalink parent award report block reply UCantStumpTheTrump 1 points 57 minutes ago I see you posting the same bullshit dooming comments on every thread. James Comey, Letitia James and John Bolton have been indicted with more coming down the pipeline permalink parent award report block reply Doritalos 7 points 4 hours ago In two more weeks.... permalink parent award report block reply Seldom_Seen_Kid 5 points 4 hours ago Impeachment means fuck all to these people. Jailing or the rope for treason is the only way. permalink parent award report block reply Grindelwald 5 points 4 hours ago I do like the old ways permalink parent award report block reply mty_green_go 2 points 3 hours ago \"Safe and effective\"... just like new vaccines permalink parent award report block reply 0care 2 points 3 hours ago certainly no reoffending permalink parent award report block reply\nMasterChief08 31 points 4 hours ago They'll never be impeached. We need other solutions permalink parent award report block reply glow-operator-2-0 4 points 2 hours ago laughs in #4 buckshot permalink parent award report block reply\nglow-operator-2-0 4 points 2 hours ago laughs in #4 buckshot permalink parent award report block reply\nKrat 15 points 4 hours ago Still holding out for those arrests too ? permalink parent award report block reply UCantStumpTheTrump 1 points 57 minutes ago I see you posting the same bullshit dooming comments on every thread. James Comey, Letitia James and John Bolton have been indicted with more coming down the pipeline permalink parent award report block reply\nUCantStumpTheTrump 1 points 57 minutes ago I see you posting the same bullshit dooming comments on every thread. James Comey, Letitia James and John Bolton have been indicted with more coming down the pipeline permalink parent award report block reply\nDoritalos 7 points 4 hours ago In two more weeks.... permalink parent award report block reply\nSeldom_Seen_Kid 5 points 4 hours ago Impeachment means fuck all to these people. Jailing or the rope for treason is the only way. permalink parent award report block reply Grindelwald 5 points 4 hours ago I do like the old ways permalink parent award report block reply mty_green_go 2 points 3 hours ago \"Safe and effective\"... just like new vaccines permalink parent award report block reply 0care 2 points 3 hours ago certainly no reoffending permalink parent award report block reply\nGrindelwald 5 points 4 hours ago I do like the old ways permalink parent award report block reply mty_green_go 2 points 3 hours ago \"Safe and effective\"... just like new vaccines permalink parent award report block reply 0care 2 points 3 hours ago certainly no reoffending permalink parent award report block reply\nmty_green_go 2 points 3 hours ago \"Safe and effective\"... just like new vaccines permalink parent award report block reply\n0care 2 points 3 hours ago certainly no reoffending permalink parent award report block reply\nStandingoak 2 points 4 hours ago Did they allow so many licenses ? permalink parent award report block reply\ndrattastic1 2 points 2 hours ago Yup injunction from activist judge in 3..2.. permalink parent award report block reply\nScot 64 points 4 hours ago CDLs are the tip of the iceberg. They have been issuing regular licenses to MILLIONS of illegal invaders and registering them to vote. They don't actually vote themselves, the democrats do that for them. permalink award report block reply Get_Off_Big_Tech 27 points 4 hours ago This. They register you to vote at the DMV when you get a license. permalink parent award report block reply Reefay 14 points 4 hours ago Motor Voter permalink parent award report block reply SavingPrivateGrace 9 points 4 hours ago We couldn't out cheat them if we tried.  This is what we need to prove and stop hoping for same day voter ID. permalink parent award report block reply UCantStumpTheTrump 2 points 55 minutes ago Yep and then the DNC “harvests” your ballot and your vote is counted weeks after the election if the Dems need more votes permalink parent award report block reply RiffFantastic 8 points 4 hours ago The CA Drivers Licenses and IDs were so loosely issued that it basically rendered all of them void. Hence, they had to issue a new REAL ID product. The state is so massively corrupt. permalink parent award report block reply IncredibleMrE1 4 points 4 hours ago Absolutely correct. permalink parent award report block reply CrankyCrab 3 points 4 hours ago California is the mecca for fuckery! permalink parent award report block reply\nGet_Off_Big_Tech 27 points 4 hours ago This. They register you to vote at the DMV when you get a license. permalink parent award report block reply Reefay 14 points 4 hours ago Motor Voter permalink parent award report block reply SavingPrivateGrace 9 points 4 hours ago We couldn't out cheat them if we tried.  This is what we need to prove and stop hoping for same day voter ID. permalink parent award report block reply UCantStumpTheTrump 2 points 55 minutes ago Yep and then the DNC “harvests” your ballot and your vote is counted weeks after the election if the Dems need more votes permalink parent award report block reply\nReefay 14 points 4 hours ago Motor Voter permalink parent award report block reply SavingPrivateGrace 9 points 4 hours ago We couldn't out cheat them if we tried.  This is what we need to prove and stop hoping for same day voter ID. permalink parent award report block reply\nSavingPrivateGrace 9 points 4 hours ago We couldn't out cheat them if we tried.  This is what we need to prove and stop hoping for same day voter ID. permalink parent award report block reply\nUCantStumpTheTrump 2 points 55 minutes ago Yep and then the DNC “harvests” your ballot and your vote is counted weeks after the election if the Dems need more votes permalink parent award report block reply\nRiffFantastic 8 points 4 hours ago The CA Drivers Licenses and IDs were so loosely issued that it basically rendered all of them void. Hence, they had to issue a new REAL ID product. The state is so massively corrupt. permalink parent award report block reply\nIncredibleMrE1 4 points 4 hours ago Absolutely correct. permalink parent award report block reply\nCrankyCrab 3 points 4 hours ago California is the mecca for fuckery! permalink parent award report block reply\nHunterBidensPC 35 points 5 hours ago I love how lying has no consequences anymore permalink award report block reply snoopy3210 7 points 4 hours ago Yeah but the 17000 number is probably a lie too, that’s way too fast. They are revoking much slower than that permalink parent award report block reply zaqwert45 -3 points 4 hours ago The number 17, I'm sure I have seen that somewhere before. Strange! permalink parent award report block reply UsernameChexOut 2 points 4 hours ago I mean, technically it does, just not the ones that we want. The consequences are all positive for the liars. permalink parent award report block reply redpirsig 2 points 2 hours ago \"Our Constitution was made only for a moral and religious people. It is wholly inadequate to the government of any other\" - John Adams permalink parent award report block reply Iremembermypassword 1 points 4 hours ago Sorry, but a district judge has ruled that lying is ok. permalink parent award report block reply highlandparker 1 points 1 hour ago if it helps brown gay or woman permalink parent award report block reply\nsnoopy3210 7 points 4 hours ago Yeah but the 17000 number is probably a lie too, that’s way too fast. They are revoking much slower than that permalink parent award report block reply zaqwert45 -3 points 4 hours ago The number 17, I'm sure I have seen that somewhere before. Strange! permalink parent award report block reply\nzaqwert45 -3 points 4 hours ago The number 17, I'm sure I have seen that somewhere before. Strange! permalink parent award report block reply\nUsernameChexOut 2 points 4 hours ago I mean, technically it does, just not the ones that we want. The consequences are all positive for the liars. permalink parent award report block reply\nredpirsig 2 points 2 hours ago \"Our Constitution was made only for a moral and religious people. It is wholly inadequate to the government of any other\" - John Adams permalink parent award report block reply\nIremembermypassword 1 points 4 hours ago Sorry, but a district judge has ruled that lying is ok. permalink parent award report block reply highlandparker 1 points 1 hour ago if it helps brown gay or woman permalink parent award report block reply\nhighlandparker 1 points 1 hour ago if it helps brown gay or woman permalink parent award report block reply\nPOTUS_DonnieJ 20 points 4 hours ago Can we please stop tweeting threats in response to gross violations of federal law that put all of us in danger and JUST DO IT?? permalink award report block reply SutopSutolf 1 points 1 hour ago They’re already doing shit that they don’t tweet. This is just optics. permalink parent award report block reply\nSutopSutolf 1 points 1 hour ago They’re already doing shit that they don’t tweet. This is just optics. permalink parent award report block reply\nCovefefe 18 points 4 hours ago What do you mean OR? It’s time to indict, disbarred, fine, and imprison offenders.   Do what you would do to private citizen Joe Conservative. permalink award report block reply Iremembermypassword 6 points 4 hours ago Pull funding until they have revoked everything. Watch how quickly they fold. permalink parent award report block reply\nIremembermypassword 6 points 4 hours ago Pull funding until they have revoked everything. Watch how quickly they fold. permalink parent award report block reply\njosiborg 11 points 4 hours ago STFU and pull it anyway. permalink award report block reply maverick202 8 points 4 hours ago You know nothing is going to happen when they send out strongly worded tweet. permalink parent award report block reply josiborg 3 points 4 hours ago I know it's all a continued choreographed show to the masses there's an actual America First platform while we get the Syrian president getting slobber jobbers in the oval office, 600,000 more Chinese university students, H1B visa trendline at an exponential curve, rehiring all with back pay worthless government employees to steal more taxes, bullshit deportation rates that put my children in higher danger of rape & honor killings, free healthcare to Ukraine & Israel, .. it's all a fucking a show man and we're just the same useful puppets to pillage. permalink parent award report block reply KernalMustard 3 points 3 hours ago I had faith. Its now on us. Prepare yourselves for the shitstorm permalink parent award report block reply\nmaverick202 8 points 4 hours ago You know nothing is going to happen when they send out strongly worded tweet. permalink parent award report block reply josiborg 3 points 4 hours ago I know it's all a continued choreographed show to the masses there's an actual America First platform while we get the Syrian president getting slobber jobbers in the oval office, 600,000 more Chinese university students, H1B visa trendline at an exponential curve, rehiring all with back pay worthless government employees to steal more taxes, bullshit deportation rates that put my children in higher danger of rape & honor killings, free healthcare to Ukraine & Israel, .. it's all a fucking a show man and we're just the same useful puppets to pillage. permalink parent award report block reply KernalMustard 3 points 3 hours ago I had faith. Its now on us. Prepare yourselves for the shitstorm permalink parent award report block reply\njosiborg 3 points 4 hours ago I know it's all a continued choreographed show to the masses there's an actual America First platform while we get the Syrian president getting slobber jobbers in the oval office, 600,000 more Chinese university students, H1B visa trendline at an exponential curve, rehiring all with back pay worthless government employees to steal more taxes, bullshit deportation rates that put my children in higher danger of rape & honor killings, free healthcare to Ukraine & Israel, .. it's all a fucking a show man and we're just the same useful puppets to pillage. permalink parent award report block reply KernalMustard 3 points 3 hours ago I had faith. Its now on us. Prepare yourselves for the shitstorm permalink parent award report block reply\nKernalMustard 3 points 3 hours ago I had faith. Its now on us. Prepare yourselves for the shitstorm permalink parent award report block reply\nMr_Rightside OP 10 points 5 hours ago https://x.com/SecDuffy/status/1988626102722474277 permalink award report block reply\nMeddlesom 8 points 3 hours ago He's doing things in the wrong order. Pull the funding first, and tell them you'll only restore it once they comply... ...then once they comply, spend that money on deportations. permalink award report block reply Drekken- 1 points 45 minutes ago 160 million? Oh no! How will California survive? ARREST SOMEONE. ANYONE! DAMMIT permalink parent award report block reply\nDrekken- 1 points 45 minutes ago 160 million? Oh no! How will California survive? ARREST SOMEONE. ANYONE! DAMMIT permalink parent award report block reply\nThisIsMethBeth 6 points 4 hours ago Anyone else find it hilarious that Newsom is obviously copying Trump’s tweeting style these days?? Using petty nicknames in this tweet, saw previous tweets where he used all caps in classic Trump style. It’s so transparent it’s hilarious. “Trump’s style must have worked because he’s President, so let’s just copy it.” Lollll permalink award report block reply\nAquamine-Amarine 6 points 4 hours ago Those are really stupid nicknames. permalink award report block reply Parhelion12 5 points 4 hours ago The left can't meme. permalink parent award report block reply\nParhelion12 5 points 4 hours ago The left can't meme. permalink parent award report block reply\nClassygasoline 5 points 4 hours ago Does the state of California get punished at all for issuing those licenses? Do the families that lost loved ones to those \"licensed\" truckers get to sue California? Something needs to be done or this shit will continue until the country is gone permalink award report block reply\nJBlaze056 5 points 4 hours ago How about punish them for their behavior right now and not after they do something else. permalink award report block reply\nReleasetheList 4 points 3 hours ago How about some prison time for those responsible? Oh, I know that's way to much to ask. permalink award report block reply\nFormerlurker92 3 points 3 hours ago Just pull it. You're gonna need time to fight the district court judges permalink award report block reply\nKlaus73 2 points 2 hours ago Sounds like a breakdown between States. permalink award report block reply\nitspancakees 2 points 2 hours ago Just pull the funding now, why wait?! permalink award report block reply\nSavingPrivateGrace 2 points 4 hours ago The commies sure had a good time problem solving what to do with their new imported voters driving their elections. permalink award report block reply\nthisisatestof2 2 points 4 hours ago Can we just revoke their federal funding anyway? permalink award report block reply\nNoMoreShinesBilly 2 points 3 hours ago pull the funding first.  agree to reinstate later once the illegality is \"resolved.\" permalink award report block reply\nActNow 2 points 4 hours ago 17K!?! I thought the roads were getting crazy. Thank you, Secretary Duffy. permalink award report block reply\nschiff_for_brains 2 points 4 hours ago The damage has already been done.  There are official plastic cards saying No Name Given is qualified to drive massive trucks on the road. permalink award report block reply\nscrubking 2 points 3 hours ago Another day, another empty Republican threat. permalink award report block reply\nTruth_Cipher 1 points 3 hours ago Just pull all funding and let things sort themselves out. Remove sanctuary states ability to issue CDLs and really anything past an ID card. That will force policy change. permalink award report block reply\n67Vert 1 points 3 hours ago $160M doesn’t seem like much in this context. permalink award report block reply\ncontender 1 points 2 hours ago and 17,000 new voters the DMV test terminal registers you to vote permalink award report block reply\nMorokei 1 points 4 hours ago At least Duffy has a concrete plan to actually do something. Instead of sending a memo to Congress like Blondie. permalink award report block reply\ngaijin_ronin 1 points 2 hours ago Lawsuits probably already filed against this. permalink award report block reply\nmidgetpornrocks 1 points 1 hour ago Why can't we have both? permalink award report block reply\nStormeyworld13 1 points 19 minutes ago Why can't we just arrest Gavin Newscum?! Really. Remove him from office. He stole his election. We recalled that evil bastard and he cheated to stay. Send him off to GITMO now! permalink award report block reply\nNoWorries77 1 points 53 minutes ago Enough talk. Pull the doggon money. permalink award report block reply\nlifeisahologram 1 points 1 hour ago How about we start DOING things first, as a consequence for what they already did, then they will have incentive to stop and comply so we stop? permalink award report block reply\nGoatboy66 1 points 3 hours ago Non-Citizens can be here Legally. It doesn't Mean Illegal Aliens. permalink award report block reply Michalusmichalus 1 points 2 hours ago It's a word game. Resident aliens would have been called just that. permalink parent award report block reply\nMichalusmichalus 1 points 2 hours ago It's a word game. Resident aliens would have been called just that. permalink parent award report block reply\nPhantomShield72 1 points 3 hours ago Social Media Posts and nothing more. Awesome. permalink award report block reply\nTookens 1 points 1 hour ago That's nice but $160 million compared to CA's annual budget is nothing. permalink award report block reply\nIPMang 1 points 12 minutes ago Notice how when the government does something illegal, nobody gets sued or goes to jail or has literally anything bad happen? Weird. permalink award report block reply\nCrankyCrab 1 points 4 hours ago 17,000 illegal CDLs issued by Commiefornia!!!  That alone more than justifies pulling the funding! permalink award report block reply\nNonbinaryPotatohead 1 points 3 hours ago Do it and then talk about it for once permalink award report block reply\nYodaBannon 1 points 4 hours ago that’s it! I’m gettin grandma! permalink award report block reply\nslimcoat 1 points 1 hour ago No \"or\". Pull the funds NOW and reinstate them once they cooperate fully. permalink award report block reply\nedxzxz 1 points 2 hours ago Here's a crazy idea - instead of demanding they stop doing illegal shit or else you'll punish them, punish them for doing the illegal shit, and then they'll stop.  Because everyone knows if you actually intended to punish them, they'd already have been punished. permalink award report block reply\niamherefortheluls 0 points 4 hours ago good, keep pressing forward permalink award report block reply"}