{"id": "1ARK9pfsCg", "contents": "21 In one of the newly released emails from Jeffrey Epstein claim that Bill Clinton never visited Epstein Island. posted 6 hours ago by CatalystForChange 11 comments award share report block AF Post @AFpost • 17h Jeffrey Epstein: \"[Bill] Clinton was never on the island.\" Follow: @AFpost\n11 comments Sort by Top Top New Worst Old Save Goozmania 4 points 5 hours ago Wait... \"it wasn't mine, it was stolen by my houseman\"? That doesn't make sense. permalink award report block reply rextexMG 4 points 5 hours ago Now we know Biden and cronies messed with them permalink award report block reply Scumbag-reddit 3 points 4 hours ago No shit!! permalink parent award report block reply Matehmateh 3 points 5 hours ago How do we know this email is authentic? permalink award report block reply Region 4 points 4 hours ago It’s a plaintext screenshot. That would be impossible to doctor. permalink parent award report block reply justinkayz 2 points 6 hours ago He preferred the plane permalink award report block reply Counterwhat 2 points 4 hours ago NBC siding with Epstein now shows you how bad they are at their job. I see a \"are we the baddies\" meme on there future permalink award report block reply 202_ 2 points 5 hours ago Because he would never tell a lie in an email permalink award report block reply TrancePhreak 1 points 10 minutes ago I wouldn't trust anything Ali Abdul-Razaq Akbar's AF Post says. Make sure to check a real source. https://archive.ph/cI4lp https://twitchy.com/samj/2025/08/12/nick-fuentes-tinfoil-moment-or-is-it-january-6-n2417159 https://www.chrisbrunet.com/p/top-50-nick-fuentes-pedophile-scandals https://archive.ph/tSif0 https://archive.ph/VeVs9 https://www.youtube.com/watch?v=M83pQwUgYNk https://xcancel.com/SarahisCensored/status/1863598014088008151?s=20 permalink award report block reply Zennbrown 1 points 4 hours ago https://anncoulter.substack.com/p/michael-wolff-to-epstein-be-anti?r=1ehke&triedRedirect=true permalink award report block reply CatalystForChange OP 0 points 6 hours ago NBC News article: Jeffrey Epstein emails: Donald Trump, Bill Clinton, Prince Andrew and more ( https://www.nbcnews.com/politics/donald-trump/epstein-emails-trump-bill-clinton-prince-andrew-what-documents-say-rcna243526 ) permalink award report block reply\nGoozmania 4 points 5 hours ago Wait... \"it wasn't mine, it was stolen by my houseman\"? That doesn't make sense. permalink award report block reply\nrextexMG 4 points 5 hours ago Now we know Biden and cronies messed with them permalink award report block reply Scumbag-reddit 3 points 4 hours ago No shit!! permalink parent award report block reply\nScumbag-reddit 3 points 4 hours ago No shit!! permalink parent award report block reply\nMatehmateh 3 points 5 hours ago How do we know this email is authentic? permalink award report block reply Region 4 points 4 hours ago It’s a plaintext screenshot. That would be impossible to doctor. permalink parent award report block reply\nRegion 4 points 4 hours ago It’s a plaintext screenshot. That would be impossible to doctor. permalink parent award report block reply\njustinkayz 2 points 6 hours ago He preferred the plane permalink award report block reply\nCounterwhat 2 points 4 hours ago NBC siding with Epstein now shows you how bad they are at their job. I see a \"are we the baddies\" meme on there future permalink award report block reply\n202_ 2 points 5 hours ago Because he would never tell a lie in an email permalink award report block reply\nTrancePhreak 1 points 10 minutes ago I wouldn't trust anything Ali Abdul-Razaq Akbar's AF Post says. Make sure to check a real source. https://archive.ph/cI4lp https://twitchy.com/samj/2025/08/12/nick-fuentes-tinfoil-moment-or-is-it-january-6-n2417159 https://www.chrisbrunet.com/p/top-50-nick-fuentes-pedophile-scandals https://archive.ph/tSif0 https://archive.ph/VeVs9 https://www.youtube.com/watch?v=M83pQwUgYNk https://xcancel.com/SarahisCensored/status/1863598014088008151?s=20 permalink award report block reply\nZennbrown 1 points 4 hours ago https://anncoulter.substack.com/p/michael-wolff-to-epstein-be-anti?r=1ehke&triedRedirect=true permalink award report block reply\nCatalystForChange OP 0 points 6 hours ago NBC News article: Jeffrey Epstein emails: Donald Trump, Bill Clinton, Prince Andrew and more ( https://www.nbcnews.com/politics/donald-trump/epstein-emails-trump-bill-clinton-prince-andrew-what-documents-say-rcna243526 ) permalink award report block reply"}