{"id": "1ARK9nOG15", "contents": "35 Florida Chemtrails Started Again- Near Naples/ Fort Myers FL posted 9 hours ago by TheDudeWillNotAbide 10 comments award share report block Just FYI: I reported it today with a photo to the Florida DEP (Dept. Environmental  Protection) and they responded immediately. See response below: The Florida Department of Environmental Protection has received your email.  Weather Modification reporting can be submitted in the following ways. Report:\nreportfloridaskies.org\nreportfloridaskies.com Email: ReportFloridaSkies@FloridaDEP.gov Hotline:\n888-750-4195 We appreciate your assistance in helping protect Florida’s skies. Respectfully, Office of Public Services\nFlorida Department of Environmental Protection\n3900 Commonwealth Blvd., MS-49\nTallahassee, FL 32399 Public.services@floridadep.gov 850-245-2118\n10 comments Sort by Top Top New Worst Old Save Around the Web Hair Will Grow Back! No Matter How Severe The Baldness HaloGrow Apersonofinterest 5 points 9 hours ago Happening here in LA too. Yesterday they covered the sky with lines that then spread out and turned into haze by the afternoon. MuH cOnTrAiLs don't do that. permalink award report block reply redditadminssuckit 3 points 9 hours ago The fucking admit putting chemicals in the air for \"cloud seeding\" permalink award report block reply Katrionna 3 points 9 hours ago Thanks for the info, it's good to have. permalink award report block reply GA_Logic 2 points 9 hours ago How did you identify it was a chem trail?  Did the smoke cloud persist? Usually if it is a plane passing through moisture it would dissipate rather quickly but if it was a chem trail it would linger. Is that what you saw? permalink award report block reply TheDudeWillNotAbide OP 5 points 9 hours ago It lingered and the sky is now hazy, sun blocked, I will upload a photo permalink parent award report block reply SpaceWizard 3 points 9 hours ago When they fly a grid and you can see them making sharp right turns to fly back and forth again with 50+ chem trails in the sky how do you explain that. Those ARE NOT COMMERCIAL AIR LINERS. they do that shit where we live too. permalink parent award report block reply GA_Logic 2 points 8 hours ago That is suspicious because that isn't survey work being done. permalink parent award report block reply SpaceWizard 2 points 8 hours ago I have pictures of them doing it, sharp right turns and coming back in a grid. Fucked up. The pilots are evil pieces of shit permalink parent award report block reply Username_here 2 points 8 hours ago Don't ruin their conspiracy fantasy. I makes them feel they have a purpose. permalink parent award report block reply Username_here 2 points 8 hours ago God damn you people are fucking morons. Just one look at flight tracker and you can clearly see they are passenger planes. For all you idiots, here is a link to educate yourselves https://en.wikipedia.org/wiki/Contrail permalink award report block reply ganachain 1 points 8 hours ago What are they going to do about it?  Do they even know who is doing it?  Do they have anti-aircraft batteries that they just shoot the planes down with? permalink award report block reply\nApersonofinterest 5 points 9 hours ago Happening here in LA too. Yesterday they covered the sky with lines that then spread out and turned into haze by the afternoon. MuH cOnTrAiLs don't do that. permalink award report block reply\nredditadminssuckit 3 points 9 hours ago The fucking admit putting chemicals in the air for \"cloud seeding\" permalink award report block reply\nKatrionna 3 points 9 hours ago Thanks for the info, it's good to have. permalink award report block reply\nGA_Logic 2 points 9 hours ago How did you identify it was a chem trail?  Did the smoke cloud persist? Usually if it is a plane passing through moisture it would dissipate rather quickly but if it was a chem trail it would linger. Is that what you saw? permalink award report block reply TheDudeWillNotAbide OP 5 points 9 hours ago It lingered and the sky is now hazy, sun blocked, I will upload a photo permalink parent award report block reply SpaceWizard 3 points 9 hours ago When they fly a grid and you can see them making sharp right turns to fly back and forth again with 50+ chem trails in the sky how do you explain that. Those ARE NOT COMMERCIAL AIR LINERS. they do that shit where we live too. permalink parent award report block reply GA_Logic 2 points 8 hours ago That is suspicious because that isn't survey work being done. permalink parent award report block reply SpaceWizard 2 points 8 hours ago I have pictures of them doing it, sharp right turns and coming back in a grid. Fucked up. The pilots are evil pieces of shit permalink parent award report block reply Username_here 2 points 8 hours ago Don't ruin their conspiracy fantasy. I makes them feel they have a purpose. permalink parent award report block reply\nTheDudeWillNotAbide OP 5 points 9 hours ago It lingered and the sky is now hazy, sun blocked, I will upload a photo permalink parent award report block reply\nSpaceWizard 3 points 9 hours ago When they fly a grid and you can see them making sharp right turns to fly back and forth again with 50+ chem trails in the sky how do you explain that. Those ARE NOT COMMERCIAL AIR LINERS. they do that shit where we live too. permalink parent award report block reply GA_Logic 2 points 8 hours ago That is suspicious because that isn't survey work being done. permalink parent award report block reply SpaceWizard 2 points 8 hours ago I have pictures of them doing it, sharp right turns and coming back in a grid. Fucked up. The pilots are evil pieces of shit permalink parent award report block reply\nGA_Logic 2 points 8 hours ago That is suspicious because that isn't survey work being done. permalink parent award report block reply SpaceWizard 2 points 8 hours ago I have pictures of them doing it, sharp right turns and coming back in a grid. Fucked up. The pilots are evil pieces of shit permalink parent award report block reply\nSpaceWizard 2 points 8 hours ago I have pictures of them doing it, sharp right turns and coming back in a grid. Fucked up. The pilots are evil pieces of shit permalink parent award report block reply\nUsername_here 2 points 8 hours ago Don't ruin their conspiracy fantasy. I makes them feel they have a purpose. permalink parent award report block reply\nUsername_here 2 points 8 hours ago God damn you people are fucking morons. Just one look at flight tracker and you can clearly see they are passenger planes. For all you idiots, here is a link to educate yourselves https://en.wikipedia.org/wiki/Contrail permalink award report block reply\nganachain 1 points 8 hours ago What are they going to do about it?  Do they even know who is doing it?  Do they have anti-aircraft batteries that they just shoot the planes down with? permalink award report block reply"}