{"id": "1ARK9iq7ls", "contents": "407 We will take Europe back from the unelected bureaucrats seeking to destroy it. \nMrs. Von der Leyen, we won't forget what you've done! posted 2 days ago by Capoditutticapi1 14 comments award share report block Eva Vlaardingerbroek @EvaVlaar • 2d We will take Europe back from the unelected bureaucrats seeking to destroy it. Mrs. von der Leyen, we won't forget what you've done.\n14 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget greatpumpkin 14 points 2 days ago Stop calling them 'immigrants'.  They're illegal aliens. Do not let the enemy define the parameters of the narrative. permalink award report block reply TwoArizonaPedes 8 points 2 days ago Invaders. An invading army. permalink parent award report block reply The_Bloofy_Bullshark 3 points 2 days ago By all accounts I’d say they are subhuman parasitic invaders. Most of them are completely physically and mentally incapable of maintaining any sort of modern civilization. permalink parent award report block reply FORMERCHILDSTAR 14 points 2 days ago God bless her. They're going to need to use their air forces if they want Europe to change direction. Europe isn't voting their way out of this mess. And the USA isn't far behind. permalink award report block reply Choppermagic 8 points 2 days ago she just got hotter and hotter permalink award report block reply GarbageLivesMatter 4 points 2 days ago What a stunning woman. permalink parent award report block reply Capoditutticapi1 OP 4 points 2 days ago No doubt hotter and hotter in the future as well... permalink parent award report block reply snoopy3210 2 points 2 days ago 15 % tariffs exemption on that one! permalink parent award report block reply rebuildingMyself 5 points 2 days ago Based shield maiden permalink award report block reply TrustYourself 4 points 2 days ago I'm gonna have a boner for a year after watching this.  thanks... permalink award report block reply Capoditutticapi1 OP 2 points 2 days ago I hear ya..., you're welcome... permalink parent award report block reply 2016TrumpMAGA 4 points 2 days ago The world needs hangings.  Lots of them. permalink award report block reply frenacrossthepond 3 points 2 days ago I'm just happy she wasn't flickin' her hair around. LOL. permalink award report block reply Roguepepe 2 points 2 days ago I love that woman. Her husband is beyond blessed. permalink award report block reply\ngreatpumpkin 14 points 2 days ago Stop calling them 'immigrants'.  They're illegal aliens. Do not let the enemy define the parameters of the narrative. permalink award report block reply TwoArizonaPedes 8 points 2 days ago Invaders. An invading army. permalink parent award report block reply The_Bloofy_Bullshark 3 points 2 days ago By all accounts I’d say they are subhuman parasitic invaders. Most of them are completely physically and mentally incapable of maintaining any sort of modern civilization. permalink parent award report block reply\nTwoArizonaPedes 8 points 2 days ago Invaders. An invading army. permalink parent award report block reply\nThe_Bloofy_Bullshark 3 points 2 days ago By all accounts I’d say they are subhuman parasitic invaders. Most of them are completely physically and mentally incapable of maintaining any sort of modern civilization. permalink parent award report block reply\nFORMERCHILDSTAR 14 points 2 days ago God bless her. They're going to need to use their air forces if they want Europe to change direction. Europe isn't voting their way out of this mess. And the USA isn't far behind. permalink award report block reply\nChoppermagic 8 points 2 days ago she just got hotter and hotter permalink award report block reply GarbageLivesMatter 4 points 2 days ago What a stunning woman. permalink parent award report block reply Capoditutticapi1 OP 4 points 2 days ago No doubt hotter and hotter in the future as well... permalink parent award report block reply snoopy3210 2 points 2 days ago 15 % tariffs exemption on that one! permalink parent award report block reply\nGarbageLivesMatter 4 points 2 days ago What a stunning woman. permalink parent award report block reply\nCapoditutticapi1 OP 4 points 2 days ago No doubt hotter and hotter in the future as well... permalink parent award report block reply\nsnoopy3210 2 points 2 days ago 15 % tariffs exemption on that one! permalink parent award report block reply\nrebuildingMyself 5 points 2 days ago Based shield maiden permalink award report block reply\nTrustYourself 4 points 2 days ago I'm gonna have a boner for a year after watching this.  thanks... permalink award report block reply Capoditutticapi1 OP 2 points 2 days ago I hear ya..., you're welcome... permalink parent award report block reply\nCapoditutticapi1 OP 2 points 2 days ago I hear ya..., you're welcome... permalink parent award report block reply\n2016TrumpMAGA 4 points 2 days ago The world needs hangings.  Lots of them. permalink award report block reply\nfrenacrossthepond 3 points 2 days ago I'm just happy she wasn't flickin' her hair around. LOL. permalink award report block reply\nRoguepepe 2 points 2 days ago I love that woman. Her husband is beyond blessed. permalink award report block reply"}