{"id": "1ARK0UbLuS", "contents": "671 Perfectly said... posted 7 days ago by KuzoKevin 8 comments award share report block Tim Young @TimRunsHisMouth • 7d Perfectly said.\n8 comments Sort by Top Top New Worst Old Save Donmartin 12 points 7 days ago Hope that he has hoarded enough ammo. His actual core skills will be needed when the time comes. permalink award report block reply PatriotSkorzeny 7 points 7 days ago How else will the illegal aliens get to their middle of no where airports? permalink award report block reply f_bastiat 3 points 7 days ago That may be the first time he has made a statement without reminding us that he killed bin laden. permalink award report block reply bagel_fragility 2 points 6 days ago yes because the white demoralization agenda is still a top priority. permalink award report block reply 1_Badcop 2 points 7 days ago Yup. permalink award report block reply Frenchie619 1 points 6 days ago That's a great question... permalink award report block reply Tacoboutit 1 points 6 days ago It's them that need the extra mouthwash because of all the shit coming out of their mouths. permalink award report block reply\nDonmartin 12 points 7 days ago Hope that he has hoarded enough ammo. His actual core skills will be needed when the time comes. permalink award report block reply\nPatriotSkorzeny 7 points 7 days ago How else will the illegal aliens get to their middle of no where airports? permalink award report block reply\nf_bastiat 3 points 7 days ago That may be the first time he has made a statement without reminding us that he killed bin laden. permalink award report block reply\nbagel_fragility 2 points 6 days ago yes because the white demoralization agenda is still a top priority. permalink award report block reply\n1_Badcop 2 points 7 days ago Yup. permalink award report block reply\nFrenchie619 1 points 6 days ago That's a great question... permalink award report block reply\nTacoboutit 1 points 6 days ago It's them that need the extra mouthwash because of all the shit coming out of their mouths. permalink award report block reply"}