{"id": "1ARK9pf2n7", "contents": "364 DHS has CONFIRMED the U.S. will have net NEGATIVE migration for the first time in 50 years. posted 11 hours ago by CatalystForChange 22 comments award share report block Eric Daugherty @EricLDaugh • 12h 🚨GREAT NEWS: DHS has CONFIRMED the U.S. will have net NEGATIVE migration for the first time in 50 years. Just what I voted for. \"The foreign-born population has declined by 2.2 million this year, which includes the 1.6 million illegal aliens who have voluntarily self-deported\n22 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style MedicallyReddit 25 points 11 hours ago Still need to deport 50 million illegals permalink award report block reply patrioticwinning3 10 points 10 hours ago And end the MASS influx of \"legal\" immigration taking away American jobs, educational opportunities, and home buying chances! permalink parent award report block reply Shitsbrokeyo 4 points 3 hours ago All this graph tells me is deportations are slow as fuck. permalink parent award report block reply MagaJay02 0 points 11 hours ago Yeah, we know. Getting a bit annoyed at the constant \"okay but\" bullshit. Hasn't been 1 year and we're making better progress than any admin has... maybe ever? permalink parent award report block reply ThisTrainHasNoBrakes 9 points 11 hours ago Still need to deport 50 million illegals Getting a bit annoyed at faggots who forget this. permalink parent award report block reply PROCIsAsshoe 5 points 10 hours ago the point is that the constant \"not good enough\" is looking more like demoralization talk than anything else. \"undersell any success\" is a known propagandist tactic. Pointing out that you'd like to deport 50mm when you're ten months into an endeavor feels that way. People were jerking off at the ~1mm deportees in a year from Operation Wetback as a precedent before the '24 election, we're doing way better than that and at this rate will be over 10mm in the four year term. That is far more of a success than I could've imagined and who knows? Might end up even higher with ACA healthcare subsidies for illegals going away in addition to all of the other screws that the administration is tightening to drive self-deports. permalink parent award report block reply ThisTrainHasNoBrakes 1 points 58 minutes ago It’s simple as hell. Punish businesses hiring them. Take away free gibs Stop importing H1Bs and saying it’s there MAGA Not hard.  I love Trump but he is a proud man.  The online bitching DOES work when he has a shit take. permalink parent award report block reply MagaJay02 1 points 11 hours ago Duh. Nobody here forgot that. We all want more deportations. But the constant negativity will just ensure we all lose in the future. Put people in depressive moods and they will bow out of the fight. Trust me, I've seen it happen a ton over the years. Pushing doom and gloom will be our demise, so hopefully more people push energizing positivity permalink parent award report block reply PROCIsAsshoe 3 points 10 hours ago I concur but the difference is that I don't believe that spirit is coming from people that are genuinely with us. they're interlopers on this site trying to achieve what you've so articulated so well. permalink parent award report block reply PedePete 13 points 11 hours ago Great.. Too bad this 'negative migration' is completely negated by the new and improved H1B/Visa scam! permalink award report block reply GayPatriotMAGAUncle -4 points 11 hours ago Fake news faggot! The few H-1B's are so miniscule you won't even notice they're here. permalink parent award report block reply GodIsPerfect 10 points 11 hours ago That number of illegals needs to be ZERO TODAY! Let’s go! There’s NO REASON TO WAIT! So many problems automatically get fixed when this happens. LET’S GO!!!! permalink award report block reply Crucible 9 points 11 hours ago \"Just what I voted for\" You work for the White House, asshole. There have been no mass deportations. That's what I voted for. permalink award report block reply LordCommissarYarrick 1 points 10 hours ago They'll be deportations, but then they'll just import more legally. permalink parent award report block reply punishedvin 8 points 11 hours ago The stuff the admin does about immigration is more important than what Trump says about immigration. permalink award report block reply Paralax 3 points 3 hours ago Let’s get those numbers up! permalink award report block reply RoughBoy 2 points 9 hours ago Now remove H1B. permalink award report block reply AlmostFullyDilated 2 points 7 hours ago calling bullshit! permalink award report block reply M-m-m-my-corona 1 points 10 hours ago We're trading some Mexicans for Indians.  Honestly, I'd rather have the Mexicans. permalink award report block reply MehNahMehNah 1 points 4 minutes ago I keep reading how Zerobama deported THREE MILLION illegals yet only now we are having negative migration? Has the data been presented wrong? permalink award report block reply Undying -2 points 11 hours ago Oh no! We are a country of immigrants though!!! permalink award report block reply\nMedicallyReddit 25 points 11 hours ago Still need to deport 50 million illegals permalink award report block reply patrioticwinning3 10 points 10 hours ago And end the MASS influx of \"legal\" immigration taking away American jobs, educational opportunities, and home buying chances! permalink parent award report block reply Shitsbrokeyo 4 points 3 hours ago All this graph tells me is deportations are slow as fuck. permalink parent award report block reply MagaJay02 0 points 11 hours ago Yeah, we know. Getting a bit annoyed at the constant \"okay but\" bullshit. Hasn't been 1 year and we're making better progress than any admin has... maybe ever? permalink parent award report block reply ThisTrainHasNoBrakes 9 points 11 hours ago Still need to deport 50 million illegals Getting a bit annoyed at faggots who forget this. permalink parent award report block reply PROCIsAsshoe 5 points 10 hours ago the point is that the constant \"not good enough\" is looking more like demoralization talk than anything else. \"undersell any success\" is a known propagandist tactic. Pointing out that you'd like to deport 50mm when you're ten months into an endeavor feels that way. People were jerking off at the ~1mm deportees in a year from Operation Wetback as a precedent before the '24 election, we're doing way better than that and at this rate will be over 10mm in the four year term. That is far more of a success than I could've imagined and who knows? Might end up even higher with ACA healthcare subsidies for illegals going away in addition to all of the other screws that the administration is tightening to drive self-deports. permalink parent award report block reply ThisTrainHasNoBrakes 1 points 58 minutes ago It’s simple as hell. Punish businesses hiring them. Take away free gibs Stop importing H1Bs and saying it’s there MAGA Not hard.  I love Trump but he is a proud man.  The online bitching DOES work when he has a shit take. permalink parent award report block reply MagaJay02 1 points 11 hours ago Duh. Nobody here forgot that. We all want more deportations. But the constant negativity will just ensure we all lose in the future. Put people in depressive moods and they will bow out of the fight. Trust me, I've seen it happen a ton over the years. Pushing doom and gloom will be our demise, so hopefully more people push energizing positivity permalink parent award report block reply PROCIsAsshoe 3 points 10 hours ago I concur but the difference is that I don't believe that spirit is coming from people that are genuinely with us. they're interlopers on this site trying to achieve what you've so articulated so well. permalink parent award report block reply\npatrioticwinning3 10 points 10 hours ago And end the MASS influx of \"legal\" immigration taking away American jobs, educational opportunities, and home buying chances! permalink parent award report block reply\nShitsbrokeyo 4 points 3 hours ago All this graph tells me is deportations are slow as fuck. permalink parent award report block reply\nMagaJay02 0 points 11 hours ago Yeah, we know. Getting a bit annoyed at the constant \"okay but\" bullshit. Hasn't been 1 year and we're making better progress than any admin has... maybe ever? permalink parent award report block reply ThisTrainHasNoBrakes 9 points 11 hours ago Still need to deport 50 million illegals Getting a bit annoyed at faggots who forget this. permalink parent award report block reply PROCIsAsshoe 5 points 10 hours ago the point is that the constant \"not good enough\" is looking more like demoralization talk than anything else. \"undersell any success\" is a known propagandist tactic. Pointing out that you'd like to deport 50mm when you're ten months into an endeavor feels that way. People were jerking off at the ~1mm deportees in a year from Operation Wetback as a precedent before the '24 election, we're doing way better than that and at this rate will be over 10mm in the four year term. That is far more of a success than I could've imagined and who knows? Might end up even higher with ACA healthcare subsidies for illegals going away in addition to all of the other screws that the administration is tightening to drive self-deports. permalink parent award report block reply ThisTrainHasNoBrakes 1 points 58 minutes ago It’s simple as hell. Punish businesses hiring them. Take away free gibs Stop importing H1Bs and saying it’s there MAGA Not hard.  I love Trump but he is a proud man.  The online bitching DOES work when he has a shit take. permalink parent award report block reply MagaJay02 1 points 11 hours ago Duh. Nobody here forgot that. We all want more deportations. But the constant negativity will just ensure we all lose in the future. Put people in depressive moods and they will bow out of the fight. Trust me, I've seen it happen a ton over the years. Pushing doom and gloom will be our demise, so hopefully more people push energizing positivity permalink parent award report block reply PROCIsAsshoe 3 points 10 hours ago I concur but the difference is that I don't believe that spirit is coming from people that are genuinely with us. they're interlopers on this site trying to achieve what you've so articulated so well. permalink parent award report block reply\nThisTrainHasNoBrakes 9 points 11 hours ago Still need to deport 50 million illegals Getting a bit annoyed at faggots who forget this. permalink parent award report block reply PROCIsAsshoe 5 points 10 hours ago the point is that the constant \"not good enough\" is looking more like demoralization talk than anything else. \"undersell any success\" is a known propagandist tactic. Pointing out that you'd like to deport 50mm when you're ten months into an endeavor feels that way. People were jerking off at the ~1mm deportees in a year from Operation Wetback as a precedent before the '24 election, we're doing way better than that and at this rate will be over 10mm in the four year term. That is far more of a success than I could've imagined and who knows? Might end up even higher with ACA healthcare subsidies for illegals going away in addition to all of the other screws that the administration is tightening to drive self-deports. permalink parent award report block reply ThisTrainHasNoBrakes 1 points 58 minutes ago It’s simple as hell. Punish businesses hiring them. Take away free gibs Stop importing H1Bs and saying it’s there MAGA Not hard.  I love Trump but he is a proud man.  The online bitching DOES work when he has a shit take. permalink parent award report block reply MagaJay02 1 points 11 hours ago Duh. Nobody here forgot that. We all want more deportations. But the constant negativity will just ensure we all lose in the future. Put people in depressive moods and they will bow out of the fight. Trust me, I've seen it happen a ton over the years. Pushing doom and gloom will be our demise, so hopefully more people push energizing positivity permalink parent award report block reply PROCIsAsshoe 3 points 10 hours ago I concur but the difference is that I don't believe that spirit is coming from people that are genuinely with us. they're interlopers on this site trying to achieve what you've so articulated so well. permalink parent award report block reply\nPROCIsAsshoe 5 points 10 hours ago the point is that the constant \"not good enough\" is looking more like demoralization talk than anything else. \"undersell any success\" is a known propagandist tactic. Pointing out that you'd like to deport 50mm when you're ten months into an endeavor feels that way. People were jerking off at the ~1mm deportees in a year from Operation Wetback as a precedent before the '24 election, we're doing way better than that and at this rate will be over 10mm in the four year term. That is far more of a success than I could've imagined and who knows? Might end up even higher with ACA healthcare subsidies for illegals going away in addition to all of the other screws that the administration is tightening to drive self-deports. permalink parent award report block reply ThisTrainHasNoBrakes 1 points 58 minutes ago It’s simple as hell. Punish businesses hiring them. Take away free gibs Stop importing H1Bs and saying it’s there MAGA Not hard.  I love Trump but he is a proud man.  The online bitching DOES work when he has a shit take. permalink parent award report block reply\nThisTrainHasNoBrakes 1 points 58 minutes ago It’s simple as hell. Punish businesses hiring them. Take away free gibs Stop importing H1Bs and saying it’s there MAGA Not hard.  I love Trump but he is a proud man.  The online bitching DOES work when he has a shit take. permalink parent award report block reply\nMagaJay02 1 points 11 hours ago Duh. Nobody here forgot that. We all want more deportations. But the constant negativity will just ensure we all lose in the future. Put people in depressive moods and they will bow out of the fight. Trust me, I've seen it happen a ton over the years. Pushing doom and gloom will be our demise, so hopefully more people push energizing positivity permalink parent award report block reply PROCIsAsshoe 3 points 10 hours ago I concur but the difference is that I don't believe that spirit is coming from people that are genuinely with us. they're interlopers on this site trying to achieve what you've so articulated so well. permalink parent award report block reply\nPROCIsAsshoe 3 points 10 hours ago I concur but the difference is that I don't believe that spirit is coming from people that are genuinely with us. they're interlopers on this site trying to achieve what you've so articulated so well. permalink parent award report block reply\nPedePete 13 points 11 hours ago Great.. Too bad this 'negative migration' is completely negated by the new and improved H1B/Visa scam! permalink award report block reply GayPatriotMAGAUncle -4 points 11 hours ago Fake news faggot! The few H-1B's are so miniscule you won't even notice they're here. permalink parent award report block reply\nGayPatriotMAGAUncle -4 points 11 hours ago Fake news faggot! The few H-1B's are so miniscule you won't even notice they're here. permalink parent award report block reply\nGodIsPerfect 10 points 11 hours ago That number of illegals needs to be ZERO TODAY! Let’s go! There’s NO REASON TO WAIT! So many problems automatically get fixed when this happens. LET’S GO!!!! permalink award report block reply\nCrucible 9 points 11 hours ago \"Just what I voted for\" You work for the White House, asshole. There have been no mass deportations. That's what I voted for. permalink award report block reply LordCommissarYarrick 1 points 10 hours ago They'll be deportations, but then they'll just import more legally. permalink parent award report block reply\nLordCommissarYarrick 1 points 10 hours ago They'll be deportations, but then they'll just import more legally. permalink parent award report block reply\npunishedvin 8 points 11 hours ago The stuff the admin does about immigration is more important than what Trump says about immigration. permalink award report block reply\nParalax 3 points 3 hours ago Let’s get those numbers up! permalink award report block reply\nRoughBoy 2 points 9 hours ago Now remove H1B. permalink award report block reply\nAlmostFullyDilated 2 points 7 hours ago calling bullshit! permalink award report block reply\nM-m-m-my-corona 1 points 10 hours ago We're trading some Mexicans for Indians.  Honestly, I'd rather have the Mexicans. permalink award report block reply\nMehNahMehNah 1 points 4 minutes ago I keep reading how Zerobama deported THREE MILLION illegals yet only now we are having negative migration? Has the data been presented wrong? permalink award report block reply\nUndying -2 points 11 hours ago Oh no! We are a country of immigrants though!!! permalink award report block reply"}