{"id": "1ARK57smJu", "contents": "861 ‘10% for the Big Guy’: Biden accuses Trump family of profiting off White House (www.bizpacreview.com) posted 4 days ago by Sea_Still 55 comments award share report block ‘10% for the Big Guy’: Biden accuses Trump family of profiting off White House Former President Joe Biden has been largely silent since leaving the White House, and he probably should have kept it that way. Instead, he got on stage […] www.bizpacreview.com\n55 comments Sort by Top Top New Worst Old Save Around the Web From Hair Loss to Hair Boss in A Few Days. Try It! HaloGrow deleted 42 points 4 days ago MasterChief 45 points 4 days ago Not Jill, she's \"Dr. Retarded\" permalink parent award report block reply IvIA6A 7 points 4 days ago \"She's a great retard doctor\" permalink parent award report block reply guywholikesDjtof2024 16 points 4 days ago Democrat projection at all time high! permalink parent award report block reply NC_patriot 4 points 4 days ago Well, they like keeping it in the family, so probably. permalink parent award report block reply Taylor3006 3 points 4 days ago Yes they are. Drug addled, retarded, and senile. But always remember little childrens, the communists always accuse you of what they are guilty of. Never forget that. permalink parent award report block reply South_Florida_Guy 1 points 4 days ago Yes permalink parent award report block reply load 1 more comments... Hanging_Chad 22 points 4 days ago how much did Hunter profit from his artwork? and is he still painting masterpieces? permalink award report block reply ItsUsvstheelite 12 points 4 days ago Totally worth half a MILLION dollars. permalink parent award report block reply mohel 5 points 4 days ago It was only $400,000 permalink parent award report block reply HockeyMom4Trump 1 points 4 days ago Only permalink parent award report block reply mohel 0 points 3 days ago Do we need a sarcasm sign? permalink parent award report block reply PeaceMakerDJT 21 points 4 days ago This is what having no fear of our justice system looks like. He knows nothing will happen to him so he's out in public making these bs speeches. Thanks bondi and kash! permalink award report block reply Hanging_Chad 3 points 4 days ago Congress should at least impeach Biden. they still have time permalink parent award report block reply HankScorpio 10 points 4 days ago Biden hasnt had a clue where he is or whats going on for years now. The video clip is probably AI. permalink award report block reply CovfefeVideo 3 points 4 days ago Artificial Idiot? permalink parent award report block reply anotherthing 3 points 4 days ago Actually Incestuous permalink parent award report block reply Yakhechos 9 points 4 days ago Every leftist accusation is actually a confession. The sooner you understand this, the easier it is to deal with them. permalink award report block reply HeavyMetalPatriot 7 points 4 days ago Satanists MUST tell you the truth, especially in its inversion. It's a bizarre part of their deception rituals, but it works because so few people pay close attention to when our enemies speak. Joey Biden in particular is an amazing truth teller, especially as his dementia progressed. permalink parent award report block reply VirTW 5 points 4 days ago he's begging trump to sue him just so he can be relevant again permalink award report block reply HoganT 5 points 4 days ago If Biden had a crypto venture we’d be on the roof calling it laundering. permalink award report block reply unotrumpcard 1 points 4 days ago Trump launching coins is a good idea, it allows him to take donations without the deep state tracing them and going after patriots. permalink parent award report block reply HoganT 1 points 4 days ago Sounds like art work. permalink parent award report block reply unotrumpcard 1 points 4 days ago Unlike Hunters paintings, Melania coin has value. permalink parent award report block reply HoganT 1 points 4 days ago lol. permalink parent award report block reply TDBabyBite 1 points 4 days ago Well yeah, his son had made millions from his \"artwork\" and literally sold meetings to the white house. Trump tries different avenues all the time, like crypto I guess permalink parent award report block reply BillPigg 4 points 4 days ago Accuse your enemies of what you are actually doing. permalink award report block reply wst4 4 points 4 days ago Never did hear where Biden was donating his salary to while he was there. permalink award report block reply MedicallyReddit 3 points 4 days ago The adrenochrome harvesting fund led by Killary and her spirit cooking accomplice Marina Abramovich permalink parent award report block reply CleanUpPhillyTrump24 3 points 4 days ago He's pretty confused. permalink award report block reply IvIA6A 3 points 4 days ago Even if it were true and they had any evidence, I don't give a fuck after they looked the other way in Ukraine, china, Romania, Hunter and Burisma. permalink award report block reply Scot 3 points 4 days ago Trump is the ONLY one who hasn't. permalink award report block reply IncredibleMrE1 3 points 4 days ago LOL permalink award report block reply mikethemarine 3 points 4 days ago “Has anyone noticed how much the Trump family has made while he’s been president?” he asked the gathered audience. “A reported $1.8 billion. Can you imagine if any other president in American history did that?” DUMB OLD FUCK TELLING LIES AGAIN I SEE, the money increase Trump made was from buying truth social, while he wasn't president and the Democrats MADE him buy to get his name out, The Dems made him make that $1.8 billion and it pisses them off permalink award report block reply Bruno 3 points 4 days ago Trump doesn't need this to enrich himself. All these politicians do however, because none of them have any value outside of lying to the American people for decades. The idea that Trump entered politics to further line his own pockets is so ridiculously inane that I can't be bothered to argue the point. permalink award report block reply BurtMcGirt 2 points 4 days ago The amount of money being President COST President Trump is crazy. If he wanted to profit, he would have just not been president. Biden is a literal retard. permalink award report block reply Seruna_Kanus 2 points 4 days ago Hard words when congress collects a salary while the government is shut down. permalink award report block reply Batting1000 2 points 4 days ago I see this accusation all the time: That President Trump is just enriching himself. HOW exactly??? permalink award report block reply schnazzmizzle 2 points 4 days ago I love the generic cartoon jackass podium..  Perfection. permalink award report block reply South_Florida_Guy 2 points 4 days ago It's always projection permalink award report block reply Braujager 2 points 4 days ago Trump family probably planted cocaine in the White House cloak room too. Related thought, maybe part of the reason the East Wing was converted was that they couldn’t get the smell of Hunter’s meth lab out of the interior. 🤣 permalink award report block reply MedicallyReddit 2 points 4 days ago Look fat permalink award report block reply Bidensmellslikepiss 2 points 4 days ago Every time this idiot speaks, he twists the knife (that is himself) deeper into the DNC. It's blatantly obvious when this retard is projecting. permalink award report block reply Wrexxis780 2 points 4 days ago Projection as usual permalink award report block reply Beelzy 2 points 4 days ago Says the world's biggest grifter. Fuck off Joe. permalink award report block reply WanderingStar 1 points 4 days ago C'mon man! permalink award report block reply CaptainWinston 1 points 4 days ago Fuck Joe Biden. When will his ass cancer win? permalink award report block reply DingleBalls 1 points 4 days ago Trump is literally taking a (forced) $1 salary permalink award report block reply Znut55 1 points 4 days ago The hot mic episode revealed his true colors when he had to be told to \"stay on the stage\" and he looked confused and puzzled and said I have to stay on the stage?? permalink award report block reply terribletwos 1 points 4 days ago Biden didn't accuse anyone of anything except who took his Jello cup he just ate. permalink award report block reply raptormissle 1 points 4 days ago That old piece of shit really should stay in the basement and not be seen. permalink award report block reply Kilroy 1 points 4 days ago Arrest and prosecute this faggot! The entire Federal Government needs to go with him permalink award report block reply KarenLukasik 1 points 4 days ago yes,and incestuous pedos too… permalink award report block reply AlmostFullyDilated 1 points 4 days ago diaper sniffer can't stitch a single sentence together permalink award report block reply HockeyMom4Trump 1 points 4 days ago Just go sit back on the beach Biden. permalink award report block reply\ndeleted 42 points 4 days ago MasterChief 45 points 4 days ago Not Jill, she's \"Dr. Retarded\" permalink parent award report block reply IvIA6A 7 points 4 days ago \"She's a great retard doctor\" permalink parent award report block reply guywholikesDjtof2024 16 points 4 days ago Democrat projection at all time high! permalink parent award report block reply NC_patriot 4 points 4 days ago Well, they like keeping it in the family, so probably. permalink parent award report block reply Taylor3006 3 points 4 days ago Yes they are. Drug addled, retarded, and senile. But always remember little childrens, the communists always accuse you of what they are guilty of. Never forget that. permalink parent award report block reply South_Florida_Guy 1 points 4 days ago Yes permalink parent award report block reply load 1 more comments...\nMasterChief 45 points 4 days ago Not Jill, she's \"Dr. Retarded\" permalink parent award report block reply IvIA6A 7 points 4 days ago \"She's a great retard doctor\" permalink parent award report block reply\nIvIA6A 7 points 4 days ago \"She's a great retard doctor\" permalink parent award report block reply\nguywholikesDjtof2024 16 points 4 days ago Democrat projection at all time high! permalink parent award report block reply\nNC_patriot 4 points 4 days ago Well, they like keeping it in the family, so probably. permalink parent award report block reply\nTaylor3006 3 points 4 days ago Yes they are. Drug addled, retarded, and senile. But always remember little childrens, the communists always accuse you of what they are guilty of. Never forget that. permalink parent award report block reply\nSouth_Florida_Guy 1 points 4 days ago Yes permalink parent award report block reply\nHanging_Chad 22 points 4 days ago how much did Hunter profit from his artwork? and is he still painting masterpieces? permalink award report block reply ItsUsvstheelite 12 points 4 days ago Totally worth half a MILLION dollars. permalink parent award report block reply mohel 5 points 4 days ago It was only $400,000 permalink parent award report block reply HockeyMom4Trump 1 points 4 days ago Only permalink parent award report block reply mohel 0 points 3 days ago Do we need a sarcasm sign? permalink parent award report block reply\nItsUsvstheelite 12 points 4 days ago Totally worth half a MILLION dollars. permalink parent award report block reply mohel 5 points 4 days ago It was only $400,000 permalink parent award report block reply HockeyMom4Trump 1 points 4 days ago Only permalink parent award report block reply mohel 0 points 3 days ago Do we need a sarcasm sign? permalink parent award report block reply\nmohel 5 points 4 days ago It was only $400,000 permalink parent award report block reply HockeyMom4Trump 1 points 4 days ago Only permalink parent award report block reply mohel 0 points 3 days ago Do we need a sarcasm sign? permalink parent award report block reply\nHockeyMom4Trump 1 points 4 days ago Only permalink parent award report block reply mohel 0 points 3 days ago Do we need a sarcasm sign? permalink parent award report block reply\nmohel 0 points 3 days ago Do we need a sarcasm sign? permalink parent award report block reply\nPeaceMakerDJT 21 points 4 days ago This is what having no fear of our justice system looks like. He knows nothing will happen to him so he's out in public making these bs speeches. Thanks bondi and kash! permalink award report block reply Hanging_Chad 3 points 4 days ago Congress should at least impeach Biden. they still have time permalink parent award report block reply\nHanging_Chad 3 points 4 days ago Congress should at least impeach Biden. they still have time permalink parent award report block reply\nHankScorpio 10 points 4 days ago Biden hasnt had a clue where he is or whats going on for years now. The video clip is probably AI. permalink award report block reply CovfefeVideo 3 points 4 days ago Artificial Idiot? permalink parent award report block reply anotherthing 3 points 4 days ago Actually Incestuous permalink parent award report block reply\nCovfefeVideo 3 points 4 days ago Artificial Idiot? permalink parent award report block reply anotherthing 3 points 4 days ago Actually Incestuous permalink parent award report block reply\nanotherthing 3 points 4 days ago Actually Incestuous permalink parent award report block reply\nYakhechos 9 points 4 days ago Every leftist accusation is actually a confession. The sooner you understand this, the easier it is to deal with them. permalink award report block reply HeavyMetalPatriot 7 points 4 days ago Satanists MUST tell you the truth, especially in its inversion. It's a bizarre part of their deception rituals, but it works because so few people pay close attention to when our enemies speak. Joey Biden in particular is an amazing truth teller, especially as his dementia progressed. permalink parent award report block reply\nHeavyMetalPatriot 7 points 4 days ago Satanists MUST tell you the truth, especially in its inversion. It's a bizarre part of their deception rituals, but it works because so few people pay close attention to when our enemies speak. Joey Biden in particular is an amazing truth teller, especially as his dementia progressed. permalink parent award report block reply\nVirTW 5 points 4 days ago he's begging trump to sue him just so he can be relevant again permalink award report block reply\nHoganT 5 points 4 days ago If Biden had a crypto venture we’d be on the roof calling it laundering. permalink award report block reply unotrumpcard 1 points 4 days ago Trump launching coins is a good idea, it allows him to take donations without the deep state tracing them and going after patriots. permalink parent award report block reply HoganT 1 points 4 days ago Sounds like art work. permalink parent award report block reply unotrumpcard 1 points 4 days ago Unlike Hunters paintings, Melania coin has value. permalink parent award report block reply HoganT 1 points 4 days ago lol. permalink parent award report block reply TDBabyBite 1 points 4 days ago Well yeah, his son had made millions from his \"artwork\" and literally sold meetings to the white house. Trump tries different avenues all the time, like crypto I guess permalink parent award report block reply\nunotrumpcard 1 points 4 days ago Trump launching coins is a good idea, it allows him to take donations without the deep state tracing them and going after patriots. permalink parent award report block reply HoganT 1 points 4 days ago Sounds like art work. permalink parent award report block reply unotrumpcard 1 points 4 days ago Unlike Hunters paintings, Melania coin has value. permalink parent award report block reply HoganT 1 points 4 days ago lol. permalink parent award report block reply\nHoganT 1 points 4 days ago Sounds like art work. permalink parent award report block reply unotrumpcard 1 points 4 days ago Unlike Hunters paintings, Melania coin has value. permalink parent award report block reply HoganT 1 points 4 days ago lol. permalink parent award report block reply\nunotrumpcard 1 points 4 days ago Unlike Hunters paintings, Melania coin has value. permalink parent award report block reply HoganT 1 points 4 days ago lol. permalink parent award report block reply\nHoganT 1 points 4 days ago lol. permalink parent award report block reply\nTDBabyBite 1 points 4 days ago Well yeah, his son had made millions from his \"artwork\" and literally sold meetings to the white house. Trump tries different avenues all the time, like crypto I guess permalink parent award report block reply\nBillPigg 4 points 4 days ago Accuse your enemies of what you are actually doing. permalink award report block reply\nwst4 4 points 4 days ago Never did hear where Biden was donating his salary to while he was there. permalink award report block reply MedicallyReddit 3 points 4 days ago The adrenochrome harvesting fund led by Killary and her spirit cooking accomplice Marina Abramovich permalink parent award report block reply\nMedicallyReddit 3 points 4 days ago The adrenochrome harvesting fund led by Killary and her spirit cooking accomplice Marina Abramovich permalink parent award report block reply\nCleanUpPhillyTrump24 3 points 4 days ago He's pretty confused. permalink award report block reply\nIvIA6A 3 points 4 days ago Even if it were true and they had any evidence, I don't give a fuck after they looked the other way in Ukraine, china, Romania, Hunter and Burisma. permalink award report block reply\nScot 3 points 4 days ago Trump is the ONLY one who hasn't. permalink award report block reply\nIncredibleMrE1 3 points 4 days ago LOL permalink award report block reply\nmikethemarine 3 points 4 days ago “Has anyone noticed how much the Trump family has made while he’s been president?” he asked the gathered audience. “A reported $1.8 billion. Can you imagine if any other president in American history did that?” DUMB OLD FUCK TELLING LIES AGAIN I SEE, the money increase Trump made was from buying truth social, while he wasn't president and the Democrats MADE him buy to get his name out, The Dems made him make that $1.8 billion and it pisses them off permalink award report block reply\nBruno 3 points 4 days ago Trump doesn't need this to enrich himself. All these politicians do however, because none of them have any value outside of lying to the American people for decades. The idea that Trump entered politics to further line his own pockets is so ridiculously inane that I can't be bothered to argue the point. permalink award report block reply\nBurtMcGirt 2 points 4 days ago The amount of money being President COST President Trump is crazy. If he wanted to profit, he would have just not been president. Biden is a literal retard. permalink award report block reply\nSeruna_Kanus 2 points 4 days ago Hard words when congress collects a salary while the government is shut down. permalink award report block reply\nBatting1000 2 points 4 days ago I see this accusation all the time: That President Trump is just enriching himself. HOW exactly??? permalink award report block reply\nschnazzmizzle 2 points 4 days ago I love the generic cartoon jackass podium..  Perfection. permalink award report block reply\nSouth_Florida_Guy 2 points 4 days ago It's always projection permalink award report block reply\nBraujager 2 points 4 days ago Trump family probably planted cocaine in the White House cloak room too. Related thought, maybe part of the reason the East Wing was converted was that they couldn’t get the smell of Hunter’s meth lab out of the interior. 🤣 permalink award report block reply\nMedicallyReddit 2 points 4 days ago Look fat permalink award report block reply\nBidensmellslikepiss 2 points 4 days ago Every time this idiot speaks, he twists the knife (that is himself) deeper into the DNC. It's blatantly obvious when this retard is projecting. permalink award report block reply\nWrexxis780 2 points 4 days ago Projection as usual permalink award report block reply\nBeelzy 2 points 4 days ago Says the world's biggest grifter. Fuck off Joe. permalink award report block reply\nWanderingStar 1 points 4 days ago C'mon man! permalink award report block reply\nCaptainWinston 1 points 4 days ago Fuck Joe Biden. When will his ass cancer win? permalink award report block reply\nDingleBalls 1 points 4 days ago Trump is literally taking a (forced) $1 salary permalink award report block reply\nZnut55 1 points 4 days ago The hot mic episode revealed his true colors when he had to be told to \"stay on the stage\" and he looked confused and puzzled and said I have to stay on the stage?? permalink award report block reply\nterribletwos 1 points 4 days ago Biden didn't accuse anyone of anything except who took his Jello cup he just ate. permalink award report block reply\nraptormissle 1 points 4 days ago That old piece of shit really should stay in the basement and not be seen. permalink award report block reply\nKilroy 1 points 4 days ago Arrest and prosecute this faggot! The entire Federal Government needs to go with him permalink award report block reply\nKarenLukasik 1 points 4 days ago yes,and incestuous pedos too… permalink award report block reply\nAlmostFullyDilated 1 points 4 days ago diaper sniffer can't stitch a single sentence together permalink award report block reply\nHockeyMom4Trump 1 points 4 days ago Just go sit back on the beach Biden. permalink award report block reply"}