{"id": "1ARK9mHEXb", "contents": "53 alentina Gomez speaks on the Islamization of Texas\n\nRoughly 30% of Texas’s 8,000 public schools now offer halal meal options, per estimates from the Texas Education Agency and USDA reports\n\n“Texas is about to experience the same fate as in the UK. posted 15 hours ago by PiratePatriotParrot 4 comments award share report block Wall Street Apes @WallStreetApes • 1d Valentina Gomez speaks on the Islamization of Texas Roughly 30% of Texas’s 8,000 public schools now offer halal meal options, per estimates from the Texas Education Agency and USDA reports “Texas is about to experience the same fate as in the UK. The UK is Islamized,\n4 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget jcd_007 3 points 15 hours ago Where did they come from? permalink award report block reply PiratePatriotParrot OP 2 points 15 hours ago Missed the V permalink award report block reply Counterwhat 1 points 13 hours ago We don't have to live like this. We shouldn't have to tolerate and change our ways for them. It should be the other way around. They should assimilate into ours. No country can survive with out assimilation. Push back, speak up and don't be afraid to state this . They came here. permalink award report block reply BKav 1 points 15 hours ago If it does, I’m out. permalink award report block reply\njcd_007 3 points 15 hours ago Where did they come from? permalink award report block reply\nPiratePatriotParrot OP 2 points 15 hours ago Missed the V permalink award report block reply\nCounterwhat 1 points 13 hours ago We don't have to live like this. We shouldn't have to tolerate and change our ways for them. It should be the other way around. They should assimilate into ours. No country can survive with out assimilation. Push back, speak up and don't be afraid to state this . They came here. permalink award report block reply\nBKav 1 points 15 hours ago If it does, I’m out. permalink award report block reply"}