{"id": "1ARK9hipRj", "contents": "784 Trump administration cannot withhold $4 billion for food aid, US appeals court rules (nypost.com) posted 2 days ago by Sea_Still 152 comments award share report block Trump administration cannot withhold $4 billion for food aid, US appeals court rules The ruling by the 1st Circuit will have no immediate impact because on Friday US Supreme Court Justice Ketanji Brown Jackson put a temporary hold on the lower court order by US District Judge John … nypost.com\n152 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style XxxRDTPRNxxX 160 points 2 days ago Just reminding everyone this fight isn't about food stamps or black people. It's about not giving free healthcare to illegals when US Citizens who pay taxes don't even get that. We can debate welfare programs for citizens at another time, but for now the goal needs to be ending the shutdown without giving illegals SHIT. permalink award report block reply Texas_81 54 points 2 days ago Facts. So tired of these games. It’s like this administration boasts about letting 0 in which is positive but doesn’t cut the welfare programs so the rest can leave permalink parent award report block reply bigdickhangsright 25 points 2 days ago That's what they're trying to do. permalink parent award report block reply deleted 3 points 2 days ago TrumpAndSimpsNotMAGA 1 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply Here_we_go 9 points 2 days ago Welfare, business owners and landlords. But we cant do that. permalink parent award report block reply Samuel_L_Bronkowitz 5 points 2 days ago It really is just that simple. permalink parent award report block reply Here_we_go 2 points 2 days ago Its infuriatingly simple. permalink parent award report block reply GatoradeJeb 3 points 2 days ago Trump doesnt ban racemixing either so ot gets worse as White woman are brainwashed by liberals and hollywood to racemix with the brown/black turds. permalink parent award report block reply Unboosted 4 points 2 days ago In less than 20 years we will hear from white women about how having a black child is \"challenging\" and would not recommend.... oh wait permalink parent award report block reply GatoradeJeb 2 points 2 days ago And only when they are worthless damaged goods with mulatto goblins do they then want a White man. Fuckt those race traitors permalink parent award report block reply CentipedeDemon 2 points 2 days ago There will never be a president that does that. permalink parent award report block reply GatoradeJeb 0 points 2 days ago Us is dead then. Its very distrutbing seeing how most young White woman are race traitors permalink parent award report block reply josiborg 14 points 2 days ago It's about insurance companies getting paid their subsides. And that's it. The other talking points are propaganda to manipulate. permalink parent award report block reply LogicalReasoning 6 points 2 days ago Any system that depends on subsidies over time becomes corrupted and inefficient and overall unsustainable. This is just the unfortunate fact, and i can't think of any example otherwise. permalink parent award report block reply onesummerdream 3 points 2 days ago Me thinks all these programs are designed that way. Even though I knew most program funding was used to grow government over time, USAID was a real eye opener. permalink parent award report block reply HoganT 0 points 2 days ago Welp, there goes our entire farming industry. Along with many others. Every single farmer is a government payee. permalink parent award report block reply BidensBodyDouble 1 points 2 days ago Ok? And the govt also pays farmers to decommission their land to combat 'climate change'. When the govt begins central planning of any market everything gets more expensive and goes to shit. If they removed the red tape on farmers it'd likely do more to lower costs than any of the subsidies. \"The top 10% of recipients of federal farm payments raked in more than 79% of total subsidies over the last 25 years \" And certainly looks like those subsidies are abused and not fairly distributed. permalink parent award report block reply Steve56775 6 points 2 days ago Illegals are only entitled to one thing-Deportation! permalink parent award report block reply XxxRDTPRNxxX 3 points 2 days ago Even MAGA people are too pussy to admit the actual solution. Fucking kill them! Why would we let millions of foreigners invade us and then spend thousands on each sending them home in one piece?! Fucking kill them and make a real disincentive. permalink parent award report block reply NotYourMan 1 points 2 days ago ^ THIS permalink parent award report block reply NotYourMan 4 points 2 days ago Giving SHIT away causes inflation.  What is inflation?  Printing money that undermines the value of the currency and causes an increase in wages.  Democrats paying for housing for illegal aliens is one cause of inflation.  Democrats paying for EBT/SNAP for illegal aliens is a cause of inflation.  Socialism causes inflation and leads to hyper-inflation. permalink parent award report block reply XxxRDTPRNxxX 2 points 2 days ago So then demand republicans change the law then and repeal snap. WTF does this have to do with refusing to fund the government until illegals get a payday? permalink parent award report block reply rastren 1 points 2 days ago What's stopping the same scenario from happening next time? It's going to be some other debacle where our \"win\" is not giving lesbian preschool teachers to conduct gender swap training. We are still losing, this isn't what I voted for. Public executions now! permalink parent award report block reply XxxRDTPRNxxX 2 points 2 days ago They already had foodstamps. You're not giving up anything to reopen the government, fool. If we we're already giving lesbian preschool teachers gender swap training as a matter of law, the correct thing to do would be repeal the law, not stop paying air traffic controllers and the military! permalink parent award report block reply load 1 more comments... DingleBalls 46 points 2 days ago \"Appeals court\" And their authority over the President is...what? permalink award report block reply overblod 11 points 2 days ago We cannot save this society without hanging them permalink parent award report block reply RedStoneDeepState -5 points 2 days ago The judicial Power shall extend to all Cases, in Law and Equity, arising under this Constitution, the Laws of the United States , and Treaties made, or which shall be made, under their Authority;—to all Cases affecting Ambassadors, other public Ministers and Consuls;—to all Cases of admiralty and maritime Jurisdiction;— to Controversies to which the United States shall be a Party; —to Controversies between two or more States;—between a State and Citizens of another State,—between Citizens of different States,—between Citizens of the same State claiming Lands under Grants of different States, and between a State, or the Citizens thereof, and foreign States, Citizens or Subjects. permalink parent award report block reply overblod 0 points 1 day ago Not if they are corrupt foreign born or dual citizens whose election was funded by likes of Soros. When the system is rotten, fucked, it has to be cauterized. permalink parent award report block reply Executarian2 -33 points 2 days ago Basic checks and balances. Appeals courts have explicit authority over the President. He gets authority in that he gets to nominate judges to his own appeals courts. Edit: LOL at the downvotes. Do some basic fucking reading on any of this. permalink parent award report block reply SanityGumby 27 points 2 days ago That's objectively false. Only the Supreme Court can compel anything of the executive branch at a national level. permalink parent award report block reply FractalRoar 12 points 2 days ago Even that is a usurpation of the Executive authority vested by the Constitution. permalink parent award report block reply RedStoneDeepState -6 points 2 days ago No it is not permalink parent award report block reply Executarian2 -6 points 2 days ago It is literally not. Where the fuck are you getting these ideas from? permalink parent award report block reply Executarian2 -2 points 2 days ago Do BASIC reading, bro. The Supreme Court is simply the FINAL authority over the President, so if they decline to hear this case, then the Circuit Courts LITERALLY have authority over Trump in this case. permalink parent award report block reply RedStoneDeepState -2 points 2 days ago The supreme court has original jurisdiction for some cases. But this isn't one of them. permalink parent award report block reply HoganT -2 points 2 days ago This is so false that you should be banned from being able to speak in public. permalink parent award report block reply RedStoneDeepState -3 points 2 days ago That is just wrong. The constitution is very clear here. The supreme court only has original jurisdiction of the case is about a ambassador, public minister/consul, or if a state is a party. Not if the executive branch is involved. In all Cases affecting Ambassadors, other public Ministers and Consuls, and those in which a State shall be Party, the supreme Court shall have original Jurisdiction. permalink parent award report block reply Unboosted 1 points 2 days ago I think you guys are talking about the same thing. Only one is blackpilled permalink parent award report block reply SanityGumby 1 points 2 days ago I know the Constitution. You clearly do not. permalink parent award report block reply view 2 more comments... 45fan 13 points 2 days ago What a poor understanding of government. The courts do not have authority over anyone in the executive. They can make decisions as to the legality of executive action. Were the executive in egregious enough violation then Congress could take action to impeach executive office holders. But, the courts themselves have no authority to compel executive officers to take any particular action. They can issue an opinion stating that they should, or should not, to be in compliance with the law. permalink parent award report block reply Executarian2 2 points 2 days ago The courts LITERALLY have ultimate authority over the legality of Trump's actions. What are you talking about? Provide a shred of evidence to prove your side. The final step is the Supreme Court, and if they choose not to hear the case, then whatever this Court says is the ultimate law. This is not hard. It's quite literally one of the most basic understandings of the Judicial branch. permalink parent award report block reply RedStoneDeepState -2 points 2 days ago The supreme court has original jurisdiction for some cases. But this isn't one of them. permalink parent award report block reply view 4 more comments... RedStoneDeepState -3 points 2 days ago The executive is responsible for enforcing laws and the courts have a right to make rulings over laws as well as Controversies to which the United States shall be a Party. The judicial Power shall extend to all Cases, in Law and Equity, arising under this Constitution, the Laws of the United States, and Treaties made, or which shall be made, under their Authority;—to all Cases affecting Ambassadors, other public Ministers and Consuls;—to all Cases of admiralty and maritime Jurisdiction;—to Controversies to which the United States shall be a Party;—to Controversies between two or more States;—between a State and Citizens of another State,—between Citizens of different States,—between Citizens of the same State claiming Lands under Grants of different States, and between a State, or the Citizens thereof, and foreign States, Citizens or Subjects. permalink parent award report block reply GatoradeJeb 0 points 2 days ago Except if your biden then you can do what ever you want if its antiWhite or pro brown permalink parent award report block reply Trump-16-20-24-28-32 0 points 2 days ago I won't downvote you, but I will challenge you.  \"Do some basic fucking reading\" is often what people say when they can't back up what it is they are saying and are just speaking from their own understanding, right or wrong. RedStoneDeepState brilliantly quoted Article III of our US Constitution, which is a reliable source.  You could build on that though and discuss judicial review as it was argued in 1803 with Marbury vs Madison which ruled that the judicial branch has the ability to review LAWS put forth by the legislative branch as unconstitutional.  It was very specifically a check that the judicial branch ruled they had the power to do, but it was limited to the legislative branch.  Now, over the years, it's been abused and most recently has been weaponized against Trump. Next, the only court that we are compelled to have is the Supreme Court.  Did you know every other court has been created out of an act of congress?  That's right, these lower courts are all created by congress (and can be taken away by congress). So, while a court can rule that an executive action is unconstitutional, they cannot create new powers and confer them to the president, nor can they deny the president the powers he already has, nor can they relegate new powers that were normally congressional (such as the power of the purse given to the House) to another branch. permalink parent award report block reply Executarian2 -1 points 2 days ago You're trying to sound smart with Marbury v. Madison but you completely misread the case. The case was literally Marbury v. Madison. James Madison was the Secretary of State, part of the Executive Branch. The entire dispute was about whether the court could force an executive officer to do his job. While the ruling did strike down a legislative act, it simultaneously established the principle that the judiciary can review the actions of both the legislative and executive branches. The idea that judicial review doesn't apply to the President is a historical fantasy. Youngstown v. Sawyer (where the court stopped Truman from seizing steel mills) and United States v. Nixon (where the court forced Nixon to turn over the tapes) are cornerstone cases that prove the judiciary has always had the power to check the executive. Who cares if Congress created the lower courts? They exist now, and their rulings are binding federal law. The executive must follow them unless the Supreme Court says otherwise. Your entire argument is based on a fourth-grade misreading of the most famous court case in U.S. history. permalink parent award report block reply Trump-16-20-24-28-32 2 points 2 days ago You know, I come at you with good faith and your first and last comment is a personal attack against me \"trying to sound smart\" and a \"fourth-grade misreading.\"  Come on, I didn't personally attack you.  I was one of the few people trying to strike up a conversation.  Sheesh.  Now you just look like a retarded troll... and I was trying to give you a chance. I blame myself for ignoring the community heavily downvoting you.  But, we all have a lapse in judgement at times. I will still respond, not for you, but for the others on here who want better context than your oversimplification. And while some of the stuff you say is true, it's lacking substantial context and history.  You do an OK job coming up with examples of how the powers were expanded 150 years after the ruling (which honestly only help what I was saying).  You need to look deeper in to issues and stop being so narrow focused.  I know it's hard to dig in to history, there is a lot of reading. For me, the source is the case itself and the actual majority opinion written by Chief Justice John Marshal, who's main focus was directed at Congress exceeding constitutional limits.  Marshal even wrote that the court couln't compel certain discretional executive acts, specifically showing a distinction between judicial review and some acts of the executive (specifically, discretionary acts, not ministerial duties). Here is what the actual case was: Congress does not have the power to pass laws that override the Constitution, such as by expanding the scope of the Supreme Court’s original jurisdiction. It seems pretty clear what was being argued. What you have shown that over time, this judicial review has expanded more frequently to the executive branch which, in my opinion, goes against what the majority opinion was in 1803. Here are some key parts of the transcript because I highly doubt you'll take the time to read it, after all, it is a couple pages long and the summary just isn't informative enough.  Take note of explicit, clear, and direct language.  He references the legislature and the law over and over again. The conclusion from this reasoning is, that where the heads of departments are the political or confidential agents of the executive, merely to execute the will of the President, or rather to act in cases in which the executive possesses a constitutional or legal discretion, nothing can be more perfectly clear than that their acts are only politically examinable. But where a specific duty is assigned by law, and individual rights depend upon the performance of that duty, it seems equally clear, that the individual who considers himself injured, has a right to resort to the laws of his country for a remedy. . . . It is, then, the opinion of the Court [that Marbury has a] right to the commission; a refusal to deliver which is a plain violation of that right, for which the laws of his country afford him a remedy. Furthermore: If an act of the legislature, repugnant to the constitution, is void, does it, notwithstanding its invalidity, bind the courts, and oblige them to give it effect? Or, in other words, though it be not law, does it constitute a rule as operative as if it was a law? This would be to overthrow in fact what was established in theory; and would seem, at first view, an absurdity too gross to be insisted on. It shall, however, receive a more attentive consideration. Furthermore: So if a law be in opposition to the constitution; if both the law and the constitution apply to a particular case, so that the court must either decide that case conformably to the law, disregarding the constitution; or conformably to the constitution, disregarding the law; the court must determine which of these conflicting rules governs the case. This is of the very essence of judicial duty. ....  If, then, the courts are to regard the constitution, and the constitution is superior to any ordinary act of the legislature, the constitution, and not such ordinary act, must govern the case to which they both apply. Lastly: From these, and many other selections which might be made, it is apparent, that the framers of the constitution contemplated that instrument as a rule for the government of courts, as well as of the legislature. Why otherwise does it direct the judges to take an oath to support it? When you read the opinion, it very briefly discusses executive actions.  But you are explaining how judicial review was later interpreted and expanded and not what Marshall explicitly ruled in 1803. Here is the text of the case and the unanimous opinion: https://supreme.justia.com/cases/federal/us/5/137/ permalink parent award report block reply view 6 more comments... Agenda47 0 points 2 days ago YEAH I can't believe these idiots don't remember the Basic Checks and Balances clause written right beneath the Good and Plenty clause! permalink parent award report block reply load 24 more comments... preferredfault 34 points 2 days ago It's a pointless ruling. The fact is, you can't force the Executive branch to fund something that congress has not voted to fund. It's as simple as that. Food stamps are no different than any other government program. Just because a program is administered under a specific agency, doesn't mean any money that agency has can go to anything that agency oversees. Congress passed food stamps as a program a long time ago. It's on them to fund it. If they don't vote to fund it, then the program effectively ceases to exist, at least for the time being. permalink award report block reply Beat_to_Quarters 6 points 2 days ago Sounds like liberals and the appeals court want Trump to act like a king lol. Feed the people, m'lord! permalink parent award report block reply Unboosted 1 points 2 days ago The real fact is democrats can and will do what they want and repubs wont. permalink parent award report block reply Executarian2 -10 points 2 days ago Whether or not you like it, it’s not a pointless ruling. If an appeals court says you must fund it, then Trump must fund it. He can appeal to the Supreme Court and they’ll make their decision, and if they say Trump must fund it, then he MUST FUND IT. permalink parent award report block reply preferredfault 11 points 2 days ago That's not true though. Our system of government doesn't work like that. Congress has the purse strings. Funds made available for a specific program, can only be legally used for that program. To force the Executive branch to fund anything is a violation of the separation of powers, because it forces the Executive to take on the role of congress by bypassing congress. Funny how there was a no kings protest, and then suddenly courts are ordering Trump to act like a king. If Trump can use disaster relief funds to pay for food stamps, then he can also use food stamp funds to build the wall, or for anything else he'd like. It'd be a terrible precedent that effectively nullifies congress in practice, for all of time. Why do we even need congress if courts can order Trump to pull money out of thin air? Why do we even need courts if Trump can pull money out of thin air? See the problem. permalink parent award report block reply Awan-CIA-Car-Lot 2 points 2 days ago I'm hearing that the shutdown could be over within the next hour.  Wouldn't that make this illegal ruling inconsequential? permalink parent award report block reply tw0scoops 1 points 2 days ago Seems to me the courts are acting like a 1000 little kings. . permalink parent award report block reply zooty 2 points 2 days ago Petit tyrans. permalink parent award report block reply Executarian2 1 points 2 days ago Okay, once again, the Appeals Courts and the Supreme Court decide what is legal and what is not. The specifics of the ruling don't say that he's compelled to pay for SNAP, but that he's compelled to NOT WITHHOLD SNAP during the shutdown. You don't get to argue with this, because it's not a matter of opinion. The only step now is the Supreme Court. If they rule against him, then that's it. He MUST pay. permalink parent award report block reply preferredfault 1 points 2 days ago Trump isn't withholding SNAP, there's no funds appropriated for it. You can't withhold $0. They can't order him to pay funds that aren't there. I mean they can, but they can't enforce it. It's on congress to fund it. Congress not funding something is as good as defunding something, and such things have happened plenty of times. Let's say for example congress doesn't fund the FBI.....does Trump have to keep the FBI open? No. Does he have to take funds from some other program to fund it? No. Not unless congress votes to say he does. This is nothing more than political games; congress trying to use the courts to force Trump to do the duty that congress is tasked with. It would be a violation of separation of powers for Trump to comply, and the courts are violating separation of powers by trying to force Trump to comply, and congress is violating the separation of powers by trying to use the courts to force Trump to comply. permalink parent award report block reply view 2 more comments... KernalMustard 1 points 2 days ago Shut down is ovee permalink parent award report block reply view 1 more comments... LauriThorne 4 points 2 days ago You're just making shit up at this point. People cannot be legally compelled to do something otherwise illegal by a court. This is a nonsense ruling designed to make Trump look bad when he doesnt comply because it is against the law for him to do so without Congressional approval you dunce. permalink parent award report block reply Executarian2 0 points 2 days ago The Courts decide what's legal, what the fuck are you talking about? If the Supreme Court, or an Appeals Court, says that what Trump does is illegal, then it is literally automatically illegal. They interpret the law. If you have any evidence to the contrary, please provide it. permalink parent award report block reply zooty 1 points 2 days ago The story of King Cnut comes to mind. Though with a slightly different spelling for these judges. permalink parent award report block reply view 4 more comments... LauriThorne 0 points 2 days ago Judges don't get to just ignore laws, especially when the case they're presiding over isnt calling said law into question. The question before the court was can the executive withhold funds appropriated by Congress for a program, the answer is no. However, the question should be can the executive appropriate funds without congressional approval which is no . In order to \"comply\" with this ruling the Trump administration would have to violate the Constitution and appropriate funds without congressional approval, which they cannot do. The court knows they cannot do this, and, since theyre left wing activists at heart, are banking on people misunderstanding the entire proceeding and getting mad at Trump for ViOlAtInG a CoUrT OrDeR and DeStRoYiNg ChEcKs aNd BaLaNcEs because they, like you, have a very surface level understanding of how this all works. permalink parent award report block reply view 2 more comments... Paperwork35 3 points 2 days ago No. permalink parent award report block reply tw0scoops 2 points 2 days ago Ridiculous argument.  Just bc a judge says it, doesnt make the impossible possible or the illegal legal. Its not as simple as unfreezing funds that the program already has. It would require new funding or moving $$ assigned somewhere else. Blood from a stone. Man can be a woman. All that nonsense. permalink parent award report block reply Executarian2 1 points 2 days ago This isn't \"a judge,\" it's literally one of the highest courts in the country. They are ruling that Trump may not WITHHOLD SNAP, not that he has to arbitrarily shell out $4 billion. The courts obviously consider these things; they aren't just pointing at Trump and telling him that he has to pay $4 billion for no reason. If the Supreme Court tells him he has to fund SNAP, he MUST. He is legally REQUIRED to. This isn't an argument. It's not a matter of opinion. It's a fact. permalink parent award report block reply henri_derelicte 21 points 2 days ago The Supreme Court needs to do something about forum shopping. Am extraordinarily high number of lawsuits against the Trump administration are being run through a small number of district (and by extension, appellate) courts. Massachusetts and the First Circuit are getting a lot of cases since they’re stacked with Obama/Biden appointees permalink award report block reply Light_HIV_Effect 2 points 2 days ago They need to review these judges and courts being overturned. A lot of these rulings could be made by first year law students and they're so clearly wrong. There needs to be consequences for fucking up easy rulings and being overturned a certain number of times in a year. permalink parent award report block reply henri_derelicte 3 points 2 days ago There are very few consequences for a judge getting routinely overturned. These leftist/activist judges don’t care if SCOTUS overrules them because they know that if there were more liberal judges on the high court, their rulings would be upheld. permalink parent award report block reply Callsign_Fox1 1 points 2 days ago Comment removed by community filter, pending further review. permalink parent award report block reply Executarian2 -3 points 2 days ago Doesn’t matter, that’s just fundamentally how the legal system has to work. Removing it would just make the exact opposite happen. permalink parent award report block reply Paperwork35 3 points 2 days ago What would that be specifically? permalink parent award report block reply Executarian2 0 points 2 days ago You just can't control where people file lawsuits. How would that even work? \"If you want to sue Trump, you MUST go through Louisiana's courts to do it!\" See how that doesn't make any sense? permalink parent award report block reply MikeyisNinja 16 points 2 days ago That’s only enough to run snap for 3 weeks. permalink award report block reply BewareOfThePug 8 points 2 days ago or 8 days of the UK National Health Service permalink parent award report block reply Skywise 11 points 2 days ago The Supreme Court already blocked funding u til they can resolve the first case where the appeals court said “gimme dat free food”  this is just virtue signaling. permalink award report block reply Executarian2 1 points 2 days ago Why does nobody read anything? This is the exact case that Jackson sent it down to. This is their decision. Now it moves to the Supreme Court. permalink parent award report block reply OrangeElvis 2 points 2 days ago Quick, someone representing the interests of the funds in question sue to stop the money being misappropriated for SNAP, lol. permalink parent award report block reply DestroyerofCobwebs 8 points 2 days ago Trump needs to appeal this to the Supreme Court even though the case may be moot due to the Democrats finally coming to their senses. The court cannot force the executive to spend money that hasn't been appropriated.  SNAP/EBT is NOT in the same bucket as Medicare and Social Security, the payments aren't mandated by law. permalink award report block reply HenkZeilstra 7 points 2 days ago How the FUCK DO JUDGES RULE THE US this is fucking Hail Hydra what's going on here permalink award report block reply GreyGooseDown 5 points 2 days ago When do courts get to appropriate money?  This is clear violation of the constitution, that never stopped them anyway. Good to know next time there is an appropriations issue. permalink award report block reply NonbinaryPotatohead 6 points 2 days ago Have you not heard of the NFA, Patriots Act, no knock raids, TSA frisk check points, etc etc?\nWhat Constitution? What Rights? permalink parent award report block reply y_do_i_need_to_hide 4 points 2 days ago I dont care what they say. permalink award report block reply Executarian2 -1 points 2 days ago Well, they have important authority so closing your eyes to it won’t do anything. permalink parent award report block reply y_do_i_need_to_hide 1 points 2 days ago An election was stolen openly. ALL of this is make believe. permalink parent award report block reply GatoradeJeb 4 points 2 days ago So I have to work but worthless browns and blacks get to parasite off me? Fuck this shit. The kkk doesnt look so bad anymore permalink award report block reply MeMargie 3 points 2 days ago Where in our constitution does it call for food aid? taxes are for city side streets. permalink award report block reply Diana 3 points 2 days ago Well, if Congress refuses to fund it .... yes, they can withhold money that is not there. permalink award report block reply JimRaynor 3 points 2 days ago Food aid to Democrat allied NGOs who will funnel back through act blue permalink award report block reply Dev404 3 points 2 days ago See how hard democrats fight for criminals? If only republicans would fight even half as hard for law abiding citizens. We have no representation in Congress and in courts. permalink award report block reply daty_dato 2 points 2 days ago Why does this matter? Isn't the government open again? permalink award report block reply Beardholder 2 points 2 days ago US Appeals court is triatorous . I want war. Not because I want innocent people to die but to fucking put a end to all this wide spread never ending corruption. permalink award report block reply plasma 3 points 2 days ago war will end everything except corruption permalink parent award report block reply Executarian2 1 points 2 days ago Keyboard warrior silliness. Waging a war on the law is just about the dumbest thing you could do. permalink parent award report block reply MegoThor 2 points 2 days ago Then let the US appeals court fund it out of their own pockets. permalink award report block reply Smurfection 2 points 2 days ago It's not Trump withholding it.  It's the Senate.  The Senate has to approve a budget that has passed the House and president signs the budget. Senate Democrats are refusing to pass the CR from the House to fund government.   Any court that orders Trump but not the Senate, has woefully and egregiously misunderstood how our system of government works. permalink award report block reply Crappydatum 2 points 2 days ago Jumanji got cornfused agin? permalink award report block reply PatriotSkorzeny 2 points 2 days ago Food aid is what we give to foreign nation hurricane relief. permalink award report block reply Wexit-Delecto 1 points 2 days ago What kind of ties bind these judges to the deep state? You can’t buy loyalty like this… permalink award report block reply Paydro 1 points 2 days ago Trump better be appointing a fuck ton of these judges right now to retard-proof the inevitable next faggot dem president permalink award report block reply cherbui 1 points 2 days ago Stupid fucks should be asking the dem why they dont do their job and hold America hostage ..  call it treason and remove those dem already and those rino too permalink award report block reply shockpurseyell 1 points 2 days ago Seems if the courts have the power to force the executive to find money for snap, the court could also order the legislature to end the shutdown and fund the govt and its programs. Courts are out of their depth when they feel emboldened to fashion a remedy for every dispute presented. When on most of these political issues they should be telling plaintiffs to contact your congressman and vote harder next time. permalink parent award report block reply Unboosted 1 points 2 days ago Just cancel welfare then. EO it permalink award report block reply VirTW 0 points 2 days ago The court should pay for the aid itself permalink award report block reply Shitsbrokeyo 0 points 2 days ago WHY NOT? ITS SUPPLEMENTAL!\nYes all caps permalink award report block reply SanityGumby 0 points 2 days ago They obviously can because that's not what Congress allotted it for. permalink award report block reply\nXxxRDTPRNxxX 160 points 2 days ago Just reminding everyone this fight isn't about food stamps or black people. It's about not giving free healthcare to illegals when US Citizens who pay taxes don't even get that. We can debate welfare programs for citizens at another time, but for now the goal needs to be ending the shutdown without giving illegals SHIT. permalink award report block reply Texas_81 54 points 2 days ago Facts. So tired of these games. It’s like this administration boasts about letting 0 in which is positive but doesn’t cut the welfare programs so the rest can leave permalink parent award report block reply bigdickhangsright 25 points 2 days ago That's what they're trying to do. permalink parent award report block reply deleted 3 points 2 days ago TrumpAndSimpsNotMAGA 1 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply Here_we_go 9 points 2 days ago Welfare, business owners and landlords. But we cant do that. permalink parent award report block reply Samuel_L_Bronkowitz 5 points 2 days ago It really is just that simple. permalink parent award report block reply Here_we_go 2 points 2 days ago Its infuriatingly simple. permalink parent award report block reply GatoradeJeb 3 points 2 days ago Trump doesnt ban racemixing either so ot gets worse as White woman are brainwashed by liberals and hollywood to racemix with the brown/black turds. permalink parent award report block reply Unboosted 4 points 2 days ago In less than 20 years we will hear from white women about how having a black child is \"challenging\" and would not recommend.... oh wait permalink parent award report block reply GatoradeJeb 2 points 2 days ago And only when they are worthless damaged goods with mulatto goblins do they then want a White man. Fuckt those race traitors permalink parent award report block reply CentipedeDemon 2 points 2 days ago There will never be a president that does that. permalink parent award report block reply GatoradeJeb 0 points 2 days ago Us is dead then. Its very distrutbing seeing how most young White woman are race traitors permalink parent award report block reply josiborg 14 points 2 days ago It's about insurance companies getting paid their subsides. And that's it. The other talking points are propaganda to manipulate. permalink parent award report block reply LogicalReasoning 6 points 2 days ago Any system that depends on subsidies over time becomes corrupted and inefficient and overall unsustainable. This is just the unfortunate fact, and i can't think of any example otherwise. permalink parent award report block reply onesummerdream 3 points 2 days ago Me thinks all these programs are designed that way. Even though I knew most program funding was used to grow government over time, USAID was a real eye opener. permalink parent award report block reply HoganT 0 points 2 days ago Welp, there goes our entire farming industry. Along with many others. Every single farmer is a government payee. permalink parent award report block reply BidensBodyDouble 1 points 2 days ago Ok? And the govt also pays farmers to decommission their land to combat 'climate change'. When the govt begins central planning of any market everything gets more expensive and goes to shit. If they removed the red tape on farmers it'd likely do more to lower costs than any of the subsidies. \"The top 10% of recipients of federal farm payments raked in more than 79% of total subsidies over the last 25 years \" And certainly looks like those subsidies are abused and not fairly distributed. permalink parent award report block reply Steve56775 6 points 2 days ago Illegals are only entitled to one thing-Deportation! permalink parent award report block reply XxxRDTPRNxxX 3 points 2 days ago Even MAGA people are too pussy to admit the actual solution. Fucking kill them! Why would we let millions of foreigners invade us and then spend thousands on each sending them home in one piece?! Fucking kill them and make a real disincentive. permalink parent award report block reply NotYourMan 1 points 2 days ago ^ THIS permalink parent award report block reply NotYourMan 4 points 2 days ago Giving SHIT away causes inflation.  What is inflation?  Printing money that undermines the value of the currency and causes an increase in wages.  Democrats paying for housing for illegal aliens is one cause of inflation.  Democrats paying for EBT/SNAP for illegal aliens is a cause of inflation.  Socialism causes inflation and leads to hyper-inflation. permalink parent award report block reply XxxRDTPRNxxX 2 points 2 days ago So then demand republicans change the law then and repeal snap. WTF does this have to do with refusing to fund the government until illegals get a payday? permalink parent award report block reply rastren 1 points 2 days ago What's stopping the same scenario from happening next time? It's going to be some other debacle where our \"win\" is not giving lesbian preschool teachers to conduct gender swap training. We are still losing, this isn't what I voted for. Public executions now! permalink parent award report block reply XxxRDTPRNxxX 2 points 2 days ago They already had foodstamps. You're not giving up anything to reopen the government, fool. If we we're already giving lesbian preschool teachers gender swap training as a matter of law, the correct thing to do would be repeal the law, not stop paying air traffic controllers and the military! permalink parent award report block reply load 1 more comments...\nTexas_81 54 points 2 days ago Facts. So tired of these games. It’s like this administration boasts about letting 0 in which is positive but doesn’t cut the welfare programs so the rest can leave permalink parent award report block reply bigdickhangsright 25 points 2 days ago That's what they're trying to do. permalink parent award report block reply deleted 3 points 2 days ago TrumpAndSimpsNotMAGA 1 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply Here_we_go 9 points 2 days ago Welfare, business owners and landlords. But we cant do that. permalink parent award report block reply Samuel_L_Bronkowitz 5 points 2 days ago It really is just that simple. permalink parent award report block reply Here_we_go 2 points 2 days ago Its infuriatingly simple. permalink parent award report block reply GatoradeJeb 3 points 2 days ago Trump doesnt ban racemixing either so ot gets worse as White woman are brainwashed by liberals and hollywood to racemix with the brown/black turds. permalink parent award report block reply Unboosted 4 points 2 days ago In less than 20 years we will hear from white women about how having a black child is \"challenging\" and would not recommend.... oh wait permalink parent award report block reply GatoradeJeb 2 points 2 days ago And only when they are worthless damaged goods with mulatto goblins do they then want a White man. Fuckt those race traitors permalink parent award report block reply CentipedeDemon 2 points 2 days ago There will never be a president that does that. permalink parent award report block reply GatoradeJeb 0 points 2 days ago Us is dead then. Its very distrutbing seeing how most young White woman are race traitors permalink parent award report block reply\nbigdickhangsright 25 points 2 days ago That's what they're trying to do. permalink parent award report block reply deleted 3 points 2 days ago TrumpAndSimpsNotMAGA 1 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply\ndeleted 3 points 2 days ago TrumpAndSimpsNotMAGA 1 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply\nTrumpAndSimpsNotMAGA 1 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply\nHere_we_go 9 points 2 days ago Welfare, business owners and landlords. But we cant do that. permalink parent award report block reply Samuel_L_Bronkowitz 5 points 2 days ago It really is just that simple. permalink parent award report block reply Here_we_go 2 points 2 days ago Its infuriatingly simple. permalink parent award report block reply\nSamuel_L_Bronkowitz 5 points 2 days ago It really is just that simple. permalink parent award report block reply Here_we_go 2 points 2 days ago Its infuriatingly simple. permalink parent award report block reply\nHere_we_go 2 points 2 days ago Its infuriatingly simple. permalink parent award report block reply\nGatoradeJeb 3 points 2 days ago Trump doesnt ban racemixing either so ot gets worse as White woman are brainwashed by liberals and hollywood to racemix with the brown/black turds. permalink parent award report block reply Unboosted 4 points 2 days ago In less than 20 years we will hear from white women about how having a black child is \"challenging\" and would not recommend.... oh wait permalink parent award report block reply GatoradeJeb 2 points 2 days ago And only when they are worthless damaged goods with mulatto goblins do they then want a White man. Fuckt those race traitors permalink parent award report block reply CentipedeDemon 2 points 2 days ago There will never be a president that does that. permalink parent award report block reply GatoradeJeb 0 points 2 days ago Us is dead then. Its very distrutbing seeing how most young White woman are race traitors permalink parent award report block reply\nUnboosted 4 points 2 days ago In less than 20 years we will hear from white women about how having a black child is \"challenging\" and would not recommend.... oh wait permalink parent award report block reply GatoradeJeb 2 points 2 days ago And only when they are worthless damaged goods with mulatto goblins do they then want a White man. Fuckt those race traitors permalink parent award report block reply\nGatoradeJeb 2 points 2 days ago And only when they are worthless damaged goods with mulatto goblins do they then want a White man. Fuckt those race traitors permalink parent award report block reply\nCentipedeDemon 2 points 2 days ago There will never be a president that does that. permalink parent award report block reply GatoradeJeb 0 points 2 days ago Us is dead then. Its very distrutbing seeing how most young White woman are race traitors permalink parent award report block reply\nGatoradeJeb 0 points 2 days ago Us is dead then. Its very distrutbing seeing how most young White woman are race traitors permalink parent award report block reply\njosiborg 14 points 2 days ago It's about insurance companies getting paid their subsides. And that's it. The other talking points are propaganda to manipulate. permalink parent award report block reply LogicalReasoning 6 points 2 days ago Any system that depends on subsidies over time becomes corrupted and inefficient and overall unsustainable. This is just the unfortunate fact, and i can't think of any example otherwise. permalink parent award report block reply onesummerdream 3 points 2 days ago Me thinks all these programs are designed that way. Even though I knew most program funding was used to grow government over time, USAID was a real eye opener. permalink parent award report block reply HoganT 0 points 2 days ago Welp, there goes our entire farming industry. Along with many others. Every single farmer is a government payee. permalink parent award report block reply BidensBodyDouble 1 points 2 days ago Ok? And the govt also pays farmers to decommission their land to combat 'climate change'. When the govt begins central planning of any market everything gets more expensive and goes to shit. If they removed the red tape on farmers it'd likely do more to lower costs than any of the subsidies. \"The top 10% of recipients of federal farm payments raked in more than 79% of total subsidies over the last 25 years \" And certainly looks like those subsidies are abused and not fairly distributed. permalink parent award report block reply\nLogicalReasoning 6 points 2 days ago Any system that depends on subsidies over time becomes corrupted and inefficient and overall unsustainable. This is just the unfortunate fact, and i can't think of any example otherwise. permalink parent award report block reply onesummerdream 3 points 2 days ago Me thinks all these programs are designed that way. Even though I knew most program funding was used to grow government over time, USAID was a real eye opener. permalink parent award report block reply HoganT 0 points 2 days ago Welp, there goes our entire farming industry. Along with many others. Every single farmer is a government payee. permalink parent award report block reply BidensBodyDouble 1 points 2 days ago Ok? And the govt also pays farmers to decommission their land to combat 'climate change'. When the govt begins central planning of any market everything gets more expensive and goes to shit. If they removed the red tape on farmers it'd likely do more to lower costs than any of the subsidies. \"The top 10% of recipients of federal farm payments raked in more than 79% of total subsidies over the last 25 years \" And certainly looks like those subsidies are abused and not fairly distributed. permalink parent award report block reply\nonesummerdream 3 points 2 days ago Me thinks all these programs are designed that way. Even though I knew most program funding was used to grow government over time, USAID was a real eye opener. permalink parent award report block reply\nHoganT 0 points 2 days ago Welp, there goes our entire farming industry. Along with many others. Every single farmer is a government payee. permalink parent award report block reply BidensBodyDouble 1 points 2 days ago Ok? And the govt also pays farmers to decommission their land to combat 'climate change'. When the govt begins central planning of any market everything gets more expensive and goes to shit. If they removed the red tape on farmers it'd likely do more to lower costs than any of the subsidies. \"The top 10% of recipients of federal farm payments raked in more than 79% of total subsidies over the last 25 years \" And certainly looks like those subsidies are abused and not fairly distributed. permalink parent award report block reply\nBidensBodyDouble 1 points 2 days ago Ok? And the govt also pays farmers to decommission their land to combat 'climate change'. When the govt begins central planning of any market everything gets more expensive and goes to shit. If they removed the red tape on farmers it'd likely do more to lower costs than any of the subsidies. \"The top 10% of recipients of federal farm payments raked in more than 79% of total subsidies over the last 25 years \" And certainly looks like those subsidies are abused and not fairly distributed. permalink parent award report block reply\nSteve56775 6 points 2 days ago Illegals are only entitled to one thing-Deportation! permalink parent award report block reply XxxRDTPRNxxX 3 points 2 days ago Even MAGA people are too pussy to admit the actual solution. Fucking kill them! Why would we let millions of foreigners invade us and then spend thousands on each sending them home in one piece?! Fucking kill them and make a real disincentive. permalink parent award report block reply NotYourMan 1 points 2 days ago ^ THIS permalink parent award report block reply\nXxxRDTPRNxxX 3 points 2 days ago Even MAGA people are too pussy to admit the actual solution. Fucking kill them! Why would we let millions of foreigners invade us and then spend thousands on each sending them home in one piece?! Fucking kill them and make a real disincentive. permalink parent award report block reply\nNotYourMan 1 points 2 days ago ^ THIS permalink parent award report block reply\nNotYourMan 4 points 2 days ago Giving SHIT away causes inflation.  What is inflation?  Printing money that undermines the value of the currency and causes an increase in wages.  Democrats paying for housing for illegal aliens is one cause of inflation.  Democrats paying for EBT/SNAP for illegal aliens is a cause of inflation.  Socialism causes inflation and leads to hyper-inflation. permalink parent award report block reply XxxRDTPRNxxX 2 points 2 days ago So then demand republicans change the law then and repeal snap. WTF does this have to do with refusing to fund the government until illegals get a payday? permalink parent award report block reply\nXxxRDTPRNxxX 2 points 2 days ago So then demand republicans change the law then and repeal snap. WTF does this have to do with refusing to fund the government until illegals get a payday? permalink parent award report block reply\nrastren 1 points 2 days ago What's stopping the same scenario from happening next time? It's going to be some other debacle where our \"win\" is not giving lesbian preschool teachers to conduct gender swap training. We are still losing, this isn't what I voted for. Public executions now! permalink parent award report block reply XxxRDTPRNxxX 2 points 2 days ago They already had foodstamps. You're not giving up anything to reopen the government, fool. If we we're already giving lesbian preschool teachers gender swap training as a matter of law, the correct thing to do would be repeal the law, not stop paying air traffic controllers and the military! permalink parent award report block reply\nXxxRDTPRNxxX 2 points 2 days ago They already had foodstamps. You're not giving up anything to reopen the government, fool. If we we're already giving lesbian preschool teachers gender swap training as a matter of law, the correct thing to do would be repeal the law, not stop paying air traffic controllers and the military! permalink parent award report block reply\nDingleBalls 46 points 2 days ago \"Appeals court\" And their authority over the President is...what? permalink award report block reply overblod 11 points 2 days ago We cannot save this society without hanging them permalink parent award report block reply RedStoneDeepState -5 points 2 days ago The judicial Power shall extend to all Cases, in Law and Equity, arising under this Constitution, the Laws of the United States , and Treaties made, or which shall be made, under their Authority;—to all Cases affecting Ambassadors, other public Ministers and Consuls;—to all Cases of admiralty and maritime Jurisdiction;— to Controversies to which the United States shall be a Party; —to Controversies between two or more States;—between a State and Citizens of another State,—between Citizens of different States,—between Citizens of the same State claiming Lands under Grants of different States, and between a State, or the Citizens thereof, and foreign States, Citizens or Subjects. permalink parent award report block reply overblod 0 points 1 day ago Not if they are corrupt foreign born or dual citizens whose election was funded by likes of Soros. When the system is rotten, fucked, it has to be cauterized. permalink parent award report block reply Executarian2 -33 points 2 days ago Basic checks and balances. Appeals courts have explicit authority over the President. He gets authority in that he gets to nominate judges to his own appeals courts. Edit: LOL at the downvotes. Do some basic fucking reading on any of this. permalink parent award report block reply SanityGumby 27 points 2 days ago That's objectively false. Only the Supreme Court can compel anything of the executive branch at a national level. permalink parent award report block reply FractalRoar 12 points 2 days ago Even that is a usurpation of the Executive authority vested by the Constitution. permalink parent award report block reply RedStoneDeepState -6 points 2 days ago No it is not permalink parent award report block reply Executarian2 -6 points 2 days ago It is literally not. Where the fuck are you getting these ideas from? permalink parent award report block reply Executarian2 -2 points 2 days ago Do BASIC reading, bro. The Supreme Court is simply the FINAL authority over the President, so if they decline to hear this case, then the Circuit Courts LITERALLY have authority over Trump in this case. permalink parent award report block reply RedStoneDeepState -2 points 2 days ago The supreme court has original jurisdiction for some cases. But this isn't one of them. permalink parent award report block reply HoganT -2 points 2 days ago This is so false that you should be banned from being able to speak in public. permalink parent award report block reply RedStoneDeepState -3 points 2 days ago That is just wrong. The constitution is very clear here. The supreme court only has original jurisdiction of the case is about a ambassador, public minister/consul, or if a state is a party. Not if the executive branch is involved. In all Cases affecting Ambassadors, other public Ministers and Consuls, and those in which a State shall be Party, the supreme Court shall have original Jurisdiction. permalink parent award report block reply Unboosted 1 points 2 days ago I think you guys are talking about the same thing. Only one is blackpilled permalink parent award report block reply SanityGumby 1 points 2 days ago I know the Constitution. You clearly do not. permalink parent award report block reply view 2 more comments... 45fan 13 points 2 days ago What a poor understanding of government. The courts do not have authority over anyone in the executive. They can make decisions as to the legality of executive action. Were the executive in egregious enough violation then Congress could take action to impeach executive office holders. But, the courts themselves have no authority to compel executive officers to take any particular action. They can issue an opinion stating that they should, or should not, to be in compliance with the law. permalink parent award report block reply Executarian2 2 points 2 days ago The courts LITERALLY have ultimate authority over the legality of Trump's actions. What are you talking about? Provide a shred of evidence to prove your side. The final step is the Supreme Court, and if they choose not to hear the case, then whatever this Court says is the ultimate law. This is not hard. It's quite literally one of the most basic understandings of the Judicial branch. permalink parent award report block reply RedStoneDeepState -2 points 2 days ago The supreme court has original jurisdiction for some cases. But this isn't one of them. permalink parent award report block reply view 4 more comments... RedStoneDeepState -3 points 2 days ago The executive is responsible for enforcing laws and the courts have a right to make rulings over laws as well as Controversies to which the United States shall be a Party. The judicial Power shall extend to all Cases, in Law and Equity, arising under this Constitution, the Laws of the United States, and Treaties made, or which shall be made, under their Authority;—to all Cases affecting Ambassadors, other public Ministers and Consuls;—to all Cases of admiralty and maritime Jurisdiction;—to Controversies to which the United States shall be a Party;—to Controversies between two or more States;—between a State and Citizens of another State,—between Citizens of different States,—between Citizens of the same State claiming Lands under Grants of different States, and between a State, or the Citizens thereof, and foreign States, Citizens or Subjects. permalink parent award report block reply GatoradeJeb 0 points 2 days ago Except if your biden then you can do what ever you want if its antiWhite or pro brown permalink parent award report block reply Trump-16-20-24-28-32 0 points 2 days ago I won't downvote you, but I will challenge you.  \"Do some basic fucking reading\" is often what people say when they can't back up what it is they are saying and are just speaking from their own understanding, right or wrong. RedStoneDeepState brilliantly quoted Article III of our US Constitution, which is a reliable source.  You could build on that though and discuss judicial review as it was argued in 1803 with Marbury vs Madison which ruled that the judicial branch has the ability to review LAWS put forth by the legislative branch as unconstitutional.  It was very specifically a check that the judicial branch ruled they had the power to do, but it was limited to the legislative branch.  Now, over the years, it's been abused and most recently has been weaponized against Trump. Next, the only court that we are compelled to have is the Supreme Court.  Did you know every other court has been created out of an act of congress?  That's right, these lower courts are all created by congress (and can be taken away by congress). So, while a court can rule that an executive action is unconstitutional, they cannot create new powers and confer them to the president, nor can they deny the president the powers he already has, nor can they relegate new powers that were normally congressional (such as the power of the purse given to the House) to another branch. permalink parent award report block reply Executarian2 -1 points 2 days ago You're trying to sound smart with Marbury v. Madison but you completely misread the case. The case was literally Marbury v. Madison. James Madison was the Secretary of State, part of the Executive Branch. The entire dispute was about whether the court could force an executive officer to do his job. While the ruling did strike down a legislative act, it simultaneously established the principle that the judiciary can review the actions of both the legislative and executive branches. The idea that judicial review doesn't apply to the President is a historical fantasy. Youngstown v. Sawyer (where the court stopped Truman from seizing steel mills) and United States v. Nixon (where the court forced Nixon to turn over the tapes) are cornerstone cases that prove the judiciary has always had the power to check the executive. Who cares if Congress created the lower courts? They exist now, and their rulings are binding federal law. The executive must follow them unless the Supreme Court says otherwise. Your entire argument is based on a fourth-grade misreading of the most famous court case in U.S. history. permalink parent award report block reply Trump-16-20-24-28-32 2 points 2 days ago You know, I come at you with good faith and your first and last comment is a personal attack against me \"trying to sound smart\" and a \"fourth-grade misreading.\"  Come on, I didn't personally attack you.  I was one of the few people trying to strike up a conversation.  Sheesh.  Now you just look like a retarded troll... and I was trying to give you a chance. I blame myself for ignoring the community heavily downvoting you.  But, we all have a lapse in judgement at times. I will still respond, not for you, but for the others on here who want better context than your oversimplification. And while some of the stuff you say is true, it's lacking substantial context and history.  You do an OK job coming up with examples of how the powers were expanded 150 years after the ruling (which honestly only help what I was saying).  You need to look deeper in to issues and stop being so narrow focused.  I know it's hard to dig in to history, there is a lot of reading. For me, the source is the case itself and the actual majority opinion written by Chief Justice John Marshal, who's main focus was directed at Congress exceeding constitutional limits.  Marshal even wrote that the court couln't compel certain discretional executive acts, specifically showing a distinction between judicial review and some acts of the executive (specifically, discretionary acts, not ministerial duties). Here is what the actual case was: Congress does not have the power to pass laws that override the Constitution, such as by expanding the scope of the Supreme Court’s original jurisdiction. It seems pretty clear what was being argued. What you have shown that over time, this judicial review has expanded more frequently to the executive branch which, in my opinion, goes against what the majority opinion was in 1803. Here are some key parts of the transcript because I highly doubt you'll take the time to read it, after all, it is a couple pages long and the summary just isn't informative enough.  Take note of explicit, clear, and direct language.  He references the legislature and the law over and over again. The conclusion from this reasoning is, that where the heads of departments are the political or confidential agents of the executive, merely to execute the will of the President, or rather to act in cases in which the executive possesses a constitutional or legal discretion, nothing can be more perfectly clear than that their acts are only politically examinable. But where a specific duty is assigned by law, and individual rights depend upon the performance of that duty, it seems equally clear, that the individual who considers himself injured, has a right to resort to the laws of his country for a remedy. . . . It is, then, the opinion of the Court [that Marbury has a] right to the commission; a refusal to deliver which is a plain violation of that right, for which the laws of his country afford him a remedy. Furthermore: If an act of the legislature, repugnant to the constitution, is void, does it, notwithstanding its invalidity, bind the courts, and oblige them to give it effect? Or, in other words, though it be not law, does it constitute a rule as operative as if it was a law? This would be to overthrow in fact what was established in theory; and would seem, at first view, an absurdity too gross to be insisted on. It shall, however, receive a more attentive consideration. Furthermore: So if a law be in opposition to the constitution; if both the law and the constitution apply to a particular case, so that the court must either decide that case conformably to the law, disregarding the constitution; or conformably to the constitution, disregarding the law; the court must determine which of these conflicting rules governs the case. This is of the very essence of judicial duty. ....  If, then, the courts are to regard the constitution, and the constitution is superior to any ordinary act of the legislature, the constitution, and not such ordinary act, must govern the case to which they both apply. Lastly: From these, and many other selections which might be made, it is apparent, that the framers of the constitution contemplated that instrument as a rule for the government of courts, as well as of the legislature. Why otherwise does it direct the judges to take an oath to support it? When you read the opinion, it very briefly discusses executive actions.  But you are explaining how judicial review was later interpreted and expanded and not what Marshall explicitly ruled in 1803. Here is the text of the case and the unanimous opinion: https://supreme.justia.com/cases/federal/us/5/137/ permalink parent award report block reply view 6 more comments... Agenda47 0 points 2 days ago YEAH I can't believe these idiots don't remember the Basic Checks and Balances clause written right beneath the Good and Plenty clause! permalink parent award report block reply load 24 more comments...\noverblod 11 points 2 days ago We cannot save this society without hanging them permalink parent award report block reply\nRedStoneDeepState -5 points 2 days ago The judicial Power shall extend to all Cases, in Law and Equity, arising under this Constitution, the Laws of the United States , and Treaties made, or which shall be made, under their Authority;—to all Cases affecting Ambassadors, other public Ministers and Consuls;—to all Cases of admiralty and maritime Jurisdiction;— to Controversies to which the United States shall be a Party; —to Controversies between two or more States;—between a State and Citizens of another State,—between Citizens of different States,—between Citizens of the same State claiming Lands under Grants of different States, and between a State, or the Citizens thereof, and foreign States, Citizens or Subjects. permalink parent award report block reply overblod 0 points 1 day ago Not if they are corrupt foreign born or dual citizens whose election was funded by likes of Soros. When the system is rotten, fucked, it has to be cauterized. permalink parent award report block reply\noverblod 0 points 1 day ago Not if they are corrupt foreign born or dual citizens whose election was funded by likes of Soros. When the system is rotten, fucked, it has to be cauterized. permalink parent award report block reply\nExecutarian2 -33 points 2 days ago Basic checks and balances. Appeals courts have explicit authority over the President. He gets authority in that he gets to nominate judges to his own appeals courts. Edit: LOL at the downvotes. Do some basic fucking reading on any of this. permalink parent award report block reply SanityGumby 27 points 2 days ago That's objectively false. Only the Supreme Court can compel anything of the executive branch at a national level. permalink parent award report block reply FractalRoar 12 points 2 days ago Even that is a usurpation of the Executive authority vested by the Constitution. permalink parent award report block reply RedStoneDeepState -6 points 2 days ago No it is not permalink parent award report block reply Executarian2 -6 points 2 days ago It is literally not. Where the fuck are you getting these ideas from? permalink parent award report block reply Executarian2 -2 points 2 days ago Do BASIC reading, bro. The Supreme Court is simply the FINAL authority over the President, so if they decline to hear this case, then the Circuit Courts LITERALLY have authority over Trump in this case. permalink parent award report block reply RedStoneDeepState -2 points 2 days ago The supreme court has original jurisdiction for some cases. But this isn't one of them. permalink parent award report block reply HoganT -2 points 2 days ago This is so false that you should be banned from being able to speak in public. permalink parent award report block reply RedStoneDeepState -3 points 2 days ago That is just wrong. The constitution is very clear here. The supreme court only has original jurisdiction of the case is about a ambassador, public minister/consul, or if a state is a party. Not if the executive branch is involved. In all Cases affecting Ambassadors, other public Ministers and Consuls, and those in which a State shall be Party, the supreme Court shall have original Jurisdiction. permalink parent award report block reply Unboosted 1 points 2 days ago I think you guys are talking about the same thing. Only one is blackpilled permalink parent award report block reply SanityGumby 1 points 2 days ago I know the Constitution. You clearly do not. permalink parent award report block reply view 2 more comments... 45fan 13 points 2 days ago What a poor understanding of government. The courts do not have authority over anyone in the executive. They can make decisions as to the legality of executive action. Were the executive in egregious enough violation then Congress could take action to impeach executive office holders. But, the courts themselves have no authority to compel executive officers to take any particular action. They can issue an opinion stating that they should, or should not, to be in compliance with the law. permalink parent award report block reply Executarian2 2 points 2 days ago The courts LITERALLY have ultimate authority over the legality of Trump's actions. What are you talking about? Provide a shred of evidence to prove your side. The final step is the Supreme Court, and if they choose not to hear the case, then whatever this Court says is the ultimate law. This is not hard. It's quite literally one of the most basic understandings of the Judicial branch. permalink parent award report block reply RedStoneDeepState -2 points 2 days ago The supreme court has original jurisdiction for some cases. But this isn't one of them. permalink parent award report block reply view 4 more comments... RedStoneDeepState -3 points 2 days ago The executive is responsible for enforcing laws and the courts have a right to make rulings over laws as well as Controversies to which the United States shall be a Party. The judicial Power shall extend to all Cases, in Law and Equity, arising under this Constitution, the Laws of the United States, and Treaties made, or which shall be made, under their Authority;—to all Cases affecting Ambassadors, other public Ministers and Consuls;—to all Cases of admiralty and maritime Jurisdiction;—to Controversies to which the United States shall be a Party;—to Controversies between two or more States;—between a State and Citizens of another State,—between Citizens of different States,—between Citizens of the same State claiming Lands under Grants of different States, and between a State, or the Citizens thereof, and foreign States, Citizens or Subjects. permalink parent award report block reply GatoradeJeb 0 points 2 days ago Except if your biden then you can do what ever you want if its antiWhite or pro brown permalink parent award report block reply Trump-16-20-24-28-32 0 points 2 days ago I won't downvote you, but I will challenge you.  \"Do some basic fucking reading\" is often what people say when they can't back up what it is they are saying and are just speaking from their own understanding, right or wrong. RedStoneDeepState brilliantly quoted Article III of our US Constitution, which is a reliable source.  You could build on that though and discuss judicial review as it was argued in 1803 with Marbury vs Madison which ruled that the judicial branch has the ability to review LAWS put forth by the legislative branch as unconstitutional.  It was very specifically a check that the judicial branch ruled they had the power to do, but it was limited to the legislative branch.  Now, over the years, it's been abused and most recently has been weaponized against Trump. Next, the only court that we are compelled to have is the Supreme Court.  Did you know every other court has been created out of an act of congress?  That's right, these lower courts are all created by congress (and can be taken away by congress). So, while a court can rule that an executive action is unconstitutional, they cannot create new powers and confer them to the president, nor can they deny the president the powers he already has, nor can they relegate new powers that were normally congressional (such as the power of the purse given to the House) to another branch. permalink parent award report block reply Executarian2 -1 points 2 days ago You're trying to sound smart with Marbury v. Madison but you completely misread the case. The case was literally Marbury v. Madison. James Madison was the Secretary of State, part of the Executive Branch. The entire dispute was about whether the court could force an executive officer to do his job. While the ruling did strike down a legislative act, it simultaneously established the principle that the judiciary can review the actions of both the legislative and executive branches. The idea that judicial review doesn't apply to the President is a historical fantasy. Youngstown v. Sawyer (where the court stopped Truman from seizing steel mills) and United States v. Nixon (where the court forced Nixon to turn over the tapes) are cornerstone cases that prove the judiciary has always had the power to check the executive. Who cares if Congress created the lower courts? They exist now, and their rulings are binding federal law. The executive must follow them unless the Supreme Court says otherwise. Your entire argument is based on a fourth-grade misreading of the most famous court case in U.S. history. permalink parent award report block reply Trump-16-20-24-28-32 2 points 2 days ago You know, I come at you with good faith and your first and last comment is a personal attack against me \"trying to sound smart\" and a \"fourth-grade misreading.\"  Come on, I didn't personally attack you.  I was one of the few people trying to strike up a conversation.  Sheesh.  Now you just look like a retarded troll... and I was trying to give you a chance. I blame myself for ignoring the community heavily downvoting you.  But, we all have a lapse in judgement at times. I will still respond, not for you, but for the others on here who want better context than your oversimplification. And while some of the stuff you say is true, it's lacking substantial context and history.  You do an OK job coming up with examples of how the powers were expanded 150 years after the ruling (which honestly only help what I was saying).  You need to look deeper in to issues and stop being so narrow focused.  I know it's hard to dig in to history, there is a lot of reading. For me, the source is the case itself and the actual majority opinion written by Chief Justice John Marshal, who's main focus was directed at Congress exceeding constitutional limits.  Marshal even wrote that the court couln't compel certain discretional executive acts, specifically showing a distinction between judicial review and some acts of the executive (specifically, discretionary acts, not ministerial duties). Here is what the actual case was: Congress does not have the power to pass laws that override the Constitution, such as by expanding the scope of the Supreme Court’s original jurisdiction. It seems pretty clear what was being argued. What you have shown that over time, this judicial review has expanded more frequently to the executive branch which, in my opinion, goes against what the majority opinion was in 1803. Here are some key parts of the transcript because I highly doubt you'll take the time to read it, after all, it is a couple pages long and the summary just isn't informative enough.  Take note of explicit, clear, and direct language.  He references the legislature and the law over and over again. The conclusion from this reasoning is, that where the heads of departments are the political or confidential agents of the executive, merely to execute the will of the President, or rather to act in cases in which the executive possesses a constitutional or legal discretion, nothing can be more perfectly clear than that their acts are only politically examinable. But where a specific duty is assigned by law, and individual rights depend upon the performance of that duty, it seems equally clear, that the individual who considers himself injured, has a right to resort to the laws of his country for a remedy. . . . It is, then, the opinion of the Court [that Marbury has a] right to the commission; a refusal to deliver which is a plain violation of that right, for which the laws of his country afford him a remedy. Furthermore: If an act of the legislature, repugnant to the constitution, is void, does it, notwithstanding its invalidity, bind the courts, and oblige them to give it effect? Or, in other words, though it be not law, does it constitute a rule as operative as if it was a law? This would be to overthrow in fact what was established in theory; and would seem, at first view, an absurdity too gross to be insisted on. It shall, however, receive a more attentive consideration. Furthermore: So if a law be in opposition to the constitution; if both the law and the constitution apply to a particular case, so that the court must either decide that case conformably to the law, disregarding the constitution; or conformably to the constitution, disregarding the law; the court must determine which of these conflicting rules governs the case. This is of the very essence of judicial duty. ....  If, then, the courts are to regard the constitution, and the constitution is superior to any ordinary act of the legislature, the constitution, and not such ordinary act, must govern the case to which they both apply. Lastly: From these, and many other selections which might be made, it is apparent, that the framers of the constitution contemplated that instrument as a rule for the government of courts, as well as of the legislature. Why otherwise does it direct the judges to take an oath to support it? When you read the opinion, it very briefly discusses executive actions.  But you are explaining how judicial review was later interpreted and expanded and not what Marshall explicitly ruled in 1803. Here is the text of the case and the unanimous opinion: https://supreme.justia.com/cases/federal/us/5/137/ permalink parent award report block reply view 6 more comments... Agenda47 0 points 2 days ago YEAH I can't believe these idiots don't remember the Basic Checks and Balances clause written right beneath the Good and Plenty clause! permalink parent award report block reply load 24 more comments...\nSanityGumby 27 points 2 days ago That's objectively false. Only the Supreme Court can compel anything of the executive branch at a national level. permalink parent award report block reply FractalRoar 12 points 2 days ago Even that is a usurpation of the Executive authority vested by the Constitution. permalink parent award report block reply RedStoneDeepState -6 points 2 days ago No it is not permalink parent award report block reply Executarian2 -6 points 2 days ago It is literally not. Where the fuck are you getting these ideas from? permalink parent award report block reply Executarian2 -2 points 2 days ago Do BASIC reading, bro. The Supreme Court is simply the FINAL authority over the President, so if they decline to hear this case, then the Circuit Courts LITERALLY have authority over Trump in this case. permalink parent award report block reply RedStoneDeepState -2 points 2 days ago The supreme court has original jurisdiction for some cases. But this isn't one of them. permalink parent award report block reply HoganT -2 points 2 days ago This is so false that you should be banned from being able to speak in public. permalink parent award report block reply RedStoneDeepState -3 points 2 days ago That is just wrong. The constitution is very clear here. The supreme court only has original jurisdiction of the case is about a ambassador, public minister/consul, or if a state is a party. Not if the executive branch is involved. In all Cases affecting Ambassadors, other public Ministers and Consuls, and those in which a State shall be Party, the supreme Court shall have original Jurisdiction. permalink parent award report block reply Unboosted 1 points 2 days ago I think you guys are talking about the same thing. Only one is blackpilled permalink parent award report block reply SanityGumby 1 points 2 days ago I know the Constitution. You clearly do not. permalink parent award report block reply view 2 more comments...\nFractalRoar 12 points 2 days ago Even that is a usurpation of the Executive authority vested by the Constitution. permalink parent award report block reply RedStoneDeepState -6 points 2 days ago No it is not permalink parent award report block reply Executarian2 -6 points 2 days ago It is literally not. Where the fuck are you getting these ideas from? permalink parent award report block reply\nRedStoneDeepState -6 points 2 days ago No it is not permalink parent award report block reply\nExecutarian2 -6 points 2 days ago It is literally not. Where the fuck are you getting these ideas from? permalink parent award report block reply\nExecutarian2 -2 points 2 days ago Do BASIC reading, bro. The Supreme Court is simply the FINAL authority over the President, so if they decline to hear this case, then the Circuit Courts LITERALLY have authority over Trump in this case. permalink parent award report block reply RedStoneDeepState -2 points 2 days ago The supreme court has original jurisdiction for some cases. But this isn't one of them. permalink parent award report block reply\nRedStoneDeepState -2 points 2 days ago The supreme court has original jurisdiction for some cases. But this isn't one of them. permalink parent award report block reply\nHoganT -2 points 2 days ago This is so false that you should be banned from being able to speak in public. permalink parent award report block reply\nRedStoneDeepState -3 points 2 days ago That is just wrong. The constitution is very clear here. The supreme court only has original jurisdiction of the case is about a ambassador, public minister/consul, or if a state is a party. Not if the executive branch is involved. In all Cases affecting Ambassadors, other public Ministers and Consuls, and those in which a State shall be Party, the supreme Court shall have original Jurisdiction. permalink parent award report block reply Unboosted 1 points 2 days ago I think you guys are talking about the same thing. Only one is blackpilled permalink parent award report block reply SanityGumby 1 points 2 days ago I know the Constitution. You clearly do not. permalink parent award report block reply view 2 more comments...\nUnboosted 1 points 2 days ago I think you guys are talking about the same thing. Only one is blackpilled permalink parent award report block reply\nSanityGumby 1 points 2 days ago I know the Constitution. You clearly do not. permalink parent award report block reply view 2 more comments...\n45fan 13 points 2 days ago What a poor understanding of government. The courts do not have authority over anyone in the executive. They can make decisions as to the legality of executive action. Were the executive in egregious enough violation then Congress could take action to impeach executive office holders. But, the courts themselves have no authority to compel executive officers to take any particular action. They can issue an opinion stating that they should, or should not, to be in compliance with the law. permalink parent award report block reply Executarian2 2 points 2 days ago The courts LITERALLY have ultimate authority over the legality of Trump's actions. What are you talking about? Provide a shred of evidence to prove your side. The final step is the Supreme Court, and if they choose not to hear the case, then whatever this Court says is the ultimate law. This is not hard. It's quite literally one of the most basic understandings of the Judicial branch. permalink parent award report block reply RedStoneDeepState -2 points 2 days ago The supreme court has original jurisdiction for some cases. But this isn't one of them. permalink parent award report block reply view 4 more comments... RedStoneDeepState -3 points 2 days ago The executive is responsible for enforcing laws and the courts have a right to make rulings over laws as well as Controversies to which the United States shall be a Party. The judicial Power shall extend to all Cases, in Law and Equity, arising under this Constitution, the Laws of the United States, and Treaties made, or which shall be made, under their Authority;—to all Cases affecting Ambassadors, other public Ministers and Consuls;—to all Cases of admiralty and maritime Jurisdiction;—to Controversies to which the United States shall be a Party;—to Controversies between two or more States;—between a State and Citizens of another State,—between Citizens of different States,—between Citizens of the same State claiming Lands under Grants of different States, and between a State, or the Citizens thereof, and foreign States, Citizens or Subjects. permalink parent award report block reply\nExecutarian2 2 points 2 days ago The courts LITERALLY have ultimate authority over the legality of Trump's actions. What are you talking about? Provide a shred of evidence to prove your side. The final step is the Supreme Court, and if they choose not to hear the case, then whatever this Court says is the ultimate law. This is not hard. It's quite literally one of the most basic understandings of the Judicial branch. permalink parent award report block reply RedStoneDeepState -2 points 2 days ago The supreme court has original jurisdiction for some cases. But this isn't one of them. permalink parent award report block reply view 4 more comments...\nRedStoneDeepState -2 points 2 days ago The supreme court has original jurisdiction for some cases. But this isn't one of them. permalink parent award report block reply view 4 more comments...\nRedStoneDeepState -3 points 2 days ago The executive is responsible for enforcing laws and the courts have a right to make rulings over laws as well as Controversies to which the United States shall be a Party. The judicial Power shall extend to all Cases, in Law and Equity, arising under this Constitution, the Laws of the United States, and Treaties made, or which shall be made, under their Authority;—to all Cases affecting Ambassadors, other public Ministers and Consuls;—to all Cases of admiralty and maritime Jurisdiction;—to Controversies to which the United States shall be a Party;—to Controversies between two or more States;—between a State and Citizens of another State,—between Citizens of different States,—between Citizens of the same State claiming Lands under Grants of different States, and between a State, or the Citizens thereof, and foreign States, Citizens or Subjects. permalink parent award report block reply\nGatoradeJeb 0 points 2 days ago Except if your biden then you can do what ever you want if its antiWhite or pro brown permalink parent award report block reply\nTrump-16-20-24-28-32 0 points 2 days ago I won't downvote you, but I will challenge you.  \"Do some basic fucking reading\" is often what people say when they can't back up what it is they are saying and are just speaking from their own understanding, right or wrong. RedStoneDeepState brilliantly quoted Article III of our US Constitution, which is a reliable source.  You could build on that though and discuss judicial review as it was argued in 1803 with Marbury vs Madison which ruled that the judicial branch has the ability to review LAWS put forth by the legislative branch as unconstitutional.  It was very specifically a check that the judicial branch ruled they had the power to do, but it was limited to the legislative branch.  Now, over the years, it's been abused and most recently has been weaponized against Trump. Next, the only court that we are compelled to have is the Supreme Court.  Did you know every other court has been created out of an act of congress?  That's right, these lower courts are all created by congress (and can be taken away by congress). So, while a court can rule that an executive action is unconstitutional, they cannot create new powers and confer them to the president, nor can they deny the president the powers he already has, nor can they relegate new powers that were normally congressional (such as the power of the purse given to the House) to another branch. permalink parent award report block reply Executarian2 -1 points 2 days ago You're trying to sound smart with Marbury v. Madison but you completely misread the case. The case was literally Marbury v. Madison. James Madison was the Secretary of State, part of the Executive Branch. The entire dispute was about whether the court could force an executive officer to do his job. While the ruling did strike down a legislative act, it simultaneously established the principle that the judiciary can review the actions of both the legislative and executive branches. The idea that judicial review doesn't apply to the President is a historical fantasy. Youngstown v. Sawyer (where the court stopped Truman from seizing steel mills) and United States v. Nixon (where the court forced Nixon to turn over the tapes) are cornerstone cases that prove the judiciary has always had the power to check the executive. Who cares if Congress created the lower courts? They exist now, and their rulings are binding federal law. The executive must follow them unless the Supreme Court says otherwise. Your entire argument is based on a fourth-grade misreading of the most famous court case in U.S. history. permalink parent award report block reply Trump-16-20-24-28-32 2 points 2 days ago You know, I come at you with good faith and your first and last comment is a personal attack against me \"trying to sound smart\" and a \"fourth-grade misreading.\"  Come on, I didn't personally attack you.  I was one of the few people trying to strike up a conversation.  Sheesh.  Now you just look like a retarded troll... and I was trying to give you a chance. I blame myself for ignoring the community heavily downvoting you.  But, we all have a lapse in judgement at times. I will still respond, not for you, but for the others on here who want better context than your oversimplification. And while some of the stuff you say is true, it's lacking substantial context and history.  You do an OK job coming up with examples of how the powers were expanded 150 years after the ruling (which honestly only help what I was saying).  You need to look deeper in to issues and stop being so narrow focused.  I know it's hard to dig in to history, there is a lot of reading. For me, the source is the case itself and the actual majority opinion written by Chief Justice John Marshal, who's main focus was directed at Congress exceeding constitutional limits.  Marshal even wrote that the court couln't compel certain discretional executive acts, specifically showing a distinction between judicial review and some acts of the executive (specifically, discretionary acts, not ministerial duties). Here is what the actual case was: Congress does not have the power to pass laws that override the Constitution, such as by expanding the scope of the Supreme Court’s original jurisdiction. It seems pretty clear what was being argued. What you have shown that over time, this judicial review has expanded more frequently to the executive branch which, in my opinion, goes against what the majority opinion was in 1803. Here are some key parts of the transcript because I highly doubt you'll take the time to read it, after all, it is a couple pages long and the summary just isn't informative enough.  Take note of explicit, clear, and direct language.  He references the legislature and the law over and over again. The conclusion from this reasoning is, that where the heads of departments are the political or confidential agents of the executive, merely to execute the will of the President, or rather to act in cases in which the executive possesses a constitutional or legal discretion, nothing can be more perfectly clear than that their acts are only politically examinable. But where a specific duty is assigned by law, and individual rights depend upon the performance of that duty, it seems equally clear, that the individual who considers himself injured, has a right to resort to the laws of his country for a remedy. . . . It is, then, the opinion of the Court [that Marbury has a] right to the commission; a refusal to deliver which is a plain violation of that right, for which the laws of his country afford him a remedy. Furthermore: If an act of the legislature, repugnant to the constitution, is void, does it, notwithstanding its invalidity, bind the courts, and oblige them to give it effect? Or, in other words, though it be not law, does it constitute a rule as operative as if it was a law? This would be to overthrow in fact what was established in theory; and would seem, at first view, an absurdity too gross to be insisted on. It shall, however, receive a more attentive consideration. Furthermore: So if a law be in opposition to the constitution; if both the law and the constitution apply to a particular case, so that the court must either decide that case conformably to the law, disregarding the constitution; or conformably to the constitution, disregarding the law; the court must determine which of these conflicting rules governs the case. This is of the very essence of judicial duty. ....  If, then, the courts are to regard the constitution, and the constitution is superior to any ordinary act of the legislature, the constitution, and not such ordinary act, must govern the case to which they both apply. Lastly: From these, and many other selections which might be made, it is apparent, that the framers of the constitution contemplated that instrument as a rule for the government of courts, as well as of the legislature. Why otherwise does it direct the judges to take an oath to support it? When you read the opinion, it very briefly discusses executive actions.  But you are explaining how judicial review was later interpreted and expanded and not what Marshall explicitly ruled in 1803. Here is the text of the case and the unanimous opinion: https://supreme.justia.com/cases/federal/us/5/137/ permalink parent award report block reply view 6 more comments...\nExecutarian2 -1 points 2 days ago You're trying to sound smart with Marbury v. Madison but you completely misread the case. The case was literally Marbury v. Madison. James Madison was the Secretary of State, part of the Executive Branch. The entire dispute was about whether the court could force an executive officer to do his job. While the ruling did strike down a legislative act, it simultaneously established the principle that the judiciary can review the actions of both the legislative and executive branches. The idea that judicial review doesn't apply to the President is a historical fantasy. Youngstown v. Sawyer (where the court stopped Truman from seizing steel mills) and United States v. Nixon (where the court forced Nixon to turn over the tapes) are cornerstone cases that prove the judiciary has always had the power to check the executive. Who cares if Congress created the lower courts? They exist now, and their rulings are binding federal law. The executive must follow them unless the Supreme Court says otherwise. Your entire argument is based on a fourth-grade misreading of the most famous court case in U.S. history. permalink parent award report block reply Trump-16-20-24-28-32 2 points 2 days ago You know, I come at you with good faith and your first and last comment is a personal attack against me \"trying to sound smart\" and a \"fourth-grade misreading.\"  Come on, I didn't personally attack you.  I was one of the few people trying to strike up a conversation.  Sheesh.  Now you just look like a retarded troll... and I was trying to give you a chance. I blame myself for ignoring the community heavily downvoting you.  But, we all have a lapse in judgement at times. I will still respond, not for you, but for the others on here who want better context than your oversimplification. And while some of the stuff you say is true, it's lacking substantial context and history.  You do an OK job coming up with examples of how the powers were expanded 150 years after the ruling (which honestly only help what I was saying).  You need to look deeper in to issues and stop being so narrow focused.  I know it's hard to dig in to history, there is a lot of reading. For me, the source is the case itself and the actual majority opinion written by Chief Justice John Marshal, who's main focus was directed at Congress exceeding constitutional limits.  Marshal even wrote that the court couln't compel certain discretional executive acts, specifically showing a distinction between judicial review and some acts of the executive (specifically, discretionary acts, not ministerial duties). Here is what the actual case was: Congress does not have the power to pass laws that override the Constitution, such as by expanding the scope of the Supreme Court’s original jurisdiction. It seems pretty clear what was being argued. What you have shown that over time, this judicial review has expanded more frequently to the executive branch which, in my opinion, goes against what the majority opinion was in 1803. Here are some key parts of the transcript because I highly doubt you'll take the time to read it, after all, it is a couple pages long and the summary just isn't informative enough.  Take note of explicit, clear, and direct language.  He references the legislature and the law over and over again. The conclusion from this reasoning is, that where the heads of departments are the political or confidential agents of the executive, merely to execute the will of the President, or rather to act in cases in which the executive possesses a constitutional or legal discretion, nothing can be more perfectly clear than that their acts are only politically examinable. But where a specific duty is assigned by law, and individual rights depend upon the performance of that duty, it seems equally clear, that the individual who considers himself injured, has a right to resort to the laws of his country for a remedy. . . . It is, then, the opinion of the Court [that Marbury has a] right to the commission; a refusal to deliver which is a plain violation of that right, for which the laws of his country afford him a remedy. Furthermore: If an act of the legislature, repugnant to the constitution, is void, does it, notwithstanding its invalidity, bind the courts, and oblige them to give it effect? Or, in other words, though it be not law, does it constitute a rule as operative as if it was a law? This would be to overthrow in fact what was established in theory; and would seem, at first view, an absurdity too gross to be insisted on. It shall, however, receive a more attentive consideration. Furthermore: So if a law be in opposition to the constitution; if both the law and the constitution apply to a particular case, so that the court must either decide that case conformably to the law, disregarding the constitution; or conformably to the constitution, disregarding the law; the court must determine which of these conflicting rules governs the case. This is of the very essence of judicial duty. ....  If, then, the courts are to regard the constitution, and the constitution is superior to any ordinary act of the legislature, the constitution, and not such ordinary act, must govern the case to which they both apply. Lastly: From these, and many other selections which might be made, it is apparent, that the framers of the constitution contemplated that instrument as a rule for the government of courts, as well as of the legislature. Why otherwise does it direct the judges to take an oath to support it? When you read the opinion, it very briefly discusses executive actions.  But you are explaining how judicial review was later interpreted and expanded and not what Marshall explicitly ruled in 1803. Here is the text of the case and the unanimous opinion: https://supreme.justia.com/cases/federal/us/5/137/ permalink parent award report block reply view 6 more comments...\nTrump-16-20-24-28-32 2 points 2 days ago You know, I come at you with good faith and your first and last comment is a personal attack against me \"trying to sound smart\" and a \"fourth-grade misreading.\"  Come on, I didn't personally attack you.  I was one of the few people trying to strike up a conversation.  Sheesh.  Now you just look like a retarded troll... and I was trying to give you a chance. I blame myself for ignoring the community heavily downvoting you.  But, we all have a lapse in judgement at times. I will still respond, not for you, but for the others on here who want better context than your oversimplification. And while some of the stuff you say is true, it's lacking substantial context and history.  You do an OK job coming up with examples of how the powers were expanded 150 years after the ruling (which honestly only help what I was saying).  You need to look deeper in to issues and stop being so narrow focused.  I know it's hard to dig in to history, there is a lot of reading. For me, the source is the case itself and the actual majority opinion written by Chief Justice John Marshal, who's main focus was directed at Congress exceeding constitutional limits.  Marshal even wrote that the court couln't compel certain discretional executive acts, specifically showing a distinction between judicial review and some acts of the executive (specifically, discretionary acts, not ministerial duties). Here is what the actual case was: Congress does not have the power to pass laws that override the Constitution, such as by expanding the scope of the Supreme Court’s original jurisdiction. It seems pretty clear what was being argued. What you have shown that over time, this judicial review has expanded more frequently to the executive branch which, in my opinion, goes against what the majority opinion was in 1803. Here are some key parts of the transcript because I highly doubt you'll take the time to read it, after all, it is a couple pages long and the summary just isn't informative enough.  Take note of explicit, clear, and direct language.  He references the legislature and the law over and over again. The conclusion from this reasoning is, that where the heads of departments are the political or confidential agents of the executive, merely to execute the will of the President, or rather to act in cases in which the executive possesses a constitutional or legal discretion, nothing can be more perfectly clear than that their acts are only politically examinable. But where a specific duty is assigned by law, and individual rights depend upon the performance of that duty, it seems equally clear, that the individual who considers himself injured, has a right to resort to the laws of his country for a remedy. . . . It is, then, the opinion of the Court [that Marbury has a] right to the commission; a refusal to deliver which is a plain violation of that right, for which the laws of his country afford him a remedy. Furthermore: If an act of the legislature, repugnant to the constitution, is void, does it, notwithstanding its invalidity, bind the courts, and oblige them to give it effect? Or, in other words, though it be not law, does it constitute a rule as operative as if it was a law? This would be to overthrow in fact what was established in theory; and would seem, at first view, an absurdity too gross to be insisted on. It shall, however, receive a more attentive consideration. Furthermore: So if a law be in opposition to the constitution; if both the law and the constitution apply to a particular case, so that the court must either decide that case conformably to the law, disregarding the constitution; or conformably to the constitution, disregarding the law; the court must determine which of these conflicting rules governs the case. This is of the very essence of judicial duty. ....  If, then, the courts are to regard the constitution, and the constitution is superior to any ordinary act of the legislature, the constitution, and not such ordinary act, must govern the case to which they both apply. Lastly: From these, and many other selections which might be made, it is apparent, that the framers of the constitution contemplated that instrument as a rule for the government of courts, as well as of the legislature. Why otherwise does it direct the judges to take an oath to support it? When you read the opinion, it very briefly discusses executive actions.  But you are explaining how judicial review was later interpreted and expanded and not what Marshall explicitly ruled in 1803. Here is the text of the case and the unanimous opinion: https://supreme.justia.com/cases/federal/us/5/137/ permalink parent award report block reply view 6 more comments...\nAgenda47 0 points 2 days ago YEAH I can't believe these idiots don't remember the Basic Checks and Balances clause written right beneath the Good and Plenty clause! permalink parent award report block reply\npreferredfault 34 points 2 days ago It's a pointless ruling. The fact is, you can't force the Executive branch to fund something that congress has not voted to fund. It's as simple as that. Food stamps are no different than any other government program. Just because a program is administered under a specific agency, doesn't mean any money that agency has can go to anything that agency oversees. Congress passed food stamps as a program a long time ago. It's on them to fund it. If they don't vote to fund it, then the program effectively ceases to exist, at least for the time being. permalink award report block reply Beat_to_Quarters 6 points 2 days ago Sounds like liberals and the appeals court want Trump to act like a king lol. Feed the people, m'lord! permalink parent award report block reply Unboosted 1 points 2 days ago The real fact is democrats can and will do what they want and repubs wont. permalink parent award report block reply Executarian2 -10 points 2 days ago Whether or not you like it, it’s not a pointless ruling. If an appeals court says you must fund it, then Trump must fund it. He can appeal to the Supreme Court and they’ll make their decision, and if they say Trump must fund it, then he MUST FUND IT. permalink parent award report block reply preferredfault 11 points 2 days ago That's not true though. Our system of government doesn't work like that. Congress has the purse strings. Funds made available for a specific program, can only be legally used for that program. To force the Executive branch to fund anything is a violation of the separation of powers, because it forces the Executive to take on the role of congress by bypassing congress. Funny how there was a no kings protest, and then suddenly courts are ordering Trump to act like a king. If Trump can use disaster relief funds to pay for food stamps, then he can also use food stamp funds to build the wall, or for anything else he'd like. It'd be a terrible precedent that effectively nullifies congress in practice, for all of time. Why do we even need congress if courts can order Trump to pull money out of thin air? Why do we even need courts if Trump can pull money out of thin air? See the problem. permalink parent award report block reply Awan-CIA-Car-Lot 2 points 2 days ago I'm hearing that the shutdown could be over within the next hour.  Wouldn't that make this illegal ruling inconsequential? permalink parent award report block reply tw0scoops 1 points 2 days ago Seems to me the courts are acting like a 1000 little kings. . permalink parent award report block reply zooty 2 points 2 days ago Petit tyrans. permalink parent award report block reply Executarian2 1 points 2 days ago Okay, once again, the Appeals Courts and the Supreme Court decide what is legal and what is not. The specifics of the ruling don't say that he's compelled to pay for SNAP, but that he's compelled to NOT WITHHOLD SNAP during the shutdown. You don't get to argue with this, because it's not a matter of opinion. The only step now is the Supreme Court. If they rule against him, then that's it. He MUST pay. permalink parent award report block reply preferredfault 1 points 2 days ago Trump isn't withholding SNAP, there's no funds appropriated for it. You can't withhold $0. They can't order him to pay funds that aren't there. I mean they can, but they can't enforce it. It's on congress to fund it. Congress not funding something is as good as defunding something, and such things have happened plenty of times. Let's say for example congress doesn't fund the FBI.....does Trump have to keep the FBI open? No. Does he have to take funds from some other program to fund it? No. Not unless congress votes to say he does. This is nothing more than political games; congress trying to use the courts to force Trump to do the duty that congress is tasked with. It would be a violation of separation of powers for Trump to comply, and the courts are violating separation of powers by trying to force Trump to comply, and congress is violating the separation of powers by trying to use the courts to force Trump to comply. permalink parent award report block reply view 2 more comments... KernalMustard 1 points 2 days ago Shut down is ovee permalink parent award report block reply view 1 more comments... LauriThorne 4 points 2 days ago You're just making shit up at this point. People cannot be legally compelled to do something otherwise illegal by a court. This is a nonsense ruling designed to make Trump look bad when he doesnt comply because it is against the law for him to do so without Congressional approval you dunce. permalink parent award report block reply Executarian2 0 points 2 days ago The Courts decide what's legal, what the fuck are you talking about? If the Supreme Court, or an Appeals Court, says that what Trump does is illegal, then it is literally automatically illegal. They interpret the law. If you have any evidence to the contrary, please provide it. permalink parent award report block reply zooty 1 points 2 days ago The story of King Cnut comes to mind. Though with a slightly different spelling for these judges. permalink parent award report block reply view 4 more comments... LauriThorne 0 points 2 days ago Judges don't get to just ignore laws, especially when the case they're presiding over isnt calling said law into question. The question before the court was can the executive withhold funds appropriated by Congress for a program, the answer is no. However, the question should be can the executive appropriate funds without congressional approval which is no . In order to \"comply\" with this ruling the Trump administration would have to violate the Constitution and appropriate funds without congressional approval, which they cannot do. The court knows they cannot do this, and, since theyre left wing activists at heart, are banking on people misunderstanding the entire proceeding and getting mad at Trump for ViOlAtInG a CoUrT OrDeR and DeStRoYiNg ChEcKs aNd BaLaNcEs because they, like you, have a very surface level understanding of how this all works. permalink parent award report block reply view 2 more comments... Paperwork35 3 points 2 days ago No. permalink parent award report block reply tw0scoops 2 points 2 days ago Ridiculous argument.  Just bc a judge says it, doesnt make the impossible possible or the illegal legal. Its not as simple as unfreezing funds that the program already has. It would require new funding or moving $$ assigned somewhere else. Blood from a stone. Man can be a woman. All that nonsense. permalink parent award report block reply Executarian2 1 points 2 days ago This isn't \"a judge,\" it's literally one of the highest courts in the country. They are ruling that Trump may not WITHHOLD SNAP, not that he has to arbitrarily shell out $4 billion. The courts obviously consider these things; they aren't just pointing at Trump and telling him that he has to pay $4 billion for no reason. If the Supreme Court tells him he has to fund SNAP, he MUST. He is legally REQUIRED to. This isn't an argument. It's not a matter of opinion. It's a fact. permalink parent award report block reply\nBeat_to_Quarters 6 points 2 days ago Sounds like liberals and the appeals court want Trump to act like a king lol. Feed the people, m'lord! permalink parent award report block reply\nUnboosted 1 points 2 days ago The real fact is democrats can and will do what they want and repubs wont. permalink parent award report block reply\nExecutarian2 -10 points 2 days ago Whether or not you like it, it’s not a pointless ruling. If an appeals court says you must fund it, then Trump must fund it. He can appeal to the Supreme Court and they’ll make their decision, and if they say Trump must fund it, then he MUST FUND IT. permalink parent award report block reply preferredfault 11 points 2 days ago That's not true though. Our system of government doesn't work like that. Congress has the purse strings. Funds made available for a specific program, can only be legally used for that program. To force the Executive branch to fund anything is a violation of the separation of powers, because it forces the Executive to take on the role of congress by bypassing congress. Funny how there was a no kings protest, and then suddenly courts are ordering Trump to act like a king. If Trump can use disaster relief funds to pay for food stamps, then he can also use food stamp funds to build the wall, or for anything else he'd like. It'd be a terrible precedent that effectively nullifies congress in practice, for all of time. Why do we even need congress if courts can order Trump to pull money out of thin air? Why do we even need courts if Trump can pull money out of thin air? See the problem. permalink parent award report block reply Awan-CIA-Car-Lot 2 points 2 days ago I'm hearing that the shutdown could be over within the next hour.  Wouldn't that make this illegal ruling inconsequential? permalink parent award report block reply tw0scoops 1 points 2 days ago Seems to me the courts are acting like a 1000 little kings. . permalink parent award report block reply zooty 2 points 2 days ago Petit tyrans. permalink parent award report block reply Executarian2 1 points 2 days ago Okay, once again, the Appeals Courts and the Supreme Court decide what is legal and what is not. The specifics of the ruling don't say that he's compelled to pay for SNAP, but that he's compelled to NOT WITHHOLD SNAP during the shutdown. You don't get to argue with this, because it's not a matter of opinion. The only step now is the Supreme Court. If they rule against him, then that's it. He MUST pay. permalink parent award report block reply preferredfault 1 points 2 days ago Trump isn't withholding SNAP, there's no funds appropriated for it. You can't withhold $0. They can't order him to pay funds that aren't there. I mean they can, but they can't enforce it. It's on congress to fund it. Congress not funding something is as good as defunding something, and such things have happened plenty of times. Let's say for example congress doesn't fund the FBI.....does Trump have to keep the FBI open? No. Does he have to take funds from some other program to fund it? No. Not unless congress votes to say he does. This is nothing more than political games; congress trying to use the courts to force Trump to do the duty that congress is tasked with. It would be a violation of separation of powers for Trump to comply, and the courts are violating separation of powers by trying to force Trump to comply, and congress is violating the separation of powers by trying to use the courts to force Trump to comply. permalink parent award report block reply view 2 more comments... KernalMustard 1 points 2 days ago Shut down is ovee permalink parent award report block reply view 1 more comments... LauriThorne 4 points 2 days ago You're just making shit up at this point. People cannot be legally compelled to do something otherwise illegal by a court. This is a nonsense ruling designed to make Trump look bad when he doesnt comply because it is against the law for him to do so without Congressional approval you dunce. permalink parent award report block reply Executarian2 0 points 2 days ago The Courts decide what's legal, what the fuck are you talking about? If the Supreme Court, or an Appeals Court, says that what Trump does is illegal, then it is literally automatically illegal. They interpret the law. If you have any evidence to the contrary, please provide it. permalink parent award report block reply zooty 1 points 2 days ago The story of King Cnut comes to mind. Though with a slightly different spelling for these judges. permalink parent award report block reply view 4 more comments... LauriThorne 0 points 2 days ago Judges don't get to just ignore laws, especially when the case they're presiding over isnt calling said law into question. The question before the court was can the executive withhold funds appropriated by Congress for a program, the answer is no. However, the question should be can the executive appropriate funds without congressional approval which is no . In order to \"comply\" with this ruling the Trump administration would have to violate the Constitution and appropriate funds without congressional approval, which they cannot do. The court knows they cannot do this, and, since theyre left wing activists at heart, are banking on people misunderstanding the entire proceeding and getting mad at Trump for ViOlAtInG a CoUrT OrDeR and DeStRoYiNg ChEcKs aNd BaLaNcEs because they, like you, have a very surface level understanding of how this all works. permalink parent award report block reply view 2 more comments... Paperwork35 3 points 2 days ago No. permalink parent award report block reply tw0scoops 2 points 2 days ago Ridiculous argument.  Just bc a judge says it, doesnt make the impossible possible or the illegal legal. Its not as simple as unfreezing funds that the program already has. It would require new funding or moving $$ assigned somewhere else. Blood from a stone. Man can be a woman. All that nonsense. permalink parent award report block reply Executarian2 1 points 2 days ago This isn't \"a judge,\" it's literally one of the highest courts in the country. They are ruling that Trump may not WITHHOLD SNAP, not that he has to arbitrarily shell out $4 billion. The courts obviously consider these things; they aren't just pointing at Trump and telling him that he has to pay $4 billion for no reason. If the Supreme Court tells him he has to fund SNAP, he MUST. He is legally REQUIRED to. This isn't an argument. It's not a matter of opinion. It's a fact. permalink parent award report block reply\npreferredfault 11 points 2 days ago That's not true though. Our system of government doesn't work like that. Congress has the purse strings. Funds made available for a specific program, can only be legally used for that program. To force the Executive branch to fund anything is a violation of the separation of powers, because it forces the Executive to take on the role of congress by bypassing congress. Funny how there was a no kings protest, and then suddenly courts are ordering Trump to act like a king. If Trump can use disaster relief funds to pay for food stamps, then he can also use food stamp funds to build the wall, or for anything else he'd like. It'd be a terrible precedent that effectively nullifies congress in practice, for all of time. Why do we even need congress if courts can order Trump to pull money out of thin air? Why do we even need courts if Trump can pull money out of thin air? See the problem. permalink parent award report block reply Awan-CIA-Car-Lot 2 points 2 days ago I'm hearing that the shutdown could be over within the next hour.  Wouldn't that make this illegal ruling inconsequential? permalink parent award report block reply tw0scoops 1 points 2 days ago Seems to me the courts are acting like a 1000 little kings. . permalink parent award report block reply zooty 2 points 2 days ago Petit tyrans. permalink parent award report block reply Executarian2 1 points 2 days ago Okay, once again, the Appeals Courts and the Supreme Court decide what is legal and what is not. The specifics of the ruling don't say that he's compelled to pay for SNAP, but that he's compelled to NOT WITHHOLD SNAP during the shutdown. You don't get to argue with this, because it's not a matter of opinion. The only step now is the Supreme Court. If they rule against him, then that's it. He MUST pay. permalink parent award report block reply preferredfault 1 points 2 days ago Trump isn't withholding SNAP, there's no funds appropriated for it. You can't withhold $0. They can't order him to pay funds that aren't there. I mean they can, but they can't enforce it. It's on congress to fund it. Congress not funding something is as good as defunding something, and such things have happened plenty of times. Let's say for example congress doesn't fund the FBI.....does Trump have to keep the FBI open? No. Does he have to take funds from some other program to fund it? No. Not unless congress votes to say he does. This is nothing more than political games; congress trying to use the courts to force Trump to do the duty that congress is tasked with. It would be a violation of separation of powers for Trump to comply, and the courts are violating separation of powers by trying to force Trump to comply, and congress is violating the separation of powers by trying to use the courts to force Trump to comply. permalink parent award report block reply view 2 more comments... KernalMustard 1 points 2 days ago Shut down is ovee permalink parent award report block reply view 1 more comments...\nAwan-CIA-Car-Lot 2 points 2 days ago I'm hearing that the shutdown could be over within the next hour.  Wouldn't that make this illegal ruling inconsequential? permalink parent award report block reply\ntw0scoops 1 points 2 days ago Seems to me the courts are acting like a 1000 little kings. . permalink parent award report block reply zooty 2 points 2 days ago Petit tyrans. permalink parent award report block reply\nzooty 2 points 2 days ago Petit tyrans. permalink parent award report block reply\nExecutarian2 1 points 2 days ago Okay, once again, the Appeals Courts and the Supreme Court decide what is legal and what is not. The specifics of the ruling don't say that he's compelled to pay for SNAP, but that he's compelled to NOT WITHHOLD SNAP during the shutdown. You don't get to argue with this, because it's not a matter of opinion. The only step now is the Supreme Court. If they rule against him, then that's it. He MUST pay. permalink parent award report block reply preferredfault 1 points 2 days ago Trump isn't withholding SNAP, there's no funds appropriated for it. You can't withhold $0. They can't order him to pay funds that aren't there. I mean they can, but they can't enforce it. It's on congress to fund it. Congress not funding something is as good as defunding something, and such things have happened plenty of times. Let's say for example congress doesn't fund the FBI.....does Trump have to keep the FBI open? No. Does he have to take funds from some other program to fund it? No. Not unless congress votes to say he does. This is nothing more than political games; congress trying to use the courts to force Trump to do the duty that congress is tasked with. It would be a violation of separation of powers for Trump to comply, and the courts are violating separation of powers by trying to force Trump to comply, and congress is violating the separation of powers by trying to use the courts to force Trump to comply. permalink parent award report block reply view 2 more comments... KernalMustard 1 points 2 days ago Shut down is ovee permalink parent award report block reply view 1 more comments...\npreferredfault 1 points 2 days ago Trump isn't withholding SNAP, there's no funds appropriated for it. You can't withhold $0. They can't order him to pay funds that aren't there. I mean they can, but they can't enforce it. It's on congress to fund it. Congress not funding something is as good as defunding something, and such things have happened plenty of times. Let's say for example congress doesn't fund the FBI.....does Trump have to keep the FBI open? No. Does he have to take funds from some other program to fund it? No. Not unless congress votes to say he does. This is nothing more than political games; congress trying to use the courts to force Trump to do the duty that congress is tasked with. It would be a violation of separation of powers for Trump to comply, and the courts are violating separation of powers by trying to force Trump to comply, and congress is violating the separation of powers by trying to use the courts to force Trump to comply. permalink parent award report block reply view 2 more comments...\nKernalMustard 1 points 2 days ago Shut down is ovee permalink parent award report block reply view 1 more comments...\nLauriThorne 4 points 2 days ago You're just making shit up at this point. People cannot be legally compelled to do something otherwise illegal by a court. This is a nonsense ruling designed to make Trump look bad when he doesnt comply because it is against the law for him to do so without Congressional approval you dunce. permalink parent award report block reply Executarian2 0 points 2 days ago The Courts decide what's legal, what the fuck are you talking about? If the Supreme Court, or an Appeals Court, says that what Trump does is illegal, then it is literally automatically illegal. They interpret the law. If you have any evidence to the contrary, please provide it. permalink parent award report block reply zooty 1 points 2 days ago The story of King Cnut comes to mind. Though with a slightly different spelling for these judges. permalink parent award report block reply view 4 more comments... LauriThorne 0 points 2 days ago Judges don't get to just ignore laws, especially when the case they're presiding over isnt calling said law into question. The question before the court was can the executive withhold funds appropriated by Congress for a program, the answer is no. However, the question should be can the executive appropriate funds without congressional approval which is no . In order to \"comply\" with this ruling the Trump administration would have to violate the Constitution and appropriate funds without congressional approval, which they cannot do. The court knows they cannot do this, and, since theyre left wing activists at heart, are banking on people misunderstanding the entire proceeding and getting mad at Trump for ViOlAtInG a CoUrT OrDeR and DeStRoYiNg ChEcKs aNd BaLaNcEs because they, like you, have a very surface level understanding of how this all works. permalink parent award report block reply view 2 more comments...\nExecutarian2 0 points 2 days ago The Courts decide what's legal, what the fuck are you talking about? If the Supreme Court, or an Appeals Court, says that what Trump does is illegal, then it is literally automatically illegal. They interpret the law. If you have any evidence to the contrary, please provide it. permalink parent award report block reply zooty 1 points 2 days ago The story of King Cnut comes to mind. Though with a slightly different spelling for these judges. permalink parent award report block reply view 4 more comments... LauriThorne 0 points 2 days ago Judges don't get to just ignore laws, especially when the case they're presiding over isnt calling said law into question. The question before the court was can the executive withhold funds appropriated by Congress for a program, the answer is no. However, the question should be can the executive appropriate funds without congressional approval which is no . In order to \"comply\" with this ruling the Trump administration would have to violate the Constitution and appropriate funds without congressional approval, which they cannot do. The court knows they cannot do this, and, since theyre left wing activists at heart, are banking on people misunderstanding the entire proceeding and getting mad at Trump for ViOlAtInG a CoUrT OrDeR and DeStRoYiNg ChEcKs aNd BaLaNcEs because they, like you, have a very surface level understanding of how this all works. permalink parent award report block reply view 2 more comments...\nzooty 1 points 2 days ago The story of King Cnut comes to mind. Though with a slightly different spelling for these judges. permalink parent award report block reply view 4 more comments...\nLauriThorne 0 points 2 days ago Judges don't get to just ignore laws, especially when the case they're presiding over isnt calling said law into question. The question before the court was can the executive withhold funds appropriated by Congress for a program, the answer is no. However, the question should be can the executive appropriate funds without congressional approval which is no . In order to \"comply\" with this ruling the Trump administration would have to violate the Constitution and appropriate funds without congressional approval, which they cannot do. The court knows they cannot do this, and, since theyre left wing activists at heart, are banking on people misunderstanding the entire proceeding and getting mad at Trump for ViOlAtInG a CoUrT OrDeR and DeStRoYiNg ChEcKs aNd BaLaNcEs because they, like you, have a very surface level understanding of how this all works. permalink parent award report block reply view 2 more comments...\nPaperwork35 3 points 2 days ago No. permalink parent award report block reply\ntw0scoops 2 points 2 days ago Ridiculous argument.  Just bc a judge says it, doesnt make the impossible possible or the illegal legal. Its not as simple as unfreezing funds that the program already has. It would require new funding or moving $$ assigned somewhere else. Blood from a stone. Man can be a woman. All that nonsense. permalink parent award report block reply Executarian2 1 points 2 days ago This isn't \"a judge,\" it's literally one of the highest courts in the country. They are ruling that Trump may not WITHHOLD SNAP, not that he has to arbitrarily shell out $4 billion. The courts obviously consider these things; they aren't just pointing at Trump and telling him that he has to pay $4 billion for no reason. If the Supreme Court tells him he has to fund SNAP, he MUST. He is legally REQUIRED to. This isn't an argument. It's not a matter of opinion. It's a fact. permalink parent award report block reply\nExecutarian2 1 points 2 days ago This isn't \"a judge,\" it's literally one of the highest courts in the country. They are ruling that Trump may not WITHHOLD SNAP, not that he has to arbitrarily shell out $4 billion. The courts obviously consider these things; they aren't just pointing at Trump and telling him that he has to pay $4 billion for no reason. If the Supreme Court tells him he has to fund SNAP, he MUST. He is legally REQUIRED to. This isn't an argument. It's not a matter of opinion. It's a fact. permalink parent award report block reply\nhenri_derelicte 21 points 2 days ago The Supreme Court needs to do something about forum shopping. Am extraordinarily high number of lawsuits against the Trump administration are being run through a small number of district (and by extension, appellate) courts. Massachusetts and the First Circuit are getting a lot of cases since they’re stacked with Obama/Biden appointees permalink award report block reply Light_HIV_Effect 2 points 2 days ago They need to review these judges and courts being overturned. A lot of these rulings could be made by first year law students and they're so clearly wrong. There needs to be consequences for fucking up easy rulings and being overturned a certain number of times in a year. permalink parent award report block reply henri_derelicte 3 points 2 days ago There are very few consequences for a judge getting routinely overturned. These leftist/activist judges don’t care if SCOTUS overrules them because they know that if there were more liberal judges on the high court, their rulings would be upheld. permalink parent award report block reply Callsign_Fox1 1 points 2 days ago Comment removed by community filter, pending further review. permalink parent award report block reply Executarian2 -3 points 2 days ago Doesn’t matter, that’s just fundamentally how the legal system has to work. Removing it would just make the exact opposite happen. permalink parent award report block reply Paperwork35 3 points 2 days ago What would that be specifically? permalink parent award report block reply Executarian2 0 points 2 days ago You just can't control where people file lawsuits. How would that even work? \"If you want to sue Trump, you MUST go through Louisiana's courts to do it!\" See how that doesn't make any sense? permalink parent award report block reply\nLight_HIV_Effect 2 points 2 days ago They need to review these judges and courts being overturned. A lot of these rulings could be made by first year law students and they're so clearly wrong. There needs to be consequences for fucking up easy rulings and being overturned a certain number of times in a year. permalink parent award report block reply henri_derelicte 3 points 2 days ago There are very few consequences for a judge getting routinely overturned. These leftist/activist judges don’t care if SCOTUS overrules them because they know that if there were more liberal judges on the high court, their rulings would be upheld. permalink parent award report block reply Callsign_Fox1 1 points 2 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nhenri_derelicte 3 points 2 days ago There are very few consequences for a judge getting routinely overturned. These leftist/activist judges don’t care if SCOTUS overrules them because they know that if there were more liberal judges on the high court, their rulings would be upheld. permalink parent award report block reply Callsign_Fox1 1 points 2 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nCallsign_Fox1 1 points 2 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nExecutarian2 -3 points 2 days ago Doesn’t matter, that’s just fundamentally how the legal system has to work. Removing it would just make the exact opposite happen. permalink parent award report block reply Paperwork35 3 points 2 days ago What would that be specifically? permalink parent award report block reply Executarian2 0 points 2 days ago You just can't control where people file lawsuits. How would that even work? \"If you want to sue Trump, you MUST go through Louisiana's courts to do it!\" See how that doesn't make any sense? permalink parent award report block reply\nPaperwork35 3 points 2 days ago What would that be specifically? permalink parent award report block reply Executarian2 0 points 2 days ago You just can't control where people file lawsuits. How would that even work? \"If you want to sue Trump, you MUST go through Louisiana's courts to do it!\" See how that doesn't make any sense? permalink parent award report block reply\nExecutarian2 0 points 2 days ago You just can't control where people file lawsuits. How would that even work? \"If you want to sue Trump, you MUST go through Louisiana's courts to do it!\" See how that doesn't make any sense? permalink parent award report block reply\nMikeyisNinja 16 points 2 days ago That’s only enough to run snap for 3 weeks. permalink award report block reply BewareOfThePug 8 points 2 days ago or 8 days of the UK National Health Service permalink parent award report block reply\nBewareOfThePug 8 points 2 days ago or 8 days of the UK National Health Service permalink parent award report block reply\nSkywise 11 points 2 days ago The Supreme Court already blocked funding u til they can resolve the first case where the appeals court said “gimme dat free food”  this is just virtue signaling. permalink award report block reply Executarian2 1 points 2 days ago Why does nobody read anything? This is the exact case that Jackson sent it down to. This is their decision. Now it moves to the Supreme Court. permalink parent award report block reply OrangeElvis 2 points 2 days ago Quick, someone representing the interests of the funds in question sue to stop the money being misappropriated for SNAP, lol. permalink parent award report block reply\nExecutarian2 1 points 2 days ago Why does nobody read anything? This is the exact case that Jackson sent it down to. This is their decision. Now it moves to the Supreme Court. permalink parent award report block reply OrangeElvis 2 points 2 days ago Quick, someone representing the interests of the funds in question sue to stop the money being misappropriated for SNAP, lol. permalink parent award report block reply\nOrangeElvis 2 points 2 days ago Quick, someone representing the interests of the funds in question sue to stop the money being misappropriated for SNAP, lol. permalink parent award report block reply\nDestroyerofCobwebs 8 points 2 days ago Trump needs to appeal this to the Supreme Court even though the case may be moot due to the Democrats finally coming to their senses. The court cannot force the executive to spend money that hasn't been appropriated.  SNAP/EBT is NOT in the same bucket as Medicare and Social Security, the payments aren't mandated by law. permalink award report block reply\nHenkZeilstra 7 points 2 days ago How the FUCK DO JUDGES RULE THE US this is fucking Hail Hydra what's going on here permalink award report block reply\nGreyGooseDown 5 points 2 days ago When do courts get to appropriate money?  This is clear violation of the constitution, that never stopped them anyway. Good to know next time there is an appropriations issue. permalink award report block reply NonbinaryPotatohead 6 points 2 days ago Have you not heard of the NFA, Patriots Act, no knock raids, TSA frisk check points, etc etc?\nWhat Constitution? What Rights? permalink parent award report block reply\nNonbinaryPotatohead 6 points 2 days ago Have you not heard of the NFA, Patriots Act, no knock raids, TSA frisk check points, etc etc?\nWhat Constitution? What Rights? permalink parent award report block reply\ny_do_i_need_to_hide 4 points 2 days ago I dont care what they say. permalink award report block reply Executarian2 -1 points 2 days ago Well, they have important authority so closing your eyes to it won’t do anything. permalink parent award report block reply y_do_i_need_to_hide 1 points 2 days ago An election was stolen openly. ALL of this is make believe. permalink parent award report block reply\nExecutarian2 -1 points 2 days ago Well, they have important authority so closing your eyes to it won’t do anything. permalink parent award report block reply y_do_i_need_to_hide 1 points 2 days ago An election was stolen openly. ALL of this is make believe. permalink parent award report block reply\ny_do_i_need_to_hide 1 points 2 days ago An election was stolen openly. ALL of this is make believe. permalink parent award report block reply\nGatoradeJeb 4 points 2 days ago So I have to work but worthless browns and blacks get to parasite off me? Fuck this shit. The kkk doesnt look so bad anymore permalink award report block reply\nMeMargie 3 points 2 days ago Where in our constitution does it call for food aid? taxes are for city side streets. permalink award report block reply\nDiana 3 points 2 days ago Well, if Congress refuses to fund it .... yes, they can withhold money that is not there. permalink award report block reply\nJimRaynor 3 points 2 days ago Food aid to Democrat allied NGOs who will funnel back through act blue permalink award report block reply\nDev404 3 points 2 days ago See how hard democrats fight for criminals? If only republicans would fight even half as hard for law abiding citizens. We have no representation in Congress and in courts. permalink award report block reply\ndaty_dato 2 points 2 days ago Why does this matter? Isn't the government open again? permalink award report block reply\nBeardholder 2 points 2 days ago US Appeals court is triatorous . I want war. Not because I want innocent people to die but to fucking put a end to all this wide spread never ending corruption. permalink award report block reply plasma 3 points 2 days ago war will end everything except corruption permalink parent award report block reply Executarian2 1 points 2 days ago Keyboard warrior silliness. Waging a war on the law is just about the dumbest thing you could do. permalink parent award report block reply\nplasma 3 points 2 days ago war will end everything except corruption permalink parent award report block reply\nExecutarian2 1 points 2 days ago Keyboard warrior silliness. Waging a war on the law is just about the dumbest thing you could do. permalink parent award report block reply\nMegoThor 2 points 2 days ago Then let the US appeals court fund it out of their own pockets. permalink award report block reply\nSmurfection 2 points 2 days ago It's not Trump withholding it.  It's the Senate.  The Senate has to approve a budget that has passed the House and president signs the budget. Senate Democrats are refusing to pass the CR from the House to fund government.   Any court that orders Trump but not the Senate, has woefully and egregiously misunderstood how our system of government works. permalink award report block reply\nCrappydatum 2 points 2 days ago Jumanji got cornfused agin? permalink award report block reply\nPatriotSkorzeny 2 points 2 days ago Food aid is what we give to foreign nation hurricane relief. permalink award report block reply\nWexit-Delecto 1 points 2 days ago What kind of ties bind these judges to the deep state? You can’t buy loyalty like this… permalink award report block reply\nPaydro 1 points 2 days ago Trump better be appointing a fuck ton of these judges right now to retard-proof the inevitable next faggot dem president permalink award report block reply\ncherbui 1 points 2 days ago Stupid fucks should be asking the dem why they dont do their job and hold America hostage ..  call it treason and remove those dem already and those rino too permalink award report block reply shockpurseyell 1 points 2 days ago Seems if the courts have the power to force the executive to find money for snap, the court could also order the legislature to end the shutdown and fund the govt and its programs. Courts are out of their depth when they feel emboldened to fashion a remedy for every dispute presented. When on most of these political issues they should be telling plaintiffs to contact your congressman and vote harder next time. permalink parent award report block reply\nshockpurseyell 1 points 2 days ago Seems if the courts have the power to force the executive to find money for snap, the court could also order the legislature to end the shutdown and fund the govt and its programs. Courts are out of their depth when they feel emboldened to fashion a remedy for every dispute presented. When on most of these political issues they should be telling plaintiffs to contact your congressman and vote harder next time. permalink parent award report block reply\nUnboosted 1 points 2 days ago Just cancel welfare then. EO it permalink award report block reply\nVirTW 0 points 2 days ago The court should pay for the aid itself permalink award report block reply\nShitsbrokeyo 0 points 2 days ago WHY NOT? ITS SUPPLEMENTAL!\nYes all caps permalink award report block reply\nSanityGumby 0 points 2 days ago They obviously can because that's not what Congress allotted it for. permalink award report block reply"}