{"id": "1ARK513aS9", "contents": "1623 Republicans plan to impeach Judge Boasberg over senators’ subpoenas. He approved secret subpoenas for the cell phone records of sitting members of Congress. (san.com) posted 6 days ago by rdvs34283 203 comments award share report block Republicans plan to impeach Judge Boasberg over senators’ subpoenas House Republicans are looking to impeach the federal judge who approved secret subpoenas for the cell phone records of sitting congresspeople. san.com\n203 comments Sort by Top Top New Worst Old Save Around the Web This Household Trick Removes All Parasites in Your Body Overnight! Paratoxil scrubking 145 points 6 days ago 'plan' so about two weeks then... permalink award report block reply AlwaysTrumper2020 59 points 6 days ago In two weeks, they will announce they will be holding a press conference, laying out their plans, for their intentions to discuss  putting together a panel to study the feasibility of such an action...... permalink parent award report block reply InternetSolutions 7 points 6 days ago They'll form a committee to discuss drafting a report that discusses the possibility of meeting to discuss an investigation into forming a committee to draft a plan to create points for an outline for a strongly worded letter. permalink parent award report block reply thunderpussy 1 points 6 days ago And should a strongly worded letter be the decided course of action, a committee will have to schedule a meeting to discuss the outline of a planned future conference on whether to use the good or everyday official stationery...... permalink parent award report block reply NoWorries77 1 points 6 days ago Such BS!!\nGOP is useless!! permalink parent award report block reply USDMaga 40 points 6 days ago When judges allowed spying on just Trump or citizens by the thousands, not a word from the Senate. You approved syping on the Senate?  NOW we will do something. Congress is full of cucks. permalink parent award report block reply MAGARondonmonson 5 points 6 days ago At the time, they had people convinced that Russia was pro Trump and they were in league, so the phone taps must be legal. Now through a larger pattern of events they can see this judge (many are just like him) is just a rogue liberal  bandit of a politician in a robe permalink parent award report block reply USDMaga 5 points 6 days ago Comey, who tapped Trump, was the one that made up the Russia hoax.  He knew it was fake when he filed the FISA warrant. Senate said NOTHING. Congress are cucks permalink parent award report block reply MAGARondonmonson 2 points 6 days ago They hid all that info, only the Gang of 8 knew, Burr & Paul Ryan knew, Rubio was not privy to most of this info. Pelosi and Schumer were as was McConnel. permalink parent award report block reply RStroud 3 points 6 days ago It is obvious that there is effectively a Praetorian Guard that attempts to run DC from behind the scenes and parallel to electoral politics.  There are undoubtedly fiefdoms and factions within that group, foreign alliances, skirmishes and coups.  They're at the edges of political hit jobs both literal and metaphorical:  JFK, COINTELPRO, Watergate, Russiagate, Epstein type stuff is the tip of the iceberg. They're not going to be called to account in their own system and you can't vote them out.  The biggest difference between the US and say Russia or China is that our revolutionary mythos was based on different values and we still believe in our veneer of a democratic republic.  The current cracks mostly come from no longer reinforcing and glorifying that origin mythos, but criticizing it while promoting and idolizing the \"oppressed\" and \"scientific\" management.  We're at the point in the cultural revolution where \"America for Americans\" or \"America First\" is controversial because so many people don't see themselves as American, and associate America with backwards (white) provincial people. permalink parent award report block reply friedchicken 10 points 6 days ago Dickless cunts permalink parent award report block reply OldZilla 2 points 6 days ago Oxy morons you say? permalink parent award report block reply SocraticMethod1 4 points 6 days ago Maybe, maybe not as THEY were targeted by this. They're spinless cowards but a spinless coward is more willing to call in hits if they think THEY will be harmed. permalink parent award report block reply SteelDriver 1 points 6 days ago It doesn’t really matter much.  The Rep Senators admit there won’t be enough votes to convict and remove him (even if Murkowski and Collins went along, which seems unlikely).  This is just an effort to expose more behind the scenes activity, much of which we already suspect. permalink parent award report block reply load 17 more comments... The_Ikonoclast 60 points 6 days ago Wake me up when it actually happens... permalink award report block reply NonbinaryPotatohead 13 points 6 days ago It won't, keep walking. permalink parent award report block reply Area82 -1 points 6 days ago They shouldn’t.  This is a criminal act.  It should be handled by the criminal justice system, not the political system. permalink parent award report block reply Snek_Plissken -4 points 6 days ago Judges have qualified immunity. It’s now clear this was a mistake. The real issue is the democrats don’t care as long as he was performing criminal acts for them. permalink parent award report block reply _Eric_Ciaramella_ 6 points 6 days ago I see you are not new here permalink parent award report block reply Krat 4 points 6 days ago Only democrats hunt and round up the wrong people by thousands and throw them into cells permalink parent award report block reply BigMikesSwingingCock 2 points 6 days ago \"What's a \"due process\"? I haven't heard of that diet, I'm a vegan.\" -Democrats permalink parent award report block reply drattastic1 3 points 6 days ago Enjoy a long long sleep permalink parent award report block reply Belenus 2 points 6 days ago I'll wake you up in 2 weeks, to let you know it will be at least another 2 weeks to go until the next 2 weeks wait. permalink parent award report block reply load 1 more comments... NonbinaryPotatohead 33 points 6 days ago 2 weeks, I want the strongly worded letter on my desk. permalink award report block reply maverick202 6 points 6 days ago Best we can do is send strongly worded tweet. permalink parent award report block reply Spuck_Fez 2 points 6 days ago And maybe a strongly worded Fox News interview permalink parent award report block reply UCantStumpTheTrump 0 points 6 days ago The guy you’re replying to is a shill here to sow discontent permalink parent award report block reply NonbinaryPotatohead 0 points 6 days ago acceptable! permalink parent award report block reply possibletower -6 points 6 days ago Nice try but refusing to blame the \"based Founding Fathers\" for setting the 2/3 Senate rule for impeachment and cockblocking presidents from being able to do much in domestic policy and also giving us \"muh based states' rights\" which leads to rigged elections and giving illegal aliens driver's licenses. permalink parent award report block reply maverick202 4 points 6 days ago Nice Kamala like word salad, son. permalink parent award report block reply MAGARondonmonson 3 points 6 days ago They were correct, if they set it up like you wanted it think of the chaos, Dems win house and senate, they use the majorities on those to bodies and all of the sudden all 6 of the Supreme Court Justices who are conservative would be gone as well as all of the FEDERAL JUSTICES in Districts 1-11. We can via a trial prove he is guilty easily. If they keep him in, then there is a way to defund them. permalink parent award report block reply Bythrfruitsyknow 2 points 6 days ago Yes, because having simple majority impeachment of judges and supreme court justices is a good idea.  Having seen the left's recent commentary do you think Justice Thomas or Justice  Kavanaugh would be still seated? Shouldn't you be out there solving unsolved crimes, genius? permalink parent award report block reply possibletower -5 points 6 days ago 2/3 Senate vote needed. But faggots here don't want to criticize the \"based Founding Fathers\" who put that in the Constitution. I will start taking people seriously when they start calling out the Constitutional Convention as much as they do when they bitch about Trump. If Trump is worthy of getting blamed then their precious \"based Founding Fathers\" really need to get assblasted for the impeachment threshold and cockblocking Trump from doing much in domestic policy like they give the presidents dictatorial power with regards to foreign policy and many other problems with the Constitution. The Constitution's \"muh based states' rights\" is why states are able to rig elections and give illegal aliens driver's licenses. permalink parent award report block reply NonbinaryPotatohead -3 points 6 days ago MAGA doesn't want to play the game, they are too busy getting compromised in sex scandals on tape in foreign lands. They could win if they gave a shit but clearly all they care about is the status quo. Feels just like the W. Bush era right now. permalink parent award report block reply Sparks1017 18 points 6 days ago But would still require 2/3 rds of Senate? Am I right about that? I think if he were just hanged, that would work permalink award report block reply dataonly 8 points 6 days ago Might find a sympathetic ear on this particular subject. Many of the old Senators have loyalty to the Senate.  Even rational Dems are thinking what if an R leaning judge seized my phone records.  Because, they know what would be found. permalink parent award report block reply rebuildingMyself 13 points 6 days ago There won't ever be enough Democrats to go along with this because even the RINOs want Trump obstructed whenever possible permalink parent award report block reply dataonly 6 points 6 days ago You may be right, but this is a different sort of issue.  This is a Judge going after members of the Senate.  That can work both ways. I could see enough Dems wanting to send a message on this subject to the judiciary. But again, you may be right. permalink parent award report block reply current_horror 4 points 6 days ago Nope. Democrats rely on their installed kings in black robes to unilaterally rule over the country. Dems will never check their own power. permalink parent award report block reply Kraken_V_Algorithm 2 points 6 days ago Most of them know who the targets are and can count on not being one if they vote the right way. permalink parent award report block reply rebuildingMyself 1 points 6 days ago In a just world, you would be correct. But knowing the Uniparty all the insane judicial activism magically goes away once the right people are back in control permalink parent award report block reply Sgt_Hulka 4 points 6 days ago The day a republican judge does this will be the day snow falls in hell. Republicans are the Washington Generals to the Democrats Harlem Globtrotters. permalink parent award report block reply Sparks1017 1 points 6 days ago Yeah, That's a good point permalink parent award report block reply 559throw 1 points 6 days ago LMAO ain't no goddamned Republican gonna do any of that. What the fuck are you smoking? Pass it over permalink parent award report block reply Area82 2 points 6 days ago It would permalink parent award report block reply WassermanSchultz 1 points 6 days ago Yes.  Nothing will happen.  It's just for show. permalink parent award report block reply possibletower -5 points 6 days ago Retards here don't want to talk about 2/3 Senate because that means they will have to criticize the Founding Fathers and they aren't allowed to criticize about \"much based Constitution\" permalink parent award report block reply dataonly 3 points 6 days ago The Founding Fathers intentionally made \"removal after impeachment\" a necessarily high bar to reduce the political nature of the process itself. i.e. It would be possible to garner a slim majority and vote as a block.  But requiring 2/3 all but eliminates that possibility. permalink parent award report block reply ragnarokrobo 2 points 6 days ago Same as when everyone was screaming about impeaching Biden like it'd ever get through the senate. permalink parent award report block reply Ryunnsun 9 points 6 days ago Let's impeach the rest of the judges who approved surveillance of  Americans for political points. permalink award report block reply elc0 1 points 6 days ago Lol. permalink parent award report block reply Liberty49220 7 points 6 days ago If a Republican congressman represents your district,  it only takes a few minutes to contact them to support this. permalink award report block reply Sparks1017 4 points 6 days ago Me and my Rep are on a first name basis, he's cool and a Patriot permalink parent award report block reply MissingTrump 6 points 6 days ago Trial and punishment. Enough of this strongly worded letters bs. permalink award report block reply Odyssey 6 points 6 days ago Requires 67 Senate votes to remove him as a judge. I am tired of these dog whistles. permalink award report block reply bonejack 2 points 6 days ago It is the equivalent of a guy talking tough because he knows his friends will just hold him back, when the fight actually breaks out. permalink parent award report block reply Klown_Kutz 5 points 6 days ago Whoa! This is getting out of sternly worded letters territory. What about muh optics? permalink award report block reply Logan051361 5 points 6 days ago Why not arrest??? WTF? permalink award report block reply keeptherepublic1776 5 points 6 days ago Notice they only act when they are affected. They don't care about the people permalink award report block reply Lurker404 2 points 6 days ago Don't they need 2/3 of the votes for an impeachment? That means they need Dem votes. They'd never vote with Reps unless they are personally affected. permalink parent award report block reply DCYR66 4 points 6 days ago He won’t. Our DOJ all talk no action. permalink award report block reply IForgotToAddAnEmail 4 points 6 days ago I'm sure they plan a lot of things. permalink award report block reply Double_D 3 points 6 days ago They wouldn’t impeach him for overseeing a multitude of illegal activity on the FISA court, including spying on the Trump campaign, wouldn’t impeach him over  his handling of the Klinesmith case or any of these more recent overreaches but, as soon as it’s revealed he fucked with them , he has to go. The vast majority of the GOP are self interested faggots permalink award report block reply Lurker404 1 points 6 days ago That's because they need some Dem votes for an impeachment AFAIK. permalink parent award report block reply Double_D 1 points 6 days ago Right, but why no calls for impeachment for all the other illegal activity? Do they really think they’re more likely to get 2/3 of the senate now than they were before? permalink parent award report block reply Lurker404 1 points 6 days ago Because all the other shit only affected Trump. They'd sooner give him a medal for that than vote with Republicans. This one affects senators. They might feel more inclined to vote in their own interest but I doubt it. permalink parent award report block reply Double_D 1 points 6 days ago One, Boasberg’s transgressions on the FISA court go way beyond Trump. While he was on the court, it was discovered that the FBI was illegally searching the NSA database for thousands of redacted individuals’ communications and giving the information to redacted contractors, going back to at least 2010. He did absolutely nothing about it. Two, Senate GOP leadership and Trump aren’t on the same team. Their overall interests are much more aligned with Dem leadership than with Trump’s. Their ultimate goal is to protect a system that enriches themselves and the billionaires who pay for their campaigns. permalink parent award report block reply Snek_Plissken -6 points 6 days ago I don’t even know about that. This is Boarsheadburger. Him and his family are all up in the NGO scheme. You don’t get all that usaids without connections. He is their dog on a leash and he is immune from legal harm.  Anyone who believes he acted independently as an idiot. They absolutely colluded and orchestrated several judges and state attorneys to make a kabuki theatre of the law. permalink parent award report block reply 16BeatsAOne 3 points 6 days ago Judge Beryl Howell has to be next on the Impeachment List. permalink award report block reply YearninNation 3 points 6 days ago Pam Bondi will be the reason Trump's second term will be a spectacular failure that gives vote riggers all the power they need to end the American experiment. permalink award report block reply RudeFrog 3 points 6 days ago Republicans are not going to do anything but talk. They will bullshit their way into losing the midterm like always. Because they are America last losers. Stop being played by them. permalink award report block reply patrioticwinning3 3 points 6 days ago Believe it when I see it... permalink award report block reply JoeBidensDementia1 2 points 6 days ago They ain't planning on doing shit permalink award report block reply Seldom_Seen_Kid 2 points 6 days ago Impeachment means nothing…jail his ass!! permalink award report block reply FlyCatcher94 2 points 6 days ago NOW they act since it’s their shit being fuxked with. Assholes permalink award report block reply bonejack 2 points 6 days ago 'Member when the gop had all that evidence against Biden and his family, just before the midterms saying stuff like \"we caught'em, it's all a shell game.\" or \"this president is the most corrupt president ever. We will impeach him, right after the midterms.\" Then absolutely nothing happened. I 'member. permalink award report block reply cbonez416 2 points 6 days ago This is something I believe when I see. Because all I've seen is nothing but harsh words from the GOP and the Republican party. These people don't have any balls. They don't have any touch on reality and they have absolutely zero gauge on the culture. permalink award report block reply A_Colostomy_Bag 2 points 6 days ago They should be impeaching dozens of judges who are conspiring against Trump and the country. permalink award report block reply Trumpwon306 2 points 6 days ago Nothing will come of this. Ignore this. Shame any retard who even shares this 'news' The only practical and half-feasable solution is to defund and dismantle the circuit courts and then reestablish them, nominating strict traditionalists. Anything else is just a ploy. permalink award report block reply pookiee68 2 points 6 days ago NO WAY the RINO losers who make up the majority of Republicans do ANYTHING, the Democrats who own them won't allow it. permalink award report block reply Fangerang 2 points 6 days ago Need more doing and less talking, planning, and strongly worded letters. permalink award report block reply Surgeon 2 points 6 days ago They'll promote him . The SWAMP never prosecutes the deep stater commie traitors .  He'll be promoted to Chief Judge at Supreme court next . Why doesn't congress enact Trumps EO's instead of wasting taxpayer funds on this shit ? MAGA voted for change / DRAIN THE SWAMP permalink award report block reply mass55th 2 points 6 days ago Don't fucking talk about it...just do it!! permalink award report block reply AllTheWayTrump 2 points 6 days ago So they'll  do something when their rights are abused, but when it's Trumps or ordinary Americans they couldn't give 2 fucks. permalink award report block reply thp2034 2 points 6 days ago Not until it happened to them. They have had this same power to impeach & remove a judge since day one. Why didn't any of them step up and file impeachment papers on any of the rouge district court judges that came after the President? It's not to late, anyone of them can still do it...why aren't they? permalink award report block reply Forty_Five 2 points 6 days ago \"plan to\" Which means literally nothing. In fact it's evidence against them actually doing anything. permalink award report block reply SurveilThis 2 points 6 days ago Typical shit. Senators never do a single thing until it happens to them directly. Spy on your party’s sitting President? Here’s a strongly worded letter. Spy on my Senate accounts? Here’s two strongly worded letters. permalink award report block reply AVeryNakedMan 1 points 6 days ago The impeachment is a scam. Republicans know it won't remove him because it won't pass the Senate. We need the Republican majority in Congress to abolish the judge's court and re-institute it with a new judicial opening, via passing a new law. This will remove him from his position with a simple majority vote in Congress. No impeachment is required. permalink award report block reply DoMe22 1 points 6 days ago Yeah, this ain't happening. Trump is the only useful republican. permalink award report block reply BoughtByBloomberg2 1 points 6 days ago Plan to strongly consider discussion the options of potentially doing something. permalink award report block reply Rakkasan91b 1 points 6 days ago I love that these losers can't be bothered to ever even go through the motions of impeaching any of these judges who have been blatantly corrupt, usurping power, or making blatantly political decisions that have affected hundreds of thousands of people for years.  Yet, now that one of the judges did something that affects some of them they are now so suddenly eager to impeach someone. permalink award report block reply Tacitus1963 1 points 6 days ago The Republicans will do jack schitt as they always do especially when it's PDJT who is in office.\nThey are beyond useless. permalink award report block reply 2016TrumpMAGA 1 points 6 days ago Fuck impeaching him, arrest the faggot. permalink award report block reply SilentSniper 1 points 6 days ago Do it already you worthless spineless fucks. DO IT permalink award report block reply jiujiujiu 1 points 6 days ago How many votes does it take to remove an impeached judge from office? permalink award report block reply onesummerdream 1 points 6 days ago We got ‘em now! Or tomorrow!! Okay next week then!!! Two weeks MAX! Pinky swearsies. permalink award report block reply bigfatnagger 1 points 6 days ago Fucking a. What do you mean \"plan\" permalink award report block reply 24601 1 points 6 days ago This is not enough. Weak knees give strength to the Communists currently taking over the country. permalink award report block reply Yakhechos 1 points 6 days ago They won't do shit. Mark my words. permalink award report block reply mateus 1 points 6 days ago This is the kind of corrupt judge the Dems have on speed dial. And I bet he's going nowhere. permalink award report block reply whataboob 1 points 6 days ago But nothing on the J6 judges and prosecutors… Just tapping a senators phone is worse to these Senator maggots than holding hundreds of Americans hostage in prison for years. permalink award report block reply HunterBidensPC 1 points 6 days ago Judge clearly attacks patriots around the country Crickets Judge attacks Congress members IMPEACHMENT!! Can we just nuke the entire judicial and legislative branches and start from scratch? permalink award report block reply Wupta PRO 1 points 6 days ago Sure it’s okay to hit Trump their asses oh now we’re offended. permalink award report block reply paramour 1 points 6 days ago Eww. Demon poster child. permalink award report block reply Melsura67 1 points 6 days ago Skeletor!!! permalink award report block reply fortyfive4fourmore 1 points 6 days ago Yeah well I plan to purchase the USA and kick everyone out but me and my dog. That'll show em. Taking bets on which one happens first. So far it's a toss up. permalink award report block reply xanax123 1 points 6 days ago Yes, we know. It’s been posted every day…what is new about this exactly? Did you just hear that Charlie Kirk was shot too? permalink award report block reply TheDevilMonkey 1 points 6 days ago Kabuki Theater. Everything is fake and gay. permalink award report block reply Induceddrag 1 points 6 days ago Boasberg has spent his judicial career trampling the rights of Americans, but he found a way to get the attention of Congress.\nOf course if Congress wanted to impeach somebody for subpoenaing their phone records maybe they should go after Schiff.  He pulled phone records on the minority members of his own house committee. permalink award report block reply Lynn4303 1 points 6 days ago They plan? Talk to me when they do it permalink award report block reply TheDevilMonkey 1 points 6 days ago 👃 permalink award report block reply Pats5x 1 points 6 days ago shouldve been done months ago....gop is just running out the clock until they get blasted in the midterms and lose the house by D+25 permalink award report block reply Followd 1 points 6 days ago Plan away! Start with a firm harshly worded letter and also go on Faux News to let everyone know what your going to do! Then when you dont do it, at least everyone will know what you were GONNA do! permalink award report block reply redneckrevival 1 points 6 days ago LMAO, ain't shit gonna happen. permalink award report block reply TheArchAngel 1 points 6 days ago I don't care what they \"plan\" to do. until they actually do it, I'll consider them as the cowards they are. permalink award report block reply donteatthat 1 points 6 days ago Not gonna happen permalink award report block reply LolitaExpressPilot 1 points 6 days ago If by 'impeach' you mean hang for treason.... permalink award report block reply current_horror 1 points 6 days ago Citizen: I’m filing a freedom of information request for my senator’s official govt communications FISA judge: sorry, congress are not subject to FOIA requests Democrats: hey yo, can we borrow the illegal NSA database to spy on our political opponents? FISA judge: fuck yeah, let’s goooooo permalink award report block reply Lol_Garrus 1 points 6 days ago Judicial tyranny against Trump? ❌ Breaking 8th Amendment rights of Conservatives? ❌ Clear bias and conflict of interest ❌ He allowed radical left DOJ to spy on Senator's phones. ✅ \"Whoa, now we gotta impeach this guy!\" permalink award report block reply stealthboy 1 points 6 days ago Spoiler alert:  They won't.  Nothing will happen. permalink award report block reply DCYR66 1 points 6 days ago Meanwhile in Ukraine! permalink award report block reply medicpatriot 1 points 6 days ago Yeah I’m sure we’ll get that right along with the Epstein files permalink award report block reply OrangeManNotBad 1 points 6 days ago So many RINO's, not a chance of impeachment. permalink award report block reply LostElf 1 points 6 days ago How utterly pointless and typical. Doesn't the DOJ have enough for a dawn raid? Anyway when they deport him back to the Carpathian Mountains remember the soil in the casket has to be from the original burial site. permalink award report block reply sgttoporbottoms 1 points 6 days ago Of course they’ll do it when it’s their asses getting spied on. Just never if it’s a popularly elected president. permalink award report block reply redneckrevival 1 points 6 days ago LMAO, ain't shit gonna happen. permalink award report block reply drmrboy 1 points 6 days ago TWO!!!!!!!!  🤓 permalink award report block reply LiteraIIyHitIer 1 points 6 days ago I wait 2 weeks in the morning I wait 2 weeks at night I wait 2 weeks in the afternoon, it makes me feel alright I wait 2 weeks in time of peace and 2 in time of war I wait 2 weeks before I wait 2 weeks And then I wait 2 more permalink award report block reply Alldayeveryday 1 points 6 days ago More bullshit talk permalink award report block reply Motownmow 1 points 6 days ago in case you're wondering, yes he is permalink award report block reply SaxonRealm 1 points 6 days ago Impeach and then arrest and imprison. permalink award report block reply hey_spike 1 points 6 days ago Can we at least take away his parking spot. Also find some way to stop important cases from going to him. permalink award report block reply Sychinlegacy 1 points 6 days ago Even if they did, which they won’t, the democrats will just aquit him. Impeaching is pointless. Just fucking arrest him and throw him into Guantanamo. permalink award report block reply Grindelwald 1 points 6 days ago NOW Congress is pissed.  Not when this judge was making up law to get-Trump.  Only when it comes to them permalink award report block reply Kricket 1 points 6 days ago Just fucking do it. permalink award report block reply ThunderGatti 1 points 6 days ago Those dickless cowards won't do shit permalink award report block reply mty_green_go 1 points 6 days ago funny they didnt care when turd burglar was railroading Trump but as soon as it happens to them they get upset permalink award report block reply JoePlumber 1 points 6 days ago Impeachment is a sham it will never reach 2/3 majority. They must remove him some other way like saying this is bad behavior with a simple majority vote. permalink award report block reply Krat 1 points 6 days ago 0 arrests permalink award report block reply OrangeCatBad 1 points 6 days ago No just remove for bad behavior, that doesnt require 2/3 permalink award report block reply BABA-YAGA 1 points 6 days ago Waste of time.  Takes 67 in the Senate and the GOP knows they will never get it.  Just more performative Kabuki theater to try and trick the base into thinking they are doing something other than obstructing Trump at every turn. permalink award report block reply whiter5fx 1 points 6 days ago So do it already permalink award report block reply Bythrfruitsyknow 1 points 6 days ago Note: They are not planning to impeach any of the federal judges involved in spying on President Trump's administration, or President Trump himself; They haven't even suggested it. They just are targeting the ones that attempted to spy on them. permalink award report block reply Chickensaurus 1 points 6 days ago Gay. They'll drag their feet until Dems are back in charge. permalink award report block reply BusterHyman99 1 points 6 days ago Notice they will impeach when it involves them but with Trump we just can't break norms and regulations permalink award report block reply ChyNahAzzWhole1 1 points 6 days ago I wont hold my breath. permalink award report block reply yummy_yumm_yumms 1 points 6 days ago Why even say anything? So fucking dumb, all talk. We should be hearing that it's happened, not that they plan on doing it. permalink award report block reply ThouShallNotSteal 1 points 6 days ago No. You drag him into the street and allow the street shitters to shit all over him. Then you drag him behind a NYC garbage truck that is blaring YMCA on the radio. permalink award report block reply cptkloss5 1 points 6 days ago close to a year in power...zero real action... by now there should have been 500 boasbergs removed. permalink award report block reply Liberalism_is_mental 1 points 6 days ago A sternly worded threat will definitely stop the Democrat criminals. permalink award report block reply Spellmonger 1 points 6 days ago Republicans plan to impeach Judge Boasberg OF COURSE THEY ARE PLANNING Judge Boasberg is appointed, NOT ELECTED. So they can use him to distract us from trying to force them to secure our elections, and in the end, whether he stays or goes will be orchestrated by Thune and Schumer without a thought of his crimes against We The People. permalink award report block reply Dev404 1 points 6 days ago Judges rubber stamp illegal shit all the time, based on no or unreliable evidence. Russiagate, anyone? Did anyone pay for that yet? Not really. permalink award report block reply NoWorries77 1 points 6 days ago Impeach?\nWHEN ?!!!!!?? permalink award report block reply HenkZeilstra 1 points 6 days ago Plan? Fucking do it, don't talk just suprise us permalink award report block reply PoohClimbsTrees 1 points 6 days ago They will huff and puff, then not actually do anything Our Republic seems in a dark place it may never recover from. permalink award report block reply Maganifice7 1 points 6 days ago Two more weeks. permalink award report block reply RyanKeyOh 1 points 6 days ago GET TO IT permalink award report block reply BigE123456 1 points 6 days ago The irony of the outrage from Congressmen and women when their rights are unconstitutionally violated. Peasant citizens be damned! J6? permalink award report block reply Krat 1 points 6 days ago 0 arrests permalink award report block reply True_Curmudgeon 1 points 6 days ago If they don't do it over this what will they do it over? permalink award report block reply Scot 0 points 6 days ago They were perfectly fine with him ILLEGALLY persecuting and trying to destroy President Trump though. permalink award report block reply 559throw 0 points 6 days ago Two more weeks! Until nothing happens permalink award report block reply Titanium5 0 points 6 days ago Only when it effects them, not us. Right? permalink award report block reply 5DchessWatch 0 points 6 days ago In his defense, when the deepstate asked him to approve somepenis he was very eager because he loves somepenis permalink award report block reply chahn1138 0 points 6 days ago And not all the other Treasonous Shit that that Motherfucker has done! RINOs needs to be buried under the jail! permalink award report block reply NewBurner04 0 points 6 days ago Take your time permalink award report block reply POTUS_DonnieJ 0 points 6 days ago Cool, so we might, but probably won’t get 1 judge out of a few dozen? permalink award report block reply Wexit-Delecto 0 points 6 days ago At the rate of one judge per year, there will be a grand total of FOUR impeached far left judges by the end of President Trump's term. Drain the swamp! permalink award report block reply HumphreyPlowjogger 0 points 6 days ago Do it already. permalink award report block reply MizzBlackSwan 0 points 6 days ago Ooooh- impeachment!  What a harsh punishment! permalink award report block reply mailinvoter 2 points 6 days ago You missed the most important part - \"plan\" aka \"isn't going to happen\". permalink parent award report block reply Comeon4954 0 points 6 days ago Great, fucking get on with it then. Do nothing\n, faggots. permalink award report block reply TidewaterYank 0 points 6 days ago Impaled was spelled wrong permalink award report block reply barwhack 0 points 6 days ago Nothing will happen to Boatymort. Because \"our side\" is trans-right. permalink award report block reply Thomm 0 points 6 days ago Ok. permalink award report block reply Mhmm2MoreWeeks 0 points 6 days ago BEWARE - SKULL AND BONES 322 permalink award report block reply Obambi 0 points 6 days ago Berg permalink award report block reply the_new_one 1 points 6 days ago Comment removed upon the user being banned. permalink award report block reply oilybohunkofshit 1 points 6 days ago Comment removed by community moderators. permalink award report block reply FullyDilated 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply RememberCharlieKirk 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply new_guy2 1 points 6 days ago Comment removed by community moderators. permalink award report block reply\nscrubking 145 points 6 days ago 'plan' so about two weeks then... permalink award report block reply AlwaysTrumper2020 59 points 6 days ago In two weeks, they will announce they will be holding a press conference, laying out their plans, for their intentions to discuss  putting together a panel to study the feasibility of such an action...... permalink parent award report block reply InternetSolutions 7 points 6 days ago They'll form a committee to discuss drafting a report that discusses the possibility of meeting to discuss an investigation into forming a committee to draft a plan to create points for an outline for a strongly worded letter. permalink parent award report block reply thunderpussy 1 points 6 days ago And should a strongly worded letter be the decided course of action, a committee will have to schedule a meeting to discuss the outline of a planned future conference on whether to use the good or everyday official stationery...... permalink parent award report block reply NoWorries77 1 points 6 days ago Such BS!!\nGOP is useless!! permalink parent award report block reply USDMaga 40 points 6 days ago When judges allowed spying on just Trump or citizens by the thousands, not a word from the Senate. You approved syping on the Senate?  NOW we will do something. Congress is full of cucks. permalink parent award report block reply MAGARondonmonson 5 points 6 days ago At the time, they had people convinced that Russia was pro Trump and they were in league, so the phone taps must be legal. Now through a larger pattern of events they can see this judge (many are just like him) is just a rogue liberal  bandit of a politician in a robe permalink parent award report block reply USDMaga 5 points 6 days ago Comey, who tapped Trump, was the one that made up the Russia hoax.  He knew it was fake when he filed the FISA warrant. Senate said NOTHING. Congress are cucks permalink parent award report block reply MAGARondonmonson 2 points 6 days ago They hid all that info, only the Gang of 8 knew, Burr & Paul Ryan knew, Rubio was not privy to most of this info. Pelosi and Schumer were as was McConnel. permalink parent award report block reply RStroud 3 points 6 days ago It is obvious that there is effectively a Praetorian Guard that attempts to run DC from behind the scenes and parallel to electoral politics.  There are undoubtedly fiefdoms and factions within that group, foreign alliances, skirmishes and coups.  They're at the edges of political hit jobs both literal and metaphorical:  JFK, COINTELPRO, Watergate, Russiagate, Epstein type stuff is the tip of the iceberg. They're not going to be called to account in their own system and you can't vote them out.  The biggest difference between the US and say Russia or China is that our revolutionary mythos was based on different values and we still believe in our veneer of a democratic republic.  The current cracks mostly come from no longer reinforcing and glorifying that origin mythos, but criticizing it while promoting and idolizing the \"oppressed\" and \"scientific\" management.  We're at the point in the cultural revolution where \"America for Americans\" or \"America First\" is controversial because so many people don't see themselves as American, and associate America with backwards (white) provincial people. permalink parent award report block reply friedchicken 10 points 6 days ago Dickless cunts permalink parent award report block reply OldZilla 2 points 6 days ago Oxy morons you say? permalink parent award report block reply SocraticMethod1 4 points 6 days ago Maybe, maybe not as THEY were targeted by this. They're spinless cowards but a spinless coward is more willing to call in hits if they think THEY will be harmed. permalink parent award report block reply SteelDriver 1 points 6 days ago It doesn’t really matter much.  The Rep Senators admit there won’t be enough votes to convict and remove him (even if Murkowski and Collins went along, which seems unlikely).  This is just an effort to expose more behind the scenes activity, much of which we already suspect. permalink parent award report block reply load 17 more comments...\nAlwaysTrumper2020 59 points 6 days ago In two weeks, they will announce they will be holding a press conference, laying out their plans, for their intentions to discuss  putting together a panel to study the feasibility of such an action...... permalink parent award report block reply InternetSolutions 7 points 6 days ago They'll form a committee to discuss drafting a report that discusses the possibility of meeting to discuss an investigation into forming a committee to draft a plan to create points for an outline for a strongly worded letter. permalink parent award report block reply thunderpussy 1 points 6 days ago And should a strongly worded letter be the decided course of action, a committee will have to schedule a meeting to discuss the outline of a planned future conference on whether to use the good or everyday official stationery...... permalink parent award report block reply NoWorries77 1 points 6 days ago Such BS!!\nGOP is useless!! permalink parent award report block reply\nInternetSolutions 7 points 6 days ago They'll form a committee to discuss drafting a report that discusses the possibility of meeting to discuss an investigation into forming a committee to draft a plan to create points for an outline for a strongly worded letter. permalink parent award report block reply thunderpussy 1 points 6 days ago And should a strongly worded letter be the decided course of action, a committee will have to schedule a meeting to discuss the outline of a planned future conference on whether to use the good or everyday official stationery...... permalink parent award report block reply\nthunderpussy 1 points 6 days ago And should a strongly worded letter be the decided course of action, a committee will have to schedule a meeting to discuss the outline of a planned future conference on whether to use the good or everyday official stationery...... permalink parent award report block reply\nNoWorries77 1 points 6 days ago Such BS!!\nGOP is useless!! permalink parent award report block reply\nUSDMaga 40 points 6 days ago When judges allowed spying on just Trump or citizens by the thousands, not a word from the Senate. You approved syping on the Senate?  NOW we will do something. Congress is full of cucks. permalink parent award report block reply MAGARondonmonson 5 points 6 days ago At the time, they had people convinced that Russia was pro Trump and they were in league, so the phone taps must be legal. Now through a larger pattern of events they can see this judge (many are just like him) is just a rogue liberal  bandit of a politician in a robe permalink parent award report block reply USDMaga 5 points 6 days ago Comey, who tapped Trump, was the one that made up the Russia hoax.  He knew it was fake when he filed the FISA warrant. Senate said NOTHING. Congress are cucks permalink parent award report block reply MAGARondonmonson 2 points 6 days ago They hid all that info, only the Gang of 8 knew, Burr & Paul Ryan knew, Rubio was not privy to most of this info. Pelosi and Schumer were as was McConnel. permalink parent award report block reply RStroud 3 points 6 days ago It is obvious that there is effectively a Praetorian Guard that attempts to run DC from behind the scenes and parallel to electoral politics.  There are undoubtedly fiefdoms and factions within that group, foreign alliances, skirmishes and coups.  They're at the edges of political hit jobs both literal and metaphorical:  JFK, COINTELPRO, Watergate, Russiagate, Epstein type stuff is the tip of the iceberg. They're not going to be called to account in their own system and you can't vote them out.  The biggest difference between the US and say Russia or China is that our revolutionary mythos was based on different values and we still believe in our veneer of a democratic republic.  The current cracks mostly come from no longer reinforcing and glorifying that origin mythos, but criticizing it while promoting and idolizing the \"oppressed\" and \"scientific\" management.  We're at the point in the cultural revolution where \"America for Americans\" or \"America First\" is controversial because so many people don't see themselves as American, and associate America with backwards (white) provincial people. permalink parent award report block reply\nMAGARondonmonson 5 points 6 days ago At the time, they had people convinced that Russia was pro Trump and they were in league, so the phone taps must be legal. Now through a larger pattern of events they can see this judge (many are just like him) is just a rogue liberal  bandit of a politician in a robe permalink parent award report block reply USDMaga 5 points 6 days ago Comey, who tapped Trump, was the one that made up the Russia hoax.  He knew it was fake when he filed the FISA warrant. Senate said NOTHING. Congress are cucks permalink parent award report block reply MAGARondonmonson 2 points 6 days ago They hid all that info, only the Gang of 8 knew, Burr & Paul Ryan knew, Rubio was not privy to most of this info. Pelosi and Schumer were as was McConnel. permalink parent award report block reply\nUSDMaga 5 points 6 days ago Comey, who tapped Trump, was the one that made up the Russia hoax.  He knew it was fake when he filed the FISA warrant. Senate said NOTHING. Congress are cucks permalink parent award report block reply MAGARondonmonson 2 points 6 days ago They hid all that info, only the Gang of 8 knew, Burr & Paul Ryan knew, Rubio was not privy to most of this info. Pelosi and Schumer were as was McConnel. permalink parent award report block reply\nMAGARondonmonson 2 points 6 days ago They hid all that info, only the Gang of 8 knew, Burr & Paul Ryan knew, Rubio was not privy to most of this info. Pelosi and Schumer were as was McConnel. permalink parent award report block reply\nRStroud 3 points 6 days ago It is obvious that there is effectively a Praetorian Guard that attempts to run DC from behind the scenes and parallel to electoral politics.  There are undoubtedly fiefdoms and factions within that group, foreign alliances, skirmishes and coups.  They're at the edges of political hit jobs both literal and metaphorical:  JFK, COINTELPRO, Watergate, Russiagate, Epstein type stuff is the tip of the iceberg. They're not going to be called to account in their own system and you can't vote them out.  The biggest difference between the US and say Russia or China is that our revolutionary mythos was based on different values and we still believe in our veneer of a democratic republic.  The current cracks mostly come from no longer reinforcing and glorifying that origin mythos, but criticizing it while promoting and idolizing the \"oppressed\" and \"scientific\" management.  We're at the point in the cultural revolution where \"America for Americans\" or \"America First\" is controversial because so many people don't see themselves as American, and associate America with backwards (white) provincial people. permalink parent award report block reply\nfriedchicken 10 points 6 days ago Dickless cunts permalink parent award report block reply OldZilla 2 points 6 days ago Oxy morons you say? permalink parent award report block reply\nOldZilla 2 points 6 days ago Oxy morons you say? permalink parent award report block reply\nSocraticMethod1 4 points 6 days ago Maybe, maybe not as THEY were targeted by this. They're spinless cowards but a spinless coward is more willing to call in hits if they think THEY will be harmed. permalink parent award report block reply\nSteelDriver 1 points 6 days ago It doesn’t really matter much.  The Rep Senators admit there won’t be enough votes to convict and remove him (even if Murkowski and Collins went along, which seems unlikely).  This is just an effort to expose more behind the scenes activity, much of which we already suspect. permalink parent award report block reply\nThe_Ikonoclast 60 points 6 days ago Wake me up when it actually happens... permalink award report block reply NonbinaryPotatohead 13 points 6 days ago It won't, keep walking. permalink parent award report block reply Area82 -1 points 6 days ago They shouldn’t.  This is a criminal act.  It should be handled by the criminal justice system, not the political system. permalink parent award report block reply Snek_Plissken -4 points 6 days ago Judges have qualified immunity. It’s now clear this was a mistake. The real issue is the democrats don’t care as long as he was performing criminal acts for them. permalink parent award report block reply _Eric_Ciaramella_ 6 points 6 days ago I see you are not new here permalink parent award report block reply Krat 4 points 6 days ago Only democrats hunt and round up the wrong people by thousands and throw them into cells permalink parent award report block reply BigMikesSwingingCock 2 points 6 days ago \"What's a \"due process\"? I haven't heard of that diet, I'm a vegan.\" -Democrats permalink parent award report block reply drattastic1 3 points 6 days ago Enjoy a long long sleep permalink parent award report block reply Belenus 2 points 6 days ago I'll wake you up in 2 weeks, to let you know it will be at least another 2 weeks to go until the next 2 weeks wait. permalink parent award report block reply load 1 more comments...\nNonbinaryPotatohead 13 points 6 days ago It won't, keep walking. permalink parent award report block reply Area82 -1 points 6 days ago They shouldn’t.  This is a criminal act.  It should be handled by the criminal justice system, not the political system. permalink parent award report block reply Snek_Plissken -4 points 6 days ago Judges have qualified immunity. It’s now clear this was a mistake. The real issue is the democrats don’t care as long as he was performing criminal acts for them. permalink parent award report block reply\nArea82 -1 points 6 days ago They shouldn’t.  This is a criminal act.  It should be handled by the criminal justice system, not the political system. permalink parent award report block reply Snek_Plissken -4 points 6 days ago Judges have qualified immunity. It’s now clear this was a mistake. The real issue is the democrats don’t care as long as he was performing criminal acts for them. permalink parent award report block reply\nSnek_Plissken -4 points 6 days ago Judges have qualified immunity. It’s now clear this was a mistake. The real issue is the democrats don’t care as long as he was performing criminal acts for them. permalink parent award report block reply\n_Eric_Ciaramella_ 6 points 6 days ago I see you are not new here permalink parent award report block reply\nKrat 4 points 6 days ago Only democrats hunt and round up the wrong people by thousands and throw them into cells permalink parent award report block reply BigMikesSwingingCock 2 points 6 days ago \"What's a \"due process\"? I haven't heard of that diet, I'm a vegan.\" -Democrats permalink parent award report block reply\nBigMikesSwingingCock 2 points 6 days ago \"What's a \"due process\"? I haven't heard of that diet, I'm a vegan.\" -Democrats permalink parent award report block reply\ndrattastic1 3 points 6 days ago Enjoy a long long sleep permalink parent award report block reply\nBelenus 2 points 6 days ago I'll wake you up in 2 weeks, to let you know it will be at least another 2 weeks to go until the next 2 weeks wait. permalink parent award report block reply\nNonbinaryPotatohead 33 points 6 days ago 2 weeks, I want the strongly worded letter on my desk. permalink award report block reply maverick202 6 points 6 days ago Best we can do is send strongly worded tweet. permalink parent award report block reply Spuck_Fez 2 points 6 days ago And maybe a strongly worded Fox News interview permalink parent award report block reply UCantStumpTheTrump 0 points 6 days ago The guy you’re replying to is a shill here to sow discontent permalink parent award report block reply NonbinaryPotatohead 0 points 6 days ago acceptable! permalink parent award report block reply possibletower -6 points 6 days ago Nice try but refusing to blame the \"based Founding Fathers\" for setting the 2/3 Senate rule for impeachment and cockblocking presidents from being able to do much in domestic policy and also giving us \"muh based states' rights\" which leads to rigged elections and giving illegal aliens driver's licenses. permalink parent award report block reply maverick202 4 points 6 days ago Nice Kamala like word salad, son. permalink parent award report block reply MAGARondonmonson 3 points 6 days ago They were correct, if they set it up like you wanted it think of the chaos, Dems win house and senate, they use the majorities on those to bodies and all of the sudden all 6 of the Supreme Court Justices who are conservative would be gone as well as all of the FEDERAL JUSTICES in Districts 1-11. We can via a trial prove he is guilty easily. If they keep him in, then there is a way to defund them. permalink parent award report block reply Bythrfruitsyknow 2 points 6 days ago Yes, because having simple majority impeachment of judges and supreme court justices is a good idea.  Having seen the left's recent commentary do you think Justice Thomas or Justice  Kavanaugh would be still seated? Shouldn't you be out there solving unsolved crimes, genius? permalink parent award report block reply possibletower -5 points 6 days ago 2/3 Senate vote needed. But faggots here don't want to criticize the \"based Founding Fathers\" who put that in the Constitution. I will start taking people seriously when they start calling out the Constitutional Convention as much as they do when they bitch about Trump. If Trump is worthy of getting blamed then their precious \"based Founding Fathers\" really need to get assblasted for the impeachment threshold and cockblocking Trump from doing much in domestic policy like they give the presidents dictatorial power with regards to foreign policy and many other problems with the Constitution. The Constitution's \"muh based states' rights\" is why states are able to rig elections and give illegal aliens driver's licenses. permalink parent award report block reply NonbinaryPotatohead -3 points 6 days ago MAGA doesn't want to play the game, they are too busy getting compromised in sex scandals on tape in foreign lands. They could win if they gave a shit but clearly all they care about is the status quo. Feels just like the W. Bush era right now. permalink parent award report block reply\nmaverick202 6 points 6 days ago Best we can do is send strongly worded tweet. permalink parent award report block reply Spuck_Fez 2 points 6 days ago And maybe a strongly worded Fox News interview permalink parent award report block reply UCantStumpTheTrump 0 points 6 days ago The guy you’re replying to is a shill here to sow discontent permalink parent award report block reply NonbinaryPotatohead 0 points 6 days ago acceptable! permalink parent award report block reply possibletower -6 points 6 days ago Nice try but refusing to blame the \"based Founding Fathers\" for setting the 2/3 Senate rule for impeachment and cockblocking presidents from being able to do much in domestic policy and also giving us \"muh based states' rights\" which leads to rigged elections and giving illegal aliens driver's licenses. permalink parent award report block reply maverick202 4 points 6 days ago Nice Kamala like word salad, son. permalink parent award report block reply MAGARondonmonson 3 points 6 days ago They were correct, if they set it up like you wanted it think of the chaos, Dems win house and senate, they use the majorities on those to bodies and all of the sudden all 6 of the Supreme Court Justices who are conservative would be gone as well as all of the FEDERAL JUSTICES in Districts 1-11. We can via a trial prove he is guilty easily. If they keep him in, then there is a way to defund them. permalink parent award report block reply Bythrfruitsyknow 2 points 6 days ago Yes, because having simple majority impeachment of judges and supreme court justices is a good idea.  Having seen the left's recent commentary do you think Justice Thomas or Justice  Kavanaugh would be still seated? Shouldn't you be out there solving unsolved crimes, genius? permalink parent award report block reply\nSpuck_Fez 2 points 6 days ago And maybe a strongly worded Fox News interview permalink parent award report block reply UCantStumpTheTrump 0 points 6 days ago The guy you’re replying to is a shill here to sow discontent permalink parent award report block reply\nUCantStumpTheTrump 0 points 6 days ago The guy you’re replying to is a shill here to sow discontent permalink parent award report block reply\nNonbinaryPotatohead 0 points 6 days ago acceptable! permalink parent award report block reply\npossibletower -6 points 6 days ago Nice try but refusing to blame the \"based Founding Fathers\" for setting the 2/3 Senate rule for impeachment and cockblocking presidents from being able to do much in domestic policy and also giving us \"muh based states' rights\" which leads to rigged elections and giving illegal aliens driver's licenses. permalink parent award report block reply maverick202 4 points 6 days ago Nice Kamala like word salad, son. permalink parent award report block reply MAGARondonmonson 3 points 6 days ago They were correct, if they set it up like you wanted it think of the chaos, Dems win house and senate, they use the majorities on those to bodies and all of the sudden all 6 of the Supreme Court Justices who are conservative would be gone as well as all of the FEDERAL JUSTICES in Districts 1-11. We can via a trial prove he is guilty easily. If they keep him in, then there is a way to defund them. permalink parent award report block reply Bythrfruitsyknow 2 points 6 days ago Yes, because having simple majority impeachment of judges and supreme court justices is a good idea.  Having seen the left's recent commentary do you think Justice Thomas or Justice  Kavanaugh would be still seated? Shouldn't you be out there solving unsolved crimes, genius? permalink parent award report block reply\nmaverick202 4 points 6 days ago Nice Kamala like word salad, son. permalink parent award report block reply\nMAGARondonmonson 3 points 6 days ago They were correct, if they set it up like you wanted it think of the chaos, Dems win house and senate, they use the majorities on those to bodies and all of the sudden all 6 of the Supreme Court Justices who are conservative would be gone as well as all of the FEDERAL JUSTICES in Districts 1-11. We can via a trial prove he is guilty easily. If they keep him in, then there is a way to defund them. permalink parent award report block reply\nBythrfruitsyknow 2 points 6 days ago Yes, because having simple majority impeachment of judges and supreme court justices is a good idea.  Having seen the left's recent commentary do you think Justice Thomas or Justice  Kavanaugh would be still seated? Shouldn't you be out there solving unsolved crimes, genius? permalink parent award report block reply\npossibletower -5 points 6 days ago 2/3 Senate vote needed. But faggots here don't want to criticize the \"based Founding Fathers\" who put that in the Constitution. I will start taking people seriously when they start calling out the Constitutional Convention as much as they do when they bitch about Trump. If Trump is worthy of getting blamed then their precious \"based Founding Fathers\" really need to get assblasted for the impeachment threshold and cockblocking Trump from doing much in domestic policy like they give the presidents dictatorial power with regards to foreign policy and many other problems with the Constitution. The Constitution's \"muh based states' rights\" is why states are able to rig elections and give illegal aliens driver's licenses. permalink parent award report block reply NonbinaryPotatohead -3 points 6 days ago MAGA doesn't want to play the game, they are too busy getting compromised in sex scandals on tape in foreign lands. They could win if they gave a shit but clearly all they care about is the status quo. Feels just like the W. Bush era right now. permalink parent award report block reply\nNonbinaryPotatohead -3 points 6 days ago MAGA doesn't want to play the game, they are too busy getting compromised in sex scandals on tape in foreign lands. They could win if they gave a shit but clearly all they care about is the status quo. Feels just like the W. Bush era right now. permalink parent award report block reply\nSparks1017 18 points 6 days ago But would still require 2/3 rds of Senate? Am I right about that? I think if he were just hanged, that would work permalink award report block reply dataonly 8 points 6 days ago Might find a sympathetic ear on this particular subject. Many of the old Senators have loyalty to the Senate.  Even rational Dems are thinking what if an R leaning judge seized my phone records.  Because, they know what would be found. permalink parent award report block reply rebuildingMyself 13 points 6 days ago There won't ever be enough Democrats to go along with this because even the RINOs want Trump obstructed whenever possible permalink parent award report block reply dataonly 6 points 6 days ago You may be right, but this is a different sort of issue.  This is a Judge going after members of the Senate.  That can work both ways. I could see enough Dems wanting to send a message on this subject to the judiciary. But again, you may be right. permalink parent award report block reply current_horror 4 points 6 days ago Nope. Democrats rely on their installed kings in black robes to unilaterally rule over the country. Dems will never check their own power. permalink parent award report block reply Kraken_V_Algorithm 2 points 6 days ago Most of them know who the targets are and can count on not being one if they vote the right way. permalink parent award report block reply rebuildingMyself 1 points 6 days ago In a just world, you would be correct. But knowing the Uniparty all the insane judicial activism magically goes away once the right people are back in control permalink parent award report block reply Sgt_Hulka 4 points 6 days ago The day a republican judge does this will be the day snow falls in hell. Republicans are the Washington Generals to the Democrats Harlem Globtrotters. permalink parent award report block reply Sparks1017 1 points 6 days ago Yeah, That's a good point permalink parent award report block reply 559throw 1 points 6 days ago LMAO ain't no goddamned Republican gonna do any of that. What the fuck are you smoking? Pass it over permalink parent award report block reply Area82 2 points 6 days ago It would permalink parent award report block reply WassermanSchultz 1 points 6 days ago Yes.  Nothing will happen.  It's just for show. permalink parent award report block reply possibletower -5 points 6 days ago Retards here don't want to talk about 2/3 Senate because that means they will have to criticize the Founding Fathers and they aren't allowed to criticize about \"much based Constitution\" permalink parent award report block reply dataonly 3 points 6 days ago The Founding Fathers intentionally made \"removal after impeachment\" a necessarily high bar to reduce the political nature of the process itself. i.e. It would be possible to garner a slim majority and vote as a block.  But requiring 2/3 all but eliminates that possibility. permalink parent award report block reply ragnarokrobo 2 points 6 days ago Same as when everyone was screaming about impeaching Biden like it'd ever get through the senate. permalink parent award report block reply\ndataonly 8 points 6 days ago Might find a sympathetic ear on this particular subject. Many of the old Senators have loyalty to the Senate.  Even rational Dems are thinking what if an R leaning judge seized my phone records.  Because, they know what would be found. permalink parent award report block reply rebuildingMyself 13 points 6 days ago There won't ever be enough Democrats to go along with this because even the RINOs want Trump obstructed whenever possible permalink parent award report block reply dataonly 6 points 6 days ago You may be right, but this is a different sort of issue.  This is a Judge going after members of the Senate.  That can work both ways. I could see enough Dems wanting to send a message on this subject to the judiciary. But again, you may be right. permalink parent award report block reply current_horror 4 points 6 days ago Nope. Democrats rely on their installed kings in black robes to unilaterally rule over the country. Dems will never check their own power. permalink parent award report block reply Kraken_V_Algorithm 2 points 6 days ago Most of them know who the targets are and can count on not being one if they vote the right way. permalink parent award report block reply rebuildingMyself 1 points 6 days ago In a just world, you would be correct. But knowing the Uniparty all the insane judicial activism magically goes away once the right people are back in control permalink parent award report block reply Sgt_Hulka 4 points 6 days ago The day a republican judge does this will be the day snow falls in hell. Republicans are the Washington Generals to the Democrats Harlem Globtrotters. permalink parent award report block reply Sparks1017 1 points 6 days ago Yeah, That's a good point permalink parent award report block reply 559throw 1 points 6 days ago LMAO ain't no goddamned Republican gonna do any of that. What the fuck are you smoking? Pass it over permalink parent award report block reply\nrebuildingMyself 13 points 6 days ago There won't ever be enough Democrats to go along with this because even the RINOs want Trump obstructed whenever possible permalink parent award report block reply dataonly 6 points 6 days ago You may be right, but this is a different sort of issue.  This is a Judge going after members of the Senate.  That can work both ways. I could see enough Dems wanting to send a message on this subject to the judiciary. But again, you may be right. permalink parent award report block reply current_horror 4 points 6 days ago Nope. Democrats rely on their installed kings in black robes to unilaterally rule over the country. Dems will never check their own power. permalink parent award report block reply Kraken_V_Algorithm 2 points 6 days ago Most of them know who the targets are and can count on not being one if they vote the right way. permalink parent award report block reply rebuildingMyself 1 points 6 days ago In a just world, you would be correct. But knowing the Uniparty all the insane judicial activism magically goes away once the right people are back in control permalink parent award report block reply\ndataonly 6 points 6 days ago You may be right, but this is a different sort of issue.  This is a Judge going after members of the Senate.  That can work both ways. I could see enough Dems wanting to send a message on this subject to the judiciary. But again, you may be right. permalink parent award report block reply current_horror 4 points 6 days ago Nope. Democrats rely on their installed kings in black robes to unilaterally rule over the country. Dems will never check their own power. permalink parent award report block reply Kraken_V_Algorithm 2 points 6 days ago Most of them know who the targets are and can count on not being one if they vote the right way. permalink parent award report block reply rebuildingMyself 1 points 6 days ago In a just world, you would be correct. But knowing the Uniparty all the insane judicial activism magically goes away once the right people are back in control permalink parent award report block reply\ncurrent_horror 4 points 6 days ago Nope. Democrats rely on their installed kings in black robes to unilaterally rule over the country. Dems will never check their own power. permalink parent award report block reply\nKraken_V_Algorithm 2 points 6 days ago Most of them know who the targets are and can count on not being one if they vote the right way. permalink parent award report block reply\nrebuildingMyself 1 points 6 days ago In a just world, you would be correct. But knowing the Uniparty all the insane judicial activism magically goes away once the right people are back in control permalink parent award report block reply\nSgt_Hulka 4 points 6 days ago The day a republican judge does this will be the day snow falls in hell. Republicans are the Washington Generals to the Democrats Harlem Globtrotters. permalink parent award report block reply\nSparks1017 1 points 6 days ago Yeah, That's a good point permalink parent award report block reply\n559throw 1 points 6 days ago LMAO ain't no goddamned Republican gonna do any of that. What the fuck are you smoking? Pass it over permalink parent award report block reply\nArea82 2 points 6 days ago It would permalink parent award report block reply\nWassermanSchultz 1 points 6 days ago Yes.  Nothing will happen.  It's just for show. permalink parent award report block reply\npossibletower -5 points 6 days ago Retards here don't want to talk about 2/3 Senate because that means they will have to criticize the Founding Fathers and they aren't allowed to criticize about \"much based Constitution\" permalink parent award report block reply dataonly 3 points 6 days ago The Founding Fathers intentionally made \"removal after impeachment\" a necessarily high bar to reduce the political nature of the process itself. i.e. It would be possible to garner a slim majority and vote as a block.  But requiring 2/3 all but eliminates that possibility. permalink parent award report block reply ragnarokrobo 2 points 6 days ago Same as when everyone was screaming about impeaching Biden like it'd ever get through the senate. permalink parent award report block reply\ndataonly 3 points 6 days ago The Founding Fathers intentionally made \"removal after impeachment\" a necessarily high bar to reduce the political nature of the process itself. i.e. It would be possible to garner a slim majority and vote as a block.  But requiring 2/3 all but eliminates that possibility. permalink parent award report block reply\nragnarokrobo 2 points 6 days ago Same as when everyone was screaming about impeaching Biden like it'd ever get through the senate. permalink parent award report block reply\nRyunnsun 9 points 6 days ago Let's impeach the rest of the judges who approved surveillance of  Americans for political points. permalink award report block reply elc0 1 points 6 days ago Lol. permalink parent award report block reply\nelc0 1 points 6 days ago Lol. permalink parent award report block reply\nLiberty49220 7 points 6 days ago If a Republican congressman represents your district,  it only takes a few minutes to contact them to support this. permalink award report block reply Sparks1017 4 points 6 days ago Me and my Rep are on a first name basis, he's cool and a Patriot permalink parent award report block reply\nSparks1017 4 points 6 days ago Me and my Rep are on a first name basis, he's cool and a Patriot permalink parent award report block reply\nMissingTrump 6 points 6 days ago Trial and punishment. Enough of this strongly worded letters bs. permalink award report block reply\nOdyssey 6 points 6 days ago Requires 67 Senate votes to remove him as a judge. I am tired of these dog whistles. permalink award report block reply bonejack 2 points 6 days ago It is the equivalent of a guy talking tough because he knows his friends will just hold him back, when the fight actually breaks out. permalink parent award report block reply\nbonejack 2 points 6 days ago It is the equivalent of a guy talking tough because he knows his friends will just hold him back, when the fight actually breaks out. permalink parent award report block reply\nKlown_Kutz 5 points 6 days ago Whoa! This is getting out of sternly worded letters territory. What about muh optics? permalink award report block reply\nLogan051361 5 points 6 days ago Why not arrest??? WTF? permalink award report block reply\nkeeptherepublic1776 5 points 6 days ago Notice they only act when they are affected. They don't care about the people permalink award report block reply Lurker404 2 points 6 days ago Don't they need 2/3 of the votes for an impeachment? That means they need Dem votes. They'd never vote with Reps unless they are personally affected. permalink parent award report block reply\nLurker404 2 points 6 days ago Don't they need 2/3 of the votes for an impeachment? That means they need Dem votes. They'd never vote with Reps unless they are personally affected. permalink parent award report block reply\nDCYR66 4 points 6 days ago He won’t. Our DOJ all talk no action. permalink award report block reply\nIForgotToAddAnEmail 4 points 6 days ago I'm sure they plan a lot of things. permalink award report block reply\nDouble_D 3 points 6 days ago They wouldn’t impeach him for overseeing a multitude of illegal activity on the FISA court, including spying on the Trump campaign, wouldn’t impeach him over  his handling of the Klinesmith case or any of these more recent overreaches but, as soon as it’s revealed he fucked with them , he has to go. The vast majority of the GOP are self interested faggots permalink award report block reply Lurker404 1 points 6 days ago That's because they need some Dem votes for an impeachment AFAIK. permalink parent award report block reply Double_D 1 points 6 days ago Right, but why no calls for impeachment for all the other illegal activity? Do they really think they’re more likely to get 2/3 of the senate now than they were before? permalink parent award report block reply Lurker404 1 points 6 days ago Because all the other shit only affected Trump. They'd sooner give him a medal for that than vote with Republicans. This one affects senators. They might feel more inclined to vote in their own interest but I doubt it. permalink parent award report block reply Double_D 1 points 6 days ago One, Boasberg’s transgressions on the FISA court go way beyond Trump. While he was on the court, it was discovered that the FBI was illegally searching the NSA database for thousands of redacted individuals’ communications and giving the information to redacted contractors, going back to at least 2010. He did absolutely nothing about it. Two, Senate GOP leadership and Trump aren’t on the same team. Their overall interests are much more aligned with Dem leadership than with Trump’s. Their ultimate goal is to protect a system that enriches themselves and the billionaires who pay for their campaigns. permalink parent award report block reply Snek_Plissken -6 points 6 days ago I don’t even know about that. This is Boarsheadburger. Him and his family are all up in the NGO scheme. You don’t get all that usaids without connections. He is their dog on a leash and he is immune from legal harm.  Anyone who believes he acted independently as an idiot. They absolutely colluded and orchestrated several judges and state attorneys to make a kabuki theatre of the law. permalink parent award report block reply\nLurker404 1 points 6 days ago That's because they need some Dem votes for an impeachment AFAIK. permalink parent award report block reply Double_D 1 points 6 days ago Right, but why no calls for impeachment for all the other illegal activity? Do they really think they’re more likely to get 2/3 of the senate now than they were before? permalink parent award report block reply Lurker404 1 points 6 days ago Because all the other shit only affected Trump. They'd sooner give him a medal for that than vote with Republicans. This one affects senators. They might feel more inclined to vote in their own interest but I doubt it. permalink parent award report block reply Double_D 1 points 6 days ago One, Boasberg’s transgressions on the FISA court go way beyond Trump. While he was on the court, it was discovered that the FBI was illegally searching the NSA database for thousands of redacted individuals’ communications and giving the information to redacted contractors, going back to at least 2010. He did absolutely nothing about it. Two, Senate GOP leadership and Trump aren’t on the same team. Their overall interests are much more aligned with Dem leadership than with Trump’s. Their ultimate goal is to protect a system that enriches themselves and the billionaires who pay for their campaigns. permalink parent award report block reply\nDouble_D 1 points 6 days ago Right, but why no calls for impeachment for all the other illegal activity? Do they really think they’re more likely to get 2/3 of the senate now than they were before? permalink parent award report block reply Lurker404 1 points 6 days ago Because all the other shit only affected Trump. They'd sooner give him a medal for that than vote with Republicans. This one affects senators. They might feel more inclined to vote in their own interest but I doubt it. permalink parent award report block reply Double_D 1 points 6 days ago One, Boasberg’s transgressions on the FISA court go way beyond Trump. While he was on the court, it was discovered that the FBI was illegally searching the NSA database for thousands of redacted individuals’ communications and giving the information to redacted contractors, going back to at least 2010. He did absolutely nothing about it. Two, Senate GOP leadership and Trump aren’t on the same team. Their overall interests are much more aligned with Dem leadership than with Trump’s. Their ultimate goal is to protect a system that enriches themselves and the billionaires who pay for their campaigns. permalink parent award report block reply\nLurker404 1 points 6 days ago Because all the other shit only affected Trump. They'd sooner give him a medal for that than vote with Republicans. This one affects senators. They might feel more inclined to vote in their own interest but I doubt it. permalink parent award report block reply Double_D 1 points 6 days ago One, Boasberg’s transgressions on the FISA court go way beyond Trump. While he was on the court, it was discovered that the FBI was illegally searching the NSA database for thousands of redacted individuals’ communications and giving the information to redacted contractors, going back to at least 2010. He did absolutely nothing about it. Two, Senate GOP leadership and Trump aren’t on the same team. Their overall interests are much more aligned with Dem leadership than with Trump’s. Their ultimate goal is to protect a system that enriches themselves and the billionaires who pay for their campaigns. permalink parent award report block reply\nDouble_D 1 points 6 days ago One, Boasberg’s transgressions on the FISA court go way beyond Trump. While he was on the court, it was discovered that the FBI was illegally searching the NSA database for thousands of redacted individuals’ communications and giving the information to redacted contractors, going back to at least 2010. He did absolutely nothing about it. Two, Senate GOP leadership and Trump aren’t on the same team. Their overall interests are much more aligned with Dem leadership than with Trump’s. Their ultimate goal is to protect a system that enriches themselves and the billionaires who pay for their campaigns. permalink parent award report block reply\nSnek_Plissken -6 points 6 days ago I don’t even know about that. This is Boarsheadburger. Him and his family are all up in the NGO scheme. You don’t get all that usaids without connections. He is their dog on a leash and he is immune from legal harm.  Anyone who believes he acted independently as an idiot. They absolutely colluded and orchestrated several judges and state attorneys to make a kabuki theatre of the law. permalink parent award report block reply\n16BeatsAOne 3 points 6 days ago Judge Beryl Howell has to be next on the Impeachment List. permalink award report block reply\nYearninNation 3 points 6 days ago Pam Bondi will be the reason Trump's second term will be a spectacular failure that gives vote riggers all the power they need to end the American experiment. permalink award report block reply\nRudeFrog 3 points 6 days ago Republicans are not going to do anything but talk. They will bullshit their way into losing the midterm like always. Because they are America last losers. Stop being played by them. permalink award report block reply\npatrioticwinning3 3 points 6 days ago Believe it when I see it... permalink award report block reply\nJoeBidensDementia1 2 points 6 days ago They ain't planning on doing shit permalink award report block reply\nSeldom_Seen_Kid 2 points 6 days ago Impeachment means nothing…jail his ass!! permalink award report block reply\nFlyCatcher94 2 points 6 days ago NOW they act since it’s their shit being fuxked with. Assholes permalink award report block reply\nbonejack 2 points 6 days ago 'Member when the gop had all that evidence against Biden and his family, just before the midterms saying stuff like \"we caught'em, it's all a shell game.\" or \"this president is the most corrupt president ever. We will impeach him, right after the midterms.\" Then absolutely nothing happened. I 'member. permalink award report block reply\ncbonez416 2 points 6 days ago This is something I believe when I see. Because all I've seen is nothing but harsh words from the GOP and the Republican party. These people don't have any balls. They don't have any touch on reality and they have absolutely zero gauge on the culture. permalink award report block reply\nA_Colostomy_Bag 2 points 6 days ago They should be impeaching dozens of judges who are conspiring against Trump and the country. permalink award report block reply\nTrumpwon306 2 points 6 days ago Nothing will come of this. Ignore this. Shame any retard who even shares this 'news' The only practical and half-feasable solution is to defund and dismantle the circuit courts and then reestablish them, nominating strict traditionalists. Anything else is just a ploy. permalink award report block reply\npookiee68 2 points 6 days ago NO WAY the RINO losers who make up the majority of Republicans do ANYTHING, the Democrats who own them won't allow it. permalink award report block reply\nFangerang 2 points 6 days ago Need more doing and less talking, planning, and strongly worded letters. permalink award report block reply\nSurgeon 2 points 6 days ago They'll promote him . The SWAMP never prosecutes the deep stater commie traitors .  He'll be promoted to Chief Judge at Supreme court next . Why doesn't congress enact Trumps EO's instead of wasting taxpayer funds on this shit ? MAGA voted for change / DRAIN THE SWAMP permalink award report block reply\nmass55th 2 points 6 days ago Don't fucking talk about it...just do it!! permalink award report block reply\nAllTheWayTrump 2 points 6 days ago So they'll  do something when their rights are abused, but when it's Trumps or ordinary Americans they couldn't give 2 fucks. permalink award report block reply\nthp2034 2 points 6 days ago Not until it happened to them. They have had this same power to impeach & remove a judge since day one. Why didn't any of them step up and file impeachment papers on any of the rouge district court judges that came after the President? It's not to late, anyone of them can still do it...why aren't they? permalink award report block reply\nForty_Five 2 points 6 days ago \"plan to\" Which means literally nothing. In fact it's evidence against them actually doing anything. permalink award report block reply\nSurveilThis 2 points 6 days ago Typical shit. Senators never do a single thing until it happens to them directly. Spy on your party’s sitting President? Here’s a strongly worded letter. Spy on my Senate accounts? Here’s two strongly worded letters. permalink award report block reply\nAVeryNakedMan 1 points 6 days ago The impeachment is a scam. Republicans know it won't remove him because it won't pass the Senate. We need the Republican majority in Congress to abolish the judge's court and re-institute it with a new judicial opening, via passing a new law. This will remove him from his position with a simple majority vote in Congress. No impeachment is required. permalink award report block reply\nDoMe22 1 points 6 days ago Yeah, this ain't happening. Trump is the only useful republican. permalink award report block reply\nBoughtByBloomberg2 1 points 6 days ago Plan to strongly consider discussion the options of potentially doing something. permalink award report block reply\nRakkasan91b 1 points 6 days ago I love that these losers can't be bothered to ever even go through the motions of impeaching any of these judges who have been blatantly corrupt, usurping power, or making blatantly political decisions that have affected hundreds of thousands of people for years.  Yet, now that one of the judges did something that affects some of them they are now so suddenly eager to impeach someone. permalink award report block reply\nTacitus1963 1 points 6 days ago The Republicans will do jack schitt as they always do especially when it's PDJT who is in office.\nThey are beyond useless. permalink award report block reply\n2016TrumpMAGA 1 points 6 days ago Fuck impeaching him, arrest the faggot. permalink award report block reply\nSilentSniper 1 points 6 days ago Do it already you worthless spineless fucks. DO IT permalink award report block reply\njiujiujiu 1 points 6 days ago How many votes does it take to remove an impeached judge from office? permalink award report block reply\nonesummerdream 1 points 6 days ago We got ‘em now! Or tomorrow!! Okay next week then!!! Two weeks MAX! Pinky swearsies. permalink award report block reply\nbigfatnagger 1 points 6 days ago Fucking a. What do you mean \"plan\" permalink award report block reply\n24601 1 points 6 days ago This is not enough. Weak knees give strength to the Communists currently taking over the country. permalink award report block reply\nYakhechos 1 points 6 days ago They won't do shit. Mark my words. permalink award report block reply\nmateus 1 points 6 days ago This is the kind of corrupt judge the Dems have on speed dial. And I bet he's going nowhere. permalink award report block reply\nwhataboob 1 points 6 days ago But nothing on the J6 judges and prosecutors… Just tapping a senators phone is worse to these Senator maggots than holding hundreds of Americans hostage in prison for years. permalink award report block reply\nHunterBidensPC 1 points 6 days ago Judge clearly attacks patriots around the country Crickets Judge attacks Congress members IMPEACHMENT!! Can we just nuke the entire judicial and legislative branches and start from scratch? permalink award report block reply\nWupta PRO 1 points 6 days ago Sure it’s okay to hit Trump their asses oh now we’re offended. permalink award report block reply\nparamour 1 points 6 days ago Eww. Demon poster child. permalink award report block reply\nMelsura67 1 points 6 days ago Skeletor!!! permalink award report block reply\nfortyfive4fourmore 1 points 6 days ago Yeah well I plan to purchase the USA and kick everyone out but me and my dog. That'll show em. Taking bets on which one happens first. So far it's a toss up. permalink award report block reply\nxanax123 1 points 6 days ago Yes, we know. It’s been posted every day…what is new about this exactly? Did you just hear that Charlie Kirk was shot too? permalink award report block reply\nTheDevilMonkey 1 points 6 days ago Kabuki Theater. Everything is fake and gay. permalink award report block reply\nInduceddrag 1 points 6 days ago Boasberg has spent his judicial career trampling the rights of Americans, but he found a way to get the attention of Congress.\nOf course if Congress wanted to impeach somebody for subpoenaing their phone records maybe they should go after Schiff.  He pulled phone records on the minority members of his own house committee. permalink award report block reply\nLynn4303 1 points 6 days ago They plan? Talk to me when they do it permalink award report block reply\nTheDevilMonkey 1 points 6 days ago 👃 permalink award report block reply\nPats5x 1 points 6 days ago shouldve been done months ago....gop is just running out the clock until they get blasted in the midterms and lose the house by D+25 permalink award report block reply\nFollowd 1 points 6 days ago Plan away! Start with a firm harshly worded letter and also go on Faux News to let everyone know what your going to do! Then when you dont do it, at least everyone will know what you were GONNA do! permalink award report block reply\nredneckrevival 1 points 6 days ago LMAO, ain't shit gonna happen. permalink award report block reply\nTheArchAngel 1 points 6 days ago I don't care what they \"plan\" to do. until they actually do it, I'll consider them as the cowards they are. permalink award report block reply\ndonteatthat 1 points 6 days ago Not gonna happen permalink award report block reply\nLolitaExpressPilot 1 points 6 days ago If by 'impeach' you mean hang for treason.... permalink award report block reply\ncurrent_horror 1 points 6 days ago Citizen: I’m filing a freedom of information request for my senator’s official govt communications FISA judge: sorry, congress are not subject to FOIA requests Democrats: hey yo, can we borrow the illegal NSA database to spy on our political opponents? FISA judge: fuck yeah, let’s goooooo permalink award report block reply\nLol_Garrus 1 points 6 days ago Judicial tyranny against Trump? ❌ Breaking 8th Amendment rights of Conservatives? ❌ Clear bias and conflict of interest ❌ He allowed radical left DOJ to spy on Senator's phones. ✅ \"Whoa, now we gotta impeach this guy!\" permalink award report block reply\nstealthboy 1 points 6 days ago Spoiler alert:  They won't.  Nothing will happen. permalink award report block reply\nDCYR66 1 points 6 days ago Meanwhile in Ukraine! permalink award report block reply\nmedicpatriot 1 points 6 days ago Yeah I’m sure we’ll get that right along with the Epstein files permalink award report block reply\nOrangeManNotBad 1 points 6 days ago So many RINO's, not a chance of impeachment. permalink award report block reply\nLostElf 1 points 6 days ago How utterly pointless and typical. Doesn't the DOJ have enough for a dawn raid? Anyway when they deport him back to the Carpathian Mountains remember the soil in the casket has to be from the original burial site. permalink award report block reply\nsgttoporbottoms 1 points 6 days ago Of course they’ll do it when it’s their asses getting spied on. Just never if it’s a popularly elected president. permalink award report block reply\nredneckrevival 1 points 6 days ago LMAO, ain't shit gonna happen. permalink award report block reply\ndrmrboy 1 points 6 days ago TWO!!!!!!!!  🤓 permalink award report block reply\nLiteraIIyHitIer 1 points 6 days ago I wait 2 weeks in the morning I wait 2 weeks at night I wait 2 weeks in the afternoon, it makes me feel alright I wait 2 weeks in time of peace and 2 in time of war I wait 2 weeks before I wait 2 weeks And then I wait 2 more permalink award report block reply\nAlldayeveryday 1 points 6 days ago More bullshit talk permalink award report block reply\nMotownmow 1 points 6 days ago in case you're wondering, yes he is permalink award report block reply\nSaxonRealm 1 points 6 days ago Impeach and then arrest and imprison. permalink award report block reply\nhey_spike 1 points 6 days ago Can we at least take away his parking spot. Also find some way to stop important cases from going to him. permalink award report block reply\nSychinlegacy 1 points 6 days ago Even if they did, which they won’t, the democrats will just aquit him. Impeaching is pointless. Just fucking arrest him and throw him into Guantanamo. permalink award report block reply\nGrindelwald 1 points 6 days ago NOW Congress is pissed.  Not when this judge was making up law to get-Trump.  Only when it comes to them permalink award report block reply\nKricket 1 points 6 days ago Just fucking do it. permalink award report block reply\nThunderGatti 1 points 6 days ago Those dickless cowards won't do shit permalink award report block reply\nmty_green_go 1 points 6 days ago funny they didnt care when turd burglar was railroading Trump but as soon as it happens to them they get upset permalink award report block reply\nJoePlumber 1 points 6 days ago Impeachment is a sham it will never reach 2/3 majority. They must remove him some other way like saying this is bad behavior with a simple majority vote. permalink award report block reply\nKrat 1 points 6 days ago 0 arrests permalink award report block reply\nOrangeCatBad 1 points 6 days ago No just remove for bad behavior, that doesnt require 2/3 permalink award report block reply\nBABA-YAGA 1 points 6 days ago Waste of time.  Takes 67 in the Senate and the GOP knows they will never get it.  Just more performative Kabuki theater to try and trick the base into thinking they are doing something other than obstructing Trump at every turn. permalink award report block reply\nwhiter5fx 1 points 6 days ago So do it already permalink award report block reply\nBythrfruitsyknow 1 points 6 days ago Note: They are not planning to impeach any of the federal judges involved in spying on President Trump's administration, or President Trump himself; They haven't even suggested it. They just are targeting the ones that attempted to spy on them. permalink award report block reply\nChickensaurus 1 points 6 days ago Gay. They'll drag their feet until Dems are back in charge. permalink award report block reply\nBusterHyman99 1 points 6 days ago Notice they will impeach when it involves them but with Trump we just can't break norms and regulations permalink award report block reply\nChyNahAzzWhole1 1 points 6 days ago I wont hold my breath. permalink award report block reply\nyummy_yumm_yumms 1 points 6 days ago Why even say anything? So fucking dumb, all talk. We should be hearing that it's happened, not that they plan on doing it. permalink award report block reply\nThouShallNotSteal 1 points 6 days ago No. You drag him into the street and allow the street shitters to shit all over him. Then you drag him behind a NYC garbage truck that is blaring YMCA on the radio. permalink award report block reply\ncptkloss5 1 points 6 days ago close to a year in power...zero real action... by now there should have been 500 boasbergs removed. permalink award report block reply\nLiberalism_is_mental 1 points 6 days ago A sternly worded threat will definitely stop the Democrat criminals. permalink award report block reply\nSpellmonger 1 points 6 days ago Republicans plan to impeach Judge Boasberg OF COURSE THEY ARE PLANNING Judge Boasberg is appointed, NOT ELECTED. So they can use him to distract us from trying to force them to secure our elections, and in the end, whether he stays or goes will be orchestrated by Thune and Schumer without a thought of his crimes against We The People. permalink award report block reply\nDev404 1 points 6 days ago Judges rubber stamp illegal shit all the time, based on no or unreliable evidence. Russiagate, anyone? Did anyone pay for that yet? Not really. permalink award report block reply\nNoWorries77 1 points 6 days ago Impeach?\nWHEN ?!!!!!?? permalink award report block reply\nHenkZeilstra 1 points 6 days ago Plan? Fucking do it, don't talk just suprise us permalink award report block reply\nPoohClimbsTrees 1 points 6 days ago They will huff and puff, then not actually do anything Our Republic seems in a dark place it may never recover from. permalink award report block reply\nMaganifice7 1 points 6 days ago Two more weeks. permalink award report block reply\nRyanKeyOh 1 points 6 days ago GET TO IT permalink award report block reply\nBigE123456 1 points 6 days ago The irony of the outrage from Congressmen and women when their rights are unconstitutionally violated. Peasant citizens be damned! J6? permalink award report block reply\nKrat 1 points 6 days ago 0 arrests permalink award report block reply\nTrue_Curmudgeon 1 points 6 days ago If they don't do it over this what will they do it over? permalink award report block reply\nScot 0 points 6 days ago They were perfectly fine with him ILLEGALLY persecuting and trying to destroy President Trump though. permalink award report block reply\n559throw 0 points 6 days ago Two more weeks! Until nothing happens permalink award report block reply\nTitanium5 0 points 6 days ago Only when it effects them, not us. Right? permalink award report block reply\n5DchessWatch 0 points 6 days ago In his defense, when the deepstate asked him to approve somepenis he was very eager because he loves somepenis permalink award report block reply\nchahn1138 0 points 6 days ago And not all the other Treasonous Shit that that Motherfucker has done! RINOs needs to be buried under the jail! permalink award report block reply\nNewBurner04 0 points 6 days ago Take your time permalink award report block reply\nPOTUS_DonnieJ 0 points 6 days ago Cool, so we might, but probably won’t get 1 judge out of a few dozen? permalink award report block reply\nWexit-Delecto 0 points 6 days ago At the rate of one judge per year, there will be a grand total of FOUR impeached far left judges by the end of President Trump's term. Drain the swamp! permalink award report block reply\nHumphreyPlowjogger 0 points 6 days ago Do it already. permalink award report block reply\nMizzBlackSwan 0 points 6 days ago Ooooh- impeachment!  What a harsh punishment! permalink award report block reply mailinvoter 2 points 6 days ago You missed the most important part - \"plan\" aka \"isn't going to happen\". permalink parent award report block reply\nmailinvoter 2 points 6 days ago You missed the most important part - \"plan\" aka \"isn't going to happen\". permalink parent award report block reply\nComeon4954 0 points 6 days ago Great, fucking get on with it then. Do nothing\n, faggots. permalink award report block reply\nTidewaterYank 0 points 6 days ago Impaled was spelled wrong permalink award report block reply\nbarwhack 0 points 6 days ago Nothing will happen to Boatymort. Because \"our side\" is trans-right. permalink award report block reply\nThomm 0 points 6 days ago Ok. permalink award report block reply\nMhmm2MoreWeeks 0 points 6 days ago BEWARE - SKULL AND BONES 322 permalink award report block reply\nObambi 0 points 6 days ago Berg permalink award report block reply\nthe_new_one 1 points 6 days ago Comment removed upon the user being banned. permalink award report block reply\noilybohunkofshit 1 points 6 days ago Comment removed by community moderators. permalink award report block reply\nFullyDilated 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply\nRememberCharlieKirk 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply\nnew_guy2 1 points 6 days ago Comment removed by community moderators. permalink award report block reply"}