{"id": "1ARK52Cnqs", "contents": "1498 RFK Jr. calls on nations to remove mercury from vaccines at global summit - Patrick Lewis (www.naturalnews.com) posted 6 days ago by TaxDollarsHardAtWork 108 comments award share report block RFK Jr. calls on nations to remove mercury from vaccines at global summit   – NaturalNews.com U.S. Health Secretary Robert F. Kennedy Jr. called on all nations to eliminate mercury from vaccines, criticizing the Minamata Convention’s exemption for mercury-based preservatives as a “double standard” that contradicts its mission to prevent mercury exp... www.naturalnews.com\n108 comments Sort by Top Top New Worst Old Save FreshMemes 63 points 6 days ago Why is mercury in vaccines in the first place? permalink award report block reply SneakyWino 48 points 6 days ago To dumb down the population at the earliest ages possible.  It's evil. permalink parent award report block reply Yawnz13 -3 points 6 days ago It doesn't even do anything. permalink parent award report block reply CaptainTrouble 13 points 6 days ago Well, if it doesn't do anything we should probably take it out. permalink parent award report block reply pikX 1 points 6 days ago yea, that's a waste of money. as opposed to the saline solution it is suspended in, which actually does something (allow the injection to be inserted) despite not being chemically active. not talking about whether or not they work and are good, of course. just that things do not have to \"do\" something to be useful. unlike mercury. which is bad. permalink parent award report block reply Yawnz13 -1 points 6 days ago The caveat being that is doesn't do anything to humans in the amounts present. permalink parent award report block reply MedicallyReddit 8 points 6 days ago Look up the origin of Mad Hatters permalink parent award report block reply Yawnz13 -6 points 6 days ago Look up what the actual additive is. permalink parent award report block reply view 4 more comments... SneakyWino 4 points 6 days ago https://pmc.ncbi.nlm.nih.gov/articles/PMC10851382/ permalink parent award report block reply Yawnz13 -6 points 6 days ago Here's a more relevant study, not that you'll read this one either: https://www.sciencedirect.com/science/article/abs/pii/S0887233308000295?via%3Dihub \"In addition, there were reports on genotoxic effects of TH in vivo. A weak but significant increase in micronuclei and chromosome aberrations was seen in male Swiss CD–1 mice at doses between 10 and 20 mg/kg\" Here's the thimerosal content per vaccine: https://oeps.wv.gov/immunizations/documents/vfc/manual/14/thimersol_table.pdf The amount in any vaccine isn't anywhere close to what you'd need to have to start seeing problems. 25 micrograms at most in any single vaccine VS 10-20 milligrams per kilogram of body weight Whole orders of magnitude less. permalink parent award report block reply view 29 more comments... Yawnz13 -6 points 6 days ago Cool, now actually read it. permalink parent award report block reply view 3 more comments... Hikedelics 2 points 6 days ago Some mercury fear mongering is over played. Like handling the liquid metal. You can do that here and there, with your bare hands even, and nothing will come of it. Organic mercury compounds, however, are an entirely different best. Methyl mercury is one of the most toxic substances known. I want to make sure I am painting a clear picture for you here. You could be wearing chemical handling gloves and a single wayward drop you didn’t even notice could land on those gloves and it would kill you. Slowly, painfully over the course of a year while you suffer knowing that by the time you realized what was making you sick, there was nothing that could be done for you. The mercury in the vaccines is ethyl mercury. One little additional carbon. They say that renders it safe in vaccines. As a chemist who handles organometallics every day of my life, I don’t fucking believe them. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago I handled liquid mercury obtained from broken thermometers quite a bit, just for fun. Good to know it's not as scary as I was told :) permalink parent award report block reply Yawnz13 -1 points 6 days ago The \"mercury\" in vaccines is thimerosal.  While ethyl mercury is used to make it (technically a chloride salt of ethyl mercury), thimerosal is way more than just a methyl group. If you really are a chemist, you should know that a single additional carbon can make a massive difference.  See methanol vs ethanol.  Ethanol has been consumed by humanity on a regular basis and in large quantities for thousands of years with fairly negligible side effects overall.  Methanol will kill you at around 30 milliliters. Even then, it isn't even used in most vaccines anyway. permalink parent award report block reply view 2 more comments... IncredibleMrE1 17 points 6 days ago Trust the science, grandma killer. permalink parent award report block reply SedimentTrap 14 points 6 days ago Mercury itself was never directly added to vaccines as metallic mercury. What was used — starting in the 1930s — was a mercury-based preservative called thimerosal AND WAS to prevent bacterial and fungal contamination This was important because in the early 20th century, some vaccines (like diphtheria and smallpox) became contaminated after being opened — and that contamination caused severe infections and even deaths. Thimerosal fixed that permalink parent award report block reply The_RedWolf 14 points 6 days ago i can forgive things like that 100 years ago, our knowledge about  many different chemicals and access to many other ways of sterilization and preservation were far more limited than today. permalink parent award report block reply UsedOnlyThrice 3 points 6 days ago You shouldn't forgive that Andrew Wakefield was discredited based on the claim that thiomersol was \"hardly used\" anymore. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago I can't forgive any of it. Frankenstein was written for a reason! permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Thimerosal also \"fixed\" people consistently being born with two arms and 10 fingers. permalink parent award report block reply CMDRConanAAnderson 7 points 6 days ago In the 1940s or so it was one of the most powerful antiseptics on the market: https://en.wikipedia.org/wiki/Thiomersal Everyone in those years used merthiolate or a similar iodine based antiseptic for home use. What's most amazing is that it's no longer used because it had an eternal shelf life, which made companies want to get rid of it. One bottle was enough for a lifetime for an entire family. I still have one and I bet it works well, side effects and all it still achieved it's purpose. permalink parent award report block reply spinometer2 4 points 6 days ago kills everything! let's inject it! permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Merthiolate hurt like hell, my Mom always used it. permalink parent award report block reply Jaqen 6 points 6 days ago Sodium is a metal that explodes when exposed to water. Yet you can combine it with chlorine, a deadly gas, to make table salt, which has none of the dangerous qualities of its components. Mercury does tend to retain its toxicity when combined with other elements though. permalink parent award report block reply load 7 more comments... HillarysFUPA 36 points 6 days ago Oh dear God. Democrats are going to start guzzling mercury now... permalink award report block reply MedicallyReddit 18 points 6 days ago The more the merrier RFK needs to tell everyone air is good for you permalink parent award report block reply TheJakeFroggy 6 points 6 days ago Part of me almost wants Trump or someone else in his administration to say \"Committing suicide is bad, you should never do it!\" just to see all the reactions from the left about it. permalink parent award report block reply IncredibleMrE1 10 points 6 days ago That would be awesome. permalink parent award report block reply XxxRDTPRNxxX 10 points 6 days ago Use AI to make reddit think there's a trend of liberals killing themselves in promotion of left wing causes. \"If Palestinians can't live, then neither can I\"  (BANG) Put out like 5 fake videos and pay some bots to provide the updoots. Then wait for the sheep to start imitating. permalink parent award report block reply ChrisSuperDude 7 points 6 days ago After that one queer set himself on fire last year, I would post in the comment section of news channels on YouTube “Trump said if 1,000,000 more Americans set themselves on fire, he’ll drop out and accept his fate.” permalink parent award report block reply LeRiverDanube 4 points 6 days ago Free elixir of life, get your free elixir of life here permalink parent award report block reply LirukDatan 2 points 5 days ago Sadly it won't do anything. It's the vapors of mercury that are toxic. permalink parent award report block reply HillarysFUPA 1 points 5 days ago I learned something today.... I imagine drinking it would still be toxic. permalink parent award report block reply LirukDatan 1 points 5 days ago You'd just vomit. permalink parent award report block reply load 4 more comments... ColonelKlink 13 points 6 days ago They keep lying and saying they don't use it in shots. permalink award report block reply Nanteen 7 points 6 days ago I did think they took it out of the vaccines in the '70s. Has anyone run a vaccine panel and proved that they still have them in? permalink award report block reply lixa 3 points 6 days ago Replaced w aluminum right permalink parent award report block reply General_Specific 2 points 6 days ago They even found it in mrna /covid poison. permalink parent award report block reply Antenna 7 points 6 days ago JUST STOP WITH THE VACCINES. It is impossible to inject health. permalink award report block reply Megaboom2025 7 points 6 days ago How about aluminum and formaldehyde? permalink award report block reply Rob55 6 points 6 days ago TDS response: “Trump administration is out of control!!! They’re DEMANDING big pharma to stop injecting us with poison now?!!! I’m demanding more mercury be injected into me!!!” permalink award report block reply whitman_99 6 points 6 days ago How about remove vaccines? permalink award report block reply birddogz 4 points 6 days ago That's not the only metal in vaccines permalink award report block reply Jabronson 4 points 6 days ago Both ethyl and methyl mercury cross the blood/brain barrier. permalink award report block reply NoticesBugleOWO 3 points 6 days ago I dunno... I think I just need a bit more mercury before I unlock whatever Alex Mack had... permalink award report block reply dachshundguy 3 points 6 days ago Here comes the mercury is good crowd.. permalink award report block reply General_Specific 3 points 6 days ago Women will start breaking open thermometers and sucking out the silvery liquid.. permalink parent award report block reply JoinTheDiscussion 1 points 5 days ago Haven't had real mercury thermometers in half a century permalink parent award report block reply General_Specific 1 points 5 days ago That is true. I forgot. Wasn't there a popular kid's toy in the 70s-80s that had mercury in it if you broke it open? I distinctly remember something like that. And being careful when at my friend's house to not touch the mercury with my bare skin. That was in the late 80s. The toy was old and broken. permalink parent award report block reply JoinTheDiscussion 1 points 5 days ago Probably a play doctor's set permalink parent award report block reply DudeNoOne 3 points 6 days ago Why in the fuck is there Hg in vaccines? permalink award report block reply General_Specific 3 points 6 days ago adjuvants/preservatives= typically metals permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago \"adjuvants\" Makes it all sound so prim and proper. This is the Soylent Green of sci-fi permalink parent award report block reply canada_is_communist 3 points 6 days ago Finally permalink award report block reply General_Specific 3 points 6 days ago Polymarket should have an open bet on his longevity. permalink award report block reply BrionK 3 points 6 days ago Why does the Trump administration talk so much? Ban all this shit, for fuck sake. Boomers are the most self congratulatory people on the planet. permalink award report block reply PatriotSkorzeny 3 points 6 days ago A child is being injected with mercury in the US right now. Y or N? permalink award report block reply Megaboom2025 2 points 6 days ago They've been phased out for some unknown reason permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Children certainly are being phased out permalink parent award report block reply KungPaoMcChicken 2 points 6 days ago You know when you fuck a dolphin, I heard it's pussy feels like mercury. Just saying. Lots of mercury. permalink award report block reply TheGoyimWhisperer 1 points 6 days ago Comment removed upon the user being banned. permalink award report block reply\nFreshMemes 63 points 6 days ago Why is mercury in vaccines in the first place? permalink award report block reply SneakyWino 48 points 6 days ago To dumb down the population at the earliest ages possible.  It's evil. permalink parent award report block reply Yawnz13 -3 points 6 days ago It doesn't even do anything. permalink parent award report block reply CaptainTrouble 13 points 6 days ago Well, if it doesn't do anything we should probably take it out. permalink parent award report block reply pikX 1 points 6 days ago yea, that's a waste of money. as opposed to the saline solution it is suspended in, which actually does something (allow the injection to be inserted) despite not being chemically active. not talking about whether or not they work and are good, of course. just that things do not have to \"do\" something to be useful. unlike mercury. which is bad. permalink parent award report block reply Yawnz13 -1 points 6 days ago The caveat being that is doesn't do anything to humans in the amounts present. permalink parent award report block reply MedicallyReddit 8 points 6 days ago Look up the origin of Mad Hatters permalink parent award report block reply Yawnz13 -6 points 6 days ago Look up what the actual additive is. permalink parent award report block reply view 4 more comments... SneakyWino 4 points 6 days ago https://pmc.ncbi.nlm.nih.gov/articles/PMC10851382/ permalink parent award report block reply Yawnz13 -6 points 6 days ago Here's a more relevant study, not that you'll read this one either: https://www.sciencedirect.com/science/article/abs/pii/S0887233308000295?via%3Dihub \"In addition, there were reports on genotoxic effects of TH in vivo. A weak but significant increase in micronuclei and chromosome aberrations was seen in male Swiss CD–1 mice at doses between 10 and 20 mg/kg\" Here's the thimerosal content per vaccine: https://oeps.wv.gov/immunizations/documents/vfc/manual/14/thimersol_table.pdf The amount in any vaccine isn't anywhere close to what you'd need to have to start seeing problems. 25 micrograms at most in any single vaccine VS 10-20 milligrams per kilogram of body weight Whole orders of magnitude less. permalink parent award report block reply view 29 more comments... Yawnz13 -6 points 6 days ago Cool, now actually read it. permalink parent award report block reply view 3 more comments... Hikedelics 2 points 6 days ago Some mercury fear mongering is over played. Like handling the liquid metal. You can do that here and there, with your bare hands even, and nothing will come of it. Organic mercury compounds, however, are an entirely different best. Methyl mercury is one of the most toxic substances known. I want to make sure I am painting a clear picture for you here. You could be wearing chemical handling gloves and a single wayward drop you didn’t even notice could land on those gloves and it would kill you. Slowly, painfully over the course of a year while you suffer knowing that by the time you realized what was making you sick, there was nothing that could be done for you. The mercury in the vaccines is ethyl mercury. One little additional carbon. They say that renders it safe in vaccines. As a chemist who handles organometallics every day of my life, I don’t fucking believe them. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago I handled liquid mercury obtained from broken thermometers quite a bit, just for fun. Good to know it's not as scary as I was told :) permalink parent award report block reply Yawnz13 -1 points 6 days ago The \"mercury\" in vaccines is thimerosal.  While ethyl mercury is used to make it (technically a chloride salt of ethyl mercury), thimerosal is way more than just a methyl group. If you really are a chemist, you should know that a single additional carbon can make a massive difference.  See methanol vs ethanol.  Ethanol has been consumed by humanity on a regular basis and in large quantities for thousands of years with fairly negligible side effects overall.  Methanol will kill you at around 30 milliliters. Even then, it isn't even used in most vaccines anyway. permalink parent award report block reply view 2 more comments... IncredibleMrE1 17 points 6 days ago Trust the science, grandma killer. permalink parent award report block reply SedimentTrap 14 points 6 days ago Mercury itself was never directly added to vaccines as metallic mercury. What was used — starting in the 1930s — was a mercury-based preservative called thimerosal AND WAS to prevent bacterial and fungal contamination This was important because in the early 20th century, some vaccines (like diphtheria and smallpox) became contaminated after being opened — and that contamination caused severe infections and even deaths. Thimerosal fixed that permalink parent award report block reply The_RedWolf 14 points 6 days ago i can forgive things like that 100 years ago, our knowledge about  many different chemicals and access to many other ways of sterilization and preservation were far more limited than today. permalink parent award report block reply UsedOnlyThrice 3 points 6 days ago You shouldn't forgive that Andrew Wakefield was discredited based on the claim that thiomersol was \"hardly used\" anymore. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago I can't forgive any of it. Frankenstein was written for a reason! permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Thimerosal also \"fixed\" people consistently being born with two arms and 10 fingers. permalink parent award report block reply CMDRConanAAnderson 7 points 6 days ago In the 1940s or so it was one of the most powerful antiseptics on the market: https://en.wikipedia.org/wiki/Thiomersal Everyone in those years used merthiolate or a similar iodine based antiseptic for home use. What's most amazing is that it's no longer used because it had an eternal shelf life, which made companies want to get rid of it. One bottle was enough for a lifetime for an entire family. I still have one and I bet it works well, side effects and all it still achieved it's purpose. permalink parent award report block reply spinometer2 4 points 6 days ago kills everything! let's inject it! permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Merthiolate hurt like hell, my Mom always used it. permalink parent award report block reply Jaqen 6 points 6 days ago Sodium is a metal that explodes when exposed to water. Yet you can combine it with chlorine, a deadly gas, to make table salt, which has none of the dangerous qualities of its components. Mercury does tend to retain its toxicity when combined with other elements though. permalink parent award report block reply load 7 more comments...\nSneakyWino 48 points 6 days ago To dumb down the population at the earliest ages possible.  It's evil. permalink parent award report block reply Yawnz13 -3 points 6 days ago It doesn't even do anything. permalink parent award report block reply CaptainTrouble 13 points 6 days ago Well, if it doesn't do anything we should probably take it out. permalink parent award report block reply pikX 1 points 6 days ago yea, that's a waste of money. as opposed to the saline solution it is suspended in, which actually does something (allow the injection to be inserted) despite not being chemically active. not talking about whether or not they work and are good, of course. just that things do not have to \"do\" something to be useful. unlike mercury. which is bad. permalink parent award report block reply Yawnz13 -1 points 6 days ago The caveat being that is doesn't do anything to humans in the amounts present. permalink parent award report block reply MedicallyReddit 8 points 6 days ago Look up the origin of Mad Hatters permalink parent award report block reply Yawnz13 -6 points 6 days ago Look up what the actual additive is. permalink parent award report block reply view 4 more comments... SneakyWino 4 points 6 days ago https://pmc.ncbi.nlm.nih.gov/articles/PMC10851382/ permalink parent award report block reply Yawnz13 -6 points 6 days ago Here's a more relevant study, not that you'll read this one either: https://www.sciencedirect.com/science/article/abs/pii/S0887233308000295?via%3Dihub \"In addition, there were reports on genotoxic effects of TH in vivo. A weak but significant increase in micronuclei and chromosome aberrations was seen in male Swiss CD–1 mice at doses between 10 and 20 mg/kg\" Here's the thimerosal content per vaccine: https://oeps.wv.gov/immunizations/documents/vfc/manual/14/thimersol_table.pdf The amount in any vaccine isn't anywhere close to what you'd need to have to start seeing problems. 25 micrograms at most in any single vaccine VS 10-20 milligrams per kilogram of body weight Whole orders of magnitude less. permalink parent award report block reply view 29 more comments... Yawnz13 -6 points 6 days ago Cool, now actually read it. permalink parent award report block reply view 3 more comments... Hikedelics 2 points 6 days ago Some mercury fear mongering is over played. Like handling the liquid metal. You can do that here and there, with your bare hands even, and nothing will come of it. Organic mercury compounds, however, are an entirely different best. Methyl mercury is one of the most toxic substances known. I want to make sure I am painting a clear picture for you here. You could be wearing chemical handling gloves and a single wayward drop you didn’t even notice could land on those gloves and it would kill you. Slowly, painfully over the course of a year while you suffer knowing that by the time you realized what was making you sick, there was nothing that could be done for you. The mercury in the vaccines is ethyl mercury. One little additional carbon. They say that renders it safe in vaccines. As a chemist who handles organometallics every day of my life, I don’t fucking believe them. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago I handled liquid mercury obtained from broken thermometers quite a bit, just for fun. Good to know it's not as scary as I was told :) permalink parent award report block reply Yawnz13 -1 points 6 days ago The \"mercury\" in vaccines is thimerosal.  While ethyl mercury is used to make it (technically a chloride salt of ethyl mercury), thimerosal is way more than just a methyl group. If you really are a chemist, you should know that a single additional carbon can make a massive difference.  See methanol vs ethanol.  Ethanol has been consumed by humanity on a regular basis and in large quantities for thousands of years with fairly negligible side effects overall.  Methanol will kill you at around 30 milliliters. Even then, it isn't even used in most vaccines anyway. permalink parent award report block reply view 2 more comments...\nYawnz13 -3 points 6 days ago It doesn't even do anything. permalink parent award report block reply CaptainTrouble 13 points 6 days ago Well, if it doesn't do anything we should probably take it out. permalink parent award report block reply pikX 1 points 6 days ago yea, that's a waste of money. as opposed to the saline solution it is suspended in, which actually does something (allow the injection to be inserted) despite not being chemically active. not talking about whether or not they work and are good, of course. just that things do not have to \"do\" something to be useful. unlike mercury. which is bad. permalink parent award report block reply Yawnz13 -1 points 6 days ago The caveat being that is doesn't do anything to humans in the amounts present. permalink parent award report block reply MedicallyReddit 8 points 6 days ago Look up the origin of Mad Hatters permalink parent award report block reply Yawnz13 -6 points 6 days ago Look up what the actual additive is. permalink parent award report block reply view 4 more comments... SneakyWino 4 points 6 days ago https://pmc.ncbi.nlm.nih.gov/articles/PMC10851382/ permalink parent award report block reply Yawnz13 -6 points 6 days ago Here's a more relevant study, not that you'll read this one either: https://www.sciencedirect.com/science/article/abs/pii/S0887233308000295?via%3Dihub \"In addition, there were reports on genotoxic effects of TH in vivo. A weak but significant increase in micronuclei and chromosome aberrations was seen in male Swiss CD–1 mice at doses between 10 and 20 mg/kg\" Here's the thimerosal content per vaccine: https://oeps.wv.gov/immunizations/documents/vfc/manual/14/thimersol_table.pdf The amount in any vaccine isn't anywhere close to what you'd need to have to start seeing problems. 25 micrograms at most in any single vaccine VS 10-20 milligrams per kilogram of body weight Whole orders of magnitude less. permalink parent award report block reply view 29 more comments... Yawnz13 -6 points 6 days ago Cool, now actually read it. permalink parent award report block reply view 3 more comments... Hikedelics 2 points 6 days ago Some mercury fear mongering is over played. Like handling the liquid metal. You can do that here and there, with your bare hands even, and nothing will come of it. Organic mercury compounds, however, are an entirely different best. Methyl mercury is one of the most toxic substances known. I want to make sure I am painting a clear picture for you here. You could be wearing chemical handling gloves and a single wayward drop you didn’t even notice could land on those gloves and it would kill you. Slowly, painfully over the course of a year while you suffer knowing that by the time you realized what was making you sick, there was nothing that could be done for you. The mercury in the vaccines is ethyl mercury. One little additional carbon. They say that renders it safe in vaccines. As a chemist who handles organometallics every day of my life, I don’t fucking believe them. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago I handled liquid mercury obtained from broken thermometers quite a bit, just for fun. Good to know it's not as scary as I was told :) permalink parent award report block reply Yawnz13 -1 points 6 days ago The \"mercury\" in vaccines is thimerosal.  While ethyl mercury is used to make it (technically a chloride salt of ethyl mercury), thimerosal is way more than just a methyl group. If you really are a chemist, you should know that a single additional carbon can make a massive difference.  See methanol vs ethanol.  Ethanol has been consumed by humanity on a regular basis and in large quantities for thousands of years with fairly negligible side effects overall.  Methanol will kill you at around 30 milliliters. Even then, it isn't even used in most vaccines anyway. permalink parent award report block reply view 2 more comments...\nCaptainTrouble 13 points 6 days ago Well, if it doesn't do anything we should probably take it out. permalink parent award report block reply pikX 1 points 6 days ago yea, that's a waste of money. as opposed to the saline solution it is suspended in, which actually does something (allow the injection to be inserted) despite not being chemically active. not talking about whether or not they work and are good, of course. just that things do not have to \"do\" something to be useful. unlike mercury. which is bad. permalink parent award report block reply Yawnz13 -1 points 6 days ago The caveat being that is doesn't do anything to humans in the amounts present. permalink parent award report block reply\npikX 1 points 6 days ago yea, that's a waste of money. as opposed to the saline solution it is suspended in, which actually does something (allow the injection to be inserted) despite not being chemically active. not talking about whether or not they work and are good, of course. just that things do not have to \"do\" something to be useful. unlike mercury. which is bad. permalink parent award report block reply\nYawnz13 -1 points 6 days ago The caveat being that is doesn't do anything to humans in the amounts present. permalink parent award report block reply\nMedicallyReddit 8 points 6 days ago Look up the origin of Mad Hatters permalink parent award report block reply Yawnz13 -6 points 6 days ago Look up what the actual additive is. permalink parent award report block reply view 4 more comments...\nYawnz13 -6 points 6 days ago Look up what the actual additive is. permalink parent award report block reply view 4 more comments...\nSneakyWino 4 points 6 days ago https://pmc.ncbi.nlm.nih.gov/articles/PMC10851382/ permalink parent award report block reply Yawnz13 -6 points 6 days ago Here's a more relevant study, not that you'll read this one either: https://www.sciencedirect.com/science/article/abs/pii/S0887233308000295?via%3Dihub \"In addition, there were reports on genotoxic effects of TH in vivo. A weak but significant increase in micronuclei and chromosome aberrations was seen in male Swiss CD–1 mice at doses between 10 and 20 mg/kg\" Here's the thimerosal content per vaccine: https://oeps.wv.gov/immunizations/documents/vfc/manual/14/thimersol_table.pdf The amount in any vaccine isn't anywhere close to what you'd need to have to start seeing problems. 25 micrograms at most in any single vaccine VS 10-20 milligrams per kilogram of body weight Whole orders of magnitude less. permalink parent award report block reply view 29 more comments... Yawnz13 -6 points 6 days ago Cool, now actually read it. permalink parent award report block reply view 3 more comments...\nYawnz13 -6 points 6 days ago Here's a more relevant study, not that you'll read this one either: https://www.sciencedirect.com/science/article/abs/pii/S0887233308000295?via%3Dihub \"In addition, there were reports on genotoxic effects of TH in vivo. A weak but significant increase in micronuclei and chromosome aberrations was seen in male Swiss CD–1 mice at doses between 10 and 20 mg/kg\" Here's the thimerosal content per vaccine: https://oeps.wv.gov/immunizations/documents/vfc/manual/14/thimersol_table.pdf The amount in any vaccine isn't anywhere close to what you'd need to have to start seeing problems. 25 micrograms at most in any single vaccine VS 10-20 milligrams per kilogram of body weight Whole orders of magnitude less. permalink parent award report block reply view 29 more comments...\nYawnz13 -6 points 6 days ago Cool, now actually read it. permalink parent award report block reply view 3 more comments...\nHikedelics 2 points 6 days ago Some mercury fear mongering is over played. Like handling the liquid metal. You can do that here and there, with your bare hands even, and nothing will come of it. Organic mercury compounds, however, are an entirely different best. Methyl mercury is one of the most toxic substances known. I want to make sure I am painting a clear picture for you here. You could be wearing chemical handling gloves and a single wayward drop you didn’t even notice could land on those gloves and it would kill you. Slowly, painfully over the course of a year while you suffer knowing that by the time you realized what was making you sick, there was nothing that could be done for you. The mercury in the vaccines is ethyl mercury. One little additional carbon. They say that renders it safe in vaccines. As a chemist who handles organometallics every day of my life, I don’t fucking believe them. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago I handled liquid mercury obtained from broken thermometers quite a bit, just for fun. Good to know it's not as scary as I was told :) permalink parent award report block reply Yawnz13 -1 points 6 days ago The \"mercury\" in vaccines is thimerosal.  While ethyl mercury is used to make it (technically a chloride salt of ethyl mercury), thimerosal is way more than just a methyl group. If you really are a chemist, you should know that a single additional carbon can make a massive difference.  See methanol vs ethanol.  Ethanol has been consumed by humanity on a regular basis and in large quantities for thousands of years with fairly negligible side effects overall.  Methanol will kill you at around 30 milliliters. Even then, it isn't even used in most vaccines anyway. permalink parent award report block reply view 2 more comments...\nSicSemperTyrannis2 1 points 6 days ago I handled liquid mercury obtained from broken thermometers quite a bit, just for fun. Good to know it's not as scary as I was told :) permalink parent award report block reply\nYawnz13 -1 points 6 days ago The \"mercury\" in vaccines is thimerosal.  While ethyl mercury is used to make it (technically a chloride salt of ethyl mercury), thimerosal is way more than just a methyl group. If you really are a chemist, you should know that a single additional carbon can make a massive difference.  See methanol vs ethanol.  Ethanol has been consumed by humanity on a regular basis and in large quantities for thousands of years with fairly negligible side effects overall.  Methanol will kill you at around 30 milliliters. Even then, it isn't even used in most vaccines anyway. permalink parent award report block reply view 2 more comments...\nIncredibleMrE1 17 points 6 days ago Trust the science, grandma killer. permalink parent award report block reply\nSedimentTrap 14 points 6 days ago Mercury itself was never directly added to vaccines as metallic mercury. What was used — starting in the 1930s — was a mercury-based preservative called thimerosal AND WAS to prevent bacterial and fungal contamination This was important because in the early 20th century, some vaccines (like diphtheria and smallpox) became contaminated after being opened — and that contamination caused severe infections and even deaths. Thimerosal fixed that permalink parent award report block reply The_RedWolf 14 points 6 days ago i can forgive things like that 100 years ago, our knowledge about  many different chemicals and access to many other ways of sterilization and preservation were far more limited than today. permalink parent award report block reply UsedOnlyThrice 3 points 6 days ago You shouldn't forgive that Andrew Wakefield was discredited based on the claim that thiomersol was \"hardly used\" anymore. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago I can't forgive any of it. Frankenstein was written for a reason! permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Thimerosal also \"fixed\" people consistently being born with two arms and 10 fingers. permalink parent award report block reply\nThe_RedWolf 14 points 6 days ago i can forgive things like that 100 years ago, our knowledge about  many different chemicals and access to many other ways of sterilization and preservation were far more limited than today. permalink parent award report block reply UsedOnlyThrice 3 points 6 days ago You shouldn't forgive that Andrew Wakefield was discredited based on the claim that thiomersol was \"hardly used\" anymore. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago I can't forgive any of it. Frankenstein was written for a reason! permalink parent award report block reply\nUsedOnlyThrice 3 points 6 days ago You shouldn't forgive that Andrew Wakefield was discredited based on the claim that thiomersol was \"hardly used\" anymore. permalink parent award report block reply\nSicSemperTyrannis2 1 points 6 days ago I can't forgive any of it. Frankenstein was written for a reason! permalink parent award report block reply\nSicSemperTyrannis2 1 points 6 days ago Thimerosal also \"fixed\" people consistently being born with two arms and 10 fingers. permalink parent award report block reply\nCMDRConanAAnderson 7 points 6 days ago In the 1940s or so it was one of the most powerful antiseptics on the market: https://en.wikipedia.org/wiki/Thiomersal Everyone in those years used merthiolate or a similar iodine based antiseptic for home use. What's most amazing is that it's no longer used because it had an eternal shelf life, which made companies want to get rid of it. One bottle was enough for a lifetime for an entire family. I still have one and I bet it works well, side effects and all it still achieved it's purpose. permalink parent award report block reply spinometer2 4 points 6 days ago kills everything! let's inject it! permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Merthiolate hurt like hell, my Mom always used it. permalink parent award report block reply\nspinometer2 4 points 6 days ago kills everything! let's inject it! permalink parent award report block reply\nSicSemperTyrannis2 1 points 6 days ago Merthiolate hurt like hell, my Mom always used it. permalink parent award report block reply\nJaqen 6 points 6 days ago Sodium is a metal that explodes when exposed to water. Yet you can combine it with chlorine, a deadly gas, to make table salt, which has none of the dangerous qualities of its components. Mercury does tend to retain its toxicity when combined with other elements though. permalink parent award report block reply\nHillarysFUPA 36 points 6 days ago Oh dear God. Democrats are going to start guzzling mercury now... permalink award report block reply MedicallyReddit 18 points 6 days ago The more the merrier RFK needs to tell everyone air is good for you permalink parent award report block reply TheJakeFroggy 6 points 6 days ago Part of me almost wants Trump or someone else in his administration to say \"Committing suicide is bad, you should never do it!\" just to see all the reactions from the left about it. permalink parent award report block reply IncredibleMrE1 10 points 6 days ago That would be awesome. permalink parent award report block reply XxxRDTPRNxxX 10 points 6 days ago Use AI to make reddit think there's a trend of liberals killing themselves in promotion of left wing causes. \"If Palestinians can't live, then neither can I\"  (BANG) Put out like 5 fake videos and pay some bots to provide the updoots. Then wait for the sheep to start imitating. permalink parent award report block reply ChrisSuperDude 7 points 6 days ago After that one queer set himself on fire last year, I would post in the comment section of news channels on YouTube “Trump said if 1,000,000 more Americans set themselves on fire, he’ll drop out and accept his fate.” permalink parent award report block reply LeRiverDanube 4 points 6 days ago Free elixir of life, get your free elixir of life here permalink parent award report block reply LirukDatan 2 points 5 days ago Sadly it won't do anything. It's the vapors of mercury that are toxic. permalink parent award report block reply HillarysFUPA 1 points 5 days ago I learned something today.... I imagine drinking it would still be toxic. permalink parent award report block reply LirukDatan 1 points 5 days ago You'd just vomit. permalink parent award report block reply load 4 more comments...\nMedicallyReddit 18 points 6 days ago The more the merrier RFK needs to tell everyone air is good for you permalink parent award report block reply TheJakeFroggy 6 points 6 days ago Part of me almost wants Trump or someone else in his administration to say \"Committing suicide is bad, you should never do it!\" just to see all the reactions from the left about it. permalink parent award report block reply\nTheJakeFroggy 6 points 6 days ago Part of me almost wants Trump or someone else in his administration to say \"Committing suicide is bad, you should never do it!\" just to see all the reactions from the left about it. permalink parent award report block reply\nIncredibleMrE1 10 points 6 days ago That would be awesome. permalink parent award report block reply\nXxxRDTPRNxxX 10 points 6 days ago Use AI to make reddit think there's a trend of liberals killing themselves in promotion of left wing causes. \"If Palestinians can't live, then neither can I\"  (BANG) Put out like 5 fake videos and pay some bots to provide the updoots. Then wait for the sheep to start imitating. permalink parent award report block reply ChrisSuperDude 7 points 6 days ago After that one queer set himself on fire last year, I would post in the comment section of news channels on YouTube “Trump said if 1,000,000 more Americans set themselves on fire, he’ll drop out and accept his fate.” permalink parent award report block reply\nChrisSuperDude 7 points 6 days ago After that one queer set himself on fire last year, I would post in the comment section of news channels on YouTube “Trump said if 1,000,000 more Americans set themselves on fire, he’ll drop out and accept his fate.” permalink parent award report block reply\nLeRiverDanube 4 points 6 days ago Free elixir of life, get your free elixir of life here permalink parent award report block reply\nLirukDatan 2 points 5 days ago Sadly it won't do anything. It's the vapors of mercury that are toxic. permalink parent award report block reply HillarysFUPA 1 points 5 days ago I learned something today.... I imagine drinking it would still be toxic. permalink parent award report block reply LirukDatan 1 points 5 days ago You'd just vomit. permalink parent award report block reply\nHillarysFUPA 1 points 5 days ago I learned something today.... I imagine drinking it would still be toxic. permalink parent award report block reply LirukDatan 1 points 5 days ago You'd just vomit. permalink parent award report block reply\nLirukDatan 1 points 5 days ago You'd just vomit. permalink parent award report block reply\nColonelKlink 13 points 6 days ago They keep lying and saying they don't use it in shots. permalink award report block reply\nNanteen 7 points 6 days ago I did think they took it out of the vaccines in the '70s. Has anyone run a vaccine panel and proved that they still have them in? permalink award report block reply lixa 3 points 6 days ago Replaced w aluminum right permalink parent award report block reply General_Specific 2 points 6 days ago They even found it in mrna /covid poison. permalink parent award report block reply\nlixa 3 points 6 days ago Replaced w aluminum right permalink parent award report block reply\nGeneral_Specific 2 points 6 days ago They even found it in mrna /covid poison. permalink parent award report block reply\nAntenna 7 points 6 days ago JUST STOP WITH THE VACCINES. It is impossible to inject health. permalink award report block reply\nMegaboom2025 7 points 6 days ago How about aluminum and formaldehyde? permalink award report block reply\nRob55 6 points 6 days ago TDS response: “Trump administration is out of control!!! They’re DEMANDING big pharma to stop injecting us with poison now?!!! I’m demanding more mercury be injected into me!!!” permalink award report block reply\nwhitman_99 6 points 6 days ago How about remove vaccines? permalink award report block reply\nbirddogz 4 points 6 days ago That's not the only metal in vaccines permalink award report block reply\nJabronson 4 points 6 days ago Both ethyl and methyl mercury cross the blood/brain barrier. permalink award report block reply\nNoticesBugleOWO 3 points 6 days ago I dunno... I think I just need a bit more mercury before I unlock whatever Alex Mack had... permalink award report block reply\ndachshundguy 3 points 6 days ago Here comes the mercury is good crowd.. permalink award report block reply General_Specific 3 points 6 days ago Women will start breaking open thermometers and sucking out the silvery liquid.. permalink parent award report block reply JoinTheDiscussion 1 points 5 days ago Haven't had real mercury thermometers in half a century permalink parent award report block reply General_Specific 1 points 5 days ago That is true. I forgot. Wasn't there a popular kid's toy in the 70s-80s that had mercury in it if you broke it open? I distinctly remember something like that. And being careful when at my friend's house to not touch the mercury with my bare skin. That was in the late 80s. The toy was old and broken. permalink parent award report block reply JoinTheDiscussion 1 points 5 days ago Probably a play doctor's set permalink parent award report block reply\nGeneral_Specific 3 points 6 days ago Women will start breaking open thermometers and sucking out the silvery liquid.. permalink parent award report block reply JoinTheDiscussion 1 points 5 days ago Haven't had real mercury thermometers in half a century permalink parent award report block reply General_Specific 1 points 5 days ago That is true. I forgot. Wasn't there a popular kid's toy in the 70s-80s that had mercury in it if you broke it open? I distinctly remember something like that. And being careful when at my friend's house to not touch the mercury with my bare skin. That was in the late 80s. The toy was old and broken. permalink parent award report block reply JoinTheDiscussion 1 points 5 days ago Probably a play doctor's set permalink parent award report block reply\nJoinTheDiscussion 1 points 5 days ago Haven't had real mercury thermometers in half a century permalink parent award report block reply General_Specific 1 points 5 days ago That is true. I forgot. Wasn't there a popular kid's toy in the 70s-80s that had mercury in it if you broke it open? I distinctly remember something like that. And being careful when at my friend's house to not touch the mercury with my bare skin. That was in the late 80s. The toy was old and broken. permalink parent award report block reply JoinTheDiscussion 1 points 5 days ago Probably a play doctor's set permalink parent award report block reply\nGeneral_Specific 1 points 5 days ago That is true. I forgot. Wasn't there a popular kid's toy in the 70s-80s that had mercury in it if you broke it open? I distinctly remember something like that. And being careful when at my friend's house to not touch the mercury with my bare skin. That was in the late 80s. The toy was old and broken. permalink parent award report block reply JoinTheDiscussion 1 points 5 days ago Probably a play doctor's set permalink parent award report block reply\nJoinTheDiscussion 1 points 5 days ago Probably a play doctor's set permalink parent award report block reply\nDudeNoOne 3 points 6 days ago Why in the fuck is there Hg in vaccines? permalink award report block reply General_Specific 3 points 6 days ago adjuvants/preservatives= typically metals permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago \"adjuvants\" Makes it all sound so prim and proper. This is the Soylent Green of sci-fi permalink parent award report block reply\nGeneral_Specific 3 points 6 days ago adjuvants/preservatives= typically metals permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago \"adjuvants\" Makes it all sound so prim and proper. This is the Soylent Green of sci-fi permalink parent award report block reply\nSicSemperTyrannis2 2 points 6 days ago \"adjuvants\" Makes it all sound so prim and proper. This is the Soylent Green of sci-fi permalink parent award report block reply\ncanada_is_communist 3 points 6 days ago Finally permalink award report block reply\nGeneral_Specific 3 points 6 days ago Polymarket should have an open bet on his longevity. permalink award report block reply\nBrionK 3 points 6 days ago Why does the Trump administration talk so much? Ban all this shit, for fuck sake. Boomers are the most self congratulatory people on the planet. permalink award report block reply\nPatriotSkorzeny 3 points 6 days ago A child is being injected with mercury in the US right now. Y or N? permalink award report block reply Megaboom2025 2 points 6 days ago They've been phased out for some unknown reason permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Children certainly are being phased out permalink parent award report block reply\nMegaboom2025 2 points 6 days ago They've been phased out for some unknown reason permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Children certainly are being phased out permalink parent award report block reply\nSicSemperTyrannis2 1 points 6 days ago Children certainly are being phased out permalink parent award report block reply\nKungPaoMcChicken 2 points 6 days ago You know when you fuck a dolphin, I heard it's pussy feels like mercury. Just saying. Lots of mercury. permalink award report block reply\nTheGoyimWhisperer 1 points 6 days ago Comment removed upon the user being banned. permalink award report block reply"}