{"id": "1ARK52CG5Z", "contents": "556 Send all 30+ million invaders to the vatican instead. Pope says he will accept them. 💩   SHITPOST   💩 posted 6 days ago by FBIAREFAGGOTS 24 comments award share report block MJTruthUltra @MJTruthUltra • 7d Womp womp womp… 🚨 Pope Leo says America needs deep reflection on how Illegal aliens are treated in the US — “You’re supposed to receive and welcome the foreigner.” Sorry Mr. Pope… you’re wrong. Scripture commands submission to LAWFUL authority (Rom 13:1–7). Illegal entry\n24 comments Sort by Top Top New Worst Old Save ESAsher 8 points 6 days ago It's good rebuttal of an idiotic position. permalink award report block reply gillonba 7 points 6 days ago We are called to be charitable, but charity is an individual decision.  The decision to take from your neighbor and give that to a foreigner isn't charity.  I'm not a \"taxation is theft\" nutjob but it sure isn't charity either. permalink award report block reply FullyDilated 2 points 6 days ago taxation is literally theft permalink parent award report block reply braindeadgroup 5 points 6 days ago They say you should be sent to hell if you dont do as they say.  We just want to send the illegals back to their country. permalink award report block reply FullyDilated 1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply TrancePhreak 4 points 6 days ago I like this idea. permalink award report block reply DlanOdcammron 4 points 6 days ago We should only take in Christian refugees after they eat a bacon and blood sausage sandwich and after a 10 year probationary stay at the Vatican. permalink award report block reply GoodvsEvil2 3 points 6 days ago the mighty beaner pope permalink award report block reply HeavyMetalPatriot 3 points 6 days ago My mom is a devout Catholic. She's very kewl with nerve gassing the Vatican to remove all the rats and roaches, especially the bipedal ones. permalink award report block reply lul_cheto 3 points 6 days ago Real catholic here.. yes plz.\nLet that retard drown in his won dillusions. permalink award report block reply FullyDilated -1 points 6 days ago a real Catholic isn't a real Christian permalink parent award report block reply lul_cheto 2 points 5 days ago A christian is someone who follows christ and DOES what he commands.. meanwhile yall are out drinking and fornicating, and are so retarded you think you can just click your heels three times and yell \"jesus!\" And be saved.. Have fun dying in your sins fool. permalink parent award report block reply Eddie_Vanjovi 3 points 6 days ago How did Paul get in prison if he \"submitted to authority\". Maybe you don't know what Roman's actually is talking about, do you. Mathew 25 speaks of \"brother of mine\". Ba'al worshipers are a brother to Christ? I think not. permalink award report block reply thunderpussy 3 points 6 days ago He really, really likes that 2 billion dollars that Catholic Charities raked in from the federal government to tend to said immigrants...... permalink award report block reply AngryPoop 2 points 6 days ago Maybe ask him why the walls are around vacation city? permalink award report block reply FullyDilated 2 points 6 days ago I don't need some gay child fucker preaching too me about the Bible permalink award report block reply Michalusmichalus 2 points 6 days ago Only Catholics care what the pope has to say. permalink award report block reply blitzkrieg1 2 points 6 days ago Catholics. Unreal. permalink award report block reply bobbacringo 1 points 5 days ago Christianity was mostly isolated from blacks and browns during it's 2,000 year reign in Europe. It keeps trying to apply the rules of whites to blacks and browns and it simply does not work. When do white people stop pretending that the other races are our equals? permalink award report block reply becomelions 1 points 5 days ago Says the pope organizing the invasion of Christendom permalink award report block reply barwhack 1 points 6 days ago There's an endless IKEA full of relics, underneath. Room for all. permalink award report block reply worldowedexplanation 1 points 5 days ago “Just let me rape you, little boy” - the Pope and all his pedos of the cloth permalink award report block reply becomelions 1 points 5 days ago house is still investigating the pope's invasion of our country. Good thing Trump cut their funding https://www.ncronline.org/news/usccb-catholic-charities-among-200-ngos-house-probe-migrant-aid permalink award report block reply\nESAsher 8 points 6 days ago It's good rebuttal of an idiotic position. permalink award report block reply\ngillonba 7 points 6 days ago We are called to be charitable, but charity is an individual decision.  The decision to take from your neighbor and give that to a foreigner isn't charity.  I'm not a \"taxation is theft\" nutjob but it sure isn't charity either. permalink award report block reply FullyDilated 2 points 6 days ago taxation is literally theft permalink parent award report block reply\nFullyDilated 2 points 6 days ago taxation is literally theft permalink parent award report block reply\nbraindeadgroup 5 points 6 days ago They say you should be sent to hell if you dont do as they say.  We just want to send the illegals back to their country. permalink award report block reply FullyDilated 1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nFullyDilated 1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nTrancePhreak 4 points 6 days ago I like this idea. permalink award report block reply\nDlanOdcammron 4 points 6 days ago We should only take in Christian refugees after they eat a bacon and blood sausage sandwich and after a 10 year probationary stay at the Vatican. permalink award report block reply\nGoodvsEvil2 3 points 6 days ago the mighty beaner pope permalink award report block reply\nHeavyMetalPatriot 3 points 6 days ago My mom is a devout Catholic. She's very kewl with nerve gassing the Vatican to remove all the rats and roaches, especially the bipedal ones. permalink award report block reply\nlul_cheto 3 points 6 days ago Real catholic here.. yes plz.\nLet that retard drown in his won dillusions. permalink award report block reply FullyDilated -1 points 6 days ago a real Catholic isn't a real Christian permalink parent award report block reply lul_cheto 2 points 5 days ago A christian is someone who follows christ and DOES what he commands.. meanwhile yall are out drinking and fornicating, and are so retarded you think you can just click your heels three times and yell \"jesus!\" And be saved.. Have fun dying in your sins fool. permalink parent award report block reply\nFullyDilated -1 points 6 days ago a real Catholic isn't a real Christian permalink parent award report block reply lul_cheto 2 points 5 days ago A christian is someone who follows christ and DOES what he commands.. meanwhile yall are out drinking and fornicating, and are so retarded you think you can just click your heels three times and yell \"jesus!\" And be saved.. Have fun dying in your sins fool. permalink parent award report block reply\nlul_cheto 2 points 5 days ago A christian is someone who follows christ and DOES what he commands.. meanwhile yall are out drinking and fornicating, and are so retarded you think you can just click your heels three times and yell \"jesus!\" And be saved.. Have fun dying in your sins fool. permalink parent award report block reply\nEddie_Vanjovi 3 points 6 days ago How did Paul get in prison if he \"submitted to authority\". Maybe you don't know what Roman's actually is talking about, do you. Mathew 25 speaks of \"brother of mine\". Ba'al worshipers are a brother to Christ? I think not. permalink award report block reply\nthunderpussy 3 points 6 days ago He really, really likes that 2 billion dollars that Catholic Charities raked in from the federal government to tend to said immigrants...... permalink award report block reply\nAngryPoop 2 points 6 days ago Maybe ask him why the walls are around vacation city? permalink award report block reply\nFullyDilated 2 points 6 days ago I don't need some gay child fucker preaching too me about the Bible permalink award report block reply\nMichalusmichalus 2 points 6 days ago Only Catholics care what the pope has to say. permalink award report block reply\nblitzkrieg1 2 points 6 days ago Catholics. Unreal. permalink award report block reply\nbobbacringo 1 points 5 days ago Christianity was mostly isolated from blacks and browns during it's 2,000 year reign in Europe. It keeps trying to apply the rules of whites to blacks and browns and it simply does not work. When do white people stop pretending that the other races are our equals? permalink award report block reply\nbecomelions 1 points 5 days ago Says the pope organizing the invasion of Christendom permalink award report block reply\nbarwhack 1 points 6 days ago There's an endless IKEA full of relics, underneath. Room for all. permalink award report block reply\nworldowedexplanation 1 points 5 days ago “Just let me rape you, little boy” - the Pope and all his pedos of the cloth permalink award report block reply\nbecomelions 1 points 5 days ago house is still investigating the pope's invasion of our country. Good thing Trump cut their funding https://www.ncronline.org/news/usccb-catholic-charities-among-200-ngos-house-probe-migrant-aid permalink award report block reply"}