{"id": "1ARK53JpWl", "contents": "435 Fucking hate that so many cars are doing this hybrid, electric, turbo shit. Naturally aspirated gas engines for the fucking win. (consumerguide.com) posted 6 days ago by 38WendysHamSquare79 51 comments award share report block\n51 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style HanginChad 18 points 6 days ago All those have their place. Hybrid, great commuter, daily driver, stuck in traffic car. Turbo, diesel truck or sports car. Not a gas truck or SUVs. Electric... Ok I don't know. But losing naturally aspirated 8 cylinder trucks or even 6 cylinder ones sucks. Losing the 300hp Camry sucks or the Honda Accord coupe. I don't need a fucking rear view camera in a Miata either. WTF!? And I don't need fake analog gauges on a computer screen, looking at you Ford mustang. permalink award report block reply Aambrick 4 points 6 days ago Electric is for space. After all the fuel is quite literally facing the sun. Planet side or gravity wells would require different types of electric, but gravity wells that have atmospheres require combustibles. The only way I would condone an electric is in 2 ways: The battery has to have 1,000 miles range or a 200 hour charge. No brain for the car, but only for the power steering and electric charge distribution. Other than that everything except radio(if one really needs it) should be able to run mechanically by design rather than by a car brain that can be hacked easily. permalink parent award report block reply Nezock_theKnight 4 points 6 days ago I had a 2006 Honda Accord EX-V6 6 speed.  The 3.0 liter V6 was smooth AF.  Mated to a perfect 6 speed.  Now, don't get me wrong, the 2.0 Turbo in the last generation Accord was a beast also.  272 (?) horsepower on paper but most people thought it was closer to 300. All that being said, if I found a pre-2018 Honda Accord V6 6 speed with under 100,000 miles, I would probably jump on it. permalink parent award report block reply HanginChad 8 points 6 days ago A few years back a friend of mine asked for some car advice, a good SUV he wanted to buy new. I told him get the 4Runner. It was probably the oldest suv platform still made. He thanks me for that advice to this day. He'll call me while driving it to tell me how much he loves his car, especially with all the problems the new ones had. permalink parent award report block reply 38WendysHamSquare79 OP 7 points 6 days ago The new one with the stupid turbo 4 cylinder engine is fucking trash. The old V6 is so much better. The liberal faggots wanting better gas mileage for worse reliability can go fuck themselves. permalink parent award report block reply Nezock_theKnight 3 points 6 days ago My father brought the last generation 4Runner with the V6 right before they changed them out for the turbo/hybrid.  It's a very nice car.  But its basically a truck, on a truck platform IIRC.  He loves it and wouldn't have brought one if it was Hybrid or turbo. permalink parent award report block reply IBentMyWookie 2 points 6 days ago It only gets like 1-2 MPG more too. About the equivalent of a roof rack or low tire pressure. RIP naturally aspirated V6s. permalink parent award report block reply DonnieRamesJio 3 points 6 days ago Inherited a Gen 3, 285K on the clock and enjoying the work of undoing all the abuse of probably its 2nd owner.It's pretty much like building a C-10 out of the LMC catalog at swap meet prices permalink parent award report block reply Law_Sam 3 points 6 days ago I ordered a 22 trd pro and waited 8 months for it. Got it undercoated immediately. Then replaced all the factory Mats with Tux mats, if you know you know. Drive it only occasionally it sits at 9k miles now. Only seen premium and non ethinol gas. permalink parent award report block reply NomadicKrow2 2 points 5 days ago My first car was a Nissan 300ZX, 1986. No turbos, two seats and T-tops. I miss that fucking car. Still had it in 2009 but I had to borrow money against it and I lost it (because I went homeless and I was trying to keep my house while looking for another job). permalink parent award report block reply Nezock_theKnight 2 points 5 days ago Man, that's rough, I'm sorry.  My Uncle had an '85 300ZX 5 speed.  T-tops, but I don't remember if it was turbo or not.  I know it used to say \"key in the ignition\" in a female voice if you left the key in.  Pretty cool for an 8 year old boy. My father had a 1987 Toyota MR2 T-tops and 5 speed.  Awesome car.  He gave it to me in like 2015 after sitting outside his garage for 4 years.  Had a bees nest in it.  I changed the oil, filter, drained the gas, got new tires, had it checked out by a mechanic.  I actually had it driving.... but after 2 weeks, the dash lit up like a Christmas tree.  I needed a new alternator.  Eventually I decided to sell it for $1,500.  Brought a Mazda6 6-speed afterwards. I'm in a bit of a job situation myself now so I know how that sucks.  Hope things are going well now. permalink parent award report block reply NomadicKrow2 2 points 5 days ago Yeah! There were a few things that would make a female voice say stuff. My dad was like \"Yeah, it's like Kitt!\" My 16 year old self had no idea who Kitt was. My step mother has a 68 Mustang Coupe with the Windsor in it. Been sitting under a tarp for like 25 years. She's finally letting me and my dad pull it into the shop (once my dad gets it finished) and we'll start trying to restore it. Hopefully, the motor isn't seized. permalink parent award report block reply NoMaskNoMaster 1 points 5 days ago The Japs pulled a fast one on an entire generation of ricers making them think one of their shitty little cars has 272 horsepower lmao I still see ricers til this day and 80% of them have piston knocking from the aftermarket mufflers they install to try and sound like they have a real engine lmao permalink parent award report block reply Luckycoz 3 points 6 days ago I have a BMW 430i and a Model 3. A full electric is an amazing local hopper to go everywhere you need and start every day with a full charge. Road trips with it are the worst so we never take it more than 100 miles away. permalink parent award report block reply HanginChad 3 points 5 days ago You could probably get 90% of the electric car benefit from a plugin hybrid though. Some have nearly a 50 mile range, and no problem taking a road trip. permalink parent award report block reply NomadicKrow2 1 points 5 days ago The V8 is coming back. Congress passed a law that put a fine on engines that had certain emissions outputs. The fine was so high that they would never sell if they made then, so the manufacturers were doing what they could. When Trump went into office again, Congress lowered the fine to zero because they couldn't get rid of the fine altogether. So V8's are coming back. I think this is why the Bronco has a 3 cylinder diesel option. wtf permalink parent award report block reply AlmostFullyDilated 1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply lifeisahologram 13 points 6 days ago The next car I buy is going to be a classic.  No more modern cars for me. If I can find a reasonable price I might want to buy the Toyota from Back to the Future, that truck is sick. permalink award report block reply Patriot4TN 8 points 6 days ago As a kid, I wanted that truck so bad! permalink parent award report block reply Supersaying 1 points 5 days ago I wanted a Bigfoot like in police academy lol permalink parent award report block reply MAGAGIRL69 1 points 5 days ago What truck is it? permalink parent award report block reply Patriot4TN 0 points 5 days ago A black 1985 Toyota SR5 Xtra Cab pickup truck permalink parent award report block reply 38WendysHamSquare79 OP 6 points 6 days ago awesome truck, they are super reliable too permalink parent award report block reply Nezock_theKnight 6 points 6 days ago Gotta get the 5 speed too permalink parent award report block reply mydogma8yourkarma 3 points 6 days ago Good luck, those are well into Porsche money. permalink parent award report block reply 24601 11 points 6 days ago CARB. They aren't allowed to sell you awesome cars, because California says so. https://ww2.arb.ca.gov/resources/documents/laws-and-regulations However, life would be a little different if the illegal and unconstitutional CARB shit got tossed.... https://www.ericpetersautos.com/2024/06/30/the-13k-toyota-pickup-you-cant-buy/ permalink award report block reply The_Emperor 1 points 5 days ago EPA, CARB, and good old anti-humanist you shall afford nothing Communism. permalink parent award report block reply DogFart_ 11 points 6 days ago 2nd generation S10 has entered the chat permalink award report block reply Mungo 8 points 6 days ago Still rocking my 1997 2500 Suburban! permalink award report block reply sixfingerdildo 6 points 6 days ago epa for the lose. nhsta for the lose. turd world countries have access to basic, reliable transportation and utility vehicles. straight 6 iron blocks from the big 3 last forever, they don't want that. add basic fuel injection and electronic ignition and a cat,  you have a solid, efficient, clean platform. hop it up with alum head and vvt cam if you want, add full ecu with sensors everywhere if you want. but the base model should be just that, base model. fucking asshole politicians, tree hugging morons and greedy ivy league corporate wasps. permalink award report block reply UltimatePistachio 5 points 6 days ago I had to go out of my way 10 years ago to get my naturally aspirated f150. One of the best purchases I've made in my life. Zero problems, still works excellent and I've used it for so many projects. They kept trying to sell me on the turbo driven version and I had to keep pushing back - anyway yes what you posted is also a great truck also. permalink award report block reply suckmycorona 4 points 6 days ago I got hit with so many quality issue with my ford explorer with the Volvo twin turbo v 6.  Yes that’s a Volvo motor why ford bought them.  The motor was great but the explorer was shit.  Then at the same time I had a 2009 f250 give me the triton issue.  Repair bill of over 4k let’s just say I’m a never fire person now. permalink parent award report block reply UltimatePistachio 2 points 6 days ago I can hear you there. I'm not really a brand guy, it's just all a matter of luck with a lot of shit like this - watch, I just praised my truck and now it'll take a giant shit tomorrow when I really need it... What I'm trying to get at is that I think the simpler the better. No turbo, naturally aspirated - that's good. permalink parent award report block reply FuckU/Spez 1 points 6 days ago I have a 2007 Ram with 128K miles on it. Besides the phantom P456 code that pops up if it gets below 1/4 tank , it runs like a champ. permalink parent award report block reply suckmycorona 5 points 6 days ago Welcome to government regulations cause that’s what creates this. permalink award report block reply HIGH_ENERGY_MEMES 3 points 6 days ago I dont get the electric hate here. I literally have the pictured series but in double cab (and a lot more used condition). Absolutely love it for what it is, but I also like the idea of electric and hope to go there one day. Electric is potentially more independent as I can power the vehicle from solar panels, also avoid gas tax. I live rural and would love to get full off grid setup one day, though the heavy machinery will probably not happen. To do that electric vehicles will be a big part so I'm all for their advancement and uptake. permalink award report block reply Nezock_theKnight 1 points 5 days ago Get a diesel then convert the intake so the engine can run on used vegetable oil too.  There are aftermarket kits for this IIRC.  You can get free used vegetable oil from restaurants (or steal it a la Fight Club), filter it at home (or in your trunk) then use it like gasoline.  You have to start the engine on diesel, then switch to oil when hot (via a dashboard switch), and make sure to switch back to diesel before shutting off, to clean out the intake.  I always wanted to do this, but I've never owned a diesel. permalink parent award report block reply HIGH_ENERGY_MEMES 1 points 20 hours ago I get what your saying and appreciate the suggestion, but I feel then your reliant on driving into a town/city and hoping you can form a relationship with some food businesses. And if there is any global strife your locked into this which may change rather than being independent to your own farm. Seems simpler and more independent to have solar, batteries, cars and tractors that can run off the sun. I have solar already and its great for the bills. Will likely get batteries next few years. I assume some years after that there will some solid car options. Tractors I wont hold my breath! permalink parent award report block reply _Liberty_Prime_ 3 points 6 days ago Kinda fond of my hybrid. permalink award report block reply NeverInterruptEnemy 1 points 6 days ago Plug in hybrid, around town I fill up once a fucking month. When I was gas it’s got a pretty hot little turbo on the ICE. Love it permalink parent award report block reply NeoDragoon 2 points 6 days ago The turbos are the result of everything getting heavier from all the crap that gets added to either chase a luxury status, or to meet government requirements. permalink award report block reply OrangeElvis 2 points 5 days ago Paid $25k for a 2001 Humvee a couple years ago.  Less than 14k miles (original odomitor looks like to me), \"newer\" A2 6.5 L engine with some engine mods to keep it running cool in TX.  Gutless engine, but essentially a marine engine which should be good for 300k miles assuming I can keep everything else operating inside nominal parameters. I am not mechanically inclined, but I figured it was designed to be worked on in the field by 18 yr olds, so maybe I have a shot... Only issue thus far is a lift pump replacement (which was a PITA) but I got it done alone.  Change its oil and filters, flushed radiator and installed two new Hawker batteries and have plans for stereo, AC and accessories.  Work in progress. Drive it weekly and it runs like a champ.  Was my dream vehicle since the Governator got one and apparently a lot of others too by the looks and \"thumbs up\" I get driving it around. permalink award report block reply gorilla_grip 2 points 6 days ago I just bought a 20 year old diesel truck.  No DEF or other bullshit.  Doing an EGR delete. It runs awesome permalink award report block reply MasterVader2U 2 points 6 days ago Just got a B2000 running great again. permalink award report block reply Nezock_theKnight 1 points 6 days ago My first car was a 1990 Nissan Sentra XE.  5 speed.  90 hp engine.  No A/C, no power windows, no power locks.  Power steering??  WTF is that??  4 drum brakes.  2 door \"sedan\" style.  Not the best to look at, but that car never gave me ANY problems.  If I still had it today, I guarantee it would still run. Every other car I've had has had at least 1 problem.  Not big deals.  But the 90 Sentra was solid. My father had a 92 Nissan Sentra SE-R.  That was a nice little car. permalink award report block reply iaintgottimetobleed 1 points 5 days ago It's the women again.  New cars are afeminated and gay.  They know it's the woman who ultimately decides what car you will buy. permalink award report block reply KiekhaeferSoldier 1 points 5 days ago 1999 Chrysler Town n Country 290,000+ miles, 1999 Dodge Ram1500 Sport 361,000+ miles, 2003 Mercury Grand Marquis 171,000 miles, 2004 Ram 3500 5.9L Cummins 145,000 miles and I LOVE every one of them!  Grand Marquis was bought from neighbor's 89 yr old former WW2 Marine Sniper many years ago; had had one request when I bought it, “Find my Bausch & Lomb 'bullet hole' shooting glasses.”  I found them on top of the trunk mounted CD changer and returned them a couple months later and he teared up. permalink award report block reply grassshrimp 1 points 6 days ago I actually love them all. Hybrid jeep, can run on 100% electric and 100% gas.  It's like a great golf cart and don't have to go off the island in the summer for gas.  And great for long trips using gas only. Full electric Tesla.  With FSD basically drives itself, over 300 mile range, so good for 95% of my driving.  I have a level 2 charger at my house so charging isn't a problem.  Electric cars are more efficient, not losing power via transmission/drive train, etc. and have blinding speed. Don't need to talk about gas vehicles, everyone knows. permalink award report block reply AlmostFullyDilated 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply\nHanginChad 18 points 6 days ago All those have their place. Hybrid, great commuter, daily driver, stuck in traffic car. Turbo, diesel truck or sports car. Not a gas truck or SUVs. Electric... Ok I don't know. But losing naturally aspirated 8 cylinder trucks or even 6 cylinder ones sucks. Losing the 300hp Camry sucks or the Honda Accord coupe. I don't need a fucking rear view camera in a Miata either. WTF!? And I don't need fake analog gauges on a computer screen, looking at you Ford mustang. permalink award report block reply Aambrick 4 points 6 days ago Electric is for space. After all the fuel is quite literally facing the sun. Planet side or gravity wells would require different types of electric, but gravity wells that have atmospheres require combustibles. The only way I would condone an electric is in 2 ways: The battery has to have 1,000 miles range or a 200 hour charge. No brain for the car, but only for the power steering and electric charge distribution. Other than that everything except radio(if one really needs it) should be able to run mechanically by design rather than by a car brain that can be hacked easily. permalink parent award report block reply Nezock_theKnight 4 points 6 days ago I had a 2006 Honda Accord EX-V6 6 speed.  The 3.0 liter V6 was smooth AF.  Mated to a perfect 6 speed.  Now, don't get me wrong, the 2.0 Turbo in the last generation Accord was a beast also.  272 (?) horsepower on paper but most people thought it was closer to 300. All that being said, if I found a pre-2018 Honda Accord V6 6 speed with under 100,000 miles, I would probably jump on it. permalink parent award report block reply HanginChad 8 points 6 days ago A few years back a friend of mine asked for some car advice, a good SUV he wanted to buy new. I told him get the 4Runner. It was probably the oldest suv platform still made. He thanks me for that advice to this day. He'll call me while driving it to tell me how much he loves his car, especially with all the problems the new ones had. permalink parent award report block reply 38WendysHamSquare79 OP 7 points 6 days ago The new one with the stupid turbo 4 cylinder engine is fucking trash. The old V6 is so much better. The liberal faggots wanting better gas mileage for worse reliability can go fuck themselves. permalink parent award report block reply Nezock_theKnight 3 points 6 days ago My father brought the last generation 4Runner with the V6 right before they changed them out for the turbo/hybrid.  It's a very nice car.  But its basically a truck, on a truck platform IIRC.  He loves it and wouldn't have brought one if it was Hybrid or turbo. permalink parent award report block reply IBentMyWookie 2 points 6 days ago It only gets like 1-2 MPG more too. About the equivalent of a roof rack or low tire pressure. RIP naturally aspirated V6s. permalink parent award report block reply DonnieRamesJio 3 points 6 days ago Inherited a Gen 3, 285K on the clock and enjoying the work of undoing all the abuse of probably its 2nd owner.It's pretty much like building a C-10 out of the LMC catalog at swap meet prices permalink parent award report block reply Law_Sam 3 points 6 days ago I ordered a 22 trd pro and waited 8 months for it. Got it undercoated immediately. Then replaced all the factory Mats with Tux mats, if you know you know. Drive it only occasionally it sits at 9k miles now. Only seen premium and non ethinol gas. permalink parent award report block reply NomadicKrow2 2 points 5 days ago My first car was a Nissan 300ZX, 1986. No turbos, two seats and T-tops. I miss that fucking car. Still had it in 2009 but I had to borrow money against it and I lost it (because I went homeless and I was trying to keep my house while looking for another job). permalink parent award report block reply Nezock_theKnight 2 points 5 days ago Man, that's rough, I'm sorry.  My Uncle had an '85 300ZX 5 speed.  T-tops, but I don't remember if it was turbo or not.  I know it used to say \"key in the ignition\" in a female voice if you left the key in.  Pretty cool for an 8 year old boy. My father had a 1987 Toyota MR2 T-tops and 5 speed.  Awesome car.  He gave it to me in like 2015 after sitting outside his garage for 4 years.  Had a bees nest in it.  I changed the oil, filter, drained the gas, got new tires, had it checked out by a mechanic.  I actually had it driving.... but after 2 weeks, the dash lit up like a Christmas tree.  I needed a new alternator.  Eventually I decided to sell it for $1,500.  Brought a Mazda6 6-speed afterwards. I'm in a bit of a job situation myself now so I know how that sucks.  Hope things are going well now. permalink parent award report block reply NomadicKrow2 2 points 5 days ago Yeah! There were a few things that would make a female voice say stuff. My dad was like \"Yeah, it's like Kitt!\" My 16 year old self had no idea who Kitt was. My step mother has a 68 Mustang Coupe with the Windsor in it. Been sitting under a tarp for like 25 years. She's finally letting me and my dad pull it into the shop (once my dad gets it finished) and we'll start trying to restore it. Hopefully, the motor isn't seized. permalink parent award report block reply NoMaskNoMaster 1 points 5 days ago The Japs pulled a fast one on an entire generation of ricers making them think one of their shitty little cars has 272 horsepower lmao I still see ricers til this day and 80% of them have piston knocking from the aftermarket mufflers they install to try and sound like they have a real engine lmao permalink parent award report block reply Luckycoz 3 points 6 days ago I have a BMW 430i and a Model 3. A full electric is an amazing local hopper to go everywhere you need and start every day with a full charge. Road trips with it are the worst so we never take it more than 100 miles away. permalink parent award report block reply HanginChad 3 points 5 days ago You could probably get 90% of the electric car benefit from a plugin hybrid though. Some have nearly a 50 mile range, and no problem taking a road trip. permalink parent award report block reply NomadicKrow2 1 points 5 days ago The V8 is coming back. Congress passed a law that put a fine on engines that had certain emissions outputs. The fine was so high that they would never sell if they made then, so the manufacturers were doing what they could. When Trump went into office again, Congress lowered the fine to zero because they couldn't get rid of the fine altogether. So V8's are coming back. I think this is why the Bronco has a 3 cylinder diesel option. wtf permalink parent award report block reply AlmostFullyDilated 1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nAambrick 4 points 6 days ago Electric is for space. After all the fuel is quite literally facing the sun. Planet side or gravity wells would require different types of electric, but gravity wells that have atmospheres require combustibles. The only way I would condone an electric is in 2 ways: The battery has to have 1,000 miles range or a 200 hour charge. No brain for the car, but only for the power steering and electric charge distribution. Other than that everything except radio(if one really needs it) should be able to run mechanically by design rather than by a car brain that can be hacked easily. permalink parent award report block reply\nNezock_theKnight 4 points 6 days ago I had a 2006 Honda Accord EX-V6 6 speed.  The 3.0 liter V6 was smooth AF.  Mated to a perfect 6 speed.  Now, don't get me wrong, the 2.0 Turbo in the last generation Accord was a beast also.  272 (?) horsepower on paper but most people thought it was closer to 300. All that being said, if I found a pre-2018 Honda Accord V6 6 speed with under 100,000 miles, I would probably jump on it. permalink parent award report block reply HanginChad 8 points 6 days ago A few years back a friend of mine asked for some car advice, a good SUV he wanted to buy new. I told him get the 4Runner. It was probably the oldest suv platform still made. He thanks me for that advice to this day. He'll call me while driving it to tell me how much he loves his car, especially with all the problems the new ones had. permalink parent award report block reply 38WendysHamSquare79 OP 7 points 6 days ago The new one with the stupid turbo 4 cylinder engine is fucking trash. The old V6 is so much better. The liberal faggots wanting better gas mileage for worse reliability can go fuck themselves. permalink parent award report block reply Nezock_theKnight 3 points 6 days ago My father brought the last generation 4Runner with the V6 right before they changed them out for the turbo/hybrid.  It's a very nice car.  But its basically a truck, on a truck platform IIRC.  He loves it and wouldn't have brought one if it was Hybrid or turbo. permalink parent award report block reply IBentMyWookie 2 points 6 days ago It only gets like 1-2 MPG more too. About the equivalent of a roof rack or low tire pressure. RIP naturally aspirated V6s. permalink parent award report block reply DonnieRamesJio 3 points 6 days ago Inherited a Gen 3, 285K on the clock and enjoying the work of undoing all the abuse of probably its 2nd owner.It's pretty much like building a C-10 out of the LMC catalog at swap meet prices permalink parent award report block reply Law_Sam 3 points 6 days ago I ordered a 22 trd pro and waited 8 months for it. Got it undercoated immediately. Then replaced all the factory Mats with Tux mats, if you know you know. Drive it only occasionally it sits at 9k miles now. Only seen premium and non ethinol gas. permalink parent award report block reply NomadicKrow2 2 points 5 days ago My first car was a Nissan 300ZX, 1986. No turbos, two seats and T-tops. I miss that fucking car. Still had it in 2009 but I had to borrow money against it and I lost it (because I went homeless and I was trying to keep my house while looking for another job). permalink parent award report block reply Nezock_theKnight 2 points 5 days ago Man, that's rough, I'm sorry.  My Uncle had an '85 300ZX 5 speed.  T-tops, but I don't remember if it was turbo or not.  I know it used to say \"key in the ignition\" in a female voice if you left the key in.  Pretty cool for an 8 year old boy. My father had a 1987 Toyota MR2 T-tops and 5 speed.  Awesome car.  He gave it to me in like 2015 after sitting outside his garage for 4 years.  Had a bees nest in it.  I changed the oil, filter, drained the gas, got new tires, had it checked out by a mechanic.  I actually had it driving.... but after 2 weeks, the dash lit up like a Christmas tree.  I needed a new alternator.  Eventually I decided to sell it for $1,500.  Brought a Mazda6 6-speed afterwards. I'm in a bit of a job situation myself now so I know how that sucks.  Hope things are going well now. permalink parent award report block reply NomadicKrow2 2 points 5 days ago Yeah! There were a few things that would make a female voice say stuff. My dad was like \"Yeah, it's like Kitt!\" My 16 year old self had no idea who Kitt was. My step mother has a 68 Mustang Coupe with the Windsor in it. Been sitting under a tarp for like 25 years. She's finally letting me and my dad pull it into the shop (once my dad gets it finished) and we'll start trying to restore it. Hopefully, the motor isn't seized. permalink parent award report block reply NoMaskNoMaster 1 points 5 days ago The Japs pulled a fast one on an entire generation of ricers making them think one of their shitty little cars has 272 horsepower lmao I still see ricers til this day and 80% of them have piston knocking from the aftermarket mufflers they install to try and sound like they have a real engine lmao permalink parent award report block reply\nHanginChad 8 points 6 days ago A few years back a friend of mine asked for some car advice, a good SUV he wanted to buy new. I told him get the 4Runner. It was probably the oldest suv platform still made. He thanks me for that advice to this day. He'll call me while driving it to tell me how much he loves his car, especially with all the problems the new ones had. permalink parent award report block reply 38WendysHamSquare79 OP 7 points 6 days ago The new one with the stupid turbo 4 cylinder engine is fucking trash. The old V6 is so much better. The liberal faggots wanting better gas mileage for worse reliability can go fuck themselves. permalink parent award report block reply Nezock_theKnight 3 points 6 days ago My father brought the last generation 4Runner with the V6 right before they changed them out for the turbo/hybrid.  It's a very nice car.  But its basically a truck, on a truck platform IIRC.  He loves it and wouldn't have brought one if it was Hybrid or turbo. permalink parent award report block reply IBentMyWookie 2 points 6 days ago It only gets like 1-2 MPG more too. About the equivalent of a roof rack or low tire pressure. RIP naturally aspirated V6s. permalink parent award report block reply DonnieRamesJio 3 points 6 days ago Inherited a Gen 3, 285K on the clock and enjoying the work of undoing all the abuse of probably its 2nd owner.It's pretty much like building a C-10 out of the LMC catalog at swap meet prices permalink parent award report block reply Law_Sam 3 points 6 days ago I ordered a 22 trd pro and waited 8 months for it. Got it undercoated immediately. Then replaced all the factory Mats with Tux mats, if you know you know. Drive it only occasionally it sits at 9k miles now. Only seen premium and non ethinol gas. permalink parent award report block reply\n38WendysHamSquare79 OP 7 points 6 days ago The new one with the stupid turbo 4 cylinder engine is fucking trash. The old V6 is so much better. The liberal faggots wanting better gas mileage for worse reliability can go fuck themselves. permalink parent award report block reply Nezock_theKnight 3 points 6 days ago My father brought the last generation 4Runner with the V6 right before they changed them out for the turbo/hybrid.  It's a very nice car.  But its basically a truck, on a truck platform IIRC.  He loves it and wouldn't have brought one if it was Hybrid or turbo. permalink parent award report block reply IBentMyWookie 2 points 6 days ago It only gets like 1-2 MPG more too. About the equivalent of a roof rack or low tire pressure. RIP naturally aspirated V6s. permalink parent award report block reply\nNezock_theKnight 3 points 6 days ago My father brought the last generation 4Runner with the V6 right before they changed them out for the turbo/hybrid.  It's a very nice car.  But its basically a truck, on a truck platform IIRC.  He loves it and wouldn't have brought one if it was Hybrid or turbo. permalink parent award report block reply\nIBentMyWookie 2 points 6 days ago It only gets like 1-2 MPG more too. About the equivalent of a roof rack or low tire pressure. RIP naturally aspirated V6s. permalink parent award report block reply\nDonnieRamesJio 3 points 6 days ago Inherited a Gen 3, 285K on the clock and enjoying the work of undoing all the abuse of probably its 2nd owner.It's pretty much like building a C-10 out of the LMC catalog at swap meet prices permalink parent award report block reply\nLaw_Sam 3 points 6 days ago I ordered a 22 trd pro and waited 8 months for it. Got it undercoated immediately. Then replaced all the factory Mats with Tux mats, if you know you know. Drive it only occasionally it sits at 9k miles now. Only seen premium and non ethinol gas. permalink parent award report block reply\nNomadicKrow2 2 points 5 days ago My first car was a Nissan 300ZX, 1986. No turbos, two seats and T-tops. I miss that fucking car. Still had it in 2009 but I had to borrow money against it and I lost it (because I went homeless and I was trying to keep my house while looking for another job). permalink parent award report block reply Nezock_theKnight 2 points 5 days ago Man, that's rough, I'm sorry.  My Uncle had an '85 300ZX 5 speed.  T-tops, but I don't remember if it was turbo or not.  I know it used to say \"key in the ignition\" in a female voice if you left the key in.  Pretty cool for an 8 year old boy. My father had a 1987 Toyota MR2 T-tops and 5 speed.  Awesome car.  He gave it to me in like 2015 after sitting outside his garage for 4 years.  Had a bees nest in it.  I changed the oil, filter, drained the gas, got new tires, had it checked out by a mechanic.  I actually had it driving.... but after 2 weeks, the dash lit up like a Christmas tree.  I needed a new alternator.  Eventually I decided to sell it for $1,500.  Brought a Mazda6 6-speed afterwards. I'm in a bit of a job situation myself now so I know how that sucks.  Hope things are going well now. permalink parent award report block reply NomadicKrow2 2 points 5 days ago Yeah! There were a few things that would make a female voice say stuff. My dad was like \"Yeah, it's like Kitt!\" My 16 year old self had no idea who Kitt was. My step mother has a 68 Mustang Coupe with the Windsor in it. Been sitting under a tarp for like 25 years. She's finally letting me and my dad pull it into the shop (once my dad gets it finished) and we'll start trying to restore it. Hopefully, the motor isn't seized. permalink parent award report block reply\nNezock_theKnight 2 points 5 days ago Man, that's rough, I'm sorry.  My Uncle had an '85 300ZX 5 speed.  T-tops, but I don't remember if it was turbo or not.  I know it used to say \"key in the ignition\" in a female voice if you left the key in.  Pretty cool for an 8 year old boy. My father had a 1987 Toyota MR2 T-tops and 5 speed.  Awesome car.  He gave it to me in like 2015 after sitting outside his garage for 4 years.  Had a bees nest in it.  I changed the oil, filter, drained the gas, got new tires, had it checked out by a mechanic.  I actually had it driving.... but after 2 weeks, the dash lit up like a Christmas tree.  I needed a new alternator.  Eventually I decided to sell it for $1,500.  Brought a Mazda6 6-speed afterwards. I'm in a bit of a job situation myself now so I know how that sucks.  Hope things are going well now. permalink parent award report block reply NomadicKrow2 2 points 5 days ago Yeah! There were a few things that would make a female voice say stuff. My dad was like \"Yeah, it's like Kitt!\" My 16 year old self had no idea who Kitt was. My step mother has a 68 Mustang Coupe with the Windsor in it. Been sitting under a tarp for like 25 years. She's finally letting me and my dad pull it into the shop (once my dad gets it finished) and we'll start trying to restore it. Hopefully, the motor isn't seized. permalink parent award report block reply\nNomadicKrow2 2 points 5 days ago Yeah! There were a few things that would make a female voice say stuff. My dad was like \"Yeah, it's like Kitt!\" My 16 year old self had no idea who Kitt was. My step mother has a 68 Mustang Coupe with the Windsor in it. Been sitting under a tarp for like 25 years. She's finally letting me and my dad pull it into the shop (once my dad gets it finished) and we'll start trying to restore it. Hopefully, the motor isn't seized. permalink parent award report block reply\nNoMaskNoMaster 1 points 5 days ago The Japs pulled a fast one on an entire generation of ricers making them think one of their shitty little cars has 272 horsepower lmao I still see ricers til this day and 80% of them have piston knocking from the aftermarket mufflers they install to try and sound like they have a real engine lmao permalink parent award report block reply\nLuckycoz 3 points 6 days ago I have a BMW 430i and a Model 3. A full electric is an amazing local hopper to go everywhere you need and start every day with a full charge. Road trips with it are the worst so we never take it more than 100 miles away. permalink parent award report block reply HanginChad 3 points 5 days ago You could probably get 90% of the electric car benefit from a plugin hybrid though. Some have nearly a 50 mile range, and no problem taking a road trip. permalink parent award report block reply\nHanginChad 3 points 5 days ago You could probably get 90% of the electric car benefit from a plugin hybrid though. Some have nearly a 50 mile range, and no problem taking a road trip. permalink parent award report block reply\nNomadicKrow2 1 points 5 days ago The V8 is coming back. Congress passed a law that put a fine on engines that had certain emissions outputs. The fine was so high that they would never sell if they made then, so the manufacturers were doing what they could. When Trump went into office again, Congress lowered the fine to zero because they couldn't get rid of the fine altogether. So V8's are coming back. I think this is why the Bronco has a 3 cylinder diesel option. wtf permalink parent award report block reply\nAlmostFullyDilated 1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nlifeisahologram 13 points 6 days ago The next car I buy is going to be a classic.  No more modern cars for me. If I can find a reasonable price I might want to buy the Toyota from Back to the Future, that truck is sick. permalink award report block reply Patriot4TN 8 points 6 days ago As a kid, I wanted that truck so bad! permalink parent award report block reply Supersaying 1 points 5 days ago I wanted a Bigfoot like in police academy lol permalink parent award report block reply MAGAGIRL69 1 points 5 days ago What truck is it? permalink parent award report block reply Patriot4TN 0 points 5 days ago A black 1985 Toyota SR5 Xtra Cab pickup truck permalink parent award report block reply 38WendysHamSquare79 OP 6 points 6 days ago awesome truck, they are super reliable too permalink parent award report block reply Nezock_theKnight 6 points 6 days ago Gotta get the 5 speed too permalink parent award report block reply mydogma8yourkarma 3 points 6 days ago Good luck, those are well into Porsche money. permalink parent award report block reply\nPatriot4TN 8 points 6 days ago As a kid, I wanted that truck so bad! permalink parent award report block reply Supersaying 1 points 5 days ago I wanted a Bigfoot like in police academy lol permalink parent award report block reply MAGAGIRL69 1 points 5 days ago What truck is it? permalink parent award report block reply Patriot4TN 0 points 5 days ago A black 1985 Toyota SR5 Xtra Cab pickup truck permalink parent award report block reply\nSupersaying 1 points 5 days ago I wanted a Bigfoot like in police academy lol permalink parent award report block reply\nMAGAGIRL69 1 points 5 days ago What truck is it? permalink parent award report block reply Patriot4TN 0 points 5 days ago A black 1985 Toyota SR5 Xtra Cab pickup truck permalink parent award report block reply\nPatriot4TN 0 points 5 days ago A black 1985 Toyota SR5 Xtra Cab pickup truck permalink parent award report block reply\n38WendysHamSquare79 OP 6 points 6 days ago awesome truck, they are super reliable too permalink parent award report block reply\nNezock_theKnight 6 points 6 days ago Gotta get the 5 speed too permalink parent award report block reply\nmydogma8yourkarma 3 points 6 days ago Good luck, those are well into Porsche money. permalink parent award report block reply\n24601 11 points 6 days ago CARB. They aren't allowed to sell you awesome cars, because California says so. https://ww2.arb.ca.gov/resources/documents/laws-and-regulations However, life would be a little different if the illegal and unconstitutional CARB shit got tossed.... https://www.ericpetersautos.com/2024/06/30/the-13k-toyota-pickup-you-cant-buy/ permalink award report block reply The_Emperor 1 points 5 days ago EPA, CARB, and good old anti-humanist you shall afford nothing Communism. permalink parent award report block reply\nThe_Emperor 1 points 5 days ago EPA, CARB, and good old anti-humanist you shall afford nothing Communism. permalink parent award report block reply\nDogFart_ 11 points 6 days ago 2nd generation S10 has entered the chat permalink award report block reply\nMungo 8 points 6 days ago Still rocking my 1997 2500 Suburban! permalink award report block reply\nsixfingerdildo 6 points 6 days ago epa for the lose. nhsta for the lose. turd world countries have access to basic, reliable transportation and utility vehicles. straight 6 iron blocks from the big 3 last forever, they don't want that. add basic fuel injection and electronic ignition and a cat,  you have a solid, efficient, clean platform. hop it up with alum head and vvt cam if you want, add full ecu with sensors everywhere if you want. but the base model should be just that, base model. fucking asshole politicians, tree hugging morons and greedy ivy league corporate wasps. permalink award report block reply\nUltimatePistachio 5 points 6 days ago I had to go out of my way 10 years ago to get my naturally aspirated f150. One of the best purchases I've made in my life. Zero problems, still works excellent and I've used it for so many projects. They kept trying to sell me on the turbo driven version and I had to keep pushing back - anyway yes what you posted is also a great truck also. permalink award report block reply suckmycorona 4 points 6 days ago I got hit with so many quality issue with my ford explorer with the Volvo twin turbo v 6.  Yes that’s a Volvo motor why ford bought them.  The motor was great but the explorer was shit.  Then at the same time I had a 2009 f250 give me the triton issue.  Repair bill of over 4k let’s just say I’m a never fire person now. permalink parent award report block reply UltimatePistachio 2 points 6 days ago I can hear you there. I'm not really a brand guy, it's just all a matter of luck with a lot of shit like this - watch, I just praised my truck and now it'll take a giant shit tomorrow when I really need it... What I'm trying to get at is that I think the simpler the better. No turbo, naturally aspirated - that's good. permalink parent award report block reply FuckU/Spez 1 points 6 days ago I have a 2007 Ram with 128K miles on it. Besides the phantom P456 code that pops up if it gets below 1/4 tank , it runs like a champ. permalink parent award report block reply\nsuckmycorona 4 points 6 days ago I got hit with so many quality issue with my ford explorer with the Volvo twin turbo v 6.  Yes that’s a Volvo motor why ford bought them.  The motor was great but the explorer was shit.  Then at the same time I had a 2009 f250 give me the triton issue.  Repair bill of over 4k let’s just say I’m a never fire person now. permalink parent award report block reply UltimatePistachio 2 points 6 days ago I can hear you there. I'm not really a brand guy, it's just all a matter of luck with a lot of shit like this - watch, I just praised my truck and now it'll take a giant shit tomorrow when I really need it... What I'm trying to get at is that I think the simpler the better. No turbo, naturally aspirated - that's good. permalink parent award report block reply\nUltimatePistachio 2 points 6 days ago I can hear you there. I'm not really a brand guy, it's just all a matter of luck with a lot of shit like this - watch, I just praised my truck and now it'll take a giant shit tomorrow when I really need it... What I'm trying to get at is that I think the simpler the better. No turbo, naturally aspirated - that's good. permalink parent award report block reply\nFuckU/Spez 1 points 6 days ago I have a 2007 Ram with 128K miles on it. Besides the phantom P456 code that pops up if it gets below 1/4 tank , it runs like a champ. permalink parent award report block reply\nsuckmycorona 5 points 6 days ago Welcome to government regulations cause that’s what creates this. permalink award report block reply\nHIGH_ENERGY_MEMES 3 points 6 days ago I dont get the electric hate here. I literally have the pictured series but in double cab (and a lot more used condition). Absolutely love it for what it is, but I also like the idea of electric and hope to go there one day. Electric is potentially more independent as I can power the vehicle from solar panels, also avoid gas tax. I live rural and would love to get full off grid setup one day, though the heavy machinery will probably not happen. To do that electric vehicles will be a big part so I'm all for their advancement and uptake. permalink award report block reply Nezock_theKnight 1 points 5 days ago Get a diesel then convert the intake so the engine can run on used vegetable oil too.  There are aftermarket kits for this IIRC.  You can get free used vegetable oil from restaurants (or steal it a la Fight Club), filter it at home (or in your trunk) then use it like gasoline.  You have to start the engine on diesel, then switch to oil when hot (via a dashboard switch), and make sure to switch back to diesel before shutting off, to clean out the intake.  I always wanted to do this, but I've never owned a diesel. permalink parent award report block reply HIGH_ENERGY_MEMES 1 points 20 hours ago I get what your saying and appreciate the suggestion, but I feel then your reliant on driving into a town/city and hoping you can form a relationship with some food businesses. And if there is any global strife your locked into this which may change rather than being independent to your own farm. Seems simpler and more independent to have solar, batteries, cars and tractors that can run off the sun. I have solar already and its great for the bills. Will likely get batteries next few years. I assume some years after that there will some solid car options. Tractors I wont hold my breath! permalink parent award report block reply\nNezock_theKnight 1 points 5 days ago Get a diesel then convert the intake so the engine can run on used vegetable oil too.  There are aftermarket kits for this IIRC.  You can get free used vegetable oil from restaurants (or steal it a la Fight Club), filter it at home (or in your trunk) then use it like gasoline.  You have to start the engine on diesel, then switch to oil when hot (via a dashboard switch), and make sure to switch back to diesel before shutting off, to clean out the intake.  I always wanted to do this, but I've never owned a diesel. permalink parent award report block reply HIGH_ENERGY_MEMES 1 points 20 hours ago I get what your saying and appreciate the suggestion, but I feel then your reliant on driving into a town/city and hoping you can form a relationship with some food businesses. And if there is any global strife your locked into this which may change rather than being independent to your own farm. Seems simpler and more independent to have solar, batteries, cars and tractors that can run off the sun. I have solar already and its great for the bills. Will likely get batteries next few years. I assume some years after that there will some solid car options. Tractors I wont hold my breath! permalink parent award report block reply\nHIGH_ENERGY_MEMES 1 points 20 hours ago I get what your saying and appreciate the suggestion, but I feel then your reliant on driving into a town/city and hoping you can form a relationship with some food businesses. And if there is any global strife your locked into this which may change rather than being independent to your own farm. Seems simpler and more independent to have solar, batteries, cars and tractors that can run off the sun. I have solar already and its great for the bills. Will likely get batteries next few years. I assume some years after that there will some solid car options. Tractors I wont hold my breath! permalink parent award report block reply\n_Liberty_Prime_ 3 points 6 days ago Kinda fond of my hybrid. permalink award report block reply NeverInterruptEnemy 1 points 6 days ago Plug in hybrid, around town I fill up once a fucking month. When I was gas it’s got a pretty hot little turbo on the ICE. Love it permalink parent award report block reply\nNeverInterruptEnemy 1 points 6 days ago Plug in hybrid, around town I fill up once a fucking month. When I was gas it’s got a pretty hot little turbo on the ICE. Love it permalink parent award report block reply\nNeoDragoon 2 points 6 days ago The turbos are the result of everything getting heavier from all the crap that gets added to either chase a luxury status, or to meet government requirements. permalink award report block reply\nOrangeElvis 2 points 5 days ago Paid $25k for a 2001 Humvee a couple years ago.  Less than 14k miles (original odomitor looks like to me), \"newer\" A2 6.5 L engine with some engine mods to keep it running cool in TX.  Gutless engine, but essentially a marine engine which should be good for 300k miles assuming I can keep everything else operating inside nominal parameters. I am not mechanically inclined, but I figured it was designed to be worked on in the field by 18 yr olds, so maybe I have a shot... Only issue thus far is a lift pump replacement (which was a PITA) but I got it done alone.  Change its oil and filters, flushed radiator and installed two new Hawker batteries and have plans for stereo, AC and accessories.  Work in progress. Drive it weekly and it runs like a champ.  Was my dream vehicle since the Governator got one and apparently a lot of others too by the looks and \"thumbs up\" I get driving it around. permalink award report block reply\ngorilla_grip 2 points 6 days ago I just bought a 20 year old diesel truck.  No DEF or other bullshit.  Doing an EGR delete. It runs awesome permalink award report block reply\nMasterVader2U 2 points 6 days ago Just got a B2000 running great again. permalink award report block reply\nNezock_theKnight 1 points 6 days ago My first car was a 1990 Nissan Sentra XE.  5 speed.  90 hp engine.  No A/C, no power windows, no power locks.  Power steering??  WTF is that??  4 drum brakes.  2 door \"sedan\" style.  Not the best to look at, but that car never gave me ANY problems.  If I still had it today, I guarantee it would still run. Every other car I've had has had at least 1 problem.  Not big deals.  But the 90 Sentra was solid. My father had a 92 Nissan Sentra SE-R.  That was a nice little car. permalink award report block reply\niaintgottimetobleed 1 points 5 days ago It's the women again.  New cars are afeminated and gay.  They know it's the woman who ultimately decides what car you will buy. permalink award report block reply\nKiekhaeferSoldier 1 points 5 days ago 1999 Chrysler Town n Country 290,000+ miles, 1999 Dodge Ram1500 Sport 361,000+ miles, 2003 Mercury Grand Marquis 171,000 miles, 2004 Ram 3500 5.9L Cummins 145,000 miles and I LOVE every one of them!  Grand Marquis was bought from neighbor's 89 yr old former WW2 Marine Sniper many years ago; had had one request when I bought it, “Find my Bausch & Lomb 'bullet hole' shooting glasses.”  I found them on top of the trunk mounted CD changer and returned them a couple months later and he teared up. permalink award report block reply\ngrassshrimp 1 points 6 days ago I actually love them all. Hybrid jeep, can run on 100% electric and 100% gas.  It's like a great golf cart and don't have to go off the island in the summer for gas.  And great for long trips using gas only. Full electric Tesla.  With FSD basically drives itself, over 300 mile range, so good for 95% of my driving.  I have a level 2 charger at my house so charging isn't a problem.  Electric cars are more efficient, not losing power via transmission/drive train, etc. and have blinding speed. Don't need to talk about gas vehicles, everyone knows. permalink award report block reply\nAlmostFullyDilated 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply"}