{"id": "1ARK9nPdGH", "contents": "15 The Democraft shutdown failed, not they're going to craft a narrative to Impeach Trump with the help of Michael Wolfe and the NYT. 🛑  Corrupt Commies  🛑 posted 5 hours ago by sleepy_bob_ross 5 comments award share report block They've been planning this as their plan B for years, get ready! They're going to make you doubt POTUS so you won't circle the wagons when they strike.\n5 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style sleepy_bob_ross OP 4 points 5 hours ago They Killed Virginia Guiffre for a reason! So she can't refute their narrative. They tried to take her out with a car crash Then they took her out medically Now the only person who \"knows\" Epstein is Michael Wolfe Get ready permalink award report block reply MrMcGreenGenes -2 points 5 hours ago Trump took a shit on MAGA. Good luck rustling up any further support from us. permalink award report block reply sleepy_bob_ross OP 2 points 5 hours ago You're a fake democrat account here for one reason permalink parent award report block reply MrMcGreenGenes -1 points 5 hours ago No, but you're definitely a retarded faggot. permalink parent award report block reply SpaceWizard 1 points 5 hours ago Speak for yourself faggot permalink parent award report block reply\nsleepy_bob_ross OP 4 points 5 hours ago They Killed Virginia Guiffre for a reason! So she can't refute their narrative. They tried to take her out with a car crash Then they took her out medically Now the only person who \"knows\" Epstein is Michael Wolfe Get ready permalink award report block reply\nMrMcGreenGenes -2 points 5 hours ago Trump took a shit on MAGA. Good luck rustling up any further support from us. permalink award report block reply sleepy_bob_ross OP 2 points 5 hours ago You're a fake democrat account here for one reason permalink parent award report block reply MrMcGreenGenes -1 points 5 hours ago No, but you're definitely a retarded faggot. permalink parent award report block reply SpaceWizard 1 points 5 hours ago Speak for yourself faggot permalink parent award report block reply\nsleepy_bob_ross OP 2 points 5 hours ago You're a fake democrat account here for one reason permalink parent award report block reply MrMcGreenGenes -1 points 5 hours ago No, but you're definitely a retarded faggot. permalink parent award report block reply\nMrMcGreenGenes -1 points 5 hours ago No, but you're definitely a retarded faggot. permalink parent award report block reply\nSpaceWizard 1 points 5 hours ago Speak for yourself faggot permalink parent award report block reply"}