{"id": "1ARK9oXkOs", "contents": "83 Bringing in foreign talent to train Americans doesn't require a 6 year H-1B visa. They can come for 1 or 2 or 3 months to accomplish training (without bringing their entire family). \n\nNo need to buy a house or set down roots. No need to enroll their children in the school system. posted 15 hours ago by PiratePatriotParrot 6 comments award share report block Wall Street Mav @WallStreetMav • 18h Bringing in foreign talent to train Americans doesn't require a 6 year H-1B visa. They can come for 1 or 2 or 3 months to accomplish training (without bringing their entire family). No need to buy a house or set down roots. No need to enroll their children in the school system.\n6 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style papa_newguineapig 4 points 15 hours ago Pro Tip, Street shitters are, contrary to popular myth, ASS at tech. permalink award report block reply DingDongDitch 4 points 13 hours ago shitty ass at best. look at the coding contests around the world. jeets never win. and what tech was invented there? waiting. permalink parent award report block reply papa_newguineapig 1 points 3 hours ago Exactly. permalink parent award report block reply General_Specific 3 points 14 hours ago Then they'll never come. That is the whole point. They come willing to work cheap because they know they'll be able to stay. permalink award report block reply Dmajallen 3 points 14 hours ago My question is when did the US start outsourcing missile production? permalink award report block reply patrioticwinning3 1 points 13 hours ago Wonder why we are getting spammed with H1B shit? Someone is now offering $3-5k per post of \"pro-H1B\" propaganda! https://x.com/Will_Panic/status/1988676599303270490 permalink award report block reply\npapa_newguineapig 4 points 15 hours ago Pro Tip, Street shitters are, contrary to popular myth, ASS at tech. permalink award report block reply DingDongDitch 4 points 13 hours ago shitty ass at best. look at the coding contests around the world. jeets never win. and what tech was invented there? waiting. permalink parent award report block reply papa_newguineapig 1 points 3 hours ago Exactly. permalink parent award report block reply\nDingDongDitch 4 points 13 hours ago shitty ass at best. look at the coding contests around the world. jeets never win. and what tech was invented there? waiting. permalink parent award report block reply papa_newguineapig 1 points 3 hours ago Exactly. permalink parent award report block reply\npapa_newguineapig 1 points 3 hours ago Exactly. permalink parent award report block reply\nGeneral_Specific 3 points 14 hours ago Then they'll never come. That is the whole point. They come willing to work cheap because they know they'll be able to stay. permalink award report block reply\nDmajallen 3 points 14 hours ago My question is when did the US start outsourcing missile production? permalink award report block reply\npatrioticwinning3 1 points 13 hours ago Wonder why we are getting spammed with H1B shit? Someone is now offering $3-5k per post of \"pro-H1B\" propaganda! https://x.com/Will_Panic/status/1988676599303270490 permalink award report block reply"}