{"id": "1ARK9nNi7V", "contents": "78 How true posted 10 hours ago by wst4 12 comments award share download report block\n12 comments Sort by Top Top New Worst Old Save c_programmer 8 points 8 hours ago Retarded take. If moms arm was enough you were never even in a moderately serious crash. permalink award report block reply happyfave 6 points 8 hours ago No... it really wasnt true, those kids were dead if they got in an accident, Mom is not strong enough. permalink award report block reply Maganifice7 6 points 8 hours ago I have a friend that works in the H. E. R. O. Program in Texas. He's seen what happens to people who don't wear seat belts. Wear a seat belt. permalink award report block reply Illah88zillah 5 points 7 hours ago What in the Facebook boomer is going on in here?!? Dont post this trash here permalink award report block reply NeverInterruptEnemy 2 points 4 hours ago Retard generator permalink parent award report block reply Bearing51 5 points 9 hours ago We also didn't have roads filled with streetshitters and dindus back then. permalink award report block reply Aggrieved03 1 points 9 hours ago Then we became a nation of faggots! permalink award report block reply 19American62Woman 1 points 9 hours ago I still do that! Some habits are hard to break! permalink award report block reply happyfave 2 points 8 hours ago You would let your kids drive in the front seat of a truck without seatbelts on ? permalink parent award report block reply 19American62Woman 1 points 7 hours ago We didn’t have seat belts back then. permalink parent award report block reply Hunter_loves_2_feet 1 points 6 hours ago My feeling is that if a seatbelt is too uncomfortable for a person to wear then Fuckit. They don’t value their lives. Let the pussy retard die in a car crash. But not buckling up your kids should land you in jail. permalink award report block reply\nc_programmer 8 points 8 hours ago Retarded take. If moms arm was enough you were never even in a moderately serious crash. permalink award report block reply\nhappyfave 6 points 8 hours ago No... it really wasnt true, those kids were dead if they got in an accident, Mom is not strong enough. permalink award report block reply\nMaganifice7 6 points 8 hours ago I have a friend that works in the H. E. R. O. Program in Texas. He's seen what happens to people who don't wear seat belts. Wear a seat belt. permalink award report block reply\nIllah88zillah 5 points 7 hours ago What in the Facebook boomer is going on in here?!? Dont post this trash here permalink award report block reply NeverInterruptEnemy 2 points 4 hours ago Retard generator permalink parent award report block reply\nNeverInterruptEnemy 2 points 4 hours ago Retard generator permalink parent award report block reply\nBearing51 5 points 9 hours ago We also didn't have roads filled with streetshitters and dindus back then. permalink award report block reply\nAggrieved03 1 points 9 hours ago Then we became a nation of faggots! permalink award report block reply\n19American62Woman 1 points 9 hours ago I still do that! Some habits are hard to break! permalink award report block reply happyfave 2 points 8 hours ago You would let your kids drive in the front seat of a truck without seatbelts on ? permalink parent award report block reply 19American62Woman 1 points 7 hours ago We didn’t have seat belts back then. permalink parent award report block reply\nhappyfave 2 points 8 hours ago You would let your kids drive in the front seat of a truck without seatbelts on ? permalink parent award report block reply 19American62Woman 1 points 7 hours ago We didn’t have seat belts back then. permalink parent award report block reply\n19American62Woman 1 points 7 hours ago We didn’t have seat belts back then. permalink parent award report block reply\nHunter_loves_2_feet 1 points 6 hours ago My feeling is that if a seatbelt is too uncomfortable for a person to wear then Fuckit. They don’t value their lives. Let the pussy retard die in a car crash. But not buckling up your kids should land you in jail. permalink award report block reply"}