{"id": "1ARK9jzcoq", "contents": "752 Every Single One posted 1 day ago by Cole_Burns 14 comments award share download report block\n14 comments Sort by Top Top New Worst Old Save Around the Web Hair Will Grow Back! No Matter How Severe The Baldness HaloGrow Wexit-Delecto 11 points 1 day ago Another pulled punch. permalink award report block reply KekistaniMemeLord 10 points 1 day ago Illegals are phase one. We need to get ahead of the curve and start having conversations about denaturalization and removal for citizenship acquired during these fucked up times where we had zero standards. There are many more like Zohran and Ilhan Omar that must be removed. Also the entire VISA system needs to be nuked. permalink award report block reply bobbacringo 3 points 1 day ago I think this is the first time I've seen someone else mention this in the MAGA-sphere. There's too many \"one race the human race\" retards in MAGA still. Most of the black and brown people will need to be repatriated in the future if America is to survive. permalink parent award report block reply KekistaniMemeLord 2 points 1 day ago UK patriots are ahead of us in this regard. People who hate us and have absolutely no intention of conforming to traditional US culture and values should not allowed to be citizens or continue to hold citizenship if they have it. It should also be noted that these cultures and values exclusively stem from a White Christian population. Freedom of speech does not mean freedom to support ideas and cultures that would literally disintegrate and destroy the concept of freedom of speech and the founding values of the country in the first place. Only shitlibs will interpret this as meaning we hate certain groups or other such nonsense. permalink parent award report block reply rebuildingMyself 9 points 1 day ago No compromise on this one. No more subsidizing our own demographic replacement permalink award report block reply Slice 9 points 1 day ago Every last Juan permalink award report block reply patrioticwinning3 8 points 1 day ago EVERY.  SINGLE.  ONE! permalink award report block reply Bidensmellslikepiss 6 points 1 day ago Especially the somalians. permalink award report block reply DCYR66 2 points 1 day ago In simple but direct words!”Get The Fuck Outta Here!!!!” permalink award report block reply Ch3f4554551n 0 points 1 day ago Two more weeks, bro. C'mon. permalink award report block reply DeplorableDreg -4 points 1 day ago Fucking retard. Whoever posted this is a fucking retard. Trump stated hundreds of times on the campaign trail, and even after the election, there were going for the most dangerous first. Why do you think that is? Come on now.. use some fucking critical thinking skills.. why would they be going after the rapist and murderers before the crop pickers??  Fucking retarded moron. permalink award report block reply EmptyNoose 1 points 1 day ago Yeah ask Mollie Tibetts's family what happened when they didnt deport the crop pickers. So many thousands more that commit crimes regularly that we never hear about. How many crop pickers kill people in DUI accidents almost daily? Get them all out, simple as that. permalink parent award report block reply TrumpDupedMAGA 0 points 1 day ago Comment removed by community moderators. permalink award report block reply\nWexit-Delecto 11 points 1 day ago Another pulled punch. permalink award report block reply\nKekistaniMemeLord 10 points 1 day ago Illegals are phase one. We need to get ahead of the curve and start having conversations about denaturalization and removal for citizenship acquired during these fucked up times where we had zero standards. There are many more like Zohran and Ilhan Omar that must be removed. Also the entire VISA system needs to be nuked. permalink award report block reply bobbacringo 3 points 1 day ago I think this is the first time I've seen someone else mention this in the MAGA-sphere. There's too many \"one race the human race\" retards in MAGA still. Most of the black and brown people will need to be repatriated in the future if America is to survive. permalink parent award report block reply KekistaniMemeLord 2 points 1 day ago UK patriots are ahead of us in this regard. People who hate us and have absolutely no intention of conforming to traditional US culture and values should not allowed to be citizens or continue to hold citizenship if they have it. It should also be noted that these cultures and values exclusively stem from a White Christian population. Freedom of speech does not mean freedom to support ideas and cultures that would literally disintegrate and destroy the concept of freedom of speech and the founding values of the country in the first place. Only shitlibs will interpret this as meaning we hate certain groups or other such nonsense. permalink parent award report block reply\nbobbacringo 3 points 1 day ago I think this is the first time I've seen someone else mention this in the MAGA-sphere. There's too many \"one race the human race\" retards in MAGA still. Most of the black and brown people will need to be repatriated in the future if America is to survive. permalink parent award report block reply KekistaniMemeLord 2 points 1 day ago UK patriots are ahead of us in this regard. People who hate us and have absolutely no intention of conforming to traditional US culture and values should not allowed to be citizens or continue to hold citizenship if they have it. It should also be noted that these cultures and values exclusively stem from a White Christian population. Freedom of speech does not mean freedom to support ideas and cultures that would literally disintegrate and destroy the concept of freedom of speech and the founding values of the country in the first place. Only shitlibs will interpret this as meaning we hate certain groups or other such nonsense. permalink parent award report block reply\nKekistaniMemeLord 2 points 1 day ago UK patriots are ahead of us in this regard. People who hate us and have absolutely no intention of conforming to traditional US culture and values should not allowed to be citizens or continue to hold citizenship if they have it. It should also be noted that these cultures and values exclusively stem from a White Christian population. Freedom of speech does not mean freedom to support ideas and cultures that would literally disintegrate and destroy the concept of freedom of speech and the founding values of the country in the first place. Only shitlibs will interpret this as meaning we hate certain groups or other such nonsense. permalink parent award report block reply\nrebuildingMyself 9 points 1 day ago No compromise on this one. No more subsidizing our own demographic replacement permalink award report block reply\nSlice 9 points 1 day ago Every last Juan permalink award report block reply\npatrioticwinning3 8 points 1 day ago EVERY.  SINGLE.  ONE! permalink award report block reply\nBidensmellslikepiss 6 points 1 day ago Especially the somalians. permalink award report block reply\nDCYR66 2 points 1 day ago In simple but direct words!”Get The Fuck Outta Here!!!!” permalink award report block reply\nCh3f4554551n 0 points 1 day ago Two more weeks, bro. C'mon. permalink award report block reply\nDeplorableDreg -4 points 1 day ago Fucking retard. Whoever posted this is a fucking retard. Trump stated hundreds of times on the campaign trail, and even after the election, there were going for the most dangerous first. Why do you think that is? Come on now.. use some fucking critical thinking skills.. why would they be going after the rapist and murderers before the crop pickers??  Fucking retarded moron. permalink award report block reply EmptyNoose 1 points 1 day ago Yeah ask Mollie Tibetts's family what happened when they didnt deport the crop pickers. So many thousands more that commit crimes regularly that we never hear about. How many crop pickers kill people in DUI accidents almost daily? Get them all out, simple as that. permalink parent award report block reply\nEmptyNoose 1 points 1 day ago Yeah ask Mollie Tibetts's family what happened when they didnt deport the crop pickers. So many thousands more that commit crimes regularly that we never hear about. How many crop pickers kill people in DUI accidents almost daily? Get them all out, simple as that. permalink parent award report block reply\nTrumpDupedMAGA 0 points 1 day ago Comment removed by community moderators. permalink award report block reply"}