{"id": "1ARK5BGJmy", "contents": "1531 🚨 HOLY CRAP! ICE is now conducting raids on the Hawaiian island of Kauai 🚨  LOCK THEM UP  🚨 posted 3 days ago by IronWolve 139 comments award share report block Nick Sortor @nicksortor • 3d 🚨 HOLY CRAP! ICE is now conducting raids on the Hawaiian island of Kauai DOZENS of Tren de Aragua gang members were just apprehended, and more raids are expected You CANNOT hide from ICE. Even on an island thousands of miles from the US mainland. They’re ALL going back! 🔥\n139 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Sp3nce321 84 points 3 days ago This will be a nice test, if there is any democratic state that locals hate outsiders, it is Hawaii permalink award report block reply DT170x 30 points 3 days ago Apparently they like the cheap labor that they will look the other way. permalink parent award report block reply entwickelnden 14 points 3 days ago Money, they like the money, and the union jobs. permalink parent award report block reply NewGoldenAge 6 points 3 days ago They also worship SPAM. Fucking weirdos. Give them to Japan and see how they like it, permalink parent award report block reply mty_green_go 7 points 3 days ago The number one product of waste on Christmas Island (Kiribati) is spam cans permalink parent award report block reply boomerbutnotOKBoomer 4 points 3 days ago One guy in Hawaii built a whole shed out of the cans... kek permalink parent award report block reply boomerbutnotOKBoomer 7 points 3 days ago Some of us have loved ones there. No one worships spam. It just was a cheap meat substitute for so long that it became part of the culture. permalink parent award report block reply popcycle 7 points 3 days ago hey, I like spam.  of course I also like s.o.s. and pretty much everything else that people can't stand.  when you grow up in a big family you eat 1st and ask questions later, it doesn't make you very selective about food.  no small part of my problem now..... permalink parent award report block reply BruddahIz 2 points 3 days ago I ate out of a lot of cans in Hawaii, it was not until the mid 70's that I started to see fresh produce and fresh meats as normal. permalink parent award report block reply NewGoldenAge 1 points 2 days ago You have a massive stockpile in case of shipping disruptions of the stuff tho. permalink parent award report block reply wilburh09 3 points 3 days ago I liked the McDonald’s egg, spam, sausage , hash brown  breakfast in Hawaii. permalink parent award report block reply NewGoldenAge 1 points 2 days ago That does sound tasty actually. permalink parent award report block reply DoesItWorkAlready 3 points 3 days ago I met a native american woman on the plane who worked with troubled youth in Hawaii for a year. I told her I'd seen a lot of construction crews that were Hispanic, and asked her if they had any construction training programs in Hawaii. The answer was \"no\".   I was sad.  She was perplexed. permalink parent award report block reply Nick-Kerr 1 points 3 days ago native american woman Doesn't exist. Not one person ever evolved in the \"Americas\". Period. They're all colonizers from the east. permalink parent award report block reply yukondave 2 points 3 days ago How on earth did they arrive without proper ID?  How did they get on an airplane?  Did they arrive by boat? permalink parent award report block reply Hanging_Chad 6 points 3 days ago does the UK flag that’s on their state flag indicate that it’s a Democrat state? permalink parent award report block reply possibletower 2 points 3 days ago So fucking cucked for Hawaii to have the Union Jack on their state flag. Not even an old Kingdom of Hawaii flag or symbol but the fucking UK flag. permalink parent award report block reply boomerbutnotOKBoomer 8 points 3 days ago The flag was officially commissioned in 1816 at the request of King Kamehameha I, incorporating the Union Jack to honor this alliance and reflect the influence of British advisors.\nThe eight alternating white, red, and blue stripes represent the eight major Hawaiian Islands. Despite Hawaii's eventual annexation by the United States in 1898 and its admission as a state in 1959, the flag's design, including the Union Jack, was retained as a symbol of the islands' unique history and diplomatic strategy. permalink parent award report block reply possibletower 1 points 2 days ago Yeah. I know. It's a cuck flag. There were flags prior to that one that could have been used. permalink parent award report block reply deleted 3 points 3 days ago yukondave 1 points 3 days ago Racist, Stone age tribal people all think the same way permalink parent award report block reply wilburh09 2 points 3 days ago I’ve hung out with cool Hawaiians in maui.  But I’d guess many Hawaiian natives would choose tren de aragua over Haole. It’s basically a very beautiful 3rd world country. permalink parent award report block reply m0ntsta 2 points 3 days ago My wife is Hawaiian. Her grandfather was born on Ni’ihau. The only thing Hawaiians might hate more than white people is 3rd world setbacks that take the retard jobs on the island. Because native Hawaiians want to do the dumb labor jobs so they can go surfing at noon. They may be hardcore democrats in Hawaii, but they don’t like illegals. permalink parent award report block reply Nick-Kerr 1 points 3 days ago There are zero \"native\" hawaiians. They all come from other lands, not too long ago. permalink parent award report block reply load 1 more comments... MagaJay02 52 points 3 days ago HOLY CRAP! I didn't know the US Government had the ability to travel to each state to enforce the law! permalink award report block reply Hanging_Chad 17 points 3 days ago is Alaska next? permalink parent award report block reply Here_we_go 14 points 3 days ago Hope so. Nobody is above the law. Looking at you eskimos. permalink parent award report block reply Hanging_Chad 6 points 3 days ago are indian reservations sanctuary nations? permalink parent award report block reply Here_we_go 9 points 3 days ago Immigration is a federal matter, and federal immigration law and enforcement agencies (such as ICE) have jurisdiction on tribal lands. permalink parent award report block reply view 2 more comments... Hawksendoom 2 points 3 days ago the more i see your posts the more i like you permalink parent award report block reply learntocode 1 points 3 days ago They are sanctuaries from U.S. law enforcement and thus harbor all manner of criminal enterprises now. permalink parent award report block reply Capoditutticapi1 5 points 3 days ago Eskimos are Natives and Alaskan, NOT illegal's FFS! permalink parent award report block reply Nick-Kerr 1 points 3 days ago Nope. no humans ever evolved in Alaska. They're all nomadic colonizers from the east. permalink parent award report block reply view 1 more comments... Here_we_go 0 points 3 days ago That.was a sarcastic joke ffs. 🙄 permalink parent award report block reply view 2 more comments... Hawksendoom 4 points 3 days ago i came for this comment :D permalink parent award report block reply Capoditutticapi1 2 points 3 days ago Arrests have surged dramatically in Alaska! Only 13 in all of 2024 and 20 in 2023, per Alaska Department of Corrections data, but 2025 has seen at least 33 by mid-year alone, with ongoing activity into fall. Been scooping em up at food service, fisheries, shipyards, and the usual migrant \"sanctuary\" communities... permalink parent award report block reply Capoditutticapi1 1 points 2 days ago It ain't much relative to other states..., but hey, we don't count the one's that the bears, wolves, bigfoots/yetis and general wilderness goblins gobble up... permalink parent award report block reply AVeryNakedMan 15 points 3 days ago BREAKING: ICE CONFIRMS HAWAII IS PART OF AMERICA. TONIGHT AT 6PM: IS WATER STILL WET? permalink parent award report block reply ciaramella_is_gay 4 points 3 days ago My god I wonder if their flight was non-stop or dare I say, these agents were already based there? permalink parent award report block reply boomerbutnotOKBoomer 1 points 3 days ago ICE has agents in every state. It's only a 5+ hour flight from SFO permalink parent award report block reply 3-10 1 points 3 days ago I don’t get why they aren’t arresting any illegal. We can use the kids in schools and ERs to grab them. I want any non-citizen sent home, criminal or not. permalink parent award report block reply GorillaTactics 1 points 3 days ago What I really want to know is, how did all these illegals get there? They HAD to travel by airline, and until the autopen took office, airlines were supposed to have strict ID requirements permalink parent award report block reply load 5 more comments... victory2024 37 points 3 days ago Jesus, even Kauai is infested with these vermin? permalink award report block reply PROCIsAsshoe 16 points 3 days ago right? did they go there to try and hide out? If you're a South American drug cartel, you don't need a large presence in Kauai of all places. permalink parent award report block reply boomerbutnotOKBoomer 13 points 3 days ago And you'd be pretty easy to spot. Plus, pretty much everyone is related. I'm related to 1/3 of Kauai and 1/2 of Maui. Not something you'd readily realize if you are going there to hide out. Of interest, about 30 years ago there was a WTO or similar conference in Honolulu. Some troublemakers from Quebec flew in to protest. They thought everyone hated the police because they did. But at that time, a huge percentage of families had at least one law enforcement type in their family. So the dumbasses cooked up this idea they would fill all the fire extinguishers in the convention center with gasoline, and then set small fires all through the center. They backed up their van in the docking area of the Convention center and stole dozens of fire extinguishers. They emptied them and then took them to a nearby gas station. The kids working there were ALL relatives of cops. So they called it in and the jackasses were arrested. permalink parent award report block reply boomerbutnotOKBoomer 6 points 3 days ago OH - one more. Another couple of asswipes from this stellar group decided to go out to the country and buy some pig shit. Their plan was to set it on fire and throw it on the cops and security details of the visiting dignitaries. Only problem is they were chatty cathies. The asswipes, again, believed everyone hates cops like they do. So they go out to the pig farms and try to buy pig shit. Got the shit beat out of them instead. Cops get called and the pig farmers tell them, \"We dunno. Dese bruddas wen come out heah and start fightin' wid each uddah. We stayed out of it. No care if dey kill each uddah.\" It was the stuff of legends for years to come. Good times. kek permalink parent award report block reply GainesvilleFlorida 1 points 2 days ago This was an nice read on my Monday morning coffee permalink parent award report block reply Justlooking250 1 points 3 days ago LMAO, retard MORONS 🤤, FAFO permalink parent award report block reply Brock_Shithouse 3 points 3 days ago It's a big vacation destination and people typically have to fly there, it makes sense there is a drug gang presence. permalink parent award report block reply wilburh09 2 points 3 days ago The locals are the druggies in Hawaii. Lots of poor locals on meth or whatever other drug. permalink parent award report block reply SeeFreeDJ 3 points 3 days ago Drug dealers make great money in Hawaii. Lots of tourists willing to pay a premium for some \"Maui Wowie\". Add in local surfer culture, and it's shooting fish in a barrel. permalink parent award report block reply m0ntsta 2 points 3 days ago Not really since they legalized medicinal weed. Now it’s a government racket like every other state with medical weed. permalink parent award report block reply SeeFreeDJ 1 points 3 days ago How easy is it for a tourist to get from a dispensary, though? I haven't been to Hawaii in decades so I can only speculate, but I imagine there would still be a thriving black market for the tourists without medicinal cards. I also would think there is still a lot of demand for other illegal drugs. permalink parent award report block reply wilburh09 1 points 3 days ago It’s not Vegas.   The locals are the meth head not the tourists. permalink parent award report block reply DemPanicAtTheDisco 1 points 3 days ago Huge meth problem on the islands mun by Mexican cartels. permalink parent award report block reply Run_over_Antifa 23 points 3 days ago Dear ICE please raid bfe Georgia, they are still everywhere. permalink award report block reply Pied-Trumper 11 points 3 days ago That’s because we’re nowhere near 1 million deportations, we only have 3 years left before your neck breaks from whiplash, and over 10 million came in over the last 4 years. permalink parent award report block reply peterthegreen 8 points 3 days ago MTG dangling the carrot of illegal alien amnesty doesn't help either. permalink parent award report block reply ICONSIDEREDTHISFIRST 6 points 3 days ago That or the amount of illegals here is significantly higher than anyone thinks. permalink parent award report block reply m0ntsta 3 points 3 days ago We are over 50,000,000+. That is my ULTRA conservative estimate based on common sense, using my eyes, and using my ears listening to the media tell us we have 12,000,000 illegals since Jimmy Carter was slingin’ peanuts. If there were 12,000,000 illegals in America in 1980, and they are coming in and growing at the same percentage rate as inflation, how many are in America today? Let’s calculate carefully step-by-step. ⸻ Establish assumptions\n•\tStarting number (1980): 12,000,000\n•\tGrowth rate: same as inflation\n•\tTime span: 1980 → 2025 = 45 years We need an average annual inflation rate over that period. The U.S. inflation rate has varied, but the average CPI inflation from 1980–2025 is about 3.2% per year (based on long-term Bureau of Labor Statistics data). ⸻ Use the compound growth formula N = N_0 \\times (1 + r)^t\nWhere:\n•\tN_0 = 12,000,000\n•\tr = 0.032 (3.2%)\n•\tt = 45 ⸻ Compute precisely\n(1.032)^{45} = e^{45 \\times \\ln(1.032)} \\approx e^{45 \\times 0.0315} \\approx e^{1.4175} \\approx 4.13\nThen:\n12,000,000 \\times 4.13 = 49,560,000 ⸻ ✅ Final Answer:\nIf the number of illegal immigrants grew at the same rate as inflation (≈3.2% annually),\nthere would be about 50 million in America today (in 2025). The more you know… permalink parent award report block reply Brock_Shithouse 1 points 3 days ago Or both permalink parent award report block reply MajJamesMcFarlane 4 points 3 days ago I think I've heard we need to expell something like 10k to 20k a day if we're going to get them all out by the end of Trump's term. Every report of 10s of arrests is literally a nothing burger. Expect to be massively disappointed permalink parent award report block reply Brock_Shithouse 3 points 3 days ago Expect to be massively disappointed Good advice whenever looking for help from politicians. permalink parent award report block reply PROCIsAsshoe 1 points 3 days ago yes we are well beyond 1mm deportations. there are various data sources corroborating the departure of ~2 million already and even hostile outlets like WSJ have stated as much. permalink parent award report block reply POTUS_DonnieJ 2 points 3 days ago If we're putting in requests, I want to see Dearborn swarming with ICE agents. permalink parent award report block reply KekistanPM 16 points 3 days ago Throw the illegals into a volcano. Then we'll be rid of them and the gods will be appeased! permalink award report block reply TDAF 9 points 3 days ago Jose Versus the Volcano permalink parent award report block reply Hawksendoom 4 points 3 days ago i mean it's what they did right? permalink parent award report block reply Aquamine-Amarine 2 points 3 days ago That's bad for the environment. Toss them into the sun. permalink parent award report block reply Justlooking250 2 points 3 days ago 'Of course we can land on the sun, we just have to go at night' 🤣 permalink parent award report block reply FreeCommieUFORides 14 points 3 days ago These fucking news stations. Did you hear that bullshit honorific accenting when they said “Tren De Aragua”? permalink award report block reply RememberCharlieKirk 8 points 3 days ago Like NPR hosts with how they pronounce Mexico permalink parent award report block reply KernalMustard 5 points 3 days ago Meh'he'co permalink parent award report block reply NoMaskNoMaster 1 points 2 days ago Bro, thank you. Good to know I'm not the only one deeply offended and disgusted by the pandering. permalink parent award report block reply Hanging_Chad 7 points 3 days ago how many CCP spies are in Hawaii? permalink award report block reply HeavyMetalPatriot 7 points 3 days ago Yes. permalink parent award report block reply one_cool 5 points 3 days ago went to honolulu. there are more chinese and russian there than American. permalink parent award report block reply KungPaoMcChicken 6 points 3 days ago I love how people were using the taking of the US from the natives as the perfect analogy for why ICE is needed. Gee you think the natives needed their own ICE back in the day? Perfect analogy. permalink award report block reply Carterslvrpilz 6 points 3 days ago More ICE in paradise!!!! permalink award report block reply Fren20 5 points 3 days ago Please ice go to San Bernardino California,full of illegals 💯💯💯💯💯 permalink award report block reply Hawksendoom 5 points 3 days ago Kauai' is a shit hole and always will be! they closed every fucking bar, restaurant and nightclub for the tourists and they fucking look at you like you are satan incarnate. Cut them all off like them puerto rico pieces of shit permalink award report block reply wilburh09 1 points 3 days ago Yea I hung out with some cool Hawaiians in Maui.  But drugs in  Hawaii are not tourist driven.  Many of the  locals there hate Haolies and are degenerate druggies. permalink parent award report block reply Hawksendoom 1 points 3 days ago i mean that's how i got treated so just sayin' permalink parent award report block reply Justlooking250 0 points 3 days ago MuH ✌️cOvId✌️ ShUtDoWnSz 🤤🤤🤤🤤🤤 WhY iSz InFlATiOn So bAD ??? 🤤🤤🤤 permalink parent award report block reply Hawksendoom 2 points 3 days ago i am curious - what did anything i just said have to do with the covid shutdown and inflation? oh you mean the bars closings? oh they fucking hate us howlies so that is why. Happened before covid in the 90's. permalink parent award report block reply Justlooking250 1 points 3 days ago I mean everything closing and the crippling inflation that resulted from that SCAM especially in blue areas permalink parent award report block reply Hawksendoom 2 points 3 days ago fair enough groovy cat. permalink parent award report block reply ythehorses 4 points 3 days ago That island has been rotten for a long time - probably because of these freakers. permalink award report block reply 559throw 4 points 3 days ago Dozens? Doesn't the video say two? permalink award report block reply freebirdie 3 points 3 days ago Meanwhile in San Jose, I saw a party at a county park that had at least 50 illegals under one awning. Never a sign of ICE anywhere, and the wetbacks I reported in January are still there. permalink award report block reply thisisatestof2 3 points 3 days ago I found it kind of interesting how the report are covered the response from the local officials who seems more than happy to acknowledge they arrested some of the terrorist gang members. permalink award report block reply SaltyTitties4 3 points 3 days ago What the HELL is that chic doing?!  She looks terrified and she looks like she’s never held a gun before. Holy shit. permalink award report block reply throwaway29834751 3 points 3 days ago Good.  Keep going.  Denaturalize mamdani too.  He lied about being a communist.  Ice raids in NYC everyday please.  Denaturalize and deport 3000 per day please. permalink award report block reply Archmagnus 3 points 3 days ago Tren de Aragua gang members They’re ALL going back! No no, let them stay, I have some prime real estate around 6 feet under in need of tenants. permalink award report block reply MrHarryReems 3 points 3 days ago Not surprising that Tren de Aragua would have a presence out here considering that Hawaii is a cesspool of human trafficking. permalink award report block reply NoMaskNoMaster 1 points 2 days ago Obamas favorite hotdog stands permalink parent award report block reply Roguepepe 2 points 3 days ago Vacation is OVER boys! permalink award report block reply boomerbutnotOKBoomer 2 points 3 days ago Thank God. Hawaii people don't deserve these gang members. They have enough trouble with their home-grown Syndicate guys. permalink award report block reply IntergalacticWalrus 2 points 3 days ago Why do we have to break into an accent when there's a Spanish word or phrase? permalink award report block reply Psalm-118_24 1 points 2 days ago ICE please come to Dearbornistan, and Hamtrack, MI, Minneapolis, MN, Patterson NJ, Chicago and Bridgeview IL, and Houston, TX. permalink award report block reply PatriotDescendant 1 points 2 days ago I hope the agents got a night or two off. Kauai is one of my happy places! permalink award report block reply hey_spike 1 points 3 days ago Surely there is  a Hawaiian judge ready to issue an injuction. permalink award report block reply RogueLeaderX 1 points 3 days ago Make Polynesia Great Again! permalink award report block reply Induceddrag 1 points 3 days ago Considering how Hawaiians hate non-natives, I can’t believe TdA would get a warm welcome there. permalink award report block reply NoMaskNoMaster 1 points 2 days ago All the old school local gangsters are dead or retired. Islands have been taken over by Samoan micronesian and cartel gangs permalink parent award report block reply Female 1 points 3 days ago curious why x people insist on saying, 'holy crap'. I don't think that they understand what the word holy means. permalink award report block reply doodaddy 1 points 3 days ago So, cartels are on the islands?  Let's talk about that Big Island fire again that devastated the town. permalink award report block reply NoMaskNoMaster 1 points 2 days ago It was Maui but yes permalink parent award report block reply doodaddy 1 points 2 days ago 🤙  that's right. permalink parent award report block reply ACActual 1 points 3 days ago I wish they'd come to Pennsylvania.  Overridden permalink award report block reply NoticesBugleOWO 1 points 3 days ago Good! I hope the hit Honolulu next. So many illegals living as homeless or working in Chinatown. permalink award report block reply darkmodeforgotpass 1 points 3 days ago Pop the boats and there will be an end to the horror. permalink award report block reply bananafone 1 points 3 days ago Ice is looking for a few good men permalink award report block reply FBIsurveillance 1 points 3 days ago I didnt even know illegal could get to hawaii permalink award report block reply ChickenStrips 1 points 3 days ago How did these TdA retards get to HI? permalink award report block reply spezisacuckold 1 points 3 days ago Why wouldn't they? permalink award report block reply KennyKetchem 1 points 3 days ago I believe they also do this in US Territories such as P.R. and Gaum. permalink award report block reply BoricuaPede 1 points 3 days ago Where's \"Gaum?\" permalink parent award report block reply JoeMcCarthyWasRight 1 points 3 days ago Everywhere but Northern California. permalink award report block reply DeplorableNeandertal 1 points 3 days ago Id settle for clearing out Minnesota and Michigan honestly permalink award report block reply mykillk 1 points 3 days ago How can these poor Venezuelan fuckers afford to live in Hawaii? permalink award report block reply TheLivingExample 1 points 3 days ago They're guaranteed to melt there, for sure! permalink award report block reply Obambi 1 points 3 days ago Lots of homeless in Hawaii and tons of drugs. Send in the dawg. permalink award report block reply Dem_slayer 1 points 3 days ago They should be executed not just deported... permalink award report block reply NoMaskNoMaster 1 points 2 days ago Remove the Micronesians and Samoans next permalink award report block reply Obambi 0 points 3 days ago Do Puerto Rico next. Bunch there overlooking the passages. permalink award report block reply\nSp3nce321 84 points 3 days ago This will be a nice test, if there is any democratic state that locals hate outsiders, it is Hawaii permalink award report block reply DT170x 30 points 3 days ago Apparently they like the cheap labor that they will look the other way. permalink parent award report block reply entwickelnden 14 points 3 days ago Money, they like the money, and the union jobs. permalink parent award report block reply NewGoldenAge 6 points 3 days ago They also worship SPAM. Fucking weirdos. Give them to Japan and see how they like it, permalink parent award report block reply mty_green_go 7 points 3 days ago The number one product of waste on Christmas Island (Kiribati) is spam cans permalink parent award report block reply boomerbutnotOKBoomer 4 points 3 days ago One guy in Hawaii built a whole shed out of the cans... kek permalink parent award report block reply boomerbutnotOKBoomer 7 points 3 days ago Some of us have loved ones there. No one worships spam. It just was a cheap meat substitute for so long that it became part of the culture. permalink parent award report block reply popcycle 7 points 3 days ago hey, I like spam.  of course I also like s.o.s. and pretty much everything else that people can't stand.  when you grow up in a big family you eat 1st and ask questions later, it doesn't make you very selective about food.  no small part of my problem now..... permalink parent award report block reply BruddahIz 2 points 3 days ago I ate out of a lot of cans in Hawaii, it was not until the mid 70's that I started to see fresh produce and fresh meats as normal. permalink parent award report block reply NewGoldenAge 1 points 2 days ago You have a massive stockpile in case of shipping disruptions of the stuff tho. permalink parent award report block reply wilburh09 3 points 3 days ago I liked the McDonald’s egg, spam, sausage , hash brown  breakfast in Hawaii. permalink parent award report block reply NewGoldenAge 1 points 2 days ago That does sound tasty actually. permalink parent award report block reply DoesItWorkAlready 3 points 3 days ago I met a native american woman on the plane who worked with troubled youth in Hawaii for a year. I told her I'd seen a lot of construction crews that were Hispanic, and asked her if they had any construction training programs in Hawaii. The answer was \"no\".   I was sad.  She was perplexed. permalink parent award report block reply Nick-Kerr 1 points 3 days ago native american woman Doesn't exist. Not one person ever evolved in the \"Americas\". Period. They're all colonizers from the east. permalink parent award report block reply yukondave 2 points 3 days ago How on earth did they arrive without proper ID?  How did they get on an airplane?  Did they arrive by boat? permalink parent award report block reply Hanging_Chad 6 points 3 days ago does the UK flag that’s on their state flag indicate that it’s a Democrat state? permalink parent award report block reply possibletower 2 points 3 days ago So fucking cucked for Hawaii to have the Union Jack on their state flag. Not even an old Kingdom of Hawaii flag or symbol but the fucking UK flag. permalink parent award report block reply boomerbutnotOKBoomer 8 points 3 days ago The flag was officially commissioned in 1816 at the request of King Kamehameha I, incorporating the Union Jack to honor this alliance and reflect the influence of British advisors.\nThe eight alternating white, red, and blue stripes represent the eight major Hawaiian Islands. Despite Hawaii's eventual annexation by the United States in 1898 and its admission as a state in 1959, the flag's design, including the Union Jack, was retained as a symbol of the islands' unique history and diplomatic strategy. permalink parent award report block reply possibletower 1 points 2 days ago Yeah. I know. It's a cuck flag. There were flags prior to that one that could have been used. permalink parent award report block reply deleted 3 points 3 days ago yukondave 1 points 3 days ago Racist, Stone age tribal people all think the same way permalink parent award report block reply wilburh09 2 points 3 days ago I’ve hung out with cool Hawaiians in maui.  But I’d guess many Hawaiian natives would choose tren de aragua over Haole. It’s basically a very beautiful 3rd world country. permalink parent award report block reply m0ntsta 2 points 3 days ago My wife is Hawaiian. Her grandfather was born on Ni’ihau. The only thing Hawaiians might hate more than white people is 3rd world setbacks that take the retard jobs on the island. Because native Hawaiians want to do the dumb labor jobs so they can go surfing at noon. They may be hardcore democrats in Hawaii, but they don’t like illegals. permalink parent award report block reply Nick-Kerr 1 points 3 days ago There are zero \"native\" hawaiians. They all come from other lands, not too long ago. permalink parent award report block reply load 1 more comments...\nDT170x 30 points 3 days ago Apparently they like the cheap labor that they will look the other way. permalink parent award report block reply entwickelnden 14 points 3 days ago Money, they like the money, and the union jobs. permalink parent award report block reply NewGoldenAge 6 points 3 days ago They also worship SPAM. Fucking weirdos. Give them to Japan and see how they like it, permalink parent award report block reply mty_green_go 7 points 3 days ago The number one product of waste on Christmas Island (Kiribati) is spam cans permalink parent award report block reply boomerbutnotOKBoomer 4 points 3 days ago One guy in Hawaii built a whole shed out of the cans... kek permalink parent award report block reply boomerbutnotOKBoomer 7 points 3 days ago Some of us have loved ones there. No one worships spam. It just was a cheap meat substitute for so long that it became part of the culture. permalink parent award report block reply popcycle 7 points 3 days ago hey, I like spam.  of course I also like s.o.s. and pretty much everything else that people can't stand.  when you grow up in a big family you eat 1st and ask questions later, it doesn't make you very selective about food.  no small part of my problem now..... permalink parent award report block reply BruddahIz 2 points 3 days ago I ate out of a lot of cans in Hawaii, it was not until the mid 70's that I started to see fresh produce and fresh meats as normal. permalink parent award report block reply NewGoldenAge 1 points 2 days ago You have a massive stockpile in case of shipping disruptions of the stuff tho. permalink parent award report block reply wilburh09 3 points 3 days ago I liked the McDonald’s egg, spam, sausage , hash brown  breakfast in Hawaii. permalink parent award report block reply NewGoldenAge 1 points 2 days ago That does sound tasty actually. permalink parent award report block reply DoesItWorkAlready 3 points 3 days ago I met a native american woman on the plane who worked with troubled youth in Hawaii for a year. I told her I'd seen a lot of construction crews that were Hispanic, and asked her if they had any construction training programs in Hawaii. The answer was \"no\".   I was sad.  She was perplexed. permalink parent award report block reply Nick-Kerr 1 points 3 days ago native american woman Doesn't exist. Not one person ever evolved in the \"Americas\". Period. They're all colonizers from the east. permalink parent award report block reply yukondave 2 points 3 days ago How on earth did they arrive without proper ID?  How did they get on an airplane?  Did they arrive by boat? permalink parent award report block reply\nentwickelnden 14 points 3 days ago Money, they like the money, and the union jobs. permalink parent award report block reply\nNewGoldenAge 6 points 3 days ago They also worship SPAM. Fucking weirdos. Give them to Japan and see how they like it, permalink parent award report block reply mty_green_go 7 points 3 days ago The number one product of waste on Christmas Island (Kiribati) is spam cans permalink parent award report block reply boomerbutnotOKBoomer 4 points 3 days ago One guy in Hawaii built a whole shed out of the cans... kek permalink parent award report block reply boomerbutnotOKBoomer 7 points 3 days ago Some of us have loved ones there. No one worships spam. It just was a cheap meat substitute for so long that it became part of the culture. permalink parent award report block reply popcycle 7 points 3 days ago hey, I like spam.  of course I also like s.o.s. and pretty much everything else that people can't stand.  when you grow up in a big family you eat 1st and ask questions later, it doesn't make you very selective about food.  no small part of my problem now..... permalink parent award report block reply BruddahIz 2 points 3 days ago I ate out of a lot of cans in Hawaii, it was not until the mid 70's that I started to see fresh produce and fresh meats as normal. permalink parent award report block reply NewGoldenAge 1 points 2 days ago You have a massive stockpile in case of shipping disruptions of the stuff tho. permalink parent award report block reply wilburh09 3 points 3 days ago I liked the McDonald’s egg, spam, sausage , hash brown  breakfast in Hawaii. permalink parent award report block reply NewGoldenAge 1 points 2 days ago That does sound tasty actually. permalink parent award report block reply\nmty_green_go 7 points 3 days ago The number one product of waste on Christmas Island (Kiribati) is spam cans permalink parent award report block reply boomerbutnotOKBoomer 4 points 3 days ago One guy in Hawaii built a whole shed out of the cans... kek permalink parent award report block reply\nboomerbutnotOKBoomer 4 points 3 days ago One guy in Hawaii built a whole shed out of the cans... kek permalink parent award report block reply\nboomerbutnotOKBoomer 7 points 3 days ago Some of us have loved ones there. No one worships spam. It just was a cheap meat substitute for so long that it became part of the culture. permalink parent award report block reply popcycle 7 points 3 days ago hey, I like spam.  of course I also like s.o.s. and pretty much everything else that people can't stand.  when you grow up in a big family you eat 1st and ask questions later, it doesn't make you very selective about food.  no small part of my problem now..... permalink parent award report block reply BruddahIz 2 points 3 days ago I ate out of a lot of cans in Hawaii, it was not until the mid 70's that I started to see fresh produce and fresh meats as normal. permalink parent award report block reply NewGoldenAge 1 points 2 days ago You have a massive stockpile in case of shipping disruptions of the stuff tho. permalink parent award report block reply\npopcycle 7 points 3 days ago hey, I like spam.  of course I also like s.o.s. and pretty much everything else that people can't stand.  when you grow up in a big family you eat 1st and ask questions later, it doesn't make you very selective about food.  no small part of my problem now..... permalink parent award report block reply\nBruddahIz 2 points 3 days ago I ate out of a lot of cans in Hawaii, it was not until the mid 70's that I started to see fresh produce and fresh meats as normal. permalink parent award report block reply\nNewGoldenAge 1 points 2 days ago You have a massive stockpile in case of shipping disruptions of the stuff tho. permalink parent award report block reply\nwilburh09 3 points 3 days ago I liked the McDonald’s egg, spam, sausage , hash brown  breakfast in Hawaii. permalink parent award report block reply NewGoldenAge 1 points 2 days ago That does sound tasty actually. permalink parent award report block reply\nNewGoldenAge 1 points 2 days ago That does sound tasty actually. permalink parent award report block reply\nDoesItWorkAlready 3 points 3 days ago I met a native american woman on the plane who worked with troubled youth in Hawaii for a year. I told her I'd seen a lot of construction crews that were Hispanic, and asked her if they had any construction training programs in Hawaii. The answer was \"no\".   I was sad.  She was perplexed. permalink parent award report block reply Nick-Kerr 1 points 3 days ago native american woman Doesn't exist. Not one person ever evolved in the \"Americas\". Period. They're all colonizers from the east. permalink parent award report block reply\nNick-Kerr 1 points 3 days ago native american woman Doesn't exist. Not one person ever evolved in the \"Americas\". Period. They're all colonizers from the east. permalink parent award report block reply\nyukondave 2 points 3 days ago How on earth did they arrive without proper ID?  How did they get on an airplane?  Did they arrive by boat? permalink parent award report block reply\nHanging_Chad 6 points 3 days ago does the UK flag that’s on their state flag indicate that it’s a Democrat state? permalink parent award report block reply possibletower 2 points 3 days ago So fucking cucked for Hawaii to have the Union Jack on their state flag. Not even an old Kingdom of Hawaii flag or symbol but the fucking UK flag. permalink parent award report block reply boomerbutnotOKBoomer 8 points 3 days ago The flag was officially commissioned in 1816 at the request of King Kamehameha I, incorporating the Union Jack to honor this alliance and reflect the influence of British advisors.\nThe eight alternating white, red, and blue stripes represent the eight major Hawaiian Islands. Despite Hawaii's eventual annexation by the United States in 1898 and its admission as a state in 1959, the flag's design, including the Union Jack, was retained as a symbol of the islands' unique history and diplomatic strategy. permalink parent award report block reply possibletower 1 points 2 days ago Yeah. I know. It's a cuck flag. There were flags prior to that one that could have been used. permalink parent award report block reply\npossibletower 2 points 3 days ago So fucking cucked for Hawaii to have the Union Jack on their state flag. Not even an old Kingdom of Hawaii flag or symbol but the fucking UK flag. permalink parent award report block reply boomerbutnotOKBoomer 8 points 3 days ago The flag was officially commissioned in 1816 at the request of King Kamehameha I, incorporating the Union Jack to honor this alliance and reflect the influence of British advisors.\nThe eight alternating white, red, and blue stripes represent the eight major Hawaiian Islands. Despite Hawaii's eventual annexation by the United States in 1898 and its admission as a state in 1959, the flag's design, including the Union Jack, was retained as a symbol of the islands' unique history and diplomatic strategy. permalink parent award report block reply possibletower 1 points 2 days ago Yeah. I know. It's a cuck flag. There were flags prior to that one that could have been used. permalink parent award report block reply\nboomerbutnotOKBoomer 8 points 3 days ago The flag was officially commissioned in 1816 at the request of King Kamehameha I, incorporating the Union Jack to honor this alliance and reflect the influence of British advisors.\nThe eight alternating white, red, and blue stripes represent the eight major Hawaiian Islands. Despite Hawaii's eventual annexation by the United States in 1898 and its admission as a state in 1959, the flag's design, including the Union Jack, was retained as a symbol of the islands' unique history and diplomatic strategy. permalink parent award report block reply possibletower 1 points 2 days ago Yeah. I know. It's a cuck flag. There were flags prior to that one that could have been used. permalink parent award report block reply\npossibletower 1 points 2 days ago Yeah. I know. It's a cuck flag. There were flags prior to that one that could have been used. permalink parent award report block reply\ndeleted 3 points 3 days ago yukondave 1 points 3 days ago Racist, Stone age tribal people all think the same way permalink parent award report block reply\nyukondave 1 points 3 days ago Racist, Stone age tribal people all think the same way permalink parent award report block reply\nwilburh09 2 points 3 days ago I’ve hung out with cool Hawaiians in maui.  But I’d guess many Hawaiian natives would choose tren de aragua over Haole. It’s basically a very beautiful 3rd world country. permalink parent award report block reply\nm0ntsta 2 points 3 days ago My wife is Hawaiian. Her grandfather was born on Ni’ihau. The only thing Hawaiians might hate more than white people is 3rd world setbacks that take the retard jobs on the island. Because native Hawaiians want to do the dumb labor jobs so they can go surfing at noon. They may be hardcore democrats in Hawaii, but they don’t like illegals. permalink parent award report block reply Nick-Kerr 1 points 3 days ago There are zero \"native\" hawaiians. They all come from other lands, not too long ago. permalink parent award report block reply\nNick-Kerr 1 points 3 days ago There are zero \"native\" hawaiians. They all come from other lands, not too long ago. permalink parent award report block reply\nMagaJay02 52 points 3 days ago HOLY CRAP! I didn't know the US Government had the ability to travel to each state to enforce the law! permalink award report block reply Hanging_Chad 17 points 3 days ago is Alaska next? permalink parent award report block reply Here_we_go 14 points 3 days ago Hope so. Nobody is above the law. Looking at you eskimos. permalink parent award report block reply Hanging_Chad 6 points 3 days ago are indian reservations sanctuary nations? permalink parent award report block reply Here_we_go 9 points 3 days ago Immigration is a federal matter, and federal immigration law and enforcement agencies (such as ICE) have jurisdiction on tribal lands. permalink parent award report block reply view 2 more comments... Hawksendoom 2 points 3 days ago the more i see your posts the more i like you permalink parent award report block reply learntocode 1 points 3 days ago They are sanctuaries from U.S. law enforcement and thus harbor all manner of criminal enterprises now. permalink parent award report block reply Capoditutticapi1 5 points 3 days ago Eskimos are Natives and Alaskan, NOT illegal's FFS! permalink parent award report block reply Nick-Kerr 1 points 3 days ago Nope. no humans ever evolved in Alaska. They're all nomadic colonizers from the east. permalink parent award report block reply view 1 more comments... Here_we_go 0 points 3 days ago That.was a sarcastic joke ffs. 🙄 permalink parent award report block reply view 2 more comments... Hawksendoom 4 points 3 days ago i came for this comment :D permalink parent award report block reply Capoditutticapi1 2 points 3 days ago Arrests have surged dramatically in Alaska! Only 13 in all of 2024 and 20 in 2023, per Alaska Department of Corrections data, but 2025 has seen at least 33 by mid-year alone, with ongoing activity into fall. Been scooping em up at food service, fisheries, shipyards, and the usual migrant \"sanctuary\" communities... permalink parent award report block reply Capoditutticapi1 1 points 2 days ago It ain't much relative to other states..., but hey, we don't count the one's that the bears, wolves, bigfoots/yetis and general wilderness goblins gobble up... permalink parent award report block reply AVeryNakedMan 15 points 3 days ago BREAKING: ICE CONFIRMS HAWAII IS PART OF AMERICA. TONIGHT AT 6PM: IS WATER STILL WET? permalink parent award report block reply ciaramella_is_gay 4 points 3 days ago My god I wonder if their flight was non-stop or dare I say, these agents were already based there? permalink parent award report block reply boomerbutnotOKBoomer 1 points 3 days ago ICE has agents in every state. It's only a 5+ hour flight from SFO permalink parent award report block reply 3-10 1 points 3 days ago I don’t get why they aren’t arresting any illegal. We can use the kids in schools and ERs to grab them. I want any non-citizen sent home, criminal or not. permalink parent award report block reply GorillaTactics 1 points 3 days ago What I really want to know is, how did all these illegals get there? They HAD to travel by airline, and until the autopen took office, airlines were supposed to have strict ID requirements permalink parent award report block reply load 5 more comments...\nHanging_Chad 17 points 3 days ago is Alaska next? permalink parent award report block reply Here_we_go 14 points 3 days ago Hope so. Nobody is above the law. Looking at you eskimos. permalink parent award report block reply Hanging_Chad 6 points 3 days ago are indian reservations sanctuary nations? permalink parent award report block reply Here_we_go 9 points 3 days ago Immigration is a federal matter, and federal immigration law and enforcement agencies (such as ICE) have jurisdiction on tribal lands. permalink parent award report block reply view 2 more comments... Hawksendoom 2 points 3 days ago the more i see your posts the more i like you permalink parent award report block reply learntocode 1 points 3 days ago They are sanctuaries from U.S. law enforcement and thus harbor all manner of criminal enterprises now. permalink parent award report block reply Capoditutticapi1 5 points 3 days ago Eskimos are Natives and Alaskan, NOT illegal's FFS! permalink parent award report block reply Nick-Kerr 1 points 3 days ago Nope. no humans ever evolved in Alaska. They're all nomadic colonizers from the east. permalink parent award report block reply view 1 more comments... Here_we_go 0 points 3 days ago That.was a sarcastic joke ffs. 🙄 permalink parent award report block reply view 2 more comments... Hawksendoom 4 points 3 days ago i came for this comment :D permalink parent award report block reply Capoditutticapi1 2 points 3 days ago Arrests have surged dramatically in Alaska! Only 13 in all of 2024 and 20 in 2023, per Alaska Department of Corrections data, but 2025 has seen at least 33 by mid-year alone, with ongoing activity into fall. Been scooping em up at food service, fisheries, shipyards, and the usual migrant \"sanctuary\" communities... permalink parent award report block reply Capoditutticapi1 1 points 2 days ago It ain't much relative to other states..., but hey, we don't count the one's that the bears, wolves, bigfoots/yetis and general wilderness goblins gobble up... permalink parent award report block reply\nHere_we_go 14 points 3 days ago Hope so. Nobody is above the law. Looking at you eskimos. permalink parent award report block reply Hanging_Chad 6 points 3 days ago are indian reservations sanctuary nations? permalink parent award report block reply Here_we_go 9 points 3 days ago Immigration is a federal matter, and federal immigration law and enforcement agencies (such as ICE) have jurisdiction on tribal lands. permalink parent award report block reply view 2 more comments... Hawksendoom 2 points 3 days ago the more i see your posts the more i like you permalink parent award report block reply learntocode 1 points 3 days ago They are sanctuaries from U.S. law enforcement and thus harbor all manner of criminal enterprises now. permalink parent award report block reply Capoditutticapi1 5 points 3 days ago Eskimos are Natives and Alaskan, NOT illegal's FFS! permalink parent award report block reply Nick-Kerr 1 points 3 days ago Nope. no humans ever evolved in Alaska. They're all nomadic colonizers from the east. permalink parent award report block reply view 1 more comments... Here_we_go 0 points 3 days ago That.was a sarcastic joke ffs. 🙄 permalink parent award report block reply view 2 more comments...\nHanging_Chad 6 points 3 days ago are indian reservations sanctuary nations? permalink parent award report block reply Here_we_go 9 points 3 days ago Immigration is a federal matter, and federal immigration law and enforcement agencies (such as ICE) have jurisdiction on tribal lands. permalink parent award report block reply view 2 more comments... Hawksendoom 2 points 3 days ago the more i see your posts the more i like you permalink parent award report block reply learntocode 1 points 3 days ago They are sanctuaries from U.S. law enforcement and thus harbor all manner of criminal enterprises now. permalink parent award report block reply\nHere_we_go 9 points 3 days ago Immigration is a federal matter, and federal immigration law and enforcement agencies (such as ICE) have jurisdiction on tribal lands. permalink parent award report block reply view 2 more comments...\nHawksendoom 2 points 3 days ago the more i see your posts the more i like you permalink parent award report block reply\nlearntocode 1 points 3 days ago They are sanctuaries from U.S. law enforcement and thus harbor all manner of criminal enterprises now. permalink parent award report block reply\nCapoditutticapi1 5 points 3 days ago Eskimos are Natives and Alaskan, NOT illegal's FFS! permalink parent award report block reply Nick-Kerr 1 points 3 days ago Nope. no humans ever evolved in Alaska. They're all nomadic colonizers from the east. permalink parent award report block reply view 1 more comments... Here_we_go 0 points 3 days ago That.was a sarcastic joke ffs. 🙄 permalink parent award report block reply view 2 more comments...\nNick-Kerr 1 points 3 days ago Nope. no humans ever evolved in Alaska. They're all nomadic colonizers from the east. permalink parent award report block reply view 1 more comments...\nHere_we_go 0 points 3 days ago That.was a sarcastic joke ffs. 🙄 permalink parent award report block reply view 2 more comments...\nHawksendoom 4 points 3 days ago i came for this comment :D permalink parent award report block reply\nCapoditutticapi1 2 points 3 days ago Arrests have surged dramatically in Alaska! Only 13 in all of 2024 and 20 in 2023, per Alaska Department of Corrections data, but 2025 has seen at least 33 by mid-year alone, with ongoing activity into fall. Been scooping em up at food service, fisheries, shipyards, and the usual migrant \"sanctuary\" communities... permalink parent award report block reply Capoditutticapi1 1 points 2 days ago It ain't much relative to other states..., but hey, we don't count the one's that the bears, wolves, bigfoots/yetis and general wilderness goblins gobble up... permalink parent award report block reply\nCapoditutticapi1 1 points 2 days ago It ain't much relative to other states..., but hey, we don't count the one's that the bears, wolves, bigfoots/yetis and general wilderness goblins gobble up... permalink parent award report block reply\nAVeryNakedMan 15 points 3 days ago BREAKING: ICE CONFIRMS HAWAII IS PART OF AMERICA. TONIGHT AT 6PM: IS WATER STILL WET? permalink parent award report block reply\nciaramella_is_gay 4 points 3 days ago My god I wonder if their flight was non-stop or dare I say, these agents were already based there? permalink parent award report block reply boomerbutnotOKBoomer 1 points 3 days ago ICE has agents in every state. It's only a 5+ hour flight from SFO permalink parent award report block reply\nboomerbutnotOKBoomer 1 points 3 days ago ICE has agents in every state. It's only a 5+ hour flight from SFO permalink parent award report block reply\n3-10 1 points 3 days ago I don’t get why they aren’t arresting any illegal. We can use the kids in schools and ERs to grab them. I want any non-citizen sent home, criminal or not. permalink parent award report block reply\nGorillaTactics 1 points 3 days ago What I really want to know is, how did all these illegals get there? They HAD to travel by airline, and until the autopen took office, airlines were supposed to have strict ID requirements permalink parent award report block reply\nvictory2024 37 points 3 days ago Jesus, even Kauai is infested with these vermin? permalink award report block reply PROCIsAsshoe 16 points 3 days ago right? did they go there to try and hide out? If you're a South American drug cartel, you don't need a large presence in Kauai of all places. permalink parent award report block reply boomerbutnotOKBoomer 13 points 3 days ago And you'd be pretty easy to spot. Plus, pretty much everyone is related. I'm related to 1/3 of Kauai and 1/2 of Maui. Not something you'd readily realize if you are going there to hide out. Of interest, about 30 years ago there was a WTO or similar conference in Honolulu. Some troublemakers from Quebec flew in to protest. They thought everyone hated the police because they did. But at that time, a huge percentage of families had at least one law enforcement type in their family. So the dumbasses cooked up this idea they would fill all the fire extinguishers in the convention center with gasoline, and then set small fires all through the center. They backed up their van in the docking area of the Convention center and stole dozens of fire extinguishers. They emptied them and then took them to a nearby gas station. The kids working there were ALL relatives of cops. So they called it in and the jackasses were arrested. permalink parent award report block reply boomerbutnotOKBoomer 6 points 3 days ago OH - one more. Another couple of asswipes from this stellar group decided to go out to the country and buy some pig shit. Their plan was to set it on fire and throw it on the cops and security details of the visiting dignitaries. Only problem is they were chatty cathies. The asswipes, again, believed everyone hates cops like they do. So they go out to the pig farms and try to buy pig shit. Got the shit beat out of them instead. Cops get called and the pig farmers tell them, \"We dunno. Dese bruddas wen come out heah and start fightin' wid each uddah. We stayed out of it. No care if dey kill each uddah.\" It was the stuff of legends for years to come. Good times. kek permalink parent award report block reply GainesvilleFlorida 1 points 2 days ago This was an nice read on my Monday morning coffee permalink parent award report block reply Justlooking250 1 points 3 days ago LMAO, retard MORONS 🤤, FAFO permalink parent award report block reply Brock_Shithouse 3 points 3 days ago It's a big vacation destination and people typically have to fly there, it makes sense there is a drug gang presence. permalink parent award report block reply wilburh09 2 points 3 days ago The locals are the druggies in Hawaii. Lots of poor locals on meth or whatever other drug. permalink parent award report block reply SeeFreeDJ 3 points 3 days ago Drug dealers make great money in Hawaii. Lots of tourists willing to pay a premium for some \"Maui Wowie\". Add in local surfer culture, and it's shooting fish in a barrel. permalink parent award report block reply m0ntsta 2 points 3 days ago Not really since they legalized medicinal weed. Now it’s a government racket like every other state with medical weed. permalink parent award report block reply SeeFreeDJ 1 points 3 days ago How easy is it for a tourist to get from a dispensary, though? I haven't been to Hawaii in decades so I can only speculate, but I imagine there would still be a thriving black market for the tourists without medicinal cards. I also would think there is still a lot of demand for other illegal drugs. permalink parent award report block reply wilburh09 1 points 3 days ago It’s not Vegas.   The locals are the meth head not the tourists. permalink parent award report block reply DemPanicAtTheDisco 1 points 3 days ago Huge meth problem on the islands mun by Mexican cartels. permalink parent award report block reply\nPROCIsAsshoe 16 points 3 days ago right? did they go there to try and hide out? If you're a South American drug cartel, you don't need a large presence in Kauai of all places. permalink parent award report block reply boomerbutnotOKBoomer 13 points 3 days ago And you'd be pretty easy to spot. Plus, pretty much everyone is related. I'm related to 1/3 of Kauai and 1/2 of Maui. Not something you'd readily realize if you are going there to hide out. Of interest, about 30 years ago there was a WTO or similar conference in Honolulu. Some troublemakers from Quebec flew in to protest. They thought everyone hated the police because they did. But at that time, a huge percentage of families had at least one law enforcement type in their family. So the dumbasses cooked up this idea they would fill all the fire extinguishers in the convention center with gasoline, and then set small fires all through the center. They backed up their van in the docking area of the Convention center and stole dozens of fire extinguishers. They emptied them and then took them to a nearby gas station. The kids working there were ALL relatives of cops. So they called it in and the jackasses were arrested. permalink parent award report block reply boomerbutnotOKBoomer 6 points 3 days ago OH - one more. Another couple of asswipes from this stellar group decided to go out to the country and buy some pig shit. Their plan was to set it on fire and throw it on the cops and security details of the visiting dignitaries. Only problem is they were chatty cathies. The asswipes, again, believed everyone hates cops like they do. So they go out to the pig farms and try to buy pig shit. Got the shit beat out of them instead. Cops get called and the pig farmers tell them, \"We dunno. Dese bruddas wen come out heah and start fightin' wid each uddah. We stayed out of it. No care if dey kill each uddah.\" It was the stuff of legends for years to come. Good times. kek permalink parent award report block reply GainesvilleFlorida 1 points 2 days ago This was an nice read on my Monday morning coffee permalink parent award report block reply Justlooking250 1 points 3 days ago LMAO, retard MORONS 🤤, FAFO permalink parent award report block reply Brock_Shithouse 3 points 3 days ago It's a big vacation destination and people typically have to fly there, it makes sense there is a drug gang presence. permalink parent award report block reply wilburh09 2 points 3 days ago The locals are the druggies in Hawaii. Lots of poor locals on meth or whatever other drug. permalink parent award report block reply SeeFreeDJ 3 points 3 days ago Drug dealers make great money in Hawaii. Lots of tourists willing to pay a premium for some \"Maui Wowie\". Add in local surfer culture, and it's shooting fish in a barrel. permalink parent award report block reply m0ntsta 2 points 3 days ago Not really since they legalized medicinal weed. Now it’s a government racket like every other state with medical weed. permalink parent award report block reply SeeFreeDJ 1 points 3 days ago How easy is it for a tourist to get from a dispensary, though? I haven't been to Hawaii in decades so I can only speculate, but I imagine there would still be a thriving black market for the tourists without medicinal cards. I also would think there is still a lot of demand for other illegal drugs. permalink parent award report block reply wilburh09 1 points 3 days ago It’s not Vegas.   The locals are the meth head not the tourists. permalink parent award report block reply\nboomerbutnotOKBoomer 13 points 3 days ago And you'd be pretty easy to spot. Plus, pretty much everyone is related. I'm related to 1/3 of Kauai and 1/2 of Maui. Not something you'd readily realize if you are going there to hide out. Of interest, about 30 years ago there was a WTO or similar conference in Honolulu. Some troublemakers from Quebec flew in to protest. They thought everyone hated the police because they did. But at that time, a huge percentage of families had at least one law enforcement type in their family. So the dumbasses cooked up this idea they would fill all the fire extinguishers in the convention center with gasoline, and then set small fires all through the center. They backed up their van in the docking area of the Convention center and stole dozens of fire extinguishers. They emptied them and then took them to a nearby gas station. The kids working there were ALL relatives of cops. So they called it in and the jackasses were arrested. permalink parent award report block reply boomerbutnotOKBoomer 6 points 3 days ago OH - one more. Another couple of asswipes from this stellar group decided to go out to the country and buy some pig shit. Their plan was to set it on fire and throw it on the cops and security details of the visiting dignitaries. Only problem is they were chatty cathies. The asswipes, again, believed everyone hates cops like they do. So they go out to the pig farms and try to buy pig shit. Got the shit beat out of them instead. Cops get called and the pig farmers tell them, \"We dunno. Dese bruddas wen come out heah and start fightin' wid each uddah. We stayed out of it. No care if dey kill each uddah.\" It was the stuff of legends for years to come. Good times. kek permalink parent award report block reply GainesvilleFlorida 1 points 2 days ago This was an nice read on my Monday morning coffee permalink parent award report block reply Justlooking250 1 points 3 days ago LMAO, retard MORONS 🤤, FAFO permalink parent award report block reply\nboomerbutnotOKBoomer 6 points 3 days ago OH - one more. Another couple of asswipes from this stellar group decided to go out to the country and buy some pig shit. Their plan was to set it on fire and throw it on the cops and security details of the visiting dignitaries. Only problem is they were chatty cathies. The asswipes, again, believed everyone hates cops like they do. So they go out to the pig farms and try to buy pig shit. Got the shit beat out of them instead. Cops get called and the pig farmers tell them, \"We dunno. Dese bruddas wen come out heah and start fightin' wid each uddah. We stayed out of it. No care if dey kill each uddah.\" It was the stuff of legends for years to come. Good times. kek permalink parent award report block reply GainesvilleFlorida 1 points 2 days ago This was an nice read on my Monday morning coffee permalink parent award report block reply\nGainesvilleFlorida 1 points 2 days ago This was an nice read on my Monday morning coffee permalink parent award report block reply\nJustlooking250 1 points 3 days ago LMAO, retard MORONS 🤤, FAFO permalink parent award report block reply\nBrock_Shithouse 3 points 3 days ago It's a big vacation destination and people typically have to fly there, it makes sense there is a drug gang presence. permalink parent award report block reply wilburh09 2 points 3 days ago The locals are the druggies in Hawaii. Lots of poor locals on meth or whatever other drug. permalink parent award report block reply\nwilburh09 2 points 3 days ago The locals are the druggies in Hawaii. Lots of poor locals on meth or whatever other drug. permalink parent award report block reply\nSeeFreeDJ 3 points 3 days ago Drug dealers make great money in Hawaii. Lots of tourists willing to pay a premium for some \"Maui Wowie\". Add in local surfer culture, and it's shooting fish in a barrel. permalink parent award report block reply m0ntsta 2 points 3 days ago Not really since they legalized medicinal weed. Now it’s a government racket like every other state with medical weed. permalink parent award report block reply SeeFreeDJ 1 points 3 days ago How easy is it for a tourist to get from a dispensary, though? I haven't been to Hawaii in decades so I can only speculate, but I imagine there would still be a thriving black market for the tourists without medicinal cards. I also would think there is still a lot of demand for other illegal drugs. permalink parent award report block reply wilburh09 1 points 3 days ago It’s not Vegas.   The locals are the meth head not the tourists. permalink parent award report block reply\nm0ntsta 2 points 3 days ago Not really since they legalized medicinal weed. Now it’s a government racket like every other state with medical weed. permalink parent award report block reply SeeFreeDJ 1 points 3 days ago How easy is it for a tourist to get from a dispensary, though? I haven't been to Hawaii in decades so I can only speculate, but I imagine there would still be a thriving black market for the tourists without medicinal cards. I also would think there is still a lot of demand for other illegal drugs. permalink parent award report block reply\nSeeFreeDJ 1 points 3 days ago How easy is it for a tourist to get from a dispensary, though? I haven't been to Hawaii in decades so I can only speculate, but I imagine there would still be a thriving black market for the tourists without medicinal cards. I also would think there is still a lot of demand for other illegal drugs. permalink parent award report block reply\nwilburh09 1 points 3 days ago It’s not Vegas.   The locals are the meth head not the tourists. permalink parent award report block reply\nDemPanicAtTheDisco 1 points 3 days ago Huge meth problem on the islands mun by Mexican cartels. permalink parent award report block reply\nRun_over_Antifa 23 points 3 days ago Dear ICE please raid bfe Georgia, they are still everywhere. permalink award report block reply Pied-Trumper 11 points 3 days ago That’s because we’re nowhere near 1 million deportations, we only have 3 years left before your neck breaks from whiplash, and over 10 million came in over the last 4 years. permalink parent award report block reply peterthegreen 8 points 3 days ago MTG dangling the carrot of illegal alien amnesty doesn't help either. permalink parent award report block reply ICONSIDEREDTHISFIRST 6 points 3 days ago That or the amount of illegals here is significantly higher than anyone thinks. permalink parent award report block reply m0ntsta 3 points 3 days ago We are over 50,000,000+. That is my ULTRA conservative estimate based on common sense, using my eyes, and using my ears listening to the media tell us we have 12,000,000 illegals since Jimmy Carter was slingin’ peanuts. If there were 12,000,000 illegals in America in 1980, and they are coming in and growing at the same percentage rate as inflation, how many are in America today? Let’s calculate carefully step-by-step. ⸻ Establish assumptions\n•\tStarting number (1980): 12,000,000\n•\tGrowth rate: same as inflation\n•\tTime span: 1980 → 2025 = 45 years We need an average annual inflation rate over that period. The U.S. inflation rate has varied, but the average CPI inflation from 1980–2025 is about 3.2% per year (based on long-term Bureau of Labor Statistics data). ⸻ Use the compound growth formula N = N_0 \\times (1 + r)^t\nWhere:\n•\tN_0 = 12,000,000\n•\tr = 0.032 (3.2%)\n•\tt = 45 ⸻ Compute precisely\n(1.032)^{45} = e^{45 \\times \\ln(1.032)} \\approx e^{45 \\times 0.0315} \\approx e^{1.4175} \\approx 4.13\nThen:\n12,000,000 \\times 4.13 = 49,560,000 ⸻ ✅ Final Answer:\nIf the number of illegal immigrants grew at the same rate as inflation (≈3.2% annually),\nthere would be about 50 million in America today (in 2025). The more you know… permalink parent award report block reply Brock_Shithouse 1 points 3 days ago Or both permalink parent award report block reply MajJamesMcFarlane 4 points 3 days ago I think I've heard we need to expell something like 10k to 20k a day if we're going to get them all out by the end of Trump's term. Every report of 10s of arrests is literally a nothing burger. Expect to be massively disappointed permalink parent award report block reply Brock_Shithouse 3 points 3 days ago Expect to be massively disappointed Good advice whenever looking for help from politicians. permalink parent award report block reply PROCIsAsshoe 1 points 3 days ago yes we are well beyond 1mm deportations. there are various data sources corroborating the departure of ~2 million already and even hostile outlets like WSJ have stated as much. permalink parent award report block reply POTUS_DonnieJ 2 points 3 days ago If we're putting in requests, I want to see Dearborn swarming with ICE agents. permalink parent award report block reply\nPied-Trumper 11 points 3 days ago That’s because we’re nowhere near 1 million deportations, we only have 3 years left before your neck breaks from whiplash, and over 10 million came in over the last 4 years. permalink parent award report block reply peterthegreen 8 points 3 days ago MTG dangling the carrot of illegal alien amnesty doesn't help either. permalink parent award report block reply ICONSIDEREDTHISFIRST 6 points 3 days ago That or the amount of illegals here is significantly higher than anyone thinks. permalink parent award report block reply m0ntsta 3 points 3 days ago We are over 50,000,000+. That is my ULTRA conservative estimate based on common sense, using my eyes, and using my ears listening to the media tell us we have 12,000,000 illegals since Jimmy Carter was slingin’ peanuts. If there were 12,000,000 illegals in America in 1980, and they are coming in and growing at the same percentage rate as inflation, how many are in America today? Let’s calculate carefully step-by-step. ⸻ Establish assumptions\n•\tStarting number (1980): 12,000,000\n•\tGrowth rate: same as inflation\n•\tTime span: 1980 → 2025 = 45 years We need an average annual inflation rate over that period. The U.S. inflation rate has varied, but the average CPI inflation from 1980–2025 is about 3.2% per year (based on long-term Bureau of Labor Statistics data). ⸻ Use the compound growth formula N = N_0 \\times (1 + r)^t\nWhere:\n•\tN_0 = 12,000,000\n•\tr = 0.032 (3.2%)\n•\tt = 45 ⸻ Compute precisely\n(1.032)^{45} = e^{45 \\times \\ln(1.032)} \\approx e^{45 \\times 0.0315} \\approx e^{1.4175} \\approx 4.13\nThen:\n12,000,000 \\times 4.13 = 49,560,000 ⸻ ✅ Final Answer:\nIf the number of illegal immigrants grew at the same rate as inflation (≈3.2% annually),\nthere would be about 50 million in America today (in 2025). The more you know… permalink parent award report block reply Brock_Shithouse 1 points 3 days ago Or both permalink parent award report block reply MajJamesMcFarlane 4 points 3 days ago I think I've heard we need to expell something like 10k to 20k a day if we're going to get them all out by the end of Trump's term. Every report of 10s of arrests is literally a nothing burger. Expect to be massively disappointed permalink parent award report block reply Brock_Shithouse 3 points 3 days ago Expect to be massively disappointed Good advice whenever looking for help from politicians. permalink parent award report block reply PROCIsAsshoe 1 points 3 days ago yes we are well beyond 1mm deportations. there are various data sources corroborating the departure of ~2 million already and even hostile outlets like WSJ have stated as much. permalink parent award report block reply\npeterthegreen 8 points 3 days ago MTG dangling the carrot of illegal alien amnesty doesn't help either. permalink parent award report block reply\nICONSIDEREDTHISFIRST 6 points 3 days ago That or the amount of illegals here is significantly higher than anyone thinks. permalink parent award report block reply m0ntsta 3 points 3 days ago We are over 50,000,000+. That is my ULTRA conservative estimate based on common sense, using my eyes, and using my ears listening to the media tell us we have 12,000,000 illegals since Jimmy Carter was slingin’ peanuts. If there were 12,000,000 illegals in America in 1980, and they are coming in and growing at the same percentage rate as inflation, how many are in America today? Let’s calculate carefully step-by-step. ⸻ Establish assumptions\n•\tStarting number (1980): 12,000,000\n•\tGrowth rate: same as inflation\n•\tTime span: 1980 → 2025 = 45 years We need an average annual inflation rate over that period. The U.S. inflation rate has varied, but the average CPI inflation from 1980–2025 is about 3.2% per year (based on long-term Bureau of Labor Statistics data). ⸻ Use the compound growth formula N = N_0 \\times (1 + r)^t\nWhere:\n•\tN_0 = 12,000,000\n•\tr = 0.032 (3.2%)\n•\tt = 45 ⸻ Compute precisely\n(1.032)^{45} = e^{45 \\times \\ln(1.032)} \\approx e^{45 \\times 0.0315} \\approx e^{1.4175} \\approx 4.13\nThen:\n12,000,000 \\times 4.13 = 49,560,000 ⸻ ✅ Final Answer:\nIf the number of illegal immigrants grew at the same rate as inflation (≈3.2% annually),\nthere would be about 50 million in America today (in 2025). The more you know… permalink parent award report block reply Brock_Shithouse 1 points 3 days ago Or both permalink parent award report block reply\nm0ntsta 3 points 3 days ago We are over 50,000,000+. That is my ULTRA conservative estimate based on common sense, using my eyes, and using my ears listening to the media tell us we have 12,000,000 illegals since Jimmy Carter was slingin’ peanuts. If there were 12,000,000 illegals in America in 1980, and they are coming in and growing at the same percentage rate as inflation, how many are in America today? Let’s calculate carefully step-by-step. ⸻ Establish assumptions\n•\tStarting number (1980): 12,000,000\n•\tGrowth rate: same as inflation\n•\tTime span: 1980 → 2025 = 45 years We need an average annual inflation rate over that period. The U.S. inflation rate has varied, but the average CPI inflation from 1980–2025 is about 3.2% per year (based on long-term Bureau of Labor Statistics data). ⸻ Use the compound growth formula N = N_0 \\times (1 + r)^t\nWhere:\n•\tN_0 = 12,000,000\n•\tr = 0.032 (3.2%)\n•\tt = 45 ⸻ Compute precisely\n(1.032)^{45} = e^{45 \\times \\ln(1.032)} \\approx e^{45 \\times 0.0315} \\approx e^{1.4175} \\approx 4.13\nThen:\n12,000,000 \\times 4.13 = 49,560,000 ⸻ ✅ Final Answer:\nIf the number of illegal immigrants grew at the same rate as inflation (≈3.2% annually),\nthere would be about 50 million in America today (in 2025). The more you know… permalink parent award report block reply\nBrock_Shithouse 1 points 3 days ago Or both permalink parent award report block reply\nMajJamesMcFarlane 4 points 3 days ago I think I've heard we need to expell something like 10k to 20k a day if we're going to get them all out by the end of Trump's term. Every report of 10s of arrests is literally a nothing burger. Expect to be massively disappointed permalink parent award report block reply Brock_Shithouse 3 points 3 days ago Expect to be massively disappointed Good advice whenever looking for help from politicians. permalink parent award report block reply\nBrock_Shithouse 3 points 3 days ago Expect to be massively disappointed Good advice whenever looking for help from politicians. permalink parent award report block reply\nPROCIsAsshoe 1 points 3 days ago yes we are well beyond 1mm deportations. there are various data sources corroborating the departure of ~2 million already and even hostile outlets like WSJ have stated as much. permalink parent award report block reply\nPOTUS_DonnieJ 2 points 3 days ago If we're putting in requests, I want to see Dearborn swarming with ICE agents. permalink parent award report block reply\nKekistanPM 16 points 3 days ago Throw the illegals into a volcano. Then we'll be rid of them and the gods will be appeased! permalink award report block reply TDAF 9 points 3 days ago Jose Versus the Volcano permalink parent award report block reply Hawksendoom 4 points 3 days ago i mean it's what they did right? permalink parent award report block reply Aquamine-Amarine 2 points 3 days ago That's bad for the environment. Toss them into the sun. permalink parent award report block reply Justlooking250 2 points 3 days ago 'Of course we can land on the sun, we just have to go at night' 🤣 permalink parent award report block reply\nTDAF 9 points 3 days ago Jose Versus the Volcano permalink parent award report block reply\nHawksendoom 4 points 3 days ago i mean it's what they did right? permalink parent award report block reply\nAquamine-Amarine 2 points 3 days ago That's bad for the environment. Toss them into the sun. permalink parent award report block reply Justlooking250 2 points 3 days ago 'Of course we can land on the sun, we just have to go at night' 🤣 permalink parent award report block reply\nJustlooking250 2 points 3 days ago 'Of course we can land on the sun, we just have to go at night' 🤣 permalink parent award report block reply\nFreeCommieUFORides 14 points 3 days ago These fucking news stations. Did you hear that bullshit honorific accenting when they said “Tren De Aragua”? permalink award report block reply RememberCharlieKirk 8 points 3 days ago Like NPR hosts with how they pronounce Mexico permalink parent award report block reply KernalMustard 5 points 3 days ago Meh'he'co permalink parent award report block reply NoMaskNoMaster 1 points 2 days ago Bro, thank you. Good to know I'm not the only one deeply offended and disgusted by the pandering. permalink parent award report block reply\nRememberCharlieKirk 8 points 3 days ago Like NPR hosts with how they pronounce Mexico permalink parent award report block reply KernalMustard 5 points 3 days ago Meh'he'co permalink parent award report block reply\nKernalMustard 5 points 3 days ago Meh'he'co permalink parent award report block reply\nNoMaskNoMaster 1 points 2 days ago Bro, thank you. Good to know I'm not the only one deeply offended and disgusted by the pandering. permalink parent award report block reply\nHanging_Chad 7 points 3 days ago how many CCP spies are in Hawaii? permalink award report block reply HeavyMetalPatriot 7 points 3 days ago Yes. permalink parent award report block reply one_cool 5 points 3 days ago went to honolulu. there are more chinese and russian there than American. permalink parent award report block reply\nHeavyMetalPatriot 7 points 3 days ago Yes. permalink parent award report block reply\none_cool 5 points 3 days ago went to honolulu. there are more chinese and russian there than American. permalink parent award report block reply\nKungPaoMcChicken 6 points 3 days ago I love how people were using the taking of the US from the natives as the perfect analogy for why ICE is needed. Gee you think the natives needed their own ICE back in the day? Perfect analogy. permalink award report block reply\nCarterslvrpilz 6 points 3 days ago More ICE in paradise!!!! permalink award report block reply\nFren20 5 points 3 days ago Please ice go to San Bernardino California,full of illegals 💯💯💯💯💯 permalink award report block reply\nHawksendoom 5 points 3 days ago Kauai' is a shit hole and always will be! they closed every fucking bar, restaurant and nightclub for the tourists and they fucking look at you like you are satan incarnate. Cut them all off like them puerto rico pieces of shit permalink award report block reply wilburh09 1 points 3 days ago Yea I hung out with some cool Hawaiians in Maui.  But drugs in  Hawaii are not tourist driven.  Many of the  locals there hate Haolies and are degenerate druggies. permalink parent award report block reply Hawksendoom 1 points 3 days ago i mean that's how i got treated so just sayin' permalink parent award report block reply Justlooking250 0 points 3 days ago MuH ✌️cOvId✌️ ShUtDoWnSz 🤤🤤🤤🤤🤤 WhY iSz InFlATiOn So bAD ??? 🤤🤤🤤 permalink parent award report block reply Hawksendoom 2 points 3 days ago i am curious - what did anything i just said have to do with the covid shutdown and inflation? oh you mean the bars closings? oh they fucking hate us howlies so that is why. Happened before covid in the 90's. permalink parent award report block reply Justlooking250 1 points 3 days ago I mean everything closing and the crippling inflation that resulted from that SCAM especially in blue areas permalink parent award report block reply Hawksendoom 2 points 3 days ago fair enough groovy cat. permalink parent award report block reply\nwilburh09 1 points 3 days ago Yea I hung out with some cool Hawaiians in Maui.  But drugs in  Hawaii are not tourist driven.  Many of the  locals there hate Haolies and are degenerate druggies. permalink parent award report block reply Hawksendoom 1 points 3 days ago i mean that's how i got treated so just sayin' permalink parent award report block reply\nHawksendoom 1 points 3 days ago i mean that's how i got treated so just sayin' permalink parent award report block reply\nJustlooking250 0 points 3 days ago MuH ✌️cOvId✌️ ShUtDoWnSz 🤤🤤🤤🤤🤤 WhY iSz InFlATiOn So bAD ??? 🤤🤤🤤 permalink parent award report block reply Hawksendoom 2 points 3 days ago i am curious - what did anything i just said have to do with the covid shutdown and inflation? oh you mean the bars closings? oh they fucking hate us howlies so that is why. Happened before covid in the 90's. permalink parent award report block reply Justlooking250 1 points 3 days ago I mean everything closing and the crippling inflation that resulted from that SCAM especially in blue areas permalink parent award report block reply Hawksendoom 2 points 3 days ago fair enough groovy cat. permalink parent award report block reply\nHawksendoom 2 points 3 days ago i am curious - what did anything i just said have to do with the covid shutdown and inflation? oh you mean the bars closings? oh they fucking hate us howlies so that is why. Happened before covid in the 90's. permalink parent award report block reply Justlooking250 1 points 3 days ago I mean everything closing and the crippling inflation that resulted from that SCAM especially in blue areas permalink parent award report block reply Hawksendoom 2 points 3 days ago fair enough groovy cat. permalink parent award report block reply\nJustlooking250 1 points 3 days ago I mean everything closing and the crippling inflation that resulted from that SCAM especially in blue areas permalink parent award report block reply Hawksendoom 2 points 3 days ago fair enough groovy cat. permalink parent award report block reply\nHawksendoom 2 points 3 days ago fair enough groovy cat. permalink parent award report block reply\nythehorses 4 points 3 days ago That island has been rotten for a long time - probably because of these freakers. permalink award report block reply\n559throw 4 points 3 days ago Dozens? Doesn't the video say two? permalink award report block reply\nfreebirdie 3 points 3 days ago Meanwhile in San Jose, I saw a party at a county park that had at least 50 illegals under one awning. Never a sign of ICE anywhere, and the wetbacks I reported in January are still there. permalink award report block reply\nthisisatestof2 3 points 3 days ago I found it kind of interesting how the report are covered the response from the local officials who seems more than happy to acknowledge they arrested some of the terrorist gang members. permalink award report block reply\nSaltyTitties4 3 points 3 days ago What the HELL is that chic doing?!  She looks terrified and she looks like she’s never held a gun before. Holy shit. permalink award report block reply\nthrowaway29834751 3 points 3 days ago Good.  Keep going.  Denaturalize mamdani too.  He lied about being a communist.  Ice raids in NYC everyday please.  Denaturalize and deport 3000 per day please. permalink award report block reply\nArchmagnus 3 points 3 days ago Tren de Aragua gang members They’re ALL going back! No no, let them stay, I have some prime real estate around 6 feet under in need of tenants. permalink award report block reply\nMrHarryReems 3 points 3 days ago Not surprising that Tren de Aragua would have a presence out here considering that Hawaii is a cesspool of human trafficking. permalink award report block reply NoMaskNoMaster 1 points 2 days ago Obamas favorite hotdog stands permalink parent award report block reply\nNoMaskNoMaster 1 points 2 days ago Obamas favorite hotdog stands permalink parent award report block reply\nRoguepepe 2 points 3 days ago Vacation is OVER boys! permalink award report block reply\nboomerbutnotOKBoomer 2 points 3 days ago Thank God. Hawaii people don't deserve these gang members. They have enough trouble with their home-grown Syndicate guys. permalink award report block reply\nIntergalacticWalrus 2 points 3 days ago Why do we have to break into an accent when there's a Spanish word or phrase? permalink award report block reply\nPsalm-118_24 1 points 2 days ago ICE please come to Dearbornistan, and Hamtrack, MI, Minneapolis, MN, Patterson NJ, Chicago and Bridgeview IL, and Houston, TX. permalink award report block reply\nPatriotDescendant 1 points 2 days ago I hope the agents got a night or two off. Kauai is one of my happy places! permalink award report block reply\nhey_spike 1 points 3 days ago Surely there is  a Hawaiian judge ready to issue an injuction. permalink award report block reply\nRogueLeaderX 1 points 3 days ago Make Polynesia Great Again! permalink award report block reply\nInduceddrag 1 points 3 days ago Considering how Hawaiians hate non-natives, I can’t believe TdA would get a warm welcome there. permalink award report block reply NoMaskNoMaster 1 points 2 days ago All the old school local gangsters are dead or retired. Islands have been taken over by Samoan micronesian and cartel gangs permalink parent award report block reply\nNoMaskNoMaster 1 points 2 days ago All the old school local gangsters are dead or retired. Islands have been taken over by Samoan micronesian and cartel gangs permalink parent award report block reply\nFemale 1 points 3 days ago curious why x people insist on saying, 'holy crap'. I don't think that they understand what the word holy means. permalink award report block reply\ndoodaddy 1 points 3 days ago So, cartels are on the islands?  Let's talk about that Big Island fire again that devastated the town. permalink award report block reply NoMaskNoMaster 1 points 2 days ago It was Maui but yes permalink parent award report block reply doodaddy 1 points 2 days ago 🤙  that's right. permalink parent award report block reply\nNoMaskNoMaster 1 points 2 days ago It was Maui but yes permalink parent award report block reply doodaddy 1 points 2 days ago 🤙  that's right. permalink parent award report block reply\ndoodaddy 1 points 2 days ago 🤙  that's right. permalink parent award report block reply\nACActual 1 points 3 days ago I wish they'd come to Pennsylvania.  Overridden permalink award report block reply\nNoticesBugleOWO 1 points 3 days ago Good! I hope the hit Honolulu next. So many illegals living as homeless or working in Chinatown. permalink award report block reply\ndarkmodeforgotpass 1 points 3 days ago Pop the boats and there will be an end to the horror. permalink award report block reply\nbananafone 1 points 3 days ago Ice is looking for a few good men permalink award report block reply\nFBIsurveillance 1 points 3 days ago I didnt even know illegal could get to hawaii permalink award report block reply\nChickenStrips 1 points 3 days ago How did these TdA retards get to HI? permalink award report block reply\nspezisacuckold 1 points 3 days ago Why wouldn't they? permalink award report block reply\nKennyKetchem 1 points 3 days ago I believe they also do this in US Territories such as P.R. and Gaum. permalink award report block reply BoricuaPede 1 points 3 days ago Where's \"Gaum?\" permalink parent award report block reply\nBoricuaPede 1 points 3 days ago Where's \"Gaum?\" permalink parent award report block reply\nJoeMcCarthyWasRight 1 points 3 days ago Everywhere but Northern California. permalink award report block reply\nDeplorableNeandertal 1 points 3 days ago Id settle for clearing out Minnesota and Michigan honestly permalink award report block reply\nmykillk 1 points 3 days ago How can these poor Venezuelan fuckers afford to live in Hawaii? permalink award report block reply\nTheLivingExample 1 points 3 days ago They're guaranteed to melt there, for sure! permalink award report block reply\nObambi 1 points 3 days ago Lots of homeless in Hawaii and tons of drugs. Send in the dawg. permalink award report block reply\nDem_slayer 1 points 3 days ago They should be executed not just deported... permalink award report block reply\nNoMaskNoMaster 1 points 2 days ago Remove the Micronesians and Samoans next permalink award report block reply\nObambi 0 points 3 days ago Do Puerto Rico next. Bunch there overlooking the passages. permalink award report block reply"}