{"id": "1ARK9nNiBa", "contents": "79 1970 Chevrolet Chevelle SS🇺🇸 posted 9 hours ago by wst4 20 comments award share download report block\n20 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style happyfave 4 points 8 hours ago Love that car, Love my Tesla too tho. permalink award report block reply Patrick_Bateman 1 points 7 hours ago Boomer meme creator misses the point that it also looks better than any current GM vehicle. permalink parent award report block reply happyfave 2 points 4 hours ago More attractive than almost any car on the road these days that is less than 100k.   ALso most people who make fun of Teslas have never driven one.  I was once in that boat... Then drove one, now it's the only car I will probably ever consider again. permalink parent award report block reply Patrick_Bateman 1 points 3 hours ago I sold my C6 Corvette to purchase my Model S over 9 years ago.. No regrets. permalink parent award report block reply C0drus 4 points 9 hours ago Beautiful, I miss real cars ☹️ permalink award report block reply RoosterRaiser 4 points 8 hours ago When I was a teen, we all joked that Chevelles were like assholes. Everyone had one. It was true. Very popular car in the 80s for teens. My boyfriend had an early 70s Buick Skylark. Loved that car more then I liked him. permalink award report block reply DudeThatCame2Sarnath 1 points 6 hours ago Sounds like the guys I grew up with. They were into muscle cars when muscle cars weren't really that cool haha. One guy drove a Plymouth Satellite, but his dream car was (and still is) an Olds 442 convertible. Or maybe a Grand National. He would preach to anybody who would listen that the AMC Javelin was actually a cool car. Me? I drove a VW Rabbit haha. I lacked the perspective at that time to properly appreciate classic American muscle cars. Especially poignant when you look at what you could have gotten a Chevelle SS for in 1985 vs what you would pay for one today. permalink parent award report block reply Blackmore 2 points 3 hours ago In 1969, I bought a 1963 Olds Delta Super 88 for $300 nd drove tht beast as my High school car. White with 394 four barrel carburetor which, one night out beat a corvette a 327 four barrel in a drag race on the Great Highway in San Francisco.It was a beast a small powerful ass kicken car lived it. permalink parent award report block reply friarfox 3 points 9 hours ago You could fill the tank for less than a pack of cigarettes today. permalink award report block reply SHILL_DETECTOR 2 points 9 hours ago teslas are fugly as fuck WHY permalink award report block reply Blackmore 1 points 3 hours ago Old school power muscle cars vs battery powered, I’d take the muscle car any day better and had class. permalink parent award report block reply PensivePatriot 1 points 8 hours ago Drag coefficients. permalink parent award report block reply SHILL_DETECTOR 1 points 8 hours ago right right because the batteries are so fucking heavy permalink parent award report block reply Wizard_Glick 2 points 9 hours ago 460 hp, they were a beast! permalink award report block reply The1776Man 1 points 8 hours ago 450hp, and that's only if it was an LS6. permalink parent award report block reply Wizard_Glick 1 points 8 hours ago 454 rated at 450 horsepower, although it was identical to the Corvette LS6 rated at 460... permalink parent award report block reply Retardloserimsogay 2 points 8 hours ago I am considering buying one 🤗 permalink award report block reply DonnieRamesJio 2 points 8 hours ago Get it on a lift before handing money over permalink parent award report block reply Retardloserimsogay 2 points 5 hours ago That's no joke, I been burned before on cheap buys... $5k. Chevelle like this is $60k plus. No worries though I did auto restoration professionally for over 15 years. permalink parent award report block reply Aggrieved03 1 points 9 hours ago and twice the price permalink award report block reply\nhappyfave 4 points 8 hours ago Love that car, Love my Tesla too tho. permalink award report block reply Patrick_Bateman 1 points 7 hours ago Boomer meme creator misses the point that it also looks better than any current GM vehicle. permalink parent award report block reply happyfave 2 points 4 hours ago More attractive than almost any car on the road these days that is less than 100k.   ALso most people who make fun of Teslas have never driven one.  I was once in that boat... Then drove one, now it's the only car I will probably ever consider again. permalink parent award report block reply Patrick_Bateman 1 points 3 hours ago I sold my C6 Corvette to purchase my Model S over 9 years ago.. No regrets. permalink parent award report block reply\nPatrick_Bateman 1 points 7 hours ago Boomer meme creator misses the point that it also looks better than any current GM vehicle. permalink parent award report block reply happyfave 2 points 4 hours ago More attractive than almost any car on the road these days that is less than 100k.   ALso most people who make fun of Teslas have never driven one.  I was once in that boat... Then drove one, now it's the only car I will probably ever consider again. permalink parent award report block reply Patrick_Bateman 1 points 3 hours ago I sold my C6 Corvette to purchase my Model S over 9 years ago.. No regrets. permalink parent award report block reply\nhappyfave 2 points 4 hours ago More attractive than almost any car on the road these days that is less than 100k.   ALso most people who make fun of Teslas have never driven one.  I was once in that boat... Then drove one, now it's the only car I will probably ever consider again. permalink parent award report block reply Patrick_Bateman 1 points 3 hours ago I sold my C6 Corvette to purchase my Model S over 9 years ago.. No regrets. permalink parent award report block reply\nPatrick_Bateman 1 points 3 hours ago I sold my C6 Corvette to purchase my Model S over 9 years ago.. No regrets. permalink parent award report block reply\nC0drus 4 points 9 hours ago Beautiful, I miss real cars ☹️ permalink award report block reply\nRoosterRaiser 4 points 8 hours ago When I was a teen, we all joked that Chevelles were like assholes. Everyone had one. It was true. Very popular car in the 80s for teens. My boyfriend had an early 70s Buick Skylark. Loved that car more then I liked him. permalink award report block reply DudeThatCame2Sarnath 1 points 6 hours ago Sounds like the guys I grew up with. They were into muscle cars when muscle cars weren't really that cool haha. One guy drove a Plymouth Satellite, but his dream car was (and still is) an Olds 442 convertible. Or maybe a Grand National. He would preach to anybody who would listen that the AMC Javelin was actually a cool car. Me? I drove a VW Rabbit haha. I lacked the perspective at that time to properly appreciate classic American muscle cars. Especially poignant when you look at what you could have gotten a Chevelle SS for in 1985 vs what you would pay for one today. permalink parent award report block reply Blackmore 2 points 3 hours ago In 1969, I bought a 1963 Olds Delta Super 88 for $300 nd drove tht beast as my High school car. White with 394 four barrel carburetor which, one night out beat a corvette a 327 four barrel in a drag race on the Great Highway in San Francisco.It was a beast a small powerful ass kicken car lived it. permalink parent award report block reply\nDudeThatCame2Sarnath 1 points 6 hours ago Sounds like the guys I grew up with. They were into muscle cars when muscle cars weren't really that cool haha. One guy drove a Plymouth Satellite, but his dream car was (and still is) an Olds 442 convertible. Or maybe a Grand National. He would preach to anybody who would listen that the AMC Javelin was actually a cool car. Me? I drove a VW Rabbit haha. I lacked the perspective at that time to properly appreciate classic American muscle cars. Especially poignant when you look at what you could have gotten a Chevelle SS for in 1985 vs what you would pay for one today. permalink parent award report block reply Blackmore 2 points 3 hours ago In 1969, I bought a 1963 Olds Delta Super 88 for $300 nd drove tht beast as my High school car. White with 394 four barrel carburetor which, one night out beat a corvette a 327 four barrel in a drag race on the Great Highway in San Francisco.It was a beast a small powerful ass kicken car lived it. permalink parent award report block reply\nBlackmore 2 points 3 hours ago In 1969, I bought a 1963 Olds Delta Super 88 for $300 nd drove tht beast as my High school car. White with 394 four barrel carburetor which, one night out beat a corvette a 327 four barrel in a drag race on the Great Highway in San Francisco.It was a beast a small powerful ass kicken car lived it. permalink parent award report block reply\nfriarfox 3 points 9 hours ago You could fill the tank for less than a pack of cigarettes today. permalink award report block reply\nSHILL_DETECTOR 2 points 9 hours ago teslas are fugly as fuck WHY permalink award report block reply Blackmore 1 points 3 hours ago Old school power muscle cars vs battery powered, I’d take the muscle car any day better and had class. permalink parent award report block reply PensivePatriot 1 points 8 hours ago Drag coefficients. permalink parent award report block reply SHILL_DETECTOR 1 points 8 hours ago right right because the batteries are so fucking heavy permalink parent award report block reply\nBlackmore 1 points 3 hours ago Old school power muscle cars vs battery powered, I’d take the muscle car any day better and had class. permalink parent award report block reply\nPensivePatriot 1 points 8 hours ago Drag coefficients. permalink parent award report block reply SHILL_DETECTOR 1 points 8 hours ago right right because the batteries are so fucking heavy permalink parent award report block reply\nSHILL_DETECTOR 1 points 8 hours ago right right because the batteries are so fucking heavy permalink parent award report block reply\nWizard_Glick 2 points 9 hours ago 460 hp, they were a beast! permalink award report block reply The1776Man 1 points 8 hours ago 450hp, and that's only if it was an LS6. permalink parent award report block reply Wizard_Glick 1 points 8 hours ago 454 rated at 450 horsepower, although it was identical to the Corvette LS6 rated at 460... permalink parent award report block reply\nThe1776Man 1 points 8 hours ago 450hp, and that's only if it was an LS6. permalink parent award report block reply Wizard_Glick 1 points 8 hours ago 454 rated at 450 horsepower, although it was identical to the Corvette LS6 rated at 460... permalink parent award report block reply\nWizard_Glick 1 points 8 hours ago 454 rated at 450 horsepower, although it was identical to the Corvette LS6 rated at 460... permalink parent award report block reply\nRetardloserimsogay 2 points 8 hours ago I am considering buying one 🤗 permalink award report block reply DonnieRamesJio 2 points 8 hours ago Get it on a lift before handing money over permalink parent award report block reply Retardloserimsogay 2 points 5 hours ago That's no joke, I been burned before on cheap buys... $5k. Chevelle like this is $60k plus. No worries though I did auto restoration professionally for over 15 years. permalink parent award report block reply\nDonnieRamesJio 2 points 8 hours ago Get it on a lift before handing money over permalink parent award report block reply Retardloserimsogay 2 points 5 hours ago That's no joke, I been burned before on cheap buys... $5k. Chevelle like this is $60k plus. No worries though I did auto restoration professionally for over 15 years. permalink parent award report block reply\nRetardloserimsogay 2 points 5 hours ago That's no joke, I been burned before on cheap buys... $5k. Chevelle like this is $60k plus. No worries though I did auto restoration professionally for over 15 years. permalink parent award report block reply\nAggrieved03 1 points 9 hours ago and twice the price permalink award report block reply"}