{"id": "1ARK514PGX", "contents": "395 Libs celebrate Mamdani election by shouting: “Sharia law starts now...\n\nThey've no idea what they're chanting for.\n\nImbeciles. posted 6 days ago by TrumpCare 53 comments award share report block Tommy Robinson 🇬🇧 @TRobinsonNewEra • 7d Libs celebrate Mamdani election by shouting: “Sharia law starts now... They've no idea what they're chanting for. Imbeciles.\n53 comments Sort by Top Top New Worst Old Save Deplorable_Citizen 20 points 6 days ago \"I don't care if I'm impacted, I just care that everyone else around me suffers too!\" - every leftist, 2025 permalink award report block reply SirPokeSmottington 2 points 6 days ago \"I don't care if I'm impacted, I just care that everyone else around me suffers too!\" - every leftist, 2025 Someone should have knocked her the fuck out and then said... I was tired of listening to a woman speak. - Sharia Law permalink parent award report block reply snoopy3210 1 points 6 days ago Btw on prop 50, republicans have many more seats to gain so she doesn’t see whats coming permalink parent award report block reply NewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply RudeFrog 16 points 6 days ago Women long to be forced back into the home. We didn't have the balls to do it so they vote for someone who will. Simple as permalink award report block reply rebuildingMyself 9 points 6 days ago Feminism was always a giant shit test against the men of society and we failed it generations ago when we let them have an equal say in our govt without the corresponding responsibility or accountability. permalink parent award report block reply LiquidSun 1 points 6 days ago Sadly this is the conclusion I'm coming to as well. permalink parent award report block reply Wexit-Delecto 14 points 6 days ago Letting them vote is a civilization-ending error. permalink award report block reply hairless_ap3 12 points 6 days ago Be awesome if some Middle Eastern man walked up and slapped the shit out of her and then made her put the fucking thing on permalink award report block reply YaharaRiver 4 points 6 days ago Like her husband? She is muslim and fyi, has a 25th wedding anniversary coming up.  Pls clap! permalink parent award report block reply Flubadub 12 points 6 days ago So you won’t be allowed to drive, get a job and you’ll have to cover your face? But Trump will bring about The Handmaid’s Tale? 🤔 permalink award report block reply RudeFrog 7 points 6 days ago You seem to be under the false impression that the handmaid's tale isn't a sexual fantasy they desire . It's basically rape porn permalink parent award report block reply Flubadub 3 points 6 days ago This is true permalink parent award report block reply SteelBallRun1890 1 points 6 days ago They all scream about how they don't want it but it's 100% part of the fantasy like you mentioned. permalink parent award report block reply orange_popcicle 0 points 6 days ago If you've read the Handmaid's Tale, you'll come to realize it was a cautionary tale about the Iranian Revolution. permalink parent award report block reply rebuildingMyself 2 points 6 days ago Christianity Bad, Anything Else Good. Its never been about inequality, it's just been about dismantling the foundations that put this country (and western civilization) at the top of the pile permalink parent award report block reply Jalapeno_gringo 12 points 6 days ago Wait until the duffle bags start falling from the tops of skyscrapers and they might have a change of heart permalink award report block reply hughjasske69 11 points 6 days ago A true muzzy wouldn't tolerate a mouthy little twat like this. permalink parent award report block reply LiquidSun 6 points 6 days ago True man* The Bible doesn't condone this sort of woman, either. It's not just Islam. permalink parent award report block reply Jalapeno_gringo 2 points 6 days ago Isn't it wonderful permalink parent award report block reply YaharaRiver 0 points 6 days ago 👉 HA!  This bitch IS a muslim!  Not only do they tolerate mouthy little twats like this, they RAISE THEM UP THAT WAY. She has released video of herself concerning converting to pisslam ☠️ https://patriots.win/p/1ARK5131xC/new-york-muslim-influencer-that-/c permalink parent award report block reply ThouShallNotSteal 6 points 6 days ago Man, I cannot wait for the violence against this bullshit to begin. permalink award report block reply Firespawn 5 points 6 days ago Think they'll celebrate like this after they get raped and beaten? permalink award report block reply rebuildingMyself 4 points 6 days ago Knowing how far they'll allow their cognitive dissonance to keep their views solid, they'll just not report the rape if it's not a white male doing it as to not encourage Islamophobia permalink parent award report block reply Firespawn 1 points 6 days ago Maybe they'll get stoned? permalink parent award report block reply CleanUpPhillyTrump24 5 points 6 days ago Dems are retarded. It's not exaggeration. Most AWFULs are basic bitches barely holding on. permalink award report block reply LiquidSun 4 points 6 days ago Women are begging for a show of real masculinity, and masculine rule. permalink award report block reply PearlyGaits57 3 points 6 days ago Get ready to give up most everything you have worked and strived to attain. Not to mention if you have any, your children as well. permalink award report block reply MR__K 3 points 6 days ago Over my dead body. permalink parent award report block reply gorilla_grip 3 points 6 days ago Part of me wants things to get real bad, real fast.  Like what we see in Muslim countries - executions in the streets and seizing assets and Muslim rape gangs and preventing people from fleeing and not letting girls attend schools and sewage running down the streets and zero tolerance for non Islamic people. permalink award report block reply YaharaRiver 0 points 6 days ago You won’t see that here, Gore&FilthLicker. Only in 7th century desert kingdoms, where females are kept as housepets and dogs are kicked in the ribs, is shit like that perfectly legal. permalink parent award report block reply gorilla_grip 1 points 6 days ago Ask girls and women in European countries overrun by muzzies if that stuff only happened in the 7th century permalink parent award report block reply MR__K 0 points 6 days ago New york new york. permalink parent award report block reply Beelzy 3 points 6 days ago Whoa, that was a LOT of retardation. permalink award report block reply YaharaRiver 1 points 6 days ago Propaganda recorded to trigger our sensibilities like this always gets that reaction 😂 Muslims can’t divide and conquer anymore.  Without lies, pisslam dies. permalink parent award report block reply SaxonRealm 2 points 6 days ago Under Sharia law, most of the Democrats would get wiped out. The entire LGBTQ+ community would all be beheaded permalink award report block reply Inukshuk 2 points 6 days ago The women in the bar should be caned. All of the women should be forced into their burkas or they should be whipped. Gays who voted for him should be very careful around tall buildings. Welcome to Sharia ladies. permalink award report block reply TruthWillOut 2 points 6 days ago \"The useful idiots.\" permalink award report block reply Sodak 2 points 6 days ago As a proud MAGA supporter I have to say I'm saddened and feel somewhat defeated right now, this was a huge loss. A fucking retard in some shithole lefty city was just elected to be MAYOR! MAYOR OF THE WHOLE FUCKING CITY! Whats next? Portland? San Francisco!? 🤣 Who gives a fuck lol. Let them go full retard. permalink award report block reply Bruno 1 points 6 days ago All white women that are probably on SSRI’s. permalink award report block reply Dev404 1 points 6 days ago These women cheer for genocide. They have no understanding of how anything works outside of Chad and Tyrone's dicks. permalink award report block reply jiminycricket1941 1 points 6 days ago I really hope it happens. Women need to be forcibly put back into the home. If the only way to do that is through a gay retarded religion, eh. permalink award report block reply corntortilla 1 points 6 days ago Stupid boomers. Oh wait. permalink award report block reply Thunderchicken 1 points 6 days ago Propaganda Capture isn't a theory, its a real thing. Not only do these fucks not have any self thinking skills for survival but they emotionally and gleefully welcome their own demise. We can't travel in the same boat with people that enthusiastically row for the waterfall. There is no hope for this sort of capture, this is mass mental illness. permalink award report block reply rebuildingMyself 2 points 6 days ago National divorce is looking better and better and seems to be inevitable at this point permalink parent award report block reply HockeyMom4Trump 1 points 6 days ago Oof. Video summary: Dumbasses who should be forced to wear a burka soon. Dumbass whose boomer MAGA parents need to enjoy their life, spend all their money, and cut this cunt completely out of the Will-hope they leave all their money to a MAGA candidate or cause. Forehead permalink award report block reply suckmycorona 1 points 6 days ago Fivehead permalink parent award report block reply elgordo 1 points 6 days ago I think they welcome it because they want to be controlled and dominated by it. permalink award report block reply spezholio 1 points 6 days ago Islam got it right about LGBT. permalink award report block reply Metta_World_KEK 1 points 6 days ago God i hate these people permalink award report block reply RudeFrog -2 points 6 days ago Tommy is pro zog permalink award report block reply\nDeplorable_Citizen 20 points 6 days ago \"I don't care if I'm impacted, I just care that everyone else around me suffers too!\" - every leftist, 2025 permalink award report block reply SirPokeSmottington 2 points 6 days ago \"I don't care if I'm impacted, I just care that everyone else around me suffers too!\" - every leftist, 2025 Someone should have knocked her the fuck out and then said... I was tired of listening to a woman speak. - Sharia Law permalink parent award report block reply snoopy3210 1 points 6 days ago Btw on prop 50, republicans have many more seats to gain so she doesn’t see whats coming permalink parent award report block reply NewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nSirPokeSmottington 2 points 6 days ago \"I don't care if I'm impacted, I just care that everyone else around me suffers too!\" - every leftist, 2025 Someone should have knocked her the fuck out and then said... I was tired of listening to a woman speak. - Sharia Law permalink parent award report block reply\nsnoopy3210 1 points 6 days ago Btw on prop 50, republicans have many more seats to gain so she doesn’t see whats coming permalink parent award report block reply\nNewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nRudeFrog 16 points 6 days ago Women long to be forced back into the home. We didn't have the balls to do it so they vote for someone who will. Simple as permalink award report block reply rebuildingMyself 9 points 6 days ago Feminism was always a giant shit test against the men of society and we failed it generations ago when we let them have an equal say in our govt without the corresponding responsibility or accountability. permalink parent award report block reply LiquidSun 1 points 6 days ago Sadly this is the conclusion I'm coming to as well. permalink parent award report block reply\nrebuildingMyself 9 points 6 days ago Feminism was always a giant shit test against the men of society and we failed it generations ago when we let them have an equal say in our govt without the corresponding responsibility or accountability. permalink parent award report block reply LiquidSun 1 points 6 days ago Sadly this is the conclusion I'm coming to as well. permalink parent award report block reply\nLiquidSun 1 points 6 days ago Sadly this is the conclusion I'm coming to as well. permalink parent award report block reply\nWexit-Delecto 14 points 6 days ago Letting them vote is a civilization-ending error. permalink award report block reply\nhairless_ap3 12 points 6 days ago Be awesome if some Middle Eastern man walked up and slapped the shit out of her and then made her put the fucking thing on permalink award report block reply YaharaRiver 4 points 6 days ago Like her husband? She is muslim and fyi, has a 25th wedding anniversary coming up.  Pls clap! permalink parent award report block reply\nYaharaRiver 4 points 6 days ago Like her husband? She is muslim and fyi, has a 25th wedding anniversary coming up.  Pls clap! permalink parent award report block reply\nFlubadub 12 points 6 days ago So you won’t be allowed to drive, get a job and you’ll have to cover your face? But Trump will bring about The Handmaid’s Tale? 🤔 permalink award report block reply RudeFrog 7 points 6 days ago You seem to be under the false impression that the handmaid's tale isn't a sexual fantasy they desire . It's basically rape porn permalink parent award report block reply Flubadub 3 points 6 days ago This is true permalink parent award report block reply SteelBallRun1890 1 points 6 days ago They all scream about how they don't want it but it's 100% part of the fantasy like you mentioned. permalink parent award report block reply orange_popcicle 0 points 6 days ago If you've read the Handmaid's Tale, you'll come to realize it was a cautionary tale about the Iranian Revolution. permalink parent award report block reply rebuildingMyself 2 points 6 days ago Christianity Bad, Anything Else Good. Its never been about inequality, it's just been about dismantling the foundations that put this country (and western civilization) at the top of the pile permalink parent award report block reply\nRudeFrog 7 points 6 days ago You seem to be under the false impression that the handmaid's tale isn't a sexual fantasy they desire . It's basically rape porn permalink parent award report block reply Flubadub 3 points 6 days ago This is true permalink parent award report block reply SteelBallRun1890 1 points 6 days ago They all scream about how they don't want it but it's 100% part of the fantasy like you mentioned. permalink parent award report block reply orange_popcicle 0 points 6 days ago If you've read the Handmaid's Tale, you'll come to realize it was a cautionary tale about the Iranian Revolution. permalink parent award report block reply\nFlubadub 3 points 6 days ago This is true permalink parent award report block reply\nSteelBallRun1890 1 points 6 days ago They all scream about how they don't want it but it's 100% part of the fantasy like you mentioned. permalink parent award report block reply\norange_popcicle 0 points 6 days ago If you've read the Handmaid's Tale, you'll come to realize it was a cautionary tale about the Iranian Revolution. permalink parent award report block reply\nrebuildingMyself 2 points 6 days ago Christianity Bad, Anything Else Good. Its never been about inequality, it's just been about dismantling the foundations that put this country (and western civilization) at the top of the pile permalink parent award report block reply\nJalapeno_gringo 12 points 6 days ago Wait until the duffle bags start falling from the tops of skyscrapers and they might have a change of heart permalink award report block reply hughjasske69 11 points 6 days ago A true muzzy wouldn't tolerate a mouthy little twat like this. permalink parent award report block reply LiquidSun 6 points 6 days ago True man* The Bible doesn't condone this sort of woman, either. It's not just Islam. permalink parent award report block reply Jalapeno_gringo 2 points 6 days ago Isn't it wonderful permalink parent award report block reply YaharaRiver 0 points 6 days ago 👉 HA!  This bitch IS a muslim!  Not only do they tolerate mouthy little twats like this, they RAISE THEM UP THAT WAY. She has released video of herself concerning converting to pisslam ☠️ https://patriots.win/p/1ARK5131xC/new-york-muslim-influencer-that-/c permalink parent award report block reply\nhughjasske69 11 points 6 days ago A true muzzy wouldn't tolerate a mouthy little twat like this. permalink parent award report block reply LiquidSun 6 points 6 days ago True man* The Bible doesn't condone this sort of woman, either. It's not just Islam. permalink parent award report block reply Jalapeno_gringo 2 points 6 days ago Isn't it wonderful permalink parent award report block reply YaharaRiver 0 points 6 days ago 👉 HA!  This bitch IS a muslim!  Not only do they tolerate mouthy little twats like this, they RAISE THEM UP THAT WAY. She has released video of herself concerning converting to pisslam ☠️ https://patriots.win/p/1ARK5131xC/new-york-muslim-influencer-that-/c permalink parent award report block reply\nLiquidSun 6 points 6 days ago True man* The Bible doesn't condone this sort of woman, either. It's not just Islam. permalink parent award report block reply\nJalapeno_gringo 2 points 6 days ago Isn't it wonderful permalink parent award report block reply\nYaharaRiver 0 points 6 days ago 👉 HA!  This bitch IS a muslim!  Not only do they tolerate mouthy little twats like this, they RAISE THEM UP THAT WAY. She has released video of herself concerning converting to pisslam ☠️ https://patriots.win/p/1ARK5131xC/new-york-muslim-influencer-that-/c permalink parent award report block reply\nThouShallNotSteal 6 points 6 days ago Man, I cannot wait for the violence against this bullshit to begin. permalink award report block reply\nFirespawn 5 points 6 days ago Think they'll celebrate like this after they get raped and beaten? permalink award report block reply rebuildingMyself 4 points 6 days ago Knowing how far they'll allow their cognitive dissonance to keep their views solid, they'll just not report the rape if it's not a white male doing it as to not encourage Islamophobia permalink parent award report block reply Firespawn 1 points 6 days ago Maybe they'll get stoned? permalink parent award report block reply\nrebuildingMyself 4 points 6 days ago Knowing how far they'll allow their cognitive dissonance to keep their views solid, they'll just not report the rape if it's not a white male doing it as to not encourage Islamophobia permalink parent award report block reply Firespawn 1 points 6 days ago Maybe they'll get stoned? permalink parent award report block reply\nFirespawn 1 points 6 days ago Maybe they'll get stoned? permalink parent award report block reply\nCleanUpPhillyTrump24 5 points 6 days ago Dems are retarded. It's not exaggeration. Most AWFULs are basic bitches barely holding on. permalink award report block reply\nLiquidSun 4 points 6 days ago Women are begging for a show of real masculinity, and masculine rule. permalink award report block reply\nPearlyGaits57 3 points 6 days ago Get ready to give up most everything you have worked and strived to attain. Not to mention if you have any, your children as well. permalink award report block reply MR__K 3 points 6 days ago Over my dead body. permalink parent award report block reply\nMR__K 3 points 6 days ago Over my dead body. permalink parent award report block reply\ngorilla_grip 3 points 6 days ago Part of me wants things to get real bad, real fast.  Like what we see in Muslim countries - executions in the streets and seizing assets and Muslim rape gangs and preventing people from fleeing and not letting girls attend schools and sewage running down the streets and zero tolerance for non Islamic people. permalink award report block reply YaharaRiver 0 points 6 days ago You won’t see that here, Gore&FilthLicker. Only in 7th century desert kingdoms, where females are kept as housepets and dogs are kicked in the ribs, is shit like that perfectly legal. permalink parent award report block reply gorilla_grip 1 points 6 days ago Ask girls and women in European countries overrun by muzzies if that stuff only happened in the 7th century permalink parent award report block reply MR__K 0 points 6 days ago New york new york. permalink parent award report block reply\nYaharaRiver 0 points 6 days ago You won’t see that here, Gore&FilthLicker. Only in 7th century desert kingdoms, where females are kept as housepets and dogs are kicked in the ribs, is shit like that perfectly legal. permalink parent award report block reply gorilla_grip 1 points 6 days ago Ask girls and women in European countries overrun by muzzies if that stuff only happened in the 7th century permalink parent award report block reply\ngorilla_grip 1 points 6 days ago Ask girls and women in European countries overrun by muzzies if that stuff only happened in the 7th century permalink parent award report block reply\nMR__K 0 points 6 days ago New york new york. permalink parent award report block reply\nBeelzy 3 points 6 days ago Whoa, that was a LOT of retardation. permalink award report block reply YaharaRiver 1 points 6 days ago Propaganda recorded to trigger our sensibilities like this always gets that reaction 😂 Muslims can’t divide and conquer anymore.  Without lies, pisslam dies. permalink parent award report block reply\nYaharaRiver 1 points 6 days ago Propaganda recorded to trigger our sensibilities like this always gets that reaction 😂 Muslims can’t divide and conquer anymore.  Without lies, pisslam dies. permalink parent award report block reply\nSaxonRealm 2 points 6 days ago Under Sharia law, most of the Democrats would get wiped out. The entire LGBTQ+ community would all be beheaded permalink award report block reply\nInukshuk 2 points 6 days ago The women in the bar should be caned. All of the women should be forced into their burkas or they should be whipped. Gays who voted for him should be very careful around tall buildings. Welcome to Sharia ladies. permalink award report block reply\nTruthWillOut 2 points 6 days ago \"The useful idiots.\" permalink award report block reply\nSodak 2 points 6 days ago As a proud MAGA supporter I have to say I'm saddened and feel somewhat defeated right now, this was a huge loss. A fucking retard in some shithole lefty city was just elected to be MAYOR! MAYOR OF THE WHOLE FUCKING CITY! Whats next? Portland? San Francisco!? 🤣 Who gives a fuck lol. Let them go full retard. permalink award report block reply\nBruno 1 points 6 days ago All white women that are probably on SSRI’s. permalink award report block reply\nDev404 1 points 6 days ago These women cheer for genocide. They have no understanding of how anything works outside of Chad and Tyrone's dicks. permalink award report block reply\njiminycricket1941 1 points 6 days ago I really hope it happens. Women need to be forcibly put back into the home. If the only way to do that is through a gay retarded religion, eh. permalink award report block reply\ncorntortilla 1 points 6 days ago Stupid boomers. Oh wait. permalink award report block reply\nThunderchicken 1 points 6 days ago Propaganda Capture isn't a theory, its a real thing. Not only do these fucks not have any self thinking skills for survival but they emotionally and gleefully welcome their own demise. We can't travel in the same boat with people that enthusiastically row for the waterfall. There is no hope for this sort of capture, this is mass mental illness. permalink award report block reply rebuildingMyself 2 points 6 days ago National divorce is looking better and better and seems to be inevitable at this point permalink parent award report block reply\nrebuildingMyself 2 points 6 days ago National divorce is looking better and better and seems to be inevitable at this point permalink parent award report block reply\nHockeyMom4Trump 1 points 6 days ago Oof. Video summary: Dumbasses who should be forced to wear a burka soon. Dumbass whose boomer MAGA parents need to enjoy their life, spend all their money, and cut this cunt completely out of the Will-hope they leave all their money to a MAGA candidate or cause. Forehead permalink award report block reply suckmycorona 1 points 6 days ago Fivehead permalink parent award report block reply\nsuckmycorona 1 points 6 days ago Fivehead permalink parent award report block reply\nelgordo 1 points 6 days ago I think they welcome it because they want to be controlled and dominated by it. permalink award report block reply\nspezholio 1 points 6 days ago Islam got it right about LGBT. permalink award report block reply\nMetta_World_KEK 1 points 6 days ago God i hate these people permalink award report block reply\nRudeFrog -2 points 6 days ago Tommy is pro zog permalink award report block reply"}