{"id": "1ARK9pgy4B", "contents": "10 Nose ring logic posted 37 minutes ago by Iranhasnukes 8 comments award share report block Anti Woke Memes @AntiWokeMemes • 2d What's the first thing that comes to mind when you see a woman with a nose ring? 😂\n8 comments Sort by Top Top New Worst Old Save FusionBlack 2 points 22 minutes ago The forehead stuck out more. permalink award report block reply NeverNotTrump 2 points 9 minutes ago That's a FIVEhead. permalink parent award report block reply Wizard_Glick 1 points 31 minutes ago Hogs... permalink award report block reply hellohellohellohell 1 points 18 minutes ago Where's a 9-Volt? permalink award report block reply empiretc 1 points 3 minutes ago we already knew she was a Hefer.... permalink award report block reply linthat22 1 points 34 minutes ago Fat, stupid takes, lives in a trailer, and the massive face taint piercing permalink award report block reply NeverNotTrump 1 points 9 minutes ago Padlock.  Every. Single. Time.  Same with stupid ear gauges. permalink award report block reply PatriotDescendant 1 points 32 minutes ago Found her!  Elsie!  She wandered off.  The herd is whole again. permalink award report block reply\nFusionBlack 2 points 22 minutes ago The forehead stuck out more. permalink award report block reply NeverNotTrump 2 points 9 minutes ago That's a FIVEhead. permalink parent award report block reply\nNeverNotTrump 2 points 9 minutes ago That's a FIVEhead. permalink parent award report block reply\nWizard_Glick 1 points 31 minutes ago Hogs... permalink award report block reply\nhellohellohellohell 1 points 18 minutes ago Where's a 9-Volt? permalink award report block reply\nempiretc 1 points 3 minutes ago we already knew she was a Hefer.... permalink award report block reply\nlinthat22 1 points 34 minutes ago Fat, stupid takes, lives in a trailer, and the massive face taint piercing permalink award report block reply\nNeverNotTrump 1 points 9 minutes ago Padlock.  Every. Single. Time.  Same with stupid ear gauges. permalink award report block reply\nPatriotDescendant 1 points 32 minutes ago Found her!  Elsie!  She wandered off.  The herd is whole again. permalink award report block reply"}