{"id": "1ARK9mHmZY", "contents": "205 All day, every day! posted 11 hours ago by wst4 6 comments award share download report block\n6 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style FreedomFlowerDelta 5 points 10 hours ago What an odd picture.  Does he have 2 wives and is her kitchen outside? permalink award report block reply AmarilloArmadillo 3 points 10 hours ago He's going to slam that football into the kids face. He's ded permalink parent award report block reply bidensmissingbrain 2 points 10 hours ago I’m becoming increasingly suspicious that posts like this are part of a propaganda/demoralization campaign against men. And they’re getting lazier with their efforts. permalink parent award report block reply Standingoak 1 points 6 hours ago He is throwing the ball to wifey 2's husband both are being defended by their son's.  Must be hard growing up without a father. permalink parent award report block reply Duster_340 3 points 8 hours ago Really? Cause White people aren’t having babies anymore, a lot of them are drugged out, killing themselves, died in overseas wars. This economy and situation is worse than what they’re telling us, no jobs for White people, all going towards H1B’s. Rich friends of the administration are living well though with there selling out of our country, and monopolies. permalink award report block reply chickeninoven 2 points 8 hours ago Why's dad dressed like a retard? permalink award report block reply\nFreedomFlowerDelta 5 points 10 hours ago What an odd picture.  Does he have 2 wives and is her kitchen outside? permalink award report block reply AmarilloArmadillo 3 points 10 hours ago He's going to slam that football into the kids face. He's ded permalink parent award report block reply bidensmissingbrain 2 points 10 hours ago I’m becoming increasingly suspicious that posts like this are part of a propaganda/demoralization campaign against men. And they’re getting lazier with their efforts. permalink parent award report block reply Standingoak 1 points 6 hours ago He is throwing the ball to wifey 2's husband both are being defended by their son's.  Must be hard growing up without a father. permalink parent award report block reply\nAmarilloArmadillo 3 points 10 hours ago He's going to slam that football into the kids face. He's ded permalink parent award report block reply\nbidensmissingbrain 2 points 10 hours ago I’m becoming increasingly suspicious that posts like this are part of a propaganda/demoralization campaign against men. And they’re getting lazier with their efforts. permalink parent award report block reply\nStandingoak 1 points 6 hours ago He is throwing the ball to wifey 2's husband both are being defended by their son's.  Must be hard growing up without a father. permalink parent award report block reply\nDuster_340 3 points 8 hours ago Really? Cause White people aren’t having babies anymore, a lot of them are drugged out, killing themselves, died in overseas wars. This economy and situation is worse than what they’re telling us, no jobs for White people, all going towards H1B’s. Rich friends of the administration are living well though with there selling out of our country, and monopolies. permalink award report block reply\nchickeninoven 2 points 8 hours ago Why's dad dressed like a retard? permalink award report block reply"}