{"id": "1ARK591S9h", "contents": "369 Welcome home, Capt. Scheurich - your service and sacrifice will never be forgotten posted 3 days ago by blue5707 7 comments award share report block Tommy Norman @OfficerNorman • 4d After exiting the plane yesterday in Norfolk, Virginia, after 57 years, U.S. Navy Capt. Thomas E Scheurich has finally returned home. Identified by the Defense POW/MIA Accounting Agency in April 2025, Capt. Scheurich was lost in 1968 during a Vietnam War mission. Yesterday ,\n7 comments Sort by Top Top New Worst Old Save thid 12 points 3 days ago RIP Patriot permalink award report block reply DemonicSoap 4 points 3 days ago I'm a fucking dumb ass... I read the post before watching and was trying to figure out how a dude was just lost in Vietnam for 57 years, who found him and told him \"bro you gotta go home\" ... did not realize he was dead.... until I saw your post. RIP Captain. permalink parent award report block reply FusionBlack 10 points 3 days ago Welcome home sir. It's hard to believe it's been that long ago. permalink award report block reply Wizard_Glick 7 points 3 days ago Lo, there do I see my father. Lo, there do I see my mother, and my sisters, and my brothers. Lo, there do I see the line of my people, Back to the beginning! Lo, they do call to me. They bid me take my place among them, In the halls of Valhalla! Where the brave may live forever! permalink award report block reply MrJinxy 3 points 3 days ago We dearly love our service men and women. Thank you, sir. permalink award report block reply barwhack 3 points 3 days ago All honor to this patriot. Never forget is a nice sentiment. permalink award report block reply txladyvoter 5 points 3 days ago Never forget. God bless those who have served on earth and in heaven. permalink parent award report block reply\nthid 12 points 3 days ago RIP Patriot permalink award report block reply DemonicSoap 4 points 3 days ago I'm a fucking dumb ass... I read the post before watching and was trying to figure out how a dude was just lost in Vietnam for 57 years, who found him and told him \"bro you gotta go home\" ... did not realize he was dead.... until I saw your post. RIP Captain. permalink parent award report block reply\nDemonicSoap 4 points 3 days ago I'm a fucking dumb ass... I read the post before watching and was trying to figure out how a dude was just lost in Vietnam for 57 years, who found him and told him \"bro you gotta go home\" ... did not realize he was dead.... until I saw your post. RIP Captain. permalink parent award report block reply\nFusionBlack 10 points 3 days ago Welcome home sir. It's hard to believe it's been that long ago. permalink award report block reply\nWizard_Glick 7 points 3 days ago Lo, there do I see my father. Lo, there do I see my mother, and my sisters, and my brothers. Lo, there do I see the line of my people, Back to the beginning! Lo, they do call to me. They bid me take my place among them, In the halls of Valhalla! Where the brave may live forever! permalink award report block reply\nMrJinxy 3 points 3 days ago We dearly love our service men and women. Thank you, sir. permalink award report block reply\nbarwhack 3 points 3 days ago All honor to this patriot. Never forget is a nice sentiment. permalink award report block reply txladyvoter 5 points 3 days ago Never forget. God bless those who have served on earth and in heaven. permalink parent award report block reply\ntxladyvoter 5 points 3 days ago Never forget. God bless those who have served on earth and in heaven. permalink parent award report block reply"}