{"id": "1ARK5A9ZMO", "contents": "1301 BREAKING: At least TEN Senate Democrats are expected to vote in favor of a “short term funding measure” today to END the Schumer Shutdown, per Axios posted 3 days ago by _C_I_A_ 112 comments award share download report block\n112 comments Sort by Top Top New Worst Old Save mattytr 116 points 3 days ago No money for illegals. No money for \"foreign aid\". The only people who should be getting American money are the Americans. permalink award report block reply BigMikesSwingingCock 65 points 3 days ago The only money I support going towards illegals is the cost to GET THEM THE FUCK OUT OF OUR COUNTRY!! permalink parent award report block reply Datamancer 8 points 3 days ago Shouldn't be too expensive to build a trebuchet and paint some targets on the other side of the border. PPV and make the money back 1000x permalink parent award report block reply 2016TrumpMAGA 2 points 3 days ago Make it a competition for accuracy and allow gambling, and make the money back 100,000X. permalink parent award report block reply MegoThor 1 points 3 days ago Rope is cheap and be used multiple times permalink parent award report block reply Mean_MAGA_Facka 32 points 3 days ago Trump can still veto any BS and he does appear to be in a mood to do so. permalink parent award report block reply DiamondDroid 13 points 3 days ago Good! permalink parent award report block reply goldkeyboardwarrior 6 points 3 days ago He could but unless it’s absolute trash I doubt it because he’s not trying to see all of the airports shut down during Thanksgiving weekend and being the one blamed for it. I know a lot of people here won’t care if their families are in driving distance but that doesn’t apply to a large part of the country. Air traffic controllers and TSA being on the verge of revolting after not getting paid for a month is a big reason the last shutdown ended. permalink parent award report block reply trumpORbust 9 points 3 days ago At much as I hate the concept, airport should be essential and get paid in shutdown ++military permalink parent award report block reply TravisRSCX 7 points 3 days ago 100+ this… air traffic control is too vital for our country to be reliant on the government. It should definitely be a requirement for them to be paid and funded by the airports/airplane companies. If USPS can be paid during this whole time they can be paid too. permalink parent award report block reply itspancakees 8 points 3 days ago There should be strings attached now. The old offer is the old offer. The new offer should be painful. Defund liberal cities permalink parent award report block reply Transparency 2 points 3 days ago No money for illegals. Just a fat envelope for those 10 Dems. permalink parent award report block reply NotYourMan 2 points 3 days ago I agree!  DEPORT!  But if they can remove all the entitlements from illegal aliens then they will leave the country.  Most are here for the free stuff.  Democrats betrayed the people and the constitution! permalink parent award report block reply load 2 more comments... MemeWarsVet 65 points 3 days ago They're all shit.  Thune, Chuck, all of 'em. permalink award report block reply DebunkTheLeft 37 points 3 days ago I wonder how the republicans will pull defeat defeat from the jaws of victory? They have to get creative on this one with their excuses. permalink parent award report block reply Moose_Antlers 19 points 3 days ago Easy. Take the CR until Christmas time, then when the Dems play chicken again in December and call everyone Scrooge, then cave to show your holiday spirit. This is standard operating procedure from these as..hats for the last 30 years. This is how we got Obamacare, if that offers some perspective on how long this business has been going on. Both parties. Doesn't matter who has the WH. They all do it. Uniparty. And Trump's still got far too few allies to plow through. permalink parent award report block reply alfredbester 4 points 3 days ago This is the sad truth. It's all a giant steaming pile of bullshit and I'm sick of acting like all these fuckers didn't steal my money my whole life. Fuck that. I want these fuckers in jail. permalink parent award report block reply MastaJoda 2 points 3 days ago lol Trump endorsed all of his RINO backstabbers, even after they repeatedly stabbed him in the face. permalink parent award report block reply SanityGumby 0 points 3 days ago No he didn’t. He didn’t endorse Rand Paul or Massie. permalink parent award report block reply view 2 more comments... tired-of-crap 1 points 3 days ago The current CR is only until Right before thanksgiving.  It would require a trip back to the house to change that. permalink parent award report block reply Simple_Doot 8 points 3 days ago They can do whatever they want and then just manipulate the masses into hatred of someone else so that they are distracted and the puppet masters stay in power.  One would figure the whole Epstein about-face would have started a rebellion against the current administration.  Then Trump was like \"its fake, and also anyone who disagrees is stupid\" and that was it.  This board instantly abandoned the most prolific blackmailing operation in human history and fell inline instantly - thats fucking power in its purest form. permalink parent award report block reply Dangerous 5 points 3 days ago They already did. This current result isn't some victory for us at all permalink parent award report block reply grad16uc 1 points 3 days ago Jaws of victory? This CR is already a loss. The only question we're debating is how hard we get fucked. permalink parent award report block reply anotherthing 1 points 2 days ago You're being downvoted by the people who are going to be completely surprised when the dollar finally collapses under the weight of the National debt. They're the same people that might know that the Japanese Yen is in the shitter, but never bothered to look at their national debt to GDP ration. permalink parent award report block reply politicsaside 3 points 3 days ago All of em. They need to go nuclear and pass Trump’s agenda asap. Wtf is wrong with these asshats. permalink parent award report block reply MemeWarsVet 3 points 3 days ago Uniparty. permalink parent award report block reply SeamusOtardy 2 points 3 days ago Look at that photo. Friggin’ larpers. permalink parent award report block reply GuerillaYourDreams 32 points 3 days ago Everyone in Congress is a snake. Prove me wrong. permalink award report block reply TheAftermath 17 points 3 days ago 535 traitors operating in a casino-whorehouse combo. permalink parent award report block reply GuerillaYourDreams 7 points 3 days ago Indeed. permalink parent award report block reply TheAftermath 5 points 3 days ago The sordid truth, friend. Always has been.jpg. permalink parent award report block reply Thereyago 2 points 3 days ago Massie and Rand aren't,  they told me so! permalink parent award report block reply Fundadores 1 points 3 days ago Hey! The ones speaking up about our rigged elections are not that bad. Let me get my list… I think MTG is on here. Anyone else? permalink parent award report block reply Cianevalies 16 points 3 days ago The Dems have chosen 10 to take the hit from the leftwing nut jobs and save schumer . It’s all political nonsense as the longer it goes on the more pressure the republicans get to nuke the filibuster. Something the Dems will do once they return to senate control. permalink award report block reply brainphreeze 6 points 3 days ago It's the theater that angers the most, every single decision driven by politics and votes rather than what is right permalink parent award report block reply lixa 1 points 3 days ago Not wanting the right to pass legislation is why the democrats gave in permalink parent award report block reply Counterwhat 14 points 3 days ago What a loser Thune is. We lost all those state elections, seats and offices for nothing if he gives in to this turd. I'll say it again the the GOP are the Washington generals watching the globetrotters dribble up and down the court before being embarrassingly tea bag dunked on to an embarrassingly bad loss. permalink award report block reply MastaJoda 3 points 3 days ago Jokes on you, they love tea bags. permalink parent award report block reply MythArcana 14 points 3 days ago Yeah, Senate Democrat Majority Leader Thune better stop screwing us over right now. permalink award report block reply songman727 5 points 3 days ago Time for a sternly-worded letter... permalink parent award report block reply ingrowntoenail 0 points 3 days ago In two weeks. permalink parent award report block reply Landslide_2020 11 points 3 days ago Yea.  Is there any word on whether Thune had to give the Dems anything in return for their vote?  If there really is going to be a vote? permalink award report block reply WhiteBoySummer 8 points 3 days ago They wouldn’t be onboard if it didn’t include free money & healthcare for illegals permalink parent award report block reply Klaus73 2 points 3 days ago Apparently this funds stuff until Jan 31st at which point we can be back here. This also ensures SNAP and VA are funded until the end of the year and requires a vote on the ACA stuff before the end of this year. permalink parent award report block reply Coprolite 11 points 3 days ago Keep it shut down. permalink award report block reply Moose_Antlers 7 points 3 days ago If I understand this correctly, it's a clean CR. CR = continuing resolution. The bill authorizes current Biden era spending levels to continue into December to allow more time to negotiate. Speaker Johnson has offered this since September. It's been sitting in the Senate waiting for Schumer to ok it this long. ------ How this will work ------ This will work the same way it does every damn year we do this. Dems are going to hold out until Christmas when everyone's feeling generous and wants to be home with their families. Then Schumer's going to make wild demands and hold the government hostage and tell them they can't celebrate Christmas until they vote. The Republicans will cave and Dems get to play Santa Claus to illegals once again with our money because the GOP is too afraid to FIGHT. If the GOP decides to show some spine, the best we'll get at the end of that stunt is another CR to get us to March, and we'll do the same game of chicken again, this time with tax season looming and businesses screaming demanding certainty in the laws so they can plan their budgets. Then the donors get involved in the pressure campaign. And usually the GOP will cave because they're too afraid to FIGHT. permalink award report block reply victory2024 9 points 3 days ago \"Biden era spending levels\" -- so funding illegals will continue? permalink parent award report block reply KekistanPM 4 points 3 days ago If congressmen and senators didn't get paid during a shutdown, you can be sure the government would be open right now. permalink parent award report block reply Dangerous -2 points 3 days ago The GOP isn't afraid. This is the exact result AIPAC wants, because a functional independent USA lead by its own citizens success is dangerous to their designs permalink parent award report block reply Spacemonkey 5 points 3 days ago Just my opinion here but any politician who even suggests legislation that would give illegal aliens anything other than a swift boot up their asses out of our country should immediately be tried for treason and if found guilty carted outside and hanged publicly that goes for Republicans as well as democrats. permalink award report block reply Hanging_Chad 4 points 3 days ago why is this causing crypto to go up? 📈 permalink award report block reply BreakingCNN 4 points 3 days ago What kind of a tulip bulb is this crypto? Is it some new hybrid, GMO, or did they use that gout medication on it Colchicine? permalink parent award report block reply Hanging_Chad 3 points 3 days ago not sure, but now’s a good time to plant them permalink parent award report block reply BreakingCNN 2 points 3 days ago Yeah, I'm going to run out and buy some of them halogen lights so I can grow them at nights? permalink parent award report block reply Klaus73 2 points 3 days ago https://www.coindesk.com/markets/2025/11/09/crypto-prices-rise-as-trump-announces-at-least-usd2k-tariff-dividend He is trying to bribe Americans with their own money. permalink parent award report block reply Hanging_Chad 2 points 3 days ago na, trying to get SCOTUS to rule in his favor. if they don’t, then people finna be mad at SCOTUS permalink parent award report block reply Thereyago 2 points 3 days ago Well, he's kinda disproving its a \"tax\" which is the BS \"principled\" argument being tossed around. permalink parent award report block reply Klaus73 2 points 3 days ago People are always mad at SCOTUS when they rule against someone; don't see this changing much. permalink parent award report block reply Induceddrag 4 points 3 days ago There is none of this meant to help Americans. This is all politics.  The democrats would prefer the American people be miserable, as long as they blame republicans.  If democrats vote for the CR it will be because Schumer told them it was ok. permalink award report block reply RedWave26 4 points 3 days ago Thune is a traitor. Always has been. permalink award report block reply Dangerous 1 points 3 days ago The entire GOP are treacherous snakes, except for the ones calling them out And the ones calling the GOP out are all on AIPACs shitlist so Trump attacks them while endorsing Thune and Lady Lindsey permalink parent award report block reply Cali_kid 4 points 3 days ago People are starting to blame the Dems, the republicans took a big LOSS. President Trump no one is on Truth social post on X permalink award report block reply KernalMustard 2 points 3 days ago Sure they are... what ever you tell yourself. permalink parent award report block reply SanityGumby 1 points 3 days ago Polling shows no one ever blamed anyone but democrats permalink parent award report block reply stripperlover 4 points 3 days ago incoming GOP cuck out!! permalink award report block reply FlgPole 4 points 3 days ago vote to end schumers career permalink award report block reply DeplorableLA 3 points 3 days ago Excellent.  Good move by Thune to keep the Senate in session, limits the amount of camera chasing by the shifty Dems. permalink award report block reply Bythrfruitsyknow 10 points 3 days ago Also it stops President Trump from being able to make any recess appointments. The real reason Thune is doing it. permalink parent award report block reply DeplorableLA 1 points 3 days ago Bummer that, for sure.  Thanks for the reminder. permalink parent award report block reply mass55th 3 points 3 days ago No short term horseshit. We'll be going through this shit again in a few months. Get the fucking job done Thune, or get the fuck out of the way. permalink award report block reply hitchhiker 3 points 3 days ago Thought we’d be going through it again on the 21st permalink parent award report block reply utfanx2 3 points 3 days ago Trump promised to never sign another Omnibus. Veto it all. permalink award report block reply American-Patriot 3 points 3 days ago Fuck them and fuck that.\nWe need to contact our republican senators and tell them to support going dully nuclear!! Stop making deals with the devil's party!!! permalink award report block reply throttlejohnson 2 points 3 days ago i don't care. honestly. let it burn to the fucking ground. everytime these motherfuckers vote on something and pass it, it is filled with bullshit and unnecessary waste. fuck them. have a nice Sunday. permalink award report block reply DiamondDroid 2 points 3 days ago Are we there yet? permalink award report block reply donteatthat 1 points 3 days ago GOD DAMNIT I WILL TURN THIS CAR AROUND permalink parent award report block reply MrMcGreenGenes 2 points 3 days ago Well, Schitt. permalink award report block reply Comeon4954 2 points 3 days ago Whatever happened to us hoping that thing that could happen on Day 41 would happen? permalink award report block reply terribletwos 2 points 3 days ago Remove the CR as an option, make them pass each 12 annual appropriation bill separately. Do this by force through the majority. permalink award report block reply Oldman1234 1 points 3 days ago Was there any doubt that Thune and the other RINO Senators would cave to the Democrats? permalink award report block reply Bldg_2019 1 points 3 days ago Don’t do it. Press the demtards into the holidays. PAST Thanksgiving at least. permalink award report block reply Obambi 1 points 3 days ago Schumer always a J involved in everything bad permalink award report block reply SanityGumby 1 points 3 days ago Well today is over… permalink award report block reply MajorClark 1 points 3 days ago These corrupt democrats have made millions off of Obamacare while throwing the tax payers into a dam near depression!   Give them nothing!   People aren't gonna forget this in the near future. permalink award report block reply rivetjoint2 1 points 3 days ago Open at the grotesque Biden spending levels.  Whatever.  If they can’t get that over the line - how on earth does the senate think it will pass the real spending bills if they even slow the growth of spending (under baseline budgeting even holding spending to the same amount is a massive cut - according to dc retard accounting). Just nuke the silent filibuster already.  Ban the mail in fraud, the machines and count the paper ballots with id required.  Make Election Day a federal holiday.  Recall when Nancy ran the house her h1 bill was mandatory mail in ballots! permalink award report block reply Znut55 1 points 3 days ago Guessing they are Dems that are in red states or Trump territory. permalink award report block reply SaltiTaralli 1 points 3 days ago Did the administration permanently lay off all those thousands of people we were told would be fired because the shut down made it possible and legal?????????? I haven't heard a damn thing about this in weeks. permalink award report block reply GreazyCheeks 2 points 3 days ago No. Bloated government remains. permalink parent award report block reply Logan051361 1 points 3 days ago As far as know, this bill is clean. permalink award report block reply Emodius 1 points 3 days ago DO NOT GIVE THEM ONE INCH! permalink award report block reply CorvettePatriot 1 points 3 days ago I hope not! permalink award report block reply Aggrieved03 1 points 3 days ago They used it perfectly! Put doubt in people’s minds that the shutdown had everyone voting blue even though the polls predicted just the opposite. Masterfully played by Schumer and the media rolled right with it and no one looks for the fraud. permalink award report block reply ChilledCovfefe 3 points 3 days ago They own the media, we always lose playing brinksmanship with shutdowns.  Every time. permalink parent award report block reply TheSonOfGadsden 1 points 3 days ago I’ll be shocked if the RINO fag doesn’t give any concessions permalink award report block reply AwShitHereWeGoAgain 1 points 3 days ago RINOs are gonna stab us in the fucking back yet again. permalink award report block reply ACActual 1 points 3 days ago If the GOP hands the Communist their midterms rescue im out permalink award report block reply hey_spike 1 points 3 days ago Do not reward the dems nasty behavior. permalink award report block reply KernalMustard 1 points 3 days ago So what are republicans giving up? permalink award report block reply Be_The_Change 1 points 3 days ago Republicans caved; again. permalink award report block reply songman727 2 points 3 days ago Diddled by the dangling dong of Destiny... permalink parent award report block reply Datamancer 1 points 3 days ago Fuck that.  All or nothing.   No money of any type for illegals. Any section 8 that cannot prove citizenship by the end of the month stops getting money December 1st. Any school receiving federal money for meals that cannot show that all children come from citizen households by the end of the month stops getting money December 1st. Any bank that cannot show that all account holders have legal status in the US by the end of the month are red-lined and removed from FDIC programs on December 1st. All lenders who cannot prove that a creditor in collection is a US citizen by the end of the month will be barred from seeking relief in federal court. All states that do not provide full SNAP accounting by the end of the month lose all SNAP payments. All states that do not provide full commercial and non-commercial driver's licenses audit by the end of the month lose all federal highway matching funds. Merry Christmas America. For Christmas you are getting a parasite removal program. permalink award report block reply DingleBalls 0 points 3 days ago Better be a CLEAN CR (it won't be) permalink award report block reply RolandDelacroix 0 points 3 days ago They're gonna keep extending until the midterms so they can beat on Republicans with it.  The republicans are fools to accept this. permalink award report block reply Thelongarm 0 points 3 days ago Why do you think they are voting for a short term act? Thune caved. permalink award report block reply DITTOPatriot 0 points 3 days ago And they will back pay all those that didn’t work a minute. Release the Epstein files. permalink award report block reply RedCalifornia -1 points 3 days ago Can’t wait to see how many billions go to our greatest allies permalink award report block reply\nmattytr 116 points 3 days ago No money for illegals. No money for \"foreign aid\". The only people who should be getting American money are the Americans. permalink award report block reply BigMikesSwingingCock 65 points 3 days ago The only money I support going towards illegals is the cost to GET THEM THE FUCK OUT OF OUR COUNTRY!! permalink parent award report block reply Datamancer 8 points 3 days ago Shouldn't be too expensive to build a trebuchet and paint some targets on the other side of the border. PPV and make the money back 1000x permalink parent award report block reply 2016TrumpMAGA 2 points 3 days ago Make it a competition for accuracy and allow gambling, and make the money back 100,000X. permalink parent award report block reply MegoThor 1 points 3 days ago Rope is cheap and be used multiple times permalink parent award report block reply Mean_MAGA_Facka 32 points 3 days ago Trump can still veto any BS and he does appear to be in a mood to do so. permalink parent award report block reply DiamondDroid 13 points 3 days ago Good! permalink parent award report block reply goldkeyboardwarrior 6 points 3 days ago He could but unless it’s absolute trash I doubt it because he’s not trying to see all of the airports shut down during Thanksgiving weekend and being the one blamed for it. I know a lot of people here won’t care if their families are in driving distance but that doesn’t apply to a large part of the country. Air traffic controllers and TSA being on the verge of revolting after not getting paid for a month is a big reason the last shutdown ended. permalink parent award report block reply trumpORbust 9 points 3 days ago At much as I hate the concept, airport should be essential and get paid in shutdown ++military permalink parent award report block reply TravisRSCX 7 points 3 days ago 100+ this… air traffic control is too vital for our country to be reliant on the government. It should definitely be a requirement for them to be paid and funded by the airports/airplane companies. If USPS can be paid during this whole time they can be paid too. permalink parent award report block reply itspancakees 8 points 3 days ago There should be strings attached now. The old offer is the old offer. The new offer should be painful. Defund liberal cities permalink parent award report block reply Transparency 2 points 3 days ago No money for illegals. Just a fat envelope for those 10 Dems. permalink parent award report block reply NotYourMan 2 points 3 days ago I agree!  DEPORT!  But if they can remove all the entitlements from illegal aliens then they will leave the country.  Most are here for the free stuff.  Democrats betrayed the people and the constitution! permalink parent award report block reply load 2 more comments...\nBigMikesSwingingCock 65 points 3 days ago The only money I support going towards illegals is the cost to GET THEM THE FUCK OUT OF OUR COUNTRY!! permalink parent award report block reply Datamancer 8 points 3 days ago Shouldn't be too expensive to build a trebuchet and paint some targets on the other side of the border. PPV and make the money back 1000x permalink parent award report block reply 2016TrumpMAGA 2 points 3 days ago Make it a competition for accuracy and allow gambling, and make the money back 100,000X. permalink parent award report block reply MegoThor 1 points 3 days ago Rope is cheap and be used multiple times permalink parent award report block reply\nDatamancer 8 points 3 days ago Shouldn't be too expensive to build a trebuchet and paint some targets on the other side of the border. PPV and make the money back 1000x permalink parent award report block reply 2016TrumpMAGA 2 points 3 days ago Make it a competition for accuracy and allow gambling, and make the money back 100,000X. permalink parent award report block reply MegoThor 1 points 3 days ago Rope is cheap and be used multiple times permalink parent award report block reply\n2016TrumpMAGA 2 points 3 days ago Make it a competition for accuracy and allow gambling, and make the money back 100,000X. permalink parent award report block reply\nMegoThor 1 points 3 days ago Rope is cheap and be used multiple times permalink parent award report block reply\nMean_MAGA_Facka 32 points 3 days ago Trump can still veto any BS and he does appear to be in a mood to do so. permalink parent award report block reply DiamondDroid 13 points 3 days ago Good! permalink parent award report block reply goldkeyboardwarrior 6 points 3 days ago He could but unless it’s absolute trash I doubt it because he’s not trying to see all of the airports shut down during Thanksgiving weekend and being the one blamed for it. I know a lot of people here won’t care if their families are in driving distance but that doesn’t apply to a large part of the country. Air traffic controllers and TSA being on the verge of revolting after not getting paid for a month is a big reason the last shutdown ended. permalink parent award report block reply trumpORbust 9 points 3 days ago At much as I hate the concept, airport should be essential and get paid in shutdown ++military permalink parent award report block reply TravisRSCX 7 points 3 days ago 100+ this… air traffic control is too vital for our country to be reliant on the government. It should definitely be a requirement for them to be paid and funded by the airports/airplane companies. If USPS can be paid during this whole time they can be paid too. permalink parent award report block reply\nDiamondDroid 13 points 3 days ago Good! permalink parent award report block reply\ngoldkeyboardwarrior 6 points 3 days ago He could but unless it’s absolute trash I doubt it because he’s not trying to see all of the airports shut down during Thanksgiving weekend and being the one blamed for it. I know a lot of people here won’t care if their families are in driving distance but that doesn’t apply to a large part of the country. Air traffic controllers and TSA being on the verge of revolting after not getting paid for a month is a big reason the last shutdown ended. permalink parent award report block reply trumpORbust 9 points 3 days ago At much as I hate the concept, airport should be essential and get paid in shutdown ++military permalink parent award report block reply TravisRSCX 7 points 3 days ago 100+ this… air traffic control is too vital for our country to be reliant on the government. It should definitely be a requirement for them to be paid and funded by the airports/airplane companies. If USPS can be paid during this whole time they can be paid too. permalink parent award report block reply\ntrumpORbust 9 points 3 days ago At much as I hate the concept, airport should be essential and get paid in shutdown ++military permalink parent award report block reply TravisRSCX 7 points 3 days ago 100+ this… air traffic control is too vital for our country to be reliant on the government. It should definitely be a requirement for them to be paid and funded by the airports/airplane companies. If USPS can be paid during this whole time they can be paid too. permalink parent award report block reply\nTravisRSCX 7 points 3 days ago 100+ this… air traffic control is too vital for our country to be reliant on the government. It should definitely be a requirement for them to be paid and funded by the airports/airplane companies. If USPS can be paid during this whole time they can be paid too. permalink parent award report block reply\nitspancakees 8 points 3 days ago There should be strings attached now. The old offer is the old offer. The new offer should be painful. Defund liberal cities permalink parent award report block reply\nTransparency 2 points 3 days ago No money for illegals. Just a fat envelope for those 10 Dems. permalink parent award report block reply\nNotYourMan 2 points 3 days ago I agree!  DEPORT!  But if they can remove all the entitlements from illegal aliens then they will leave the country.  Most are here for the free stuff.  Democrats betrayed the people and the constitution! permalink parent award report block reply\nMemeWarsVet 65 points 3 days ago They're all shit.  Thune, Chuck, all of 'em. permalink award report block reply DebunkTheLeft 37 points 3 days ago I wonder how the republicans will pull defeat defeat from the jaws of victory? They have to get creative on this one with their excuses. permalink parent award report block reply Moose_Antlers 19 points 3 days ago Easy. Take the CR until Christmas time, then when the Dems play chicken again in December and call everyone Scrooge, then cave to show your holiday spirit. This is standard operating procedure from these as..hats for the last 30 years. This is how we got Obamacare, if that offers some perspective on how long this business has been going on. Both parties. Doesn't matter who has the WH. They all do it. Uniparty. And Trump's still got far too few allies to plow through. permalink parent award report block reply alfredbester 4 points 3 days ago This is the sad truth. It's all a giant steaming pile of bullshit and I'm sick of acting like all these fuckers didn't steal my money my whole life. Fuck that. I want these fuckers in jail. permalink parent award report block reply MastaJoda 2 points 3 days ago lol Trump endorsed all of his RINO backstabbers, even after they repeatedly stabbed him in the face. permalink parent award report block reply SanityGumby 0 points 3 days ago No he didn’t. He didn’t endorse Rand Paul or Massie. permalink parent award report block reply view 2 more comments... tired-of-crap 1 points 3 days ago The current CR is only until Right before thanksgiving.  It would require a trip back to the house to change that. permalink parent award report block reply Simple_Doot 8 points 3 days ago They can do whatever they want and then just manipulate the masses into hatred of someone else so that they are distracted and the puppet masters stay in power.  One would figure the whole Epstein about-face would have started a rebellion against the current administration.  Then Trump was like \"its fake, and also anyone who disagrees is stupid\" and that was it.  This board instantly abandoned the most prolific blackmailing operation in human history and fell inline instantly - thats fucking power in its purest form. permalink parent award report block reply Dangerous 5 points 3 days ago They already did. This current result isn't some victory for us at all permalink parent award report block reply grad16uc 1 points 3 days ago Jaws of victory? This CR is already a loss. The only question we're debating is how hard we get fucked. permalink parent award report block reply anotherthing 1 points 2 days ago You're being downvoted by the people who are going to be completely surprised when the dollar finally collapses under the weight of the National debt. They're the same people that might know that the Japanese Yen is in the shitter, but never bothered to look at their national debt to GDP ration. permalink parent award report block reply politicsaside 3 points 3 days ago All of em. They need to go nuclear and pass Trump’s agenda asap. Wtf is wrong with these asshats. permalink parent award report block reply MemeWarsVet 3 points 3 days ago Uniparty. permalink parent award report block reply SeamusOtardy 2 points 3 days ago Look at that photo. Friggin’ larpers. permalink parent award report block reply\nDebunkTheLeft 37 points 3 days ago I wonder how the republicans will pull defeat defeat from the jaws of victory? They have to get creative on this one with their excuses. permalink parent award report block reply Moose_Antlers 19 points 3 days ago Easy. Take the CR until Christmas time, then when the Dems play chicken again in December and call everyone Scrooge, then cave to show your holiday spirit. This is standard operating procedure from these as..hats for the last 30 years. This is how we got Obamacare, if that offers some perspective on how long this business has been going on. Both parties. Doesn't matter who has the WH. They all do it. Uniparty. And Trump's still got far too few allies to plow through. permalink parent award report block reply alfredbester 4 points 3 days ago This is the sad truth. It's all a giant steaming pile of bullshit and I'm sick of acting like all these fuckers didn't steal my money my whole life. Fuck that. I want these fuckers in jail. permalink parent award report block reply MastaJoda 2 points 3 days ago lol Trump endorsed all of his RINO backstabbers, even after they repeatedly stabbed him in the face. permalink parent award report block reply SanityGumby 0 points 3 days ago No he didn’t. He didn’t endorse Rand Paul or Massie. permalink parent award report block reply view 2 more comments... tired-of-crap 1 points 3 days ago The current CR is only until Right before thanksgiving.  It would require a trip back to the house to change that. permalink parent award report block reply Simple_Doot 8 points 3 days ago They can do whatever they want and then just manipulate the masses into hatred of someone else so that they are distracted and the puppet masters stay in power.  One would figure the whole Epstein about-face would have started a rebellion against the current administration.  Then Trump was like \"its fake, and also anyone who disagrees is stupid\" and that was it.  This board instantly abandoned the most prolific blackmailing operation in human history and fell inline instantly - thats fucking power in its purest form. permalink parent award report block reply Dangerous 5 points 3 days ago They already did. This current result isn't some victory for us at all permalink parent award report block reply grad16uc 1 points 3 days ago Jaws of victory? This CR is already a loss. The only question we're debating is how hard we get fucked. permalink parent award report block reply anotherthing 1 points 2 days ago You're being downvoted by the people who are going to be completely surprised when the dollar finally collapses under the weight of the National debt. They're the same people that might know that the Japanese Yen is in the shitter, but never bothered to look at their national debt to GDP ration. permalink parent award report block reply\nMoose_Antlers 19 points 3 days ago Easy. Take the CR until Christmas time, then when the Dems play chicken again in December and call everyone Scrooge, then cave to show your holiday spirit. This is standard operating procedure from these as..hats for the last 30 years. This is how we got Obamacare, if that offers some perspective on how long this business has been going on. Both parties. Doesn't matter who has the WH. They all do it. Uniparty. And Trump's still got far too few allies to plow through. permalink parent award report block reply alfredbester 4 points 3 days ago This is the sad truth. It's all a giant steaming pile of bullshit and I'm sick of acting like all these fuckers didn't steal my money my whole life. Fuck that. I want these fuckers in jail. permalink parent award report block reply MastaJoda 2 points 3 days ago lol Trump endorsed all of his RINO backstabbers, even after they repeatedly stabbed him in the face. permalink parent award report block reply SanityGumby 0 points 3 days ago No he didn’t. He didn’t endorse Rand Paul or Massie. permalink parent award report block reply view 2 more comments... tired-of-crap 1 points 3 days ago The current CR is only until Right before thanksgiving.  It would require a trip back to the house to change that. permalink parent award report block reply\nalfredbester 4 points 3 days ago This is the sad truth. It's all a giant steaming pile of bullshit and I'm sick of acting like all these fuckers didn't steal my money my whole life. Fuck that. I want these fuckers in jail. permalink parent award report block reply\nMastaJoda 2 points 3 days ago lol Trump endorsed all of his RINO backstabbers, even after they repeatedly stabbed him in the face. permalink parent award report block reply SanityGumby 0 points 3 days ago No he didn’t. He didn’t endorse Rand Paul or Massie. permalink parent award report block reply view 2 more comments...\nSanityGumby 0 points 3 days ago No he didn’t. He didn’t endorse Rand Paul or Massie. permalink parent award report block reply view 2 more comments...\ntired-of-crap 1 points 3 days ago The current CR is only until Right before thanksgiving.  It would require a trip back to the house to change that. permalink parent award report block reply\nSimple_Doot 8 points 3 days ago They can do whatever they want and then just manipulate the masses into hatred of someone else so that they are distracted and the puppet masters stay in power.  One would figure the whole Epstein about-face would have started a rebellion against the current administration.  Then Trump was like \"its fake, and also anyone who disagrees is stupid\" and that was it.  This board instantly abandoned the most prolific blackmailing operation in human history and fell inline instantly - thats fucking power in its purest form. permalink parent award report block reply\nDangerous 5 points 3 days ago They already did. This current result isn't some victory for us at all permalink parent award report block reply\ngrad16uc 1 points 3 days ago Jaws of victory? This CR is already a loss. The only question we're debating is how hard we get fucked. permalink parent award report block reply anotherthing 1 points 2 days ago You're being downvoted by the people who are going to be completely surprised when the dollar finally collapses under the weight of the National debt. They're the same people that might know that the Japanese Yen is in the shitter, but never bothered to look at their national debt to GDP ration. permalink parent award report block reply\nanotherthing 1 points 2 days ago You're being downvoted by the people who are going to be completely surprised when the dollar finally collapses under the weight of the National debt. They're the same people that might know that the Japanese Yen is in the shitter, but never bothered to look at their national debt to GDP ration. permalink parent award report block reply\npoliticsaside 3 points 3 days ago All of em. They need to go nuclear and pass Trump’s agenda asap. Wtf is wrong with these asshats. permalink parent award report block reply MemeWarsVet 3 points 3 days ago Uniparty. permalink parent award report block reply\nMemeWarsVet 3 points 3 days ago Uniparty. permalink parent award report block reply\nSeamusOtardy 2 points 3 days ago Look at that photo. Friggin’ larpers. permalink parent award report block reply\nGuerillaYourDreams 32 points 3 days ago Everyone in Congress is a snake. Prove me wrong. permalink award report block reply TheAftermath 17 points 3 days ago 535 traitors operating in a casino-whorehouse combo. permalink parent award report block reply GuerillaYourDreams 7 points 3 days ago Indeed. permalink parent award report block reply TheAftermath 5 points 3 days ago The sordid truth, friend. Always has been.jpg. permalink parent award report block reply Thereyago 2 points 3 days ago Massie and Rand aren't,  they told me so! permalink parent award report block reply Fundadores 1 points 3 days ago Hey! The ones speaking up about our rigged elections are not that bad. Let me get my list… I think MTG is on here. Anyone else? permalink parent award report block reply\nTheAftermath 17 points 3 days ago 535 traitors operating in a casino-whorehouse combo. permalink parent award report block reply GuerillaYourDreams 7 points 3 days ago Indeed. permalink parent award report block reply TheAftermath 5 points 3 days ago The sordid truth, friend. Always has been.jpg. permalink parent award report block reply Thereyago 2 points 3 days ago Massie and Rand aren't,  they told me so! permalink parent award report block reply\nGuerillaYourDreams 7 points 3 days ago Indeed. permalink parent award report block reply TheAftermath 5 points 3 days ago The sordid truth, friend. Always has been.jpg. permalink parent award report block reply\nTheAftermath 5 points 3 days ago The sordid truth, friend. Always has been.jpg. permalink parent award report block reply\nThereyago 2 points 3 days ago Massie and Rand aren't,  they told me so! permalink parent award report block reply\nFundadores 1 points 3 days ago Hey! The ones speaking up about our rigged elections are not that bad. Let me get my list… I think MTG is on here. Anyone else? permalink parent award report block reply\nCianevalies 16 points 3 days ago The Dems have chosen 10 to take the hit from the leftwing nut jobs and save schumer . It’s all political nonsense as the longer it goes on the more pressure the republicans get to nuke the filibuster. Something the Dems will do once they return to senate control. permalink award report block reply brainphreeze 6 points 3 days ago It's the theater that angers the most, every single decision driven by politics and votes rather than what is right permalink parent award report block reply lixa 1 points 3 days ago Not wanting the right to pass legislation is why the democrats gave in permalink parent award report block reply\nbrainphreeze 6 points 3 days ago It's the theater that angers the most, every single decision driven by politics and votes rather than what is right permalink parent award report block reply\nlixa 1 points 3 days ago Not wanting the right to pass legislation is why the democrats gave in permalink parent award report block reply\nCounterwhat 14 points 3 days ago What a loser Thune is. We lost all those state elections, seats and offices for nothing if he gives in to this turd. I'll say it again the the GOP are the Washington generals watching the globetrotters dribble up and down the court before being embarrassingly tea bag dunked on to an embarrassingly bad loss. permalink award report block reply MastaJoda 3 points 3 days ago Jokes on you, they love tea bags. permalink parent award report block reply\nMastaJoda 3 points 3 days ago Jokes on you, they love tea bags. permalink parent award report block reply\nMythArcana 14 points 3 days ago Yeah, Senate Democrat Majority Leader Thune better stop screwing us over right now. permalink award report block reply songman727 5 points 3 days ago Time for a sternly-worded letter... permalink parent award report block reply ingrowntoenail 0 points 3 days ago In two weeks. permalink parent award report block reply\nsongman727 5 points 3 days ago Time for a sternly-worded letter... permalink parent award report block reply ingrowntoenail 0 points 3 days ago In two weeks. permalink parent award report block reply\ningrowntoenail 0 points 3 days ago In two weeks. permalink parent award report block reply\nLandslide_2020 11 points 3 days ago Yea.  Is there any word on whether Thune had to give the Dems anything in return for their vote?  If there really is going to be a vote? permalink award report block reply WhiteBoySummer 8 points 3 days ago They wouldn’t be onboard if it didn’t include free money & healthcare for illegals permalink parent award report block reply Klaus73 2 points 3 days ago Apparently this funds stuff until Jan 31st at which point we can be back here. This also ensures SNAP and VA are funded until the end of the year and requires a vote on the ACA stuff before the end of this year. permalink parent award report block reply\nWhiteBoySummer 8 points 3 days ago They wouldn’t be onboard if it didn’t include free money & healthcare for illegals permalink parent award report block reply\nKlaus73 2 points 3 days ago Apparently this funds stuff until Jan 31st at which point we can be back here. This also ensures SNAP and VA are funded until the end of the year and requires a vote on the ACA stuff before the end of this year. permalink parent award report block reply\nCoprolite 11 points 3 days ago Keep it shut down. permalink award report block reply\nMoose_Antlers 7 points 3 days ago If I understand this correctly, it's a clean CR. CR = continuing resolution. The bill authorizes current Biden era spending levels to continue into December to allow more time to negotiate. Speaker Johnson has offered this since September. It's been sitting in the Senate waiting for Schumer to ok it this long. ------ How this will work ------ This will work the same way it does every damn year we do this. Dems are going to hold out until Christmas when everyone's feeling generous and wants to be home with their families. Then Schumer's going to make wild demands and hold the government hostage and tell them they can't celebrate Christmas until they vote. The Republicans will cave and Dems get to play Santa Claus to illegals once again with our money because the GOP is too afraid to FIGHT. If the GOP decides to show some spine, the best we'll get at the end of that stunt is another CR to get us to March, and we'll do the same game of chicken again, this time with tax season looming and businesses screaming demanding certainty in the laws so they can plan their budgets. Then the donors get involved in the pressure campaign. And usually the GOP will cave because they're too afraid to FIGHT. permalink award report block reply victory2024 9 points 3 days ago \"Biden era spending levels\" -- so funding illegals will continue? permalink parent award report block reply KekistanPM 4 points 3 days ago If congressmen and senators didn't get paid during a shutdown, you can be sure the government would be open right now. permalink parent award report block reply Dangerous -2 points 3 days ago The GOP isn't afraid. This is the exact result AIPAC wants, because a functional independent USA lead by its own citizens success is dangerous to their designs permalink parent award report block reply\nvictory2024 9 points 3 days ago \"Biden era spending levels\" -- so funding illegals will continue? permalink parent award report block reply\nKekistanPM 4 points 3 days ago If congressmen and senators didn't get paid during a shutdown, you can be sure the government would be open right now. permalink parent award report block reply\nDangerous -2 points 3 days ago The GOP isn't afraid. This is the exact result AIPAC wants, because a functional independent USA lead by its own citizens success is dangerous to their designs permalink parent award report block reply\nSpacemonkey 5 points 3 days ago Just my opinion here but any politician who even suggests legislation that would give illegal aliens anything other than a swift boot up their asses out of our country should immediately be tried for treason and if found guilty carted outside and hanged publicly that goes for Republicans as well as democrats. permalink award report block reply\nHanging_Chad 4 points 3 days ago why is this causing crypto to go up? 📈 permalink award report block reply BreakingCNN 4 points 3 days ago What kind of a tulip bulb is this crypto? Is it some new hybrid, GMO, or did they use that gout medication on it Colchicine? permalink parent award report block reply Hanging_Chad 3 points 3 days ago not sure, but now’s a good time to plant them permalink parent award report block reply BreakingCNN 2 points 3 days ago Yeah, I'm going to run out and buy some of them halogen lights so I can grow them at nights? permalink parent award report block reply Klaus73 2 points 3 days ago https://www.coindesk.com/markets/2025/11/09/crypto-prices-rise-as-trump-announces-at-least-usd2k-tariff-dividend He is trying to bribe Americans with their own money. permalink parent award report block reply Hanging_Chad 2 points 3 days ago na, trying to get SCOTUS to rule in his favor. if they don’t, then people finna be mad at SCOTUS permalink parent award report block reply Thereyago 2 points 3 days ago Well, he's kinda disproving its a \"tax\" which is the BS \"principled\" argument being tossed around. permalink parent award report block reply Klaus73 2 points 3 days ago People are always mad at SCOTUS when they rule against someone; don't see this changing much. permalink parent award report block reply\nBreakingCNN 4 points 3 days ago What kind of a tulip bulb is this crypto? Is it some new hybrid, GMO, or did they use that gout medication on it Colchicine? permalink parent award report block reply Hanging_Chad 3 points 3 days ago not sure, but now’s a good time to plant them permalink parent award report block reply BreakingCNN 2 points 3 days ago Yeah, I'm going to run out and buy some of them halogen lights so I can grow them at nights? permalink parent award report block reply\nHanging_Chad 3 points 3 days ago not sure, but now’s a good time to plant them permalink parent award report block reply BreakingCNN 2 points 3 days ago Yeah, I'm going to run out and buy some of them halogen lights so I can grow them at nights? permalink parent award report block reply\nBreakingCNN 2 points 3 days ago Yeah, I'm going to run out and buy some of them halogen lights so I can grow them at nights? permalink parent award report block reply\nKlaus73 2 points 3 days ago https://www.coindesk.com/markets/2025/11/09/crypto-prices-rise-as-trump-announces-at-least-usd2k-tariff-dividend He is trying to bribe Americans with their own money. permalink parent award report block reply Hanging_Chad 2 points 3 days ago na, trying to get SCOTUS to rule in his favor. if they don’t, then people finna be mad at SCOTUS permalink parent award report block reply Thereyago 2 points 3 days ago Well, he's kinda disproving its a \"tax\" which is the BS \"principled\" argument being tossed around. permalink parent award report block reply Klaus73 2 points 3 days ago People are always mad at SCOTUS when they rule against someone; don't see this changing much. permalink parent award report block reply\nHanging_Chad 2 points 3 days ago na, trying to get SCOTUS to rule in his favor. if they don’t, then people finna be mad at SCOTUS permalink parent award report block reply Thereyago 2 points 3 days ago Well, he's kinda disproving its a \"tax\" which is the BS \"principled\" argument being tossed around. permalink parent award report block reply Klaus73 2 points 3 days ago People are always mad at SCOTUS when they rule against someone; don't see this changing much. permalink parent award report block reply\nThereyago 2 points 3 days ago Well, he's kinda disproving its a \"tax\" which is the BS \"principled\" argument being tossed around. permalink parent award report block reply\nKlaus73 2 points 3 days ago People are always mad at SCOTUS when they rule against someone; don't see this changing much. permalink parent award report block reply\nInduceddrag 4 points 3 days ago There is none of this meant to help Americans. This is all politics.  The democrats would prefer the American people be miserable, as long as they blame republicans.  If democrats vote for the CR it will be because Schumer told them it was ok. permalink award report block reply\nRedWave26 4 points 3 days ago Thune is a traitor. Always has been. permalink award report block reply Dangerous 1 points 3 days ago The entire GOP are treacherous snakes, except for the ones calling them out And the ones calling the GOP out are all on AIPACs shitlist so Trump attacks them while endorsing Thune and Lady Lindsey permalink parent award report block reply\nDangerous 1 points 3 days ago The entire GOP are treacherous snakes, except for the ones calling them out And the ones calling the GOP out are all on AIPACs shitlist so Trump attacks them while endorsing Thune and Lady Lindsey permalink parent award report block reply\nCali_kid 4 points 3 days ago People are starting to blame the Dems, the republicans took a big LOSS. President Trump no one is on Truth social post on X permalink award report block reply KernalMustard 2 points 3 days ago Sure they are... what ever you tell yourself. permalink parent award report block reply SanityGumby 1 points 3 days ago Polling shows no one ever blamed anyone but democrats permalink parent award report block reply\nKernalMustard 2 points 3 days ago Sure they are... what ever you tell yourself. permalink parent award report block reply\nSanityGumby 1 points 3 days ago Polling shows no one ever blamed anyone but democrats permalink parent award report block reply\nstripperlover 4 points 3 days ago incoming GOP cuck out!! permalink award report block reply\nFlgPole 4 points 3 days ago vote to end schumers career permalink award report block reply\nDeplorableLA 3 points 3 days ago Excellent.  Good move by Thune to keep the Senate in session, limits the amount of camera chasing by the shifty Dems. permalink award report block reply Bythrfruitsyknow 10 points 3 days ago Also it stops President Trump from being able to make any recess appointments. The real reason Thune is doing it. permalink parent award report block reply DeplorableLA 1 points 3 days ago Bummer that, for sure.  Thanks for the reminder. permalink parent award report block reply\nBythrfruitsyknow 10 points 3 days ago Also it stops President Trump from being able to make any recess appointments. The real reason Thune is doing it. permalink parent award report block reply DeplorableLA 1 points 3 days ago Bummer that, for sure.  Thanks for the reminder. permalink parent award report block reply\nDeplorableLA 1 points 3 days ago Bummer that, for sure.  Thanks for the reminder. permalink parent award report block reply\nmass55th 3 points 3 days ago No short term horseshit. We'll be going through this shit again in a few months. Get the fucking job done Thune, or get the fuck out of the way. permalink award report block reply hitchhiker 3 points 3 days ago Thought we’d be going through it again on the 21st permalink parent award report block reply\nhitchhiker 3 points 3 days ago Thought we’d be going through it again on the 21st permalink parent award report block reply\nutfanx2 3 points 3 days ago Trump promised to never sign another Omnibus. Veto it all. permalink award report block reply\nAmerican-Patriot 3 points 3 days ago Fuck them and fuck that.\nWe need to contact our republican senators and tell them to support going dully nuclear!! Stop making deals with the devil's party!!! permalink award report block reply\nthrottlejohnson 2 points 3 days ago i don't care. honestly. let it burn to the fucking ground. everytime these motherfuckers vote on something and pass it, it is filled with bullshit and unnecessary waste. fuck them. have a nice Sunday. permalink award report block reply\nDiamondDroid 2 points 3 days ago Are we there yet? permalink award report block reply donteatthat 1 points 3 days ago GOD DAMNIT I WILL TURN THIS CAR AROUND permalink parent award report block reply\ndonteatthat 1 points 3 days ago GOD DAMNIT I WILL TURN THIS CAR AROUND permalink parent award report block reply\nMrMcGreenGenes 2 points 3 days ago Well, Schitt. permalink award report block reply\nComeon4954 2 points 3 days ago Whatever happened to us hoping that thing that could happen on Day 41 would happen? permalink award report block reply\nterribletwos 2 points 3 days ago Remove the CR as an option, make them pass each 12 annual appropriation bill separately. Do this by force through the majority. permalink award report block reply\nOldman1234 1 points 3 days ago Was there any doubt that Thune and the other RINO Senators would cave to the Democrats? permalink award report block reply\nBldg_2019 1 points 3 days ago Don’t do it. Press the demtards into the holidays. PAST Thanksgiving at least. permalink award report block reply\nObambi 1 points 3 days ago Schumer always a J involved in everything bad permalink award report block reply\nSanityGumby 1 points 3 days ago Well today is over… permalink award report block reply\nMajorClark 1 points 3 days ago These corrupt democrats have made millions off of Obamacare while throwing the tax payers into a dam near depression!   Give them nothing!   People aren't gonna forget this in the near future. permalink award report block reply\nrivetjoint2 1 points 3 days ago Open at the grotesque Biden spending levels.  Whatever.  If they can’t get that over the line - how on earth does the senate think it will pass the real spending bills if they even slow the growth of spending (under baseline budgeting even holding spending to the same amount is a massive cut - according to dc retard accounting). Just nuke the silent filibuster already.  Ban the mail in fraud, the machines and count the paper ballots with id required.  Make Election Day a federal holiday.  Recall when Nancy ran the house her h1 bill was mandatory mail in ballots! permalink award report block reply\nZnut55 1 points 3 days ago Guessing they are Dems that are in red states or Trump territory. permalink award report block reply\nSaltiTaralli 1 points 3 days ago Did the administration permanently lay off all those thousands of people we were told would be fired because the shut down made it possible and legal?????????? I haven't heard a damn thing about this in weeks. permalink award report block reply GreazyCheeks 2 points 3 days ago No. Bloated government remains. permalink parent award report block reply\nGreazyCheeks 2 points 3 days ago No. Bloated government remains. permalink parent award report block reply\nLogan051361 1 points 3 days ago As far as know, this bill is clean. permalink award report block reply\nEmodius 1 points 3 days ago DO NOT GIVE THEM ONE INCH! permalink award report block reply\nCorvettePatriot 1 points 3 days ago I hope not! permalink award report block reply\nAggrieved03 1 points 3 days ago They used it perfectly! Put doubt in people’s minds that the shutdown had everyone voting blue even though the polls predicted just the opposite. Masterfully played by Schumer and the media rolled right with it and no one looks for the fraud. permalink award report block reply ChilledCovfefe 3 points 3 days ago They own the media, we always lose playing brinksmanship with shutdowns.  Every time. permalink parent award report block reply\nChilledCovfefe 3 points 3 days ago They own the media, we always lose playing brinksmanship with shutdowns.  Every time. permalink parent award report block reply\nTheSonOfGadsden 1 points 3 days ago I’ll be shocked if the RINO fag doesn’t give any concessions permalink award report block reply\nAwShitHereWeGoAgain 1 points 3 days ago RINOs are gonna stab us in the fucking back yet again. permalink award report block reply\nACActual 1 points 3 days ago If the GOP hands the Communist their midterms rescue im out permalink award report block reply\nhey_spike 1 points 3 days ago Do not reward the dems nasty behavior. permalink award report block reply\nKernalMustard 1 points 3 days ago So what are republicans giving up? permalink award report block reply\nBe_The_Change 1 points 3 days ago Republicans caved; again. permalink award report block reply songman727 2 points 3 days ago Diddled by the dangling dong of Destiny... permalink parent award report block reply\nsongman727 2 points 3 days ago Diddled by the dangling dong of Destiny... permalink parent award report block reply\nDatamancer 1 points 3 days ago Fuck that.  All or nothing.   No money of any type for illegals. Any section 8 that cannot prove citizenship by the end of the month stops getting money December 1st. Any school receiving federal money for meals that cannot show that all children come from citizen households by the end of the month stops getting money December 1st. Any bank that cannot show that all account holders have legal status in the US by the end of the month are red-lined and removed from FDIC programs on December 1st. All lenders who cannot prove that a creditor in collection is a US citizen by the end of the month will be barred from seeking relief in federal court. All states that do not provide full SNAP accounting by the end of the month lose all SNAP payments. All states that do not provide full commercial and non-commercial driver's licenses audit by the end of the month lose all federal highway matching funds. Merry Christmas America. For Christmas you are getting a parasite removal program. permalink award report block reply\nDingleBalls 0 points 3 days ago Better be a CLEAN CR (it won't be) permalink award report block reply\nRolandDelacroix 0 points 3 days ago They're gonna keep extending until the midterms so they can beat on Republicans with it.  The republicans are fools to accept this. permalink award report block reply\nThelongarm 0 points 3 days ago Why do you think they are voting for a short term act? Thune caved. permalink award report block reply\nDITTOPatriot 0 points 3 days ago And they will back pay all those that didn’t work a minute. Release the Epstein files. permalink award report block reply\nRedCalifornia -1 points 3 days ago Can’t wait to see how many billions go to our greatest allies permalink award report block reply"}