{"id": "1ARK9nOXGa", "contents": "44 Looking for Field Engineer positions and I stumbled upon one that required all kinds of languages (I wonder why). posted 8 hours ago by Congo 9 comments award share download report block\n9 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Iremembermypassword 8 points 8 hours ago Learn four languages for a 50k job? You could get better jobs as a translator. permalink award report block reply Whenagain 5 points 8 hours ago This. If you speak 4-5 languages and aren't making $200k+ you're getting ripped off. permalink parent award report block reply ChyNahAzzWhole1 5 points 8 hours ago 50-65K WTF? permalink award report block reply newestofnew 4 points 8 hours ago lots of requirements for poverty permalink award report block reply fallhollow 3 points 7 hours ago report the company for discriminatory hiring practices permalink award report block reply bratt 3 points 7 hours ago 5 language multilingual, engineer for 65K. LOL I make more than that as a carpenter. permalink award report block reply MoreGuns 2 points 8 hours ago It should be illegal to require any language other than American English for any job permalink award report block reply Wexit-Delecto 2 points 8 hours ago That way they can make sure they don't get any Whites. permalink award report block reply SHILL_DETECTOR 2 points 8 hours ago bro, dont even bother applying to any jobs on t hese job boards, they will never respond you are wasting your time permalink award report block reply\nIremembermypassword 8 points 8 hours ago Learn four languages for a 50k job? You could get better jobs as a translator. permalink award report block reply Whenagain 5 points 8 hours ago This. If you speak 4-5 languages and aren't making $200k+ you're getting ripped off. permalink parent award report block reply\nWhenagain 5 points 8 hours ago This. If you speak 4-5 languages and aren't making $200k+ you're getting ripped off. permalink parent award report block reply\nChyNahAzzWhole1 5 points 8 hours ago 50-65K WTF? permalink award report block reply\nnewestofnew 4 points 8 hours ago lots of requirements for poverty permalink award report block reply\nfallhollow 3 points 7 hours ago report the company for discriminatory hiring practices permalink award report block reply\nbratt 3 points 7 hours ago 5 language multilingual, engineer for 65K. LOL I make more than that as a carpenter. permalink award report block reply\nMoreGuns 2 points 8 hours ago It should be illegal to require any language other than American English for any job permalink award report block reply\nWexit-Delecto 2 points 8 hours ago That way they can make sure they don't get any Whites. permalink award report block reply\nSHILL_DETECTOR 2 points 8 hours ago bro, dont even bother applying to any jobs on t hese job boards, they will never respond you are wasting your time permalink award report block reply"}