{"id": "1ARK9mG8oO", "contents": "95 For the Midterms, we have: 50 yr mortgages, more H1-B, H-4 Dependent, and OTPS visas, steak and chicken prices up, bs investigations going nowhere, no healthcare plan, Venezuela war, more Ukraine and Israel aid, wallowing in victimhood ---- No one is voting for that. posted 20 hours ago by breadbaker 34 comments award share report block Oh yeah and now swamp rats crawling out of the uniparty swamp. Fuck off with that. Stay with the economy.\n34 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style ACActual 18 points 20 hours ago Were watching the end of the Republican Party.   This is suicidal permalink award report block reply breadbaker OP 9 points 20 hours ago If I find out in 10 years that at some moment in Jan/Feb 2025 the real Trump had been replaced by a uniparty neocon Trump impersonator, I would believe it and swear to the fact that I felt it. permalink parent award report block reply ACActual 11 points 20 hours ago Seems like that.  Lived experience proves it.  Hard to believe he's squandering divine intervention but here we are permalink parent award report block reply breadbaker OP 6 points 20 hours ago It's frustrating and sad. It feel like the uniparty is back, the culture wars are back. Fuck, Glenn Beck is back. Like seriously, all these schlock meisters that feed the AM radio hate machine are making a comeback. Meanwhile, there are huge economic issues: housing, prices of basic groceries, healthcare. None of these issues are being addressed by MAGA or America First principles. permalink parent award report block reply ACActual 5 points 19 hours ago He just wrecked the Midterms.   That soundbite will last forever.   Who's going to vote for this?  American Coders, Gen Z, MAHA are staying home for the Midterms permalink parent award report block reply view 6 more comments... Hikedelics 9 points 19 hours ago The moment they backtracked on the Epstein files was when it all fell apart. I remember being disappointed but hopeful it was just a bump in the road. Instead it has been a string of losses ever since. permalink parent award report block reply AccipiterQ 2 points 19 hours ago Always happen, just like 2024 was supposed to be death of Dems. It just keeps getting worse and worse. permalink parent award report block reply ACActual 1 points 19 hours ago Makes you wonder if they're trying to ignite Revolution.   I feel the Patriot in that meme being poked with a stick permalink parent award report block reply boogeyman420 18 points 20 hours ago Fuentes went from clown to looking pretty fucking wise. This shit is a disaster. permalink award report block reply Teamdjt 3 points 20 hours ago Hoping for good out of the Republican party is an exercises in futility. 3rd grade they asked if I was going Bush or Dukakis, I picked red and have stayed with them every since. permalink parent award report block reply statesfrights 13 points 20 hours ago sadly this will be removed bc this site has gone to shit but you are correct permalink award report block reply TGNX 2 points 18 hours ago Since he isn't dooming (dancing on the line, maybe) I don't see an issue with him calling out the problems we currently have. As I said elsewhere, we have a year to fix this shit. permalink parent award report block reply NormalCitizen 11 points 19 hours ago Don't forget 600K CCP students! permalink award report block reply AccipiterQ 11 points 19 hours ago Don't forget, no arrests of openly Antifa rioters, despite the domestic terror organization. permalink award report block reply B-2StealthTrump 4 points 18 hours ago That’s another one that just disappeared. Wtf was the point of designating them as such, only to do nothing? permalink parent award report block reply genericamerican69 5 points 19 hours ago God damn disaster permalink award report block reply TGNX 4 points 18 hours ago Midterms are a year away. Time enough to get someone into Trump's ear to dump the visa shit and step up deportations. permalink award report block reply breadbaker OP 1 points 9 hours ago As I understand it, most who actually vote in the midterms have made their choices by end of March. Admittedly, 'most' is undefined and I will take it as anything from 40% +, but that is still a stupid large amount of voters that are slipping out of Trump's grasp for really poor attention to the issues truly facing America. permalink parent award report block reply breadbaker OP 1 points 20 hours ago Thanks. permalink award report block reply MakeRedditSukItagain -2 points 19 hours ago It’s not always what you vote for, but what you vote against.  Unless of course you’re one of those “it needs to get worse” before we see any real change people.  In that case, that’s a bold strategy Cotton. permalink award report block reply starjello -2 points 19 hours ago Well on the bright side you could cheer yourself up and go over to the Gay Awankening and read all the comments from the professional turd polishers other wise known as Q tards https://patriots.win/c/GreatAwakening/p/1ARK9mFJSx permalink award report block reply breadbaker OP 3 points 19 hours ago What is it with the constant gay references on this board? Post about the economy and you get a slew of gay related comments. Seriously, are you all closeted?  Actually debate policy or shut up. permalink parent award report block reply B-2StealthTrump 2 points 18 hours ago u/starjello is a known bot-faggot on this site. Block if you prefer, but I enjoy the salty tears, so I keep it around like a pet. permalink parent award report block reply starjello -3 points 19 hours ago Hey faggot go cry on the gay awankening you disillusioned Q faggot. Go over to the Q tard forum and bring back your fag buddies to down vote. Trump is selling you fags out. permalink parent award report block reply Maxmax -3 points 19 hours ago Get a grip. permalink award report block reply LaptopDied -3 points 19 hours ago Whole chicken is $2 a pound. Not bad. Bottom Round Beef is $5 a pound. Not bad. The national beef herd is very low. Because of drought. The 50  year mortgage will increase demand. Construction will then happen.  That drives  lot of other activity. Health care is horrible.  Maybe Obamacare can be repealed. 80% of the public want the ACA Obamacare enhanced tax credits extended. They will expire in January. Costs will necessarily skyrocket. ALL HELL WILL BREAK LOOSE THEN. Of course the Dems will enjoy seeing Trump blamed. permalink award report block reply breadbaker OP 5 points 19 hours ago The 50 year mortgage will increase demand. Construction will then happen. That drives lot of other activity. The 50 year mortgage is double the interest of a 30 year mortgage. You are not paying more than a pittance of principal back for a decade. permalink parent award report block reply LaptopDied -5 points 19 hours ago Unless you WANT TO. You can. No prepayment penalty. I assume. Consult your lawyer. Read what you sign. Unless you have the brains and means to pay more each month than you have to. It is a CHANCE. To own. Then comes the hard work of actually paying for it. As fast as possible, because as you say, time is your enemy. Best way? Go in with one or two other families and buy a house for ... cash. permalink parent award report block reply\nACActual 18 points 20 hours ago Were watching the end of the Republican Party.   This is suicidal permalink award report block reply breadbaker OP 9 points 20 hours ago If I find out in 10 years that at some moment in Jan/Feb 2025 the real Trump had been replaced by a uniparty neocon Trump impersonator, I would believe it and swear to the fact that I felt it. permalink parent award report block reply ACActual 11 points 20 hours ago Seems like that.  Lived experience proves it.  Hard to believe he's squandering divine intervention but here we are permalink parent award report block reply breadbaker OP 6 points 20 hours ago It's frustrating and sad. It feel like the uniparty is back, the culture wars are back. Fuck, Glenn Beck is back. Like seriously, all these schlock meisters that feed the AM radio hate machine are making a comeback. Meanwhile, there are huge economic issues: housing, prices of basic groceries, healthcare. None of these issues are being addressed by MAGA or America First principles. permalink parent award report block reply ACActual 5 points 19 hours ago He just wrecked the Midterms.   That soundbite will last forever.   Who's going to vote for this?  American Coders, Gen Z, MAHA are staying home for the Midterms permalink parent award report block reply view 6 more comments... Hikedelics 9 points 19 hours ago The moment they backtracked on the Epstein files was when it all fell apart. I remember being disappointed but hopeful it was just a bump in the road. Instead it has been a string of losses ever since. permalink parent award report block reply AccipiterQ 2 points 19 hours ago Always happen, just like 2024 was supposed to be death of Dems. It just keeps getting worse and worse. permalink parent award report block reply ACActual 1 points 19 hours ago Makes you wonder if they're trying to ignite Revolution.   I feel the Patriot in that meme being poked with a stick permalink parent award report block reply\nbreadbaker OP 9 points 20 hours ago If I find out in 10 years that at some moment in Jan/Feb 2025 the real Trump had been replaced by a uniparty neocon Trump impersonator, I would believe it and swear to the fact that I felt it. permalink parent award report block reply ACActual 11 points 20 hours ago Seems like that.  Lived experience proves it.  Hard to believe he's squandering divine intervention but here we are permalink parent award report block reply breadbaker OP 6 points 20 hours ago It's frustrating and sad. It feel like the uniparty is back, the culture wars are back. Fuck, Glenn Beck is back. Like seriously, all these schlock meisters that feed the AM radio hate machine are making a comeback. Meanwhile, there are huge economic issues: housing, prices of basic groceries, healthcare. None of these issues are being addressed by MAGA or America First principles. permalink parent award report block reply ACActual 5 points 19 hours ago He just wrecked the Midterms.   That soundbite will last forever.   Who's going to vote for this?  American Coders, Gen Z, MAHA are staying home for the Midterms permalink parent award report block reply view 6 more comments... Hikedelics 9 points 19 hours ago The moment they backtracked on the Epstein files was when it all fell apart. I remember being disappointed but hopeful it was just a bump in the road. Instead it has been a string of losses ever since. permalink parent award report block reply\nACActual 11 points 20 hours ago Seems like that.  Lived experience proves it.  Hard to believe he's squandering divine intervention but here we are permalink parent award report block reply breadbaker OP 6 points 20 hours ago It's frustrating and sad. It feel like the uniparty is back, the culture wars are back. Fuck, Glenn Beck is back. Like seriously, all these schlock meisters that feed the AM radio hate machine are making a comeback. Meanwhile, there are huge economic issues: housing, prices of basic groceries, healthcare. None of these issues are being addressed by MAGA or America First principles. permalink parent award report block reply ACActual 5 points 19 hours ago He just wrecked the Midterms.   That soundbite will last forever.   Who's going to vote for this?  American Coders, Gen Z, MAHA are staying home for the Midterms permalink parent award report block reply view 6 more comments...\nbreadbaker OP 6 points 20 hours ago It's frustrating and sad. It feel like the uniparty is back, the culture wars are back. Fuck, Glenn Beck is back. Like seriously, all these schlock meisters that feed the AM radio hate machine are making a comeback. Meanwhile, there are huge economic issues: housing, prices of basic groceries, healthcare. None of these issues are being addressed by MAGA or America First principles. permalink parent award report block reply ACActual 5 points 19 hours ago He just wrecked the Midterms.   That soundbite will last forever.   Who's going to vote for this?  American Coders, Gen Z, MAHA are staying home for the Midterms permalink parent award report block reply view 6 more comments...\nACActual 5 points 19 hours ago He just wrecked the Midterms.   That soundbite will last forever.   Who's going to vote for this?  American Coders, Gen Z, MAHA are staying home for the Midterms permalink parent award report block reply view 6 more comments...\nHikedelics 9 points 19 hours ago The moment they backtracked on the Epstein files was when it all fell apart. I remember being disappointed but hopeful it was just a bump in the road. Instead it has been a string of losses ever since. permalink parent award report block reply\nAccipiterQ 2 points 19 hours ago Always happen, just like 2024 was supposed to be death of Dems. It just keeps getting worse and worse. permalink parent award report block reply ACActual 1 points 19 hours ago Makes you wonder if they're trying to ignite Revolution.   I feel the Patriot in that meme being poked with a stick permalink parent award report block reply\nACActual 1 points 19 hours ago Makes you wonder if they're trying to ignite Revolution.   I feel the Patriot in that meme being poked with a stick permalink parent award report block reply\nboogeyman420 18 points 20 hours ago Fuentes went from clown to looking pretty fucking wise. This shit is a disaster. permalink award report block reply Teamdjt 3 points 20 hours ago Hoping for good out of the Republican party is an exercises in futility. 3rd grade they asked if I was going Bush or Dukakis, I picked red and have stayed with them every since. permalink parent award report block reply\nTeamdjt 3 points 20 hours ago Hoping for good out of the Republican party is an exercises in futility. 3rd grade they asked if I was going Bush or Dukakis, I picked red and have stayed with them every since. permalink parent award report block reply\nstatesfrights 13 points 20 hours ago sadly this will be removed bc this site has gone to shit but you are correct permalink award report block reply TGNX 2 points 18 hours ago Since he isn't dooming (dancing on the line, maybe) I don't see an issue with him calling out the problems we currently have. As I said elsewhere, we have a year to fix this shit. permalink parent award report block reply\nTGNX 2 points 18 hours ago Since he isn't dooming (dancing on the line, maybe) I don't see an issue with him calling out the problems we currently have. As I said elsewhere, we have a year to fix this shit. permalink parent award report block reply\nNormalCitizen 11 points 19 hours ago Don't forget 600K CCP students! permalink award report block reply\nAccipiterQ 11 points 19 hours ago Don't forget, no arrests of openly Antifa rioters, despite the domestic terror organization. permalink award report block reply B-2StealthTrump 4 points 18 hours ago That’s another one that just disappeared. Wtf was the point of designating them as such, only to do nothing? permalink parent award report block reply\nB-2StealthTrump 4 points 18 hours ago That’s another one that just disappeared. Wtf was the point of designating them as such, only to do nothing? permalink parent award report block reply\ngenericamerican69 5 points 19 hours ago God damn disaster permalink award report block reply\nTGNX 4 points 18 hours ago Midterms are a year away. Time enough to get someone into Trump's ear to dump the visa shit and step up deportations. permalink award report block reply breadbaker OP 1 points 9 hours ago As I understand it, most who actually vote in the midterms have made their choices by end of March. Admittedly, 'most' is undefined and I will take it as anything from 40% +, but that is still a stupid large amount of voters that are slipping out of Trump's grasp for really poor attention to the issues truly facing America. permalink parent award report block reply\nbreadbaker OP 1 points 9 hours ago As I understand it, most who actually vote in the midterms have made their choices by end of March. Admittedly, 'most' is undefined and I will take it as anything from 40% +, but that is still a stupid large amount of voters that are slipping out of Trump's grasp for really poor attention to the issues truly facing America. permalink parent award report block reply\nbreadbaker OP 1 points 20 hours ago Thanks. permalink award report block reply\nMakeRedditSukItagain -2 points 19 hours ago It’s not always what you vote for, but what you vote against.  Unless of course you’re one of those “it needs to get worse” before we see any real change people.  In that case, that’s a bold strategy Cotton. permalink award report block reply\nstarjello -2 points 19 hours ago Well on the bright side you could cheer yourself up and go over to the Gay Awankening and read all the comments from the professional turd polishers other wise known as Q tards https://patriots.win/c/GreatAwakening/p/1ARK9mFJSx permalink award report block reply breadbaker OP 3 points 19 hours ago What is it with the constant gay references on this board? Post about the economy and you get a slew of gay related comments. Seriously, are you all closeted?  Actually debate policy or shut up. permalink parent award report block reply B-2StealthTrump 2 points 18 hours ago u/starjello is a known bot-faggot on this site. Block if you prefer, but I enjoy the salty tears, so I keep it around like a pet. permalink parent award report block reply starjello -3 points 19 hours ago Hey faggot go cry on the gay awankening you disillusioned Q faggot. Go over to the Q tard forum and bring back your fag buddies to down vote. Trump is selling you fags out. permalink parent award report block reply\nbreadbaker OP 3 points 19 hours ago What is it with the constant gay references on this board? Post about the economy and you get a slew of gay related comments. Seriously, are you all closeted?  Actually debate policy or shut up. permalink parent award report block reply B-2StealthTrump 2 points 18 hours ago u/starjello is a known bot-faggot on this site. Block if you prefer, but I enjoy the salty tears, so I keep it around like a pet. permalink parent award report block reply starjello -3 points 19 hours ago Hey faggot go cry on the gay awankening you disillusioned Q faggot. Go over to the Q tard forum and bring back your fag buddies to down vote. Trump is selling you fags out. permalink parent award report block reply\nB-2StealthTrump 2 points 18 hours ago u/starjello is a known bot-faggot on this site. Block if you prefer, but I enjoy the salty tears, so I keep it around like a pet. permalink parent award report block reply\nstarjello -3 points 19 hours ago Hey faggot go cry on the gay awankening you disillusioned Q faggot. Go over to the Q tard forum and bring back your fag buddies to down vote. Trump is selling you fags out. permalink parent award report block reply\nMaxmax -3 points 19 hours ago Get a grip. permalink award report block reply\nLaptopDied -3 points 19 hours ago Whole chicken is $2 a pound. Not bad. Bottom Round Beef is $5 a pound. Not bad. The national beef herd is very low. Because of drought. The 50  year mortgage will increase demand. Construction will then happen.  That drives  lot of other activity. Health care is horrible.  Maybe Obamacare can be repealed. 80% of the public want the ACA Obamacare enhanced tax credits extended. They will expire in January. Costs will necessarily skyrocket. ALL HELL WILL BREAK LOOSE THEN. Of course the Dems will enjoy seeing Trump blamed. permalink award report block reply breadbaker OP 5 points 19 hours ago The 50 year mortgage will increase demand. Construction will then happen. That drives lot of other activity. The 50 year mortgage is double the interest of a 30 year mortgage. You are not paying more than a pittance of principal back for a decade. permalink parent award report block reply LaptopDied -5 points 19 hours ago Unless you WANT TO. You can. No prepayment penalty. I assume. Consult your lawyer. Read what you sign. Unless you have the brains and means to pay more each month than you have to. It is a CHANCE. To own. Then comes the hard work of actually paying for it. As fast as possible, because as you say, time is your enemy. Best way? Go in with one or two other families and buy a house for ... cash. permalink parent award report block reply\nbreadbaker OP 5 points 19 hours ago The 50 year mortgage will increase demand. Construction will then happen. That drives lot of other activity. The 50 year mortgage is double the interest of a 30 year mortgage. You are not paying more than a pittance of principal back for a decade. permalink parent award report block reply LaptopDied -5 points 19 hours ago Unless you WANT TO. You can. No prepayment penalty. I assume. Consult your lawyer. Read what you sign. Unless you have the brains and means to pay more each month than you have to. It is a CHANCE. To own. Then comes the hard work of actually paying for it. As fast as possible, because as you say, time is your enemy. Best way? Go in with one or two other families and buy a house for ... cash. permalink parent award report block reply\nLaptopDied -5 points 19 hours ago Unless you WANT TO. You can. No prepayment penalty. I assume. Consult your lawyer. Read what you sign. Unless you have the brains and means to pay more each month than you have to. It is a CHANCE. To own. Then comes the hard work of actually paying for it. As fast as possible, because as you say, time is your enemy. Best way? Go in with one or two other families and buy a house for ... cash. permalink parent award report block reply"}