{"id": "1ARK9pgQEg", "contents": "38 Approximately one in four adult women in the United States reported taking at least one psychiatric medication (thefederalist.com) posted 2 hours ago by blackswans 6 comments award share report block Most Women Are On Crazy Pills, And It's Bad For Everyone Until society rejects the profiteering illusions of social media and telehealth empires, the epidemic of medicated misery will only swell. thefederalist.com\n6 comments Sort by Top Top New Worst Old Save Around the Web Salt Lake City's Hair Growth Method Breaks All Records! HaloGrow someguy7738 3 points 57 minutes ago It's amazing the normalization of people being on mind altering pharmaceuticals from cradle to grave. People just accept it, and act like you're the crazy one for \"rawdogging life\" as they put it. permalink award report block reply Elencher 2 points 21 minutes ago One of my biggest black pills in life, grad school intro seminar. I'd been reading the docs they gave us and am going in pissed off because I see how much they're charging us for health insurance, ie more than I've ever paid in my life. So they're going through all the rules, finally get to the health insurance bit and open with \"We have a health insurance plan that will pay for your psych meds\" and the whole auditorium starts cheering. Fortunately later on I was able to talk to an admin and get taken off the student health insurance plan, but holy fuck it made me realize that the grad student body was fucking nuts. permalink parent award report block reply Elencher 3 points 1 hour ago We don't talk enough about the damage that hormonal birth control has done to women. permalink award report block reply starjello 1 points 50 minutes ago No because that would make the Catholic Church look good and that can't be done around here. Prophets are never recognized in their hometown. Pope Paul the 6th you were indeed a prophet. permalink parent award report block reply BBvarn 2 points 2 hours ago And Prozac is considered a vitamin, so that number could be higher. permalink award report block reply SpaceWizard 2 points 2 hours ago Not surprised permalink award report block reply\nsomeguy7738 3 points 57 minutes ago It's amazing the normalization of people being on mind altering pharmaceuticals from cradle to grave. People just accept it, and act like you're the crazy one for \"rawdogging life\" as they put it. permalink award report block reply Elencher 2 points 21 minutes ago One of my biggest black pills in life, grad school intro seminar. I'd been reading the docs they gave us and am going in pissed off because I see how much they're charging us for health insurance, ie more than I've ever paid in my life. So they're going through all the rules, finally get to the health insurance bit and open with \"We have a health insurance plan that will pay for your psych meds\" and the whole auditorium starts cheering. Fortunately later on I was able to talk to an admin and get taken off the student health insurance plan, but holy fuck it made me realize that the grad student body was fucking nuts. permalink parent award report block reply\nElencher 2 points 21 minutes ago One of my biggest black pills in life, grad school intro seminar. I'd been reading the docs they gave us and am going in pissed off because I see how much they're charging us for health insurance, ie more than I've ever paid in my life. So they're going through all the rules, finally get to the health insurance bit and open with \"We have a health insurance plan that will pay for your psych meds\" and the whole auditorium starts cheering. Fortunately later on I was able to talk to an admin and get taken off the student health insurance plan, but holy fuck it made me realize that the grad student body was fucking nuts. permalink parent award report block reply\nElencher 3 points 1 hour ago We don't talk enough about the damage that hormonal birth control has done to women. permalink award report block reply starjello 1 points 50 minutes ago No because that would make the Catholic Church look good and that can't be done around here. Prophets are never recognized in their hometown. Pope Paul the 6th you were indeed a prophet. permalink parent award report block reply\nstarjello 1 points 50 minutes ago No because that would make the Catholic Church look good and that can't be done around here. Prophets are never recognized in their hometown. Pope Paul the 6th you were indeed a prophet. permalink parent award report block reply\nBBvarn 2 points 2 hours ago And Prozac is considered a vitamin, so that number could be higher. permalink award report block reply\nSpaceWizard 2 points 2 hours ago Not surprised permalink award report block reply"}