{"id": "1ARK57sVL7", "contents": "264 Longest Shutdown Ever Reveals U.S. Could Stand To Fire A Lot Of Federal Workers.  One thing the shutdown seems to show is that there may very well be quite a few federal employees America could do without. (thefederalist.com) posted 4 days ago by actlikewewon 7 comments award share report block Shutdown Shows U.S. Could Stand To Fire Many Federal Workers One thing the shutdown seems to show is that there may very well be quite a few federal employees America could do without. thefederalist.com\n7 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style deleted 6 points 4 days ago TonyTreehouse 4 points 4 days ago Yeah, just like they use defense spending to buy Senator's votes. Contractors put the manufacturing all over the place so senators will support the program. It is why the defense department acquisition cycle is years long.  And then programs are hard to kill. permalink parent award report block reply utfanx2 2 points 4 days ago Judging by leftist outrage, the FAA seems to be the only agency doing any actual work. permalink award report block reply Comanche_Moon 1 points 4 days ago They should be going through the Snap and EBT lists and taking off all the illegals and those who won't do any work at all and could work. permalink award report block reply RachetQueen2020 1 points 4 days ago LOL. I am still working unpaid. Doing my job. Anyone saying different can do a back flip off the nearest bridge faggot. permalink award report block reply Right0hio 1 points 4 days ago It also shows that if you take 42,000,000 people off the public dole, grocery prices plummet! Local Kroger had gallons of milk for $1.00 this morning,\nExp. Date 11/21. They’ve have been having meat sales this week like I’ve never seen! permalink award report block reply suckmycorona 1 points 4 days ago Cause when it’s free money you buy like crazy and prob toss half of it away.  While working Americans have to be selective. permalink parent award report block reply\ndeleted 6 points 4 days ago TonyTreehouse 4 points 4 days ago Yeah, just like they use defense spending to buy Senator's votes. Contractors put the manufacturing all over the place so senators will support the program. It is why the defense department acquisition cycle is years long.  And then programs are hard to kill. permalink parent award report block reply\nTonyTreehouse 4 points 4 days ago Yeah, just like they use defense spending to buy Senator's votes. Contractors put the manufacturing all over the place so senators will support the program. It is why the defense department acquisition cycle is years long.  And then programs are hard to kill. permalink parent award report block reply\nutfanx2 2 points 4 days ago Judging by leftist outrage, the FAA seems to be the only agency doing any actual work. permalink award report block reply\nComanche_Moon 1 points 4 days ago They should be going through the Snap and EBT lists and taking off all the illegals and those who won't do any work at all and could work. permalink award report block reply\nRachetQueen2020 1 points 4 days ago LOL. I am still working unpaid. Doing my job. Anyone saying different can do a back flip off the nearest bridge faggot. permalink award report block reply\nRight0hio 1 points 4 days ago It also shows that if you take 42,000,000 people off the public dole, grocery prices plummet! Local Kroger had gallons of milk for $1.00 this morning,\nExp. Date 11/21. They’ve have been having meat sales this week like I’ve never seen! permalink award report block reply suckmycorona 1 points 4 days ago Cause when it’s free money you buy like crazy and prob toss half of it away.  While working Americans have to be selective. permalink parent award report block reply\nsuckmycorona 1 points 4 days ago Cause when it’s free money you buy like crazy and prob toss half of it away.  While working Americans have to be selective. permalink parent award report block reply"}