{"id": "1ARK9pg8zD", "contents": "81 Ukraine faces ‘huge problems’ finding soldiers as men flee abroad, says Kyiv mayor.\n\nNobody wants to die for Zelenskyy and his corrupt cohorts. (www.politico.eu) posted 4 hours ago by Trump2024Train 6 comments award share report block Ukraine faces ‘huge problems’ finding soldiers as men flee abroad, says Kyiv mayor In an interview, Vitali Klitschko describes Russian troops attacking in relentless waves “like a video game” as he calls for the draft age to be lowered. www.politico.eu\n6 comments Sort by Top Top New Worst Old Save Around the Web This Simple Trick Kills All Parasites in The Body! Paratoxil sordfysh PRO 3 points 4 hours ago Start drafting women. It's the age of feminism, right? permalink award report block reply Millie1234 1 points 55 minutes ago It's the women and kids they want, just needed to remove all the men first. permalink parent award report block reply AwShitHereWeGoAgain 2 points 3 hours ago Glass him. permalink award report block reply SpaceWizard 1 points 2 hours ago Good. Fuck Ukraine permalink award report block reply FlyinHeadlock 1 points 4 hours ago Russia has always fought this way. He has to know since he is Russian. permalink award report block reply JeetPoopDo 1 points 3 hours ago Comment removed by community filter, pending further review. permalink award report block reply\nsordfysh PRO 3 points 4 hours ago Start drafting women. It's the age of feminism, right? permalink award report block reply Millie1234 1 points 55 minutes ago It's the women and kids they want, just needed to remove all the men first. permalink parent award report block reply\nMillie1234 1 points 55 minutes ago It's the women and kids they want, just needed to remove all the men first. permalink parent award report block reply\nAwShitHereWeGoAgain 2 points 3 hours ago Glass him. permalink award report block reply\nSpaceWizard 1 points 2 hours ago Good. Fuck Ukraine permalink award report block reply\nFlyinHeadlock 1 points 4 hours ago Russia has always fought this way. He has to know since he is Russian. permalink award report block reply\nJeetPoopDo 1 points 3 hours ago Comment removed by community filter, pending further review. permalink award report block reply"}