{"id": "1ARK9hjvZp", "contents": "1112 BREAKING: House Speaker Mike Johnson told House Republicans that he is hoping to vote on the Senate’s deal to end the government shutdown on Wednesday — CNN posted 2 days ago by _C_I_A_ 45 comments award share download report block\n45 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Kelemor88 28 points 2 days ago Why isnt it done today….. permalink award report block reply deleted 28 points 2 days ago POTUS_DonnieJ 34 points 2 days ago Never pass up a chance for a 7 week long vacation. permalink parent award report block reply deleted 20 points 2 days ago POTUS_DonnieJ 11 points 2 days ago Don’t disagree. The framers of he Constitution never intended for government to become full time life long careers for people. permalink parent award report block reply goldkeyboardwarrior 5 points 2 days ago Back then it could take days or even a week to get back home by horse so it made sense for them to only come to DC once a year and stay for a few weeks. Today there is no major city in the country more than a five hour flight away from Reagan except in Alaska and Hawaii which is about 9-12 hours away. permalink parent award report block reply view 5 more comments... TheMostUselessFeeder 10 points 2 days ago They have to give fags like Rand Paul time to bluster and grandstand too, of course permalink parent award report block reply BidensfullAFdiaper 7 points 2 days ago He’s such a douche. His dad must have known he was going to be such a massive faggot and thus gave him an apt name. permalink parent award report block reply mohel 3 points 2 days ago He's a disappointment to his dad. permalink parent award report block reply view 2 more comments... jiujiujiu 3 points 2 days ago He is trying to protect his state from something stupid that is in the bill. He wants that thing removed from the bill and voted on separately so that he doesn’t betray his own state’s interests. It’s regarding the legal hemp industry which provides thousands of jobs for Kentucky. The bill, as is, will crush that industry. What’s the point of states having senators if they don’t protect their state’s interests? permalink parent award report block reply OutlawPurpleHairDye 5 points 2 days ago I'm guessing because the House has been as empty as Joe Biden's head for weeks and most members have left town and are just now coming back. permalink parent award report block reply Rydanovich 4 points 2 days ago Paperwork, mostly. The bloated system has a hundred sheets to go through before you're authorized to turn on a desk fan. permalink parent award report block reply Aquamine-Amarine 4 points 2 days ago Tuesday is a holiday. permalink parent award report block reply DustyGoose 2 points 2 days ago What's the rush, we're enjoying the shutdown. permalink parent award report block reply SoyLatte 2 points 2 days ago I know I am permalink parent award report block reply load 1 more comments... deltch 14 points 2 days ago Keep the government closed forever. permalink award report block reply TrumpLandslide20201 10 points 2 days ago There is no reason to give them ANYTHING!  Bunch of fucking pussies. permalink award report block reply SavingPrivateGrace 6 points 2 days ago Protect the 8ate from the violent left. permalink award report block reply IsrorOrca 6 points 2 days ago The should never have let the house \"go home\" during this time. OR...OR... This nonsense of being present. It's 2025 fuck that shit, vote remote if you have to. permalink award report block reply CruzControl 5 points 2 days ago This is dumb. Should have been no deal and Dems just sign what the House decided. Thune should have given them nothing. permalink award report block reply Deplorable556 3 points 2 days ago mike with all due respect can suck my johnson. permalink award report block reply Fangerang 3 points 2 days ago Mike Johnson is a useless faggot. permalink award report block reply realPhantomFuck 2 points 2 days ago Hope the House removes the hemp bullshit the Senate let slip in there (they won't) permalink award report block reply Thomm 2 points 2 days ago Can’t be that urgent. Why not just wait until January 30th and vote on the whole thing. permalink award report block reply MegoThor 2 points 2 days ago Fuck Mike Johnson. permalink award report block reply Amway 1 points 2 days ago Rand Paul is throwing a wrench into the, already, slow gears of government. He has his own pet issue he wants added to the bill or he will slow down the process. The Republican Leadership has ignore him for years and now he is a nightmare come true. permalink award report block reply Vorticity1 1 points 2 days ago Alcohol industry is getting CBD banned again. permalink award report block reply Wupta PRO 1 points 2 days ago Fuck the shutdown do the filibuster. permalink award report block reply freedomnc1776-2 1 points 2 days ago How about...TODAY.  Or 24 hours....Can any of you imagine walking into your bosses office...HEY...sorry, didn't get a good budget for 2027.  Gunna have to shut the business down until we do.  See ya in a week. permalink award report block reply Feddny 1 points 2 days ago I don’t really want the government open\nAt least not SNAP permalink award report block reply Siteless_Vagrant 1 points 2 days ago Sounds like capitulation. permalink award report block reply WanderingStar 1 points 2 days ago It's too bad that this can't be extended thru Thanksgiving, provided they make some provisions for the military, DHS and Air Traffic Controllers. permalink award report block reply NdNcenti 1 points 2 days ago They have 72 hours to return after being recalled, it wont be this week I’m sure permalink award report block reply deleted -6 points 2 days ago williammcfadden 6 points 2 days ago I think you're in the wrong forum. permalink parent award report block reply BeauHD 6 points 2 days ago Oh no. It's in the right forum. It's an influencer bot running on a Docker container. permalink parent award report block reply\nKelemor88 28 points 2 days ago Why isnt it done today….. permalink award report block reply deleted 28 points 2 days ago POTUS_DonnieJ 34 points 2 days ago Never pass up a chance for a 7 week long vacation. permalink parent award report block reply deleted 20 points 2 days ago POTUS_DonnieJ 11 points 2 days ago Don’t disagree. The framers of he Constitution never intended for government to become full time life long careers for people. permalink parent award report block reply goldkeyboardwarrior 5 points 2 days ago Back then it could take days or even a week to get back home by horse so it made sense for them to only come to DC once a year and stay for a few weeks. Today there is no major city in the country more than a five hour flight away from Reagan except in Alaska and Hawaii which is about 9-12 hours away. permalink parent award report block reply view 5 more comments... TheMostUselessFeeder 10 points 2 days ago They have to give fags like Rand Paul time to bluster and grandstand too, of course permalink parent award report block reply BidensfullAFdiaper 7 points 2 days ago He’s such a douche. His dad must have known he was going to be such a massive faggot and thus gave him an apt name. permalink parent award report block reply mohel 3 points 2 days ago He's a disappointment to his dad. permalink parent award report block reply view 2 more comments... jiujiujiu 3 points 2 days ago He is trying to protect his state from something stupid that is in the bill. He wants that thing removed from the bill and voted on separately so that he doesn’t betray his own state’s interests. It’s regarding the legal hemp industry which provides thousands of jobs for Kentucky. The bill, as is, will crush that industry. What’s the point of states having senators if they don’t protect their state’s interests? permalink parent award report block reply OutlawPurpleHairDye 5 points 2 days ago I'm guessing because the House has been as empty as Joe Biden's head for weeks and most members have left town and are just now coming back. permalink parent award report block reply Rydanovich 4 points 2 days ago Paperwork, mostly. The bloated system has a hundred sheets to go through before you're authorized to turn on a desk fan. permalink parent award report block reply Aquamine-Amarine 4 points 2 days ago Tuesday is a holiday. permalink parent award report block reply DustyGoose 2 points 2 days ago What's the rush, we're enjoying the shutdown. permalink parent award report block reply SoyLatte 2 points 2 days ago I know I am permalink parent award report block reply load 1 more comments...\ndeleted 28 points 2 days ago POTUS_DonnieJ 34 points 2 days ago Never pass up a chance for a 7 week long vacation. permalink parent award report block reply deleted 20 points 2 days ago POTUS_DonnieJ 11 points 2 days ago Don’t disagree. The framers of he Constitution never intended for government to become full time life long careers for people. permalink parent award report block reply goldkeyboardwarrior 5 points 2 days ago Back then it could take days or even a week to get back home by horse so it made sense for them to only come to DC once a year and stay for a few weeks. Today there is no major city in the country more than a five hour flight away from Reagan except in Alaska and Hawaii which is about 9-12 hours away. permalink parent award report block reply view 5 more comments... TheMostUselessFeeder 10 points 2 days ago They have to give fags like Rand Paul time to bluster and grandstand too, of course permalink parent award report block reply BidensfullAFdiaper 7 points 2 days ago He’s such a douche. His dad must have known he was going to be such a massive faggot and thus gave him an apt name. permalink parent award report block reply mohel 3 points 2 days ago He's a disappointment to his dad. permalink parent award report block reply view 2 more comments... jiujiujiu 3 points 2 days ago He is trying to protect his state from something stupid that is in the bill. He wants that thing removed from the bill and voted on separately so that he doesn’t betray his own state’s interests. It’s regarding the legal hemp industry which provides thousands of jobs for Kentucky. The bill, as is, will crush that industry. What’s the point of states having senators if they don’t protect their state’s interests? permalink parent award report block reply\nPOTUS_DonnieJ 34 points 2 days ago Never pass up a chance for a 7 week long vacation. permalink parent award report block reply deleted 20 points 2 days ago POTUS_DonnieJ 11 points 2 days ago Don’t disagree. The framers of he Constitution never intended for government to become full time life long careers for people. permalink parent award report block reply goldkeyboardwarrior 5 points 2 days ago Back then it could take days or even a week to get back home by horse so it made sense for them to only come to DC once a year and stay for a few weeks. Today there is no major city in the country more than a five hour flight away from Reagan except in Alaska and Hawaii which is about 9-12 hours away. permalink parent award report block reply view 5 more comments...\ndeleted 20 points 2 days ago POTUS_DonnieJ 11 points 2 days ago Don’t disagree. The framers of he Constitution never intended for government to become full time life long careers for people. permalink parent award report block reply goldkeyboardwarrior 5 points 2 days ago Back then it could take days or even a week to get back home by horse so it made sense for them to only come to DC once a year and stay for a few weeks. Today there is no major city in the country more than a five hour flight away from Reagan except in Alaska and Hawaii which is about 9-12 hours away. permalink parent award report block reply view 5 more comments...\nPOTUS_DonnieJ 11 points 2 days ago Don’t disagree. The framers of he Constitution never intended for government to become full time life long careers for people. permalink parent award report block reply\ngoldkeyboardwarrior 5 points 2 days ago Back then it could take days or even a week to get back home by horse so it made sense for them to only come to DC once a year and stay for a few weeks. Today there is no major city in the country more than a five hour flight away from Reagan except in Alaska and Hawaii which is about 9-12 hours away. permalink parent award report block reply view 5 more comments...\nTheMostUselessFeeder 10 points 2 days ago They have to give fags like Rand Paul time to bluster and grandstand too, of course permalink parent award report block reply BidensfullAFdiaper 7 points 2 days ago He’s such a douche. His dad must have known he was going to be such a massive faggot and thus gave him an apt name. permalink parent award report block reply mohel 3 points 2 days ago He's a disappointment to his dad. permalink parent award report block reply view 2 more comments... jiujiujiu 3 points 2 days ago He is trying to protect his state from something stupid that is in the bill. He wants that thing removed from the bill and voted on separately so that he doesn’t betray his own state’s interests. It’s regarding the legal hemp industry which provides thousands of jobs for Kentucky. The bill, as is, will crush that industry. What’s the point of states having senators if they don’t protect their state’s interests? permalink parent award report block reply\nBidensfullAFdiaper 7 points 2 days ago He’s such a douche. His dad must have known he was going to be such a massive faggot and thus gave him an apt name. permalink parent award report block reply mohel 3 points 2 days ago He's a disappointment to his dad. permalink parent award report block reply view 2 more comments...\nmohel 3 points 2 days ago He's a disappointment to his dad. permalink parent award report block reply view 2 more comments...\njiujiujiu 3 points 2 days ago He is trying to protect his state from something stupid that is in the bill. He wants that thing removed from the bill and voted on separately so that he doesn’t betray his own state’s interests. It’s regarding the legal hemp industry which provides thousands of jobs for Kentucky. The bill, as is, will crush that industry. What’s the point of states having senators if they don’t protect their state’s interests? permalink parent award report block reply\nOutlawPurpleHairDye 5 points 2 days ago I'm guessing because the House has been as empty as Joe Biden's head for weeks and most members have left town and are just now coming back. permalink parent award report block reply\nRydanovich 4 points 2 days ago Paperwork, mostly. The bloated system has a hundred sheets to go through before you're authorized to turn on a desk fan. permalink parent award report block reply\nAquamine-Amarine 4 points 2 days ago Tuesday is a holiday. permalink parent award report block reply\nDustyGoose 2 points 2 days ago What's the rush, we're enjoying the shutdown. permalink parent award report block reply SoyLatte 2 points 2 days ago I know I am permalink parent award report block reply\nSoyLatte 2 points 2 days ago I know I am permalink parent award report block reply\ndeltch 14 points 2 days ago Keep the government closed forever. permalink award report block reply\nTrumpLandslide20201 10 points 2 days ago There is no reason to give them ANYTHING!  Bunch of fucking pussies. permalink award report block reply\nSavingPrivateGrace 6 points 2 days ago Protect the 8ate from the violent left. permalink award report block reply\nIsrorOrca 6 points 2 days ago The should never have let the house \"go home\" during this time. OR...OR... This nonsense of being present. It's 2025 fuck that shit, vote remote if you have to. permalink award report block reply\nCruzControl 5 points 2 days ago This is dumb. Should have been no deal and Dems just sign what the House decided. Thune should have given them nothing. permalink award report block reply\nDeplorable556 3 points 2 days ago mike with all due respect can suck my johnson. permalink award report block reply\nFangerang 3 points 2 days ago Mike Johnson is a useless faggot. permalink award report block reply\nrealPhantomFuck 2 points 2 days ago Hope the House removes the hemp bullshit the Senate let slip in there (they won't) permalink award report block reply\nThomm 2 points 2 days ago Can’t be that urgent. Why not just wait until January 30th and vote on the whole thing. permalink award report block reply\nMegoThor 2 points 2 days ago Fuck Mike Johnson. permalink award report block reply\nAmway 1 points 2 days ago Rand Paul is throwing a wrench into the, already, slow gears of government. He has his own pet issue he wants added to the bill or he will slow down the process. The Republican Leadership has ignore him for years and now he is a nightmare come true. permalink award report block reply\nVorticity1 1 points 2 days ago Alcohol industry is getting CBD banned again. permalink award report block reply\nWupta PRO 1 points 2 days ago Fuck the shutdown do the filibuster. permalink award report block reply\nfreedomnc1776-2 1 points 2 days ago How about...TODAY.  Or 24 hours....Can any of you imagine walking into your bosses office...HEY...sorry, didn't get a good budget for 2027.  Gunna have to shut the business down until we do.  See ya in a week. permalink award report block reply\nFeddny 1 points 2 days ago I don’t really want the government open\nAt least not SNAP permalink award report block reply\nSiteless_Vagrant 1 points 2 days ago Sounds like capitulation. permalink award report block reply\nWanderingStar 1 points 2 days ago It's too bad that this can't be extended thru Thanksgiving, provided they make some provisions for the military, DHS and Air Traffic Controllers. permalink award report block reply\nNdNcenti 1 points 2 days ago They have 72 hours to return after being recalled, it wont be this week I’m sure permalink award report block reply\ndeleted -6 points 2 days ago williammcfadden 6 points 2 days ago I think you're in the wrong forum. permalink parent award report block reply BeauHD 6 points 2 days ago Oh no. It's in the right forum. It's an influencer bot running on a Docker container. permalink parent award report block reply\nwilliammcfadden 6 points 2 days ago I think you're in the wrong forum. permalink parent award report block reply BeauHD 6 points 2 days ago Oh no. It's in the right forum. It's an influencer bot running on a Docker container. permalink parent award report block reply\nBeauHD 6 points 2 days ago Oh no. It's in the right forum. It's an influencer bot running on a Docker container. permalink parent award report block reply"}