{"id": "1ARK54SDaB", "contents": "262 Bondi is such a disappointment posted 5 days ago by wst4 10 comments award share download report block\n10 comments Sort by Top Top New Worst Old Save newestofnew 5 points 5 days ago we see republican democrat. those in power are much more tribal with their affiliations. as tucker said, they look after their group and the American people are not in their group. permalink award report block reply Mulletgunning 4 points 5 days ago Uniparty establishment trash. Susie,Pam,Todd,Kash etc need to be yeeted. Kash just got caught using leer jet to fly to his honey pot events. She is definitely his handler. She served in the IDF and works for Prager U plus is Abe Hamedeh s press sec from Arizona. 100% an Israeli spy who has to direct googly eyed Kash where to lick. MAGA AF permalink award report block reply suckmycorona 3 points 5 days ago I'd settle for jaywalking or parking ticket at this point. permalink award report block reply Im_RickSteves_bitch 3 points 5 days ago Send this to the Big Man's DMs. permalink award report block reply Grindelwald 2 points 5 days ago Maybe she should do a podcast with Tucker, Fuentes, and Candace.  It would be fun. permalink award report block reply SaltArmyCaptain 1 points 5 days ago Literally one thing! permalink award report block reply Califunya 1 points 5 days ago Bone permalink award report block reply Now_On_to_Mars 0 points 5 days ago Hannity is On in 15 permalink award report block reply TheGoyimWhisperer 1 points 5 days ago Comment removed upon the user being banned. permalink award report block reply TrumpMostUnMAGA 1 points 5 days ago Comment removed upon the user being banned. permalink award report block reply\nnewestofnew 5 points 5 days ago we see republican democrat. those in power are much more tribal with their affiliations. as tucker said, they look after their group and the American people are not in their group. permalink award report block reply\nMulletgunning 4 points 5 days ago Uniparty establishment trash. Susie,Pam,Todd,Kash etc need to be yeeted. Kash just got caught using leer jet to fly to his honey pot events. She is definitely his handler. She served in the IDF and works for Prager U plus is Abe Hamedeh s press sec from Arizona. 100% an Israeli spy who has to direct googly eyed Kash where to lick. MAGA AF permalink award report block reply\nsuckmycorona 3 points 5 days ago I'd settle for jaywalking or parking ticket at this point. permalink award report block reply\nIm_RickSteves_bitch 3 points 5 days ago Send this to the Big Man's DMs. permalink award report block reply\nGrindelwald 2 points 5 days ago Maybe she should do a podcast with Tucker, Fuentes, and Candace.  It would be fun. permalink award report block reply\nSaltArmyCaptain 1 points 5 days ago Literally one thing! permalink award report block reply\nCalifunya 1 points 5 days ago Bone permalink award report block reply\nNow_On_to_Mars 0 points 5 days ago Hannity is On in 15 permalink award report block reply\nTheGoyimWhisperer 1 points 5 days ago Comment removed upon the user being banned. permalink award report block reply\nTrumpMostUnMAGA 1 points 5 days ago Comment removed upon the user being banned. permalink award report block reply"}