{"id": "1ARK9nNhii", "contents": "530 In Japan, cleanliness isn’t just a duty it’s a reflection of their culture and identity. posted 10 hours ago by MEME-SUPREME 51 comments award share report block Massimo @Rainmaker1973 • 18h In Japan, cleanliness isn’t just a duty it’s a reflection of their culture and identity. [🎞️ insightgemz]\n51 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget Hantif 52 points 10 hours ago So, the anti-India? permalink award report block reply mty_green_go 17 points 9 hours ago 😂  😂  😂 Please do the needful!  Fucking filthy rapists and scammers permalink parent award report block reply MAGALADON9 8 points 9 hours ago I actually had to pull a huge knife on a group of jeets in Jaipur to defend a woman. Yeah yeah simp. She was under my protection and I knew they'd kill me and rape her to death permalink parent award report block reply mty_green_go 10 points 9 hours ago there is nothing simp about defending a helpless woman from a group of rapejeets. I would say that was bold and brave.. especially if the other option is death.  fuck 'em. your life > rapejeets permalink parent award report block reply TrumpYouMagaFrenner 2 points 9 hours ago Well if she voted to protect them permalink parent award report block reply RedStoneDeepState 4 points 9 hours ago Indians are a culture without high grade violence. Leftists think this means they are completely peaceful. What it actually means is they lack the authority to properly persecute that scum. Germanic culture has the highest propensity for high grade violence. It doesn't mean that Germanic people constantly fight, it means when they fight it is swift and brutal. permalink parent award report block reply DaninElkhart 3 points 7 hours ago \"Germanic culture has the highest propensity for high grade violence. Not anymore, not since they caught the Feminsta Mind Virus. permalink parent award report block reply AlmostFullyDilated 1 points 7 hours ago source? permalink parent award report block reply view 5 more comments... ThisTrainHasNoBrakes 3 points 7 hours ago Haha this explains why they got rid of them so fast.  Imagine living like this and then seeing a street shitter wipe his ass with his hand and then shove it into his rice. permalink parent award report block reply SpellingContable 3 points 6 hours ago Black tiktokers disrupting a culturally peaceful train carriage because the Japanese are too 'meek' to respond, or said black tiktoker constantly stealing food from self serve mini marts is just someones bottom dweller race chimping out because they cannot handle the tranquility of a respectful and high trust society. I can imagine the Jeets having a similar freakout with the garbage free streets, and the humble petite girls/women making their way home after school or work. permalink parent award report block reply Exsultate 18 points 10 hours ago Very much the cleanest country in the world.  They have a sense of honor and take pride in their country and their environment.  Even the garbage trucks are spotless. permalink award report block reply rivetjoint2 9 points 9 hours ago Japan?  Very much on the surface.  They don't treat the ocean very well in my experience, their idea of raw sewage disposal was    a pipe.   And they also hunt dolphins to the point of extinction. permalink parent award report block reply Fren20 2 points 7 hours ago I agree,they smile alot but what is behind that smile,they are humans and humans are not perfect.never been there but I am sure there are messy places,and they hunt dolphins and duty up the 🌊🌊🌊 ocean permalink parent award report block reply SpellingContable 2 points 6 hours ago I watched a vid which showed dumpsites of home appliances etc, dumped in the country because of the high cost of hard rubbish disposal in Japan. May have just been a sloptuber doing clickbait vids. Dont judge the Japs until you try Teriyaki Dolphin. Delicious. permalink parent award report block reply AlmostFullyDilated 1 points 7 hours ago fuck dolphins permalink parent award report block reply PresElectKekPede 0 points 8 hours ago Dolphins rape almost as much as the jeets. permalink parent award report block reply AR_MAGA 0 points 9 hours ago Exactly. And they think that we are inferior (Whites). permalink parent award report block reply Supersaying 3 points 8 hours ago Yeah well the woke shit didn’t start in Japan. permalink parent award report block reply AK_lurker_not_a_glow 0 points 9 hours ago Who cares about dolphins. They aren't the most innocent animal. We know the screwy things they've done. permalink parent award report block reply MAGALADON9 1 points 9 hours ago Comment removed by community filter. permalink parent award report block reply BidensPrisonWallet 16 points 9 hours ago Germany used to be neat as a pin. Even far out into the countryside the grass along the roadways looked like a manicured lawn. This started changing in the 2000's and I assumed it was because Government resources where being used up on the invaders. My last visit was in 2019 and there are now legitimate shithole areas in Germany. Sad. permalink award report block reply MAGALADON9 4 points 9 hours ago Time to dust off the Stahlhelm and your Boss uniform. permalink parent award report block reply mty_green_go 2 points 9 hours ago don't americanize my germany!! EU is going down the shitter FAST. there are tent cities all over europe now.. not just gypsies in paris anymore permalink parent award report block reply MuslimsWorshipSatan 15 points 9 hours ago We don't do the same because we aren't allowed to have homogenous societies like Japan still does. If the US was still ~95% White, we'd probably be pretty close to Japan in a lot of things. permalink award report block reply AR_MAGA 6 points 9 hours ago As a former residential technician I can tell you something. The majority of Black homes are filthy, and half of the White homes. You'll be surprised, the cleanest homes are the Hispanic ones, especially Cubans. permalink parent award report block reply AlmostFullyDilated 1 points 7 hours ago Comment removed by community filter. permalink parent award report block reply Fren20 1 points 7 hours ago Well just like a lot of white trash,they never want people telling them how messy they are or not to kill things permalink parent award report block reply HeatherSwanson 8 points 9 hours ago The USA were clean too when the naggerz were slaves and beaten to keep the plantation clean. permalink award report block reply MAGALADON9 3 points 9 hours ago Ahh the good ol days. No but srsly there are recording of actual slaves talking about their treatment and it's NOT what you'd expect.  This one woman recounts Q. Were you ever whipped or beaten aww nah you dun heard bout dat time to time but I ain't neva did see it or had it dun ta me neither. The family was nice and treated us good. Q. But not the same? well, we wuz not de same but we wuz not beat like some ask, least I wasn't permalink parent award report block reply journalist 4 points 7 hours ago Lived in Japan for over four years and they are major litter bugs. permalink award report block reply pococurante 5 points 6 hours ago The one idiotic thing Japan does, there are no trash cans in public. They expect people to carry trash when them all day and put it in their own trash can when they get back home. permalink parent award report block reply Markstarr85 4 points 9 hours ago wont be long until they bar blacks permalink award report block reply learntocode 4 points 3 hours ago I have this same sense from being a Boy Scout and being made unafraid of cleaning. We did alleys, campsites,  trails and when I owned a retail shop for a few years I was out scraping gum and sweeping every day. I found it to be great for my mental health, actually. permalink award report block reply chahn1138 3 points 3 hours ago You sound un-jabbed!  :0)  Bless you! permalink parent award report block reply Smurfection 3 points 7 hours ago AI vids.   I'd love to see a vid about Japan's dedication to cleanliness but the AI stuff just makes the vid lose all credibility. permalink award report block reply RedFoxOnFire 3 points 6 hours ago The thought process goes like this. Say there is an abandoned building, but it's clean.  No graffiti, no broken windows, no dirt or debris. Down the street there is another abandoned building, but this one is the opposite. Graffiti, broken windows, etc. A delinquent would be more likely to continue to vandalize the second one since others have already done so. But to be the first one to throw a rock or tag with spray paint not only requires a bit of extra courage, but might bring unwanted attention to themselves since someone is obviously keeping an eye one the place. Order encourages order and chaos encourages chaos. permalink award report block reply pococurante 4 points 5 hours ago Decades of Democrat mayors turned NYC into a filthy dump that people treated like a dump. Then in the 90s they elected a Republican who understood that, and NYC became clean and safe and prosperous for 20 years. Now the city is relapsing again. It's hard to understand why urban voters keep rejecting the party with a proven track record in favor of one that makes empty promises that are never fulfilled. permalink parent award report block reply 26magarat 2 points 6 hours ago Dave Barry wrote a book about his visit to Japan. He joked that the Japanese consider Westerners to be like water buffalo, pooping all over their landscape. permalink award report block reply TheColonelsDaughter 2 points 6 hours ago Fortunately for Japan, they came to their senses while they still HAVE a culture to reflect. We've spent so long giving ours away, that it's all but vanished. ;o( permalink award report block reply SleeperAgentSupreme 2 points 4 hours ago That's what you can have as long as you have an overwhelmingly single ethnicity population. permalink award report block reply Vermino 1 points 4 hours ago Already know a few problems: Water police in Nevada and banned phosphates in Washington. permalink award report block reply chahn1138 1 points 3 hours ago It is called \"Aiming High\" and I have Deep Respect for it! Arms Crossed! permalink award report block reply NoMaskNoMaster 1 points 49 minutes ago Keep in mind Whites invented all of this technology. It's time to kick the parasites out of the country and you knows who that is permalink award report block reply Watermelons 1 points 9 hours ago 5S permalink award report block reply Shitsbrokeyo 1 points 7 hours ago I want that for our country permalink award report block reply OkieDoker 1 points 3 hours ago Hmmmmm 98% homogeneous you say? permalink award report block reply ncswicn 1 points 5 hours ago Same for  Germany. permalink award report block reply MAGALADON9 0 points 9 hours ago REEEEEEEEEEEEEEEEEEE THEY NEED DIVERSITY!!!!!!!  AXIS POWER IS NAZI ADJACENT!!!!! REEEEEEEEEEEEEEEEEEE permalink award report block reply\nHantif 52 points 10 hours ago So, the anti-India? permalink award report block reply mty_green_go 17 points 9 hours ago 😂  😂  😂 Please do the needful!  Fucking filthy rapists and scammers permalink parent award report block reply MAGALADON9 8 points 9 hours ago I actually had to pull a huge knife on a group of jeets in Jaipur to defend a woman. Yeah yeah simp. She was under my protection and I knew they'd kill me and rape her to death permalink parent award report block reply mty_green_go 10 points 9 hours ago there is nothing simp about defending a helpless woman from a group of rapejeets. I would say that was bold and brave.. especially if the other option is death.  fuck 'em. your life > rapejeets permalink parent award report block reply TrumpYouMagaFrenner 2 points 9 hours ago Well if she voted to protect them permalink parent award report block reply RedStoneDeepState 4 points 9 hours ago Indians are a culture without high grade violence. Leftists think this means they are completely peaceful. What it actually means is they lack the authority to properly persecute that scum. Germanic culture has the highest propensity for high grade violence. It doesn't mean that Germanic people constantly fight, it means when they fight it is swift and brutal. permalink parent award report block reply DaninElkhart 3 points 7 hours ago \"Germanic culture has the highest propensity for high grade violence. Not anymore, not since they caught the Feminsta Mind Virus. permalink parent award report block reply AlmostFullyDilated 1 points 7 hours ago source? permalink parent award report block reply view 5 more comments... ThisTrainHasNoBrakes 3 points 7 hours ago Haha this explains why they got rid of them so fast.  Imagine living like this and then seeing a street shitter wipe his ass with his hand and then shove it into his rice. permalink parent award report block reply SpellingContable 3 points 6 hours ago Black tiktokers disrupting a culturally peaceful train carriage because the Japanese are too 'meek' to respond, or said black tiktoker constantly stealing food from self serve mini marts is just someones bottom dweller race chimping out because they cannot handle the tranquility of a respectful and high trust society. I can imagine the Jeets having a similar freakout with the garbage free streets, and the humble petite girls/women making their way home after school or work. permalink parent award report block reply\nmty_green_go 17 points 9 hours ago 😂  😂  😂 Please do the needful!  Fucking filthy rapists and scammers permalink parent award report block reply MAGALADON9 8 points 9 hours ago I actually had to pull a huge knife on a group of jeets in Jaipur to defend a woman. Yeah yeah simp. She was under my protection and I knew they'd kill me and rape her to death permalink parent award report block reply mty_green_go 10 points 9 hours ago there is nothing simp about defending a helpless woman from a group of rapejeets. I would say that was bold and brave.. especially if the other option is death.  fuck 'em. your life > rapejeets permalink parent award report block reply TrumpYouMagaFrenner 2 points 9 hours ago Well if she voted to protect them permalink parent award report block reply RedStoneDeepState 4 points 9 hours ago Indians are a culture without high grade violence. Leftists think this means they are completely peaceful. What it actually means is they lack the authority to properly persecute that scum. Germanic culture has the highest propensity for high grade violence. It doesn't mean that Germanic people constantly fight, it means when they fight it is swift and brutal. permalink parent award report block reply DaninElkhart 3 points 7 hours ago \"Germanic culture has the highest propensity for high grade violence. Not anymore, not since they caught the Feminsta Mind Virus. permalink parent award report block reply AlmostFullyDilated 1 points 7 hours ago source? permalink parent award report block reply view 5 more comments...\nMAGALADON9 8 points 9 hours ago I actually had to pull a huge knife on a group of jeets in Jaipur to defend a woman. Yeah yeah simp. She was under my protection and I knew they'd kill me and rape her to death permalink parent award report block reply mty_green_go 10 points 9 hours ago there is nothing simp about defending a helpless woman from a group of rapejeets. I would say that was bold and brave.. especially if the other option is death.  fuck 'em. your life > rapejeets permalink parent award report block reply TrumpYouMagaFrenner 2 points 9 hours ago Well if she voted to protect them permalink parent award report block reply RedStoneDeepState 4 points 9 hours ago Indians are a culture without high grade violence. Leftists think this means they are completely peaceful. What it actually means is they lack the authority to properly persecute that scum. Germanic culture has the highest propensity for high grade violence. It doesn't mean that Germanic people constantly fight, it means when they fight it is swift and brutal. permalink parent award report block reply DaninElkhart 3 points 7 hours ago \"Germanic culture has the highest propensity for high grade violence. Not anymore, not since they caught the Feminsta Mind Virus. permalink parent award report block reply AlmostFullyDilated 1 points 7 hours ago source? permalink parent award report block reply view 5 more comments...\nmty_green_go 10 points 9 hours ago there is nothing simp about defending a helpless woman from a group of rapejeets. I would say that was bold and brave.. especially if the other option is death.  fuck 'em. your life > rapejeets permalink parent award report block reply TrumpYouMagaFrenner 2 points 9 hours ago Well if she voted to protect them permalink parent award report block reply\nTrumpYouMagaFrenner 2 points 9 hours ago Well if she voted to protect them permalink parent award report block reply\nRedStoneDeepState 4 points 9 hours ago Indians are a culture without high grade violence. Leftists think this means they are completely peaceful. What it actually means is they lack the authority to properly persecute that scum. Germanic culture has the highest propensity for high grade violence. It doesn't mean that Germanic people constantly fight, it means when they fight it is swift and brutal. permalink parent award report block reply DaninElkhart 3 points 7 hours ago \"Germanic culture has the highest propensity for high grade violence. Not anymore, not since they caught the Feminsta Mind Virus. permalink parent award report block reply AlmostFullyDilated 1 points 7 hours ago source? permalink parent award report block reply view 5 more comments...\nDaninElkhart 3 points 7 hours ago \"Germanic culture has the highest propensity for high grade violence. Not anymore, not since they caught the Feminsta Mind Virus. permalink parent award report block reply\nAlmostFullyDilated 1 points 7 hours ago source? permalink parent award report block reply view 5 more comments...\nThisTrainHasNoBrakes 3 points 7 hours ago Haha this explains why they got rid of them so fast.  Imagine living like this and then seeing a street shitter wipe his ass with his hand and then shove it into his rice. permalink parent award report block reply SpellingContable 3 points 6 hours ago Black tiktokers disrupting a culturally peaceful train carriage because the Japanese are too 'meek' to respond, or said black tiktoker constantly stealing food from self serve mini marts is just someones bottom dweller race chimping out because they cannot handle the tranquility of a respectful and high trust society. I can imagine the Jeets having a similar freakout with the garbage free streets, and the humble petite girls/women making their way home after school or work. permalink parent award report block reply\nSpellingContable 3 points 6 hours ago Black tiktokers disrupting a culturally peaceful train carriage because the Japanese are too 'meek' to respond, or said black tiktoker constantly stealing food from self serve mini marts is just someones bottom dweller race chimping out because they cannot handle the tranquility of a respectful and high trust society. I can imagine the Jeets having a similar freakout with the garbage free streets, and the humble petite girls/women making their way home after school or work. permalink parent award report block reply\nExsultate 18 points 10 hours ago Very much the cleanest country in the world.  They have a sense of honor and take pride in their country and their environment.  Even the garbage trucks are spotless. permalink award report block reply rivetjoint2 9 points 9 hours ago Japan?  Very much on the surface.  They don't treat the ocean very well in my experience, their idea of raw sewage disposal was    a pipe.   And they also hunt dolphins to the point of extinction. permalink parent award report block reply Fren20 2 points 7 hours ago I agree,they smile alot but what is behind that smile,they are humans and humans are not perfect.never been there but I am sure there are messy places,and they hunt dolphins and duty up the 🌊🌊🌊 ocean permalink parent award report block reply SpellingContable 2 points 6 hours ago I watched a vid which showed dumpsites of home appliances etc, dumped in the country because of the high cost of hard rubbish disposal in Japan. May have just been a sloptuber doing clickbait vids. Dont judge the Japs until you try Teriyaki Dolphin. Delicious. permalink parent award report block reply AlmostFullyDilated 1 points 7 hours ago fuck dolphins permalink parent award report block reply PresElectKekPede 0 points 8 hours ago Dolphins rape almost as much as the jeets. permalink parent award report block reply AR_MAGA 0 points 9 hours ago Exactly. And they think that we are inferior (Whites). permalink parent award report block reply Supersaying 3 points 8 hours ago Yeah well the woke shit didn’t start in Japan. permalink parent award report block reply AK_lurker_not_a_glow 0 points 9 hours ago Who cares about dolphins. They aren't the most innocent animal. We know the screwy things they've done. permalink parent award report block reply MAGALADON9 1 points 9 hours ago Comment removed by community filter. permalink parent award report block reply\nrivetjoint2 9 points 9 hours ago Japan?  Very much on the surface.  They don't treat the ocean very well in my experience, their idea of raw sewage disposal was    a pipe.   And they also hunt dolphins to the point of extinction. permalink parent award report block reply Fren20 2 points 7 hours ago I agree,they smile alot but what is behind that smile,they are humans and humans are not perfect.never been there but I am sure there are messy places,and they hunt dolphins and duty up the 🌊🌊🌊 ocean permalink parent award report block reply SpellingContable 2 points 6 hours ago I watched a vid which showed dumpsites of home appliances etc, dumped in the country because of the high cost of hard rubbish disposal in Japan. May have just been a sloptuber doing clickbait vids. Dont judge the Japs until you try Teriyaki Dolphin. Delicious. permalink parent award report block reply AlmostFullyDilated 1 points 7 hours ago fuck dolphins permalink parent award report block reply PresElectKekPede 0 points 8 hours ago Dolphins rape almost as much as the jeets. permalink parent award report block reply AR_MAGA 0 points 9 hours ago Exactly. And they think that we are inferior (Whites). permalink parent award report block reply Supersaying 3 points 8 hours ago Yeah well the woke shit didn’t start in Japan. permalink parent award report block reply AK_lurker_not_a_glow 0 points 9 hours ago Who cares about dolphins. They aren't the most innocent animal. We know the screwy things they've done. permalink parent award report block reply\nFren20 2 points 7 hours ago I agree,they smile alot but what is behind that smile,they are humans and humans are not perfect.never been there but I am sure there are messy places,and they hunt dolphins and duty up the 🌊🌊🌊 ocean permalink parent award report block reply SpellingContable 2 points 6 hours ago I watched a vid which showed dumpsites of home appliances etc, dumped in the country because of the high cost of hard rubbish disposal in Japan. May have just been a sloptuber doing clickbait vids. Dont judge the Japs until you try Teriyaki Dolphin. Delicious. permalink parent award report block reply\nSpellingContable 2 points 6 hours ago I watched a vid which showed dumpsites of home appliances etc, dumped in the country because of the high cost of hard rubbish disposal in Japan. May have just been a sloptuber doing clickbait vids. Dont judge the Japs until you try Teriyaki Dolphin. Delicious. permalink parent award report block reply\nAlmostFullyDilated 1 points 7 hours ago fuck dolphins permalink parent award report block reply\nPresElectKekPede 0 points 8 hours ago Dolphins rape almost as much as the jeets. permalink parent award report block reply\nAR_MAGA 0 points 9 hours ago Exactly. And they think that we are inferior (Whites). permalink parent award report block reply Supersaying 3 points 8 hours ago Yeah well the woke shit didn’t start in Japan. permalink parent award report block reply\nSupersaying 3 points 8 hours ago Yeah well the woke shit didn’t start in Japan. permalink parent award report block reply\nAK_lurker_not_a_glow 0 points 9 hours ago Who cares about dolphins. They aren't the most innocent animal. We know the screwy things they've done. permalink parent award report block reply\nMAGALADON9 1 points 9 hours ago Comment removed by community filter. permalink parent award report block reply\nBidensPrisonWallet 16 points 9 hours ago Germany used to be neat as a pin. Even far out into the countryside the grass along the roadways looked like a manicured lawn. This started changing in the 2000's and I assumed it was because Government resources where being used up on the invaders. My last visit was in 2019 and there are now legitimate shithole areas in Germany. Sad. permalink award report block reply MAGALADON9 4 points 9 hours ago Time to dust off the Stahlhelm and your Boss uniform. permalink parent award report block reply mty_green_go 2 points 9 hours ago don't americanize my germany!! EU is going down the shitter FAST. there are tent cities all over europe now.. not just gypsies in paris anymore permalink parent award report block reply\nMAGALADON9 4 points 9 hours ago Time to dust off the Stahlhelm and your Boss uniform. permalink parent award report block reply\nmty_green_go 2 points 9 hours ago don't americanize my germany!! EU is going down the shitter FAST. there are tent cities all over europe now.. not just gypsies in paris anymore permalink parent award report block reply\nMuslimsWorshipSatan 15 points 9 hours ago We don't do the same because we aren't allowed to have homogenous societies like Japan still does. If the US was still ~95% White, we'd probably be pretty close to Japan in a lot of things. permalink award report block reply AR_MAGA 6 points 9 hours ago As a former residential technician I can tell you something. The majority of Black homes are filthy, and half of the White homes. You'll be surprised, the cleanest homes are the Hispanic ones, especially Cubans. permalink parent award report block reply AlmostFullyDilated 1 points 7 hours ago Comment removed by community filter. permalink parent award report block reply Fren20 1 points 7 hours ago Well just like a lot of white trash,they never want people telling them how messy they are or not to kill things permalink parent award report block reply\nAR_MAGA 6 points 9 hours ago As a former residential technician I can tell you something. The majority of Black homes are filthy, and half of the White homes. You'll be surprised, the cleanest homes are the Hispanic ones, especially Cubans. permalink parent award report block reply AlmostFullyDilated 1 points 7 hours ago Comment removed by community filter. permalink parent award report block reply\nAlmostFullyDilated 1 points 7 hours ago Comment removed by community filter. permalink parent award report block reply\nFren20 1 points 7 hours ago Well just like a lot of white trash,they never want people telling them how messy they are or not to kill things permalink parent award report block reply\nHeatherSwanson 8 points 9 hours ago The USA were clean too when the naggerz were slaves and beaten to keep the plantation clean. permalink award report block reply MAGALADON9 3 points 9 hours ago Ahh the good ol days. No but srsly there are recording of actual slaves talking about their treatment and it's NOT what you'd expect.  This one woman recounts Q. Were you ever whipped or beaten aww nah you dun heard bout dat time to time but I ain't neva did see it or had it dun ta me neither. The family was nice and treated us good. Q. But not the same? well, we wuz not de same but we wuz not beat like some ask, least I wasn't permalink parent award report block reply\nMAGALADON9 3 points 9 hours ago Ahh the good ol days. No but srsly there are recording of actual slaves talking about their treatment and it's NOT what you'd expect.  This one woman recounts Q. Were you ever whipped or beaten aww nah you dun heard bout dat time to time but I ain't neva did see it or had it dun ta me neither. The family was nice and treated us good. Q. But not the same? well, we wuz not de same but we wuz not beat like some ask, least I wasn't permalink parent award report block reply\njournalist 4 points 7 hours ago Lived in Japan for over four years and they are major litter bugs. permalink award report block reply pococurante 5 points 6 hours ago The one idiotic thing Japan does, there are no trash cans in public. They expect people to carry trash when them all day and put it in their own trash can when they get back home. permalink parent award report block reply\npococurante 5 points 6 hours ago The one idiotic thing Japan does, there are no trash cans in public. They expect people to carry trash when them all day and put it in their own trash can when they get back home. permalink parent award report block reply\nMarkstarr85 4 points 9 hours ago wont be long until they bar blacks permalink award report block reply\nlearntocode 4 points 3 hours ago I have this same sense from being a Boy Scout and being made unafraid of cleaning. We did alleys, campsites,  trails and when I owned a retail shop for a few years I was out scraping gum and sweeping every day. I found it to be great for my mental health, actually. permalink award report block reply chahn1138 3 points 3 hours ago You sound un-jabbed!  :0)  Bless you! permalink parent award report block reply\nchahn1138 3 points 3 hours ago You sound un-jabbed!  :0)  Bless you! permalink parent award report block reply\nSmurfection 3 points 7 hours ago AI vids.   I'd love to see a vid about Japan's dedication to cleanliness but the AI stuff just makes the vid lose all credibility. permalink award report block reply\nRedFoxOnFire 3 points 6 hours ago The thought process goes like this. Say there is an abandoned building, but it's clean.  No graffiti, no broken windows, no dirt or debris. Down the street there is another abandoned building, but this one is the opposite. Graffiti, broken windows, etc. A delinquent would be more likely to continue to vandalize the second one since others have already done so. But to be the first one to throw a rock or tag with spray paint not only requires a bit of extra courage, but might bring unwanted attention to themselves since someone is obviously keeping an eye one the place. Order encourages order and chaos encourages chaos. permalink award report block reply pococurante 4 points 5 hours ago Decades of Democrat mayors turned NYC into a filthy dump that people treated like a dump. Then in the 90s they elected a Republican who understood that, and NYC became clean and safe and prosperous for 20 years. Now the city is relapsing again. It's hard to understand why urban voters keep rejecting the party with a proven track record in favor of one that makes empty promises that are never fulfilled. permalink parent award report block reply\npococurante 4 points 5 hours ago Decades of Democrat mayors turned NYC into a filthy dump that people treated like a dump. Then in the 90s they elected a Republican who understood that, and NYC became clean and safe and prosperous for 20 years. Now the city is relapsing again. It's hard to understand why urban voters keep rejecting the party with a proven track record in favor of one that makes empty promises that are never fulfilled. permalink parent award report block reply\n26magarat 2 points 6 hours ago Dave Barry wrote a book about his visit to Japan. He joked that the Japanese consider Westerners to be like water buffalo, pooping all over their landscape. permalink award report block reply\nTheColonelsDaughter 2 points 6 hours ago Fortunately for Japan, they came to their senses while they still HAVE a culture to reflect. We've spent so long giving ours away, that it's all but vanished. ;o( permalink award report block reply\nSleeperAgentSupreme 2 points 4 hours ago That's what you can have as long as you have an overwhelmingly single ethnicity population. permalink award report block reply\nVermino 1 points 4 hours ago Already know a few problems: Water police in Nevada and banned phosphates in Washington. permalink award report block reply\nchahn1138 1 points 3 hours ago It is called \"Aiming High\" and I have Deep Respect for it! Arms Crossed! permalink award report block reply\nNoMaskNoMaster 1 points 49 minutes ago Keep in mind Whites invented all of this technology. It's time to kick the parasites out of the country and you knows who that is permalink award report block reply\nWatermelons 1 points 9 hours ago 5S permalink award report block reply\nShitsbrokeyo 1 points 7 hours ago I want that for our country permalink award report block reply\nOkieDoker 1 points 3 hours ago Hmmmmm 98% homogeneous you say? permalink award report block reply\nncswicn 1 points 5 hours ago Same for  Germany. permalink award report block reply\nMAGALADON9 0 points 9 hours ago REEEEEEEEEEEEEEEEEEE THEY NEED DIVERSITY!!!!!!!  AXIS POWER IS NAZI ADJACENT!!!!! REEEEEEEEEEEEEEEEEEE permalink award report block reply"}