{"id": "1ARK9hj6d6", "contents": "295 SICKENING!! Democrat Ro Khanna is averaging 17 stock trades per day at $16,500 per trade with a trading volume of over $562 million dollars! posted 2 days ago by kek_saved_the_world 8 comments award share report block Michelle #AmericaFirst @MichelleRM68 • 3d 🚨SICKENING!! Democrat Ro Khanna is averaging 17 stock trades per day at $16,500 per trade with a trading volume of over $562 million dollars! Why are Reps like Ro & Nancy Pelosi allowed to use their office to become multimillionaires? It's CRIMINAL!!👇\n8 comments Sort by Top Top New Worst Old Save Elon Walked Away – Now We Know Why Read More Ads by Ad.Style MastaJoda 13 points 2 days ago They are all allowed to do it, Rs like my POS Sen Markwanye MULLET, as long as they vote against American interests and help loot our treasury for the globalists and donors... Clearly its a reward for TREASON. permalink award report block reply NotYourMan 9 points 2 days ago Nancy is giving lessons on how to win in the market. permalink award report block reply Overtaxed 4 points 2 days ago Time to change my Autopilot profile. permalink award report block reply Roadpower 3 points 2 days ago Who is managing his accounts? permalink award report block reply reversethefraud 6 points 2 days ago Who is managing their accounts? is a better question. permalink parent award report block reply Roadpower 2 points 2 days ago I'm good with that to. permalink parent award report block reply npc_1234 3 points 2 days ago He must be a graduate of the Paul and Nancy Pelosi School of Finance. permalink award report block reply TheSwampThang 3 points 2 days ago It's incredible how congress and the senate is a place where people with almost no experience in investing suddenly develop their hidden skills to become legendary investors that always win on every bet. permalink award report block reply grenades_and_ham 2 points 2 days ago Dan Cyclops Crenshaw has been quiet. permalink parent award report block reply MapleMAGA 2 points 2 days ago I do about 20 trades per year and luck if I make 20k… sad! These people are getting away with so much, how fast would we be in jail? permalink award report block reply\nMastaJoda 13 points 2 days ago They are all allowed to do it, Rs like my POS Sen Markwanye MULLET, as long as they vote against American interests and help loot our treasury for the globalists and donors... Clearly its a reward for TREASON. permalink award report block reply\nNotYourMan 9 points 2 days ago Nancy is giving lessons on how to win in the market. permalink award report block reply\nOvertaxed 4 points 2 days ago Time to change my Autopilot profile. permalink award report block reply\nRoadpower 3 points 2 days ago Who is managing his accounts? permalink award report block reply reversethefraud 6 points 2 days ago Who is managing their accounts? is a better question. permalink parent award report block reply Roadpower 2 points 2 days ago I'm good with that to. permalink parent award report block reply\nreversethefraud 6 points 2 days ago Who is managing their accounts? is a better question. permalink parent award report block reply Roadpower 2 points 2 days ago I'm good with that to. permalink parent award report block reply\nRoadpower 2 points 2 days ago I'm good with that to. permalink parent award report block reply\nnpc_1234 3 points 2 days ago He must be a graduate of the Paul and Nancy Pelosi School of Finance. permalink award report block reply\nTheSwampThang 3 points 2 days ago It's incredible how congress and the senate is a place where people with almost no experience in investing suddenly develop their hidden skills to become legendary investors that always win on every bet. permalink award report block reply grenades_and_ham 2 points 2 days ago Dan Cyclops Crenshaw has been quiet. permalink parent award report block reply\ngrenades_and_ham 2 points 2 days ago Dan Cyclops Crenshaw has been quiet. permalink parent award report block reply\nMapleMAGA 2 points 2 days ago I do about 20 trades per year and luck if I make 20k… sad! These people are getting away with so much, how fast would we be in jail? permalink award report block reply"}