{"id": "1ARK9pgy4F", "contents": "13 That's almost half a mortgage! posted 26 minutes ago by Pkvi_redeux 4 comments award share report block Dominic Michael Tripi @DMichaelTripi • 59m BREAKING: Israel seeks 20-year military aid deal with US with \"America First\" tweaks. -Axios\n4 comments Sort by Top Top New Worst Old Save Around the Web SpeekFreely 3 points 7 minutes ago An effort to connect them to the future generations of leadership. I’m surprised they didn’t do the typical 99 years. permalink award report block reply FlgPole 1 points 24 minutes ago God must not be so powerful. Imagine being God's chosen people and having to bed for money because God chose to leave you poor. permalink award report block reply JoeBidensDementia1 2 points 15 minutes ago They really don't need to beg since Trump just keeps giving them shit these days. permalink parent award report block reply FlgPole 1 points 9 minutes ago the fact they need it in the first place proves the God they control is the ego. permalink parent award report block reply\nSpeekFreely 3 points 7 minutes ago An effort to connect them to the future generations of leadership. I’m surprised they didn’t do the typical 99 years. permalink award report block reply\nFlgPole 1 points 24 minutes ago God must not be so powerful. Imagine being God's chosen people and having to bed for money because God chose to leave you poor. permalink award report block reply JoeBidensDementia1 2 points 15 minutes ago They really don't need to beg since Trump just keeps giving them shit these days. permalink parent award report block reply FlgPole 1 points 9 minutes ago the fact they need it in the first place proves the God they control is the ego. permalink parent award report block reply\nJoeBidensDementia1 2 points 15 minutes ago They really don't need to beg since Trump just keeps giving them shit these days. permalink parent award report block reply FlgPole 1 points 9 minutes ago the fact they need it in the first place proves the God they control is the ego. permalink parent award report block reply\nFlgPole 1 points 9 minutes ago the fact they need it in the first place proves the God they control is the ego. permalink parent award report block reply"}