{"id": "1ARK9pghHj", "contents": "31 WTF is going on? posted 1 hour ago by k-doe3 11 comments award share report block Eric Daugherty @EricLDaugh • 2h 🚨 BREAKING: FBI Deputy Director Dan Bongino SCORCHES Rep. Thomas Massie for insinuating his FBI is \"retaliating\" against a whistleblower in the J6 pipe bomb investigation Bongino posted RECEIPTS that Massie is IGNORING his call. \"This is disgusting, even by the low standards\n11 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style PresElectKekPede 7 points 54 minutes ago Everything we wanted to happen isn’t, and it never was going to. That’s what is going on. permalink award report block reply JoePlumber 3 points 56 minutes ago I don't trust Bongino or Patel at all anymore. permalink award report block reply eclectic22 1 points 58 minutes ago Massie the asshole being the asshole. permalink award report block reply newestofnew 1 points 57 minutes ago my migga permalink parent award report block reply Porkbut 0 points 5 minutes ago Hello trantifa! permalink parent award report block reply newestofnew 0 points 58 minutes ago I don't agree with Massie, but he doesn't lie. If he lied he would make life a lot easier for himself. Bongino on the other hand hasn't stopped lying since taking office. permalink award report block reply Jthenk 5 points 34 minutes ago All politicians lie permalink parent award report block reply Porkbut 3 points 6 minutes ago Dumbest take of the century. Maybe millennia. permalink parent award report block reply TakingCoatsWIN 1 points 3 minutes ago The glaze is thick. permalink parent award report block reply Darkpoisonousshaddow 0 points 57 minutes ago They are out to get Massie, I feel for the guy. permalink award report block reply Darkpoisonousshaddow -4 points 55 minutes ago I've just seen the letter, Massie is telling the truth. permalink award report block reply\nPresElectKekPede 7 points 54 minutes ago Everything we wanted to happen isn’t, and it never was going to. That’s what is going on. permalink award report block reply\nJoePlumber 3 points 56 minutes ago I don't trust Bongino or Patel at all anymore. permalink award report block reply\neclectic22 1 points 58 minutes ago Massie the asshole being the asshole. permalink award report block reply newestofnew 1 points 57 minutes ago my migga permalink parent award report block reply Porkbut 0 points 5 minutes ago Hello trantifa! permalink parent award report block reply\nnewestofnew 1 points 57 minutes ago my migga permalink parent award report block reply Porkbut 0 points 5 minutes ago Hello trantifa! permalink parent award report block reply\nPorkbut 0 points 5 minutes ago Hello trantifa! permalink parent award report block reply\nnewestofnew 0 points 58 minutes ago I don't agree with Massie, but he doesn't lie. If he lied he would make life a lot easier for himself. Bongino on the other hand hasn't stopped lying since taking office. permalink award report block reply Jthenk 5 points 34 minutes ago All politicians lie permalink parent award report block reply Porkbut 3 points 6 minutes ago Dumbest take of the century. Maybe millennia. permalink parent award report block reply TakingCoatsWIN 1 points 3 minutes ago The glaze is thick. permalink parent award report block reply\nJthenk 5 points 34 minutes ago All politicians lie permalink parent award report block reply\nPorkbut 3 points 6 minutes ago Dumbest take of the century. Maybe millennia. permalink parent award report block reply\nTakingCoatsWIN 1 points 3 minutes ago The glaze is thick. permalink parent award report block reply\nDarkpoisonousshaddow 0 points 57 minutes ago They are out to get Massie, I feel for the guy. permalink award report block reply\nDarkpoisonousshaddow -4 points 55 minutes ago I've just seen the letter, Massie is telling the truth. permalink award report block reply"}