{"id": "1ARK9pfbHw", "contents": "26 The left is pushing another desperate anti-Trump hoax – a false Epstein smear campaign (nypost.com) posted 8 hours ago by LearnAboutRoaches 8 comments award share report block Miranda Devine: The left is pushing another desperate anti-Trump hoax – a false Epstein smear campaign Democrats are back in Congress after their shutdown to launch another anti-Trump hoax. nypost.com\n8 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno SubmarineGuy 2 points 4 hours ago It appears to be organized. Most of the anti Trump tweets I see on Twitter are using the Epstein smear tactic.  Could even be automated bots. permalink award report block reply patrioticwinning3 2 points 8 hours ago Lol we don't need dems to push \"hoaxes\" Trump is already shooting himself in the foot with his love of H1Bs and Chicom students! XD permalink award report block reply LearnAboutRoaches OP -3 points 8 hours ago ^ Said no one except you and the little bluesky shill army you came here with tonight permalink parent award report block reply patrioticwinning3 3 points 7 hours ago Found the faggot poojeet trolling from India! permalink parent award report block reply LearnAboutRoaches OP -1 points 7 hours ago Lol permalink parent award report block reply Texasnumber1 1 points 8 hours ago That's literally all they have they never demanded anything from their beloved savior Joe Biden the crazy thing is you have some people that call themselves Trump supporters perrating the same talking points permalink award report block reply jakebrake 1 points 4 hours ago President Trump could have released everything on day one.\nAnd I mean everything, even the burn bags hiding under a desk in a back room. The longer this goes on the more they'll use it to deflect or change the narrative. And yet they wonder why there are conspiracy theories. permalink award report block reply conservativefrank 1 points 2 hours ago What is everything? No matter what is released, people will claim something is being withheld because someone they don't like isn't shown as being involved in sex with kids. permalink parent award report block reply LearnAboutRoaches OP 1 points 4 hours ago \"Everything\" I don't wonder why there are conspiracy theories. Those like indians and guatemalans will not ever stop being produced. What I do wonder however is how is it that you can't understand that the president is privy to information that we will never know, and that he does what he does based on that. We elect a representitive we trust to represent us the most, and then they go and take care of the complicated business. You either trust him to do what's right or you think he's a big fat fucking liar. Guess which one I choose permalink parent award report block reply\nSubmarineGuy 2 points 4 hours ago It appears to be organized. Most of the anti Trump tweets I see on Twitter are using the Epstein smear tactic.  Could even be automated bots. permalink award report block reply\npatrioticwinning3 2 points 8 hours ago Lol we don't need dems to push \"hoaxes\" Trump is already shooting himself in the foot with his love of H1Bs and Chicom students! XD permalink award report block reply LearnAboutRoaches OP -3 points 8 hours ago ^ Said no one except you and the little bluesky shill army you came here with tonight permalink parent award report block reply patrioticwinning3 3 points 7 hours ago Found the faggot poojeet trolling from India! permalink parent award report block reply LearnAboutRoaches OP -1 points 7 hours ago Lol permalink parent award report block reply\nLearnAboutRoaches OP -3 points 8 hours ago ^ Said no one except you and the little bluesky shill army you came here with tonight permalink parent award report block reply patrioticwinning3 3 points 7 hours ago Found the faggot poojeet trolling from India! permalink parent award report block reply LearnAboutRoaches OP -1 points 7 hours ago Lol permalink parent award report block reply\npatrioticwinning3 3 points 7 hours ago Found the faggot poojeet trolling from India! permalink parent award report block reply LearnAboutRoaches OP -1 points 7 hours ago Lol permalink parent award report block reply\nLearnAboutRoaches OP -1 points 7 hours ago Lol permalink parent award report block reply\nTexasnumber1 1 points 8 hours ago That's literally all they have they never demanded anything from their beloved savior Joe Biden the crazy thing is you have some people that call themselves Trump supporters perrating the same talking points permalink award report block reply\njakebrake 1 points 4 hours ago President Trump could have released everything on day one.\nAnd I mean everything, even the burn bags hiding under a desk in a back room. The longer this goes on the more they'll use it to deflect or change the narrative. And yet they wonder why there are conspiracy theories. permalink award report block reply conservativefrank 1 points 2 hours ago What is everything? No matter what is released, people will claim something is being withheld because someone they don't like isn't shown as being involved in sex with kids. permalink parent award report block reply LearnAboutRoaches OP 1 points 4 hours ago \"Everything\" I don't wonder why there are conspiracy theories. Those like indians and guatemalans will not ever stop being produced. What I do wonder however is how is it that you can't understand that the president is privy to information that we will never know, and that he does what he does based on that. We elect a representitive we trust to represent us the most, and then they go and take care of the complicated business. You either trust him to do what's right or you think he's a big fat fucking liar. Guess which one I choose permalink parent award report block reply\nconservativefrank 1 points 2 hours ago What is everything? No matter what is released, people will claim something is being withheld because someone they don't like isn't shown as being involved in sex with kids. permalink parent award report block reply\nLearnAboutRoaches OP 1 points 4 hours ago \"Everything\" I don't wonder why there are conspiracy theories. Those like indians and guatemalans will not ever stop being produced. What I do wonder however is how is it that you can't understand that the president is privy to information that we will never know, and that he does what he does based on that. We elect a representitive we trust to represent us the most, and then they go and take care of the complicated business. You either trust him to do what's right or you think he's a big fat fucking liar. Guess which one I choose permalink parent award report block reply"}