{"id": "1ARK9oWejm", "contents": "20 Jian, 33, was arrested in June and accused of conspiring to study and nurse a toxic fungus at a (U of M) lab. A pathogen known as Fusarium graminearum can attack wheat, barley, maize and rice. She was caught carrying small samples while arriving at a Detroit airport in 2024. She will be deported. (www.detroitnews.com) posted 2 hours ago by MIMAGA 4 comments award share report block www.detroitnews.com\n4 comments Sort by Top Top New Worst Old Save Around the Web Doctor: A Teaspoon Kills All Worms in Your Body! Paratoxil MIMAGA OP 2 points 2 hours ago https://www.detroitnews.com/story/news/local/michigan/2025/11/12/chinese-scientist-yunqing-jian-pleads-guilty-smuggling-case/87238134007/ \"As of 2025, Chinese companies own approximately 265,000 to 277,000 acres of U.S. farmland, according to the most recent USDA data.\" permalink award report block reply ReleasetheList 2 points 2 hours ago Isn't she like the 3rd or 4th one of these this year alone? You know what sounds like a good idea? Inviting 600k more of them. permalink award report block reply Blackmore 2 points 1 hour ago I think you do not need these spies here in the UNITED STATES, when you can get : “willing americans to work here in thebUS” permalink parent award report block reply Wizard_Glick 2 points 1 hour ago She should be hanged... permalink award report block reply\nMIMAGA OP 2 points 2 hours ago https://www.detroitnews.com/story/news/local/michigan/2025/11/12/chinese-scientist-yunqing-jian-pleads-guilty-smuggling-case/87238134007/ \"As of 2025, Chinese companies own approximately 265,000 to 277,000 acres of U.S. farmland, according to the most recent USDA data.\" permalink award report block reply\nReleasetheList 2 points 2 hours ago Isn't she like the 3rd or 4th one of these this year alone? You know what sounds like a good idea? Inviting 600k more of them. permalink award report block reply Blackmore 2 points 1 hour ago I think you do not need these spies here in the UNITED STATES, when you can get : “willing americans to work here in thebUS” permalink parent award report block reply\nBlackmore 2 points 1 hour ago I think you do not need these spies here in the UNITED STATES, when you can get : “willing americans to work here in thebUS” permalink parent award report block reply\nWizard_Glick 2 points 1 hour ago She should be hanged... permalink award report block reply"}