{"id": "1ARK56kvti", "contents": "384 Mexican Who Illegally Voted, Elected Mayor in Kansas Town. Not only do non-citizens vote, they hold elected office. (www.frontpagemag.com) posted 4 days ago by rdvs34283 8 comments award share report block Mexican Who Illegally Voted, Elected Mayor in Kansas Town | Frontpage Mag Not only do non-citizens vote, they hold elected office. www.frontpagemag.com\n8 comments Sort by Top Top New Worst Old Save Around the Web The Killer of Baldness Has Been Found! (Try This at Home) HaloGrow ContendersEdge 6 points 4 days ago For those of you who haven't heard, his electoral victory was short lived as he could now face most of his term in prison but that is not enough.  He needs to be deported. permalink award report block reply TearsAficionado 4 points 4 days ago I will gladly pay my taxes to ensure fuckers like this faggot sit in prison for a sentence before just being happily deported back to their shithole country. There must be punishment before a free ticket home. If we have to bear the burden to pay for it, I accept that. Gotta break some eggs to make an omelet. permalink parent award report block reply ContendersEdge 2 points 4 days ago You have to give the KS authorities a lot of credit on this one.  They wasted no time at all. permalink parent award report block reply bill_in_texas 2 points 4 days ago If he's guilty of the felony of illegally voting, pull his green card, then send him to serve his sentence at CECOT, cheaper than imprisoning him here, then deport him wherever he's from after his release from CECOT. permalink parent award report block reply BillGateCanSuckIt 3 points 4 days ago It shouldn't be hard to look at illegals who are in office to find something illegal and kick them out. Same applies to immigrants who are in office. 100% guaranteed fraud and other illegal things are occuring by said individual permalink award report block reply Reefay 1 points 4 days ago I would think just being illegal would be enough to kick the illegal out 🤷‍♂️ permalink parent award report block reply patrioticwinning3 1 points 4 days ago Where's tough talkin' Tommy Boi? permalink award report block reply bill_in_texas 1 points 4 days ago This seems cut and dry, like either being pregnant or not.  He's a green card holder, I take it, so he can't legally vote here.  If he did, that's a crime that should result in having his green card revoked and having him deported. He's still here, so either the story is garbage, or, like Ilhan Omar, he's untouchable for some reason. permalink award report block reply\nContendersEdge 6 points 4 days ago For those of you who haven't heard, his electoral victory was short lived as he could now face most of his term in prison but that is not enough.  He needs to be deported. permalink award report block reply TearsAficionado 4 points 4 days ago I will gladly pay my taxes to ensure fuckers like this faggot sit in prison for a sentence before just being happily deported back to their shithole country. There must be punishment before a free ticket home. If we have to bear the burden to pay for it, I accept that. Gotta break some eggs to make an omelet. permalink parent award report block reply ContendersEdge 2 points 4 days ago You have to give the KS authorities a lot of credit on this one.  They wasted no time at all. permalink parent award report block reply bill_in_texas 2 points 4 days ago If he's guilty of the felony of illegally voting, pull his green card, then send him to serve his sentence at CECOT, cheaper than imprisoning him here, then deport him wherever he's from after his release from CECOT. permalink parent award report block reply\nTearsAficionado 4 points 4 days ago I will gladly pay my taxes to ensure fuckers like this faggot sit in prison for a sentence before just being happily deported back to their shithole country. There must be punishment before a free ticket home. If we have to bear the burden to pay for it, I accept that. Gotta break some eggs to make an omelet. permalink parent award report block reply ContendersEdge 2 points 4 days ago You have to give the KS authorities a lot of credit on this one.  They wasted no time at all. permalink parent award report block reply\nContendersEdge 2 points 4 days ago You have to give the KS authorities a lot of credit on this one.  They wasted no time at all. permalink parent award report block reply\nbill_in_texas 2 points 4 days ago If he's guilty of the felony of illegally voting, pull his green card, then send him to serve his sentence at CECOT, cheaper than imprisoning him here, then deport him wherever he's from after his release from CECOT. permalink parent award report block reply\nBillGateCanSuckIt 3 points 4 days ago It shouldn't be hard to look at illegals who are in office to find something illegal and kick them out. Same applies to immigrants who are in office. 100% guaranteed fraud and other illegal things are occuring by said individual permalink award report block reply Reefay 1 points 4 days ago I would think just being illegal would be enough to kick the illegal out 🤷‍♂️ permalink parent award report block reply\nReefay 1 points 4 days ago I would think just being illegal would be enough to kick the illegal out 🤷‍♂️ permalink parent award report block reply\npatrioticwinning3 1 points 4 days ago Where's tough talkin' Tommy Boi? permalink award report block reply\nbill_in_texas 1 points 4 days ago This seems cut and dry, like either being pregnant or not.  He's a green card holder, I take it, so he can't legally vote here.  If he did, that's a crime that should result in having his green card revoked and having him deported. He's still here, so either the story is garbage, or, like Ilhan Omar, he's untouchable for some reason. permalink award report block reply"}