{"id": "1ARK9l810T", "contents": "436 TOP KEK 👌💯🤣🤣🤣🤣🤣 posted 1 day ago by Prandogolio 24 comments award share download report block\n24 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Wide_Peepo_Happy 14 points 1 day ago Go back even farther to the peak of luxury when there was a cig lighter and ash tray on every door. permalink award report block reply empiretc 7 points 1 day ago yep, this. our 1965 cadilllac had that permalink parent award report block reply NippleSalad 7 points 1 day ago I wouldn't call my car smelling like ass luxury. permalink parent award report block reply bricvic 24 points 1 day ago If your ass smells like cigarettes, you're smoking them wrong chief. permalink parent award report block reply CrustySockpuppet 10 points 1 day ago Lmfao permalink parent award report block reply Rerun1Central 13 points 1 day ago I can smell the cigarette smoke permalink award report block reply TEXinLA 11 points 1 day ago Solid  \"thud\" when it shut... permalink award report block reply killedmytv 7 points 1 day ago You could bounce a cruise missile off the 600 pound doors of one of those two door land yachts and it'd make the same thud... I had my ankle slammed in the door of a Cadillac coupe once while trying to get out of the back seat. I don't want to go through that experience again. permalink parent award report block reply KilroyJCNJ 5 points 24 hours ago At least you still have your ankle so that you could *potentially * go through that experience again 🤣😂🤣 permalink parent award report block reply IBentMyWookie 10 points 1 day ago In the 90’s, My family’s Caprice Classic was in a highway pile up - foggy bridge where someone didn’t slow down and slammed into stopped cars. Other cars were a wreck but we literally just had a bent license plate. permalink award report block reply Gulleyfoyleismyname 7 points 1 day ago God help you if the wind blew it closed on your legs. Ask me how I know. 🤣🤣🤣 permalink award report block reply vfr2imc 5 points 22 hours ago Cars are heavier than ever now lol. People are so dumb. permalink award report block reply Standingoak 5 points 17 hours ago No one cares about EV's permalink parent award report block reply vfr2imc 1 points 31 minutes ago Non EVs too you dumbass. permalink parent award report block reply KilroyJCNJ 5 points 24 hours ago And replacing the hinge pin bushings by yourself — without any specialized equipment - was quite the interesting exercise… permalink award report block reply noPTSDforMePlease 4 points 21 hours ago I'm an old millennial and I'm the youngest one here, arent I. Goddamn it. permalink award report block reply Standingoak 4 points 17 hours ago Until you have jumped up and down on the roof of a DeSoto without bending it , you're the youngest permalink parent award report block reply Synonymity 3 points 20 hours ago Fleetwood Brougham permalink award report block reply JamesBlomey 1 points 23 hours ago GM! permalink award report block reply nmipede 1 points 23 hours ago I'm going to guess Mopar mid '70's. permalink award report block reply entERmyMAtrix 1 points 23 hours ago lol permalink award report block reply somecunt 1 points 15 hours ago Nope. Daily driving a 40 year old Landcruiser. permalink award report block reply Megabrain1960 1 points 11 hours ago A few years after my uncle passed away, I bought his 1977 2-door Lincoln Towne Coupe from my cousin. The car was 17.5' long and weighted 5200 lbs.  He still had the window sticker from the dealer.  It cost around $5500 in '77, about a dollar a pound!  The 460 cu.in. beast of a motor got 10 mpg. The doors were about a foot thick and close to 5' long!  It was pale yellow, with a full black vinyl top.  Black leather interior.  You should have seen my five foot tall wife driving it!  LOL\nWhat a ride!  Kind of like this... https://www.hemmings.com/stories/the-1977-lincoln-continental-town-coupe-was-bigger-and-cheaper-than-the-mk-v-but-at-least-it-didnt-sell-more/ permalink award report block reply DITTOPatriot 1 points 22 hours ago 1973 LTD permalink award report block reply Justjayce 1 points 21 hours ago Looks like a Buick Roadmaster permalink award report block reply\nWide_Peepo_Happy 14 points 1 day ago Go back even farther to the peak of luxury when there was a cig lighter and ash tray on every door. permalink award report block reply empiretc 7 points 1 day ago yep, this. our 1965 cadilllac had that permalink parent award report block reply NippleSalad 7 points 1 day ago I wouldn't call my car smelling like ass luxury. permalink parent award report block reply bricvic 24 points 1 day ago If your ass smells like cigarettes, you're smoking them wrong chief. permalink parent award report block reply CrustySockpuppet 10 points 1 day ago Lmfao permalink parent award report block reply\nempiretc 7 points 1 day ago yep, this. our 1965 cadilllac had that permalink parent award report block reply\nNippleSalad 7 points 1 day ago I wouldn't call my car smelling like ass luxury. permalink parent award report block reply bricvic 24 points 1 day ago If your ass smells like cigarettes, you're smoking them wrong chief. permalink parent award report block reply CrustySockpuppet 10 points 1 day ago Lmfao permalink parent award report block reply\nbricvic 24 points 1 day ago If your ass smells like cigarettes, you're smoking them wrong chief. permalink parent award report block reply CrustySockpuppet 10 points 1 day ago Lmfao permalink parent award report block reply\nCrustySockpuppet 10 points 1 day ago Lmfao permalink parent award report block reply\nRerun1Central 13 points 1 day ago I can smell the cigarette smoke permalink award report block reply\nTEXinLA 11 points 1 day ago Solid  \"thud\" when it shut... permalink award report block reply killedmytv 7 points 1 day ago You could bounce a cruise missile off the 600 pound doors of one of those two door land yachts and it'd make the same thud... I had my ankle slammed in the door of a Cadillac coupe once while trying to get out of the back seat. I don't want to go through that experience again. permalink parent award report block reply KilroyJCNJ 5 points 24 hours ago At least you still have your ankle so that you could *potentially * go through that experience again 🤣😂🤣 permalink parent award report block reply\nkilledmytv 7 points 1 day ago You could bounce a cruise missile off the 600 pound doors of one of those two door land yachts and it'd make the same thud... I had my ankle slammed in the door of a Cadillac coupe once while trying to get out of the back seat. I don't want to go through that experience again. permalink parent award report block reply KilroyJCNJ 5 points 24 hours ago At least you still have your ankle so that you could *potentially * go through that experience again 🤣😂🤣 permalink parent award report block reply\nKilroyJCNJ 5 points 24 hours ago At least you still have your ankle so that you could *potentially * go through that experience again 🤣😂🤣 permalink parent award report block reply\nIBentMyWookie 10 points 1 day ago In the 90’s, My family’s Caprice Classic was in a highway pile up - foggy bridge where someone didn’t slow down and slammed into stopped cars. Other cars were a wreck but we literally just had a bent license plate. permalink award report block reply\nGulleyfoyleismyname 7 points 1 day ago God help you if the wind blew it closed on your legs. Ask me how I know. 🤣🤣🤣 permalink award report block reply\nvfr2imc 5 points 22 hours ago Cars are heavier than ever now lol. People are so dumb. permalink award report block reply Standingoak 5 points 17 hours ago No one cares about EV's permalink parent award report block reply vfr2imc 1 points 31 minutes ago Non EVs too you dumbass. permalink parent award report block reply\nStandingoak 5 points 17 hours ago No one cares about EV's permalink parent award report block reply vfr2imc 1 points 31 minutes ago Non EVs too you dumbass. permalink parent award report block reply\nvfr2imc 1 points 31 minutes ago Non EVs too you dumbass. permalink parent award report block reply\nKilroyJCNJ 5 points 24 hours ago And replacing the hinge pin bushings by yourself — without any specialized equipment - was quite the interesting exercise… permalink award report block reply\nnoPTSDforMePlease 4 points 21 hours ago I'm an old millennial and I'm the youngest one here, arent I. Goddamn it. permalink award report block reply Standingoak 4 points 17 hours ago Until you have jumped up and down on the roof of a DeSoto without bending it , you're the youngest permalink parent award report block reply\nStandingoak 4 points 17 hours ago Until you have jumped up and down on the roof of a DeSoto without bending it , you're the youngest permalink parent award report block reply\nSynonymity 3 points 20 hours ago Fleetwood Brougham permalink award report block reply\nJamesBlomey 1 points 23 hours ago GM! permalink award report block reply\nnmipede 1 points 23 hours ago I'm going to guess Mopar mid '70's. permalink award report block reply\nentERmyMAtrix 1 points 23 hours ago lol permalink award report block reply\nsomecunt 1 points 15 hours ago Nope. Daily driving a 40 year old Landcruiser. permalink award report block reply\nMegabrain1960 1 points 11 hours ago A few years after my uncle passed away, I bought his 1977 2-door Lincoln Towne Coupe from my cousin. The car was 17.5' long and weighted 5200 lbs.  He still had the window sticker from the dealer.  It cost around $5500 in '77, about a dollar a pound!  The 460 cu.in. beast of a motor got 10 mpg. The doors were about a foot thick and close to 5' long!  It was pale yellow, with a full black vinyl top.  Black leather interior.  You should have seen my five foot tall wife driving it!  LOL\nWhat a ride!  Kind of like this... https://www.hemmings.com/stories/the-1977-lincoln-continental-town-coupe-was-bigger-and-cheaper-than-the-mk-v-but-at-least-it-didnt-sell-more/ permalink award report block reply\nDITTOPatriot 1 points 22 hours ago 1973 LTD permalink award report block reply\nJustjayce 1 points 21 hours ago Looks like a Buick Roadmaster permalink award report block reply"}