{"id": "1ARK57sEDr", "contents": "304 Scenes From A Communist Restaurant: You will never see this picture on a T-shirt posted 4 days ago by JackStraw1021 8 comments award share report block Lucinda @AZRetirees • 4d This is socialism/communism\n8 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style Skywise 18 points 4 days ago Perhaps we should put this picture on a shirt and sell it and wear them... permalink award report block reply ChyNahAzzWhole1 -5 points 4 days ago Catholic Priest working for the atheist communist, NOT the sheep of his flock. permalink award report block reply Ronaldus -11 points 4 days ago Roman Catholics and their unbiblical last rites. A reformer would have died a martyr defending the farmer. permalink award report block reply ancroidubh 4 points 3 days ago And all of Protestantism is built upon apostasy and heresy by an oath-breaking serial adulterer permalink parent award report block reply Ronaldus -3 points 3 days ago There is no such thing as protestantism. See how ignorant you are? You're building a straw man and trying to fight it. THIS is PAGAN HEATHEN ROMAN CATHOLICISM, right out of your catechism: \"The plan of salvation also includes those who acknowledge the Creator, in the first place amongst whom are the Muslims. Those also can attain to salvation who through no fault of their own do not know the Gospel of Christ or His Church, yet sincerely seek God and moved by grace strive by their deeds to do His will as it is known to them through the dictates of conscience.\" So you can whine and pee your diaper and make up things and cry, but I can pull out quotes from YOUR BIBLE and even the actual Bible over and over again to prove that all of your doctrines are Satanic. I have receipts by the millions on your cult. Because I know it better than you do. permalink parent award report block reply ancroidubh 4 points 3 days ago The great theologian speaks… nonsense. Wipe your mouth, there’s still a little shit on your lips. permalink parent award report block reply TwoArizonaPedes 5 points 3 days ago He doesn't understand. Just keep reporting him and praying for him. permalink parent award report block reply Ronaldus -2 points 3 days ago And yet, you speak... Nothing. You have nothing. You earned your L with gusto. permalink parent award report block reply\nSkywise 18 points 4 days ago Perhaps we should put this picture on a shirt and sell it and wear them... permalink award report block reply\nChyNahAzzWhole1 -5 points 4 days ago Catholic Priest working for the atheist communist, NOT the sheep of his flock. permalink award report block reply\nRonaldus -11 points 4 days ago Roman Catholics and their unbiblical last rites. A reformer would have died a martyr defending the farmer. permalink award report block reply ancroidubh 4 points 3 days ago And all of Protestantism is built upon apostasy and heresy by an oath-breaking serial adulterer permalink parent award report block reply Ronaldus -3 points 3 days ago There is no such thing as protestantism. See how ignorant you are? You're building a straw man and trying to fight it. THIS is PAGAN HEATHEN ROMAN CATHOLICISM, right out of your catechism: \"The plan of salvation also includes those who acknowledge the Creator, in the first place amongst whom are the Muslims. Those also can attain to salvation who through no fault of their own do not know the Gospel of Christ or His Church, yet sincerely seek God and moved by grace strive by their deeds to do His will as it is known to them through the dictates of conscience.\" So you can whine and pee your diaper and make up things and cry, but I can pull out quotes from YOUR BIBLE and even the actual Bible over and over again to prove that all of your doctrines are Satanic. I have receipts by the millions on your cult. Because I know it better than you do. permalink parent award report block reply ancroidubh 4 points 3 days ago The great theologian speaks… nonsense. Wipe your mouth, there’s still a little shit on your lips. permalink parent award report block reply TwoArizonaPedes 5 points 3 days ago He doesn't understand. Just keep reporting him and praying for him. permalink parent award report block reply Ronaldus -2 points 3 days ago And yet, you speak... Nothing. You have nothing. You earned your L with gusto. permalink parent award report block reply\nancroidubh 4 points 3 days ago And all of Protestantism is built upon apostasy and heresy by an oath-breaking serial adulterer permalink parent award report block reply Ronaldus -3 points 3 days ago There is no such thing as protestantism. See how ignorant you are? You're building a straw man and trying to fight it. THIS is PAGAN HEATHEN ROMAN CATHOLICISM, right out of your catechism: \"The plan of salvation also includes those who acknowledge the Creator, in the first place amongst whom are the Muslims. Those also can attain to salvation who through no fault of their own do not know the Gospel of Christ or His Church, yet sincerely seek God and moved by grace strive by their deeds to do His will as it is known to them through the dictates of conscience.\" So you can whine and pee your diaper and make up things and cry, but I can pull out quotes from YOUR BIBLE and even the actual Bible over and over again to prove that all of your doctrines are Satanic. I have receipts by the millions on your cult. Because I know it better than you do. permalink parent award report block reply ancroidubh 4 points 3 days ago The great theologian speaks… nonsense. Wipe your mouth, there’s still a little shit on your lips. permalink parent award report block reply TwoArizonaPedes 5 points 3 days ago He doesn't understand. Just keep reporting him and praying for him. permalink parent award report block reply Ronaldus -2 points 3 days ago And yet, you speak... Nothing. You have nothing. You earned your L with gusto. permalink parent award report block reply\nRonaldus -3 points 3 days ago There is no such thing as protestantism. See how ignorant you are? You're building a straw man and trying to fight it. THIS is PAGAN HEATHEN ROMAN CATHOLICISM, right out of your catechism: \"The plan of salvation also includes those who acknowledge the Creator, in the first place amongst whom are the Muslims. Those also can attain to salvation who through no fault of their own do not know the Gospel of Christ or His Church, yet sincerely seek God and moved by grace strive by their deeds to do His will as it is known to them through the dictates of conscience.\" So you can whine and pee your diaper and make up things and cry, but I can pull out quotes from YOUR BIBLE and even the actual Bible over and over again to prove that all of your doctrines are Satanic. I have receipts by the millions on your cult. Because I know it better than you do. permalink parent award report block reply ancroidubh 4 points 3 days ago The great theologian speaks… nonsense. Wipe your mouth, there’s still a little shit on your lips. permalink parent award report block reply TwoArizonaPedes 5 points 3 days ago He doesn't understand. Just keep reporting him and praying for him. permalink parent award report block reply Ronaldus -2 points 3 days ago And yet, you speak... Nothing. You have nothing. You earned your L with gusto. permalink parent award report block reply\nancroidubh 4 points 3 days ago The great theologian speaks… nonsense. Wipe your mouth, there’s still a little shit on your lips. permalink parent award report block reply TwoArizonaPedes 5 points 3 days ago He doesn't understand. Just keep reporting him and praying for him. permalink parent award report block reply Ronaldus -2 points 3 days ago And yet, you speak... Nothing. You have nothing. You earned your L with gusto. permalink parent award report block reply\nTwoArizonaPedes 5 points 3 days ago He doesn't understand. Just keep reporting him and praying for him. permalink parent award report block reply\nRonaldus -2 points 3 days ago And yet, you speak... Nothing. You have nothing. You earned your L with gusto. permalink parent award report block reply"}