{"id": "1ARK9hiHPk", "contents": "952 I am becoming more and more convinced that the vast majority of America’s problems could be solved by deporting illegal aliens. \n What am I missing here? posted 2 days ago by CyanScales 67 comments award share report block Matt Van Swol @mattvanswol • 3d I am becoming more and more convinced that the vast majority of America’s problems could be solved by deporting illegal aliens. - Housing - Healthcare - Wages - Inflation - Traffic - Huge amounts of crime What am I missing here?\n67 comments Sort by Top Top New Worst Old Save USMC6541E5 23 points 2 days ago What a mind blowing concept!!! permalink award report block reply KilroyJCNJ 11 points 2 days ago Van Swol is a convert. Hurricane Helene opened his eyes. permalink parent award report block reply Granny 8 points 2 days ago Missing? There are so many entities that are making big profits off the illegals, and that's why it's like pulling teeth to get rid of them. Another Pede just pointed out how much $$ Pepsi is making from SNAP recipients. The whole food industry, along with housing, health care, etc are making windfall profits at the taxpayers' expense, due to our financing the presence of the illegal hordes. Then the lobbyists in DC will not allow this great cash flow to be removed!!! permalink parent award report block reply Transparency 1 points 2 days ago Another Pede just pointed out how much $$ Pepsi is making from SNAP recipients. Got a link? permalink parent award report block reply DeportThemAllForever -2 points 2 days ago This, every builder out here (red state btw) uses illegals.  I submit info to ice, so far nothing.  All you got to do is show up during construction. Then we have a fiber optic company “tdscable”, all illegals there laying cable, not a word of English. Disgusting how they managed to replace Americans with illegals everywhere, exploded social safety nets, and take no responsibility for these societal costs. permalink parent award report block reply farangbak 3 points 2 days ago Common sense is not so common.............. permalink parent award report block reply free-will-of-choice 15 points 2 days ago What am I missing here? That aliens pretending to be natives are running the migration scheme to generate problems to sell even more problematic solutions. permalink award report block reply Leporidae 4 points 2 days ago Riddle me this, it hits close to home.\nWho opens our borders, but closes their own? permalink parent award report block reply EADReddit 13 points 2 days ago send the blacks with em.... permalink award report block reply ChrisSuperDude 22 points 2 days ago I came to a realization a while back that we could actually live in the world liberals want to if we were 99% White. We could manage to significantly cut  police funding due to the near zero percent crime rate, we could easily afford a SNAP/EBT program because we wouldn’t have lifers, gun violence would be zero, insurance would be cheaper, college costs may even drop. Liberals and their worship of diversity stops them from achieving their own goals. permalink parent award report block reply FutureFreemason 6 points 2 days ago National socialism permalink parent award report block reply Nibba2 12 points 2 days ago And the Muslims. permalink parent award report block reply pococurante 3 points 2 days ago It would solve problems, but it's wrong. They have been here for hundreds of years too, it's our problem to solve domestically. And what country would agree to that anyway? permalink parent award report block reply MrFrogBottom 12 points 2 days ago Ending H1-B and other stupid foreign worker programs. Don't need them, never have. permalink award report block reply deleted 10 points 2 days ago Froynlavenfroynlaven 3 points 2 days ago Those are directly related to traffic and healthcare, which were mentioned. permalink parent award report block reply Kamalas_Cankles 9 points 2 days ago But we're told if that happens we won't have any doctors or astronauts. permalink award report block reply rebuildingMyself 7 points 2 days ago We'd have to repeal the 19th to even have a chance at this. permalink award report block reply RealWomenLoveTrump 6 points 2 days ago Female pede checking in. Can confirm. permalink parent award report block reply worldowedexplanation 1 points 2 days ago Plenty of dumb soy noodle arm liberal men exist you know permalink parent award report block reply NotYourMan 6 points 2 days ago There is no reason for the US or any successful European country to bring in asylum seekers, no reason.  Bringing people that have no intention to accept your culture is just wrong even if their country of origin is bad.  It just isn't our problem to solve.  We are not the world's trash can for the violent criminals from other countries.  This is a simple replacement plan.  DEPORT and everything gets cheaper and we can get back to being great. permalink award report block reply TDBabyBite 5 points 2 days ago You're just missing the people pulling those strings facing consequences. permalink award report block reply PatriotSkorzeny 5 points 2 days ago LE doesn’t want to deport them. That’s what you’re missing. They go as far out of the way as they can to help illegal alien terrorist invader trafficker murderer predators. They removed American children from school buildings to bivouac foreign military aged males. It’s treason. There are no good cops. 🖕🏼 permalink award report block reply Krat 5 points 2 days ago More problems can be fixed by arresting people and bringing back consequences permalink award report block reply MathletesFoot 2 points 2 days ago This. This would go extremely far towards correcting so many of today's problems. People say they want god brought back into this, that, and the other, but what they really want is consequences brought back. permalink parent award report block reply Shitsbrokeyo 4 points 2 days ago Teacher student ratio Education quality teaching to lowest link budget strained by ESL requirements teachers and tutor materials for ESL permalink award report block reply Nimblenavigator1 4 points 2 days ago H1Bs Diversity lottery winners Chain migration relatives All of the Haitians, Somalians, and Gypsies permalink award report block reply Repentnow 3 points 2 days ago - Education Millions of illegal's children flooding the K - 12 school system. Overloading resources and dragging down the ability to educate American children.  25% of Texas school children state wide are ESL. In some school districts it's nearly 100%. permalink award report block reply FreedomLubber 3 points 2 days ago SNAP permalink award report block reply Waco419 3 points 2 days ago Throw in cultural aliens (legal or otherwise), and you go from \"vast majority\" to \"nearly all\". permalink award report block reply donteatthat 3 points 2 days ago A government with the dick to do it permalink award report block reply GarudaDarkblack 3 points 2 days ago Denaturalize (if naturalized) and deport any immigrant that has been convicted of a felony, more than 3 misdemeanors, came here illegally, or is on any form of government assistance that isn't a loan they have to pay back. permalink award report block reply StayoutOfit 3 points 2 days ago Not even just the illegal ones. Plenty of H1B's are technically here legally, but causing just as much damage in different ways. permalink award report block reply Im_RickSteves_bitch 3 points 2 days ago And not letting people live off the taxpayers in general. 50-year mortgages will only make it worse. permalink award report block reply MemeWarsVet 3 points 2 days ago Nothing. You are correct. permalink award report block reply the-new-style 3 points 2 days ago What am I missing here? about 30 years permalink award report block reply Wanderlust 3 points 2 days ago H1Bs permalink award report block reply JustInTime2_ 2 points 2 days ago Nothing permalink award report block reply fullpotato1776 2 points 2 days ago Jews. Deport the Jews permalink award report block reply Pelosi_Halitosis 2 points 2 days ago Immigration and world poverty explained with gum balls. Or, why mass immigration will never work. https://youtu.be/l6tSqGCfoCI?si=PmLpHK3nEJmlWKgD permalink award report block reply Smurfection 2 points 2 days ago The biggest problem of all, Democrats need uneducated criminals who want free stuff voting for them. permalink award report block reply OrangeElvis 2 points 2 days ago Que the \"We landed on the moon!\" Dumb and Dumber meme. permalink award report block reply 2020Gop 2 points 2 days ago Repeal the 19th. permalink award report block reply greatpumpkin 2 points 2 days ago Nothing.  You nailed 65% of what's wrong in this country in one sentence. permalink award report block reply Psarg 1 points 2 days ago Deport bad Americans too. permalink award report block reply bluewhiteandred 1 points 2 days ago Add too many Taxes and regulations permalink award report block reply 2016TrumpMAGA 1 points 2 days ago What am I missing here? Federal, State, and Local budgets. permalink award report block reply IBentMyWookie 1 points 2 days ago Education Now it’s further down the list than chin pouts and LGBTQRS nonsense, but having to alter course content to be accessible to students who don’t read or write English grinds learning to a halt. permalink award report block reply Wildwind 1 points 2 days ago Number one item is deport them all. Every last one of them. I really do not care if they came here legally and became a citizen.  Get all of them the fuck out. If you take them off of snap, and health  care, make it illegal to hire them they all would be walking back to Mexico or buying plane tickets back to the shit hole they come from. permalink award report block reply 16BeatsAOne 1 points 2 days ago Ya think so? permalink award report block reply Crappydatum 1 points 2 days ago But where oh where would the Democrats get their slaves? permalink award report block reply Aquamine-Amarine 1 points 2 days ago Deporting illegals is great and definitely a step in the right direction, the problem is that leftists run the schools and media. They'll just brainwash another generation and when those freaks are in power they'll let the illegals back in, undoing all the work this administration is doing. permalink award report block reply ncswicn 1 points 2 days ago 👍🏻 No doubt! 👍🏻 permalink award report block reply lul_cheto 1 points 2 days ago Sub par public schooling\nTaxes\nLitter permalink award report block reply 26magarat 1 points 2 days ago Also water is wet. permalink award report block reply Cop-Morty 1 points 2 days ago Racism.  Can't be racist if there are no more dirty illegals around permalink award report block reply KarenLukasik 1 points 2 days ago Not worrying about illegals voting for democrats? permalink award report block reply ApplyingForce 1 points 2 days ago Remove  trespassers permalink award report block reply TerrorAndSlaughter 1 points 2 days ago If we deport a few more tens of millions I might get enough money out of Social Security to break even.  As it stands now I will have to share very little with a dozen illiterate delivery drivers. permalink award report block reply DelightfulDane 1 points 1 day ago Not disagreeing.....BUT....it's a symptom, not the cause. Leftist Policy is the Cause. It will be illegals or it will be something else. Leftists gonna Leftist! permalink award report block reply abstr4ct 1 points 2 days ago taxes... permalink award report block reply LibsRcrazy 1 points 2 days ago And deport all the judges with them. permalink award report block reply barwhack 1 points 2 days ago You're missing the Epstard files. Cuz listees need to be depoted from life , to get them outa power over you. But Trump will placate you with MIGA-asif-MAGA, America First Also, and Deport 50 M k. 🇺🇦 Emmkay? permalink award report block reply Dev404 1 points 2 days ago He's missing capital punishment for those in office and in court for treason, sedition, all sorts of trafficking, money laundering, bribery, blackmail, extortion, and crimes against humanity.... just to name a few that come to mind, immediately. permalink award report block reply HazelHen 0 points 2 days ago Legal immigrants also. permalink award report block reply RedStoneDeepState -1 points 2 days ago Most housing issues and crime issues are caused by blacks and wages are not some zero sum game. permalink award report block reply\nUSMC6541E5 23 points 2 days ago What a mind blowing concept!!! permalink award report block reply KilroyJCNJ 11 points 2 days ago Van Swol is a convert. Hurricane Helene opened his eyes. permalink parent award report block reply Granny 8 points 2 days ago Missing? There are so many entities that are making big profits off the illegals, and that's why it's like pulling teeth to get rid of them. Another Pede just pointed out how much $$ Pepsi is making from SNAP recipients. The whole food industry, along with housing, health care, etc are making windfall profits at the taxpayers' expense, due to our financing the presence of the illegal hordes. Then the lobbyists in DC will not allow this great cash flow to be removed!!! permalink parent award report block reply Transparency 1 points 2 days ago Another Pede just pointed out how much $$ Pepsi is making from SNAP recipients. Got a link? permalink parent award report block reply DeportThemAllForever -2 points 2 days ago This, every builder out here (red state btw) uses illegals.  I submit info to ice, so far nothing.  All you got to do is show up during construction. Then we have a fiber optic company “tdscable”, all illegals there laying cable, not a word of English. Disgusting how they managed to replace Americans with illegals everywhere, exploded social safety nets, and take no responsibility for these societal costs. permalink parent award report block reply farangbak 3 points 2 days ago Common sense is not so common.............. permalink parent award report block reply\nKilroyJCNJ 11 points 2 days ago Van Swol is a convert. Hurricane Helene opened his eyes. permalink parent award report block reply\nGranny 8 points 2 days ago Missing? There are so many entities that are making big profits off the illegals, and that's why it's like pulling teeth to get rid of them. Another Pede just pointed out how much $$ Pepsi is making from SNAP recipients. The whole food industry, along with housing, health care, etc are making windfall profits at the taxpayers' expense, due to our financing the presence of the illegal hordes. Then the lobbyists in DC will not allow this great cash flow to be removed!!! permalink parent award report block reply Transparency 1 points 2 days ago Another Pede just pointed out how much $$ Pepsi is making from SNAP recipients. Got a link? permalink parent award report block reply DeportThemAllForever -2 points 2 days ago This, every builder out here (red state btw) uses illegals.  I submit info to ice, so far nothing.  All you got to do is show up during construction. Then we have a fiber optic company “tdscable”, all illegals there laying cable, not a word of English. Disgusting how they managed to replace Americans with illegals everywhere, exploded social safety nets, and take no responsibility for these societal costs. permalink parent award report block reply\nTransparency 1 points 2 days ago Another Pede just pointed out how much $$ Pepsi is making from SNAP recipients. Got a link? permalink parent award report block reply\nDeportThemAllForever -2 points 2 days ago This, every builder out here (red state btw) uses illegals.  I submit info to ice, so far nothing.  All you got to do is show up during construction. Then we have a fiber optic company “tdscable”, all illegals there laying cable, not a word of English. Disgusting how they managed to replace Americans with illegals everywhere, exploded social safety nets, and take no responsibility for these societal costs. permalink parent award report block reply\nfarangbak 3 points 2 days ago Common sense is not so common.............. permalink parent award report block reply\nfree-will-of-choice 15 points 2 days ago What am I missing here? That aliens pretending to be natives are running the migration scheme to generate problems to sell even more problematic solutions. permalink award report block reply Leporidae 4 points 2 days ago Riddle me this, it hits close to home.\nWho opens our borders, but closes their own? permalink parent award report block reply\nLeporidae 4 points 2 days ago Riddle me this, it hits close to home.\nWho opens our borders, but closes their own? permalink parent award report block reply\nEADReddit 13 points 2 days ago send the blacks with em.... permalink award report block reply ChrisSuperDude 22 points 2 days ago I came to a realization a while back that we could actually live in the world liberals want to if we were 99% White. We could manage to significantly cut  police funding due to the near zero percent crime rate, we could easily afford a SNAP/EBT program because we wouldn’t have lifers, gun violence would be zero, insurance would be cheaper, college costs may even drop. Liberals and their worship of diversity stops them from achieving their own goals. permalink parent award report block reply FutureFreemason 6 points 2 days ago National socialism permalink parent award report block reply Nibba2 12 points 2 days ago And the Muslims. permalink parent award report block reply pococurante 3 points 2 days ago It would solve problems, but it's wrong. They have been here for hundreds of years too, it's our problem to solve domestically. And what country would agree to that anyway? permalink parent award report block reply\nChrisSuperDude 22 points 2 days ago I came to a realization a while back that we could actually live in the world liberals want to if we were 99% White. We could manage to significantly cut  police funding due to the near zero percent crime rate, we could easily afford a SNAP/EBT program because we wouldn’t have lifers, gun violence would be zero, insurance would be cheaper, college costs may even drop. Liberals and their worship of diversity stops them from achieving their own goals. permalink parent award report block reply FutureFreemason 6 points 2 days ago National socialism permalink parent award report block reply\nFutureFreemason 6 points 2 days ago National socialism permalink parent award report block reply\nNibba2 12 points 2 days ago And the Muslims. permalink parent award report block reply\npococurante 3 points 2 days ago It would solve problems, but it's wrong. They have been here for hundreds of years too, it's our problem to solve domestically. And what country would agree to that anyway? permalink parent award report block reply\nMrFrogBottom 12 points 2 days ago Ending H1-B and other stupid foreign worker programs. Don't need them, never have. permalink award report block reply\ndeleted 10 points 2 days ago Froynlavenfroynlaven 3 points 2 days ago Those are directly related to traffic and healthcare, which were mentioned. permalink parent award report block reply\nFroynlavenfroynlaven 3 points 2 days ago Those are directly related to traffic and healthcare, which were mentioned. permalink parent award report block reply\nKamalas_Cankles 9 points 2 days ago But we're told if that happens we won't have any doctors or astronauts. permalink award report block reply\nrebuildingMyself 7 points 2 days ago We'd have to repeal the 19th to even have a chance at this. permalink award report block reply RealWomenLoveTrump 6 points 2 days ago Female pede checking in. Can confirm. permalink parent award report block reply worldowedexplanation 1 points 2 days ago Plenty of dumb soy noodle arm liberal men exist you know permalink parent award report block reply\nRealWomenLoveTrump 6 points 2 days ago Female pede checking in. Can confirm. permalink parent award report block reply\nworldowedexplanation 1 points 2 days ago Plenty of dumb soy noodle arm liberal men exist you know permalink parent award report block reply\nNotYourMan 6 points 2 days ago There is no reason for the US or any successful European country to bring in asylum seekers, no reason.  Bringing people that have no intention to accept your culture is just wrong even if their country of origin is bad.  It just isn't our problem to solve.  We are not the world's trash can for the violent criminals from other countries.  This is a simple replacement plan.  DEPORT and everything gets cheaper and we can get back to being great. permalink award report block reply\nTDBabyBite 5 points 2 days ago You're just missing the people pulling those strings facing consequences. permalink award report block reply\nPatriotSkorzeny 5 points 2 days ago LE doesn’t want to deport them. That’s what you’re missing. They go as far out of the way as they can to help illegal alien terrorist invader trafficker murderer predators. They removed American children from school buildings to bivouac foreign military aged males. It’s treason. There are no good cops. 🖕🏼 permalink award report block reply\nKrat 5 points 2 days ago More problems can be fixed by arresting people and bringing back consequences permalink award report block reply MathletesFoot 2 points 2 days ago This. This would go extremely far towards correcting so many of today's problems. People say they want god brought back into this, that, and the other, but what they really want is consequences brought back. permalink parent award report block reply\nMathletesFoot 2 points 2 days ago This. This would go extremely far towards correcting so many of today's problems. People say they want god brought back into this, that, and the other, but what they really want is consequences brought back. permalink parent award report block reply\nShitsbrokeyo 4 points 2 days ago Teacher student ratio Education quality teaching to lowest link budget strained by ESL requirements teachers and tutor materials for ESL permalink award report block reply\nNimblenavigator1 4 points 2 days ago H1Bs Diversity lottery winners Chain migration relatives All of the Haitians, Somalians, and Gypsies permalink award report block reply\nRepentnow 3 points 2 days ago - Education Millions of illegal's children flooding the K - 12 school system. Overloading resources and dragging down the ability to educate American children.  25% of Texas school children state wide are ESL. In some school districts it's nearly 100%. permalink award report block reply\nFreedomLubber 3 points 2 days ago SNAP permalink award report block reply\nWaco419 3 points 2 days ago Throw in cultural aliens (legal or otherwise), and you go from \"vast majority\" to \"nearly all\". permalink award report block reply\ndonteatthat 3 points 2 days ago A government with the dick to do it permalink award report block reply\nGarudaDarkblack 3 points 2 days ago Denaturalize (if naturalized) and deport any immigrant that has been convicted of a felony, more than 3 misdemeanors, came here illegally, or is on any form of government assistance that isn't a loan they have to pay back. permalink award report block reply\nStayoutOfit 3 points 2 days ago Not even just the illegal ones. Plenty of H1B's are technically here legally, but causing just as much damage in different ways. permalink award report block reply\nIm_RickSteves_bitch 3 points 2 days ago And not letting people live off the taxpayers in general. 50-year mortgages will only make it worse. permalink award report block reply\nMemeWarsVet 3 points 2 days ago Nothing. You are correct. permalink award report block reply\nthe-new-style 3 points 2 days ago What am I missing here? about 30 years permalink award report block reply\nWanderlust 3 points 2 days ago H1Bs permalink award report block reply\nJustInTime2_ 2 points 2 days ago Nothing permalink award report block reply\nfullpotato1776 2 points 2 days ago Jews. Deport the Jews permalink award report block reply\nPelosi_Halitosis 2 points 2 days ago Immigration and world poverty explained with gum balls. Or, why mass immigration will never work. https://youtu.be/l6tSqGCfoCI?si=PmLpHK3nEJmlWKgD permalink award report block reply\nSmurfection 2 points 2 days ago The biggest problem of all, Democrats need uneducated criminals who want free stuff voting for them. permalink award report block reply\nOrangeElvis 2 points 2 days ago Que the \"We landed on the moon!\" Dumb and Dumber meme. permalink award report block reply\n2020Gop 2 points 2 days ago Repeal the 19th. permalink award report block reply\ngreatpumpkin 2 points 2 days ago Nothing.  You nailed 65% of what's wrong in this country in one sentence. permalink award report block reply\nPsarg 1 points 2 days ago Deport bad Americans too. permalink award report block reply\nbluewhiteandred 1 points 2 days ago Add too many Taxes and regulations permalink award report block reply\n2016TrumpMAGA 1 points 2 days ago What am I missing here? Federal, State, and Local budgets. permalink award report block reply\nIBentMyWookie 1 points 2 days ago Education Now it’s further down the list than chin pouts and LGBTQRS nonsense, but having to alter course content to be accessible to students who don’t read or write English grinds learning to a halt. permalink award report block reply\nWildwind 1 points 2 days ago Number one item is deport them all. Every last one of them. I really do not care if they came here legally and became a citizen.  Get all of them the fuck out. If you take them off of snap, and health  care, make it illegal to hire them they all would be walking back to Mexico or buying plane tickets back to the shit hole they come from. permalink award report block reply\n16BeatsAOne 1 points 2 days ago Ya think so? permalink award report block reply\nCrappydatum 1 points 2 days ago But where oh where would the Democrats get their slaves? permalink award report block reply\nAquamine-Amarine 1 points 2 days ago Deporting illegals is great and definitely a step in the right direction, the problem is that leftists run the schools and media. They'll just brainwash another generation and when those freaks are in power they'll let the illegals back in, undoing all the work this administration is doing. permalink award report block reply\nncswicn 1 points 2 days ago 👍🏻 No doubt! 👍🏻 permalink award report block reply\nlul_cheto 1 points 2 days ago Sub par public schooling\nTaxes\nLitter permalink award report block reply\n26magarat 1 points 2 days ago Also water is wet. permalink award report block reply\nCop-Morty 1 points 2 days ago Racism.  Can't be racist if there are no more dirty illegals around permalink award report block reply\nKarenLukasik 1 points 2 days ago Not worrying about illegals voting for democrats? permalink award report block reply\nApplyingForce 1 points 2 days ago Remove  trespassers permalink award report block reply\nTerrorAndSlaughter 1 points 2 days ago If we deport a few more tens of millions I might get enough money out of Social Security to break even.  As it stands now I will have to share very little with a dozen illiterate delivery drivers. permalink award report block reply\nDelightfulDane 1 points 1 day ago Not disagreeing.....BUT....it's a symptom, not the cause. Leftist Policy is the Cause. It will be illegals or it will be something else. Leftists gonna Leftist! permalink award report block reply\nabstr4ct 1 points 2 days ago taxes... permalink award report block reply\nLibsRcrazy 1 points 2 days ago And deport all the judges with them. permalink award report block reply\nbarwhack 1 points 2 days ago You're missing the Epstard files. Cuz listees need to be depoted from life , to get them outa power over you. But Trump will placate you with MIGA-asif-MAGA, America First Also, and Deport 50 M k. 🇺🇦 Emmkay? permalink award report block reply\nDev404 1 points 2 days ago He's missing capital punishment for those in office and in court for treason, sedition, all sorts of trafficking, money laundering, bribery, blackmail, extortion, and crimes against humanity.... just to name a few that come to mind, immediately. permalink award report block reply\nHazelHen 0 points 2 days ago Legal immigrants also. permalink award report block reply\nRedStoneDeepState -1 points 2 days ago Most housing issues and crime issues are caused by blacks and wages are not some zero sum game. permalink award report block reply"}