{"id": "1ARK57rP8x", "contents": "794 Denmark set to become another EU country to ban children under 15 from certain Social Media platforms, including Snapchat, Instagram, YouTube, and TikTok.  Parents can grant access to children aged 13 and older to certain platforms. (www.disclose.tv) posted 4 days ago by Landslide_2020 84 comments award share report block Denmark to bans social media for under-15s Breaking news from around the world. www.disclose.tv\n84 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno deleted 35 points 4 days ago Wtf_socialismreally 30 points 4 days ago Likely true, but it's also a measure to have verification which means invading privacy and consensual files on every citizen there. Yes, we've all heard the \"they have it anyway\" line, but there is a difference between the government illegally having it and legally having it. permalink parent award report block reply POTUS_DonnieJ 6 points 4 days ago This is it, they need to know if you’re under 15 so they can ban you from the internet. That also means they need to know if you’re over 15. Which means they need to know who you are. permalink parent award report block reply liberalshitlord 3 points 4 days ago States like TX have age verification for online porn now that require validating your age with your ID etc… No longer anonymous on the interwebs. permalink parent award report block reply trumpORbust 3 points 4 days ago The Internet had never been anonymous -- obscured at best, easily unwound except the most paranoid with their multiple to layers and hijacked endpoint permalink parent award report block reply liberalshitlord 1 points 3 days ago If they know who you are already, why verify it? permalink parent award report block reply view 1 more comments... SanityGumby 2 points 4 days ago The Internet definitely isn’t anonymous and welcome to the 90s where credit cards were used for age verification on porn sites. permalink parent award report block reply liberalshitlord 1 points 3 days ago I’ve never had to enter a credit card to verify my age to watch porn in my life. permalink parent award report block reply mikethemarine 1 points 4 days ago what they will do in Denmark, is charge the parents for allowing them on those sites and allowing them to post what they said, this will end up how they do their censorship, by jailing the parents for them not enforcing the governments will. There WELL BE A CATCH TO THIS, just like our country is charging the parents when the kids take their gun and commit a crime, it's never the persons fault, it was caused by somebody else that the government wants to be able to control permalink parent award report block reply cptkloss5 13 points 4 days ago it's all about enforcing digital id, so you can't use the internet anonymously permalink parent award report block reply TheRPatriot 2 points 4 days ago Half these kids are probably actually watching Mr beast slop, which is scientifically causing detriments to their minds permalink parent award report block reply RuleoVicus 3 points 4 days ago They were watching Charlie Kirk videos abs that was a bad thing. permalink parent award report block reply TheRPatriot 2 points 4 days ago You don’t know a lot of iPad kids, do you? permalink parent award report block reply Bluemoonsugar 1 points 4 days ago Yes. They understand for decades that God's word is true when it says, instruct a child in his way and when he grows up he will not depart from it. Same as why liberals took over schools which were most Christians decades ago and now teach their perversion as young as possible. permalink parent award report block reply JohnMiller2020 1 points 4 days ago No. It's to usher in digital ID. I can't believe people don't see that. permalink parent award report block reply load 3 more comments... Thefrogeatsfree 26 points 4 days ago This should really be fixed by culture not government. I agree kids shouldn't be on social media permalink award report block reply ListenJack 18 points 4 days ago This is the correct take. The govt should never be a parent in place of idiot parents. permalink parent award report block reply MasterChief 5 points 4 days ago Agreed, this is dystopian, but I can't think of any better solutions. Maybe if they did a \"dystopian ID verification is required if company doesn't comply with X, Y, Z safety precautions\" or something. There are standards and certifications in every other industry, they should have to maintain a bare minimum level of precaution that everyone can agree upon. permalink parent award report block reply FromNC 4 points 4 days ago The only problem I see with this is that the government now has the propaganda pipeline monopoly going straight to children that have no access to other view points. permalink parent award report block reply MasterChief 1 points 4 days ago Yeah it's a slippery slope and really complicated. It should really be left up to the parents and nobody else. Unfortunately there are a lot of naive parents out there. permalink parent award report block reply CocaineNewsome 3 points 4 days ago The better solution is for parents to.. I dunno.. parent. permalink parent award report block reply MasterChief 2 points 4 days ago Agreed. I am applying my limited purview and generalizing the masses. Empower parents to be good parents. That is probably better left up to privatization than government oversight, imo, but it's taking way too long. permalink parent award report block reply RuleoVicus 2 points 4 days ago \"but I can't think of any better solutions\" What exactly is the problem you believe needs a solution? permalink parent award report block reply MasterChief 1 points 4 days ago Do you know if you are talking to a child? If you did, would you change anything about how you are talking to them? Beyond that, they are young and dumb and shouldn't be exposed to a ton of shit that's out there. I am mostly referring to shit I did, or saw growing up without supervision and applying it to others. Probably selfish of me, but I don't want anyone else to make the same mistakes I did. permalink parent award report block reply SpellingContable 1 points 4 days ago The most dangerous thing for children is for them to be in the company of pedos. Both online and in real life. I propose banning children from; -internet porn -internet chatrooms - ex preddit and roblox -government worker interactions -teachers permalink parent award report block reply EvJohn 1 points 4 days ago Very good question.  Upstream. permalink parent award report block reply staroframphansbhole 3 points 4 days ago Yeah well parents have no balls anymore also because of the state, so the state has to step in to offer a solution to the problem it created permalink parent award report block reply Thefrogeatsfree 1 points 4 days ago You got kids? permalink parent award report block reply RuleoVicus 1 points 4 days ago Twenty.  What's your point? permalink parent award report block reply Thefrogeatsfree 1 points 4 days ago Just seems like your part of the problem and not the solution. If you had kids I'd hope you'd practice what you preach instead of the defeatist attitude. permalink parent award report block reply view 5 more comments... AndyCuomoIsAMobster 2 points 4 days ago Read an article in Psychology magazine over five years ago that stated in thirty years we will look back on giving toddlers and children iPads as child abuse. It rewires their brains. permalink parent award report block reply RuleoVicus -3 points 4 days ago Jesus Christ and I bet you think video games cause violence. permalink parent award report block reply Thefrogeatsfree 4 points 4 days ago You're really going hard on this topic. Struck a nerve? Must be one of them roblox predators who dont want their source taken away permalink parent award report block reply AndyCuomoIsAMobster 1 points 3 days ago I don't think they cause violence but I think they make your kid a social idiot, especially when introduced as a toddler. permalink parent award report block reply Criss_P_Bacon 11 points 4 days ago Social media has negatively impacted society. permalink award report block reply TrumpAndGodWin 1 points 3 days ago \"Comparison is a thief of happiness.\" The elite want miserable people that can be easily controlled. permalink parent award report block reply RuleoVicus -9 points 4 days ago Social media only exposed what was already there. It created nothing. permalink parent award report block reply TrumpyMadeThemGrumpy 9 points 4 days ago It greatly amplified the voices of the hysterical retards that we all just laughed at and ignored.  Now they gather their global retard club together and it makes it seem like their voice is larger than it really is.  Social media creates an illusion and the large gathering of retards is forcing companies and politicians to bend over for them. So yes, the retards were already here, but they thankfully didn't have a voice.  Now they do. permalink parent award report block reply ApparentlyAssumption 7 points 4 days ago This is incorrect.  It has had a drastic effect and damage in society permalink parent award report block reply Twitter 9 points 4 days ago Surprised they aren't going to ban gaming as well they might as well go full send permalink award report block reply Landslide_2020 OP 10 points 4 days ago I refused to buy gaming systems for my children while they were growing up.  I told them that they could have one, but that they'd have to purchase it themselves.  I also told them that if they wanted to play sports, or any school activities, that of course I would support them and purchase what was needed.  But, they had to maintain a B average in order to participate.  The schools minimum was a C average.  Each one of them graduated with at least a 3.5 GPA.  I don't regret my decision one bit. permalink parent award report block reply Tobin 1 points 4 days ago This is the way, but unfortunately many parents nowadays don't hold their children to any standards and then blame the school.  Don't get me wrong, the schools aren't always good, but they often aren't the problem either. permalink parent award report block reply SanityGumby 2 points 4 days ago A bunch of retards tried by attacking steam but the backlash was large enough Steam backed out permalink parent award report block reply CocaineNewsome 2 points 4 days ago Gaming has online accounts so yes. permalink parent award report block reply Settin 6 points 4 days ago Kids are noticing we gotta shut it down. permalink award report block reply RuleoVicus 3 points 4 days ago Precisely what's going on. permalink parent award report block reply cptkloss5 6 points 4 days ago don't fall for this bullshit \"The government plans to enforce the ban through an age-verification app linked to Denmark's national electronic ID system, which nearly all Danish citizens over 13 have.\" permalink award report block reply patrioticwinning3 5 points 4 days ago How will they \"verify\" this?  Through some kind of \"digital ID?\" permalink award report block reply guywholikesDjtof2024 5 points 4 days ago Slavery dystopia. Welcome to communism and 1984 where free speech is dying or dead. permalink award report block reply JC81 5 points 4 days ago This is just another part of the trap of digital id's. It will be a part of social credit scores. Coming to this website will probably get us all thrown in a gulag or unable to buy groceries. permalink award report block reply EvJohn 4 points 4 days ago There's never been a lock made that cannot be breached.  Keep that in mind in this conversation. permalink parent award report block reply knnbccb 4 points 4 days ago Some of the (younger) parents are no better, they spend more time on their phones than do actual (offline) parenting stuff. permalink award report block reply CocaineNewsome 4 points 4 days ago Yea, 1984 is coming. Why I keep whining about it. How would they know you're not 18? Oh just submit your real identity that for sure isn't going to be connected, no way, no how. How many of you would sign up to PDW with your face, name and address. All sitting there to get hacked or matched up by glowies to pay you a visit. As a result, free speech dies. For the chillun! permalink award report block reply MAGALADON9 3 points 4 days ago The EU has full-on pro Islamic pro communist, or sexual degenerate crap and only that censoring anything \"white\" or Christian etc so fuck em. Read a book. permalink award report block reply Fromseatoshinningsea 3 points 4 days ago Denmark joins Poland & Hungary: nations preserving their citizens, culture & heritage. permalink award report block reply terribletwos 3 points 4 days ago They don't want the victims to be able to tattle on the invader pedos publicly. permalink award report block reply RuleoVicus 1 points 4 days ago Incredibly hilarious username to post relevance lol permalink parent award report block reply bluewhiteandred 2 points 4 days ago Debates like this probably center around how to treat middle schoolers (around 10-14) versus high schoolers (around 14-18) Around 10 and under have no business on social media that I can think of (besides maybe an exceptional minority which could be monitored by parents) Adolescents start to want to figure out what the world looks like so we debate when to treat them more like adults in that respect Looks like a rough consensus of high schoolers can be on social media A minority of adolescents / children might develop faster than their peers and maybe exceptions could be made (for example those who like graduate college before age 18) permalink award report block reply TerdBergler 2 points 4 days ago Children not using these platforms is great. Government mandating it is BAD. PARENT YOUR CHILDREN! This shit is the equivalent of EBT and section 8, but for parenting. permalink award report block reply MakeAmericaGreat9 1 points 4 days ago How do you actually stop this without some bullshit form of ID to use a phone? permalink award report block reply bergsoe -1 points 4 days ago You don't. We have a national digital ID. So the way it's gonna work is that if the social media does not implement it at login, it will likely get banned. Hopefully, this is the stepping stone to also ban all porn for under-18-year-olds, with the same logic. Implement digital ID or get banned by all IPS. Im a Danish National btw. permalink parent award report block reply MakeAmericaGreat9 2 points 4 days ago Get fucked with your national ID. permalink parent award report block reply VladtheTickler 1 points 4 days ago Make it banned and mysterious to curious teens.  What could possibly go wrong? permalink award report block reply SavingPrivateGrace 1 points 4 days ago The twenty somethings on social media ruined the internet.  Reddit and all the generations together online were never going to see eye-to-eye.  Age 15-25  should have a special check mark online so we know they are minors and college age.  There's a reason you can't run for office of the president until 35 and that is because of experience in God, Family & Country.  It should actually be higher now that people are not getting married until their thirties, it's not 1776.  We now have a Mayor of NYC, 34 and never held a job and not that it will happen, but he very well could run in the next presidential election. permalink award report block reply NewGoldenAge 3 points 4 days ago No he can't. Foreign. Ugandan-born. Duuuuuuhhhhhhh Dumbshit faggot. permalink parent award report block reply EvJohn 1 points 4 days ago AoL \"ruined the internet\". The rest is just what followed. permalink parent award report block reply MasterChief 3 points 4 days ago damn, you just made me remember using instant messenger while working on my myspace and geocities after playing runescape permalink parent award report block reply VoteMAGA 1 points 4 days ago We already mostly have the infrastructure in place to do it in the US. Between TPM modules on computers and UID+IMEI on phones, it is just a matter of making API calls to implement it with a database of users. The goal isn't to protect children though, it is to ultimately police and limit any free thinking content. permalink award report block reply Michalusmichalus 1 points 4 days ago My kids had adult supervision. It was my responsibility alone. Here we are, my kids are grown. And AI can't figure out its 3 people using everything of mine not one person. If I lived there, my kids would just be me. permalink award report block reply SanityGumby 1 points 4 days ago This shouldn’t be a thing because parents shouldn’t be letting their kids on this shit to begin with permalink award report block reply cyberwar 1 points 4 days ago ban them from all so that pedos can't abuse them permalink award report block reply Lower 0 points 4 days ago Sadly, the vast majority of parents will grant access anyway, because they don't want their child \"bullied over not having access\" (aka, LAZY PARENTS) permalink award report block reply\ndeleted 35 points 4 days ago Wtf_socialismreally 30 points 4 days ago Likely true, but it's also a measure to have verification which means invading privacy and consensual files on every citizen there. Yes, we've all heard the \"they have it anyway\" line, but there is a difference between the government illegally having it and legally having it. permalink parent award report block reply POTUS_DonnieJ 6 points 4 days ago This is it, they need to know if you’re under 15 so they can ban you from the internet. That also means they need to know if you’re over 15. Which means they need to know who you are. permalink parent award report block reply liberalshitlord 3 points 4 days ago States like TX have age verification for online porn now that require validating your age with your ID etc… No longer anonymous on the interwebs. permalink parent award report block reply trumpORbust 3 points 4 days ago The Internet had never been anonymous -- obscured at best, easily unwound except the most paranoid with their multiple to layers and hijacked endpoint permalink parent award report block reply liberalshitlord 1 points 3 days ago If they know who you are already, why verify it? permalink parent award report block reply view 1 more comments... SanityGumby 2 points 4 days ago The Internet definitely isn’t anonymous and welcome to the 90s where credit cards were used for age verification on porn sites. permalink parent award report block reply liberalshitlord 1 points 3 days ago I’ve never had to enter a credit card to verify my age to watch porn in my life. permalink parent award report block reply mikethemarine 1 points 4 days ago what they will do in Denmark, is charge the parents for allowing them on those sites and allowing them to post what they said, this will end up how they do their censorship, by jailing the parents for them not enforcing the governments will. There WELL BE A CATCH TO THIS, just like our country is charging the parents when the kids take their gun and commit a crime, it's never the persons fault, it was caused by somebody else that the government wants to be able to control permalink parent award report block reply cptkloss5 13 points 4 days ago it's all about enforcing digital id, so you can't use the internet anonymously permalink parent award report block reply TheRPatriot 2 points 4 days ago Half these kids are probably actually watching Mr beast slop, which is scientifically causing detriments to their minds permalink parent award report block reply RuleoVicus 3 points 4 days ago They were watching Charlie Kirk videos abs that was a bad thing. permalink parent award report block reply TheRPatriot 2 points 4 days ago You don’t know a lot of iPad kids, do you? permalink parent award report block reply Bluemoonsugar 1 points 4 days ago Yes. They understand for decades that God's word is true when it says, instruct a child in his way and when he grows up he will not depart from it. Same as why liberals took over schools which were most Christians decades ago and now teach their perversion as young as possible. permalink parent award report block reply JohnMiller2020 1 points 4 days ago No. It's to usher in digital ID. I can't believe people don't see that. permalink parent award report block reply load 3 more comments...\nWtf_socialismreally 30 points 4 days ago Likely true, but it's also a measure to have verification which means invading privacy and consensual files on every citizen there. Yes, we've all heard the \"they have it anyway\" line, but there is a difference between the government illegally having it and legally having it. permalink parent award report block reply POTUS_DonnieJ 6 points 4 days ago This is it, they need to know if you’re under 15 so they can ban you from the internet. That also means they need to know if you’re over 15. Which means they need to know who you are. permalink parent award report block reply liberalshitlord 3 points 4 days ago States like TX have age verification for online porn now that require validating your age with your ID etc… No longer anonymous on the interwebs. permalink parent award report block reply trumpORbust 3 points 4 days ago The Internet had never been anonymous -- obscured at best, easily unwound except the most paranoid with their multiple to layers and hijacked endpoint permalink parent award report block reply liberalshitlord 1 points 3 days ago If they know who you are already, why verify it? permalink parent award report block reply view 1 more comments... SanityGumby 2 points 4 days ago The Internet definitely isn’t anonymous and welcome to the 90s where credit cards were used for age verification on porn sites. permalink parent award report block reply liberalshitlord 1 points 3 days ago I’ve never had to enter a credit card to verify my age to watch porn in my life. permalink parent award report block reply mikethemarine 1 points 4 days ago what they will do in Denmark, is charge the parents for allowing them on those sites and allowing them to post what they said, this will end up how they do their censorship, by jailing the parents for them not enforcing the governments will. There WELL BE A CATCH TO THIS, just like our country is charging the parents when the kids take their gun and commit a crime, it's never the persons fault, it was caused by somebody else that the government wants to be able to control permalink parent award report block reply\nPOTUS_DonnieJ 6 points 4 days ago This is it, they need to know if you’re under 15 so they can ban you from the internet. That also means they need to know if you’re over 15. Which means they need to know who you are. permalink parent award report block reply\nliberalshitlord 3 points 4 days ago States like TX have age verification for online porn now that require validating your age with your ID etc… No longer anonymous on the interwebs. permalink parent award report block reply trumpORbust 3 points 4 days ago The Internet had never been anonymous -- obscured at best, easily unwound except the most paranoid with their multiple to layers and hijacked endpoint permalink parent award report block reply liberalshitlord 1 points 3 days ago If they know who you are already, why verify it? permalink parent award report block reply view 1 more comments... SanityGumby 2 points 4 days ago The Internet definitely isn’t anonymous and welcome to the 90s where credit cards were used for age verification on porn sites. permalink parent award report block reply liberalshitlord 1 points 3 days ago I’ve never had to enter a credit card to verify my age to watch porn in my life. permalink parent award report block reply\ntrumpORbust 3 points 4 days ago The Internet had never been anonymous -- obscured at best, easily unwound except the most paranoid with their multiple to layers and hijacked endpoint permalink parent award report block reply liberalshitlord 1 points 3 days ago If they know who you are already, why verify it? permalink parent award report block reply view 1 more comments...\nliberalshitlord 1 points 3 days ago If they know who you are already, why verify it? permalink parent award report block reply view 1 more comments...\nSanityGumby 2 points 4 days ago The Internet definitely isn’t anonymous and welcome to the 90s where credit cards were used for age verification on porn sites. permalink parent award report block reply liberalshitlord 1 points 3 days ago I’ve never had to enter a credit card to verify my age to watch porn in my life. permalink parent award report block reply\nliberalshitlord 1 points 3 days ago I’ve never had to enter a credit card to verify my age to watch porn in my life. permalink parent award report block reply\nmikethemarine 1 points 4 days ago what they will do in Denmark, is charge the parents for allowing them on those sites and allowing them to post what they said, this will end up how they do their censorship, by jailing the parents for them not enforcing the governments will. There WELL BE A CATCH TO THIS, just like our country is charging the parents when the kids take their gun and commit a crime, it's never the persons fault, it was caused by somebody else that the government wants to be able to control permalink parent award report block reply\ncptkloss5 13 points 4 days ago it's all about enforcing digital id, so you can't use the internet anonymously permalink parent award report block reply\nTheRPatriot 2 points 4 days ago Half these kids are probably actually watching Mr beast slop, which is scientifically causing detriments to their minds permalink parent award report block reply RuleoVicus 3 points 4 days ago They were watching Charlie Kirk videos abs that was a bad thing. permalink parent award report block reply TheRPatriot 2 points 4 days ago You don’t know a lot of iPad kids, do you? permalink parent award report block reply\nRuleoVicus 3 points 4 days ago They were watching Charlie Kirk videos abs that was a bad thing. permalink parent award report block reply TheRPatriot 2 points 4 days ago You don’t know a lot of iPad kids, do you? permalink parent award report block reply\nTheRPatriot 2 points 4 days ago You don’t know a lot of iPad kids, do you? permalink parent award report block reply\nBluemoonsugar 1 points 4 days ago Yes. They understand for decades that God's word is true when it says, instruct a child in his way and when he grows up he will not depart from it. Same as why liberals took over schools which were most Christians decades ago and now teach their perversion as young as possible. permalink parent award report block reply\nJohnMiller2020 1 points 4 days ago No. It's to usher in digital ID. I can't believe people don't see that. permalink parent award report block reply\nThefrogeatsfree 26 points 4 days ago This should really be fixed by culture not government. I agree kids shouldn't be on social media permalink award report block reply ListenJack 18 points 4 days ago This is the correct take. The govt should never be a parent in place of idiot parents. permalink parent award report block reply MasterChief 5 points 4 days ago Agreed, this is dystopian, but I can't think of any better solutions. Maybe if they did a \"dystopian ID verification is required if company doesn't comply with X, Y, Z safety precautions\" or something. There are standards and certifications in every other industry, they should have to maintain a bare minimum level of precaution that everyone can agree upon. permalink parent award report block reply FromNC 4 points 4 days ago The only problem I see with this is that the government now has the propaganda pipeline monopoly going straight to children that have no access to other view points. permalink parent award report block reply MasterChief 1 points 4 days ago Yeah it's a slippery slope and really complicated. It should really be left up to the parents and nobody else. Unfortunately there are a lot of naive parents out there. permalink parent award report block reply CocaineNewsome 3 points 4 days ago The better solution is for parents to.. I dunno.. parent. permalink parent award report block reply MasterChief 2 points 4 days ago Agreed. I am applying my limited purview and generalizing the masses. Empower parents to be good parents. That is probably better left up to privatization than government oversight, imo, but it's taking way too long. permalink parent award report block reply RuleoVicus 2 points 4 days ago \"but I can't think of any better solutions\" What exactly is the problem you believe needs a solution? permalink parent award report block reply MasterChief 1 points 4 days ago Do you know if you are talking to a child? If you did, would you change anything about how you are talking to them? Beyond that, they are young and dumb and shouldn't be exposed to a ton of shit that's out there. I am mostly referring to shit I did, or saw growing up without supervision and applying it to others. Probably selfish of me, but I don't want anyone else to make the same mistakes I did. permalink parent award report block reply SpellingContable 1 points 4 days ago The most dangerous thing for children is for them to be in the company of pedos. Both online and in real life. I propose banning children from; -internet porn -internet chatrooms - ex preddit and roblox -government worker interactions -teachers permalink parent award report block reply EvJohn 1 points 4 days ago Very good question.  Upstream. permalink parent award report block reply staroframphansbhole 3 points 4 days ago Yeah well parents have no balls anymore also because of the state, so the state has to step in to offer a solution to the problem it created permalink parent award report block reply Thefrogeatsfree 1 points 4 days ago You got kids? permalink parent award report block reply RuleoVicus 1 points 4 days ago Twenty.  What's your point? permalink parent award report block reply Thefrogeatsfree 1 points 4 days ago Just seems like your part of the problem and not the solution. If you had kids I'd hope you'd practice what you preach instead of the defeatist attitude. permalink parent award report block reply view 5 more comments... AndyCuomoIsAMobster 2 points 4 days ago Read an article in Psychology magazine over five years ago that stated in thirty years we will look back on giving toddlers and children iPads as child abuse. It rewires their brains. permalink parent award report block reply RuleoVicus -3 points 4 days ago Jesus Christ and I bet you think video games cause violence. permalink parent award report block reply Thefrogeatsfree 4 points 4 days ago You're really going hard on this topic. Struck a nerve? Must be one of them roblox predators who dont want their source taken away permalink parent award report block reply AndyCuomoIsAMobster 1 points 3 days ago I don't think they cause violence but I think they make your kid a social idiot, especially when introduced as a toddler. permalink parent award report block reply\nListenJack 18 points 4 days ago This is the correct take. The govt should never be a parent in place of idiot parents. permalink parent award report block reply\nMasterChief 5 points 4 days ago Agreed, this is dystopian, but I can't think of any better solutions. Maybe if they did a \"dystopian ID verification is required if company doesn't comply with X, Y, Z safety precautions\" or something. There are standards and certifications in every other industry, they should have to maintain a bare minimum level of precaution that everyone can agree upon. permalink parent award report block reply FromNC 4 points 4 days ago The only problem I see with this is that the government now has the propaganda pipeline monopoly going straight to children that have no access to other view points. permalink parent award report block reply MasterChief 1 points 4 days ago Yeah it's a slippery slope and really complicated. It should really be left up to the parents and nobody else. Unfortunately there are a lot of naive parents out there. permalink parent award report block reply CocaineNewsome 3 points 4 days ago The better solution is for parents to.. I dunno.. parent. permalink parent award report block reply MasterChief 2 points 4 days ago Agreed. I am applying my limited purview and generalizing the masses. Empower parents to be good parents. That is probably better left up to privatization than government oversight, imo, but it's taking way too long. permalink parent award report block reply RuleoVicus 2 points 4 days ago \"but I can't think of any better solutions\" What exactly is the problem you believe needs a solution? permalink parent award report block reply MasterChief 1 points 4 days ago Do you know if you are talking to a child? If you did, would you change anything about how you are talking to them? Beyond that, they are young and dumb and shouldn't be exposed to a ton of shit that's out there. I am mostly referring to shit I did, or saw growing up without supervision and applying it to others. Probably selfish of me, but I don't want anyone else to make the same mistakes I did. permalink parent award report block reply SpellingContable 1 points 4 days ago The most dangerous thing for children is for them to be in the company of pedos. Both online and in real life. I propose banning children from; -internet porn -internet chatrooms - ex preddit and roblox -government worker interactions -teachers permalink parent award report block reply EvJohn 1 points 4 days ago Very good question.  Upstream. permalink parent award report block reply\nFromNC 4 points 4 days ago The only problem I see with this is that the government now has the propaganda pipeline monopoly going straight to children that have no access to other view points. permalink parent award report block reply MasterChief 1 points 4 days ago Yeah it's a slippery slope and really complicated. It should really be left up to the parents and nobody else. Unfortunately there are a lot of naive parents out there. permalink parent award report block reply\nMasterChief 1 points 4 days ago Yeah it's a slippery slope and really complicated. It should really be left up to the parents and nobody else. Unfortunately there are a lot of naive parents out there. permalink parent award report block reply\nCocaineNewsome 3 points 4 days ago The better solution is for parents to.. I dunno.. parent. permalink parent award report block reply MasterChief 2 points 4 days ago Agreed. I am applying my limited purview and generalizing the masses. Empower parents to be good parents. That is probably better left up to privatization than government oversight, imo, but it's taking way too long. permalink parent award report block reply\nMasterChief 2 points 4 days ago Agreed. I am applying my limited purview and generalizing the masses. Empower parents to be good parents. That is probably better left up to privatization than government oversight, imo, but it's taking way too long. permalink parent award report block reply\nRuleoVicus 2 points 4 days ago \"but I can't think of any better solutions\" What exactly is the problem you believe needs a solution? permalink parent award report block reply MasterChief 1 points 4 days ago Do you know if you are talking to a child? If you did, would you change anything about how you are talking to them? Beyond that, they are young and dumb and shouldn't be exposed to a ton of shit that's out there. I am mostly referring to shit I did, or saw growing up without supervision and applying it to others. Probably selfish of me, but I don't want anyone else to make the same mistakes I did. permalink parent award report block reply SpellingContable 1 points 4 days ago The most dangerous thing for children is for them to be in the company of pedos. Both online and in real life. I propose banning children from; -internet porn -internet chatrooms - ex preddit and roblox -government worker interactions -teachers permalink parent award report block reply EvJohn 1 points 4 days ago Very good question.  Upstream. permalink parent award report block reply\nMasterChief 1 points 4 days ago Do you know if you are talking to a child? If you did, would you change anything about how you are talking to them? Beyond that, they are young and dumb and shouldn't be exposed to a ton of shit that's out there. I am mostly referring to shit I did, or saw growing up without supervision and applying it to others. Probably selfish of me, but I don't want anyone else to make the same mistakes I did. permalink parent award report block reply SpellingContable 1 points 4 days ago The most dangerous thing for children is for them to be in the company of pedos. Both online and in real life. I propose banning children from; -internet porn -internet chatrooms - ex preddit and roblox -government worker interactions -teachers permalink parent award report block reply\nSpellingContable 1 points 4 days ago The most dangerous thing for children is for them to be in the company of pedos. Both online and in real life. I propose banning children from; -internet porn -internet chatrooms - ex preddit and roblox -government worker interactions -teachers permalink parent award report block reply\nEvJohn 1 points 4 days ago Very good question.  Upstream. permalink parent award report block reply\nstaroframphansbhole 3 points 4 days ago Yeah well parents have no balls anymore also because of the state, so the state has to step in to offer a solution to the problem it created permalink parent award report block reply Thefrogeatsfree 1 points 4 days ago You got kids? permalink parent award report block reply RuleoVicus 1 points 4 days ago Twenty.  What's your point? permalink parent award report block reply Thefrogeatsfree 1 points 4 days ago Just seems like your part of the problem and not the solution. If you had kids I'd hope you'd practice what you preach instead of the defeatist attitude. permalink parent award report block reply view 5 more comments...\nThefrogeatsfree 1 points 4 days ago You got kids? permalink parent award report block reply RuleoVicus 1 points 4 days ago Twenty.  What's your point? permalink parent award report block reply Thefrogeatsfree 1 points 4 days ago Just seems like your part of the problem and not the solution. If you had kids I'd hope you'd practice what you preach instead of the defeatist attitude. permalink parent award report block reply view 5 more comments...\nRuleoVicus 1 points 4 days ago Twenty.  What's your point? permalink parent award report block reply Thefrogeatsfree 1 points 4 days ago Just seems like your part of the problem and not the solution. If you had kids I'd hope you'd practice what you preach instead of the defeatist attitude. permalink parent award report block reply view 5 more comments...\nThefrogeatsfree 1 points 4 days ago Just seems like your part of the problem and not the solution. If you had kids I'd hope you'd practice what you preach instead of the defeatist attitude. permalink parent award report block reply view 5 more comments...\nAndyCuomoIsAMobster 2 points 4 days ago Read an article in Psychology magazine over five years ago that stated in thirty years we will look back on giving toddlers and children iPads as child abuse. It rewires their brains. permalink parent award report block reply RuleoVicus -3 points 4 days ago Jesus Christ and I bet you think video games cause violence. permalink parent award report block reply Thefrogeatsfree 4 points 4 days ago You're really going hard on this topic. Struck a nerve? Must be one of them roblox predators who dont want their source taken away permalink parent award report block reply AndyCuomoIsAMobster 1 points 3 days ago I don't think they cause violence but I think they make your kid a social idiot, especially when introduced as a toddler. permalink parent award report block reply\nRuleoVicus -3 points 4 days ago Jesus Christ and I bet you think video games cause violence. permalink parent award report block reply Thefrogeatsfree 4 points 4 days ago You're really going hard on this topic. Struck a nerve? Must be one of them roblox predators who dont want their source taken away permalink parent award report block reply AndyCuomoIsAMobster 1 points 3 days ago I don't think they cause violence but I think they make your kid a social idiot, especially when introduced as a toddler. permalink parent award report block reply\nThefrogeatsfree 4 points 4 days ago You're really going hard on this topic. Struck a nerve? Must be one of them roblox predators who dont want their source taken away permalink parent award report block reply\nAndyCuomoIsAMobster 1 points 3 days ago I don't think they cause violence but I think they make your kid a social idiot, especially when introduced as a toddler. permalink parent award report block reply\nCriss_P_Bacon 11 points 4 days ago Social media has negatively impacted society. permalink award report block reply TrumpAndGodWin 1 points 3 days ago \"Comparison is a thief of happiness.\" The elite want miserable people that can be easily controlled. permalink parent award report block reply RuleoVicus -9 points 4 days ago Social media only exposed what was already there. It created nothing. permalink parent award report block reply TrumpyMadeThemGrumpy 9 points 4 days ago It greatly amplified the voices of the hysterical retards that we all just laughed at and ignored.  Now they gather their global retard club together and it makes it seem like their voice is larger than it really is.  Social media creates an illusion and the large gathering of retards is forcing companies and politicians to bend over for them. So yes, the retards were already here, but they thankfully didn't have a voice.  Now they do. permalink parent award report block reply ApparentlyAssumption 7 points 4 days ago This is incorrect.  It has had a drastic effect and damage in society permalink parent award report block reply\nTrumpAndGodWin 1 points 3 days ago \"Comparison is a thief of happiness.\" The elite want miserable people that can be easily controlled. permalink parent award report block reply\nRuleoVicus -9 points 4 days ago Social media only exposed what was already there. It created nothing. permalink parent award report block reply TrumpyMadeThemGrumpy 9 points 4 days ago It greatly amplified the voices of the hysterical retards that we all just laughed at and ignored.  Now they gather their global retard club together and it makes it seem like their voice is larger than it really is.  Social media creates an illusion and the large gathering of retards is forcing companies and politicians to bend over for them. So yes, the retards were already here, but they thankfully didn't have a voice.  Now they do. permalink parent award report block reply ApparentlyAssumption 7 points 4 days ago This is incorrect.  It has had a drastic effect and damage in society permalink parent award report block reply\nTrumpyMadeThemGrumpy 9 points 4 days ago It greatly amplified the voices of the hysterical retards that we all just laughed at and ignored.  Now they gather their global retard club together and it makes it seem like their voice is larger than it really is.  Social media creates an illusion and the large gathering of retards is forcing companies and politicians to bend over for them. So yes, the retards were already here, but they thankfully didn't have a voice.  Now they do. permalink parent award report block reply\nApparentlyAssumption 7 points 4 days ago This is incorrect.  It has had a drastic effect and damage in society permalink parent award report block reply\nTwitter 9 points 4 days ago Surprised they aren't going to ban gaming as well they might as well go full send permalink award report block reply Landslide_2020 OP 10 points 4 days ago I refused to buy gaming systems for my children while they were growing up.  I told them that they could have one, but that they'd have to purchase it themselves.  I also told them that if they wanted to play sports, or any school activities, that of course I would support them and purchase what was needed.  But, they had to maintain a B average in order to participate.  The schools minimum was a C average.  Each one of them graduated with at least a 3.5 GPA.  I don't regret my decision one bit. permalink parent award report block reply Tobin 1 points 4 days ago This is the way, but unfortunately many parents nowadays don't hold their children to any standards and then blame the school.  Don't get me wrong, the schools aren't always good, but they often aren't the problem either. permalink parent award report block reply SanityGumby 2 points 4 days ago A bunch of retards tried by attacking steam but the backlash was large enough Steam backed out permalink parent award report block reply CocaineNewsome 2 points 4 days ago Gaming has online accounts so yes. permalink parent award report block reply\nLandslide_2020 OP 10 points 4 days ago I refused to buy gaming systems for my children while they were growing up.  I told them that they could have one, but that they'd have to purchase it themselves.  I also told them that if they wanted to play sports, or any school activities, that of course I would support them and purchase what was needed.  But, they had to maintain a B average in order to participate.  The schools minimum was a C average.  Each one of them graduated with at least a 3.5 GPA.  I don't regret my decision one bit. permalink parent award report block reply Tobin 1 points 4 days ago This is the way, but unfortunately many parents nowadays don't hold their children to any standards and then blame the school.  Don't get me wrong, the schools aren't always good, but they often aren't the problem either. permalink parent award report block reply\nTobin 1 points 4 days ago This is the way, but unfortunately many parents nowadays don't hold their children to any standards and then blame the school.  Don't get me wrong, the schools aren't always good, but they often aren't the problem either. permalink parent award report block reply\nSanityGumby 2 points 4 days ago A bunch of retards tried by attacking steam but the backlash was large enough Steam backed out permalink parent award report block reply\nCocaineNewsome 2 points 4 days ago Gaming has online accounts so yes. permalink parent award report block reply\nSettin 6 points 4 days ago Kids are noticing we gotta shut it down. permalink award report block reply RuleoVicus 3 points 4 days ago Precisely what's going on. permalink parent award report block reply\nRuleoVicus 3 points 4 days ago Precisely what's going on. permalink parent award report block reply\ncptkloss5 6 points 4 days ago don't fall for this bullshit \"The government plans to enforce the ban through an age-verification app linked to Denmark's national electronic ID system, which nearly all Danish citizens over 13 have.\" permalink award report block reply\npatrioticwinning3 5 points 4 days ago How will they \"verify\" this?  Through some kind of \"digital ID?\" permalink award report block reply\nguywholikesDjtof2024 5 points 4 days ago Slavery dystopia. Welcome to communism and 1984 where free speech is dying or dead. permalink award report block reply\nJC81 5 points 4 days ago This is just another part of the trap of digital id's. It will be a part of social credit scores. Coming to this website will probably get us all thrown in a gulag or unable to buy groceries. permalink award report block reply EvJohn 4 points 4 days ago There's never been a lock made that cannot be breached.  Keep that in mind in this conversation. permalink parent award report block reply\nEvJohn 4 points 4 days ago There's never been a lock made that cannot be breached.  Keep that in mind in this conversation. permalink parent award report block reply\nknnbccb 4 points 4 days ago Some of the (younger) parents are no better, they spend more time on their phones than do actual (offline) parenting stuff. permalink award report block reply\nCocaineNewsome 4 points 4 days ago Yea, 1984 is coming. Why I keep whining about it. How would they know you're not 18? Oh just submit your real identity that for sure isn't going to be connected, no way, no how. How many of you would sign up to PDW with your face, name and address. All sitting there to get hacked or matched up by glowies to pay you a visit. As a result, free speech dies. For the chillun! permalink award report block reply\nMAGALADON9 3 points 4 days ago The EU has full-on pro Islamic pro communist, or sexual degenerate crap and only that censoring anything \"white\" or Christian etc so fuck em. Read a book. permalink award report block reply\nFromseatoshinningsea 3 points 4 days ago Denmark joins Poland & Hungary: nations preserving their citizens, culture & heritage. permalink award report block reply\nterribletwos 3 points 4 days ago They don't want the victims to be able to tattle on the invader pedos publicly. permalink award report block reply RuleoVicus 1 points 4 days ago Incredibly hilarious username to post relevance lol permalink parent award report block reply\nRuleoVicus 1 points 4 days ago Incredibly hilarious username to post relevance lol permalink parent award report block reply\nbluewhiteandred 2 points 4 days ago Debates like this probably center around how to treat middle schoolers (around 10-14) versus high schoolers (around 14-18) Around 10 and under have no business on social media that I can think of (besides maybe an exceptional minority which could be monitored by parents) Adolescents start to want to figure out what the world looks like so we debate when to treat them more like adults in that respect Looks like a rough consensus of high schoolers can be on social media A minority of adolescents / children might develop faster than their peers and maybe exceptions could be made (for example those who like graduate college before age 18) permalink award report block reply\nTerdBergler 2 points 4 days ago Children not using these platforms is great. Government mandating it is BAD. PARENT YOUR CHILDREN! This shit is the equivalent of EBT and section 8, but for parenting. permalink award report block reply\nMakeAmericaGreat9 1 points 4 days ago How do you actually stop this without some bullshit form of ID to use a phone? permalink award report block reply bergsoe -1 points 4 days ago You don't. We have a national digital ID. So the way it's gonna work is that if the social media does not implement it at login, it will likely get banned. Hopefully, this is the stepping stone to also ban all porn for under-18-year-olds, with the same logic. Implement digital ID or get banned by all IPS. Im a Danish National btw. permalink parent award report block reply MakeAmericaGreat9 2 points 4 days ago Get fucked with your national ID. permalink parent award report block reply\nbergsoe -1 points 4 days ago You don't. We have a national digital ID. So the way it's gonna work is that if the social media does not implement it at login, it will likely get banned. Hopefully, this is the stepping stone to also ban all porn for under-18-year-olds, with the same logic. Implement digital ID or get banned by all IPS. Im a Danish National btw. permalink parent award report block reply MakeAmericaGreat9 2 points 4 days ago Get fucked with your national ID. permalink parent award report block reply\nMakeAmericaGreat9 2 points 4 days ago Get fucked with your national ID. permalink parent award report block reply\nVladtheTickler 1 points 4 days ago Make it banned and mysterious to curious teens.  What could possibly go wrong? permalink award report block reply\nSavingPrivateGrace 1 points 4 days ago The twenty somethings on social media ruined the internet.  Reddit and all the generations together online were never going to see eye-to-eye.  Age 15-25  should have a special check mark online so we know they are minors and college age.  There's a reason you can't run for office of the president until 35 and that is because of experience in God, Family & Country.  It should actually be higher now that people are not getting married until their thirties, it's not 1776.  We now have a Mayor of NYC, 34 and never held a job and not that it will happen, but he very well could run in the next presidential election. permalink award report block reply NewGoldenAge 3 points 4 days ago No he can't. Foreign. Ugandan-born. Duuuuuuhhhhhhh Dumbshit faggot. permalink parent award report block reply EvJohn 1 points 4 days ago AoL \"ruined the internet\". The rest is just what followed. permalink parent award report block reply MasterChief 3 points 4 days ago damn, you just made me remember using instant messenger while working on my myspace and geocities after playing runescape permalink parent award report block reply\nNewGoldenAge 3 points 4 days ago No he can't. Foreign. Ugandan-born. Duuuuuuhhhhhhh Dumbshit faggot. permalink parent award report block reply\nEvJohn 1 points 4 days ago AoL \"ruined the internet\". The rest is just what followed. permalink parent award report block reply MasterChief 3 points 4 days ago damn, you just made me remember using instant messenger while working on my myspace and geocities after playing runescape permalink parent award report block reply\nMasterChief 3 points 4 days ago damn, you just made me remember using instant messenger while working on my myspace and geocities after playing runescape permalink parent award report block reply\nVoteMAGA 1 points 4 days ago We already mostly have the infrastructure in place to do it in the US. Between TPM modules on computers and UID+IMEI on phones, it is just a matter of making API calls to implement it with a database of users. The goal isn't to protect children though, it is to ultimately police and limit any free thinking content. permalink award report block reply\nMichalusmichalus 1 points 4 days ago My kids had adult supervision. It was my responsibility alone. Here we are, my kids are grown. And AI can't figure out its 3 people using everything of mine not one person. If I lived there, my kids would just be me. permalink award report block reply\nSanityGumby 1 points 4 days ago This shouldn’t be a thing because parents shouldn’t be letting their kids on this shit to begin with permalink award report block reply\ncyberwar 1 points 4 days ago ban them from all so that pedos can't abuse them permalink award report block reply\nLower 0 points 4 days ago Sadly, the vast majority of parents will grant access anyway, because they don't want their child \"bullied over not having access\" (aka, LAZY PARENTS) permalink award report block reply"}