{"id": "1ARK9nNylk", "contents": "73 ? posted 7 hours ago by wst4 2 comments award share download report block\n2 comments Sort by Top Top New Worst Old Save Elon Walked Away – Now We Know Why Read More Ads by Ad.Style Captntrouble 1 points 7 hours ago Think some archaeologist lost their funding or something because they said that bones were gender neutral permalink award report block reply Nutt_bugget 1 points 6 hours ago Archaeologists can easily distinguish between the sexes by simply looking at the pelvis of the skeleton-person in question https://anatomynote.com/male-vs-female-pelvis-anatomical-differences-and-functions/ Note that there is no weaseling about it. The pelvis shows the sex of the skeleton-person. There's no accounting for the made-up term 'gender', so none of the many bullshit categories apply. There's another interesting fact: They can tell if a skeleton wore a wedding ring, and may have been married. If you wear a wedding ring on your \"ring finger\" for a long time, the bone underneath the ring becomes polished, and very smooth. Normally, bones have a slightly striated texture - they're not perfectly smooth. Unless you've worn a ring for a long time, that is.  Married? Not sure, but customs and other things notwithstanding, they can tell if you've worn an ornament on that hand. <TheMoreYouKnow.gif> permalink award report block reply\nCaptntrouble 1 points 7 hours ago Think some archaeologist lost their funding or something because they said that bones were gender neutral permalink award report block reply\nNutt_bugget 1 points 6 hours ago Archaeologists can easily distinguish between the sexes by simply looking at the pelvis of the skeleton-person in question https://anatomynote.com/male-vs-female-pelvis-anatomical-differences-and-functions/ Note that there is no weaseling about it. The pelvis shows the sex of the skeleton-person. There's no accounting for the made-up term 'gender', so none of the many bullshit categories apply. There's another interesting fact: They can tell if a skeleton wore a wedding ring, and may have been married. If you wear a wedding ring on your \"ring finger\" for a long time, the bone underneath the ring becomes polished, and very smooth. Normally, bones have a slightly striated texture - they're not perfectly smooth. Unless you've worn a ring for a long time, that is.  Married? Not sure, but customs and other things notwithstanding, they can tell if you've worn an ornament on that hand. <TheMoreYouKnow.gif> permalink award report block reply"}