{"id": "1ARK9pfs4S", "contents": "109 JUST IN: Democrats began SCREECHING  at each other on the House floor when members of their own party defected and voted to REOPEN\n\n“NO!!!! NOOOOO!!!!!!!”\n\n*unintelligible screaming*\n\nDemocrats are in full meltdown mode 🤣🔥 posted 6 hours ago by kinbergfan 6 comments award share report block Nick Sortor @nicksortor • 13h 🚨 JUST IN: Democrats began SCREECHING  at each other on the House floor when members of their own party defected and voted to REOPEN “NO!!!! NOOOOO!!!!!!!” *unintelligible screaming* Democrats are in full meltdown mode 🤣🔥\n6 comments Sort by Top Top New Worst Old Save BartzFFV 2 points 6 hours ago You where cheering for food stamps and a hemp ban and some other dirty shit they snuck in? permalink award report block reply Spellmonger 2 points 4 hours ago Congress approved a $5,000 personal payout, which they will start collecting 5 minutes after the bill is signed into law, while promising us $1,000  apiece that we will never see . permalink parent award report block reply KilroyJCNJ 2 points 6 hours ago You love to see it. permalink award report block reply eclectic22 2 points 6 hours ago Demonic. permalink award report block reply Spellmonger 1 points 4 hours ago Democrats began SCREECHING at each other on the House floor when members of their own party defected and voted to REOPEN\n“NO!!!! NOOOOO!!!!!!!” unintelligible screaming It is all an act; stop falling for it, if you are falling for it.  Or stop pushing it, if you see clearly but are willing to use your influence to deceive anyone who even half-way believes in you. permalink award report block reply SubmarineGuy 1 points 5 hours ago Schendfraude! permalink award report block reply\nBartzFFV 2 points 6 hours ago You where cheering for food stamps and a hemp ban and some other dirty shit they snuck in? permalink award report block reply Spellmonger 2 points 4 hours ago Congress approved a $5,000 personal payout, which they will start collecting 5 minutes after the bill is signed into law, while promising us $1,000  apiece that we will never see . permalink parent award report block reply\nSpellmonger 2 points 4 hours ago Congress approved a $5,000 personal payout, which they will start collecting 5 minutes after the bill is signed into law, while promising us $1,000  apiece that we will never see . permalink parent award report block reply\nKilroyJCNJ 2 points 6 hours ago You love to see it. permalink award report block reply\neclectic22 2 points 6 hours ago Demonic. permalink award report block reply\nSpellmonger 1 points 4 hours ago Democrats began SCREECHING at each other on the House floor when members of their own party defected and voted to REOPEN\n“NO!!!! NOOOOO!!!!!!!” unintelligible screaming It is all an act; stop falling for it, if you are falling for it.  Or stop pushing it, if you see clearly but are willing to use your influence to deceive anyone who even half-way believes in you. permalink award report block reply\nSubmarineGuy 1 points 5 hours ago Schendfraude! permalink award report block reply"}