{"id": "1ARK9oY1ys", "contents": "73 \"Immigration views are rapidly switching among Republicans where many would prefer illegal Mexicans over H1b workers. It's one of the biggest issues and Republican leaders won't listen. They need to pay attention, because their base would just prefer not to vote rather than have American jobs taken\" posted 14 hours ago by bleeje 8 comments award share report block 9mmSMG @9mm_smg • 16h Immigration views are rapidly switching among Republicans where many would prefer illegal Mexicans over H1b workers. It's one of the biggest issues and Republican leaders won't listen. They need to pay attention, because their base would just prefer not to vote rather than have Rep. Chip Roy Press Office @RepChipRoy • 20h Rep. Roy: \"I've got a bill that I'm going to be introducing that is a freeze on ALL immigration. Freeze it until we achieve certain objectives: reforming chain migration, ending H-1B visas, getting birthright citizenship dealt with, and vetting people for their adherence to\n8 comments Sort by Top Top New Worst Old Save patrioticwinning3 14 points 13 hours ago FUCK 'EM BOTH!  WE WANT NEITHER!  AMERICA FIRST! permalink award report block reply MemeWarsVet 13 points 14 hours ago Um, no.  I want neither. HIRE AMERICANS IN AMERICA! permalink award report block reply Fren20 11 points 13 hours ago Hell no we do not want illegals of all fuck this shit stupid moron no illegal Mexicans.. motherfuckers permalink award report block reply BoltCarrierGroup 11 points 14 hours ago I want no immigrants But if it was forced (which we got forced over the last few decades of all) I’d pick 1,000 illegal Mexicans over 10 legal Indians. permalink award report block reply CleanUpPhillyTrump24 9 points 13 hours ago Where does any GOPer say they prefer Mexican illegals over Indian H1bs? permalink award report block reply Formerlurker92 7 points 13 hours ago None! What is so fucking hard about none! permalink award report block reply PatriotGeneral 3 points 12 hours ago Automatically Denaturalize everyone who would not have qualified for the 1965 immigration act permalink award report block reply BadBrainsBuzzcocks 2 points 12 hours ago What a moronic thing to say. It's isn't one or the other. No illegals no matter where they are from and no H1Bs. We'll lose the midterms because of this lame shit. permalink award report block reply\npatrioticwinning3 14 points 13 hours ago FUCK 'EM BOTH!  WE WANT NEITHER!  AMERICA FIRST! permalink award report block reply\nMemeWarsVet 13 points 14 hours ago Um, no.  I want neither. HIRE AMERICANS IN AMERICA! permalink award report block reply\nFren20 11 points 13 hours ago Hell no we do not want illegals of all fuck this shit stupid moron no illegal Mexicans.. motherfuckers permalink award report block reply\nBoltCarrierGroup 11 points 14 hours ago I want no immigrants But if it was forced (which we got forced over the last few decades of all) I’d pick 1,000 illegal Mexicans over 10 legal Indians. permalink award report block reply\nCleanUpPhillyTrump24 9 points 13 hours ago Where does any GOPer say they prefer Mexican illegals over Indian H1bs? permalink award report block reply\nFormerlurker92 7 points 13 hours ago None! What is so fucking hard about none! permalink award report block reply\nPatriotGeneral 3 points 12 hours ago Automatically Denaturalize everyone who would not have qualified for the 1965 immigration act permalink award report block reply\nBadBrainsBuzzcocks 2 points 12 hours ago What a moronic thing to say. It's isn't one or the other. No illegals no matter where they are from and no H1Bs. We'll lose the midterms because of this lame shit. permalink award report block reply"}