{"id": "1ARK57qr2p", "contents": "273 Mamdani charges campaign workers for drinks at  victory party. posted 4 days ago by Belleoffreedom 20 comments award share report block 🇺🇸 Pecan 🇺🇸 @PecanC8 • 5d Mamdani is under fire for charging people $13 per beer at his ‘victory party’. \"I arrived thinking everything would be free, only to be charged $13 for a Bud Light. I was shocked after all the hard work I put in,\" one progressive campaign worker said. This is gonna be fun! 🍿🤣\n20 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Stossels_stach 20 points 4 days ago Of course it was a Bud Light permalink award report block reply AgnesDomini 14 points 4 days ago \"Oh, I'm stupid, and just found out that I'm stupid!\" There, I fixed it for you. permalink award report block reply God-is-good 4 points 4 days ago Quicker turn around than normal is refreshing. permalink parent award report block reply Comanche_Moon 2 points 4 days ago They should have known better.  Stupid is as stupid does. permalink parent award report block reply Covfefebrulee 8 points 4 days ago He looks like a low IQ beaver. permalink award report block reply YaharaRiver 3 points 4 days ago A beaver that gnawed a burnt stump at that! permalink parent award report block reply Covfefebrulee 2 points 4 days ago I truly mean when I say…apologies to beavers. permalink parent award report block reply tired-of-crap 7 points 4 days ago Free everything except for things that are traditionally free. That's all right, when he finds out about the Federal Transit administration rules, the buses will not be free either. Eventually you run out of other people's money.  Looks like this is already happened here. permalink award report block reply bill_in_texas 3 points 4 days ago Wait until they aren't permitted to access or drink alcohol! permalink award report block reply Belleoffreedom OP 2 points 4 days ago https://x.com/PecanC8/status/1986943422586876096?s=20 permalink award report block reply equiv222 2 points 4 days ago SORRY, JUST THE BUS RIDE AND THE HOUSING IS FREE.. THE BEER AND AIR ARE GOING TO BE A PREMIUM FROM NOW ON.\nHOW MUCH IS NOW IN HIS POCKET FOR HIS GREAT ACTING LEARNED A CENTRAL CASTING? I'M GUESSING HE IS ALREADY NEARING $500K FREE AND CLEAR, NO TAXES OWED. permalink award report block reply SpeekFreely 2 points 4 days ago Mandami is on the payroll https://jellyfish.news/new-york-city-mayor-zohran-mamdani-is-another-controlled-puppet-funded-by-jews-who-is-being-used-to-ramp-up-renewed-islamophobia-propaganda/ permalink award report block reply npc_1234 2 points 4 days ago Not only was he charging them, he was ripping them off. A tallboy of domestic is $16 at Yankee Stadium . permalink award report block reply blitzkrieg1 1 points 4 days ago He must be a closet jew. permalink award report block reply mailinvoter 1 points 4 days ago I wonder if the stock was super limited as well? permalink award report block reply sixfingerdildo 1 points 4 days ago Socialism ain't free, bitch, who you think you is! permalink award report block reply Laquandavious 1 points 4 days ago What if this guy ends up being a hardcore fiscal conservative penny pinching Indian? permalink award report block reply equiv222 1 points 4 days ago MAKE NO MISTAKE. HE IS THERE TO FURTHER THE RADICAL ISLAM AGENDA.. THATS IT.\nYOU WILL BECOME MUSLIM TO GET ANYTHING OUT OF PROMISES (he didn't promise anything, he just presented a vision, and let people THINK whatever they gleaned from his obama tonge)\n. LIKE BUS PASSES.. CONVERT... AND YOU GET 1 MONTH PASS for bus rides,\nGO TO MUSLIM PRAYER.. GET ANOTHER WEEK OF BUS PASS.\nFREE HOUSING... WITH A ONE BEDROOM AND 4 OTHER STINKY MUSLIMS. .. BUT ONLY IF YOU ATTEND PRAYER WHEN THE BELL GOES OFF. YOU MUST SUBSCRIBE TO SHARIA LAW  IF YOU WANT ANYTHING FREE. THATS HOW THIS WILL GO DOWN.\nSELL YOUR SOUL FOR HIS VISION, NOT SOMETHING FOR NOTHING.\nIF YOU CONVERT TO ISLAM, WE WON'T RAISE YOUR TAXES 2.5% ETC permalink award report block reply equiv222 1 points 4 days ago I HOPE THE GOAT FUCKERS RAPE HIM AFTER RAPING A GOAT permalink award report block reply NecturusMaculosus 1 points 4 days ago Welcome to communism! permalink award report block reply\nStossels_stach 20 points 4 days ago Of course it was a Bud Light permalink award report block reply\nAgnesDomini 14 points 4 days ago \"Oh, I'm stupid, and just found out that I'm stupid!\" There, I fixed it for you. permalink award report block reply God-is-good 4 points 4 days ago Quicker turn around than normal is refreshing. permalink parent award report block reply Comanche_Moon 2 points 4 days ago They should have known better.  Stupid is as stupid does. permalink parent award report block reply\nGod-is-good 4 points 4 days ago Quicker turn around than normal is refreshing. permalink parent award report block reply\nComanche_Moon 2 points 4 days ago They should have known better.  Stupid is as stupid does. permalink parent award report block reply\nCovfefebrulee 8 points 4 days ago He looks like a low IQ beaver. permalink award report block reply YaharaRiver 3 points 4 days ago A beaver that gnawed a burnt stump at that! permalink parent award report block reply Covfefebrulee 2 points 4 days ago I truly mean when I say…apologies to beavers. permalink parent award report block reply\nYaharaRiver 3 points 4 days ago A beaver that gnawed a burnt stump at that! permalink parent award report block reply Covfefebrulee 2 points 4 days ago I truly mean when I say…apologies to beavers. permalink parent award report block reply\nCovfefebrulee 2 points 4 days ago I truly mean when I say…apologies to beavers. permalink parent award report block reply\ntired-of-crap 7 points 4 days ago Free everything except for things that are traditionally free. That's all right, when he finds out about the Federal Transit administration rules, the buses will not be free either. Eventually you run out of other people's money.  Looks like this is already happened here. permalink award report block reply\nbill_in_texas 3 points 4 days ago Wait until they aren't permitted to access or drink alcohol! permalink award report block reply\nBelleoffreedom OP 2 points 4 days ago https://x.com/PecanC8/status/1986943422586876096?s=20 permalink award report block reply\nequiv222 2 points 4 days ago SORRY, JUST THE BUS RIDE AND THE HOUSING IS FREE.. THE BEER AND AIR ARE GOING TO BE A PREMIUM FROM NOW ON.\nHOW MUCH IS NOW IN HIS POCKET FOR HIS GREAT ACTING LEARNED A CENTRAL CASTING? I'M GUESSING HE IS ALREADY NEARING $500K FREE AND CLEAR, NO TAXES OWED. permalink award report block reply\nSpeekFreely 2 points 4 days ago Mandami is on the payroll https://jellyfish.news/new-york-city-mayor-zohran-mamdani-is-another-controlled-puppet-funded-by-jews-who-is-being-used-to-ramp-up-renewed-islamophobia-propaganda/ permalink award report block reply\nnpc_1234 2 points 4 days ago Not only was he charging them, he was ripping them off. A tallboy of domestic is $16 at Yankee Stadium . permalink award report block reply\nblitzkrieg1 1 points 4 days ago He must be a closet jew. permalink award report block reply\nmailinvoter 1 points 4 days ago I wonder if the stock was super limited as well? permalink award report block reply\nsixfingerdildo 1 points 4 days ago Socialism ain't free, bitch, who you think you is! permalink award report block reply\nLaquandavious 1 points 4 days ago What if this guy ends up being a hardcore fiscal conservative penny pinching Indian? permalink award report block reply\nequiv222 1 points 4 days ago MAKE NO MISTAKE. HE IS THERE TO FURTHER THE RADICAL ISLAM AGENDA.. THATS IT.\nYOU WILL BECOME MUSLIM TO GET ANYTHING OUT OF PROMISES (he didn't promise anything, he just presented a vision, and let people THINK whatever they gleaned from his obama tonge)\n. LIKE BUS PASSES.. CONVERT... AND YOU GET 1 MONTH PASS for bus rides,\nGO TO MUSLIM PRAYER.. GET ANOTHER WEEK OF BUS PASS.\nFREE HOUSING... WITH A ONE BEDROOM AND 4 OTHER STINKY MUSLIMS. .. BUT ONLY IF YOU ATTEND PRAYER WHEN THE BELL GOES OFF. YOU MUST SUBSCRIBE TO SHARIA LAW  IF YOU WANT ANYTHING FREE. THATS HOW THIS WILL GO DOWN.\nSELL YOUR SOUL FOR HIS VISION, NOT SOMETHING FOR NOTHING.\nIF YOU CONVERT TO ISLAM, WE WON'T RAISE YOUR TAXES 2.5% ETC permalink award report block reply\nequiv222 1 points 4 days ago I HOPE THE GOAT FUCKERS RAPE HIM AFTER RAPING A GOAT permalink award report block reply\nNecturusMaculosus 1 points 4 days ago Welcome to communism! permalink award report block reply"}