{"id": "1ARK9nNiBZ", "contents": "33 Breaking News: The faggot loser Jimmy Kimmel is such an unbelievable cuck that he hired his shitlib wife to be executive producer and head writer lmao! So now this ugly ass 4 on a scale of 10 entitled karen wants the world to know how much she hates Trump supporters in 2025 YOU'RE  FIRED! posted 10 hours ago by LearnAboutRoaches 3 comments award share report block Chief Nerd @TheChiefNerd • 4d 🚨 NEW: Jimmy Kimmel’s Wife & Show Producer Molly McNearney Says She is Losing Relationships w/ Her Trump-Voting Family, Wishes She Could ‘Deprogram’ Herself “To me, them voting for Trump is them not voting for my husband and me and our family … This is not just Republican\n3 comments Sort by Top Top New Worst Old Save LearnAboutRoaches OP 2 points 10 hours ago So who's wearing the pants? Neither one of these fucking parasites, they are both equally pedo supporting shit fucking holly wood stains Now with an added curse to all of the people who were around when it started with the main member Cleto of his Cletones band just dying as a young man like uncle Frank permalink award report block reply reversethefraud 2 points 9 hours ago wow I couldn't even take 30 seconds of that. Such special people who are the more smrter than everyone else. permalink award report block reply LearnAboutRoaches OP 1 points 9 hours ago Once you get those millions pouring in from selling your soul, you can't go back so of course these miserable looking shit beings continue to be shit beings permalink parent award report block reply\nLearnAboutRoaches OP 2 points 10 hours ago So who's wearing the pants? Neither one of these fucking parasites, they are both equally pedo supporting shit fucking holly wood stains Now with an added curse to all of the people who were around when it started with the main member Cleto of his Cletones band just dying as a young man like uncle Frank permalink award report block reply\nreversethefraud 2 points 9 hours ago wow I couldn't even take 30 seconds of that. Such special people who are the more smrter than everyone else. permalink award report block reply LearnAboutRoaches OP 1 points 9 hours ago Once you get those millions pouring in from selling your soul, you can't go back so of course these miserable looking shit beings continue to be shit beings permalink parent award report block reply\nLearnAboutRoaches OP 1 points 9 hours ago Once you get those millions pouring in from selling your soul, you can't go back so of course these miserable looking shit beings continue to be shit beings permalink parent award report block reply"}