{"id": "1ARK9mHEbn", "contents": "388 Most foreign \"talent\" is fake from diploma and certification mills. It's all corporate welfare at the expense of Americans. America first! posted 14 hours ago by wharfthrowaway 9 comments award share report block Really hope we aren't forced to pretend H1B is a good thing.\n9 comments Sort by Top Top New Worst Old Save one_cool 10 points 13 hours ago Jeets have entire network of fake schools in Canada like conestoga colleg and also fake medical and academic journals that will \"publish\" their fake papers.  For example, \"American Journal of Biomedical Science and Research\" is operated out of India to get jeets O-1 visas. permalink award report block reply Calumet57 6 points 14 hours ago H1B sounds like a good name for a debilitating and potentially lethal virus.. permalink award report block reply RealWomenLoveTrump 6 points 13 hours ago That's because it is permalink parent award report block reply Goozmania 6 points 11 hours ago They know this. They don't fucking care. permalink award report block reply SuperDuperBasedMD 3 points 12 hours ago I wonder if there isn't a way to weaponize the legal system against companies that hire fake H1bs. Bloomberg columnist Matt Levine has a saying, \"Everything is securities fraud.\" which means that virtually any negative corporate behavior can lead to securities fraud claims if it affects shareholders. For instance, if a company fails to disclose harmful information that impacts its stock price, it may face lawsuits from shareholders claiming securities fraud. I imagine that hiring H1b's with fake degrees would qualify since the risk of a fuck up would be higher and any fuckups would entail more liability than if they had legit degrees since corporate should have known. What we need is a MAGA law firm to file nuisance securities fraud lawsuits against individual directors and CEOs, not because we expect to win damages, but to intimidate them into not hiring people with fake degrees. permalink award report block reply TrumpPl4yedU 1 points 8 hours ago Comment removed upon the user being banned. permalink parent award report block reply -Evspra 1 points 8 hours ago u/GuerillaYourDreams check out the username. I wonder what nice things he'll have to say lol permalink parent award report block reply cosmos411 2 points 5 hours ago I witnessed this far too often. Streetshitter programmers spend most of their day googling for code and then copy/pasting it .. and it never works properly. Searching online for code is one thing, but you have to be able to tweak the code for your purpose, which requires programming knowledge they don't have. permalink award report block reply booblitchutz 1 points 4 hours ago They don’t have to do this anymore. AI will spit out code for them. permalink parent award report block reply\none_cool 10 points 13 hours ago Jeets have entire network of fake schools in Canada like conestoga colleg and also fake medical and academic journals that will \"publish\" their fake papers.  For example, \"American Journal of Biomedical Science and Research\" is operated out of India to get jeets O-1 visas. permalink award report block reply\nCalumet57 6 points 14 hours ago H1B sounds like a good name for a debilitating and potentially lethal virus.. permalink award report block reply RealWomenLoveTrump 6 points 13 hours ago That's because it is permalink parent award report block reply\nRealWomenLoveTrump 6 points 13 hours ago That's because it is permalink parent award report block reply\nGoozmania 6 points 11 hours ago They know this. They don't fucking care. permalink award report block reply\nSuperDuperBasedMD 3 points 12 hours ago I wonder if there isn't a way to weaponize the legal system against companies that hire fake H1bs. Bloomberg columnist Matt Levine has a saying, \"Everything is securities fraud.\" which means that virtually any negative corporate behavior can lead to securities fraud claims if it affects shareholders. For instance, if a company fails to disclose harmful information that impacts its stock price, it may face lawsuits from shareholders claiming securities fraud. I imagine that hiring H1b's with fake degrees would qualify since the risk of a fuck up would be higher and any fuckups would entail more liability than if they had legit degrees since corporate should have known. What we need is a MAGA law firm to file nuisance securities fraud lawsuits against individual directors and CEOs, not because we expect to win damages, but to intimidate them into not hiring people with fake degrees. permalink award report block reply TrumpPl4yedU 1 points 8 hours ago Comment removed upon the user being banned. permalink parent award report block reply -Evspra 1 points 8 hours ago u/GuerillaYourDreams check out the username. I wonder what nice things he'll have to say lol permalink parent award report block reply\nTrumpPl4yedU 1 points 8 hours ago Comment removed upon the user being banned. permalink parent award report block reply -Evspra 1 points 8 hours ago u/GuerillaYourDreams check out the username. I wonder what nice things he'll have to say lol permalink parent award report block reply\n-Evspra 1 points 8 hours ago u/GuerillaYourDreams check out the username. I wonder what nice things he'll have to say lol permalink parent award report block reply\ncosmos411 2 points 5 hours ago I witnessed this far too often. Streetshitter programmers spend most of their day googling for code and then copy/pasting it .. and it never works properly. Searching online for code is one thing, but you have to be able to tweak the code for your purpose, which requires programming knowledge they don't have. permalink award report block reply booblitchutz 1 points 4 hours ago They don’t have to do this anymore. AI will spit out code for them. permalink parent award report block reply\nbooblitchutz 1 points 4 hours ago They don’t have to do this anymore. AI will spit out code for them. permalink parent award report block reply"}