{"id": "1ARK9pfsTI", "contents": "168 MAGA / AF isn't dead. It's doing what it's always done and that is shed all of those who can't endure its core convictions. posted 4 hours ago by MickHigan2 8 comments award share report block Being America First is tough when you have a shit ton of foreigners in your ear working for foreign interests.\n8 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Save on Your Electric Bill (Try Tonight) GadgetCyno SpeekFreely 7 points 4 hours ago There is too much infiltrated corruption w/in the MAGA movement at the government level. This is gonna turn out to be just like the fight for the Republican Party, a decade long waste of time trying to reform it. A new party is needed, America Only, they can’t win w/out us so they will be forced to contend w/us. permalink award report block reply Brandon1776 5 points 4 hours ago Maga and AF arent the same thing anymore. Maga are globist first shills. They sold us up the river....again permalink award report block reply Strike08 2 points 3 hours ago Literally 1 account is posting that crap on c/funny . You block him and no posts. Almost like some sore leftoid is doing this because they got nothing out of closing government permalink award report block reply MAG-n-KAG 2 points 2 hours ago MAGA isnt dead or dying.  It'll just have to move on without Trump. permalink award report block reply BBvarn 1 points 2 hours ago Okay, then move to NYC with your beloved goat fucker leader.  There is free housing and free bus rides in NYC. permalink award report block reply JustAnotherPsyopNPC -1 points 4 hours ago MIGA! permalink award report block reply Mydogisbetter 4 points 4 hours ago Nah fuck that let's just do the civil war thing and get rid of the lot of them.  H1Bs ruined my company and my career fuck them. permalink parent award report block reply patriotpodcast 1 points 2 hours ago Comment removed by community filter, pending further review. permalink award report block reply\nSpeekFreely 7 points 4 hours ago There is too much infiltrated corruption w/in the MAGA movement at the government level. This is gonna turn out to be just like the fight for the Republican Party, a decade long waste of time trying to reform it. A new party is needed, America Only, they can’t win w/out us so they will be forced to contend w/us. permalink award report block reply\nBrandon1776 5 points 4 hours ago Maga and AF arent the same thing anymore. Maga are globist first shills. They sold us up the river....again permalink award report block reply\nStrike08 2 points 3 hours ago Literally 1 account is posting that crap on c/funny . You block him and no posts. Almost like some sore leftoid is doing this because they got nothing out of closing government permalink award report block reply\nMAG-n-KAG 2 points 2 hours ago MAGA isnt dead or dying.  It'll just have to move on without Trump. permalink award report block reply\nBBvarn 1 points 2 hours ago Okay, then move to NYC with your beloved goat fucker leader.  There is free housing and free bus rides in NYC. permalink award report block reply\nJustAnotherPsyopNPC -1 points 4 hours ago MIGA! permalink award report block reply Mydogisbetter 4 points 4 hours ago Nah fuck that let's just do the civil war thing and get rid of the lot of them.  H1Bs ruined my company and my career fuck them. permalink parent award report block reply\nMydogisbetter 4 points 4 hours ago Nah fuck that let's just do the civil war thing and get rid of the lot of them.  H1Bs ruined my company and my career fuck them. permalink parent award report block reply\npatriotpodcast 1 points 2 hours ago Comment removed by community filter, pending further review. permalink award report block reply"}