{"id": "1ARK9oWeTA", "contents": "15 What if I told you the Senate GOP (Looking at You Sen. Thune 👀)\nSlipped a Poisoned Pill into the Legislation they sent back to the House GOP and that poisoned pill was going to create One Hell Of A PAYDAY for some of them…I’m sure some of you might think I was making it up... Video:[7mins34secs] posted 2 hours ago by 5121313 12 comments award share report block 𝓜𝓐𝓖𝓐 𝕏 𝓣𝓘𝓜𝓔𝓢 𝓓𝓐𝓘𝓛𝓨 𝓝𝓔𝓦𝓢🇺🇸 @MAGA_X_Times • 11h What if I told you the @SenateGOP slipped a poisoned pill into the legislation they sent back to @HouseGOP and that poisoned pill was going to create one hell of a payday for some of them…I’m sure some of you might think I was making it up.\n12 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style 5121313 OP 4 points 2 hours ago House Rules Committee. Video X- Post Back Up Link: https://x.com/MAGA_X_Times/status/1988596512730054682 $500,000.00 x 6 or 7... permalink award report block reply 2025WhatIsTrue 4 points 2 hours ago Typical smarmy, integrity-free loser politicians...the lowest form of life. permalink award report block reply FusionBlack 4 points 2 hours ago Holy shit! They just wrote themselves a check! A list of the names  should be posted by the house. Vote no. Imagine having the power to give yourself millions of dollars .  We need a tar and feather session at the capital steps. If they were spied on prosecute them not get rich over it. permalink award report block reply GoodvsEvil2 2 points 1 hour ago \" in the last FISA-702 reauthorization, Congress also forbade any member of the legislative branch from being subject to the illegal use of the NSA surveillance system.\nCongress is exempt from the FISA abuse they authorize on Americans, and Congress is exempt from subpoenas against their phone records that are authorized against Americans. \" permalink award report block reply ReleasetheList 1 points 2 hours ago This about the Hemp ban? permalink award report block reply 5121313 OP 3 points 2 hours ago Nope ... More like Snooping on Senators since 2020.. From what I gather. permalink parent award report block reply ReleasetheList 2 points 2 hours ago Just watched. Wow, just when you think they couldn't be bigger shitbags. So they want protection from accountability and they want to be able sue if they are ever investigated. And they want to make it retroactive. permalink parent award report block reply 5121313 OP 2 points 2 hours ago Frigg'n Unbelievable!  Huh? permalink parent award report block reply MrMcGreenGenes 0 points 2 hours ago Trump signed this bullshit yet? permalink award report block reply Cville123 -2 points 2 hours ago Explain it not some drawn out video permalink award report block reply 5121313 OP 3 points 2 hours ago Go ahead be my Guest... permalink parent award report block reply SpeekFreely 2 points 2 hours ago https://theconservativetreehouse.com/blog/2025/11/10/republican-senators-include-provision-in-shutdown-bill-that-doj-cannot-subpoena-senators-phone-records-you-me-no-such-protection/ permalink parent award report block reply\n5121313 OP 4 points 2 hours ago House Rules Committee. Video X- Post Back Up Link: https://x.com/MAGA_X_Times/status/1988596512730054682 $500,000.00 x 6 or 7... permalink award report block reply\n2025WhatIsTrue 4 points 2 hours ago Typical smarmy, integrity-free loser politicians...the lowest form of life. permalink award report block reply\nFusionBlack 4 points 2 hours ago Holy shit! They just wrote themselves a check! A list of the names  should be posted by the house. Vote no. Imagine having the power to give yourself millions of dollars .  We need a tar and feather session at the capital steps. If they were spied on prosecute them not get rich over it. permalink award report block reply\nGoodvsEvil2 2 points 1 hour ago \" in the last FISA-702 reauthorization, Congress also forbade any member of the legislative branch from being subject to the illegal use of the NSA surveillance system.\nCongress is exempt from the FISA abuse they authorize on Americans, and Congress is exempt from subpoenas against their phone records that are authorized against Americans. \" permalink award report block reply\nReleasetheList 1 points 2 hours ago This about the Hemp ban? permalink award report block reply 5121313 OP 3 points 2 hours ago Nope ... More like Snooping on Senators since 2020.. From what I gather. permalink parent award report block reply ReleasetheList 2 points 2 hours ago Just watched. Wow, just when you think they couldn't be bigger shitbags. So they want protection from accountability and they want to be able sue if they are ever investigated. And they want to make it retroactive. permalink parent award report block reply 5121313 OP 2 points 2 hours ago Frigg'n Unbelievable!  Huh? permalink parent award report block reply\n5121313 OP 3 points 2 hours ago Nope ... More like Snooping on Senators since 2020.. From what I gather. permalink parent award report block reply ReleasetheList 2 points 2 hours ago Just watched. Wow, just when you think they couldn't be bigger shitbags. So they want protection from accountability and they want to be able sue if they are ever investigated. And they want to make it retroactive. permalink parent award report block reply 5121313 OP 2 points 2 hours ago Frigg'n Unbelievable!  Huh? permalink parent award report block reply\nReleasetheList 2 points 2 hours ago Just watched. Wow, just when you think they couldn't be bigger shitbags. So they want protection from accountability and they want to be able sue if they are ever investigated. And they want to make it retroactive. permalink parent award report block reply 5121313 OP 2 points 2 hours ago Frigg'n Unbelievable!  Huh? permalink parent award report block reply\n5121313 OP 2 points 2 hours ago Frigg'n Unbelievable!  Huh? permalink parent award report block reply\nMrMcGreenGenes 0 points 2 hours ago Trump signed this bullshit yet? permalink award report block reply\nCville123 -2 points 2 hours ago Explain it not some drawn out video permalink award report block reply 5121313 OP 3 points 2 hours ago Go ahead be my Guest... permalink parent award report block reply SpeekFreely 2 points 2 hours ago https://theconservativetreehouse.com/blog/2025/11/10/republican-senators-include-provision-in-shutdown-bill-that-doj-cannot-subpoena-senators-phone-records-you-me-no-such-protection/ permalink parent award report block reply\n5121313 OP 3 points 2 hours ago Go ahead be my Guest... permalink parent award report block reply\nSpeekFreely 2 points 2 hours ago https://theconservativetreehouse.com/blog/2025/11/10/republican-senators-include-provision-in-shutdown-bill-that-doj-cannot-subpoena-senators-phone-records-you-me-no-such-protection/ permalink parent award report block reply"}