{"id": "1ARK9mHETR", "contents": "268 I promise you, if the H-1B system was really about bringing the most talented to America, 70% of them wouldn’t magically come from India.\n\nAre there no, Poles, Japanese, or Australians that are smart enough? \n\nIt’s a scam and we all know it. The least Trump could do is not pretend like we’re stupid. posted 12 hours ago by PiratePatriotParrot 12 comments award share report block Lane Kendall @lanedeankendall • 18h I promise you, if the H-1B system was really about bringing the most talented to America, 70% of them wouldn’t magically come from India. Are there no, Poles, Japanese, or Australians that are smart enough? It’s a scam and we all know it. The least Trump could do is not\n12 comments Sort by Top Top New Worst Old Save Spunky_kitty 8 points 12 hours ago Indians are desperate to escape their country and I don't blame them, but they're like rats fleeing a sinking ship. permalink award report block reply MAG-n-KAG 3 points 6 hours ago they're shit overflowing a toilet permalink parent award report block reply cyberrigger 7 points 12 hours ago Isn't India's average IQ below par? permalink award report block reply sleepinggiant 2 points 6 hours ago Middle asia has a massive inbreeding problem. permalink parent award report block reply Metal4Freedom 6 points 12 hours ago YEET THE JEET permalink award report block reply booblitchutz 5 points 8 hours ago There are H1Bs from other places than India. I know a few. But like 95% of them are from India. It’s definitely a scam. permalink award report block reply mandarb916 3 points 10 hours ago Contrary to popular foreign belief, there isn't a huge desire by Japanese citizens to leave Japan. Life there has its flaws, but unlike Easter European countries, India, China, etc, life is pretty decent there. It being a bit of a nanny state makes it less palatable for me, but for anyone who hasn't been outside of Japan and hasn't really absorbed the ideals of the individual's pursuit to life, liberty, and posterity - there isn't a huge drive to leave. And guns...gotta have my guns... :) permalink award report block reply freebirdie 2 points 4 hours ago He told you exactly what he thinks of the people who put him where he is. He said it clearly and plainly. He isn't even slightly interested in helping white Americans and everything he's doing proves it. The best we can do is acknowledge we have been scammed, then try to mitigate the bleed. permalink award report block reply cyberrigger 2 points 12 hours ago excellent point permalink award report block reply possibletower -6 points 12 hours ago Fuck Gen Z. They are the most libshit generation in history and they aren't \"turning on Trump\" because they never voted for Trump. Also Gen Z wants Trump to do socialist price controls on housing and food and healthcare. Fuck Gen Z permalink award report block reply possibletower -9 points 11 hours ago Hey retard...he mentioned South Koreans to Ingraham. GFY and GTFO here back to Reddit, you libshit faggot permalink award report block reply TrumpPl4yedU 1 points 6 hours ago Comment removed upon the user being banned. permalink award report block reply\nSpunky_kitty 8 points 12 hours ago Indians are desperate to escape their country and I don't blame them, but they're like rats fleeing a sinking ship. permalink award report block reply MAG-n-KAG 3 points 6 hours ago they're shit overflowing a toilet permalink parent award report block reply\nMAG-n-KAG 3 points 6 hours ago they're shit overflowing a toilet permalink parent award report block reply\ncyberrigger 7 points 12 hours ago Isn't India's average IQ below par? permalink award report block reply sleepinggiant 2 points 6 hours ago Middle asia has a massive inbreeding problem. permalink parent award report block reply\nsleepinggiant 2 points 6 hours ago Middle asia has a massive inbreeding problem. permalink parent award report block reply\nMetal4Freedom 6 points 12 hours ago YEET THE JEET permalink award report block reply\nbooblitchutz 5 points 8 hours ago There are H1Bs from other places than India. I know a few. But like 95% of them are from India. It’s definitely a scam. permalink award report block reply\nmandarb916 3 points 10 hours ago Contrary to popular foreign belief, there isn't a huge desire by Japanese citizens to leave Japan. Life there has its flaws, but unlike Easter European countries, India, China, etc, life is pretty decent there. It being a bit of a nanny state makes it less palatable for me, but for anyone who hasn't been outside of Japan and hasn't really absorbed the ideals of the individual's pursuit to life, liberty, and posterity - there isn't a huge drive to leave. And guns...gotta have my guns... :) permalink award report block reply\nfreebirdie 2 points 4 hours ago He told you exactly what he thinks of the people who put him where he is. He said it clearly and plainly. He isn't even slightly interested in helping white Americans and everything he's doing proves it. The best we can do is acknowledge we have been scammed, then try to mitigate the bleed. permalink award report block reply\ncyberrigger 2 points 12 hours ago excellent point permalink award report block reply\npossibletower -6 points 12 hours ago Fuck Gen Z. They are the most libshit generation in history and they aren't \"turning on Trump\" because they never voted for Trump. Also Gen Z wants Trump to do socialist price controls on housing and food and healthcare. Fuck Gen Z permalink award report block reply\npossibletower -9 points 11 hours ago Hey retard...he mentioned South Koreans to Ingraham. GFY and GTFO here back to Reddit, you libshit faggot permalink award report block reply\nTrumpPl4yedU 1 points 6 hours ago Comment removed upon the user being banned. permalink award report block reply"}