{"id": "1ARK5BGK7b", "contents": "626 Tom Homan just INFURIATED Zohran Mamdani and Chicago Mayor Brandon Johnson by confirming illegal alien beds will nearly DOUBLE to 100,000 THOUSAND!  “We will FLOOD the zone [in] sanctuary cities like Chicago and New York!”\n\n“We’re gonna make New York safer — WITH or WITHOUT [Mamdani]!” posted 3 days ago by I-am-Orlando PRO 14 comments award share report block Eric Daugherty @EricLDaugh • 3d 🚨 BREAKING: Tom Homan just INFURIATED Zohran Mamdani and Chicago Mayor Brandon Johnson by confirming illegal alien beds will nearly DOUBLE to 100,000 THOUSAND! 🔥   https://t.co/zFviQ2Ypoi “100,000 beds — turn over 10 times a year? You got a MILLION [deportations]!” “We will\n14 comments Sort by Top Top New Worst Old Save PatriotSkorzeny 14 points 3 days ago Roarrr!!! Flooood the zone!!!! More beds for illegals!!! Dude. If they’re not gonna deport the illegals they should just fucking say so. Bullshitting everyone and dragging it out is lame. It’s mockery at this point. permalink award report block reply snoopy3210 5 points 3 days ago You lie lie lie... He needs beds to deport, and with 100K beds, as he said (but you didn't listen) a bed with 10 turnovers means 1 Million deported. Homan is not bullshitting. You can fuck off. permalink parent award report block reply PatriotSkorzeny 0 points 2 days ago “Needs beds to deport. 🤡 Arrest illegal - drive to border - push over border - don’t let back in. Beds. 🤡 permalink parent award report block reply snoopy3210 1 points 2 days ago Not registered, no fingerprint and he comes back again demanding asylum, you 🤡 permalink parent award report block reply TheAftermath 8 points 3 days ago Deport Mamdungi first, Tom! permalink award report block reply perma-maga 6 points 3 days ago 1/10 of whats needed permalink award report block reply rickroshi 2 points 3 days ago he's doubling it to 100k, and then he needs to double it again.=200k then double again 400k, and then double again... 800k then double again 1.6mil ok now we are starting to put a real dent in the tens of millions deportations needed. permalink parent award report block reply JoeMcCarthyWasRight 5 points 3 days ago Still playing in the minors. Not impressed at all with Trump and Homan in regards to the “LARGEST DEPORTATION OPERATION IN HISTORY” has been a flop. permalink award report block reply rickroshi 3 points 3 days ago its a ramp up process, I heard him say that he is just as disappointed, he wants them all out. Not to mention the hostile dems are making every step a pain permalink parent award report block reply YaharaRiver 4 points 3 days ago And Ma’am-damny can’t do SQUAT about it! 😂👍 Mayoral powers are generally not exercisable by a mayor-elect prior to taking the oath of office and formally assuming the role.  Very insecure times for our little lapdog puppet. permalink award report block reply BlackPilledMAGA 2 points 3 days ago Zohran the Mohran permalink award report block reply Shitsbrokeyo 2 points 3 days ago It would be a sweet irony if he commandeers the luxary hotels that put theillegals up for years. permalink award report block reply Psalm-118_24 1 points 2 days ago Flood the zone and start arresting the muslim illegals.  Most lied on their application because their \"law\" of taqiyya allows it.  MAGA permalink award report block reply FerkenBlerkin 1 points 3 days ago The U.N. can feel free to relocate these invaders to any other country but ours. permalink award report block reply\nPatriotSkorzeny 14 points 3 days ago Roarrr!!! Flooood the zone!!!! More beds for illegals!!! Dude. If they’re not gonna deport the illegals they should just fucking say so. Bullshitting everyone and dragging it out is lame. It’s mockery at this point. permalink award report block reply snoopy3210 5 points 3 days ago You lie lie lie... He needs beds to deport, and with 100K beds, as he said (but you didn't listen) a bed with 10 turnovers means 1 Million deported. Homan is not bullshitting. You can fuck off. permalink parent award report block reply PatriotSkorzeny 0 points 2 days ago “Needs beds to deport. 🤡 Arrest illegal - drive to border - push over border - don’t let back in. Beds. 🤡 permalink parent award report block reply snoopy3210 1 points 2 days ago Not registered, no fingerprint and he comes back again demanding asylum, you 🤡 permalink parent award report block reply\nsnoopy3210 5 points 3 days ago You lie lie lie... He needs beds to deport, and with 100K beds, as he said (but you didn't listen) a bed with 10 turnovers means 1 Million deported. Homan is not bullshitting. You can fuck off. permalink parent award report block reply PatriotSkorzeny 0 points 2 days ago “Needs beds to deport. 🤡 Arrest illegal - drive to border - push over border - don’t let back in. Beds. 🤡 permalink parent award report block reply snoopy3210 1 points 2 days ago Not registered, no fingerprint and he comes back again demanding asylum, you 🤡 permalink parent award report block reply\nPatriotSkorzeny 0 points 2 days ago “Needs beds to deport. 🤡 Arrest illegal - drive to border - push over border - don’t let back in. Beds. 🤡 permalink parent award report block reply snoopy3210 1 points 2 days ago Not registered, no fingerprint and he comes back again demanding asylum, you 🤡 permalink parent award report block reply\nsnoopy3210 1 points 2 days ago Not registered, no fingerprint and he comes back again demanding asylum, you 🤡 permalink parent award report block reply\nTheAftermath 8 points 3 days ago Deport Mamdungi first, Tom! permalink award report block reply\nperma-maga 6 points 3 days ago 1/10 of whats needed permalink award report block reply rickroshi 2 points 3 days ago he's doubling it to 100k, and then he needs to double it again.=200k then double again 400k, and then double again... 800k then double again 1.6mil ok now we are starting to put a real dent in the tens of millions deportations needed. permalink parent award report block reply\nrickroshi 2 points 3 days ago he's doubling it to 100k, and then he needs to double it again.=200k then double again 400k, and then double again... 800k then double again 1.6mil ok now we are starting to put a real dent in the tens of millions deportations needed. permalink parent award report block reply\nJoeMcCarthyWasRight 5 points 3 days ago Still playing in the minors. Not impressed at all with Trump and Homan in regards to the “LARGEST DEPORTATION OPERATION IN HISTORY” has been a flop. permalink award report block reply rickroshi 3 points 3 days ago its a ramp up process, I heard him say that he is just as disappointed, he wants them all out. Not to mention the hostile dems are making every step a pain permalink parent award report block reply\nrickroshi 3 points 3 days ago its a ramp up process, I heard him say that he is just as disappointed, he wants them all out. Not to mention the hostile dems are making every step a pain permalink parent award report block reply\nYaharaRiver 4 points 3 days ago And Ma’am-damny can’t do SQUAT about it! 😂👍 Mayoral powers are generally not exercisable by a mayor-elect prior to taking the oath of office and formally assuming the role.  Very insecure times for our little lapdog puppet. permalink award report block reply\nBlackPilledMAGA 2 points 3 days ago Zohran the Mohran permalink award report block reply\nShitsbrokeyo 2 points 3 days ago It would be a sweet irony if he commandeers the luxary hotels that put theillegals up for years. permalink award report block reply\nPsalm-118_24 1 points 2 days ago Flood the zone and start arresting the muslim illegals.  Most lied on their application because their \"law\" of taqiyya allows it.  MAGA permalink award report block reply\nFerkenBlerkin 1 points 3 days ago The U.N. can feel free to relocate these invaders to any other country but ours. permalink award report block reply"}