{"id": "1ARK513rMm", "contents": "311 Jumanji Left Humiliated After Making an Epic Gaffe While Trying To School U.S. Solicitor General on Tariff Authority (www.thegatewaypundit.com) posted 6 days ago by hansgruber7 36 comments award share report block Justice Ketanji Brown Jackson Left Humiliated After Making an Epic Gaffe While Trying To School U.S. Solicitor General on Tariff... Joe Biden’s DEI Supreme Court Justice Ketanji Brown Jackson made a gaffe for the ages while trying to school the Trump Administration’s solicitor general on the history of tariffs. www.thegatewaypundit.com\n36 comments Sort by Top Top New Worst Old Save Greenhills 22 points 6 days ago She doesn’t have any scruples to be humiliated. permalink award report block reply PhantomShield72 8 points 6 days ago Even if you have scruples, being stupid would also prevent you from feeling humiliation... It would appear she's doubly insulated... permalink parent award report block reply DeepStateParasite 3 points 6 days ago Exactly, she lacks the self-awareness to be humiliated - she presumably feels like she got in a solid jab by saying he was talking too fast for her to follow. permalink parent award report block reply Transparency 2 points 6 days ago a solid jab not a \"jab\", but, rather, an excuse that clearly and fully covers her ineptitude and overall incompetence. permalink parent award report block reply Transparency 2 points 6 days ago being stupid would also prevent you from feeling humiliation... Yup, 👍: https://i0.wp.com/politicallyincorrecthumor.com/wp-content/uploads/2018/10/sam-elliot-when-youre-dead-you-dont-know-it-pain-is-felt-by-others-same-thing-when-you-are-stupid.jpg?resize=500%2C494&ssl=1 permalink parent award report block reply roadrunner0 14 points 6 days ago We are in and out of an Idiocracy so idiots like this are to be expected.. Imagine having 7 to 9 of these on the Supreme court, they could drag us to the lowest common denominator in a very short time.. permalink award report block reply hansgruber7 OP 10 points 6 days ago Once they get a majority on the Supreme Court the Republic is dead.  Just look at what the Communist Supreme Court in Brazil is doing to destroy them. permalink parent award report block reply indigo_truther 2 points 6 days ago Pretty sure it's accelerating Canada's decline as well permalink parent award report block reply Krat 9 points 6 days ago Imagine a country willingly allowing itself to get enslaved by hostile foreigners permalink parent award report block reply hansgruber7 OP 3 points 6 days ago The entire West is willingly committing cultural suicide.  Sad. permalink parent award report block reply Transparency 2 points 6 days ago Imagine a country willingly allowing itself to get enslaved by hostile foreigners Rome invited their conquers in. Gave them citizenship. Allowed them to join the military. permalink parent award report block reply Made_in_America 5 points 6 days ago \"This court does hold that the Constitutional right to twerk shall be upheld consistent with the inalienable God-given right to keepin' it reallllll!\" [WAP starts playing} permalink parent award report block reply empiretc 12 points 6 days ago Autopen DEI hire needs to go!! permalink award report block reply basedboston 8 points 6 days ago KBJ is the gift that keeps on giving... we have 20 more years of this dipshit reminding us how retarded DEI was... permalink award report block reply CleanUpPhillyTrump24 3 points 6 days ago Respectfully BB, Ms. Autopen's days are numbered. Take that to the bank. permalink parent award report block reply hansgruber7 OP 5 points 6 days ago I wish I believed that were true. permalink parent award report block reply DeepStateParasite 2 points 6 days ago Is, not was. They haven't stopped, just slowed down until they get more of their CIA / Communists in place. permalink parent award report block reply CommieCucker 7 points 6 days ago Just LOOK at her! permalink award report block reply CleanUpPhillyTrump24 5 points 6 days ago She looks like the porch light is on and no one is home. permalink parent award report block reply Trooph-Hurts 7 points 6 days ago Look, she doesn’t even know what a woman is!…. How you can still be sworn in to that position and saying that something that incredibly retarded…. Our senators are idiots permalink award report block reply hansgruber7 OP 5 points 6 days ago The real problem is the millions of retarded voters who keep re-electing these senators. permalink parent award report block reply Trooph-Hurts 7 points 6 days ago Don’t completely blame the voters…… they rig who makes it through the primary system! permalink parent award report block reply hansgruber7 OP 3 points 6 days ago That's true.  But millions of voters are still retarded to make the rigging possible. permalink parent award report block reply Trooph-Hurts 2 points 6 days ago For sure, we have the stupid voting! permalink parent award report block reply CleanUpPhillyTrump24 2 points 6 days ago IMHO the true margin of actual blue or status quo voters is very small. That's the reason for this massive foreign funded cheat. That's the reason we \"fund Ukraine\" so the uniparty can continue to buy off and rig the election process - judges, poll workers, everyone. permalink parent award report block reply view 1 more comments... CleanUpPhillyTrump24 1 points 6 days ago You know it is fraud though right? RINOs too not just Dems. They're installed. permalink parent award report block reply hansgruber7 OP 1 points 6 days ago Of course there is fraud, but the fraud is responsible for at most a 5-10 percent margin.  The rest of the 40 percent of the vote they need are real genuine retards. permalink parent award report block reply CleanUpPhillyTrump24 4 points 6 days ago Good Lord, it's embarrassing. Jumanji was auto penned. Time to press this issue. That's going to be under the rubric of the DOJ to do. Trump cannot do it all. permalink award report block reply labajada 4 points 6 days ago Someone's talking in her ear and they were only prepared for a Lincoln cite, she had to wait for them to quickly look up Nixon tariffs permalink award report block reply the-new-style 3 points 6 days ago talking fast and understanding fast talkers is correlated with IQ just sayin' permalink award report block reply charlesthehammer 2 points 6 days ago I’m shocked. permalink award report block reply barwhack 2 points 6 days ago I don't think giraffes hit the same, with Jumanjis... permalink award report block reply SemperFidelis231 2 points 6 days ago She's far too stupid to feel any shame. permalink award report block reply JoeCubicle 2 points 6 days ago SHE DUM! permalink award report block reply booblitchutz 2 points 6 days ago I think the business interests are going to win here. There's too much money on the line for these mega corporations that rely on globalism and imbalanced trade. I'm afraid we're about to get handed a big L. permalink award report block reply\nGreenhills 22 points 6 days ago She doesn’t have any scruples to be humiliated. permalink award report block reply PhantomShield72 8 points 6 days ago Even if you have scruples, being stupid would also prevent you from feeling humiliation... It would appear she's doubly insulated... permalink parent award report block reply DeepStateParasite 3 points 6 days ago Exactly, she lacks the self-awareness to be humiliated - she presumably feels like she got in a solid jab by saying he was talking too fast for her to follow. permalink parent award report block reply Transparency 2 points 6 days ago a solid jab not a \"jab\", but, rather, an excuse that clearly and fully covers her ineptitude and overall incompetence. permalink parent award report block reply Transparency 2 points 6 days ago being stupid would also prevent you from feeling humiliation... Yup, 👍: https://i0.wp.com/politicallyincorrecthumor.com/wp-content/uploads/2018/10/sam-elliot-when-youre-dead-you-dont-know-it-pain-is-felt-by-others-same-thing-when-you-are-stupid.jpg?resize=500%2C494&ssl=1 permalink parent award report block reply\nPhantomShield72 8 points 6 days ago Even if you have scruples, being stupid would also prevent you from feeling humiliation... It would appear she's doubly insulated... permalink parent award report block reply DeepStateParasite 3 points 6 days ago Exactly, she lacks the self-awareness to be humiliated - she presumably feels like she got in a solid jab by saying he was talking too fast for her to follow. permalink parent award report block reply Transparency 2 points 6 days ago a solid jab not a \"jab\", but, rather, an excuse that clearly and fully covers her ineptitude and overall incompetence. permalink parent award report block reply Transparency 2 points 6 days ago being stupid would also prevent you from feeling humiliation... Yup, 👍: https://i0.wp.com/politicallyincorrecthumor.com/wp-content/uploads/2018/10/sam-elliot-when-youre-dead-you-dont-know-it-pain-is-felt-by-others-same-thing-when-you-are-stupid.jpg?resize=500%2C494&ssl=1 permalink parent award report block reply\nDeepStateParasite 3 points 6 days ago Exactly, she lacks the self-awareness to be humiliated - she presumably feels like she got in a solid jab by saying he was talking too fast for her to follow. permalink parent award report block reply Transparency 2 points 6 days ago a solid jab not a \"jab\", but, rather, an excuse that clearly and fully covers her ineptitude and overall incompetence. permalink parent award report block reply\nTransparency 2 points 6 days ago a solid jab not a \"jab\", but, rather, an excuse that clearly and fully covers her ineptitude and overall incompetence. permalink parent award report block reply\nTransparency 2 points 6 days ago being stupid would also prevent you from feeling humiliation... Yup, 👍: https://i0.wp.com/politicallyincorrecthumor.com/wp-content/uploads/2018/10/sam-elliot-when-youre-dead-you-dont-know-it-pain-is-felt-by-others-same-thing-when-you-are-stupid.jpg?resize=500%2C494&ssl=1 permalink parent award report block reply\nroadrunner0 14 points 6 days ago We are in and out of an Idiocracy so idiots like this are to be expected.. Imagine having 7 to 9 of these on the Supreme court, they could drag us to the lowest common denominator in a very short time.. permalink award report block reply hansgruber7 OP 10 points 6 days ago Once they get a majority on the Supreme Court the Republic is dead.  Just look at what the Communist Supreme Court in Brazil is doing to destroy them. permalink parent award report block reply indigo_truther 2 points 6 days ago Pretty sure it's accelerating Canada's decline as well permalink parent award report block reply Krat 9 points 6 days ago Imagine a country willingly allowing itself to get enslaved by hostile foreigners permalink parent award report block reply hansgruber7 OP 3 points 6 days ago The entire West is willingly committing cultural suicide.  Sad. permalink parent award report block reply Transparency 2 points 6 days ago Imagine a country willingly allowing itself to get enslaved by hostile foreigners Rome invited their conquers in. Gave them citizenship. Allowed them to join the military. permalink parent award report block reply Made_in_America 5 points 6 days ago \"This court does hold that the Constitutional right to twerk shall be upheld consistent with the inalienable God-given right to keepin' it reallllll!\" [WAP starts playing} permalink parent award report block reply\nhansgruber7 OP 10 points 6 days ago Once they get a majority on the Supreme Court the Republic is dead.  Just look at what the Communist Supreme Court in Brazil is doing to destroy them. permalink parent award report block reply indigo_truther 2 points 6 days ago Pretty sure it's accelerating Canada's decline as well permalink parent award report block reply\nindigo_truther 2 points 6 days ago Pretty sure it's accelerating Canada's decline as well permalink parent award report block reply\nKrat 9 points 6 days ago Imagine a country willingly allowing itself to get enslaved by hostile foreigners permalink parent award report block reply hansgruber7 OP 3 points 6 days ago The entire West is willingly committing cultural suicide.  Sad. permalink parent award report block reply Transparency 2 points 6 days ago Imagine a country willingly allowing itself to get enslaved by hostile foreigners Rome invited their conquers in. Gave them citizenship. Allowed them to join the military. permalink parent award report block reply\nhansgruber7 OP 3 points 6 days ago The entire West is willingly committing cultural suicide.  Sad. permalink parent award report block reply\nTransparency 2 points 6 days ago Imagine a country willingly allowing itself to get enslaved by hostile foreigners Rome invited their conquers in. Gave them citizenship. Allowed them to join the military. permalink parent award report block reply\nMade_in_America 5 points 6 days ago \"This court does hold that the Constitutional right to twerk shall be upheld consistent with the inalienable God-given right to keepin' it reallllll!\" [WAP starts playing} permalink parent award report block reply\nempiretc 12 points 6 days ago Autopen DEI hire needs to go!! permalink award report block reply\nbasedboston 8 points 6 days ago KBJ is the gift that keeps on giving... we have 20 more years of this dipshit reminding us how retarded DEI was... permalink award report block reply CleanUpPhillyTrump24 3 points 6 days ago Respectfully BB, Ms. Autopen's days are numbered. Take that to the bank. permalink parent award report block reply hansgruber7 OP 5 points 6 days ago I wish I believed that were true. permalink parent award report block reply DeepStateParasite 2 points 6 days ago Is, not was. They haven't stopped, just slowed down until they get more of their CIA / Communists in place. permalink parent award report block reply\nCleanUpPhillyTrump24 3 points 6 days ago Respectfully BB, Ms. Autopen's days are numbered. Take that to the bank. permalink parent award report block reply hansgruber7 OP 5 points 6 days ago I wish I believed that were true. permalink parent award report block reply\nhansgruber7 OP 5 points 6 days ago I wish I believed that were true. permalink parent award report block reply\nDeepStateParasite 2 points 6 days ago Is, not was. They haven't stopped, just slowed down until they get more of their CIA / Communists in place. permalink parent award report block reply\nCommieCucker 7 points 6 days ago Just LOOK at her! permalink award report block reply CleanUpPhillyTrump24 5 points 6 days ago She looks like the porch light is on and no one is home. permalink parent award report block reply\nCleanUpPhillyTrump24 5 points 6 days ago She looks like the porch light is on and no one is home. permalink parent award report block reply\nTrooph-Hurts 7 points 6 days ago Look, she doesn’t even know what a woman is!…. How you can still be sworn in to that position and saying that something that incredibly retarded…. Our senators are idiots permalink award report block reply hansgruber7 OP 5 points 6 days ago The real problem is the millions of retarded voters who keep re-electing these senators. permalink parent award report block reply Trooph-Hurts 7 points 6 days ago Don’t completely blame the voters…… they rig who makes it through the primary system! permalink parent award report block reply hansgruber7 OP 3 points 6 days ago That's true.  But millions of voters are still retarded to make the rigging possible. permalink parent award report block reply Trooph-Hurts 2 points 6 days ago For sure, we have the stupid voting! permalink parent award report block reply CleanUpPhillyTrump24 2 points 6 days ago IMHO the true margin of actual blue or status quo voters is very small. That's the reason for this massive foreign funded cheat. That's the reason we \"fund Ukraine\" so the uniparty can continue to buy off and rig the election process - judges, poll workers, everyone. permalink parent award report block reply view 1 more comments... CleanUpPhillyTrump24 1 points 6 days ago You know it is fraud though right? RINOs too not just Dems. They're installed. permalink parent award report block reply hansgruber7 OP 1 points 6 days ago Of course there is fraud, but the fraud is responsible for at most a 5-10 percent margin.  The rest of the 40 percent of the vote they need are real genuine retards. permalink parent award report block reply\nhansgruber7 OP 5 points 6 days ago The real problem is the millions of retarded voters who keep re-electing these senators. permalink parent award report block reply Trooph-Hurts 7 points 6 days ago Don’t completely blame the voters…… they rig who makes it through the primary system! permalink parent award report block reply hansgruber7 OP 3 points 6 days ago That's true.  But millions of voters are still retarded to make the rigging possible. permalink parent award report block reply Trooph-Hurts 2 points 6 days ago For sure, we have the stupid voting! permalink parent award report block reply CleanUpPhillyTrump24 2 points 6 days ago IMHO the true margin of actual blue or status quo voters is very small. That's the reason for this massive foreign funded cheat. That's the reason we \"fund Ukraine\" so the uniparty can continue to buy off and rig the election process - judges, poll workers, everyone. permalink parent award report block reply view 1 more comments... CleanUpPhillyTrump24 1 points 6 days ago You know it is fraud though right? RINOs too not just Dems. They're installed. permalink parent award report block reply hansgruber7 OP 1 points 6 days ago Of course there is fraud, but the fraud is responsible for at most a 5-10 percent margin.  The rest of the 40 percent of the vote they need are real genuine retards. permalink parent award report block reply\nTrooph-Hurts 7 points 6 days ago Don’t completely blame the voters…… they rig who makes it through the primary system! permalink parent award report block reply hansgruber7 OP 3 points 6 days ago That's true.  But millions of voters are still retarded to make the rigging possible. permalink parent award report block reply Trooph-Hurts 2 points 6 days ago For sure, we have the stupid voting! permalink parent award report block reply CleanUpPhillyTrump24 2 points 6 days ago IMHO the true margin of actual blue or status quo voters is very small. That's the reason for this massive foreign funded cheat. That's the reason we \"fund Ukraine\" so the uniparty can continue to buy off and rig the election process - judges, poll workers, everyone. permalink parent award report block reply view 1 more comments...\nhansgruber7 OP 3 points 6 days ago That's true.  But millions of voters are still retarded to make the rigging possible. permalink parent award report block reply Trooph-Hurts 2 points 6 days ago For sure, we have the stupid voting! permalink parent award report block reply CleanUpPhillyTrump24 2 points 6 days ago IMHO the true margin of actual blue or status quo voters is very small. That's the reason for this massive foreign funded cheat. That's the reason we \"fund Ukraine\" so the uniparty can continue to buy off and rig the election process - judges, poll workers, everyone. permalink parent award report block reply view 1 more comments...\nTrooph-Hurts 2 points 6 days ago For sure, we have the stupid voting! permalink parent award report block reply\nCleanUpPhillyTrump24 2 points 6 days ago IMHO the true margin of actual blue or status quo voters is very small. That's the reason for this massive foreign funded cheat. That's the reason we \"fund Ukraine\" so the uniparty can continue to buy off and rig the election process - judges, poll workers, everyone. permalink parent award report block reply view 1 more comments...\nCleanUpPhillyTrump24 1 points 6 days ago You know it is fraud though right? RINOs too not just Dems. They're installed. permalink parent award report block reply hansgruber7 OP 1 points 6 days ago Of course there is fraud, but the fraud is responsible for at most a 5-10 percent margin.  The rest of the 40 percent of the vote they need are real genuine retards. permalink parent award report block reply\nhansgruber7 OP 1 points 6 days ago Of course there is fraud, but the fraud is responsible for at most a 5-10 percent margin.  The rest of the 40 percent of the vote they need are real genuine retards. permalink parent award report block reply\nCleanUpPhillyTrump24 4 points 6 days ago Good Lord, it's embarrassing. Jumanji was auto penned. Time to press this issue. That's going to be under the rubric of the DOJ to do. Trump cannot do it all. permalink award report block reply\nlabajada 4 points 6 days ago Someone's talking in her ear and they were only prepared for a Lincoln cite, she had to wait for them to quickly look up Nixon tariffs permalink award report block reply\nthe-new-style 3 points 6 days ago talking fast and understanding fast talkers is correlated with IQ just sayin' permalink award report block reply\ncharlesthehammer 2 points 6 days ago I’m shocked. permalink award report block reply\nbarwhack 2 points 6 days ago I don't think giraffes hit the same, with Jumanjis... permalink award report block reply\nSemperFidelis231 2 points 6 days ago She's far too stupid to feel any shame. permalink award report block reply\nJoeCubicle 2 points 6 days ago SHE DUM! permalink award report block reply\nbooblitchutz 2 points 6 days ago I think the business interests are going to win here. There's too much money on the line for these mega corporations that rely on globalism and imbalanced trade. I'm afraid we're about to get handed a big L. permalink award report block reply"}