{"id": "1ARK9nOoJZ", "contents": "14 Democrats trying to incriminate GEOTUS by releasing alleged Epstein e-mails (www.nytimes.com) 🌶️ 🌶️ SPICY 🌶️ 🌶️ posted 7 hours ago by _TRUMP_OR_BUST_ 5 comments award share report block Jeffrey Epstein Alleged in Emails That Trump Knew of His Conduct In a message obtained by Congress, the convicted sex offender Jeffrey Epstein wrote that Donald J. Trump spent hours at his house with one of Mr. Epstein’s victims. www.nytimes.com\n5 comments Sort by Top Top New Worst Old Save Grindelwald 5 points 7 hours ago More deep state coordinated attacks.  All BS. permalink award report block reply _TRUMP_OR_BUST_ OP 2 points 7 hours ago President Trump should sue them for libel and let the truth come out. permalink parent award report block reply Suck_My_Dick 3 points 7 hours ago What happened to Trump wanting to release the files? permalink parent award report block reply Grindelwald 2 points 7 hours ago Yes, he could do the West Wing with the proceeds. permalink parent award report block reply MeMargie 1 points 6 hours ago Send Congress the message 2004 Kenyan born all set to take the Illinois State Senate. permalink award report block reply\nGrindelwald 5 points 7 hours ago More deep state coordinated attacks.  All BS. permalink award report block reply _TRUMP_OR_BUST_ OP 2 points 7 hours ago President Trump should sue them for libel and let the truth come out. permalink parent award report block reply Suck_My_Dick 3 points 7 hours ago What happened to Trump wanting to release the files? permalink parent award report block reply Grindelwald 2 points 7 hours ago Yes, he could do the West Wing with the proceeds. permalink parent award report block reply\n_TRUMP_OR_BUST_ OP 2 points 7 hours ago President Trump should sue them for libel and let the truth come out. permalink parent award report block reply Suck_My_Dick 3 points 7 hours ago What happened to Trump wanting to release the files? permalink parent award report block reply Grindelwald 2 points 7 hours ago Yes, he could do the West Wing with the proceeds. permalink parent award report block reply\nSuck_My_Dick 3 points 7 hours ago What happened to Trump wanting to release the files? permalink parent award report block reply\nGrindelwald 2 points 7 hours ago Yes, he could do the West Wing with the proceeds. permalink parent award report block reply\nMeMargie 1 points 6 hours ago Send Congress the message 2004 Kenyan born all set to take the Illinois State Senate. permalink award report block reply"}