{"id": "1ARK9pgQAW", "contents": "28 ROGER STONE: Fascinating! Over 1700 mentions of Steve Bannon in Jeffrey Epstein's emails released today including many emails between Steve and his pedophile friend Jeffrey! posted 2 hours ago by Sunnybats2 8 comments award share download report block\n8 comments Sort by Top Top New Worst Old Save Around the Web RejectoftheRepublic 7 points 2 hours ago Wait, does Roger Stone not like Steve Bannon? I figured they'd be friends permalink award report block reply Sunnybats2 OP 1 points 2 hours ago Bannon perjured to get Roger convicted by Mueller permalink parent award report block reply Aggrieved03 5 points 2 hours ago From the emails I saw they looked about as authentic as the ones between Charlie Kirk’s murderer and the tranny. permalink award report block reply DenturesNancy 4 points 2 hours ago stop the damn infighting and focus on the enemy you damn bastards.  the emails are fake, they seem to have the same author as Charlie Kirk's killer messages with his boyfriend permalink award report block reply Sunnybats2 OP -2 points 1 hour ago Ok tard permalink parent award report block reply Logan051361 3 points 2 hours ago And this why they didnt want to release these. People will be accused of being a Pedo for association even if they never did anything except know him or go to parties. permalink award report block reply Sunnybats2 OP -2 points 2 hours ago Bannon was his PR guy permalink parent award report block reply\nRejectoftheRepublic 7 points 2 hours ago Wait, does Roger Stone not like Steve Bannon? I figured they'd be friends permalink award report block reply Sunnybats2 OP 1 points 2 hours ago Bannon perjured to get Roger convicted by Mueller permalink parent award report block reply\nSunnybats2 OP 1 points 2 hours ago Bannon perjured to get Roger convicted by Mueller permalink parent award report block reply\nAggrieved03 5 points 2 hours ago From the emails I saw they looked about as authentic as the ones between Charlie Kirk’s murderer and the tranny. permalink award report block reply\nDenturesNancy 4 points 2 hours ago stop the damn infighting and focus on the enemy you damn bastards.  the emails are fake, they seem to have the same author as Charlie Kirk's killer messages with his boyfriend permalink award report block reply Sunnybats2 OP -2 points 1 hour ago Ok tard permalink parent award report block reply\nSunnybats2 OP -2 points 1 hour ago Ok tard permalink parent award report block reply\nLogan051361 3 points 2 hours ago And this why they didnt want to release these. People will be accused of being a Pedo for association even if they never did anything except know him or go to parties. permalink award report block reply Sunnybats2 OP -2 points 2 hours ago Bannon was his PR guy permalink parent award report block reply\nSunnybats2 OP -2 points 2 hours ago Bannon was his PR guy permalink parent award report block reply"}