{"id": "1ARK9pfKN8", "contents": "86 I was in Best Buy last week in Chandler, AZ. Look at the options it gives when time to pay? And you don’t think we have a problem? Think again. I took this photo. posted 9 hours ago by PiratePatriotParrot 10 comments award share report block Maggs @aspen_lindsay • 18h I was in Best Buy last week in Chandler, AZ. Look at the options it gives when time to pay? And you don’t think we have a problem? Think again. I took this photo.\n10 comments Sort by Top Top New Worst Old Save TonyTreehouse 7 points 8 hours ago I think that would only come up if you used an Indian credit card or atm card. I think that would be for any international card, but would show a different currency.  I sometimes get this in other countries if I use my credit card.  Though usually it just charges the local currency and doesn't give the option. permalink award report block reply dres3 4 points 8 hours ago Going by comment thread.  Credit card was registered in India and this pops up whenever credit card is used internally. Like if you tried to use American Express in China.  Again going by thread comments. permalink award report block reply The_Bloofy_Bullshark 3 points 8 hours ago It’s Chandler AZ. Doesn’t surprise me one bit. That place is overrun with jeets. Chandler Intel campus (and the new Fab 52) is there. permalink award report block reply TwoArizonaPedes 3 points 9 hours ago Wtf? permalink award report block reply guywholikesDjtof2024 3 points 9 hours ago grrrrr you must be bigot for wanting your own country to yourself, and not wanting it invaded by who knows who. permalink award report block reply patrioticwinning3 2 points 8 hours ago END ALL IMPORTATION OF CHEAP LABOR NOW! permalink award report block reply Califunya 2 points 9 hours ago PAY IN PENNIES WHILE YOU CAN permalink award report block reply Atruckdriver 1 points 6 hours ago Are you using a credit card issued in India? Wait, are you an H1B!? permalink award report block reply walls4america 1 points 8 hours ago Does the Best Buy home appliance section also sell toilet paper?  If so, I bet a TP purchase would make the system remove the Indian payment choice. permalink award report block reply SoL-Chi 1 points 8 hours ago No way this is real permalink award report block reply\nTonyTreehouse 7 points 8 hours ago I think that would only come up if you used an Indian credit card or atm card. I think that would be for any international card, but would show a different currency.  I sometimes get this in other countries if I use my credit card.  Though usually it just charges the local currency and doesn't give the option. permalink award report block reply\ndres3 4 points 8 hours ago Going by comment thread.  Credit card was registered in India and this pops up whenever credit card is used internally. Like if you tried to use American Express in China.  Again going by thread comments. permalink award report block reply\nThe_Bloofy_Bullshark 3 points 8 hours ago It’s Chandler AZ. Doesn’t surprise me one bit. That place is overrun with jeets. Chandler Intel campus (and the new Fab 52) is there. permalink award report block reply\nTwoArizonaPedes 3 points 9 hours ago Wtf? permalink award report block reply\nguywholikesDjtof2024 3 points 9 hours ago grrrrr you must be bigot for wanting your own country to yourself, and not wanting it invaded by who knows who. permalink award report block reply\npatrioticwinning3 2 points 8 hours ago END ALL IMPORTATION OF CHEAP LABOR NOW! permalink award report block reply\nCalifunya 2 points 9 hours ago PAY IN PENNIES WHILE YOU CAN permalink award report block reply\nAtruckdriver 1 points 6 hours ago Are you using a credit card issued in India? Wait, are you an H1B!? permalink award report block reply\nwalls4america 1 points 8 hours ago Does the Best Buy home appliance section also sell toilet paper?  If so, I bet a TP purchase would make the system remove the Indian payment choice. permalink award report block reply\nSoL-Chi 1 points 8 hours ago No way this is real permalink award report block reply"}