{"id": "1ARK5A8ThP", "contents": "1490 How do you steal $38,000,000,000,000 and still claim you have no money? posted 3 days ago by Crucible 81 comments award share download report block\n81 comments Sort by Top Top New Worst Old Save Appeal2Heaven98 54 points 3 days ago I wonder if we'll even have a country in a decade. We're already past the point of no return, and no one seems bothered to give a shit and stop the spending. permalink award report block reply Crucible OP 39 points 3 days ago I get called a \"Doomer\" and \"Trump Hater\" by the normies for pointing out the obvious. permalink parent award report block reply RomanCatholicPatriot 22 points 3 days ago 100% permalink parent award report block reply 123breadman 2 points 3 days ago That's because every week it's something new crying wolf. The world is always ending \"soon.\" Has been going on for a while. Epic Economist, Canadian Prepper, Mason Mannerino, Steve Quayle. Always happens. \"The world is ending soon, buy my book and dvd for $60 to learn how it could end\" \"Sell your house now (2016) and rent an apartment before your home value collapses.\" permalink parent award report block reply Klaus73 1 points 3 days ago I got tired of Canadian Prepper telling me to go buy gold... permalink parent award report block reply 123breadman 0 points 2 days ago As usual conservatives complaining about global birth rates, but have anxiety that the world is ending so they can't have kids. Make it make sense. Brb, turns out it's just an old man telling us to do this lol permalink parent award report block reply view 1 more comments... corporateshizer 30 points 3 days ago Same. We either deport 50 - 100 million foreigners  in the next decade or we don't have a country. permalink parent award report block reply Aggrieved03 14 points 3 days ago Not one politician is talking about this. permalink parent award report block reply Weepingwillowwidow 10 points 3 days ago Why would they talk about their failure to protect the citizens from the enemy within? We are pawns in a large game, adapt and overcome. permalink parent award report block reply justicein2020 3 points 3 days ago Because they are mostly (dual citizens). And this isn't their fav country. permalink parent award report block reply RhodesianRidgeback 15 points 3 days ago I'm moving to Costa Rica or El Salvador. If I'm going to be forced to live around a bunch of third world shitskins, at least I wont have the shit taxed out of me and my cost of living will be cut in half. permalink parent award report block reply EmptyNoose 10 points 3 days ago You are so correct when you say no one gives a shit. We have accumulated TWO TRILLION dollars worth of debt in less than a year and pay over a trillion a year just to service the overall debt. When I bring it up to anyone saying it's completely unsustainable people look at me as if it's a silly thing to worry about. I hope we aren't past the point of no return but you may be right. I've been putting myself into low interest debt because fuck it why not best thing to have during a high inflation economy. permalink parent award report block reply mikejones 2 points 3 days ago The thing is no one has been around to experience what we are experiencing. We are going to be 50 trillion dollars in debt before anything gets going. And most families will be quickly in debt if someone loses their job. The bigger the bubble. the harder the crash. permalink parent award report block reply ninabobby 9 points 3 days ago You can’t maintain something like America unless the people are educated and believe in God. And we failed to stop the commies from taking over the schools, so that’s how we lost it. permalink parent award report block reply load 7 more comments... deleted 23 points 3 days ago HockeyMom4Trump 21 points 3 days ago Why only 50 years? Why not make it 75!!!! Yay! Maybe even 100 year mortgages! permalink parent award report block reply Hanging_Chad 7 points 3 days ago 25-year-olds can pay until they’re 75. no 100-year-old wants to still be paying for their first house permalink parent award report block reply Klaus73 3 points 3 days ago The beauty is that the lender will put that asset on the books and then horse trade it back and forth essentially x10 its value. permalink parent award report block reply DeportThemAllForever -1 points 3 days ago To increase real estate prices.  Part of the “you’ll own nothing…” permalink parent award report block reply RomanCatholicPatriot 1 points 3 days ago Fuck off, cockbite. permalink parent award report block reply Crucible OP 11 points 3 days ago May need to take out 3 of them: One for the home. One for a car. One to go grocery shopping. permalink parent award report block reply DeportThemAllForever 1 points 3 days ago Fucking government always does bullshit that increases asset inflation and cost of everything for benefit of few corporations at expense to entire nation. This shit needs to be reverted, all of it.  Oh and healthcare already comes with massive loans.  Wanna live? Sign away right here on the dotted line. permalink parent award report block reply Hanging_Chad 4 points 3 days ago just identify as an illegal permalink parent award report block reply BlackPilledMAGA -2 points 3 days ago Right, I say cut all Fannie/Freddie backed mortgages to 15 year max... watch those home prices come a tumblin' down! That's the way we should be going. If they made it harder to get loans and made the terms shorter then it would be more beneficial to the younger generation of new buyers because it would slice home prices substantially as sellers can only ask for what buyers can afford to pay and the majority of buyers shop and buy based on what they can afford monthly. Yeah equity would be lost by a fuckton of people but oh well at least their kids and grandkids wouldn't be living with them permanently. permalink parent award report block reply DeportThemAllForever -3 points 3 days ago Much agreed, 30 year mortgages is crony capitalism. permalink parent award report block reply RuprechtThaMonkeyBoy 3 points 3 days ago I’ve never kept my original mortgage. I sold my starter home after 12 years (refinanced once) and it’s been 13 years in the current one. You’re not committed to that full mortgage timeframe, it’s not a sentence. Only in rare circumstances should someone target their first home as their last home. Sometimes it works out, but most of the time you learn what you like/don’t like in the first home. If you’ve lived under your means and saved you’ll have the option of renting the first one out when you buy your 2nd and the proceeds from that will help to pay it off early. permalink parent award report block reply daty_dato 2 points 3 days ago and they don't understand inflation. If you can get a 50 year fixed rate at 3% that's a deal of a life time. Inflation will make you payments nothing in 10-20 years. permalink parent award report block reply chickeninoven 1 points 3 days ago Assuming your wages keep up with or beat inflation. Have yours? Mine haven't. permalink parent award report block reply daty_dato 1 points 3 days ago Yes. but I don't have a situation like most.  The farther we get from Covid it'll work out.  The simple money devaluation will make that mortgage better then a 30 year. Top of my head 10% better. You can always pay it faster or invest with historically better returns. It all depends on the interest rate. And you have a home now. If that's the main driver. We need other reforms that would be better but just as unlikely.. permalink parent award report block reply Aggrieved03 2 points 3 days ago People are financing a trip to McDonald's. permalink parent award report block reply DT170x -3 points 3 days ago Must be the Current Thing that the derailers are saying. Mortgages is now [Current Thing] for the NPC'S on this site. I noticed that NPC'S will pick a [Current Topic] and plastered it on every topics in hopes to derail it to death. permalink parent award report block reply load 1 more comments... corporateshizer 18 points 3 days ago The Fed's $38 trillion debt is on top of the taxes everyone paid. They stole them both. Our federal government spent $192 trillion (in today's value) in the last 50 years, and look at the state of the country: crumbling infrastructure and 80-IQ foreign retards everywhere. Thanks, Boomers! permalink award report block reply mikejones 1 points 3 days ago The best thing to do is point out the current problem. And that is Trump taking on 37 trillion of debt. He knows what's up and is trying to loot the countries we made rich to pay off our debt. Meanwhile instead of fixing old stuff, we are building new stuff by knocking down trees so reach people can get away from the problem areas. permalink parent award report block reply BigMikesSwingingCock 1 points 3 days ago Our interstates are a complete disaster; a state of disrepair. Everywhere you drive, there's more potholes than you can shake a stick at, so it's not just on a federal level, it's also state and county. Public transportation is a clown show, it's basically a lawless zoo. Not to mention that any projects that receive funding end up having all the funds embezzled, and projects scrapped. The power grids are a joke. One day of snow, or heavy rain, and you've got brownouts and blackouts. permalink parent award report block reply duznmatter -3 points 3 days ago Get off your ass and fix it then shitskin. You wouldn't even be on the internet playing video games in your Mom's basement today if it wasn't for boomers. permalink parent award report block reply SavingPrivateGrace 13 points 3 days ago Our country was sold out and stolen from us because we don't have term limits for the crooks. permalink award report block reply Crucible OP 9 points 3 days ago 1913 permalink parent award report block reply corporateshizer 1 points 3 days ago Comment removed by community filter, pending further review. permalink parent award report block reply learntocode 12 points 3 days ago Thw idea that we have an annual budget is asinine. We should NOT be borrowing our currency from a private bank cartel. We should be SELLING the right to lend to banks. So straightforward. No lame moralizing needed. permalink award report block reply RhodesianRidgeback 8 points 3 days ago \"If the government were placed in charge of the Sahara Desert, in four years there would be a shortage of sand.\" - Milton Friedman permalink award report block reply HockeyMom4Trump 8 points 3 days ago It’s like having a drug addicted gambler in the family-never enough money and they will take take take and steal steal steal! permalink award report block reply FKH2 6 points 3 days ago If what you mean by \"Fail to properly manage it\" is launder it through government contracts, foreign aid and NGO's and have it kicked back to them through campaign contributions and book deals than yes permalink award report block reply Crucible OP 5 points 3 days ago \"Abscond with\".... permalink parent award report block reply BigBadMagaMan 5 points 3 days ago It’s easy when 70% of that fucking money is being spent on shit outside of our country. permalink award report block reply RedStoneDeepState -5 points 3 days ago What the fuck are you talking about? permalink parent award report block reply BigBadMagaMan 4 points 3 days ago Government spends money on foreign affairs. What the fuck are you talking about, Rothstein? permalink parent award report block reply RedStoneDeepState -4 points 3 days ago Government spends money on foreign affairs. How does an amount of spending equal 70% of total spending? permalink parent award report block reply BigBadMagaMan 3 points 3 days ago GO LOOK AT OVERSEAS AND FOREIGN US GOVT SPENDING DUMBFUCK. permalink parent award report block reply view 5 more comments... Easzq8 3 points 3 days ago They have guns so they don’t need to be competitive. permalink award report block reply knnbccb 3 points 3 days ago A small and limited government is your only guarantee of liberty, prosperity and security. If it is neither small nor limited, the opposite outcomes happen. permalink award report block reply rightoverthere 2 points 2 days ago how can anyone claim usa is the wealthiest country in the world with that amount of debt. permalink award report block reply greatpumpkin 2 points 3 days ago (D)s never saw a bag of gold they didn't immediately figure out how to piss away. permalink award report block reply NHMS_observer 2 points 3 days ago So many traitors.  So many unconstitutional actions taken.  So much iniquity abounds.  So much anti-American behavior emanates from our very own Capital.  All is being revealed now in the reality of the apocalypse. permalink award report block reply cornpop_1988 1 points 3 days ago End foreign aid for good. Welfare is a huge problem in this country so put an end to that too. However, that won't happen because of Democrats. permalink award report block reply GuessWhoItIs 1 points 3 days ago It’s not a failure. It’s a success and everything is going to plan. Their plan, not ours. permalink award report block reply Stolen 1 points 3 days ago Accelerated success $5.7 Trillion in the year 2000 to $38 trillion by 2025. Caused by 9-11 cabal, 2008 financial crash,  and the 2020 Plandemic. permalink parent award report block reply moscowjade 1 points 3 days ago And all the money they spend goes to destroying us. permalink award report block reply CatsGoWoof 1 points 3 days ago Just like wikipedia. Fuck those website owners. permalink award report block reply JimQPublic 1 points 3 days ago Easy.  They spent it before they stole it. permalink award report block reply MarshallB 1 points 3 days ago It is Congressionally Approved borrowing. It isn't wise, but it's why the shutdown prevents funding SNAP. There is no money to spend or borrow until authorized. What is being spent has already been authorized or gifted to them. permalink award report block reply Harvestsmiles 1 points 3 days ago Politicians are similar to some of those Section 8 videos going around recently. permalink award report block reply Auserr 1 points 3 days ago Both sides are playing us. permalink award report block reply Megaboom2025 1 points 3 days ago By gunpoint permalink award report block reply ThorsonTT 1 points 3 days ago The secret ingredient is crime. permalink award report block reply Aggrieved03 1 points 3 days ago One thing both parties love to do. permalink award report block reply CatalystForChange 1 points 3 days ago Any currency that is not asset backed is not real money. How much of that 38T debt is fake? permalink award report block reply Mhmm2MoreWeeks 0 points 3 days ago Simple. Government is Organized Crime. Its primary skill is not the Guns and Prisons and all that NONONONO. Its primary skill is fooling stupid people to support their own destruction, or fooling angry people into thinking they are in a race war. Government is real good at those two things. permalink award report block reply\nAppeal2Heaven98 54 points 3 days ago I wonder if we'll even have a country in a decade. We're already past the point of no return, and no one seems bothered to give a shit and stop the spending. permalink award report block reply Crucible OP 39 points 3 days ago I get called a \"Doomer\" and \"Trump Hater\" by the normies for pointing out the obvious. permalink parent award report block reply RomanCatholicPatriot 22 points 3 days ago 100% permalink parent award report block reply 123breadman 2 points 3 days ago That's because every week it's something new crying wolf. The world is always ending \"soon.\" Has been going on for a while. Epic Economist, Canadian Prepper, Mason Mannerino, Steve Quayle. Always happens. \"The world is ending soon, buy my book and dvd for $60 to learn how it could end\" \"Sell your house now (2016) and rent an apartment before your home value collapses.\" permalink parent award report block reply Klaus73 1 points 3 days ago I got tired of Canadian Prepper telling me to go buy gold... permalink parent award report block reply 123breadman 0 points 2 days ago As usual conservatives complaining about global birth rates, but have anxiety that the world is ending so they can't have kids. Make it make sense. Brb, turns out it's just an old man telling us to do this lol permalink parent award report block reply view 1 more comments... corporateshizer 30 points 3 days ago Same. We either deport 50 - 100 million foreigners  in the next decade or we don't have a country. permalink parent award report block reply Aggrieved03 14 points 3 days ago Not one politician is talking about this. permalink parent award report block reply Weepingwillowwidow 10 points 3 days ago Why would they talk about their failure to protect the citizens from the enemy within? We are pawns in a large game, adapt and overcome. permalink parent award report block reply justicein2020 3 points 3 days ago Because they are mostly (dual citizens). And this isn't their fav country. permalink parent award report block reply RhodesianRidgeback 15 points 3 days ago I'm moving to Costa Rica or El Salvador. If I'm going to be forced to live around a bunch of third world shitskins, at least I wont have the shit taxed out of me and my cost of living will be cut in half. permalink parent award report block reply EmptyNoose 10 points 3 days ago You are so correct when you say no one gives a shit. We have accumulated TWO TRILLION dollars worth of debt in less than a year and pay over a trillion a year just to service the overall debt. When I bring it up to anyone saying it's completely unsustainable people look at me as if it's a silly thing to worry about. I hope we aren't past the point of no return but you may be right. I've been putting myself into low interest debt because fuck it why not best thing to have during a high inflation economy. permalink parent award report block reply mikejones 2 points 3 days ago The thing is no one has been around to experience what we are experiencing. We are going to be 50 trillion dollars in debt before anything gets going. And most families will be quickly in debt if someone loses their job. The bigger the bubble. the harder the crash. permalink parent award report block reply ninabobby 9 points 3 days ago You can’t maintain something like America unless the people are educated and believe in God. And we failed to stop the commies from taking over the schools, so that’s how we lost it. permalink parent award report block reply load 7 more comments...\nCrucible OP 39 points 3 days ago I get called a \"Doomer\" and \"Trump Hater\" by the normies for pointing out the obvious. permalink parent award report block reply RomanCatholicPatriot 22 points 3 days ago 100% permalink parent award report block reply 123breadman 2 points 3 days ago That's because every week it's something new crying wolf. The world is always ending \"soon.\" Has been going on for a while. Epic Economist, Canadian Prepper, Mason Mannerino, Steve Quayle. Always happens. \"The world is ending soon, buy my book and dvd for $60 to learn how it could end\" \"Sell your house now (2016) and rent an apartment before your home value collapses.\" permalink parent award report block reply Klaus73 1 points 3 days ago I got tired of Canadian Prepper telling me to go buy gold... permalink parent award report block reply 123breadman 0 points 2 days ago As usual conservatives complaining about global birth rates, but have anxiety that the world is ending so they can't have kids. Make it make sense. Brb, turns out it's just an old man telling us to do this lol permalink parent award report block reply view 1 more comments...\nRomanCatholicPatriot 22 points 3 days ago 100% permalink parent award report block reply\n123breadman 2 points 3 days ago That's because every week it's something new crying wolf. The world is always ending \"soon.\" Has been going on for a while. Epic Economist, Canadian Prepper, Mason Mannerino, Steve Quayle. Always happens. \"The world is ending soon, buy my book and dvd for $60 to learn how it could end\" \"Sell your house now (2016) and rent an apartment before your home value collapses.\" permalink parent award report block reply Klaus73 1 points 3 days ago I got tired of Canadian Prepper telling me to go buy gold... permalink parent award report block reply 123breadman 0 points 2 days ago As usual conservatives complaining about global birth rates, but have anxiety that the world is ending so they can't have kids. Make it make sense. Brb, turns out it's just an old man telling us to do this lol permalink parent award report block reply view 1 more comments...\nKlaus73 1 points 3 days ago I got tired of Canadian Prepper telling me to go buy gold... permalink parent award report block reply 123breadman 0 points 2 days ago As usual conservatives complaining about global birth rates, but have anxiety that the world is ending so they can't have kids. Make it make sense. Brb, turns out it's just an old man telling us to do this lol permalink parent award report block reply view 1 more comments...\n123breadman 0 points 2 days ago As usual conservatives complaining about global birth rates, but have anxiety that the world is ending so they can't have kids. Make it make sense. Brb, turns out it's just an old man telling us to do this lol permalink parent award report block reply view 1 more comments...\ncorporateshizer 30 points 3 days ago Same. We either deport 50 - 100 million foreigners  in the next decade or we don't have a country. permalink parent award report block reply Aggrieved03 14 points 3 days ago Not one politician is talking about this. permalink parent award report block reply Weepingwillowwidow 10 points 3 days ago Why would they talk about their failure to protect the citizens from the enemy within? We are pawns in a large game, adapt and overcome. permalink parent award report block reply justicein2020 3 points 3 days ago Because they are mostly (dual citizens). And this isn't their fav country. permalink parent award report block reply\nAggrieved03 14 points 3 days ago Not one politician is talking about this. permalink parent award report block reply Weepingwillowwidow 10 points 3 days ago Why would they talk about their failure to protect the citizens from the enemy within? We are pawns in a large game, adapt and overcome. permalink parent award report block reply justicein2020 3 points 3 days ago Because they are mostly (dual citizens). And this isn't their fav country. permalink parent award report block reply\nWeepingwillowwidow 10 points 3 days ago Why would they talk about their failure to protect the citizens from the enemy within? We are pawns in a large game, adapt and overcome. permalink parent award report block reply\njusticein2020 3 points 3 days ago Because they are mostly (dual citizens). And this isn't their fav country. permalink parent award report block reply\nRhodesianRidgeback 15 points 3 days ago I'm moving to Costa Rica or El Salvador. If I'm going to be forced to live around a bunch of third world shitskins, at least I wont have the shit taxed out of me and my cost of living will be cut in half. permalink parent award report block reply\nEmptyNoose 10 points 3 days ago You are so correct when you say no one gives a shit. We have accumulated TWO TRILLION dollars worth of debt in less than a year and pay over a trillion a year just to service the overall debt. When I bring it up to anyone saying it's completely unsustainable people look at me as if it's a silly thing to worry about. I hope we aren't past the point of no return but you may be right. I've been putting myself into low interest debt because fuck it why not best thing to have during a high inflation economy. permalink parent award report block reply mikejones 2 points 3 days ago The thing is no one has been around to experience what we are experiencing. We are going to be 50 trillion dollars in debt before anything gets going. And most families will be quickly in debt if someone loses their job. The bigger the bubble. the harder the crash. permalink parent award report block reply\nmikejones 2 points 3 days ago The thing is no one has been around to experience what we are experiencing. We are going to be 50 trillion dollars in debt before anything gets going. And most families will be quickly in debt if someone loses their job. The bigger the bubble. the harder the crash. permalink parent award report block reply\nninabobby 9 points 3 days ago You can’t maintain something like America unless the people are educated and believe in God. And we failed to stop the commies from taking over the schools, so that’s how we lost it. permalink parent award report block reply\ndeleted 23 points 3 days ago HockeyMom4Trump 21 points 3 days ago Why only 50 years? Why not make it 75!!!! Yay! Maybe even 100 year mortgages! permalink parent award report block reply Hanging_Chad 7 points 3 days ago 25-year-olds can pay until they’re 75. no 100-year-old wants to still be paying for their first house permalink parent award report block reply Klaus73 3 points 3 days ago The beauty is that the lender will put that asset on the books and then horse trade it back and forth essentially x10 its value. permalink parent award report block reply DeportThemAllForever -1 points 3 days ago To increase real estate prices.  Part of the “you’ll own nothing…” permalink parent award report block reply RomanCatholicPatriot 1 points 3 days ago Fuck off, cockbite. permalink parent award report block reply Crucible OP 11 points 3 days ago May need to take out 3 of them: One for the home. One for a car. One to go grocery shopping. permalink parent award report block reply DeportThemAllForever 1 points 3 days ago Fucking government always does bullshit that increases asset inflation and cost of everything for benefit of few corporations at expense to entire nation. This shit needs to be reverted, all of it.  Oh and healthcare already comes with massive loans.  Wanna live? Sign away right here on the dotted line. permalink parent award report block reply Hanging_Chad 4 points 3 days ago just identify as an illegal permalink parent award report block reply BlackPilledMAGA -2 points 3 days ago Right, I say cut all Fannie/Freddie backed mortgages to 15 year max... watch those home prices come a tumblin' down! That's the way we should be going. If they made it harder to get loans and made the terms shorter then it would be more beneficial to the younger generation of new buyers because it would slice home prices substantially as sellers can only ask for what buyers can afford to pay and the majority of buyers shop and buy based on what they can afford monthly. Yeah equity would be lost by a fuckton of people but oh well at least their kids and grandkids wouldn't be living with them permanently. permalink parent award report block reply DeportThemAllForever -3 points 3 days ago Much agreed, 30 year mortgages is crony capitalism. permalink parent award report block reply RuprechtThaMonkeyBoy 3 points 3 days ago I’ve never kept my original mortgage. I sold my starter home after 12 years (refinanced once) and it’s been 13 years in the current one. You’re not committed to that full mortgage timeframe, it’s not a sentence. Only in rare circumstances should someone target their first home as their last home. Sometimes it works out, but most of the time you learn what you like/don’t like in the first home. If you’ve lived under your means and saved you’ll have the option of renting the first one out when you buy your 2nd and the proceeds from that will help to pay it off early. permalink parent award report block reply daty_dato 2 points 3 days ago and they don't understand inflation. If you can get a 50 year fixed rate at 3% that's a deal of a life time. Inflation will make you payments nothing in 10-20 years. permalink parent award report block reply chickeninoven 1 points 3 days ago Assuming your wages keep up with or beat inflation. Have yours? Mine haven't. permalink parent award report block reply daty_dato 1 points 3 days ago Yes. but I don't have a situation like most.  The farther we get from Covid it'll work out.  The simple money devaluation will make that mortgage better then a 30 year. Top of my head 10% better. You can always pay it faster or invest with historically better returns. It all depends on the interest rate. And you have a home now. If that's the main driver. We need other reforms that would be better but just as unlikely.. permalink parent award report block reply Aggrieved03 2 points 3 days ago People are financing a trip to McDonald's. permalink parent award report block reply DT170x -3 points 3 days ago Must be the Current Thing that the derailers are saying. Mortgages is now [Current Thing] for the NPC'S on this site. I noticed that NPC'S will pick a [Current Topic] and plastered it on every topics in hopes to derail it to death. permalink parent award report block reply load 1 more comments...\nHockeyMom4Trump 21 points 3 days ago Why only 50 years? Why not make it 75!!!! Yay! Maybe even 100 year mortgages! permalink parent award report block reply Hanging_Chad 7 points 3 days ago 25-year-olds can pay until they’re 75. no 100-year-old wants to still be paying for their first house permalink parent award report block reply Klaus73 3 points 3 days ago The beauty is that the lender will put that asset on the books and then horse trade it back and forth essentially x10 its value. permalink parent award report block reply DeportThemAllForever -1 points 3 days ago To increase real estate prices.  Part of the “you’ll own nothing…” permalink parent award report block reply RomanCatholicPatriot 1 points 3 days ago Fuck off, cockbite. permalink parent award report block reply\nHanging_Chad 7 points 3 days ago 25-year-olds can pay until they’re 75. no 100-year-old wants to still be paying for their first house permalink parent award report block reply\nKlaus73 3 points 3 days ago The beauty is that the lender will put that asset on the books and then horse trade it back and forth essentially x10 its value. permalink parent award report block reply\nDeportThemAllForever -1 points 3 days ago To increase real estate prices.  Part of the “you’ll own nothing…” permalink parent award report block reply RomanCatholicPatriot 1 points 3 days ago Fuck off, cockbite. permalink parent award report block reply\nRomanCatholicPatriot 1 points 3 days ago Fuck off, cockbite. permalink parent award report block reply\nCrucible OP 11 points 3 days ago May need to take out 3 of them: One for the home. One for a car. One to go grocery shopping. permalink parent award report block reply DeportThemAllForever 1 points 3 days ago Fucking government always does bullshit that increases asset inflation and cost of everything for benefit of few corporations at expense to entire nation. This shit needs to be reverted, all of it.  Oh and healthcare already comes with massive loans.  Wanna live? Sign away right here on the dotted line. permalink parent award report block reply Hanging_Chad 4 points 3 days ago just identify as an illegal permalink parent award report block reply BlackPilledMAGA -2 points 3 days ago Right, I say cut all Fannie/Freddie backed mortgages to 15 year max... watch those home prices come a tumblin' down! That's the way we should be going. If they made it harder to get loans and made the terms shorter then it would be more beneficial to the younger generation of new buyers because it would slice home prices substantially as sellers can only ask for what buyers can afford to pay and the majority of buyers shop and buy based on what they can afford monthly. Yeah equity would be lost by a fuckton of people but oh well at least their kids and grandkids wouldn't be living with them permanently. permalink parent award report block reply DeportThemAllForever -3 points 3 days ago Much agreed, 30 year mortgages is crony capitalism. permalink parent award report block reply\nDeportThemAllForever 1 points 3 days ago Fucking government always does bullshit that increases asset inflation and cost of everything for benefit of few corporations at expense to entire nation. This shit needs to be reverted, all of it.  Oh and healthcare already comes with massive loans.  Wanna live? Sign away right here on the dotted line. permalink parent award report block reply Hanging_Chad 4 points 3 days ago just identify as an illegal permalink parent award report block reply BlackPilledMAGA -2 points 3 days ago Right, I say cut all Fannie/Freddie backed mortgages to 15 year max... watch those home prices come a tumblin' down! That's the way we should be going. If they made it harder to get loans and made the terms shorter then it would be more beneficial to the younger generation of new buyers because it would slice home prices substantially as sellers can only ask for what buyers can afford to pay and the majority of buyers shop and buy based on what they can afford monthly. Yeah equity would be lost by a fuckton of people but oh well at least their kids and grandkids wouldn't be living with them permanently. permalink parent award report block reply DeportThemAllForever -3 points 3 days ago Much agreed, 30 year mortgages is crony capitalism. permalink parent award report block reply\nHanging_Chad 4 points 3 days ago just identify as an illegal permalink parent award report block reply\nBlackPilledMAGA -2 points 3 days ago Right, I say cut all Fannie/Freddie backed mortgages to 15 year max... watch those home prices come a tumblin' down! That's the way we should be going. If they made it harder to get loans and made the terms shorter then it would be more beneficial to the younger generation of new buyers because it would slice home prices substantially as sellers can only ask for what buyers can afford to pay and the majority of buyers shop and buy based on what they can afford monthly. Yeah equity would be lost by a fuckton of people but oh well at least their kids and grandkids wouldn't be living with them permanently. permalink parent award report block reply DeportThemAllForever -3 points 3 days ago Much agreed, 30 year mortgages is crony capitalism. permalink parent award report block reply\nDeportThemAllForever -3 points 3 days ago Much agreed, 30 year mortgages is crony capitalism. permalink parent award report block reply\nRuprechtThaMonkeyBoy 3 points 3 days ago I’ve never kept my original mortgage. I sold my starter home after 12 years (refinanced once) and it’s been 13 years in the current one. You’re not committed to that full mortgage timeframe, it’s not a sentence. Only in rare circumstances should someone target their first home as their last home. Sometimes it works out, but most of the time you learn what you like/don’t like in the first home. If you’ve lived under your means and saved you’ll have the option of renting the first one out when you buy your 2nd and the proceeds from that will help to pay it off early. permalink parent award report block reply daty_dato 2 points 3 days ago and they don't understand inflation. If you can get a 50 year fixed rate at 3% that's a deal of a life time. Inflation will make you payments nothing in 10-20 years. permalink parent award report block reply chickeninoven 1 points 3 days ago Assuming your wages keep up with or beat inflation. Have yours? Mine haven't. permalink parent award report block reply daty_dato 1 points 3 days ago Yes. but I don't have a situation like most.  The farther we get from Covid it'll work out.  The simple money devaluation will make that mortgage better then a 30 year. Top of my head 10% better. You can always pay it faster or invest with historically better returns. It all depends on the interest rate. And you have a home now. If that's the main driver. We need other reforms that would be better but just as unlikely.. permalink parent award report block reply\ndaty_dato 2 points 3 days ago and they don't understand inflation. If you can get a 50 year fixed rate at 3% that's a deal of a life time. Inflation will make you payments nothing in 10-20 years. permalink parent award report block reply chickeninoven 1 points 3 days ago Assuming your wages keep up with or beat inflation. Have yours? Mine haven't. permalink parent award report block reply daty_dato 1 points 3 days ago Yes. but I don't have a situation like most.  The farther we get from Covid it'll work out.  The simple money devaluation will make that mortgage better then a 30 year. Top of my head 10% better. You can always pay it faster or invest with historically better returns. It all depends on the interest rate. And you have a home now. If that's the main driver. We need other reforms that would be better but just as unlikely.. permalink parent award report block reply\nchickeninoven 1 points 3 days ago Assuming your wages keep up with or beat inflation. Have yours? Mine haven't. permalink parent award report block reply daty_dato 1 points 3 days ago Yes. but I don't have a situation like most.  The farther we get from Covid it'll work out.  The simple money devaluation will make that mortgage better then a 30 year. Top of my head 10% better. You can always pay it faster or invest with historically better returns. It all depends on the interest rate. And you have a home now. If that's the main driver. We need other reforms that would be better but just as unlikely.. permalink parent award report block reply\ndaty_dato 1 points 3 days ago Yes. but I don't have a situation like most.  The farther we get from Covid it'll work out.  The simple money devaluation will make that mortgage better then a 30 year. Top of my head 10% better. You can always pay it faster or invest with historically better returns. It all depends on the interest rate. And you have a home now. If that's the main driver. We need other reforms that would be better but just as unlikely.. permalink parent award report block reply\nAggrieved03 2 points 3 days ago People are financing a trip to McDonald's. permalink parent award report block reply\nDT170x -3 points 3 days ago Must be the Current Thing that the derailers are saying. Mortgages is now [Current Thing] for the NPC'S on this site. I noticed that NPC'S will pick a [Current Topic] and plastered it on every topics in hopes to derail it to death. permalink parent award report block reply\ncorporateshizer 18 points 3 days ago The Fed's $38 trillion debt is on top of the taxes everyone paid. They stole them both. Our federal government spent $192 trillion (in today's value) in the last 50 years, and look at the state of the country: crumbling infrastructure and 80-IQ foreign retards everywhere. Thanks, Boomers! permalink award report block reply mikejones 1 points 3 days ago The best thing to do is point out the current problem. And that is Trump taking on 37 trillion of debt. He knows what's up and is trying to loot the countries we made rich to pay off our debt. Meanwhile instead of fixing old stuff, we are building new stuff by knocking down trees so reach people can get away from the problem areas. permalink parent award report block reply BigMikesSwingingCock 1 points 3 days ago Our interstates are a complete disaster; a state of disrepair. Everywhere you drive, there's more potholes than you can shake a stick at, so it's not just on a federal level, it's also state and county. Public transportation is a clown show, it's basically a lawless zoo. Not to mention that any projects that receive funding end up having all the funds embezzled, and projects scrapped. The power grids are a joke. One day of snow, or heavy rain, and you've got brownouts and blackouts. permalink parent award report block reply duznmatter -3 points 3 days ago Get off your ass and fix it then shitskin. You wouldn't even be on the internet playing video games in your Mom's basement today if it wasn't for boomers. permalink parent award report block reply\nmikejones 1 points 3 days ago The best thing to do is point out the current problem. And that is Trump taking on 37 trillion of debt. He knows what's up and is trying to loot the countries we made rich to pay off our debt. Meanwhile instead of fixing old stuff, we are building new stuff by knocking down trees so reach people can get away from the problem areas. permalink parent award report block reply\nBigMikesSwingingCock 1 points 3 days ago Our interstates are a complete disaster; a state of disrepair. Everywhere you drive, there's more potholes than you can shake a stick at, so it's not just on a federal level, it's also state and county. Public transportation is a clown show, it's basically a lawless zoo. Not to mention that any projects that receive funding end up having all the funds embezzled, and projects scrapped. The power grids are a joke. One day of snow, or heavy rain, and you've got brownouts and blackouts. permalink parent award report block reply\nduznmatter -3 points 3 days ago Get off your ass and fix it then shitskin. You wouldn't even be on the internet playing video games in your Mom's basement today if it wasn't for boomers. permalink parent award report block reply\nSavingPrivateGrace 13 points 3 days ago Our country was sold out and stolen from us because we don't have term limits for the crooks. permalink award report block reply Crucible OP 9 points 3 days ago 1913 permalink parent award report block reply corporateshizer 1 points 3 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nCrucible OP 9 points 3 days ago 1913 permalink parent award report block reply\ncorporateshizer 1 points 3 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nlearntocode 12 points 3 days ago Thw idea that we have an annual budget is asinine. We should NOT be borrowing our currency from a private bank cartel. We should be SELLING the right to lend to banks. So straightforward. No lame moralizing needed. permalink award report block reply\nRhodesianRidgeback 8 points 3 days ago \"If the government were placed in charge of the Sahara Desert, in four years there would be a shortage of sand.\" - Milton Friedman permalink award report block reply\nHockeyMom4Trump 8 points 3 days ago It’s like having a drug addicted gambler in the family-never enough money and they will take take take and steal steal steal! permalink award report block reply\nFKH2 6 points 3 days ago If what you mean by \"Fail to properly manage it\" is launder it through government contracts, foreign aid and NGO's and have it kicked back to them through campaign contributions and book deals than yes permalink award report block reply Crucible OP 5 points 3 days ago \"Abscond with\".... permalink parent award report block reply\nCrucible OP 5 points 3 days ago \"Abscond with\".... permalink parent award report block reply\nBigBadMagaMan 5 points 3 days ago It’s easy when 70% of that fucking money is being spent on shit outside of our country. permalink award report block reply RedStoneDeepState -5 points 3 days ago What the fuck are you talking about? permalink parent award report block reply BigBadMagaMan 4 points 3 days ago Government spends money on foreign affairs. What the fuck are you talking about, Rothstein? permalink parent award report block reply RedStoneDeepState -4 points 3 days ago Government spends money on foreign affairs. How does an amount of spending equal 70% of total spending? permalink parent award report block reply BigBadMagaMan 3 points 3 days ago GO LOOK AT OVERSEAS AND FOREIGN US GOVT SPENDING DUMBFUCK. permalink parent award report block reply view 5 more comments...\nRedStoneDeepState -5 points 3 days ago What the fuck are you talking about? permalink parent award report block reply BigBadMagaMan 4 points 3 days ago Government spends money on foreign affairs. What the fuck are you talking about, Rothstein? permalink parent award report block reply RedStoneDeepState -4 points 3 days ago Government spends money on foreign affairs. How does an amount of spending equal 70% of total spending? permalink parent award report block reply BigBadMagaMan 3 points 3 days ago GO LOOK AT OVERSEAS AND FOREIGN US GOVT SPENDING DUMBFUCK. permalink parent award report block reply view 5 more comments...\nBigBadMagaMan 4 points 3 days ago Government spends money on foreign affairs. What the fuck are you talking about, Rothstein? permalink parent award report block reply RedStoneDeepState -4 points 3 days ago Government spends money on foreign affairs. How does an amount of spending equal 70% of total spending? permalink parent award report block reply BigBadMagaMan 3 points 3 days ago GO LOOK AT OVERSEAS AND FOREIGN US GOVT SPENDING DUMBFUCK. permalink parent award report block reply view 5 more comments...\nRedStoneDeepState -4 points 3 days ago Government spends money on foreign affairs. How does an amount of spending equal 70% of total spending? permalink parent award report block reply BigBadMagaMan 3 points 3 days ago GO LOOK AT OVERSEAS AND FOREIGN US GOVT SPENDING DUMBFUCK. permalink parent award report block reply view 5 more comments...\nBigBadMagaMan 3 points 3 days ago GO LOOK AT OVERSEAS AND FOREIGN US GOVT SPENDING DUMBFUCK. permalink parent award report block reply view 5 more comments...\nEaszq8 3 points 3 days ago They have guns so they don’t need to be competitive. permalink award report block reply\nknnbccb 3 points 3 days ago A small and limited government is your only guarantee of liberty, prosperity and security. If it is neither small nor limited, the opposite outcomes happen. permalink award report block reply\nrightoverthere 2 points 2 days ago how can anyone claim usa is the wealthiest country in the world with that amount of debt. permalink award report block reply\ngreatpumpkin 2 points 3 days ago (D)s never saw a bag of gold they didn't immediately figure out how to piss away. permalink award report block reply\nNHMS_observer 2 points 3 days ago So many traitors.  So many unconstitutional actions taken.  So much iniquity abounds.  So much anti-American behavior emanates from our very own Capital.  All is being revealed now in the reality of the apocalypse. permalink award report block reply\ncornpop_1988 1 points 3 days ago End foreign aid for good. Welfare is a huge problem in this country so put an end to that too. However, that won't happen because of Democrats. permalink award report block reply\nGuessWhoItIs 1 points 3 days ago It’s not a failure. It’s a success and everything is going to plan. Their plan, not ours. permalink award report block reply Stolen 1 points 3 days ago Accelerated success $5.7 Trillion in the year 2000 to $38 trillion by 2025. Caused by 9-11 cabal, 2008 financial crash,  and the 2020 Plandemic. permalink parent award report block reply\nStolen 1 points 3 days ago Accelerated success $5.7 Trillion in the year 2000 to $38 trillion by 2025. Caused by 9-11 cabal, 2008 financial crash,  and the 2020 Plandemic. permalink parent award report block reply\nmoscowjade 1 points 3 days ago And all the money they spend goes to destroying us. permalink award report block reply\nCatsGoWoof 1 points 3 days ago Just like wikipedia. Fuck those website owners. permalink award report block reply\nJimQPublic 1 points 3 days ago Easy.  They spent it before they stole it. permalink award report block reply\nMarshallB 1 points 3 days ago It is Congressionally Approved borrowing. It isn't wise, but it's why the shutdown prevents funding SNAP. There is no money to spend or borrow until authorized. What is being spent has already been authorized or gifted to them. permalink award report block reply\nHarvestsmiles 1 points 3 days ago Politicians are similar to some of those Section 8 videos going around recently. permalink award report block reply\nAuserr 1 points 3 days ago Both sides are playing us. permalink award report block reply\nMegaboom2025 1 points 3 days ago By gunpoint permalink award report block reply\nThorsonTT 1 points 3 days ago The secret ingredient is crime. permalink award report block reply\nAggrieved03 1 points 3 days ago One thing both parties love to do. permalink award report block reply\nCatalystForChange 1 points 3 days ago Any currency that is not asset backed is not real money. How much of that 38T debt is fake? permalink award report block reply\nMhmm2MoreWeeks 0 points 3 days ago Simple. Government is Organized Crime. Its primary skill is not the Guns and Prisons and all that NONONONO. Its primary skill is fooling stupid people to support their own destruction, or fooling angry people into thinking they are in a race war. Government is real good at those two things. permalink award report block reply"}