{"id": "1ARK9oXTLq", "contents": "187 Trump and the GOP are NOTHING without these people. Good luck having pajeets fill these shoes in 2026 and 2028. posted 16 hours ago by JoeMcCarthyWasRight 10 comments award share download report block\n10 comments Sort by Top Top New Worst Old Save CrossTheRubixCube 10 points 15 hours ago The poos will just vote blue lol permalink award report block reply Afeazo 2 points 14 hours ago They also have next to no connection to the longevity of the country. They will vote for whatever, and if it turns to shit they will just move back to where they came from. Many of them are sending a lot of money back already to build homes and pad bank accounts over there. A $10k USD annual salary puts you in the top 5-10% in India, that is the top end of upper middle class if not just straight upper class. That is like a $350k income in the US. If an H1B worker comes here and manages to put away $20k a year for 10 years (which is very doable, its less than what it would take to max out a 401k), they can now go to india and live for 40 years on the savings living an upper class lifestyle without working. permalink parent award report block reply 0illuminated1 3 points 15 hours ago Lol, as if. permalink award report block reply General_Specific 1 points 14 hours ago Maybe this is Trump's version \"importing voter\". permalink award report block reply grassshrimp -2 points 14 hours ago This faux outrage by communists doesn't exist in the real world. OP is a pretender. permalink award report block reply DefineTheLine -2 points 15 hours ago His crowds will all be 65+ Y/Os. permalink award report block reply B-2StealthTrump 3 points 11 hours ago Charlie Kirk and Gen Z would like a word, soy-boy. permalink parent award report block reply berserkerbarrage -7 points 15 hours ago Most people in the real world don't care about the fake H-1B outrage. permalink award report block reply General_Specific 1 points 14 hours ago Because most people in the world are stupid fucking sheep who never challenge authority. permalink parent award report block reply Standingoak 1 points 10 hours ago That's your job Wolfhound.  Somebody has to care for the 50%  that are below average(mean) IQ sheep. Motivate and direct. permalink parent award report block reply General_Specific 1 points 4 hours ago So you have to be low IQ to not want your country to be invaded by slave labor who don't assimilate and have no respect for your country, culture, government? Interesting. I don't have friends below 120 IQ and most are over 130 and they ALL want the H1B shit to end. You must hang around below mean people. permalink parent award report block reply\nCrossTheRubixCube 10 points 15 hours ago The poos will just vote blue lol permalink award report block reply Afeazo 2 points 14 hours ago They also have next to no connection to the longevity of the country. They will vote for whatever, and if it turns to shit they will just move back to where they came from. Many of them are sending a lot of money back already to build homes and pad bank accounts over there. A $10k USD annual salary puts you in the top 5-10% in India, that is the top end of upper middle class if not just straight upper class. That is like a $350k income in the US. If an H1B worker comes here and manages to put away $20k a year for 10 years (which is very doable, its less than what it would take to max out a 401k), they can now go to india and live for 40 years on the savings living an upper class lifestyle without working. permalink parent award report block reply\nAfeazo 2 points 14 hours ago They also have next to no connection to the longevity of the country. They will vote for whatever, and if it turns to shit they will just move back to where they came from. Many of them are sending a lot of money back already to build homes and pad bank accounts over there. A $10k USD annual salary puts you in the top 5-10% in India, that is the top end of upper middle class if not just straight upper class. That is like a $350k income in the US. If an H1B worker comes here and manages to put away $20k a year for 10 years (which is very doable, its less than what it would take to max out a 401k), they can now go to india and live for 40 years on the savings living an upper class lifestyle without working. permalink parent award report block reply\n0illuminated1 3 points 15 hours ago Lol, as if. permalink award report block reply\nGeneral_Specific 1 points 14 hours ago Maybe this is Trump's version \"importing voter\". permalink award report block reply\ngrassshrimp -2 points 14 hours ago This faux outrage by communists doesn't exist in the real world. OP is a pretender. permalink award report block reply\nDefineTheLine -2 points 15 hours ago His crowds will all be 65+ Y/Os. permalink award report block reply B-2StealthTrump 3 points 11 hours ago Charlie Kirk and Gen Z would like a word, soy-boy. permalink parent award report block reply\nB-2StealthTrump 3 points 11 hours ago Charlie Kirk and Gen Z would like a word, soy-boy. permalink parent award report block reply\nberserkerbarrage -7 points 15 hours ago Most people in the real world don't care about the fake H-1B outrage. permalink award report block reply General_Specific 1 points 14 hours ago Because most people in the world are stupid fucking sheep who never challenge authority. permalink parent award report block reply Standingoak 1 points 10 hours ago That's your job Wolfhound.  Somebody has to care for the 50%  that are below average(mean) IQ sheep. Motivate and direct. permalink parent award report block reply General_Specific 1 points 4 hours ago So you have to be low IQ to not want your country to be invaded by slave labor who don't assimilate and have no respect for your country, culture, government? Interesting. I don't have friends below 120 IQ and most are over 130 and they ALL want the H1B shit to end. You must hang around below mean people. permalink parent award report block reply\nGeneral_Specific 1 points 14 hours ago Because most people in the world are stupid fucking sheep who never challenge authority. permalink parent award report block reply Standingoak 1 points 10 hours ago That's your job Wolfhound.  Somebody has to care for the 50%  that are below average(mean) IQ sheep. Motivate and direct. permalink parent award report block reply General_Specific 1 points 4 hours ago So you have to be low IQ to not want your country to be invaded by slave labor who don't assimilate and have no respect for your country, culture, government? Interesting. I don't have friends below 120 IQ and most are over 130 and they ALL want the H1B shit to end. You must hang around below mean people. permalink parent award report block reply\nStandingoak 1 points 10 hours ago That's your job Wolfhound.  Somebody has to care for the 50%  that are below average(mean) IQ sheep. Motivate and direct. permalink parent award report block reply General_Specific 1 points 4 hours ago So you have to be low IQ to not want your country to be invaded by slave labor who don't assimilate and have no respect for your country, culture, government? Interesting. I don't have friends below 120 IQ and most are over 130 and they ALL want the H1B shit to end. You must hang around below mean people. permalink parent award report block reply\nGeneral_Specific 1 points 4 hours ago So you have to be low IQ to not want your country to be invaded by slave labor who don't assimilate and have no respect for your country, culture, government? Interesting. I don't have friends below 120 IQ and most are over 130 and they ALL want the H1B shit to end. You must hang around below mean people. permalink parent award report block reply"}