{"id": "1ARK9oYa4x", "contents": "93 This, and only this... Fuck these nogs driving up steak prices to $30/lb posted 13 hours ago by SuperHonkey 13 comments award share report block Wall Street Apes @WallStreetApes • 23h This is what the state of Louisiana gives with their “commodities supplemental food program” where they give the elderly one box of food a month The entire nation’s food stamps program should be changed over to this No more EBT payments for fast food, junk and fraud\n13 comments Sort by Top Top New Worst Old Save Around the Web 5 Parasite Causing Foods You Should Stop Eating Right Now Paratoxil Jack_NC 6 points 12 hours ago I guess I'm poor b/c I was thinking how much that box would help and how grateful I would be. Someone could create a lot of meals from that bag of grits and the bag of instant potatoes, there's even fruit and some canned vegetables. permalink award report block reply Beachbum2023 2 points 11 hours ago I sent you a private message permalink parent award report block reply Burisma 1 points 11 hours ago Send me one too! permalink parent award report block reply Beachbum2023 4 points 11 hours ago Dick pics for everyone! permalink parent award report block reply AlwaysTrumper2020 4 points 12 hours ago Gimmedats would burn down Baton Rouge if they got this instead of their EBT cards in Louisiana... permalink award report block reply BlokeyMcBlokeFace 3 points 11 hours ago Notice how the woman is actually happy and grateful to get stuff like dried beans and rice? permalink award report block reply SuperHonkey OP 2 points 11 hours ago Well, she's white, so... permalink parent award report block reply Trump454748 2 points 3 hours ago No flamin’ hot Cheetos, purple drank, or steak and lobster? Dat’s rayciss!!!!!  Seriously though, that’s what the government SHOULD be handing out instead of unlimited free shit. permalink award report block reply GodSaveTheWest 2 points 11 hours ago Yep, this is the bare minimum type food that should be given out. EBT/SNAP should not be buying any luxuries. permalink award report block reply OpusX 1 points 11 hours ago The word 'supplement' means an addition to in order to make a whole . The idea being that the person who's receiving the aid is making efforts to also provide for themselves. These programs were never intended to pay for millions of people to sit on their ass and have the goverment pay for all their groceries for the whole month, every month ad infinitum. permalink award report block reply IncredibleMrE1 1 points 12 hours ago Lobster too. permalink award report block reply schnazzmizzle 1 points 11 hours ago Cheese grits is all you need. permalink award report block reply Beachbum2023 1 points 11 hours ago Canned meat is awesome. My favorite is canned chicken, plus you can make anything in half the time because the meat already cooked! permalink award report block reply\nJack_NC 6 points 12 hours ago I guess I'm poor b/c I was thinking how much that box would help and how grateful I would be. Someone could create a lot of meals from that bag of grits and the bag of instant potatoes, there's even fruit and some canned vegetables. permalink award report block reply Beachbum2023 2 points 11 hours ago I sent you a private message permalink parent award report block reply Burisma 1 points 11 hours ago Send me one too! permalink parent award report block reply Beachbum2023 4 points 11 hours ago Dick pics for everyone! permalink parent award report block reply\nBeachbum2023 2 points 11 hours ago I sent you a private message permalink parent award report block reply Burisma 1 points 11 hours ago Send me one too! permalink parent award report block reply Beachbum2023 4 points 11 hours ago Dick pics for everyone! permalink parent award report block reply\nBurisma 1 points 11 hours ago Send me one too! permalink parent award report block reply Beachbum2023 4 points 11 hours ago Dick pics for everyone! permalink parent award report block reply\nBeachbum2023 4 points 11 hours ago Dick pics for everyone! permalink parent award report block reply\nAlwaysTrumper2020 4 points 12 hours ago Gimmedats would burn down Baton Rouge if they got this instead of their EBT cards in Louisiana... permalink award report block reply\nBlokeyMcBlokeFace 3 points 11 hours ago Notice how the woman is actually happy and grateful to get stuff like dried beans and rice? permalink award report block reply SuperHonkey OP 2 points 11 hours ago Well, she's white, so... permalink parent award report block reply\nSuperHonkey OP 2 points 11 hours ago Well, she's white, so... permalink parent award report block reply\nTrump454748 2 points 3 hours ago No flamin’ hot Cheetos, purple drank, or steak and lobster? Dat’s rayciss!!!!!  Seriously though, that’s what the government SHOULD be handing out instead of unlimited free shit. permalink award report block reply\nGodSaveTheWest 2 points 11 hours ago Yep, this is the bare minimum type food that should be given out. EBT/SNAP should not be buying any luxuries. permalink award report block reply\nOpusX 1 points 11 hours ago The word 'supplement' means an addition to in order to make a whole . The idea being that the person who's receiving the aid is making efforts to also provide for themselves. These programs were never intended to pay for millions of people to sit on their ass and have the goverment pay for all their groceries for the whole month, every month ad infinitum. permalink award report block reply\nIncredibleMrE1 1 points 12 hours ago Lobster too. permalink award report block reply\nschnazzmizzle 1 points 11 hours ago Cheese grits is all you need. permalink award report block reply\nBeachbum2023 1 points 11 hours ago Canned meat is awesome. My favorite is canned chicken, plus you can make anything in half the time because the meat already cooked! permalink award report block reply"}