{"id": "1ARK9nPM4u", "contents": "35 \"No prior generation had to give up all other joys in life to buy a home. \n\nThey had phones. They watched tv and movies. They ate at restaurants. They traveled. They drove new cars. They went to bars with friends. They drank and smoked constantly. \n\nTo pretend otherwise is absurd.\" posted 6 hours ago by bleeje 12 comments award share report block wolfgang fuckface @mustachetoilet • 1d No prior generation had to give up all other joys in life to buy a home. They had phones. They watched tv and movies. They ate at restaurants. They traveled. They drove new cars. They went to bars with friends. They drank and smoked constantly. To pretend otherwise is absurd. 4nt1p4tt3rn 🏴‍☠ Appalachistan Wolf Lodge #47 @4nt1p4tt3rn • 1d You want a house? Cool, cool. When are you gonna give up your $1,500 smartphone that you buy the new version of every year or so? When are you cancelling all your subscription services? When are you giving up Uber, and UberEats? When are you going to stop buying a $7\n12 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style EvJohn 5 points 5 hours ago It was a little different for Gen X, though.  Stuff like Netflix and spotify and even basic cell phones weren't  \"necessities \". The subscription economy is a drain we did not have. permalink award report block reply EvJohn 3 points 5 hours ago Further, when we were saving for our first down payment, we didn't have a TV, drove a $200 beater from the classifieds, and \"ate out\" once a month as a treat. Difference is, we didn't think of it as austerity. We thought it normal.  By our standards then, we weren't deprived of anything. permalink parent award report block reply NeverNotTrump 4 points 4 hours ago Newsflash: The property isn't worth more; the currency is worth less. permalink award report block reply skuts 3 points 5 hours ago My old man bought a new house a new car and put two kids through private school on a waiter's salary, in the early 1960s. permalink award report block reply Watermelons 3 points 6 hours ago Saul Alinsky would be proud. permalink award report block reply Iremembermypassword 3 points 6 hours ago What about 50 years of debt slavery? permalink award report block reply GA_Logic 2 points 6 hours ago There were financial sacrifices that  had to be made or delayed.  But yes cost of living was more reasonable decades ago. permalink award report block reply elgordo 2 points 4 hours ago I bought used cars and we shared a cell phone all the way until I made like 130K, and that was in year 2000 money. We ate out once in a while and we went to the restaurants in person. The utterly fucking retarded Uber eats services didn't exist. These make take out food cost TWICE as much as you would pay going out. And the food is fucking soggy. Only pizza and Chinese food can be delivered and taste good. People are idiots for spending money one all of these delivery services. permalink award report block reply NeverNotTrump 1 points 4 hours ago I have zero debt and still don't buy new cars.  Hat tip, Dave Ramsey. permalink parent award report block reply Taqiyya_Mockingbird 1 points 6 hours ago They had plastic phones, usually mounted on the wall, that didn’t have the internet, cameras, games, etc and weren’t made of glass that would shatter when you sneeze and cost $700. permalink award report block reply Littleirishmaid 3 points 5 hours ago They could buy a car for $700 back then.  Obama crushed any of them that remained. permalink parent award report block reply SCHULTZ 1 points 6 hours ago Comment removed by community moderators. permalink award report block reply\nEvJohn 5 points 5 hours ago It was a little different for Gen X, though.  Stuff like Netflix and spotify and even basic cell phones weren't  \"necessities \". The subscription economy is a drain we did not have. permalink award report block reply EvJohn 3 points 5 hours ago Further, when we were saving for our first down payment, we didn't have a TV, drove a $200 beater from the classifieds, and \"ate out\" once a month as a treat. Difference is, we didn't think of it as austerity. We thought it normal.  By our standards then, we weren't deprived of anything. permalink parent award report block reply\nEvJohn 3 points 5 hours ago Further, when we were saving for our first down payment, we didn't have a TV, drove a $200 beater from the classifieds, and \"ate out\" once a month as a treat. Difference is, we didn't think of it as austerity. We thought it normal.  By our standards then, we weren't deprived of anything. permalink parent award report block reply\nNeverNotTrump 4 points 4 hours ago Newsflash: The property isn't worth more; the currency is worth less. permalink award report block reply\nskuts 3 points 5 hours ago My old man bought a new house a new car and put two kids through private school on a waiter's salary, in the early 1960s. permalink award report block reply\nWatermelons 3 points 6 hours ago Saul Alinsky would be proud. permalink award report block reply\nIremembermypassword 3 points 6 hours ago What about 50 years of debt slavery? permalink award report block reply\nGA_Logic 2 points 6 hours ago There were financial sacrifices that  had to be made or delayed.  But yes cost of living was more reasonable decades ago. permalink award report block reply\nelgordo 2 points 4 hours ago I bought used cars and we shared a cell phone all the way until I made like 130K, and that was in year 2000 money. We ate out once in a while and we went to the restaurants in person. The utterly fucking retarded Uber eats services didn't exist. These make take out food cost TWICE as much as you would pay going out. And the food is fucking soggy. Only pizza and Chinese food can be delivered and taste good. People are idiots for spending money one all of these delivery services. permalink award report block reply NeverNotTrump 1 points 4 hours ago I have zero debt and still don't buy new cars.  Hat tip, Dave Ramsey. permalink parent award report block reply\nNeverNotTrump 1 points 4 hours ago I have zero debt and still don't buy new cars.  Hat tip, Dave Ramsey. permalink parent award report block reply\nTaqiyya_Mockingbird 1 points 6 hours ago They had plastic phones, usually mounted on the wall, that didn’t have the internet, cameras, games, etc and weren’t made of glass that would shatter when you sneeze and cost $700. permalink award report block reply Littleirishmaid 3 points 5 hours ago They could buy a car for $700 back then.  Obama crushed any of them that remained. permalink parent award report block reply\nLittleirishmaid 3 points 5 hours ago They could buy a car for $700 back then.  Obama crushed any of them that remained. permalink parent award report block reply\nSCHULTZ 1 points 6 hours ago Comment removed by community moderators. permalink award report block reply"}