{"id": "1ARK9mHn2V", "contents": "1145 God is good! Months ago, I posted about my wife & I struggling to conceive 2+ years after a miscarriage changed our minds about wanting to become parents. Yesterday, we saw our daughter's face for the first time. ❤️ posted 10 hours ago by MawdT20 110 comments award share download report block\n110 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget RuprechtThaMonkeyBoy 46 points 10 hours ago Congrats! permalink award report block reply memeYourDreams 10 points 4 hours ago And DO NOT for the love of god, VACCINATE mother nor child! permalink parent award report block reply SnowSnake 39 points 10 hours ago Very cool! Our son will be 6 in February. I still have his first sonogram image as my cellphone background wallpaper. He was the size of a grape at the time. Fascinating. You can see thru them, their spine and heart beating.. truly a miracle of God. The real fun begins moments after delivery. You will never be the same again. Bless God 🙌 permalink award report block reply Grindelwald 37 points 10 hours ago Congrats.\nMy mother had her first child. Then three miscarriages.   Doctor  says she’ll never conceive again.  Then she had eight more children. permalink award report block reply ancroidubh 30 points 10 hours ago Welcome to the most difficult yet most rewarding job of your lifetime. May God bless you all. permalink award report block reply KeenanV71 2 points 51 minutes ago It's the most stressful, unappreciated, job ever. I wouldn't trade a single second of it for anything. permalink parent award report block reply JtBlaze 24 points 10 hours ago Priceless. permalink award report block reply GA_Logic 23 points 10 hours ago Congratulations! permalink award report block reply E-dantes 20 points 10 hours ago Amen, fren. God is good. May you be blessed with sleepless nights and baby giggles, great memories, and a lifetime of love to give to that child! The struggle is so worth it every time my kids look at me and smile, whether they've challenged themselves in completing a task, or when they goof up. Every smile makes every days struggle worth it. permalink award report block reply KiekhaeferSoldier 16 points 8 hours ago Wife & I married late... (35yrs old) and while \"waiting until we could afford kids\" my 20yr old nephew fathered his third child with a third mother.  We decidd then that we needed children to offset the damage my nephew was doing.  After third miscarriage, her OB said, \"Keep trying.  This is just God's way of sorting out the good eggs\".  Our daughter is now 21, brilliant, 4.0+ in Junior year to become a doctor.  She is KILLIN' it.  She walked on 1st birthday, could sing National Anthem at 18 months, speaks perfect, proper english (never spoke baby talk to her), converses perfectly with other adults, scoffs at peer pressure and is a great driver! (can change a flat, too!).\nRead to your daughter!  Enjoy silly cat videos with her.  Point out lunatics in public so she recognizes them.  Don't ever be vulgar around her, or your wife.  Drop what you're doing and welcome her when she arrives home or even enters a room. Oh, and teach her sign language!  We started before 6months old and it completely eliminated \"The terrible two's\" because she could sign WAY BEFORE she could speak. permalink award report block reply MawdT20 OP 9 points 8 hours ago Reading to the baby is #1 on my activities list to do with her! We've already started adding books to the shelves in the nursery. permalink parent award report block reply KiekhaeferSoldier 9 points 7 hours ago Go to thrift stores (goodwill, salvation army, etc...) and buy up all the OLD (pre-1980's) \"Little Golden Book\" series.  They have all the best nursery rhymes, stories and wholesome content and can be passed down to your future grandchildren!!\nAlso, right NOW, buy this book!!!  Best thing ever, written like an old Boy Scout Handbook and I loved it! https://www.amazon.com/Be-Prepared-Gary-Greenberg/dp/0743251547 permalink parent award report block reply Karma 13 points 9 hours ago She looks beautiful! permalink award report block reply SisterCovfefeToo 12 points 10 hours ago Congratulations! permalink award report block reply Fundadores 10 points 9 hours ago I can’t know God’s thought process, but for those of us who struggled to conceive, I imagine it’s His way of cementing it in our minds that “you wanted this” which is helpful when things get difficult. You’ll have so much joy, and no help needed during those times, but you’ll also have challenges. Never forget how much you wanted it and how God honored that and blessed you with the responsibility. You can also be proud of yourself and your wife for having the courage to keep trying. That’s a rough season. Thanks for sharing! She has an adorable, sweet little face. permalink award report block reply Copen45 10 points 10 hours ago that is awesome... congratulations brother permalink award report block reply Seatacjoe 10 points 9 hours ago Oh brother, praying for you and your wife permalink award report block reply Baldeagle8 10 points 8 hours ago So happy for you! My wife and I just had our beautiful  healthly daughter born on October 14th. We had years of miscarriages and a newborn loss, (our son had down syndrome and had a lot of health issues). Before our first ultrasound at 6 weeks, I prayed to God and he told me \"this is the one\". I don't fully understand why we have to go through all the hardships, but now holding my daughter I can say it was all worth it. God bless you and your family! permalink award report block reply CaptainN 9 points 9 hours ago Congrats! The wife and I have been trying, without success, for awhile now. So, we're praying for a similar outcome for ourselves. permalink award report block reply MawdT20 OP 8 points 9 hours ago 🙏 Nothing is impossible for God! permalink parent award report block reply glow-operator-2-0 8 points 9 hours ago Why is this post categorized as NSFW? Are the content moderators and admins here secretly against babies? permalink award report block reply MawdT20 OP 8 points 9 hours ago That was me. I figured I'd make it optional if people wanted to open the pic cuz... I'd just woken up when I made the post and was a little morning-retarded yet. Lol permalink parent award report block reply NeutronDon1 8 points 9 hours ago Congratulations!! happy to see some kind of happy news every once in a while on this website. permalink award report block reply Side_o_beef_curtains 7 points 9 hours ago OP, we went through a very similar ordeal before my youngest was conceived. Congratulations. God bless your family. permalink award report block reply HumphreyPlowjogger 7 points 9 hours ago Awesome. permalink award report block reply tt777 7 points 10 hours ago Congratulations permalink award report block reply just2groovy 7 points 9 hours ago Congratulations! permalink award report block reply T471 7 points 9 hours ago Congrats! permalink award report block reply mlp67 7 points 10 hours ago Such wonderful news! God Bless all of you! permalink award report block reply Lockbidenup 7 points 9 hours ago Congrats.  Keep the needles away from her! permalink award report block reply icecreamheadache 7 points 9 hours ago Amazing stuff - congrats permalink award report block reply Stlpoolguy 6 points 9 hours ago Woot...woot!!  You are blessed!  Those 3D ultrasounds are amazing aren't they? permalink award report block reply obar1 6 points 8 hours ago take care of her and focus on the diet and food she eats permalink award report block reply MAGALADON9 6 points 9 hours ago At first I didn't see it (don't dv faggots, im.just being honest) then BOOOM I saw, very nice. Cute mouth and nose.  Thing is I was expecting a whole body pic and was thrown that it was a face. Congrats permalink award report block reply TheSwampThang 6 points 9 hours ago Congrats!  Every child is truly a miracle.  Losing a child in pregnancy is beyond brutal.   It's something you never get over. permalink award report block reply Area82 6 points 9 hours ago Congrats.  God is good. permalink award report block reply tholinz 5 points 9 hours ago Congrats! It's amazing isn't it? permalink award report block reply Stickybedel 5 points 6 hours ago Congratulations fellow Patriot! Many blessings on your budding family. permalink award report block reply Godan 5 points 6 hours ago It's an awesome moment. Being a parent is both fun and challenging. You'll get to relax when they're grown up. permalink award report block reply God-is-good 5 points 8 hours ago Amen!  In the words of Hannah when God granted her request for a child 1 Samuel 2:1-2 (KJV) 1 And Hannah prayed, and said, My heart rejoiceth in the LORD, mine horn is exalted in the LORD: my mouth is enlarged over mine enemies; because I rejoice in thy salvation. 2 [There is] none holy as the LORD: for [there is] none beside thee: neither [is there] any rock like our God. What a beautiful treasure to be blessed with. May we all continue to thank God daily for the opportunity to be parents. I pray you are able to enjoy your new destiny to its fullest! God continue to bless you all. permalink award report block reply Gildoom 5 points 5 hours ago Praise God permalink award report block reply I_Love_45-70_Gov 5 points 9 hours ago Beautiful, Pede. 😀 permalink award report block reply Briankitis 5 points 6 hours ago Tell her to take a baby aspirin a day to help prevent miscarriages due to blood clots. My wife had a problem with this and since she took one that last two births we had no issues with having another miscarriage. Our doctor recommended it after her second miscarriage. permalink award report block reply entwickelnden 5 points 9 hours ago God is great! Congratulations fren! permalink award report block reply barwhack 5 points 9 hours ago She's lovely. Be brave. permalink award report block reply clownworld30330 5 points 5 hours ago God is very good! permalink award report block reply Karpus 5 points 6 hours ago Congratulations!  You’re going to love being a parent. My wife and I were having fertility issues, and we had almost given up before deciding to seek fertility treatment. Today, our beautiful baby boy is just over 4 months old.  The joy we feel each day is indescribable. Best wishes for you both! If you’re on PDW then I have no doubt you will be wonderful parents. permalink award report block reply Beelzy 5 points 6 hours ago She looks just like you. Lol...Congrats to both of you! permalink award report block reply MawdT20 OP 4 points 6 hours ago My nose for sure, and possibly eyes. That's 100% her mother's mouth, though! XD permalink parent award report block reply MAGA 4 points 9 hours ago congrats pede, hope mama and baby are doing well! permalink award report block reply MrBobNJ 4 points 9 hours ago Congrats! It only gets better from here. Nothing makes your world seem both bigger and smaller than you, at the same time, then the first time you get to hold them. permalink award report block reply WhoMeTwo 4 points 6 hours ago Sending prayers to you and yours, fren! Congratulations! permalink award report block reply Italianshamrock 3 points 7 hours ago So happy for you. permalink award report block reply Wtfbombs 3 points 8 hours ago Congrats! permalink award report block reply MJ_43 3 points 5 hours ago Thats beautiful brother, gets me right in the feels, congratulations, god has blessed you! permalink award report block reply DJTXLV 3 points 8 hours ago Congrats!!! permalink award report block reply Icanbememe 3 points 8 hours ago beautiful!! permalink award report block reply GarbageLivesMatter 3 points 6 hours ago Congrats fren. permalink award report block reply BigMikesChef 3 points 7 hours ago Very happy for you! A daughter is an unbelievably wonderful blessing! permalink award report block reply Megabrain1960 3 points 9 hours ago Jesus loves Him some little ones! permalink award report block reply very_presidential 3 points 8 hours ago Congratulations!! So happy for you guys! We went through that as well, 3 years of heartbreak trying after miscarriage. Now we have 3 more! God is good! permalink award report block reply Emodius 3 points 8 hours ago Cool who's the dad? Jk Congratulations! That is absolutely awesome God bless permalink award report block reply Klaus73 3 points 7 hours ago Grats - did government IVF support ever happen btw now that I think of it? permalink award report block reply MawdT20 OP 2 points 7 hours ago I have no idea tbh. We never got that far, just eventually lucked out with fertility boosters & timing. permalink parent award report block reply Klaus73 3 points 6 hours ago GRATs friend - as a father of 2 boys I welcome you into the fold; nothing quite like realizing when you first hold your newborn that the future is literally in your hands. permalink parent award report block reply clarise 3 points 8 hours ago Congratulations! 🎉 permalink award report block reply Genji_Sama 3 points 8 hours ago Public service announcement: Polyester underwear reduces male fertility (it's just temporary). Well backed research shows this. In one study, after 180 days of tight polyester underwear, 100% of mean were completely infertile. They all eventually returned to normal but it took a year and a half for some participants. permalink award report block reply DrVSGGEOTUSPhD 3 points 8 hours ago Congratulations its a sea horse! permalink award report block reply RickSanchezC137 3 points 5 hours ago Congratulations to you both! permalink award report block reply ChrisSuperDude 3 points 7 hours ago You’re going to love fatherhood my friend. Congrats permalink award report block reply Bullet3250 3 points 9 hours ago This is why Life is so precious. And there is never a guarantee.... permalink award report block reply RoosterRaiser 3 points 8 hours ago The warmest love and congratulations to the two of you. She is beautiful! permalink award report block reply rivetjoint2 3 points 9 hours ago So cool.  Like little angel. permalink award report block reply herrickb 3 points 7 hours ago She will change you, for the better....congrats permalink award report block reply Conspiracytheorist 3 points 9 hours ago Congratulations 🎊 permalink award report block reply MacGordon 3 points 5 hours ago Grats man. The more I watch and read, especially Gary Brecka, the more I'm seeing a correlation with woman having fertility issues along side dietary issues, and it's usually an absences of ruminant meat consumption. Just keep feeding her steak & burger patties, lol. Enjoy parenthood. It's amazing. permalink award report block reply IAmNotAnAutist 3 points 8 hours ago That's awesome.  You juust always be the BEST PARENT YOU CAN. permalink award report block reply MawdT20 OP 3 points 8 hours ago I'm gonna try! I told my wife the only thing that worries me is if I'll be a competent parent. She goes, \"The fact that you care so much that it worries you means you'll do great.\" 🤞 permalink parent award report block reply f_bastiat 3 points 7 hours ago Breed until you can breed no more permalink award report block reply CaptRedbeard 3 points 9 hours ago Awesome! permalink award report block reply SpellingContable 3 points 6 hours ago That's 2 miracles in one. 1, Your baby. Congratulations. 2, An ultrasound I can actually decipher the picture. Congratulations to the ultrasound technician. permalink award report block reply Hikedelics 3 points 8 hours ago My son is just about to turn two. Being a dad is the most incredible thing, in ways I could have never imagined before hand. Congrats, buddy!!! permalink award report block reply trumpdagoat 3 points 7 hours ago Congrats, fren. permalink award report block reply TheFountainhead 3 points 5 hours ago Dude! God is Good! permalink award report block reply Gregor85 3 points 5 hours ago God is good brother. Being a husband and dad are the last two things on my bucket list. At 40 I feel my time is ticking but I’m keeping hope. So happy for you and your wife and God Bless! permalink award report block reply Smurfection 3 points 7 hours ago Congratulations! permalink award report block reply RU_joe_king 3 points 6 hours ago Romans 8:28....We know that all things work together for the good of those who love God: those who are called according to His purpose. permalink award report block reply Quesowaffen 2 points 8 hours ago God bless pede! permalink award report block reply Eddie_LeBec 2 points 4 hours ago How are these pics not shown in court to end abortion.\nThis is science I knew you before you were born permalink award report block reply KiekhaeferSoldier 2 points 7 hours ago Advice so good, I'm posting it twice! Buy this book!!! Best thing ever, written like an old Boy Scout Handbook and I loved it! https://www.amazon.com/Be-Prepared-Gary-Greenberg/dp/0743251547 permalink award report block reply JohnN 2 points 2 hours ago Magnificent! Congrats! permalink award report block reply Pederella 2 points 3 hours ago Jeremiah 1:5 Psalm 139: 13-16 permalink award report block reply Pelosi_Halitosis 2 points 9 hours ago Congratulations! Those ultrasound pictures are weird. I still have ours tucked away. Hopefully, they haven't \"developed\" more over the years and turned into black paper sheets. Our first was a boy, and I never saw proof of that in the ultrasound images. However, our daughter was instantly identified. My wife and the nurse were like, oh, it's a girl. I struggled at first, then embarrassed, I said. Oh, I see it now. Plain as day, it was as if she had and OF page in the womb. permalink award report block reply MawdT20 OP 3 points 9 hours ago I had a similar experience at the anatomy scan. The ultrasound tech goes, \"I'm calling it, it's a girl! See the 3 lines?\" I was struggling to make anything out at that appt. and I was like, \"Yeah, yeah... Uh, and those would be...?\" My wife and the tech gave each other a bemused look and the tech finally answers, \"Her labia.\" permalink parent award report block reply CALI_MAGA_MAMA 1 points 19 minutes ago God bless!! ❤️ permalink award report block reply MAGAnificent700 1 points 2 hours ago What a sweet face!!  ❤️. Congratulations! We struggled with fertility and now have two. It is a roller coaster of emotion. Praying to overcome one last hurdle for a third.  We will see if it’s in the cards. permalink award report block reply Tomboy_Patriot 1 points 2 hours ago HEY-O! Congrats! permalink award report block reply brimshae 1 points 53 minutes ago Buy some salad tongs and keep them exclusively in the bathroom. You'll know when you need 'em. Hint: It beats fishing out toys and important items by hand. permalink award report block reply LePEDES 1 points 1 hour ago He sure is great! We just had our twin girls a few months back after 7 miscarriages. permalink award report block reply KeenanV71 1 points 48 minutes ago Congratulations! Did you pick out a name yet? permalink award report block reply AlmostFullyDilated -1 points 7 hours ago don't count your chickens until they hatch permalink award report block reply SHILL_DETECTOR -8 points 10 hours ago what is that permalink award report block reply MawdT20 OP 12 points 10 hours ago A side profile of her face. The black hole in the center is her eye. Dark gray spot of that to the left is her nose, lips below that, etc. permalink parent award report block reply SHILL_DETECTOR -6 points 10 hours ago oh shit i see it now looks like a gnome permalink parent award report block reply LauraCoomer 11 points 10 hours ago Ultrasound permalink parent award report block reply x79q3pb 9 points 10 hours ago Come on you aren't that retarded. permalink parent award report block reply SHILL_DETECTOR -3 points 10 hours ago picture isnt very clear permalink parent award report block reply x79q3pb 8 points 10 hours ago Get some glasses or something, the face is clear enough. permalink parent award report block reply SHILL_DETECTOR -4 points 10 hours ago looked like a dust bunny permalink parent award report block reply view 2 more comments...\nRuprechtThaMonkeyBoy 46 points 10 hours ago Congrats! permalink award report block reply memeYourDreams 10 points 4 hours ago And DO NOT for the love of god, VACCINATE mother nor child! permalink parent award report block reply\nmemeYourDreams 10 points 4 hours ago And DO NOT for the love of god, VACCINATE mother nor child! permalink parent award report block reply\nSnowSnake 39 points 10 hours ago Very cool! Our son will be 6 in February. I still have his first sonogram image as my cellphone background wallpaper. He was the size of a grape at the time. Fascinating. You can see thru them, their spine and heart beating.. truly a miracle of God. The real fun begins moments after delivery. You will never be the same again. Bless God 🙌 permalink award report block reply\nGrindelwald 37 points 10 hours ago Congrats.\nMy mother had her first child. Then three miscarriages.   Doctor  says she’ll never conceive again.  Then she had eight more children. permalink award report block reply\nancroidubh 30 points 10 hours ago Welcome to the most difficult yet most rewarding job of your lifetime. May God bless you all. permalink award report block reply KeenanV71 2 points 51 minutes ago It's the most stressful, unappreciated, job ever. I wouldn't trade a single second of it for anything. permalink parent award report block reply\nKeenanV71 2 points 51 minutes ago It's the most stressful, unappreciated, job ever. I wouldn't trade a single second of it for anything. permalink parent award report block reply\nJtBlaze 24 points 10 hours ago Priceless. permalink award report block reply\nGA_Logic 23 points 10 hours ago Congratulations! permalink award report block reply\nE-dantes 20 points 10 hours ago Amen, fren. God is good. May you be blessed with sleepless nights and baby giggles, great memories, and a lifetime of love to give to that child! The struggle is so worth it every time my kids look at me and smile, whether they've challenged themselves in completing a task, or when they goof up. Every smile makes every days struggle worth it. permalink award report block reply\nKiekhaeferSoldier 16 points 8 hours ago Wife & I married late... (35yrs old) and while \"waiting until we could afford kids\" my 20yr old nephew fathered his third child with a third mother.  We decidd then that we needed children to offset the damage my nephew was doing.  After third miscarriage, her OB said, \"Keep trying.  This is just God's way of sorting out the good eggs\".  Our daughter is now 21, brilliant, 4.0+ in Junior year to become a doctor.  She is KILLIN' it.  She walked on 1st birthday, could sing National Anthem at 18 months, speaks perfect, proper english (never spoke baby talk to her), converses perfectly with other adults, scoffs at peer pressure and is a great driver! (can change a flat, too!).\nRead to your daughter!  Enjoy silly cat videos with her.  Point out lunatics in public so she recognizes them.  Don't ever be vulgar around her, or your wife.  Drop what you're doing and welcome her when she arrives home or even enters a room. Oh, and teach her sign language!  We started before 6months old and it completely eliminated \"The terrible two's\" because she could sign WAY BEFORE she could speak. permalink award report block reply MawdT20 OP 9 points 8 hours ago Reading to the baby is #1 on my activities list to do with her! We've already started adding books to the shelves in the nursery. permalink parent award report block reply KiekhaeferSoldier 9 points 7 hours ago Go to thrift stores (goodwill, salvation army, etc...) and buy up all the OLD (pre-1980's) \"Little Golden Book\" series.  They have all the best nursery rhymes, stories and wholesome content and can be passed down to your future grandchildren!!\nAlso, right NOW, buy this book!!!  Best thing ever, written like an old Boy Scout Handbook and I loved it! https://www.amazon.com/Be-Prepared-Gary-Greenberg/dp/0743251547 permalink parent award report block reply\nMawdT20 OP 9 points 8 hours ago Reading to the baby is #1 on my activities list to do with her! We've already started adding books to the shelves in the nursery. permalink parent award report block reply KiekhaeferSoldier 9 points 7 hours ago Go to thrift stores (goodwill, salvation army, etc...) and buy up all the OLD (pre-1980's) \"Little Golden Book\" series.  They have all the best nursery rhymes, stories and wholesome content and can be passed down to your future grandchildren!!\nAlso, right NOW, buy this book!!!  Best thing ever, written like an old Boy Scout Handbook and I loved it! https://www.amazon.com/Be-Prepared-Gary-Greenberg/dp/0743251547 permalink parent award report block reply\nKiekhaeferSoldier 9 points 7 hours ago Go to thrift stores (goodwill, salvation army, etc...) and buy up all the OLD (pre-1980's) \"Little Golden Book\" series.  They have all the best nursery rhymes, stories and wholesome content and can be passed down to your future grandchildren!!\nAlso, right NOW, buy this book!!!  Best thing ever, written like an old Boy Scout Handbook and I loved it! https://www.amazon.com/Be-Prepared-Gary-Greenberg/dp/0743251547 permalink parent award report block reply\nKarma 13 points 9 hours ago She looks beautiful! permalink award report block reply\nSisterCovfefeToo 12 points 10 hours ago Congratulations! permalink award report block reply\nFundadores 10 points 9 hours ago I can’t know God’s thought process, but for those of us who struggled to conceive, I imagine it’s His way of cementing it in our minds that “you wanted this” which is helpful when things get difficult. You’ll have so much joy, and no help needed during those times, but you’ll also have challenges. Never forget how much you wanted it and how God honored that and blessed you with the responsibility. You can also be proud of yourself and your wife for having the courage to keep trying. That’s a rough season. Thanks for sharing! She has an adorable, sweet little face. permalink award report block reply\nCopen45 10 points 10 hours ago that is awesome... congratulations brother permalink award report block reply\nSeatacjoe 10 points 9 hours ago Oh brother, praying for you and your wife permalink award report block reply\nBaldeagle8 10 points 8 hours ago So happy for you! My wife and I just had our beautiful  healthly daughter born on October 14th. We had years of miscarriages and a newborn loss, (our son had down syndrome and had a lot of health issues). Before our first ultrasound at 6 weeks, I prayed to God and he told me \"this is the one\". I don't fully understand why we have to go through all the hardships, but now holding my daughter I can say it was all worth it. God bless you and your family! permalink award report block reply\nCaptainN 9 points 9 hours ago Congrats! The wife and I have been trying, without success, for awhile now. So, we're praying for a similar outcome for ourselves. permalink award report block reply MawdT20 OP 8 points 9 hours ago 🙏 Nothing is impossible for God! permalink parent award report block reply\nMawdT20 OP 8 points 9 hours ago 🙏 Nothing is impossible for God! permalink parent award report block reply\nglow-operator-2-0 8 points 9 hours ago Why is this post categorized as NSFW? Are the content moderators and admins here secretly against babies? permalink award report block reply MawdT20 OP 8 points 9 hours ago That was me. I figured I'd make it optional if people wanted to open the pic cuz... I'd just woken up when I made the post and was a little morning-retarded yet. Lol permalink parent award report block reply\nMawdT20 OP 8 points 9 hours ago That was me. I figured I'd make it optional if people wanted to open the pic cuz... I'd just woken up when I made the post and was a little morning-retarded yet. Lol permalink parent award report block reply\nNeutronDon1 8 points 9 hours ago Congratulations!! happy to see some kind of happy news every once in a while on this website. permalink award report block reply\nSide_o_beef_curtains 7 points 9 hours ago OP, we went through a very similar ordeal before my youngest was conceived. Congratulations. God bless your family. permalink award report block reply\nHumphreyPlowjogger 7 points 9 hours ago Awesome. permalink award report block reply\ntt777 7 points 10 hours ago Congratulations permalink award report block reply\njust2groovy 7 points 9 hours ago Congratulations! permalink award report block reply\nT471 7 points 9 hours ago Congrats! permalink award report block reply\nmlp67 7 points 10 hours ago Such wonderful news! God Bless all of you! permalink award report block reply\nLockbidenup 7 points 9 hours ago Congrats.  Keep the needles away from her! permalink award report block reply\nicecreamheadache 7 points 9 hours ago Amazing stuff - congrats permalink award report block reply\nStlpoolguy 6 points 9 hours ago Woot...woot!!  You are blessed!  Those 3D ultrasounds are amazing aren't they? permalink award report block reply\nobar1 6 points 8 hours ago take care of her and focus on the diet and food she eats permalink award report block reply\nMAGALADON9 6 points 9 hours ago At first I didn't see it (don't dv faggots, im.just being honest) then BOOOM I saw, very nice. Cute mouth and nose.  Thing is I was expecting a whole body pic and was thrown that it was a face. Congrats permalink award report block reply\nTheSwampThang 6 points 9 hours ago Congrats!  Every child is truly a miracle.  Losing a child in pregnancy is beyond brutal.   It's something you never get over. permalink award report block reply\nArea82 6 points 9 hours ago Congrats.  God is good. permalink award report block reply\ntholinz 5 points 9 hours ago Congrats! It's amazing isn't it? permalink award report block reply\nStickybedel 5 points 6 hours ago Congratulations fellow Patriot! Many blessings on your budding family. permalink award report block reply\nGodan 5 points 6 hours ago It's an awesome moment. Being a parent is both fun and challenging. You'll get to relax when they're grown up. permalink award report block reply\nGod-is-good 5 points 8 hours ago Amen!  In the words of Hannah when God granted her request for a child 1 Samuel 2:1-2 (KJV) 1 And Hannah prayed, and said, My heart rejoiceth in the LORD, mine horn is exalted in the LORD: my mouth is enlarged over mine enemies; because I rejoice in thy salvation. 2 [There is] none holy as the LORD: for [there is] none beside thee: neither [is there] any rock like our God. What a beautiful treasure to be blessed with. May we all continue to thank God daily for the opportunity to be parents. I pray you are able to enjoy your new destiny to its fullest! God continue to bless you all. permalink award report block reply\nGildoom 5 points 5 hours ago Praise God permalink award report block reply\nI_Love_45-70_Gov 5 points 9 hours ago Beautiful, Pede. 😀 permalink award report block reply\nBriankitis 5 points 6 hours ago Tell her to take a baby aspirin a day to help prevent miscarriages due to blood clots. My wife had a problem with this and since she took one that last two births we had no issues with having another miscarriage. Our doctor recommended it after her second miscarriage. permalink award report block reply\nentwickelnden 5 points 9 hours ago God is great! Congratulations fren! permalink award report block reply\nbarwhack 5 points 9 hours ago She's lovely. Be brave. permalink award report block reply\nclownworld30330 5 points 5 hours ago God is very good! permalink award report block reply\nKarpus 5 points 6 hours ago Congratulations!  You’re going to love being a parent. My wife and I were having fertility issues, and we had almost given up before deciding to seek fertility treatment. Today, our beautiful baby boy is just over 4 months old.  The joy we feel each day is indescribable. Best wishes for you both! If you’re on PDW then I have no doubt you will be wonderful parents. permalink award report block reply\nBeelzy 5 points 6 hours ago She looks just like you. Lol...Congrats to both of you! permalink award report block reply MawdT20 OP 4 points 6 hours ago My nose for sure, and possibly eyes. That's 100% her mother's mouth, though! XD permalink parent award report block reply\nMawdT20 OP 4 points 6 hours ago My nose for sure, and possibly eyes. That's 100% her mother's mouth, though! XD permalink parent award report block reply\nMAGA 4 points 9 hours ago congrats pede, hope mama and baby are doing well! permalink award report block reply\nMrBobNJ 4 points 9 hours ago Congrats! It only gets better from here. Nothing makes your world seem both bigger and smaller than you, at the same time, then the first time you get to hold them. permalink award report block reply\nWhoMeTwo 4 points 6 hours ago Sending prayers to you and yours, fren! Congratulations! permalink award report block reply\nItalianshamrock 3 points 7 hours ago So happy for you. permalink award report block reply\nWtfbombs 3 points 8 hours ago Congrats! permalink award report block reply\nMJ_43 3 points 5 hours ago Thats beautiful brother, gets me right in the feels, congratulations, god has blessed you! permalink award report block reply\nDJTXLV 3 points 8 hours ago Congrats!!! permalink award report block reply\nIcanbememe 3 points 8 hours ago beautiful!! permalink award report block reply\nGarbageLivesMatter 3 points 6 hours ago Congrats fren. permalink award report block reply\nBigMikesChef 3 points 7 hours ago Very happy for you! A daughter is an unbelievably wonderful blessing! permalink award report block reply\nMegabrain1960 3 points 9 hours ago Jesus loves Him some little ones! permalink award report block reply\nvery_presidential 3 points 8 hours ago Congratulations!! So happy for you guys! We went through that as well, 3 years of heartbreak trying after miscarriage. Now we have 3 more! God is good! permalink award report block reply\nEmodius 3 points 8 hours ago Cool who's the dad? Jk Congratulations! That is absolutely awesome God bless permalink award report block reply\nKlaus73 3 points 7 hours ago Grats - did government IVF support ever happen btw now that I think of it? permalink award report block reply MawdT20 OP 2 points 7 hours ago I have no idea tbh. We never got that far, just eventually lucked out with fertility boosters & timing. permalink parent award report block reply Klaus73 3 points 6 hours ago GRATs friend - as a father of 2 boys I welcome you into the fold; nothing quite like realizing when you first hold your newborn that the future is literally in your hands. permalink parent award report block reply\nMawdT20 OP 2 points 7 hours ago I have no idea tbh. We never got that far, just eventually lucked out with fertility boosters & timing. permalink parent award report block reply Klaus73 3 points 6 hours ago GRATs friend - as a father of 2 boys I welcome you into the fold; nothing quite like realizing when you first hold your newborn that the future is literally in your hands. permalink parent award report block reply\nKlaus73 3 points 6 hours ago GRATs friend - as a father of 2 boys I welcome you into the fold; nothing quite like realizing when you first hold your newborn that the future is literally in your hands. permalink parent award report block reply\nclarise 3 points 8 hours ago Congratulations! 🎉 permalink award report block reply\nGenji_Sama 3 points 8 hours ago Public service announcement: Polyester underwear reduces male fertility (it's just temporary). Well backed research shows this. In one study, after 180 days of tight polyester underwear, 100% of mean were completely infertile. They all eventually returned to normal but it took a year and a half for some participants. permalink award report block reply\nDrVSGGEOTUSPhD 3 points 8 hours ago Congratulations its a sea horse! permalink award report block reply\nRickSanchezC137 3 points 5 hours ago Congratulations to you both! permalink award report block reply\nChrisSuperDude 3 points 7 hours ago You’re going to love fatherhood my friend. Congrats permalink award report block reply\nBullet3250 3 points 9 hours ago This is why Life is so precious. And there is never a guarantee.... permalink award report block reply\nRoosterRaiser 3 points 8 hours ago The warmest love and congratulations to the two of you. She is beautiful! permalink award report block reply\nrivetjoint2 3 points 9 hours ago So cool.  Like little angel. permalink award report block reply\nherrickb 3 points 7 hours ago She will change you, for the better....congrats permalink award report block reply\nConspiracytheorist 3 points 9 hours ago Congratulations 🎊 permalink award report block reply\nMacGordon 3 points 5 hours ago Grats man. The more I watch and read, especially Gary Brecka, the more I'm seeing a correlation with woman having fertility issues along side dietary issues, and it's usually an absences of ruminant meat consumption. Just keep feeding her steak & burger patties, lol. Enjoy parenthood. It's amazing. permalink award report block reply\nIAmNotAnAutist 3 points 8 hours ago That's awesome.  You juust always be the BEST PARENT YOU CAN. permalink award report block reply MawdT20 OP 3 points 8 hours ago I'm gonna try! I told my wife the only thing that worries me is if I'll be a competent parent. She goes, \"The fact that you care so much that it worries you means you'll do great.\" 🤞 permalink parent award report block reply\nMawdT20 OP 3 points 8 hours ago I'm gonna try! I told my wife the only thing that worries me is if I'll be a competent parent. She goes, \"The fact that you care so much that it worries you means you'll do great.\" 🤞 permalink parent award report block reply\nf_bastiat 3 points 7 hours ago Breed until you can breed no more permalink award report block reply\nCaptRedbeard 3 points 9 hours ago Awesome! permalink award report block reply\nSpellingContable 3 points 6 hours ago That's 2 miracles in one. 1, Your baby. Congratulations. 2, An ultrasound I can actually decipher the picture. Congratulations to the ultrasound technician. permalink award report block reply\nHikedelics 3 points 8 hours ago My son is just about to turn two. Being a dad is the most incredible thing, in ways I could have never imagined before hand. Congrats, buddy!!! permalink award report block reply\ntrumpdagoat 3 points 7 hours ago Congrats, fren. permalink award report block reply\nTheFountainhead 3 points 5 hours ago Dude! God is Good! permalink award report block reply\nGregor85 3 points 5 hours ago God is good brother. Being a husband and dad are the last two things on my bucket list. At 40 I feel my time is ticking but I’m keeping hope. So happy for you and your wife and God Bless! permalink award report block reply\nSmurfection 3 points 7 hours ago Congratulations! permalink award report block reply\nRU_joe_king 3 points 6 hours ago Romans 8:28....We know that all things work together for the good of those who love God: those who are called according to His purpose. permalink award report block reply\nQuesowaffen 2 points 8 hours ago God bless pede! permalink award report block reply\nEddie_LeBec 2 points 4 hours ago How are these pics not shown in court to end abortion.\nThis is science I knew you before you were born permalink award report block reply\nKiekhaeferSoldier 2 points 7 hours ago Advice so good, I'm posting it twice! Buy this book!!! Best thing ever, written like an old Boy Scout Handbook and I loved it! https://www.amazon.com/Be-Prepared-Gary-Greenberg/dp/0743251547 permalink award report block reply\nJohnN 2 points 2 hours ago Magnificent! Congrats! permalink award report block reply\nPederella 2 points 3 hours ago Jeremiah 1:5 Psalm 139: 13-16 permalink award report block reply\nPelosi_Halitosis 2 points 9 hours ago Congratulations! Those ultrasound pictures are weird. I still have ours tucked away. Hopefully, they haven't \"developed\" more over the years and turned into black paper sheets. Our first was a boy, and I never saw proof of that in the ultrasound images. However, our daughter was instantly identified. My wife and the nurse were like, oh, it's a girl. I struggled at first, then embarrassed, I said. Oh, I see it now. Plain as day, it was as if she had and OF page in the womb. permalink award report block reply MawdT20 OP 3 points 9 hours ago I had a similar experience at the anatomy scan. The ultrasound tech goes, \"I'm calling it, it's a girl! See the 3 lines?\" I was struggling to make anything out at that appt. and I was like, \"Yeah, yeah... Uh, and those would be...?\" My wife and the tech gave each other a bemused look and the tech finally answers, \"Her labia.\" permalink parent award report block reply\nMawdT20 OP 3 points 9 hours ago I had a similar experience at the anatomy scan. The ultrasound tech goes, \"I'm calling it, it's a girl! See the 3 lines?\" I was struggling to make anything out at that appt. and I was like, \"Yeah, yeah... Uh, and those would be...?\" My wife and the tech gave each other a bemused look and the tech finally answers, \"Her labia.\" permalink parent award report block reply\nCALI_MAGA_MAMA 1 points 19 minutes ago God bless!! ❤️ permalink award report block reply\nMAGAnificent700 1 points 2 hours ago What a sweet face!!  ❤️. Congratulations! We struggled with fertility and now have two. It is a roller coaster of emotion. Praying to overcome one last hurdle for a third.  We will see if it’s in the cards. permalink award report block reply\nTomboy_Patriot 1 points 2 hours ago HEY-O! Congrats! permalink award report block reply\nbrimshae 1 points 53 minutes ago Buy some salad tongs and keep them exclusively in the bathroom. You'll know when you need 'em. Hint: It beats fishing out toys and important items by hand. permalink award report block reply\nLePEDES 1 points 1 hour ago He sure is great! We just had our twin girls a few months back after 7 miscarriages. permalink award report block reply\nKeenanV71 1 points 48 minutes ago Congratulations! Did you pick out a name yet? permalink award report block reply\nAlmostFullyDilated -1 points 7 hours ago don't count your chickens until they hatch permalink award report block reply\nSHILL_DETECTOR -8 points 10 hours ago what is that permalink award report block reply MawdT20 OP 12 points 10 hours ago A side profile of her face. The black hole in the center is her eye. Dark gray spot of that to the left is her nose, lips below that, etc. permalink parent award report block reply SHILL_DETECTOR -6 points 10 hours ago oh shit i see it now looks like a gnome permalink parent award report block reply LauraCoomer 11 points 10 hours ago Ultrasound permalink parent award report block reply x79q3pb 9 points 10 hours ago Come on you aren't that retarded. permalink parent award report block reply SHILL_DETECTOR -3 points 10 hours ago picture isnt very clear permalink parent award report block reply x79q3pb 8 points 10 hours ago Get some glasses or something, the face is clear enough. permalink parent award report block reply SHILL_DETECTOR -4 points 10 hours ago looked like a dust bunny permalink parent award report block reply view 2 more comments...\nMawdT20 OP 12 points 10 hours ago A side profile of her face. The black hole in the center is her eye. Dark gray spot of that to the left is her nose, lips below that, etc. permalink parent award report block reply SHILL_DETECTOR -6 points 10 hours ago oh shit i see it now looks like a gnome permalink parent award report block reply\nSHILL_DETECTOR -6 points 10 hours ago oh shit i see it now looks like a gnome permalink parent award report block reply\nLauraCoomer 11 points 10 hours ago Ultrasound permalink parent award report block reply\nx79q3pb 9 points 10 hours ago Come on you aren't that retarded. permalink parent award report block reply SHILL_DETECTOR -3 points 10 hours ago picture isnt very clear permalink parent award report block reply x79q3pb 8 points 10 hours ago Get some glasses or something, the face is clear enough. permalink parent award report block reply SHILL_DETECTOR -4 points 10 hours ago looked like a dust bunny permalink parent award report block reply view 2 more comments...\nSHILL_DETECTOR -3 points 10 hours ago picture isnt very clear permalink parent award report block reply x79q3pb 8 points 10 hours ago Get some glasses or something, the face is clear enough. permalink parent award report block reply SHILL_DETECTOR -4 points 10 hours ago looked like a dust bunny permalink parent award report block reply view 2 more comments...\nx79q3pb 8 points 10 hours ago Get some glasses or something, the face is clear enough. permalink parent award report block reply SHILL_DETECTOR -4 points 10 hours ago looked like a dust bunny permalink parent award report block reply view 2 more comments...\nSHILL_DETECTOR -4 points 10 hours ago looked like a dust bunny permalink parent award report block reply view 2 more comments..."}