{"id": "1ARK56j0YX", "contents": "946 Justice Ketanji Brown Jackson issued the order for an administrative stay, approving Trump's emergency appeal to withhold full funding of SNAP food aid payments amid a shutdown. posted 5 days ago by hocuspocusfocusjeep 108 comments award share download report block\n108 comments Sort by Top Top New Worst Old Save TooTrue-translation 95 points 5 days ago Remember how she thought the dude was talking about Abraham Lincoln yesterday? Peperidge Farm remembers! permalink award report block reply lefty295 67 points 5 days ago She didn’t make this decision. She is assigned the 1st circuit. All requests go though her, but she HAS TO refer them to the full court, who all vote on a stay like this. She likely voted against this stay, but she can’t make this decision on her own. permalink parent award report block reply DrVSGGEOTUSPhD 45 points 5 days ago Writing this Must have been....most unpleasant for her Edit i meant because she wants to be giving out free stuff not because writing is hard permalink parent award report block reply AussieTrumpFan 18 points 5 days ago Could be AI.  Has anyone checked for em-dash appearance? permalink parent award report block reply TooStoopid 8 points 5 days ago Wait, is the use of the em-dash an Ai sign? If so,\n... Dammit, I loved using it, it was that kinda fun secret no one rly uses. permalink parent award report block reply view 11 more comments... YT45 3 points 5 days ago In her case it would be artificial stupidity. permalink parent award report block reply view 1 more comments... MastaJoda 3 points 4 days ago Nah, shes just helping her Dem colleagues create distress for D voters ahead of the midterms to remind how evil Rs are and how Ds are their saviors. Retarded D voters will never even know Jumanji let Trump cut off their SNAP. This shit is so obvious by now. The Rs will lose the midterms because R voters wont be supporting israel's stooges anymore and Ds get to rile up their base by starving them a bit while blaming Rs. The Rs will help starve and motivate D voters. The Rs and Ds are working together to make this a reality. Trump is just being led around by his massive ego by the Rs. permalink parent award report block reply JerryNadlerBeltFund 1 points 4 days ago But, also because writing is hard. permalink parent award report block reply doodaddy 1 points 4 days ago good point!  but we're way past communists abiding by any rules, absolute rules or not, on the federal stage or not. permalink parent award report block reply Bearing51 22 points 5 days ago Want to bet she doesn't remember though? permalink parent award report block reply Konsaki 29 points 5 days ago She doesn't understand. permalink parent award report block reply Bearing51 20 points 5 days ago But I did eat breakfast. permalink parent award report block reply congruent 7 points 5 days ago I know that one :) permalink parent award report block reply tree_sloth4 7 points 5 days ago chirp permalink parent award report block reply MasterChief08 6 points 5 days ago She can't even spell Abraham by hand. permalink parent award report block reply Agenda47 4 points 5 days ago It's ok, ChatGPT spells it for her. permalink parent award report block reply NomadicKrow2 2 points 5 days ago Woah woah woah. What? permalink parent award report block reply realPixelDust 2 points 5 days ago Pepe’s Farmers remember* permalink parent award report block reply SERP-SERP 2 points 5 days ago Oooooo I member ! permalink parent award report block reply load 3 more comments... AllisterTwo 64 points 5 days ago This is such a simple judicial ruling even the retard understands that Congress controls the purse and an inferior court judge with TDS that failed grade school civics, can't demand the President do something unconstitutional... permalink award report block reply SalteenCracker 39 points 5 days ago There's no way she understands that. Maybe her clerks are tired of being laughed at, but I suspect the Dems want SNAP suspended for their narrative. permalink parent award report block reply fskfsk 15 points 5 days ago Most likely this.  Even for a competent judge, most of the work is done by the clerks. permalink parent award report block reply moscowjade 5 points 5 days ago As a county clerk, can confirm. permalink parent award report block reply Zelda 1 points 5 days ago Are you bombarded with the county clerk video from TikTok? Because that’s totally my county clerk . permalink parent award report block reply NomadicKrow2 5 points 5 days ago Resume: \"Worked as legal clerk for Ketanji Brown Jackson.\" Resume goes in garbage. permalink parent award report block reply IncredibleMrE1 4 points 5 days ago This is it. permalink parent award report block reply fightfightfightx 1 points 5 days ago yes, its all narrative Trump needs to go all in, or not. This half assed approach is just making ppl mad but for no real benefit. permalink parent award report block reply lefty295 1 points 5 days ago She didn’t make this decision. She is assigned the 2nd circuit. So it’s under her name. But the the full SOCTUS votes on stays like this. Edit: she’s assigned the 1st circuit, which Rhode Island is under, I put the wrong one. permalink parent award report block reply SalteenCracker 2 points 5 days ago Thank you, kind sir. permalink parent award report block reply AllisterTwo 1 points 4 days ago Only in rare instances does the full court vote on emergency stays initially, it's almost always the purview of the single justice  assigned to the circuit...  There is nothing that suggest or indicates the full court voted on this one... Even Left Wing propaganda sites like Politico agree... https://www.politico.com/news/2025/11/07/ketanji-brown-jackson-supreme-court-snap-benefits-ruling-00643639 The administration’s emergency appeal was routed to Jackson because she is assigned to oversee urgent matters arising from the 1st Circuit. She will likely refer the issue to the full court at some juncture, but her order Friday gave no indication she has yet done so. permalink parent award report block reply load 1 more comments... yukondave 2 points 5 days ago No she is a commie.  She wants to give the next COmmie leader the power to control food permalink parent award report block reply aaafirefly123 2 points 5 days ago That’s basically what that lower court was doing, And I get the feeling that the SCOTUS is gonna put that lower court in its place VERY soon. It’s one thing to rule in a way that hinders a perfectly legal and constitutional action, but to ACTIVELY try to FORCE the executive branch to violate the constitution… that’s something that is unprecedented. permalink parent award report block reply snoopy3210 1 points 4 days ago It was a trap. Trump’s lawyers, probably on the order of Todd Blanche, want him to lose the midterms with this. Todd Blanche is s crook who brought a fake top secret war plan to Mar a lago in 2021 and illegally recorded the President! permalink parent award report block reply MAGA_NRG 31 points 5 days ago Did I read that right? permalink award report block reply TrumpAndGodWin 34 points 5 days ago Her masters told her to starve the SNAPricans to kick off their race based civil war while they're trying to crash the stock market and bring in dystopian technocratic neo feudalism? permalink parent award report block reply MasterChief08 28 points 5 days ago The economy is doing rather well for such a massive government shutdown. It's almost as if 70% of the federal government is a waste  and I'm being incredibly generous with that number. permalink parent award report block reply goldkeyboardwarrior 8 points 5 days ago Unless you’re a federal employee or in the military the shutdown for the most part wasn’t going to affect your average person for the first few weeks. But Dems know that the best way to try and hurt Trump is to affect air travel which is why they’re resisting passing a stand-alone bill paying feds since that would keep TSA and air traffic controllers from calling out en masse. permalink parent award report block reply Agenda47 8 points 5 days ago SNAPricans, proud descendants of the legendary Basketball Americans. permalink parent award report block reply Emodius 6 points 5 days ago Lmao at SNAPricans. So wrong permalink parent award report block reply TrumpAndGodWin 4 points 5 days ago Kek i almost said snaprican Americans but I wanted to include white leftists, Mexicans, etc and fairly spread the blame. permalink parent award report block reply MAGA_NRG 5 points 5 days ago This is food for thought. Makes sense. Ok thanks for the clarification. permalink parent award report block reply Ch3f4554551n 5 points 5 days ago A race-based civil war would be over in days and would favor MAGA. The stock market is due for a massive retrace, and policy won't stop it. permalink parent award report block reply TrumpAndGodWin 3 points 5 days ago It's not the blacks or leftist useful idiots you'd have to worry about in a civil war with the globalists that let in hundreds of thousands of Chinese military,  middle eastern terrorists like Hezbollah, etc and their biological weapons, cyberattacks, etc. permalink parent award report block reply Ch3f4554551n 1 points 5 days ago Oh no! Cyberattacks! Lol where are the Chinese going to land and get slaughtered? Long Beach or Mussel Shoals? permalink parent award report block reply view 3 more comments... lefty295 6 points 5 days ago No, she is assigned the 1st circuit, Rhode Island falls under that. The request goes to her, she has to refer it to the full court, and they all vote on stays like this. She likely voted against it. She didn’t make this decision. permalink parent award report block reply killedmytv 19 points 5 days ago The only reason Jumanji (or whoever wrote her homework assignment for her) did this is because she thinks it'll hurt Trump among the welfare class and useful idiots who get all their news from the TV. There's no way she did this because it was the right decision. permalink award report block reply MasterChief08 8 points 5 days ago The welfare class overwhelmingly votes Democrat regardless.  And the ones who don't are typically truly disabled Americans who know this shutdown is 100% on Democrats. permalink parent award report block reply lefty295 5 points 5 days ago She didn’t do this. You’re all wrong about this. She is assigned the 1st circuit. Rhode Island where the district court is, falls under that. She MUST refer all requests to the full SCOTUS, who then vote on the stay. She doesn’t decide this on her own. She has to bring it to the full court. permalink parent award report block reply goldkeyboardwarrior 3 points 5 days ago There are some Dems on social media demanding to know why she did it so that will be interesting. permalink parent award report block reply lefty295 4 points 5 days ago She didn’t, they just don’t understand how stays with SCOTUS work. permalink parent award report block reply zooty 4 points 5 days ago They don't understand much, to be honest. permalink parent award report block reply SanityGumby 2 points 5 days ago That and I suspect it's bad for the supreme court to let a lower court have that much power. She wants that power. permalink parent award report block reply lefty295 15 points 5 days ago That’s not how it works. That’s not her decision. She issues it because she was assigned that circuit. The request goes to her, she MUST refer it to the full court, and they all vote on it. This is not Jackson deciding it should be stayed. This the full SCOTUS voting for a stay, and it’s in her assigned circuit. permalink award report block reply ForceMultiplier 1 points 4 days ago I sure wish that u/hocuspocusfocusjeep would spend 30 seconds to drop the url we all know he has, so I could explore the context. permalink parent award report block reply we_won_the_war_jack 10 points 5 days ago It’s a play then.  They want this. permalink award report block reply JohnN 7 points 5 days ago The Marxists do this with hopeless cases to appear to be \"measured and thoughtful.\" permalink award report block reply DJT_MFers1 6 points 5 days ago With a name like Ketanji it’s only matter of time that she commits robbery homicide permalink award report block reply YodaBannon 5 points 5 days ago show them all the beauty they possess inside. Sesual Chocolate permalink award report block reply Awakened 5 points 5 days ago Lol, when someone tells her what she just did she's gonna be pissed. permalink award report block reply ARMENTO 4 points 5 days ago Reddit about to nuke itself into orbit. permalink award report block reply infinitysupreme 2 points 4 days ago Reddit is a Democrat speech suppression factory which suppresses visibility of  information like this permalink parent award report block reply AbsurdOpinion 3 points 5 days ago The wording here and the article title make it seem like it would be legal for Trump to order the release of the funds - it's not. The funds were allocated by Congress for an \"emergency\", and the democrats stonewalling is not an emergency, it's just idiocy. permalink award report block reply Easzq8 3 points 5 days ago I’m speaking, I’m speaking! permalink award report block reply asiatrails 3 points 5 days ago She probably had it ghostwritten by AI and signed by the indefatigable clerk Otto Pen. But, it is the right decision. permalink award report block reply Choppermagic 3 points 5 days ago CNN will claim she is right wing now haha permalink award report block reply Saltish 3 points 5 days ago A stay to remove the injunction of the appeal to inhibit the administrative order to require the continued withholding.... I need a logic tree to determine the upshot of these rulings. permalink award report block reply womp-womp-twice 2 points 5 days ago Haha, sure Judge Jumanji understood it right away permalink parent award report block reply zooty 3 points 5 days ago Oops. She used the wrong AI prompt. permalink award report block reply Rey_ 2 points 4 days ago He's not withholding anything, snap is not funded and the emergency money is contingent money, grr. permalink award report block reply DeplorableLA 2 points 5 days ago Stunning. permalink award report block reply Emodius 2 points 5 days ago And brave permalink parent award report block reply Shitsbrokeyo 2 points 5 days ago Did AI write it again? permalink award report block reply Tryhardneckbeard 2 points 5 days ago What fuckin world I live in that I wanna applaud a DEI appointment for applying common sense. permalink award report block reply AbrahamLincoln 2 points 4 days ago Jumanji couldn't have written this, it's not retarded enough and doesn't go on any random insane tangents. permalink award report block reply BahamaDon 2 points 5 days ago But she's not a farmer, or a grocer! permalink award report block reply SanityGumby 2 points 5 days ago Broken clock permalink award report block reply Oldman1234 2 points 4 days ago Justice Jumanji B. Jackson thought \"staying\" a lower court order meant keeping it in place. permalink award report block reply knnbccb 1 points 4 days ago Need to check with a biologist first. permalink award report block reply trumpORbust 1 points 4 days ago They needed to give the DEI hire an easy task to offset all the fumbles so far permalink award report block reply BBvarn 1 points 4 days ago Justice Ketanji Brown Jackson wants her SNAP card updated. permalink award report block reply Unboosted 1 points 5 days ago A chat gpt judge? permalink award report block reply Steve56775 1 points 4 days ago All this theater doesn’t matter. The Republicans will cave this week. In which case the blame falls squarely on their shoulders. Double win for the Democrats. permalink award report block reply BobSux 1 points 5 days ago 80% of her family probably receives welfare, so this is surprising. permalink award report block reply Tim_Berframer 1 points 4 days ago She's being blackmailed. She thinks the guy's name is Otto Penn. permalink award report block reply SavingPrivateGrace -1 points 5 days ago This shouldn't be confusing.  There is 5 billion in an emergency fund that could cover 50% of SNAP benefits for November during the shut down.  Withhold the full funding and use it. permalink award report block reply Emodius 7 points 5 days ago He can't. It can't be used for this at all. It's literally against the law. He has no mechanism or power to do it. permalink parent award report block reply SavingPrivateGrace 4 points 5 days ago I didn't see that.  Thank you. permalink parent award report block reply\nTooTrue-translation 95 points 5 days ago Remember how she thought the dude was talking about Abraham Lincoln yesterday? Peperidge Farm remembers! permalink award report block reply lefty295 67 points 5 days ago She didn’t make this decision. She is assigned the 1st circuit. All requests go though her, but she HAS TO refer them to the full court, who all vote on a stay like this. She likely voted against this stay, but she can’t make this decision on her own. permalink parent award report block reply DrVSGGEOTUSPhD 45 points 5 days ago Writing this Must have been....most unpleasant for her Edit i meant because she wants to be giving out free stuff not because writing is hard permalink parent award report block reply AussieTrumpFan 18 points 5 days ago Could be AI.  Has anyone checked for em-dash appearance? permalink parent award report block reply TooStoopid 8 points 5 days ago Wait, is the use of the em-dash an Ai sign? If so,\n... Dammit, I loved using it, it was that kinda fun secret no one rly uses. permalink parent award report block reply view 11 more comments... YT45 3 points 5 days ago In her case it would be artificial stupidity. permalink parent award report block reply view 1 more comments... MastaJoda 3 points 4 days ago Nah, shes just helping her Dem colleagues create distress for D voters ahead of the midterms to remind how evil Rs are and how Ds are their saviors. Retarded D voters will never even know Jumanji let Trump cut off their SNAP. This shit is so obvious by now. The Rs will lose the midterms because R voters wont be supporting israel's stooges anymore and Ds get to rile up their base by starving them a bit while blaming Rs. The Rs will help starve and motivate D voters. The Rs and Ds are working together to make this a reality. Trump is just being led around by his massive ego by the Rs. permalink parent award report block reply JerryNadlerBeltFund 1 points 4 days ago But, also because writing is hard. permalink parent award report block reply doodaddy 1 points 4 days ago good point!  but we're way past communists abiding by any rules, absolute rules or not, on the federal stage or not. permalink parent award report block reply Bearing51 22 points 5 days ago Want to bet she doesn't remember though? permalink parent award report block reply Konsaki 29 points 5 days ago She doesn't understand. permalink parent award report block reply Bearing51 20 points 5 days ago But I did eat breakfast. permalink parent award report block reply congruent 7 points 5 days ago I know that one :) permalink parent award report block reply tree_sloth4 7 points 5 days ago chirp permalink parent award report block reply MasterChief08 6 points 5 days ago She can't even spell Abraham by hand. permalink parent award report block reply Agenda47 4 points 5 days ago It's ok, ChatGPT spells it for her. permalink parent award report block reply NomadicKrow2 2 points 5 days ago Woah woah woah. What? permalink parent award report block reply realPixelDust 2 points 5 days ago Pepe’s Farmers remember* permalink parent award report block reply SERP-SERP 2 points 5 days ago Oooooo I member ! permalink parent award report block reply load 3 more comments...\nlefty295 67 points 5 days ago She didn’t make this decision. She is assigned the 1st circuit. All requests go though her, but she HAS TO refer them to the full court, who all vote on a stay like this. She likely voted against this stay, but she can’t make this decision on her own. permalink parent award report block reply DrVSGGEOTUSPhD 45 points 5 days ago Writing this Must have been....most unpleasant for her Edit i meant because she wants to be giving out free stuff not because writing is hard permalink parent award report block reply AussieTrumpFan 18 points 5 days ago Could be AI.  Has anyone checked for em-dash appearance? permalink parent award report block reply TooStoopid 8 points 5 days ago Wait, is the use of the em-dash an Ai sign? If so,\n... Dammit, I loved using it, it was that kinda fun secret no one rly uses. permalink parent award report block reply view 11 more comments... YT45 3 points 5 days ago In her case it would be artificial stupidity. permalink parent award report block reply view 1 more comments... MastaJoda 3 points 4 days ago Nah, shes just helping her Dem colleagues create distress for D voters ahead of the midterms to remind how evil Rs are and how Ds are their saviors. Retarded D voters will never even know Jumanji let Trump cut off their SNAP. This shit is so obvious by now. The Rs will lose the midterms because R voters wont be supporting israel's stooges anymore and Ds get to rile up their base by starving them a bit while blaming Rs. The Rs will help starve and motivate D voters. The Rs and Ds are working together to make this a reality. Trump is just being led around by his massive ego by the Rs. permalink parent award report block reply JerryNadlerBeltFund 1 points 4 days ago But, also because writing is hard. permalink parent award report block reply doodaddy 1 points 4 days ago good point!  but we're way past communists abiding by any rules, absolute rules or not, on the federal stage or not. permalink parent award report block reply\nDrVSGGEOTUSPhD 45 points 5 days ago Writing this Must have been....most unpleasant for her Edit i meant because she wants to be giving out free stuff not because writing is hard permalink parent award report block reply AussieTrumpFan 18 points 5 days ago Could be AI.  Has anyone checked for em-dash appearance? permalink parent award report block reply TooStoopid 8 points 5 days ago Wait, is the use of the em-dash an Ai sign? If so,\n... Dammit, I loved using it, it was that kinda fun secret no one rly uses. permalink parent award report block reply view 11 more comments... YT45 3 points 5 days ago In her case it would be artificial stupidity. permalink parent award report block reply view 1 more comments... MastaJoda 3 points 4 days ago Nah, shes just helping her Dem colleagues create distress for D voters ahead of the midterms to remind how evil Rs are and how Ds are their saviors. Retarded D voters will never even know Jumanji let Trump cut off their SNAP. This shit is so obvious by now. The Rs will lose the midterms because R voters wont be supporting israel's stooges anymore and Ds get to rile up their base by starving them a bit while blaming Rs. The Rs will help starve and motivate D voters. The Rs and Ds are working together to make this a reality. Trump is just being led around by his massive ego by the Rs. permalink parent award report block reply JerryNadlerBeltFund 1 points 4 days ago But, also because writing is hard. permalink parent award report block reply\nAussieTrumpFan 18 points 5 days ago Could be AI.  Has anyone checked for em-dash appearance? permalink parent award report block reply TooStoopid 8 points 5 days ago Wait, is the use of the em-dash an Ai sign? If so,\n... Dammit, I loved using it, it was that kinda fun secret no one rly uses. permalink parent award report block reply view 11 more comments... YT45 3 points 5 days ago In her case it would be artificial stupidity. permalink parent award report block reply view 1 more comments...\nTooStoopid 8 points 5 days ago Wait, is the use of the em-dash an Ai sign? If so,\n... Dammit, I loved using it, it was that kinda fun secret no one rly uses. permalink parent award report block reply view 11 more comments...\nYT45 3 points 5 days ago In her case it would be artificial stupidity. permalink parent award report block reply view 1 more comments...\nMastaJoda 3 points 4 days ago Nah, shes just helping her Dem colleagues create distress for D voters ahead of the midterms to remind how evil Rs are and how Ds are their saviors. Retarded D voters will never even know Jumanji let Trump cut off their SNAP. This shit is so obvious by now. The Rs will lose the midterms because R voters wont be supporting israel's stooges anymore and Ds get to rile up their base by starving them a bit while blaming Rs. The Rs will help starve and motivate D voters. The Rs and Ds are working together to make this a reality. Trump is just being led around by his massive ego by the Rs. permalink parent award report block reply\nJerryNadlerBeltFund 1 points 4 days ago But, also because writing is hard. permalink parent award report block reply\ndoodaddy 1 points 4 days ago good point!  but we're way past communists abiding by any rules, absolute rules or not, on the federal stage or not. permalink parent award report block reply\nBearing51 22 points 5 days ago Want to bet she doesn't remember though? permalink parent award report block reply Konsaki 29 points 5 days ago She doesn't understand. permalink parent award report block reply Bearing51 20 points 5 days ago But I did eat breakfast. permalink parent award report block reply congruent 7 points 5 days ago I know that one :) permalink parent award report block reply tree_sloth4 7 points 5 days ago chirp permalink parent award report block reply MasterChief08 6 points 5 days ago She can't even spell Abraham by hand. permalink parent award report block reply Agenda47 4 points 5 days ago It's ok, ChatGPT spells it for her. permalink parent award report block reply\nKonsaki 29 points 5 days ago She doesn't understand. permalink parent award report block reply Bearing51 20 points 5 days ago But I did eat breakfast. permalink parent award report block reply congruent 7 points 5 days ago I know that one :) permalink parent award report block reply tree_sloth4 7 points 5 days ago chirp permalink parent award report block reply MasterChief08 6 points 5 days ago She can't even spell Abraham by hand. permalink parent award report block reply Agenda47 4 points 5 days ago It's ok, ChatGPT spells it for her. permalink parent award report block reply\nBearing51 20 points 5 days ago But I did eat breakfast. permalink parent award report block reply congruent 7 points 5 days ago I know that one :) permalink parent award report block reply tree_sloth4 7 points 5 days ago chirp permalink parent award report block reply\ncongruent 7 points 5 days ago I know that one :) permalink parent award report block reply\ntree_sloth4 7 points 5 days ago chirp permalink parent award report block reply\nMasterChief08 6 points 5 days ago She can't even spell Abraham by hand. permalink parent award report block reply Agenda47 4 points 5 days ago It's ok, ChatGPT spells it for her. permalink parent award report block reply\nAgenda47 4 points 5 days ago It's ok, ChatGPT spells it for her. permalink parent award report block reply\nNomadicKrow2 2 points 5 days ago Woah woah woah. What? permalink parent award report block reply\nrealPixelDust 2 points 5 days ago Pepe’s Farmers remember* permalink parent award report block reply\nSERP-SERP 2 points 5 days ago Oooooo I member ! permalink parent award report block reply\nAllisterTwo 64 points 5 days ago This is such a simple judicial ruling even the retard understands that Congress controls the purse and an inferior court judge with TDS that failed grade school civics, can't demand the President do something unconstitutional... permalink award report block reply SalteenCracker 39 points 5 days ago There's no way she understands that. Maybe her clerks are tired of being laughed at, but I suspect the Dems want SNAP suspended for their narrative. permalink parent award report block reply fskfsk 15 points 5 days ago Most likely this.  Even for a competent judge, most of the work is done by the clerks. permalink parent award report block reply moscowjade 5 points 5 days ago As a county clerk, can confirm. permalink parent award report block reply Zelda 1 points 5 days ago Are you bombarded with the county clerk video from TikTok? Because that’s totally my county clerk . permalink parent award report block reply NomadicKrow2 5 points 5 days ago Resume: \"Worked as legal clerk for Ketanji Brown Jackson.\" Resume goes in garbage. permalink parent award report block reply IncredibleMrE1 4 points 5 days ago This is it. permalink parent award report block reply fightfightfightx 1 points 5 days ago yes, its all narrative Trump needs to go all in, or not. This half assed approach is just making ppl mad but for no real benefit. permalink parent award report block reply lefty295 1 points 5 days ago She didn’t make this decision. She is assigned the 2nd circuit. So it’s under her name. But the the full SOCTUS votes on stays like this. Edit: she’s assigned the 1st circuit, which Rhode Island is under, I put the wrong one. permalink parent award report block reply SalteenCracker 2 points 5 days ago Thank you, kind sir. permalink parent award report block reply AllisterTwo 1 points 4 days ago Only in rare instances does the full court vote on emergency stays initially, it's almost always the purview of the single justice  assigned to the circuit...  There is nothing that suggest or indicates the full court voted on this one... Even Left Wing propaganda sites like Politico agree... https://www.politico.com/news/2025/11/07/ketanji-brown-jackson-supreme-court-snap-benefits-ruling-00643639 The administration’s emergency appeal was routed to Jackson because she is assigned to oversee urgent matters arising from the 1st Circuit. She will likely refer the issue to the full court at some juncture, but her order Friday gave no indication she has yet done so. permalink parent award report block reply load 1 more comments... yukondave 2 points 5 days ago No she is a commie.  She wants to give the next COmmie leader the power to control food permalink parent award report block reply aaafirefly123 2 points 5 days ago That’s basically what that lower court was doing, And I get the feeling that the SCOTUS is gonna put that lower court in its place VERY soon. It’s one thing to rule in a way that hinders a perfectly legal and constitutional action, but to ACTIVELY try to FORCE the executive branch to violate the constitution… that’s something that is unprecedented. permalink parent award report block reply snoopy3210 1 points 4 days ago It was a trap. Trump’s lawyers, probably on the order of Todd Blanche, want him to lose the midterms with this. Todd Blanche is s crook who brought a fake top secret war plan to Mar a lago in 2021 and illegally recorded the President! permalink parent award report block reply\nSalteenCracker 39 points 5 days ago There's no way she understands that. Maybe her clerks are tired of being laughed at, but I suspect the Dems want SNAP suspended for their narrative. permalink parent award report block reply fskfsk 15 points 5 days ago Most likely this.  Even for a competent judge, most of the work is done by the clerks. permalink parent award report block reply moscowjade 5 points 5 days ago As a county clerk, can confirm. permalink parent award report block reply Zelda 1 points 5 days ago Are you bombarded with the county clerk video from TikTok? Because that’s totally my county clerk . permalink parent award report block reply NomadicKrow2 5 points 5 days ago Resume: \"Worked as legal clerk for Ketanji Brown Jackson.\" Resume goes in garbage. permalink parent award report block reply IncredibleMrE1 4 points 5 days ago This is it. permalink parent award report block reply fightfightfightx 1 points 5 days ago yes, its all narrative Trump needs to go all in, or not. This half assed approach is just making ppl mad but for no real benefit. permalink parent award report block reply lefty295 1 points 5 days ago She didn’t make this decision. She is assigned the 2nd circuit. So it’s under her name. But the the full SOCTUS votes on stays like this. Edit: she’s assigned the 1st circuit, which Rhode Island is under, I put the wrong one. permalink parent award report block reply SalteenCracker 2 points 5 days ago Thank you, kind sir. permalink parent award report block reply AllisterTwo 1 points 4 days ago Only in rare instances does the full court vote on emergency stays initially, it's almost always the purview of the single justice  assigned to the circuit...  There is nothing that suggest or indicates the full court voted on this one... Even Left Wing propaganda sites like Politico agree... https://www.politico.com/news/2025/11/07/ketanji-brown-jackson-supreme-court-snap-benefits-ruling-00643639 The administration’s emergency appeal was routed to Jackson because she is assigned to oversee urgent matters arising from the 1st Circuit. She will likely refer the issue to the full court at some juncture, but her order Friday gave no indication she has yet done so. permalink parent award report block reply load 1 more comments...\nfskfsk 15 points 5 days ago Most likely this.  Even for a competent judge, most of the work is done by the clerks. permalink parent award report block reply moscowjade 5 points 5 days ago As a county clerk, can confirm. permalink parent award report block reply Zelda 1 points 5 days ago Are you bombarded with the county clerk video from TikTok? Because that’s totally my county clerk . permalink parent award report block reply\nmoscowjade 5 points 5 days ago As a county clerk, can confirm. permalink parent award report block reply Zelda 1 points 5 days ago Are you bombarded with the county clerk video from TikTok? Because that’s totally my county clerk . permalink parent award report block reply\nZelda 1 points 5 days ago Are you bombarded with the county clerk video from TikTok? Because that’s totally my county clerk . permalink parent award report block reply\nNomadicKrow2 5 points 5 days ago Resume: \"Worked as legal clerk for Ketanji Brown Jackson.\" Resume goes in garbage. permalink parent award report block reply\nIncredibleMrE1 4 points 5 days ago This is it. permalink parent award report block reply\nfightfightfightx 1 points 5 days ago yes, its all narrative Trump needs to go all in, or not. This half assed approach is just making ppl mad but for no real benefit. permalink parent award report block reply\nlefty295 1 points 5 days ago She didn’t make this decision. She is assigned the 2nd circuit. So it’s under her name. But the the full SOCTUS votes on stays like this. Edit: she’s assigned the 1st circuit, which Rhode Island is under, I put the wrong one. permalink parent award report block reply SalteenCracker 2 points 5 days ago Thank you, kind sir. permalink parent award report block reply AllisterTwo 1 points 4 days ago Only in rare instances does the full court vote on emergency stays initially, it's almost always the purview of the single justice  assigned to the circuit...  There is nothing that suggest or indicates the full court voted on this one... Even Left Wing propaganda sites like Politico agree... https://www.politico.com/news/2025/11/07/ketanji-brown-jackson-supreme-court-snap-benefits-ruling-00643639 The administration’s emergency appeal was routed to Jackson because she is assigned to oversee urgent matters arising from the 1st Circuit. She will likely refer the issue to the full court at some juncture, but her order Friday gave no indication she has yet done so. permalink parent award report block reply\nSalteenCracker 2 points 5 days ago Thank you, kind sir. permalink parent award report block reply\nAllisterTwo 1 points 4 days ago Only in rare instances does the full court vote on emergency stays initially, it's almost always the purview of the single justice  assigned to the circuit...  There is nothing that suggest or indicates the full court voted on this one... Even Left Wing propaganda sites like Politico agree... https://www.politico.com/news/2025/11/07/ketanji-brown-jackson-supreme-court-snap-benefits-ruling-00643639 The administration’s emergency appeal was routed to Jackson because she is assigned to oversee urgent matters arising from the 1st Circuit. She will likely refer the issue to the full court at some juncture, but her order Friday gave no indication she has yet done so. permalink parent award report block reply\nyukondave 2 points 5 days ago No she is a commie.  She wants to give the next COmmie leader the power to control food permalink parent award report block reply\naaafirefly123 2 points 5 days ago That’s basically what that lower court was doing, And I get the feeling that the SCOTUS is gonna put that lower court in its place VERY soon. It’s one thing to rule in a way that hinders a perfectly legal and constitutional action, but to ACTIVELY try to FORCE the executive branch to violate the constitution… that’s something that is unprecedented. permalink parent award report block reply\nsnoopy3210 1 points 4 days ago It was a trap. Trump’s lawyers, probably on the order of Todd Blanche, want him to lose the midterms with this. Todd Blanche is s crook who brought a fake top secret war plan to Mar a lago in 2021 and illegally recorded the President! permalink parent award report block reply\nMAGA_NRG 31 points 5 days ago Did I read that right? permalink award report block reply TrumpAndGodWin 34 points 5 days ago Her masters told her to starve the SNAPricans to kick off their race based civil war while they're trying to crash the stock market and bring in dystopian technocratic neo feudalism? permalink parent award report block reply MasterChief08 28 points 5 days ago The economy is doing rather well for such a massive government shutdown. It's almost as if 70% of the federal government is a waste  and I'm being incredibly generous with that number. permalink parent award report block reply goldkeyboardwarrior 8 points 5 days ago Unless you’re a federal employee or in the military the shutdown for the most part wasn’t going to affect your average person for the first few weeks. But Dems know that the best way to try and hurt Trump is to affect air travel which is why they’re resisting passing a stand-alone bill paying feds since that would keep TSA and air traffic controllers from calling out en masse. permalink parent award report block reply Agenda47 8 points 5 days ago SNAPricans, proud descendants of the legendary Basketball Americans. permalink parent award report block reply Emodius 6 points 5 days ago Lmao at SNAPricans. So wrong permalink parent award report block reply TrumpAndGodWin 4 points 5 days ago Kek i almost said snaprican Americans but I wanted to include white leftists, Mexicans, etc and fairly spread the blame. permalink parent award report block reply MAGA_NRG 5 points 5 days ago This is food for thought. Makes sense. Ok thanks for the clarification. permalink parent award report block reply Ch3f4554551n 5 points 5 days ago A race-based civil war would be over in days and would favor MAGA. The stock market is due for a massive retrace, and policy won't stop it. permalink parent award report block reply TrumpAndGodWin 3 points 5 days ago It's not the blacks or leftist useful idiots you'd have to worry about in a civil war with the globalists that let in hundreds of thousands of Chinese military,  middle eastern terrorists like Hezbollah, etc and their biological weapons, cyberattacks, etc. permalink parent award report block reply Ch3f4554551n 1 points 5 days ago Oh no! Cyberattacks! Lol where are the Chinese going to land and get slaughtered? Long Beach or Mussel Shoals? permalink parent award report block reply view 3 more comments... lefty295 6 points 5 days ago No, she is assigned the 1st circuit, Rhode Island falls under that. The request goes to her, she has to refer it to the full court, and they all vote on stays like this. She likely voted against it. She didn’t make this decision. permalink parent award report block reply\nTrumpAndGodWin 34 points 5 days ago Her masters told her to starve the SNAPricans to kick off their race based civil war while they're trying to crash the stock market and bring in dystopian technocratic neo feudalism? permalink parent award report block reply MasterChief08 28 points 5 days ago The economy is doing rather well for such a massive government shutdown. It's almost as if 70% of the federal government is a waste  and I'm being incredibly generous with that number. permalink parent award report block reply goldkeyboardwarrior 8 points 5 days ago Unless you’re a federal employee or in the military the shutdown for the most part wasn’t going to affect your average person for the first few weeks. But Dems know that the best way to try and hurt Trump is to affect air travel which is why they’re resisting passing a stand-alone bill paying feds since that would keep TSA and air traffic controllers from calling out en masse. permalink parent award report block reply Agenda47 8 points 5 days ago SNAPricans, proud descendants of the legendary Basketball Americans. permalink parent award report block reply Emodius 6 points 5 days ago Lmao at SNAPricans. So wrong permalink parent award report block reply TrumpAndGodWin 4 points 5 days ago Kek i almost said snaprican Americans but I wanted to include white leftists, Mexicans, etc and fairly spread the blame. permalink parent award report block reply MAGA_NRG 5 points 5 days ago This is food for thought. Makes sense. Ok thanks for the clarification. permalink parent award report block reply Ch3f4554551n 5 points 5 days ago A race-based civil war would be over in days and would favor MAGA. The stock market is due for a massive retrace, and policy won't stop it. permalink parent award report block reply TrumpAndGodWin 3 points 5 days ago It's not the blacks or leftist useful idiots you'd have to worry about in a civil war with the globalists that let in hundreds of thousands of Chinese military,  middle eastern terrorists like Hezbollah, etc and their biological weapons, cyberattacks, etc. permalink parent award report block reply Ch3f4554551n 1 points 5 days ago Oh no! Cyberattacks! Lol where are the Chinese going to land and get slaughtered? Long Beach or Mussel Shoals? permalink parent award report block reply view 3 more comments...\nMasterChief08 28 points 5 days ago The economy is doing rather well for such a massive government shutdown. It's almost as if 70% of the federal government is a waste  and I'm being incredibly generous with that number. permalink parent award report block reply goldkeyboardwarrior 8 points 5 days ago Unless you’re a federal employee or in the military the shutdown for the most part wasn’t going to affect your average person for the first few weeks. But Dems know that the best way to try and hurt Trump is to affect air travel which is why they’re resisting passing a stand-alone bill paying feds since that would keep TSA and air traffic controllers from calling out en masse. permalink parent award report block reply\ngoldkeyboardwarrior 8 points 5 days ago Unless you’re a federal employee or in the military the shutdown for the most part wasn’t going to affect your average person for the first few weeks. But Dems know that the best way to try and hurt Trump is to affect air travel which is why they’re resisting passing a stand-alone bill paying feds since that would keep TSA and air traffic controllers from calling out en masse. permalink parent award report block reply\nAgenda47 8 points 5 days ago SNAPricans, proud descendants of the legendary Basketball Americans. permalink parent award report block reply\nEmodius 6 points 5 days ago Lmao at SNAPricans. So wrong permalink parent award report block reply TrumpAndGodWin 4 points 5 days ago Kek i almost said snaprican Americans but I wanted to include white leftists, Mexicans, etc and fairly spread the blame. permalink parent award report block reply\nTrumpAndGodWin 4 points 5 days ago Kek i almost said snaprican Americans but I wanted to include white leftists, Mexicans, etc and fairly spread the blame. permalink parent award report block reply\nMAGA_NRG 5 points 5 days ago This is food for thought. Makes sense. Ok thanks for the clarification. permalink parent award report block reply\nCh3f4554551n 5 points 5 days ago A race-based civil war would be over in days and would favor MAGA. The stock market is due for a massive retrace, and policy won't stop it. permalink parent award report block reply TrumpAndGodWin 3 points 5 days ago It's not the blacks or leftist useful idiots you'd have to worry about in a civil war with the globalists that let in hundreds of thousands of Chinese military,  middle eastern terrorists like Hezbollah, etc and their biological weapons, cyberattacks, etc. permalink parent award report block reply Ch3f4554551n 1 points 5 days ago Oh no! Cyberattacks! Lol where are the Chinese going to land and get slaughtered? Long Beach or Mussel Shoals? permalink parent award report block reply view 3 more comments...\nTrumpAndGodWin 3 points 5 days ago It's not the blacks or leftist useful idiots you'd have to worry about in a civil war with the globalists that let in hundreds of thousands of Chinese military,  middle eastern terrorists like Hezbollah, etc and their biological weapons, cyberattacks, etc. permalink parent award report block reply Ch3f4554551n 1 points 5 days ago Oh no! Cyberattacks! Lol where are the Chinese going to land and get slaughtered? Long Beach or Mussel Shoals? permalink parent award report block reply view 3 more comments...\nCh3f4554551n 1 points 5 days ago Oh no! Cyberattacks! Lol where are the Chinese going to land and get slaughtered? Long Beach or Mussel Shoals? permalink parent award report block reply view 3 more comments...\nlefty295 6 points 5 days ago No, she is assigned the 1st circuit, Rhode Island falls under that. The request goes to her, she has to refer it to the full court, and they all vote on stays like this. She likely voted against it. She didn’t make this decision. permalink parent award report block reply\nkilledmytv 19 points 5 days ago The only reason Jumanji (or whoever wrote her homework assignment for her) did this is because she thinks it'll hurt Trump among the welfare class and useful idiots who get all their news from the TV. There's no way she did this because it was the right decision. permalink award report block reply MasterChief08 8 points 5 days ago The welfare class overwhelmingly votes Democrat regardless.  And the ones who don't are typically truly disabled Americans who know this shutdown is 100% on Democrats. permalink parent award report block reply lefty295 5 points 5 days ago She didn’t do this. You’re all wrong about this. She is assigned the 1st circuit. Rhode Island where the district court is, falls under that. She MUST refer all requests to the full SCOTUS, who then vote on the stay. She doesn’t decide this on her own. She has to bring it to the full court. permalink parent award report block reply goldkeyboardwarrior 3 points 5 days ago There are some Dems on social media demanding to know why she did it so that will be interesting. permalink parent award report block reply lefty295 4 points 5 days ago She didn’t, they just don’t understand how stays with SCOTUS work. permalink parent award report block reply zooty 4 points 5 days ago They don't understand much, to be honest. permalink parent award report block reply SanityGumby 2 points 5 days ago That and I suspect it's bad for the supreme court to let a lower court have that much power. She wants that power. permalink parent award report block reply\nMasterChief08 8 points 5 days ago The welfare class overwhelmingly votes Democrat regardless.  And the ones who don't are typically truly disabled Americans who know this shutdown is 100% on Democrats. permalink parent award report block reply\nlefty295 5 points 5 days ago She didn’t do this. You’re all wrong about this. She is assigned the 1st circuit. Rhode Island where the district court is, falls under that. She MUST refer all requests to the full SCOTUS, who then vote on the stay. She doesn’t decide this on her own. She has to bring it to the full court. permalink parent award report block reply\ngoldkeyboardwarrior 3 points 5 days ago There are some Dems on social media demanding to know why she did it so that will be interesting. permalink parent award report block reply lefty295 4 points 5 days ago She didn’t, they just don’t understand how stays with SCOTUS work. permalink parent award report block reply zooty 4 points 5 days ago They don't understand much, to be honest. permalink parent award report block reply\nlefty295 4 points 5 days ago She didn’t, they just don’t understand how stays with SCOTUS work. permalink parent award report block reply zooty 4 points 5 days ago They don't understand much, to be honest. permalink parent award report block reply\nzooty 4 points 5 days ago They don't understand much, to be honest. permalink parent award report block reply\nSanityGumby 2 points 5 days ago That and I suspect it's bad for the supreme court to let a lower court have that much power. She wants that power. permalink parent award report block reply\nlefty295 15 points 5 days ago That’s not how it works. That’s not her decision. She issues it because she was assigned that circuit. The request goes to her, she MUST refer it to the full court, and they all vote on it. This is not Jackson deciding it should be stayed. This the full SCOTUS voting for a stay, and it’s in her assigned circuit. permalink award report block reply ForceMultiplier 1 points 4 days ago I sure wish that u/hocuspocusfocusjeep would spend 30 seconds to drop the url we all know he has, so I could explore the context. permalink parent award report block reply\nForceMultiplier 1 points 4 days ago I sure wish that u/hocuspocusfocusjeep would spend 30 seconds to drop the url we all know he has, so I could explore the context. permalink parent award report block reply\nwe_won_the_war_jack 10 points 5 days ago It’s a play then.  They want this. permalink award report block reply\nJohnN 7 points 5 days ago The Marxists do this with hopeless cases to appear to be \"measured and thoughtful.\" permalink award report block reply\nDJT_MFers1 6 points 5 days ago With a name like Ketanji it’s only matter of time that she commits robbery homicide permalink award report block reply\nYodaBannon 5 points 5 days ago show them all the beauty they possess inside. Sesual Chocolate permalink award report block reply\nAwakened 5 points 5 days ago Lol, when someone tells her what she just did she's gonna be pissed. permalink award report block reply\nARMENTO 4 points 5 days ago Reddit about to nuke itself into orbit. permalink award report block reply infinitysupreme 2 points 4 days ago Reddit is a Democrat speech suppression factory which suppresses visibility of  information like this permalink parent award report block reply\ninfinitysupreme 2 points 4 days ago Reddit is a Democrat speech suppression factory which suppresses visibility of  information like this permalink parent award report block reply\nAbsurdOpinion 3 points 5 days ago The wording here and the article title make it seem like it would be legal for Trump to order the release of the funds - it's not. The funds were allocated by Congress for an \"emergency\", and the democrats stonewalling is not an emergency, it's just idiocy. permalink award report block reply\nEaszq8 3 points 5 days ago I’m speaking, I’m speaking! permalink award report block reply\nasiatrails 3 points 5 days ago She probably had it ghostwritten by AI and signed by the indefatigable clerk Otto Pen. But, it is the right decision. permalink award report block reply\nChoppermagic 3 points 5 days ago CNN will claim she is right wing now haha permalink award report block reply\nSaltish 3 points 5 days ago A stay to remove the injunction of the appeal to inhibit the administrative order to require the continued withholding.... I need a logic tree to determine the upshot of these rulings. permalink award report block reply womp-womp-twice 2 points 5 days ago Haha, sure Judge Jumanji understood it right away permalink parent award report block reply\nwomp-womp-twice 2 points 5 days ago Haha, sure Judge Jumanji understood it right away permalink parent award report block reply\nzooty 3 points 5 days ago Oops. She used the wrong AI prompt. permalink award report block reply\nRey_ 2 points 4 days ago He's not withholding anything, snap is not funded and the emergency money is contingent money, grr. permalink award report block reply\nDeplorableLA 2 points 5 days ago Stunning. permalink award report block reply Emodius 2 points 5 days ago And brave permalink parent award report block reply\nEmodius 2 points 5 days ago And brave permalink parent award report block reply\nShitsbrokeyo 2 points 5 days ago Did AI write it again? permalink award report block reply\nTryhardneckbeard 2 points 5 days ago What fuckin world I live in that I wanna applaud a DEI appointment for applying common sense. permalink award report block reply\nAbrahamLincoln 2 points 4 days ago Jumanji couldn't have written this, it's not retarded enough and doesn't go on any random insane tangents. permalink award report block reply\nBahamaDon 2 points 5 days ago But she's not a farmer, or a grocer! permalink award report block reply\nSanityGumby 2 points 5 days ago Broken clock permalink award report block reply\nOldman1234 2 points 4 days ago Justice Jumanji B. Jackson thought \"staying\" a lower court order meant keeping it in place. permalink award report block reply\nknnbccb 1 points 4 days ago Need to check with a biologist first. permalink award report block reply\ntrumpORbust 1 points 4 days ago They needed to give the DEI hire an easy task to offset all the fumbles so far permalink award report block reply\nBBvarn 1 points 4 days ago Justice Ketanji Brown Jackson wants her SNAP card updated. permalink award report block reply\nUnboosted 1 points 5 days ago A chat gpt judge? permalink award report block reply\nSteve56775 1 points 4 days ago All this theater doesn’t matter. The Republicans will cave this week. In which case the blame falls squarely on their shoulders. Double win for the Democrats. permalink award report block reply\nBobSux 1 points 5 days ago 80% of her family probably receives welfare, so this is surprising. permalink award report block reply\nTim_Berframer 1 points 4 days ago She's being blackmailed. She thinks the guy's name is Otto Penn. permalink award report block reply\nSavingPrivateGrace -1 points 5 days ago This shouldn't be confusing.  There is 5 billion in an emergency fund that could cover 50% of SNAP benefits for November during the shut down.  Withhold the full funding and use it. permalink award report block reply Emodius 7 points 5 days ago He can't. It can't be used for this at all. It's literally against the law. He has no mechanism or power to do it. permalink parent award report block reply SavingPrivateGrace 4 points 5 days ago I didn't see that.  Thank you. permalink parent award report block reply\nEmodius 7 points 5 days ago He can't. It can't be used for this at all. It's literally against the law. He has no mechanism or power to do it. permalink parent award report block reply SavingPrivateGrace 4 points 5 days ago I didn't see that.  Thank you. permalink parent award report block reply\nSavingPrivateGrace 4 points 5 days ago I didn't see that.  Thank you. permalink parent award report block reply"}