{"id": "1ARK9pemCx", "contents": "81 H1Bs LIE about their knowledge and qualifications. Basically all of them do it, and they are NEVER asked to prove what they claim to know. Next step... They get hired, get put on a project team, and are nothing but a helpless know nothing dead weight to who has to be hand held and carried across the posted 11 hours ago by HeavenlyTrumpets 3 comments award share report block Finish line. I've seen In person multiple times, multiple employers. The H1B who supposedly knows so much is nothing but a massive liability who slows everyone down. Even without getting rid of H1B, if they somehow had to prove to know what they say they know, almost none of them would be hired. That's too difficult to enforce though..better to just scrap it altogether.\n3 comments Sort by Top Top New Worst Old Save mykillk 3 points 11 hours ago Why pay good money for good work when you can pay ok money for no work? My company shares a business park with another company who got big into hiring Indians....literally every. single. time. i go outside on a break i see groups of indians sitting around smoking or them on their phones. I have not gone outside once in 7 years now without seeing at least one jeet. These people do not work. permalink award report block reply HeavenlyTrumpets OP 2 points 11 hours ago I'm sure it's done to look good to board members who don't actually know what's going on or understand that their \"cheap\" labor is actually just throwing money out the window for people who contribute little to nothing permalink parent award report block reply RocksCanOnlyWait 1 points 10 hours ago It's easy to filter the liars with a 30min phone call. They can't answer any technical question well, even if it's specific to the work they claimed to do on their resume. I've had to do it several times. permalink award report block reply\nmykillk 3 points 11 hours ago Why pay good money for good work when you can pay ok money for no work? My company shares a business park with another company who got big into hiring Indians....literally every. single. time. i go outside on a break i see groups of indians sitting around smoking or them on their phones. I have not gone outside once in 7 years now without seeing at least one jeet. These people do not work. permalink award report block reply HeavenlyTrumpets OP 2 points 11 hours ago I'm sure it's done to look good to board members who don't actually know what's going on or understand that their \"cheap\" labor is actually just throwing money out the window for people who contribute little to nothing permalink parent award report block reply\nHeavenlyTrumpets OP 2 points 11 hours ago I'm sure it's done to look good to board members who don't actually know what's going on or understand that their \"cheap\" labor is actually just throwing money out the window for people who contribute little to nothing permalink parent award report block reply\nRocksCanOnlyWait 1 points 10 hours ago It's easy to filter the liars with a 30min phone call. They can't answer any technical question well, even if it's specific to the work they claimed to do on their resume. I've had to do it several times. permalink award report block reply"}