{"id": "1ARK9pgh1F", "contents": "63 Well, well, well. posted 1 hour ago by MickHigan2 13 comments award share download report block\n13 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Mungo 7 points 44 minutes ago The races were never meant to mix long term. Period. permalink award report block reply dodgetimes2 3 points 1 hour ago Dey dindunuffin permalink award report block reply 2025WhatIsTrue 3 points 1 hour ago Them. Avoid them. permalink award report block reply MickHigan2 OP 2 points 1 hour ago https://www.youtube.com/watch?v=FMXj7JJBXqw permalink award report block reply Roadpower 2 points 1 hour ago Three out of the twenty one have organized hair, UN-organized hair is a great predictor of someone who creates or participates in chaos and/or criminality. permalink award report block reply Whoopies_tds 2 points 55 minutes ago Their fathers must be pissed 🤷🏿 permalink award report block reply Dewormed_Patriot 1 points 56 seconds ago I'm a statistic connoisseur. permalink award report block reply Luvs_2_Bop 1 points 35 minutes ago Obama’s 21 other kids??? permalink award report block reply South_Florida_Guy 1 points 9 minutes ago damn White supreme pizzas! permalink award report block reply mydogma8yourkarma 1 points 19 minutes ago Possibly White - CNN permalink award report block reply Elencher 1 points 29 minutes ago According to the FBI: 21 white gang members taken off streets. permalink award report block reply MakinBacon 1 points 4 minutes ago they wuz hungry n shyit permalink award report block reply RoninIV 1 points 28 minutes ago \"Teens\" permalink award report block reply\nMungo 7 points 44 minutes ago The races were never meant to mix long term. Period. permalink award report block reply\ndodgetimes2 3 points 1 hour ago Dey dindunuffin permalink award report block reply\n2025WhatIsTrue 3 points 1 hour ago Them. Avoid them. permalink award report block reply\nMickHigan2 OP 2 points 1 hour ago https://www.youtube.com/watch?v=FMXj7JJBXqw permalink award report block reply\nRoadpower 2 points 1 hour ago Three out of the twenty one have organized hair, UN-organized hair is a great predictor of someone who creates or participates in chaos and/or criminality. permalink award report block reply\nWhoopies_tds 2 points 55 minutes ago Their fathers must be pissed 🤷🏿 permalink award report block reply\nDewormed_Patriot 1 points 56 seconds ago I'm a statistic connoisseur. permalink award report block reply\nLuvs_2_Bop 1 points 35 minutes ago Obama’s 21 other kids??? permalink award report block reply\nSouth_Florida_Guy 1 points 9 minutes ago damn White supreme pizzas! permalink award report block reply\nmydogma8yourkarma 1 points 19 minutes ago Possibly White - CNN permalink award report block reply\nElencher 1 points 29 minutes ago According to the FBI: 21 white gang members taken off streets. permalink award report block reply\nMakinBacon 1 points 4 minutes ago they wuz hungry n shyit permalink award report block reply\nRoninIV 1 points 28 minutes ago \"Teens\" permalink award report block reply"}