{"id": "1ARK9hi0ZF", "contents": "948 Zohran posted 2 days ago by rdvs34283 49 comments award share download report block\n49 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style deleted 23 points 2 days ago Awan-CIA-Car-Lot 17 points 2 days ago I saw a night vision video taken by some soldiers in Afghanistan.  There was a degenerate muzzie going at it on a poor donkey. You can't unsee that, man. Perverts. permalink parent award report block reply Bullet3250 10 points 2 days ago They were taught by there spiritual leader - Muhammad draws a line in the sand. https://www.youtube.com/watch?v=OtqFzOjclL8 permalink parent award report block reply Awan-CIA-Car-Lot 7 points 2 days ago That's David Woods, right?  I like that guy.   He really knows his facts. permalink parent award report block reply Bullet3250 8 points 2 days ago 💯 I am surprised Islam made it as far as it has - with this story from Mohammeds OWN LIFE (there are many many more similar) ... Islam is just from the depths, no other explanation. permalink parent award report block reply view 1 more comments... drattastic1 3 points 2 days ago I guess there weren't any little boys around. permalink parent award report block reply YaharaRiver 2 points 2 days ago I’ve seen video of a muslim banging the exhaust pipe of a vehicle. However, Abdul did not spawn a new car. permalink parent award report block reply Awan-CIA-Car-Lot 3 points 2 days ago 😅😅😅 permalink parent award report block reply Deportthemall23 4 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply view 1 more comments... Mortal_Wombat 1 points 2 days ago You ever see bloody baby dick being sucked? Metzizah b'peh anyone? They're all fucked up. So yeah. permalink parent award report block reply YaharaRiver -1 points 2 days ago I’ve seen skewered babies on the end of muslim weapons, which were recorded and emailed to the muslim parents for ecstatic celebration and praise. I’ve seen dismembered victims of muslim slaughter strewn about, the heads kicked around like soccer balls. Ive seen the testimonies of survivors describe the depraved mindset of muslims, the thousands of child “brides” (pedofile sex slaves), the breeder cows in chains and trash bags, the state of muslim regions filled to capacity with filth and trash. That’s barely scratching the surface of the earthly plague known as pisslam. permalink parent award report block reply view 1 more comments... Made_in_America 2 points 2 days ago Muzzles fuck donkeys in the desert. Jews fuck kids on an Island. Must have something to do with the heat messing up the brains of desert people. permalink parent award report block reply Rock9Head 4 points 2 days ago Even the dead ones. permalink parent award report block reply WhiteGhost 4 points 2 days ago Any animal, but costs and sheep are preferred. https://www.documentingreality.com/forum/f167/army-camera-catches-afghan-men-having-sex-goat-135250/ permalink parent award report block reply RPOZ28 3 points 2 days ago If they're bi, they'll probably do both. permalink parent award report block reply bh506407 10 points 2 days ago Sheep’s clothing my ass, dude is an out in the open Islamic socialist. THAT’S what commie NYC wanted. permalink award report block reply Mamapedia 5 points 2 days ago They wanted the socialist part, but they have no idea what the Islamic part actually means.  Remember, they are the coexist crowd (in theory, not practice).  FO time. permalink parent award report block reply Deportthemall23 -1 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply JohnnyWolverine 7 points 2 days ago The retarded sheep of NYC know he's a wolf, and voted for him anyway. Possibly to spite us, possibly because of \"vote blue no matter who\", or possibly because NYC is overrun by muslims. What is certain is that things are going to get much shittier. permalink award report block reply AmericanMan00 7 points 2 days ago The competitors were insulting to the voters.  All i heard of Zohran was he was going to make buses free to ride and the media lost their minds. permalink parent award report block reply Tellman125 4 points 2 days ago His supporters were mostly foreign-born, most of them moved here within the past 10 years: https://patriots.win/p/1ARK53KNIC/the-bushobamaandbidenera-invader/c https://x.com/PaulyBowz/status/1986187309859983485 permalink parent award report block reply pollsarefake 1 points 2 days ago Trump is sending a special unit of ICE to arrest and deport this infiltrator permalink parent award report block reply Treefiddydiddy 5 points 2 days ago they were charging 13 dolla for a bud light at one of his recent 'get togethers' lol permalink award report block reply rebuildingMyself 4 points 2 days ago Then immediately asked for donations to fund his transition team. Hope the voters there get used to that request for every single thing he does permalink parent award report block reply Made_in_America 4 points 2 days ago costume paid for by George Soros and his people. permalink award report block reply barwhack 3 points 2 days ago So that's what they do with the sheep, afterwards. permalink award report block reply YaharaRiver 2 points 2 days ago Crawl inside and lick the interior dry. permalink parent award report block reply WildStar 3 points 2 days ago Not really accurate; he was quite open about being a communist muslim supremacist. His intentions were obvious, and people voted for it anyway. permalink award report block reply kwakkles 3 points 2 days ago The goal of socialism is communism. permalink award report block reply Kaputtmacher 2 points 2 days ago I don't get it. He wasn't hiding it. permalink award report block reply Stanwyk74 2 points 2 days ago Is he even dressed up? Seems like he is straight up telling people what he is permalink award report block reply Tellman125 2 points 2 days ago As bad as his rhetoric is, the truth is much worse, because he's just using the socialism stuff to usher in Sharia law and favor Muslims; it's exactly what Sadiq Khan did in London. When he talks, he never just says \"New Yorkers,\" he always follows it with a specfication: \"the New Yorkers I know / I talk to / I hear from / I represent.\" That's his fellow Muslims, the \"brotherhood.\" His newly announced apartment plan is all about taking apartments away from white landlords and white tenants and giving them to Muslim ones, but he frames it as him cracking down on those big mean landlords. permalink parent award report block reply DlanOdcammron 2 points 2 days ago He’s not a wolf in sheep’s clothing. He’s a communist mooslim in communist mooslim clothing. permalink award report block reply Tellman125 1 points 2 days ago But in his TikTok videos, he's a grinning, witty, happy-go-lucky actor strolling around the city and being approached and greeted by adoring fans. They created a celebrity out of him, and his social media team was using popular hashtags of the day to get his videos to the front page. And he used to dress like the  third-world dirt-eating animal he really is, as shown in many videos and photos from the past several years, but now wears a suit, which is his American politician costume. I can't even stand his name, so I call him Moron Scamdummy. permalink parent award report block reply Tellman125 1 points 2 days ago MORON SCAMDUMMY permalink award report block reply MagaPhone017 1 points 2 days ago He better not wear that get-up around his Muslim buddies...they may get them a fever , since he doesn't have a visible beard... permalink award report block reply Bohemyth_2 1 points 2 days ago Cuomo was the devil we knew NYC was the city we knew permalink award report block reply Tellman125 2 points 2 days ago Cuomo did a huge favor for the sane residents of the city by actually staying the race all the way to the general election. If the race was just Scamdummy vs. Sliwa, Sliwa would have gotten even less than the 26% he got last time against Eric Adams. And now Elise Stefanik is already campaigning for governor and aggressively so: https://patriots.win/p/1ARK9hipJW/already-campaigning-elise-stefan/c permalink parent award report block reply Kricket 1 points 2 days ago They simply deserve what comes next. permalink award report block reply ancroidubh 1 points 2 days ago Well, muzzles do spend a lot of time inside sheep, so… permalink award report block reply 2016TrumpMAGA 1 points 2 days ago Cartoon in incorrect.  He was open about exactly who he was. permalink award report block reply Riehlpissed 1 points 2 days ago No go zones are already setup and just waiting to close to us “infedels”. Dumb liberals be yelling “Hiel Mandani” as thier being raped and killed. permalink award report block reply CharlesWilliams 1 points 2 days ago He’s a furry who dresses up to have carnal relations  with real sheep? permalink award report block reply YaharaRiver 1 points 2 days ago Speaking of animal metaphors, this mayoral disaster is a perfect example of letting the camel's nose under the tent.  Amazingly, we are supposed to think this occurred in the midst of overwhelming rejection of pisslam, which has been widespread all over the country and growing. permalink award report block reply BBvarn 0 points 2 days ago When do the White liberal cows of NYC start wearing full burqas. That will be a major site improvement for NYC. permalink award report block reply\ndeleted 23 points 2 days ago Awan-CIA-Car-Lot 17 points 2 days ago I saw a night vision video taken by some soldiers in Afghanistan.  There was a degenerate muzzie going at it on a poor donkey. You can't unsee that, man. Perverts. permalink parent award report block reply Bullet3250 10 points 2 days ago They were taught by there spiritual leader - Muhammad draws a line in the sand. https://www.youtube.com/watch?v=OtqFzOjclL8 permalink parent award report block reply Awan-CIA-Car-Lot 7 points 2 days ago That's David Woods, right?  I like that guy.   He really knows his facts. permalink parent award report block reply Bullet3250 8 points 2 days ago 💯 I am surprised Islam made it as far as it has - with this story from Mohammeds OWN LIFE (there are many many more similar) ... Islam is just from the depths, no other explanation. permalink parent award report block reply view 1 more comments... drattastic1 3 points 2 days ago I guess there weren't any little boys around. permalink parent award report block reply YaharaRiver 2 points 2 days ago I’ve seen video of a muslim banging the exhaust pipe of a vehicle. However, Abdul did not spawn a new car. permalink parent award report block reply Awan-CIA-Car-Lot 3 points 2 days ago 😅😅😅 permalink parent award report block reply Deportthemall23 4 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply view 1 more comments... Mortal_Wombat 1 points 2 days ago You ever see bloody baby dick being sucked? Metzizah b'peh anyone? They're all fucked up. So yeah. permalink parent award report block reply YaharaRiver -1 points 2 days ago I’ve seen skewered babies on the end of muslim weapons, which were recorded and emailed to the muslim parents for ecstatic celebration and praise. I’ve seen dismembered victims of muslim slaughter strewn about, the heads kicked around like soccer balls. Ive seen the testimonies of survivors describe the depraved mindset of muslims, the thousands of child “brides” (pedofile sex slaves), the breeder cows in chains and trash bags, the state of muslim regions filled to capacity with filth and trash. That’s barely scratching the surface of the earthly plague known as pisslam. permalink parent award report block reply view 1 more comments... Made_in_America 2 points 2 days ago Muzzles fuck donkeys in the desert. Jews fuck kids on an Island. Must have something to do with the heat messing up the brains of desert people. permalink parent award report block reply Rock9Head 4 points 2 days ago Even the dead ones. permalink parent award report block reply WhiteGhost 4 points 2 days ago Any animal, but costs and sheep are preferred. https://www.documentingreality.com/forum/f167/army-camera-catches-afghan-men-having-sex-goat-135250/ permalink parent award report block reply RPOZ28 3 points 2 days ago If they're bi, they'll probably do both. permalink parent award report block reply\nAwan-CIA-Car-Lot 17 points 2 days ago I saw a night vision video taken by some soldiers in Afghanistan.  There was a degenerate muzzie going at it on a poor donkey. You can't unsee that, man. Perverts. permalink parent award report block reply Bullet3250 10 points 2 days ago They were taught by there spiritual leader - Muhammad draws a line in the sand. https://www.youtube.com/watch?v=OtqFzOjclL8 permalink parent award report block reply Awan-CIA-Car-Lot 7 points 2 days ago That's David Woods, right?  I like that guy.   He really knows his facts. permalink parent award report block reply Bullet3250 8 points 2 days ago 💯 I am surprised Islam made it as far as it has - with this story from Mohammeds OWN LIFE (there are many many more similar) ... Islam is just from the depths, no other explanation. permalink parent award report block reply view 1 more comments... drattastic1 3 points 2 days ago I guess there weren't any little boys around. permalink parent award report block reply YaharaRiver 2 points 2 days ago I’ve seen video of a muslim banging the exhaust pipe of a vehicle. However, Abdul did not spawn a new car. permalink parent award report block reply Awan-CIA-Car-Lot 3 points 2 days ago 😅😅😅 permalink parent award report block reply Deportthemall23 4 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply view 1 more comments... Mortal_Wombat 1 points 2 days ago You ever see bloody baby dick being sucked? Metzizah b'peh anyone? They're all fucked up. So yeah. permalink parent award report block reply YaharaRiver -1 points 2 days ago I’ve seen skewered babies on the end of muslim weapons, which were recorded and emailed to the muslim parents for ecstatic celebration and praise. I’ve seen dismembered victims of muslim slaughter strewn about, the heads kicked around like soccer balls. Ive seen the testimonies of survivors describe the depraved mindset of muslims, the thousands of child “brides” (pedofile sex slaves), the breeder cows in chains and trash bags, the state of muslim regions filled to capacity with filth and trash. That’s barely scratching the surface of the earthly plague known as pisslam. permalink parent award report block reply view 1 more comments... Made_in_America 2 points 2 days ago Muzzles fuck donkeys in the desert. Jews fuck kids on an Island. Must have something to do with the heat messing up the brains of desert people. permalink parent award report block reply\nBullet3250 10 points 2 days ago They were taught by there spiritual leader - Muhammad draws a line in the sand. https://www.youtube.com/watch?v=OtqFzOjclL8 permalink parent award report block reply Awan-CIA-Car-Lot 7 points 2 days ago That's David Woods, right?  I like that guy.   He really knows his facts. permalink parent award report block reply Bullet3250 8 points 2 days ago 💯 I am surprised Islam made it as far as it has - with this story from Mohammeds OWN LIFE (there are many many more similar) ... Islam is just from the depths, no other explanation. permalink parent award report block reply view 1 more comments...\nAwan-CIA-Car-Lot 7 points 2 days ago That's David Woods, right?  I like that guy.   He really knows his facts. permalink parent award report block reply Bullet3250 8 points 2 days ago 💯 I am surprised Islam made it as far as it has - with this story from Mohammeds OWN LIFE (there are many many more similar) ... Islam is just from the depths, no other explanation. permalink parent award report block reply view 1 more comments...\nBullet3250 8 points 2 days ago 💯 I am surprised Islam made it as far as it has - with this story from Mohammeds OWN LIFE (there are many many more similar) ... Islam is just from the depths, no other explanation. permalink parent award report block reply view 1 more comments...\ndrattastic1 3 points 2 days ago I guess there weren't any little boys around. permalink parent award report block reply\nYaharaRiver 2 points 2 days ago I’ve seen video of a muslim banging the exhaust pipe of a vehicle. However, Abdul did not spawn a new car. permalink parent award report block reply Awan-CIA-Car-Lot 3 points 2 days ago 😅😅😅 permalink parent award report block reply Deportthemall23 4 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply view 1 more comments... Mortal_Wombat 1 points 2 days ago You ever see bloody baby dick being sucked? Metzizah b'peh anyone? They're all fucked up. So yeah. permalink parent award report block reply YaharaRiver -1 points 2 days ago I’ve seen skewered babies on the end of muslim weapons, which were recorded and emailed to the muslim parents for ecstatic celebration and praise. I’ve seen dismembered victims of muslim slaughter strewn about, the heads kicked around like soccer balls. Ive seen the testimonies of survivors describe the depraved mindset of muslims, the thousands of child “brides” (pedofile sex slaves), the breeder cows in chains and trash bags, the state of muslim regions filled to capacity with filth and trash. That’s barely scratching the surface of the earthly plague known as pisslam. permalink parent award report block reply view 1 more comments...\nAwan-CIA-Car-Lot 3 points 2 days ago 😅😅😅 permalink parent award report block reply Deportthemall23 4 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply view 1 more comments...\nDeportthemall23 4 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply view 1 more comments...\nMortal_Wombat 1 points 2 days ago You ever see bloody baby dick being sucked? Metzizah b'peh anyone? They're all fucked up. So yeah. permalink parent award report block reply YaharaRiver -1 points 2 days ago I’ve seen skewered babies on the end of muslim weapons, which were recorded and emailed to the muslim parents for ecstatic celebration and praise. I’ve seen dismembered victims of muslim slaughter strewn about, the heads kicked around like soccer balls. Ive seen the testimonies of survivors describe the depraved mindset of muslims, the thousands of child “brides” (pedofile sex slaves), the breeder cows in chains and trash bags, the state of muslim regions filled to capacity with filth and trash. That’s barely scratching the surface of the earthly plague known as pisslam. permalink parent award report block reply view 1 more comments...\nYaharaRiver -1 points 2 days ago I’ve seen skewered babies on the end of muslim weapons, which were recorded and emailed to the muslim parents for ecstatic celebration and praise. I’ve seen dismembered victims of muslim slaughter strewn about, the heads kicked around like soccer balls. Ive seen the testimonies of survivors describe the depraved mindset of muslims, the thousands of child “brides” (pedofile sex slaves), the breeder cows in chains and trash bags, the state of muslim regions filled to capacity with filth and trash. That’s barely scratching the surface of the earthly plague known as pisslam. permalink parent award report block reply view 1 more comments...\nMade_in_America 2 points 2 days ago Muzzles fuck donkeys in the desert. Jews fuck kids on an Island. Must have something to do with the heat messing up the brains of desert people. permalink parent award report block reply\nRock9Head 4 points 2 days ago Even the dead ones. permalink parent award report block reply\nWhiteGhost 4 points 2 days ago Any animal, but costs and sheep are preferred. https://www.documentingreality.com/forum/f167/army-camera-catches-afghan-men-having-sex-goat-135250/ permalink parent award report block reply\nRPOZ28 3 points 2 days ago If they're bi, they'll probably do both. permalink parent award report block reply\nbh506407 10 points 2 days ago Sheep’s clothing my ass, dude is an out in the open Islamic socialist. THAT’S what commie NYC wanted. permalink award report block reply Mamapedia 5 points 2 days ago They wanted the socialist part, but they have no idea what the Islamic part actually means.  Remember, they are the coexist crowd (in theory, not practice).  FO time. permalink parent award report block reply Deportthemall23 -1 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply\nMamapedia 5 points 2 days ago They wanted the socialist part, but they have no idea what the Islamic part actually means.  Remember, they are the coexist crowd (in theory, not practice).  FO time. permalink parent award report block reply\nDeportthemall23 -1 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply\nJohnnyWolverine 7 points 2 days ago The retarded sheep of NYC know he's a wolf, and voted for him anyway. Possibly to spite us, possibly because of \"vote blue no matter who\", or possibly because NYC is overrun by muslims. What is certain is that things are going to get much shittier. permalink award report block reply AmericanMan00 7 points 2 days ago The competitors were insulting to the voters.  All i heard of Zohran was he was going to make buses free to ride and the media lost their minds. permalink parent award report block reply Tellman125 4 points 2 days ago His supporters were mostly foreign-born, most of them moved here within the past 10 years: https://patriots.win/p/1ARK53KNIC/the-bushobamaandbidenera-invader/c https://x.com/PaulyBowz/status/1986187309859983485 permalink parent award report block reply pollsarefake 1 points 2 days ago Trump is sending a special unit of ICE to arrest and deport this infiltrator permalink parent award report block reply\nAmericanMan00 7 points 2 days ago The competitors were insulting to the voters.  All i heard of Zohran was he was going to make buses free to ride and the media lost their minds. permalink parent award report block reply\nTellman125 4 points 2 days ago His supporters were mostly foreign-born, most of them moved here within the past 10 years: https://patriots.win/p/1ARK53KNIC/the-bushobamaandbidenera-invader/c https://x.com/PaulyBowz/status/1986187309859983485 permalink parent award report block reply\npollsarefake 1 points 2 days ago Trump is sending a special unit of ICE to arrest and deport this infiltrator permalink parent award report block reply\nTreefiddydiddy 5 points 2 days ago they were charging 13 dolla for a bud light at one of his recent 'get togethers' lol permalink award report block reply rebuildingMyself 4 points 2 days ago Then immediately asked for donations to fund his transition team. Hope the voters there get used to that request for every single thing he does permalink parent award report block reply\nrebuildingMyself 4 points 2 days ago Then immediately asked for donations to fund his transition team. Hope the voters there get used to that request for every single thing he does permalink parent award report block reply\nMade_in_America 4 points 2 days ago costume paid for by George Soros and his people. permalink award report block reply\nbarwhack 3 points 2 days ago So that's what they do with the sheep, afterwards. permalink award report block reply YaharaRiver 2 points 2 days ago Crawl inside and lick the interior dry. permalink parent award report block reply\nYaharaRiver 2 points 2 days ago Crawl inside and lick the interior dry. permalink parent award report block reply\nWildStar 3 points 2 days ago Not really accurate; he was quite open about being a communist muslim supremacist. His intentions were obvious, and people voted for it anyway. permalink award report block reply\nkwakkles 3 points 2 days ago The goal of socialism is communism. permalink award report block reply\nKaputtmacher 2 points 2 days ago I don't get it. He wasn't hiding it. permalink award report block reply\nStanwyk74 2 points 2 days ago Is he even dressed up? Seems like he is straight up telling people what he is permalink award report block reply Tellman125 2 points 2 days ago As bad as his rhetoric is, the truth is much worse, because he's just using the socialism stuff to usher in Sharia law and favor Muslims; it's exactly what Sadiq Khan did in London. When he talks, he never just says \"New Yorkers,\" he always follows it with a specfication: \"the New Yorkers I know / I talk to / I hear from / I represent.\" That's his fellow Muslims, the \"brotherhood.\" His newly announced apartment plan is all about taking apartments away from white landlords and white tenants and giving them to Muslim ones, but he frames it as him cracking down on those big mean landlords. permalink parent award report block reply\nTellman125 2 points 2 days ago As bad as his rhetoric is, the truth is much worse, because he's just using the socialism stuff to usher in Sharia law and favor Muslims; it's exactly what Sadiq Khan did in London. When he talks, he never just says \"New Yorkers,\" he always follows it with a specfication: \"the New Yorkers I know / I talk to / I hear from / I represent.\" That's his fellow Muslims, the \"brotherhood.\" His newly announced apartment plan is all about taking apartments away from white landlords and white tenants and giving them to Muslim ones, but he frames it as him cracking down on those big mean landlords. permalink parent award report block reply\nDlanOdcammron 2 points 2 days ago He’s not a wolf in sheep’s clothing. He’s a communist mooslim in communist mooslim clothing. permalink award report block reply Tellman125 1 points 2 days ago But in his TikTok videos, he's a grinning, witty, happy-go-lucky actor strolling around the city and being approached and greeted by adoring fans. They created a celebrity out of him, and his social media team was using popular hashtags of the day to get his videos to the front page. And he used to dress like the  third-world dirt-eating animal he really is, as shown in many videos and photos from the past several years, but now wears a suit, which is his American politician costume. I can't even stand his name, so I call him Moron Scamdummy. permalink parent award report block reply\nTellman125 1 points 2 days ago But in his TikTok videos, he's a grinning, witty, happy-go-lucky actor strolling around the city and being approached and greeted by adoring fans. They created a celebrity out of him, and his social media team was using popular hashtags of the day to get his videos to the front page. And he used to dress like the  third-world dirt-eating animal he really is, as shown in many videos and photos from the past several years, but now wears a suit, which is his American politician costume. I can't even stand his name, so I call him Moron Scamdummy. permalink parent award report block reply\nTellman125 1 points 2 days ago MORON SCAMDUMMY permalink award report block reply\nMagaPhone017 1 points 2 days ago He better not wear that get-up around his Muslim buddies...they may get them a fever , since he doesn't have a visible beard... permalink award report block reply\nBohemyth_2 1 points 2 days ago Cuomo was the devil we knew NYC was the city we knew permalink award report block reply Tellman125 2 points 2 days ago Cuomo did a huge favor for the sane residents of the city by actually staying the race all the way to the general election. If the race was just Scamdummy vs. Sliwa, Sliwa would have gotten even less than the 26% he got last time against Eric Adams. And now Elise Stefanik is already campaigning for governor and aggressively so: https://patriots.win/p/1ARK9hipJW/already-campaigning-elise-stefan/c permalink parent award report block reply\nTellman125 2 points 2 days ago Cuomo did a huge favor for the sane residents of the city by actually staying the race all the way to the general election. If the race was just Scamdummy vs. Sliwa, Sliwa would have gotten even less than the 26% he got last time against Eric Adams. And now Elise Stefanik is already campaigning for governor and aggressively so: https://patriots.win/p/1ARK9hipJW/already-campaigning-elise-stefan/c permalink parent award report block reply\nKricket 1 points 2 days ago They simply deserve what comes next. permalink award report block reply\nancroidubh 1 points 2 days ago Well, muzzles do spend a lot of time inside sheep, so… permalink award report block reply\n2016TrumpMAGA 1 points 2 days ago Cartoon in incorrect.  He was open about exactly who he was. permalink award report block reply\nRiehlpissed 1 points 2 days ago No go zones are already setup and just waiting to close to us “infedels”. Dumb liberals be yelling “Hiel Mandani” as thier being raped and killed. permalink award report block reply\nCharlesWilliams 1 points 2 days ago He’s a furry who dresses up to have carnal relations  with real sheep? permalink award report block reply\nYaharaRiver 1 points 2 days ago Speaking of animal metaphors, this mayoral disaster is a perfect example of letting the camel's nose under the tent.  Amazingly, we are supposed to think this occurred in the midst of overwhelming rejection of pisslam, which has been widespread all over the country and growing. permalink award report block reply\nBBvarn 0 points 2 days ago When do the White liberal cows of NYC start wearing full burqas. That will be a major site improvement for NYC. permalink award report block reply"}