{"id": "1ARK9mHVSS", "contents": "184 $850 to buy fake MD in India to get H1B visa in US posted 13 hours ago by FuckAllDemocrats 9 comments award share report block Info Battle Maiden @info_maiden • 2d @1776General_ For just 75k rupees (~$850), Indians snag fake MDs & unleash 'medical terrorism' on unsuspecting Americans. Never go to an indian doctor.\n9 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget Calumet57 3 points 13 hours ago Few honest Injuns. permalink award report block reply redinmn 3 points 10 hours ago Common sense should tell you that if there were 10,000 engineers in India available to do such a good job, local companies would have hired them.  At the very least, US companies should be questioning how they have so many highly talented people there when their own schools are not capable of pushing out that many that fast. permalink award report block reply The_Emperor 1 points 9 hours ago If you're one in a million talent in India, there are 1500 just like you. permalink parent award report block reply Briben 1 points 6 hours ago Englands national health system in a nutshell. permalink award report block reply IPFreely 1 points 12 hours ago I’ll take two permalink award report block reply SuperDuperBasedMD 1 points 12 hours ago Keep in mind, although the H1b problem is real and it's very important, the reason why it's being algorithmically pushed is because it's being used as a wedge to destroy MAGA. Everyone should read this article. https://theconservativetreehouse.com/blog/2025/11/11/the-2025-maga-fracture-and-the-benefactors-behind-it/ \"This effort to split the MAGA base, using Israel or (insert_next_thing_here) as a wedge issue within the America First movement – only benefits one larger apparatus, the Sea Island billionaire control system.\" permalink award report block reply ChilledCovfefe 2 points 12 hours ago Epstein too. permalink parent award report block reply SuperDuperBasedMD 1 points 12 hours ago 100% permalink parent award report block reply God-is-good 1 points 8 hours ago Is that you formerly based medical doctor ?\nTrying to rebrand with a little super? permalink parent award report block reply\nCalumet57 3 points 13 hours ago Few honest Injuns. permalink award report block reply\nredinmn 3 points 10 hours ago Common sense should tell you that if there were 10,000 engineers in India available to do such a good job, local companies would have hired them.  At the very least, US companies should be questioning how they have so many highly talented people there when their own schools are not capable of pushing out that many that fast. permalink award report block reply The_Emperor 1 points 9 hours ago If you're one in a million talent in India, there are 1500 just like you. permalink parent award report block reply\nThe_Emperor 1 points 9 hours ago If you're one in a million talent in India, there are 1500 just like you. permalink parent award report block reply\nBriben 1 points 6 hours ago Englands national health system in a nutshell. permalink award report block reply\nIPFreely 1 points 12 hours ago I’ll take two permalink award report block reply\nSuperDuperBasedMD 1 points 12 hours ago Keep in mind, although the H1b problem is real and it's very important, the reason why it's being algorithmically pushed is because it's being used as a wedge to destroy MAGA. Everyone should read this article. https://theconservativetreehouse.com/blog/2025/11/11/the-2025-maga-fracture-and-the-benefactors-behind-it/ \"This effort to split the MAGA base, using Israel or (insert_next_thing_here) as a wedge issue within the America First movement – only benefits one larger apparatus, the Sea Island billionaire control system.\" permalink award report block reply ChilledCovfefe 2 points 12 hours ago Epstein too. permalink parent award report block reply SuperDuperBasedMD 1 points 12 hours ago 100% permalink parent award report block reply God-is-good 1 points 8 hours ago Is that you formerly based medical doctor ?\nTrying to rebrand with a little super? permalink parent award report block reply\nChilledCovfefe 2 points 12 hours ago Epstein too. permalink parent award report block reply SuperDuperBasedMD 1 points 12 hours ago 100% permalink parent award report block reply\nSuperDuperBasedMD 1 points 12 hours ago 100% permalink parent award report block reply\nGod-is-good 1 points 8 hours ago Is that you formerly based medical doctor ?\nTrying to rebrand with a little super? permalink parent award report block reply"}