{"id": "1ARK9nPM98", "contents": "6 Off topic PSA of a vulnerability for ALL Android phones (www.youtube.com) posted 6 hours ago by Roadpower 3 comments award share report block\n3 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Roadpower OP 1 points 6 hours ago Pixnapping is a new class of attacks that allows a malicious Android app to stealthily leak information displayed by other Android apps or arbitrary websites. Pixnapping exploits Android APIs and a hardware side channel that affects nearly all modern Android devices. Despite being a major, high severity vulnerability, is currently unpatched. permalink award report block reply SHILL_DETECTOR 1 points 6 hours ago dont use apps on your phone! easy solution. permalink award report block reply nmipede 1 points 5 hours ago While the original exploit method was mitigated in September, Google received an updated attack that demonstrated a bypass for the original fix. Google has developed a more thorough patch to be released with the Android security updates for December. Google says that leveraging this data leak technique requires specific data about the targeted device, which, as the researchers noted, leads to a low success rate. Current verifications found no malicious apps on Google Play leveraging the Pixnapping vulnerability. https://www.bleepingcomputer.com/news/security/new-android-pixnapping-attack-steals-mfa-codes-pixel-by-pixel/ You have to load a malicious app to be exploited. As long as Google pays attention for another 45 days or so to what's going on in the Play store this shouldn't be anything other than a lab rat. Unless you side load stuff in dev mode. Then, maybe. permalink award report block reply\nRoadpower OP 1 points 6 hours ago Pixnapping is a new class of attacks that allows a malicious Android app to stealthily leak information displayed by other Android apps or arbitrary websites. Pixnapping exploits Android APIs and a hardware side channel that affects nearly all modern Android devices. Despite being a major, high severity vulnerability, is currently unpatched. permalink award report block reply\nSHILL_DETECTOR 1 points 6 hours ago dont use apps on your phone! easy solution. permalink award report block reply\nnmipede 1 points 5 hours ago While the original exploit method was mitigated in September, Google received an updated attack that demonstrated a bypass for the original fix. Google has developed a more thorough patch to be released with the Android security updates for December. Google says that leveraging this data leak technique requires specific data about the targeted device, which, as the researchers noted, leads to a low success rate. Current verifications found no malicious apps on Google Play leveraging the Pixnapping vulnerability. https://www.bleepingcomputer.com/news/security/new-android-pixnapping-attack-steals-mfa-codes-pixel-by-pixel/ You have to load a malicious app to be exploited. As long as Google pays attention for another 45 days or so to what's going on in the Play store this shouldn't be anything other than a lab rat. Unless you side load stuff in dev mode. Then, maybe. permalink award report block reply"}