{"id": "1ARK9pf3G4", "contents": "598 Probably YOU GUYS ARE GAY posted 10 hours ago by kek-is-tan 61 comments award share download report block\n61 comments Sort by Top Top New Worst Old Save Around the Web 5 Parasite Causing Foods You Should Stop Eating Right Now Paratoxil HumphreyPlowjogger 25 points 10 hours ago Faggots, yep. permalink award report block reply kek-is-tan OP 6 points 10 hours ago Pillow biters confirmed. permalink parent award report block reply grenades_and_ham 3 points 4 hours ago Power bottoms. permalink parent award report block reply snoopy3210 3 points 10 hours ago the \"hey where's my lube\" type of fed permalink parent award report block reply CaptainCuomo 10 points 9 hours ago On Election Day 2024, Trump was \"plus 3\" among voters under age 30.   Now he's \"minus 40\". If that's due-to a rogue FBI troll farm PsyOp-- they've done a magnificent job of buttfucking America. If that's not the explanation-- and Nick Fuentes is operating independently, according to his own agenda-- then he has done-so despite having every Trusted Institution™ united against him. There's only one way that's possible:  if those opposed to Nick Fuentes left a giant hole in the political landscape, for him to seize, occupy, and expand to fill. Fuentes didn't invent that strategy. 2016 Trump saw the discrepancy between the positions that the Republican Party was willing to occupy/ vs. many many opinions held by the voters... with no leader willing to stand-up for what we actually wanted. Heck, even that retarded hipster Zohran Mamdani saw an opportunity-- when Every Other Candidate on the Dem primary debate stage-- said they would immediately fly to Israel after being elected, first thing.    And No Other Candidate was willing to acknowledge how insanely expensive it is for a young person to start a life in NYC.   (In Mamdani's case-- he was only able to offer brain-dead \"solutions\".  But the voters didn't-even care.  They settled for him as a Protest Vote.  With no obligation to deliver his Communist Promises.) The thing about any leader-- who shows us that a forbidden position Can be claimed & championed-- is that his leadership can't be Un-Done.   A bullet took Charlie Kirk, but he had already showed us the way forward. Only Zohran can negate Mamdani-- by failing to deliver.  Only Nick can cancel Fuentes-- by becoming that-which he formerly denounced.  Only Donald can derail the Trump train. permalink parent award report block reply possibletower -8 points 10 hours ago 100%. Fucking finally. While I disagree with Trump on Chinese student visas he is completely correct about the state of Gen Z today who are poorly educated and can't even pass 1st grade math and reading level when he said Bob the Antifa/BLM mom's basement dweller (who is an American) no fucking way is able to teach young 100 Americans how to build TVs/microchips/furniture when we haven't had TV/chips/furniture factories in America since the 1980s/90s!!! I still haven't seen these faggots' \"American trainers only\" plan to restart our manufacturing and tech factories when the youngest Americans who did manufacturing work in so many of these industries (that are returning to America thanks solely to Trump's economic policies, btw) are in their 60s and 70s now and most of them are dead. I saw bunch of the same people laugh in posts here at Gen Z and Gen Alpha for being piss poor in math/science/reading skills and then bitch about Trump for saying the exact same shit they are laughing at Gen Z/Alpha over, like \"how dare Trump notice what we notice about how poorly educated and dumb young Americans are?\" 🤣 SPEZ: I'm loving the downvotes from all you hypocritical faggots who were just upvoting and shooting the shit about how retarded young Americans are with their 1st grade level math/science/reading skills yet in the next post that shits on Trump for spilling the truth about how poorly educated Gen Z and Gen Alpha are you scream (in Greta's voice) \"how dare you, Orange Man Bad!!!\" permalink parent award report block reply Repentnow 8 points 10 hours ago Gen Z today who are poorly educated Maybe, but people from India are legit retarded. They have the exact same education—as in, word for word. They can't reason. They can't extrapolate. They can't learn. They can't invent. They will be the first nation to be 100% replaced by AI. permalink parent award report block reply RizzlieDoodad 1 points 2 hours ago Literal shit skins that throw poop at each other permalink parent award report block reply RuprechtThaMonkeyBoy -6 points 9 hours ago That’s the most retarded statement I’ve come across all day.\nI’ve got 6 Indian coders on my team and they are excellent. My white coders are equally as good. There’s shit coders everywhere, but to say all Indians can’t reason, extrapolate, or learn is just dumb. Also, I would be thrilled to have a halt on all H1Bs. We’re full. permalink parent award report block reply vegaspatriot1776 1 points 3 hours ago Faggot permalink parent award report block reply guywholikesDjtof2024 5 points 9 hours ago i hate america! america stupid! foreign countries good! what permalink parent award report block reply Wexit-Delecto 21 points 10 hours ago The government is open and the ‘jeet H1Bs are coming. MAGA full steam! permalink award report block reply Necrovoter 4 points 10 hours ago The H1Bs were coming in before.  The new applications have a 100K fee.   This isn't any kind of acceleration of H1B. I'd agree that we need less H1Bs and more effort finding the Americans who are qualified, and more focus on training future Americans for the high H1B usage areas. Trump isn't backtracking.   \"Basket of Deplorables\" didn't work.  \"Garbage People\" didn't work.  \"MAGA is dead\" won't work. permalink parent award report block reply Wexit-Delecto 9 points 10 hours ago The fee should be on every renewal. Otherwise it still makes sense to hire. Jeet for $70k for 3 years than to hire a White, Christian American for $100k for the same time. As it is now, it’s basically saying “okay international megacorps that shouldn’t exist if antitrust law were properly applied, you can replace the American workforce … but give the government a cut!” permalink parent award report block reply Necrovoter 1 points 9 hours ago I've no arguments against any of that, or even more strict rules.  The prices need to start increasing on a schedule that allows time for new students to come through colleges to gain the so called \"talent\" that the companies need. e.g.   5 years from now  200K for first processing and 100K per year.  7 years  - 350K and 150K per year.  10 years 500K and 250K per year.  15 years and 1,000,000 with a 500K per year renewal. If they claim they have to move out of the country, tell them they can no longer ever sell any products or services in the United States, and if they were a US company at startup, they lose all their US physical assets and intellectual properties developed here. permalink parent award report block reply vegaspatriot1776 2 points 3 hours ago Are you referring to those 600,000 chinese students each year? MAGA? permalink parent award report block reply Wexit-Delecto 0 points 1 hour ago What is the advantage of importing poos to reduce the intensity of the market signals? Why not let the market signal right now, hard? That would give everyone with time and money to invest an immediate hint as to what to invest in. permalink parent award report block reply yarg 1 points 3 hours ago Remember when for about 2 days they tried to get \"Dangerous Don\" to stick also. It wasn't perceived in a negative context like they hoped, so they dropped it. permalink parent award report block reply possibletower -10 points 10 hours ago All the anti-Trump bullshit is done by the Ron DeFaggot 2028 people. They always do this astroturf campaign to try to make Ron 2028 a thing. Trump is completely correct about the state of Gen Z today who are poorly educated and can't even pass 1st grade math and reading level when he said Bob the Antifa/BLM mom's basement dweller (who is an American) no fucking way is able to teach young 100 Americans how to build TVs/microchips/furniture when we haven't had TV/chips/furniture factories in America since the 1980s/90s!!! I still haven't seen these faggots' \"American trainers only\" plan to restart our manufacturing and tech factories when the youngest Americans who did manufacturing work in so many of these industries (that are returning to America thanks solely to Trump's economic policies, btw) are in their 60s and 70s now and most of them are dead. I saw bunch of the same people laugh in posts here at Gen Z and Gen Alpha for being piss poor in math/science/reading skills and then bitch about Trump for saying the exact same shit they are laughing at Gen Z/Alpha over, like \"how dare Trump notice what we notice about how poorly educated and dumb young Americans are?\" 🤣 permalink parent award report block reply vegaspatriot1776 2 points 3 hours ago So Make India Great Again? permalink parent award report block reply Necrovoter 1 points 9 hours ago to try to make Ron 2028 a thing. All this clown had to do was completely back Trump, especially  when Trump was running.   That's it. Our educational system isn't putting any emphasis on STEM.  Hell, in 10 years, I wouldn't be shocked if they didn't even know what STEM was.   Society and social media doesn't help, with everyone's focus on making themselves a mini social media star in their own TikTok world. permalink parent award report block reply possibletower -8 points 10 hours ago Ron DeFaggot will never be your POTUS, first of all. Also aren't you the same type of faggots who laugh at Gen Z/Alpha's atrocious math/science/reading skills? So why the fuck are you whining about Trump noticing facts regarding the same poorly educated retarded young Americans that you laugh at? He is completely correct about the state of Gen Z today who are poorly educated and can't even pass 1st grade math and reading level when he said Bob the Antifa/BLM mom's basement dweller (who is an American) no fucking way is able to teach young 100 Americans how to build TVs/microchips/furniture when we haven't had TV/chips/furniture factories in America since the 1980s/90s!!! I still haven't seen these faggots' \"American trainers only\" plan to restart our manufacturing and tech factories when the youngest Americans who did manufacturing work in so many of these industries (that are returning to America thanks solely to Trump's economic policies, btw) are in their 60s and 70s now and most of them are dead. I saw bunch of the same people laugh in posts here at Gen Z and Gen Alpha for being piss poor in math/science/reading skills and then bitch about Trump for saying the exact same shit they are laughing at Gen Z/Alpha over, like \"how dare Trump notice what we notice about how poorly educated and dumb young Americans are?\" 🤣 permalink parent award report block reply Wexit-Delecto 7 points 10 hours ago Make America great again… by replacing those pesky Americans! You know, the ones who made America great the first time but couldn’t possibly do so again for reasons unnose. permalink parent award report block reply vegaspatriot1776 2 points 3 hours ago Make India Great Again is more like it! permalink parent award report block reply Cacciali_Via 1 points 5 hours ago What is \"young 100 Americans\". I mean, other than a phrase no native English speaker would ever use? What brown country are you from? White people do not butcher our language so badly. permalink parent award report block reply TexasBeer 12 points 10 hours ago MAGA isn’t dead, but America First is where things will have to naturally shift toward permalink award report block reply EstadosUnidosPrimero 9 points 10 hours ago Import more H1B's and expedite their visas because Americans have no talent. Bring in 600K more chinese students. Maga is alive? permalink award report block reply possibletower -9 points 10 hours ago Ron DeFaggot will never be your POTUS, first of all. Also aren't you the same type of faggots who laugh at Gen Z/Alpha's atrocious math/science/reading skills? So why the fuck are you whining about Trump noticing facts regarding the same poorly educated retarded young Americans that you laugh at? He is completely correct about the state of Gen Z today who are poorly educated and can't even pass 1st grade math and reading level when he said Bob the Antifa/BLM mom's basement dweller (who is an American) no fucking way is able to teach young 100 Americans how to build TVs/microchips/furniture when we haven't had TV/chips/furniture factories in America since the 1980s/90s!!! I still haven't seen these faggots' \"American trainers only\" plan to restart our manufacturing and tech factories when the youngest Americans who did manufacturing work in so many of these industries (that are returning to America thanks solely to Trump's economic policies, btw) are in their 60s and 70s now and most of them are dead. I saw bunch of the same people laugh in posts here at Gen Z and Gen Alpha for being piss poor in math/science/reading skills and then bitch about Trump for saying the exact same shit they are laughing at Gen Z/Alpha over, like \"how dare Trump notice what we notice about how poorly educated and dumb young Americans are?\" 🤣 permalink parent award report block reply sicarius 3 points 3 hours ago I don't even need to read all that.\nWall of text = retarded dem permalink parent award report block reply DEUSVEULT232 8 points 10 hours ago Yeah, lets not have actual debate about this very polarizing issue.   Just accept that you will be replaced and that is a good thing. permalink award report block reply ParadigmShift2070 6 points 9 hours ago You're a Muslim if you don't support h1b! permalink parent award report block reply lizardo221 1 points 5 hours ago You know we can see you are a new account, right? permalink parent award report block reply Repentnow 8 points 10 hours ago So, are those guys all posting on PDW too? Sure seems that way. permalink award report block reply BlackJack1776 2 points 9 hours ago I'm sure there is a Discord out there at this point. I'll admit Trump has had some bad takes lately, but not to this level. \"The Emperor has no clothes\" is one thing. \"It's all over\" is another. Fortunately, they've overplayed their hand and are now easy to spot. permalink parent award report block reply Cacciali_Via 3 points 5 hours ago Trump's form of MAGA was a great start. Trump brought up so many issues that other candidates wouldn't touch. He is amazing. That said, America First removes the Zionism inherent in Trump's stance on every issue. AF is inevitable as the next step in reclaiming our nation. permalink parent award report block reply DT170x 8 points 10 hours ago Glow OP = FAG OP. permalink award report block reply lifeisahologram 5 points 2 hours ago Pretty sure MAGA is supposed to be America first, but I will always side with whatever side doesn’t support h1bs, doesn’t believe America can’t do certain jobs, doesn’t give money to foreign “Allies” etc permalink award report block reply RobinNet 5 points 9 hours ago Faggots Being Idiots permalink award report block reply BidenSniffsLittleKid 4 points 10 hours ago Somewhere down the line America first turned into American corporations first and they’re not wrong for pointing it out permalink award report block reply Rob55 3 points 3 hours ago MAGA is not all about Trump. It’s bigger. Yes created by Trump but if Trump goes full socialist tomorrow MAGA carries on without him. permalink award report block reply RizzlieDoodad 3 points 2 hours ago You can call em feds all you want. But everything Trump has pushed the last few days is America last. Tell me how 50 year mortgages help the housing crisis. Oh you save a few hundred bucks every month to pay massive interest to the banks. Tell me how speeding up naturalization process for H1Bs is helping America without saying anything about GDP go up. Explain to me how Trump flip flopping on deportations and all the news is literally a drop in the bucket. If deportations don't speed up, we're not even going to be able to remove the 10 million that Biden let in. We need to remove about 50 million. We need a moratorium on immigration. Please explain how this is gonna help the average American. Explain to me how Trump is saying that Americans lack talent. Pissing in your face and calling it rain. All of this is America last. Don't even get me started on the Epstein nonsense either. I voted for Trump and I was excited with the messaging. But after a year, I'm seeing we got the Temu version. Trump was the one who coined the term America first back during his first run. He said on his first inauguration \"From this day forward, it's only going to be America first.\" And so far I'm seeing the boomer version of maga, which was sell out your country for the highest profits. Simple as. permalink award report block reply GainesvilleFlorida 2 points 53 minutes ago Realistically. How could deportations happen faster?\nThe gov moves extremely slow (when folllowing the law). ICE cannot deport at the same rate they were illegally flown in. They aren’t freaking lining up at the airport to leave like they did to come in. The Biden admin didn’t have seemed forces in other countries rounding them up to bring here.\nI’m surprised we even hit 3000 deportations a week. permalink parent award report block reply RizzlieDoodad 1 points 38 minutes ago This is a national emergency permalink parent award report block reply FaustyArchaeus 3 points 10 hours ago Magic fren pure magic permalink award report block reply kek-is-tan OP 3 points 10 hours ago TY fren permalink parent award report block reply projectarcturus 2 points 10 hours ago Ye olde talking points. permalink award report block reply GainesvilleFlorida 2 points 57 minutes ago I was having a good day until I saw this photo that always pisses me off. permalink award report block reply Maga305_47 2 points 1 hour ago 😂😂😂 permalink award report block reply FreeKyleNow 2 points 2 hours ago Has anyone ever done a deep dive to identify these faggots? permalink award report block reply kekranger 1 points 10 hours ago Chinese bot accounts more likely. permalink award report block reply possibletower -6 points 10 hours ago Nick is 100% a Chinese bot account. He is Hitler/Stalin First after all. Winnie the Pooh and Kim Jong un are more of his type of heroes. permalink parent award report block reply xkgb 1 points 2 minutes ago Fuentes is cringe. https://www.vice.com/en/article/hard-not-to-respect-that-why-white-nationalists-are-toasting-the-taliban/ permalink parent award report block reply deleted 1 points 10 hours ago RuprechtThaMonkeyBoy 3 points 10 hours ago Yes, they like kids. permalink parent award report block reply snoopy3210 0 points 10 hours ago Fuentes proving himself to be the ultimate useful idiot once again, talking alone, to a government troll farm. permalink award report block reply Cacciali_Via 2 points 5 hours ago You are just a butt hurt Jew. AF is inevitable. permalink parent award report block reply seeling0 0 points 10 hours ago These guys don't look goatfucker-y enough to be on the \"Trump should stay out of global politics\" team. permalink award report block reply Mhmm2MoreWeeks -6 points 9 hours ago They have but one purpose. To make you openly Racist. Why? Because that is what helps the Globalists and Left the most, politically. So whatever your views, careful where you share. permalink award report block reply sicarius 3 points 3 hours ago Oh no we better watch what we say or the libs might start calling us racist permalink parent award report block reply Cacciali_Via -1 points 5 hours ago Please expound on your nonsensical theory. permalink parent award report block reply\nHumphreyPlowjogger 25 points 10 hours ago Faggots, yep. permalink award report block reply kek-is-tan OP 6 points 10 hours ago Pillow biters confirmed. permalink parent award report block reply grenades_and_ham 3 points 4 hours ago Power bottoms. permalink parent award report block reply snoopy3210 3 points 10 hours ago the \"hey where's my lube\" type of fed permalink parent award report block reply CaptainCuomo 10 points 9 hours ago On Election Day 2024, Trump was \"plus 3\" among voters under age 30.   Now he's \"minus 40\". If that's due-to a rogue FBI troll farm PsyOp-- they've done a magnificent job of buttfucking America. If that's not the explanation-- and Nick Fuentes is operating independently, according to his own agenda-- then he has done-so despite having every Trusted Institution™ united against him. There's only one way that's possible:  if those opposed to Nick Fuentes left a giant hole in the political landscape, for him to seize, occupy, and expand to fill. Fuentes didn't invent that strategy. 2016 Trump saw the discrepancy between the positions that the Republican Party was willing to occupy/ vs. many many opinions held by the voters... with no leader willing to stand-up for what we actually wanted. Heck, even that retarded hipster Zohran Mamdani saw an opportunity-- when Every Other Candidate on the Dem primary debate stage-- said they would immediately fly to Israel after being elected, first thing.    And No Other Candidate was willing to acknowledge how insanely expensive it is for a young person to start a life in NYC.   (In Mamdani's case-- he was only able to offer brain-dead \"solutions\".  But the voters didn't-even care.  They settled for him as a Protest Vote.  With no obligation to deliver his Communist Promises.) The thing about any leader-- who shows us that a forbidden position Can be claimed & championed-- is that his leadership can't be Un-Done.   A bullet took Charlie Kirk, but he had already showed us the way forward. Only Zohran can negate Mamdani-- by failing to deliver.  Only Nick can cancel Fuentes-- by becoming that-which he formerly denounced.  Only Donald can derail the Trump train. permalink parent award report block reply possibletower -8 points 10 hours ago 100%. Fucking finally. While I disagree with Trump on Chinese student visas he is completely correct about the state of Gen Z today who are poorly educated and can't even pass 1st grade math and reading level when he said Bob the Antifa/BLM mom's basement dweller (who is an American) no fucking way is able to teach young 100 Americans how to build TVs/microchips/furniture when we haven't had TV/chips/furniture factories in America since the 1980s/90s!!! I still haven't seen these faggots' \"American trainers only\" plan to restart our manufacturing and tech factories when the youngest Americans who did manufacturing work in so many of these industries (that are returning to America thanks solely to Trump's economic policies, btw) are in their 60s and 70s now and most of them are dead. I saw bunch of the same people laugh in posts here at Gen Z and Gen Alpha for being piss poor in math/science/reading skills and then bitch about Trump for saying the exact same shit they are laughing at Gen Z/Alpha over, like \"how dare Trump notice what we notice about how poorly educated and dumb young Americans are?\" 🤣 SPEZ: I'm loving the downvotes from all you hypocritical faggots who were just upvoting and shooting the shit about how retarded young Americans are with their 1st grade level math/science/reading skills yet in the next post that shits on Trump for spilling the truth about how poorly educated Gen Z and Gen Alpha are you scream (in Greta's voice) \"how dare you, Orange Man Bad!!!\" permalink parent award report block reply Repentnow 8 points 10 hours ago Gen Z today who are poorly educated Maybe, but people from India are legit retarded. They have the exact same education—as in, word for word. They can't reason. They can't extrapolate. They can't learn. They can't invent. They will be the first nation to be 100% replaced by AI. permalink parent award report block reply RizzlieDoodad 1 points 2 hours ago Literal shit skins that throw poop at each other permalink parent award report block reply RuprechtThaMonkeyBoy -6 points 9 hours ago That’s the most retarded statement I’ve come across all day.\nI’ve got 6 Indian coders on my team and they are excellent. My white coders are equally as good. There’s shit coders everywhere, but to say all Indians can’t reason, extrapolate, or learn is just dumb. Also, I would be thrilled to have a halt on all H1Bs. We’re full. permalink parent award report block reply vegaspatriot1776 1 points 3 hours ago Faggot permalink parent award report block reply guywholikesDjtof2024 5 points 9 hours ago i hate america! america stupid! foreign countries good! what permalink parent award report block reply\nkek-is-tan OP 6 points 10 hours ago Pillow biters confirmed. permalink parent award report block reply grenades_and_ham 3 points 4 hours ago Power bottoms. permalink parent award report block reply snoopy3210 3 points 10 hours ago the \"hey where's my lube\" type of fed permalink parent award report block reply CaptainCuomo 10 points 9 hours ago On Election Day 2024, Trump was \"plus 3\" among voters under age 30.   Now he's \"minus 40\". If that's due-to a rogue FBI troll farm PsyOp-- they've done a magnificent job of buttfucking America. If that's not the explanation-- and Nick Fuentes is operating independently, according to his own agenda-- then he has done-so despite having every Trusted Institution™ united against him. There's only one way that's possible:  if those opposed to Nick Fuentes left a giant hole in the political landscape, for him to seize, occupy, and expand to fill. Fuentes didn't invent that strategy. 2016 Trump saw the discrepancy between the positions that the Republican Party was willing to occupy/ vs. many many opinions held by the voters... with no leader willing to stand-up for what we actually wanted. Heck, even that retarded hipster Zohran Mamdani saw an opportunity-- when Every Other Candidate on the Dem primary debate stage-- said they would immediately fly to Israel after being elected, first thing.    And No Other Candidate was willing to acknowledge how insanely expensive it is for a young person to start a life in NYC.   (In Mamdani's case-- he was only able to offer brain-dead \"solutions\".  But the voters didn't-even care.  They settled for him as a Protest Vote.  With no obligation to deliver his Communist Promises.) The thing about any leader-- who shows us that a forbidden position Can be claimed & championed-- is that his leadership can't be Un-Done.   A bullet took Charlie Kirk, but he had already showed us the way forward. Only Zohran can negate Mamdani-- by failing to deliver.  Only Nick can cancel Fuentes-- by becoming that-which he formerly denounced.  Only Donald can derail the Trump train. permalink parent award report block reply\ngrenades_and_ham 3 points 4 hours ago Power bottoms. permalink parent award report block reply\nsnoopy3210 3 points 10 hours ago the \"hey where's my lube\" type of fed permalink parent award report block reply CaptainCuomo 10 points 9 hours ago On Election Day 2024, Trump was \"plus 3\" among voters under age 30.   Now he's \"minus 40\". If that's due-to a rogue FBI troll farm PsyOp-- they've done a magnificent job of buttfucking America. If that's not the explanation-- and Nick Fuentes is operating independently, according to his own agenda-- then he has done-so despite having every Trusted Institution™ united against him. There's only one way that's possible:  if those opposed to Nick Fuentes left a giant hole in the political landscape, for him to seize, occupy, and expand to fill. Fuentes didn't invent that strategy. 2016 Trump saw the discrepancy between the positions that the Republican Party was willing to occupy/ vs. many many opinions held by the voters... with no leader willing to stand-up for what we actually wanted. Heck, even that retarded hipster Zohran Mamdani saw an opportunity-- when Every Other Candidate on the Dem primary debate stage-- said they would immediately fly to Israel after being elected, first thing.    And No Other Candidate was willing to acknowledge how insanely expensive it is for a young person to start a life in NYC.   (In Mamdani's case-- he was only able to offer brain-dead \"solutions\".  But the voters didn't-even care.  They settled for him as a Protest Vote.  With no obligation to deliver his Communist Promises.) The thing about any leader-- who shows us that a forbidden position Can be claimed & championed-- is that his leadership can't be Un-Done.   A bullet took Charlie Kirk, but he had already showed us the way forward. Only Zohran can negate Mamdani-- by failing to deliver.  Only Nick can cancel Fuentes-- by becoming that-which he formerly denounced.  Only Donald can derail the Trump train. permalink parent award report block reply\nCaptainCuomo 10 points 9 hours ago On Election Day 2024, Trump was \"plus 3\" among voters under age 30.   Now he's \"minus 40\". If that's due-to a rogue FBI troll farm PsyOp-- they've done a magnificent job of buttfucking America. If that's not the explanation-- and Nick Fuentes is operating independently, according to his own agenda-- then he has done-so despite having every Trusted Institution™ united against him. There's only one way that's possible:  if those opposed to Nick Fuentes left a giant hole in the political landscape, for him to seize, occupy, and expand to fill. Fuentes didn't invent that strategy. 2016 Trump saw the discrepancy between the positions that the Republican Party was willing to occupy/ vs. many many opinions held by the voters... with no leader willing to stand-up for what we actually wanted. Heck, even that retarded hipster Zohran Mamdani saw an opportunity-- when Every Other Candidate on the Dem primary debate stage-- said they would immediately fly to Israel after being elected, first thing.    And No Other Candidate was willing to acknowledge how insanely expensive it is for a young person to start a life in NYC.   (In Mamdani's case-- he was only able to offer brain-dead \"solutions\".  But the voters didn't-even care.  They settled for him as a Protest Vote.  With no obligation to deliver his Communist Promises.) The thing about any leader-- who shows us that a forbidden position Can be claimed & championed-- is that his leadership can't be Un-Done.   A bullet took Charlie Kirk, but he had already showed us the way forward. Only Zohran can negate Mamdani-- by failing to deliver.  Only Nick can cancel Fuentes-- by becoming that-which he formerly denounced.  Only Donald can derail the Trump train. permalink parent award report block reply\npossibletower -8 points 10 hours ago 100%. Fucking finally. While I disagree with Trump on Chinese student visas he is completely correct about the state of Gen Z today who are poorly educated and can't even pass 1st grade math and reading level when he said Bob the Antifa/BLM mom's basement dweller (who is an American) no fucking way is able to teach young 100 Americans how to build TVs/microchips/furniture when we haven't had TV/chips/furniture factories in America since the 1980s/90s!!! I still haven't seen these faggots' \"American trainers only\" plan to restart our manufacturing and tech factories when the youngest Americans who did manufacturing work in so many of these industries (that are returning to America thanks solely to Trump's economic policies, btw) are in their 60s and 70s now and most of them are dead. I saw bunch of the same people laugh in posts here at Gen Z and Gen Alpha for being piss poor in math/science/reading skills and then bitch about Trump for saying the exact same shit they are laughing at Gen Z/Alpha over, like \"how dare Trump notice what we notice about how poorly educated and dumb young Americans are?\" 🤣 SPEZ: I'm loving the downvotes from all you hypocritical faggots who were just upvoting and shooting the shit about how retarded young Americans are with their 1st grade level math/science/reading skills yet in the next post that shits on Trump for spilling the truth about how poorly educated Gen Z and Gen Alpha are you scream (in Greta's voice) \"how dare you, Orange Man Bad!!!\" permalink parent award report block reply Repentnow 8 points 10 hours ago Gen Z today who are poorly educated Maybe, but people from India are legit retarded. They have the exact same education—as in, word for word. They can't reason. They can't extrapolate. They can't learn. They can't invent. They will be the first nation to be 100% replaced by AI. permalink parent award report block reply RizzlieDoodad 1 points 2 hours ago Literal shit skins that throw poop at each other permalink parent award report block reply RuprechtThaMonkeyBoy -6 points 9 hours ago That’s the most retarded statement I’ve come across all day.\nI’ve got 6 Indian coders on my team and they are excellent. My white coders are equally as good. There’s shit coders everywhere, but to say all Indians can’t reason, extrapolate, or learn is just dumb. Also, I would be thrilled to have a halt on all H1Bs. We’re full. permalink parent award report block reply vegaspatriot1776 1 points 3 hours ago Faggot permalink parent award report block reply guywholikesDjtof2024 5 points 9 hours ago i hate america! america stupid! foreign countries good! what permalink parent award report block reply\nRepentnow 8 points 10 hours ago Gen Z today who are poorly educated Maybe, but people from India are legit retarded. They have the exact same education—as in, word for word. They can't reason. They can't extrapolate. They can't learn. They can't invent. They will be the first nation to be 100% replaced by AI. permalink parent award report block reply RizzlieDoodad 1 points 2 hours ago Literal shit skins that throw poop at each other permalink parent award report block reply RuprechtThaMonkeyBoy -6 points 9 hours ago That’s the most retarded statement I’ve come across all day.\nI’ve got 6 Indian coders on my team and they are excellent. My white coders are equally as good. There’s shit coders everywhere, but to say all Indians can’t reason, extrapolate, or learn is just dumb. Also, I would be thrilled to have a halt on all H1Bs. We’re full. permalink parent award report block reply vegaspatriot1776 1 points 3 hours ago Faggot permalink parent award report block reply\nRizzlieDoodad 1 points 2 hours ago Literal shit skins that throw poop at each other permalink parent award report block reply\nRuprechtThaMonkeyBoy -6 points 9 hours ago That’s the most retarded statement I’ve come across all day.\nI’ve got 6 Indian coders on my team and they are excellent. My white coders are equally as good. There’s shit coders everywhere, but to say all Indians can’t reason, extrapolate, or learn is just dumb. Also, I would be thrilled to have a halt on all H1Bs. We’re full. permalink parent award report block reply vegaspatriot1776 1 points 3 hours ago Faggot permalink parent award report block reply\nvegaspatriot1776 1 points 3 hours ago Faggot permalink parent award report block reply\nguywholikesDjtof2024 5 points 9 hours ago i hate america! america stupid! foreign countries good! what permalink parent award report block reply\nWexit-Delecto 21 points 10 hours ago The government is open and the ‘jeet H1Bs are coming. MAGA full steam! permalink award report block reply Necrovoter 4 points 10 hours ago The H1Bs were coming in before.  The new applications have a 100K fee.   This isn't any kind of acceleration of H1B. I'd agree that we need less H1Bs and more effort finding the Americans who are qualified, and more focus on training future Americans for the high H1B usage areas. Trump isn't backtracking.   \"Basket of Deplorables\" didn't work.  \"Garbage People\" didn't work.  \"MAGA is dead\" won't work. permalink parent award report block reply Wexit-Delecto 9 points 10 hours ago The fee should be on every renewal. Otherwise it still makes sense to hire. Jeet for $70k for 3 years than to hire a White, Christian American for $100k for the same time. As it is now, it’s basically saying “okay international megacorps that shouldn’t exist if antitrust law were properly applied, you can replace the American workforce … but give the government a cut!” permalink parent award report block reply Necrovoter 1 points 9 hours ago I've no arguments against any of that, or even more strict rules.  The prices need to start increasing on a schedule that allows time for new students to come through colleges to gain the so called \"talent\" that the companies need. e.g.   5 years from now  200K for first processing and 100K per year.  7 years  - 350K and 150K per year.  10 years 500K and 250K per year.  15 years and 1,000,000 with a 500K per year renewal. If they claim they have to move out of the country, tell them they can no longer ever sell any products or services in the United States, and if they were a US company at startup, they lose all their US physical assets and intellectual properties developed here. permalink parent award report block reply vegaspatriot1776 2 points 3 hours ago Are you referring to those 600,000 chinese students each year? MAGA? permalink parent award report block reply Wexit-Delecto 0 points 1 hour ago What is the advantage of importing poos to reduce the intensity of the market signals? Why not let the market signal right now, hard? That would give everyone with time and money to invest an immediate hint as to what to invest in. permalink parent award report block reply yarg 1 points 3 hours ago Remember when for about 2 days they tried to get \"Dangerous Don\" to stick also. It wasn't perceived in a negative context like they hoped, so they dropped it. permalink parent award report block reply possibletower -10 points 10 hours ago All the anti-Trump bullshit is done by the Ron DeFaggot 2028 people. They always do this astroturf campaign to try to make Ron 2028 a thing. Trump is completely correct about the state of Gen Z today who are poorly educated and can't even pass 1st grade math and reading level when he said Bob the Antifa/BLM mom's basement dweller (who is an American) no fucking way is able to teach young 100 Americans how to build TVs/microchips/furniture when we haven't had TV/chips/furniture factories in America since the 1980s/90s!!! I still haven't seen these faggots' \"American trainers only\" plan to restart our manufacturing and tech factories when the youngest Americans who did manufacturing work in so many of these industries (that are returning to America thanks solely to Trump's economic policies, btw) are in their 60s and 70s now and most of them are dead. I saw bunch of the same people laugh in posts here at Gen Z and Gen Alpha for being piss poor in math/science/reading skills and then bitch about Trump for saying the exact same shit they are laughing at Gen Z/Alpha over, like \"how dare Trump notice what we notice about how poorly educated and dumb young Americans are?\" 🤣 permalink parent award report block reply vegaspatriot1776 2 points 3 hours ago So Make India Great Again? permalink parent award report block reply Necrovoter 1 points 9 hours ago to try to make Ron 2028 a thing. All this clown had to do was completely back Trump, especially  when Trump was running.   That's it. Our educational system isn't putting any emphasis on STEM.  Hell, in 10 years, I wouldn't be shocked if they didn't even know what STEM was.   Society and social media doesn't help, with everyone's focus on making themselves a mini social media star in their own TikTok world. permalink parent award report block reply possibletower -8 points 10 hours ago Ron DeFaggot will never be your POTUS, first of all. Also aren't you the same type of faggots who laugh at Gen Z/Alpha's atrocious math/science/reading skills? So why the fuck are you whining about Trump noticing facts regarding the same poorly educated retarded young Americans that you laugh at? He is completely correct about the state of Gen Z today who are poorly educated and can't even pass 1st grade math and reading level when he said Bob the Antifa/BLM mom's basement dweller (who is an American) no fucking way is able to teach young 100 Americans how to build TVs/microchips/furniture when we haven't had TV/chips/furniture factories in America since the 1980s/90s!!! I still haven't seen these faggots' \"American trainers only\" plan to restart our manufacturing and tech factories when the youngest Americans who did manufacturing work in so many of these industries (that are returning to America thanks solely to Trump's economic policies, btw) are in their 60s and 70s now and most of them are dead. I saw bunch of the same people laugh in posts here at Gen Z and Gen Alpha for being piss poor in math/science/reading skills and then bitch about Trump for saying the exact same shit they are laughing at Gen Z/Alpha over, like \"how dare Trump notice what we notice about how poorly educated and dumb young Americans are?\" 🤣 permalink parent award report block reply Wexit-Delecto 7 points 10 hours ago Make America great again… by replacing those pesky Americans! You know, the ones who made America great the first time but couldn’t possibly do so again for reasons unnose. permalink parent award report block reply vegaspatriot1776 2 points 3 hours ago Make India Great Again is more like it! permalink parent award report block reply Cacciali_Via 1 points 5 hours ago What is \"young 100 Americans\". I mean, other than a phrase no native English speaker would ever use? What brown country are you from? White people do not butcher our language so badly. permalink parent award report block reply\nNecrovoter 4 points 10 hours ago The H1Bs were coming in before.  The new applications have a 100K fee.   This isn't any kind of acceleration of H1B. I'd agree that we need less H1Bs and more effort finding the Americans who are qualified, and more focus on training future Americans for the high H1B usage areas. Trump isn't backtracking.   \"Basket of Deplorables\" didn't work.  \"Garbage People\" didn't work.  \"MAGA is dead\" won't work. permalink parent award report block reply Wexit-Delecto 9 points 10 hours ago The fee should be on every renewal. Otherwise it still makes sense to hire. Jeet for $70k for 3 years than to hire a White, Christian American for $100k for the same time. As it is now, it’s basically saying “okay international megacorps that shouldn’t exist if antitrust law were properly applied, you can replace the American workforce … but give the government a cut!” permalink parent award report block reply Necrovoter 1 points 9 hours ago I've no arguments against any of that, or even more strict rules.  The prices need to start increasing on a schedule that allows time for new students to come through colleges to gain the so called \"talent\" that the companies need. e.g.   5 years from now  200K for first processing and 100K per year.  7 years  - 350K and 150K per year.  10 years 500K and 250K per year.  15 years and 1,000,000 with a 500K per year renewal. If they claim they have to move out of the country, tell them they can no longer ever sell any products or services in the United States, and if they were a US company at startup, they lose all their US physical assets and intellectual properties developed here. permalink parent award report block reply vegaspatriot1776 2 points 3 hours ago Are you referring to those 600,000 chinese students each year? MAGA? permalink parent award report block reply Wexit-Delecto 0 points 1 hour ago What is the advantage of importing poos to reduce the intensity of the market signals? Why not let the market signal right now, hard? That would give everyone with time and money to invest an immediate hint as to what to invest in. permalink parent award report block reply yarg 1 points 3 hours ago Remember when for about 2 days they tried to get \"Dangerous Don\" to stick also. It wasn't perceived in a negative context like they hoped, so they dropped it. permalink parent award report block reply possibletower -10 points 10 hours ago All the anti-Trump bullshit is done by the Ron DeFaggot 2028 people. They always do this astroturf campaign to try to make Ron 2028 a thing. Trump is completely correct about the state of Gen Z today who are poorly educated and can't even pass 1st grade math and reading level when he said Bob the Antifa/BLM mom's basement dweller (who is an American) no fucking way is able to teach young 100 Americans how to build TVs/microchips/furniture when we haven't had TV/chips/furniture factories in America since the 1980s/90s!!! I still haven't seen these faggots' \"American trainers only\" plan to restart our manufacturing and tech factories when the youngest Americans who did manufacturing work in so many of these industries (that are returning to America thanks solely to Trump's economic policies, btw) are in their 60s and 70s now and most of them are dead. I saw bunch of the same people laugh in posts here at Gen Z and Gen Alpha for being piss poor in math/science/reading skills and then bitch about Trump for saying the exact same shit they are laughing at Gen Z/Alpha over, like \"how dare Trump notice what we notice about how poorly educated and dumb young Americans are?\" 🤣 permalink parent award report block reply vegaspatriot1776 2 points 3 hours ago So Make India Great Again? permalink parent award report block reply Necrovoter 1 points 9 hours ago to try to make Ron 2028 a thing. All this clown had to do was completely back Trump, especially  when Trump was running.   That's it. Our educational system isn't putting any emphasis on STEM.  Hell, in 10 years, I wouldn't be shocked if they didn't even know what STEM was.   Society and social media doesn't help, with everyone's focus on making themselves a mini social media star in their own TikTok world. permalink parent award report block reply\nWexit-Delecto 9 points 10 hours ago The fee should be on every renewal. Otherwise it still makes sense to hire. Jeet for $70k for 3 years than to hire a White, Christian American for $100k for the same time. As it is now, it’s basically saying “okay international megacorps that shouldn’t exist if antitrust law were properly applied, you can replace the American workforce … but give the government a cut!” permalink parent award report block reply Necrovoter 1 points 9 hours ago I've no arguments against any of that, or even more strict rules.  The prices need to start increasing on a schedule that allows time for new students to come through colleges to gain the so called \"talent\" that the companies need. e.g.   5 years from now  200K for first processing and 100K per year.  7 years  - 350K and 150K per year.  10 years 500K and 250K per year.  15 years and 1,000,000 with a 500K per year renewal. If they claim they have to move out of the country, tell them they can no longer ever sell any products or services in the United States, and if they were a US company at startup, they lose all their US physical assets and intellectual properties developed here. permalink parent award report block reply vegaspatriot1776 2 points 3 hours ago Are you referring to those 600,000 chinese students each year? MAGA? permalink parent award report block reply Wexit-Delecto 0 points 1 hour ago What is the advantage of importing poos to reduce the intensity of the market signals? Why not let the market signal right now, hard? That would give everyone with time and money to invest an immediate hint as to what to invest in. permalink parent award report block reply\nNecrovoter 1 points 9 hours ago I've no arguments against any of that, or even more strict rules.  The prices need to start increasing on a schedule that allows time for new students to come through colleges to gain the so called \"talent\" that the companies need. e.g.   5 years from now  200K for first processing and 100K per year.  7 years  - 350K and 150K per year.  10 years 500K and 250K per year.  15 years and 1,000,000 with a 500K per year renewal. If they claim they have to move out of the country, tell them they can no longer ever sell any products or services in the United States, and if they were a US company at startup, they lose all their US physical assets and intellectual properties developed here. permalink parent award report block reply vegaspatriot1776 2 points 3 hours ago Are you referring to those 600,000 chinese students each year? MAGA? permalink parent award report block reply Wexit-Delecto 0 points 1 hour ago What is the advantage of importing poos to reduce the intensity of the market signals? Why not let the market signal right now, hard? That would give everyone with time and money to invest an immediate hint as to what to invest in. permalink parent award report block reply\nvegaspatriot1776 2 points 3 hours ago Are you referring to those 600,000 chinese students each year? MAGA? permalink parent award report block reply\nWexit-Delecto 0 points 1 hour ago What is the advantage of importing poos to reduce the intensity of the market signals? Why not let the market signal right now, hard? That would give everyone with time and money to invest an immediate hint as to what to invest in. permalink parent award report block reply\nyarg 1 points 3 hours ago Remember when for about 2 days they tried to get \"Dangerous Don\" to stick also. It wasn't perceived in a negative context like they hoped, so they dropped it. permalink parent award report block reply\npossibletower -10 points 10 hours ago All the anti-Trump bullshit is done by the Ron DeFaggot 2028 people. They always do this astroturf campaign to try to make Ron 2028 a thing. Trump is completely correct about the state of Gen Z today who are poorly educated and can't even pass 1st grade math and reading level when he said Bob the Antifa/BLM mom's basement dweller (who is an American) no fucking way is able to teach young 100 Americans how to build TVs/microchips/furniture when we haven't had TV/chips/furniture factories in America since the 1980s/90s!!! I still haven't seen these faggots' \"American trainers only\" plan to restart our manufacturing and tech factories when the youngest Americans who did manufacturing work in so many of these industries (that are returning to America thanks solely to Trump's economic policies, btw) are in their 60s and 70s now and most of them are dead. I saw bunch of the same people laugh in posts here at Gen Z and Gen Alpha for being piss poor in math/science/reading skills and then bitch about Trump for saying the exact same shit they are laughing at Gen Z/Alpha over, like \"how dare Trump notice what we notice about how poorly educated and dumb young Americans are?\" 🤣 permalink parent award report block reply vegaspatriot1776 2 points 3 hours ago So Make India Great Again? permalink parent award report block reply Necrovoter 1 points 9 hours ago to try to make Ron 2028 a thing. All this clown had to do was completely back Trump, especially  when Trump was running.   That's it. Our educational system isn't putting any emphasis on STEM.  Hell, in 10 years, I wouldn't be shocked if they didn't even know what STEM was.   Society and social media doesn't help, with everyone's focus on making themselves a mini social media star in their own TikTok world. permalink parent award report block reply\nvegaspatriot1776 2 points 3 hours ago So Make India Great Again? permalink parent award report block reply\nNecrovoter 1 points 9 hours ago to try to make Ron 2028 a thing. All this clown had to do was completely back Trump, especially  when Trump was running.   That's it. Our educational system isn't putting any emphasis on STEM.  Hell, in 10 years, I wouldn't be shocked if they didn't even know what STEM was.   Society and social media doesn't help, with everyone's focus on making themselves a mini social media star in their own TikTok world. permalink parent award report block reply\npossibletower -8 points 10 hours ago Ron DeFaggot will never be your POTUS, first of all. Also aren't you the same type of faggots who laugh at Gen Z/Alpha's atrocious math/science/reading skills? So why the fuck are you whining about Trump noticing facts regarding the same poorly educated retarded young Americans that you laugh at? He is completely correct about the state of Gen Z today who are poorly educated and can't even pass 1st grade math and reading level when he said Bob the Antifa/BLM mom's basement dweller (who is an American) no fucking way is able to teach young 100 Americans how to build TVs/microchips/furniture when we haven't had TV/chips/furniture factories in America since the 1980s/90s!!! I still haven't seen these faggots' \"American trainers only\" plan to restart our manufacturing and tech factories when the youngest Americans who did manufacturing work in so many of these industries (that are returning to America thanks solely to Trump's economic policies, btw) are in their 60s and 70s now and most of them are dead. I saw bunch of the same people laugh in posts here at Gen Z and Gen Alpha for being piss poor in math/science/reading skills and then bitch about Trump for saying the exact same shit they are laughing at Gen Z/Alpha over, like \"how dare Trump notice what we notice about how poorly educated and dumb young Americans are?\" 🤣 permalink parent award report block reply Wexit-Delecto 7 points 10 hours ago Make America great again… by replacing those pesky Americans! You know, the ones who made America great the first time but couldn’t possibly do so again for reasons unnose. permalink parent award report block reply vegaspatriot1776 2 points 3 hours ago Make India Great Again is more like it! permalink parent award report block reply Cacciali_Via 1 points 5 hours ago What is \"young 100 Americans\". I mean, other than a phrase no native English speaker would ever use? What brown country are you from? White people do not butcher our language so badly. permalink parent award report block reply\nWexit-Delecto 7 points 10 hours ago Make America great again… by replacing those pesky Americans! You know, the ones who made America great the first time but couldn’t possibly do so again for reasons unnose. permalink parent award report block reply vegaspatriot1776 2 points 3 hours ago Make India Great Again is more like it! permalink parent award report block reply\nvegaspatriot1776 2 points 3 hours ago Make India Great Again is more like it! permalink parent award report block reply\nCacciali_Via 1 points 5 hours ago What is \"young 100 Americans\". I mean, other than a phrase no native English speaker would ever use? What brown country are you from? White people do not butcher our language so badly. permalink parent award report block reply\nTexasBeer 12 points 10 hours ago MAGA isn’t dead, but America First is where things will have to naturally shift toward permalink award report block reply\nEstadosUnidosPrimero 9 points 10 hours ago Import more H1B's and expedite their visas because Americans have no talent. Bring in 600K more chinese students. Maga is alive? permalink award report block reply possibletower -9 points 10 hours ago Ron DeFaggot will never be your POTUS, first of all. Also aren't you the same type of faggots who laugh at Gen Z/Alpha's atrocious math/science/reading skills? So why the fuck are you whining about Trump noticing facts regarding the same poorly educated retarded young Americans that you laugh at? He is completely correct about the state of Gen Z today who are poorly educated and can't even pass 1st grade math and reading level when he said Bob the Antifa/BLM mom's basement dweller (who is an American) no fucking way is able to teach young 100 Americans how to build TVs/microchips/furniture when we haven't had TV/chips/furniture factories in America since the 1980s/90s!!! I still haven't seen these faggots' \"American trainers only\" plan to restart our manufacturing and tech factories when the youngest Americans who did manufacturing work in so many of these industries (that are returning to America thanks solely to Trump's economic policies, btw) are in their 60s and 70s now and most of them are dead. I saw bunch of the same people laugh in posts here at Gen Z and Gen Alpha for being piss poor in math/science/reading skills and then bitch about Trump for saying the exact same shit they are laughing at Gen Z/Alpha over, like \"how dare Trump notice what we notice about how poorly educated and dumb young Americans are?\" 🤣 permalink parent award report block reply sicarius 3 points 3 hours ago I don't even need to read all that.\nWall of text = retarded dem permalink parent award report block reply\npossibletower -9 points 10 hours ago Ron DeFaggot will never be your POTUS, first of all. Also aren't you the same type of faggots who laugh at Gen Z/Alpha's atrocious math/science/reading skills? So why the fuck are you whining about Trump noticing facts regarding the same poorly educated retarded young Americans that you laugh at? He is completely correct about the state of Gen Z today who are poorly educated and can't even pass 1st grade math and reading level when he said Bob the Antifa/BLM mom's basement dweller (who is an American) no fucking way is able to teach young 100 Americans how to build TVs/microchips/furniture when we haven't had TV/chips/furniture factories in America since the 1980s/90s!!! I still haven't seen these faggots' \"American trainers only\" plan to restart our manufacturing and tech factories when the youngest Americans who did manufacturing work in so many of these industries (that are returning to America thanks solely to Trump's economic policies, btw) are in their 60s and 70s now and most of them are dead. I saw bunch of the same people laugh in posts here at Gen Z and Gen Alpha for being piss poor in math/science/reading skills and then bitch about Trump for saying the exact same shit they are laughing at Gen Z/Alpha over, like \"how dare Trump notice what we notice about how poorly educated and dumb young Americans are?\" 🤣 permalink parent award report block reply sicarius 3 points 3 hours ago I don't even need to read all that.\nWall of text = retarded dem permalink parent award report block reply\nsicarius 3 points 3 hours ago I don't even need to read all that.\nWall of text = retarded dem permalink parent award report block reply\nDEUSVEULT232 8 points 10 hours ago Yeah, lets not have actual debate about this very polarizing issue.   Just accept that you will be replaced and that is a good thing. permalink award report block reply ParadigmShift2070 6 points 9 hours ago You're a Muslim if you don't support h1b! permalink parent award report block reply lizardo221 1 points 5 hours ago You know we can see you are a new account, right? permalink parent award report block reply\nParadigmShift2070 6 points 9 hours ago You're a Muslim if you don't support h1b! permalink parent award report block reply\nlizardo221 1 points 5 hours ago You know we can see you are a new account, right? permalink parent award report block reply\nRepentnow 8 points 10 hours ago So, are those guys all posting on PDW too? Sure seems that way. permalink award report block reply BlackJack1776 2 points 9 hours ago I'm sure there is a Discord out there at this point. I'll admit Trump has had some bad takes lately, but not to this level. \"The Emperor has no clothes\" is one thing. \"It's all over\" is another. Fortunately, they've overplayed their hand and are now easy to spot. permalink parent award report block reply Cacciali_Via 3 points 5 hours ago Trump's form of MAGA was a great start. Trump brought up so many issues that other candidates wouldn't touch. He is amazing. That said, America First removes the Zionism inherent in Trump's stance on every issue. AF is inevitable as the next step in reclaiming our nation. permalink parent award report block reply\nBlackJack1776 2 points 9 hours ago I'm sure there is a Discord out there at this point. I'll admit Trump has had some bad takes lately, but not to this level. \"The Emperor has no clothes\" is one thing. \"It's all over\" is another. Fortunately, they've overplayed their hand and are now easy to spot. permalink parent award report block reply Cacciali_Via 3 points 5 hours ago Trump's form of MAGA was a great start. Trump brought up so many issues that other candidates wouldn't touch. He is amazing. That said, America First removes the Zionism inherent in Trump's stance on every issue. AF is inevitable as the next step in reclaiming our nation. permalink parent award report block reply\nCacciali_Via 3 points 5 hours ago Trump's form of MAGA was a great start. Trump brought up so many issues that other candidates wouldn't touch. He is amazing. That said, America First removes the Zionism inherent in Trump's stance on every issue. AF is inevitable as the next step in reclaiming our nation. permalink parent award report block reply\nDT170x 8 points 10 hours ago Glow OP = FAG OP. permalink award report block reply\nlifeisahologram 5 points 2 hours ago Pretty sure MAGA is supposed to be America first, but I will always side with whatever side doesn’t support h1bs, doesn’t believe America can’t do certain jobs, doesn’t give money to foreign “Allies” etc permalink award report block reply\nRobinNet 5 points 9 hours ago Faggots Being Idiots permalink award report block reply\nBidenSniffsLittleKid 4 points 10 hours ago Somewhere down the line America first turned into American corporations first and they’re not wrong for pointing it out permalink award report block reply\nRob55 3 points 3 hours ago MAGA is not all about Trump. It’s bigger. Yes created by Trump but if Trump goes full socialist tomorrow MAGA carries on without him. permalink award report block reply\nRizzlieDoodad 3 points 2 hours ago You can call em feds all you want. But everything Trump has pushed the last few days is America last. Tell me how 50 year mortgages help the housing crisis. Oh you save a few hundred bucks every month to pay massive interest to the banks. Tell me how speeding up naturalization process for H1Bs is helping America without saying anything about GDP go up. Explain to me how Trump flip flopping on deportations and all the news is literally a drop in the bucket. If deportations don't speed up, we're not even going to be able to remove the 10 million that Biden let in. We need to remove about 50 million. We need a moratorium on immigration. Please explain how this is gonna help the average American. Explain to me how Trump is saying that Americans lack talent. Pissing in your face and calling it rain. All of this is America last. Don't even get me started on the Epstein nonsense either. I voted for Trump and I was excited with the messaging. But after a year, I'm seeing we got the Temu version. Trump was the one who coined the term America first back during his first run. He said on his first inauguration \"From this day forward, it's only going to be America first.\" And so far I'm seeing the boomer version of maga, which was sell out your country for the highest profits. Simple as. permalink award report block reply GainesvilleFlorida 2 points 53 minutes ago Realistically. How could deportations happen faster?\nThe gov moves extremely slow (when folllowing the law). ICE cannot deport at the same rate they were illegally flown in. They aren’t freaking lining up at the airport to leave like they did to come in. The Biden admin didn’t have seemed forces in other countries rounding them up to bring here.\nI’m surprised we even hit 3000 deportations a week. permalink parent award report block reply RizzlieDoodad 1 points 38 minutes ago This is a national emergency permalink parent award report block reply\nGainesvilleFlorida 2 points 53 minutes ago Realistically. How could deportations happen faster?\nThe gov moves extremely slow (when folllowing the law). ICE cannot deport at the same rate they were illegally flown in. They aren’t freaking lining up at the airport to leave like they did to come in. The Biden admin didn’t have seemed forces in other countries rounding them up to bring here.\nI’m surprised we even hit 3000 deportations a week. permalink parent award report block reply RizzlieDoodad 1 points 38 minutes ago This is a national emergency permalink parent award report block reply\nRizzlieDoodad 1 points 38 minutes ago This is a national emergency permalink parent award report block reply\nFaustyArchaeus 3 points 10 hours ago Magic fren pure magic permalink award report block reply kek-is-tan OP 3 points 10 hours ago TY fren permalink parent award report block reply\nkek-is-tan OP 3 points 10 hours ago TY fren permalink parent award report block reply\nprojectarcturus 2 points 10 hours ago Ye olde talking points. permalink award report block reply\nGainesvilleFlorida 2 points 57 minutes ago I was having a good day until I saw this photo that always pisses me off. permalink award report block reply\nMaga305_47 2 points 1 hour ago 😂😂😂 permalink award report block reply\nFreeKyleNow 2 points 2 hours ago Has anyone ever done a deep dive to identify these faggots? permalink award report block reply\nkekranger 1 points 10 hours ago Chinese bot accounts more likely. permalink award report block reply possibletower -6 points 10 hours ago Nick is 100% a Chinese bot account. He is Hitler/Stalin First after all. Winnie the Pooh and Kim Jong un are more of his type of heroes. permalink parent award report block reply xkgb 1 points 2 minutes ago Fuentes is cringe. https://www.vice.com/en/article/hard-not-to-respect-that-why-white-nationalists-are-toasting-the-taliban/ permalink parent award report block reply\npossibletower -6 points 10 hours ago Nick is 100% a Chinese bot account. He is Hitler/Stalin First after all. Winnie the Pooh and Kim Jong un are more of his type of heroes. permalink parent award report block reply xkgb 1 points 2 minutes ago Fuentes is cringe. https://www.vice.com/en/article/hard-not-to-respect-that-why-white-nationalists-are-toasting-the-taliban/ permalink parent award report block reply\nxkgb 1 points 2 minutes ago Fuentes is cringe. https://www.vice.com/en/article/hard-not-to-respect-that-why-white-nationalists-are-toasting-the-taliban/ permalink parent award report block reply\ndeleted 1 points 10 hours ago RuprechtThaMonkeyBoy 3 points 10 hours ago Yes, they like kids. permalink parent award report block reply\nRuprechtThaMonkeyBoy 3 points 10 hours ago Yes, they like kids. permalink parent award report block reply\nsnoopy3210 0 points 10 hours ago Fuentes proving himself to be the ultimate useful idiot once again, talking alone, to a government troll farm. permalink award report block reply Cacciali_Via 2 points 5 hours ago You are just a butt hurt Jew. AF is inevitable. permalink parent award report block reply\nCacciali_Via 2 points 5 hours ago You are just a butt hurt Jew. AF is inevitable. permalink parent award report block reply\nseeling0 0 points 10 hours ago These guys don't look goatfucker-y enough to be on the \"Trump should stay out of global politics\" team. permalink award report block reply\nMhmm2MoreWeeks -6 points 9 hours ago They have but one purpose. To make you openly Racist. Why? Because that is what helps the Globalists and Left the most, politically. So whatever your views, careful where you share. permalink award report block reply sicarius 3 points 3 hours ago Oh no we better watch what we say or the libs might start calling us racist permalink parent award report block reply Cacciali_Via -1 points 5 hours ago Please expound on your nonsensical theory. permalink parent award report block reply\nsicarius 3 points 3 hours ago Oh no we better watch what we say or the libs might start calling us racist permalink parent award report block reply\nCacciali_Via -1 points 5 hours ago Please expound on your nonsensical theory. permalink parent award report block reply"}