{"id": "1ARK9oXkfI", "contents": "78 And he wonders why nobody is listening to his message posted 15 hours ago by neosin 8 comments award share download report block\n8 comments Sort by Top Top New Worst Old Save South_Florida_Guy 6 points 13 hours ago but jews have infinite land rights to a place they just got to? permalink award report block reply FreedomFromGovt 6 points 14 hours ago Let's see what happens when we say that about Jews. permalink award report block reply Trump454748 3 points 13 hours ago Stop being so antisemitic!!!! permalink parent award report block reply Smurfection 4 points 13 hours ago OH but Jews get to lay claim to a land they had 2,000 years ago.  I'm from Minneapolis.  My great, great, great granpappy bought some land and built a house in Minneapolis after the Battle of Gettysburg.  He was a Red Bull, 1st Minnesota Regiment.   The motto now is To The Last Man because they were asked to hold the line, and they did, almost to the last man.  They took 80% KIA and not a single one of the survivors wasn't wounded.  My great, great, great grandpappy was hit in the leg, stomach and arm.   He got a fever while recuperating and then an infection.  His foot was amputated.  For over a century, his picture hung over the fireplace he built out of stone.  Eight remodels on the house and no generation moved that picture. I sold the house in 2019 because I became a foreigner in my own neighborhood. Somalis started coming into Minnesota because the Russian Jewish socialist Senator Paul Wellstone, professor from Carlton College and lefty hack said \"Minnesota is too white and too Christian\". Ben Shapiro, Fuck you! permalink award report block reply Gunmolester 4 points 15 hours ago You cant be pragmatic with most people ..They dont Get it permalink award report block reply AwShitHereWeGoAgain 2 points 13 hours ago (((FUCK YOU, Lil' Benny!!!!))) permalink award report block reply Veritas264 1 points 13 hours ago Well, what was the context? All these people that are complaining about high priced houses but are refusing to move saying they have a right to live there.  Is that what he meant? permalink award report block reply dems_be_crazy 1 points 14 hours ago You don't have a right to live where you grew up. You do have the right to vote to blow up a system that no longer allows you to live where you grew up. You want people to abandon capitalism and the American experiment? Easiest way to do that is by making those things not work for the people that vote. permalink award report block reply\nSouth_Florida_Guy 6 points 13 hours ago but jews have infinite land rights to a place they just got to? permalink award report block reply\nFreedomFromGovt 6 points 14 hours ago Let's see what happens when we say that about Jews. permalink award report block reply Trump454748 3 points 13 hours ago Stop being so antisemitic!!!! permalink parent award report block reply\nTrump454748 3 points 13 hours ago Stop being so antisemitic!!!! permalink parent award report block reply\nSmurfection 4 points 13 hours ago OH but Jews get to lay claim to a land they had 2,000 years ago.  I'm from Minneapolis.  My great, great, great granpappy bought some land and built a house in Minneapolis after the Battle of Gettysburg.  He was a Red Bull, 1st Minnesota Regiment.   The motto now is To The Last Man because they were asked to hold the line, and they did, almost to the last man.  They took 80% KIA and not a single one of the survivors wasn't wounded.  My great, great, great grandpappy was hit in the leg, stomach and arm.   He got a fever while recuperating and then an infection.  His foot was amputated.  For over a century, his picture hung over the fireplace he built out of stone.  Eight remodels on the house and no generation moved that picture. I sold the house in 2019 because I became a foreigner in my own neighborhood. Somalis started coming into Minnesota because the Russian Jewish socialist Senator Paul Wellstone, professor from Carlton College and lefty hack said \"Minnesota is too white and too Christian\". Ben Shapiro, Fuck you! permalink award report block reply\nGunmolester 4 points 15 hours ago You cant be pragmatic with most people ..They dont Get it permalink award report block reply\nAwShitHereWeGoAgain 2 points 13 hours ago (((FUCK YOU, Lil' Benny!!!!))) permalink award report block reply\nVeritas264 1 points 13 hours ago Well, what was the context? All these people that are complaining about high priced houses but are refusing to move saying they have a right to live there.  Is that what he meant? permalink award report block reply\ndems_be_crazy 1 points 14 hours ago You don't have a right to live where you grew up. You do have the right to vote to blow up a system that no longer allows you to live where you grew up. You want people to abandon capitalism and the American experiment? Easiest way to do that is by making those things not work for the people that vote. permalink award report block reply"}