{"id": "1ARK5BIWRh", "contents": "344 🔴🔴How MAGA is this administration if they fail to fight for American jobs and cowardly keep all the H-B1s? 🌶️ 🌶️ SPICY 🌶️ 🌶️ posted 3 days ago by GodIsPerfect 8 comments award share report block Sara Lane @TheMoose1775 • 7d @PressSec We are Trump supporters.  Have been from day one.  We are hurting.  We are still significantly financially behind where we were 5 years ago ago.  Number one reason is H1B visa.  My husband had to take  30% pay cut to find a job after he was laid off.  Terminate ALL foreign worker\n8 comments Sort by Top Top New Worst Old Save fskfsk 9 points 3 days ago Lol, 30% pay cut is doing well.  I don't work in software at all anymore. permalink award report block reply BillGateCanSuckIt 7 points 3 days ago Congress is assho permalink award report block reply fskfsk 8 points 3 days ago Trump is \"america first\", but so far he hasn't done shit about H1b.  He did some minor reforms that don't really change anything. permalink parent award report block reply SanityGumby 2 points 2 days ago Why are you lying like a faggot. Go back to Reddit where you belong. permalink parent award report block reply HeavyMetalPatriot 6 points 3 days ago Trump is bizarrely beholden to Silicon Valley. They hate him, yet he does their bidding. But I'm super duper sure JD Pajeet Vance will totally stop the invasion. permalink award report block reply RINOssuck 3 points 2 days ago I have seen this same quote from several different posters. This is MAGA dividing bullshit. permalink award report block reply greatpumpkin 2 points 2 days ago You're not the only one wondering that, friend. permalink award report block reply SanityGumby 2 points 2 days ago I see you are mentally retarded and need to be deported. They are doing something about H1b you fucking mental midget. There are investigations against nearly 200 companies for H1b fraud. They added expenses to reduce h1bs. Next the H1b cap will continue to decline. They are revoking thousands and thousands and thousands of immigration visas. Just because you are low iq doesn’t mean anything isn’t being done and if they did what you’re mental midget negroid iq wanted you would destroy the entire global economy. permalink award report block reply barwhack 1 points 2 days ago Trump isn't MAGA? H1Bs are certainly not America First... permalink award report block reply\nfskfsk 9 points 3 days ago Lol, 30% pay cut is doing well.  I don't work in software at all anymore. permalink award report block reply\nBillGateCanSuckIt 7 points 3 days ago Congress is assho permalink award report block reply fskfsk 8 points 3 days ago Trump is \"america first\", but so far he hasn't done shit about H1b.  He did some minor reforms that don't really change anything. permalink parent award report block reply SanityGumby 2 points 2 days ago Why are you lying like a faggot. Go back to Reddit where you belong. permalink parent award report block reply\nfskfsk 8 points 3 days ago Trump is \"america first\", but so far he hasn't done shit about H1b.  He did some minor reforms that don't really change anything. permalink parent award report block reply SanityGumby 2 points 2 days ago Why are you lying like a faggot. Go back to Reddit where you belong. permalink parent award report block reply\nSanityGumby 2 points 2 days ago Why are you lying like a faggot. Go back to Reddit where you belong. permalink parent award report block reply\nHeavyMetalPatriot 6 points 3 days ago Trump is bizarrely beholden to Silicon Valley. They hate him, yet he does their bidding. But I'm super duper sure JD Pajeet Vance will totally stop the invasion. permalink award report block reply\nRINOssuck 3 points 2 days ago I have seen this same quote from several different posters. This is MAGA dividing bullshit. permalink award report block reply\ngreatpumpkin 2 points 2 days ago You're not the only one wondering that, friend. permalink award report block reply\nSanityGumby 2 points 2 days ago I see you are mentally retarded and need to be deported. They are doing something about H1b you fucking mental midget. There are investigations against nearly 200 companies for H1b fraud. They added expenses to reduce h1bs. Next the H1b cap will continue to decline. They are revoking thousands and thousands and thousands of immigration visas. Just because you are low iq doesn’t mean anything isn’t being done and if they did what you’re mental midget negroid iq wanted you would destroy the entire global economy. permalink award report block reply\nbarwhack 1 points 2 days ago Trump isn't MAGA? H1Bs are certainly not America First... permalink award report block reply"}