{"id": "1ARK53JHMY", "contents": "1487 Trust no truck. No Driver's License, no registration, no DOT, no CDL, half the truck is broken. posted 6 days ago by PiratePatriotParrot 185 comments award share report block The Disrespected Trucker @DisrespectedThe • 6d These people are on our roads.\n185 comments Sort by Top Top New Worst Old Save BrianOfNazareth 111 points 6 days ago I'd love to know what state.  The guy thought he could just get on the road with no markings at all and nobody would notice?  Are states like CA so bad that you can actually get away with that? permalink award report block reply hansgruber7 79 points 6 days ago Yes. permalink parent award report block reply AcAirman -19 points 6 days ago Proof. permalink parent award report block reply Redpilled2Depression 27 points 6 days ago It’s fucking California, that’s all the proof that’s needed. permalink parent award report block reply XxxRDTPRNxxX 7 points 5 days ago Here: https://patriots.win/p/1ARK53JHMY/trust-no-truck-no-drivers-licens/c permalink parent award report block reply RBFace 4 points 5 days ago KEK permalink parent award report block reply SuperHonkey 2 points 5 days ago 😙🤌🏻 permalink parent award report block reply SuperHonkey 2 points 5 days ago Faggggggggg 🫩☝🏻 permalink parent award report block reply Ch3f4554551n 56 points 6 days ago \"highway law enforcement\" in California consists solely of revenue generation (pulling over people who likely have income), cutting intersections to get coffee, and collision cleanup. If it isn't one of these, LEO's ignore it. permalink parent award report block reply 123breadman 27 points 6 days ago That's not highway enforcement that all the worthless police in liberal areas. They refuse to go in the ghetto to enforce laws and they only hang around the suburbs to ticket the middle class for \"looking drunk\" permalink parent award report block reply Redeemable 3 points 5 days ago Why wouls cops want to go into dangerous areas in liberal states where the government will always side with the criminals? permalink parent award report block reply MySidesGoUp -3 points 5 days ago It’s always liberal areas lol. Never has govt been corrupted in a conservative area 💪💪 Yeah, no…govt is corrupt regardless of color. But we have crayon-eaters here who protect the jew to hate browns… permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply Brownwaterboys 29 points 6 days ago LW Towing out of Texas. Frisco and Celina Texas. Somewhere around there i guess :D permalink parent award report block reply Cheesemaker 10 points 6 days ago No hablo ingles permalink parent award report block reply deleted 0 points 6 days ago walls4america 0 points 6 days ago All I heard in the video was someone replying “yep” to the inspector.  One doesn’t have to be fluent in English to say “yep”. permalink parent award report block reply OTher55 6 points 6 days ago L.W.'s Towing in North Texas area. Frisco, Carrollton, Plano, Addison, Lewisville, Little Elm, The Colony, Farmers Branch is what it says on their website. permalink parent award report block reply load 18 more comments... _Sully_ 72 points 6 days ago What's important here is for you to not be racist. Everything else, like the family of four this would would likely kill isn't important. Nor is worrying about the fact that he can just flee to another country to avoid any punishment. Doesn't matter at all. Not being racist is more important. permalink award report block reply SimaYi 18 points 6 days ago Not being racist is literally the only thing that is important in this country. It is the prime directive in Judeo-America. permalink parent award report block reply _Sully_ 11 points 6 days ago Be carful, noticing is also racist. permalink parent award report block reply 10MeV 6 points 6 days ago The only thing that’s considered wrong is saying something is wrong. permalink parent award report block reply HunterBidensPC 12 points 6 days ago This timeline MADE me racist out of spite. Idk who to be racist to but liberals are a good start. Intellectually inferior cock-sucking crack-smoking pearl-clutching ass-kissing “CNN tells me what to think today” faggot ass liberals. permalink parent award report block reply _Sully_ 6 points 6 days ago You, you I like. But that might be racist. permalink parent award report block reply Friendly_B 2 points 6 days ago ivermectinpepe alt Would you like to know more?  I'm doing my part! https://patriots.win/c/TheDonald/p/19BZl15e1F/x/c/4eU3UB7P9qk permalink parent award report block reply glow-operator-2-0 1 points 5 days ago Hating liberals isn't racist, because they aren't restricted one race or ethnicity. Neither is being dismissive to Islam, since again, it is not a race. permalink parent award report block reply deleted 0 points 6 days ago NZbacon 1 points 5 days ago The video didn't show the driver. permalink parent award report block reply deleted 0 points 5 days ago view 4 more comments... deleted 1 points 6 days ago _Sully_ 14 points 6 days ago I mean obviously, bro. I'm not satirizing this guy. permalink parent award report block reply deleted 3 points 6 days ago RuleoVicus 5 points 6 days ago You wouldn't be wrong. Internet interpretation can be a bitch. permalink parent award report block reply deleted 0 points 6 days ago NZbacon 2 points 5 days ago We didn't get to see the driver or hear anyone say they were the driver. permalink parent award report block reply deleted 0 points 5 days ago NZbacon 0 points 5 days ago You think the driver is helping find the broken shit on his own truck huh? LEO work in pairs. permalink parent award report block reply view 1 more comments... USMC6541E5 33 points 6 days ago Pete Buttgauge standards met. permalink award report block reply Filo76 10 points 6 days ago Is it gay? ✅ Mayor Pete approved! permalink parent award report block reply RuleoVicus 4 points 6 days ago Are little boys involved? ✅ permalink parent award report block reply Filo76 1 points 6 days ago Gonna win the Muslim vote in a landslide. permalink parent award report block reply Covfefebrulee 22 points 6 days ago He was probably planning on parking on the railroad tracks. permalink award report block reply Pissonit 7 points 6 days ago Lol....There's a....Training joke in there somewhere. permalink parent award report block reply Covfefebrulee 9 points 6 days ago I truly believe some of these train / truck crashes are intentional. I had a CDL when I was 23. Took my test with 15 burly semi truck drivers. 6 of us passed. It was tough. Not that has anything really to do with it. I just remember how hard I studied and worked to pass that test. permalink parent award report block reply Pissonit 9 points 6 days ago I have a friend that was a truck driver his whole life. I was a diesel/ tanker trailer mechanic my entire life. Were both retired now and sometimes think back when we were young if we just would have put our talents together we could have started a trucking company together. Old news now but we may have missed the golden ring on that one.... permalink parent award report block reply Covfefebrulee 8 points 6 days ago I love trucks and I used to think truck drivers were the safest people to drive next to. I still do people like you guys some of the most amazing truckers I’ve followed all the way from Montana to Alaska on the Alaska Highway for days on end and they looked out for me more than once a truck driver has reached out to make sure I’m OK in my travels over the years. It’s an interesting profession. I know that when my brothers and I saw smoky in the bandit we all wanted to get a CB and my dad got us one. It was awesome. In general these days, it’s really hard to find good mechanics and reliable people. I remember things were different and I keep reminding myself these days that it’s not the same anymore. People are just not skilled anymore. All the skilled people are retired! permalink parent award report block reply view 3 more comments... bratt 19 points 6 days ago Always think forfeiture!  Seize the truck and the cargo. I don't think he ever said anything about the driver being an illegal alien, but with everything missing to be a driver or the truck being licensed to be on the road, I am betting on it. permalink award report block reply HIGH_ENERGY_MEMES 4 points 6 days ago Seize the truck and the cargo. Cargo would be harsh as it would be too easy for some ordinary person to pay for delivery to an all seemingly respectable company and then lose something really valuable. If I pay for delivery but company turns around and hires this, I the sender and being frauded also, and dont deserve punishment. 100% seize truck and charge driver + anyone that hired/owned this truck. the one that really bothered me is the non licence at all, seriously.... that person needs some time in prison as they have no respect for society. permalink parent award report block reply RedStoneDeepState -1 points 6 days ago This screams farm use/mechanic/redneck not illegal. The illegal aliens stick to the lowest common denominator, this is not their MO. permalink parent award report block reply SimaYi 6 points 6 days ago With no Driver's license? White people have DLs. permalink parent award report block reply RedStoneDeepState -3 points 6 days ago Not necessarily on them. To have the truck you need to obtain the truck - most illegals drive for mega  carriers. permalink parent award report block reply bratt 5 points 6 days ago Farmers I would give a pass. They have 13 year old kids driving, they are local and not driving far or fast. I think farm vehicles get lots of exceptions. Combines and tractors are always on the roads. stick to the lowest common denominator I don't know what that means? permalink parent award report block reply RedStoneDeepState 2 points 6 days ago For the purposes of trucking, think megacarrier dry van freight. Dont stick out, be the most \"normal\" of the profession. Trying to be abnormal gets deportations. permalink parent award report block reply bratt 1 points 6 days ago I can see that. Same rules as drug running. No speeding, common car, current plates. If they would have learned decent English, many would never be check in the first place. permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago Shouldn't be operating that on a highway. At the very least it's a blowout waiting to happen.  VIN is also a problem; very suspicious. permalink parent award report block reply HIGH_ENERGY_MEMES 2 points 6 days ago Combines and tractors are always on the roads. You see this where I am, also ATVs and kids on dirt bikes. The community has general rule you do this stuff in the valley as its rural but dont take vehicles out of it to the local town. Rural cops are pretty chill as they are part of the community and get it. Also works because people are responsible. We had one family move in that was trouble, doing burnouts everywhere and taking bikes onto other people properties type behaviour. Cops went and had a chat with them, no idea what they said but I haven't seem them take a unregistered vehicle off the property in over 18 months. Everyone else, no problem. That's the way communities should work. permalink parent award report block reply NZbacon 1 points 5 days ago Farmers don't drive enclosed semi trailers.  They're useless for farming. permalink parent award report block reply RedStoneDeepState 2 points 5 days ago Sure they do, dig a trench for the rear wheels and you have a cheap storage solution. permalink parent award report block reply NZbacon 2 points 5 days ago Cut a hole in the end and you've got a cheap bridge too. But that ain't out on the road. permalink parent award report block reply view 1 more comments... deleted -1 points 6 days ago NZbacon 2 points 5 days ago Noone is identified as the driver. permalink parent award report block reply PatriotSkorzeny 18 points 6 days ago Because people with badges LET THEM. What would you have a civilian do? permalink award report block reply FromGodNotMonkey 2 points 5 days ago In Arkansas we have Highway police that only look at commercial vehicles. They’d never be able to get away with this here. This must have happened in one of those states where they issue drivers licenses with “no name” permalink parent award report block reply Taylor3006 16 points 6 days ago Arrest the driver, impound the truck and when the case is done, crush the truck, the trailer, and the contents. Anyone who uses these people to haul their goods should be held to account and suffer along with the criminals. permalink award report block reply D__1 5 points 6 days ago I doubt he was transporting legal cargo. permalink parent award report block reply RuleoVicus 5 points 6 days ago People. permalink parent award report block reply R3tro 16 points 6 days ago Part 2 of the video continues where part 1 left off…. Tldr…. No spare tires, no air brake lines, no breaks, no transmission, no engine, no steering wheel, no windshield,  no deodorant found in the cab, no live goats left in the sleeper compartment. permalink award report block reply RuleoVicus 9 points 6 days ago Lol bro as I was reading my inner monologue was going \"should ask for the link to part 2\" until the 'no transmission'.... fuuuuuu you got me lol permalink parent award report block reply KilroyJCNJ 13 points 6 days ago Years ago, when I was commuting 77 miles each way, I would take the truck lanes because I would rather take my chances with professional drivers over the amateurs in the “ Cars Only “ lanes. If I had to do it now, I would take local roads all the way down and back. permalink award report block reply NY2KCMO1776 7 points 6 days ago I was taught to drive on the new jersey turnpike on the local route, with tractor trailers by Newark Airport.  MY parents forced me to get comfortable around them, never hang out in blind spots etc.  I would take the local lanes to avoid traffic and I felt comfortable because truckers were white males and predictable.   Fast forward 20 years I bought a car in kansas.  Almost had one run me off the road week one.  Saw multiple tractors on the left lane not passing, lots of ghetto and 3rd world drivers.  Trucks are cutting people off as if they are in an Altima.  Now I avoid trucks at all costs.  Inevitably I get stuck behind some jackass in the left lane just cruising along in the blind spot of a truck not even attempting to pass.  I back off, got to the right and pass them off.  Drive in 35 in kansas or 70 and you see it all Day. permalink parent award report block reply KilroyJCNJ 1 points 4 days ago 14 to 7A and back was fun. I will also say Atlanta is even worse. permalink parent award report block reply Darkheartisland 12 points 6 days ago That's wild. Wonder what color their turban is. permalink award report block reply RuleoVicus 3 points 6 days ago Brown. permalink parent award report block reply SwedishChainsaw2 9 points 6 days ago No mention of the load. What was he hauling and for who? Where was the load from? permalink award report block reply AccipiterQ 8 points 6 days ago VIN number didn't go back to anything??? permalink award report block reply MocksFordComma 3 points 6 days ago Mexican trailer? permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago We're gonna need a bigger trebuchet ... permalink parent award report block reply joggin_noggin 1 points 5 days ago Either that or Canadian. permalink parent award report block reply jml1997 8 points 6 days ago Driver was arrested? Right???? permalink award report block reply PiratePatriotParrot OP 17 points 6 days ago He was given his $17,000 in food stamps and his $8,000 for crossing the border. He was then given his vote in our elections, and FHA home loan and temporary housing in a 5 star hotel with 5 star service. permalink parent award report block reply ingrowntoenail 5 points 6 days ago Don't forget the free Obama phone. permalink parent award report block reply deleted -3 points 6 days ago NZbacon 2 points 5 days ago You're shilling this everywhere.  There is noone in that video identified as the driver permalink parent award report block reply RedStoneDeepState -8 points 6 days ago This screams farm use/mechanic/redneck not an illegal. I have seen worse farm use trucks out of Colorado. permalink parent award report block reply ingrowntoenail 4 points 6 days ago No it doesn't. permalink parent award report block reply RedStoneDeepState -4 points 6 days ago How did they get the truck? Did the illegal come here with 20k to buy it? permalink parent award report block reply view 4 more comments... clownworld30330 3 points 6 days ago Deported permalink parent award report block reply RedStoneDeepState -4 points 6 days ago Waah, snowflake niggеr faggot cant stand hearing anything that goes against their world view. permalink parent award report block reply ScamBlondie 1 points 6 days ago 🤣🤣🤣 permalink parent award report block reply KennyKetchem 7 points 6 days ago No turn signal especially on the right is very dangerous for a big rig. It is a massive blind spot for the driver. permalink award report block reply FrankDuncan 5 points 6 days ago Somebody was on the way to pick up cartel drugs or illegals permalink award report block reply RuleoVicus 1 points 6 days ago Yup. permalink parent award report block reply Gunmolester 5 points 6 days ago I drive the 40 often and usually see swerving trucks...from now on im calling it in permalink award report block reply feraxil 5 points 6 days ago Geez, I wonder how they're trucking in all the drugs and fentanyl. it's a total mystery permalink award report block reply Mintap 4 points 6 days ago How many illegal aliens in the trailer? permalink award report block reply TrustYourself 4 points 6 days ago Holy shit. permalink award report block reply freedom-thinker 3 points 6 days ago And how will it be investigated???? permalink award report block reply Texasnumber1 3 points 6 days ago And let me guess the people that hire these illegals nothing will happen to them right.......? As always this illegal will get freed into the country once again, to do it all over again Perpetual insanity. permalink award report block reply deleted -3 points 6 days ago NZbacon 1 points 5 days ago Nope.  Driver is not identified in the video permalink parent award report block reply Firespawn 3 points 6 days ago There's a Bosnian trucking company close to where I work. Those stupid MFS will park in the road, blocking traffic, take 15 minutes to turn around, have the noses of the semis half a car length out in the road. I'm always flipping them off or cussing them out. Wish they'd get checked. I bet they'd lose some drivers. And in the summer, they have music blaring that sounds like some Muslim bullshit. permalink award report block reply SicSemperTyrannis2 3 points 6 days ago Report them. Seriously! DOT is probably more relevant than Police. permalink parent award report block reply Firespawn 2 points 5 days ago My friend did. He was 10 minutes late for work today, all due to them getting a truck stuck in a ditch while the trailer blocked the road. We go by a point system at work. They gave him half a point for being late and their stupid ass  response to what happened was \"maybe you should leave earlier for work\"\nThere's only one way in and out. We are on a dead end road. He said he called DOT and he won't stop until something is done. permalink parent award report block reply SicSemperTyrannis2 1 points 5 days ago My last job has a disciplinary system like that, and on top of it they give out written warnings for attendance like candy. A full crew on one shift has 15 people, one day they handed out 10. It's juvenile ... Good luck to you getting this addressed via LEO, whether that be DOT or whoever. permalink parent award report block reply 67Vert 3 points 6 days ago Don’t worry. Thats all perfectly fine in Cali. permalink award report block reply elmerecido 3 points 6 days ago Until a Leftist dirtbag like Pelosi looses a relative to one of these scofflaws smashing their car to a pancake, I expect nothing to change. permalink award report block reply SGT_Glowie 3 points 6 days ago I avoid them like the plague now. permalink award report block reply excelance 3 points 6 days ago Who the hell is paying these drivers? permalink award report block reply Roadpower 3 points 6 days ago I didn't see wheel chalks deployed. I would not be doing an inspection on that truck without those. That truck will probably never make it back to whoever bought it and instead end up at an auction. permalink award report block reply TrumpRideorDie74 4 points 6 days ago You referring to chocks? permalink parent award report block reply Roadpower 3 points 6 days ago Yes thank you. permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago Nah just have the DOT inspector mark the bad tires with chalk - that'll fix everything including the VIN# LOL permalink parent award report block reply Melodicgrog 3 points 6 days ago Dang. Missed “welded frame”. Almost got bingo. permalink award report block reply RuleoVicus 3 points 6 days ago Rofl. Hey there's a funny YT channel called Just Rolled In. There's a running gag within the community about 'structural foam spray' and 'HB Weld fixes most codes'. I bet you'd enjoy. permalink parent award report block reply grapeape67 1 points 6 days ago reddit has a board called \"just rolled into the shop\". For auto mechanics. It is hilarious, too. permalink parent award report block reply Melodicgrog 1 points 5 days ago Yeah watch them and now I’m afraid to drive with those people on the road permalink parent award report block reply Maxmax 3 points 6 days ago And, the driver??? permalink award report block reply deleted -4 points 6 days ago NZbacon 4 points 5 days ago The driver is not identified in the video. permalink parent award report block reply KungPaoMcChicken 3 points 6 days ago We used to have standards... permalink award report block reply HunterBidensPC 2 points 6 days ago So straight to jail and fines for the company right? Like fuck. wtf are we doing!? permalink award report block reply SicSemperTyrannis2 2 points 6 days ago Try identifying the company. Hold it until you get a SWAT team for backup, this is beyond suspicious ... permalink parent award report block reply TruthWillOut 2 points 5 days ago Illegals gonna illegal. permalink award report block reply TrumpRideorDie74 2 points 6 days ago And probably no English permalink award report block reply deleted -3 points 6 days ago NZbacon 3 points 5 days ago The driver is not identified in the video. permalink parent award report block reply fjzappa 2 points 6 days ago Arrest the driver and impound truck and the cargo.  Put an end to this shit permalink award report block reply SimaYi 2 points 6 days ago Third world country. permalink award report block reply Preludachris 2 points 6 days ago What?! permalink award report block reply Klown_Kutz 1 points 5 days ago Hey this is what the Libertopians want on our roads. Enjoy what y’all ask for! permalink award report block reply MAGALADON9 1 points 5 days ago He is just a hard working cartel affiliated big eyed blinkity blink immigrant permalink award report block reply PearlyGaits57 1 points 5 days ago Who hires these asshats, they need to be held accountable as well. permalink award report block reply Riehlpissed 1 points 5 days ago What’s in the trailer? permalink award report block reply Covfefe_Commando 1 points 6 days ago No Name Given.  But a CDL was issued, anyway. permalink award report block reply ArtLife 8 points 6 days ago No, he said no CDL, not even a regular DL. He had zero. I'm curious what loads are these guys hauling? What companies are brokering these loads? I mean this stuff belongs to someone and is going somewhere. permalink parent award report block reply RuleoVicus 3 points 6 days ago No shit. Hired criminals are caught yet the employers are untouched. RICO ignored. permalink parent award report block reply ArtLife 1 points 5 days ago Yeah that's total BS. Trucks like these are not delivering to some regular DC. They are hauling stolen property, maybe people, who knows. Put the thumb screws to the driver to find out who pays him to drive this deathtrap. permalink parent award report block reply deleted 2 points 6 days ago ArtLife 2 points 5 days ago IIRC he said the VIN didn't match the truck. They make no mention of cargo so don't know if he was empty. The whole thing is super sus and should be investigated. The inspector kept saying he was only going to talk about the violations so maybe a bigger picture here we are unaware of. permalink parent award report block reply deleted 2 points 5 days ago view 3 more comments... SicSemperTyrannis2 1 points 4 days ago You're right, the VIN# is just bad, \"doesn't go back to anything.\" permalink parent award report block reply deleted 8 points 6 days ago MocksFordComma 4 points 6 days ago Betting on Mexican truck in Texas permalink parent award report block reply Megabrain1960 1 points 5 days ago It might be a good idea to check the load in the trailer..? permalink award report block reply Fromseatoshinningsea 1 points 5 days ago Is the driver in jail? Of course not permalink award report block reply hk416 1 points 5 days ago Trucker circle's are full of interesting specimens. I've heard from multiple vectors about the cattle hauling industry in the south. employers won't have you on their team unless you're doing meth that away you're up non-stop getting their cows delivered. permalink award report block reply worldowedexplanation 1 points 5 days ago This is terrifying and it’s amazing how dumbass Democrats seem to think this won’t affect them, like they don’t drive on roads? This is a major terrorist attack waiting to happen. Which is apparently just what the FBI wants, since they are allowing this. Imagine one of these trucks with a homemade bomb in it, driven into a building or a crowd. permalink award report block reply m203gunner 1 points 6 days ago It Newscum Cali duh permalink award report block reply RedStoneDeepState 0 points 6 days ago Unless that is a mechanic or farm use, that is prison time. permalink award report block reply BallotsOnRubysUSB -1 points 6 days ago ︎ Where is this? In Mexico or Africa? ︎ permalink award report block reply Framus 5 points 6 days ago I know, right?  Like the old saying goes, thank God it can't happen here! permalink parent award report block reply\nBrianOfNazareth 111 points 6 days ago I'd love to know what state.  The guy thought he could just get on the road with no markings at all and nobody would notice?  Are states like CA so bad that you can actually get away with that? permalink award report block reply hansgruber7 79 points 6 days ago Yes. permalink parent award report block reply AcAirman -19 points 6 days ago Proof. permalink parent award report block reply Redpilled2Depression 27 points 6 days ago It’s fucking California, that’s all the proof that’s needed. permalink parent award report block reply XxxRDTPRNxxX 7 points 5 days ago Here: https://patriots.win/p/1ARK53JHMY/trust-no-truck-no-drivers-licens/c permalink parent award report block reply RBFace 4 points 5 days ago KEK permalink parent award report block reply SuperHonkey 2 points 5 days ago 😙🤌🏻 permalink parent award report block reply SuperHonkey 2 points 5 days ago Faggggggggg 🫩☝🏻 permalink parent award report block reply Ch3f4554551n 56 points 6 days ago \"highway law enforcement\" in California consists solely of revenue generation (pulling over people who likely have income), cutting intersections to get coffee, and collision cleanup. If it isn't one of these, LEO's ignore it. permalink parent award report block reply 123breadman 27 points 6 days ago That's not highway enforcement that all the worthless police in liberal areas. They refuse to go in the ghetto to enforce laws and they only hang around the suburbs to ticket the middle class for \"looking drunk\" permalink parent award report block reply Redeemable 3 points 5 days ago Why wouls cops want to go into dangerous areas in liberal states where the government will always side with the criminals? permalink parent award report block reply MySidesGoUp -3 points 5 days ago It’s always liberal areas lol. Never has govt been corrupted in a conservative area 💪💪 Yeah, no…govt is corrupt regardless of color. But we have crayon-eaters here who protect the jew to hate browns… permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply Brownwaterboys 29 points 6 days ago LW Towing out of Texas. Frisco and Celina Texas. Somewhere around there i guess :D permalink parent award report block reply Cheesemaker 10 points 6 days ago No hablo ingles permalink parent award report block reply deleted 0 points 6 days ago walls4america 0 points 6 days ago All I heard in the video was someone replying “yep” to the inspector.  One doesn’t have to be fluent in English to say “yep”. permalink parent award report block reply OTher55 6 points 6 days ago L.W.'s Towing in North Texas area. Frisco, Carrollton, Plano, Addison, Lewisville, Little Elm, The Colony, Farmers Branch is what it says on their website. permalink parent award report block reply load 18 more comments...\nhansgruber7 79 points 6 days ago Yes. permalink parent award report block reply AcAirman -19 points 6 days ago Proof. permalink parent award report block reply Redpilled2Depression 27 points 6 days ago It’s fucking California, that’s all the proof that’s needed. permalink parent award report block reply XxxRDTPRNxxX 7 points 5 days ago Here: https://patriots.win/p/1ARK53JHMY/trust-no-truck-no-drivers-licens/c permalink parent award report block reply RBFace 4 points 5 days ago KEK permalink parent award report block reply SuperHonkey 2 points 5 days ago 😙🤌🏻 permalink parent award report block reply SuperHonkey 2 points 5 days ago Faggggggggg 🫩☝🏻 permalink parent award report block reply\nAcAirman -19 points 6 days ago Proof. permalink parent award report block reply Redpilled2Depression 27 points 6 days ago It’s fucking California, that’s all the proof that’s needed. permalink parent award report block reply XxxRDTPRNxxX 7 points 5 days ago Here: https://patriots.win/p/1ARK53JHMY/trust-no-truck-no-drivers-licens/c permalink parent award report block reply RBFace 4 points 5 days ago KEK permalink parent award report block reply SuperHonkey 2 points 5 days ago 😙🤌🏻 permalink parent award report block reply SuperHonkey 2 points 5 days ago Faggggggggg 🫩☝🏻 permalink parent award report block reply\nRedpilled2Depression 27 points 6 days ago It’s fucking California, that’s all the proof that’s needed. permalink parent award report block reply\nXxxRDTPRNxxX 7 points 5 days ago Here: https://patriots.win/p/1ARK53JHMY/trust-no-truck-no-drivers-licens/c permalink parent award report block reply RBFace 4 points 5 days ago KEK permalink parent award report block reply SuperHonkey 2 points 5 days ago 😙🤌🏻 permalink parent award report block reply\nRBFace 4 points 5 days ago KEK permalink parent award report block reply\nSuperHonkey 2 points 5 days ago 😙🤌🏻 permalink parent award report block reply\nSuperHonkey 2 points 5 days ago Faggggggggg 🫩☝🏻 permalink parent award report block reply\nCh3f4554551n 56 points 6 days ago \"highway law enforcement\" in California consists solely of revenue generation (pulling over people who likely have income), cutting intersections to get coffee, and collision cleanup. If it isn't one of these, LEO's ignore it. permalink parent award report block reply 123breadman 27 points 6 days ago That's not highway enforcement that all the worthless police in liberal areas. They refuse to go in the ghetto to enforce laws and they only hang around the suburbs to ticket the middle class for \"looking drunk\" permalink parent award report block reply Redeemable 3 points 5 days ago Why wouls cops want to go into dangerous areas in liberal states where the government will always side with the criminals? permalink parent award report block reply MySidesGoUp -3 points 5 days ago It’s always liberal areas lol. Never has govt been corrupted in a conservative area 💪💪 Yeah, no…govt is corrupt regardless of color. But we have crayon-eaters here who protect the jew to hate browns… permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\n123breadman 27 points 6 days ago That's not highway enforcement that all the worthless police in liberal areas. They refuse to go in the ghetto to enforce laws and they only hang around the suburbs to ticket the middle class for \"looking drunk\" permalink parent award report block reply Redeemable 3 points 5 days ago Why wouls cops want to go into dangerous areas in liberal states where the government will always side with the criminals? permalink parent award report block reply MySidesGoUp -3 points 5 days ago It’s always liberal areas lol. Never has govt been corrupted in a conservative area 💪💪 Yeah, no…govt is corrupt regardless of color. But we have crayon-eaters here who protect the jew to hate browns… permalink parent award report block reply newdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nRedeemable 3 points 5 days ago Why wouls cops want to go into dangerous areas in liberal states where the government will always side with the criminals? permalink parent award report block reply\nMySidesGoUp -3 points 5 days ago It’s always liberal areas lol. Never has govt been corrupted in a conservative area 💪💪 Yeah, no…govt is corrupt regardless of color. But we have crayon-eaters here who protect the jew to hate browns… permalink parent award report block reply\nnewdaynewname9 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nBrownwaterboys 29 points 6 days ago LW Towing out of Texas. Frisco and Celina Texas. Somewhere around there i guess :D permalink parent award report block reply\nCheesemaker 10 points 6 days ago No hablo ingles permalink parent award report block reply deleted 0 points 6 days ago walls4america 0 points 6 days ago All I heard in the video was someone replying “yep” to the inspector.  One doesn’t have to be fluent in English to say “yep”. permalink parent award report block reply\ndeleted 0 points 6 days ago walls4america 0 points 6 days ago All I heard in the video was someone replying “yep” to the inspector.  One doesn’t have to be fluent in English to say “yep”. permalink parent award report block reply\nwalls4america 0 points 6 days ago All I heard in the video was someone replying “yep” to the inspector.  One doesn’t have to be fluent in English to say “yep”. permalink parent award report block reply\nOTher55 6 points 6 days ago L.W.'s Towing in North Texas area. Frisco, Carrollton, Plano, Addison, Lewisville, Little Elm, The Colony, Farmers Branch is what it says on their website. permalink parent award report block reply\n_Sully_ 72 points 6 days ago What's important here is for you to not be racist. Everything else, like the family of four this would would likely kill isn't important. Nor is worrying about the fact that he can just flee to another country to avoid any punishment. Doesn't matter at all. Not being racist is more important. permalink award report block reply SimaYi 18 points 6 days ago Not being racist is literally the only thing that is important in this country. It is the prime directive in Judeo-America. permalink parent award report block reply _Sully_ 11 points 6 days ago Be carful, noticing is also racist. permalink parent award report block reply 10MeV 6 points 6 days ago The only thing that’s considered wrong is saying something is wrong. permalink parent award report block reply HunterBidensPC 12 points 6 days ago This timeline MADE me racist out of spite. Idk who to be racist to but liberals are a good start. Intellectually inferior cock-sucking crack-smoking pearl-clutching ass-kissing “CNN tells me what to think today” faggot ass liberals. permalink parent award report block reply _Sully_ 6 points 6 days ago You, you I like. But that might be racist. permalink parent award report block reply Friendly_B 2 points 6 days ago ivermectinpepe alt Would you like to know more?  I'm doing my part! https://patriots.win/c/TheDonald/p/19BZl15e1F/x/c/4eU3UB7P9qk permalink parent award report block reply glow-operator-2-0 1 points 5 days ago Hating liberals isn't racist, because they aren't restricted one race or ethnicity. Neither is being dismissive to Islam, since again, it is not a race. permalink parent award report block reply deleted 0 points 6 days ago NZbacon 1 points 5 days ago The video didn't show the driver. permalink parent award report block reply deleted 0 points 5 days ago view 4 more comments... deleted 1 points 6 days ago _Sully_ 14 points 6 days ago I mean obviously, bro. I'm not satirizing this guy. permalink parent award report block reply deleted 3 points 6 days ago RuleoVicus 5 points 6 days ago You wouldn't be wrong. Internet interpretation can be a bitch. permalink parent award report block reply deleted 0 points 6 days ago NZbacon 2 points 5 days ago We didn't get to see the driver or hear anyone say they were the driver. permalink parent award report block reply deleted 0 points 5 days ago NZbacon 0 points 5 days ago You think the driver is helping find the broken shit on his own truck huh? LEO work in pairs. permalink parent award report block reply view 1 more comments...\nSimaYi 18 points 6 days ago Not being racist is literally the only thing that is important in this country. It is the prime directive in Judeo-America. permalink parent award report block reply _Sully_ 11 points 6 days ago Be carful, noticing is also racist. permalink parent award report block reply 10MeV 6 points 6 days ago The only thing that’s considered wrong is saying something is wrong. permalink parent award report block reply\n_Sully_ 11 points 6 days ago Be carful, noticing is also racist. permalink parent award report block reply\n10MeV 6 points 6 days ago The only thing that’s considered wrong is saying something is wrong. permalink parent award report block reply\nHunterBidensPC 12 points 6 days ago This timeline MADE me racist out of spite. Idk who to be racist to but liberals are a good start. Intellectually inferior cock-sucking crack-smoking pearl-clutching ass-kissing “CNN tells me what to think today” faggot ass liberals. permalink parent award report block reply _Sully_ 6 points 6 days ago You, you I like. But that might be racist. permalink parent award report block reply Friendly_B 2 points 6 days ago ivermectinpepe alt Would you like to know more?  I'm doing my part! https://patriots.win/c/TheDonald/p/19BZl15e1F/x/c/4eU3UB7P9qk permalink parent award report block reply glow-operator-2-0 1 points 5 days ago Hating liberals isn't racist, because they aren't restricted one race or ethnicity. Neither is being dismissive to Islam, since again, it is not a race. permalink parent award report block reply deleted 0 points 6 days ago NZbacon 1 points 5 days ago The video didn't show the driver. permalink parent award report block reply deleted 0 points 5 days ago view 4 more comments...\n_Sully_ 6 points 6 days ago You, you I like. But that might be racist. permalink parent award report block reply Friendly_B 2 points 6 days ago ivermectinpepe alt Would you like to know more?  I'm doing my part! https://patriots.win/c/TheDonald/p/19BZl15e1F/x/c/4eU3UB7P9qk permalink parent award report block reply\nFriendly_B 2 points 6 days ago ivermectinpepe alt Would you like to know more?  I'm doing my part! https://patriots.win/c/TheDonald/p/19BZl15e1F/x/c/4eU3UB7P9qk permalink parent award report block reply\nglow-operator-2-0 1 points 5 days ago Hating liberals isn't racist, because they aren't restricted one race or ethnicity. Neither is being dismissive to Islam, since again, it is not a race. permalink parent award report block reply\ndeleted 0 points 6 days ago NZbacon 1 points 5 days ago The video didn't show the driver. permalink parent award report block reply deleted 0 points 5 days ago view 4 more comments...\nNZbacon 1 points 5 days ago The video didn't show the driver. permalink parent award report block reply deleted 0 points 5 days ago view 4 more comments...\ndeleted 0 points 5 days ago view 4 more comments...\ndeleted 1 points 6 days ago _Sully_ 14 points 6 days ago I mean obviously, bro. I'm not satirizing this guy. permalink parent award report block reply deleted 3 points 6 days ago RuleoVicus 5 points 6 days ago You wouldn't be wrong. Internet interpretation can be a bitch. permalink parent award report block reply\n_Sully_ 14 points 6 days ago I mean obviously, bro. I'm not satirizing this guy. permalink parent award report block reply deleted 3 points 6 days ago RuleoVicus 5 points 6 days ago You wouldn't be wrong. Internet interpretation can be a bitch. permalink parent award report block reply\ndeleted 3 points 6 days ago RuleoVicus 5 points 6 days ago You wouldn't be wrong. Internet interpretation can be a bitch. permalink parent award report block reply\nRuleoVicus 5 points 6 days ago You wouldn't be wrong. Internet interpretation can be a bitch. permalink parent award report block reply\ndeleted 0 points 6 days ago NZbacon 2 points 5 days ago We didn't get to see the driver or hear anyone say they were the driver. permalink parent award report block reply deleted 0 points 5 days ago NZbacon 0 points 5 days ago You think the driver is helping find the broken shit on his own truck huh? LEO work in pairs. permalink parent award report block reply view 1 more comments...\nNZbacon 2 points 5 days ago We didn't get to see the driver or hear anyone say they were the driver. permalink parent award report block reply deleted 0 points 5 days ago NZbacon 0 points 5 days ago You think the driver is helping find the broken shit on his own truck huh? LEO work in pairs. permalink parent award report block reply view 1 more comments...\ndeleted 0 points 5 days ago NZbacon 0 points 5 days ago You think the driver is helping find the broken shit on his own truck huh? LEO work in pairs. permalink parent award report block reply view 1 more comments...\nNZbacon 0 points 5 days ago You think the driver is helping find the broken shit on his own truck huh? LEO work in pairs. permalink parent award report block reply view 1 more comments...\nUSMC6541E5 33 points 6 days ago Pete Buttgauge standards met. permalink award report block reply Filo76 10 points 6 days ago Is it gay? ✅ Mayor Pete approved! permalink parent award report block reply RuleoVicus 4 points 6 days ago Are little boys involved? ✅ permalink parent award report block reply Filo76 1 points 6 days ago Gonna win the Muslim vote in a landslide. permalink parent award report block reply\nFilo76 10 points 6 days ago Is it gay? ✅ Mayor Pete approved! permalink parent award report block reply RuleoVicus 4 points 6 days ago Are little boys involved? ✅ permalink parent award report block reply Filo76 1 points 6 days ago Gonna win the Muslim vote in a landslide. permalink parent award report block reply\nRuleoVicus 4 points 6 days ago Are little boys involved? ✅ permalink parent award report block reply Filo76 1 points 6 days ago Gonna win the Muslim vote in a landslide. permalink parent award report block reply\nFilo76 1 points 6 days ago Gonna win the Muslim vote in a landslide. permalink parent award report block reply\nCovfefebrulee 22 points 6 days ago He was probably planning on parking on the railroad tracks. permalink award report block reply Pissonit 7 points 6 days ago Lol....There's a....Training joke in there somewhere. permalink parent award report block reply Covfefebrulee 9 points 6 days ago I truly believe some of these train / truck crashes are intentional. I had a CDL when I was 23. Took my test with 15 burly semi truck drivers. 6 of us passed. It was tough. Not that has anything really to do with it. I just remember how hard I studied and worked to pass that test. permalink parent award report block reply Pissonit 9 points 6 days ago I have a friend that was a truck driver his whole life. I was a diesel/ tanker trailer mechanic my entire life. Were both retired now and sometimes think back when we were young if we just would have put our talents together we could have started a trucking company together. Old news now but we may have missed the golden ring on that one.... permalink parent award report block reply Covfefebrulee 8 points 6 days ago I love trucks and I used to think truck drivers were the safest people to drive next to. I still do people like you guys some of the most amazing truckers I’ve followed all the way from Montana to Alaska on the Alaska Highway for days on end and they looked out for me more than once a truck driver has reached out to make sure I’m OK in my travels over the years. It’s an interesting profession. I know that when my brothers and I saw smoky in the bandit we all wanted to get a CB and my dad got us one. It was awesome. In general these days, it’s really hard to find good mechanics and reliable people. I remember things were different and I keep reminding myself these days that it’s not the same anymore. People are just not skilled anymore. All the skilled people are retired! permalink parent award report block reply view 3 more comments...\nPissonit 7 points 6 days ago Lol....There's a....Training joke in there somewhere. permalink parent award report block reply Covfefebrulee 9 points 6 days ago I truly believe some of these train / truck crashes are intentional. I had a CDL when I was 23. Took my test with 15 burly semi truck drivers. 6 of us passed. It was tough. Not that has anything really to do with it. I just remember how hard I studied and worked to pass that test. permalink parent award report block reply Pissonit 9 points 6 days ago I have a friend that was a truck driver his whole life. I was a diesel/ tanker trailer mechanic my entire life. Were both retired now and sometimes think back when we were young if we just would have put our talents together we could have started a trucking company together. Old news now but we may have missed the golden ring on that one.... permalink parent award report block reply Covfefebrulee 8 points 6 days ago I love trucks and I used to think truck drivers were the safest people to drive next to. I still do people like you guys some of the most amazing truckers I’ve followed all the way from Montana to Alaska on the Alaska Highway for days on end and they looked out for me more than once a truck driver has reached out to make sure I’m OK in my travels over the years. It’s an interesting profession. I know that when my brothers and I saw smoky in the bandit we all wanted to get a CB and my dad got us one. It was awesome. In general these days, it’s really hard to find good mechanics and reliable people. I remember things were different and I keep reminding myself these days that it’s not the same anymore. People are just not skilled anymore. All the skilled people are retired! permalink parent award report block reply view 3 more comments...\nCovfefebrulee 9 points 6 days ago I truly believe some of these train / truck crashes are intentional. I had a CDL when I was 23. Took my test with 15 burly semi truck drivers. 6 of us passed. It was tough. Not that has anything really to do with it. I just remember how hard I studied and worked to pass that test. permalink parent award report block reply Pissonit 9 points 6 days ago I have a friend that was a truck driver his whole life. I was a diesel/ tanker trailer mechanic my entire life. Were both retired now and sometimes think back when we were young if we just would have put our talents together we could have started a trucking company together. Old news now but we may have missed the golden ring on that one.... permalink parent award report block reply Covfefebrulee 8 points 6 days ago I love trucks and I used to think truck drivers were the safest people to drive next to. I still do people like you guys some of the most amazing truckers I’ve followed all the way from Montana to Alaska on the Alaska Highway for days on end and they looked out for me more than once a truck driver has reached out to make sure I’m OK in my travels over the years. It’s an interesting profession. I know that when my brothers and I saw smoky in the bandit we all wanted to get a CB and my dad got us one. It was awesome. In general these days, it’s really hard to find good mechanics and reliable people. I remember things were different and I keep reminding myself these days that it’s not the same anymore. People are just not skilled anymore. All the skilled people are retired! permalink parent award report block reply view 3 more comments...\nPissonit 9 points 6 days ago I have a friend that was a truck driver his whole life. I was a diesel/ tanker trailer mechanic my entire life. Were both retired now and sometimes think back when we were young if we just would have put our talents together we could have started a trucking company together. Old news now but we may have missed the golden ring on that one.... permalink parent award report block reply Covfefebrulee 8 points 6 days ago I love trucks and I used to think truck drivers were the safest people to drive next to. I still do people like you guys some of the most amazing truckers I’ve followed all the way from Montana to Alaska on the Alaska Highway for days on end and they looked out for me more than once a truck driver has reached out to make sure I’m OK in my travels over the years. It’s an interesting profession. I know that when my brothers and I saw smoky in the bandit we all wanted to get a CB and my dad got us one. It was awesome. In general these days, it’s really hard to find good mechanics and reliable people. I remember things were different and I keep reminding myself these days that it’s not the same anymore. People are just not skilled anymore. All the skilled people are retired! permalink parent award report block reply view 3 more comments...\nCovfefebrulee 8 points 6 days ago I love trucks and I used to think truck drivers were the safest people to drive next to. I still do people like you guys some of the most amazing truckers I’ve followed all the way from Montana to Alaska on the Alaska Highway for days on end and they looked out for me more than once a truck driver has reached out to make sure I’m OK in my travels over the years. It’s an interesting profession. I know that when my brothers and I saw smoky in the bandit we all wanted to get a CB and my dad got us one. It was awesome. In general these days, it’s really hard to find good mechanics and reliable people. I remember things were different and I keep reminding myself these days that it’s not the same anymore. People are just not skilled anymore. All the skilled people are retired! permalink parent award report block reply view 3 more comments...\nbratt 19 points 6 days ago Always think forfeiture!  Seize the truck and the cargo. I don't think he ever said anything about the driver being an illegal alien, but with everything missing to be a driver or the truck being licensed to be on the road, I am betting on it. permalink award report block reply HIGH_ENERGY_MEMES 4 points 6 days ago Seize the truck and the cargo. Cargo would be harsh as it would be too easy for some ordinary person to pay for delivery to an all seemingly respectable company and then lose something really valuable. If I pay for delivery but company turns around and hires this, I the sender and being frauded also, and dont deserve punishment. 100% seize truck and charge driver + anyone that hired/owned this truck. the one that really bothered me is the non licence at all, seriously.... that person needs some time in prison as they have no respect for society. permalink parent award report block reply RedStoneDeepState -1 points 6 days ago This screams farm use/mechanic/redneck not illegal. The illegal aliens stick to the lowest common denominator, this is not their MO. permalink parent award report block reply SimaYi 6 points 6 days ago With no Driver's license? White people have DLs. permalink parent award report block reply RedStoneDeepState -3 points 6 days ago Not necessarily on them. To have the truck you need to obtain the truck - most illegals drive for mega  carriers. permalink parent award report block reply bratt 5 points 6 days ago Farmers I would give a pass. They have 13 year old kids driving, they are local and not driving far or fast. I think farm vehicles get lots of exceptions. Combines and tractors are always on the roads. stick to the lowest common denominator I don't know what that means? permalink parent award report block reply RedStoneDeepState 2 points 6 days ago For the purposes of trucking, think megacarrier dry van freight. Dont stick out, be the most \"normal\" of the profession. Trying to be abnormal gets deportations. permalink parent award report block reply bratt 1 points 6 days ago I can see that. Same rules as drug running. No speeding, common car, current plates. If they would have learned decent English, many would never be check in the first place. permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago Shouldn't be operating that on a highway. At the very least it's a blowout waiting to happen.  VIN is also a problem; very suspicious. permalink parent award report block reply HIGH_ENERGY_MEMES 2 points 6 days ago Combines and tractors are always on the roads. You see this where I am, also ATVs and kids on dirt bikes. The community has general rule you do this stuff in the valley as its rural but dont take vehicles out of it to the local town. Rural cops are pretty chill as they are part of the community and get it. Also works because people are responsible. We had one family move in that was trouble, doing burnouts everywhere and taking bikes onto other people properties type behaviour. Cops went and had a chat with them, no idea what they said but I haven't seem them take a unregistered vehicle off the property in over 18 months. Everyone else, no problem. That's the way communities should work. permalink parent award report block reply NZbacon 1 points 5 days ago Farmers don't drive enclosed semi trailers.  They're useless for farming. permalink parent award report block reply RedStoneDeepState 2 points 5 days ago Sure they do, dig a trench for the rear wheels and you have a cheap storage solution. permalink parent award report block reply NZbacon 2 points 5 days ago Cut a hole in the end and you've got a cheap bridge too. But that ain't out on the road. permalink parent award report block reply view 1 more comments... deleted -1 points 6 days ago NZbacon 2 points 5 days ago Noone is identified as the driver. permalink parent award report block reply\nHIGH_ENERGY_MEMES 4 points 6 days ago Seize the truck and the cargo. Cargo would be harsh as it would be too easy for some ordinary person to pay for delivery to an all seemingly respectable company and then lose something really valuable. If I pay for delivery but company turns around and hires this, I the sender and being frauded also, and dont deserve punishment. 100% seize truck and charge driver + anyone that hired/owned this truck. the one that really bothered me is the non licence at all, seriously.... that person needs some time in prison as they have no respect for society. permalink parent award report block reply\nRedStoneDeepState -1 points 6 days ago This screams farm use/mechanic/redneck not illegal. The illegal aliens stick to the lowest common denominator, this is not their MO. permalink parent award report block reply SimaYi 6 points 6 days ago With no Driver's license? White people have DLs. permalink parent award report block reply RedStoneDeepState -3 points 6 days ago Not necessarily on them. To have the truck you need to obtain the truck - most illegals drive for mega  carriers. permalink parent award report block reply bratt 5 points 6 days ago Farmers I would give a pass. They have 13 year old kids driving, they are local and not driving far or fast. I think farm vehicles get lots of exceptions. Combines and tractors are always on the roads. stick to the lowest common denominator I don't know what that means? permalink parent award report block reply RedStoneDeepState 2 points 6 days ago For the purposes of trucking, think megacarrier dry van freight. Dont stick out, be the most \"normal\" of the profession. Trying to be abnormal gets deportations. permalink parent award report block reply bratt 1 points 6 days ago I can see that. Same rules as drug running. No speeding, common car, current plates. If they would have learned decent English, many would never be check in the first place. permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago Shouldn't be operating that on a highway. At the very least it's a blowout waiting to happen.  VIN is also a problem; very suspicious. permalink parent award report block reply HIGH_ENERGY_MEMES 2 points 6 days ago Combines and tractors are always on the roads. You see this where I am, also ATVs and kids on dirt bikes. The community has general rule you do this stuff in the valley as its rural but dont take vehicles out of it to the local town. Rural cops are pretty chill as they are part of the community and get it. Also works because people are responsible. We had one family move in that was trouble, doing burnouts everywhere and taking bikes onto other people properties type behaviour. Cops went and had a chat with them, no idea what they said but I haven't seem them take a unregistered vehicle off the property in over 18 months. Everyone else, no problem. That's the way communities should work. permalink parent award report block reply NZbacon 1 points 5 days ago Farmers don't drive enclosed semi trailers.  They're useless for farming. permalink parent award report block reply RedStoneDeepState 2 points 5 days ago Sure they do, dig a trench for the rear wheels and you have a cheap storage solution. permalink parent award report block reply NZbacon 2 points 5 days ago Cut a hole in the end and you've got a cheap bridge too. But that ain't out on the road. permalink parent award report block reply view 1 more comments...\nSimaYi 6 points 6 days ago With no Driver's license? White people have DLs. permalink parent award report block reply RedStoneDeepState -3 points 6 days ago Not necessarily on them. To have the truck you need to obtain the truck - most illegals drive for mega  carriers. permalink parent award report block reply\nRedStoneDeepState -3 points 6 days ago Not necessarily on them. To have the truck you need to obtain the truck - most illegals drive for mega  carriers. permalink parent award report block reply\nbratt 5 points 6 days ago Farmers I would give a pass. They have 13 year old kids driving, they are local and not driving far or fast. I think farm vehicles get lots of exceptions. Combines and tractors are always on the roads. stick to the lowest common denominator I don't know what that means? permalink parent award report block reply RedStoneDeepState 2 points 6 days ago For the purposes of trucking, think megacarrier dry van freight. Dont stick out, be the most \"normal\" of the profession. Trying to be abnormal gets deportations. permalink parent award report block reply bratt 1 points 6 days ago I can see that. Same rules as drug running. No speeding, common car, current plates. If they would have learned decent English, many would never be check in the first place. permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago Shouldn't be operating that on a highway. At the very least it's a blowout waiting to happen.  VIN is also a problem; very suspicious. permalink parent award report block reply HIGH_ENERGY_MEMES 2 points 6 days ago Combines and tractors are always on the roads. You see this where I am, also ATVs and kids on dirt bikes. The community has general rule you do this stuff in the valley as its rural but dont take vehicles out of it to the local town. Rural cops are pretty chill as they are part of the community and get it. Also works because people are responsible. We had one family move in that was trouble, doing burnouts everywhere and taking bikes onto other people properties type behaviour. Cops went and had a chat with them, no idea what they said but I haven't seem them take a unregistered vehicle off the property in over 18 months. Everyone else, no problem. That's the way communities should work. permalink parent award report block reply\nRedStoneDeepState 2 points 6 days ago For the purposes of trucking, think megacarrier dry van freight. Dont stick out, be the most \"normal\" of the profession. Trying to be abnormal gets deportations. permalink parent award report block reply bratt 1 points 6 days ago I can see that. Same rules as drug running. No speeding, common car, current plates. If they would have learned decent English, many would never be check in the first place. permalink parent award report block reply\nbratt 1 points 6 days ago I can see that. Same rules as drug running. No speeding, common car, current plates. If they would have learned decent English, many would never be check in the first place. permalink parent award report block reply\nSicSemperTyrannis2 2 points 6 days ago Shouldn't be operating that on a highway. At the very least it's a blowout waiting to happen.  VIN is also a problem; very suspicious. permalink parent award report block reply\nHIGH_ENERGY_MEMES 2 points 6 days ago Combines and tractors are always on the roads. You see this where I am, also ATVs and kids on dirt bikes. The community has general rule you do this stuff in the valley as its rural but dont take vehicles out of it to the local town. Rural cops are pretty chill as they are part of the community and get it. Also works because people are responsible. We had one family move in that was trouble, doing burnouts everywhere and taking bikes onto other people properties type behaviour. Cops went and had a chat with them, no idea what they said but I haven't seem them take a unregistered vehicle off the property in over 18 months. Everyone else, no problem. That's the way communities should work. permalink parent award report block reply\nNZbacon 1 points 5 days ago Farmers don't drive enclosed semi trailers.  They're useless for farming. permalink parent award report block reply RedStoneDeepState 2 points 5 days ago Sure they do, dig a trench for the rear wheels and you have a cheap storage solution. permalink parent award report block reply NZbacon 2 points 5 days ago Cut a hole in the end and you've got a cheap bridge too. But that ain't out on the road. permalink parent award report block reply view 1 more comments...\nRedStoneDeepState 2 points 5 days ago Sure they do, dig a trench for the rear wheels and you have a cheap storage solution. permalink parent award report block reply NZbacon 2 points 5 days ago Cut a hole in the end and you've got a cheap bridge too. But that ain't out on the road. permalink parent award report block reply view 1 more comments...\nNZbacon 2 points 5 days ago Cut a hole in the end and you've got a cheap bridge too. But that ain't out on the road. permalink parent award report block reply view 1 more comments...\ndeleted -1 points 6 days ago NZbacon 2 points 5 days ago Noone is identified as the driver. permalink parent award report block reply\nNZbacon 2 points 5 days ago Noone is identified as the driver. permalink parent award report block reply\nPatriotSkorzeny 18 points 6 days ago Because people with badges LET THEM. What would you have a civilian do? permalink award report block reply FromGodNotMonkey 2 points 5 days ago In Arkansas we have Highway police that only look at commercial vehicles. They’d never be able to get away with this here. This must have happened in one of those states where they issue drivers licenses with “no name” permalink parent award report block reply\nFromGodNotMonkey 2 points 5 days ago In Arkansas we have Highway police that only look at commercial vehicles. They’d never be able to get away with this here. This must have happened in one of those states where they issue drivers licenses with “no name” permalink parent award report block reply\nTaylor3006 16 points 6 days ago Arrest the driver, impound the truck and when the case is done, crush the truck, the trailer, and the contents. Anyone who uses these people to haul their goods should be held to account and suffer along with the criminals. permalink award report block reply D__1 5 points 6 days ago I doubt he was transporting legal cargo. permalink parent award report block reply RuleoVicus 5 points 6 days ago People. permalink parent award report block reply\nD__1 5 points 6 days ago I doubt he was transporting legal cargo. permalink parent award report block reply RuleoVicus 5 points 6 days ago People. permalink parent award report block reply\nRuleoVicus 5 points 6 days ago People. permalink parent award report block reply\nR3tro 16 points 6 days ago Part 2 of the video continues where part 1 left off…. Tldr…. No spare tires, no air brake lines, no breaks, no transmission, no engine, no steering wheel, no windshield,  no deodorant found in the cab, no live goats left in the sleeper compartment. permalink award report block reply RuleoVicus 9 points 6 days ago Lol bro as I was reading my inner monologue was going \"should ask for the link to part 2\" until the 'no transmission'.... fuuuuuu you got me lol permalink parent award report block reply\nRuleoVicus 9 points 6 days ago Lol bro as I was reading my inner monologue was going \"should ask for the link to part 2\" until the 'no transmission'.... fuuuuuu you got me lol permalink parent award report block reply\nKilroyJCNJ 13 points 6 days ago Years ago, when I was commuting 77 miles each way, I would take the truck lanes because I would rather take my chances with professional drivers over the amateurs in the “ Cars Only “ lanes. If I had to do it now, I would take local roads all the way down and back. permalink award report block reply NY2KCMO1776 7 points 6 days ago I was taught to drive on the new jersey turnpike on the local route, with tractor trailers by Newark Airport.  MY parents forced me to get comfortable around them, never hang out in blind spots etc.  I would take the local lanes to avoid traffic and I felt comfortable because truckers were white males and predictable.   Fast forward 20 years I bought a car in kansas.  Almost had one run me off the road week one.  Saw multiple tractors on the left lane not passing, lots of ghetto and 3rd world drivers.  Trucks are cutting people off as if they are in an Altima.  Now I avoid trucks at all costs.  Inevitably I get stuck behind some jackass in the left lane just cruising along in the blind spot of a truck not even attempting to pass.  I back off, got to the right and pass them off.  Drive in 35 in kansas or 70 and you see it all Day. permalink parent award report block reply KilroyJCNJ 1 points 4 days ago 14 to 7A and back was fun. I will also say Atlanta is even worse. permalink parent award report block reply\nNY2KCMO1776 7 points 6 days ago I was taught to drive on the new jersey turnpike on the local route, with tractor trailers by Newark Airport.  MY parents forced me to get comfortable around them, never hang out in blind spots etc.  I would take the local lanes to avoid traffic and I felt comfortable because truckers were white males and predictable.   Fast forward 20 years I bought a car in kansas.  Almost had one run me off the road week one.  Saw multiple tractors on the left lane not passing, lots of ghetto and 3rd world drivers.  Trucks are cutting people off as if they are in an Altima.  Now I avoid trucks at all costs.  Inevitably I get stuck behind some jackass in the left lane just cruising along in the blind spot of a truck not even attempting to pass.  I back off, got to the right and pass them off.  Drive in 35 in kansas or 70 and you see it all Day. permalink parent award report block reply KilroyJCNJ 1 points 4 days ago 14 to 7A and back was fun. I will also say Atlanta is even worse. permalink parent award report block reply\nKilroyJCNJ 1 points 4 days ago 14 to 7A and back was fun. I will also say Atlanta is even worse. permalink parent award report block reply\nDarkheartisland 12 points 6 days ago That's wild. Wonder what color their turban is. permalink award report block reply RuleoVicus 3 points 6 days ago Brown. permalink parent award report block reply\nRuleoVicus 3 points 6 days ago Brown. permalink parent award report block reply\nSwedishChainsaw2 9 points 6 days ago No mention of the load. What was he hauling and for who? Where was the load from? permalink award report block reply\nAccipiterQ 8 points 6 days ago VIN number didn't go back to anything??? permalink award report block reply MocksFordComma 3 points 6 days ago Mexican trailer? permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago We're gonna need a bigger trebuchet ... permalink parent award report block reply joggin_noggin 1 points 5 days ago Either that or Canadian. permalink parent award report block reply\nMocksFordComma 3 points 6 days ago Mexican trailer? permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago We're gonna need a bigger trebuchet ... permalink parent award report block reply joggin_noggin 1 points 5 days ago Either that or Canadian. permalink parent award report block reply\nSicSemperTyrannis2 2 points 6 days ago We're gonna need a bigger trebuchet ... permalink parent award report block reply\njoggin_noggin 1 points 5 days ago Either that or Canadian. permalink parent award report block reply\njml1997 8 points 6 days ago Driver was arrested? Right???? permalink award report block reply PiratePatriotParrot OP 17 points 6 days ago He was given his $17,000 in food stamps and his $8,000 for crossing the border. He was then given his vote in our elections, and FHA home loan and temporary housing in a 5 star hotel with 5 star service. permalink parent award report block reply ingrowntoenail 5 points 6 days ago Don't forget the free Obama phone. permalink parent award report block reply deleted -3 points 6 days ago NZbacon 2 points 5 days ago You're shilling this everywhere.  There is noone in that video identified as the driver permalink parent award report block reply RedStoneDeepState -8 points 6 days ago This screams farm use/mechanic/redneck not an illegal. I have seen worse farm use trucks out of Colorado. permalink parent award report block reply ingrowntoenail 4 points 6 days ago No it doesn't. permalink parent award report block reply RedStoneDeepState -4 points 6 days ago How did they get the truck? Did the illegal come here with 20k to buy it? permalink parent award report block reply view 4 more comments... clownworld30330 3 points 6 days ago Deported permalink parent award report block reply RedStoneDeepState -4 points 6 days ago Waah, snowflake niggеr faggot cant stand hearing anything that goes against their world view. permalink parent award report block reply ScamBlondie 1 points 6 days ago 🤣🤣🤣 permalink parent award report block reply\nPiratePatriotParrot OP 17 points 6 days ago He was given his $17,000 in food stamps and his $8,000 for crossing the border. He was then given his vote in our elections, and FHA home loan and temporary housing in a 5 star hotel with 5 star service. permalink parent award report block reply ingrowntoenail 5 points 6 days ago Don't forget the free Obama phone. permalink parent award report block reply deleted -3 points 6 days ago NZbacon 2 points 5 days ago You're shilling this everywhere.  There is noone in that video identified as the driver permalink parent award report block reply RedStoneDeepState -8 points 6 days ago This screams farm use/mechanic/redneck not an illegal. I have seen worse farm use trucks out of Colorado. permalink parent award report block reply ingrowntoenail 4 points 6 days ago No it doesn't. permalink parent award report block reply RedStoneDeepState -4 points 6 days ago How did they get the truck? Did the illegal come here with 20k to buy it? permalink parent award report block reply view 4 more comments... clownworld30330 3 points 6 days ago Deported permalink parent award report block reply RedStoneDeepState -4 points 6 days ago Waah, snowflake niggеr faggot cant stand hearing anything that goes against their world view. permalink parent award report block reply\ningrowntoenail 5 points 6 days ago Don't forget the free Obama phone. permalink parent award report block reply\ndeleted -3 points 6 days ago NZbacon 2 points 5 days ago You're shilling this everywhere.  There is noone in that video identified as the driver permalink parent award report block reply\nNZbacon 2 points 5 days ago You're shilling this everywhere.  There is noone in that video identified as the driver permalink parent award report block reply\nRedStoneDeepState -8 points 6 days ago This screams farm use/mechanic/redneck not an illegal. I have seen worse farm use trucks out of Colorado. permalink parent award report block reply ingrowntoenail 4 points 6 days ago No it doesn't. permalink parent award report block reply RedStoneDeepState -4 points 6 days ago How did they get the truck? Did the illegal come here with 20k to buy it? permalink parent award report block reply view 4 more comments... clownworld30330 3 points 6 days ago Deported permalink parent award report block reply RedStoneDeepState -4 points 6 days ago Waah, snowflake niggеr faggot cant stand hearing anything that goes against their world view. permalink parent award report block reply\ningrowntoenail 4 points 6 days ago No it doesn't. permalink parent award report block reply RedStoneDeepState -4 points 6 days ago How did they get the truck? Did the illegal come here with 20k to buy it? permalink parent award report block reply view 4 more comments...\nRedStoneDeepState -4 points 6 days ago How did they get the truck? Did the illegal come here with 20k to buy it? permalink parent award report block reply view 4 more comments...\nclownworld30330 3 points 6 days ago Deported permalink parent award report block reply RedStoneDeepState -4 points 6 days ago Waah, snowflake niggеr faggot cant stand hearing anything that goes against their world view. permalink parent award report block reply\nRedStoneDeepState -4 points 6 days ago Waah, snowflake niggеr faggot cant stand hearing anything that goes against their world view. permalink parent award report block reply\nScamBlondie 1 points 6 days ago 🤣🤣🤣 permalink parent award report block reply\nKennyKetchem 7 points 6 days ago No turn signal especially on the right is very dangerous for a big rig. It is a massive blind spot for the driver. permalink award report block reply\nFrankDuncan 5 points 6 days ago Somebody was on the way to pick up cartel drugs or illegals permalink award report block reply RuleoVicus 1 points 6 days ago Yup. permalink parent award report block reply\nRuleoVicus 1 points 6 days ago Yup. permalink parent award report block reply\nGunmolester 5 points 6 days ago I drive the 40 often and usually see swerving trucks...from now on im calling it in permalink award report block reply\nferaxil 5 points 6 days ago Geez, I wonder how they're trucking in all the drugs and fentanyl. it's a total mystery permalink award report block reply\nMintap 4 points 6 days ago How many illegal aliens in the trailer? permalink award report block reply\nTrustYourself 4 points 6 days ago Holy shit. permalink award report block reply\nfreedom-thinker 3 points 6 days ago And how will it be investigated???? permalink award report block reply\nTexasnumber1 3 points 6 days ago And let me guess the people that hire these illegals nothing will happen to them right.......? As always this illegal will get freed into the country once again, to do it all over again Perpetual insanity. permalink award report block reply deleted -3 points 6 days ago NZbacon 1 points 5 days ago Nope.  Driver is not identified in the video permalink parent award report block reply\ndeleted -3 points 6 days ago NZbacon 1 points 5 days ago Nope.  Driver is not identified in the video permalink parent award report block reply\nNZbacon 1 points 5 days ago Nope.  Driver is not identified in the video permalink parent award report block reply\nFirespawn 3 points 6 days ago There's a Bosnian trucking company close to where I work. Those stupid MFS will park in the road, blocking traffic, take 15 minutes to turn around, have the noses of the semis half a car length out in the road. I'm always flipping them off or cussing them out. Wish they'd get checked. I bet they'd lose some drivers. And in the summer, they have music blaring that sounds like some Muslim bullshit. permalink award report block reply SicSemperTyrannis2 3 points 6 days ago Report them. Seriously! DOT is probably more relevant than Police. permalink parent award report block reply Firespawn 2 points 5 days ago My friend did. He was 10 minutes late for work today, all due to them getting a truck stuck in a ditch while the trailer blocked the road. We go by a point system at work. They gave him half a point for being late and their stupid ass  response to what happened was \"maybe you should leave earlier for work\"\nThere's only one way in and out. We are on a dead end road. He said he called DOT and he won't stop until something is done. permalink parent award report block reply SicSemperTyrannis2 1 points 5 days ago My last job has a disciplinary system like that, and on top of it they give out written warnings for attendance like candy. A full crew on one shift has 15 people, one day they handed out 10. It's juvenile ... Good luck to you getting this addressed via LEO, whether that be DOT or whoever. permalink parent award report block reply\nSicSemperTyrannis2 3 points 6 days ago Report them. Seriously! DOT is probably more relevant than Police. permalink parent award report block reply Firespawn 2 points 5 days ago My friend did. He was 10 minutes late for work today, all due to them getting a truck stuck in a ditch while the trailer blocked the road. We go by a point system at work. They gave him half a point for being late and their stupid ass  response to what happened was \"maybe you should leave earlier for work\"\nThere's only one way in and out. We are on a dead end road. He said he called DOT and he won't stop until something is done. permalink parent award report block reply SicSemperTyrannis2 1 points 5 days ago My last job has a disciplinary system like that, and on top of it they give out written warnings for attendance like candy. A full crew on one shift has 15 people, one day they handed out 10. It's juvenile ... Good luck to you getting this addressed via LEO, whether that be DOT or whoever. permalink parent award report block reply\nFirespawn 2 points 5 days ago My friend did. He was 10 minutes late for work today, all due to them getting a truck stuck in a ditch while the trailer blocked the road. We go by a point system at work. They gave him half a point for being late and their stupid ass  response to what happened was \"maybe you should leave earlier for work\"\nThere's only one way in and out. We are on a dead end road. He said he called DOT and he won't stop until something is done. permalink parent award report block reply SicSemperTyrannis2 1 points 5 days ago My last job has a disciplinary system like that, and on top of it they give out written warnings for attendance like candy. A full crew on one shift has 15 people, one day they handed out 10. It's juvenile ... Good luck to you getting this addressed via LEO, whether that be DOT or whoever. permalink parent award report block reply\nSicSemperTyrannis2 1 points 5 days ago My last job has a disciplinary system like that, and on top of it they give out written warnings for attendance like candy. A full crew on one shift has 15 people, one day they handed out 10. It's juvenile ... Good luck to you getting this addressed via LEO, whether that be DOT or whoever. permalink parent award report block reply\n67Vert 3 points 6 days ago Don’t worry. Thats all perfectly fine in Cali. permalink award report block reply\nelmerecido 3 points 6 days ago Until a Leftist dirtbag like Pelosi looses a relative to one of these scofflaws smashing their car to a pancake, I expect nothing to change. permalink award report block reply\nSGT_Glowie 3 points 6 days ago I avoid them like the plague now. permalink award report block reply\nexcelance 3 points 6 days ago Who the hell is paying these drivers? permalink award report block reply\nRoadpower 3 points 6 days ago I didn't see wheel chalks deployed. I would not be doing an inspection on that truck without those. That truck will probably never make it back to whoever bought it and instead end up at an auction. permalink award report block reply TrumpRideorDie74 4 points 6 days ago You referring to chocks? permalink parent award report block reply Roadpower 3 points 6 days ago Yes thank you. permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago Nah just have the DOT inspector mark the bad tires with chalk - that'll fix everything including the VIN# LOL permalink parent award report block reply\nTrumpRideorDie74 4 points 6 days ago You referring to chocks? permalink parent award report block reply Roadpower 3 points 6 days ago Yes thank you. permalink parent award report block reply SicSemperTyrannis2 2 points 6 days ago Nah just have the DOT inspector mark the bad tires with chalk - that'll fix everything including the VIN# LOL permalink parent award report block reply\nRoadpower 3 points 6 days ago Yes thank you. permalink parent award report block reply\nSicSemperTyrannis2 2 points 6 days ago Nah just have the DOT inspector mark the bad tires with chalk - that'll fix everything including the VIN# LOL permalink parent award report block reply\nMelodicgrog 3 points 6 days ago Dang. Missed “welded frame”. Almost got bingo. permalink award report block reply RuleoVicus 3 points 6 days ago Rofl. Hey there's a funny YT channel called Just Rolled In. There's a running gag within the community about 'structural foam spray' and 'HB Weld fixes most codes'. I bet you'd enjoy. permalink parent award report block reply grapeape67 1 points 6 days ago reddit has a board called \"just rolled into the shop\". For auto mechanics. It is hilarious, too. permalink parent award report block reply Melodicgrog 1 points 5 days ago Yeah watch them and now I’m afraid to drive with those people on the road permalink parent award report block reply\nRuleoVicus 3 points 6 days ago Rofl. Hey there's a funny YT channel called Just Rolled In. There's a running gag within the community about 'structural foam spray' and 'HB Weld fixes most codes'. I bet you'd enjoy. permalink parent award report block reply grapeape67 1 points 6 days ago reddit has a board called \"just rolled into the shop\". For auto mechanics. It is hilarious, too. permalink parent award report block reply Melodicgrog 1 points 5 days ago Yeah watch them and now I’m afraid to drive with those people on the road permalink parent award report block reply\ngrapeape67 1 points 6 days ago reddit has a board called \"just rolled into the shop\". For auto mechanics. It is hilarious, too. permalink parent award report block reply\nMelodicgrog 1 points 5 days ago Yeah watch them and now I’m afraid to drive with those people on the road permalink parent award report block reply\nMaxmax 3 points 6 days ago And, the driver??? permalink award report block reply deleted -4 points 6 days ago NZbacon 4 points 5 days ago The driver is not identified in the video. permalink parent award report block reply\ndeleted -4 points 6 days ago NZbacon 4 points 5 days ago The driver is not identified in the video. permalink parent award report block reply\nNZbacon 4 points 5 days ago The driver is not identified in the video. permalink parent award report block reply\nKungPaoMcChicken 3 points 6 days ago We used to have standards... permalink award report block reply\nHunterBidensPC 2 points 6 days ago So straight to jail and fines for the company right? Like fuck. wtf are we doing!? permalink award report block reply SicSemperTyrannis2 2 points 6 days ago Try identifying the company. Hold it until you get a SWAT team for backup, this is beyond suspicious ... permalink parent award report block reply\nSicSemperTyrannis2 2 points 6 days ago Try identifying the company. Hold it until you get a SWAT team for backup, this is beyond suspicious ... permalink parent award report block reply\nTruthWillOut 2 points 5 days ago Illegals gonna illegal. permalink award report block reply\nTrumpRideorDie74 2 points 6 days ago And probably no English permalink award report block reply deleted -3 points 6 days ago NZbacon 3 points 5 days ago The driver is not identified in the video. permalink parent award report block reply\ndeleted -3 points 6 days ago NZbacon 3 points 5 days ago The driver is not identified in the video. permalink parent award report block reply\nNZbacon 3 points 5 days ago The driver is not identified in the video. permalink parent award report block reply\nfjzappa 2 points 6 days ago Arrest the driver and impound truck and the cargo.  Put an end to this shit permalink award report block reply\nSimaYi 2 points 6 days ago Third world country. permalink award report block reply\nPreludachris 2 points 6 days ago What?! permalink award report block reply\nKlown_Kutz 1 points 5 days ago Hey this is what the Libertopians want on our roads. Enjoy what y’all ask for! permalink award report block reply\nMAGALADON9 1 points 5 days ago He is just a hard working cartel affiliated big eyed blinkity blink immigrant permalink award report block reply\nPearlyGaits57 1 points 5 days ago Who hires these asshats, they need to be held accountable as well. permalink award report block reply\nRiehlpissed 1 points 5 days ago What’s in the trailer? permalink award report block reply\nCovfefe_Commando 1 points 6 days ago No Name Given.  But a CDL was issued, anyway. permalink award report block reply ArtLife 8 points 6 days ago No, he said no CDL, not even a regular DL. He had zero. I'm curious what loads are these guys hauling? What companies are brokering these loads? I mean this stuff belongs to someone and is going somewhere. permalink parent award report block reply RuleoVicus 3 points 6 days ago No shit. Hired criminals are caught yet the employers are untouched. RICO ignored. permalink parent award report block reply ArtLife 1 points 5 days ago Yeah that's total BS. Trucks like these are not delivering to some regular DC. They are hauling stolen property, maybe people, who knows. Put the thumb screws to the driver to find out who pays him to drive this deathtrap. permalink parent award report block reply deleted 2 points 6 days ago ArtLife 2 points 5 days ago IIRC he said the VIN didn't match the truck. They make no mention of cargo so don't know if he was empty. The whole thing is super sus and should be investigated. The inspector kept saying he was only going to talk about the violations so maybe a bigger picture here we are unaware of. permalink parent award report block reply deleted 2 points 5 days ago view 3 more comments... SicSemperTyrannis2 1 points 4 days ago You're right, the VIN# is just bad, \"doesn't go back to anything.\" permalink parent award report block reply deleted 8 points 6 days ago MocksFordComma 4 points 6 days ago Betting on Mexican truck in Texas permalink parent award report block reply\nArtLife 8 points 6 days ago No, he said no CDL, not even a regular DL. He had zero. I'm curious what loads are these guys hauling? What companies are brokering these loads? I mean this stuff belongs to someone and is going somewhere. permalink parent award report block reply RuleoVicus 3 points 6 days ago No shit. Hired criminals are caught yet the employers are untouched. RICO ignored. permalink parent award report block reply ArtLife 1 points 5 days ago Yeah that's total BS. Trucks like these are not delivering to some regular DC. They are hauling stolen property, maybe people, who knows. Put the thumb screws to the driver to find out who pays him to drive this deathtrap. permalink parent award report block reply deleted 2 points 6 days ago ArtLife 2 points 5 days ago IIRC he said the VIN didn't match the truck. They make no mention of cargo so don't know if he was empty. The whole thing is super sus and should be investigated. The inspector kept saying he was only going to talk about the violations so maybe a bigger picture here we are unaware of. permalink parent award report block reply deleted 2 points 5 days ago view 3 more comments... SicSemperTyrannis2 1 points 4 days ago You're right, the VIN# is just bad, \"doesn't go back to anything.\" permalink parent award report block reply\nRuleoVicus 3 points 6 days ago No shit. Hired criminals are caught yet the employers are untouched. RICO ignored. permalink parent award report block reply ArtLife 1 points 5 days ago Yeah that's total BS. Trucks like these are not delivering to some regular DC. They are hauling stolen property, maybe people, who knows. Put the thumb screws to the driver to find out who pays him to drive this deathtrap. permalink parent award report block reply\nArtLife 1 points 5 days ago Yeah that's total BS. Trucks like these are not delivering to some regular DC. They are hauling stolen property, maybe people, who knows. Put the thumb screws to the driver to find out who pays him to drive this deathtrap. permalink parent award report block reply\ndeleted 2 points 6 days ago ArtLife 2 points 5 days ago IIRC he said the VIN didn't match the truck. They make no mention of cargo so don't know if he was empty. The whole thing is super sus and should be investigated. The inspector kept saying he was only going to talk about the violations so maybe a bigger picture here we are unaware of. permalink parent award report block reply deleted 2 points 5 days ago view 3 more comments... SicSemperTyrannis2 1 points 4 days ago You're right, the VIN# is just bad, \"doesn't go back to anything.\" permalink parent award report block reply\nArtLife 2 points 5 days ago IIRC he said the VIN didn't match the truck. They make no mention of cargo so don't know if he was empty. The whole thing is super sus and should be investigated. The inspector kept saying he was only going to talk about the violations so maybe a bigger picture here we are unaware of. permalink parent award report block reply deleted 2 points 5 days ago view 3 more comments... SicSemperTyrannis2 1 points 4 days ago You're right, the VIN# is just bad, \"doesn't go back to anything.\" permalink parent award report block reply\ndeleted 2 points 5 days ago view 3 more comments...\nSicSemperTyrannis2 1 points 4 days ago You're right, the VIN# is just bad, \"doesn't go back to anything.\" permalink parent award report block reply\ndeleted 8 points 6 days ago MocksFordComma 4 points 6 days ago Betting on Mexican truck in Texas permalink parent award report block reply\nMocksFordComma 4 points 6 days ago Betting on Mexican truck in Texas permalink parent award report block reply\nMegabrain1960 1 points 5 days ago It might be a good idea to check the load in the trailer..? permalink award report block reply\nFromseatoshinningsea 1 points 5 days ago Is the driver in jail? Of course not permalink award report block reply\nhk416 1 points 5 days ago Trucker circle's are full of interesting specimens. I've heard from multiple vectors about the cattle hauling industry in the south. employers won't have you on their team unless you're doing meth that away you're up non-stop getting their cows delivered. permalink award report block reply\nworldowedexplanation 1 points 5 days ago This is terrifying and it’s amazing how dumbass Democrats seem to think this won’t affect them, like they don’t drive on roads? This is a major terrorist attack waiting to happen. Which is apparently just what the FBI wants, since they are allowing this. Imagine one of these trucks with a homemade bomb in it, driven into a building or a crowd. permalink award report block reply\nm203gunner 1 points 6 days ago It Newscum Cali duh permalink award report block reply\nRedStoneDeepState 0 points 6 days ago Unless that is a mechanic or farm use, that is prison time. permalink award report block reply\nBallotsOnRubysUSB -1 points 6 days ago ︎ Where is this? In Mexico or Africa? ︎ permalink award report block reply Framus 5 points 6 days ago I know, right?  Like the old saying goes, thank God it can't happen here! permalink parent award report block reply\nFramus 5 points 6 days ago I know, right?  Like the old saying goes, thank God it can't happen here! permalink parent award report block reply"}