{"id": "1ARK9oY1yu", "contents": "83 Secretary Rollins on fraud in the SNAP program: \"Very big announcements coming next week on this. We are cracking down. We now have a plan to fix it, and we're really, really excited about doing that for the American people.\" posted 14 hours ago by Hammond 11 comments award share report block Rapid Response 47 @RapidResponse47 • 14h .@SecRollins on fraud in the SNAP program: \"Very big announcements coming next week on this. We are cracking down. We now have a plan to fix it, and we're really, really excited about doing that for the American people.\"\n11 comments Sort by Top Top New Worst Old Save Greenhills 5 points 13 hours ago The only thing that satisfies me is that snap is directly allocated to people and not given to states to steal. permalink award report block reply Hoodlum 4 points 14 hours ago Knowing how things have been going, they will probably only target underemployed and displaced White millennials and Gen Z and completely ignore the millions of illegals and generational hood rats. Would love to be wrong. permalink award report block reply CleanUpPhillyTrump24 2 points 13 hours ago She mentioned illegals in the above, so it's obviously about requiring proof of citizenship and reapplication, which is already underway in HUD. Watch the video. permalink parent award report block reply Hoodlum 1 points 13 hours ago Like I said, I would love to be wrong. There have been a number of things this administration has said they were going to do that they then proceed to completely ignore. Pretending like that doesn't happen isn't going to change reality. permalink parent award report block reply ianpatrick1966 1 points 12 hours ago Will the 600k students coming from China be allowed to sign up? permalink parent award report block reply CleanUpPhillyTrump24 3 points 13 hours ago They're going to have the cards tied to ID like a debit card or credit card, and any fraud is trackable. If you sell the card, the USDA will easily know. States that act hinky about handing over their user data - poof, instant cut off from all fed funds from the USDA. permalink award report block reply Hammond OP 2 points 14 hours ago Link: https://x.com/RapidResponse47/status/1988770457764413724 permalink award report block reply Hikedelics 2 points 13 hours ago Lemme guess, 10 more business days? permalink award report block reply CleanUpPhillyTrump24 1 points 13 hours ago What are you whining about? The most significant welfare reform has already been implemented as of today since Bill Clinton and Newt Gingrich. permalink parent award report block reply AwShitHereWeGoAgain 2 points 12 hours ago Arrests. permalink award report block reply MemeWarsVet 1 points 14 hours ago Uh-huh. permalink award report block reply SpeekFreely 1 points 13 hours ago It’s not just a Democrat program, the Rs vote for it too. permalink award report block reply\nGreenhills 5 points 13 hours ago The only thing that satisfies me is that snap is directly allocated to people and not given to states to steal. permalink award report block reply\nHoodlum 4 points 14 hours ago Knowing how things have been going, they will probably only target underemployed and displaced White millennials and Gen Z and completely ignore the millions of illegals and generational hood rats. Would love to be wrong. permalink award report block reply CleanUpPhillyTrump24 2 points 13 hours ago She mentioned illegals in the above, so it's obviously about requiring proof of citizenship and reapplication, which is already underway in HUD. Watch the video. permalink parent award report block reply Hoodlum 1 points 13 hours ago Like I said, I would love to be wrong. There have been a number of things this administration has said they were going to do that they then proceed to completely ignore. Pretending like that doesn't happen isn't going to change reality. permalink parent award report block reply ianpatrick1966 1 points 12 hours ago Will the 600k students coming from China be allowed to sign up? permalink parent award report block reply\nCleanUpPhillyTrump24 2 points 13 hours ago She mentioned illegals in the above, so it's obviously about requiring proof of citizenship and reapplication, which is already underway in HUD. Watch the video. permalink parent award report block reply Hoodlum 1 points 13 hours ago Like I said, I would love to be wrong. There have been a number of things this administration has said they were going to do that they then proceed to completely ignore. Pretending like that doesn't happen isn't going to change reality. permalink parent award report block reply ianpatrick1966 1 points 12 hours ago Will the 600k students coming from China be allowed to sign up? permalink parent award report block reply\nHoodlum 1 points 13 hours ago Like I said, I would love to be wrong. There have been a number of things this administration has said they were going to do that they then proceed to completely ignore. Pretending like that doesn't happen isn't going to change reality. permalink parent award report block reply\nianpatrick1966 1 points 12 hours ago Will the 600k students coming from China be allowed to sign up? permalink parent award report block reply\nCleanUpPhillyTrump24 3 points 13 hours ago They're going to have the cards tied to ID like a debit card or credit card, and any fraud is trackable. If you sell the card, the USDA will easily know. States that act hinky about handing over their user data - poof, instant cut off from all fed funds from the USDA. permalink award report block reply\nHammond OP 2 points 14 hours ago Link: https://x.com/RapidResponse47/status/1988770457764413724 permalink award report block reply\nHikedelics 2 points 13 hours ago Lemme guess, 10 more business days? permalink award report block reply CleanUpPhillyTrump24 1 points 13 hours ago What are you whining about? The most significant welfare reform has already been implemented as of today since Bill Clinton and Newt Gingrich. permalink parent award report block reply\nCleanUpPhillyTrump24 1 points 13 hours ago What are you whining about? The most significant welfare reform has already been implemented as of today since Bill Clinton and Newt Gingrich. permalink parent award report block reply\nAwShitHereWeGoAgain 2 points 12 hours ago Arrests. permalink award report block reply\nMemeWarsVet 1 points 14 hours ago Uh-huh. permalink award report block reply\nSpeekFreely 1 points 13 hours ago It’s not just a Democrat program, the Rs vote for it too. permalink award report block reply"}