{"id": "1ARK5BGs9X", "contents": "1018 Outgoing NYC Mayor Eric Adams to allow fired COVID workers to get jobs back (justthenews.com) posted 3 days ago by Sea_Still 24 comments award share report block Outgoing NYC Mayor Eric Adams to allow fired COVID workers to get jobs back Adams, who steps down on Dec. 31, said he is giving about 2,900 city workers who were fired during the pandemic over their refusal to get vaccinated another shot at coming back to work as he prepares to depart City Hall. justthenews.com\n24 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style MeMargie 37 points 3 days ago We sure do have a lot of government employees permalink award report block reply McFatty7 1 points 3 days ago Government employees is like UBI, but with an extra step or two. permalink parent award report block reply Roadpower 1 points 3 days ago Bingo. permalink parent award report block reply ProtestantPatriot777 13 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply bck- 11 points 3 days ago From the winter of severe illness and death? permalink parent award report block reply The_Return_of_User_x 4 points 3 days ago Plastic nano particles in their balls? High Fructose Corn Syrup? Flouride? Jabb-Fever? How about climate change! permalink parent award report block reply thisisatestof2 10 points 3 days ago Trying save face. permalink award report block reply ARMENTO 8 points 3 days ago Maybe so. But he seems genuine (or at least, less evil) since his party turned on him in the last year or two. permalink parent award report block reply Bohemyth_2 9 points 3 days ago recent eric adams searches reveal resumè padding how to blend into muslim society dress suggestions for met gala burqa? permalink award report block reply Hanging_Chad 7 points 3 days ago with backpay? permalink award report block reply pixiepepe 12 points 3 days ago Per the article: \"Under the plan, terminated employees will be offered the opportunity to return to their same job at the same rate of pay, Adams said, but without credit for the time they didn't work, and with no right to backpay.\" permalink parent award report block reply ARMENTO 7 points 3 days ago Sounds like a bunch of lawyers will jump on this opportunity for lost wages. permalink parent award report block reply SavingPrivateGrace 7 points 3 days ago \"without credit for the time they didn't work, and with no right to backpay.\"  Most of the jobs were in public schools and Housing Authority. permalink parent award report block reply NYforTrump 4 points 3 days ago Mamdani is going to make me miss this asshole so much permalink award report block reply schiff_for_brains 3 points 3 days ago He's trying to sabotage mamdani permalink award report block reply YaharaRiver 1 points 2 days ago Yes.  I like it 👍 permalink parent award report block reply snoozeflu 3 points 3 days ago It's been 6 years. I think most folks have moved on and have other jobs by now. permalink award report block reply mikethemarine 3 points 3 days ago tell the commie to fuck off and die, people are now fleeing the city and they need people that know what to do stay and be a slave permalink award report block reply Justlooking250 3 points 3 days ago Don't worry, Morondani will just fire them again permalink award report block reply MasterChief08 2 points 3 days ago He should be paying people to leak information for the next 8 years permalink award report block reply Roadpower 2 points 3 days ago Few to none of those people do real any work. They're just free loading jobs that they show up for. I see these people all the time milling about outside of gubment buildings smoking cigs or sitting in gubment vehicles doing nothing while the engine is running. They're less than useless. permalink award report block reply matt11707 1 points 3 days ago not bad, but he still sucks permalink award report block reply MAGALADON9 1 points 3 days ago Ohhhhhh no you don't mandummy is saving us from your bloated police gestapo permalink award report block reply BigE_123456 0 points 2 days ago You refused to get your shot so you can now come back to work for Mamdani and then get shot. What a deal!!! permalink award report block reply\nMeMargie 37 points 3 days ago We sure do have a lot of government employees permalink award report block reply McFatty7 1 points 3 days ago Government employees is like UBI, but with an extra step or two. permalink parent award report block reply Roadpower 1 points 3 days ago Bingo. permalink parent award report block reply ProtestantPatriot777 13 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply bck- 11 points 3 days ago From the winter of severe illness and death? permalink parent award report block reply The_Return_of_User_x 4 points 3 days ago Plastic nano particles in their balls? High Fructose Corn Syrup? Flouride? Jabb-Fever? How about climate change! permalink parent award report block reply\nMcFatty7 1 points 3 days ago Government employees is like UBI, but with an extra step or two. permalink parent award report block reply Roadpower 1 points 3 days ago Bingo. permalink parent award report block reply\nRoadpower 1 points 3 days ago Bingo. permalink parent award report block reply\nProtestantPatriot777 13 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply bck- 11 points 3 days ago From the winter of severe illness and death? permalink parent award report block reply The_Return_of_User_x 4 points 3 days ago Plastic nano particles in their balls? High Fructose Corn Syrup? Flouride? Jabb-Fever? How about climate change! permalink parent award report block reply\nbck- 11 points 3 days ago From the winter of severe illness and death? permalink parent award report block reply The_Return_of_User_x 4 points 3 days ago Plastic nano particles in their balls? High Fructose Corn Syrup? Flouride? Jabb-Fever? How about climate change! permalink parent award report block reply\nThe_Return_of_User_x 4 points 3 days ago Plastic nano particles in their balls? High Fructose Corn Syrup? Flouride? Jabb-Fever? How about climate change! permalink parent award report block reply\nthisisatestof2 10 points 3 days ago Trying save face. permalink award report block reply ARMENTO 8 points 3 days ago Maybe so. But he seems genuine (or at least, less evil) since his party turned on him in the last year or two. permalink parent award report block reply\nARMENTO 8 points 3 days ago Maybe so. But he seems genuine (or at least, less evil) since his party turned on him in the last year or two. permalink parent award report block reply\nBohemyth_2 9 points 3 days ago recent eric adams searches reveal resumè padding how to blend into muslim society dress suggestions for met gala burqa? permalink award report block reply\nHanging_Chad 7 points 3 days ago with backpay? permalink award report block reply pixiepepe 12 points 3 days ago Per the article: \"Under the plan, terminated employees will be offered the opportunity to return to their same job at the same rate of pay, Adams said, but without credit for the time they didn't work, and with no right to backpay.\" permalink parent award report block reply ARMENTO 7 points 3 days ago Sounds like a bunch of lawyers will jump on this opportunity for lost wages. permalink parent award report block reply SavingPrivateGrace 7 points 3 days ago \"without credit for the time they didn't work, and with no right to backpay.\"  Most of the jobs were in public schools and Housing Authority. permalink parent award report block reply\npixiepepe 12 points 3 days ago Per the article: \"Under the plan, terminated employees will be offered the opportunity to return to their same job at the same rate of pay, Adams said, but without credit for the time they didn't work, and with no right to backpay.\" permalink parent award report block reply ARMENTO 7 points 3 days ago Sounds like a bunch of lawyers will jump on this opportunity for lost wages. permalink parent award report block reply\nARMENTO 7 points 3 days ago Sounds like a bunch of lawyers will jump on this opportunity for lost wages. permalink parent award report block reply\nSavingPrivateGrace 7 points 3 days ago \"without credit for the time they didn't work, and with no right to backpay.\"  Most of the jobs were in public schools and Housing Authority. permalink parent award report block reply\nNYforTrump 4 points 3 days ago Mamdani is going to make me miss this asshole so much permalink award report block reply\nschiff_for_brains 3 points 3 days ago He's trying to sabotage mamdani permalink award report block reply YaharaRiver 1 points 2 days ago Yes.  I like it 👍 permalink parent award report block reply\nYaharaRiver 1 points 2 days ago Yes.  I like it 👍 permalink parent award report block reply\nsnoozeflu 3 points 3 days ago It's been 6 years. I think most folks have moved on and have other jobs by now. permalink award report block reply\nmikethemarine 3 points 3 days ago tell the commie to fuck off and die, people are now fleeing the city and they need people that know what to do stay and be a slave permalink award report block reply\nJustlooking250 3 points 3 days ago Don't worry, Morondani will just fire them again permalink award report block reply\nMasterChief08 2 points 3 days ago He should be paying people to leak information for the next 8 years permalink award report block reply\nRoadpower 2 points 3 days ago Few to none of those people do real any work. They're just free loading jobs that they show up for. I see these people all the time milling about outside of gubment buildings smoking cigs or sitting in gubment vehicles doing nothing while the engine is running. They're less than useless. permalink award report block reply\nmatt11707 1 points 3 days ago not bad, but he still sucks permalink award report block reply\nMAGALADON9 1 points 3 days ago Ohhhhhh no you don't mandummy is saving us from your bloated police gestapo permalink award report block reply\nBigE_123456 0 points 2 days ago You refused to get your shot so you can now come back to work for Mamdani and then get shot. What a deal!!! permalink award report block reply"}