{"id": "1ARK9mGPGH", "contents": "155 If you got clear enough skies, take a break from leftist fags and check out a natural wonder tonight posted 20 hours ago by DingleBalls 17 comments award share download report block\n17 comments Sort by Top Top New Worst Old Save suntzu 6 points 19 hours ago i see pepe 👀🤌🐸 permalink award report block reply SmartyPants 6 points 18 hours ago I saw it with my granddaughter. God made that moment for us! permalink award report block reply OldGamerGuy79 6 points 19 hours ago For those ootl, Two X1 solar flares along with a massive X5 solar flare erupted late last night and we’re getting hit by all three simultaneously. This is a VERY RARE event and could potentially cause havoc on our infrastructure. https://youtu.be/AuPXenTkajk?si=l_Q_wMH0w-C73yIl permalink award report block reply ColonelKlink 5 points 20 hours ago We were able to see it, It's beautiful. permalink award report block reply henri_derelicte 3 points 18 hours ago I’ve seen them before, but this was the first time I was able to really see them with the naked eye permalink award report block reply TrumpVoter1 1 points 6 hours ago The one seen last year in Georgia was more impressive. Curious how tonight will be. permalink parent award report block reply SavingPrivateGrace 3 points 19 hours ago Yes, the clearest I've ever seen.  Exactly like your pic. permalink award report block reply HeavenlyTrumpets 3 points 19 hours ago This was incredible. I'm over 40 this is the first time I've ever seen them. permalink award report block reply GuerillaYourDreams 3 points 18 hours ago And I am reminded that we will all be able to see Jesus Christ upon His return, in the clouds. permalink award report block reply YaharaRiver 2 points 18 hours ago Open skies <sigh> So nice. I am surrounded by mature trees in every direction and can only see between them. Gotta go outside and stand in the driveway and look up to see sky.  Usually having canopy is nice, but sometimes you miss good sunsets. Well, all the time really. :(  Thanks for the photo, looks fabulous. permalink award report block reply deepbake 2 points 19 hours ago HIGH ENERGY permalink award report block reply Tabascocat12 2 points 18 hours ago It will be even better tomorrow night extending its range 😎 permalink award report block reply ActNow 2 points 18 hours ago We had red skies here this evening. Snapped a pic before learning about the solar flare. permalink award report block reply Brookes 1 points 9 hours ago We had some very pink skies last night over the Catalina mountains outside Tucson! permalink award report block reply PoohBearBalloon 1 points 18 hours ago Pretty crazy what a weakened magnetic field can do. permalink award report block reply schiff_for_brains 1 points 18 hours ago Clouds are too thick here.  But I\"ll try again befoe bed. permalink award report block reply\nsuntzu 6 points 19 hours ago i see pepe 👀🤌🐸 permalink award report block reply\nSmartyPants 6 points 18 hours ago I saw it with my granddaughter. God made that moment for us! permalink award report block reply\nOldGamerGuy79 6 points 19 hours ago For those ootl, Two X1 solar flares along with a massive X5 solar flare erupted late last night and we’re getting hit by all three simultaneously. This is a VERY RARE event and could potentially cause havoc on our infrastructure. https://youtu.be/AuPXenTkajk?si=l_Q_wMH0w-C73yIl permalink award report block reply\nColonelKlink 5 points 20 hours ago We were able to see it, It's beautiful. permalink award report block reply\nhenri_derelicte 3 points 18 hours ago I’ve seen them before, but this was the first time I was able to really see them with the naked eye permalink award report block reply TrumpVoter1 1 points 6 hours ago The one seen last year in Georgia was more impressive. Curious how tonight will be. permalink parent award report block reply\nTrumpVoter1 1 points 6 hours ago The one seen last year in Georgia was more impressive. Curious how tonight will be. permalink parent award report block reply\nSavingPrivateGrace 3 points 19 hours ago Yes, the clearest I've ever seen.  Exactly like your pic. permalink award report block reply\nHeavenlyTrumpets 3 points 19 hours ago This was incredible. I'm over 40 this is the first time I've ever seen them. permalink award report block reply\nGuerillaYourDreams 3 points 18 hours ago And I am reminded that we will all be able to see Jesus Christ upon His return, in the clouds. permalink award report block reply\nYaharaRiver 2 points 18 hours ago Open skies <sigh> So nice. I am surrounded by mature trees in every direction and can only see between them. Gotta go outside and stand in the driveway and look up to see sky.  Usually having canopy is nice, but sometimes you miss good sunsets. Well, all the time really. :(  Thanks for the photo, looks fabulous. permalink award report block reply\ndeepbake 2 points 19 hours ago HIGH ENERGY permalink award report block reply\nTabascocat12 2 points 18 hours ago It will be even better tomorrow night extending its range 😎 permalink award report block reply\nActNow 2 points 18 hours ago We had red skies here this evening. Snapped a pic before learning about the solar flare. permalink award report block reply\nBrookes 1 points 9 hours ago We had some very pink skies last night over the Catalina mountains outside Tucson! permalink award report block reply\nPoohBearBalloon 1 points 18 hours ago Pretty crazy what a weakened magnetic field can do. permalink award report block reply\nschiff_for_brains 1 points 18 hours ago Clouds are too thick here.  But I\"ll try again befoe bed. permalink award report block reply"}