{"id": "1ARK9oYa98", "contents": "82 🫷🏼 𝐑𝐞𝐩. 𝐓𝐢𝐦 𝐁𝐮𝐫𝐜𝐡𝐞𝐭𝐭: I tried to release the Epstein files today. Democrats 𝙗𝙡𝙤𝙘𝙠𝙚𝙙 it... posted 13 hours ago by TheRedPilledArtist 7 comments award share report block Rep. Tim Burchett Press Office @RepTimBurchett • 15h I tried to release the Epstein files today. Democrats blocked it.\n7 comments Sort by Top Top New Worst Old Save Around the Web Doctor: A Teaspoon Kills All Worms in Your Body! Paratoxil Aggrieved03 10 points 13 hours ago Like the guy in the bar who said he’d beat your ass but his girlfriend is holding him back. Neither side wants it released. permalink award report block reply Tyscribz 6 points 12 hours ago Just release it why do you need the democrats permission? Fuck em, quit being a bitch permalink award report block reply LORDFALCONE 5 points 12 hours ago They're ALL blackmailed permalink award report block reply armyofpedes4usa 3 points 12 hours ago They were either never really planning to, or were \"made an offer they couldn't refuse.\" permalink award report block reply Lisa7209 1 points 9 hours ago We have a majority in the Senate. If Republicans stuck together, this would have passed...So, Republicans blocked iy you dolt!! permalink award report block reply YaharaRiver 0 points 13 hours ago What are the democrats hiding?! permalink award report block reply Lisa7209 4 points 9 hours ago The same thing the Republicans are hiding. permalink parent award report block reply\nAggrieved03 10 points 13 hours ago Like the guy in the bar who said he’d beat your ass but his girlfriend is holding him back. Neither side wants it released. permalink award report block reply\nTyscribz 6 points 12 hours ago Just release it why do you need the democrats permission? Fuck em, quit being a bitch permalink award report block reply\nLORDFALCONE 5 points 12 hours ago They're ALL blackmailed permalink award report block reply\narmyofpedes4usa 3 points 12 hours ago They were either never really planning to, or were \"made an offer they couldn't refuse.\" permalink award report block reply\nLisa7209 1 points 9 hours ago We have a majority in the Senate. If Republicans stuck together, this would have passed...So, Republicans blocked iy you dolt!! permalink award report block reply\nYaharaRiver 0 points 13 hours ago What are the democrats hiding?! permalink award report block reply Lisa7209 4 points 9 hours ago The same thing the Republicans are hiding. permalink parent award report block reply\nLisa7209 4 points 9 hours ago The same thing the Republicans are hiding. permalink parent award report block reply"}