{"id": "1ARK0Ubd1U", "contents": "457 DOJ charges 3 more Chinese nationals at Univ. of Michigan for smuggling biological materials into the U.S. posted 7 days ago by Looniz74 PRO 15 comments award share report block Breaking911 @Breaking911 • 7d BREAKING: DOJ charges 3 more Chinese nationals at Univ. of Michigan for smuggling biological materials into the U.S. \"These men are part of a long and alarming pattern of criminal activities committed by Chinese Nationals under the cover of the University of Michigan,\" said U.S.\n15 comments Sort by Top Top New Worst Old Save Filo76 15 points 7 days ago Huh. It’s almost like bringing in hordes of foreigners is bad for our country. permalink award report block reply Darth0311 6 points 7 days ago Especially from countries that are known adversaries. [Dems with surprised Pikachu faces waiting to blame it on racism] permalink parent award report block reply PoohBearBalloon 4 points 7 days ago Imagine what surprises they have stashed away in their illegal marijuana grow houses just waiting for the signal.  Forget Russia, China is the real threat and is especially dangerous now before their population crisis really kicks into high gear. permalink award report block reply punkalicious 4 points 7 days ago Ann Arbor is a whore. permalink award report block reply Mulletgunning 4 points 7 days ago Oh no! You fags better get ready,you only have 600 thousand more to keep an eye on along with the current ones here.MAGA AF permalink award report block reply 2FBIAgents1Cup 3 points 7 days ago U of M is fully compromised permalink award report block reply ZangiefQueef 3 points 7 days ago All schools are permalink parent award report block reply Trooph-Hurts 3 points 7 days ago Stop the press…..   you mean SMUGGLING WMD!  I’m sorry, this is GITMO time permalink award report block reply Gtrfan 3 points 7 days ago Yet President Trump treats China with kid gloves. permalink award report block reply Looniz74 OP PRO 3 points 7 days ago https://x.com/Breaking911/status/1986234619482522073 permalink award report block reply Ligersrule1 1 points 7 days ago Sum Ting Wong (yet again) permalink award report block reply ZangiefQueef 1 points 7 days ago Death penalty now permalink award report block reply FUCK_TYLER 1 points 6 days ago the fuck permalink award report block reply HoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink award report block reply\nFilo76 15 points 7 days ago Huh. It’s almost like bringing in hordes of foreigners is bad for our country. permalink award report block reply Darth0311 6 points 7 days ago Especially from countries that are known adversaries. [Dems with surprised Pikachu faces waiting to blame it on racism] permalink parent award report block reply\nDarth0311 6 points 7 days ago Especially from countries that are known adversaries. [Dems with surprised Pikachu faces waiting to blame it on racism] permalink parent award report block reply\nPoohBearBalloon 4 points 7 days ago Imagine what surprises they have stashed away in their illegal marijuana grow houses just waiting for the signal.  Forget Russia, China is the real threat and is especially dangerous now before their population crisis really kicks into high gear. permalink award report block reply\npunkalicious 4 points 7 days ago Ann Arbor is a whore. permalink award report block reply\nMulletgunning 4 points 7 days ago Oh no! You fags better get ready,you only have 600 thousand more to keep an eye on along with the current ones here.MAGA AF permalink award report block reply\n2FBIAgents1Cup 3 points 7 days ago U of M is fully compromised permalink award report block reply ZangiefQueef 3 points 7 days ago All schools are permalink parent award report block reply\nZangiefQueef 3 points 7 days ago All schools are permalink parent award report block reply\nTrooph-Hurts 3 points 7 days ago Stop the press…..   you mean SMUGGLING WMD!  I’m sorry, this is GITMO time permalink award report block reply\nGtrfan 3 points 7 days ago Yet President Trump treats China with kid gloves. permalink award report block reply\nLooniz74 OP PRO 3 points 7 days ago https://x.com/Breaking911/status/1986234619482522073 permalink award report block reply\nLigersrule1 1 points 7 days ago Sum Ting Wong (yet again) permalink award report block reply\nZangiefQueef 1 points 7 days ago Death penalty now permalink award report block reply\nFUCK_TYLER 1 points 6 days ago the fuck permalink award report block reply\nHoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink award report block reply"}