{"id": "1ARK9mHW3Y", "contents": "42 Order of business. America Last policies. posted 12 hours ago by MickHigan2 5 comments award share report block Dan Patrick @DanPatrick • 2d UPDATE: The U.S. Senate just passed HR5371 to reopen the Federal Government. Notably, the resolution prioritized a ban on intoxicating hemp THC, similar to the bill passed by the Texas Legislature. In the midst of the Federal Government shutdown, the U.S. Senate felt so\n5 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style BannedAccount 3 points 11 hours ago It was already banned federally you cant ban it any harder but its hilarious when congress creatures make posts like this bragging about why they're gonna lose their seat. permalink award report block reply astralentity 1 points 12 hours ago Can the House strip it out? permalink award report block reply Hambonemcgee -1 points 12 hours ago Is this a ban on hemp derived thc-a or delta 8?   I actually believe that shit should be banned because it's not the same as regular thc.  For one, it doesn't get you high so dumb people smoke way too much of it trying to catch a buzz and trigger hyperemesis syndrome.  Normal weed doesn't have this effect on people. permalink award report block reply TrumpsLoyalist 2 points 12 hours ago None of what you said is even remotely true permalink parent award report block reply Hambonemcgee 2 points 11 hours ago Since I have personally tried to get high off it, I think I know.  I also know a young man that developed CHS from smoking delta 8.  That shit is bunk. permalink parent award report block reply\nBannedAccount 3 points 11 hours ago It was already banned federally you cant ban it any harder but its hilarious when congress creatures make posts like this bragging about why they're gonna lose their seat. permalink award report block reply\nastralentity 1 points 12 hours ago Can the House strip it out? permalink award report block reply\nHambonemcgee -1 points 12 hours ago Is this a ban on hemp derived thc-a or delta 8?   I actually believe that shit should be banned because it's not the same as regular thc.  For one, it doesn't get you high so dumb people smoke way too much of it trying to catch a buzz and trigger hyperemesis syndrome.  Normal weed doesn't have this effect on people. permalink award report block reply TrumpsLoyalist 2 points 12 hours ago None of what you said is even remotely true permalink parent award report block reply Hambonemcgee 2 points 11 hours ago Since I have personally tried to get high off it, I think I know.  I also know a young man that developed CHS from smoking delta 8.  That shit is bunk. permalink parent award report block reply\nTrumpsLoyalist 2 points 12 hours ago None of what you said is even remotely true permalink parent award report block reply Hambonemcgee 2 points 11 hours ago Since I have personally tried to get high off it, I think I know.  I also know a young man that developed CHS from smoking delta 8.  That shit is bunk. permalink parent award report block reply\nHambonemcgee 2 points 11 hours ago Since I have personally tried to get high off it, I think I know.  I also know a young man that developed CHS from smoking delta 8.  That shit is bunk. permalink parent award report block reply"}