{"id": "1ARK57rxVW", "contents": "274 from 1953 to 1970, United Airlines offered a men-only flight featuring cigars, cocktails, & full steak dinners 🥩🚬🍸👩🏻‍✈️✈️ YES posted 4 days ago by Hanging_Chad 22 comments award share report block Dudes Posting Their W’s @DudespostingWs • 6d From 1953 to 1970, United Airlines offered a men-only flight featuring cigars, cocktails, and full steak dinners 🔥\n22 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style Deplora 11 points 4 days ago Men only . . . except for the stewardesses. permalink award report block reply Futuo 7 points 4 days ago Who you could rest assured did not resemble Rosie O'Donnell clones. permalink parent award report block reply SimaYi 4 points 4 days ago Or faggots. permalink parent award report block reply deleted 9 points 4 days ago ApparentlyAssumption 7 points 4 days ago Are you women willing to pay for it? Or will it be like the wnba where you won't support it but beg others to keep it in business. permalink parent award report block reply Aquamine-Amarine 2 points 4 days ago Comparing a plane to a sport isn't exactly a good comparison. A male only or female only plane would be far more popular than a sport that's just for entertainment, which you don't really need. Unlike a plane, which you do need if you work or travel. Wouldn't these things be paid for by the airline with all the money they make selling the tickets? permalink parent award report block reply BonginosRac1stCowboy 2 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply Bboop 6 points 4 days ago With cute guys permalink parent award report block reply Aquamine-Amarine 3 points 4 days ago I agree. Both sexes deserve to have their own spaces. permalink parent award report block reply blitzkrieg1 7 points 4 days ago Those were the days. permalink award report block reply DrVSGGEOTUSPhD 1 points 4 days ago And you knew who you were then. permalink parent award report block reply blitzkrieg1 1 points 4 days ago Assume at your own risk. I was one in 62.  I merely spoke of the times. permalink parent award report block reply DrVSGGEOTUSPhD 2 points 4 days ago Oh no...I thought we were doing the Archie bunker intro song...because that guy looks like Archie bunker https://youtu.be/0d8FTPv955I?si=kaDyYaix15yHA61u permalink parent award report block reply Breacherbear 6 points 4 days ago We used to be a proper country permalink award report block reply TrumpAndGodWin 2 points 4 days ago Isn't it queer that you rarely hear anyone say we can correct it if strong men simply work together in large enough numbers. permalink parent award report block reply greatpumpkin 5 points 4 days ago It was a simpler time. A better time. permalink award report block reply Luvs_2_Bop 4 points 4 days ago And now they’re run by a crossdressing faggot ceo who laughed on national tv about firing his employees who refused the clot shot permalink award report block reply suckmycorona 4 points 4 days ago Society is basically always in a race to zero.  Flying is basically the subways of the sky. permalink award report block reply corntortilla 3 points 4 days ago Finally some peace and quiet! permalink award report block reply Wizard_Glick 3 points 4 days ago They were awesome! permalink award report block reply mikethemarine 2 points 4 days ago Shit I would pay the extra money just to have that back again, my wife can sneak into baggage department permalink award report block reply\nDeplora 11 points 4 days ago Men only . . . except for the stewardesses. permalink award report block reply Futuo 7 points 4 days ago Who you could rest assured did not resemble Rosie O'Donnell clones. permalink parent award report block reply SimaYi 4 points 4 days ago Or faggots. permalink parent award report block reply\nFutuo 7 points 4 days ago Who you could rest assured did not resemble Rosie O'Donnell clones. permalink parent award report block reply SimaYi 4 points 4 days ago Or faggots. permalink parent award report block reply\nSimaYi 4 points 4 days ago Or faggots. permalink parent award report block reply\ndeleted 9 points 4 days ago ApparentlyAssumption 7 points 4 days ago Are you women willing to pay for it? Or will it be like the wnba where you won't support it but beg others to keep it in business. permalink parent award report block reply Aquamine-Amarine 2 points 4 days ago Comparing a plane to a sport isn't exactly a good comparison. A male only or female only plane would be far more popular than a sport that's just for entertainment, which you don't really need. Unlike a plane, which you do need if you work or travel. Wouldn't these things be paid for by the airline with all the money they make selling the tickets? permalink parent award report block reply BonginosRac1stCowboy 2 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply Bboop 6 points 4 days ago With cute guys permalink parent award report block reply Aquamine-Amarine 3 points 4 days ago I agree. Both sexes deserve to have their own spaces. permalink parent award report block reply\nApparentlyAssumption 7 points 4 days ago Are you women willing to pay for it? Or will it be like the wnba where you won't support it but beg others to keep it in business. permalink parent award report block reply Aquamine-Amarine 2 points 4 days ago Comparing a plane to a sport isn't exactly a good comparison. A male only or female only plane would be far more popular than a sport that's just for entertainment, which you don't really need. Unlike a plane, which you do need if you work or travel. Wouldn't these things be paid for by the airline with all the money they make selling the tickets? permalink parent award report block reply BonginosRac1stCowboy 2 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nAquamine-Amarine 2 points 4 days ago Comparing a plane to a sport isn't exactly a good comparison. A male only or female only plane would be far more popular than a sport that's just for entertainment, which you don't really need. Unlike a plane, which you do need if you work or travel. Wouldn't these things be paid for by the airline with all the money they make selling the tickets? permalink parent award report block reply\nBonginosRac1stCowboy 2 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nBboop 6 points 4 days ago With cute guys permalink parent award report block reply\nAquamine-Amarine 3 points 4 days ago I agree. Both sexes deserve to have their own spaces. permalink parent award report block reply\nblitzkrieg1 7 points 4 days ago Those were the days. permalink award report block reply DrVSGGEOTUSPhD 1 points 4 days ago And you knew who you were then. permalink parent award report block reply blitzkrieg1 1 points 4 days ago Assume at your own risk. I was one in 62.  I merely spoke of the times. permalink parent award report block reply DrVSGGEOTUSPhD 2 points 4 days ago Oh no...I thought we were doing the Archie bunker intro song...because that guy looks like Archie bunker https://youtu.be/0d8FTPv955I?si=kaDyYaix15yHA61u permalink parent award report block reply\nDrVSGGEOTUSPhD 1 points 4 days ago And you knew who you were then. permalink parent award report block reply blitzkrieg1 1 points 4 days ago Assume at your own risk. I was one in 62.  I merely spoke of the times. permalink parent award report block reply DrVSGGEOTUSPhD 2 points 4 days ago Oh no...I thought we were doing the Archie bunker intro song...because that guy looks like Archie bunker https://youtu.be/0d8FTPv955I?si=kaDyYaix15yHA61u permalink parent award report block reply\nblitzkrieg1 1 points 4 days ago Assume at your own risk. I was one in 62.  I merely spoke of the times. permalink parent award report block reply DrVSGGEOTUSPhD 2 points 4 days ago Oh no...I thought we were doing the Archie bunker intro song...because that guy looks like Archie bunker https://youtu.be/0d8FTPv955I?si=kaDyYaix15yHA61u permalink parent award report block reply\nDrVSGGEOTUSPhD 2 points 4 days ago Oh no...I thought we were doing the Archie bunker intro song...because that guy looks like Archie bunker https://youtu.be/0d8FTPv955I?si=kaDyYaix15yHA61u permalink parent award report block reply\nBreacherbear 6 points 4 days ago We used to be a proper country permalink award report block reply TrumpAndGodWin 2 points 4 days ago Isn't it queer that you rarely hear anyone say we can correct it if strong men simply work together in large enough numbers. permalink parent award report block reply\nTrumpAndGodWin 2 points 4 days ago Isn't it queer that you rarely hear anyone say we can correct it if strong men simply work together in large enough numbers. permalink parent award report block reply\ngreatpumpkin 5 points 4 days ago It was a simpler time. A better time. permalink award report block reply\nLuvs_2_Bop 4 points 4 days ago And now they’re run by a crossdressing faggot ceo who laughed on national tv about firing his employees who refused the clot shot permalink award report block reply\nsuckmycorona 4 points 4 days ago Society is basically always in a race to zero.  Flying is basically the subways of the sky. permalink award report block reply\ncorntortilla 3 points 4 days ago Finally some peace and quiet! permalink award report block reply\nWizard_Glick 3 points 4 days ago They were awesome! permalink award report block reply\nmikethemarine 2 points 4 days ago Shit I would pay the extra money just to have that back again, my wife can sneak into baggage department permalink award report block reply"}