{"id": "1ARK591S5e", "contents": "973 RFK Jr.’s HHS just exposed deep corruption inside the CDC’s vaccine advisory panel (ACIP).\n\n97% of members never filed conflict-of-interest waivers.\nNone ever voted against a vaccine.\nAnd several took money from Pfizer, Merck, and GSK. posted 3 days ago by blue5707 23 comments award share report block Dr. Simone Gold @drsimonegold • 4d BREAKING: RFK Jr.’s HHS just exposed deep corruption inside the CDC’s vaccine advisory panel (ACIP). 97% of members never filed conflict-of-interest waivers. None ever voted against a vaccine. And several took money from Pfizer, Merck, and GSK. This is shocking.\n23 comments Sort by Top Top New Worst Old Save Around the Web Hair Will Grow Back! No Matter How Severe The Baldness HaloGrow guywholikesDjtof2024 25 points 3 days ago Seize all assets, arrest those responsible and all those connected to them, etc. You know the drill. The rot is deep. permalink award report block reply IlhansBrother 12 points 3 days ago Rico prosecutions in a red state permalink parent award report block reply Bullet3250 17 points 3 days ago We used to have at least a partial MEDIA that would dig up facts like this and chase corruption where ever it was found... Now, the entire MEDIA is 'owned' by that very same corruption. permalink award report block reply cyberwar 10 points 3 days ago all lamestream media depends on the pharma ad money permalink parent award report block reply Bullet3250 8 points 3 days ago There was a time when Big Pharma was not allowed to buy ads for their drugs. We really need to re-instate that policy. permalink parent award report block reply grenades_and_ham 9 points 3 days ago “Pravda” permalink parent award report block reply NZ_Pede 14 points 3 days ago \"This is shocking\" Only if you are fucking retarded permalink award report block reply Sgt_Hulka 9 points 3 days ago Ok, now do something about it. Put people in jail. FOR THE LOVE OF GOD, DO SOMETHING permalink award report block reply billybaldwin2 7 points 3 days ago The left has been complaining about this for 5 - 20+ years. Something about when they stop being top execs at big pharma companies, they work for CDC. RFK is also coming at it from the left as well. permalink award report block reply GenWashington 8 points 3 days ago Not the left I would argue. Mainly the hippies and earth people. They get associated with the left because the right never embraced holistic views. That changed with covids permalink parent award report block reply Carterslvrpilz 5 points 3 days ago Reminder Our government hates us and wants us dead. permalink award report block reply JasonF84 4 points 3 days ago Color me shocked! Shocked I tell you!!!! permalink award report block reply Darkpoisonousshaddow 3 points 3 days ago Nothing. Will. Happen. permalink award report block reply SaltyTitties4 2 points 3 days ago Some of us have known this for years.  No one who isn’t mind controlled should be surprised by this. permalink award report block reply GA_Logic 2 points 3 days ago Time to go after them. permalink award report block reply PoleWatcher 2 points 3 days ago Another news flash that ends in..... wait till the end... Nothing ever happens permalink award report block reply crackerstacker 2 points 3 days ago Tax undisclosed royalties at 100%. Then nail them for tax evasion if they don't disclose. permalink award report block reply Smurfection 2 points 3 days ago Was the CDC trying to poison us?  I'm asking this seriously.   Where they committed to the injuring and death of Americans because they certainly seemed to be wanting that. permalink award report block reply elstegosaur 0 points 3 days ago I think so.  I can't prove it outright, but my theory is that we have been purposely 'poisoned' by government directives.  We were told to eat the wrong food, which caused problems.  We were told we needed pills to address those problems, not the root cause.  The problems persist and medical care is needed as we age.  The people making the big decisions know they have mislead us for profit, and we have all been brainwashed in some way or another with their bullshit(although a lot of us here have gotten wise to the game, we all still have blind/washed spots).  AND we pay for it every step of the way.  Medical enslavement and tyranny. I think the food is the key... people are not getting enough saturated fat and protein to make their brains and bodies work right; The brains are easier to control when they are malfunctioning.  If we eat right, we feel right, we think right, we act right. permalink parent award report block reply Smurfection 3 points 3 days ago I think it's part of the replacement process too.  They want to rule over two bit thieves and crooks and moochers who are too illiterate, too unschooled and too unsophisticated to understand the deep deceit embedded in communism.   It's why no developed nation has ever installed communism.  Communist revolutions only happened in nations with peasants, aristocrats and widespread reliance on manual labor.  No developed nation has ever implemented communism because development takes a somewhat sophisticated population that understands taxes, supply lines, supply and demand and trade infrastructure. permalink parent award report block reply HockeyMom4Trump 1 points 3 days ago money money money It’s always about the money. Follow the money! permalink award report block reply SDsc0rch 1 points 3 days ago can we arrest even ONE corrupt govt official? just...... a SINGLE ONE?!? permalink award report block reply Nanteen 1 points 3 days ago So let's have a list of names put out and then prosecutions. Begin? Oh let me guess just two more weeks right? permalink award report block reply Spellmonger 1 points 3 days ago I looked for information on the members because they do not deserve anonymity.  At the ACIP site, I read that there are 19 voting members - So there is only https://www.cdc.gov/acip/membership/index.html So there was only 1 supposedly honest member. permalink award report block reply TrumpVoter1 1 points 3 days ago How is this shocking? How do you think they get so drugs approved so quickly now? permalink award report block reply\nguywholikesDjtof2024 25 points 3 days ago Seize all assets, arrest those responsible and all those connected to them, etc. You know the drill. The rot is deep. permalink award report block reply IlhansBrother 12 points 3 days ago Rico prosecutions in a red state permalink parent award report block reply\nIlhansBrother 12 points 3 days ago Rico prosecutions in a red state permalink parent award report block reply\nBullet3250 17 points 3 days ago We used to have at least a partial MEDIA that would dig up facts like this and chase corruption where ever it was found... Now, the entire MEDIA is 'owned' by that very same corruption. permalink award report block reply cyberwar 10 points 3 days ago all lamestream media depends on the pharma ad money permalink parent award report block reply Bullet3250 8 points 3 days ago There was a time when Big Pharma was not allowed to buy ads for their drugs. We really need to re-instate that policy. permalink parent award report block reply grenades_and_ham 9 points 3 days ago “Pravda” permalink parent award report block reply\ncyberwar 10 points 3 days ago all lamestream media depends on the pharma ad money permalink parent award report block reply Bullet3250 8 points 3 days ago There was a time when Big Pharma was not allowed to buy ads for their drugs. We really need to re-instate that policy. permalink parent award report block reply\nBullet3250 8 points 3 days ago There was a time when Big Pharma was not allowed to buy ads for their drugs. We really need to re-instate that policy. permalink parent award report block reply\ngrenades_and_ham 9 points 3 days ago “Pravda” permalink parent award report block reply\nNZ_Pede 14 points 3 days ago \"This is shocking\" Only if you are fucking retarded permalink award report block reply\nSgt_Hulka 9 points 3 days ago Ok, now do something about it. Put people in jail. FOR THE LOVE OF GOD, DO SOMETHING permalink award report block reply\nbillybaldwin2 7 points 3 days ago The left has been complaining about this for 5 - 20+ years. Something about when they stop being top execs at big pharma companies, they work for CDC. RFK is also coming at it from the left as well. permalink award report block reply GenWashington 8 points 3 days ago Not the left I would argue. Mainly the hippies and earth people. They get associated with the left because the right never embraced holistic views. That changed with covids permalink parent award report block reply\nGenWashington 8 points 3 days ago Not the left I would argue. Mainly the hippies and earth people. They get associated with the left because the right never embraced holistic views. That changed with covids permalink parent award report block reply\nCarterslvrpilz 5 points 3 days ago Reminder Our government hates us and wants us dead. permalink award report block reply\nJasonF84 4 points 3 days ago Color me shocked! Shocked I tell you!!!! permalink award report block reply\nDarkpoisonousshaddow 3 points 3 days ago Nothing. Will. Happen. permalink award report block reply\nSaltyTitties4 2 points 3 days ago Some of us have known this for years.  No one who isn’t mind controlled should be surprised by this. permalink award report block reply\nGA_Logic 2 points 3 days ago Time to go after them. permalink award report block reply\nPoleWatcher 2 points 3 days ago Another news flash that ends in..... wait till the end... Nothing ever happens permalink award report block reply\ncrackerstacker 2 points 3 days ago Tax undisclosed royalties at 100%. Then nail them for tax evasion if they don't disclose. permalink award report block reply\nSmurfection 2 points 3 days ago Was the CDC trying to poison us?  I'm asking this seriously.   Where they committed to the injuring and death of Americans because they certainly seemed to be wanting that. permalink award report block reply elstegosaur 0 points 3 days ago I think so.  I can't prove it outright, but my theory is that we have been purposely 'poisoned' by government directives.  We were told to eat the wrong food, which caused problems.  We were told we needed pills to address those problems, not the root cause.  The problems persist and medical care is needed as we age.  The people making the big decisions know they have mislead us for profit, and we have all been brainwashed in some way or another with their bullshit(although a lot of us here have gotten wise to the game, we all still have blind/washed spots).  AND we pay for it every step of the way.  Medical enslavement and tyranny. I think the food is the key... people are not getting enough saturated fat and protein to make their brains and bodies work right; The brains are easier to control when they are malfunctioning.  If we eat right, we feel right, we think right, we act right. permalink parent award report block reply Smurfection 3 points 3 days ago I think it's part of the replacement process too.  They want to rule over two bit thieves and crooks and moochers who are too illiterate, too unschooled and too unsophisticated to understand the deep deceit embedded in communism.   It's why no developed nation has ever installed communism.  Communist revolutions only happened in nations with peasants, aristocrats and widespread reliance on manual labor.  No developed nation has ever implemented communism because development takes a somewhat sophisticated population that understands taxes, supply lines, supply and demand and trade infrastructure. permalink parent award report block reply\nelstegosaur 0 points 3 days ago I think so.  I can't prove it outright, but my theory is that we have been purposely 'poisoned' by government directives.  We were told to eat the wrong food, which caused problems.  We were told we needed pills to address those problems, not the root cause.  The problems persist and medical care is needed as we age.  The people making the big decisions know they have mislead us for profit, and we have all been brainwashed in some way or another with their bullshit(although a lot of us here have gotten wise to the game, we all still have blind/washed spots).  AND we pay for it every step of the way.  Medical enslavement and tyranny. I think the food is the key... people are not getting enough saturated fat and protein to make their brains and bodies work right; The brains are easier to control when they are malfunctioning.  If we eat right, we feel right, we think right, we act right. permalink parent award report block reply Smurfection 3 points 3 days ago I think it's part of the replacement process too.  They want to rule over two bit thieves and crooks and moochers who are too illiterate, too unschooled and too unsophisticated to understand the deep deceit embedded in communism.   It's why no developed nation has ever installed communism.  Communist revolutions only happened in nations with peasants, aristocrats and widespread reliance on manual labor.  No developed nation has ever implemented communism because development takes a somewhat sophisticated population that understands taxes, supply lines, supply and demand and trade infrastructure. permalink parent award report block reply\nSmurfection 3 points 3 days ago I think it's part of the replacement process too.  They want to rule over two bit thieves and crooks and moochers who are too illiterate, too unschooled and too unsophisticated to understand the deep deceit embedded in communism.   It's why no developed nation has ever installed communism.  Communist revolutions only happened in nations with peasants, aristocrats and widespread reliance on manual labor.  No developed nation has ever implemented communism because development takes a somewhat sophisticated population that understands taxes, supply lines, supply and demand and trade infrastructure. permalink parent award report block reply\nHockeyMom4Trump 1 points 3 days ago money money money It’s always about the money. Follow the money! permalink award report block reply\nSDsc0rch 1 points 3 days ago can we arrest even ONE corrupt govt official? just...... a SINGLE ONE?!? permalink award report block reply\nNanteen 1 points 3 days ago So let's have a list of names put out and then prosecutions. Begin? Oh let me guess just two more weeks right? permalink award report block reply\nSpellmonger 1 points 3 days ago I looked for information on the members because they do not deserve anonymity.  At the ACIP site, I read that there are 19 voting members - So there is only https://www.cdc.gov/acip/membership/index.html So there was only 1 supposedly honest member. permalink award report block reply\nTrumpVoter1 1 points 3 days ago How is this shocking? How do you think they get so drugs approved so quickly now? permalink award report block reply"}