{"id": "1ARK57sVfc", "contents": "383 Trump’s DOJ Fires More Immigration Judges in Effort to Slash Biden-era ‘Asylum Seeker’ Numbers (slaynews.com) posted 4 days ago by Sea_Still 25 comments award share report block Trump's DOJ Fires More Immigration Judges in Effort to Slash Biden-era 'Asylum Seeker' Numbers - Slay News President Donald Trump's Department of Justice (DOJ) has fired as many as 70 immigration judges since his new administration began in January. slaynews.com\n25 comments Sort by Top Top New Worst Old Save OhioRepublic 25 points 4 days ago Begin with all the ones named \"Cortez,\" \"Hernandez,\" \"Garcia,\" and \"Martinez\". permalink award report block reply OhioRepublic 20 points 4 days ago Throw in \"Gonzalez\" and \"Lopez\" and we'll have a decent start. permalink parent award report block reply Hanging_Chad 4 points 4 days ago Rodriguez, Pérez, Sanchez, Diaz, Fernandez, Gomez, Ramirez, Cruz, Jiménez, Torres, Morales, Flores, Rivera, Ocasio, Sheinbaum, Mohammad permalink parent award report block reply Viewer01 5 points 4 days ago Literally do this. https://imgflip.com/memegenerator/237132471/Peter-Griffin-skin-color-chart-race-terrorist-blank permalink parent award report block reply Hanging_Chad 1 points 4 days ago that’s colorist permalink parent award report block reply greatpumpkin 3 points 4 days ago Don't forget '-stein', '-berg', '-feld', and '-gold'. permalink parent award report block reply Vinnie 17 points 4 days ago Should have done that day one permalink award report block reply BlackPilledMAGA 11 points 4 days ago Exactly permalink parent award report block reply guywholikesDjtof2024 3 points 4 days ago Someone should list a timeline of EVERY ONE of Scam's accomplishments and failures. permalink parent award report block reply Hanging_Chad 2 points 4 days ago I’ll start with an accomplishment served as a key member of the legal & communications team defending President Trump during his 1st peach mint trial permalink parent award report block reply Vinnie 2 points 2 days ago Yeah that's fair. Pam Bondi is fulfilling her primary objective which is to shield the President from Lawfare, so credit where credit is due. permalink parent award report block reply SavingPrivateGrace 8 points 4 days ago There's a backlog of 3.5 million asylum seekers and another 2.3 million new ones.  The numbers are overwhelming, an additional 500k for 2025 year.  The judges were in place to speed up the process for the Dems. permalink award report block reply KernalMustard 4 points 4 days ago There's 170+ countries they can seek asylum. permalink parent award report block reply Aquamine-Amarine 1 points 4 days ago Aren't they only allowed to seek asylum in the very first country they walk into, so the one that borders the one they left? You can't just walk through a dozen countries and say you want to seek asylum in the U.S. permalink parent award report block reply MasterChief08 3 points 4 days ago Fucking disgusting. This is why I've cut out Democrats from my life. Not only were they cheering for moderates like Charlie to get murdered but they cheered for my country being invaded I hate the left so much, guys. Like I've never felt hatred for any group like I feel for these people. I hate them more than the illegal immigrants themselves. They truly are demonic. permalink parent award report block reply BlackPilledMAGA 7 points 4 days ago Why the wait? permalink award report block reply TheRedPilledArtist 5 points 4 days ago 𝙸 𝚟𝚘𝚝𝚎𝚍 𝚏𝚘𝚛 𝚝𝚑𝚊𝚝. permalink award report block reply MasterChief 4 points 4 days ago Where is my wall? permalink award report block reply BurtMcGirt 3 points 4 days ago Seek asylum somewhere else, especially if your culture is different. permalink award report block reply lovemylibs 3 points 4 days ago You're fired. permalink award report block reply BadBrainsBuzzcocks 3 points 4 days ago I want all those fake asylum parasites that are hanging around waiting for their cases gone so I hope we have the judges in place to speed that up. permalink award report block reply GoldwaterVoter 3 points 4 days ago We don't need judges to hand out tickets for south-bound charter buses and a baloney sammich in a paper bag, do we? permalink award report block reply Forty_Five 2 points 4 days ago Faster permalink award report block reply hey_spike 2 points 4 days ago Change name to: Deportation Judge. Much like Secretary of War, branding is important. A Deportation Judge will naturally favor deportation as the best judgement. permalink award report block reply john9985 2 points 4 days ago Federal judge orders they stay on the bench … permalink award report block reply fruckuschumer 1 points 4 days ago Jail, the noose, firing squad? permalink award report block reply\nOhioRepublic 25 points 4 days ago Begin with all the ones named \"Cortez,\" \"Hernandez,\" \"Garcia,\" and \"Martinez\". permalink award report block reply OhioRepublic 20 points 4 days ago Throw in \"Gonzalez\" and \"Lopez\" and we'll have a decent start. permalink parent award report block reply Hanging_Chad 4 points 4 days ago Rodriguez, Pérez, Sanchez, Diaz, Fernandez, Gomez, Ramirez, Cruz, Jiménez, Torres, Morales, Flores, Rivera, Ocasio, Sheinbaum, Mohammad permalink parent award report block reply Viewer01 5 points 4 days ago Literally do this. https://imgflip.com/memegenerator/237132471/Peter-Griffin-skin-color-chart-race-terrorist-blank permalink parent award report block reply Hanging_Chad 1 points 4 days ago that’s colorist permalink parent award report block reply greatpumpkin 3 points 4 days ago Don't forget '-stein', '-berg', '-feld', and '-gold'. permalink parent award report block reply\nOhioRepublic 20 points 4 days ago Throw in \"Gonzalez\" and \"Lopez\" and we'll have a decent start. permalink parent award report block reply Hanging_Chad 4 points 4 days ago Rodriguez, Pérez, Sanchez, Diaz, Fernandez, Gomez, Ramirez, Cruz, Jiménez, Torres, Morales, Flores, Rivera, Ocasio, Sheinbaum, Mohammad permalink parent award report block reply\nHanging_Chad 4 points 4 days ago Rodriguez, Pérez, Sanchez, Diaz, Fernandez, Gomez, Ramirez, Cruz, Jiménez, Torres, Morales, Flores, Rivera, Ocasio, Sheinbaum, Mohammad permalink parent award report block reply\nViewer01 5 points 4 days ago Literally do this. https://imgflip.com/memegenerator/237132471/Peter-Griffin-skin-color-chart-race-terrorist-blank permalink parent award report block reply Hanging_Chad 1 points 4 days ago that’s colorist permalink parent award report block reply\nHanging_Chad 1 points 4 days ago that’s colorist permalink parent award report block reply\ngreatpumpkin 3 points 4 days ago Don't forget '-stein', '-berg', '-feld', and '-gold'. permalink parent award report block reply\nVinnie 17 points 4 days ago Should have done that day one permalink award report block reply BlackPilledMAGA 11 points 4 days ago Exactly permalink parent award report block reply guywholikesDjtof2024 3 points 4 days ago Someone should list a timeline of EVERY ONE of Scam's accomplishments and failures. permalink parent award report block reply Hanging_Chad 2 points 4 days ago I’ll start with an accomplishment served as a key member of the legal & communications team defending President Trump during his 1st peach mint trial permalink parent award report block reply Vinnie 2 points 2 days ago Yeah that's fair. Pam Bondi is fulfilling her primary objective which is to shield the President from Lawfare, so credit where credit is due. permalink parent award report block reply\nBlackPilledMAGA 11 points 4 days ago Exactly permalink parent award report block reply\nguywholikesDjtof2024 3 points 4 days ago Someone should list a timeline of EVERY ONE of Scam's accomplishments and failures. permalink parent award report block reply Hanging_Chad 2 points 4 days ago I’ll start with an accomplishment served as a key member of the legal & communications team defending President Trump during his 1st peach mint trial permalink parent award report block reply Vinnie 2 points 2 days ago Yeah that's fair. Pam Bondi is fulfilling her primary objective which is to shield the President from Lawfare, so credit where credit is due. permalink parent award report block reply\nHanging_Chad 2 points 4 days ago I’ll start with an accomplishment served as a key member of the legal & communications team defending President Trump during his 1st peach mint trial permalink parent award report block reply Vinnie 2 points 2 days ago Yeah that's fair. Pam Bondi is fulfilling her primary objective which is to shield the President from Lawfare, so credit where credit is due. permalink parent award report block reply\nVinnie 2 points 2 days ago Yeah that's fair. Pam Bondi is fulfilling her primary objective which is to shield the President from Lawfare, so credit where credit is due. permalink parent award report block reply\nSavingPrivateGrace 8 points 4 days ago There's a backlog of 3.5 million asylum seekers and another 2.3 million new ones.  The numbers are overwhelming, an additional 500k for 2025 year.  The judges were in place to speed up the process for the Dems. permalink award report block reply KernalMustard 4 points 4 days ago There's 170+ countries they can seek asylum. permalink parent award report block reply Aquamine-Amarine 1 points 4 days ago Aren't they only allowed to seek asylum in the very first country they walk into, so the one that borders the one they left? You can't just walk through a dozen countries and say you want to seek asylum in the U.S. permalink parent award report block reply MasterChief08 3 points 4 days ago Fucking disgusting. This is why I've cut out Democrats from my life. Not only were they cheering for moderates like Charlie to get murdered but they cheered for my country being invaded I hate the left so much, guys. Like I've never felt hatred for any group like I feel for these people. I hate them more than the illegal immigrants themselves. They truly are demonic. permalink parent award report block reply\nKernalMustard 4 points 4 days ago There's 170+ countries they can seek asylum. permalink parent award report block reply Aquamine-Amarine 1 points 4 days ago Aren't they only allowed to seek asylum in the very first country they walk into, so the one that borders the one they left? You can't just walk through a dozen countries and say you want to seek asylum in the U.S. permalink parent award report block reply\nAquamine-Amarine 1 points 4 days ago Aren't they only allowed to seek asylum in the very first country they walk into, so the one that borders the one they left? You can't just walk through a dozen countries and say you want to seek asylum in the U.S. permalink parent award report block reply\nMasterChief08 3 points 4 days ago Fucking disgusting. This is why I've cut out Democrats from my life. Not only were they cheering for moderates like Charlie to get murdered but they cheered for my country being invaded I hate the left so much, guys. Like I've never felt hatred for any group like I feel for these people. I hate them more than the illegal immigrants themselves. They truly are demonic. permalink parent award report block reply\nBlackPilledMAGA 7 points 4 days ago Why the wait? permalink award report block reply\nTheRedPilledArtist 5 points 4 days ago 𝙸 𝚟𝚘𝚝𝚎𝚍 𝚏𝚘𝚛 𝚝𝚑𝚊𝚝. permalink award report block reply\nMasterChief 4 points 4 days ago Where is my wall? permalink award report block reply\nBurtMcGirt 3 points 4 days ago Seek asylum somewhere else, especially if your culture is different. permalink award report block reply\nlovemylibs 3 points 4 days ago You're fired. permalink award report block reply\nBadBrainsBuzzcocks 3 points 4 days ago I want all those fake asylum parasites that are hanging around waiting for their cases gone so I hope we have the judges in place to speed that up. permalink award report block reply\nGoldwaterVoter 3 points 4 days ago We don't need judges to hand out tickets for south-bound charter buses and a baloney sammich in a paper bag, do we? permalink award report block reply\nForty_Five 2 points 4 days ago Faster permalink award report block reply\nhey_spike 2 points 4 days ago Change name to: Deportation Judge. Much like Secretary of War, branding is important. A Deportation Judge will naturally favor deportation as the best judgement. permalink award report block reply\njohn9985 2 points 4 days ago Federal judge orders they stay on the bench … permalink award report block reply\nfruckuschumer 1 points 4 days ago Jail, the noose, firing squad? permalink award report block reply"}