{"id": "1ARK9nNhih", "contents": "17 If you have the money to short any / all AI stonks... then you should probably do it. posted 11 hours ago by MickHigan2 20 comments award share report block This is not financial advice but AI is obviously search engine 2.0. Lycos, askjeeves, and many, many others crashed and burned in a very similar fashion how AI's bubble will burst. Search Engine + Word Processor = AI\n20 comments Sort by Top Top New Worst Old Save Around the Web Hair Will Grow Back! No Matter How Severe The Baldness HaloGrow Rerun1Central 1 points 11 hours ago Buy puts with way out of the money strike prices.. you can only lose the premium. permalink award report block reply GoDawgs 1 points 10 hours ago Ummm, bruh…. Have you seen the market?  Shorting AI right now is like shorting the internet back in 1993.  You’re probably correct about there being a bubble, but it could still double before topping out (see S&P ‘95-‘99).  Save the cash, wait for the crash, buy & hold. permalink award report block reply SHILL_DETECTOR 1 points 11 hours ago shorting is risky...you can lose more money than you have permalink award report block reply BonginosRac1stCowboy 1 points 11 hours ago Comment removed by community moderators. permalink parent award report block reply Rerun1Central 1 points 11 hours ago You can set it up with 30 second phone call or online form permalink parent award report block reply SpeekFreely 1 points 11 hours ago I would just sit on cash, and buy the bottom. This next bottom is gonna be below basement prices. permalink award report block reply SHILL_DETECTOR 1 points 11 hours ago if you had 80k making like 220 bucks a month in savings, how much would you store in your tastytrade account to wait for the crash? permalink parent award report block reply GoDawgs 1 points 10 hours ago A high dividend bond ETF ($IEF, for example) is usually a good place to park cash.  Price doesn’t fluctuate much, but it will double the returns over a savings account. permalink parent award report block reply SHILL_DETECTOR 1 points 9 hours ago thank you for the info, how does this work exactly?  dividends go back into the brokerage account?? permalink parent award report block reply SHILL_DETECTOR 1 points 9 hours ago wow does that say it made 8.54% this year??? https://finance.yahoo.com/quote/IEF/ permalink parent award report block reply GoDawgs 1 points 3 minutes ago Yes on both, the dividends get deposited monthly into the brokerage account, or most brokers  will let you automatically reinvest them back into partial shares (ideal for compounding). permalink parent award report block reply view 1 more comments... SpeekFreely 1 points 10 hours ago If you’re sitting on 80K in cash you don’t care about 220 a month. That 80K is part of a bigger portfolio looking for a deal. permalink parent award report block reply SHILL_DETECTOR 1 points 10 hours ago do what???  why dont i care about 220 a month? permalink parent award report block reply SpeekFreely 1 points 10 hours ago You can care about it, but you’re not building a wealth plan w/it. permalink parent award report block reply view 3 more comments... Rerun1Central 1 points 11 hours ago Buy gold and wait permalink parent award report block reply SpeekFreely 1 points 10 hours ago Buy the miners, not the gold permalink parent award report block reply\nRerun1Central 1 points 11 hours ago Buy puts with way out of the money strike prices.. you can only lose the premium. permalink award report block reply\nGoDawgs 1 points 10 hours ago Ummm, bruh…. Have you seen the market?  Shorting AI right now is like shorting the internet back in 1993.  You’re probably correct about there being a bubble, but it could still double before topping out (see S&P ‘95-‘99).  Save the cash, wait for the crash, buy & hold. permalink award report block reply\nSHILL_DETECTOR 1 points 11 hours ago shorting is risky...you can lose more money than you have permalink award report block reply BonginosRac1stCowboy 1 points 11 hours ago Comment removed by community moderators. permalink parent award report block reply Rerun1Central 1 points 11 hours ago You can set it up with 30 second phone call or online form permalink parent award report block reply\nBonginosRac1stCowboy 1 points 11 hours ago Comment removed by community moderators. permalink parent award report block reply Rerun1Central 1 points 11 hours ago You can set it up with 30 second phone call or online form permalink parent award report block reply\nRerun1Central 1 points 11 hours ago You can set it up with 30 second phone call or online form permalink parent award report block reply\nSpeekFreely 1 points 11 hours ago I would just sit on cash, and buy the bottom. This next bottom is gonna be below basement prices. permalink award report block reply SHILL_DETECTOR 1 points 11 hours ago if you had 80k making like 220 bucks a month in savings, how much would you store in your tastytrade account to wait for the crash? permalink parent award report block reply GoDawgs 1 points 10 hours ago A high dividend bond ETF ($IEF, for example) is usually a good place to park cash.  Price doesn’t fluctuate much, but it will double the returns over a savings account. permalink parent award report block reply SHILL_DETECTOR 1 points 9 hours ago thank you for the info, how does this work exactly?  dividends go back into the brokerage account?? permalink parent award report block reply SHILL_DETECTOR 1 points 9 hours ago wow does that say it made 8.54% this year??? https://finance.yahoo.com/quote/IEF/ permalink parent award report block reply GoDawgs 1 points 3 minutes ago Yes on both, the dividends get deposited monthly into the brokerage account, or most brokers  will let you automatically reinvest them back into partial shares (ideal for compounding). permalink parent award report block reply view 1 more comments... SpeekFreely 1 points 10 hours ago If you’re sitting on 80K in cash you don’t care about 220 a month. That 80K is part of a bigger portfolio looking for a deal. permalink parent award report block reply SHILL_DETECTOR 1 points 10 hours ago do what???  why dont i care about 220 a month? permalink parent award report block reply SpeekFreely 1 points 10 hours ago You can care about it, but you’re not building a wealth plan w/it. permalink parent award report block reply view 3 more comments... Rerun1Central 1 points 11 hours ago Buy gold and wait permalink parent award report block reply SpeekFreely 1 points 10 hours ago Buy the miners, not the gold permalink parent award report block reply\nSHILL_DETECTOR 1 points 11 hours ago if you had 80k making like 220 bucks a month in savings, how much would you store in your tastytrade account to wait for the crash? permalink parent award report block reply GoDawgs 1 points 10 hours ago A high dividend bond ETF ($IEF, for example) is usually a good place to park cash.  Price doesn’t fluctuate much, but it will double the returns over a savings account. permalink parent award report block reply SHILL_DETECTOR 1 points 9 hours ago thank you for the info, how does this work exactly?  dividends go back into the brokerage account?? permalink parent award report block reply SHILL_DETECTOR 1 points 9 hours ago wow does that say it made 8.54% this year??? https://finance.yahoo.com/quote/IEF/ permalink parent award report block reply GoDawgs 1 points 3 minutes ago Yes on both, the dividends get deposited monthly into the brokerage account, or most brokers  will let you automatically reinvest them back into partial shares (ideal for compounding). permalink parent award report block reply view 1 more comments... SpeekFreely 1 points 10 hours ago If you’re sitting on 80K in cash you don’t care about 220 a month. That 80K is part of a bigger portfolio looking for a deal. permalink parent award report block reply SHILL_DETECTOR 1 points 10 hours ago do what???  why dont i care about 220 a month? permalink parent award report block reply SpeekFreely 1 points 10 hours ago You can care about it, but you’re not building a wealth plan w/it. permalink parent award report block reply view 3 more comments...\nGoDawgs 1 points 10 hours ago A high dividend bond ETF ($IEF, for example) is usually a good place to park cash.  Price doesn’t fluctuate much, but it will double the returns over a savings account. permalink parent award report block reply SHILL_DETECTOR 1 points 9 hours ago thank you for the info, how does this work exactly?  dividends go back into the brokerage account?? permalink parent award report block reply SHILL_DETECTOR 1 points 9 hours ago wow does that say it made 8.54% this year??? https://finance.yahoo.com/quote/IEF/ permalink parent award report block reply GoDawgs 1 points 3 minutes ago Yes on both, the dividends get deposited monthly into the brokerage account, or most brokers  will let you automatically reinvest them back into partial shares (ideal for compounding). permalink parent award report block reply view 1 more comments...\nSHILL_DETECTOR 1 points 9 hours ago thank you for the info, how does this work exactly?  dividends go back into the brokerage account?? permalink parent award report block reply\nSHILL_DETECTOR 1 points 9 hours ago wow does that say it made 8.54% this year??? https://finance.yahoo.com/quote/IEF/ permalink parent award report block reply GoDawgs 1 points 3 minutes ago Yes on both, the dividends get deposited monthly into the brokerage account, or most brokers  will let you automatically reinvest them back into partial shares (ideal for compounding). permalink parent award report block reply view 1 more comments...\nGoDawgs 1 points 3 minutes ago Yes on both, the dividends get deposited monthly into the brokerage account, or most brokers  will let you automatically reinvest them back into partial shares (ideal for compounding). permalink parent award report block reply view 1 more comments...\nSpeekFreely 1 points 10 hours ago If you’re sitting on 80K in cash you don’t care about 220 a month. That 80K is part of a bigger portfolio looking for a deal. permalink parent award report block reply SHILL_DETECTOR 1 points 10 hours ago do what???  why dont i care about 220 a month? permalink parent award report block reply SpeekFreely 1 points 10 hours ago You can care about it, but you’re not building a wealth plan w/it. permalink parent award report block reply view 3 more comments...\nSHILL_DETECTOR 1 points 10 hours ago do what???  why dont i care about 220 a month? permalink parent award report block reply SpeekFreely 1 points 10 hours ago You can care about it, but you’re not building a wealth plan w/it. permalink parent award report block reply view 3 more comments...\nSpeekFreely 1 points 10 hours ago You can care about it, but you’re not building a wealth plan w/it. permalink parent award report block reply view 3 more comments...\nRerun1Central 1 points 11 hours ago Buy gold and wait permalink parent award report block reply SpeekFreely 1 points 10 hours ago Buy the miners, not the gold permalink parent award report block reply\nSpeekFreely 1 points 10 hours ago Buy the miners, not the gold permalink parent award report block reply"}