{"id": "1ARK55bRBJ", "contents": "611 It is a total disgrace that the G20 will be held in South Africa.Afrikaners (descended from Dutch settlers/French & German immigrants) are being killed and slaughtered, & their land and farms are being illegally confiscated.No U.S. Official will attend as long as these Human Rights abuses continue. TRUMP  TRUTH posted 5 days ago by Mr_Rightside 19 comments award share download report block\n19 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget henri_derelicte 17 points 5 days ago The solution to South Africa’s problems is a return to White minority Afrikaner rule. If the blacks don’t like it, they can leave permalink award report block reply HeavenlyTrumpets 5 points 5 days ago no, they can't. if they can't behave they should be in prison. permalink parent award report block reply stars 1 points 4 days ago The best case scenario at this point is for the White population of South Africa (any the rest of Africa as a whole, am of course talking about the non race traitors) to return home to Europe or at least too one of the anglosphere nations. They have effectively zero demographic value in that continent while in Europe they could buy our people more time in the fight against ethnic replacement. They are at most 8% of the population in a nation over 85% African. Any conflict they have, they will lose. permalink parent award report block reply henri_derelicte 0 points 4 days ago Why have them return to Europe when ethnically cleansing the black population is an option? White people shouldn’t be forced to retreat from lands they rightfully conquered permalink parent award report block reply stars 1 points 4 days ago Let's genocide over 50 million people! I bet you call yourself a Christian. We did conquer South Africa (though we failed to establish a White majority) but we lost it and they would be better at home fighting for Europe, do you think the allies should have left their men on Dunkirk to be slaughtered against all the odds? permalink parent award report block reply Grindelwald 9 points 5 days ago He had a more important meeting recently.  It was the G2 with chairman Xi. permalink award report block reply Mr_Rightside OP 7 points 5 days ago https://truthsocial.com/@realDonaldTrump/posts/115510666739916664 permalink award report block reply Awakened 6 points 5 days ago The only refugees with a legitimate claim. permalink award report block reply LibsRcrazy 5 points 5 days ago Where are all the white Africans we are supposed to be allowing in???? permalink award report block reply ParadigmShift2070 4 points 5 days ago Lol why is South Africa still on the g20, surely there are other countries with bigger economy that can replace it now south Africa is turning into Zimbabwe permalink award report block reply TheTelltaleFly 3 points 5 days ago Fuck every G20 meeting until we get our own country back. Elections still being stolen, democrats still running the Congress, no jobs for Americans, still no accountability for all the lawfare, Kash Patel is in Beijing doing fuck-all to to dismantle the federal brownshirts, our people are being assassinated,  and nowhere near enough deportations. permalink award report block reply America_No_1 2 points 5 days ago Fuck the foreign community, Trump.  Domestic is all that matters. permalink award report block reply MadRussian 2 points 5 days ago Blonde Boer girls should be moved to the front of the line and imported without any limits or tariffs. Just saying. permalink award report block reply MudDog 1 points 5 days ago G19 is being held in SA?! permalink award report block reply Txiribiton 1 points 4 days ago Says the friend of the head choppers of Syria, who killed thousands of christians, and of zionist genocides. permalink award report block reply Goodgoodygoodgood -3 points 5 days ago Why would we want these South African farmers here, even if they’re white? They sat back and encouraged the noggers to take over their country, happily handed them the keys to a nation that was prosperous and a player on the world stage and elected a literal terrorist as their prime minister in Nelson Mandela. They’re passive, weak, cucks. They should be forced to live in the shithole they created. We’re fighting our own battle for spirit of the Nation, and are under invasion by an enemy that wants to occupy us. These South Africans have proven to conspire with the enemies because of ‘mUH eQUalItY’, they offer nothing beneficial and have no skills to build upon. They’re going to get here and leech off our tax dollars like every fucking piece of shit alien who thinks America is their meal ticket. I bet we wouldn’t even be considering it if Peter Thiel and Musk weren’t pulling some strings behind the scenes permalink award report block reply stars 1 points 4 days ago You say that while White Americans have allowed ourselves to demographically decline from 85% of the population to now <55% of the population with non Whites already the majority of under 18s and social liberalism as effectively the dominant socio-cultural ideology . White nationalists have been screaming this for decades while the average White American sat back watching sportsball and still conforming to the establishment political culture until Trump came a long which has woken some up but still not enough - https://www.youtube.com/watch?v=00Y4GhoZRbg&t=1s White South Africans on the other hand were at most 25% of the population, a percentage that began rapidly declining after WW2 as African birth rates increased. African nationalists had extensive funding from communists while South Africa was sanctioned by most of the world, they still held out until the 90s. They didn't elect Nelson Mandela either, the African population did.\nIgnorant dumbasses shouldn't throw stones in glass houses. permalink parent award report block reply TheGoyimWhisperer 1 points 5 days ago Comment removed upon the user being banned. permalink award report block reply\nhenri_derelicte 17 points 5 days ago The solution to South Africa’s problems is a return to White minority Afrikaner rule. If the blacks don’t like it, they can leave permalink award report block reply HeavenlyTrumpets 5 points 5 days ago no, they can't. if they can't behave they should be in prison. permalink parent award report block reply stars 1 points 4 days ago The best case scenario at this point is for the White population of South Africa (any the rest of Africa as a whole, am of course talking about the non race traitors) to return home to Europe or at least too one of the anglosphere nations. They have effectively zero demographic value in that continent while in Europe they could buy our people more time in the fight against ethnic replacement. They are at most 8% of the population in a nation over 85% African. Any conflict they have, they will lose. permalink parent award report block reply henri_derelicte 0 points 4 days ago Why have them return to Europe when ethnically cleansing the black population is an option? White people shouldn’t be forced to retreat from lands they rightfully conquered permalink parent award report block reply stars 1 points 4 days ago Let's genocide over 50 million people! I bet you call yourself a Christian. We did conquer South Africa (though we failed to establish a White majority) but we lost it and they would be better at home fighting for Europe, do you think the allies should have left their men on Dunkirk to be slaughtered against all the odds? permalink parent award report block reply\nHeavenlyTrumpets 5 points 5 days ago no, they can't. if they can't behave they should be in prison. permalink parent award report block reply\nstars 1 points 4 days ago The best case scenario at this point is for the White population of South Africa (any the rest of Africa as a whole, am of course talking about the non race traitors) to return home to Europe or at least too one of the anglosphere nations. They have effectively zero demographic value in that continent while in Europe they could buy our people more time in the fight against ethnic replacement. They are at most 8% of the population in a nation over 85% African. Any conflict they have, they will lose. permalink parent award report block reply henri_derelicte 0 points 4 days ago Why have them return to Europe when ethnically cleansing the black population is an option? White people shouldn’t be forced to retreat from lands they rightfully conquered permalink parent award report block reply stars 1 points 4 days ago Let's genocide over 50 million people! I bet you call yourself a Christian. We did conquer South Africa (though we failed to establish a White majority) but we lost it and they would be better at home fighting for Europe, do you think the allies should have left their men on Dunkirk to be slaughtered against all the odds? permalink parent award report block reply\nhenri_derelicte 0 points 4 days ago Why have them return to Europe when ethnically cleansing the black population is an option? White people shouldn’t be forced to retreat from lands they rightfully conquered permalink parent award report block reply stars 1 points 4 days ago Let's genocide over 50 million people! I bet you call yourself a Christian. We did conquer South Africa (though we failed to establish a White majority) but we lost it and they would be better at home fighting for Europe, do you think the allies should have left their men on Dunkirk to be slaughtered against all the odds? permalink parent award report block reply\nstars 1 points 4 days ago Let's genocide over 50 million people! I bet you call yourself a Christian. We did conquer South Africa (though we failed to establish a White majority) but we lost it and they would be better at home fighting for Europe, do you think the allies should have left their men on Dunkirk to be slaughtered against all the odds? permalink parent award report block reply\nGrindelwald 9 points 5 days ago He had a more important meeting recently.  It was the G2 with chairman Xi. permalink award report block reply\nMr_Rightside OP 7 points 5 days ago https://truthsocial.com/@realDonaldTrump/posts/115510666739916664 permalink award report block reply\nAwakened 6 points 5 days ago The only refugees with a legitimate claim. permalink award report block reply\nLibsRcrazy 5 points 5 days ago Where are all the white Africans we are supposed to be allowing in???? permalink award report block reply\nParadigmShift2070 4 points 5 days ago Lol why is South Africa still on the g20, surely there are other countries with bigger economy that can replace it now south Africa is turning into Zimbabwe permalink award report block reply\nTheTelltaleFly 3 points 5 days ago Fuck every G20 meeting until we get our own country back. Elections still being stolen, democrats still running the Congress, no jobs for Americans, still no accountability for all the lawfare, Kash Patel is in Beijing doing fuck-all to to dismantle the federal brownshirts, our people are being assassinated,  and nowhere near enough deportations. permalink award report block reply\nAmerica_No_1 2 points 5 days ago Fuck the foreign community, Trump.  Domestic is all that matters. permalink award report block reply\nMadRussian 2 points 5 days ago Blonde Boer girls should be moved to the front of the line and imported without any limits or tariffs. Just saying. permalink award report block reply\nMudDog 1 points 5 days ago G19 is being held in SA?! permalink award report block reply\nTxiribiton 1 points 4 days ago Says the friend of the head choppers of Syria, who killed thousands of christians, and of zionist genocides. permalink award report block reply\nGoodgoodygoodgood -3 points 5 days ago Why would we want these South African farmers here, even if they’re white? They sat back and encouraged the noggers to take over their country, happily handed them the keys to a nation that was prosperous and a player on the world stage and elected a literal terrorist as their prime minister in Nelson Mandela. They’re passive, weak, cucks. They should be forced to live in the shithole they created. We’re fighting our own battle for spirit of the Nation, and are under invasion by an enemy that wants to occupy us. These South Africans have proven to conspire with the enemies because of ‘mUH eQUalItY’, they offer nothing beneficial and have no skills to build upon. They’re going to get here and leech off our tax dollars like every fucking piece of shit alien who thinks America is their meal ticket. I bet we wouldn’t even be considering it if Peter Thiel and Musk weren’t pulling some strings behind the scenes permalink award report block reply stars 1 points 4 days ago You say that while White Americans have allowed ourselves to demographically decline from 85% of the population to now <55% of the population with non Whites already the majority of under 18s and social liberalism as effectively the dominant socio-cultural ideology . White nationalists have been screaming this for decades while the average White American sat back watching sportsball and still conforming to the establishment political culture until Trump came a long which has woken some up but still not enough - https://www.youtube.com/watch?v=00Y4GhoZRbg&t=1s White South Africans on the other hand were at most 25% of the population, a percentage that began rapidly declining after WW2 as African birth rates increased. African nationalists had extensive funding from communists while South Africa was sanctioned by most of the world, they still held out until the 90s. They didn't elect Nelson Mandela either, the African population did.\nIgnorant dumbasses shouldn't throw stones in glass houses. permalink parent award report block reply\nstars 1 points 4 days ago You say that while White Americans have allowed ourselves to demographically decline from 85% of the population to now <55% of the population with non Whites already the majority of under 18s and social liberalism as effectively the dominant socio-cultural ideology . White nationalists have been screaming this for decades while the average White American sat back watching sportsball and still conforming to the establishment political culture until Trump came a long which has woken some up but still not enough - https://www.youtube.com/watch?v=00Y4GhoZRbg&t=1s White South Africans on the other hand were at most 25% of the population, a percentage that began rapidly declining after WW2 as African birth rates increased. African nationalists had extensive funding from communists while South Africa was sanctioned by most of the world, they still held out until the 90s. They didn't elect Nelson Mandela either, the African population did.\nIgnorant dumbasses shouldn't throw stones in glass houses. permalink parent award report block reply\nTheGoyimWhisperer 1 points 5 days ago Comment removed upon the user being banned. permalink award report block reply"}