{"id": "1ARK5BGaln", "contents": "1439 Liberals boo as Trump swears in U.S. Military members at the Commanders game. Absolutely disgusting. Democrats have no respect for our brave troops who put their lives on the line to protect our country. Democrats hate America. posted 3 days ago by Mr_Rightside 124 comments award share report block Libs of TikTok @libsoftiktok • 3d JUST IN: Liberals boo as Trump swears in U.S. Military members at the Commanders game. Absolutely disgusting. Democrats have no respect for our brave troops who put their lives on the line to protect our country. Democrats hate America.\n124 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno perma-maga 92 points 3 days ago Greater DC metro permalink award report block reply MemeWarsVet 68 points 3 days ago This. Plus, NFL fags. permalink parent award report block reply NukeTheTroons 25 points 3 days ago NFL fags care more about men playing a literal game than the decline of their country. permalink parent award report block reply suckmycorona 11 points 3 days ago Everything about nfl is gay.  Look at the tights.  Quarterback grabs balls in order to get a ball.  Wide receiver, tight end. And what’s with the consent spitting.  None of them in the nfl swallow? permalink parent award report block reply mlp67 6 points 3 days ago Why are they always spanking each other's asses? I always thought that was weird permalink parent award report block reply view 1 more comments... NukeTheTroons 3 points 3 days ago I couldn’t have said it better myself. The sportsball card collectors are the gayest. Why would you want to collect pictures of grown men? My friend tried making fun of my Pokemon collection from the 90s I saved, until I hit him with that question. permalink parent award report block reply BeauHD 4 points 3 days ago They like it IDB and that is the only thing that matters to them! permalink parent award report block reply FerkenBlerkin 11 points 3 days ago Fags who still go to Redskins games after the SJW mob forced them to change their name.   The faggiest fags in America.   Trump should've known better than to do this. permalink parent award report block reply Moose_Antlers 3 points 3 days ago They're the same fags who lecture me about tolerance and inclusion of minorities and then trample all over a minority symbol supported by actual minority people and replace it with a soulless white liberal-approved name that means nothing. If these people were legit, they'd be demanding the Redskins be reinstated in full, complete with the proud Indian head on the helmets. But these minorities aren't useful, so they don't get pandered to. They get trampled. permalink parent award report block reply HeavyMetalPatriot 19 points 3 days ago AKA, Trannyfagcommiefuckistan. permalink parent award report block reply MasterChief08 11 points 3 days ago Why shouldn't we just mistreat people who live in DC? They want us dead. permalink parent award report block reply LookFatty 1 points 3 days ago Yeah. And they live in VA and suck permalink parent award report block reply McFatty7 10 points 3 days ago Laid-off Federal workers who are mad that they can't collect a UBI-like salary for doing almost no work anymore. permalink parent award report block reply Christineblaseyford 1 points 2 days ago The worst that humanity has to offer.  Seriously... Disgusting, gay, dumb, trannies the whole lot of them.  A bunch of men exploring their emotions. permalink parent award report block reply MagaJay02 54 points 3 days ago Who cares. Leftists hate us and Trump, big surprise. I'd boo a leftist given the chance. permalink award report block reply YaharaRiver 14 points 3 days ago We could be friends.  I am immune also 👍 permalink parent award report block reply MagaJay02 8 points 3 days ago I love it haha. Got to guard your soul! No need to get outraged about irrelevent things, ya know? permalink parent award report block reply EgregiousPhilbin 9 points 3 days ago The people who want me and my entire family dead and penniless - they were also rude! permalink parent award report block reply infinitysupreme 6 points 3 days ago Don't forget that they want to wipe your race off the face of the earth. Probably your religion too. permalink parent award report block reply EgregiousPhilbin 7 points 3 days ago Yes, and the only problem with that is if you complain about it, so just quietly go extinct. Thanks. permalink parent award report block reply LookFatty 2 points 3 days ago And us Super Straight Pure Bloods too permalink parent award report block reply infinitysupreme 2 points 3 days ago They're out to murder anyone who's to the right of AOC, or who doesn't put things in their butt permalink parent award report block reply PyroSphere 32 points 3 days ago Liberals should all be catapulted into an active volcano. permalink award report block reply South_Florida_Guy 14 points 3 days ago That's terrible! It should be a trebuchet instead. permalink parent award report block reply MastaJoda 8 points 3 days ago Im a trebuchet man myself. permalink parent award report block reply Pissonit 3 points 3 days ago Tom Hanks was but the Volcano spit his ass right back out! permalink parent award report block reply Above_Reproach 1 points 3 days ago Don't stop there...All nfl watchers. permalink parent award report block reply Hanging_Chad 20 points 3 days ago happy veterans weekend permalink award report block reply JohnN 5 points 3 days ago Thanks.  Though I often wonder, \"When's taxpayer weekend?\" permalink parent award report block reply Hanging_Chad 3 points 3 days ago tax-free weekends are awesome permalink parent award report block reply TheMostUselessFeeder 3 points 3 days ago Enjoy the long weekend! permalink parent award report block reply Mr_Rightside OP 18 points 3 days ago ABC/CNN/NBC tomorrow: Liberals weren't booing. They were saying boo-urns! Boo-urns! permalink award report block reply Patrick_Bateman 18 points 3 days ago Naw they'll pretend like this is an average NFL fanbase instead of a stadium 95% full of government employees and contractors. permalink parent award report block reply infinitysupreme 4 points 3 days ago Also the gay lovers of govt employees and contractors permalink parent award report block reply BeauHD 3 points 3 days ago I was saying Boo Earns. permalink parent award report block reply MAGA_Toaster 2 points 3 days ago 🥔 permalink parent award report block reply roy_the_boy 3 points 3 days ago Nah are you kidding, people booing Trump? This'll be their top story, as if there's nothing better to talk about permalink parent award report block reply LookFatty 1 points 3 days ago I was saying boo-urns... permalink parent award report block reply Chickensaurus 1 points 3 days ago They're booing Trump. We'd boo Biden. permalink parent award report block reply PillarOfWisdom 16 points 3 days ago Those who call them \"liberals\" don't fully understand what Bolsheviks did and what their goals are.  \"Liberal\" lets them off easy and makes them sound like simple democrats of the 60s.  Those people are gone - they are dead. Bolsheviks are marxists who have declared war on us and the White society that is our God-given birthright and was defended by our ancestors.  Dems are all-in for the illegal invasion and repubes are equally all-in for the H1B invasion.  Both are corrosive to our society and they know it. Worse, Trump also knows and we are seeing and feeling the results.  Younger people are completely giving up on the American Dream and there is nothing we can say or do to bring them back at this point.  Dystopian doesn't get close to covering it. Good people are giving up and it's hard to blame them. permalink award report block reply Awakened 4 points 3 days ago I wish this was the top comment. permalink parent award report block reply SicSemperTyrannis2 0 points 3 days ago This is why I call them demonrats. Al Marxists. Never let the left control the language! permalink parent award report block reply PillarOfWisdom 3 points 3 days ago EXACTLY!!!!  Call them marxists, bolsheviks, or communists.  Those are historical terms that comes with a ton of context that is equal to their behavior. Words matter, we must never allow them to set the narrative. permalink parent award report block reply iteachfuckinscience 15 points 3 days ago That’s because they’re faggots permalink award report block reply goldkeyboardwarrior 14 points 3 days ago Washington, DC voted 90% for Harris and 6% for Trump. Prince George’s County where the Commanders play voted 86% for Harris and 11% for Trump. They would have still booed if he announced he cured both cancer and AIDS because he was the one that announced it. permalink award report block reply Brock_Shithouse 5 points 3 days ago Ironic, since they're all at high risk for AIDS. permalink parent award report block reply grenades_and_ham 12 points 3 days ago The NFL is gay. permalink award report block reply Fundadores 7 points 3 days ago And trans! permalink parent award report block reply Nibba2 3 points 3 days ago It’s true! https://www.nbcnews.com/news/rcna1300 permalink parent award report block reply SicSemperTyrannis2 -3 points 3 days ago It's not true though. Not a single player has come out as gay since that faggot statement was created by some league retard. permalink parent award report block reply Nibba2 1 points 3 days ago If you looked at that link. there is a video of a gay football player in it, which is what prompted it to begin with. permalink parent award report block reply BeauHD 2 points 3 days ago The Superbowl is Gay https://www.youtube.com/watch?v=DKSmFvgSRUc permalink parent award report block reply maleitch 8 points 3 days ago People who cheer us when one of us gets murdered boo our leader.  Shocker. So many on our side are still in delusion.  Pathetic permalink award report block reply MocksFordComma 6 points 3 days ago They don't hate just him ... they hate all of us, our military and it's servicemen, and they hate the idea of America. Hatred is at the core of their being. I don't know how you cure this. Also: Your boos mean nothing to me. I've seen what makes you cheer. permalink award report block reply BOHICA2021 4 points 3 days ago There are only a few solutions to this; they are openly at war with US and it will only continue to escalate if unaddressed...rope and/or lead works best with these vermin. permalink parent award report block reply orcwordlaugh 5 points 3 days ago Aww, it cuts right before \"enemies foreign and domestic\". I was waiting for some emphasis on \"domestic\". permalink award report block reply KneadThePeople 4 points 3 days ago The Trump hate in DC is ridiculous. permalink award report block reply RichieSprouse 4 points 3 days ago We need to use every opportunity we can to let these honorable young soldiers we are behind them even when the liberal pig Karens boo permalink award report block reply Albo22 4 points 3 days ago It's DC what do you expect permalink award report block reply theDialecticalPlaya 4 points 3 days ago Who cares. Fuck the left. I'd do the same it was a shitlib \"President\" swearing in Antifa troons into the military. permalink award report block reply spinometer2 4 points 3 days ago I hope Trump roasts them and their hateful political representatives on Truth permalink award report block reply roy_the_boy 3 points 3 days ago Shoulda roasted them right there, instead of waiting to make a social media post they'll never read permalink parent award report block reply Im_RickSteves_bitch 3 points 3 days ago Federal \"workers.\" permalink award report block reply Above_Reproach 3 points 3 days ago Circus-ception. permalink award report block reply elmopancakes 3 points 3 days ago Yup, they hate America and don't care who knows it. Keep up. permalink award report block reply stillbringingitback 3 points 3 days ago DC is a fucking shithole permalink award report block reply GA_Logic 3 points 3 days ago Maryland is full on cuckville. permalink award report block reply infinitysupreme 3 points 3 days ago If DC isn't violently booing your favorite politician, you're doing politics wrong permalink award report block reply FredRedd 2 points 3 days ago Agree. \"... Your boos mean nothing, I’ve seen what makes you cheer.\" permalink parent award report block reply PeaceMakerDJT 3 points 3 days ago They hate America permalink award report block reply f_bastiat 3 points 3 days ago LiVeS oN tHe LiNe.... There's nothing brave about applying for a job, getting the job, getting paid to do the job, and leaving when your agreed upon term is over. Forgetting the fact that you're getting paid with money they was coercively taxed. You are not brave or a hero for getting a job at the DoD, you are a government employee. permalink award report block reply Hanging_Chad 1 points 3 days ago someone change his mind permalink parent award report block reply f_bastiat 4 points 3 days ago (pro tip: you can't) permalink parent award report block reply noPTSDforMePlease 1 points 2 days ago Yesh I suppose that's true if you pretend that wars will never happen again. permalink parent award report block reply f_bastiat 1 points 2 days ago Like anything after WW2? Not even sure I'm happy we entered WW2 at this point. permalink parent award report block reply TheAttackTitan 2 points 3 days ago It’s DC and the NFL did you expect anything else? permalink award report block reply BigDRustyShackleford 2 points 3 days ago You don't want people in and around DC to like you.  They're the problem. permalink award report block reply Trumpluv77 2 points 3 days ago My 4 1/2 year old last night, trying to get her to leave the park....loud as hell for the whole park to hear, \"You two are faggots!!\" From the top of the slide looking down. Never taught her that, but couldn't help our hidden laughs. Good girl. permalink award report block reply seattlerunner 2 points 3 days ago We call them shitlibs for a reason.. permalink award report block reply fat50 2 points 3 days ago They lost by three touchdowns, so... Fuck em. permalink award report block reply asdrubael_was_right 2 points 3 days ago Whatever staffer let him be put in that position should be fired. permalink award report block reply SALTY-OGRE 2 points 3 days ago They are NOT Liberals they are brainwashed COMMIECUMHOLES! permalink award report block reply RogueLeaderX 1 points 3 days ago DC is anither Dem shithole. permalink award report block reply Sunnybats2 1 points 3 days ago I went ro a Redskins Eagles game and they have busses from parking.  Eagles fan's on the bus were crazy.  Dont recalls kins fans permalink award report block reply Knumberate 1 points 3 days ago If putin nuked Washington DC i would have to think about how upset I would be about it.  Especially if he said that's the only place.   How little I give a shit about the people who live and work there.  Oh no he got 90% of the senate, and the entire house.  Im so mad I just cant even permalink award report block reply Michalusmichalus 1 points 2 days ago Trump prefers the UFC anyway. permalink award report block reply fazaman 1 points 2 days ago Commanders? Never heard of 'em. What is that, a field hockey team? permalink award report block reply mcoulton 1 points 3 days ago I wish it went to the part about \"and Domestic\" and him accenting \"Domestic\" permalink award report block reply LiberaIPussyGuy 1 points 3 days ago That wasn't a great idea.  You couldn't hear a thing he was saying. permalink award report block reply GBA4ever 3 points 3 days ago Trump gave a great interview with the Fox announcers. And he called a few plays. It was fun to watch. permalink parent award report block reply Prandogolio 1 points 3 days ago Commanders lol permalink award report block reply journalist 1 points 3 days ago Cowboys fans permalink award report block reply mcoulton 1 points 3 days ago A prisoner learns to love the bars, they looked at being robbed or killed as part of being in the dc metro area permalink award report block reply suckmycorona 1 points 3 days ago This is what you get when you have shit head parents permalink award report block reply JetJocky 1 points 3 days ago Those pathetic Dem commie sons a bitches. permalink award report block reply UnknownUserName 1 points 3 days ago At which time has the military protected our country since WW2? permalink award report block reply FusionBlack 1 points 3 days ago NFL National Fag League. permalink award report block reply blueeyephoto 1 points 2 days ago Didn't they try to lambast Trump by falsely claiming he called the troops \"losers\"? permalink award report block reply Live_free_or_die_55 1 points 3 days ago They are communists not democrats ‼️ permalink award report block reply Crappydatum 1 points 3 days ago It was in DC so Demoncrats are 90% there Notice he got more love from the Lions team permalink award report block reply AyChiXuaxua 1 points 3 days ago Find out who booed.  Make them famous. permalink award report block reply MagaChamp253 1 points 3 days ago First time? permalink award report block reply lispboy 1 points 3 days ago That really was the wrong place to do that. permalink award report block reply champdog 1 points 2 days ago Its the fans nowadays, as much as everything else, thats caused me to lose interest in this once great game. permalink award report block reply bagel_fragility 2 points 2 days ago sportsball fandom is a red flag for lukewarm IQ. the americana element of professional sports took a turn for the worse in the 00’s, and was flushed clean down the shitter in 2020. listening to men talk about sports now gives me the same nails-on-chalkboard effect as a woman talking about politics. permalink parent award report block reply Fundadores 1 points 3 days ago While this story resonates, it also seems to be counterproductive. It reinforces the idea that candidates from party ‘D’ are bad and those from party ‘R’ are good. Bologna. America’s threat is much greater than either party. Those two damn parties work together to slow walk us deeper into this hellscape. permalink award report block reply DingleBalls 1 points 3 days ago Anyone booing should have been kicked out permalink award report block reply Prandogolio 0 points 3 days ago There shouldn't be any patriots at these cucked commie major league sports events. *Cucked sports addict butthurt.  Look, even more gay shit: https://patriots.win/p/1ARK5BH8w0/two-cleveland-guardians-pitchers/c permalink parent award report block reply LORDFALCONE 1 points 3 days ago If this was in Israel he'd get so many cheers permalink award report block reply blitzkrieg1 1 points 3 days ago Yea but they will neal for some lowlife drug addict so fk them/ permalink award report block reply al-phabitz89 -1 points 3 days ago This is a horrible look and saying otherwise is self delusion. This may be a wake up call for him, and infinite ammo for his detractors. permalink award report block reply Moose_Antlers -1 points 3 days ago I will say this. This is not the time or the place for such a ceremony. It's not what football is about or what it's for. It's not what the military is about or what it's for. Football is bread and circuses for low IQ people who are entertained by fat men pushing each other and tossing a ball around. I totally get the athletic component of it, but it's bread and circuses. Meanwhile, military service is about patriotism and young people committing to a life of discipline, honor, sacrifice, and service. That kind of commitment needs to be respected and not conflated with sportsballs. Liberals, however, wouldn't understand either of these nuances. They just don't care. Trump's there, so they pour out their hate like 3 year olds with no self-control. Pathetic behavior, and a total disgrace to both this country, and to the grown men they're paying to play a child's game for their entertainment. Classless people. permalink award report block reply ThatsDoable -5 points 3 days ago Unfortunately the negatives of this administration are starting to outweigh the positives so I doubt it's just liberals permalink award report block reply FlgPole -14 points 3 days ago I have no respect for our troops. We are literally born slaves in America. they have been derelict of duty for at least 85 years if not 150 years for letting Democrats win the civil war. change our form of government, install the fed, crash the economy just to make everyone slaves. Fuck those guys. permalink award report block reply YaharaRiver 5 points 3 days ago DEPORT. permalink parent award report block reply DrVSGGEOTUSPhD 2 points 3 days ago DEPORT....with extreme prejudice. permalink parent award report block reply FlgPole -5 points 3 days ago \"all property belongs to the state\" As long as America is a fascist communist country. I will continue to shit on the troops. permalink parent award report block reply YaharaRiver 2 points 3 days ago You don’t belong. permalink parent award report block reply Criss_P_Bacon 3 points 3 days ago On the fag scale, you’re an 11 out of 10. permalink parent award report block reply FlgPole -1 points 3 days ago nothing I said is made up or a lie. permalink parent award report block reply Criss_P_Bacon 3 points 3 days ago Did you say the democrats won the civil war?? permalink parent award report block reply FlgPole -1 points 3 days ago you can't name any time in history where the losers of war get to change the form of government. That is reserved for the winners. democrats killed Abe, replaced the Republic with a private corporation. Named it UNITED STATES to confuse everyone. title 28 1746 title 28 3002 part 15 UNITED STATES defined has nothing to do with 50 states in a union. There are 2 governments and 1 is abandoned.  1 is currently shut down this is why I have zero respect for the military. We are legally slaves from birth permalink parent award report block reply Above_Reproach -1 points 3 days ago ThAnk mE for mUh sErviCe, cHud. permalink parent award report block reply\nperma-maga 92 points 3 days ago Greater DC metro permalink award report block reply MemeWarsVet 68 points 3 days ago This. Plus, NFL fags. permalink parent award report block reply NukeTheTroons 25 points 3 days ago NFL fags care more about men playing a literal game than the decline of their country. permalink parent award report block reply suckmycorona 11 points 3 days ago Everything about nfl is gay.  Look at the tights.  Quarterback grabs balls in order to get a ball.  Wide receiver, tight end. And what’s with the consent spitting.  None of them in the nfl swallow? permalink parent award report block reply mlp67 6 points 3 days ago Why are they always spanking each other's asses? I always thought that was weird permalink parent award report block reply view 1 more comments... NukeTheTroons 3 points 3 days ago I couldn’t have said it better myself. The sportsball card collectors are the gayest. Why would you want to collect pictures of grown men? My friend tried making fun of my Pokemon collection from the 90s I saved, until I hit him with that question. permalink parent award report block reply BeauHD 4 points 3 days ago They like it IDB and that is the only thing that matters to them! permalink parent award report block reply FerkenBlerkin 11 points 3 days ago Fags who still go to Redskins games after the SJW mob forced them to change their name.   The faggiest fags in America.   Trump should've known better than to do this. permalink parent award report block reply Moose_Antlers 3 points 3 days ago They're the same fags who lecture me about tolerance and inclusion of minorities and then trample all over a minority symbol supported by actual minority people and replace it with a soulless white liberal-approved name that means nothing. If these people were legit, they'd be demanding the Redskins be reinstated in full, complete with the proud Indian head on the helmets. But these minorities aren't useful, so they don't get pandered to. They get trampled. permalink parent award report block reply HeavyMetalPatriot 19 points 3 days ago AKA, Trannyfagcommiefuckistan. permalink parent award report block reply MasterChief08 11 points 3 days ago Why shouldn't we just mistreat people who live in DC? They want us dead. permalink parent award report block reply LookFatty 1 points 3 days ago Yeah. And they live in VA and suck permalink parent award report block reply McFatty7 10 points 3 days ago Laid-off Federal workers who are mad that they can't collect a UBI-like salary for doing almost no work anymore. permalink parent award report block reply Christineblaseyford 1 points 2 days ago The worst that humanity has to offer.  Seriously... Disgusting, gay, dumb, trannies the whole lot of them.  A bunch of men exploring their emotions. permalink parent award report block reply\nMemeWarsVet 68 points 3 days ago This. Plus, NFL fags. permalink parent award report block reply NukeTheTroons 25 points 3 days ago NFL fags care more about men playing a literal game than the decline of their country. permalink parent award report block reply suckmycorona 11 points 3 days ago Everything about nfl is gay.  Look at the tights.  Quarterback grabs balls in order to get a ball.  Wide receiver, tight end. And what’s with the consent spitting.  None of them in the nfl swallow? permalink parent award report block reply mlp67 6 points 3 days ago Why are they always spanking each other's asses? I always thought that was weird permalink parent award report block reply view 1 more comments... NukeTheTroons 3 points 3 days ago I couldn’t have said it better myself. The sportsball card collectors are the gayest. Why would you want to collect pictures of grown men? My friend tried making fun of my Pokemon collection from the 90s I saved, until I hit him with that question. permalink parent award report block reply BeauHD 4 points 3 days ago They like it IDB and that is the only thing that matters to them! permalink parent award report block reply FerkenBlerkin 11 points 3 days ago Fags who still go to Redskins games after the SJW mob forced them to change their name.   The faggiest fags in America.   Trump should've known better than to do this. permalink parent award report block reply Moose_Antlers 3 points 3 days ago They're the same fags who lecture me about tolerance and inclusion of minorities and then trample all over a minority symbol supported by actual minority people and replace it with a soulless white liberal-approved name that means nothing. If these people were legit, they'd be demanding the Redskins be reinstated in full, complete with the proud Indian head on the helmets. But these minorities aren't useful, so they don't get pandered to. They get trampled. permalink parent award report block reply\nNukeTheTroons 25 points 3 days ago NFL fags care more about men playing a literal game than the decline of their country. permalink parent award report block reply suckmycorona 11 points 3 days ago Everything about nfl is gay.  Look at the tights.  Quarterback grabs balls in order to get a ball.  Wide receiver, tight end. And what’s with the consent spitting.  None of them in the nfl swallow? permalink parent award report block reply mlp67 6 points 3 days ago Why are they always spanking each other's asses? I always thought that was weird permalink parent award report block reply view 1 more comments... NukeTheTroons 3 points 3 days ago I couldn’t have said it better myself. The sportsball card collectors are the gayest. Why would you want to collect pictures of grown men? My friend tried making fun of my Pokemon collection from the 90s I saved, until I hit him with that question. permalink parent award report block reply BeauHD 4 points 3 days ago They like it IDB and that is the only thing that matters to them! permalink parent award report block reply\nsuckmycorona 11 points 3 days ago Everything about nfl is gay.  Look at the tights.  Quarterback grabs balls in order to get a ball.  Wide receiver, tight end. And what’s with the consent spitting.  None of them in the nfl swallow? permalink parent award report block reply mlp67 6 points 3 days ago Why are they always spanking each other's asses? I always thought that was weird permalink parent award report block reply view 1 more comments... NukeTheTroons 3 points 3 days ago I couldn’t have said it better myself. The sportsball card collectors are the gayest. Why would you want to collect pictures of grown men? My friend tried making fun of my Pokemon collection from the 90s I saved, until I hit him with that question. permalink parent award report block reply\nmlp67 6 points 3 days ago Why are they always spanking each other's asses? I always thought that was weird permalink parent award report block reply view 1 more comments...\nNukeTheTroons 3 points 3 days ago I couldn’t have said it better myself. The sportsball card collectors are the gayest. Why would you want to collect pictures of grown men? My friend tried making fun of my Pokemon collection from the 90s I saved, until I hit him with that question. permalink parent award report block reply\nBeauHD 4 points 3 days ago They like it IDB and that is the only thing that matters to them! permalink parent award report block reply\nFerkenBlerkin 11 points 3 days ago Fags who still go to Redskins games after the SJW mob forced them to change their name.   The faggiest fags in America.   Trump should've known better than to do this. permalink parent award report block reply Moose_Antlers 3 points 3 days ago They're the same fags who lecture me about tolerance and inclusion of minorities and then trample all over a minority symbol supported by actual minority people and replace it with a soulless white liberal-approved name that means nothing. If these people were legit, they'd be demanding the Redskins be reinstated in full, complete with the proud Indian head on the helmets. But these minorities aren't useful, so they don't get pandered to. They get trampled. permalink parent award report block reply\nMoose_Antlers 3 points 3 days ago They're the same fags who lecture me about tolerance and inclusion of minorities and then trample all over a minority symbol supported by actual minority people and replace it with a soulless white liberal-approved name that means nothing. If these people were legit, they'd be demanding the Redskins be reinstated in full, complete with the proud Indian head on the helmets. But these minorities aren't useful, so they don't get pandered to. They get trampled. permalink parent award report block reply\nHeavyMetalPatriot 19 points 3 days ago AKA, Trannyfagcommiefuckistan. permalink parent award report block reply\nMasterChief08 11 points 3 days ago Why shouldn't we just mistreat people who live in DC? They want us dead. permalink parent award report block reply LookFatty 1 points 3 days ago Yeah. And they live in VA and suck permalink parent award report block reply\nLookFatty 1 points 3 days ago Yeah. And they live in VA and suck permalink parent award report block reply\nMcFatty7 10 points 3 days ago Laid-off Federal workers who are mad that they can't collect a UBI-like salary for doing almost no work anymore. permalink parent award report block reply\nChristineblaseyford 1 points 2 days ago The worst that humanity has to offer.  Seriously... Disgusting, gay, dumb, trannies the whole lot of them.  A bunch of men exploring their emotions. permalink parent award report block reply\nMagaJay02 54 points 3 days ago Who cares. Leftists hate us and Trump, big surprise. I'd boo a leftist given the chance. permalink award report block reply YaharaRiver 14 points 3 days ago We could be friends.  I am immune also 👍 permalink parent award report block reply MagaJay02 8 points 3 days ago I love it haha. Got to guard your soul! No need to get outraged about irrelevent things, ya know? permalink parent award report block reply EgregiousPhilbin 9 points 3 days ago The people who want me and my entire family dead and penniless - they were also rude! permalink parent award report block reply infinitysupreme 6 points 3 days ago Don't forget that they want to wipe your race off the face of the earth. Probably your religion too. permalink parent award report block reply EgregiousPhilbin 7 points 3 days ago Yes, and the only problem with that is if you complain about it, so just quietly go extinct. Thanks. permalink parent award report block reply LookFatty 2 points 3 days ago And us Super Straight Pure Bloods too permalink parent award report block reply infinitysupreme 2 points 3 days ago They're out to murder anyone who's to the right of AOC, or who doesn't put things in their butt permalink parent award report block reply\nYaharaRiver 14 points 3 days ago We could be friends.  I am immune also 👍 permalink parent award report block reply MagaJay02 8 points 3 days ago I love it haha. Got to guard your soul! No need to get outraged about irrelevent things, ya know? permalink parent award report block reply\nMagaJay02 8 points 3 days ago I love it haha. Got to guard your soul! No need to get outraged about irrelevent things, ya know? permalink parent award report block reply\nEgregiousPhilbin 9 points 3 days ago The people who want me and my entire family dead and penniless - they were also rude! permalink parent award report block reply infinitysupreme 6 points 3 days ago Don't forget that they want to wipe your race off the face of the earth. Probably your religion too. permalink parent award report block reply EgregiousPhilbin 7 points 3 days ago Yes, and the only problem with that is if you complain about it, so just quietly go extinct. Thanks. permalink parent award report block reply LookFatty 2 points 3 days ago And us Super Straight Pure Bloods too permalink parent award report block reply infinitysupreme 2 points 3 days ago They're out to murder anyone who's to the right of AOC, or who doesn't put things in their butt permalink parent award report block reply\ninfinitysupreme 6 points 3 days ago Don't forget that they want to wipe your race off the face of the earth. Probably your religion too. permalink parent award report block reply EgregiousPhilbin 7 points 3 days ago Yes, and the only problem with that is if you complain about it, so just quietly go extinct. Thanks. permalink parent award report block reply LookFatty 2 points 3 days ago And us Super Straight Pure Bloods too permalink parent award report block reply infinitysupreme 2 points 3 days ago They're out to murder anyone who's to the right of AOC, or who doesn't put things in their butt permalink parent award report block reply\nEgregiousPhilbin 7 points 3 days ago Yes, and the only problem with that is if you complain about it, so just quietly go extinct. Thanks. permalink parent award report block reply\nLookFatty 2 points 3 days ago And us Super Straight Pure Bloods too permalink parent award report block reply infinitysupreme 2 points 3 days ago They're out to murder anyone who's to the right of AOC, or who doesn't put things in their butt permalink parent award report block reply\ninfinitysupreme 2 points 3 days ago They're out to murder anyone who's to the right of AOC, or who doesn't put things in their butt permalink parent award report block reply\nPyroSphere 32 points 3 days ago Liberals should all be catapulted into an active volcano. permalink award report block reply South_Florida_Guy 14 points 3 days ago That's terrible! It should be a trebuchet instead. permalink parent award report block reply MastaJoda 8 points 3 days ago Im a trebuchet man myself. permalink parent award report block reply Pissonit 3 points 3 days ago Tom Hanks was but the Volcano spit his ass right back out! permalink parent award report block reply Above_Reproach 1 points 3 days ago Don't stop there...All nfl watchers. permalink parent award report block reply\nSouth_Florida_Guy 14 points 3 days ago That's terrible! It should be a trebuchet instead. permalink parent award report block reply MastaJoda 8 points 3 days ago Im a trebuchet man myself. permalink parent award report block reply\nMastaJoda 8 points 3 days ago Im a trebuchet man myself. permalink parent award report block reply\nPissonit 3 points 3 days ago Tom Hanks was but the Volcano spit his ass right back out! permalink parent award report block reply\nAbove_Reproach 1 points 3 days ago Don't stop there...All nfl watchers. permalink parent award report block reply\nHanging_Chad 20 points 3 days ago happy veterans weekend permalink award report block reply JohnN 5 points 3 days ago Thanks.  Though I often wonder, \"When's taxpayer weekend?\" permalink parent award report block reply Hanging_Chad 3 points 3 days ago tax-free weekends are awesome permalink parent award report block reply TheMostUselessFeeder 3 points 3 days ago Enjoy the long weekend! permalink parent award report block reply\nJohnN 5 points 3 days ago Thanks.  Though I often wonder, \"When's taxpayer weekend?\" permalink parent award report block reply Hanging_Chad 3 points 3 days ago tax-free weekends are awesome permalink parent award report block reply\nHanging_Chad 3 points 3 days ago tax-free weekends are awesome permalink parent award report block reply\nTheMostUselessFeeder 3 points 3 days ago Enjoy the long weekend! permalink parent award report block reply\nMr_Rightside OP 18 points 3 days ago ABC/CNN/NBC tomorrow: Liberals weren't booing. They were saying boo-urns! Boo-urns! permalink award report block reply Patrick_Bateman 18 points 3 days ago Naw they'll pretend like this is an average NFL fanbase instead of a stadium 95% full of government employees and contractors. permalink parent award report block reply infinitysupreme 4 points 3 days ago Also the gay lovers of govt employees and contractors permalink parent award report block reply BeauHD 3 points 3 days ago I was saying Boo Earns. permalink parent award report block reply MAGA_Toaster 2 points 3 days ago 🥔 permalink parent award report block reply roy_the_boy 3 points 3 days ago Nah are you kidding, people booing Trump? This'll be their top story, as if there's nothing better to talk about permalink parent award report block reply LookFatty 1 points 3 days ago I was saying boo-urns... permalink parent award report block reply Chickensaurus 1 points 3 days ago They're booing Trump. We'd boo Biden. permalink parent award report block reply\nPatrick_Bateman 18 points 3 days ago Naw they'll pretend like this is an average NFL fanbase instead of a stadium 95% full of government employees and contractors. permalink parent award report block reply infinitysupreme 4 points 3 days ago Also the gay lovers of govt employees and contractors permalink parent award report block reply\ninfinitysupreme 4 points 3 days ago Also the gay lovers of govt employees and contractors permalink parent award report block reply\nBeauHD 3 points 3 days ago I was saying Boo Earns. permalink parent award report block reply MAGA_Toaster 2 points 3 days ago 🥔 permalink parent award report block reply\nMAGA_Toaster 2 points 3 days ago 🥔 permalink parent award report block reply\nroy_the_boy 3 points 3 days ago Nah are you kidding, people booing Trump? This'll be their top story, as if there's nothing better to talk about permalink parent award report block reply\nLookFatty 1 points 3 days ago I was saying boo-urns... permalink parent award report block reply\nChickensaurus 1 points 3 days ago They're booing Trump. We'd boo Biden. permalink parent award report block reply\nPillarOfWisdom 16 points 3 days ago Those who call them \"liberals\" don't fully understand what Bolsheviks did and what their goals are.  \"Liberal\" lets them off easy and makes them sound like simple democrats of the 60s.  Those people are gone - they are dead. Bolsheviks are marxists who have declared war on us and the White society that is our God-given birthright and was defended by our ancestors.  Dems are all-in for the illegal invasion and repubes are equally all-in for the H1B invasion.  Both are corrosive to our society and they know it. Worse, Trump also knows and we are seeing and feeling the results.  Younger people are completely giving up on the American Dream and there is nothing we can say or do to bring them back at this point.  Dystopian doesn't get close to covering it. Good people are giving up and it's hard to blame them. permalink award report block reply Awakened 4 points 3 days ago I wish this was the top comment. permalink parent award report block reply SicSemperTyrannis2 0 points 3 days ago This is why I call them demonrats. Al Marxists. Never let the left control the language! permalink parent award report block reply PillarOfWisdom 3 points 3 days ago EXACTLY!!!!  Call them marxists, bolsheviks, or communists.  Those are historical terms that comes with a ton of context that is equal to their behavior. Words matter, we must never allow them to set the narrative. permalink parent award report block reply\nAwakened 4 points 3 days ago I wish this was the top comment. permalink parent award report block reply\nSicSemperTyrannis2 0 points 3 days ago This is why I call them demonrats. Al Marxists. Never let the left control the language! permalink parent award report block reply PillarOfWisdom 3 points 3 days ago EXACTLY!!!!  Call them marxists, bolsheviks, or communists.  Those are historical terms that comes with a ton of context that is equal to their behavior. Words matter, we must never allow them to set the narrative. permalink parent award report block reply\nPillarOfWisdom 3 points 3 days ago EXACTLY!!!!  Call them marxists, bolsheviks, or communists.  Those are historical terms that comes with a ton of context that is equal to their behavior. Words matter, we must never allow them to set the narrative. permalink parent award report block reply\niteachfuckinscience 15 points 3 days ago That’s because they’re faggots permalink award report block reply\ngoldkeyboardwarrior 14 points 3 days ago Washington, DC voted 90% for Harris and 6% for Trump. Prince George’s County where the Commanders play voted 86% for Harris and 11% for Trump. They would have still booed if he announced he cured both cancer and AIDS because he was the one that announced it. permalink award report block reply Brock_Shithouse 5 points 3 days ago Ironic, since they're all at high risk for AIDS. permalink parent award report block reply\nBrock_Shithouse 5 points 3 days ago Ironic, since they're all at high risk for AIDS. permalink parent award report block reply\ngrenades_and_ham 12 points 3 days ago The NFL is gay. permalink award report block reply Fundadores 7 points 3 days ago And trans! permalink parent award report block reply Nibba2 3 points 3 days ago It’s true! https://www.nbcnews.com/news/rcna1300 permalink parent award report block reply SicSemperTyrannis2 -3 points 3 days ago It's not true though. Not a single player has come out as gay since that faggot statement was created by some league retard. permalink parent award report block reply Nibba2 1 points 3 days ago If you looked at that link. there is a video of a gay football player in it, which is what prompted it to begin with. permalink parent award report block reply BeauHD 2 points 3 days ago The Superbowl is Gay https://www.youtube.com/watch?v=DKSmFvgSRUc permalink parent award report block reply\nFundadores 7 points 3 days ago And trans! permalink parent award report block reply\nNibba2 3 points 3 days ago It’s true! https://www.nbcnews.com/news/rcna1300 permalink parent award report block reply SicSemperTyrannis2 -3 points 3 days ago It's not true though. Not a single player has come out as gay since that faggot statement was created by some league retard. permalink parent award report block reply Nibba2 1 points 3 days ago If you looked at that link. there is a video of a gay football player in it, which is what prompted it to begin with. permalink parent award report block reply\nSicSemperTyrannis2 -3 points 3 days ago It's not true though. Not a single player has come out as gay since that faggot statement was created by some league retard. permalink parent award report block reply Nibba2 1 points 3 days ago If you looked at that link. there is a video of a gay football player in it, which is what prompted it to begin with. permalink parent award report block reply\nNibba2 1 points 3 days ago If you looked at that link. there is a video of a gay football player in it, which is what prompted it to begin with. permalink parent award report block reply\nBeauHD 2 points 3 days ago The Superbowl is Gay https://www.youtube.com/watch?v=DKSmFvgSRUc permalink parent award report block reply\nmaleitch 8 points 3 days ago People who cheer us when one of us gets murdered boo our leader.  Shocker. So many on our side are still in delusion.  Pathetic permalink award report block reply\nMocksFordComma 6 points 3 days ago They don't hate just him ... they hate all of us, our military and it's servicemen, and they hate the idea of America. Hatred is at the core of their being. I don't know how you cure this. Also: Your boos mean nothing to me. I've seen what makes you cheer. permalink award report block reply BOHICA2021 4 points 3 days ago There are only a few solutions to this; they are openly at war with US and it will only continue to escalate if unaddressed...rope and/or lead works best with these vermin. permalink parent award report block reply\nBOHICA2021 4 points 3 days ago There are only a few solutions to this; they are openly at war with US and it will only continue to escalate if unaddressed...rope and/or lead works best with these vermin. permalink parent award report block reply\norcwordlaugh 5 points 3 days ago Aww, it cuts right before \"enemies foreign and domestic\". I was waiting for some emphasis on \"domestic\". permalink award report block reply\nKneadThePeople 4 points 3 days ago The Trump hate in DC is ridiculous. permalink award report block reply\nRichieSprouse 4 points 3 days ago We need to use every opportunity we can to let these honorable young soldiers we are behind them even when the liberal pig Karens boo permalink award report block reply\nAlbo22 4 points 3 days ago It's DC what do you expect permalink award report block reply\ntheDialecticalPlaya 4 points 3 days ago Who cares. Fuck the left. I'd do the same it was a shitlib \"President\" swearing in Antifa troons into the military. permalink award report block reply\nspinometer2 4 points 3 days ago I hope Trump roasts them and their hateful political representatives on Truth permalink award report block reply roy_the_boy 3 points 3 days ago Shoulda roasted them right there, instead of waiting to make a social media post they'll never read permalink parent award report block reply\nroy_the_boy 3 points 3 days ago Shoulda roasted them right there, instead of waiting to make a social media post they'll never read permalink parent award report block reply\nIm_RickSteves_bitch 3 points 3 days ago Federal \"workers.\" permalink award report block reply\nAbove_Reproach 3 points 3 days ago Circus-ception. permalink award report block reply\nelmopancakes 3 points 3 days ago Yup, they hate America and don't care who knows it. Keep up. permalink award report block reply\nstillbringingitback 3 points 3 days ago DC is a fucking shithole permalink award report block reply\nGA_Logic 3 points 3 days ago Maryland is full on cuckville. permalink award report block reply\ninfinitysupreme 3 points 3 days ago If DC isn't violently booing your favorite politician, you're doing politics wrong permalink award report block reply FredRedd 2 points 3 days ago Agree. \"... Your boos mean nothing, I’ve seen what makes you cheer.\" permalink parent award report block reply\nFredRedd 2 points 3 days ago Agree. \"... Your boos mean nothing, I’ve seen what makes you cheer.\" permalink parent award report block reply\nPeaceMakerDJT 3 points 3 days ago They hate America permalink award report block reply\nf_bastiat 3 points 3 days ago LiVeS oN tHe LiNe.... There's nothing brave about applying for a job, getting the job, getting paid to do the job, and leaving when your agreed upon term is over. Forgetting the fact that you're getting paid with money they was coercively taxed. You are not brave or a hero for getting a job at the DoD, you are a government employee. permalink award report block reply Hanging_Chad 1 points 3 days ago someone change his mind permalink parent award report block reply f_bastiat 4 points 3 days ago (pro tip: you can't) permalink parent award report block reply noPTSDforMePlease 1 points 2 days ago Yesh I suppose that's true if you pretend that wars will never happen again. permalink parent award report block reply f_bastiat 1 points 2 days ago Like anything after WW2? Not even sure I'm happy we entered WW2 at this point. permalink parent award report block reply\nHanging_Chad 1 points 3 days ago someone change his mind permalink parent award report block reply f_bastiat 4 points 3 days ago (pro tip: you can't) permalink parent award report block reply\nf_bastiat 4 points 3 days ago (pro tip: you can't) permalink parent award report block reply\nnoPTSDforMePlease 1 points 2 days ago Yesh I suppose that's true if you pretend that wars will never happen again. permalink parent award report block reply f_bastiat 1 points 2 days ago Like anything after WW2? Not even sure I'm happy we entered WW2 at this point. permalink parent award report block reply\nf_bastiat 1 points 2 days ago Like anything after WW2? Not even sure I'm happy we entered WW2 at this point. permalink parent award report block reply\nTheAttackTitan 2 points 3 days ago It’s DC and the NFL did you expect anything else? permalink award report block reply\nBigDRustyShackleford 2 points 3 days ago You don't want people in and around DC to like you.  They're the problem. permalink award report block reply\nTrumpluv77 2 points 3 days ago My 4 1/2 year old last night, trying to get her to leave the park....loud as hell for the whole park to hear, \"You two are faggots!!\" From the top of the slide looking down. Never taught her that, but couldn't help our hidden laughs. Good girl. permalink award report block reply\nseattlerunner 2 points 3 days ago We call them shitlibs for a reason.. permalink award report block reply\nfat50 2 points 3 days ago They lost by three touchdowns, so... Fuck em. permalink award report block reply\nasdrubael_was_right 2 points 3 days ago Whatever staffer let him be put in that position should be fired. permalink award report block reply\nSALTY-OGRE 2 points 3 days ago They are NOT Liberals they are brainwashed COMMIECUMHOLES! permalink award report block reply\nRogueLeaderX 1 points 3 days ago DC is anither Dem shithole. permalink award report block reply\nSunnybats2 1 points 3 days ago I went ro a Redskins Eagles game and they have busses from parking.  Eagles fan's on the bus were crazy.  Dont recalls kins fans permalink award report block reply\nKnumberate 1 points 3 days ago If putin nuked Washington DC i would have to think about how upset I would be about it.  Especially if he said that's the only place.   How little I give a shit about the people who live and work there.  Oh no he got 90% of the senate, and the entire house.  Im so mad I just cant even permalink award report block reply\nMichalusmichalus 1 points 2 days ago Trump prefers the UFC anyway. permalink award report block reply\nfazaman 1 points 2 days ago Commanders? Never heard of 'em. What is that, a field hockey team? permalink award report block reply\nmcoulton 1 points 3 days ago I wish it went to the part about \"and Domestic\" and him accenting \"Domestic\" permalink award report block reply\nLiberaIPussyGuy 1 points 3 days ago That wasn't a great idea.  You couldn't hear a thing he was saying. permalink award report block reply GBA4ever 3 points 3 days ago Trump gave a great interview with the Fox announcers. And he called a few plays. It was fun to watch. permalink parent award report block reply\nGBA4ever 3 points 3 days ago Trump gave a great interview with the Fox announcers. And he called a few plays. It was fun to watch. permalink parent award report block reply\nPrandogolio 1 points 3 days ago Commanders lol permalink award report block reply\njournalist 1 points 3 days ago Cowboys fans permalink award report block reply\nmcoulton 1 points 3 days ago A prisoner learns to love the bars, they looked at being robbed or killed as part of being in the dc metro area permalink award report block reply\nsuckmycorona 1 points 3 days ago This is what you get when you have shit head parents permalink award report block reply\nJetJocky 1 points 3 days ago Those pathetic Dem commie sons a bitches. permalink award report block reply\nUnknownUserName 1 points 3 days ago At which time has the military protected our country since WW2? permalink award report block reply\nFusionBlack 1 points 3 days ago NFL National Fag League. permalink award report block reply\nblueeyephoto 1 points 2 days ago Didn't they try to lambast Trump by falsely claiming he called the troops \"losers\"? permalink award report block reply\nLive_free_or_die_55 1 points 3 days ago They are communists not democrats ‼️ permalink award report block reply\nCrappydatum 1 points 3 days ago It was in DC so Demoncrats are 90% there Notice he got more love from the Lions team permalink award report block reply\nAyChiXuaxua 1 points 3 days ago Find out who booed.  Make them famous. permalink award report block reply\nMagaChamp253 1 points 3 days ago First time? permalink award report block reply\nlispboy 1 points 3 days ago That really was the wrong place to do that. permalink award report block reply\nchampdog 1 points 2 days ago Its the fans nowadays, as much as everything else, thats caused me to lose interest in this once great game. permalink award report block reply bagel_fragility 2 points 2 days ago sportsball fandom is a red flag for lukewarm IQ. the americana element of professional sports took a turn for the worse in the 00’s, and was flushed clean down the shitter in 2020. listening to men talk about sports now gives me the same nails-on-chalkboard effect as a woman talking about politics. permalink parent award report block reply\nbagel_fragility 2 points 2 days ago sportsball fandom is a red flag for lukewarm IQ. the americana element of professional sports took a turn for the worse in the 00’s, and was flushed clean down the shitter in 2020. listening to men talk about sports now gives me the same nails-on-chalkboard effect as a woman talking about politics. permalink parent award report block reply\nFundadores 1 points 3 days ago While this story resonates, it also seems to be counterproductive. It reinforces the idea that candidates from party ‘D’ are bad and those from party ‘R’ are good. Bologna. America’s threat is much greater than either party. Those two damn parties work together to slow walk us deeper into this hellscape. permalink award report block reply\nDingleBalls 1 points 3 days ago Anyone booing should have been kicked out permalink award report block reply Prandogolio 0 points 3 days ago There shouldn't be any patriots at these cucked commie major league sports events. *Cucked sports addict butthurt.  Look, even more gay shit: https://patriots.win/p/1ARK5BH8w0/two-cleveland-guardians-pitchers/c permalink parent award report block reply\nPrandogolio 0 points 3 days ago There shouldn't be any patriots at these cucked commie major league sports events. *Cucked sports addict butthurt.  Look, even more gay shit: https://patriots.win/p/1ARK5BH8w0/two-cleveland-guardians-pitchers/c permalink parent award report block reply\nLORDFALCONE 1 points 3 days ago If this was in Israel he'd get so many cheers permalink award report block reply\nblitzkrieg1 1 points 3 days ago Yea but they will neal for some lowlife drug addict so fk them/ permalink award report block reply\nal-phabitz89 -1 points 3 days ago This is a horrible look and saying otherwise is self delusion. This may be a wake up call for him, and infinite ammo for his detractors. permalink award report block reply\nMoose_Antlers -1 points 3 days ago I will say this. This is not the time or the place for such a ceremony. It's not what football is about or what it's for. It's not what the military is about or what it's for. Football is bread and circuses for low IQ people who are entertained by fat men pushing each other and tossing a ball around. I totally get the athletic component of it, but it's bread and circuses. Meanwhile, military service is about patriotism and young people committing to a life of discipline, honor, sacrifice, and service. That kind of commitment needs to be respected and not conflated with sportsballs. Liberals, however, wouldn't understand either of these nuances. They just don't care. Trump's there, so they pour out their hate like 3 year olds with no self-control. Pathetic behavior, and a total disgrace to both this country, and to the grown men they're paying to play a child's game for their entertainment. Classless people. permalink award report block reply\nThatsDoable -5 points 3 days ago Unfortunately the negatives of this administration are starting to outweigh the positives so I doubt it's just liberals permalink award report block reply\nFlgPole -14 points 3 days ago I have no respect for our troops. We are literally born slaves in America. they have been derelict of duty for at least 85 years if not 150 years for letting Democrats win the civil war. change our form of government, install the fed, crash the economy just to make everyone slaves. Fuck those guys. permalink award report block reply YaharaRiver 5 points 3 days ago DEPORT. permalink parent award report block reply DrVSGGEOTUSPhD 2 points 3 days ago DEPORT....with extreme prejudice. permalink parent award report block reply FlgPole -5 points 3 days ago \"all property belongs to the state\" As long as America is a fascist communist country. I will continue to shit on the troops. permalink parent award report block reply YaharaRiver 2 points 3 days ago You don’t belong. permalink parent award report block reply Criss_P_Bacon 3 points 3 days ago On the fag scale, you’re an 11 out of 10. permalink parent award report block reply FlgPole -1 points 3 days ago nothing I said is made up or a lie. permalink parent award report block reply Criss_P_Bacon 3 points 3 days ago Did you say the democrats won the civil war?? permalink parent award report block reply FlgPole -1 points 3 days ago you can't name any time in history where the losers of war get to change the form of government. That is reserved for the winners. democrats killed Abe, replaced the Republic with a private corporation. Named it UNITED STATES to confuse everyone. title 28 1746 title 28 3002 part 15 UNITED STATES defined has nothing to do with 50 states in a union. There are 2 governments and 1 is abandoned.  1 is currently shut down this is why I have zero respect for the military. We are legally slaves from birth permalink parent award report block reply Above_Reproach -1 points 3 days ago ThAnk mE for mUh sErviCe, cHud. permalink parent award report block reply\nYaharaRiver 5 points 3 days ago DEPORT. permalink parent award report block reply DrVSGGEOTUSPhD 2 points 3 days ago DEPORT....with extreme prejudice. permalink parent award report block reply FlgPole -5 points 3 days ago \"all property belongs to the state\" As long as America is a fascist communist country. I will continue to shit on the troops. permalink parent award report block reply YaharaRiver 2 points 3 days ago You don’t belong. permalink parent award report block reply\nDrVSGGEOTUSPhD 2 points 3 days ago DEPORT....with extreme prejudice. permalink parent award report block reply\nFlgPole -5 points 3 days ago \"all property belongs to the state\" As long as America is a fascist communist country. I will continue to shit on the troops. permalink parent award report block reply YaharaRiver 2 points 3 days ago You don’t belong. permalink parent award report block reply\nYaharaRiver 2 points 3 days ago You don’t belong. permalink parent award report block reply\nCriss_P_Bacon 3 points 3 days ago On the fag scale, you’re an 11 out of 10. permalink parent award report block reply FlgPole -1 points 3 days ago nothing I said is made up or a lie. permalink parent award report block reply Criss_P_Bacon 3 points 3 days ago Did you say the democrats won the civil war?? permalink parent award report block reply FlgPole -1 points 3 days ago you can't name any time in history where the losers of war get to change the form of government. That is reserved for the winners. democrats killed Abe, replaced the Republic with a private corporation. Named it UNITED STATES to confuse everyone. title 28 1746 title 28 3002 part 15 UNITED STATES defined has nothing to do with 50 states in a union. There are 2 governments and 1 is abandoned.  1 is currently shut down this is why I have zero respect for the military. We are legally slaves from birth permalink parent award report block reply\nFlgPole -1 points 3 days ago nothing I said is made up or a lie. permalink parent award report block reply Criss_P_Bacon 3 points 3 days ago Did you say the democrats won the civil war?? permalink parent award report block reply FlgPole -1 points 3 days ago you can't name any time in history where the losers of war get to change the form of government. That is reserved for the winners. democrats killed Abe, replaced the Republic with a private corporation. Named it UNITED STATES to confuse everyone. title 28 1746 title 28 3002 part 15 UNITED STATES defined has nothing to do with 50 states in a union. There are 2 governments and 1 is abandoned.  1 is currently shut down this is why I have zero respect for the military. We are legally slaves from birth permalink parent award report block reply\nCriss_P_Bacon 3 points 3 days ago Did you say the democrats won the civil war?? permalink parent award report block reply FlgPole -1 points 3 days ago you can't name any time in history where the losers of war get to change the form of government. That is reserved for the winners. democrats killed Abe, replaced the Republic with a private corporation. Named it UNITED STATES to confuse everyone. title 28 1746 title 28 3002 part 15 UNITED STATES defined has nothing to do with 50 states in a union. There are 2 governments and 1 is abandoned.  1 is currently shut down this is why I have zero respect for the military. We are legally slaves from birth permalink parent award report block reply\nFlgPole -1 points 3 days ago you can't name any time in history where the losers of war get to change the form of government. That is reserved for the winners. democrats killed Abe, replaced the Republic with a private corporation. Named it UNITED STATES to confuse everyone. title 28 1746 title 28 3002 part 15 UNITED STATES defined has nothing to do with 50 states in a union. There are 2 governments and 1 is abandoned.  1 is currently shut down this is why I have zero respect for the military. We are legally slaves from birth permalink parent award report block reply\nAbove_Reproach -1 points 3 days ago ThAnk mE for mUh sErviCe, cHud. permalink parent award report block reply"}