{"id": "1ARK58zWsd", "contents": "497 The Constitution did not delegate hiring air traffic controllers to the federal government posted 4 days ago by AVeryNakedMan 39 comments award share download report block\n39 comments Sort by Top Top New Worst Old Save Around the Web The Killer of Baldness Has Been Found! (Try This at Home) HaloGrow PatriotSkorzeny 20 points 4 days ago Bruh to leave air traffic to the whims of 50 different states is fucking stupid. Fed gov gets the military. Military has the Air Force. There. Train air traffic controllers. permalink award report block reply Moebius 13 points 4 days ago Military.  That's where all the controllers came from after Reagan fired the lot of 'em during the PATCO strike. The majority came from the USAF... permalink parent award report block reply Moebius 12 points 4 days ago Yup.  You'll get Controllers like you get Jeet CDL holders... permalink parent award report block reply h4b1t 7 points 4 days ago They should be mainly funded by the airlines permalink parent award report block reply keeman 3 points 4 days ago Ding Ding!  This one understands. permalink parent award report block reply patrioticwinning3 4 points 4 days ago The Airforce Air traffic controllers are already trained... and not getting paid since to globohomo dems shut the government down. permalink parent award report block reply Moebius 5 points 4 days ago Already trained and FAA Certified. permalink parent award report block reply SqRt7744 3 points 3 days ago Privatized not State owned permalink parent award report block reply load 1 more comments... Pyroth5687 10 points 4 days ago Before 9/11, airports had to higher their own security screeners. They may have just been cops from their city. permalink award report block reply benjovikenobi 10 points 4 days ago This is a fine time to remind everybody that the FAA is facing a class-action lawsuit (Brigida v. FAA) for DEI hiring policies that specifically intended to create a shortage of qualified ATC controllers, and deliberately hired incompetents. permalink award report block reply Moebius 9 points 4 days ago ATC must be standardized...and we have to deal with those pesky ICAO rules we're mostly bound to by treaty. As for 'VFR only' towers you can hire anybody to sit up there and sleep... permalink award report block reply ltbadpuppy 6 points 4 days ago I rather one standard than 51 permalink award report block reply mikethemarine 5 points 4 days ago it is because the government gets a shit load of money from it that's why, they will never give up this cash cow, now ask why don't they also provide their own airport security, same thing they don't want the responsibility, leave it to the tax payer it will cost them less, how much does U.S. taxpayer supplies airlines?we are getting screwed General Fund: The remainder of the TSA's budget (the total net spending was $6.7 billion in FY 2024, and the total budget request for FY 2025 was $11.8 billion) is covered by the general fund of the U.S. Treasury, which is comprised of various federal taxes. The U.S. government directly funds the Federal Air Marshal Service (FAMS), not the airlines, through a dedicated budget for inflight security. The 2025 budget for the FAMS is approximately $843 million, covering operations and personnel costs, not a direct subsidy to airlines. This funding is separate from airline expenses, although airlines do incur their own security costs. U.S. taxpayers have provided significant financial support to airlines, most notably through over $50 billion in pandemic-related grants and loans through the Payroll Support Program (PSP), with the\nTreasury Department awarding about $59 billion in financial assistance. Beyond pandemic aid, U.S. taxpayers fund the airline industry through infrastructure like airports via the Airport and Airway Trust Fund (AATF), which also receives money from excise taxes on flights, and provides funding for the Federal Aviation Administration (FAA). Edit: I left this one out and I am sure there is more I missed dollar plan to modernize the system, a significant portion of the Federal Aviation Administration (FAA)'s budget, and specific project funding. For fiscal year 2024, the FAA's budget was about ($24.8) billion, with the Airport and Airway Trust Fund (AATF) contributing ($18.9) billion. Specific investments in equipment, infrastructure, and facilities include ($12.5) billion from the 2025 budget for items like telecommunications, radar replacements, and new control centers, with the total cost for a complete overhaul estimated at ($31.5) billion the total is $210+ billion this year, but they will try to say the industry gives a lot back in taxes, it's bullshit,We pay it all as fees then they send it back to the politicians that gave them our money permalink award report block reply TGNX 2 points 4 days ago And all the middlemen in between scraping off their share. permalink parent award report block reply mikethemarine 3 points 4 days ago TSA steal like a mother fucker from the people boarding the planes, you know they are padding their time cards and getting extra for something and anything else they can scam from the system permalink parent award report block reply TGNX 2 points 3 days ago It's not just the lower levels of the TSA. It's every politician and bureaucrat that touches the paperwork. permalink parent award report block reply Seruna_Kanus 4 points 4 days ago There are some services that should be regulated.  There are some industries that do need nation wide oversight. permalink award report block reply SanityGumby 3 points 4 days ago Because I would rather not die because they H1B it all to jeets. We already have enough an issue because Obama reduced the math requirements because blacks couldn't pass the exam. permalink award report block reply Gyrfalcon 1 points 3 days ago H1Bs are coding the self driving cars. permalink parent award report block reply DudeNoOne 3 points 4 days ago In short the government owns the entirety of the ATC system because of national security interests. The ATC system is part of the US’s early warning system. Most if not all ATC positions require at minimum a background check, many positions require at least a secret clearance. permalink award report block reply BartzFFV 3 points 4 days ago Seems like a job for AI. permalink award report block reply Apersonofinterest 4 points 4 days ago DEAI. permalink parent award report block reply keeman 0 points 4 days ago Seems like a job for AI. Um.  No. permalink parent award report block reply BartzFFV 1 points 3 days ago Why not? I see little room for error. permalink parent award report block reply Gyrfalcon 1 points 3 days ago I asked AI why women's shoe sizes were smaller than men's shoe sizes. Answer was women's sizes were larger than men's, followed by absolute stupidity for an explanation. If something that simple can be so wrong, how can you trust it for anything. permalink parent award report block reply CuttersGhost 1 points 3 days ago Now do politicians... permalink parent award report block reply BartzFFV 0 points 3 days ago Well, ai writes perfect mathematically correct music. ATC is choreography for landing planes.  I dont think it could make a human like error in that appliance. permalink parent award report block reply view 1 more comments... HeavyMetalPatriot -1 points 4 days ago Very soon it will be 99% automated. Pilots will be replaced soon as well. permalink parent award report block reply keeman 3 points 4 days ago You are vastly over-rating the supposed abilities of AI.  No.  Sell your AI stocks, they will tank. permalink parent award report block reply BartzFFV -1 points 3 days ago I like to think I know how shitty AI is. Yet I also know  ATC is a logical flow that AI can do better than a human. permalink parent award report block reply BartzFFV 0 points 3 days ago Why would anyone downvote this statement?   ATC is logical flow. There is no guessing. permalink parent award report block reply view 1 more comments... kishkan 1 points 4 days ago Reagan did. permalink award report block reply Inficant 1 points 3 days ago Wasn't it Reagan that federalized them? permalink award report block reply kishkan 1 points 3 days ago Yes, due to a strike. permalink parent award report block reply SqRt7744 1 points 3 days ago Should literally be privatized. permalink award report block reply Deplora 1 points 4 days ago It basically did.  Interstate commerce clause. permalink award report block reply keeman 1 points 4 days ago Do you think ANY of the founding generation would have said the interstate commerce clause authorized the FAA?  Are you high?  Have you read any of the federalist or anti-federalist papers?  And how about a plane that takes off in Seattle and lands in Spokane?  Not really interstate.  Draining the swamp requires understanding that the swamp got here because of arguments like you have just made. permalink parent award report block reply hillaryforprison -2 points 4 days ago someone will make an AI solution that will be 10000x safer than human beings. permalink award report block reply keeman 2 points 4 days ago No.  You know nothing.  That AI engine you like to talk to is more retarded than your pet dog.  It is just REALLY good at copying conversations that it has seen.  Ask it about anything it has never seen a conversation about and see it flail. permalink parent award report block reply\nPatriotSkorzeny 20 points 4 days ago Bruh to leave air traffic to the whims of 50 different states is fucking stupid. Fed gov gets the military. Military has the Air Force. There. Train air traffic controllers. permalink award report block reply Moebius 13 points 4 days ago Military.  That's where all the controllers came from after Reagan fired the lot of 'em during the PATCO strike. The majority came from the USAF... permalink parent award report block reply Moebius 12 points 4 days ago Yup.  You'll get Controllers like you get Jeet CDL holders... permalink parent award report block reply h4b1t 7 points 4 days ago They should be mainly funded by the airlines permalink parent award report block reply keeman 3 points 4 days ago Ding Ding!  This one understands. permalink parent award report block reply patrioticwinning3 4 points 4 days ago The Airforce Air traffic controllers are already trained... and not getting paid since to globohomo dems shut the government down. permalink parent award report block reply Moebius 5 points 4 days ago Already trained and FAA Certified. permalink parent award report block reply SqRt7744 3 points 3 days ago Privatized not State owned permalink parent award report block reply load 1 more comments...\nMoebius 13 points 4 days ago Military.  That's where all the controllers came from after Reagan fired the lot of 'em during the PATCO strike. The majority came from the USAF... permalink parent award report block reply\nMoebius 12 points 4 days ago Yup.  You'll get Controllers like you get Jeet CDL holders... permalink parent award report block reply\nh4b1t 7 points 4 days ago They should be mainly funded by the airlines permalink parent award report block reply keeman 3 points 4 days ago Ding Ding!  This one understands. permalink parent award report block reply\nkeeman 3 points 4 days ago Ding Ding!  This one understands. permalink parent award report block reply\npatrioticwinning3 4 points 4 days ago The Airforce Air traffic controllers are already trained... and not getting paid since to globohomo dems shut the government down. permalink parent award report block reply Moebius 5 points 4 days ago Already trained and FAA Certified. permalink parent award report block reply\nMoebius 5 points 4 days ago Already trained and FAA Certified. permalink parent award report block reply\nSqRt7744 3 points 3 days ago Privatized not State owned permalink parent award report block reply\nPyroth5687 10 points 4 days ago Before 9/11, airports had to higher their own security screeners. They may have just been cops from their city. permalink award report block reply\nbenjovikenobi 10 points 4 days ago This is a fine time to remind everybody that the FAA is facing a class-action lawsuit (Brigida v. FAA) for DEI hiring policies that specifically intended to create a shortage of qualified ATC controllers, and deliberately hired incompetents. permalink award report block reply\nMoebius 9 points 4 days ago ATC must be standardized...and we have to deal with those pesky ICAO rules we're mostly bound to by treaty. As for 'VFR only' towers you can hire anybody to sit up there and sleep... permalink award report block reply\nltbadpuppy 6 points 4 days ago I rather one standard than 51 permalink award report block reply\nmikethemarine 5 points 4 days ago it is because the government gets a shit load of money from it that's why, they will never give up this cash cow, now ask why don't they also provide their own airport security, same thing they don't want the responsibility, leave it to the tax payer it will cost them less, how much does U.S. taxpayer supplies airlines?we are getting screwed General Fund: The remainder of the TSA's budget (the total net spending was $6.7 billion in FY 2024, and the total budget request for FY 2025 was $11.8 billion) is covered by the general fund of the U.S. Treasury, which is comprised of various federal taxes. The U.S. government directly funds the Federal Air Marshal Service (FAMS), not the airlines, through a dedicated budget for inflight security. The 2025 budget for the FAMS is approximately $843 million, covering operations and personnel costs, not a direct subsidy to airlines. This funding is separate from airline expenses, although airlines do incur their own security costs. U.S. taxpayers have provided significant financial support to airlines, most notably through over $50 billion in pandemic-related grants and loans through the Payroll Support Program (PSP), with the\nTreasury Department awarding about $59 billion in financial assistance. Beyond pandemic aid, U.S. taxpayers fund the airline industry through infrastructure like airports via the Airport and Airway Trust Fund (AATF), which also receives money from excise taxes on flights, and provides funding for the Federal Aviation Administration (FAA). Edit: I left this one out and I am sure there is more I missed dollar plan to modernize the system, a significant portion of the Federal Aviation Administration (FAA)'s budget, and specific project funding. For fiscal year 2024, the FAA's budget was about ($24.8) billion, with the Airport and Airway Trust Fund (AATF) contributing ($18.9) billion. Specific investments in equipment, infrastructure, and facilities include ($12.5) billion from the 2025 budget for items like telecommunications, radar replacements, and new control centers, with the total cost for a complete overhaul estimated at ($31.5) billion the total is $210+ billion this year, but they will try to say the industry gives a lot back in taxes, it's bullshit,We pay it all as fees then they send it back to the politicians that gave them our money permalink award report block reply TGNX 2 points 4 days ago And all the middlemen in between scraping off their share. permalink parent award report block reply mikethemarine 3 points 4 days ago TSA steal like a mother fucker from the people boarding the planes, you know they are padding their time cards and getting extra for something and anything else they can scam from the system permalink parent award report block reply TGNX 2 points 3 days ago It's not just the lower levels of the TSA. It's every politician and bureaucrat that touches the paperwork. permalink parent award report block reply\nTGNX 2 points 4 days ago And all the middlemen in between scraping off their share. permalink parent award report block reply mikethemarine 3 points 4 days ago TSA steal like a mother fucker from the people boarding the planes, you know they are padding their time cards and getting extra for something and anything else they can scam from the system permalink parent award report block reply TGNX 2 points 3 days ago It's not just the lower levels of the TSA. It's every politician and bureaucrat that touches the paperwork. permalink parent award report block reply\nmikethemarine 3 points 4 days ago TSA steal like a mother fucker from the people boarding the planes, you know they are padding their time cards and getting extra for something and anything else they can scam from the system permalink parent award report block reply TGNX 2 points 3 days ago It's not just the lower levels of the TSA. It's every politician and bureaucrat that touches the paperwork. permalink parent award report block reply\nTGNX 2 points 3 days ago It's not just the lower levels of the TSA. It's every politician and bureaucrat that touches the paperwork. permalink parent award report block reply\nSeruna_Kanus 4 points 4 days ago There are some services that should be regulated.  There are some industries that do need nation wide oversight. permalink award report block reply\nSanityGumby 3 points 4 days ago Because I would rather not die because they H1B it all to jeets. We already have enough an issue because Obama reduced the math requirements because blacks couldn't pass the exam. permalink award report block reply Gyrfalcon 1 points 3 days ago H1Bs are coding the self driving cars. permalink parent award report block reply\nGyrfalcon 1 points 3 days ago H1Bs are coding the self driving cars. permalink parent award report block reply\nDudeNoOne 3 points 4 days ago In short the government owns the entirety of the ATC system because of national security interests. The ATC system is part of the US’s early warning system. Most if not all ATC positions require at minimum a background check, many positions require at least a secret clearance. permalink award report block reply\nBartzFFV 3 points 4 days ago Seems like a job for AI. permalink award report block reply Apersonofinterest 4 points 4 days ago DEAI. permalink parent award report block reply keeman 0 points 4 days ago Seems like a job for AI. Um.  No. permalink parent award report block reply BartzFFV 1 points 3 days ago Why not? I see little room for error. permalink parent award report block reply Gyrfalcon 1 points 3 days ago I asked AI why women's shoe sizes were smaller than men's shoe sizes. Answer was women's sizes were larger than men's, followed by absolute stupidity for an explanation. If something that simple can be so wrong, how can you trust it for anything. permalink parent award report block reply CuttersGhost 1 points 3 days ago Now do politicians... permalink parent award report block reply BartzFFV 0 points 3 days ago Well, ai writes perfect mathematically correct music. ATC is choreography for landing planes.  I dont think it could make a human like error in that appliance. permalink parent award report block reply view 1 more comments... HeavyMetalPatriot -1 points 4 days ago Very soon it will be 99% automated. Pilots will be replaced soon as well. permalink parent award report block reply keeman 3 points 4 days ago You are vastly over-rating the supposed abilities of AI.  No.  Sell your AI stocks, they will tank. permalink parent award report block reply BartzFFV -1 points 3 days ago I like to think I know how shitty AI is. Yet I also know  ATC is a logical flow that AI can do better than a human. permalink parent award report block reply BartzFFV 0 points 3 days ago Why would anyone downvote this statement?   ATC is logical flow. There is no guessing. permalink parent award report block reply view 1 more comments...\nApersonofinterest 4 points 4 days ago DEAI. permalink parent award report block reply\nkeeman 0 points 4 days ago Seems like a job for AI. Um.  No. permalink parent award report block reply BartzFFV 1 points 3 days ago Why not? I see little room for error. permalink parent award report block reply Gyrfalcon 1 points 3 days ago I asked AI why women's shoe sizes were smaller than men's shoe sizes. Answer was women's sizes were larger than men's, followed by absolute stupidity for an explanation. If something that simple can be so wrong, how can you trust it for anything. permalink parent award report block reply CuttersGhost 1 points 3 days ago Now do politicians... permalink parent award report block reply BartzFFV 0 points 3 days ago Well, ai writes perfect mathematically correct music. ATC is choreography for landing planes.  I dont think it could make a human like error in that appliance. permalink parent award report block reply view 1 more comments...\nBartzFFV 1 points 3 days ago Why not? I see little room for error. permalink parent award report block reply Gyrfalcon 1 points 3 days ago I asked AI why women's shoe sizes were smaller than men's shoe sizes. Answer was women's sizes were larger than men's, followed by absolute stupidity for an explanation. If something that simple can be so wrong, how can you trust it for anything. permalink parent award report block reply CuttersGhost 1 points 3 days ago Now do politicians... permalink parent award report block reply BartzFFV 0 points 3 days ago Well, ai writes perfect mathematically correct music. ATC is choreography for landing planes.  I dont think it could make a human like error in that appliance. permalink parent award report block reply view 1 more comments...\nGyrfalcon 1 points 3 days ago I asked AI why women's shoe sizes were smaller than men's shoe sizes. Answer was women's sizes were larger than men's, followed by absolute stupidity for an explanation. If something that simple can be so wrong, how can you trust it for anything. permalink parent award report block reply CuttersGhost 1 points 3 days ago Now do politicians... permalink parent award report block reply BartzFFV 0 points 3 days ago Well, ai writes perfect mathematically correct music. ATC is choreography for landing planes.  I dont think it could make a human like error in that appliance. permalink parent award report block reply view 1 more comments...\nCuttersGhost 1 points 3 days ago Now do politicians... permalink parent award report block reply\nBartzFFV 0 points 3 days ago Well, ai writes perfect mathematically correct music. ATC is choreography for landing planes.  I dont think it could make a human like error in that appliance. permalink parent award report block reply view 1 more comments...\nHeavyMetalPatriot -1 points 4 days ago Very soon it will be 99% automated. Pilots will be replaced soon as well. permalink parent award report block reply keeman 3 points 4 days ago You are vastly over-rating the supposed abilities of AI.  No.  Sell your AI stocks, they will tank. permalink parent award report block reply BartzFFV -1 points 3 days ago I like to think I know how shitty AI is. Yet I also know  ATC is a logical flow that AI can do better than a human. permalink parent award report block reply BartzFFV 0 points 3 days ago Why would anyone downvote this statement?   ATC is logical flow. There is no guessing. permalink parent award report block reply view 1 more comments...\nkeeman 3 points 4 days ago You are vastly over-rating the supposed abilities of AI.  No.  Sell your AI stocks, they will tank. permalink parent award report block reply BartzFFV -1 points 3 days ago I like to think I know how shitty AI is. Yet I also know  ATC is a logical flow that AI can do better than a human. permalink parent award report block reply BartzFFV 0 points 3 days ago Why would anyone downvote this statement?   ATC is logical flow. There is no guessing. permalink parent award report block reply view 1 more comments...\nBartzFFV -1 points 3 days ago I like to think I know how shitty AI is. Yet I also know  ATC is a logical flow that AI can do better than a human. permalink parent award report block reply BartzFFV 0 points 3 days ago Why would anyone downvote this statement?   ATC is logical flow. There is no guessing. permalink parent award report block reply view 1 more comments...\nBartzFFV 0 points 3 days ago Why would anyone downvote this statement?   ATC is logical flow. There is no guessing. permalink parent award report block reply view 1 more comments...\nkishkan 1 points 4 days ago Reagan did. permalink award report block reply\nInficant 1 points 3 days ago Wasn't it Reagan that federalized them? permalink award report block reply kishkan 1 points 3 days ago Yes, due to a strike. permalink parent award report block reply\nkishkan 1 points 3 days ago Yes, due to a strike. permalink parent award report block reply\nSqRt7744 1 points 3 days ago Should literally be privatized. permalink award report block reply\nDeplora 1 points 4 days ago It basically did.  Interstate commerce clause. permalink award report block reply keeman 1 points 4 days ago Do you think ANY of the founding generation would have said the interstate commerce clause authorized the FAA?  Are you high?  Have you read any of the federalist or anti-federalist papers?  And how about a plane that takes off in Seattle and lands in Spokane?  Not really interstate.  Draining the swamp requires understanding that the swamp got here because of arguments like you have just made. permalink parent award report block reply\nkeeman 1 points 4 days ago Do you think ANY of the founding generation would have said the interstate commerce clause authorized the FAA?  Are you high?  Have you read any of the federalist or anti-federalist papers?  And how about a plane that takes off in Seattle and lands in Spokane?  Not really interstate.  Draining the swamp requires understanding that the swamp got here because of arguments like you have just made. permalink parent award report block reply\nhillaryforprison -2 points 4 days ago someone will make an AI solution that will be 10000x safer than human beings. permalink award report block reply keeman 2 points 4 days ago No.  You know nothing.  That AI engine you like to talk to is more retarded than your pet dog.  It is just REALLY good at copying conversations that it has seen.  Ask it about anything it has never seen a conversation about and see it flail. permalink parent award report block reply\nkeeman 2 points 4 days ago No.  You know nothing.  That AI engine you like to talk to is more retarded than your pet dog.  It is just REALLY good at copying conversations that it has seen.  Ask it about anything it has never seen a conversation about and see it flail. permalink parent award report block reply"}