{"id": "1ARK9mHVad", "contents": "1224 Trump must roll some heads in White House, including removing warmongers posted 10 hours ago by FuckAllDemocrats 193 comments award share report block Jack Posobiec @JackPosobiec • 16h We should implement every step of this Charlie Kirk @charliekirk11 • 3M This is the social compact breaking down. We need urgency to restore it: 1 - Mass deportations 2 - Stop the H-1B scam 3 - Dramatically reduce LEGAL Immigration 4 - End chain migration and the Visa Lottery 5 - Build 10 million homes for Americans 6 - Crush the College Cartel\n193 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style HenkZeilstra 122 points 9 hours ago Trump just stated in the interview with Fox that we do not have talented people in America so we need H1B., The FUCK permalink award report block reply Viewer01 85 points 9 hours ago I have said this plenty but the boomer Zionists would sooner smash this party to kindling than let an America first who doesn’t support Israel sentiment take over. Think about it. This shit started going off the rails the minute bb showed up trying to start a war with Iran. Kirk, Elon, and all the youth were suddenly and magically removed from the admin. Group chats were leaked. Private meetings taped. All by Jews. Now? Oh Noes white man you’re too dumb to do this job. Oh no white man you can’t afford a home? Here’s super usury. Oh no white man you can’t go to college we have to let in a million Chinese. permalink parent award report block reply Antiluminati 19 points 8 hours ago When did Trump start receiving tiny hat money? Wile I don’t think Trump has betrayed us it does seem that he made a deal with the devil at some level with all this. permalink parent award report block reply Viewer01 37 points 8 hours ago Trump got literally a quarter of a billion dollars from Mariam Adelson. Who is a rich Vegas gambling jewess. The short version is his cabinet is filled with Zionists and they’re doing their typical destructive policy. permalink parent award report block reply sordfysh PRO 3 points 7 hours ago She made her money from gambling? Oof. Remember that to defeat the Zionists, you must defeat the Jew within yourself first. permalink parent award report block reply view 4 more comments... TallestSkill -10 points 7 hours ago Viewer01, you sound like a man staring at a thunderstorm and blaming the clouds for being Jewish. Miriam Adelson’s donations were public, legal, and entirely predictable in a political system built on super PACs. Every major campaign takes money from billionaires, because Washington is designed to make that unavoidable. Trump took money from Adelson, Thiel, Icahn, Uihlein, and a dozen others. That is not “Zionism,” it is campaign finance law written by the same establishment that wants the populist right dead. The irony is that Trump was the first president in decades to govern against donor consensus. He wrecked TPP, froze new wars, called out China, and put working-class wages above Wall Street indexes. Those are things no “Zionist cabinet” would ever have approved. You are mistaking token diplomatic gestures for control. You want to know what’s actually destructive policy? The Fed printing trillions, the universities importing visa labor, the Pentagon laundering hundreds of billions through foreign contractors, the Chamber of Commerce buying both parties, and the bureaucrats regulating America out of existence. None of that requires a menorah, just greed and contempt for the nation. This movement either matures into a disciplined nationalist force or collapses into a paranoid message board cult. If your only political theory is “the Jews did it,” you are not fighting globalism, you are auditioning for its sideshow. permalink parent award report block reply view 2 more comments... someguy7738 18 points 7 hours ago Honestly Trump has always been some what beholden to Israel, his kids have married into the tribe, but it had seemed, at least a for a little while, that his America First goals slightly overrode that. permalink parent award report block reply Decepticons-superior 9 points 6 hours ago It amazes me that someone like Ivanka can convert from Christianity to Judaism. I submit that this is not even possible. You weren’t Christian to begin with if you can do that. permalink parent award report block reply TallestSkill -12 points 7 hours ago someguy7738, calling marriage “joining the tribe” is the kind of barstool anthropology that confuses gossip for geopolitics. Trump’s son-in-law did not hypnotize him with a dreidel. Trump has been pro-Israel because every U.S. president for seventy years has been pro-Israel. It is institutional inertia, not secret conversion. The difference is that Trump was the first president in modern history to break the “Israel first, America second” rule in practice. He cut off endless wars, pressured NATO freeloaders, crushed ISIS, sanctioned Iran without launching another Middle East quagmire, and forced Israel to make regional peace deals instead of demanding more American troops. That is what “America First” actually looks like. Alliances serve our interests or they do not exist. You are mistaking diplomacy for devotion. The same man who moved the embassy to Jerusalem also told Netanyahu to his face that America would not fight his wars. That is not servitude, that is transactional realism. If the movement cannot distinguish between family ties and national betrayal, it will keep chasing bloodlines while the real traitors, bureaucrats, bankers, and global consultants, keep selling the country piece by piece. The test of loyalty is policy, not who someone’s daughter married. permalink parent award report block reply view 4 more comments... flashersenpai 17 points 8 hours ago I believe 20M term 1, 90M term 2 both from Miriam Adelson 2M to unseat Thomas Massie from Adelson and two other Zionists, supposedly plus an additional 20M. Presidential campaign levels of funding to get rid of one House member who never took AIPAC money. permalink parent award report block reply TallestSkill -12 points 7 hours ago Antiluminati, this “tiny hat money” nonsense is the vocabulary of defeat. You are describing global corruption and calling it a synagogue. You are confusing Wall Street, Davos, and K Street with Jerusalem. Trump’s “deal with the devil” was not with Jews. It was with the same donor and consultant machine that every modern politician must navigate to compete. He walked into a rigged casino and still managed to flip the table for four years. That took courage, not conspiracy. The people hollowing out this country are not defined by religion. They are defined by class. The permanent managerial caste believes it owns the nation, and it will rent it out to anyone for a profit. That includes Chinese nationals, Silicon Valley tech lords, NGO parasites, and yes, a few Israeli lobbyists too. The common thread is money and power, not a menorah. You are repeating a century-old script written to keep working people stupid and divided. Every time populism gains traction, someone yells “Jewish puppet” to fracture the coalition. The bankers and bureaucrats love that. They drink champagne every time another right-winger trades political analysis for racial mysticism. If you want to restore the social compact, stop chanting about hats and start naming institutions. Name the banks, the NGOs, the Ivy League foundations, the consulting firms, the defense contractors. Name the empire, not a religion. The movement fails the moment it stops telling the truth. permalink parent award report block reply NonbinaryPotatohead 10 points 7 hours ago Trump literally admitted to being bought by Miriam Adelson live on air while visiting Israel recently. Have you not seen that video? It was fucking insane. permalink parent award report block reply view 8 more comments... Antiluminati 2 points 6 hours ago Oh no don't confuse me with storm fags i completely understand what you’re saying. You actually did a really good job of explaining it. Thank you. permalink parent award report block reply Lurker404 8 points 7 hours ago Elon is just as much for H1Pajeets as Trump suddenly seems to be. permalink parent award report block reply keeman 1 points 45 minutes ago Rubio has been pushing the admin in a neocon direction since the start.  Every time there is a danger of the US finding a way out of Ukraine or the middle east, little Marco goes and throws a spanner in the works.  Rubio, Bondi, Patel all need to go.  And yes, Trump needs to tell Bibi to solve his own problems without American help. permalink parent award report block reply TallestSkill -13 points 7 hours ago Viewer01, you are confusing cause and effect.\nAmerica did not lose its footing because of “the Jews.” It lost its footing because our own political class, white, black, Christian, atheist, male, and female, sold the nation out for global profit margins and Beltway prestige. Blaming Jews for that is lazy Marxist thinking with a cross necklace on. It is a cope. The Israel lobby did not offshore American industry. It did not design the H-1B scam. It did not write the DEI bureaucracies strangling our businesses. All that was done by the same Ivy-credentialed ruling caste that waves the rainbow flag and cashes checks from Beijing. You are right that “Zionist boomers” exist. They are a symptom of the Cold War alliance system, not a secret religion. And yes, BB and Neocons pushed Iran hawkishness. But that is not Judaism. That is the same military-industrial machine that used Christianity and “freedom” as marketing slogans for half a century. If you cannot tell the difference between a religion and a lobby, between a citizen and a subversive, you are helping the real enemy, the global managerial elite, divide and neutralize us. They want right-wing populists chasing ghosts instead of power. This movement is supposed to defend our civilization. That means defending the truth. If your analysis begins and ends with “the Jews,” you have already admitted you cannot handle reality. permalink parent award report block reply ProdigalPlaneswalker 3 points 6 hours ago America did not lose its footing because of “the Jews.” It lost its footing because our own political class, white, black, Christian, atheist, male, and female, sold the nation out for global profit margins and Beltway prestige. Don't blame the people doing the bribing. Only blame the people taking the bribes. permalink parent award report block reply TallestSkill -4 points 6 hours ago ProdigalPlaneswalker, you are repeating a kindergarten-level moralization that is useless in the real world. Blame without analysis changes nothing. If you only go after the bribe-takers, the architects of the system, the lobbyists, the banks, the consulting firms, and the regulatory cartels remain untouched. They design the incentives, write the rules, and rig the game. The people accepting bribes are symptoms, not causes. They act because the system rewards betrayal. Punching shadows at the margins while the real power brokers operate freely is why populist movements collapse. Understanding corruption requires mapping the network, identifying leverage points, and dismantling the incentives. Moral outrage alone achieves nothing. If your strategy is to blame only the hand that takes money, you are training yourself to fail while the global managerial elite laughs and consolidates control. The battle is structural, not personal. permalink parent award report block reply Awakened 3 points 6 hours ago 'Blaming Jews for that is lazy Marxist thinking' Lol, well Jews invented and perpetuated Marxism so it seems like a bit of karma. Look, this has happened a hundred times before. Fair or not we both know where this is going. It's up to the Jews to break the cycle, not the 110th country reacting to it. Break the cycle. Own up to it. Stop the subversion. Stop embracing unfettered immigration as a whole. Every Jewish group of importance embraces both legal and illegal immigration, man. They also punch for leftism. There was on this page just a week ago a prominent Jewish journalist bragging how Jews create and push leftism. So she was surprised at the anti-semitism coming from the free Palestine movement. Stop getting angry at people reacting to your group and noticing what's happening.  Be the change. You know a clever phrase like that was invented by a Jew and not Obama. You guys are over represented in media, law, finance, and government.  The most influential industries to be in. Of course you're gonna catch blame. As well you should. You really can fix this. You start by stopping getting mad at those reacting to it and placing the blame where it belongs. Then shame and change. I have family that is Jewish and I care very much. It would terrible for the cycle to begin again. But it's not in the hands of the people posting here. They can't be you and make those changes. They can only react. Good luck. permalink parent award report block reply TallestSkill -3 points 6 hours ago Awakened, this is exactly the kind of intellectual laziness that keeps the same global managerial class in power. You are turning a structural and political problem into a morality play about one religious group. That is not analysis, that is storytelling for people who want an easy villain. Blaming Jews for Marxism, immigration, or leftism is the oldest deflection in the book. The real power in media, finance, law, and government is class and networks, not religion. Ivy League financiers, multinational corporations, and bureaucratic cartels run the incentives. They hire, fire, lobby, and write policy to maximize profit and influence. Religion is incidental. Bloodlines do not dictate policy, structures do. The moment you treat a group as the cause of systemic corruption, you hand the real architects a free pass. You are telling ordinary Americans that they cannot fight the system unless they chase ghosts. That is exactly what the elite wants: populists distracted by ethnic or religious scapegoats while the ruling class continues hollowing out the nation. If you want change, focus on institutions, not identity. Follow the money, follow the regulations, follow the power. Stop anthropologizing. Otherwise, you are participating in the cycle you claim to fear. All the “good intentions” in the world cannot save a nation if your strategy is moralizing about ethnicity instead of dismantling power. permalink parent award report block reply view 1 more comments... champdog 62 points 9 hours ago Remember, we're also \"stupid\" for even bringing up Epstein, something he campaigned on.  Weird. permalink parent award report block reply twentytwentyfourr 42 points 9 hours ago whoah broah, cool it with the anti-semitism permalink parent award report block reply Here_we_go 7 points 8 hours ago I know someone else that likes pizzas and is very sensitive about his little  hat. Wonder whats up with the pizza obsession and being a faggot. permalink parent award report block reply TallestSkill -1 points 7 hours ago So you have been dead weight since pizzagate? permalink parent award report block reply TallestSkill -3 points 7 hours ago Cool it with bearing false witness permalink parent award report block reply sordfysh PRO 2 points 7 hours ago Bearing false witness that Epstein was a Jew and that Maxwell was a Jew? Zionists don't even believe that it's a sin to bear false witness. That's why we are not of the same cloth. permalink parent award report block reply view 19 more comments... SimaYi 9 points 8 hours ago It's just a democrat hoax. But don't worry, he's going to \"arrest Obama\" in two weeks. permalink parent award report block reply btntx 6 points 7 hours ago He’s not good at flip-flopping. While he’s good at embellishing, he’s a horrible liar. permalink parent award report block reply TallestSkill -1 points 7 hours ago This, but unironically. It's not my fault you all fall hook line and sinker for any and all propaganda if the words child rape are uttered. Child rape. Child rape. Child rape. Congratulations your critical thinking is GONE because I merely said the elites are raping kids. permalink parent award report block reply -Evspra 49 points 9 hours ago we're too stupid to work at car plants, so we need to import rajesh and his 500 inbred cousins to show us how it's done permalink parent award report block reply Here_we_go 15 points 8 hours ago I guess we need to learn to shit in the streets and ise the same unwashed hand to eat. permalink parent award report block reply someguy7738 9 points 7 hours ago Don't forget tech. The US was just a useless backwater with no technology until we imported all those brilliant street shitters to create the entire tech industry from scratch.... Or so I've been told. permalink parent award report block reply flashersenpai 9 points 8 hours ago you're so full of shit it's Park Kim and his 500 cousins to make batteries get it right permalink parent award report block reply ElectionDenier2020 5 points 7 hours ago Bizarre that Trump actually seemed to be complaining about those deportations. How's his cabinet supposed to get it done? permalink parent award report block reply -Evspra 2 points 7 hours ago horee sheet... my bad ah... you totally right la... i also dunno how i can mess up until like that one... aiyo next time i must open my eyes big big already lor... wat da hek mannn permalink parent award report block reply JoesNoseKnows 9 points 7 hours ago Whoever is advising him on this must go now. This isn't coming from Miller. This isn't coming from Bannon. This might come from someone from the more progressive side of his family (Kushner?) or more likely from that Tylenol guzzling Musk. This is what we're importing: https://youtu.be/66_Sj8DWm2I?si=513rX3t_mxe-V45- permalink parent award report block reply HumblePepe 8 points 7 hours ago That was an incredibly out of touch thing to say. I'd expect Dinesh or Vivek to say such bullshit. Not Trump. permalink parent award report block reply sordfysh PRO 3 points 7 hours ago Dinesh is very busy right now being a hitman for the Zionist lobby. permalink parent award report block reply TrumpPlay3dYouLoL 1 points 4 hours ago Comment removed by community moderators. permalink parent award report block reply load 16 more comments... linthat22 57 points 9 hours ago Charlie is gonna be the other dead man that Trump isn't gonna want to hear much more of. permalink award report block reply DeportThemAllForever 25 points 7 hours ago Sad, Charlie really understood the needs of the nation.  Thing is everyone knows, but government is ran to benefit those cartels, not to improve lives of everyday Americans. permalink parent award report block reply sordfysh PRO 7 points 7 hours ago Candace Owens was suggesting that the Trump admin has a hand in the assassination or cover-up. I didn't know what to think, but I didn't see why Trump would want Charlie killed. Now I see it plain and clear. Charlie would have been Trump's biggest thorn today. Trump seems to be currently diametrically opposed to Charlie's top political policies. permalink parent award report block reply DeportThemAllForever -1 points 7 hours ago No, Trump wouldn’t kill Charlie.  Left hated him, that’s the source. permalink parent award report block reply sordfysh PRO 4 points 5 hours ago Despite what Trump said about being able to kill someone on Fifth Avenue, I do not think Trump could just kill someone in public, and I do not think Trump himself shot Charlie Kirk. And I never said that I think Trump killed Charlie Kirk. Nobody involved looked anything like Trump, so he's clearly not the one who killed him. permalink parent award report block reply Mhmm2MoreWeeks -2 points 5 hours ago Well Sure, if the Jew Haters keep using him like a Dog Whistle. permalink parent award report block reply Buce-Nudo 0 points 9 hours ago Comment removed by community moderators. permalink parent award report block reply Scumbag-reddit 1 points 9 hours ago Advocating for Trump's death, nice. Pathetic shills permalink parent award report block reply Buce-Nudo 1 points 2 hours ago Yeah, it was a dumb heated comment. Just not happy about a couple of things. Plus, health issues. Not a great excuse,  I know. permalink parent award report block reply D-Dub 48 points 9 hours ago Sorry all Trump can do is say Americans aren’t talented while bringing more H1-Bs in. https://patriots.win/p/1ARK9mFaNd/trump-says-americans-arent-talen/c/ permalink award report block reply SimaYi 20 points 8 hours ago Why isn't this stickied?! What in the actual fuck?! permalink parent award report block reply ceva 19 points 7 hours ago Mods are complicit permalink parent award report block reply gottarememberpasswor 4 points 7 hours ago Been looking for articles like this posted for the last couple days there's another one recently too. Unfortunately the rule one I think is being enforced as hard as it possibly can be here permalink parent award report block reply Scipio_Americanus 1 points 4 hours ago Sounds like we need a MAGA.win site. permalink parent award report block reply Awakened 2 points 5 hours ago Yep. That story made it up on other Scored message boards, but not the one it should have. They're worried they will lose the board if we turn on Trump, but they don't need to worry at all. It's already got Patriots dot win as the URL. They will just need to change the name from Donald to Patriots. They'll still keep their honey pot. permalink parent award report block reply Appeal2Heaven98 1 points 5 hours ago Because this is a pro-Trump site and no criticism of Trump is allowed, Reddit op. /s permalink parent award report block reply FusionBlack 10 points 7 hours ago That clip knocked the wind out of me. You know the feeling you get when you find out your best friend or intimate person in your life has been lying to you all of the time you supported them? What has happened? permalink parent award report block reply The_Emperor 4 points 7 hours ago College nerds used to be able to get jobs readily.  They were recruited like athletes.   Now, athletes still get recruited,  and nerds are hired from Asia. permalink parent award report block reply Goozmania 37 points 9 hours ago When the words come from Trump's own mouth, why do we assume its the other people in his cabinet? permalink award report block reply someguy7738 7 points 7 hours ago Trump has always been susceptible to snakes whispering in his ear, sadly. permalink parent award report block reply Goozmania 10 points 7 hours ago Trump is a grown ass man, a billionaire businessman and philantrhropist. Not a fucking child. permalink parent award report block reply Appeal2Heaven98 1 points 5 hours ago He also has a family and legacy to look after. He's not going to do the history-altering nuclear decision-making that this country needs because it could negatively affect his family for future generations. permalink parent award report block reply someguy7738 0 points 7 hours ago And? permalink parent award report block reply TrumpPlay3dYouLoL 1 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply FKH2 6 points 7 hours ago Not an excuse permalink parent award report block reply someguy7738 1 points 7 hours ago Yeah not an excuse but it's a known weakness and the reason he's not allowed to have any America first patriots in his inner circle. The MIGA faggots have got him cut off and isolated from his base. permalink parent award report block reply Appeal2Heaven98 1 points 5 hours ago One word: Cope. permalink parent award report block reply brainphreeze 31 points 9 hours ago The complete silence on the pipe bomber is terrible from the admin, they could have an easy win by at least acknowledging the situation and some sort of investigation. permalink award report block reply sordfysh PRO 4 points 7 hours ago Wonder if the Israeli intelligence was involved in J6, too. Or else Trump is just not interested in draining the swamp. permalink parent award report block reply Psarg 1 points 3 hours ago Have you seen one liberal that was shocked about the new J6 bomber story?  They don't vigorously deny it, they just try to deflect it.  And Islamists, immigrants, and  people on food stamps could care less too. permalink parent award report block reply XxxRDTPRNxxX 29 points 9 hours ago I knew it was bad, but I had no idea it was 50% to 10% bad. In 1 generation new American's are gone. permalink award report block reply MAGA9428 30 points 8 hours ago And yet some people on the right still mock young people for complaining about how hard things have become. permalink parent award report block reply BoatingAccident 11 points 7 hours ago I only mocked the ones  at work who complained about how expensive everything is and they can’t ever afford to buy a house, but then insist America is such a rich country we can keep letting illegals in.  Those are the only kinds that I mock because in reality if we would deport 40 million illegals, there would be plenty of jobs for everybody. We have so much in this country and the corrupt government are stealing everything.\nIt’s disgusting that two parents have to work full-time jobs and still can’t afford to raise a family. permalink parent award report block reply NonbinaryPotatohead 3 points 7 hours ago I agree. It's literally a flick of a switch away. I'm not being sarcastic. permalink parent award report block reply squash1324 14 points 8 hours ago Demographic collapse isn't happening, its already happened. The collapse is inevitable, so prepare accordingly. permalink parent award report block reply AnAmishWithATude 7 points 7 hours ago Prepare accordingly by importing infinity Indians? permalink parent award report block reply Original_Dankster 2 points 6 hours ago I suggest individual preparation for yourself. Have non cash assets. Have the means to generate your own electricity and draw and treat your own water. Own property. Own guns and ammo. Learn how to preserve food. permalink parent award report block reply BannedAccount 19 points 8 hours ago Sorry best Trump can do is try to get a pardon for bibi and importing 600,000 Chinese spies permalink award report block reply covok48 18 points 8 hours ago I am done with this admin. He CAN NOT take that H1B stuff back. permalink award report block reply OmegaBird 17 points 8 hours ago Yeah. Trump isn't going to do that. He couldn't even drain the swamp which was his core goal. The only thing he's achieved has been SOME deportations. But not the rest of that. No Demoncrats have faced the chopping block. The J6 are free of consequences. The rinos remain. The swamp is thicker than ever. And lastly unemployment is still really high. permalink award report block reply narvster 11 points 9 hours ago As in the UK it's not just high levels of legal migration, it's who is migrating. permalink award report block reply Cuck-WTF 9 points 9 hours ago It will collapse. Focus on the rebuild. permalink award report block reply Here_we_go 6 points 8 hours ago How do you rebuild with half the country communists and invaders? permalink parent award report block reply NoahGav 4 points 7 hours ago You rebuild it on their bones. It's been done before. permalink parent award report block reply Train_w_no_brakes 3 points 7 hours ago You don’t. Collapse will end in levels of violence the world has NEVER seen. I am not rooting for this nor should anyone permalink parent award report block reply BoatingAccident 1 points 7 hours ago Meteor permalink parent award report block reply SimaYi 9 points 8 hours ago Right when I became an adult is when it went to shit. Great. permalink award report block reply flashersenpai 2 points 7 hours ago damn permalink parent award report block reply SteveRogers42 1 points 4 hours ago Just in time to play your part in the Reconquista. permalink parent award report block reply RedFoxOnFire 7 points 9 hours ago In addition to all this, put heavy taxes on corporations and LLC's that buy homes to rent.  Also find ways to encourage these companies to sell.  Make it less profitable specifically for them so more families will buy homes. permalink award report block reply Flataxandmaga 9 points 8 hours ago These companies should also have to pay up front property taxes for 15-20 years. If they're going to dabble in the housing market force it long term. permalink parent award report block reply UltraMagaWA 7 points 7 hours ago Trump needs to get his shit straight! MAGA (make America great again) not MiGA (make Israel great again), and replacing the population isn't MAGA either. permalink award report block reply LostElf 6 points 7 hours ago Breeding is out of whack. Stop rewarding EBT baby factories and start incentivizing large workingclass families. permalink award report block reply ScoobyDum 5 points 7 hours ago Trump wants illegals now with his latest interview. He thinks Americans don’t have the talent only illegals can do. Midterms are fucked period, Dems only need to replay that clip over and over with Trump saying Americans do not have talent. permalink award report block reply LadyGrahamsminge 4 points 7 hours ago Well, Trump said that we were going to see the largest mass deportations the world has ever known starting day one. We are deporting literally hundreds of illegals per month! I’ve never seen anything like it! Way to win permalink award report block reply FKH2 4 points 7 hours ago Stop all foreign aid to all countries to include that special one permalink award report block reply NonbinaryPotatohead 3 points 7 hours ago And I want those homes to be made of concrete damnit. None of that drywall, popsicle and glue illegal made bullshit. permalink award report block reply Counterwhat 3 points 10 hours ago I hope Trump listens. permalink award report block reply Froynlavenfroynlaven 17 points 9 hours ago He is.   50 year mortgages,  baby! permalink parent award report block reply Here_we_go 12 points 8 hours ago 15 year car notes! You're welcome! permalink parent award report block reply NoahGav 4 points 7 hours ago usury for the goyim! permalink parent award report block reply Lurker404 4 points 7 hours ago And more H1Pajeets because Americans are too dumb. permalink parent award report block reply RickSanchezC137 3 points 7 hours ago Mass deportations would negate number 5 permalink award report block reply RolandDelacroix 2 points 5 hours ago It's astounding that virtually every problem today is due to the govt distorting the market through subsidies. permalink award report block reply Train_w_no_brakes 2 points 7 hours ago Sorry to burst your bubble, Trump agrees with these people. You retards are living in a fantasy just like troons. Trump is kinda retarded on a lot of topics. He would rather have peace, but if the country is playing hardball, he will bomb them. He IS NOT an isolationist at all. He also loves foreigners stealing middle and upper middle class white collar jobs. He seems to only care about brokie and unskilled illegal immigration. You know, the Americans who pay little to no taxes. High 5 figure, Low 6 figure jobs in corporate America are INFESTED with Indians and Asians on H1-B and no one cares. They cry about the $15 an hour dipshit losing his job to an illegal but fuck the middle class who pay most of the taxes permalink award report block reply friedchicken 2 points 7 hours ago Next do rubio permalink award report block reply SenorTrumper 2 points 8 hours ago Who is the biggest warmonger? Lil Marco? permalink award report block reply flashersenpai 4 points 7 hours ago In the cabinet it's Rubio without a doubt, although I expect Susie Wiles is one too. Have you noticed the media has pretty much ignored her? You can pretty much assume that anyone who's supporting Israel will support all the wars. permalink parent award report block reply BasedCostanza91 2 points 7 hours ago I know we love Trump but we have to remember that he’s still a boomer. permalink award report block reply MoldyLocksNesMonste 1 points 3 hours ago Has nothing to do with it. permalink parent award report block reply TrumpPlay3dYouLoL 1 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply Shitsbrokeyo 2 points 3 hours ago Agree on all. Don't need 10 million homes after deportation and visa removals.  In fact, you have a surplus which will create affordability. permalink award report block reply rivetjoint2 2 points 7 hours ago 100% permalink award report block reply shatmaself 2 points 9 hours ago The graph at bottom is interesting, but I wonder at the true reasons for the drop-off.  I see that the sharp decline started in 1990 and 1990's, that would correspond to 30-year-olds who were born in the 1960's, and we raised during and after the \"Me\" and \"Hippie\" stuff. The contraceptive pill came into being in the 1960's, and helped change how women viewed their lives and roles, plus feminism intensified. All those things combine into people choosing not to get married and have kids, and that can explain the decline, as much or more as any economic factors or constraints. But I agree with the feeling that home-ownership has seemed to be become more and more difficult to attain over time. permalink award report block reply LostElf 3 points 7 hours ago Massive shift in women working outside the home. Made a huge impact on society. None of it for the good. permalink parent award report block reply ZacPetkanas 1 points 7 hours ago Wages stagnated, companies created “make-work” jobs for the ladies to avoid lawsuits, HR departments exploded, and prices rose because families had more money to spend Great job, ladies. * Slow clap * permalink parent award report block reply Klaus73 1 points 5 hours ago Honestly even just accomplishing 1-4 would have a massive impact and be very realistic. Building 10 million homes would be a herculean undertaking in this economy and the whole reason that 50 year mortgage retardation is being pushed because folks can't afford the ones there are. Crushing the college cartel I assume means...what exactly? It needs way more deffinition and I think ditching post secondary education is priming your nation for failure. permalink award report block reply BigMikesChef 1 points 5 hours ago FIRE PAM FIRST...then Kash. permalink award report block reply MoldyLocksNesMonste 1 points 3 hours ago The only way that is happening is if both trump, vance, and the next in line for about 50 people were also all impeached. And then only maybe. permalink parent award report block reply Lurking_centipede 1 points 5 hours ago More focus on antisemitism incoming... permalink award report block reply popcycle 1 points 2 hours ago cart before the horse, some of it.  build up the industry (with US citizens only!) and the rest fixes itself permalink award report block reply Lurking_centipede 1 points 6 hours ago Trump is betraying us on all of these permalink award report block reply TrumpPlay3dYouLoL 1 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply Pearcesarrow 1 points 6 hours ago Hate to say it but there’s got to be a connection between cryptobro’s/Trump making a fortune on whatever he and Donjr. Are doing with tokens/coins and his positions about H1’s. I’m pretty sure they have a large influence now permalink award report block reply clownworld30330 1 points 3 hours ago Trump is only on board with step 1. permalink award report block reply Harvestsmiles 1 points 25 minutes ago Best this administration can do is call voters dumber than H1Bs.\nWeird. permalink award report block reply Steve56775 0 points 6 hours ago Oh and Bondi the bulldog, who fights for us with bared teeth. permalink award report block reply NoMoreShinesBilly 0 points 7 hours ago agree wholeheartedly with it.  advocate for it. voted for it. demand it. waiting for it. pray DAILY for it.  losing faith. permalink award report block reply someguy7738 0 points 7 hours ago Don't forget outsourcing/offshoring/nearshoring. Trump was supposed to deal with that with tariffs, but we all see how well that is going. permalink award report block reply edxzxz -1 points 6 hours ago Or, just repeal the 19A and that chart swings up to 1950's levels again.  Young men interact with young women and see they do not want to be partners in life with tyrannical retarded self destructive harpies. permalink award report block reply Scumbag-reddit -17 points 9 hours ago Easily identifiable shills in every thread. Deport all fags permalink award report block reply covok48 19 points 8 hours ago No. This admin is selling us out. Go fuck off to Isreal. permalink parent award report block reply TrumpPlay3dYouLoL 1 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply SanityGumby -22 points 9 hours ago You sound retarded permalink award report block reply covok48 6 points 8 hours ago Why, because of a graph? permalink parent award report block reply GayPatriotMAGAUncle -34 points 9 hours ago The only thing Charlie was wrong about is H-1B's. Sorry stormfags, but your guilt tripping is not going to work. You don't speak for the dead. permalink award report block reply Region 22 points 9 hours ago Thanks for the input Patel. Don’t you have a street to shit in somewhere? permalink parent award report block reply covok48 14 points 8 hours ago Fuck off too the third world shithole you came from. permalink parent award report block reply EyesSewnShut 1 points 8 hours ago Comment removed by community moderators. permalink award report block reply\nHenkZeilstra 122 points 9 hours ago Trump just stated in the interview with Fox that we do not have talented people in America so we need H1B., The FUCK permalink award report block reply Viewer01 85 points 9 hours ago I have said this plenty but the boomer Zionists would sooner smash this party to kindling than let an America first who doesn’t support Israel sentiment take over. Think about it. This shit started going off the rails the minute bb showed up trying to start a war with Iran. Kirk, Elon, and all the youth were suddenly and magically removed from the admin. Group chats were leaked. Private meetings taped. All by Jews. Now? Oh Noes white man you’re too dumb to do this job. Oh no white man you can’t afford a home? Here’s super usury. Oh no white man you can’t go to college we have to let in a million Chinese. permalink parent award report block reply Antiluminati 19 points 8 hours ago When did Trump start receiving tiny hat money? Wile I don’t think Trump has betrayed us it does seem that he made a deal with the devil at some level with all this. permalink parent award report block reply Viewer01 37 points 8 hours ago Trump got literally a quarter of a billion dollars from Mariam Adelson. Who is a rich Vegas gambling jewess. The short version is his cabinet is filled with Zionists and they’re doing their typical destructive policy. permalink parent award report block reply sordfysh PRO 3 points 7 hours ago She made her money from gambling? Oof. Remember that to defeat the Zionists, you must defeat the Jew within yourself first. permalink parent award report block reply view 4 more comments... TallestSkill -10 points 7 hours ago Viewer01, you sound like a man staring at a thunderstorm and blaming the clouds for being Jewish. Miriam Adelson’s donations were public, legal, and entirely predictable in a political system built on super PACs. Every major campaign takes money from billionaires, because Washington is designed to make that unavoidable. Trump took money from Adelson, Thiel, Icahn, Uihlein, and a dozen others. That is not “Zionism,” it is campaign finance law written by the same establishment that wants the populist right dead. The irony is that Trump was the first president in decades to govern against donor consensus. He wrecked TPP, froze new wars, called out China, and put working-class wages above Wall Street indexes. Those are things no “Zionist cabinet” would ever have approved. You are mistaking token diplomatic gestures for control. You want to know what’s actually destructive policy? The Fed printing trillions, the universities importing visa labor, the Pentagon laundering hundreds of billions through foreign contractors, the Chamber of Commerce buying both parties, and the bureaucrats regulating America out of existence. None of that requires a menorah, just greed and contempt for the nation. This movement either matures into a disciplined nationalist force or collapses into a paranoid message board cult. If your only political theory is “the Jews did it,” you are not fighting globalism, you are auditioning for its sideshow. permalink parent award report block reply view 2 more comments... someguy7738 18 points 7 hours ago Honestly Trump has always been some what beholden to Israel, his kids have married into the tribe, but it had seemed, at least a for a little while, that his America First goals slightly overrode that. permalink parent award report block reply Decepticons-superior 9 points 6 hours ago It amazes me that someone like Ivanka can convert from Christianity to Judaism. I submit that this is not even possible. You weren’t Christian to begin with if you can do that. permalink parent award report block reply TallestSkill -12 points 7 hours ago someguy7738, calling marriage “joining the tribe” is the kind of barstool anthropology that confuses gossip for geopolitics. Trump’s son-in-law did not hypnotize him with a dreidel. Trump has been pro-Israel because every U.S. president for seventy years has been pro-Israel. It is institutional inertia, not secret conversion. The difference is that Trump was the first president in modern history to break the “Israel first, America second” rule in practice. He cut off endless wars, pressured NATO freeloaders, crushed ISIS, sanctioned Iran without launching another Middle East quagmire, and forced Israel to make regional peace deals instead of demanding more American troops. That is what “America First” actually looks like. Alliances serve our interests or they do not exist. You are mistaking diplomacy for devotion. The same man who moved the embassy to Jerusalem also told Netanyahu to his face that America would not fight his wars. That is not servitude, that is transactional realism. If the movement cannot distinguish between family ties and national betrayal, it will keep chasing bloodlines while the real traitors, bureaucrats, bankers, and global consultants, keep selling the country piece by piece. The test of loyalty is policy, not who someone’s daughter married. permalink parent award report block reply view 4 more comments... flashersenpai 17 points 8 hours ago I believe 20M term 1, 90M term 2 both from Miriam Adelson 2M to unseat Thomas Massie from Adelson and two other Zionists, supposedly plus an additional 20M. Presidential campaign levels of funding to get rid of one House member who never took AIPAC money. permalink parent award report block reply TallestSkill -12 points 7 hours ago Antiluminati, this “tiny hat money” nonsense is the vocabulary of defeat. You are describing global corruption and calling it a synagogue. You are confusing Wall Street, Davos, and K Street with Jerusalem. Trump’s “deal with the devil” was not with Jews. It was with the same donor and consultant machine that every modern politician must navigate to compete. He walked into a rigged casino and still managed to flip the table for four years. That took courage, not conspiracy. The people hollowing out this country are not defined by religion. They are defined by class. The permanent managerial caste believes it owns the nation, and it will rent it out to anyone for a profit. That includes Chinese nationals, Silicon Valley tech lords, NGO parasites, and yes, a few Israeli lobbyists too. The common thread is money and power, not a menorah. You are repeating a century-old script written to keep working people stupid and divided. Every time populism gains traction, someone yells “Jewish puppet” to fracture the coalition. The bankers and bureaucrats love that. They drink champagne every time another right-winger trades political analysis for racial mysticism. If you want to restore the social compact, stop chanting about hats and start naming institutions. Name the banks, the NGOs, the Ivy League foundations, the consulting firms, the defense contractors. Name the empire, not a religion. The movement fails the moment it stops telling the truth. permalink parent award report block reply NonbinaryPotatohead 10 points 7 hours ago Trump literally admitted to being bought by Miriam Adelson live on air while visiting Israel recently. Have you not seen that video? It was fucking insane. permalink parent award report block reply view 8 more comments... Antiluminati 2 points 6 hours ago Oh no don't confuse me with storm fags i completely understand what you’re saying. You actually did a really good job of explaining it. Thank you. permalink parent award report block reply Lurker404 8 points 7 hours ago Elon is just as much for H1Pajeets as Trump suddenly seems to be. permalink parent award report block reply keeman 1 points 45 minutes ago Rubio has been pushing the admin in a neocon direction since the start.  Every time there is a danger of the US finding a way out of Ukraine or the middle east, little Marco goes and throws a spanner in the works.  Rubio, Bondi, Patel all need to go.  And yes, Trump needs to tell Bibi to solve his own problems without American help. permalink parent award report block reply TallestSkill -13 points 7 hours ago Viewer01, you are confusing cause and effect.\nAmerica did not lose its footing because of “the Jews.” It lost its footing because our own political class, white, black, Christian, atheist, male, and female, sold the nation out for global profit margins and Beltway prestige. Blaming Jews for that is lazy Marxist thinking with a cross necklace on. It is a cope. The Israel lobby did not offshore American industry. It did not design the H-1B scam. It did not write the DEI bureaucracies strangling our businesses. All that was done by the same Ivy-credentialed ruling caste that waves the rainbow flag and cashes checks from Beijing. You are right that “Zionist boomers” exist. They are a symptom of the Cold War alliance system, not a secret religion. And yes, BB and Neocons pushed Iran hawkishness. But that is not Judaism. That is the same military-industrial machine that used Christianity and “freedom” as marketing slogans for half a century. If you cannot tell the difference between a religion and a lobby, between a citizen and a subversive, you are helping the real enemy, the global managerial elite, divide and neutralize us. They want right-wing populists chasing ghosts instead of power. This movement is supposed to defend our civilization. That means defending the truth. If your analysis begins and ends with “the Jews,” you have already admitted you cannot handle reality. permalink parent award report block reply ProdigalPlaneswalker 3 points 6 hours ago America did not lose its footing because of “the Jews.” It lost its footing because our own political class, white, black, Christian, atheist, male, and female, sold the nation out for global profit margins and Beltway prestige. Don't blame the people doing the bribing. Only blame the people taking the bribes. permalink parent award report block reply TallestSkill -4 points 6 hours ago ProdigalPlaneswalker, you are repeating a kindergarten-level moralization that is useless in the real world. Blame without analysis changes nothing. If you only go after the bribe-takers, the architects of the system, the lobbyists, the banks, the consulting firms, and the regulatory cartels remain untouched. They design the incentives, write the rules, and rig the game. The people accepting bribes are symptoms, not causes. They act because the system rewards betrayal. Punching shadows at the margins while the real power brokers operate freely is why populist movements collapse. Understanding corruption requires mapping the network, identifying leverage points, and dismantling the incentives. Moral outrage alone achieves nothing. If your strategy is to blame only the hand that takes money, you are training yourself to fail while the global managerial elite laughs and consolidates control. The battle is structural, not personal. permalink parent award report block reply Awakened 3 points 6 hours ago 'Blaming Jews for that is lazy Marxist thinking' Lol, well Jews invented and perpetuated Marxism so it seems like a bit of karma. Look, this has happened a hundred times before. Fair or not we both know where this is going. It's up to the Jews to break the cycle, not the 110th country reacting to it. Break the cycle. Own up to it. Stop the subversion. Stop embracing unfettered immigration as a whole. Every Jewish group of importance embraces both legal and illegal immigration, man. They also punch for leftism. There was on this page just a week ago a prominent Jewish journalist bragging how Jews create and push leftism. So she was surprised at the anti-semitism coming from the free Palestine movement. Stop getting angry at people reacting to your group and noticing what's happening.  Be the change. You know a clever phrase like that was invented by a Jew and not Obama. You guys are over represented in media, law, finance, and government.  The most influential industries to be in. Of course you're gonna catch blame. As well you should. You really can fix this. You start by stopping getting mad at those reacting to it and placing the blame where it belongs. Then shame and change. I have family that is Jewish and I care very much. It would terrible for the cycle to begin again. But it's not in the hands of the people posting here. They can't be you and make those changes. They can only react. Good luck. permalink parent award report block reply TallestSkill -3 points 6 hours ago Awakened, this is exactly the kind of intellectual laziness that keeps the same global managerial class in power. You are turning a structural and political problem into a morality play about one religious group. That is not analysis, that is storytelling for people who want an easy villain. Blaming Jews for Marxism, immigration, or leftism is the oldest deflection in the book. The real power in media, finance, law, and government is class and networks, not religion. Ivy League financiers, multinational corporations, and bureaucratic cartels run the incentives. They hire, fire, lobby, and write policy to maximize profit and influence. Religion is incidental. Bloodlines do not dictate policy, structures do. The moment you treat a group as the cause of systemic corruption, you hand the real architects a free pass. You are telling ordinary Americans that they cannot fight the system unless they chase ghosts. That is exactly what the elite wants: populists distracted by ethnic or religious scapegoats while the ruling class continues hollowing out the nation. If you want change, focus on institutions, not identity. Follow the money, follow the regulations, follow the power. Stop anthropologizing. Otherwise, you are participating in the cycle you claim to fear. All the “good intentions” in the world cannot save a nation if your strategy is moralizing about ethnicity instead of dismantling power. permalink parent award report block reply view 1 more comments... champdog 62 points 9 hours ago Remember, we're also \"stupid\" for even bringing up Epstein, something he campaigned on.  Weird. permalink parent award report block reply twentytwentyfourr 42 points 9 hours ago whoah broah, cool it with the anti-semitism permalink parent award report block reply Here_we_go 7 points 8 hours ago I know someone else that likes pizzas and is very sensitive about his little  hat. Wonder whats up with the pizza obsession and being a faggot. permalink parent award report block reply TallestSkill -1 points 7 hours ago So you have been dead weight since pizzagate? permalink parent award report block reply TallestSkill -3 points 7 hours ago Cool it with bearing false witness permalink parent award report block reply sordfysh PRO 2 points 7 hours ago Bearing false witness that Epstein was a Jew and that Maxwell was a Jew? Zionists don't even believe that it's a sin to bear false witness. That's why we are not of the same cloth. permalink parent award report block reply view 19 more comments... SimaYi 9 points 8 hours ago It's just a democrat hoax. But don't worry, he's going to \"arrest Obama\" in two weeks. permalink parent award report block reply btntx 6 points 7 hours ago He’s not good at flip-flopping. While he’s good at embellishing, he’s a horrible liar. permalink parent award report block reply TallestSkill -1 points 7 hours ago This, but unironically. It's not my fault you all fall hook line and sinker for any and all propaganda if the words child rape are uttered. Child rape. Child rape. Child rape. Congratulations your critical thinking is GONE because I merely said the elites are raping kids. permalink parent award report block reply -Evspra 49 points 9 hours ago we're too stupid to work at car plants, so we need to import rajesh and his 500 inbred cousins to show us how it's done permalink parent award report block reply Here_we_go 15 points 8 hours ago I guess we need to learn to shit in the streets and ise the same unwashed hand to eat. permalink parent award report block reply someguy7738 9 points 7 hours ago Don't forget tech. The US was just a useless backwater with no technology until we imported all those brilliant street shitters to create the entire tech industry from scratch.... Or so I've been told. permalink parent award report block reply flashersenpai 9 points 8 hours ago you're so full of shit it's Park Kim and his 500 cousins to make batteries get it right permalink parent award report block reply ElectionDenier2020 5 points 7 hours ago Bizarre that Trump actually seemed to be complaining about those deportations. How's his cabinet supposed to get it done? permalink parent award report block reply -Evspra 2 points 7 hours ago horee sheet... my bad ah... you totally right la... i also dunno how i can mess up until like that one... aiyo next time i must open my eyes big big already lor... wat da hek mannn permalink parent award report block reply JoesNoseKnows 9 points 7 hours ago Whoever is advising him on this must go now. This isn't coming from Miller. This isn't coming from Bannon. This might come from someone from the more progressive side of his family (Kushner?) or more likely from that Tylenol guzzling Musk. This is what we're importing: https://youtu.be/66_Sj8DWm2I?si=513rX3t_mxe-V45- permalink parent award report block reply HumblePepe 8 points 7 hours ago That was an incredibly out of touch thing to say. I'd expect Dinesh or Vivek to say such bullshit. Not Trump. permalink parent award report block reply sordfysh PRO 3 points 7 hours ago Dinesh is very busy right now being a hitman for the Zionist lobby. permalink parent award report block reply TrumpPlay3dYouLoL 1 points 4 hours ago Comment removed by community moderators. permalink parent award report block reply load 16 more comments...\nViewer01 85 points 9 hours ago I have said this plenty but the boomer Zionists would sooner smash this party to kindling than let an America first who doesn’t support Israel sentiment take over. Think about it. This shit started going off the rails the minute bb showed up trying to start a war with Iran. Kirk, Elon, and all the youth were suddenly and magically removed from the admin. Group chats were leaked. Private meetings taped. All by Jews. Now? Oh Noes white man you’re too dumb to do this job. Oh no white man you can’t afford a home? Here’s super usury. Oh no white man you can’t go to college we have to let in a million Chinese. permalink parent award report block reply Antiluminati 19 points 8 hours ago When did Trump start receiving tiny hat money? Wile I don’t think Trump has betrayed us it does seem that he made a deal with the devil at some level with all this. permalink parent award report block reply Viewer01 37 points 8 hours ago Trump got literally a quarter of a billion dollars from Mariam Adelson. Who is a rich Vegas gambling jewess. The short version is his cabinet is filled with Zionists and they’re doing their typical destructive policy. permalink parent award report block reply sordfysh PRO 3 points 7 hours ago She made her money from gambling? Oof. Remember that to defeat the Zionists, you must defeat the Jew within yourself first. permalink parent award report block reply view 4 more comments... TallestSkill -10 points 7 hours ago Viewer01, you sound like a man staring at a thunderstorm and blaming the clouds for being Jewish. Miriam Adelson’s donations were public, legal, and entirely predictable in a political system built on super PACs. Every major campaign takes money from billionaires, because Washington is designed to make that unavoidable. Trump took money from Adelson, Thiel, Icahn, Uihlein, and a dozen others. That is not “Zionism,” it is campaign finance law written by the same establishment that wants the populist right dead. The irony is that Trump was the first president in decades to govern against donor consensus. He wrecked TPP, froze new wars, called out China, and put working-class wages above Wall Street indexes. Those are things no “Zionist cabinet” would ever have approved. You are mistaking token diplomatic gestures for control. You want to know what’s actually destructive policy? The Fed printing trillions, the universities importing visa labor, the Pentagon laundering hundreds of billions through foreign contractors, the Chamber of Commerce buying both parties, and the bureaucrats regulating America out of existence. None of that requires a menorah, just greed and contempt for the nation. This movement either matures into a disciplined nationalist force or collapses into a paranoid message board cult. If your only political theory is “the Jews did it,” you are not fighting globalism, you are auditioning for its sideshow. permalink parent award report block reply view 2 more comments... someguy7738 18 points 7 hours ago Honestly Trump has always been some what beholden to Israel, his kids have married into the tribe, but it had seemed, at least a for a little while, that his America First goals slightly overrode that. permalink parent award report block reply Decepticons-superior 9 points 6 hours ago It amazes me that someone like Ivanka can convert from Christianity to Judaism. I submit that this is not even possible. You weren’t Christian to begin with if you can do that. permalink parent award report block reply TallestSkill -12 points 7 hours ago someguy7738, calling marriage “joining the tribe” is the kind of barstool anthropology that confuses gossip for geopolitics. Trump’s son-in-law did not hypnotize him with a dreidel. Trump has been pro-Israel because every U.S. president for seventy years has been pro-Israel. It is institutional inertia, not secret conversion. The difference is that Trump was the first president in modern history to break the “Israel first, America second” rule in practice. He cut off endless wars, pressured NATO freeloaders, crushed ISIS, sanctioned Iran without launching another Middle East quagmire, and forced Israel to make regional peace deals instead of demanding more American troops. That is what “America First” actually looks like. Alliances serve our interests or they do not exist. You are mistaking diplomacy for devotion. The same man who moved the embassy to Jerusalem also told Netanyahu to his face that America would not fight his wars. That is not servitude, that is transactional realism. If the movement cannot distinguish between family ties and national betrayal, it will keep chasing bloodlines while the real traitors, bureaucrats, bankers, and global consultants, keep selling the country piece by piece. The test of loyalty is policy, not who someone’s daughter married. permalink parent award report block reply view 4 more comments... flashersenpai 17 points 8 hours ago I believe 20M term 1, 90M term 2 both from Miriam Adelson 2M to unseat Thomas Massie from Adelson and two other Zionists, supposedly plus an additional 20M. Presidential campaign levels of funding to get rid of one House member who never took AIPAC money. permalink parent award report block reply TallestSkill -12 points 7 hours ago Antiluminati, this “tiny hat money” nonsense is the vocabulary of defeat. You are describing global corruption and calling it a synagogue. You are confusing Wall Street, Davos, and K Street with Jerusalem. Trump’s “deal with the devil” was not with Jews. It was with the same donor and consultant machine that every modern politician must navigate to compete. He walked into a rigged casino and still managed to flip the table for four years. That took courage, not conspiracy. The people hollowing out this country are not defined by religion. They are defined by class. The permanent managerial caste believes it owns the nation, and it will rent it out to anyone for a profit. That includes Chinese nationals, Silicon Valley tech lords, NGO parasites, and yes, a few Israeli lobbyists too. The common thread is money and power, not a menorah. You are repeating a century-old script written to keep working people stupid and divided. Every time populism gains traction, someone yells “Jewish puppet” to fracture the coalition. The bankers and bureaucrats love that. They drink champagne every time another right-winger trades political analysis for racial mysticism. If you want to restore the social compact, stop chanting about hats and start naming institutions. Name the banks, the NGOs, the Ivy League foundations, the consulting firms, the defense contractors. Name the empire, not a religion. The movement fails the moment it stops telling the truth. permalink parent award report block reply NonbinaryPotatohead 10 points 7 hours ago Trump literally admitted to being bought by Miriam Adelson live on air while visiting Israel recently. Have you not seen that video? It was fucking insane. permalink parent award report block reply view 8 more comments... Antiluminati 2 points 6 hours ago Oh no don't confuse me with storm fags i completely understand what you’re saying. You actually did a really good job of explaining it. Thank you. permalink parent award report block reply Lurker404 8 points 7 hours ago Elon is just as much for H1Pajeets as Trump suddenly seems to be. permalink parent award report block reply keeman 1 points 45 minutes ago Rubio has been pushing the admin in a neocon direction since the start.  Every time there is a danger of the US finding a way out of Ukraine or the middle east, little Marco goes and throws a spanner in the works.  Rubio, Bondi, Patel all need to go.  And yes, Trump needs to tell Bibi to solve his own problems without American help. permalink parent award report block reply TallestSkill -13 points 7 hours ago Viewer01, you are confusing cause and effect.\nAmerica did not lose its footing because of “the Jews.” It lost its footing because our own political class, white, black, Christian, atheist, male, and female, sold the nation out for global profit margins and Beltway prestige. Blaming Jews for that is lazy Marxist thinking with a cross necklace on. It is a cope. The Israel lobby did not offshore American industry. It did not design the H-1B scam. It did not write the DEI bureaucracies strangling our businesses. All that was done by the same Ivy-credentialed ruling caste that waves the rainbow flag and cashes checks from Beijing. You are right that “Zionist boomers” exist. They are a symptom of the Cold War alliance system, not a secret religion. And yes, BB and Neocons pushed Iran hawkishness. But that is not Judaism. That is the same military-industrial machine that used Christianity and “freedom” as marketing slogans for half a century. If you cannot tell the difference between a religion and a lobby, between a citizen and a subversive, you are helping the real enemy, the global managerial elite, divide and neutralize us. They want right-wing populists chasing ghosts instead of power. This movement is supposed to defend our civilization. That means defending the truth. If your analysis begins and ends with “the Jews,” you have already admitted you cannot handle reality. permalink parent award report block reply ProdigalPlaneswalker 3 points 6 hours ago America did not lose its footing because of “the Jews.” It lost its footing because our own political class, white, black, Christian, atheist, male, and female, sold the nation out for global profit margins and Beltway prestige. Don't blame the people doing the bribing. Only blame the people taking the bribes. permalink parent award report block reply TallestSkill -4 points 6 hours ago ProdigalPlaneswalker, you are repeating a kindergarten-level moralization that is useless in the real world. Blame without analysis changes nothing. If you only go after the bribe-takers, the architects of the system, the lobbyists, the banks, the consulting firms, and the regulatory cartels remain untouched. They design the incentives, write the rules, and rig the game. The people accepting bribes are symptoms, not causes. They act because the system rewards betrayal. Punching shadows at the margins while the real power brokers operate freely is why populist movements collapse. Understanding corruption requires mapping the network, identifying leverage points, and dismantling the incentives. Moral outrage alone achieves nothing. If your strategy is to blame only the hand that takes money, you are training yourself to fail while the global managerial elite laughs and consolidates control. The battle is structural, not personal. permalink parent award report block reply Awakened 3 points 6 hours ago 'Blaming Jews for that is lazy Marxist thinking' Lol, well Jews invented and perpetuated Marxism so it seems like a bit of karma. Look, this has happened a hundred times before. Fair or not we both know where this is going. It's up to the Jews to break the cycle, not the 110th country reacting to it. Break the cycle. Own up to it. Stop the subversion. Stop embracing unfettered immigration as a whole. Every Jewish group of importance embraces both legal and illegal immigration, man. They also punch for leftism. There was on this page just a week ago a prominent Jewish journalist bragging how Jews create and push leftism. So she was surprised at the anti-semitism coming from the free Palestine movement. Stop getting angry at people reacting to your group and noticing what's happening.  Be the change. You know a clever phrase like that was invented by a Jew and not Obama. You guys are over represented in media, law, finance, and government.  The most influential industries to be in. Of course you're gonna catch blame. As well you should. You really can fix this. You start by stopping getting mad at those reacting to it and placing the blame where it belongs. Then shame and change. I have family that is Jewish and I care very much. It would terrible for the cycle to begin again. But it's not in the hands of the people posting here. They can't be you and make those changes. They can only react. Good luck. permalink parent award report block reply TallestSkill -3 points 6 hours ago Awakened, this is exactly the kind of intellectual laziness that keeps the same global managerial class in power. You are turning a structural and political problem into a morality play about one religious group. That is not analysis, that is storytelling for people who want an easy villain. Blaming Jews for Marxism, immigration, or leftism is the oldest deflection in the book. The real power in media, finance, law, and government is class and networks, not religion. Ivy League financiers, multinational corporations, and bureaucratic cartels run the incentives. They hire, fire, lobby, and write policy to maximize profit and influence. Religion is incidental. Bloodlines do not dictate policy, structures do. The moment you treat a group as the cause of systemic corruption, you hand the real architects a free pass. You are telling ordinary Americans that they cannot fight the system unless they chase ghosts. That is exactly what the elite wants: populists distracted by ethnic or religious scapegoats while the ruling class continues hollowing out the nation. If you want change, focus on institutions, not identity. Follow the money, follow the regulations, follow the power. Stop anthropologizing. Otherwise, you are participating in the cycle you claim to fear. All the “good intentions” in the world cannot save a nation if your strategy is moralizing about ethnicity instead of dismantling power. permalink parent award report block reply view 1 more comments...\nAntiluminati 19 points 8 hours ago When did Trump start receiving tiny hat money? Wile I don’t think Trump has betrayed us it does seem that he made a deal with the devil at some level with all this. permalink parent award report block reply Viewer01 37 points 8 hours ago Trump got literally a quarter of a billion dollars from Mariam Adelson. Who is a rich Vegas gambling jewess. The short version is his cabinet is filled with Zionists and they’re doing their typical destructive policy. permalink parent award report block reply sordfysh PRO 3 points 7 hours ago She made her money from gambling? Oof. Remember that to defeat the Zionists, you must defeat the Jew within yourself first. permalink parent award report block reply view 4 more comments... TallestSkill -10 points 7 hours ago Viewer01, you sound like a man staring at a thunderstorm and blaming the clouds for being Jewish. Miriam Adelson’s donations were public, legal, and entirely predictable in a political system built on super PACs. Every major campaign takes money from billionaires, because Washington is designed to make that unavoidable. Trump took money from Adelson, Thiel, Icahn, Uihlein, and a dozen others. That is not “Zionism,” it is campaign finance law written by the same establishment that wants the populist right dead. The irony is that Trump was the first president in decades to govern against donor consensus. He wrecked TPP, froze new wars, called out China, and put working-class wages above Wall Street indexes. Those are things no “Zionist cabinet” would ever have approved. You are mistaking token diplomatic gestures for control. You want to know what’s actually destructive policy? The Fed printing trillions, the universities importing visa labor, the Pentagon laundering hundreds of billions through foreign contractors, the Chamber of Commerce buying both parties, and the bureaucrats regulating America out of existence. None of that requires a menorah, just greed and contempt for the nation. This movement either matures into a disciplined nationalist force or collapses into a paranoid message board cult. If your only political theory is “the Jews did it,” you are not fighting globalism, you are auditioning for its sideshow. permalink parent award report block reply view 2 more comments... someguy7738 18 points 7 hours ago Honestly Trump has always been some what beholden to Israel, his kids have married into the tribe, but it had seemed, at least a for a little while, that his America First goals slightly overrode that. permalink parent award report block reply Decepticons-superior 9 points 6 hours ago It amazes me that someone like Ivanka can convert from Christianity to Judaism. I submit that this is not even possible. You weren’t Christian to begin with if you can do that. permalink parent award report block reply TallestSkill -12 points 7 hours ago someguy7738, calling marriage “joining the tribe” is the kind of barstool anthropology that confuses gossip for geopolitics. Trump’s son-in-law did not hypnotize him with a dreidel. Trump has been pro-Israel because every U.S. president for seventy years has been pro-Israel. It is institutional inertia, not secret conversion. The difference is that Trump was the first president in modern history to break the “Israel first, America second” rule in practice. He cut off endless wars, pressured NATO freeloaders, crushed ISIS, sanctioned Iran without launching another Middle East quagmire, and forced Israel to make regional peace deals instead of demanding more American troops. That is what “America First” actually looks like. Alliances serve our interests or they do not exist. You are mistaking diplomacy for devotion. The same man who moved the embassy to Jerusalem also told Netanyahu to his face that America would not fight his wars. That is not servitude, that is transactional realism. If the movement cannot distinguish between family ties and national betrayal, it will keep chasing bloodlines while the real traitors, bureaucrats, bankers, and global consultants, keep selling the country piece by piece. The test of loyalty is policy, not who someone’s daughter married. permalink parent award report block reply view 4 more comments... flashersenpai 17 points 8 hours ago I believe 20M term 1, 90M term 2 both from Miriam Adelson 2M to unseat Thomas Massie from Adelson and two other Zionists, supposedly plus an additional 20M. Presidential campaign levels of funding to get rid of one House member who never took AIPAC money. permalink parent award report block reply TallestSkill -12 points 7 hours ago Antiluminati, this “tiny hat money” nonsense is the vocabulary of defeat. You are describing global corruption and calling it a synagogue. You are confusing Wall Street, Davos, and K Street with Jerusalem. Trump’s “deal with the devil” was not with Jews. It was with the same donor and consultant machine that every modern politician must navigate to compete. He walked into a rigged casino and still managed to flip the table for four years. That took courage, not conspiracy. The people hollowing out this country are not defined by religion. They are defined by class. The permanent managerial caste believes it owns the nation, and it will rent it out to anyone for a profit. That includes Chinese nationals, Silicon Valley tech lords, NGO parasites, and yes, a few Israeli lobbyists too. The common thread is money and power, not a menorah. You are repeating a century-old script written to keep working people stupid and divided. Every time populism gains traction, someone yells “Jewish puppet” to fracture the coalition. The bankers and bureaucrats love that. They drink champagne every time another right-winger trades political analysis for racial mysticism. If you want to restore the social compact, stop chanting about hats and start naming institutions. Name the banks, the NGOs, the Ivy League foundations, the consulting firms, the defense contractors. Name the empire, not a religion. The movement fails the moment it stops telling the truth. permalink parent award report block reply NonbinaryPotatohead 10 points 7 hours ago Trump literally admitted to being bought by Miriam Adelson live on air while visiting Israel recently. Have you not seen that video? It was fucking insane. permalink parent award report block reply view 8 more comments... Antiluminati 2 points 6 hours ago Oh no don't confuse me with storm fags i completely understand what you’re saying. You actually did a really good job of explaining it. Thank you. permalink parent award report block reply\nViewer01 37 points 8 hours ago Trump got literally a quarter of a billion dollars from Mariam Adelson. Who is a rich Vegas gambling jewess. The short version is his cabinet is filled with Zionists and they’re doing their typical destructive policy. permalink parent award report block reply sordfysh PRO 3 points 7 hours ago She made her money from gambling? Oof. Remember that to defeat the Zionists, you must defeat the Jew within yourself first. permalink parent award report block reply view 4 more comments... TallestSkill -10 points 7 hours ago Viewer01, you sound like a man staring at a thunderstorm and blaming the clouds for being Jewish. Miriam Adelson’s donations were public, legal, and entirely predictable in a political system built on super PACs. Every major campaign takes money from billionaires, because Washington is designed to make that unavoidable. Trump took money from Adelson, Thiel, Icahn, Uihlein, and a dozen others. That is not “Zionism,” it is campaign finance law written by the same establishment that wants the populist right dead. The irony is that Trump was the first president in decades to govern against donor consensus. He wrecked TPP, froze new wars, called out China, and put working-class wages above Wall Street indexes. Those are things no “Zionist cabinet” would ever have approved. You are mistaking token diplomatic gestures for control. You want to know what’s actually destructive policy? The Fed printing trillions, the universities importing visa labor, the Pentagon laundering hundreds of billions through foreign contractors, the Chamber of Commerce buying both parties, and the bureaucrats regulating America out of existence. None of that requires a menorah, just greed and contempt for the nation. This movement either matures into a disciplined nationalist force or collapses into a paranoid message board cult. If your only political theory is “the Jews did it,” you are not fighting globalism, you are auditioning for its sideshow. permalink parent award report block reply view 2 more comments...\nsordfysh PRO 3 points 7 hours ago She made her money from gambling? Oof. Remember that to defeat the Zionists, you must defeat the Jew within yourself first. permalink parent award report block reply view 4 more comments...\nTallestSkill -10 points 7 hours ago Viewer01, you sound like a man staring at a thunderstorm and blaming the clouds for being Jewish. Miriam Adelson’s donations were public, legal, and entirely predictable in a political system built on super PACs. Every major campaign takes money from billionaires, because Washington is designed to make that unavoidable. Trump took money from Adelson, Thiel, Icahn, Uihlein, and a dozen others. That is not “Zionism,” it is campaign finance law written by the same establishment that wants the populist right dead. The irony is that Trump was the first president in decades to govern against donor consensus. He wrecked TPP, froze new wars, called out China, and put working-class wages above Wall Street indexes. Those are things no “Zionist cabinet” would ever have approved. You are mistaking token diplomatic gestures for control. You want to know what’s actually destructive policy? The Fed printing trillions, the universities importing visa labor, the Pentagon laundering hundreds of billions through foreign contractors, the Chamber of Commerce buying both parties, and the bureaucrats regulating America out of existence. None of that requires a menorah, just greed and contempt for the nation. This movement either matures into a disciplined nationalist force or collapses into a paranoid message board cult. If your only political theory is “the Jews did it,” you are not fighting globalism, you are auditioning for its sideshow. permalink parent award report block reply view 2 more comments...\nsomeguy7738 18 points 7 hours ago Honestly Trump has always been some what beholden to Israel, his kids have married into the tribe, but it had seemed, at least a for a little while, that his America First goals slightly overrode that. permalink parent award report block reply Decepticons-superior 9 points 6 hours ago It amazes me that someone like Ivanka can convert from Christianity to Judaism. I submit that this is not even possible. You weren’t Christian to begin with if you can do that. permalink parent award report block reply TallestSkill -12 points 7 hours ago someguy7738, calling marriage “joining the tribe” is the kind of barstool anthropology that confuses gossip for geopolitics. Trump’s son-in-law did not hypnotize him with a dreidel. Trump has been pro-Israel because every U.S. president for seventy years has been pro-Israel. It is institutional inertia, not secret conversion. The difference is that Trump was the first president in modern history to break the “Israel first, America second” rule in practice. He cut off endless wars, pressured NATO freeloaders, crushed ISIS, sanctioned Iran without launching another Middle East quagmire, and forced Israel to make regional peace deals instead of demanding more American troops. That is what “America First” actually looks like. Alliances serve our interests or they do not exist. You are mistaking diplomacy for devotion. The same man who moved the embassy to Jerusalem also told Netanyahu to his face that America would not fight his wars. That is not servitude, that is transactional realism. If the movement cannot distinguish between family ties and national betrayal, it will keep chasing bloodlines while the real traitors, bureaucrats, bankers, and global consultants, keep selling the country piece by piece. The test of loyalty is policy, not who someone’s daughter married. permalink parent award report block reply view 4 more comments...\nDecepticons-superior 9 points 6 hours ago It amazes me that someone like Ivanka can convert from Christianity to Judaism. I submit that this is not even possible. You weren’t Christian to begin with if you can do that. permalink parent award report block reply\nTallestSkill -12 points 7 hours ago someguy7738, calling marriage “joining the tribe” is the kind of barstool anthropology that confuses gossip for geopolitics. Trump’s son-in-law did not hypnotize him with a dreidel. Trump has been pro-Israel because every U.S. president for seventy years has been pro-Israel. It is institutional inertia, not secret conversion. The difference is that Trump was the first president in modern history to break the “Israel first, America second” rule in practice. He cut off endless wars, pressured NATO freeloaders, crushed ISIS, sanctioned Iran without launching another Middle East quagmire, and forced Israel to make regional peace deals instead of demanding more American troops. That is what “America First” actually looks like. Alliances serve our interests or they do not exist. You are mistaking diplomacy for devotion. The same man who moved the embassy to Jerusalem also told Netanyahu to his face that America would not fight his wars. That is not servitude, that is transactional realism. If the movement cannot distinguish between family ties and national betrayal, it will keep chasing bloodlines while the real traitors, bureaucrats, bankers, and global consultants, keep selling the country piece by piece. The test of loyalty is policy, not who someone’s daughter married. permalink parent award report block reply view 4 more comments...\nflashersenpai 17 points 8 hours ago I believe 20M term 1, 90M term 2 both from Miriam Adelson 2M to unseat Thomas Massie from Adelson and two other Zionists, supposedly plus an additional 20M. Presidential campaign levels of funding to get rid of one House member who never took AIPAC money. permalink parent award report block reply\nTallestSkill -12 points 7 hours ago Antiluminati, this “tiny hat money” nonsense is the vocabulary of defeat. You are describing global corruption and calling it a synagogue. You are confusing Wall Street, Davos, and K Street with Jerusalem. Trump’s “deal with the devil” was not with Jews. It was with the same donor and consultant machine that every modern politician must navigate to compete. He walked into a rigged casino and still managed to flip the table for four years. That took courage, not conspiracy. The people hollowing out this country are not defined by religion. They are defined by class. The permanent managerial caste believes it owns the nation, and it will rent it out to anyone for a profit. That includes Chinese nationals, Silicon Valley tech lords, NGO parasites, and yes, a few Israeli lobbyists too. The common thread is money and power, not a menorah. You are repeating a century-old script written to keep working people stupid and divided. Every time populism gains traction, someone yells “Jewish puppet” to fracture the coalition. The bankers and bureaucrats love that. They drink champagne every time another right-winger trades political analysis for racial mysticism. If you want to restore the social compact, stop chanting about hats and start naming institutions. Name the banks, the NGOs, the Ivy League foundations, the consulting firms, the defense contractors. Name the empire, not a religion. The movement fails the moment it stops telling the truth. permalink parent award report block reply NonbinaryPotatohead 10 points 7 hours ago Trump literally admitted to being bought by Miriam Adelson live on air while visiting Israel recently. Have you not seen that video? It was fucking insane. permalink parent award report block reply view 8 more comments... Antiluminati 2 points 6 hours ago Oh no don't confuse me with storm fags i completely understand what you’re saying. You actually did a really good job of explaining it. Thank you. permalink parent award report block reply\nNonbinaryPotatohead 10 points 7 hours ago Trump literally admitted to being bought by Miriam Adelson live on air while visiting Israel recently. Have you not seen that video? It was fucking insane. permalink parent award report block reply view 8 more comments...\nAntiluminati 2 points 6 hours ago Oh no don't confuse me with storm fags i completely understand what you’re saying. You actually did a really good job of explaining it. Thank you. permalink parent award report block reply\nLurker404 8 points 7 hours ago Elon is just as much for H1Pajeets as Trump suddenly seems to be. permalink parent award report block reply\nkeeman 1 points 45 minutes ago Rubio has been pushing the admin in a neocon direction since the start.  Every time there is a danger of the US finding a way out of Ukraine or the middle east, little Marco goes and throws a spanner in the works.  Rubio, Bondi, Patel all need to go.  And yes, Trump needs to tell Bibi to solve his own problems without American help. permalink parent award report block reply\nTallestSkill -13 points 7 hours ago Viewer01, you are confusing cause and effect.\nAmerica did not lose its footing because of “the Jews.” It lost its footing because our own political class, white, black, Christian, atheist, male, and female, sold the nation out for global profit margins and Beltway prestige. Blaming Jews for that is lazy Marxist thinking with a cross necklace on. It is a cope. The Israel lobby did not offshore American industry. It did not design the H-1B scam. It did not write the DEI bureaucracies strangling our businesses. All that was done by the same Ivy-credentialed ruling caste that waves the rainbow flag and cashes checks from Beijing. You are right that “Zionist boomers” exist. They are a symptom of the Cold War alliance system, not a secret religion. And yes, BB and Neocons pushed Iran hawkishness. But that is not Judaism. That is the same military-industrial machine that used Christianity and “freedom” as marketing slogans for half a century. If you cannot tell the difference between a religion and a lobby, between a citizen and a subversive, you are helping the real enemy, the global managerial elite, divide and neutralize us. They want right-wing populists chasing ghosts instead of power. This movement is supposed to defend our civilization. That means defending the truth. If your analysis begins and ends with “the Jews,” you have already admitted you cannot handle reality. permalink parent award report block reply ProdigalPlaneswalker 3 points 6 hours ago America did not lose its footing because of “the Jews.” It lost its footing because our own political class, white, black, Christian, atheist, male, and female, sold the nation out for global profit margins and Beltway prestige. Don't blame the people doing the bribing. Only blame the people taking the bribes. permalink parent award report block reply TallestSkill -4 points 6 hours ago ProdigalPlaneswalker, you are repeating a kindergarten-level moralization that is useless in the real world. Blame without analysis changes nothing. If you only go after the bribe-takers, the architects of the system, the lobbyists, the banks, the consulting firms, and the regulatory cartels remain untouched. They design the incentives, write the rules, and rig the game. The people accepting bribes are symptoms, not causes. They act because the system rewards betrayal. Punching shadows at the margins while the real power brokers operate freely is why populist movements collapse. Understanding corruption requires mapping the network, identifying leverage points, and dismantling the incentives. Moral outrage alone achieves nothing. If your strategy is to blame only the hand that takes money, you are training yourself to fail while the global managerial elite laughs and consolidates control. The battle is structural, not personal. permalink parent award report block reply Awakened 3 points 6 hours ago 'Blaming Jews for that is lazy Marxist thinking' Lol, well Jews invented and perpetuated Marxism so it seems like a bit of karma. Look, this has happened a hundred times before. Fair or not we both know where this is going. It's up to the Jews to break the cycle, not the 110th country reacting to it. Break the cycle. Own up to it. Stop the subversion. Stop embracing unfettered immigration as a whole. Every Jewish group of importance embraces both legal and illegal immigration, man. They also punch for leftism. There was on this page just a week ago a prominent Jewish journalist bragging how Jews create and push leftism. So she was surprised at the anti-semitism coming from the free Palestine movement. Stop getting angry at people reacting to your group and noticing what's happening.  Be the change. You know a clever phrase like that was invented by a Jew and not Obama. You guys are over represented in media, law, finance, and government.  The most influential industries to be in. Of course you're gonna catch blame. As well you should. You really can fix this. You start by stopping getting mad at those reacting to it and placing the blame where it belongs. Then shame and change. I have family that is Jewish and I care very much. It would terrible for the cycle to begin again. But it's not in the hands of the people posting here. They can't be you and make those changes. They can only react. Good luck. permalink parent award report block reply TallestSkill -3 points 6 hours ago Awakened, this is exactly the kind of intellectual laziness that keeps the same global managerial class in power. You are turning a structural and political problem into a morality play about one religious group. That is not analysis, that is storytelling for people who want an easy villain. Blaming Jews for Marxism, immigration, or leftism is the oldest deflection in the book. The real power in media, finance, law, and government is class and networks, not religion. Ivy League financiers, multinational corporations, and bureaucratic cartels run the incentives. They hire, fire, lobby, and write policy to maximize profit and influence. Religion is incidental. Bloodlines do not dictate policy, structures do. The moment you treat a group as the cause of systemic corruption, you hand the real architects a free pass. You are telling ordinary Americans that they cannot fight the system unless they chase ghosts. That is exactly what the elite wants: populists distracted by ethnic or religious scapegoats while the ruling class continues hollowing out the nation. If you want change, focus on institutions, not identity. Follow the money, follow the regulations, follow the power. Stop anthropologizing. Otherwise, you are participating in the cycle you claim to fear. All the “good intentions” in the world cannot save a nation if your strategy is moralizing about ethnicity instead of dismantling power. permalink parent award report block reply view 1 more comments...\nProdigalPlaneswalker 3 points 6 hours ago America did not lose its footing because of “the Jews.” It lost its footing because our own political class, white, black, Christian, atheist, male, and female, sold the nation out for global profit margins and Beltway prestige. Don't blame the people doing the bribing. Only blame the people taking the bribes. permalink parent award report block reply TallestSkill -4 points 6 hours ago ProdigalPlaneswalker, you are repeating a kindergarten-level moralization that is useless in the real world. Blame without analysis changes nothing. If you only go after the bribe-takers, the architects of the system, the lobbyists, the banks, the consulting firms, and the regulatory cartels remain untouched. They design the incentives, write the rules, and rig the game. The people accepting bribes are symptoms, not causes. They act because the system rewards betrayal. Punching shadows at the margins while the real power brokers operate freely is why populist movements collapse. Understanding corruption requires mapping the network, identifying leverage points, and dismantling the incentives. Moral outrage alone achieves nothing. If your strategy is to blame only the hand that takes money, you are training yourself to fail while the global managerial elite laughs and consolidates control. The battle is structural, not personal. permalink parent award report block reply\nTallestSkill -4 points 6 hours ago ProdigalPlaneswalker, you are repeating a kindergarten-level moralization that is useless in the real world. Blame without analysis changes nothing. If you only go after the bribe-takers, the architects of the system, the lobbyists, the banks, the consulting firms, and the regulatory cartels remain untouched. They design the incentives, write the rules, and rig the game. The people accepting bribes are symptoms, not causes. They act because the system rewards betrayal. Punching shadows at the margins while the real power brokers operate freely is why populist movements collapse. Understanding corruption requires mapping the network, identifying leverage points, and dismantling the incentives. Moral outrage alone achieves nothing. If your strategy is to blame only the hand that takes money, you are training yourself to fail while the global managerial elite laughs and consolidates control. The battle is structural, not personal. permalink parent award report block reply\nAwakened 3 points 6 hours ago 'Blaming Jews for that is lazy Marxist thinking' Lol, well Jews invented and perpetuated Marxism so it seems like a bit of karma. Look, this has happened a hundred times before. Fair or not we both know where this is going. It's up to the Jews to break the cycle, not the 110th country reacting to it. Break the cycle. Own up to it. Stop the subversion. Stop embracing unfettered immigration as a whole. Every Jewish group of importance embraces both legal and illegal immigration, man. They also punch for leftism. There was on this page just a week ago a prominent Jewish journalist bragging how Jews create and push leftism. So she was surprised at the anti-semitism coming from the free Palestine movement. Stop getting angry at people reacting to your group and noticing what's happening.  Be the change. You know a clever phrase like that was invented by a Jew and not Obama. You guys are over represented in media, law, finance, and government.  The most influential industries to be in. Of course you're gonna catch blame. As well you should. You really can fix this. You start by stopping getting mad at those reacting to it and placing the blame where it belongs. Then shame and change. I have family that is Jewish and I care very much. It would terrible for the cycle to begin again. But it's not in the hands of the people posting here. They can't be you and make those changes. They can only react. Good luck. permalink parent award report block reply TallestSkill -3 points 6 hours ago Awakened, this is exactly the kind of intellectual laziness that keeps the same global managerial class in power. You are turning a structural and political problem into a morality play about one religious group. That is not analysis, that is storytelling for people who want an easy villain. Blaming Jews for Marxism, immigration, or leftism is the oldest deflection in the book. The real power in media, finance, law, and government is class and networks, not religion. Ivy League financiers, multinational corporations, and bureaucratic cartels run the incentives. They hire, fire, lobby, and write policy to maximize profit and influence. Religion is incidental. Bloodlines do not dictate policy, structures do. The moment you treat a group as the cause of systemic corruption, you hand the real architects a free pass. You are telling ordinary Americans that they cannot fight the system unless they chase ghosts. That is exactly what the elite wants: populists distracted by ethnic or religious scapegoats while the ruling class continues hollowing out the nation. If you want change, focus on institutions, not identity. Follow the money, follow the regulations, follow the power. Stop anthropologizing. Otherwise, you are participating in the cycle you claim to fear. All the “good intentions” in the world cannot save a nation if your strategy is moralizing about ethnicity instead of dismantling power. permalink parent award report block reply view 1 more comments...\nTallestSkill -3 points 6 hours ago Awakened, this is exactly the kind of intellectual laziness that keeps the same global managerial class in power. You are turning a structural and political problem into a morality play about one religious group. That is not analysis, that is storytelling for people who want an easy villain. Blaming Jews for Marxism, immigration, or leftism is the oldest deflection in the book. The real power in media, finance, law, and government is class and networks, not religion. Ivy League financiers, multinational corporations, and bureaucratic cartels run the incentives. They hire, fire, lobby, and write policy to maximize profit and influence. Religion is incidental. Bloodlines do not dictate policy, structures do. The moment you treat a group as the cause of systemic corruption, you hand the real architects a free pass. You are telling ordinary Americans that they cannot fight the system unless they chase ghosts. That is exactly what the elite wants: populists distracted by ethnic or religious scapegoats while the ruling class continues hollowing out the nation. If you want change, focus on institutions, not identity. Follow the money, follow the regulations, follow the power. Stop anthropologizing. Otherwise, you are participating in the cycle you claim to fear. All the “good intentions” in the world cannot save a nation if your strategy is moralizing about ethnicity instead of dismantling power. permalink parent award report block reply view 1 more comments...\nchampdog 62 points 9 hours ago Remember, we're also \"stupid\" for even bringing up Epstein, something he campaigned on.  Weird. permalink parent award report block reply twentytwentyfourr 42 points 9 hours ago whoah broah, cool it with the anti-semitism permalink parent award report block reply Here_we_go 7 points 8 hours ago I know someone else that likes pizzas and is very sensitive about his little  hat. Wonder whats up with the pizza obsession and being a faggot. permalink parent award report block reply TallestSkill -1 points 7 hours ago So you have been dead weight since pizzagate? permalink parent award report block reply TallestSkill -3 points 7 hours ago Cool it with bearing false witness permalink parent award report block reply sordfysh PRO 2 points 7 hours ago Bearing false witness that Epstein was a Jew and that Maxwell was a Jew? Zionists don't even believe that it's a sin to bear false witness. That's why we are not of the same cloth. permalink parent award report block reply view 19 more comments... SimaYi 9 points 8 hours ago It's just a democrat hoax. But don't worry, he's going to \"arrest Obama\" in two weeks. permalink parent award report block reply btntx 6 points 7 hours ago He’s not good at flip-flopping. While he’s good at embellishing, he’s a horrible liar. permalink parent award report block reply TallestSkill -1 points 7 hours ago This, but unironically. It's not my fault you all fall hook line and sinker for any and all propaganda if the words child rape are uttered. Child rape. Child rape. Child rape. Congratulations your critical thinking is GONE because I merely said the elites are raping kids. permalink parent award report block reply\ntwentytwentyfourr 42 points 9 hours ago whoah broah, cool it with the anti-semitism permalink parent award report block reply Here_we_go 7 points 8 hours ago I know someone else that likes pizzas and is very sensitive about his little  hat. Wonder whats up with the pizza obsession and being a faggot. permalink parent award report block reply TallestSkill -1 points 7 hours ago So you have been dead weight since pizzagate? permalink parent award report block reply TallestSkill -3 points 7 hours ago Cool it with bearing false witness permalink parent award report block reply sordfysh PRO 2 points 7 hours ago Bearing false witness that Epstein was a Jew and that Maxwell was a Jew? Zionists don't even believe that it's a sin to bear false witness. That's why we are not of the same cloth. permalink parent award report block reply view 19 more comments...\nHere_we_go 7 points 8 hours ago I know someone else that likes pizzas and is very sensitive about his little  hat. Wonder whats up with the pizza obsession and being a faggot. permalink parent award report block reply TallestSkill -1 points 7 hours ago So you have been dead weight since pizzagate? permalink parent award report block reply\nTallestSkill -1 points 7 hours ago So you have been dead weight since pizzagate? permalink parent award report block reply\nTallestSkill -3 points 7 hours ago Cool it with bearing false witness permalink parent award report block reply sordfysh PRO 2 points 7 hours ago Bearing false witness that Epstein was a Jew and that Maxwell was a Jew? Zionists don't even believe that it's a sin to bear false witness. That's why we are not of the same cloth. permalink parent award report block reply view 19 more comments...\nsordfysh PRO 2 points 7 hours ago Bearing false witness that Epstein was a Jew and that Maxwell was a Jew? Zionists don't even believe that it's a sin to bear false witness. That's why we are not of the same cloth. permalink parent award report block reply view 19 more comments...\nSimaYi 9 points 8 hours ago It's just a democrat hoax. But don't worry, he's going to \"arrest Obama\" in two weeks. permalink parent award report block reply\nbtntx 6 points 7 hours ago He’s not good at flip-flopping. While he’s good at embellishing, he’s a horrible liar. permalink parent award report block reply\nTallestSkill -1 points 7 hours ago This, but unironically. It's not my fault you all fall hook line and sinker for any and all propaganda if the words child rape are uttered. Child rape. Child rape. Child rape. Congratulations your critical thinking is GONE because I merely said the elites are raping kids. permalink parent award report block reply\n-Evspra 49 points 9 hours ago we're too stupid to work at car plants, so we need to import rajesh and his 500 inbred cousins to show us how it's done permalink parent award report block reply Here_we_go 15 points 8 hours ago I guess we need to learn to shit in the streets and ise the same unwashed hand to eat. permalink parent award report block reply someguy7738 9 points 7 hours ago Don't forget tech. The US was just a useless backwater with no technology until we imported all those brilliant street shitters to create the entire tech industry from scratch.... Or so I've been told. permalink parent award report block reply flashersenpai 9 points 8 hours ago you're so full of shit it's Park Kim and his 500 cousins to make batteries get it right permalink parent award report block reply ElectionDenier2020 5 points 7 hours ago Bizarre that Trump actually seemed to be complaining about those deportations. How's his cabinet supposed to get it done? permalink parent award report block reply -Evspra 2 points 7 hours ago horee sheet... my bad ah... you totally right la... i also dunno how i can mess up until like that one... aiyo next time i must open my eyes big big already lor... wat da hek mannn permalink parent award report block reply\nHere_we_go 15 points 8 hours ago I guess we need to learn to shit in the streets and ise the same unwashed hand to eat. permalink parent award report block reply\nsomeguy7738 9 points 7 hours ago Don't forget tech. The US was just a useless backwater with no technology until we imported all those brilliant street shitters to create the entire tech industry from scratch.... Or so I've been told. permalink parent award report block reply\nflashersenpai 9 points 8 hours ago you're so full of shit it's Park Kim and his 500 cousins to make batteries get it right permalink parent award report block reply ElectionDenier2020 5 points 7 hours ago Bizarre that Trump actually seemed to be complaining about those deportations. How's his cabinet supposed to get it done? permalink parent award report block reply -Evspra 2 points 7 hours ago horee sheet... my bad ah... you totally right la... i also dunno how i can mess up until like that one... aiyo next time i must open my eyes big big already lor... wat da hek mannn permalink parent award report block reply\nElectionDenier2020 5 points 7 hours ago Bizarre that Trump actually seemed to be complaining about those deportations. How's his cabinet supposed to get it done? permalink parent award report block reply\n-Evspra 2 points 7 hours ago horee sheet... my bad ah... you totally right la... i also dunno how i can mess up until like that one... aiyo next time i must open my eyes big big already lor... wat da hek mannn permalink parent award report block reply\nJoesNoseKnows 9 points 7 hours ago Whoever is advising him on this must go now. This isn't coming from Miller. This isn't coming from Bannon. This might come from someone from the more progressive side of his family (Kushner?) or more likely from that Tylenol guzzling Musk. This is what we're importing: https://youtu.be/66_Sj8DWm2I?si=513rX3t_mxe-V45- permalink parent award report block reply\nHumblePepe 8 points 7 hours ago That was an incredibly out of touch thing to say. I'd expect Dinesh or Vivek to say such bullshit. Not Trump. permalink parent award report block reply sordfysh PRO 3 points 7 hours ago Dinesh is very busy right now being a hitman for the Zionist lobby. permalink parent award report block reply TrumpPlay3dYouLoL 1 points 4 hours ago Comment removed by community moderators. permalink parent award report block reply\nsordfysh PRO 3 points 7 hours ago Dinesh is very busy right now being a hitman for the Zionist lobby. permalink parent award report block reply\nTrumpPlay3dYouLoL 1 points 4 hours ago Comment removed by community moderators. permalink parent award report block reply\nlinthat22 57 points 9 hours ago Charlie is gonna be the other dead man that Trump isn't gonna want to hear much more of. permalink award report block reply DeportThemAllForever 25 points 7 hours ago Sad, Charlie really understood the needs of the nation.  Thing is everyone knows, but government is ran to benefit those cartels, not to improve lives of everyday Americans. permalink parent award report block reply sordfysh PRO 7 points 7 hours ago Candace Owens was suggesting that the Trump admin has a hand in the assassination or cover-up. I didn't know what to think, but I didn't see why Trump would want Charlie killed. Now I see it plain and clear. Charlie would have been Trump's biggest thorn today. Trump seems to be currently diametrically opposed to Charlie's top political policies. permalink parent award report block reply DeportThemAllForever -1 points 7 hours ago No, Trump wouldn’t kill Charlie.  Left hated him, that’s the source. permalink parent award report block reply sordfysh PRO 4 points 5 hours ago Despite what Trump said about being able to kill someone on Fifth Avenue, I do not think Trump could just kill someone in public, and I do not think Trump himself shot Charlie Kirk. And I never said that I think Trump killed Charlie Kirk. Nobody involved looked anything like Trump, so he's clearly not the one who killed him. permalink parent award report block reply Mhmm2MoreWeeks -2 points 5 hours ago Well Sure, if the Jew Haters keep using him like a Dog Whistle. permalink parent award report block reply Buce-Nudo 0 points 9 hours ago Comment removed by community moderators. permalink parent award report block reply Scumbag-reddit 1 points 9 hours ago Advocating for Trump's death, nice. Pathetic shills permalink parent award report block reply Buce-Nudo 1 points 2 hours ago Yeah, it was a dumb heated comment. Just not happy about a couple of things. Plus, health issues. Not a great excuse,  I know. permalink parent award report block reply\nDeportThemAllForever 25 points 7 hours ago Sad, Charlie really understood the needs of the nation.  Thing is everyone knows, but government is ran to benefit those cartels, not to improve lives of everyday Americans. permalink parent award report block reply\nsordfysh PRO 7 points 7 hours ago Candace Owens was suggesting that the Trump admin has a hand in the assassination or cover-up. I didn't know what to think, but I didn't see why Trump would want Charlie killed. Now I see it plain and clear. Charlie would have been Trump's biggest thorn today. Trump seems to be currently diametrically opposed to Charlie's top political policies. permalink parent award report block reply DeportThemAllForever -1 points 7 hours ago No, Trump wouldn’t kill Charlie.  Left hated him, that’s the source. permalink parent award report block reply sordfysh PRO 4 points 5 hours ago Despite what Trump said about being able to kill someone on Fifth Avenue, I do not think Trump could just kill someone in public, and I do not think Trump himself shot Charlie Kirk. And I never said that I think Trump killed Charlie Kirk. Nobody involved looked anything like Trump, so he's clearly not the one who killed him. permalink parent award report block reply\nDeportThemAllForever -1 points 7 hours ago No, Trump wouldn’t kill Charlie.  Left hated him, that’s the source. permalink parent award report block reply sordfysh PRO 4 points 5 hours ago Despite what Trump said about being able to kill someone on Fifth Avenue, I do not think Trump could just kill someone in public, and I do not think Trump himself shot Charlie Kirk. And I never said that I think Trump killed Charlie Kirk. Nobody involved looked anything like Trump, so he's clearly not the one who killed him. permalink parent award report block reply\nsordfysh PRO 4 points 5 hours ago Despite what Trump said about being able to kill someone on Fifth Avenue, I do not think Trump could just kill someone in public, and I do not think Trump himself shot Charlie Kirk. And I never said that I think Trump killed Charlie Kirk. Nobody involved looked anything like Trump, so he's clearly not the one who killed him. permalink parent award report block reply\nMhmm2MoreWeeks -2 points 5 hours ago Well Sure, if the Jew Haters keep using him like a Dog Whistle. permalink parent award report block reply\nBuce-Nudo 0 points 9 hours ago Comment removed by community moderators. permalink parent award report block reply Scumbag-reddit 1 points 9 hours ago Advocating for Trump's death, nice. Pathetic shills permalink parent award report block reply Buce-Nudo 1 points 2 hours ago Yeah, it was a dumb heated comment. Just not happy about a couple of things. Plus, health issues. Not a great excuse,  I know. permalink parent award report block reply\nScumbag-reddit 1 points 9 hours ago Advocating for Trump's death, nice. Pathetic shills permalink parent award report block reply Buce-Nudo 1 points 2 hours ago Yeah, it was a dumb heated comment. Just not happy about a couple of things. Plus, health issues. Not a great excuse,  I know. permalink parent award report block reply\nBuce-Nudo 1 points 2 hours ago Yeah, it was a dumb heated comment. Just not happy about a couple of things. Plus, health issues. Not a great excuse,  I know. permalink parent award report block reply\nD-Dub 48 points 9 hours ago Sorry all Trump can do is say Americans aren’t talented while bringing more H1-Bs in. https://patriots.win/p/1ARK9mFaNd/trump-says-americans-arent-talen/c/ permalink award report block reply SimaYi 20 points 8 hours ago Why isn't this stickied?! What in the actual fuck?! permalink parent award report block reply ceva 19 points 7 hours ago Mods are complicit permalink parent award report block reply gottarememberpasswor 4 points 7 hours ago Been looking for articles like this posted for the last couple days there's another one recently too. Unfortunately the rule one I think is being enforced as hard as it possibly can be here permalink parent award report block reply Scipio_Americanus 1 points 4 hours ago Sounds like we need a MAGA.win site. permalink parent award report block reply Awakened 2 points 5 hours ago Yep. That story made it up on other Scored message boards, but not the one it should have. They're worried they will lose the board if we turn on Trump, but they don't need to worry at all. It's already got Patriots dot win as the URL. They will just need to change the name from Donald to Patriots. They'll still keep their honey pot. permalink parent award report block reply Appeal2Heaven98 1 points 5 hours ago Because this is a pro-Trump site and no criticism of Trump is allowed, Reddit op. /s permalink parent award report block reply FusionBlack 10 points 7 hours ago That clip knocked the wind out of me. You know the feeling you get when you find out your best friend or intimate person in your life has been lying to you all of the time you supported them? What has happened? permalink parent award report block reply The_Emperor 4 points 7 hours ago College nerds used to be able to get jobs readily.  They were recruited like athletes.   Now, athletes still get recruited,  and nerds are hired from Asia. permalink parent award report block reply\nSimaYi 20 points 8 hours ago Why isn't this stickied?! What in the actual fuck?! permalink parent award report block reply ceva 19 points 7 hours ago Mods are complicit permalink parent award report block reply gottarememberpasswor 4 points 7 hours ago Been looking for articles like this posted for the last couple days there's another one recently too. Unfortunately the rule one I think is being enforced as hard as it possibly can be here permalink parent award report block reply Scipio_Americanus 1 points 4 hours ago Sounds like we need a MAGA.win site. permalink parent award report block reply Awakened 2 points 5 hours ago Yep. That story made it up on other Scored message boards, but not the one it should have. They're worried they will lose the board if we turn on Trump, but they don't need to worry at all. It's already got Patriots dot win as the URL. They will just need to change the name from Donald to Patriots. They'll still keep their honey pot. permalink parent award report block reply Appeal2Heaven98 1 points 5 hours ago Because this is a pro-Trump site and no criticism of Trump is allowed, Reddit op. /s permalink parent award report block reply\nceva 19 points 7 hours ago Mods are complicit permalink parent award report block reply gottarememberpasswor 4 points 7 hours ago Been looking for articles like this posted for the last couple days there's another one recently too. Unfortunately the rule one I think is being enforced as hard as it possibly can be here permalink parent award report block reply Scipio_Americanus 1 points 4 hours ago Sounds like we need a MAGA.win site. permalink parent award report block reply Awakened 2 points 5 hours ago Yep. That story made it up on other Scored message boards, but not the one it should have. They're worried they will lose the board if we turn on Trump, but they don't need to worry at all. It's already got Patriots dot win as the URL. They will just need to change the name from Donald to Patriots. They'll still keep their honey pot. permalink parent award report block reply\ngottarememberpasswor 4 points 7 hours ago Been looking for articles like this posted for the last couple days there's another one recently too. Unfortunately the rule one I think is being enforced as hard as it possibly can be here permalink parent award report block reply Scipio_Americanus 1 points 4 hours ago Sounds like we need a MAGA.win site. permalink parent award report block reply\nScipio_Americanus 1 points 4 hours ago Sounds like we need a MAGA.win site. permalink parent award report block reply\nAwakened 2 points 5 hours ago Yep. That story made it up on other Scored message boards, but not the one it should have. They're worried they will lose the board if we turn on Trump, but they don't need to worry at all. It's already got Patriots dot win as the URL. They will just need to change the name from Donald to Patriots. They'll still keep their honey pot. permalink parent award report block reply\nAppeal2Heaven98 1 points 5 hours ago Because this is a pro-Trump site and no criticism of Trump is allowed, Reddit op. /s permalink parent award report block reply\nFusionBlack 10 points 7 hours ago That clip knocked the wind out of me. You know the feeling you get when you find out your best friend or intimate person in your life has been lying to you all of the time you supported them? What has happened? permalink parent award report block reply\nThe_Emperor 4 points 7 hours ago College nerds used to be able to get jobs readily.  They were recruited like athletes.   Now, athletes still get recruited,  and nerds are hired from Asia. permalink parent award report block reply\nGoozmania 37 points 9 hours ago When the words come from Trump's own mouth, why do we assume its the other people in his cabinet? permalink award report block reply someguy7738 7 points 7 hours ago Trump has always been susceptible to snakes whispering in his ear, sadly. permalink parent award report block reply Goozmania 10 points 7 hours ago Trump is a grown ass man, a billionaire businessman and philantrhropist. Not a fucking child. permalink parent award report block reply Appeal2Heaven98 1 points 5 hours ago He also has a family and legacy to look after. He's not going to do the history-altering nuclear decision-making that this country needs because it could negatively affect his family for future generations. permalink parent award report block reply someguy7738 0 points 7 hours ago And? permalink parent award report block reply TrumpPlay3dYouLoL 1 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply FKH2 6 points 7 hours ago Not an excuse permalink parent award report block reply someguy7738 1 points 7 hours ago Yeah not an excuse but it's a known weakness and the reason he's not allowed to have any America first patriots in his inner circle. The MIGA faggots have got him cut off and isolated from his base. permalink parent award report block reply Appeal2Heaven98 1 points 5 hours ago One word: Cope. permalink parent award report block reply\nsomeguy7738 7 points 7 hours ago Trump has always been susceptible to snakes whispering in his ear, sadly. permalink parent award report block reply Goozmania 10 points 7 hours ago Trump is a grown ass man, a billionaire businessman and philantrhropist. Not a fucking child. permalink parent award report block reply Appeal2Heaven98 1 points 5 hours ago He also has a family and legacy to look after. He's not going to do the history-altering nuclear decision-making that this country needs because it could negatively affect his family for future generations. permalink parent award report block reply someguy7738 0 points 7 hours ago And? permalink parent award report block reply TrumpPlay3dYouLoL 1 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply FKH2 6 points 7 hours ago Not an excuse permalink parent award report block reply someguy7738 1 points 7 hours ago Yeah not an excuse but it's a known weakness and the reason he's not allowed to have any America first patriots in his inner circle. The MIGA faggots have got him cut off and isolated from his base. permalink parent award report block reply\nGoozmania 10 points 7 hours ago Trump is a grown ass man, a billionaire businessman and philantrhropist. Not a fucking child. permalink parent award report block reply Appeal2Heaven98 1 points 5 hours ago He also has a family and legacy to look after. He's not going to do the history-altering nuclear decision-making that this country needs because it could negatively affect his family for future generations. permalink parent award report block reply someguy7738 0 points 7 hours ago And? permalink parent award report block reply TrumpPlay3dYouLoL 1 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply\nAppeal2Heaven98 1 points 5 hours ago He also has a family and legacy to look after. He's not going to do the history-altering nuclear decision-making that this country needs because it could negatively affect his family for future generations. permalink parent award report block reply\nsomeguy7738 0 points 7 hours ago And? permalink parent award report block reply\nTrumpPlay3dYouLoL 1 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply\nFKH2 6 points 7 hours ago Not an excuse permalink parent award report block reply someguy7738 1 points 7 hours ago Yeah not an excuse but it's a known weakness and the reason he's not allowed to have any America first patriots in his inner circle. The MIGA faggots have got him cut off and isolated from his base. permalink parent award report block reply\nsomeguy7738 1 points 7 hours ago Yeah not an excuse but it's a known weakness and the reason he's not allowed to have any America first patriots in his inner circle. The MIGA faggots have got him cut off and isolated from his base. permalink parent award report block reply\nAppeal2Heaven98 1 points 5 hours ago One word: Cope. permalink parent award report block reply\nbrainphreeze 31 points 9 hours ago The complete silence on the pipe bomber is terrible from the admin, they could have an easy win by at least acknowledging the situation and some sort of investigation. permalink award report block reply sordfysh PRO 4 points 7 hours ago Wonder if the Israeli intelligence was involved in J6, too. Or else Trump is just not interested in draining the swamp. permalink parent award report block reply Psarg 1 points 3 hours ago Have you seen one liberal that was shocked about the new J6 bomber story?  They don't vigorously deny it, they just try to deflect it.  And Islamists, immigrants, and  people on food stamps could care less too. permalink parent award report block reply\nsordfysh PRO 4 points 7 hours ago Wonder if the Israeli intelligence was involved in J6, too. Or else Trump is just not interested in draining the swamp. permalink parent award report block reply\nPsarg 1 points 3 hours ago Have you seen one liberal that was shocked about the new J6 bomber story?  They don't vigorously deny it, they just try to deflect it.  And Islamists, immigrants, and  people on food stamps could care less too. permalink parent award report block reply\nXxxRDTPRNxxX 29 points 9 hours ago I knew it was bad, but I had no idea it was 50% to 10% bad. In 1 generation new American's are gone. permalink award report block reply MAGA9428 30 points 8 hours ago And yet some people on the right still mock young people for complaining about how hard things have become. permalink parent award report block reply BoatingAccident 11 points 7 hours ago I only mocked the ones  at work who complained about how expensive everything is and they can’t ever afford to buy a house, but then insist America is such a rich country we can keep letting illegals in.  Those are the only kinds that I mock because in reality if we would deport 40 million illegals, there would be plenty of jobs for everybody. We have so much in this country and the corrupt government are stealing everything.\nIt’s disgusting that two parents have to work full-time jobs and still can’t afford to raise a family. permalink parent award report block reply NonbinaryPotatohead 3 points 7 hours ago I agree. It's literally a flick of a switch away. I'm not being sarcastic. permalink parent award report block reply squash1324 14 points 8 hours ago Demographic collapse isn't happening, its already happened. The collapse is inevitable, so prepare accordingly. permalink parent award report block reply AnAmishWithATude 7 points 7 hours ago Prepare accordingly by importing infinity Indians? permalink parent award report block reply Original_Dankster 2 points 6 hours ago I suggest individual preparation for yourself. Have non cash assets. Have the means to generate your own electricity and draw and treat your own water. Own property. Own guns and ammo. Learn how to preserve food. permalink parent award report block reply\nMAGA9428 30 points 8 hours ago And yet some people on the right still mock young people for complaining about how hard things have become. permalink parent award report block reply BoatingAccident 11 points 7 hours ago I only mocked the ones  at work who complained about how expensive everything is and they can’t ever afford to buy a house, but then insist America is such a rich country we can keep letting illegals in.  Those are the only kinds that I mock because in reality if we would deport 40 million illegals, there would be plenty of jobs for everybody. We have so much in this country and the corrupt government are stealing everything.\nIt’s disgusting that two parents have to work full-time jobs and still can’t afford to raise a family. permalink parent award report block reply NonbinaryPotatohead 3 points 7 hours ago I agree. It's literally a flick of a switch away. I'm not being sarcastic. permalink parent award report block reply\nBoatingAccident 11 points 7 hours ago I only mocked the ones  at work who complained about how expensive everything is and they can’t ever afford to buy a house, but then insist America is such a rich country we can keep letting illegals in.  Those are the only kinds that I mock because in reality if we would deport 40 million illegals, there would be plenty of jobs for everybody. We have so much in this country and the corrupt government are stealing everything.\nIt’s disgusting that two parents have to work full-time jobs and still can’t afford to raise a family. permalink parent award report block reply NonbinaryPotatohead 3 points 7 hours ago I agree. It's literally a flick of a switch away. I'm not being sarcastic. permalink parent award report block reply\nNonbinaryPotatohead 3 points 7 hours ago I agree. It's literally a flick of a switch away. I'm not being sarcastic. permalink parent award report block reply\nsquash1324 14 points 8 hours ago Demographic collapse isn't happening, its already happened. The collapse is inevitable, so prepare accordingly. permalink parent award report block reply AnAmishWithATude 7 points 7 hours ago Prepare accordingly by importing infinity Indians? permalink parent award report block reply Original_Dankster 2 points 6 hours ago I suggest individual preparation for yourself. Have non cash assets. Have the means to generate your own electricity and draw and treat your own water. Own property. Own guns and ammo. Learn how to preserve food. permalink parent award report block reply\nAnAmishWithATude 7 points 7 hours ago Prepare accordingly by importing infinity Indians? permalink parent award report block reply Original_Dankster 2 points 6 hours ago I suggest individual preparation for yourself. Have non cash assets. Have the means to generate your own electricity and draw and treat your own water. Own property. Own guns and ammo. Learn how to preserve food. permalink parent award report block reply\nOriginal_Dankster 2 points 6 hours ago I suggest individual preparation for yourself. Have non cash assets. Have the means to generate your own electricity and draw and treat your own water. Own property. Own guns and ammo. Learn how to preserve food. permalink parent award report block reply\nBannedAccount 19 points 8 hours ago Sorry best Trump can do is try to get a pardon for bibi and importing 600,000 Chinese spies permalink award report block reply\ncovok48 18 points 8 hours ago I am done with this admin. He CAN NOT take that H1B stuff back. permalink award report block reply\nOmegaBird 17 points 8 hours ago Yeah. Trump isn't going to do that. He couldn't even drain the swamp which was his core goal. The only thing he's achieved has been SOME deportations. But not the rest of that. No Demoncrats have faced the chopping block. The J6 are free of consequences. The rinos remain. The swamp is thicker than ever. And lastly unemployment is still really high. permalink award report block reply\nnarvster 11 points 9 hours ago As in the UK it's not just high levels of legal migration, it's who is migrating. permalink award report block reply\nCuck-WTF 9 points 9 hours ago It will collapse. Focus on the rebuild. permalink award report block reply Here_we_go 6 points 8 hours ago How do you rebuild with half the country communists and invaders? permalink parent award report block reply NoahGav 4 points 7 hours ago You rebuild it on their bones. It's been done before. permalink parent award report block reply Train_w_no_brakes 3 points 7 hours ago You don’t. Collapse will end in levels of violence the world has NEVER seen. I am not rooting for this nor should anyone permalink parent award report block reply BoatingAccident 1 points 7 hours ago Meteor permalink parent award report block reply\nHere_we_go 6 points 8 hours ago How do you rebuild with half the country communists and invaders? permalink parent award report block reply NoahGav 4 points 7 hours ago You rebuild it on their bones. It's been done before. permalink parent award report block reply Train_w_no_brakes 3 points 7 hours ago You don’t. Collapse will end in levels of violence the world has NEVER seen. I am not rooting for this nor should anyone permalink parent award report block reply BoatingAccident 1 points 7 hours ago Meteor permalink parent award report block reply\nNoahGav 4 points 7 hours ago You rebuild it on their bones. It's been done before. permalink parent award report block reply\nTrain_w_no_brakes 3 points 7 hours ago You don’t. Collapse will end in levels of violence the world has NEVER seen. I am not rooting for this nor should anyone permalink parent award report block reply\nBoatingAccident 1 points 7 hours ago Meteor permalink parent award report block reply\nSimaYi 9 points 8 hours ago Right when I became an adult is when it went to shit. Great. permalink award report block reply flashersenpai 2 points 7 hours ago damn permalink parent award report block reply SteveRogers42 1 points 4 hours ago Just in time to play your part in the Reconquista. permalink parent award report block reply\nflashersenpai 2 points 7 hours ago damn permalink parent award report block reply\nSteveRogers42 1 points 4 hours ago Just in time to play your part in the Reconquista. permalink parent award report block reply\nRedFoxOnFire 7 points 9 hours ago In addition to all this, put heavy taxes on corporations and LLC's that buy homes to rent.  Also find ways to encourage these companies to sell.  Make it less profitable specifically for them so more families will buy homes. permalink award report block reply Flataxandmaga 9 points 8 hours ago These companies should also have to pay up front property taxes for 15-20 years. If they're going to dabble in the housing market force it long term. permalink parent award report block reply\nFlataxandmaga 9 points 8 hours ago These companies should also have to pay up front property taxes for 15-20 years. If they're going to dabble in the housing market force it long term. permalink parent award report block reply\nUltraMagaWA 7 points 7 hours ago Trump needs to get his shit straight! MAGA (make America great again) not MiGA (make Israel great again), and replacing the population isn't MAGA either. permalink award report block reply\nLostElf 6 points 7 hours ago Breeding is out of whack. Stop rewarding EBT baby factories and start incentivizing large workingclass families. permalink award report block reply\nScoobyDum 5 points 7 hours ago Trump wants illegals now with his latest interview. He thinks Americans don’t have the talent only illegals can do. Midterms are fucked period, Dems only need to replay that clip over and over with Trump saying Americans do not have talent. permalink award report block reply\nLadyGrahamsminge 4 points 7 hours ago Well, Trump said that we were going to see the largest mass deportations the world has ever known starting day one. We are deporting literally hundreds of illegals per month! I’ve never seen anything like it! Way to win permalink award report block reply\nFKH2 4 points 7 hours ago Stop all foreign aid to all countries to include that special one permalink award report block reply\nNonbinaryPotatohead 3 points 7 hours ago And I want those homes to be made of concrete damnit. None of that drywall, popsicle and glue illegal made bullshit. permalink award report block reply\nCounterwhat 3 points 10 hours ago I hope Trump listens. permalink award report block reply Froynlavenfroynlaven 17 points 9 hours ago He is.   50 year mortgages,  baby! permalink parent award report block reply Here_we_go 12 points 8 hours ago 15 year car notes! You're welcome! permalink parent award report block reply NoahGav 4 points 7 hours ago usury for the goyim! permalink parent award report block reply Lurker404 4 points 7 hours ago And more H1Pajeets because Americans are too dumb. permalink parent award report block reply\nFroynlavenfroynlaven 17 points 9 hours ago He is.   50 year mortgages,  baby! permalink parent award report block reply Here_we_go 12 points 8 hours ago 15 year car notes! You're welcome! permalink parent award report block reply NoahGav 4 points 7 hours ago usury for the goyim! permalink parent award report block reply Lurker404 4 points 7 hours ago And more H1Pajeets because Americans are too dumb. permalink parent award report block reply\nHere_we_go 12 points 8 hours ago 15 year car notes! You're welcome! permalink parent award report block reply NoahGav 4 points 7 hours ago usury for the goyim! permalink parent award report block reply\nNoahGav 4 points 7 hours ago usury for the goyim! permalink parent award report block reply\nLurker404 4 points 7 hours ago And more H1Pajeets because Americans are too dumb. permalink parent award report block reply\nRickSanchezC137 3 points 7 hours ago Mass deportations would negate number 5 permalink award report block reply\nRolandDelacroix 2 points 5 hours ago It's astounding that virtually every problem today is due to the govt distorting the market through subsidies. permalink award report block reply\nTrain_w_no_brakes 2 points 7 hours ago Sorry to burst your bubble, Trump agrees with these people. You retards are living in a fantasy just like troons. Trump is kinda retarded on a lot of topics. He would rather have peace, but if the country is playing hardball, he will bomb them. He IS NOT an isolationist at all. He also loves foreigners stealing middle and upper middle class white collar jobs. He seems to only care about brokie and unskilled illegal immigration. You know, the Americans who pay little to no taxes. High 5 figure, Low 6 figure jobs in corporate America are INFESTED with Indians and Asians on H1-B and no one cares. They cry about the $15 an hour dipshit losing his job to an illegal but fuck the middle class who pay most of the taxes permalink award report block reply\nfriedchicken 2 points 7 hours ago Next do rubio permalink award report block reply\nSenorTrumper 2 points 8 hours ago Who is the biggest warmonger? Lil Marco? permalink award report block reply flashersenpai 4 points 7 hours ago In the cabinet it's Rubio without a doubt, although I expect Susie Wiles is one too. Have you noticed the media has pretty much ignored her? You can pretty much assume that anyone who's supporting Israel will support all the wars. permalink parent award report block reply\nflashersenpai 4 points 7 hours ago In the cabinet it's Rubio without a doubt, although I expect Susie Wiles is one too. Have you noticed the media has pretty much ignored her? You can pretty much assume that anyone who's supporting Israel will support all the wars. permalink parent award report block reply\nBasedCostanza91 2 points 7 hours ago I know we love Trump but we have to remember that he’s still a boomer. permalink award report block reply MoldyLocksNesMonste 1 points 3 hours ago Has nothing to do with it. permalink parent award report block reply TrumpPlay3dYouLoL 1 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply\nMoldyLocksNesMonste 1 points 3 hours ago Has nothing to do with it. permalink parent award report block reply\nTrumpPlay3dYouLoL 1 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply\nShitsbrokeyo 2 points 3 hours ago Agree on all. Don't need 10 million homes after deportation and visa removals.  In fact, you have a surplus which will create affordability. permalink award report block reply\nrivetjoint2 2 points 7 hours ago 100% permalink award report block reply\nshatmaself 2 points 9 hours ago The graph at bottom is interesting, but I wonder at the true reasons for the drop-off.  I see that the sharp decline started in 1990 and 1990's, that would correspond to 30-year-olds who were born in the 1960's, and we raised during and after the \"Me\" and \"Hippie\" stuff. The contraceptive pill came into being in the 1960's, and helped change how women viewed their lives and roles, plus feminism intensified. All those things combine into people choosing not to get married and have kids, and that can explain the decline, as much or more as any economic factors or constraints. But I agree with the feeling that home-ownership has seemed to be become more and more difficult to attain over time. permalink award report block reply LostElf 3 points 7 hours ago Massive shift in women working outside the home. Made a huge impact on society. None of it for the good. permalink parent award report block reply ZacPetkanas 1 points 7 hours ago Wages stagnated, companies created “make-work” jobs for the ladies to avoid lawsuits, HR departments exploded, and prices rose because families had more money to spend Great job, ladies. * Slow clap * permalink parent award report block reply\nLostElf 3 points 7 hours ago Massive shift in women working outside the home. Made a huge impact on society. None of it for the good. permalink parent award report block reply ZacPetkanas 1 points 7 hours ago Wages stagnated, companies created “make-work” jobs for the ladies to avoid lawsuits, HR departments exploded, and prices rose because families had more money to spend Great job, ladies. * Slow clap * permalink parent award report block reply\nZacPetkanas 1 points 7 hours ago Wages stagnated, companies created “make-work” jobs for the ladies to avoid lawsuits, HR departments exploded, and prices rose because families had more money to spend Great job, ladies. * Slow clap * permalink parent award report block reply\nKlaus73 1 points 5 hours ago Honestly even just accomplishing 1-4 would have a massive impact and be very realistic. Building 10 million homes would be a herculean undertaking in this economy and the whole reason that 50 year mortgage retardation is being pushed because folks can't afford the ones there are. Crushing the college cartel I assume means...what exactly? It needs way more deffinition and I think ditching post secondary education is priming your nation for failure. permalink award report block reply\nBigMikesChef 1 points 5 hours ago FIRE PAM FIRST...then Kash. permalink award report block reply MoldyLocksNesMonste 1 points 3 hours ago The only way that is happening is if both trump, vance, and the next in line for about 50 people were also all impeached. And then only maybe. permalink parent award report block reply\nMoldyLocksNesMonste 1 points 3 hours ago The only way that is happening is if both trump, vance, and the next in line for about 50 people were also all impeached. And then only maybe. permalink parent award report block reply\nLurking_centipede 1 points 5 hours ago More focus on antisemitism incoming... permalink award report block reply\npopcycle 1 points 2 hours ago cart before the horse, some of it.  build up the industry (with US citizens only!) and the rest fixes itself permalink award report block reply\nLurking_centipede 1 points 6 hours ago Trump is betraying us on all of these permalink award report block reply TrumpPlay3dYouLoL 1 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply\nTrumpPlay3dYouLoL 1 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply\nPearcesarrow 1 points 6 hours ago Hate to say it but there’s got to be a connection between cryptobro’s/Trump making a fortune on whatever he and Donjr. Are doing with tokens/coins and his positions about H1’s. I’m pretty sure they have a large influence now permalink award report block reply\nclownworld30330 1 points 3 hours ago Trump is only on board with step 1. permalink award report block reply\nHarvestsmiles 1 points 25 minutes ago Best this administration can do is call voters dumber than H1Bs.\nWeird. permalink award report block reply\nSteve56775 0 points 6 hours ago Oh and Bondi the bulldog, who fights for us with bared teeth. permalink award report block reply\nNoMoreShinesBilly 0 points 7 hours ago agree wholeheartedly with it.  advocate for it. voted for it. demand it. waiting for it. pray DAILY for it.  losing faith. permalink award report block reply\nsomeguy7738 0 points 7 hours ago Don't forget outsourcing/offshoring/nearshoring. Trump was supposed to deal with that with tariffs, but we all see how well that is going. permalink award report block reply\nedxzxz -1 points 6 hours ago Or, just repeal the 19A and that chart swings up to 1950's levels again.  Young men interact with young women and see they do not want to be partners in life with tyrannical retarded self destructive harpies. permalink award report block reply\nScumbag-reddit -17 points 9 hours ago Easily identifiable shills in every thread. Deport all fags permalink award report block reply covok48 19 points 8 hours ago No. This admin is selling us out. Go fuck off to Isreal. permalink parent award report block reply TrumpPlay3dYouLoL 1 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply\ncovok48 19 points 8 hours ago No. This admin is selling us out. Go fuck off to Isreal. permalink parent award report block reply\nTrumpPlay3dYouLoL 1 points 3 hours ago Comment removed by community moderators. permalink parent award report block reply\nSanityGumby -22 points 9 hours ago You sound retarded permalink award report block reply covok48 6 points 8 hours ago Why, because of a graph? permalink parent award report block reply\ncovok48 6 points 8 hours ago Why, because of a graph? permalink parent award report block reply\nGayPatriotMAGAUncle -34 points 9 hours ago The only thing Charlie was wrong about is H-1B's. Sorry stormfags, but your guilt tripping is not going to work. You don't speak for the dead. permalink award report block reply Region 22 points 9 hours ago Thanks for the input Patel. Don’t you have a street to shit in somewhere? permalink parent award report block reply covok48 14 points 8 hours ago Fuck off too the third world shithole you came from. permalink parent award report block reply\nRegion 22 points 9 hours ago Thanks for the input Patel. Don’t you have a street to shit in somewhere? permalink parent award report block reply\ncovok48 14 points 8 hours ago Fuck off too the third world shithole you came from. permalink parent award report block reply\nEyesSewnShut 1 points 8 hours ago Comment removed by community moderators. permalink award report block reply"}