{"id": "1ARK9pelg0", "contents": "58 The single most important ingredient for RFK to immediately remove from the food supply posted 12 hours ago by FlgPole 30 comments award share download report block\n30 comments Sort by Top Top New Worst Old Save Tikk 3 points 11 hours ago Holy shit this is stupid. Please explain how you think Roundup operates: permalink award report block reply OneTypoComment 1 points 11 hours ago You literally wash it off with water. It doesn't \"absorb\" into the food or change its molecular biology. permalink parent award report block reply TGNX -2 points 11 hours ago It doesn't all \"wash off.\" It gets absorbed by the plant. While trace amounts might not be a big deal, we're talking about ALL food crops getting sprayed with this. Even \"organic\" if you don't pay close enough attention to the producer. permalink parent award report block reply RedStoneDeepState 1 points 1 hour ago The only crops getting sprayed with roundup is wheat, corn and soy. Nothing you are even potentially eating organic has a roundup ready option. permalink parent award report block reply TGNX 1 points 54 minutes ago They aren't supposed to. I've read about some supposedly organic products still containing glyphosate. permalink parent award report block reply view 1 more comments... BillGateCanSuckIt 1 points 1 hour ago https://search.brave.com/search?q=spray+glyphosate-+on+grain+as+a+drying+agent&source=android&summary=1&conversation=cf27437f7c93bf5016dfba permalink parent award report block reply RedStoneDeepState 1 points 1 hour ago Roundup isn't used as a drying agent. It does a shit job. permalink parent award report block reply view 2 more comments... staroframphansbhole 0 points 11 hours ago Don’t want glyphosate in me food mate. Simple as that. permalink parent award report block reply SERP-SERP 3 points 12 hours ago He's definitely talked about it permalink award report block reply War_Hamster 3 points 12 hours ago I think he has. He’s taking on both sides of the FDA. permalink parent award report block reply MediumBase 2 points 11 hours ago That and high fructose corn syrup. permalink award report block reply HillarysBeaverMunch 1 points 11 hours ago Roundup-resistant corn has been genetically modified  to resist being killed  by Roundup, which is an incredibly potent herbicide. It was hard to solve, but scientists  found a subspecies of moth that had a genetic resistance to being killed by glyphosphate, the active ingredient in Roundup. So the scientists spliced that section of the month's DNA into corn and created \"Roundup  Ready\" corn. It was a huge success. So today when you consume any corn product in North America, you consume a small amount of moth DNA. permalink award report block reply staroframphansbhole 2 points 11 hours ago Gross permalink parent award report block reply FlgPole OP 0 points 1 hour ago you vill eat ze bugs. Now research venomous fruit. Tomato spliced with scorpions permalink parent award report block reply Frociaggine 1 points 11 hours ago Glyphosates permalink award report block reply TrumpAndGodWin 1 points 10 hours ago It's contaminated most of the fresh water in America... permalink award report block reply Lunk 1 points 11 hours ago Never happen the price farmers would pay to go back to traditional ways of planting crops would be astronomical, yields would be less per acre. permalink award report block reply TGNX 2 points 11 hours ago What do you mean by \"traditional?\" Do you mean methods from 15 or 20 years ago? permalink parent award report block reply Lunk 2 points 3 hours ago I mean no longer using the no till method permalink parent award report block reply BillGateCanSuckIt 1 points 1 hour ago https://search.brave.com/search?q=spray+glyphosate-+on+grain+as+a+drying+agent&source=android&summary=1&conversation=cf27437f7c93bf5016dfba permalink parent award report block reply BillGateCanSuckIt 1 points 11 hours ago They fucking spray it on grain to help it dry faster. These people deserve the noose permalink award report block reply EllisDee25 2 points 5 hours ago No they don't. Your s lying retard. permalink parent award report block reply BillGateCanSuckIt 1 points 1 hour ago Look it up FAGGOT, truth is stranger than fiction. https://non-gmoreport.com/articles/grim-reaper-many-food-crops-sprayed-with-weed-killer-before-harvest/ https://search.brave.com/search?q=spray+glyphosate-+on+grain+as+a+drying+agent&source=android&summary=1&conversation=cf27437f7c93bf5016dfba permalink parent award report block reply RedStoneDeepState 1 points 59 minutes ago Roundup isn't used as a drying agent. It does a shit job. permalink parent award report block reply Raetchel 1 points 12 hours ago you don't want weeds do you? permalink award report block reply chickeninoven 4 points 11 hours ago Nope! Gimme loads of that yummy yummy glyphosate, Mr. Bayer! Yum Yummy! permalink parent award report block reply TGNX 1 points 11 hours ago They use glyphosate to dry out the plants prior to harvest. So the agricorp isn't on such a time crunch and can get larger yields. permalink parent award report block reply RedStoneDeepState 1 points 59 minutes ago No they don't. permalink parent award report block reply\nTikk 3 points 11 hours ago Holy shit this is stupid. Please explain how you think Roundup operates: permalink award report block reply OneTypoComment 1 points 11 hours ago You literally wash it off with water. It doesn't \"absorb\" into the food or change its molecular biology. permalink parent award report block reply TGNX -2 points 11 hours ago It doesn't all \"wash off.\" It gets absorbed by the plant. While trace amounts might not be a big deal, we're talking about ALL food crops getting sprayed with this. Even \"organic\" if you don't pay close enough attention to the producer. permalink parent award report block reply RedStoneDeepState 1 points 1 hour ago The only crops getting sprayed with roundup is wheat, corn and soy. Nothing you are even potentially eating organic has a roundup ready option. permalink parent award report block reply TGNX 1 points 54 minutes ago They aren't supposed to. I've read about some supposedly organic products still containing glyphosate. permalink parent award report block reply view 1 more comments... BillGateCanSuckIt 1 points 1 hour ago https://search.brave.com/search?q=spray+glyphosate-+on+grain+as+a+drying+agent&source=android&summary=1&conversation=cf27437f7c93bf5016dfba permalink parent award report block reply RedStoneDeepState 1 points 1 hour ago Roundup isn't used as a drying agent. It does a shit job. permalink parent award report block reply view 2 more comments... staroframphansbhole 0 points 11 hours ago Don’t want glyphosate in me food mate. Simple as that. permalink parent award report block reply\nOneTypoComment 1 points 11 hours ago You literally wash it off with water. It doesn't \"absorb\" into the food or change its molecular biology. permalink parent award report block reply TGNX -2 points 11 hours ago It doesn't all \"wash off.\" It gets absorbed by the plant. While trace amounts might not be a big deal, we're talking about ALL food crops getting sprayed with this. Even \"organic\" if you don't pay close enough attention to the producer. permalink parent award report block reply RedStoneDeepState 1 points 1 hour ago The only crops getting sprayed with roundup is wheat, corn and soy. Nothing you are even potentially eating organic has a roundup ready option. permalink parent award report block reply TGNX 1 points 54 minutes ago They aren't supposed to. I've read about some supposedly organic products still containing glyphosate. permalink parent award report block reply view 1 more comments... BillGateCanSuckIt 1 points 1 hour ago https://search.brave.com/search?q=spray+glyphosate-+on+grain+as+a+drying+agent&source=android&summary=1&conversation=cf27437f7c93bf5016dfba permalink parent award report block reply RedStoneDeepState 1 points 1 hour ago Roundup isn't used as a drying agent. It does a shit job. permalink parent award report block reply view 2 more comments...\nTGNX -2 points 11 hours ago It doesn't all \"wash off.\" It gets absorbed by the plant. While trace amounts might not be a big deal, we're talking about ALL food crops getting sprayed with this. Even \"organic\" if you don't pay close enough attention to the producer. permalink parent award report block reply RedStoneDeepState 1 points 1 hour ago The only crops getting sprayed with roundup is wheat, corn and soy. Nothing you are even potentially eating organic has a roundup ready option. permalink parent award report block reply TGNX 1 points 54 minutes ago They aren't supposed to. I've read about some supposedly organic products still containing glyphosate. permalink parent award report block reply view 1 more comments... BillGateCanSuckIt 1 points 1 hour ago https://search.brave.com/search?q=spray+glyphosate-+on+grain+as+a+drying+agent&source=android&summary=1&conversation=cf27437f7c93bf5016dfba permalink parent award report block reply RedStoneDeepState 1 points 1 hour ago Roundup isn't used as a drying agent. It does a shit job. permalink parent award report block reply view 2 more comments...\nRedStoneDeepState 1 points 1 hour ago The only crops getting sprayed with roundup is wheat, corn and soy. Nothing you are even potentially eating organic has a roundup ready option. permalink parent award report block reply TGNX 1 points 54 minutes ago They aren't supposed to. I've read about some supposedly organic products still containing glyphosate. permalink parent award report block reply view 1 more comments...\nTGNX 1 points 54 minutes ago They aren't supposed to. I've read about some supposedly organic products still containing glyphosate. permalink parent award report block reply view 1 more comments...\nBillGateCanSuckIt 1 points 1 hour ago https://search.brave.com/search?q=spray+glyphosate-+on+grain+as+a+drying+agent&source=android&summary=1&conversation=cf27437f7c93bf5016dfba permalink parent award report block reply RedStoneDeepState 1 points 1 hour ago Roundup isn't used as a drying agent. It does a shit job. permalink parent award report block reply view 2 more comments...\nRedStoneDeepState 1 points 1 hour ago Roundup isn't used as a drying agent. It does a shit job. permalink parent award report block reply view 2 more comments...\nstaroframphansbhole 0 points 11 hours ago Don’t want glyphosate in me food mate. Simple as that. permalink parent award report block reply\nSERP-SERP 3 points 12 hours ago He's definitely talked about it permalink award report block reply War_Hamster 3 points 12 hours ago I think he has. He’s taking on both sides of the FDA. permalink parent award report block reply\nWar_Hamster 3 points 12 hours ago I think he has. He’s taking on both sides of the FDA. permalink parent award report block reply\nMediumBase 2 points 11 hours ago That and high fructose corn syrup. permalink award report block reply\nHillarysBeaverMunch 1 points 11 hours ago Roundup-resistant corn has been genetically modified  to resist being killed  by Roundup, which is an incredibly potent herbicide. It was hard to solve, but scientists  found a subspecies of moth that had a genetic resistance to being killed by glyphosphate, the active ingredient in Roundup. So the scientists spliced that section of the month's DNA into corn and created \"Roundup  Ready\" corn. It was a huge success. So today when you consume any corn product in North America, you consume a small amount of moth DNA. permalink award report block reply staroframphansbhole 2 points 11 hours ago Gross permalink parent award report block reply FlgPole OP 0 points 1 hour ago you vill eat ze bugs. Now research venomous fruit. Tomato spliced with scorpions permalink parent award report block reply\nstaroframphansbhole 2 points 11 hours ago Gross permalink parent award report block reply\nFlgPole OP 0 points 1 hour ago you vill eat ze bugs. Now research venomous fruit. Tomato spliced with scorpions permalink parent award report block reply\nFrociaggine 1 points 11 hours ago Glyphosates permalink award report block reply\nTrumpAndGodWin 1 points 10 hours ago It's contaminated most of the fresh water in America... permalink award report block reply\nLunk 1 points 11 hours ago Never happen the price farmers would pay to go back to traditional ways of planting crops would be astronomical, yields would be less per acre. permalink award report block reply TGNX 2 points 11 hours ago What do you mean by \"traditional?\" Do you mean methods from 15 or 20 years ago? permalink parent award report block reply Lunk 2 points 3 hours ago I mean no longer using the no till method permalink parent award report block reply BillGateCanSuckIt 1 points 1 hour ago https://search.brave.com/search?q=spray+glyphosate-+on+grain+as+a+drying+agent&source=android&summary=1&conversation=cf27437f7c93bf5016dfba permalink parent award report block reply\nTGNX 2 points 11 hours ago What do you mean by \"traditional?\" Do you mean methods from 15 or 20 years ago? permalink parent award report block reply Lunk 2 points 3 hours ago I mean no longer using the no till method permalink parent award report block reply BillGateCanSuckIt 1 points 1 hour ago https://search.brave.com/search?q=spray+glyphosate-+on+grain+as+a+drying+agent&source=android&summary=1&conversation=cf27437f7c93bf5016dfba permalink parent award report block reply\nLunk 2 points 3 hours ago I mean no longer using the no till method permalink parent award report block reply BillGateCanSuckIt 1 points 1 hour ago https://search.brave.com/search?q=spray+glyphosate-+on+grain+as+a+drying+agent&source=android&summary=1&conversation=cf27437f7c93bf5016dfba permalink parent award report block reply\nBillGateCanSuckIt 1 points 1 hour ago https://search.brave.com/search?q=spray+glyphosate-+on+grain+as+a+drying+agent&source=android&summary=1&conversation=cf27437f7c93bf5016dfba permalink parent award report block reply\nBillGateCanSuckIt 1 points 11 hours ago They fucking spray it on grain to help it dry faster. These people deserve the noose permalink award report block reply EllisDee25 2 points 5 hours ago No they don't. Your s lying retard. permalink parent award report block reply BillGateCanSuckIt 1 points 1 hour ago Look it up FAGGOT, truth is stranger than fiction. https://non-gmoreport.com/articles/grim-reaper-many-food-crops-sprayed-with-weed-killer-before-harvest/ https://search.brave.com/search?q=spray+glyphosate-+on+grain+as+a+drying+agent&source=android&summary=1&conversation=cf27437f7c93bf5016dfba permalink parent award report block reply RedStoneDeepState 1 points 59 minutes ago Roundup isn't used as a drying agent. It does a shit job. permalink parent award report block reply\nEllisDee25 2 points 5 hours ago No they don't. Your s lying retard. permalink parent award report block reply BillGateCanSuckIt 1 points 1 hour ago Look it up FAGGOT, truth is stranger than fiction. https://non-gmoreport.com/articles/grim-reaper-many-food-crops-sprayed-with-weed-killer-before-harvest/ https://search.brave.com/search?q=spray+glyphosate-+on+grain+as+a+drying+agent&source=android&summary=1&conversation=cf27437f7c93bf5016dfba permalink parent award report block reply RedStoneDeepState 1 points 59 minutes ago Roundup isn't used as a drying agent. It does a shit job. permalink parent award report block reply\nBillGateCanSuckIt 1 points 1 hour ago Look it up FAGGOT, truth is stranger than fiction. https://non-gmoreport.com/articles/grim-reaper-many-food-crops-sprayed-with-weed-killer-before-harvest/ https://search.brave.com/search?q=spray+glyphosate-+on+grain+as+a+drying+agent&source=android&summary=1&conversation=cf27437f7c93bf5016dfba permalink parent award report block reply RedStoneDeepState 1 points 59 minutes ago Roundup isn't used as a drying agent. It does a shit job. permalink parent award report block reply\nRedStoneDeepState 1 points 59 minutes ago Roundup isn't used as a drying agent. It does a shit job. permalink parent award report block reply\nRaetchel 1 points 12 hours ago you don't want weeds do you? permalink award report block reply chickeninoven 4 points 11 hours ago Nope! Gimme loads of that yummy yummy glyphosate, Mr. Bayer! Yum Yummy! permalink parent award report block reply TGNX 1 points 11 hours ago They use glyphosate to dry out the plants prior to harvest. So the agricorp isn't on such a time crunch and can get larger yields. permalink parent award report block reply RedStoneDeepState 1 points 59 minutes ago No they don't. permalink parent award report block reply\nchickeninoven 4 points 11 hours ago Nope! Gimme loads of that yummy yummy glyphosate, Mr. Bayer! Yum Yummy! permalink parent award report block reply\nTGNX 1 points 11 hours ago They use glyphosate to dry out the plants prior to harvest. So the agricorp isn't on such a time crunch and can get larger yields. permalink parent award report block reply RedStoneDeepState 1 points 59 minutes ago No they don't. permalink parent award report block reply\nRedStoneDeepState 1 points 59 minutes ago No they don't. permalink parent award report block reply"}