{"id": "1ARK52Asdx", "contents": "1068 I have worked anywhere between one and three jobs since I was 15 - the fact that even one cent of my paycheck goes towards feeding illiterate obese garden gnomes is fucking demoralizing. posted 6 days ago by CyanScales 122 comments award share report block M2 @Amer1can_Barbie • 7d I have worked anywhere between one and three jobs since I was 15 - the fact that even one cent of my paycheck goes towards feeding illiterate obese garden gnomes is fucking demoralizing. Breaking911 @Breaking911 • 8d NEWS 12: \"Danielle Grant is starving.\"\n122 comments Sort by Top Top New Worst Old Save 62jawbill 112 points 6 days ago Poor people were skinny when I was a kid. permalink award report block reply ImYourHuckleberry24 54 points 6 days ago Yep, including my own family growing up. permalink parent award report block reply The_Bloofy_Bullshark 19 points 6 days ago Yup. People thought my wife had an eating disorder. She was just poor as shit. permalink parent award report block reply memeYourDreams 27 points 6 days ago But then how will the medical industry make trillions? permalink parent award report block reply keeman 19 points 6 days ago Trump admin has just announced that Ozempic is gonna be $50 copay under medicare.  So no we will have only slightly obese elderly people with severe pancreas and kidney disease.  Don't worry, the drug industries make expensive drugs to treat those conditions also.  And so on. permalink parent award report block reply keeman 13 points 6 days ago Also, didn't we get Bobby Kennedy in there to stop things like subsidizing Ozempic?  Is he on vacation or something? permalink parent award report block reply chickeninoven 3 points 6 days ago He got Doritos to stop using rat poison in their cool ranch chips. Isn't that enough for you? permalink parent award report block reply view 1 more comments... ActNow 1 points 6 days ago RFK Jr. has his own deep state employees to deal with at FDA. They have been withholding information from him and scheduling meetings when he is not available. This won't be easy. permalink parent award report block reply MastaJoda 7 points 6 days ago Ozempic that creates a shit ton of heart issues as well as what you listed and is banned in Germany where it was created and distributed from almost exclusively for Americans? That Ozempic? Lol permalink parent award report block reply Cacciali_Via 1 points 6 days ago So. If the woman in the video was given ozempic and lost 100lbs. Do you think she would be better off or worse off health wise? permalink parent award report block reply 24601 22 points 6 days ago I know.... I was a skinny poor kid when I was a kid. permalink parent award report block reply indigo_truther 6 points 6 days ago Same permalink parent award report block reply lixa 5 points 6 days ago And I worked since 12. 15 pffft. permalink parent award report block reply chickeninoven 6 points 6 days ago Pfft. I had a paper route when I was nine. Rode a laden bike uphill both ways through snow while dogs chased me and kids threw C batteries at me. permalink parent award report block reply ailurus 2 points 6 days ago You got free batteries?  Lucky! permalink parent award report block reply Maxdady01 2 points 6 days ago You had a bike?!?   :) permalink parent award report block reply view 1 more comments... AdmrlNelson 13 points 6 days ago I've yet to see someone complaining about EBT that is skinny. permalink parent award report block reply TD_Covfefe_Crusader 6 points 6 days ago There were also very few homeless people when I was a kid. permalink parent award report block reply load 5 more comments... 24601 60 points 6 days ago Starving people don't have $300 leather jackets.... $60 purple hair extensions... and ginormous quadruple wide asses. permalink award report block reply Dev404 25 points 6 days ago I'm told that having these opinions was racist and oppressive and that I should be happy my tax dollars goes to helping black slaves, who never experienced slavery, continue weighing more than me and wear more expensive jewelry/accessories than I wear. permalink parent award report block reply TD_Covfefe_Crusader 11 points 6 days ago They take more Carnival cruises than you do too. permalink parent award report block reply MastaJoda 6 points 6 days ago Bribing democrats biggest voter block is the tax payers job, ya bigot! permalink parent award report block reply that_sound 10 points 6 days ago $300 leather jackets.... $60 purple hair extensions You think that's bad, you should see what her health care costs are. And she doesn't pay for any of it, you do. permalink parent award report block reply BeBest 3 points 6 days ago I remember going into the Wilson’s leather store as a teen and just wanting one of those $100 leather jackets. They were so nice! permalink parent award report block reply Monkeytributo 6 points 6 days ago WIDE LOAD permalink parent award report block reply 26magarat 5 points 6 days ago They were trendy when I was a teen, but I couldn't afford one. But I wasn't alone. permalink parent award report block reply impera 4 points 6 days ago Maslow's hierarchy of needs does not seem to be a universal thing when some people would prioritize decorating themselves with trinkets rather than eating. permalink parent award report block reply load 1 more comments... hughjasske69 28 points 6 days ago That fat bitch isn't starving. Jesus Christ I pray she finds a job permalink award report block reply imnotdeadyet 21 points 6 days ago That's the problem, these people feel \"entitled.\"  They can't function in the work force because they have to be civil and many can't even do that!  Who is going to hire a barely functional illiterate with a bad attitude? permalink parent award report block reply RetainedByLucifer 11 points 6 days ago Wendy's? permalink parent award report block reply imnotdeadyet 8 points 6 days ago I was thinking Popeye's, but you may be right. permalink parent award report block reply keeman 9 points 6 days ago Waffle house. permalink parent award report block reply TD_Covfefe_Crusader 6 points 6 days ago They can't even muster up the basics of showing up on time for a job. permalink parent award report block reply imnotdeadyet 6 points 6 days ago Very true. permalink parent award report block reply bejeavis 3 points 6 days ago Charity without accountability is abuse permalink parent award report block reply Repentnow 3 points 6 days ago Prison. permalink parent award report block reply spez_this 17 points 6 days ago She had enough money to get her hair braided and dyed pink. She needs to leave the pantry and come back after she's lost a couple of chins and found a job. permalink parent award report block reply rebuildingMyself 7 points 6 days ago They braid each other's hair and she probably stole the hair dye permalink parent award report block reply Smurfection 15 points 6 days ago Given some electrolytes, salt, vitamin D + C and tea, she could probably go a year without eating. To those who don't understand, fat people don't starve.  Given enough water, electrolytes, vitamins and some sun, they lose weight. I know this because I've been doing water fasts for three days a month for almost three years now.  Okay, I miss some months.  I also do intermittent fasting.    It is not true that skipping meals is bad for us.  I believed that almost my entire life, but as I found out, one of the best things you can do for your own health is skip meals, regularly. Breakfast is not the most important meal of the day. No one needs breakfast to get going in the morning.  your body wakes up with a glucose spike from a process known as gluconeogenesis.  That's probably what wakes a person up from sleeping.   You might need some cafffeine in the morning (I recommend coffee with a bit of butter, salt and MTC oil, called bullet coffee) but no, you don't need to eat every meal and you don't need food all the time. permalink parent award report block reply Lurker6 1 points 5 days ago Still bitter that I was of the age where we went through the, \"oh, you shouldn't be eating 3 moderate sized meals with limited snacking in between.  You should be spiking your blood sugar 5 to 7 times a day.\" And the food pyramid... permalink parent award report block reply Smurfection 1 points 4 days ago I actually believed this all the way thru January 2023 when I went Keto and started doing intermittent fasting.  I've been a yo-yo dieter my whole life and I thought it was important to not skip meals.   I was amazed how easy it was to lose weight and keep it off just by being keto and skipping meals. I can't believe how many stupid things I believed about diet and nutrition prior to going keto. permalink parent award report block reply keeman 5 points 6 days ago If you cut off her food stamps then perhaps that would provide some incentive.  Don't feed the animals, you just get dependent animals. permalink parent award report block reply that_sound 4 points 6 days ago Look, I don't care what people do in the privacy of their own homes. But public obesity should be a crime. And at this level it should be a felony. Nobody should ever have to look at something like that. It's disgusting. Children should never be allowed to see it. You don't want that kind of thing normalized. Nobody should grow up thinking being that fat is in any way ok. This person is clearly a threat to herself. Look at what she has done to herself by way of destroying her health. Involuntary institutionalization. Restricted diet, forced exercise, and classes on how to act like an adult. Any future probationary period should exclude any contact with children. Make Asylums Great Again. permalink parent award report block reply FelixtheMan 20 points 6 days ago My mom went to bed hungry as a kid for many years.....she was skinny her whole life.  Weird permalink award report block reply Spicy_cat 7 points 6 days ago I used to come home from a 12 hour shift and steam 1/2 cup of rice for dinner permalink parent award report block reply MastaJoda 4 points 6 days ago I used to sleep with my balled up fist under my stomach to kill hunger pangs. permalink parent award report block reply Monkeytributo 18 points 6 days ago Obese garden gmone is a crazy ass insult🤣🤣🤣 permalink award report block reply covok48 3 points 6 days ago I’d call them something else, but I’d have to go to ConPro for that. permalink parent award report block reply TEXinLA 15 points 6 days ago 🤣🤣 You have to laugh. Or you'd cry... permalink award report block reply 1DontTreadOnMe1 13 points 6 days ago Bitch has enough fat stores to last her 3 or 4 years without eating a single drop of food! permalink award report block reply covok48 3 points 6 days ago 100% permalink parent award report block reply MastaJoda 2 points 6 days ago Fact! permalink parent award report block reply FakeNametag 11 points 6 days ago The increase in your health insurance is also paying for her motorized wheelchair permalink award report block reply Realassman 8 points 6 days ago In last three years I could have paid my house and lived worry free if not for taxes permalink award report block reply ahamrbond 8 points 6 days ago Do they have any idea how good it is for your health to fast for a few days? It fixes everything. Even cancer. Just drink some water and relax. After about two or three days, the hunger pangs go away and you can just chill out. You can go a good 30 days without any food and come out of it a better person. Jesus used to go into the desert for 40 days to fast and pray. What a great country it would be if those chubby EBT users took a month off from leeching off society, lost some weight and helped to cure their bodies. permalink award report block reply RedStoneDeepState 7 points 6 days ago That gnome could go for about 80-100 days without food permalink parent award report block reply breathittbill 3 points 6 days ago Just fasting in between meals would be impossible for these land whales. permalink parent award report block reply RyanKeyOh 1 points 6 days ago I do a 72 hour fast every other month permalink parent award report block reply Krat 7 points 6 days ago She voted for the communism permalink award report block reply _Sully_ 7 points 6 days ago This is some sick comedy. This woman isn't starving and a total drug addict. Have you ever been around a heroin addict? They will say and do anything to keep that train moving forward and that includes robbing their own grandmother and stomping on their own children. We are being held hostage by sociopaths. permalink award report block reply The_Bloofy_Bullshark 5 points 6 days ago 100% I know a woman who loves telling everyone how she’s clean and that she needs money for food and whatnot. Except it was the strangest thing, she kept getting these new pesky track marks. Then she OD’d, obviously not from drugs because she was totally clean and spending her money only on food, and ended up in a hospital for a few weeks because of sepsis. permalink parent award report block reply Formerlurker92 7 points 6 days ago Its the same reason people stopped donating to charity. You just end up encouraging this behavior permalink award report block reply Trooph-Hurts 7 points 6 days ago No one rides for free! I’m sure there is something this fat ass can do for us????  I personally think she could work on a road crew a road base compactor before asphalting….. just get her some boots and she’s good to go! permalink award report block reply penguinjay1212 4 points 6 days ago I know you joke, but I wouldnt trust that thing to be a sign spinner. permalink parent award report block reply Trooph-Hurts 6 points 6 days ago Just have them pick up garbage but it has to be videoed as evidence!!!! For sure to your point, these people are good for nothing!…. Completely worthless permalink parent award report block reply MayorofTrumpton 5 points 6 days ago That woman has more chins than you would find in the China phone book. She definitely could do with missing a few meals. permalink award report block reply yummy_yumm_yumms 5 points 6 days ago Keeps wiping tears that are not there. permalink award report block reply Icanbememe 4 points 6 days ago dey all phat permalink award report block reply handshakejackson 3 points 6 days ago I'm conflicted on whether the first person in this video could even work or hold a job.  I don't know that I hate helping a person like her.  She legitimately seems cognitively disabled. permalink award report block reply Owmyballz 3 points 6 days ago The good thing for the Jabba the Hutt American is that in two days your body is running on ketones and you start thinking clearer and feel better.  She'll be voting Republican after she gets the seed oils and high fructose syrup out of her sugar caverns, which most people would call arteries and veins. permalink award report block reply cook_does 3 points 6 days ago Demoralizing for sure. You think getting your tea taxed is bat, wait until you have to listen to some fat black woman tell \"I is be starvin n' shit up in this bitch\" permalink award report block reply dr_gonzo 3 points 6 days ago It's way past time for Americans to wake the fuck up. Blacks and various 3rd worlders don't possess the requisite IQ to live in a free society with whites and Asians, nor will they at any point in the next several centuries. That's just the reality. As a group, they're incapable of competing, which means if we don't ELIMINATE the social welfare programs, they will absolutely, 100% destroy the currency and crash our economy. That is guaranteed. It's already happening and will only get worse and worse as minorities increase in number, and as the interest payment on the national debt consumes a larger and larger piece of total federal revenue. Destroying the middle class, not to mention the free world, is not \"compassionate\". Charity must be PRIVATE and VOLUNTARY. If we don't have a dramatic shift in opinion on these idiotic government programs, we are absolutely fucked. permalink award report block reply C0drus 3 points 6 days ago “Garden Gnomes” 🤣🤣🤣 is this the term for joggers that takes the place of “Lawn Jockey”? permalink award report block reply SvbHvman 3 points 6 days ago It'll take a while. permalink award report block reply Jimmyprawns 3 points 6 days ago Ain't nobody starving out there. They're just crying about losing premium cable, fiber internet and having to down grade thier smart phones. permalink award report block reply Donsabai 3 points 6 days ago She hungry now but hangry later. Looks like she has never missed a meal in her whole life. permalink award report block reply JesusIsMyGod114 3 points 6 days ago Looll garden gnome 🤣🤣 permalink award report block reply MisterMAGA 2 points 6 days ago I am indeed getting tired of all this winning permalink award report block reply 26magarat 2 points 6 days ago Don't insult garden gnomes: they are much cuter than this woman.  She's closer to a Teletubby. permalink award report block reply asiatrails 2 points 6 days ago This ghetto flob blub is not starving permalink award report block reply SaltyLandscaper 2 points 5 days ago I don't care anymore lard ass. I barely cared before. But now my caring is in the negative. permalink award report block reply 3-10 2 points 6 days ago When the currency collapses, I will have my shotgun ready to kill these starving people when they try to get my food stores. permalink award report block reply elmerecido 2 points 6 days ago If that obeast gets diagnosed with a flesh-eating disease, she’d have 6 months to live. permalink award report block reply yummy_yumm_yumms 2 points 6 days ago If anyone could use a little bit of forced fasting, holy shit! permalink award report block reply PoonDong 2 points 6 days ago Remember all the obese white people living in the Hoovervilles during the Great Depression? Im so fuckin tired of the welfare state. permalink award report block reply muppeton 2 points 6 days ago I can't believe the news reporter opened with that line and didn't think it would get meme'd into oblivion. permalink award report block reply votedforthe45th 2 points 6 days ago Jessica Jones needs to buy some condoms permalink award report block reply mikejones 2 points 6 days ago Where does the money from her check go? permalink award report block reply FrankDuncan 2 points 6 days ago Chins-r-us permalink parent award report block reply Keep_on_winning_kag 2 points 6 days ago Nice fake crying you fat pig. permalink award report block reply RudeFrog 2 points 6 days ago Shouldn't she just go into hibernation? I remember when poor people used to be skinny because they were actually starving. permalink award report block reply Lol_Garrus 2 points 6 days ago I wonder how much she spent on that hair. permalink award report block reply laredditarmy 2 points 6 days ago Is this AI? permalink award report block reply 00buck1200fps 2 points 6 days ago Resources are slim but she isn't permalink award report block reply BoyPuzzy4me 2 points 6 days ago She be bilt different cuh this nigga STARVIN!! permalink award report block reply Mungo 2 points 6 days ago Haha (pointing like Nelson) permalink award report block reply Trundlethegreat 1 points 6 days ago That bitch is starving every 32 seconds though. permalink award report block reply Obambi 1 points 6 days ago Women in this video are fucking dumb and very emotional and fake. Same for that bald headed dude Reporter is a fucking fake news creator there to work on her sizzle reel only permalink award report block reply donteatthat 1 points 6 days ago Danielle Grant can die in a fucking ditch. permalink award report block reply twopoint71 1 points 6 days ago I wouldn't say she's \"starving\". permalink award report block reply Average-Joe 1 points 6 days ago Looks and moves like Grimace permalink award report block reply 181degrees 1 points 6 days ago The obese black woman could survive one year just on her fat stores permalink award report block reply Michalusmichalus 1 points 6 days ago The internet says food banks are giving out junk food because that's all that's left. permalink award report block reply EffectiveTactics 1 points 6 days ago The ends of her belt don’t meet. permalink award report block reply ProudConservativeNY 1 points 6 days ago This fat cunt can hibernate for the winter permalink award report block reply FrankDuncan 1 points 5 days ago Blobba the gut permalink award report block reply Fanakapan 1 points 6 days ago Easy to see how the term 'Lawn Jockey' fell out of use. permalink award report block reply Systemfree1632 1 points 6 days ago The dildo of Accountability rarely arrives lubed . permalink award report block reply MythArcana 1 points 6 days ago Sometimes we eat, sometimes we don't. permalink award report block reply RyanKeyOh 1 points 6 days ago Doubt permalink award report block reply Aut_MAGA_Aut_Nihil 1 points 6 days ago Two seconds in and already I’m lmao rofl. “Starving”! 😂 permalink award report block reply Sliced_Beef_Brisket 1 points 6 days ago The government takes about $400 per year from me to pay for SNAP.  Fuck this fat bitch. permalink award report block reply GeneticsGuy 0 points 6 days ago I remember when my wife and I qualified for food stamps when we had our first child and we were broke, but both working... this was like 2011, in a state that doesn't give outrageously generous, like California. We qualified for like $400 a month, in 2011 money. Our previous budget was $150 for all our food, and while we didn't eat fancy, we had enough. $400 made us feel like we could eat like kings... we could get steaks, shrimp if we wanted, all the frozen food imaginable. Who cares if that bag of chips was overpriced, we never spent the full $400 anyway. Oh and, because it took them too long to process it, they back paid us like 2.5 months worth and deposited $1000 + $400 on our EBT card for the food stamps we missed. I couldn't believe it. I felt guilty shopping on it, but it was wild how beneficial it was. Now here is the thing... when my I got a slightly better income, we lost ALL benefits, food stamps, medicaid, and so on. We talked to the benefits department of our state and the person literally told us that if my wife cut back her hours from working or chose not to work, then our family income would be low enough to qualify for all these benefits again. They straight-up were recommending my wife to quit her job so we could qualify for welfare again. The system is broken. The incentives are broken. Welfare should be enough to keep you from starving. Give you rice and beans you need to cook yourself, with maybe a few other misc. proteins and carbs. But overall, it should not be something you live on. Thankfully, we were too proud to stay on the system. I wonder how many people would LOVE to be on the system and have all that crap paid for though. It offsets all these other expenses because now they get to spend other people's money on food. permalink award report block reply\n62jawbill 112 points 6 days ago Poor people were skinny when I was a kid. permalink award report block reply ImYourHuckleberry24 54 points 6 days ago Yep, including my own family growing up. permalink parent award report block reply The_Bloofy_Bullshark 19 points 6 days ago Yup. People thought my wife had an eating disorder. She was just poor as shit. permalink parent award report block reply memeYourDreams 27 points 6 days ago But then how will the medical industry make trillions? permalink parent award report block reply keeman 19 points 6 days ago Trump admin has just announced that Ozempic is gonna be $50 copay under medicare.  So no we will have only slightly obese elderly people with severe pancreas and kidney disease.  Don't worry, the drug industries make expensive drugs to treat those conditions also.  And so on. permalink parent award report block reply keeman 13 points 6 days ago Also, didn't we get Bobby Kennedy in there to stop things like subsidizing Ozempic?  Is he on vacation or something? permalink parent award report block reply chickeninoven 3 points 6 days ago He got Doritos to stop using rat poison in their cool ranch chips. Isn't that enough for you? permalink parent award report block reply view 1 more comments... ActNow 1 points 6 days ago RFK Jr. has his own deep state employees to deal with at FDA. They have been withholding information from him and scheduling meetings when he is not available. This won't be easy. permalink parent award report block reply MastaJoda 7 points 6 days ago Ozempic that creates a shit ton of heart issues as well as what you listed and is banned in Germany where it was created and distributed from almost exclusively for Americans? That Ozempic? Lol permalink parent award report block reply Cacciali_Via 1 points 6 days ago So. If the woman in the video was given ozempic and lost 100lbs. Do you think she would be better off or worse off health wise? permalink parent award report block reply 24601 22 points 6 days ago I know.... I was a skinny poor kid when I was a kid. permalink parent award report block reply indigo_truther 6 points 6 days ago Same permalink parent award report block reply lixa 5 points 6 days ago And I worked since 12. 15 pffft. permalink parent award report block reply chickeninoven 6 points 6 days ago Pfft. I had a paper route when I was nine. Rode a laden bike uphill both ways through snow while dogs chased me and kids threw C batteries at me. permalink parent award report block reply ailurus 2 points 6 days ago You got free batteries?  Lucky! permalink parent award report block reply Maxdady01 2 points 6 days ago You had a bike?!?   :) permalink parent award report block reply view 1 more comments... AdmrlNelson 13 points 6 days ago I've yet to see someone complaining about EBT that is skinny. permalink parent award report block reply TD_Covfefe_Crusader 6 points 6 days ago There were also very few homeless people when I was a kid. permalink parent award report block reply load 5 more comments...\nImYourHuckleberry24 54 points 6 days ago Yep, including my own family growing up. permalink parent award report block reply The_Bloofy_Bullshark 19 points 6 days ago Yup. People thought my wife had an eating disorder. She was just poor as shit. permalink parent award report block reply\nThe_Bloofy_Bullshark 19 points 6 days ago Yup. People thought my wife had an eating disorder. She was just poor as shit. permalink parent award report block reply\nmemeYourDreams 27 points 6 days ago But then how will the medical industry make trillions? permalink parent award report block reply keeman 19 points 6 days ago Trump admin has just announced that Ozempic is gonna be $50 copay under medicare.  So no we will have only slightly obese elderly people with severe pancreas and kidney disease.  Don't worry, the drug industries make expensive drugs to treat those conditions also.  And so on. permalink parent award report block reply keeman 13 points 6 days ago Also, didn't we get Bobby Kennedy in there to stop things like subsidizing Ozempic?  Is he on vacation or something? permalink parent award report block reply chickeninoven 3 points 6 days ago He got Doritos to stop using rat poison in their cool ranch chips. Isn't that enough for you? permalink parent award report block reply view 1 more comments... ActNow 1 points 6 days ago RFK Jr. has his own deep state employees to deal with at FDA. They have been withholding information from him and scheduling meetings when he is not available. This won't be easy. permalink parent award report block reply MastaJoda 7 points 6 days ago Ozempic that creates a shit ton of heart issues as well as what you listed and is banned in Germany where it was created and distributed from almost exclusively for Americans? That Ozempic? Lol permalink parent award report block reply Cacciali_Via 1 points 6 days ago So. If the woman in the video was given ozempic and lost 100lbs. Do you think she would be better off or worse off health wise? permalink parent award report block reply\nkeeman 19 points 6 days ago Trump admin has just announced that Ozempic is gonna be $50 copay under medicare.  So no we will have only slightly obese elderly people with severe pancreas and kidney disease.  Don't worry, the drug industries make expensive drugs to treat those conditions also.  And so on. permalink parent award report block reply keeman 13 points 6 days ago Also, didn't we get Bobby Kennedy in there to stop things like subsidizing Ozempic?  Is he on vacation or something? permalink parent award report block reply chickeninoven 3 points 6 days ago He got Doritos to stop using rat poison in their cool ranch chips. Isn't that enough for you? permalink parent award report block reply view 1 more comments... ActNow 1 points 6 days ago RFK Jr. has his own deep state employees to deal with at FDA. They have been withholding information from him and scheduling meetings when he is not available. This won't be easy. permalink parent award report block reply MastaJoda 7 points 6 days ago Ozempic that creates a shit ton of heart issues as well as what you listed and is banned in Germany where it was created and distributed from almost exclusively for Americans? That Ozempic? Lol permalink parent award report block reply Cacciali_Via 1 points 6 days ago So. If the woman in the video was given ozempic and lost 100lbs. Do you think she would be better off or worse off health wise? permalink parent award report block reply\nkeeman 13 points 6 days ago Also, didn't we get Bobby Kennedy in there to stop things like subsidizing Ozempic?  Is he on vacation or something? permalink parent award report block reply chickeninoven 3 points 6 days ago He got Doritos to stop using rat poison in their cool ranch chips. Isn't that enough for you? permalink parent award report block reply view 1 more comments... ActNow 1 points 6 days ago RFK Jr. has his own deep state employees to deal with at FDA. They have been withholding information from him and scheduling meetings when he is not available. This won't be easy. permalink parent award report block reply\nchickeninoven 3 points 6 days ago He got Doritos to stop using rat poison in their cool ranch chips. Isn't that enough for you? permalink parent award report block reply view 1 more comments...\nActNow 1 points 6 days ago RFK Jr. has his own deep state employees to deal with at FDA. They have been withholding information from him and scheduling meetings when he is not available. This won't be easy. permalink parent award report block reply\nMastaJoda 7 points 6 days ago Ozempic that creates a shit ton of heart issues as well as what you listed and is banned in Germany where it was created and distributed from almost exclusively for Americans? That Ozempic? Lol permalink parent award report block reply Cacciali_Via 1 points 6 days ago So. If the woman in the video was given ozempic and lost 100lbs. Do you think she would be better off or worse off health wise? permalink parent award report block reply\nCacciali_Via 1 points 6 days ago So. If the woman in the video was given ozempic and lost 100lbs. Do you think she would be better off or worse off health wise? permalink parent award report block reply\n24601 22 points 6 days ago I know.... I was a skinny poor kid when I was a kid. permalink parent award report block reply indigo_truther 6 points 6 days ago Same permalink parent award report block reply lixa 5 points 6 days ago And I worked since 12. 15 pffft. permalink parent award report block reply chickeninoven 6 points 6 days ago Pfft. I had a paper route when I was nine. Rode a laden bike uphill both ways through snow while dogs chased me and kids threw C batteries at me. permalink parent award report block reply ailurus 2 points 6 days ago You got free batteries?  Lucky! permalink parent award report block reply Maxdady01 2 points 6 days ago You had a bike?!?   :) permalink parent award report block reply view 1 more comments...\nindigo_truther 6 points 6 days ago Same permalink parent award report block reply\nlixa 5 points 6 days ago And I worked since 12. 15 pffft. permalink parent award report block reply chickeninoven 6 points 6 days ago Pfft. I had a paper route when I was nine. Rode a laden bike uphill both ways through snow while dogs chased me and kids threw C batteries at me. permalink parent award report block reply ailurus 2 points 6 days ago You got free batteries?  Lucky! permalink parent award report block reply Maxdady01 2 points 6 days ago You had a bike?!?   :) permalink parent award report block reply view 1 more comments...\nchickeninoven 6 points 6 days ago Pfft. I had a paper route when I was nine. Rode a laden bike uphill both ways through snow while dogs chased me and kids threw C batteries at me. permalink parent award report block reply ailurus 2 points 6 days ago You got free batteries?  Lucky! permalink parent award report block reply Maxdady01 2 points 6 days ago You had a bike?!?   :) permalink parent award report block reply view 1 more comments...\nailurus 2 points 6 days ago You got free batteries?  Lucky! permalink parent award report block reply\nMaxdady01 2 points 6 days ago You had a bike?!?   :) permalink parent award report block reply view 1 more comments...\nAdmrlNelson 13 points 6 days ago I've yet to see someone complaining about EBT that is skinny. permalink parent award report block reply\nTD_Covfefe_Crusader 6 points 6 days ago There were also very few homeless people when I was a kid. permalink parent award report block reply\n24601 60 points 6 days ago Starving people don't have $300 leather jackets.... $60 purple hair extensions... and ginormous quadruple wide asses. permalink award report block reply Dev404 25 points 6 days ago I'm told that having these opinions was racist and oppressive and that I should be happy my tax dollars goes to helping black slaves, who never experienced slavery, continue weighing more than me and wear more expensive jewelry/accessories than I wear. permalink parent award report block reply TD_Covfefe_Crusader 11 points 6 days ago They take more Carnival cruises than you do too. permalink parent award report block reply MastaJoda 6 points 6 days ago Bribing democrats biggest voter block is the tax payers job, ya bigot! permalink parent award report block reply that_sound 10 points 6 days ago $300 leather jackets.... $60 purple hair extensions You think that's bad, you should see what her health care costs are. And she doesn't pay for any of it, you do. permalink parent award report block reply BeBest 3 points 6 days ago I remember going into the Wilson’s leather store as a teen and just wanting one of those $100 leather jackets. They were so nice! permalink parent award report block reply Monkeytributo 6 points 6 days ago WIDE LOAD permalink parent award report block reply 26magarat 5 points 6 days ago They were trendy when I was a teen, but I couldn't afford one. But I wasn't alone. permalink parent award report block reply impera 4 points 6 days ago Maslow's hierarchy of needs does not seem to be a universal thing when some people would prioritize decorating themselves with trinkets rather than eating. permalink parent award report block reply load 1 more comments...\nDev404 25 points 6 days ago I'm told that having these opinions was racist and oppressive and that I should be happy my tax dollars goes to helping black slaves, who never experienced slavery, continue weighing more than me and wear more expensive jewelry/accessories than I wear. permalink parent award report block reply TD_Covfefe_Crusader 11 points 6 days ago They take more Carnival cruises than you do too. permalink parent award report block reply MastaJoda 6 points 6 days ago Bribing democrats biggest voter block is the tax payers job, ya bigot! permalink parent award report block reply\nTD_Covfefe_Crusader 11 points 6 days ago They take more Carnival cruises than you do too. permalink parent award report block reply\nMastaJoda 6 points 6 days ago Bribing democrats biggest voter block is the tax payers job, ya bigot! permalink parent award report block reply\nthat_sound 10 points 6 days ago $300 leather jackets.... $60 purple hair extensions You think that's bad, you should see what her health care costs are. And she doesn't pay for any of it, you do. permalink parent award report block reply BeBest 3 points 6 days ago I remember going into the Wilson’s leather store as a teen and just wanting one of those $100 leather jackets. They were so nice! permalink parent award report block reply\nBeBest 3 points 6 days ago I remember going into the Wilson’s leather store as a teen and just wanting one of those $100 leather jackets. They were so nice! permalink parent award report block reply\nMonkeytributo 6 points 6 days ago WIDE LOAD permalink parent award report block reply\n26magarat 5 points 6 days ago They were trendy when I was a teen, but I couldn't afford one. But I wasn't alone. permalink parent award report block reply\nimpera 4 points 6 days ago Maslow's hierarchy of needs does not seem to be a universal thing when some people would prioritize decorating themselves with trinkets rather than eating. permalink parent award report block reply\nhughjasske69 28 points 6 days ago That fat bitch isn't starving. Jesus Christ I pray she finds a job permalink award report block reply imnotdeadyet 21 points 6 days ago That's the problem, these people feel \"entitled.\"  They can't function in the work force because they have to be civil and many can't even do that!  Who is going to hire a barely functional illiterate with a bad attitude? permalink parent award report block reply RetainedByLucifer 11 points 6 days ago Wendy's? permalink parent award report block reply imnotdeadyet 8 points 6 days ago I was thinking Popeye's, but you may be right. permalink parent award report block reply keeman 9 points 6 days ago Waffle house. permalink parent award report block reply TD_Covfefe_Crusader 6 points 6 days ago They can't even muster up the basics of showing up on time for a job. permalink parent award report block reply imnotdeadyet 6 points 6 days ago Very true. permalink parent award report block reply bejeavis 3 points 6 days ago Charity without accountability is abuse permalink parent award report block reply Repentnow 3 points 6 days ago Prison. permalink parent award report block reply spez_this 17 points 6 days ago She had enough money to get her hair braided and dyed pink. She needs to leave the pantry and come back after she's lost a couple of chins and found a job. permalink parent award report block reply rebuildingMyself 7 points 6 days ago They braid each other's hair and she probably stole the hair dye permalink parent award report block reply Smurfection 15 points 6 days ago Given some electrolytes, salt, vitamin D + C and tea, she could probably go a year without eating. To those who don't understand, fat people don't starve.  Given enough water, electrolytes, vitamins and some sun, they lose weight. I know this because I've been doing water fasts for three days a month for almost three years now.  Okay, I miss some months.  I also do intermittent fasting.    It is not true that skipping meals is bad for us.  I believed that almost my entire life, but as I found out, one of the best things you can do for your own health is skip meals, regularly. Breakfast is not the most important meal of the day. No one needs breakfast to get going in the morning.  your body wakes up with a glucose spike from a process known as gluconeogenesis.  That's probably what wakes a person up from sleeping.   You might need some cafffeine in the morning (I recommend coffee with a bit of butter, salt and MTC oil, called bullet coffee) but no, you don't need to eat every meal and you don't need food all the time. permalink parent award report block reply Lurker6 1 points 5 days ago Still bitter that I was of the age where we went through the, \"oh, you shouldn't be eating 3 moderate sized meals with limited snacking in between.  You should be spiking your blood sugar 5 to 7 times a day.\" And the food pyramid... permalink parent award report block reply Smurfection 1 points 4 days ago I actually believed this all the way thru January 2023 when I went Keto and started doing intermittent fasting.  I've been a yo-yo dieter my whole life and I thought it was important to not skip meals.   I was amazed how easy it was to lose weight and keep it off just by being keto and skipping meals. I can't believe how many stupid things I believed about diet and nutrition prior to going keto. permalink parent award report block reply keeman 5 points 6 days ago If you cut off her food stamps then perhaps that would provide some incentive.  Don't feed the animals, you just get dependent animals. permalink parent award report block reply that_sound 4 points 6 days ago Look, I don't care what people do in the privacy of their own homes. But public obesity should be a crime. And at this level it should be a felony. Nobody should ever have to look at something like that. It's disgusting. Children should never be allowed to see it. You don't want that kind of thing normalized. Nobody should grow up thinking being that fat is in any way ok. This person is clearly a threat to herself. Look at what she has done to herself by way of destroying her health. Involuntary institutionalization. Restricted diet, forced exercise, and classes on how to act like an adult. Any future probationary period should exclude any contact with children. Make Asylums Great Again. permalink parent award report block reply\nimnotdeadyet 21 points 6 days ago That's the problem, these people feel \"entitled.\"  They can't function in the work force because they have to be civil and many can't even do that!  Who is going to hire a barely functional illiterate with a bad attitude? permalink parent award report block reply RetainedByLucifer 11 points 6 days ago Wendy's? permalink parent award report block reply imnotdeadyet 8 points 6 days ago I was thinking Popeye's, but you may be right. permalink parent award report block reply keeman 9 points 6 days ago Waffle house. permalink parent award report block reply TD_Covfefe_Crusader 6 points 6 days ago They can't even muster up the basics of showing up on time for a job. permalink parent award report block reply imnotdeadyet 6 points 6 days ago Very true. permalink parent award report block reply bejeavis 3 points 6 days ago Charity without accountability is abuse permalink parent award report block reply Repentnow 3 points 6 days ago Prison. permalink parent award report block reply\nRetainedByLucifer 11 points 6 days ago Wendy's? permalink parent award report block reply imnotdeadyet 8 points 6 days ago I was thinking Popeye's, but you may be right. permalink parent award report block reply keeman 9 points 6 days ago Waffle house. permalink parent award report block reply\nimnotdeadyet 8 points 6 days ago I was thinking Popeye's, but you may be right. permalink parent award report block reply keeman 9 points 6 days ago Waffle house. permalink parent award report block reply\nkeeman 9 points 6 days ago Waffle house. permalink parent award report block reply\nTD_Covfefe_Crusader 6 points 6 days ago They can't even muster up the basics of showing up on time for a job. permalink parent award report block reply imnotdeadyet 6 points 6 days ago Very true. permalink parent award report block reply\nimnotdeadyet 6 points 6 days ago Very true. permalink parent award report block reply\nbejeavis 3 points 6 days ago Charity without accountability is abuse permalink parent award report block reply\nRepentnow 3 points 6 days ago Prison. permalink parent award report block reply\nspez_this 17 points 6 days ago She had enough money to get her hair braided and dyed pink. She needs to leave the pantry and come back after she's lost a couple of chins and found a job. permalink parent award report block reply rebuildingMyself 7 points 6 days ago They braid each other's hair and she probably stole the hair dye permalink parent award report block reply\nrebuildingMyself 7 points 6 days ago They braid each other's hair and she probably stole the hair dye permalink parent award report block reply\nSmurfection 15 points 6 days ago Given some electrolytes, salt, vitamin D + C and tea, she could probably go a year without eating. To those who don't understand, fat people don't starve.  Given enough water, electrolytes, vitamins and some sun, they lose weight. I know this because I've been doing water fasts for three days a month for almost three years now.  Okay, I miss some months.  I also do intermittent fasting.    It is not true that skipping meals is bad for us.  I believed that almost my entire life, but as I found out, one of the best things you can do for your own health is skip meals, regularly. Breakfast is not the most important meal of the day. No one needs breakfast to get going in the morning.  your body wakes up with a glucose spike from a process known as gluconeogenesis.  That's probably what wakes a person up from sleeping.   You might need some cafffeine in the morning (I recommend coffee with a bit of butter, salt and MTC oil, called bullet coffee) but no, you don't need to eat every meal and you don't need food all the time. permalink parent award report block reply Lurker6 1 points 5 days ago Still bitter that I was of the age where we went through the, \"oh, you shouldn't be eating 3 moderate sized meals with limited snacking in between.  You should be spiking your blood sugar 5 to 7 times a day.\" And the food pyramid... permalink parent award report block reply Smurfection 1 points 4 days ago I actually believed this all the way thru January 2023 when I went Keto and started doing intermittent fasting.  I've been a yo-yo dieter my whole life and I thought it was important to not skip meals.   I was amazed how easy it was to lose weight and keep it off just by being keto and skipping meals. I can't believe how many stupid things I believed about diet and nutrition prior to going keto. permalink parent award report block reply\nLurker6 1 points 5 days ago Still bitter that I was of the age where we went through the, \"oh, you shouldn't be eating 3 moderate sized meals with limited snacking in between.  You should be spiking your blood sugar 5 to 7 times a day.\" And the food pyramid... permalink parent award report block reply Smurfection 1 points 4 days ago I actually believed this all the way thru January 2023 when I went Keto and started doing intermittent fasting.  I've been a yo-yo dieter my whole life and I thought it was important to not skip meals.   I was amazed how easy it was to lose weight and keep it off just by being keto and skipping meals. I can't believe how many stupid things I believed about diet and nutrition prior to going keto. permalink parent award report block reply\nSmurfection 1 points 4 days ago I actually believed this all the way thru January 2023 when I went Keto and started doing intermittent fasting.  I've been a yo-yo dieter my whole life and I thought it was important to not skip meals.   I was amazed how easy it was to lose weight and keep it off just by being keto and skipping meals. I can't believe how many stupid things I believed about diet and nutrition prior to going keto. permalink parent award report block reply\nkeeman 5 points 6 days ago If you cut off her food stamps then perhaps that would provide some incentive.  Don't feed the animals, you just get dependent animals. permalink parent award report block reply\nthat_sound 4 points 6 days ago Look, I don't care what people do in the privacy of their own homes. But public obesity should be a crime. And at this level it should be a felony. Nobody should ever have to look at something like that. It's disgusting. Children should never be allowed to see it. You don't want that kind of thing normalized. Nobody should grow up thinking being that fat is in any way ok. This person is clearly a threat to herself. Look at what she has done to herself by way of destroying her health. Involuntary institutionalization. Restricted diet, forced exercise, and classes on how to act like an adult. Any future probationary period should exclude any contact with children. Make Asylums Great Again. permalink parent award report block reply\nFelixtheMan 20 points 6 days ago My mom went to bed hungry as a kid for many years.....she was skinny her whole life.  Weird permalink award report block reply Spicy_cat 7 points 6 days ago I used to come home from a 12 hour shift and steam 1/2 cup of rice for dinner permalink parent award report block reply MastaJoda 4 points 6 days ago I used to sleep with my balled up fist under my stomach to kill hunger pangs. permalink parent award report block reply\nSpicy_cat 7 points 6 days ago I used to come home from a 12 hour shift and steam 1/2 cup of rice for dinner permalink parent award report block reply\nMastaJoda 4 points 6 days ago I used to sleep with my balled up fist under my stomach to kill hunger pangs. permalink parent award report block reply\nMonkeytributo 18 points 6 days ago Obese garden gmone is a crazy ass insult🤣🤣🤣 permalink award report block reply covok48 3 points 6 days ago I’d call them something else, but I’d have to go to ConPro for that. permalink parent award report block reply\ncovok48 3 points 6 days ago I’d call them something else, but I’d have to go to ConPro for that. permalink parent award report block reply\nTEXinLA 15 points 6 days ago 🤣🤣 You have to laugh. Or you'd cry... permalink award report block reply\n1DontTreadOnMe1 13 points 6 days ago Bitch has enough fat stores to last her 3 or 4 years without eating a single drop of food! permalink award report block reply covok48 3 points 6 days ago 100% permalink parent award report block reply MastaJoda 2 points 6 days ago Fact! permalink parent award report block reply\ncovok48 3 points 6 days ago 100% permalink parent award report block reply\nMastaJoda 2 points 6 days ago Fact! permalink parent award report block reply\nFakeNametag 11 points 6 days ago The increase in your health insurance is also paying for her motorized wheelchair permalink award report block reply\nRealassman 8 points 6 days ago In last three years I could have paid my house and lived worry free if not for taxes permalink award report block reply\nahamrbond 8 points 6 days ago Do they have any idea how good it is for your health to fast for a few days? It fixes everything. Even cancer. Just drink some water and relax. After about two or three days, the hunger pangs go away and you can just chill out. You can go a good 30 days without any food and come out of it a better person. Jesus used to go into the desert for 40 days to fast and pray. What a great country it would be if those chubby EBT users took a month off from leeching off society, lost some weight and helped to cure their bodies. permalink award report block reply RedStoneDeepState 7 points 6 days ago That gnome could go for about 80-100 days without food permalink parent award report block reply breathittbill 3 points 6 days ago Just fasting in between meals would be impossible for these land whales. permalink parent award report block reply RyanKeyOh 1 points 6 days ago I do a 72 hour fast every other month permalink parent award report block reply\nRedStoneDeepState 7 points 6 days ago That gnome could go for about 80-100 days without food permalink parent award report block reply\nbreathittbill 3 points 6 days ago Just fasting in between meals would be impossible for these land whales. permalink parent award report block reply\nRyanKeyOh 1 points 6 days ago I do a 72 hour fast every other month permalink parent award report block reply\nKrat 7 points 6 days ago She voted for the communism permalink award report block reply\n_Sully_ 7 points 6 days ago This is some sick comedy. This woman isn't starving and a total drug addict. Have you ever been around a heroin addict? They will say and do anything to keep that train moving forward and that includes robbing their own grandmother and stomping on their own children. We are being held hostage by sociopaths. permalink award report block reply The_Bloofy_Bullshark 5 points 6 days ago 100% I know a woman who loves telling everyone how she’s clean and that she needs money for food and whatnot. Except it was the strangest thing, she kept getting these new pesky track marks. Then she OD’d, obviously not from drugs because she was totally clean and spending her money only on food, and ended up in a hospital for a few weeks because of sepsis. permalink parent award report block reply\nThe_Bloofy_Bullshark 5 points 6 days ago 100% I know a woman who loves telling everyone how she’s clean and that she needs money for food and whatnot. Except it was the strangest thing, she kept getting these new pesky track marks. Then she OD’d, obviously not from drugs because she was totally clean and spending her money only on food, and ended up in a hospital for a few weeks because of sepsis. permalink parent award report block reply\nFormerlurker92 7 points 6 days ago Its the same reason people stopped donating to charity. You just end up encouraging this behavior permalink award report block reply\nTrooph-Hurts 7 points 6 days ago No one rides for free! I’m sure there is something this fat ass can do for us????  I personally think she could work on a road crew a road base compactor before asphalting….. just get her some boots and she’s good to go! permalink award report block reply penguinjay1212 4 points 6 days ago I know you joke, but I wouldnt trust that thing to be a sign spinner. permalink parent award report block reply Trooph-Hurts 6 points 6 days ago Just have them pick up garbage but it has to be videoed as evidence!!!! For sure to your point, these people are good for nothing!…. Completely worthless permalink parent award report block reply\npenguinjay1212 4 points 6 days ago I know you joke, but I wouldnt trust that thing to be a sign spinner. permalink parent award report block reply Trooph-Hurts 6 points 6 days ago Just have them pick up garbage but it has to be videoed as evidence!!!! For sure to your point, these people are good for nothing!…. Completely worthless permalink parent award report block reply\nTrooph-Hurts 6 points 6 days ago Just have them pick up garbage but it has to be videoed as evidence!!!! For sure to your point, these people are good for nothing!…. Completely worthless permalink parent award report block reply\nMayorofTrumpton 5 points 6 days ago That woman has more chins than you would find in the China phone book. She definitely could do with missing a few meals. permalink award report block reply\nyummy_yumm_yumms 5 points 6 days ago Keeps wiping tears that are not there. permalink award report block reply\nIcanbememe 4 points 6 days ago dey all phat permalink award report block reply\nhandshakejackson 3 points 6 days ago I'm conflicted on whether the first person in this video could even work or hold a job.  I don't know that I hate helping a person like her.  She legitimately seems cognitively disabled. permalink award report block reply\nOwmyballz 3 points 6 days ago The good thing for the Jabba the Hutt American is that in two days your body is running on ketones and you start thinking clearer and feel better.  She'll be voting Republican after she gets the seed oils and high fructose syrup out of her sugar caverns, which most people would call arteries and veins. permalink award report block reply\ncook_does 3 points 6 days ago Demoralizing for sure. You think getting your tea taxed is bat, wait until you have to listen to some fat black woman tell \"I is be starvin n' shit up in this bitch\" permalink award report block reply\ndr_gonzo 3 points 6 days ago It's way past time for Americans to wake the fuck up. Blacks and various 3rd worlders don't possess the requisite IQ to live in a free society with whites and Asians, nor will they at any point in the next several centuries. That's just the reality. As a group, they're incapable of competing, which means if we don't ELIMINATE the social welfare programs, they will absolutely, 100% destroy the currency and crash our economy. That is guaranteed. It's already happening and will only get worse and worse as minorities increase in number, and as the interest payment on the national debt consumes a larger and larger piece of total federal revenue. Destroying the middle class, not to mention the free world, is not \"compassionate\". Charity must be PRIVATE and VOLUNTARY. If we don't have a dramatic shift in opinion on these idiotic government programs, we are absolutely fucked. permalink award report block reply\nC0drus 3 points 6 days ago “Garden Gnomes” 🤣🤣🤣 is this the term for joggers that takes the place of “Lawn Jockey”? permalink award report block reply\nSvbHvman 3 points 6 days ago It'll take a while. permalink award report block reply\nJimmyprawns 3 points 6 days ago Ain't nobody starving out there. They're just crying about losing premium cable, fiber internet and having to down grade thier smart phones. permalink award report block reply\nDonsabai 3 points 6 days ago She hungry now but hangry later. Looks like she has never missed a meal in her whole life. permalink award report block reply\nJesusIsMyGod114 3 points 6 days ago Looll garden gnome 🤣🤣 permalink award report block reply\nMisterMAGA 2 points 6 days ago I am indeed getting tired of all this winning permalink award report block reply\n26magarat 2 points 6 days ago Don't insult garden gnomes: they are much cuter than this woman.  She's closer to a Teletubby. permalink award report block reply\nasiatrails 2 points 6 days ago This ghetto flob blub is not starving permalink award report block reply\nSaltyLandscaper 2 points 5 days ago I don't care anymore lard ass. I barely cared before. But now my caring is in the negative. permalink award report block reply\n3-10 2 points 6 days ago When the currency collapses, I will have my shotgun ready to kill these starving people when they try to get my food stores. permalink award report block reply\nelmerecido 2 points 6 days ago If that obeast gets diagnosed with a flesh-eating disease, she’d have 6 months to live. permalink award report block reply\nyummy_yumm_yumms 2 points 6 days ago If anyone could use a little bit of forced fasting, holy shit! permalink award report block reply\nPoonDong 2 points 6 days ago Remember all the obese white people living in the Hoovervilles during the Great Depression? Im so fuckin tired of the welfare state. permalink award report block reply\nmuppeton 2 points 6 days ago I can't believe the news reporter opened with that line and didn't think it would get meme'd into oblivion. permalink award report block reply\nvotedforthe45th 2 points 6 days ago Jessica Jones needs to buy some condoms permalink award report block reply\nmikejones 2 points 6 days ago Where does the money from her check go? permalink award report block reply FrankDuncan 2 points 6 days ago Chins-r-us permalink parent award report block reply\nFrankDuncan 2 points 6 days ago Chins-r-us permalink parent award report block reply\nKeep_on_winning_kag 2 points 6 days ago Nice fake crying you fat pig. permalink award report block reply\nRudeFrog 2 points 6 days ago Shouldn't she just go into hibernation? I remember when poor people used to be skinny because they were actually starving. permalink award report block reply\nLol_Garrus 2 points 6 days ago I wonder how much she spent on that hair. permalink award report block reply\nlaredditarmy 2 points 6 days ago Is this AI? permalink award report block reply\n00buck1200fps 2 points 6 days ago Resources are slim but she isn't permalink award report block reply\nBoyPuzzy4me 2 points 6 days ago She be bilt different cuh this nigga STARVIN!! permalink award report block reply\nMungo 2 points 6 days ago Haha (pointing like Nelson) permalink award report block reply\nTrundlethegreat 1 points 6 days ago That bitch is starving every 32 seconds though. permalink award report block reply\nObambi 1 points 6 days ago Women in this video are fucking dumb and very emotional and fake. Same for that bald headed dude Reporter is a fucking fake news creator there to work on her sizzle reel only permalink award report block reply\ndonteatthat 1 points 6 days ago Danielle Grant can die in a fucking ditch. permalink award report block reply\ntwopoint71 1 points 6 days ago I wouldn't say she's \"starving\". permalink award report block reply\nAverage-Joe 1 points 6 days ago Looks and moves like Grimace permalink award report block reply\n181degrees 1 points 6 days ago The obese black woman could survive one year just on her fat stores permalink award report block reply\nMichalusmichalus 1 points 6 days ago The internet says food banks are giving out junk food because that's all that's left. permalink award report block reply\nEffectiveTactics 1 points 6 days ago The ends of her belt don’t meet. permalink award report block reply\nProudConservativeNY 1 points 6 days ago This fat cunt can hibernate for the winter permalink award report block reply\nFrankDuncan 1 points 5 days ago Blobba the gut permalink award report block reply\nFanakapan 1 points 6 days ago Easy to see how the term 'Lawn Jockey' fell out of use. permalink award report block reply\nSystemfree1632 1 points 6 days ago The dildo of Accountability rarely arrives lubed . permalink award report block reply\nMythArcana 1 points 6 days ago Sometimes we eat, sometimes we don't. permalink award report block reply\nRyanKeyOh 1 points 6 days ago Doubt permalink award report block reply\nAut_MAGA_Aut_Nihil 1 points 6 days ago Two seconds in and already I’m lmao rofl. “Starving”! 😂 permalink award report block reply\nSliced_Beef_Brisket 1 points 6 days ago The government takes about $400 per year from me to pay for SNAP.  Fuck this fat bitch. permalink award report block reply\nGeneticsGuy 0 points 6 days ago I remember when my wife and I qualified for food stamps when we had our first child and we were broke, but both working... this was like 2011, in a state that doesn't give outrageously generous, like California. We qualified for like $400 a month, in 2011 money. Our previous budget was $150 for all our food, and while we didn't eat fancy, we had enough. $400 made us feel like we could eat like kings... we could get steaks, shrimp if we wanted, all the frozen food imaginable. Who cares if that bag of chips was overpriced, we never spent the full $400 anyway. Oh and, because it took them too long to process it, they back paid us like 2.5 months worth and deposited $1000 + $400 on our EBT card for the food stamps we missed. I couldn't believe it. I felt guilty shopping on it, but it was wild how beneficial it was. Now here is the thing... when my I got a slightly better income, we lost ALL benefits, food stamps, medicaid, and so on. We talked to the benefits department of our state and the person literally told us that if my wife cut back her hours from working or chose not to work, then our family income would be low enough to qualify for all these benefits again. They straight-up were recommending my wife to quit her job so we could qualify for welfare again. The system is broken. The incentives are broken. Welfare should be enough to keep you from starving. Give you rice and beans you need to cook yourself, with maybe a few other misc. proteins and carbs. But overall, it should not be something you live on. Thankfully, we were too proud to stay on the system. I wonder how many people would LOVE to be on the system and have all that crap paid for though. It offsets all these other expenses because now they get to spend other people's money on food. permalink award report block reply"}