{"id": "1ARK54Tb9y", "contents": "256 Something Doesn’t Add Up in New Jersey’s Election Results — and Pollsters Know It (pjmedia.com) posted 5 days ago by cd3dog 8 comments award share report block Something Doesn’t Add Up in New Jersey’s Election Results — and Pollsters Know It New Jersey election results raise questions with unexpected voter turnout and polling discrepancies. pjmedia.com\n8 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style HellNoKameltoe 8 points 5 days ago yeah, i don't buy \"5 counties went to Sherrill that Trump had in 2024\". https://nj1015.com/nj-gubernatorial-election-results/ Like with Murphy last time, there's no fucking way she won in a \"landslide\", if she legitimately \"won\" it was razor-thin, especially if all the lead-up had it as a \"dead heat race\". There's no way even with the \"million more registered dems in the state\" they got them all out to vote this time. the bomb threats the \"voting machines down\" and \"not enough provisional ballots\" permalink award report block reply PROCIsAsshoe 2 points 5 days ago I'm sure every illegal in the state voted, only explanation for how 2/3rds of hispanics voted for the democrats. permalink parent award report block reply Scot 7 points 5 days ago No different than California where 90% of exit polls said they opposed redistricting. permalink award report block reply helgaslove 4 points 5 days ago It's because those same people didn't go to jail for 2020 election fraud. permalink award report block reply QueensOwn 4 points 5 days ago Any suggestion of a curiosity in voting anomalies and the left wing nuts go crazy. I think we suspect why but until someone serious actually takes a look nothing will happen. Just look at how many more votes were cast for Sherrill than the prior election. Doesn’t seem explainable. permalink award report block reply HellNoKameltoe 4 points 5 days ago \"noticing our corruption is nazi-esque and literally Hitler!\" permalink parent award report block reply ACActual 2 points 5 days ago Rasmussen talked about this.  Fraud in NJ is off the charts permalink award report block reply EADReddit 1 points 5 days ago There are things you can't vote your way out of.... permalink award report block reply\nHellNoKameltoe 8 points 5 days ago yeah, i don't buy \"5 counties went to Sherrill that Trump had in 2024\". https://nj1015.com/nj-gubernatorial-election-results/ Like with Murphy last time, there's no fucking way she won in a \"landslide\", if she legitimately \"won\" it was razor-thin, especially if all the lead-up had it as a \"dead heat race\". There's no way even with the \"million more registered dems in the state\" they got them all out to vote this time. the bomb threats the \"voting machines down\" and \"not enough provisional ballots\" permalink award report block reply PROCIsAsshoe 2 points 5 days ago I'm sure every illegal in the state voted, only explanation for how 2/3rds of hispanics voted for the democrats. permalink parent award report block reply\nPROCIsAsshoe 2 points 5 days ago I'm sure every illegal in the state voted, only explanation for how 2/3rds of hispanics voted for the democrats. permalink parent award report block reply\nScot 7 points 5 days ago No different than California where 90% of exit polls said they opposed redistricting. permalink award report block reply\nhelgaslove 4 points 5 days ago It's because those same people didn't go to jail for 2020 election fraud. permalink award report block reply\nQueensOwn 4 points 5 days ago Any suggestion of a curiosity in voting anomalies and the left wing nuts go crazy. I think we suspect why but until someone serious actually takes a look nothing will happen. Just look at how many more votes were cast for Sherrill than the prior election. Doesn’t seem explainable. permalink award report block reply HellNoKameltoe 4 points 5 days ago \"noticing our corruption is nazi-esque and literally Hitler!\" permalink parent award report block reply\nHellNoKameltoe 4 points 5 days ago \"noticing our corruption is nazi-esque and literally Hitler!\" permalink parent award report block reply\nACActual 2 points 5 days ago Rasmussen talked about this.  Fraud in NJ is off the charts permalink award report block reply\nEADReddit 1 points 5 days ago There are things you can't vote your way out of.... permalink award report block reply"}