{"id": "1ARK9nPM4y", "contents": "13 Trump's Pentagon name change could cost up to $2 billion.\nOfficially changing the Department of Defense to the Department of War can only be done by Congress and would require updating thousands of signs, rewriting digital code and creating new letterheads, placards and badges. (www.nbcnews.com) posted 6 hours ago by Eruditio 4 comments award share report block Trump's Pentagon name change could cost up to $2 billion Officially changing the Department of Defense to the Department of War  can only be done by Congress and would require updating thousands of signs, rewriting digital code and creating new letterheads, placards and badges. www.nbcnews.com\n4 comments Sort by Top Top New Worst Old Save Crucible 3 points 6 hours ago We are a country geographically separated from where all the wars are. One name implies protection of our homeland. The other implies we are a dying imperialist nation fighting forever wars with no strategic military objective. This was a silly idea, IMHFO.  We don't want war - We want MAGA. permalink award report block reply henri_derelicte 3 points 6 hours ago How much money did Biden’s “naming commission” waste renaming Fort Bragg, Benning, Hood, etc.? permalink award report block reply PatriotSkorzeny 3 points 6 hours ago 600,000 Chinese can do it. permalink award report block reply Whoopies_tds 2 points 5 hours ago Waste of time and money and does nothing to purge the corruption in DC permalink award report block reply\nCrucible 3 points 6 hours ago We are a country geographically separated from where all the wars are. One name implies protection of our homeland. The other implies we are a dying imperialist nation fighting forever wars with no strategic military objective. This was a silly idea, IMHFO.  We don't want war - We want MAGA. permalink award report block reply\nhenri_derelicte 3 points 6 hours ago How much money did Biden’s “naming commission” waste renaming Fort Bragg, Benning, Hood, etc.? permalink award report block reply\nPatriotSkorzeny 3 points 6 hours ago 600,000 Chinese can do it. permalink award report block reply\nWhoopies_tds 2 points 5 hours ago Waste of time and money and does nothing to purge the corruption in DC permalink award report block reply"}