{"id": "1ARK5BG34V", "contents": "538 Impossibility posted 3 days ago by TinfoilHardhat 7 comments award share download report block\n7 comments Sort by Top Top New Worst Old Save Pikes985 14 points 3 days ago Pam Bondi prosecuting the Deep State. permalink award report block reply Crappydatum 7 points 3 days ago Winner winner chicken dinner! ☝️☝️😆 permalink parent award report block reply Scumbag-reddit 3 points 3 days ago Why would she prosecute her own? Anyone living in Florida during her tenure here knows what shes about permalink parent award report block reply Aggrieved03 7 points 3 days ago 2020 election results, an honest politician, j6 being organic, accountability……. permalink award report block reply South_Florida_Guy 5 points 3 days ago Biden getting 81m votes permalink award report block reply heeeeeeeeeeeeemeyer 2 points 3 days ago Very fake, very gay. Bullets don't do that. permalink award report block reply TinfoilHardhat OP 1 points 3 days ago Could be.  I was wondering why one lacked rifling. permalink parent award report block reply\nPikes985 14 points 3 days ago Pam Bondi prosecuting the Deep State. permalink award report block reply Crappydatum 7 points 3 days ago Winner winner chicken dinner! ☝️☝️😆 permalink parent award report block reply Scumbag-reddit 3 points 3 days ago Why would she prosecute her own? Anyone living in Florida during her tenure here knows what shes about permalink parent award report block reply\nCrappydatum 7 points 3 days ago Winner winner chicken dinner! ☝️☝️😆 permalink parent award report block reply\nScumbag-reddit 3 points 3 days ago Why would she prosecute her own? Anyone living in Florida during her tenure here knows what shes about permalink parent award report block reply\nAggrieved03 7 points 3 days ago 2020 election results, an honest politician, j6 being organic, accountability……. permalink award report block reply\nSouth_Florida_Guy 5 points 3 days ago Biden getting 81m votes permalink award report block reply\nheeeeeeeeeeeeemeyer 2 points 3 days ago Very fake, very gay. Bullets don't do that. permalink award report block reply TinfoilHardhat OP 1 points 3 days ago Could be.  I was wondering why one lacked rifling. permalink parent award report block reply\nTinfoilHardhat OP 1 points 3 days ago Could be.  I was wondering why one lacked rifling. permalink parent award report block reply"}