{"id": "1ARK9pghDW", "contents": "39 Byron Donalds calls for MORE Immigrants, Slams \"Woke\" Republicans posted 1 hour ago by Trumpwon306 25 comments award share report block Anthony Sabatini @AnthonySabatini • 2h WOW—@ByronDonalds gave a speech in Miami this week attacking republican voters who want to reduce legal immigration & visas If Donalds is elected governor, he’s going to work to make Florida “more welcome” to the visa holders who are stealing our jobs The speech was largely a\n25 comments Sort by Top Top New Worst Old Save 1True-translation 11 points 1 hour ago Woke right lol....not gonna happen retards permalink award report block reply newestofnew 7 points 58 minutes ago its a shame, he had so much promise too. permalink parent award report block reply Trumpwon306 OP 4 points 51 minutes ago Besides being black, in what way was he any more promising than the average Florida Representative? permalink parent award report block reply newestofnew 3 points 41 minutes ago He is the only other major Republican along with JD Vance capable of dismantling bad faith questioning from hostile media with ease. He's a gifted and talented orator. It's just the facts. He was MAGA from the start, part of the millennial cohort capable of attracting young voters. Shame he kissed the wall. The problem is you're fixated on his race. Let's be honest you're the type who would claim Thomas isn't the most conservative or based Supreme Court Justice too. permalink parent award report block reply Trumpwon306 OP 6 points 39 minutes ago Thomas is the most conservative and based justice. Donaldson is just an Israel first coon that delivers speeches so painfully outdated and boring, that I'm struggling to understand how you can consider him a talented orator. I mean unless it's because he is black, and you're astonished that he can speak without resorting to ebonics. permalink parent award report block reply view 1 more comments... South_Florida_Guy 1 points 35 seconds ago Donalds is  grifter, Matt Gaetz would make a way better governor. permalink parent award report block reply South_Florida_Guy 1 points 2 minutes ago He talks a lot of shit but he's a total grifter. He actually endorsed a carpet bagging democrat jew from philly that came down here (didn't even move into the district he was running for mind you) and tried to make pretend was the greatest maga candidate since Trump himself to run against DWS and it turned out the guy (Bryan Lieb) was actually a plant from DWS herself that paid him to run in the primary vs an actual local republican and cause that guy to waste money to fend him off. Donalds endorsed the guy for a measly 10k campaign donation (which actually came from DWS) permalink parent award report block reply Luvs_2_Bop 2 points 24 minutes ago \"Woke right\" doesn't seem like the right way to describe those of us who are not disillusioned. I’d consider myself & my frens the “Based Right” permalink parent award report block reply loooooof 8 points 1 hour ago Anyone spouting \"woke right\" nonsense is a compromised shill. permalink award report block reply South_Florida_Guy 1 points 5 seconds ago Dude always been been, he's a total grifter, never trusted him permalink parent award report block reply Roadpower 8 points 1 hour ago I guess it is time to check opensecrets.org on Donalds. Hmm, lets see.. Oh there it is. AIPAC. https://www.opensecrets.org/members-of-congress/byron-donalds/contributors?cid=N00034016&cycle=CAREER permalink award report block reply Covfefebrulee 7 points 1 hour ago And…he just lost me. permalink award report block reply HumphreyPlowjogger 6 points 1 hour ago Well Buh bye. permalink award report block reply FusionBlack 5 points 1 hour ago He wont fly in my district. permalink award report block reply RudeFrog 4 points 36 minutes ago Anyone screaming woke right is woke right which is just another way of saying rino faggot permalink award report block reply rivetjoint2 3 points 25 minutes ago Is the woke right part of the Tuckercaust? permalink award report block reply JoePlumber 2 points 45 minutes ago How the fuck is it woke to say we are full up no more immigrants legal or illegal? Neither party supports us. permalink award report block reply South_Florida_Guy 2 points 4 minutes ago Dude is a slimy grifter never did trust him and will not vote for him permalink award report block reply Callsign_Fox1 2 points 54 minutes ago $7k stimmies hit his account. permalink award report block reply DrVSGGEOTUSPhD 1 points 1 minute ago Too bad I liked that guy. I guess the memo went out: if you want to get campaign funding you better shill for Total White Death? permalink award report block reply SpeekFreely 1 points 23 minutes ago Connect the dots folks, woke Right and a speech in Miami. permalink award report block reply Whoopies_tds 1 points 58 minutes ago People get outraged when they hear \"more legal immigrants\" IMO, there are some examples where it is absolutely needed. FWIW, I do not support warm body entry level mediocre IT/programmers. On the other hand, highly specialized people that will help America to lead in tech, medicine and other critical industries are something I would 100% support. China is leading the pack in AI partly because their kids aren't taught gender studies but instead critical math/science. permalink award report block reply couranto 1 points 17 minutes ago He did not. Total lie. permalink award report block reply hellohellohellohell 0 points 1 hour ago I've never liked Donalds, but I'm wondering who Sabatini works for? Is it true that DeSantis is still trying to clear the field for his wife? permalink award report block reply\n1True-translation 11 points 1 hour ago Woke right lol....not gonna happen retards permalink award report block reply newestofnew 7 points 58 minutes ago its a shame, he had so much promise too. permalink parent award report block reply Trumpwon306 OP 4 points 51 minutes ago Besides being black, in what way was he any more promising than the average Florida Representative? permalink parent award report block reply newestofnew 3 points 41 minutes ago He is the only other major Republican along with JD Vance capable of dismantling bad faith questioning from hostile media with ease. He's a gifted and talented orator. It's just the facts. He was MAGA from the start, part of the millennial cohort capable of attracting young voters. Shame he kissed the wall. The problem is you're fixated on his race. Let's be honest you're the type who would claim Thomas isn't the most conservative or based Supreme Court Justice too. permalink parent award report block reply Trumpwon306 OP 6 points 39 minutes ago Thomas is the most conservative and based justice. Donaldson is just an Israel first coon that delivers speeches so painfully outdated and boring, that I'm struggling to understand how you can consider him a talented orator. I mean unless it's because he is black, and you're astonished that he can speak without resorting to ebonics. permalink parent award report block reply view 1 more comments... South_Florida_Guy 1 points 35 seconds ago Donalds is  grifter, Matt Gaetz would make a way better governor. permalink parent award report block reply South_Florida_Guy 1 points 2 minutes ago He talks a lot of shit but he's a total grifter. He actually endorsed a carpet bagging democrat jew from philly that came down here (didn't even move into the district he was running for mind you) and tried to make pretend was the greatest maga candidate since Trump himself to run against DWS and it turned out the guy (Bryan Lieb) was actually a plant from DWS herself that paid him to run in the primary vs an actual local republican and cause that guy to waste money to fend him off. Donalds endorsed the guy for a measly 10k campaign donation (which actually came from DWS) permalink parent award report block reply Luvs_2_Bop 2 points 24 minutes ago \"Woke right\" doesn't seem like the right way to describe those of us who are not disillusioned. I’d consider myself & my frens the “Based Right” permalink parent award report block reply\nnewestofnew 7 points 58 minutes ago its a shame, he had so much promise too. permalink parent award report block reply Trumpwon306 OP 4 points 51 minutes ago Besides being black, in what way was he any more promising than the average Florida Representative? permalink parent award report block reply newestofnew 3 points 41 minutes ago He is the only other major Republican along with JD Vance capable of dismantling bad faith questioning from hostile media with ease. He's a gifted and talented orator. It's just the facts. He was MAGA from the start, part of the millennial cohort capable of attracting young voters. Shame he kissed the wall. The problem is you're fixated on his race. Let's be honest you're the type who would claim Thomas isn't the most conservative or based Supreme Court Justice too. permalink parent award report block reply Trumpwon306 OP 6 points 39 minutes ago Thomas is the most conservative and based justice. Donaldson is just an Israel first coon that delivers speeches so painfully outdated and boring, that I'm struggling to understand how you can consider him a talented orator. I mean unless it's because he is black, and you're astonished that he can speak without resorting to ebonics. permalink parent award report block reply view 1 more comments... South_Florida_Guy 1 points 35 seconds ago Donalds is  grifter, Matt Gaetz would make a way better governor. permalink parent award report block reply South_Florida_Guy 1 points 2 minutes ago He talks a lot of shit but he's a total grifter. He actually endorsed a carpet bagging democrat jew from philly that came down here (didn't even move into the district he was running for mind you) and tried to make pretend was the greatest maga candidate since Trump himself to run against DWS and it turned out the guy (Bryan Lieb) was actually a plant from DWS herself that paid him to run in the primary vs an actual local republican and cause that guy to waste money to fend him off. Donalds endorsed the guy for a measly 10k campaign donation (which actually came from DWS) permalink parent award report block reply\nTrumpwon306 OP 4 points 51 minutes ago Besides being black, in what way was he any more promising than the average Florida Representative? permalink parent award report block reply newestofnew 3 points 41 minutes ago He is the only other major Republican along with JD Vance capable of dismantling bad faith questioning from hostile media with ease. He's a gifted and talented orator. It's just the facts. He was MAGA from the start, part of the millennial cohort capable of attracting young voters. Shame he kissed the wall. The problem is you're fixated on his race. Let's be honest you're the type who would claim Thomas isn't the most conservative or based Supreme Court Justice too. permalink parent award report block reply Trumpwon306 OP 6 points 39 minutes ago Thomas is the most conservative and based justice. Donaldson is just an Israel first coon that delivers speeches so painfully outdated and boring, that I'm struggling to understand how you can consider him a talented orator. I mean unless it's because he is black, and you're astonished that he can speak without resorting to ebonics. permalink parent award report block reply view 1 more comments... South_Florida_Guy 1 points 35 seconds ago Donalds is  grifter, Matt Gaetz would make a way better governor. permalink parent award report block reply South_Florida_Guy 1 points 2 minutes ago He talks a lot of shit but he's a total grifter. He actually endorsed a carpet bagging democrat jew from philly that came down here (didn't even move into the district he was running for mind you) and tried to make pretend was the greatest maga candidate since Trump himself to run against DWS and it turned out the guy (Bryan Lieb) was actually a plant from DWS herself that paid him to run in the primary vs an actual local republican and cause that guy to waste money to fend him off. Donalds endorsed the guy for a measly 10k campaign donation (which actually came from DWS) permalink parent award report block reply\nnewestofnew 3 points 41 minutes ago He is the only other major Republican along with JD Vance capable of dismantling bad faith questioning from hostile media with ease. He's a gifted and talented orator. It's just the facts. He was MAGA from the start, part of the millennial cohort capable of attracting young voters. Shame he kissed the wall. The problem is you're fixated on his race. Let's be honest you're the type who would claim Thomas isn't the most conservative or based Supreme Court Justice too. permalink parent award report block reply Trumpwon306 OP 6 points 39 minutes ago Thomas is the most conservative and based justice. Donaldson is just an Israel first coon that delivers speeches so painfully outdated and boring, that I'm struggling to understand how you can consider him a talented orator. I mean unless it's because he is black, and you're astonished that he can speak without resorting to ebonics. permalink parent award report block reply view 1 more comments... South_Florida_Guy 1 points 35 seconds ago Donalds is  grifter, Matt Gaetz would make a way better governor. permalink parent award report block reply\nTrumpwon306 OP 6 points 39 minutes ago Thomas is the most conservative and based justice. Donaldson is just an Israel first coon that delivers speeches so painfully outdated and boring, that I'm struggling to understand how you can consider him a talented orator. I mean unless it's because he is black, and you're astonished that he can speak without resorting to ebonics. permalink parent award report block reply view 1 more comments...\nSouth_Florida_Guy 1 points 35 seconds ago Donalds is  grifter, Matt Gaetz would make a way better governor. permalink parent award report block reply\nSouth_Florida_Guy 1 points 2 minutes ago He talks a lot of shit but he's a total grifter. He actually endorsed a carpet bagging democrat jew from philly that came down here (didn't even move into the district he was running for mind you) and tried to make pretend was the greatest maga candidate since Trump himself to run against DWS and it turned out the guy (Bryan Lieb) was actually a plant from DWS herself that paid him to run in the primary vs an actual local republican and cause that guy to waste money to fend him off. Donalds endorsed the guy for a measly 10k campaign donation (which actually came from DWS) permalink parent award report block reply\nLuvs_2_Bop 2 points 24 minutes ago \"Woke right\" doesn't seem like the right way to describe those of us who are not disillusioned. I’d consider myself & my frens the “Based Right” permalink parent award report block reply\nloooooof 8 points 1 hour ago Anyone spouting \"woke right\" nonsense is a compromised shill. permalink award report block reply South_Florida_Guy 1 points 5 seconds ago Dude always been been, he's a total grifter, never trusted him permalink parent award report block reply\nSouth_Florida_Guy 1 points 5 seconds ago Dude always been been, he's a total grifter, never trusted him permalink parent award report block reply\nRoadpower 8 points 1 hour ago I guess it is time to check opensecrets.org on Donalds. Hmm, lets see.. Oh there it is. AIPAC. https://www.opensecrets.org/members-of-congress/byron-donalds/contributors?cid=N00034016&cycle=CAREER permalink award report block reply\nCovfefebrulee 7 points 1 hour ago And…he just lost me. permalink award report block reply\nHumphreyPlowjogger 6 points 1 hour ago Well Buh bye. permalink award report block reply\nFusionBlack 5 points 1 hour ago He wont fly in my district. permalink award report block reply\nRudeFrog 4 points 36 minutes ago Anyone screaming woke right is woke right which is just another way of saying rino faggot permalink award report block reply\nrivetjoint2 3 points 25 minutes ago Is the woke right part of the Tuckercaust? permalink award report block reply\nJoePlumber 2 points 45 minutes ago How the fuck is it woke to say we are full up no more immigrants legal or illegal? Neither party supports us. permalink award report block reply\nSouth_Florida_Guy 2 points 4 minutes ago Dude is a slimy grifter never did trust him and will not vote for him permalink award report block reply\nCallsign_Fox1 2 points 54 minutes ago $7k stimmies hit his account. permalink award report block reply\nDrVSGGEOTUSPhD 1 points 1 minute ago Too bad I liked that guy. I guess the memo went out: if you want to get campaign funding you better shill for Total White Death? permalink award report block reply\nSpeekFreely 1 points 23 minutes ago Connect the dots folks, woke Right and a speech in Miami. permalink award report block reply\nWhoopies_tds 1 points 58 minutes ago People get outraged when they hear \"more legal immigrants\" IMO, there are some examples where it is absolutely needed. FWIW, I do not support warm body entry level mediocre IT/programmers. On the other hand, highly specialized people that will help America to lead in tech, medicine and other critical industries are something I would 100% support. China is leading the pack in AI partly because their kids aren't taught gender studies but instead critical math/science. permalink award report block reply\ncouranto 1 points 17 minutes ago He did not. Total lie. permalink award report block reply\nhellohellohellohell 0 points 1 hour ago I've never liked Donalds, but I'm wondering who Sabatini works for? Is it true that DeSantis is still trying to clear the field for his wife? permalink award report block reply"}