{"id": "1ARK9oWvie", "contents": "31 🔴RULE OF THUMB: Never attack Trump for ANYTHING while he is president. Chances are you don't know what he knows. Remember, Trump is a pragmatist, not an ideologue. He sees the numbers and is not ideologically opposed to H1-B's if they solve a practical problem. P.S., Trump is right. posted 1 hour ago by DeusVult1096 37 comments award share download report block\n37 comments Sort by Top Top New Worst Old Save Wildwind 18 points 1 hour ago Disagree. If he messes up by all means call him out. And he has screwed up on a few items the last 2 months. Just because he is president  doesnt mean that people can not tell him. permalink award report block reply patrioticwinning3 5 points 1 hour ago Yes OP is posting the SAME QTARD BULLSHIT they have been spewing from the First Trump administration!  Fuck those qtards! Edit: They are now offer $3-5k PER POST promoting H1Bs! https://x.com/Will_Panic/status/1988676599303270490 permalink parent award report block reply Awakened 11 points 1 hour ago Nah, he's completely wrong about H1bs and your graphic is complete bullshit. We are not in a cult and we can and will call him out. Those of us that work in tech know it's a great big scam. More importantly, we want to win the midterms. His messaging on H1b is retarded and will be one of many factors that cause us to lose against the very unpopular dems.\nYou've gotta go back. permalink award report block reply patrioticwinning3 1 points 1 hour ago Agreed!  It's like he's become the globohomos he railed against on all three campaign trails! permalink parent award report block reply JoePlumber 7 points 1 hour ago Cool nonsense from lib sources permalink award report block reply patrioticwinning3 2 points 1 hour ago Fake News! permalink parent award report block reply JoePlumber 2 points 16 minutes ago There is no shortage of tech workers there's mass layoffs at a new tech firm every day. There is no shortage of ANY kind of workers just companies that would rather pay for h1b than keep Americans employed. Americans can learn any job just like foreigners. This idea that foreigners are more skilled or smarter than US workers is disingenuous bullshit. Americans have trillions of dollars in student debt they are definitely qualified to do whatever jobs we're filling with foreigners. permalink parent award report block reply SpeekFreely 7 points 1 hour ago That’s assuming the AI Ponzi scheme will materialize, which it will not. permalink award report block reply RandoBudster 2 points 58 minutes ago AI may be the next 'climate change' permalink parent award report block reply patrioticwinning3 2 points 49 minutes ago I think its more akin to the Neo Con, \"Fight them over there!\"  Just sight \"muh national security.\" Hey why can't we have affordable power, \"muh national security for AI.\"  Hey why can't we get accepted to colleges to study AI?  \"We need to allow Indians and Chinese in to study AI instead of you because, muh National Security\"  Hey, these Americans just graduated with degrees in AI why can't they get jobs, \"We need to give it to Chinese and Indians because muh national security...\" :p permalink parent award report block reply SpeekFreely 1 points 54 minutes ago Good point, some might argue it already is. permalink parent award report block reply breadbaker 7 points 1 hour ago Fuck off you total moron. I am not in a cult. get a brain and learn when you are being screwed. You fucking inbred loser. permalink award report block reply patrioticwinning3 1 points 51 minutes ago ^^^This guys gets it! permalink parent award report block reply lostmyoldpassword 4 points 1 hour ago Did you delete your first attempt? Not the response you were hoping for? lemme copy paste my response for you so you don't lose it - I will paraphrase the others responses if you want me to.  \"For decades now, all of our lives for the most part - our country's tax dollars have been syphoned off to foreign countries and greedy corporations. The state of public schooling in this country has plummeted in that time - those schools teaching fucking Python to 12 year old Indian kids - were bought and paid for by these sleezy fucks and USAID money. Of course they want infinite cheap labor desperate third worlders who can code, but don't know how to fucking exist in a society, or know that they deserve more than a fucking POD and a warm sandwich. Whether or not you know it - in this post you are defending those evil fucks - even worse you are mocking those that are the victims and trying to incite them with your inflammatory rhetoric.\" permalink award report block reply lostmyoldpassword 2 points 1 hour ago Oh you do want me to paraphrase what they said?  I'll take that downvote as meaning that. Ok - the 3 other people who responded to you, before you deleted it and tried again - wanted to let you know - hey, you're a fucking piece of shit, and a liar, AND they hate you.  That was the gist of it from what I can recall.  Cool.  Good talk. permalink parent award report block reply patrioticwinning3 0 points 1 hour ago LMFAO how many times to you think this qtard will delete and repost this bullshit!? XD permalink parent award report block reply lostmyoldpassword 2 points 1 hour ago Dunno - deusvult is one of the big guns, they only bring him out when shit is real bad - I honestly don't know what they will do. permalink parent award report block reply patrioticwinning3 -1 points 1 hour ago I noticed he is all in for Isreal First and a mossad faggot as well... permalink parent award report block reply lostmyoldpassword 0 points 60 minutes ago Your tone is suss, and you're trying to draw connections to unrelated shit, for reasons I can't even fathom. permalink parent award report block reply view 5 more comments... MemeWarsVet 5 points 1 hour ago America First is a very clear mandate and he is straying from it. permalink award report block reply patrioticwinning3 0 points 1 hour ago Straying?  Seems like he's doing a complete 180! permalink parent award report block reply MemeWarsVet 1 points 20 minutes ago No - not even close.  But he is straying. permalink parent award report block reply whatsupup 3 points 1 hour ago did u take the vax? i mean he might know something you dont? if you didn't, you should shuddup. permalink award report block reply patrioticwinning3 2 points 52 minutes ago This is the same qtard shit they have been pushing since the first administration! permalink parent award report block reply RandoBudster 3 points 58 minutes ago So fill all these jobs with qualified Americans first then the remainder can be outsourced to poo-worlders. Right now thats completely reversed and we all know why. I have very low confidence in these projections anyway, their gaming for their own benefit. permalink award report block reply patrioticwinning3 4 points 50 minutes ago There are currently about a million US workers in Stem Fields that have been laid off due to importation of cheap labor or outsourcing of cheap labor, ironically by people who live in foreign countries but were educated here.  If we had record high labor participation rate and still couldn't find jobs, I would have no problem with this, but WE DON'T! permalink parent award report block reply Wizard_Glick 3 points 57 minutes ago Until you lose your job... permalink award report block reply shogun5000 3 points 56 minutes ago Fucking Q tard permalink award report block reply Wrexxis780 2 points 34 minutes ago By that logic we shouldn’t have pushed back against the vax and all got the clot shot permalink award report block reply togtfo 1 points 27 minutes ago If you want to join a cult, be our guest.  Don't expect anyone else to follow you, you absolute unit of a faggot. permalink award report block reply TakingCoatsWIN 1 points 1 hour ago There's an U.S. arms race against China on who will achieve the next level of AI first, whoever does will control the future of humanity. This is the current situation. permalink award report block reply GoldenSpirals 1 points 2 minutes ago If there is even ONE fucking jeet who has a job I can do its too many. Ive been unemployed for over a year. permalink award report block reply DestroyerofCobwebs 1 points 44 minutes ago The obvious problem, and I do mean obvious, is that every statistic you cite is either created by, or easily manipulated by, the very people who stand to profit off importing the cheap labor. permalink award report block reply\nWildwind 18 points 1 hour ago Disagree. If he messes up by all means call him out. And he has screwed up on a few items the last 2 months. Just because he is president  doesnt mean that people can not tell him. permalink award report block reply patrioticwinning3 5 points 1 hour ago Yes OP is posting the SAME QTARD BULLSHIT they have been spewing from the First Trump administration!  Fuck those qtards! Edit: They are now offer $3-5k PER POST promoting H1Bs! https://x.com/Will_Panic/status/1988676599303270490 permalink parent award report block reply\npatrioticwinning3 5 points 1 hour ago Yes OP is posting the SAME QTARD BULLSHIT they have been spewing from the First Trump administration!  Fuck those qtards! Edit: They are now offer $3-5k PER POST promoting H1Bs! https://x.com/Will_Panic/status/1988676599303270490 permalink parent award report block reply\nAwakened 11 points 1 hour ago Nah, he's completely wrong about H1bs and your graphic is complete bullshit. We are not in a cult and we can and will call him out. Those of us that work in tech know it's a great big scam. More importantly, we want to win the midterms. His messaging on H1b is retarded and will be one of many factors that cause us to lose against the very unpopular dems.\nYou've gotta go back. permalink award report block reply patrioticwinning3 1 points 1 hour ago Agreed!  It's like he's become the globohomos he railed against on all three campaign trails! permalink parent award report block reply\npatrioticwinning3 1 points 1 hour ago Agreed!  It's like he's become the globohomos he railed against on all three campaign trails! permalink parent award report block reply\nJoePlumber 7 points 1 hour ago Cool nonsense from lib sources permalink award report block reply patrioticwinning3 2 points 1 hour ago Fake News! permalink parent award report block reply JoePlumber 2 points 16 minutes ago There is no shortage of tech workers there's mass layoffs at a new tech firm every day. There is no shortage of ANY kind of workers just companies that would rather pay for h1b than keep Americans employed. Americans can learn any job just like foreigners. This idea that foreigners are more skilled or smarter than US workers is disingenuous bullshit. Americans have trillions of dollars in student debt they are definitely qualified to do whatever jobs we're filling with foreigners. permalink parent award report block reply\npatrioticwinning3 2 points 1 hour ago Fake News! permalink parent award report block reply JoePlumber 2 points 16 minutes ago There is no shortage of tech workers there's mass layoffs at a new tech firm every day. There is no shortage of ANY kind of workers just companies that would rather pay for h1b than keep Americans employed. Americans can learn any job just like foreigners. This idea that foreigners are more skilled or smarter than US workers is disingenuous bullshit. Americans have trillions of dollars in student debt they are definitely qualified to do whatever jobs we're filling with foreigners. permalink parent award report block reply\nJoePlumber 2 points 16 minutes ago There is no shortage of tech workers there's mass layoffs at a new tech firm every day. There is no shortage of ANY kind of workers just companies that would rather pay for h1b than keep Americans employed. Americans can learn any job just like foreigners. This idea that foreigners are more skilled or smarter than US workers is disingenuous bullshit. Americans have trillions of dollars in student debt they are definitely qualified to do whatever jobs we're filling with foreigners. permalink parent award report block reply\nSpeekFreely 7 points 1 hour ago That’s assuming the AI Ponzi scheme will materialize, which it will not. permalink award report block reply RandoBudster 2 points 58 minutes ago AI may be the next 'climate change' permalink parent award report block reply patrioticwinning3 2 points 49 minutes ago I think its more akin to the Neo Con, \"Fight them over there!\"  Just sight \"muh national security.\" Hey why can't we have affordable power, \"muh national security for AI.\"  Hey why can't we get accepted to colleges to study AI?  \"We need to allow Indians and Chinese in to study AI instead of you because, muh National Security\"  Hey, these Americans just graduated with degrees in AI why can't they get jobs, \"We need to give it to Chinese and Indians because muh national security...\" :p permalink parent award report block reply SpeekFreely 1 points 54 minutes ago Good point, some might argue it already is. permalink parent award report block reply\nRandoBudster 2 points 58 minutes ago AI may be the next 'climate change' permalink parent award report block reply patrioticwinning3 2 points 49 minutes ago I think its more akin to the Neo Con, \"Fight them over there!\"  Just sight \"muh national security.\" Hey why can't we have affordable power, \"muh national security for AI.\"  Hey why can't we get accepted to colleges to study AI?  \"We need to allow Indians and Chinese in to study AI instead of you because, muh National Security\"  Hey, these Americans just graduated with degrees in AI why can't they get jobs, \"We need to give it to Chinese and Indians because muh national security...\" :p permalink parent award report block reply SpeekFreely 1 points 54 minutes ago Good point, some might argue it already is. permalink parent award report block reply\npatrioticwinning3 2 points 49 minutes ago I think its more akin to the Neo Con, \"Fight them over there!\"  Just sight \"muh national security.\" Hey why can't we have affordable power, \"muh national security for AI.\"  Hey why can't we get accepted to colleges to study AI?  \"We need to allow Indians and Chinese in to study AI instead of you because, muh National Security\"  Hey, these Americans just graduated with degrees in AI why can't they get jobs, \"We need to give it to Chinese and Indians because muh national security...\" :p permalink parent award report block reply\nSpeekFreely 1 points 54 minutes ago Good point, some might argue it already is. permalink parent award report block reply\nbreadbaker 7 points 1 hour ago Fuck off you total moron. I am not in a cult. get a brain and learn when you are being screwed. You fucking inbred loser. permalink award report block reply patrioticwinning3 1 points 51 minutes ago ^^^This guys gets it! permalink parent award report block reply\npatrioticwinning3 1 points 51 minutes ago ^^^This guys gets it! permalink parent award report block reply\nlostmyoldpassword 4 points 1 hour ago Did you delete your first attempt? Not the response you were hoping for? lemme copy paste my response for you so you don't lose it - I will paraphrase the others responses if you want me to.  \"For decades now, all of our lives for the most part - our country's tax dollars have been syphoned off to foreign countries and greedy corporations. The state of public schooling in this country has plummeted in that time - those schools teaching fucking Python to 12 year old Indian kids - were bought and paid for by these sleezy fucks and USAID money. Of course they want infinite cheap labor desperate third worlders who can code, but don't know how to fucking exist in a society, or know that they deserve more than a fucking POD and a warm sandwich. Whether or not you know it - in this post you are defending those evil fucks - even worse you are mocking those that are the victims and trying to incite them with your inflammatory rhetoric.\" permalink award report block reply lostmyoldpassword 2 points 1 hour ago Oh you do want me to paraphrase what they said?  I'll take that downvote as meaning that. Ok - the 3 other people who responded to you, before you deleted it and tried again - wanted to let you know - hey, you're a fucking piece of shit, and a liar, AND they hate you.  That was the gist of it from what I can recall.  Cool.  Good talk. permalink parent award report block reply patrioticwinning3 0 points 1 hour ago LMFAO how many times to you think this qtard will delete and repost this bullshit!? XD permalink parent award report block reply lostmyoldpassword 2 points 1 hour ago Dunno - deusvult is one of the big guns, they only bring him out when shit is real bad - I honestly don't know what they will do. permalink parent award report block reply patrioticwinning3 -1 points 1 hour ago I noticed he is all in for Isreal First and a mossad faggot as well... permalink parent award report block reply lostmyoldpassword 0 points 60 minutes ago Your tone is suss, and you're trying to draw connections to unrelated shit, for reasons I can't even fathom. permalink parent award report block reply view 5 more comments...\nlostmyoldpassword 2 points 1 hour ago Oh you do want me to paraphrase what they said?  I'll take that downvote as meaning that. Ok - the 3 other people who responded to you, before you deleted it and tried again - wanted to let you know - hey, you're a fucking piece of shit, and a liar, AND they hate you.  That was the gist of it from what I can recall.  Cool.  Good talk. permalink parent award report block reply\npatrioticwinning3 0 points 1 hour ago LMFAO how many times to you think this qtard will delete and repost this bullshit!? XD permalink parent award report block reply lostmyoldpassword 2 points 1 hour ago Dunno - deusvult is one of the big guns, they only bring him out when shit is real bad - I honestly don't know what they will do. permalink parent award report block reply patrioticwinning3 -1 points 1 hour ago I noticed he is all in for Isreal First and a mossad faggot as well... permalink parent award report block reply lostmyoldpassword 0 points 60 minutes ago Your tone is suss, and you're trying to draw connections to unrelated shit, for reasons I can't even fathom. permalink parent award report block reply view 5 more comments...\nlostmyoldpassword 2 points 1 hour ago Dunno - deusvult is one of the big guns, they only bring him out when shit is real bad - I honestly don't know what they will do. permalink parent award report block reply patrioticwinning3 -1 points 1 hour ago I noticed he is all in for Isreal First and a mossad faggot as well... permalink parent award report block reply lostmyoldpassword 0 points 60 minutes ago Your tone is suss, and you're trying to draw connections to unrelated shit, for reasons I can't even fathom. permalink parent award report block reply view 5 more comments...\npatrioticwinning3 -1 points 1 hour ago I noticed he is all in for Isreal First and a mossad faggot as well... permalink parent award report block reply lostmyoldpassword 0 points 60 minutes ago Your tone is suss, and you're trying to draw connections to unrelated shit, for reasons I can't even fathom. permalink parent award report block reply view 5 more comments...\nlostmyoldpassword 0 points 60 minutes ago Your tone is suss, and you're trying to draw connections to unrelated shit, for reasons I can't even fathom. permalink parent award report block reply view 5 more comments...\nMemeWarsVet 5 points 1 hour ago America First is a very clear mandate and he is straying from it. permalink award report block reply patrioticwinning3 0 points 1 hour ago Straying?  Seems like he's doing a complete 180! permalink parent award report block reply MemeWarsVet 1 points 20 minutes ago No - not even close.  But he is straying. permalink parent award report block reply\npatrioticwinning3 0 points 1 hour ago Straying?  Seems like he's doing a complete 180! permalink parent award report block reply MemeWarsVet 1 points 20 minutes ago No - not even close.  But he is straying. permalink parent award report block reply\nMemeWarsVet 1 points 20 minutes ago No - not even close.  But he is straying. permalink parent award report block reply\nwhatsupup 3 points 1 hour ago did u take the vax? i mean he might know something you dont? if you didn't, you should shuddup. permalink award report block reply patrioticwinning3 2 points 52 minutes ago This is the same qtard shit they have been pushing since the first administration! permalink parent award report block reply\npatrioticwinning3 2 points 52 minutes ago This is the same qtard shit they have been pushing since the first administration! permalink parent award report block reply\nRandoBudster 3 points 58 minutes ago So fill all these jobs with qualified Americans first then the remainder can be outsourced to poo-worlders. Right now thats completely reversed and we all know why. I have very low confidence in these projections anyway, their gaming for their own benefit. permalink award report block reply patrioticwinning3 4 points 50 minutes ago There are currently about a million US workers in Stem Fields that have been laid off due to importation of cheap labor or outsourcing of cheap labor, ironically by people who live in foreign countries but were educated here.  If we had record high labor participation rate and still couldn't find jobs, I would have no problem with this, but WE DON'T! permalink parent award report block reply\npatrioticwinning3 4 points 50 minutes ago There are currently about a million US workers in Stem Fields that have been laid off due to importation of cheap labor or outsourcing of cheap labor, ironically by people who live in foreign countries but were educated here.  If we had record high labor participation rate and still couldn't find jobs, I would have no problem with this, but WE DON'T! permalink parent award report block reply\nWizard_Glick 3 points 57 minutes ago Until you lose your job... permalink award report block reply\nshogun5000 3 points 56 minutes ago Fucking Q tard permalink award report block reply\nWrexxis780 2 points 34 minutes ago By that logic we shouldn’t have pushed back against the vax and all got the clot shot permalink award report block reply\ntogtfo 1 points 27 minutes ago If you want to join a cult, be our guest.  Don't expect anyone else to follow you, you absolute unit of a faggot. permalink award report block reply\nTakingCoatsWIN 1 points 1 hour ago There's an U.S. arms race against China on who will achieve the next level of AI first, whoever does will control the future of humanity. This is the current situation. permalink award report block reply\nGoldenSpirals 1 points 2 minutes ago If there is even ONE fucking jeet who has a job I can do its too many. Ive been unemployed for over a year. permalink award report block reply\nDestroyerofCobwebs 1 points 44 minutes ago The obvious problem, and I do mean obvious, is that every statistic you cite is either created by, or easily manipulated by, the very people who stand to profit off importing the cheap labor. permalink award report block reply"}