{"id": "1ARK9nOFgR", "contents": "38 The only thing that saved him is a gun. Around X never relax. 🔥   BURN,  LOOT,  MURDER  🔥 posted 9 hours ago by BlackCrimesMatter 12 comments award share report block\n12 comments Sort by Top Top New Worst Old Save MamaLlama2pointOh 4 points 9 hours ago At least his family acknowledged that he brought it on himself, which is not typical in these scenarios. permalink award report block reply ElevenMile 2 points 9 hours ago They were probably tired of his retarded, abusive ass permalink parent award report block reply SHILL_DETECTOR 1 points 8 hours ago how do you know this? permalink parent award report block reply Lurker404 2 points 8 hours ago IIRC They went from \"police brutality, he was unarmed\" to \"oh well, yea, maybe he shouldn't have done that \" after seeing the video. permalink parent award report block reply MamaLlama2pointOh 1 points 8 hours ago https://youtu.be/vUddn5W4Jps?si=gUWOnNSSFNbBoBa0 permalink parent award report block reply SHILL_DETECTOR 2 points 7 hours ago thanks mang permalink parent award report block reply MamaLlama2pointOh 1 points 4 hours ago Ju got it mang permalink parent award report block reply bratt 2 points 8 hours ago Anybody else notice he hit the light pole about 6 feet in the air? permalink award report block reply Peanutshucko 2 points 9 hours ago I hope he's chilling with Satan :-) permalink award report block reply Farqquard 1 points 9 hours ago the guy in the truck is a cunt.....drives like a dickhead. permalink award report block reply reversethefraud 1 points 9 hours ago I relent in these situations. It makes me mad that I relent. Even knowing that I'm avoiding the hasstle of the potential aftermath, I still get angry. permalink award report block reply bill_in_texas 1 points 9 hours ago White the guy who got shot ultimately was at fault, both drivers were assholes.  Yes, dude had the ROW, but it was obvious that there was an obstruction in the right lane ahead.  Zipper merge rules apply.   Both drivers wanted to force the issue, so a collision happened.  Could have been easily avoided if either of them had just backed off, but no, it seems neither one could. permalink award report block reply\nMamaLlama2pointOh 4 points 9 hours ago At least his family acknowledged that he brought it on himself, which is not typical in these scenarios. permalink award report block reply ElevenMile 2 points 9 hours ago They were probably tired of his retarded, abusive ass permalink parent award report block reply SHILL_DETECTOR 1 points 8 hours ago how do you know this? permalink parent award report block reply Lurker404 2 points 8 hours ago IIRC They went from \"police brutality, he was unarmed\" to \"oh well, yea, maybe he shouldn't have done that \" after seeing the video. permalink parent award report block reply MamaLlama2pointOh 1 points 8 hours ago https://youtu.be/vUddn5W4Jps?si=gUWOnNSSFNbBoBa0 permalink parent award report block reply SHILL_DETECTOR 2 points 7 hours ago thanks mang permalink parent award report block reply MamaLlama2pointOh 1 points 4 hours ago Ju got it mang permalink parent award report block reply\nElevenMile 2 points 9 hours ago They were probably tired of his retarded, abusive ass permalink parent award report block reply\nSHILL_DETECTOR 1 points 8 hours ago how do you know this? permalink parent award report block reply Lurker404 2 points 8 hours ago IIRC They went from \"police brutality, he was unarmed\" to \"oh well, yea, maybe he shouldn't have done that \" after seeing the video. permalink parent award report block reply MamaLlama2pointOh 1 points 8 hours ago https://youtu.be/vUddn5W4Jps?si=gUWOnNSSFNbBoBa0 permalink parent award report block reply SHILL_DETECTOR 2 points 7 hours ago thanks mang permalink parent award report block reply MamaLlama2pointOh 1 points 4 hours ago Ju got it mang permalink parent award report block reply\nLurker404 2 points 8 hours ago IIRC They went from \"police brutality, he was unarmed\" to \"oh well, yea, maybe he shouldn't have done that \" after seeing the video. permalink parent award report block reply\nMamaLlama2pointOh 1 points 8 hours ago https://youtu.be/vUddn5W4Jps?si=gUWOnNSSFNbBoBa0 permalink parent award report block reply SHILL_DETECTOR 2 points 7 hours ago thanks mang permalink parent award report block reply MamaLlama2pointOh 1 points 4 hours ago Ju got it mang permalink parent award report block reply\nSHILL_DETECTOR 2 points 7 hours ago thanks mang permalink parent award report block reply MamaLlama2pointOh 1 points 4 hours ago Ju got it mang permalink parent award report block reply\nMamaLlama2pointOh 1 points 4 hours ago Ju got it mang permalink parent award report block reply\nbratt 2 points 8 hours ago Anybody else notice he hit the light pole about 6 feet in the air? permalink award report block reply\nPeanutshucko 2 points 9 hours ago I hope he's chilling with Satan :-) permalink award report block reply\nFarqquard 1 points 9 hours ago the guy in the truck is a cunt.....drives like a dickhead. permalink award report block reply\nreversethefraud 1 points 9 hours ago I relent in these situations. It makes me mad that I relent. Even knowing that I'm avoiding the hasstle of the potential aftermath, I still get angry. permalink award report block reply\nbill_in_texas 1 points 9 hours ago White the guy who got shot ultimately was at fault, both drivers were assholes.  Yes, dude had the ROW, but it was obvious that there was an obstruction in the right lane ahead.  Zipper merge rules apply.   Both drivers wanted to force the issue, so a collision happened.  Could have been easily avoided if either of them had just backed off, but no, it seems neither one could. permalink award report block reply"}