{"id": "1ARK9nPuF8", "contents": "79 Nick Fuentes: \"Remember all of the optimism exactly a year ago? This is why I didn’t vote. When billionaires from Wall St, Silicon Valley, and the Israel Lobby were lining up to donate, that’s how you knew…\" posted 4 hours ago by raptoris2 26 comments award share report block Nicholas J. Fuentes @NickJFuentes • 21h Trump’s 2nd term is objectively a colossal disappointment and a catastrophic failure. Remember all of the optimism exactly a year ago? This is why I didn’t vote. When billionaires from Wall St, Silicon Valley, and the Israel Lobby were lining up to donate, that’s how you knew…\n26 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget Petiteputnam1 14 points 3 hours ago Dude was saying vote for Kamala his opinion carries no weight to me permalink award report block reply DrCowboyPresident 8 points 3 hours ago Probably an accelerationist mindset. This slow demoralizing death is excruciating. permalink parent award report block reply DickTick PRO 5 points 3 hours ago Yep permalink parent award report block reply BlackJack1776 1 points 3 hours ago Kid is a FedFag. permalink parent award report block reply 27Sandino 1 points 30 minutes ago Show a source of him saying to vote for camel permalink parent award report block reply Stolen 1 points 2 hours ago He alao works with Shapiro and Levin to fracture conservatives. Easier to control a divided group. permalink parent award report block reply PatPede1 6 points 3 hours ago Not voting for Trump, or not voting at all.....is always retarded.  There are always a ton of other local issues on the ballot anyway.  You lose the right to complain if you don't at least vote. permalink award report block reply Elencher 6 points 3 hours ago There's a case to be made for accelerations. permalink parent award report block reply Formerlurker92 2 points 3 hours ago How'd that work out for us last term? permalink parent award report block reply raptoris2 OP 1 points 57 minutes ago Biden admin disastrous policy regarding immigration helped turn the perception of voters in favor of america first viewpoint. So it did accelerate something to say the least. permalink parent award report block reply keeptherepublic1776 4 points 3 hours ago He's not wrong permalink award report block reply berserkerbarrage 4 points 3 hours ago He left out the part where the alternative was Kamala Harris, who had the backing of even more billionaires and was part of an administration that allowed 20 million unvetted foreigners into the country with the single click of an app. He's lying when he said that he didn't vote. He was first in line to vote for Kamala Harris because he's a faggot and probably a fed. He spent the entirety of 2024 trying to convince other people to vote for her, too. permalink award report block reply TrustYourself 3 points 2 hours ago This cant be ignored anylonger permalink award report block reply Drekken- 3 points 3 hours ago Like seriously... This is a Trump site and this douche bag has done nothing good for us or Trump. Fuck him. permalink award report block reply keeptherepublic1776 2 points 3 hours ago Trump hasn't done anything to help trump lately. If you don't see thst you are brainwashed and retarded permalink parent award report block reply Drekken- 1 points 33 minutes ago I didn't vote for him to help himself. I voted for him everytime because he is supposed to be helping us. How does 600k Chinese students(which a lot are spies), H1B visas, and 50 year house loans helping us? It's okay to call it out. It's our job. Not blind support. I'm America first and quite frankly ONLY. I get how that doesn't work so I will settle for America first. If you took a second to look, I'm not happy right now but this guy... He's not the answer. permalink parent award report block reply GayPatriotMAGAUncle 3 points 22 minutes ago FUCK FED FUENTES and FUCK YOU OP for posting this garbage! permalink award report block reply freedom-thinker 2 points 3 hours ago FU Nick, unless you are an accelerationlist, and there is an argument for that, we are still better off. permalink award report block reply Morokei 2 points 2 hours ago That’s right. I don’t have time to listen to Fuentes anyway. Too busy watching our President play host to Islamic terrorists and explaining why White people should give up applying for good jobs and welcome hundreds of thousands of chinese communist bioweapon carrying spies into the country. permalink parent award report block reply keeptherepublic1776 1 points 3 hours ago Are we? Nothing is cheaper. permalink parent award report block reply M-m-m-my-corona 2 points 3 hours ago Fuentes was right about everything. permalink award report block reply _Sully_ 1 points 2 hours ago Well the quickest way to even more failure is to think like this. If you really want to accelerate then by all means but you were never gonna get that via voting for anyone. permalink award report block reply Billionaired 0 points 2 hours ago Oh look... it's that faggot Fuentes again! permalink award report block reply Redditcanblowme -1 points 3 hours ago Why do people re-post this little bitch?  Who gives a fuck about his low T opinions? permalink award report block reply 2021is1776-2 -1 points 3 hours ago I’m surprised he can type so much while getting his tonsils punched by destiny dick. Yeah I’m pretty sure that guy swallowed destiny’s load.  Also massive grifter, I feel pretty bad for the chumps who follow him. permalink award report block reply TrumpYouMagaFrenner -2 points 3 hours ago Cock sucking faggot permalink award report block reply keeptherepublic1776 1 points 3 hours ago Brainwashed retard permalink parent award report block reply\nPetiteputnam1 14 points 3 hours ago Dude was saying vote for Kamala his opinion carries no weight to me permalink award report block reply DrCowboyPresident 8 points 3 hours ago Probably an accelerationist mindset. This slow demoralizing death is excruciating. permalink parent award report block reply DickTick PRO 5 points 3 hours ago Yep permalink parent award report block reply BlackJack1776 1 points 3 hours ago Kid is a FedFag. permalink parent award report block reply 27Sandino 1 points 30 minutes ago Show a source of him saying to vote for camel permalink parent award report block reply Stolen 1 points 2 hours ago He alao works with Shapiro and Levin to fracture conservatives. Easier to control a divided group. permalink parent award report block reply\nDrCowboyPresident 8 points 3 hours ago Probably an accelerationist mindset. This slow demoralizing death is excruciating. permalink parent award report block reply\nDickTick PRO 5 points 3 hours ago Yep permalink parent award report block reply\nBlackJack1776 1 points 3 hours ago Kid is a FedFag. permalink parent award report block reply\n27Sandino 1 points 30 minutes ago Show a source of him saying to vote for camel permalink parent award report block reply\nStolen 1 points 2 hours ago He alao works with Shapiro and Levin to fracture conservatives. Easier to control a divided group. permalink parent award report block reply\nPatPede1 6 points 3 hours ago Not voting for Trump, or not voting at all.....is always retarded.  There are always a ton of other local issues on the ballot anyway.  You lose the right to complain if you don't at least vote. permalink award report block reply Elencher 6 points 3 hours ago There's a case to be made for accelerations. permalink parent award report block reply Formerlurker92 2 points 3 hours ago How'd that work out for us last term? permalink parent award report block reply raptoris2 OP 1 points 57 minutes ago Biden admin disastrous policy regarding immigration helped turn the perception of voters in favor of america first viewpoint. So it did accelerate something to say the least. permalink parent award report block reply\nElencher 6 points 3 hours ago There's a case to be made for accelerations. permalink parent award report block reply Formerlurker92 2 points 3 hours ago How'd that work out for us last term? permalink parent award report block reply raptoris2 OP 1 points 57 minutes ago Biden admin disastrous policy regarding immigration helped turn the perception of voters in favor of america first viewpoint. So it did accelerate something to say the least. permalink parent award report block reply\nFormerlurker92 2 points 3 hours ago How'd that work out for us last term? permalink parent award report block reply raptoris2 OP 1 points 57 minutes ago Biden admin disastrous policy regarding immigration helped turn the perception of voters in favor of america first viewpoint. So it did accelerate something to say the least. permalink parent award report block reply\nraptoris2 OP 1 points 57 minutes ago Biden admin disastrous policy regarding immigration helped turn the perception of voters in favor of america first viewpoint. So it did accelerate something to say the least. permalink parent award report block reply\nkeeptherepublic1776 4 points 3 hours ago He's not wrong permalink award report block reply\nberserkerbarrage 4 points 3 hours ago He left out the part where the alternative was Kamala Harris, who had the backing of even more billionaires and was part of an administration that allowed 20 million unvetted foreigners into the country with the single click of an app. He's lying when he said that he didn't vote. He was first in line to vote for Kamala Harris because he's a faggot and probably a fed. He spent the entirety of 2024 trying to convince other people to vote for her, too. permalink award report block reply\nTrustYourself 3 points 2 hours ago This cant be ignored anylonger permalink award report block reply\nDrekken- 3 points 3 hours ago Like seriously... This is a Trump site and this douche bag has done nothing good for us or Trump. Fuck him. permalink award report block reply keeptherepublic1776 2 points 3 hours ago Trump hasn't done anything to help trump lately. If you don't see thst you are brainwashed and retarded permalink parent award report block reply Drekken- 1 points 33 minutes ago I didn't vote for him to help himself. I voted for him everytime because he is supposed to be helping us. How does 600k Chinese students(which a lot are spies), H1B visas, and 50 year house loans helping us? It's okay to call it out. It's our job. Not blind support. I'm America first and quite frankly ONLY. I get how that doesn't work so I will settle for America first. If you took a second to look, I'm not happy right now but this guy... He's not the answer. permalink parent award report block reply\nkeeptherepublic1776 2 points 3 hours ago Trump hasn't done anything to help trump lately. If you don't see thst you are brainwashed and retarded permalink parent award report block reply Drekken- 1 points 33 minutes ago I didn't vote for him to help himself. I voted for him everytime because he is supposed to be helping us. How does 600k Chinese students(which a lot are spies), H1B visas, and 50 year house loans helping us? It's okay to call it out. It's our job. Not blind support. I'm America first and quite frankly ONLY. I get how that doesn't work so I will settle for America first. If you took a second to look, I'm not happy right now but this guy... He's not the answer. permalink parent award report block reply\nDrekken- 1 points 33 minutes ago I didn't vote for him to help himself. I voted for him everytime because he is supposed to be helping us. How does 600k Chinese students(which a lot are spies), H1B visas, and 50 year house loans helping us? It's okay to call it out. It's our job. Not blind support. I'm America first and quite frankly ONLY. I get how that doesn't work so I will settle for America first. If you took a second to look, I'm not happy right now but this guy... He's not the answer. permalink parent award report block reply\nGayPatriotMAGAUncle 3 points 22 minutes ago FUCK FED FUENTES and FUCK YOU OP for posting this garbage! permalink award report block reply\nfreedom-thinker 2 points 3 hours ago FU Nick, unless you are an accelerationlist, and there is an argument for that, we are still better off. permalink award report block reply Morokei 2 points 2 hours ago That’s right. I don’t have time to listen to Fuentes anyway. Too busy watching our President play host to Islamic terrorists and explaining why White people should give up applying for good jobs and welcome hundreds of thousands of chinese communist bioweapon carrying spies into the country. permalink parent award report block reply keeptherepublic1776 1 points 3 hours ago Are we? Nothing is cheaper. permalink parent award report block reply\nMorokei 2 points 2 hours ago That’s right. I don’t have time to listen to Fuentes anyway. Too busy watching our President play host to Islamic terrorists and explaining why White people should give up applying for good jobs and welcome hundreds of thousands of chinese communist bioweapon carrying spies into the country. permalink parent award report block reply\nkeeptherepublic1776 1 points 3 hours ago Are we? Nothing is cheaper. permalink parent award report block reply\nM-m-m-my-corona 2 points 3 hours ago Fuentes was right about everything. permalink award report block reply\n_Sully_ 1 points 2 hours ago Well the quickest way to even more failure is to think like this. If you really want to accelerate then by all means but you were never gonna get that via voting for anyone. permalink award report block reply\nBillionaired 0 points 2 hours ago Oh look... it's that faggot Fuentes again! permalink award report block reply\nRedditcanblowme -1 points 3 hours ago Why do people re-post this little bitch?  Who gives a fuck about his low T opinions? permalink award report block reply\n2021is1776-2 -1 points 3 hours ago I’m surprised he can type so much while getting his tonsils punched by destiny dick. Yeah I’m pretty sure that guy swallowed destiny’s load.  Also massive grifter, I feel pretty bad for the chumps who follow him. permalink award report block reply\nTrumpYouMagaFrenner -2 points 3 hours ago Cock sucking faggot permalink award report block reply keeptherepublic1776 1 points 3 hours ago Brainwashed retard permalink parent award report block reply\nkeeptherepublic1776 1 points 3 hours ago Brainwashed retard permalink parent award report block reply"}