{"id": "1ARK9nPdOW", "contents": "40 LET ME INTRODUCE NEW TERMINOLOGY SINCE OUR POLITICIANS AND TRUMP CANT UNDERSTAND AMERICA FIRST posted 5 hours ago by ACActual 6 comments award share report block Start using America ONLY FUCK FOREIGNERS\n6 comments Sort by Top Top New Worst Old Save Around the Web Salt Lake City's Hair Growth Method Breaks All Records! HaloGrow LauraCoomer 9 points 5 hours ago AMERICA ONLY! permalink award report block reply ACActual OP 7 points 5 hours ago AMERICA ONLY permalink award report block reply PapaPepe 6 points 5 hours ago Trump needs to get rid of his close advisors because they clearly are trying to screw him permalink award report block reply lostmyoldpassword 3 points 5 hours ago I saw this comment in the wild earlier - it's the only one I've read in 2 days that gave me any semblance of hope.\n\"I think this could be Trump's final play to throw Israel and neocons off his back, he's like fine I'll go full team neocons, basically lighting a huge fire that has everyone mad and he'll basically destroy that whole line of the party as they're now seeing the backlash and then he'll reverse course. Hopefully I'm right otherwise it's the end of America.\"\nIt's not much hope, but hey. permalink award report block reply ACActual OP 5 points 5 hours ago Copium.   Pray your right permalink parent award report block reply VanDeKoik -1 points 5 hours ago I rather not use brainless slogans from people that dont even know what the hell that even means. Didn't do it with BLM and not here either. permalink award report block reply\nLauraCoomer 9 points 5 hours ago AMERICA ONLY! permalink award report block reply\nACActual OP 7 points 5 hours ago AMERICA ONLY permalink award report block reply\nPapaPepe 6 points 5 hours ago Trump needs to get rid of his close advisors because they clearly are trying to screw him permalink award report block reply\nlostmyoldpassword 3 points 5 hours ago I saw this comment in the wild earlier - it's the only one I've read in 2 days that gave me any semblance of hope.\n\"I think this could be Trump's final play to throw Israel and neocons off his back, he's like fine I'll go full team neocons, basically lighting a huge fire that has everyone mad and he'll basically destroy that whole line of the party as they're now seeing the backlash and then he'll reverse course. Hopefully I'm right otherwise it's the end of America.\"\nIt's not much hope, but hey. permalink award report block reply ACActual OP 5 points 5 hours ago Copium.   Pray your right permalink parent award report block reply\nACActual OP 5 points 5 hours ago Copium.   Pray your right permalink parent award report block reply\nVanDeKoik -1 points 5 hours ago I rather not use brainless slogans from people that dont even know what the hell that even means. Didn't do it with BLM and not here either. permalink award report block reply"}