{"id": "1ARK590u3i", "contents": "381 Did you know JD Vance was in highlander? posted 4 days ago by Ragingtrumper69 27 comments award share download report block\n27 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style SenorTrumper 11 points 4 days ago Why the fuck is this turd stickied? permalink award report block reply keeman 4 points 4 days ago Cause it's fun? permalink parent award report block reply SenorTrumper -1 points 3 days ago Ok, you tell me what the image is?  I just see two wrasslers. permalink parent award report block reply Ragingtrumper69 OP 3 points 3 days ago Yes.... you are permalink parent award report block reply SenorTrumper 2 points 3 days ago Go home, you drunk! permalink parent award report block reply view 1 more comments... Ragingtrumper69 OP 0 points 3 days ago Go back to Mexico if you dont get it permalink parent award report block reply Agenda47 3 points 4 days ago Can someone explain the joke to me please? permalink award report block reply agremlinintheworks 4 points 3 days ago It's the opening wrestling scene from the original highlander movie. I guess the blonde wrestler looks a bit like the JD Vance memes. permalink parent award report block reply SenorTrumper 2 points 3 days ago Don't axe me. permalink parent award report block reply utfanx2 3 points 4 days ago And Trump is a MacLeod. https://en.wikipedia.org/wiki/Mary_Anne_MacLeod_Trump permalink award report block reply BeBest 2 points 4 days ago I know his name! permalink award report block reply RedCapNation 2 points 3 days ago There can be only one permalink award report block reply Goozmania 2 points 4 days ago The guy on the right is also JD Vance, actually. permalink award report block reply TheRedPilledArtist 1 points 4 days ago 🌈 𝙏𝙝𝙚 𝙈𝙤𝙧𝙚 𝙔𝙤𝙪 𝙆𝙣𝙤𝙬💫 permalink award report block reply daveywavey86 1 points 3 days ago its michael PS hayes from the freebirds permalink award report block reply Ragingtrumper69 OP 2 points 3 days ago Wrong, its JD Vance during the 86 quickening. permalink parent award report block reply ThePatriotGames2016 1 points 4 days ago Michael Hayes I'm sure. permalink award report block reply Ritchie_Blackadder 1 points 4 days ago Old Freebirds vs Islanders (Haku and Tonga Kid Sam Fatu) from MSG 1985 during the 'Birds cup of coffee up north permalink parent award report block reply ThePatriotGames2016 4 points 3 days ago cup of coffee oooooooo yeeeeeeeeuuuuuhhh permalink parent award report block reply journalist 0 points 4 days ago \"P.S.\" (\"Purely Sexy\") permalink award report block reply SenorTrumper 0 points 4 days ago No, does that picture somehow constitute evidence? permalink award report block reply Ragingtrumper69 OP 1 points 3 days ago Did you try crying about it on the internet? permalink parent award report block reply SenorTrumper 1 points 3 days ago I can't understand you with those 3 BBCs deepthroating you. 😱 permalink parent award report block reply Ragingtrumper69 OP 1 points 3 days ago So the weiners are deepthroating me? permalink parent award report block reply Ragingtrumper69 OP 1 points 3 days ago ESL? permalink parent award report block reply SenorTrumper 1 points 3 days ago Did you ride the shortbus to school? permalink parent award report block reply rapskull 1 points 4 days ago Comment removed by community moderators. permalink award report block reply\nSenorTrumper 11 points 4 days ago Why the fuck is this turd stickied? permalink award report block reply keeman 4 points 4 days ago Cause it's fun? permalink parent award report block reply SenorTrumper -1 points 3 days ago Ok, you tell me what the image is?  I just see two wrasslers. permalink parent award report block reply Ragingtrumper69 OP 3 points 3 days ago Yes.... you are permalink parent award report block reply SenorTrumper 2 points 3 days ago Go home, you drunk! permalink parent award report block reply view 1 more comments... Ragingtrumper69 OP 0 points 3 days ago Go back to Mexico if you dont get it permalink parent award report block reply\nkeeman 4 points 4 days ago Cause it's fun? permalink parent award report block reply SenorTrumper -1 points 3 days ago Ok, you tell me what the image is?  I just see two wrasslers. permalink parent award report block reply Ragingtrumper69 OP 3 points 3 days ago Yes.... you are permalink parent award report block reply SenorTrumper 2 points 3 days ago Go home, you drunk! permalink parent award report block reply view 1 more comments...\nSenorTrumper -1 points 3 days ago Ok, you tell me what the image is?  I just see two wrasslers. permalink parent award report block reply Ragingtrumper69 OP 3 points 3 days ago Yes.... you are permalink parent award report block reply SenorTrumper 2 points 3 days ago Go home, you drunk! permalink parent award report block reply view 1 more comments...\nRagingtrumper69 OP 3 points 3 days ago Yes.... you are permalink parent award report block reply SenorTrumper 2 points 3 days ago Go home, you drunk! permalink parent award report block reply view 1 more comments...\nSenorTrumper 2 points 3 days ago Go home, you drunk! permalink parent award report block reply view 1 more comments...\nRagingtrumper69 OP 0 points 3 days ago Go back to Mexico if you dont get it permalink parent award report block reply\nAgenda47 3 points 4 days ago Can someone explain the joke to me please? permalink award report block reply agremlinintheworks 4 points 3 days ago It's the opening wrestling scene from the original highlander movie. I guess the blonde wrestler looks a bit like the JD Vance memes. permalink parent award report block reply SenorTrumper 2 points 3 days ago Don't axe me. permalink parent award report block reply\nagremlinintheworks 4 points 3 days ago It's the opening wrestling scene from the original highlander movie. I guess the blonde wrestler looks a bit like the JD Vance memes. permalink parent award report block reply\nSenorTrumper 2 points 3 days ago Don't axe me. permalink parent award report block reply\nutfanx2 3 points 4 days ago And Trump is a MacLeod. https://en.wikipedia.org/wiki/Mary_Anne_MacLeod_Trump permalink award report block reply\nBeBest 2 points 4 days ago I know his name! permalink award report block reply\nRedCapNation 2 points 3 days ago There can be only one permalink award report block reply\nGoozmania 2 points 4 days ago The guy on the right is also JD Vance, actually. permalink award report block reply\nTheRedPilledArtist 1 points 4 days ago 🌈 𝙏𝙝𝙚 𝙈𝙤𝙧𝙚 𝙔𝙤𝙪 𝙆𝙣𝙤𝙬💫 permalink award report block reply\ndaveywavey86 1 points 3 days ago its michael PS hayes from the freebirds permalink award report block reply Ragingtrumper69 OP 2 points 3 days ago Wrong, its JD Vance during the 86 quickening. permalink parent award report block reply\nRagingtrumper69 OP 2 points 3 days ago Wrong, its JD Vance during the 86 quickening. permalink parent award report block reply\nThePatriotGames2016 1 points 4 days ago Michael Hayes I'm sure. permalink award report block reply Ritchie_Blackadder 1 points 4 days ago Old Freebirds vs Islanders (Haku and Tonga Kid Sam Fatu) from MSG 1985 during the 'Birds cup of coffee up north permalink parent award report block reply ThePatriotGames2016 4 points 3 days ago cup of coffee oooooooo yeeeeeeeeuuuuuhhh permalink parent award report block reply\nRitchie_Blackadder 1 points 4 days ago Old Freebirds vs Islanders (Haku and Tonga Kid Sam Fatu) from MSG 1985 during the 'Birds cup of coffee up north permalink parent award report block reply ThePatriotGames2016 4 points 3 days ago cup of coffee oooooooo yeeeeeeeeuuuuuhhh permalink parent award report block reply\nThePatriotGames2016 4 points 3 days ago cup of coffee oooooooo yeeeeeeeeuuuuuhhh permalink parent award report block reply\njournalist 0 points 4 days ago \"P.S.\" (\"Purely Sexy\") permalink award report block reply\nSenorTrumper 0 points 4 days ago No, does that picture somehow constitute evidence? permalink award report block reply Ragingtrumper69 OP 1 points 3 days ago Did you try crying about it on the internet? permalink parent award report block reply SenorTrumper 1 points 3 days ago I can't understand you with those 3 BBCs deepthroating you. 😱 permalink parent award report block reply Ragingtrumper69 OP 1 points 3 days ago So the weiners are deepthroating me? permalink parent award report block reply Ragingtrumper69 OP 1 points 3 days ago ESL? permalink parent award report block reply SenorTrumper 1 points 3 days ago Did you ride the shortbus to school? permalink parent award report block reply\nRagingtrumper69 OP 1 points 3 days ago Did you try crying about it on the internet? permalink parent award report block reply SenorTrumper 1 points 3 days ago I can't understand you with those 3 BBCs deepthroating you. 😱 permalink parent award report block reply Ragingtrumper69 OP 1 points 3 days ago So the weiners are deepthroating me? permalink parent award report block reply Ragingtrumper69 OP 1 points 3 days ago ESL? permalink parent award report block reply SenorTrumper 1 points 3 days ago Did you ride the shortbus to school? permalink parent award report block reply\nSenorTrumper 1 points 3 days ago I can't understand you with those 3 BBCs deepthroating you. 😱 permalink parent award report block reply Ragingtrumper69 OP 1 points 3 days ago So the weiners are deepthroating me? permalink parent award report block reply Ragingtrumper69 OP 1 points 3 days ago ESL? permalink parent award report block reply SenorTrumper 1 points 3 days ago Did you ride the shortbus to school? permalink parent award report block reply\nRagingtrumper69 OP 1 points 3 days ago So the weiners are deepthroating me? permalink parent award report block reply\nRagingtrumper69 OP 1 points 3 days ago ESL? permalink parent award report block reply SenorTrumper 1 points 3 days ago Did you ride the shortbus to school? permalink parent award report block reply\nSenorTrumper 1 points 3 days ago Did you ride the shortbus to school? permalink parent award report block reply\nrapskull 1 points 4 days ago Comment removed by community moderators. permalink award report block reply"}