{"id": "1ARK9iqg4N", "contents": "418 @mattgaetz: Did Trump just put a “hotties only” sign on the US? 😍🐆  MELANIA  🐆😍 posted 2 days ago by blue5707 14 comments award share report block Matt Gaetz @mattgaetz • 2d Did Trump just put a “hotties only” sign on the US? Golden Age indeed… Polymarket @Polymarket • 2d BREAKING: Trump admin directive will prohibit certain “high calorie humans” from obtaining visas.\n14 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno Mintap 16 points 2 days ago No fatties permalink award report block reply patrioticwinning3 6 points 2 days ago No fat chicks :p permalink parent award report block reply Mintap 2 points 2 days ago save the manatees permalink parent award report block reply Brownwaterboys 9 points 2 days ago 9's and 10's only permalink award report block reply empiretc 9 points 2 days ago kek permalink award report block reply RolandDelacroix 7 points 2 days ago We only want good genes. permalink award report block reply TrumpAndGodWin 1 points 2 days ago Good genes improve morale and help resist race-specific bioweapons. permalink parent award report block reply KennyKetchem 5 points 2 days ago Does this mean Rosie O'Donnell is not coming back? permalink award report block reply RedCapNation 3 points 2 days ago Wow Matt Gaetz the quitter chimes in… permalink award report block reply Smurfection 3 points 2 days ago He didn't quit.  It was obvious the senate wasn't going to confirm and he didn't have the votes so he cleared the path for someone else.  The problem wasn't Gaetz.  The problem is the senators who wouldn't confirm him.   Despite what the left thinks, Trump isn't a dictator and can't just make the Senate do what he wants. permalink parent award report block reply Tacitus1963 1 points 2 days ago I know New Zealand and possibly Australia were following a similar protocol for legal immigration.\nOf course, now they are targeted in keeping with the Kalergi Plan to flood them with the filth of the 3rd world so that in time, the native New Zealanders- whites especially- will be replaced as well as those in Australia. permalink award report block reply lifeisahologram 1 points 2 days ago Obese people shouldn’t get the same rights when it comes to immigration. If I had a farm and needed to hire ranch hands to help and they’d get to live on my farm in exchange for their work, I’m not hiring any obese people. The same should apply to countries. permalink award report block reply HoganT -11 points 2 days ago Tone deaf from the diddy drug parties with underage girls brought across state lines, scumbag. permalink award report block reply ThisTrainHasNoBrakes 3 points 2 days ago Spoken like a true uggo. permalink parent award report block reply\nMintap 16 points 2 days ago No fatties permalink award report block reply patrioticwinning3 6 points 2 days ago No fat chicks :p permalink parent award report block reply Mintap 2 points 2 days ago save the manatees permalink parent award report block reply\npatrioticwinning3 6 points 2 days ago No fat chicks :p permalink parent award report block reply Mintap 2 points 2 days ago save the manatees permalink parent award report block reply\nMintap 2 points 2 days ago save the manatees permalink parent award report block reply\nBrownwaterboys 9 points 2 days ago 9's and 10's only permalink award report block reply\nempiretc 9 points 2 days ago kek permalink award report block reply\nRolandDelacroix 7 points 2 days ago We only want good genes. permalink award report block reply TrumpAndGodWin 1 points 2 days ago Good genes improve morale and help resist race-specific bioweapons. permalink parent award report block reply\nTrumpAndGodWin 1 points 2 days ago Good genes improve morale and help resist race-specific bioweapons. permalink parent award report block reply\nKennyKetchem 5 points 2 days ago Does this mean Rosie O'Donnell is not coming back? permalink award report block reply\nRedCapNation 3 points 2 days ago Wow Matt Gaetz the quitter chimes in… permalink award report block reply Smurfection 3 points 2 days ago He didn't quit.  It was obvious the senate wasn't going to confirm and he didn't have the votes so he cleared the path for someone else.  The problem wasn't Gaetz.  The problem is the senators who wouldn't confirm him.   Despite what the left thinks, Trump isn't a dictator and can't just make the Senate do what he wants. permalink parent award report block reply\nSmurfection 3 points 2 days ago He didn't quit.  It was obvious the senate wasn't going to confirm and he didn't have the votes so he cleared the path for someone else.  The problem wasn't Gaetz.  The problem is the senators who wouldn't confirm him.   Despite what the left thinks, Trump isn't a dictator and can't just make the Senate do what he wants. permalink parent award report block reply\nTacitus1963 1 points 2 days ago I know New Zealand and possibly Australia were following a similar protocol for legal immigration.\nOf course, now they are targeted in keeping with the Kalergi Plan to flood them with the filth of the 3rd world so that in time, the native New Zealanders- whites especially- will be replaced as well as those in Australia. permalink award report block reply\nlifeisahologram 1 points 2 days ago Obese people shouldn’t get the same rights when it comes to immigration. If I had a farm and needed to hire ranch hands to help and they’d get to live on my farm in exchange for their work, I’m not hiring any obese people. The same should apply to countries. permalink award report block reply\nHoganT -11 points 2 days ago Tone deaf from the diddy drug parties with underage girls brought across state lines, scumbag. permalink award report block reply ThisTrainHasNoBrakes 3 points 2 days ago Spoken like a true uggo. permalink parent award report block reply\nThisTrainHasNoBrakes 3 points 2 days ago Spoken like a true uggo. permalink parent award report block reply"}