{"id": "1ARK5A9qbo", "contents": "283 \"You know who’s going to purchase the 50 year mortgage?\nImmigrants that pack the home in with the entire extended family.\nAmerica is finished unless you SHUT DOWN the border.\nThis is not up for discussion.\" posted 3 days ago by bleeje 8 comments award share report block Peter B @realpeteyb123 • 3d You know who’s going to purchase the 50 year mortgage? Immigrants that pack the home in with the entire extended family. America is finished unless you SHUT DOWN the border. This is not up for discussion.\n8 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style MAGALADON9 8 points 3 days ago Saaaar saaar you bloody bastard!! permalink award report block reply KuzoKevin 6 points 3 days ago The border is shut down. permalink award report block reply GoldenEarz 4 points 3 days ago Shut it down for all immigration, for any reason. permalink parent award report block reply patrioticwinning3 4 points 3 days ago The border is shut down... we need to deport the illegals, anchor babies, and end the H1Bs and other visas! permalink award report block reply Znut55 4 points 3 days ago Yep....and those living on all the \"govt. freebies\" who could care less if they live long enough to pay off the home or not.  And guaranteed the govt. will be VERY selective on whose properties they \"repossess\" should you default on your payments. permalink award report block reply Harvestsmiles 2 points 3 days ago Same ones buying up the overpriced beginner housing in... places like CA permalink award report block reply SanityGumby 1 points 3 days ago The border is shutdown idiot permalink award report block reply MAGALADON9 1 points 3 days ago Comment removed by community filter. permalink award report block reply\nMAGALADON9 8 points 3 days ago Saaaar saaar you bloody bastard!! permalink award report block reply\nKuzoKevin 6 points 3 days ago The border is shut down. permalink award report block reply GoldenEarz 4 points 3 days ago Shut it down for all immigration, for any reason. permalink parent award report block reply\nGoldenEarz 4 points 3 days ago Shut it down for all immigration, for any reason. permalink parent award report block reply\npatrioticwinning3 4 points 3 days ago The border is shut down... we need to deport the illegals, anchor babies, and end the H1Bs and other visas! permalink award report block reply\nZnut55 4 points 3 days ago Yep....and those living on all the \"govt. freebies\" who could care less if they live long enough to pay off the home or not.  And guaranteed the govt. will be VERY selective on whose properties they \"repossess\" should you default on your payments. permalink award report block reply\nHarvestsmiles 2 points 3 days ago Same ones buying up the overpriced beginner housing in... places like CA permalink award report block reply\nSanityGumby 1 points 3 days ago The border is shutdown idiot permalink award report block reply\nMAGALADON9 1 points 3 days ago Comment removed by community filter. permalink award report block reply"}