{"id": "1ARK9nOFog", "contents": "15 Perfect rebuff to Trump’s latest H1-B gaffe (patriots.win) posted 9 hours ago by xanaxagoras 2 comments award share report block The Donald The Donald is a never-ending rally of patriots dedicated to the 45th President of the United States, Donald J. Trump. patriots.win\n2 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style RudeFrog 1 points 8 hours ago Oh thank goodness it's just a gaffe guys the h1b replacing you is just a gaffe nothing to worry about permalink award report block reply xanaxagoras OP 1 points 3 hours ago Good point, this is no gaffe. Replacing Americans and hollowing out what remains of American prosperity and civilization is his administration’s priority. We showed him nothing but support and adoration and he hates us like all the rest of them. His real innovation was dressing up in populism to subvert it and gain power. We all got played like God damned fools, three times. permalink parent award report block reply\nRudeFrog 1 points 8 hours ago Oh thank goodness it's just a gaffe guys the h1b replacing you is just a gaffe nothing to worry about permalink award report block reply xanaxagoras OP 1 points 3 hours ago Good point, this is no gaffe. Replacing Americans and hollowing out what remains of American prosperity and civilization is his administration’s priority. We showed him nothing but support and adoration and he hates us like all the rest of them. His real innovation was dressing up in populism to subvert it and gain power. We all got played like God damned fools, three times. permalink parent award report block reply\nxanaxagoras OP 1 points 3 hours ago Good point, this is no gaffe. Replacing Americans and hollowing out what remains of American prosperity and civilization is his administration’s priority. We showed him nothing but support and adoration and he hates us like all the rest of them. His real innovation was dressing up in populism to subvert it and gain power. We all got played like God damned fools, three times. permalink parent award report block reply"}