{"id": "1ARK9oWNcb", "contents": "11 The whole Epstein thing perfectly illustrates the difference between conservative voters and the brainwashed NPC voters on the left. It is a clear example of the difference posted 2 hours ago by Username_here 4 comments award share report block From day one, conservative voters have wanted full transparency on Epstein. Conservative voters have not changed. They still want it because they care about right and wrong and want people held accountable no matter who it is. Democrat NPC voters however, never once cared about Epstein and in fact tried to downplay it all(because they know most of the bad actors are on the left). It wasn't until their overlords lost power and thought they could use it to their advantage. They sent out the instructions to all the NPCs to now pretend like they care. And sure enough, all the mind numbed programmable NPCs on the left got their instructions and are just awaiting their next set of instructions.\n4 comments Sort by Top Top New Worst Old Save lostmyoldpassword 2 points 2 hours ago Yes, but let's not break our arms patting ourselves on the back too hard.  Those people exist on this side too unfortunately, just not near the numbers. permalink award report block reply ChilledCovfefe 2 points 2 hours ago And for those that can’t get over it on our side. Any horrible evidence was destroyed by the deep state while they had full control for 4 years. Anyone who thinks there is a magic list of names or something, is an idiot. permalink award report block reply lostmyoldpassword 1 points 2 hours ago No one thinks that.  Boiling the shit down to that is a clear sign you are pushing an agenda.  Fucking meme name...again btw - for anyone paying attention today. permalink parent award report block reply guywholikesDjtof2024 1 points 2 hours ago That and Charlie Kirk.  CHARLES. KIRK. permalink award report block reply\nlostmyoldpassword 2 points 2 hours ago Yes, but let's not break our arms patting ourselves on the back too hard.  Those people exist on this side too unfortunately, just not near the numbers. permalink award report block reply\nChilledCovfefe 2 points 2 hours ago And for those that can’t get over it on our side. Any horrible evidence was destroyed by the deep state while they had full control for 4 years. Anyone who thinks there is a magic list of names or something, is an idiot. permalink award report block reply lostmyoldpassword 1 points 2 hours ago No one thinks that.  Boiling the shit down to that is a clear sign you are pushing an agenda.  Fucking meme name...again btw - for anyone paying attention today. permalink parent award report block reply\nlostmyoldpassword 1 points 2 hours ago No one thinks that.  Boiling the shit down to that is a clear sign you are pushing an agenda.  Fucking meme name...again btw - for anyone paying attention today. permalink parent award report block reply\nguywholikesDjtof2024 1 points 2 hours ago That and Charlie Kirk.  CHARLES. KIRK. permalink award report block reply"}