{"id": "1ARK9nNi7M", "contents": "106 🚨Bessent: Stimulus checks would only go to families making less than $100,000 a year posted 10 hours ago by laurabranigan1 41 comments award share report block Cash Casey @cassiuscasey • 10h 🚨Bessent: Stimulus checks would only go to families making less than $100,000 a year\n41 comments Sort by Top Top New Worst Old Save Thomm 26 points 9 hours ago This is a far cry from abolishing the irs and using the tariff money to pay for everything. No one wants this. permalink award report block reply Retardloserimsogay 12 points 8 hours ago Yeah, this is retarded... getting the low IQs hooked on endless stimulus checks and UBI. No one voted for this. permalink parent award report block reply MastaJoda -1 points 8 hours ago How in tf is anyone making $100k/yr ''hurting''?????? I wouldnt know what to do with $100k/yr. If these mfs are living above their means at $100k/yr, they need financial advisors, not a $2k payout... permalink parent award report block reply Pede45 2 points 7 hours ago It says families. So Dad makes $50,000 and Mom makes 50,000. Throw in a couple of kids and that's not a lot of money. That's living pay check to pay check. permalink parent award report block reply MastaJoda 1 points 8 hours ago ☝truth hurts permalink parent award report block reply TrumpPatriot84 1 points 7 hours ago SNAP and EBT are about to get more money they don't deserve... Anyone on SNAP or EBT should be excluded. permalink parent award report block reply Ronaldus 15 points 9 hours ago I am sick to death of my money going to deadbeats. permalink award report block reply Callsign_Fox1 7 points 9 hours ago Don't worry, the likelihood of these 2k checks going out is close to zero. Still waiting on those 5k DODGE checks. permalink parent award report block reply Ronaldus 4 points 8 hours ago Yeah, I needed that 5K for stocking up on toilet paper. Because that's a thing now. permalink parent award report block reply SpeekFreely 13 points 9 hours ago They won’t go out until just before the midterms permalink award report block reply MastaJoda 4 points 8 hours ago In an omnimus bill packed with $6T in pork for the donor class and Congressfckwads NGOs. This is so predictable. permalink parent award report block reply FromNC 11 points 9 hours ago Why is someone already receiving my tax funds more entitled to my money than I am making $9k over a ridiculously low threshold. permalink award report block reply JerryNadlerBeltFund 9 points 9 hours ago Their brains are stuck in 1995, when a $100k was a top 5% income for a family. permalink parent award report block reply schiff_for_brains 7 points 8 hours ago $100k is the new $50k. permalink parent award report block reply FromNC 3 points 8 hours ago This needs to be a $2k forgiveness of federal taxes if anything. permalink parent award report block reply LauraCoomer 10 points 9 hours ago Great, everything is going to get even more expensive. What the fuck is going on? permalink award report block reply MastaJoda 4 points 8 hours ago The continued control detonation of America. permalink parent award report block reply RolandDelacroix 3 points 7 hours ago Surely Trump isn't this stupid economically permalink parent award report block reply Atruckdriver 3 points 5 hours ago 50 yr mortgage says “Hi!” permalink parent award report block reply Callsign_Fox1 8 points 10 hours ago That sucks for me. permalink award report block reply BannedAccount 6 points 9 hours ago Families making over 100,000? So if it's a married couple both people have to make less than 50k? If you're only making 50k in this economy I doubt $2000 will even make a dent in your financial issues. permalink award report block reply EvensoAmen 6 points 9 hours ago Hmmmmm…stupidity is multiplying permalink award report block reply stealthboy 3 points 8 hours ago Which is precisely why I have zero optimism for the future of our country. permalink parent award report block reply keeptherepublic1776 3 points 8 hours ago Same permalink parent award report block reply keeptherepublic1776 5 points 8 hours ago Waiting for the trump boot lickers to defend This. Thump has 1 order. Destroy the middle class the rest of the way permalink award report block reply SilentSniper 5 points 9 hours ago Guess I ain’t getting one. Fuck this administration.  /s permalink award report block reply magamagashii 5 points 9 hours ago Same boat. It's okay while the poor take a nice cruise I can work overtime to pay taxes on my stocks that are up based solely on inflation but the overall value of my portfolio probably hasn't changed or has gone down. permalink parent award report block reply RolandDelacroix 3 points 7 hours ago Yep, wife and work over 50 hours week to make barely over $100k because that's middle class in my area. How about a tax cut instead? permalink parent award report block reply chickeninoven 3 points 7 hours ago Sorry slave. That just doesn't have the same WOW factor as a nice fat federal check in the mail. permalink parent award report block reply magamagashii 4 points 9 hours ago Zimbabwe will also be sending out $2000 checks to anyone making less than $100,000,000 a year.... permalink award report block reply rightoverthere 4 points 9 hours ago is we gettin free stuff? permalink award report block reply CloudNine 4 points 9 hours ago If it happens at all- it will only go to people who have a job and pay taxes. permalink award report block reply RolandDelacroix 2 points 7 hours ago Sure. permalink parent award report block reply DEPORT50M 3 points 8 hours ago Oh good, more money for shaniqua and dawntay. What a fucking joke permalink award report block reply keeptherepublic1776 3 points 8 hours ago Fuck you then. Families make under 100k are probably not even paying taxes permalink award report block reply 2008RonPaul2012 2 points 8 hours ago Definitely gonna buy Bitcoin permalink award report block reply RolandDelacroix 2 points 7 hours ago Why are we doing stimulus checks instead of tax cuts or refunds? permalink award report block reply Spellmonger 1 points 6 hours ago Bessent: Stimulus checks would only go to families making less than $100,000 a year How about this , stimulus checks WILL only go to working families making less than 150,000 a year - and nothing for families who received government assistance for the last 9 months or more. Then, take the money that would have gone to the parasite class, and add it to the total amount of the stimulus and send each member of the working family a larger stimulus check. It is about time we, and all the members of our family got a Thank You Note. permalink award report block reply chickeninoven 1 points 7 hours ago Household income under $100k? Bro fuck you. permalink award report block reply WI-Patriot 1 points 7 hours ago In other words, the people who don't pay taxes.  Sigh... permalink award report block reply TrumpPatriot84 1 points 7 hours ago SNAP and EBT are about to get more money they don't deserve... Anyone on SNAP or EBT should be excluded. permalink award report block reply\nThomm 26 points 9 hours ago This is a far cry from abolishing the irs and using the tariff money to pay for everything. No one wants this. permalink award report block reply Retardloserimsogay 12 points 8 hours ago Yeah, this is retarded... getting the low IQs hooked on endless stimulus checks and UBI. No one voted for this. permalink parent award report block reply MastaJoda -1 points 8 hours ago How in tf is anyone making $100k/yr ''hurting''?????? I wouldnt know what to do with $100k/yr. If these mfs are living above their means at $100k/yr, they need financial advisors, not a $2k payout... permalink parent award report block reply Pede45 2 points 7 hours ago It says families. So Dad makes $50,000 and Mom makes 50,000. Throw in a couple of kids and that's not a lot of money. That's living pay check to pay check. permalink parent award report block reply MastaJoda 1 points 8 hours ago ☝truth hurts permalink parent award report block reply TrumpPatriot84 1 points 7 hours ago SNAP and EBT are about to get more money they don't deserve... Anyone on SNAP or EBT should be excluded. permalink parent award report block reply\nRetardloserimsogay 12 points 8 hours ago Yeah, this is retarded... getting the low IQs hooked on endless stimulus checks and UBI. No one voted for this. permalink parent award report block reply MastaJoda -1 points 8 hours ago How in tf is anyone making $100k/yr ''hurting''?????? I wouldnt know what to do with $100k/yr. If these mfs are living above their means at $100k/yr, they need financial advisors, not a $2k payout... permalink parent award report block reply Pede45 2 points 7 hours ago It says families. So Dad makes $50,000 and Mom makes 50,000. Throw in a couple of kids and that's not a lot of money. That's living pay check to pay check. permalink parent award report block reply MastaJoda 1 points 8 hours ago ☝truth hurts permalink parent award report block reply\nMastaJoda -1 points 8 hours ago How in tf is anyone making $100k/yr ''hurting''?????? I wouldnt know what to do with $100k/yr. If these mfs are living above their means at $100k/yr, they need financial advisors, not a $2k payout... permalink parent award report block reply Pede45 2 points 7 hours ago It says families. So Dad makes $50,000 and Mom makes 50,000. Throw in a couple of kids and that's not a lot of money. That's living pay check to pay check. permalink parent award report block reply MastaJoda 1 points 8 hours ago ☝truth hurts permalink parent award report block reply\nPede45 2 points 7 hours ago It says families. So Dad makes $50,000 and Mom makes 50,000. Throw in a couple of kids and that's not a lot of money. That's living pay check to pay check. permalink parent award report block reply\nMastaJoda 1 points 8 hours ago ☝truth hurts permalink parent award report block reply\nTrumpPatriot84 1 points 7 hours ago SNAP and EBT are about to get more money they don't deserve... Anyone on SNAP or EBT should be excluded. permalink parent award report block reply\nRonaldus 15 points 9 hours ago I am sick to death of my money going to deadbeats. permalink award report block reply Callsign_Fox1 7 points 9 hours ago Don't worry, the likelihood of these 2k checks going out is close to zero. Still waiting on those 5k DODGE checks. permalink parent award report block reply Ronaldus 4 points 8 hours ago Yeah, I needed that 5K for stocking up on toilet paper. Because that's a thing now. permalink parent award report block reply\nCallsign_Fox1 7 points 9 hours ago Don't worry, the likelihood of these 2k checks going out is close to zero. Still waiting on those 5k DODGE checks. permalink parent award report block reply Ronaldus 4 points 8 hours ago Yeah, I needed that 5K for stocking up on toilet paper. Because that's a thing now. permalink parent award report block reply\nRonaldus 4 points 8 hours ago Yeah, I needed that 5K for stocking up on toilet paper. Because that's a thing now. permalink parent award report block reply\nSpeekFreely 13 points 9 hours ago They won’t go out until just before the midterms permalink award report block reply MastaJoda 4 points 8 hours ago In an omnimus bill packed with $6T in pork for the donor class and Congressfckwads NGOs. This is so predictable. permalink parent award report block reply\nMastaJoda 4 points 8 hours ago In an omnimus bill packed with $6T in pork for the donor class and Congressfckwads NGOs. This is so predictable. permalink parent award report block reply\nFromNC 11 points 9 hours ago Why is someone already receiving my tax funds more entitled to my money than I am making $9k over a ridiculously low threshold. permalink award report block reply JerryNadlerBeltFund 9 points 9 hours ago Their brains are stuck in 1995, when a $100k was a top 5% income for a family. permalink parent award report block reply schiff_for_brains 7 points 8 hours ago $100k is the new $50k. permalink parent award report block reply FromNC 3 points 8 hours ago This needs to be a $2k forgiveness of federal taxes if anything. permalink parent award report block reply\nJerryNadlerBeltFund 9 points 9 hours ago Their brains are stuck in 1995, when a $100k was a top 5% income for a family. permalink parent award report block reply schiff_for_brains 7 points 8 hours ago $100k is the new $50k. permalink parent award report block reply FromNC 3 points 8 hours ago This needs to be a $2k forgiveness of federal taxes if anything. permalink parent award report block reply\nschiff_for_brains 7 points 8 hours ago $100k is the new $50k. permalink parent award report block reply\nFromNC 3 points 8 hours ago This needs to be a $2k forgiveness of federal taxes if anything. permalink parent award report block reply\nLauraCoomer 10 points 9 hours ago Great, everything is going to get even more expensive. What the fuck is going on? permalink award report block reply MastaJoda 4 points 8 hours ago The continued control detonation of America. permalink parent award report block reply RolandDelacroix 3 points 7 hours ago Surely Trump isn't this stupid economically permalink parent award report block reply Atruckdriver 3 points 5 hours ago 50 yr mortgage says “Hi!” permalink parent award report block reply\nMastaJoda 4 points 8 hours ago The continued control detonation of America. permalink parent award report block reply\nRolandDelacroix 3 points 7 hours ago Surely Trump isn't this stupid economically permalink parent award report block reply Atruckdriver 3 points 5 hours ago 50 yr mortgage says “Hi!” permalink parent award report block reply\nAtruckdriver 3 points 5 hours ago 50 yr mortgage says “Hi!” permalink parent award report block reply\nCallsign_Fox1 8 points 10 hours ago That sucks for me. permalink award report block reply\nBannedAccount 6 points 9 hours ago Families making over 100,000? So if it's a married couple both people have to make less than 50k? If you're only making 50k in this economy I doubt $2000 will even make a dent in your financial issues. permalink award report block reply\nEvensoAmen 6 points 9 hours ago Hmmmmm…stupidity is multiplying permalink award report block reply stealthboy 3 points 8 hours ago Which is precisely why I have zero optimism for the future of our country. permalink parent award report block reply keeptherepublic1776 3 points 8 hours ago Same permalink parent award report block reply\nstealthboy 3 points 8 hours ago Which is precisely why I have zero optimism for the future of our country. permalink parent award report block reply keeptherepublic1776 3 points 8 hours ago Same permalink parent award report block reply\nkeeptherepublic1776 3 points 8 hours ago Same permalink parent award report block reply\nkeeptherepublic1776 5 points 8 hours ago Waiting for the trump boot lickers to defend This. Thump has 1 order. Destroy the middle class the rest of the way permalink award report block reply\nSilentSniper 5 points 9 hours ago Guess I ain’t getting one. Fuck this administration.  /s permalink award report block reply magamagashii 5 points 9 hours ago Same boat. It's okay while the poor take a nice cruise I can work overtime to pay taxes on my stocks that are up based solely on inflation but the overall value of my portfolio probably hasn't changed or has gone down. permalink parent award report block reply RolandDelacroix 3 points 7 hours ago Yep, wife and work over 50 hours week to make barely over $100k because that's middle class in my area. How about a tax cut instead? permalink parent award report block reply chickeninoven 3 points 7 hours ago Sorry slave. That just doesn't have the same WOW factor as a nice fat federal check in the mail. permalink parent award report block reply\nmagamagashii 5 points 9 hours ago Same boat. It's okay while the poor take a nice cruise I can work overtime to pay taxes on my stocks that are up based solely on inflation but the overall value of my portfolio probably hasn't changed or has gone down. permalink parent award report block reply\nRolandDelacroix 3 points 7 hours ago Yep, wife and work over 50 hours week to make barely over $100k because that's middle class in my area. How about a tax cut instead? permalink parent award report block reply chickeninoven 3 points 7 hours ago Sorry slave. That just doesn't have the same WOW factor as a nice fat federal check in the mail. permalink parent award report block reply\nchickeninoven 3 points 7 hours ago Sorry slave. That just doesn't have the same WOW factor as a nice fat federal check in the mail. permalink parent award report block reply\nmagamagashii 4 points 9 hours ago Zimbabwe will also be sending out $2000 checks to anyone making less than $100,000,000 a year.... permalink award report block reply\nrightoverthere 4 points 9 hours ago is we gettin free stuff? permalink award report block reply\nCloudNine 4 points 9 hours ago If it happens at all- it will only go to people who have a job and pay taxes. permalink award report block reply RolandDelacroix 2 points 7 hours ago Sure. permalink parent award report block reply\nRolandDelacroix 2 points 7 hours ago Sure. permalink parent award report block reply\nDEPORT50M 3 points 8 hours ago Oh good, more money for shaniqua and dawntay. What a fucking joke permalink award report block reply\nkeeptherepublic1776 3 points 8 hours ago Fuck you then. Families make under 100k are probably not even paying taxes permalink award report block reply\n2008RonPaul2012 2 points 8 hours ago Definitely gonna buy Bitcoin permalink award report block reply\nRolandDelacroix 2 points 7 hours ago Why are we doing stimulus checks instead of tax cuts or refunds? permalink award report block reply\nSpellmonger 1 points 6 hours ago Bessent: Stimulus checks would only go to families making less than $100,000 a year How about this , stimulus checks WILL only go to working families making less than 150,000 a year - and nothing for families who received government assistance for the last 9 months or more. Then, take the money that would have gone to the parasite class, and add it to the total amount of the stimulus and send each member of the working family a larger stimulus check. It is about time we, and all the members of our family got a Thank You Note. permalink award report block reply\nchickeninoven 1 points 7 hours ago Household income under $100k? Bro fuck you. permalink award report block reply\nWI-Patriot 1 points 7 hours ago In other words, the people who don't pay taxes.  Sigh... permalink award report block reply\nTrumpPatriot84 1 points 7 hours ago SNAP and EBT are about to get more money they don't deserve... Anyone on SNAP or EBT should be excluded. permalink award report block reply"}