{"id": "1ARK5BG34Z", "contents": "291 Firing squad. 🏆 CANT STOP  WINNING  🏆 posted 3 days ago by GodIsPerfect 6 comments award share download report block\n6 comments Sort by Top Top New Worst Old Save ramennov 12 points 3 days ago Correct. permalink award report block reply YearninNation 9 points 3 days ago Pam Bondi must be a retard. permalink award report block reply patrioticwinning3 4 points 3 days ago Or a globohomo agent.  Either way her, Todd Blanche, Krap Patel, and all globohomos and retards in the FBI and DOJ should be fired immediately and replaced with MAGA! permalink parent award report block reply YearninNation 1 points 3 days ago Replaced with some Marines permalink parent award report block reply HanginChad 7 points 3 days ago Is she in custody? She's a flight risk for sure. permalink award report block reply jakebrake 2 points 3 days ago She's more likely a dead woman limping. permalink parent award report block reply\nramennov 12 points 3 days ago Correct. permalink award report block reply\nYearninNation 9 points 3 days ago Pam Bondi must be a retard. permalink award report block reply patrioticwinning3 4 points 3 days ago Or a globohomo agent.  Either way her, Todd Blanche, Krap Patel, and all globohomos and retards in the FBI and DOJ should be fired immediately and replaced with MAGA! permalink parent award report block reply YearninNation 1 points 3 days ago Replaced with some Marines permalink parent award report block reply\npatrioticwinning3 4 points 3 days ago Or a globohomo agent.  Either way her, Todd Blanche, Krap Patel, and all globohomos and retards in the FBI and DOJ should be fired immediately and replaced with MAGA! permalink parent award report block reply YearninNation 1 points 3 days ago Replaced with some Marines permalink parent award report block reply\nYearninNation 1 points 3 days ago Replaced with some Marines permalink parent award report block reply\nHanginChad 7 points 3 days ago Is she in custody? She's a flight risk for sure. permalink award report block reply jakebrake 2 points 3 days ago She's more likely a dead woman limping. permalink parent award report block reply\njakebrake 2 points 3 days ago She's more likely a dead woman limping. permalink parent award report block reply"}