{"id": "1ARK9oXkvq", "contents": "250 Youtube Caught LYING As Mass Bannings Reveal The Truth We All Suspected. (www.youtube.com) 👋    IT'S  HAPPENING!   🖐️ posted 14 hours ago by SenorTrumper 21 comments award share report block\n21 comments Sort by Top Top New Worst Old Save Here_we_go 15 points 14 hours ago Jeremy loves his yt money soooo much. Oh buy his coffee too. permalink award report block reply AwShitHereWeGoAgain 1 points 14 hours ago KEK! permalink parent award report block reply SenorTrumper OP -11 points 14 hours ago You a communist, comrade? permalink parent award report block reply Here_we_go 7 points 14 hours ago Coffee brand coffee commie. permalink parent award report block reply SenorTrumper OP -10 points 14 hours ago Go home and come back when you're coherent. TIA permalink parent award report block reply Thatunknownguy 8 points 14 hours ago Zoomerhistorian was banned permalink award report block reply Combat_Hamster 4 points 13 hours ago It says \"This video has been removed by the uploader.\" Anyone got a rumble link to the video? permalink parent award report block reply General_Specific 6 points 14 hours ago \"video removed by uploader\" which prob means banned. permalink award report block reply War_Hamster 11 points 13 hours ago Putting a video on YouTube that’s about YouTube lying is a pretty good way to get yourself banned. permalink parent award report block reply General_Specific 3 points 13 hours ago Yep. permalink parent award report block reply NonbinaryPotatohead 3 points 11 hours ago Jeremy Hamplanet just needs a Quartermillion dollars to buy his wife's bull a new plane. I'm not even joking. If you have been following his poop tales (it's almost all he talks about these days) then you will know how badly he needs to keep his saltwater fish tank and RC playground. Cmon guys, he's under attack! This is not hyperbole. This is actually his current life story if you have been watching. permalink award report block reply SenorTrumper OP 0 points 11 hours ago LOL My bad.  Instead of digging deeper for a gooder source, I picked him.  I was actually been thinking about posting about how the powers that be are handing over the biggest platforms  like YT and TikTok to you-know-who, and then seeing Jeremy's video, I thought this is the one I will use as a source. Sorry. permalink parent award report block reply NonbinaryPotatohead 1 points 38 minutes ago Check out the Kino Casino's coverage of him, it's hilarious permalink parent award report block reply dirtysanchez69 0 points 14 hours ago DEPORT permalink award report block reply SenorTrumper OP -8 points 14 hours ago Deport what? YouTube?  YouTubers?  Jeremy? Learn how to think and communicate, FFS. permalink parent award report block reply brassmule 5 points 13 hours ago Who is Jeremy? The video you linked was deleted by the uploader, fwiw.  Is there an updated link for it? permalink parent award report block reply SenorTrumper OP -12 points 13 hours ago Nothing has been deleted. It's still there. Did you give him reason to block your sorry ass?\n🤦‍♀️ permalink parent award report block reply brassmule 15 points 13 hours ago https://i.imgur.com/Xo7BTMp.png It's pretty weird to get insulted for asking a question, my dearest brother in Christ. It's entirely unwarranted and undeserved.  Especially considering that you, the OP of this post, have failed to realize that the content you have posted no longer exists. As you can clearly see, the video has been deleted by the uploader. I have no idea who Jeremy is or what the channel might be, so I have no way to look to see if perhaps a different version is available. permalink parent award report block reply view 4 more comments...\nHere_we_go 15 points 14 hours ago Jeremy loves his yt money soooo much. Oh buy his coffee too. permalink award report block reply AwShitHereWeGoAgain 1 points 14 hours ago KEK! permalink parent award report block reply SenorTrumper OP -11 points 14 hours ago You a communist, comrade? permalink parent award report block reply Here_we_go 7 points 14 hours ago Coffee brand coffee commie. permalink parent award report block reply SenorTrumper OP -10 points 14 hours ago Go home and come back when you're coherent. TIA permalink parent award report block reply\nAwShitHereWeGoAgain 1 points 14 hours ago KEK! permalink parent award report block reply\nSenorTrumper OP -11 points 14 hours ago You a communist, comrade? permalink parent award report block reply Here_we_go 7 points 14 hours ago Coffee brand coffee commie. permalink parent award report block reply SenorTrumper OP -10 points 14 hours ago Go home and come back when you're coherent. TIA permalink parent award report block reply\nHere_we_go 7 points 14 hours ago Coffee brand coffee commie. permalink parent award report block reply SenorTrumper OP -10 points 14 hours ago Go home and come back when you're coherent. TIA permalink parent award report block reply\nSenorTrumper OP -10 points 14 hours ago Go home and come back when you're coherent. TIA permalink parent award report block reply\nThatunknownguy 8 points 14 hours ago Zoomerhistorian was banned permalink award report block reply Combat_Hamster 4 points 13 hours ago It says \"This video has been removed by the uploader.\" Anyone got a rumble link to the video? permalink parent award report block reply\nCombat_Hamster 4 points 13 hours ago It says \"This video has been removed by the uploader.\" Anyone got a rumble link to the video? permalink parent award report block reply\nGeneral_Specific 6 points 14 hours ago \"video removed by uploader\" which prob means banned. permalink award report block reply War_Hamster 11 points 13 hours ago Putting a video on YouTube that’s about YouTube lying is a pretty good way to get yourself banned. permalink parent award report block reply General_Specific 3 points 13 hours ago Yep. permalink parent award report block reply\nWar_Hamster 11 points 13 hours ago Putting a video on YouTube that’s about YouTube lying is a pretty good way to get yourself banned. permalink parent award report block reply General_Specific 3 points 13 hours ago Yep. permalink parent award report block reply\nGeneral_Specific 3 points 13 hours ago Yep. permalink parent award report block reply\nNonbinaryPotatohead 3 points 11 hours ago Jeremy Hamplanet just needs a Quartermillion dollars to buy his wife's bull a new plane. I'm not even joking. If you have been following his poop tales (it's almost all he talks about these days) then you will know how badly he needs to keep his saltwater fish tank and RC playground. Cmon guys, he's under attack! This is not hyperbole. This is actually his current life story if you have been watching. permalink award report block reply SenorTrumper OP 0 points 11 hours ago LOL My bad.  Instead of digging deeper for a gooder source, I picked him.  I was actually been thinking about posting about how the powers that be are handing over the biggest platforms  like YT and TikTok to you-know-who, and then seeing Jeremy's video, I thought this is the one I will use as a source. Sorry. permalink parent award report block reply NonbinaryPotatohead 1 points 38 minutes ago Check out the Kino Casino's coverage of him, it's hilarious permalink parent award report block reply\nSenorTrumper OP 0 points 11 hours ago LOL My bad.  Instead of digging deeper for a gooder source, I picked him.  I was actually been thinking about posting about how the powers that be are handing over the biggest platforms  like YT and TikTok to you-know-who, and then seeing Jeremy's video, I thought this is the one I will use as a source. Sorry. permalink parent award report block reply NonbinaryPotatohead 1 points 38 minutes ago Check out the Kino Casino's coverage of him, it's hilarious permalink parent award report block reply\nNonbinaryPotatohead 1 points 38 minutes ago Check out the Kino Casino's coverage of him, it's hilarious permalink parent award report block reply\ndirtysanchez69 0 points 14 hours ago DEPORT permalink award report block reply SenorTrumper OP -8 points 14 hours ago Deport what? YouTube?  YouTubers?  Jeremy? Learn how to think and communicate, FFS. permalink parent award report block reply brassmule 5 points 13 hours ago Who is Jeremy? The video you linked was deleted by the uploader, fwiw.  Is there an updated link for it? permalink parent award report block reply SenorTrumper OP -12 points 13 hours ago Nothing has been deleted. It's still there. Did you give him reason to block your sorry ass?\n🤦‍♀️ permalink parent award report block reply brassmule 15 points 13 hours ago https://i.imgur.com/Xo7BTMp.png It's pretty weird to get insulted for asking a question, my dearest brother in Christ. It's entirely unwarranted and undeserved.  Especially considering that you, the OP of this post, have failed to realize that the content you have posted no longer exists. As you can clearly see, the video has been deleted by the uploader. I have no idea who Jeremy is or what the channel might be, so I have no way to look to see if perhaps a different version is available. permalink parent award report block reply view 4 more comments...\nSenorTrumper OP -8 points 14 hours ago Deport what? YouTube?  YouTubers?  Jeremy? Learn how to think and communicate, FFS. permalink parent award report block reply brassmule 5 points 13 hours ago Who is Jeremy? The video you linked was deleted by the uploader, fwiw.  Is there an updated link for it? permalink parent award report block reply SenorTrumper OP -12 points 13 hours ago Nothing has been deleted. It's still there. Did you give him reason to block your sorry ass?\n🤦‍♀️ permalink parent award report block reply brassmule 15 points 13 hours ago https://i.imgur.com/Xo7BTMp.png It's pretty weird to get insulted for asking a question, my dearest brother in Christ. It's entirely unwarranted and undeserved.  Especially considering that you, the OP of this post, have failed to realize that the content you have posted no longer exists. As you can clearly see, the video has been deleted by the uploader. I have no idea who Jeremy is or what the channel might be, so I have no way to look to see if perhaps a different version is available. permalink parent award report block reply view 4 more comments...\nbrassmule 5 points 13 hours ago Who is Jeremy? The video you linked was deleted by the uploader, fwiw.  Is there an updated link for it? permalink parent award report block reply SenorTrumper OP -12 points 13 hours ago Nothing has been deleted. It's still there. Did you give him reason to block your sorry ass?\n🤦‍♀️ permalink parent award report block reply brassmule 15 points 13 hours ago https://i.imgur.com/Xo7BTMp.png It's pretty weird to get insulted for asking a question, my dearest brother in Christ. It's entirely unwarranted and undeserved.  Especially considering that you, the OP of this post, have failed to realize that the content you have posted no longer exists. As you can clearly see, the video has been deleted by the uploader. I have no idea who Jeremy is or what the channel might be, so I have no way to look to see if perhaps a different version is available. permalink parent award report block reply view 4 more comments...\nSenorTrumper OP -12 points 13 hours ago Nothing has been deleted. It's still there. Did you give him reason to block your sorry ass?\n🤦‍♀️ permalink parent award report block reply brassmule 15 points 13 hours ago https://i.imgur.com/Xo7BTMp.png It's pretty weird to get insulted for asking a question, my dearest brother in Christ. It's entirely unwarranted and undeserved.  Especially considering that you, the OP of this post, have failed to realize that the content you have posted no longer exists. As you can clearly see, the video has been deleted by the uploader. I have no idea who Jeremy is or what the channel might be, so I have no way to look to see if perhaps a different version is available. permalink parent award report block reply view 4 more comments...\nbrassmule 15 points 13 hours ago https://i.imgur.com/Xo7BTMp.png It's pretty weird to get insulted for asking a question, my dearest brother in Christ. It's entirely unwarranted and undeserved.  Especially considering that you, the OP of this post, have failed to realize that the content you have posted no longer exists. As you can clearly see, the video has been deleted by the uploader. I have no idea who Jeremy is or what the channel might be, so I have no way to look to see if perhaps a different version is available. permalink parent award report block reply view 4 more comments..."}