{"id": "1ARK9nPLsW", "contents": "6 “Demoralized MAGA” seems to ring true, based on what I’m reading here today. (m.youtube.com) posted 7 hours ago by Taqiyya_Mockingbird 6 comments award share report block\n6 comments Sort by Top Top New Worst Old Save Around the Web Salt Lake City's Hair Growth Method Breaks All Records! HaloGrow HeavenlyTrumpets 7 points 6 hours ago Israel is only one reason.  Many things are happening right now, and if Trump doesn't start wielding a big response to it, the midterms are going to be a complete bloodbath. permalink award report block reply GA_Logic 3 points 6 hours ago I am energized to know the energy executive orders for President Trump will be in full swing in Q1 of 2026.  Also, inflation is going to slow down by December based on predictions with the m2 money supply. Obamacare is about to be nuked and the tariff dividend is around the corner. Things are looking up for the USA. permalink award report block reply LaptopDied 2 points 6 hours ago Not me. permalink award report block reply Girthquakes 2 points 6 hours ago By design, not organic. Think \"death by a thousand cuts\" permalink award report block reply possibletower -2 points 6 hours ago It is a fakeass DeSantis 2028 astroturf campaign. Notice how they want us to not talk about the end of the shutdown which is a fucking train wreck for the Dems but instead bitch about Trump and whine more about Trump than Democrats. They were hoping EBT riots would happen so DeSantis could have his Yeltsin on a tank moment and denounce Trump and claim that DeSantis is the real MAGA patriot.  They shifted to Plan D. permalink award report block reply DirtyDiaperJoe -1 points 6 hours ago Ron Meatball will NEVER be President.  He's a twerp.  And no matter what the Sea Island cunts want, it's not going to happen.  Ron and his lovely wife, cooked their goose, when they went anti-MAGA.  We haven't forgotten and won't. permalink parent award report block reply\nHeavenlyTrumpets 7 points 6 hours ago Israel is only one reason.  Many things are happening right now, and if Trump doesn't start wielding a big response to it, the midterms are going to be a complete bloodbath. permalink award report block reply\nGA_Logic 3 points 6 hours ago I am energized to know the energy executive orders for President Trump will be in full swing in Q1 of 2026.  Also, inflation is going to slow down by December based on predictions with the m2 money supply. Obamacare is about to be nuked and the tariff dividend is around the corner. Things are looking up for the USA. permalink award report block reply\nLaptopDied 2 points 6 hours ago Not me. permalink award report block reply\nGirthquakes 2 points 6 hours ago By design, not organic. Think \"death by a thousand cuts\" permalink award report block reply\npossibletower -2 points 6 hours ago It is a fakeass DeSantis 2028 astroturf campaign. Notice how they want us to not talk about the end of the shutdown which is a fucking train wreck for the Dems but instead bitch about Trump and whine more about Trump than Democrats. They were hoping EBT riots would happen so DeSantis could have his Yeltsin on a tank moment and denounce Trump and claim that DeSantis is the real MAGA patriot.  They shifted to Plan D. permalink award report block reply DirtyDiaperJoe -1 points 6 hours ago Ron Meatball will NEVER be President.  He's a twerp.  And no matter what the Sea Island cunts want, it's not going to happen.  Ron and his lovely wife, cooked their goose, when they went anti-MAGA.  We haven't forgotten and won't. permalink parent award report block reply\nDirtyDiaperJoe -1 points 6 hours ago Ron Meatball will NEVER be President.  He's a twerp.  And no matter what the Sea Island cunts want, it's not going to happen.  Ron and his lovely wife, cooked their goose, when they went anti-MAGA.  We haven't forgotten and won't. permalink parent award report block reply"}