{"id": "1ARK58zFZ8", "contents": "244 Inside. Job. 🏆 CANT STOP  WINNING  🏆 posted 4 days ago by GodIsPerfect 8 comments award share report block Kyle Seraphin @KyleSeraphin • 4d A woman who testified in court about J6, who worked for the Congressional praetorian guard, who somehow passed a CIA polygraph despite having left pipe bombs around Washington DC on Jan 5 has been able to elude an $11B investigative agency which offered a $500k reward for 5 years Steve Baker @SteveBakerUSA • 5d This might just be the biggest scandal and conspiracy in American history. Many heroes were involved in bringing this to light. Some we can name in coming days. Some who want no recognition. And there’s much more to this yet to be told.\n8 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style USDMaga 8 points 4 days ago FBI knew who it was, they are attempting to cover/bury it. The $500k reward was them trying to prove they were serious, but they thought no one would turn her in. Now Kash is stuck.  He said he would prosecute, knowing he wouldn't, but she is now public.  He can either resign or just come out and admit he is just as bad as Comey and nothing will happen to her. permalink award report block reply Threaper666 7 points 4 days ago They knew who it was.  They just didn't say anything, because they liked letting people thinking that it was some MAGA person who did it. permalink parent award report block reply RINOssuck 1 points 4 days ago Where are you getting all of that bullshit? permalink parent award report block reply OpusX 6 points 4 days ago A woman who testified in court about J6, who worked for the Congressional praetorian guard, who somehow passed a CIA polygraph despite having left pipe bombs around Washington DC on Jan 5 has been able to elude an $11B investigative agency which offered a $500k reward for 5 years Had no problem scouring the internet and social media to ruthlessly hunt down MAGA mee-maws for taking selfies in the Capitol Rotunda though, did they? permalink award report block reply Deplora 4 points 4 days ago Reminder:  This \"identification\" is still nothing but clickbaity rumor. permalink award report block reply MrPfizer 3 points 4 days ago I've seen pictures of this year's ago on 4 chan.  They matched the shoes if I remember correctly. permalink award report block reply USDMaga 1 points 4 days ago It was a pair of shoes I think they sold 40,000 of in the US.  So it didn't get the person but narrowed it down a lot. permalink parent award report block reply MrPfizer 1 points 4 days ago I remember a picture of the capital police or something and the chick was wearing the same shoes, not long before or after.  Its been a while. permalink parent award report block reply\nUSDMaga 8 points 4 days ago FBI knew who it was, they are attempting to cover/bury it. The $500k reward was them trying to prove they were serious, but they thought no one would turn her in. Now Kash is stuck.  He said he would prosecute, knowing he wouldn't, but she is now public.  He can either resign or just come out and admit he is just as bad as Comey and nothing will happen to her. permalink award report block reply Threaper666 7 points 4 days ago They knew who it was.  They just didn't say anything, because they liked letting people thinking that it was some MAGA person who did it. permalink parent award report block reply RINOssuck 1 points 4 days ago Where are you getting all of that bullshit? permalink parent award report block reply\nThreaper666 7 points 4 days ago They knew who it was.  They just didn't say anything, because they liked letting people thinking that it was some MAGA person who did it. permalink parent award report block reply\nRINOssuck 1 points 4 days ago Where are you getting all of that bullshit? permalink parent award report block reply\nOpusX 6 points 4 days ago A woman who testified in court about J6, who worked for the Congressional praetorian guard, who somehow passed a CIA polygraph despite having left pipe bombs around Washington DC on Jan 5 has been able to elude an $11B investigative agency which offered a $500k reward for 5 years Had no problem scouring the internet and social media to ruthlessly hunt down MAGA mee-maws for taking selfies in the Capitol Rotunda though, did they? permalink award report block reply\nDeplora 4 points 4 days ago Reminder:  This \"identification\" is still nothing but clickbaity rumor. permalink award report block reply\nMrPfizer 3 points 4 days ago I've seen pictures of this year's ago on 4 chan.  They matched the shoes if I remember correctly. permalink award report block reply USDMaga 1 points 4 days ago It was a pair of shoes I think they sold 40,000 of in the US.  So it didn't get the person but narrowed it down a lot. permalink parent award report block reply MrPfizer 1 points 4 days ago I remember a picture of the capital police or something and the chick was wearing the same shoes, not long before or after.  Its been a while. permalink parent award report block reply\nUSDMaga 1 points 4 days ago It was a pair of shoes I think they sold 40,000 of in the US.  So it didn't get the person but narrowed it down a lot. permalink parent award report block reply MrPfizer 1 points 4 days ago I remember a picture of the capital police or something and the chick was wearing the same shoes, not long before or after.  Its been a while. permalink parent award report block reply\nMrPfizer 1 points 4 days ago I remember a picture of the capital police or something and the chick was wearing the same shoes, not long before or after.  Its been a while. permalink parent award report block reply"}