{"id": "1ARK52Cnea", "contents": "488 You want to know why the GOP Congress isn't doing ANYTHING to help Trump? \n\nIts because  Republicans are funded by Democrats. \n\nMeet the Uniparty. posted 6 days ago by ALT26 15 comments award share report block Mila Joy @MilaLovesJoe • 7d You want to know why the GOP Congress isn't doing ANYTHING to help Trump? Its because  Republicans are funded by Democrats. Meet the Uniparty.\n15 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Counterwhat 18 points 6 days ago The Republicans are the Washington generals watching the globetrotters dribble up and down the court before being embarrassingly tea bag dunked on. permalink award report block reply suckmycorona 8 points 6 days ago Way underrated comment.  Never have I put those words to it and it’s perfect.  And who pays the generals? The globetrotters. permalink parent award report block reply Counterwhat 4 points 6 days ago Thanks. Yep. permalink parent award report block reply LiteraIIyHitIer 3 points 6 days ago I'm so glad this analogy is catching on with people. permalink parent award report block reply PatriotSkorzeny 9 points 6 days ago We know. We thought MAGA would end that shit cause they broke actual laws and we have the 1 and 2 spot at the FBI. 🤣 permalink award report block reply sordfysh PRO 2 points 6 days ago There is one white pill left. One hopium pill left. The winter is the only time Democrats don't riot, so maybe the winter will result in arrests. Come on guys. Two more weeks. permalink parent award report block reply HeatherSwanson 4 points 6 days ago Because sassy Mike Johnson is LGBTQ++ permalink award report block reply MastaJoda 3 points 6 days ago No sticky...fuck these mods Lets pin a few more posts on egg prices. permalink award report block reply BBvarn 3 points 6 days ago GOP must nuke the filibuster or die.  And what sucks is, Trump will be taken down by the GOP pussies. permalink award report block reply Bullet3250 8 points 6 days ago Establishment GOP absolutely hates Trump and they hate all his policies. ZERO will even talk them up in Public.   It's an absolute betrayal of not just TRUMP - but all us voters too. Meanwhile most of the Dems are as politically united as the Mormon Tabernacle Choir singing Christmas songs. permalink parent award report block reply GBA4ever 4 points 6 days ago Establishment republicans are waiting for the Trump storm to pass so they can go back to being the minority in the background complaining but claiming they can’t do anything. permalink parent award report block reply brutustyberius 7 points 6 days ago This is becoming painfully accurate. We will never see voter laws passed in our favor ever again. We are in seriously deep shit. permalink parent award report block reply TruthWillOut 1 points 6 days ago 🐸❤️🫡 permalink award report block reply Centipedealicious 1 points 5 days ago This is so true. The GOP wants money. The DNC wants power. That’s why the GOP lets the DNC win. Because they can fundraise better when the DNC is in charge. permalink award report block reply\nCounterwhat 18 points 6 days ago The Republicans are the Washington generals watching the globetrotters dribble up and down the court before being embarrassingly tea bag dunked on. permalink award report block reply suckmycorona 8 points 6 days ago Way underrated comment.  Never have I put those words to it and it’s perfect.  And who pays the generals? The globetrotters. permalink parent award report block reply Counterwhat 4 points 6 days ago Thanks. Yep. permalink parent award report block reply LiteraIIyHitIer 3 points 6 days ago I'm so glad this analogy is catching on with people. permalink parent award report block reply\nsuckmycorona 8 points 6 days ago Way underrated comment.  Never have I put those words to it and it’s perfect.  And who pays the generals? The globetrotters. permalink parent award report block reply Counterwhat 4 points 6 days ago Thanks. Yep. permalink parent award report block reply\nCounterwhat 4 points 6 days ago Thanks. Yep. permalink parent award report block reply\nLiteraIIyHitIer 3 points 6 days ago I'm so glad this analogy is catching on with people. permalink parent award report block reply\nPatriotSkorzeny 9 points 6 days ago We know. We thought MAGA would end that shit cause they broke actual laws and we have the 1 and 2 spot at the FBI. 🤣 permalink award report block reply sordfysh PRO 2 points 6 days ago There is one white pill left. One hopium pill left. The winter is the only time Democrats don't riot, so maybe the winter will result in arrests. Come on guys. Two more weeks. permalink parent award report block reply\nsordfysh PRO 2 points 6 days ago There is one white pill left. One hopium pill left. The winter is the only time Democrats don't riot, so maybe the winter will result in arrests. Come on guys. Two more weeks. permalink parent award report block reply\nHeatherSwanson 4 points 6 days ago Because sassy Mike Johnson is LGBTQ++ permalink award report block reply\nMastaJoda 3 points 6 days ago No sticky...fuck these mods Lets pin a few more posts on egg prices. permalink award report block reply\nBBvarn 3 points 6 days ago GOP must nuke the filibuster or die.  And what sucks is, Trump will be taken down by the GOP pussies. permalink award report block reply Bullet3250 8 points 6 days ago Establishment GOP absolutely hates Trump and they hate all his policies. ZERO will even talk them up in Public.   It's an absolute betrayal of not just TRUMP - but all us voters too. Meanwhile most of the Dems are as politically united as the Mormon Tabernacle Choir singing Christmas songs. permalink parent award report block reply GBA4ever 4 points 6 days ago Establishment republicans are waiting for the Trump storm to pass so they can go back to being the minority in the background complaining but claiming they can’t do anything. permalink parent award report block reply brutustyberius 7 points 6 days ago This is becoming painfully accurate. We will never see voter laws passed in our favor ever again. We are in seriously deep shit. permalink parent award report block reply\nBullet3250 8 points 6 days ago Establishment GOP absolutely hates Trump and they hate all his policies. ZERO will even talk them up in Public.   It's an absolute betrayal of not just TRUMP - but all us voters too. Meanwhile most of the Dems are as politically united as the Mormon Tabernacle Choir singing Christmas songs. permalink parent award report block reply GBA4ever 4 points 6 days ago Establishment republicans are waiting for the Trump storm to pass so they can go back to being the minority in the background complaining but claiming they can’t do anything. permalink parent award report block reply\nGBA4ever 4 points 6 days ago Establishment republicans are waiting for the Trump storm to pass so they can go back to being the minority in the background complaining but claiming they can’t do anything. permalink parent award report block reply\nbrutustyberius 7 points 6 days ago This is becoming painfully accurate. We will never see voter laws passed in our favor ever again. We are in seriously deep shit. permalink parent award report block reply\nTruthWillOut 1 points 6 days ago 🐸❤️🫡 permalink award report block reply\nCentipedealicious 1 points 5 days ago This is so true. The GOP wants money. The DNC wants power. That’s why the GOP lets the DNC win. Because they can fundraise better when the DNC is in charge. permalink award report block reply"}