{"id": "1ARK53KN5k", "contents": "1221 I am thrilled to announce an incredible Trade and Economic Deal between the United States and Uzbekistan. TRUMP  TRUTH posted 6 days ago by I-am-Orlando PRO 197 comments award share download report block\n197 comments Sort by Top Top New Worst Old Save Baconb_breakfast 98 points 6 days ago Unless I’m missing something, the common thread between all of these trade deals is the rare earth minerals, i.e., “critical minerals”. It’s the way to keep China from holding the US hostage because we were so reliant on permalink award report block reply Husky 50 points 6 days ago Rare earth minerals aren't all that rare. We have them in the us, we just don't mine them. Solution seems to be... mine them permalink parent award report block reply breadbaker 37 points 6 days ago We have them in the us, we just don't mine them. You have to be willing to destroy vast stretches of land to leach and refine a small amount. Much smarter to invest in a material resources recovery methods to avoid landfilling rare earths. Something that we could aim for when we would not be entertaining Zelensky and Netanyahu for the 10th time this year. permalink parent award report block reply Aambrick 11 points 6 days ago TMSRs Very obvious for the last 15 years. Thorium Molten Salts Reactors Thorium is almost always tied to a cheap rare earth mineral monazite. There is other types of rare-earths connected, but monazite is the most commonly found with Thorium. There is literally a very simple and effective solution that nobody wants to implement except people that actually understand this. I support TMSRs for energy mainly, but there is a vast amount of subsets to this than just energy. Just the Cheap Rare earth mineral Monazite is just one part of the discussion. The fact that our own Government has done its best to kill any research into it while selling everything they have on it to China should say a lot about the situation. permalink parent award report block reply breadbaker 4 points 6 days ago I thought that ran its course and the last one (in AZ?) closed. 1+ billion write off. Seemed like a good idea to me. Sad to read what you write about its demise. permalink parent award report block reply view 1 more comments... MehNahMehNah 2 points 5 days ago Sounds like 'rare earth' won't be as rare as it sounds. Could be good for the market if you're buying. permalink parent award report block reply FullyDilated 1 points 6 days ago lol no you don't permalink parent award report block reply ShadowInv 0 points 6 days ago Fetch an asteroid full of them drag it back nearby. Total jobs creator, and double funny if it’s solid gold. permalink parent award report block reply Decepticons-superior 5 points 6 days ago Let’s train a bunch of drillers to be astronauts. Or do we train a bunch of astronauts to be drillers? permalink parent award report block reply view 4 more comments... RedStoneDeepState -6 points 6 days ago Someone should gouge out your eyes so we pay a Mexican to be your full time nurse. That is a \"job creator\". Fuck off with this demand side nonsense. permalink parent award report block reply view 2 more comments... ifyoustrikemedown 7 points 6 days ago We are trying to but we just assumed the supply from China was safe and so we never invested in the industry. Rare earths are technically not rare, but you have to mine like 3 football fields for 1 jar of the mineral. It's an incredibly dirty and intensive process to get the minerals in pure form. That's why we let China do it. I've heard we are 10+ years out from having a stable domestic supply. permalink parent award report block reply anotherrandomname 5 points 6 days ago We are trying to but we just assumed the supply from China was safe and so we never invested in the industry. No, we used to have an industry, what happened was China was dumping them cheap as fuck and undercutting what was possible for US mines and drove them out of business, and now that they've created a monopoly they're jacking prices up and using them for geopolitical purposes, which was, obviously, the plan all along, and makes a strong case for tariffs to protect local industry from such foreign dumping and monopolization. permalink parent award report block reply ifyoustrikemedown 4 points 6 days ago China was dumping, but the US rare earth industry never really took off. China took over as rare earth's started to be used in more and more technology. We didn't prioritize domestic production because we didn't realize their strategic importance and Washington DC is a lumbering dinosaur. Here's one source I came across: https://chinapower.csis.org/china-rare-earths/ In recent years, the US has sought to reestablish itself as a major world supplier of rare earths. After being shuttered for years, the US’ only rare earth mine, located in Mountain Pass, California, came under new ownership in 2017 and resumed production. However, the mined material that it produces is still sent to China for processing. The US government has also made notable policy changes, including the May 2018 addition of rare earths to a list of minerals deemed critical to US economic and national security. In July 2019, President Trump also declared rare earth metals and alloys “essential to the national defense,” which freed up resources for the Department of Defense (DoD) to take action to secure a domestic rare earth production capability. If you look at the first chart, rare earth production began to skyrocket in the 90s. Our capacity never grew with demand. permalink parent award report block reply view 1 more comments... RedStoneDeepState 1 points 6 days ago No, the entire global industry is still only worth about 4 billion and most of the demand remains in Asian markets. I swear China is trying to get Trump to do stupid trade deals. permalink parent award report block reply RedStoneDeepState 0 points 6 days ago but you have to mine like 3 football fields for 1 jar of the mineral. Incorrect, the ore concentration of our one mine in Arizona is on average about 6%. It is just a bitch to separate lanthanides. That is it. permalink parent award report block reply ifyoustrikemedown 2 points 6 days ago I was just trying to make the point that the refinement is the issue, not the mining. I think it varies from mineral to mineral and from mine to mine. 6% is probably high for rare earths. permalink parent award report block reply TerryBibble 3 points 6 days ago Rare in this case is state rather than scarcity permalink parent award report block reply PitfallHarry 2 points 6 days ago What happened to drill baby drill? permalink parent award report block reply phro 1 points 5 days ago Are you not paying attention? We are already setting new all time high production and not slowing down. https://www.eia.gov/dnav/pet/hist/LeafHandler.ashx?n=PET&s=MCRFPUS2&f=M permalink parent award report block reply PitfallHarry 1 points 5 days ago So prices are down. That’s what I keep telling people. permalink parent award report block reply RedStoneDeepState -1 points 6 days ago Lanthanides are not oil. permalink parent award report block reply PitfallHarry 1 points 5 days ago Mine. Drill. All the same thing. permalink parent award report block reply BirthHole 1 points 5 days ago we could mine them, but the overhead to mine then 'environmentally safe' doesnt make it profitable. permalink parent award report block reply load 7 more comments... Skogin 12 points 6 days ago Right on, right on. permalink parent award report block reply DeportThemAllForever 3 points 6 days ago Another “stan” country. permalink parent award report block reply carpetxparmesan 2 points 5 days ago I'm more interested in a different offshoot of that thinking. This \"stan\" is in Russia's backyard. VERY backyard. Russia's had some disagreements with these 'stanis, sure, but they still control this stan. Two options present itself: A. US wants to go balls deep in another ukraine-like front which is unlikely B. They struck a deal with russia. which leads us to B.1. They've reached a \"deal\" on ukraine B.2. They're doing this deal with russia as an aside without reaching a deal on ukraine. This is a big story. Not really a story about mining at all. permalink parent award report block reply Yawnz13 1 points 6 days ago What about it? permalink parent award report block reply AfrikaanerBoer 3 points 6 days ago SUPERIOR POTASSIUM 💯 permalink parent award report block reply FatigueIsReal 2 points 6 days ago Yes, but I think its broader than that. Trump is effectively encircling China and Russia with economic partners and trade deals. He's using America's strengths to essentially choke out China and Russia, and India too if they keep their shit up. And though most people on here are blind to it, this includes Israel and Muslim ME nations. permalink parent award report block reply carpetxparmesan 1 points 5 days ago This 'stan isn't one of russia's \"neighbors\", this is like germany buying ng from russia while chanting slava ukraina. permalink parent award report block reply FatigueIsReal 2 points 5 days ago True, but it is a China neighbor. permalink parent award report block reply carpetxparmesan 2 points 5 days ago I don't try to figure this stuff out, we're too low on the information pole. I just entertain and educate youse and let you think things for yourself. I'm sure half this thread doesn't know crimean dirt from uzbeki dirt. I really doubt most people on TD keep track of which \"client states\" russia has and which stage of maskerovka or false feud or actual feud or uzbek daytime telenovela russia and uzbekistan are in at the moment. TBQH, I don't exactly remember why the uzbeks aren't yet another state within the russian \"federation\" even though I've got a little uzbek starik on my shelf right now. Don't worry, he gets potato vodka and the AC is on. Aight, here we go... 5min history of the squints uzbekistan: https://youtu.be/Wf3e9omI9ok KEK. That 3 min video went about like I expected. Enjoy! permalink parent award report block reply DITTOPatriot 1 points 5 days ago That the illusion they meant for you to see. permalink parent award report block reply load 9 more comments... Zskills 32 points 6 days ago The chess pieces are moving.   Rare earth mineral deals.   Investment in nuclear power.  Domestic chip production.  The race to super artificial intelligence.  Whoever wins controls the fate of humanity.   It's all about this. permalink award report block reply Krat 40 points 6 days ago All will be undone by democrats in hours permalink parent award report block reply staroframphansbhole 17 points 6 days ago Nah they’ll just keep the good parts of Trump’s economic policies but pretend it was their idea all along, then reintroduce gayness into everything permalink parent award report block reply Decepticons-superior 3 points 6 days ago Yes gayness is the crucial piece. permalink parent award report block reply Retard_Strength 3 points 5 days ago \"President AOC today announced a ground-breaking incentive to hire more LGBTQIA++ miners...\" permalink parent award report block reply Senaleb 3 points 6 days ago Mining rare earths inside a mans hairy butthole -Democrat mining permalink parent award report block reply LordKuroTheGreat 3 points 6 days ago They'd start spinning around spewing pea soup like a scene from The Exorcist if they tried to retain something objectively good but related to Trump. permalink parent award report block reply staroframphansbhole 1 points 5 days ago They did though! Biden kept many of Trump's tariffs in place particularly on China and the left just ignored it or said it was cool because it was their guy doing it. permalink parent award report block reply snoopy3210 4 points 6 days ago Let’s hope it wont be an artificial economy too permalink parent award report block reply PitfallHarry 1 points 6 days ago Domestic chip production was increased 3 years ago with the chips act. permalink parent award report block reply Zskills 1 points 6 days ago Correct.  And when do you think power brokers saw the gravity of China controlling a super artificial intelligence?  Last week? permalink parent award report block reply PitfallHarry 2 points 6 days ago Nope. 3+ years ago. That’s why we kept the chip supply from flowing to China. That however forced them to do more with less and they now have some of the most efficient model available. That’s why deepseek was so disruptive. permalink parent award report block reply carpetxparmesan 2 points 5 days ago That other guy was a bit too mean, but I was going to post a youtube video on why and how this \"chip investment\" has been a failure just a few weeks ago. I'm not going to insult you personally, it's not about that, but I am getting pretty tired of normies on this site talking about the chips thing without actually knowing details about what's going on with the chips; not YOU personally. To summarize the problem, I'm going to relay an anecdote. Allegedly, the taiwanese JUMPED on this Trump opportunity and wanted to take advantage of it. So they TRIED. And, this is not my word, or my spin, this is how they presented it... they could not even get CLEAN ENOUGH WATER for their yields. As they presented (spin or not), they said they found out that the supply chain here does not even come close to what taiwan has set up over there. They imply, at a minimum, that supply chain problem would need to be fixed. Meaning, and these are my words now, it would take another 3-4 years before the supply chain could yield results and here's the BIG kicker... few people are even trying to work on supply chain issues. My interpretation of all this is the chip program is in big trouble here in the USA and it'll be ripe to be called a failure whenever democrats gain the least bit of power. I don't think it's a complete failure, but there's a lot more to be talked about on the issue. We might want to talk to the mods about doing a series of posts on the issue, maybe get some AMA from someone actually in the trenches in the admin or something. I think there's a lot to be unpacked (good and bad). But it's such a small part of the \"program\" right now and things are moving at such breakneck speed... it might be pointless just to inform people. permalink parent award report block reply view 1 more comments... Zskills 1 points 6 days ago Ah, so you do know what's going on 👌  yep.  A lot more makes sense when you're clued in to this issue permalink parent award report block reply KernalMustard 1 points 6 days ago Then Skynet permalink parent award report block reply load 2 more comments... DJT_MFers1 32 points 6 days ago Hey President Trump, can we get a trade deal for Pam Bondi? permalink award report block reply guywholikesDjtof2024 6 points 6 days ago deport scam bondi to Uzbekistanistan. permalink parent award report block reply carpetxparmesan 2 points 5 days ago But what do we get in return? permalink parent award report block reply ShadowInv 28 points 6 days ago I don’t care, I can’t afford a house without going into crazy debt and the streetshitters all got theirs for half the current asking price. We don’t care about ubequizstan. permalink award report block reply 24601 27 points 6 days ago I don't know... but it really looks like Trump misses the impeachment process.... because that's what's going to happen when the Communists take back Congress next fall. MAGA ?  Where is MAGA ? Calling MAGA. permalink award report block reply Lurker404 8 points 6 days ago Yea, nobody cares about all that foreign policy stuff when the issues at home aren't addressed. permalink parent award report block reply EgregiousPhilbin 0 points 6 days ago The reason Congress goes D this time is because of Congress, not Trump. Trump is a boomer and he's not perfect, but I'd still vote for him. I will never, and I mean never, vote for a RINO congress fag. permalink parent award report block reply deleted 21 points 6 days ago RuleoVicus 15 points 6 days ago Doesn't. permalink parent award report block reply 1_Badcop 13 points 6 days ago More importantly, how does this benefit Israel? permalink parent award report block reply Yawnz13 -1 points 6 days ago Who said that it would?  Why are you acting as if those are the only extant issues? permalink parent award report block reply Pongpagongbatibot 0 points 6 days ago These are groypers. They pretend to be America first and white nationalists but in reality they are Iranian trolls. Notice that for every topic in discussion, majority of comments are anti-trump.. that's a sign that PDW is now overran by Iranian agents permalink parent award report block reply Yawnz13 1 points 5 days ago Nah, just a concern troll. permalink parent award report block reply deleted 1 points 5 days ago Yawnz13 1 points 5 days ago Yeah, you. permalink parent award report block reply SenorTrumper 1 points 5 days ago We have a far worse problem than Iranians. Iranians didn't murder Charlie. permalink parent award report block reply AR_MAGA -8 points 6 days ago Typical socialist phrase, don't expect anything from the government. permalink parent award report block reply 1_Badcop 6 points 6 days ago Expecting the man who promised to Make America Great Again to actually do something to Make America Great Again is, in no way, socialist. permalink parent award report block reply Yawnz13 3 points 6 days ago And acting like this doesn't help make that is peak stupid. permalink parent award report block reply AR_MAGA -1 points 5 days ago If your family rely on another man, not you, you're either a socialist or lazy. permalink parent award report block reply 1_Badcop 2 points 5 days ago You are fucking retarded. Can you even comprehend the English language? WTF are you talking about? Holding a man accountable for doing his job is neither socialist nor lazy, and has nothing to do with one's family. Go back wherever you came from, Pidgen English speaker. permalink parent award report block reply view 2 more comments... JoeBidensDementia1 18 points 6 days ago Who? Fuck this shit. The Muslims are taking over on of our greatest cities! DEPORT THEM ALL! permalink award report block reply Wallllllllllllllllll 4 points 6 days ago Uzbeki-beki-bekistan permalink parent award report block reply guywholikesDjtof2024 3 points 6 days ago uzburkaburkastan permalink parent award report block reply SenorTrumper 2 points 5 days ago First the juice ran it, now the muzzies. permalink parent award report block reply RedStoneDeepState 1 points 6 days ago Uzbekistan was the center of the Soviet rocketry program and effectively colonized India for 500 years. permalink parent award report block reply Yawnz13 1 points 6 days ago Uzbekistan colonized India?  You mean the Mongols.  The Mongols invaded and destroyed the Khwarazmians who ruled what is now Uzbekistan at the time (13th century).  Timur/Tamerlane founded the Timurid dynasty in the area (14th, and his descendent Babur founded the Mughal dynasty in India.  \"Mughal\" = \"Mongol\". permalink parent award report block reply RedStoneDeepState 1 points 6 days ago I mean Uzbekistan not the Mongols. Tamerlane is the national hero of Uzbekistan, being born in Transoxiana as a Muslim. That is Uzbekistan. The capitol of his empire was Samarkand, again Uzbekistan. He claimed legitimacy from the Mongols but at the end of the day he was a Muslim not a Tengrist, it was squarely a different culture than Mongols. Hence why they get called Mughals, the Perzianization of Mongol. Babur was from Andijan - again Uzbekistan. permalink parent award report block reply Yawnz13 0 points 6 days ago I mean Uzbekistan not the Mongols You're still wrong though. Tamerlane is the national hero of Uzbekistan, being born in Transoxiana as a Muslim. That is Uzbekistan. The capitol of his empire was Samarkand, again Uzbekistan. Cool story, and who was he born of?  Turkified Mongols.  Transoxiana was at the time part of the Mongol confederation known as Barlas.  He shared common ancestry with Genghis Khan on his father's side, saw himself as Genghis' legitimate heir, and wanted to restore the Mongol Empire. He claimed legitimacy from the Mongols but at the end of the day he was a Muslim not a Tengrist, it was squarely a different culture than Mongols. You do understand that large portions of the Mongols converted to Islam, yes?  Being a Mongol and being a Muslim are not mutually exclusive concepts.  Timur claimed common ancestry with Genghis Khan, said ancestor being Tumbinai Khan. Had the Mongol invasion and subsequent destruction of the Khwarazmian Empire not happened, Timur wouldn't have been born.  Had Timur not been born, Babur wouldn't have been born.  Had Babur not been born, the Mughal Empire would never have been founded. permalink parent award report block reply view 9 more comments... lefty295 1 points 6 days ago Yeah but Uzbeks are the descendants of Timur or the people his ancestors brought partly. Timur was the result of a migration to that region by Mongolians. After they depopulated it. then mixed with the remaining locals and Turkic tribes into what are now Uzbeks. They're more similar to Timur than modern Mongolians are. Modern Uzbeks would have more of a claim to him as part of their national identity than a modern Mongolian would. Timur was born in modern day Uzbekistan. It doesn't matter who his ancestors are when he is their ancestor. Modern Mongolians are not his descendants. They're the people that stayed in that region. permalink parent award report block reply Yawnz13 1 points 5 days ago Yeah but Uzbeks are the descendants of Timur or the people his ancestors brought partly. Most are Turkic.  Timur was entirely Mongol. They're more similar to Timur than modern Mongolians are. Timur was entirely Mongol. Modern Uzbeks would have more of a claim to him as part of their national identity than a modern Mongolian would. What they claim doesn't matter.  Genetics is what matters. Timur was born in modern day Uzbekistan. No, Timur was born It doesn't matter who his ancestors are when he is their ancestor. Modern Mongolians are not his descendants. They're the people that stayed in that region. Retarded argument.  Someone is German because their ancestors were German, yes?  German is a definable genetic group not dependent on place.  Likewise, so is \"Mongol\". Modern Uzbeks are a mix of Mongol and Turkic.  Timur wouldn't have had Turkic admixture given that he was born to Mongol parents. https://www.protobulgarians.com/Statii%20ot%20drugi%20avtori/Turks%20-%20race%20apearance%20and%20origin.htm permalink parent award report block reply Maxdady01 17 points 6 days ago Election reform, Voter Id, Mail-in Ballots here at home? permalink award report block reply TexasRepublic 16 points 6 days ago Whatever. Where are those Epstein files you promised? permalink award report block reply flp999 15 points 6 days ago I DON'T CARE ABOUT THIS AT ALL. Where is my fucking scamdemic truth? WTF is this bullshit? Fuck Uzbekistan. Fuck this whole economy. I WANT THE GODDAMN TRUTH ABOUT WHAT THIS GOVERNMENT DID TO US!!! permalink award report block reply RedStoneDeepState -2 points 6 days ago Fuck this whole economy Fine, lets get you cut off from the voluntary exchange of goods and services. You would start bitching seconds after getting your power cut. permalink parent award report block reply BrionK 14 points 6 days ago Zzzzzzzzzzzzzzzzzzzzzzzz.\nWaiting for America First results. permalink award report block reply knnbccb 14 points 6 days ago If you haven't noticed already. Trump is slowly and methodically peeling away China's 'good little buddies' around the world. Some of them you can't peel away, so you need surgical removal. Up next: Venezuela, then South Africa. permalink award report block reply BobDolesBanana 8 points 6 days ago If only we could trade with Russia... permalink parent award report block reply NZbacon 3 points 6 days ago When zelenski disappears it will happen. permalink parent award report block reply Skogin 5 points 6 days ago Oh, we notice. And so do all the shills. permalink parent award report block reply Lurker404 0 points 6 days ago That's nice and all but while he's busy doing that he's bleeding voters at home. Voters don't care. They care that everything is getting more expensive. They care that they can't find a job while all these H1Jeets are flooding in. And they care that Republicans are busy simping for some sandbox shithole on the other side of the ocean. permalink parent award report block reply YaharaRiver 14 points 6 days ago yikes. 95% muslim, so expect them to betray you. The country has an immature and unskilled population, with 30.1% of its residents 👉 under the age of 14. The median age in Uzbekistan is 27 years as of 2025. What could possibly go wrong?! permalink award report block reply DT170x 12 points 6 days ago They can stay there and we don't need any Uzbekistani people. permalink parent award report block reply OhioRepublic 9 points 6 days ago Fuck every place ending with -stan permalink parent award report block reply RedStoneDeepState 1 points 6 days ago Uzbekistan is not Afghanistan. It was the center of the Soviet rocketry program. See the Nevich testing ground. permalink parent award report block reply guywholikesDjtof2024 0 points 6 days ago Stan is satan without the first a. permalink parent award report block reply yodayoda -1 points 6 days ago well you're going to have them, apparently. permalink parent award report block reply Skogin 8 points 6 days ago median age in Uzbekistan is 27 years That’s perfect for operating the mining equipment. permalink parent award report block reply RedStoneDeepState 1 points 6 days ago Which type? They have both. The Tajik/Uzbek border is the second most mined border in the world. permalink parent award report block reply henri_derelicte 1 points 6 days ago There was old song mentioning how Uzbeks are very nosy people with bone in their brain permalink parent award report block reply RedStoneDeepState 1 points 6 days ago Uzbekistan is a rather highly educated country bordering the truly retarded Muslims. They are effectively in a cold war with neighboring Tajikistan and mine everything that touches Tajikistan or Afghanistan. permalink parent award report block reply breadbaker 3 points 6 days ago What could possibly go wrong?! Listening to Israelis shitting on what is essentially a high-value investment deal. UZ is net energy exporter with 36 million people who are used to living near first world standard of living. Their resources won't run out soon - and apparently they like buying the stuff that makes the first world the first world from us and investing their assets here. Finally a good deal. I nominate Uzbekistan as a our greatest ally and say uzbek-christian values shall live on forever. Can someone form the American Uzbek Political Action Committee? permalink parent award report block reply BobDolesBanana 3 points 6 days ago Oh, yeah. It's called the National Endowment for Democracy, a US-based nonprofit that provides grants to support democratic institutions, human rights initiatives, and civic engagement in Uzbekistan, aligning with US foreign policy goals. We do this in nearly every country. It is how the US performs regime change. How did you think we have pointless foreign wars in the first place? permalink parent award report block reply YaharaRiver 1 points 6 days ago ok, yeah this was funny 😂👍 permalink parent award report block reply RedStoneDeepState 0 points 6 days ago Uzbekistan was the center of the Soviet rocketry program and effectively colonized India for 500 years. with 30.1% of its residents 👉 under the age of 14. The median age in Uzbekistan is 27 years as of 2025. That describes the USA in the 1970s. permalink parent award report block reply Modernturnkey 14 points 6 days ago Awesome, how many billions are we gonna be giving them to invest in the US? permalink award report block reply guywholikesDjtof2024 6 points 6 days ago Billions and Billions permalink parent award report block reply ImYourHuckleberry24 12 points 6 days ago I'm thrilled to announce that I don't give shit! I, like most other MAGA voters, would prefer actual JUSTICE be done! Is THAT too much to ask? permalink award report block reply 1_Badcop 5 points 6 days ago Apparently, yes, asking for justice is too much to ask. permalink parent award report block reply WhatTheActualFuckS 12 points 6 days ago Sorry but where is this country getting 35 billion dollars to invest in anything? Thats 30% of their gdp and then 10% over ten years? permalink award report block reply Modernturnkey 13 points 6 days ago Easy peasy, we will give them 35 billion of taxpayer money, and they'll reinvest it into US corporations that fill the pockets of politicians! permalink parent award report block reply curiousorganelle 6 points 6 days ago The israeli model of economics!! permalink parent award report block reply Modernturnkey 3 points 6 days ago coin clipping intensifies permalink parent award report block reply PeteJeffrey 12 points 6 days ago I. Don't. Give. A. Shit. About. Other. Countries. Neither their money nor there problems. permalink award report block reply DT170x 10 points 6 days ago If Uzbekistan buy our stuff in which pay OUR employees and expands OUR economy. That is a Win in my books. permalink parent award report block reply yodayoda 3 points 6 days ago since when in the history of modern trade deals do other countries buy substantially from us? we'll be running a trade deficit with them, like with everyone else. permalink parent award report block reply RedStoneDeepState 2 points 6 days ago The US exports over 3 trillion in goods permalink parent award report block reply AliceCooperBiden 1 points 6 days ago Doesn't matter when we import over 3 trillion... permalink parent award report block reply yodayoda -1 points 6 days ago interesting. now do imports. permalink parent award report block reply Lurker404 1 points 6 days ago Even if that happens, it'll only benefit Democrats because they'll be the ones in power by then. All these longterm issues don't solve the problems of the people right now. Trump has maybe half a year to turn things around domestically or he's done once the midterms come around. permalink parent award report block reply Rock9Head 11 points 6 days ago I hope they don’t get visas. permalink award report block reply anti_masker 10 points 6 days ago Oh, Uzbekistan. I’ve heard of that country. I think… permalink award report block reply RedStoneDeepState 4 points 6 days ago It was a core part of the Soviet Union.  It was the center of the Soviet rocketry program. See the Nevich testing ground. Separately, before being absorbed by Russia, that group went by the name of the \"Mughal Empire\" - the Mughal empire wasnt ruled by Indians, it was Uzbekistan having colonized India under Tamerlane's empire and the successor that Babur set up. So have you ever heard of the Soviet Union or Mughal empire? permalink parent award report block reply medicpatriot 8 points 6 days ago Who gives a shit? permalink award report block reply weltallic 7 points 6 days ago I'm sure the next Democrat administration will quietly thank you under their breath as they spend it all importing millions of migrants. While they imprison you.  And your whole team. Because you did NOTHING. permalink award report block reply PiratePatriotParrot 6 points 6 days ago idon'tgiveafuckistan permalink award report block reply GayPatriotMAGAUncle 6 points 6 days ago Why!? Why asshole Uzbekistan? Why not make great deal with Kazakhstan, #1 exporter of potassium? Kazakhstan should be greatest ally of America, not stinky Uzbekistan. Borat will not be very happy with this. permalink award report block reply AlmostFullyDilated -1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply flashersenpai 6 points 6 days ago would be nice to have an economic deal with Russia permalink award report block reply Dr_Phil 5 points 6 days ago Boring. permalink award report block reply 1_Badcop 3 points 6 days ago No, more likely strip-mining. permalink parent award report block reply I-am-Orlando OP PRO 5 points 6 days ago Link https://truthsocial.com/@realDonaldTrump/115506045885898474 permalink award report block reply yodayoda 5 points 6 days ago more bullshit trade deals i see. permalink award report block reply KungPaoMcChicken 4 points 6 days ago 99% of Americans can't point to it on the map. I'm thinking it's somewhere between Iran and Russia, but only because of the copious hours of EU4 I have played. permalink award report block reply SenorTrumper 1 points 5 days ago All the Far-away-istans are former USSR republics and therefore clustered together. permalink parent award report block reply KungPaoMcChicken 2 points 5 days ago I heard that there are some incredible USSR bus stops in some of these former soviet era nations. I imagine that travelling the world just to see all of these magical bugs stops would be incredible. Like brutalist architecture using concrete. But, not how the west does concrete in a cheap fashion, every bus stop was completely different. Usually with a tonne of curves. And not mass produced. Like someone really took a lot of effort. They believed in the future they thought they were making. permalink parent award report block reply SenorTrumper 1 points 5 days ago Turn on CCs. https://www.youtube.com/watch?v=8HZ4DnVfWYQ https://www.youtube.com/watch?v=t7kr7utvVEs&list=RDt7kr7utvVEs&start_radio=1 Those are Russian videos.  Watch closely. Every scene is a gem. permalink parent award report block reply KungPaoMcChicken 1 points 5 days ago Interesting... permalink parent award report block reply SenorTrumper 1 points 5 days ago Speaking of bus stops, have you watched the Russian epies on the Bald & Bankrupt channel on YT? permalink parent award report block reply henri_derelicte 4 points 6 days ago No mention of tariffs. How interesting… permalink award report block reply Hantif 4 points 6 days ago Can we get them to build a few prisons? We're going to need some place to ship illegal alien criminals to. Sending a few thousand Antifa over there would be fitting, let them see the results of real socialism. permalink award report block reply RedStoneDeepState 3 points 6 days ago I'd rather live in Uzbekistan than Portland. permalink parent award report block reply panic_scam 4 points 6 days ago But Borat called them assholes :( permalink award report block reply Txiribiton 3 points 6 days ago ??? They don't have that money, it will be the other way, the US will purchase from them, that's why you don't see tariffs. Then there is another incognite, is the US trying to create another Ukraine 2.0 near Russia? permalink award report block reply FullyDilated 2 points 6 days ago asshole Uzbekistan! permalink award report block reply DrTar 2 points 5 days ago I bet Hillary's miffed she didn't get a taste of this action. permalink award report block reply Wexit-Delecto 2 points 5 days ago TFW you're a leaf and Uzbeki-fuckin-stan has a deal before your country: :( permalink award report block reply Pats5x 2 points 5 days ago Is that what maga has come to?  Trade deals with fucking Uzbekistan?  We're absolutely fucked. permalink award report block reply JoinTheDiscussion 2 points 6 days ago Doing his part to bring more sand people into the frey permalink award report block reply rugburnd 2 points 5 days ago Someone throw up the red hat and let Trump know of the plight of the working class. We can post up and prop up Wall Street but food and energy prices are too high. He is losing the MAGA base with AI and Rare earth materials. \"It's the economy stupid\".\nPeople are hurting. permalink award report block reply DRKMSTR 2 points 6 days ago Plz import food. Uzbek goodbek permalink award report block reply TheRedPilledArtist 1 points 6 days ago Based Uzbekis permalink award report block reply GoodvsEvil2 1 points 6 days ago Geographically Uzbekistan is only 1 country away from iran. permalink award report block reply RedStoneDeepState 2 points 6 days ago Turkmenistan is effectively North Korea. permalink parent award report block reply RudeFrog 1 points 5 days ago What about a deal with the great country Kazakhstan, I trases you my wife and 3 other goats for Mercedes Benz! Is good deal she's very pretty.  Hey for real though all these foreign deals, are they creating American jobs? Or just making rich people richer? Kinda feels like this one is just selling off parts of the country permalink award report block reply truthjusticetruth 1 points 5 days ago I don’t care. America has a judge problem and an elections problem. Work on that. permalink award report block reply Powhattan 1 points 6 days ago we slapping 3rd worlds with 9 inches of limp dick making them cough up cash HAHAHAHAAHHA permalink award report block reply mohel 1 points 5 days ago uzbeki .... beki .... beki ... stan? permalink award report block reply vongregormench 1 points 6 days ago That sounds like more than the total GDP of Uzbekistan. permalink award report block reply CruzControl 1 points 5 days ago Mandatory - https://media1.tenor.com/m/4-5dlQLi-HEAAAAd/uzbekistan-fuck.gif permalink award report block reply Scot 1 points 5 days ago The best trade deal I could imagine would be with China - give them all of our democrats. permalink award report block reply PitfallHarry 1 points 6 days ago Dealing with Uzbekistan? Gross. permalink award report block reply YodaBannon 0 points 6 days ago cool beans permalink award report block reply Minn2000 -5 points 6 days ago \"Sorry Uzbekistan, I know I've been negotiating this trade deal with you for weeks if not months, but a couple state-level elections happened so now I'm gonna have to completely cut you off and ignore you and every other country for the rest of my term. Don't you know I'm literally not doing anything for the economy and lowering costs even though I literally announced a plan earlier today that would drastically lower the price of certain drugs, which objectively helps towards that?\" This is how some of you sound lately. permalink award report block reply Modernturnkey 8 points 6 days ago Costs have not been lowered on anything, and taxes have done nothing but increase. permalink parent award report block reply 1_Badcop 4 points 6 days ago Sorry America, we're not interested in doing shit about election integrity because, fuck America I guess. Hey, we've deported like a thousand illegals, way less than Obama, but like I said, fuck America. Oh! By the way, your health insurance is going up 137% (mine really did, I got the letter today).  You all are going to turn out in 2026 and vote, right? So I can continue to ignore doing anything that actually helps anybody with a net worth of less than 100 million, right? This is how you sound right now. permalink parent award report block reply\nBaconb_breakfast 98 points 6 days ago Unless I’m missing something, the common thread between all of these trade deals is the rare earth minerals, i.e., “critical minerals”. It’s the way to keep China from holding the US hostage because we were so reliant on permalink award report block reply Husky 50 points 6 days ago Rare earth minerals aren't all that rare. We have them in the us, we just don't mine them. Solution seems to be... mine them permalink parent award report block reply breadbaker 37 points 6 days ago We have them in the us, we just don't mine them. You have to be willing to destroy vast stretches of land to leach and refine a small amount. Much smarter to invest in a material resources recovery methods to avoid landfilling rare earths. Something that we could aim for when we would not be entertaining Zelensky and Netanyahu for the 10th time this year. permalink parent award report block reply Aambrick 11 points 6 days ago TMSRs Very obvious for the last 15 years. Thorium Molten Salts Reactors Thorium is almost always tied to a cheap rare earth mineral monazite. There is other types of rare-earths connected, but monazite is the most commonly found with Thorium. There is literally a very simple and effective solution that nobody wants to implement except people that actually understand this. I support TMSRs for energy mainly, but there is a vast amount of subsets to this than just energy. Just the Cheap Rare earth mineral Monazite is just one part of the discussion. The fact that our own Government has done its best to kill any research into it while selling everything they have on it to China should say a lot about the situation. permalink parent award report block reply breadbaker 4 points 6 days ago I thought that ran its course and the last one (in AZ?) closed. 1+ billion write off. Seemed like a good idea to me. Sad to read what you write about its demise. permalink parent award report block reply view 1 more comments... MehNahMehNah 2 points 5 days ago Sounds like 'rare earth' won't be as rare as it sounds. Could be good for the market if you're buying. permalink parent award report block reply FullyDilated 1 points 6 days ago lol no you don't permalink parent award report block reply ShadowInv 0 points 6 days ago Fetch an asteroid full of them drag it back nearby. Total jobs creator, and double funny if it’s solid gold. permalink parent award report block reply Decepticons-superior 5 points 6 days ago Let’s train a bunch of drillers to be astronauts. Or do we train a bunch of astronauts to be drillers? permalink parent award report block reply view 4 more comments... RedStoneDeepState -6 points 6 days ago Someone should gouge out your eyes so we pay a Mexican to be your full time nurse. That is a \"job creator\". Fuck off with this demand side nonsense. permalink parent award report block reply view 2 more comments... ifyoustrikemedown 7 points 6 days ago We are trying to but we just assumed the supply from China was safe and so we never invested in the industry. Rare earths are technically not rare, but you have to mine like 3 football fields for 1 jar of the mineral. It's an incredibly dirty and intensive process to get the minerals in pure form. That's why we let China do it. I've heard we are 10+ years out from having a stable domestic supply. permalink parent award report block reply anotherrandomname 5 points 6 days ago We are trying to but we just assumed the supply from China was safe and so we never invested in the industry. No, we used to have an industry, what happened was China was dumping them cheap as fuck and undercutting what was possible for US mines and drove them out of business, and now that they've created a monopoly they're jacking prices up and using them for geopolitical purposes, which was, obviously, the plan all along, and makes a strong case for tariffs to protect local industry from such foreign dumping and monopolization. permalink parent award report block reply ifyoustrikemedown 4 points 6 days ago China was dumping, but the US rare earth industry never really took off. China took over as rare earth's started to be used in more and more technology. We didn't prioritize domestic production because we didn't realize their strategic importance and Washington DC is a lumbering dinosaur. Here's one source I came across: https://chinapower.csis.org/china-rare-earths/ In recent years, the US has sought to reestablish itself as a major world supplier of rare earths. After being shuttered for years, the US’ only rare earth mine, located in Mountain Pass, California, came under new ownership in 2017 and resumed production. However, the mined material that it produces is still sent to China for processing. The US government has also made notable policy changes, including the May 2018 addition of rare earths to a list of minerals deemed critical to US economic and national security. In July 2019, President Trump also declared rare earth metals and alloys “essential to the national defense,” which freed up resources for the Department of Defense (DoD) to take action to secure a domestic rare earth production capability. If you look at the first chart, rare earth production began to skyrocket in the 90s. Our capacity never grew with demand. permalink parent award report block reply view 1 more comments... RedStoneDeepState 1 points 6 days ago No, the entire global industry is still only worth about 4 billion and most of the demand remains in Asian markets. I swear China is trying to get Trump to do stupid trade deals. permalink parent award report block reply RedStoneDeepState 0 points 6 days ago but you have to mine like 3 football fields for 1 jar of the mineral. Incorrect, the ore concentration of our one mine in Arizona is on average about 6%. It is just a bitch to separate lanthanides. That is it. permalink parent award report block reply ifyoustrikemedown 2 points 6 days ago I was just trying to make the point that the refinement is the issue, not the mining. I think it varies from mineral to mineral and from mine to mine. 6% is probably high for rare earths. permalink parent award report block reply TerryBibble 3 points 6 days ago Rare in this case is state rather than scarcity permalink parent award report block reply PitfallHarry 2 points 6 days ago What happened to drill baby drill? permalink parent award report block reply phro 1 points 5 days ago Are you not paying attention? We are already setting new all time high production and not slowing down. https://www.eia.gov/dnav/pet/hist/LeafHandler.ashx?n=PET&s=MCRFPUS2&f=M permalink parent award report block reply PitfallHarry 1 points 5 days ago So prices are down. That’s what I keep telling people. permalink parent award report block reply RedStoneDeepState -1 points 6 days ago Lanthanides are not oil. permalink parent award report block reply PitfallHarry 1 points 5 days ago Mine. Drill. All the same thing. permalink parent award report block reply BirthHole 1 points 5 days ago we could mine them, but the overhead to mine then 'environmentally safe' doesnt make it profitable. permalink parent award report block reply load 7 more comments... Skogin 12 points 6 days ago Right on, right on. permalink parent award report block reply DeportThemAllForever 3 points 6 days ago Another “stan” country. permalink parent award report block reply carpetxparmesan 2 points 5 days ago I'm more interested in a different offshoot of that thinking. This \"stan\" is in Russia's backyard. VERY backyard. Russia's had some disagreements with these 'stanis, sure, but they still control this stan. Two options present itself: A. US wants to go balls deep in another ukraine-like front which is unlikely B. They struck a deal with russia. which leads us to B.1. They've reached a \"deal\" on ukraine B.2. They're doing this deal with russia as an aside without reaching a deal on ukraine. This is a big story. Not really a story about mining at all. permalink parent award report block reply Yawnz13 1 points 6 days ago What about it? permalink parent award report block reply AfrikaanerBoer 3 points 6 days ago SUPERIOR POTASSIUM 💯 permalink parent award report block reply FatigueIsReal 2 points 6 days ago Yes, but I think its broader than that. Trump is effectively encircling China and Russia with economic partners and trade deals. He's using America's strengths to essentially choke out China and Russia, and India too if they keep their shit up. And though most people on here are blind to it, this includes Israel and Muslim ME nations. permalink parent award report block reply carpetxparmesan 1 points 5 days ago This 'stan isn't one of russia's \"neighbors\", this is like germany buying ng from russia while chanting slava ukraina. permalink parent award report block reply FatigueIsReal 2 points 5 days ago True, but it is a China neighbor. permalink parent award report block reply carpetxparmesan 2 points 5 days ago I don't try to figure this stuff out, we're too low on the information pole. I just entertain and educate youse and let you think things for yourself. I'm sure half this thread doesn't know crimean dirt from uzbeki dirt. I really doubt most people on TD keep track of which \"client states\" russia has and which stage of maskerovka or false feud or actual feud or uzbek daytime telenovela russia and uzbekistan are in at the moment. TBQH, I don't exactly remember why the uzbeks aren't yet another state within the russian \"federation\" even though I've got a little uzbek starik on my shelf right now. Don't worry, he gets potato vodka and the AC is on. Aight, here we go... 5min history of the squints uzbekistan: https://youtu.be/Wf3e9omI9ok KEK. That 3 min video went about like I expected. Enjoy! permalink parent award report block reply DITTOPatriot 1 points 5 days ago That the illusion they meant for you to see. permalink parent award report block reply load 9 more comments...\nHusky 50 points 6 days ago Rare earth minerals aren't all that rare. We have them in the us, we just don't mine them. Solution seems to be... mine them permalink parent award report block reply breadbaker 37 points 6 days ago We have them in the us, we just don't mine them. You have to be willing to destroy vast stretches of land to leach and refine a small amount. Much smarter to invest in a material resources recovery methods to avoid landfilling rare earths. Something that we could aim for when we would not be entertaining Zelensky and Netanyahu for the 10th time this year. permalink parent award report block reply Aambrick 11 points 6 days ago TMSRs Very obvious for the last 15 years. Thorium Molten Salts Reactors Thorium is almost always tied to a cheap rare earth mineral monazite. There is other types of rare-earths connected, but monazite is the most commonly found with Thorium. There is literally a very simple and effective solution that nobody wants to implement except people that actually understand this. I support TMSRs for energy mainly, but there is a vast amount of subsets to this than just energy. Just the Cheap Rare earth mineral Monazite is just one part of the discussion. The fact that our own Government has done its best to kill any research into it while selling everything they have on it to China should say a lot about the situation. permalink parent award report block reply breadbaker 4 points 6 days ago I thought that ran its course and the last one (in AZ?) closed. 1+ billion write off. Seemed like a good idea to me. Sad to read what you write about its demise. permalink parent award report block reply view 1 more comments... MehNahMehNah 2 points 5 days ago Sounds like 'rare earth' won't be as rare as it sounds. Could be good for the market if you're buying. permalink parent award report block reply FullyDilated 1 points 6 days ago lol no you don't permalink parent award report block reply ShadowInv 0 points 6 days ago Fetch an asteroid full of them drag it back nearby. Total jobs creator, and double funny if it’s solid gold. permalink parent award report block reply Decepticons-superior 5 points 6 days ago Let’s train a bunch of drillers to be astronauts. Or do we train a bunch of astronauts to be drillers? permalink parent award report block reply view 4 more comments... RedStoneDeepState -6 points 6 days ago Someone should gouge out your eyes so we pay a Mexican to be your full time nurse. That is a \"job creator\". Fuck off with this demand side nonsense. permalink parent award report block reply view 2 more comments... ifyoustrikemedown 7 points 6 days ago We are trying to but we just assumed the supply from China was safe and so we never invested in the industry. Rare earths are technically not rare, but you have to mine like 3 football fields for 1 jar of the mineral. It's an incredibly dirty and intensive process to get the minerals in pure form. That's why we let China do it. I've heard we are 10+ years out from having a stable domestic supply. permalink parent award report block reply anotherrandomname 5 points 6 days ago We are trying to but we just assumed the supply from China was safe and so we never invested in the industry. No, we used to have an industry, what happened was China was dumping them cheap as fuck and undercutting what was possible for US mines and drove them out of business, and now that they've created a monopoly they're jacking prices up and using them for geopolitical purposes, which was, obviously, the plan all along, and makes a strong case for tariffs to protect local industry from such foreign dumping and monopolization. permalink parent award report block reply ifyoustrikemedown 4 points 6 days ago China was dumping, but the US rare earth industry never really took off. China took over as rare earth's started to be used in more and more technology. We didn't prioritize domestic production because we didn't realize their strategic importance and Washington DC is a lumbering dinosaur. Here's one source I came across: https://chinapower.csis.org/china-rare-earths/ In recent years, the US has sought to reestablish itself as a major world supplier of rare earths. After being shuttered for years, the US’ only rare earth mine, located in Mountain Pass, California, came under new ownership in 2017 and resumed production. However, the mined material that it produces is still sent to China for processing. The US government has also made notable policy changes, including the May 2018 addition of rare earths to a list of minerals deemed critical to US economic and national security. In July 2019, President Trump also declared rare earth metals and alloys “essential to the national defense,” which freed up resources for the Department of Defense (DoD) to take action to secure a domestic rare earth production capability. If you look at the first chart, rare earth production began to skyrocket in the 90s. Our capacity never grew with demand. permalink parent award report block reply view 1 more comments... RedStoneDeepState 1 points 6 days ago No, the entire global industry is still only worth about 4 billion and most of the demand remains in Asian markets. I swear China is trying to get Trump to do stupid trade deals. permalink parent award report block reply RedStoneDeepState 0 points 6 days ago but you have to mine like 3 football fields for 1 jar of the mineral. Incorrect, the ore concentration of our one mine in Arizona is on average about 6%. It is just a bitch to separate lanthanides. That is it. permalink parent award report block reply ifyoustrikemedown 2 points 6 days ago I was just trying to make the point that the refinement is the issue, not the mining. I think it varies from mineral to mineral and from mine to mine. 6% is probably high for rare earths. permalink parent award report block reply TerryBibble 3 points 6 days ago Rare in this case is state rather than scarcity permalink parent award report block reply PitfallHarry 2 points 6 days ago What happened to drill baby drill? permalink parent award report block reply phro 1 points 5 days ago Are you not paying attention? We are already setting new all time high production and not slowing down. https://www.eia.gov/dnav/pet/hist/LeafHandler.ashx?n=PET&s=MCRFPUS2&f=M permalink parent award report block reply PitfallHarry 1 points 5 days ago So prices are down. That’s what I keep telling people. permalink parent award report block reply RedStoneDeepState -1 points 6 days ago Lanthanides are not oil. permalink parent award report block reply PitfallHarry 1 points 5 days ago Mine. Drill. All the same thing. permalink parent award report block reply BirthHole 1 points 5 days ago we could mine them, but the overhead to mine then 'environmentally safe' doesnt make it profitable. permalink parent award report block reply load 7 more comments...\nbreadbaker 37 points 6 days ago We have them in the us, we just don't mine them. You have to be willing to destroy vast stretches of land to leach and refine a small amount. Much smarter to invest in a material resources recovery methods to avoid landfilling rare earths. Something that we could aim for when we would not be entertaining Zelensky and Netanyahu for the 10th time this year. permalink parent award report block reply Aambrick 11 points 6 days ago TMSRs Very obvious for the last 15 years. Thorium Molten Salts Reactors Thorium is almost always tied to a cheap rare earth mineral monazite. There is other types of rare-earths connected, but monazite is the most commonly found with Thorium. There is literally a very simple and effective solution that nobody wants to implement except people that actually understand this. I support TMSRs for energy mainly, but there is a vast amount of subsets to this than just energy. Just the Cheap Rare earth mineral Monazite is just one part of the discussion. The fact that our own Government has done its best to kill any research into it while selling everything they have on it to China should say a lot about the situation. permalink parent award report block reply breadbaker 4 points 6 days ago I thought that ran its course and the last one (in AZ?) closed. 1+ billion write off. Seemed like a good idea to me. Sad to read what you write about its demise. permalink parent award report block reply view 1 more comments... MehNahMehNah 2 points 5 days ago Sounds like 'rare earth' won't be as rare as it sounds. Could be good for the market if you're buying. permalink parent award report block reply FullyDilated 1 points 6 days ago lol no you don't permalink parent award report block reply ShadowInv 0 points 6 days ago Fetch an asteroid full of them drag it back nearby. Total jobs creator, and double funny if it’s solid gold. permalink parent award report block reply Decepticons-superior 5 points 6 days ago Let’s train a bunch of drillers to be astronauts. Or do we train a bunch of astronauts to be drillers? permalink parent award report block reply view 4 more comments... RedStoneDeepState -6 points 6 days ago Someone should gouge out your eyes so we pay a Mexican to be your full time nurse. That is a \"job creator\". Fuck off with this demand side nonsense. permalink parent award report block reply view 2 more comments...\nAambrick 11 points 6 days ago TMSRs Very obvious for the last 15 years. Thorium Molten Salts Reactors Thorium is almost always tied to a cheap rare earth mineral monazite. There is other types of rare-earths connected, but monazite is the most commonly found with Thorium. There is literally a very simple and effective solution that nobody wants to implement except people that actually understand this. I support TMSRs for energy mainly, but there is a vast amount of subsets to this than just energy. Just the Cheap Rare earth mineral Monazite is just one part of the discussion. The fact that our own Government has done its best to kill any research into it while selling everything they have on it to China should say a lot about the situation. permalink parent award report block reply breadbaker 4 points 6 days ago I thought that ran its course and the last one (in AZ?) closed. 1+ billion write off. Seemed like a good idea to me. Sad to read what you write about its demise. permalink parent award report block reply view 1 more comments... MehNahMehNah 2 points 5 days ago Sounds like 'rare earth' won't be as rare as it sounds. Could be good for the market if you're buying. permalink parent award report block reply\nbreadbaker 4 points 6 days ago I thought that ran its course and the last one (in AZ?) closed. 1+ billion write off. Seemed like a good idea to me. Sad to read what you write about its demise. permalink parent award report block reply view 1 more comments...\nMehNahMehNah 2 points 5 days ago Sounds like 'rare earth' won't be as rare as it sounds. Could be good for the market if you're buying. permalink parent award report block reply\nFullyDilated 1 points 6 days ago lol no you don't permalink parent award report block reply\nShadowInv 0 points 6 days ago Fetch an asteroid full of them drag it back nearby. Total jobs creator, and double funny if it’s solid gold. permalink parent award report block reply Decepticons-superior 5 points 6 days ago Let’s train a bunch of drillers to be astronauts. Or do we train a bunch of astronauts to be drillers? permalink parent award report block reply view 4 more comments... RedStoneDeepState -6 points 6 days ago Someone should gouge out your eyes so we pay a Mexican to be your full time nurse. That is a \"job creator\". Fuck off with this demand side nonsense. permalink parent award report block reply view 2 more comments...\nDecepticons-superior 5 points 6 days ago Let’s train a bunch of drillers to be astronauts. Or do we train a bunch of astronauts to be drillers? permalink parent award report block reply view 4 more comments...\nRedStoneDeepState -6 points 6 days ago Someone should gouge out your eyes so we pay a Mexican to be your full time nurse. That is a \"job creator\". Fuck off with this demand side nonsense. permalink parent award report block reply view 2 more comments...\nifyoustrikemedown 7 points 6 days ago We are trying to but we just assumed the supply from China was safe and so we never invested in the industry. Rare earths are technically not rare, but you have to mine like 3 football fields for 1 jar of the mineral. It's an incredibly dirty and intensive process to get the minerals in pure form. That's why we let China do it. I've heard we are 10+ years out from having a stable domestic supply. permalink parent award report block reply anotherrandomname 5 points 6 days ago We are trying to but we just assumed the supply from China was safe and so we never invested in the industry. No, we used to have an industry, what happened was China was dumping them cheap as fuck and undercutting what was possible for US mines and drove them out of business, and now that they've created a monopoly they're jacking prices up and using them for geopolitical purposes, which was, obviously, the plan all along, and makes a strong case for tariffs to protect local industry from such foreign dumping and monopolization. permalink parent award report block reply ifyoustrikemedown 4 points 6 days ago China was dumping, but the US rare earth industry never really took off. China took over as rare earth's started to be used in more and more technology. We didn't prioritize domestic production because we didn't realize their strategic importance and Washington DC is a lumbering dinosaur. Here's one source I came across: https://chinapower.csis.org/china-rare-earths/ In recent years, the US has sought to reestablish itself as a major world supplier of rare earths. After being shuttered for years, the US’ only rare earth mine, located in Mountain Pass, California, came under new ownership in 2017 and resumed production. However, the mined material that it produces is still sent to China for processing. The US government has also made notable policy changes, including the May 2018 addition of rare earths to a list of minerals deemed critical to US economic and national security. In July 2019, President Trump also declared rare earth metals and alloys “essential to the national defense,” which freed up resources for the Department of Defense (DoD) to take action to secure a domestic rare earth production capability. If you look at the first chart, rare earth production began to skyrocket in the 90s. Our capacity never grew with demand. permalink parent award report block reply view 1 more comments... RedStoneDeepState 1 points 6 days ago No, the entire global industry is still only worth about 4 billion and most of the demand remains in Asian markets. I swear China is trying to get Trump to do stupid trade deals. permalink parent award report block reply RedStoneDeepState 0 points 6 days ago but you have to mine like 3 football fields for 1 jar of the mineral. Incorrect, the ore concentration of our one mine in Arizona is on average about 6%. It is just a bitch to separate lanthanides. That is it. permalink parent award report block reply ifyoustrikemedown 2 points 6 days ago I was just trying to make the point that the refinement is the issue, not the mining. I think it varies from mineral to mineral and from mine to mine. 6% is probably high for rare earths. permalink parent award report block reply\nanotherrandomname 5 points 6 days ago We are trying to but we just assumed the supply from China was safe and so we never invested in the industry. No, we used to have an industry, what happened was China was dumping them cheap as fuck and undercutting what was possible for US mines and drove them out of business, and now that they've created a monopoly they're jacking prices up and using them for geopolitical purposes, which was, obviously, the plan all along, and makes a strong case for tariffs to protect local industry from such foreign dumping and monopolization. permalink parent award report block reply ifyoustrikemedown 4 points 6 days ago China was dumping, but the US rare earth industry never really took off. China took over as rare earth's started to be used in more and more technology. We didn't prioritize domestic production because we didn't realize their strategic importance and Washington DC is a lumbering dinosaur. Here's one source I came across: https://chinapower.csis.org/china-rare-earths/ In recent years, the US has sought to reestablish itself as a major world supplier of rare earths. After being shuttered for years, the US’ only rare earth mine, located in Mountain Pass, California, came under new ownership in 2017 and resumed production. However, the mined material that it produces is still sent to China for processing. The US government has also made notable policy changes, including the May 2018 addition of rare earths to a list of minerals deemed critical to US economic and national security. In July 2019, President Trump also declared rare earth metals and alloys “essential to the national defense,” which freed up resources for the Department of Defense (DoD) to take action to secure a domestic rare earth production capability. If you look at the first chart, rare earth production began to skyrocket in the 90s. Our capacity never grew with demand. permalink parent award report block reply view 1 more comments... RedStoneDeepState 1 points 6 days ago No, the entire global industry is still only worth about 4 billion and most of the demand remains in Asian markets. I swear China is trying to get Trump to do stupid trade deals. permalink parent award report block reply\nifyoustrikemedown 4 points 6 days ago China was dumping, but the US rare earth industry never really took off. China took over as rare earth's started to be used in more and more technology. We didn't prioritize domestic production because we didn't realize their strategic importance and Washington DC is a lumbering dinosaur. Here's one source I came across: https://chinapower.csis.org/china-rare-earths/ In recent years, the US has sought to reestablish itself as a major world supplier of rare earths. After being shuttered for years, the US’ only rare earth mine, located in Mountain Pass, California, came under new ownership in 2017 and resumed production. However, the mined material that it produces is still sent to China for processing. The US government has also made notable policy changes, including the May 2018 addition of rare earths to a list of minerals deemed critical to US economic and national security. In July 2019, President Trump also declared rare earth metals and alloys “essential to the national defense,” which freed up resources for the Department of Defense (DoD) to take action to secure a domestic rare earth production capability. If you look at the first chart, rare earth production began to skyrocket in the 90s. Our capacity never grew with demand. permalink parent award report block reply view 1 more comments...\nRedStoneDeepState 1 points 6 days ago No, the entire global industry is still only worth about 4 billion and most of the demand remains in Asian markets. I swear China is trying to get Trump to do stupid trade deals. permalink parent award report block reply\nRedStoneDeepState 0 points 6 days ago but you have to mine like 3 football fields for 1 jar of the mineral. Incorrect, the ore concentration of our one mine in Arizona is on average about 6%. It is just a bitch to separate lanthanides. That is it. permalink parent award report block reply ifyoustrikemedown 2 points 6 days ago I was just trying to make the point that the refinement is the issue, not the mining. I think it varies from mineral to mineral and from mine to mine. 6% is probably high for rare earths. permalink parent award report block reply\nifyoustrikemedown 2 points 6 days ago I was just trying to make the point that the refinement is the issue, not the mining. I think it varies from mineral to mineral and from mine to mine. 6% is probably high for rare earths. permalink parent award report block reply\nTerryBibble 3 points 6 days ago Rare in this case is state rather than scarcity permalink parent award report block reply\nPitfallHarry 2 points 6 days ago What happened to drill baby drill? permalink parent award report block reply phro 1 points 5 days ago Are you not paying attention? We are already setting new all time high production and not slowing down. https://www.eia.gov/dnav/pet/hist/LeafHandler.ashx?n=PET&s=MCRFPUS2&f=M permalink parent award report block reply PitfallHarry 1 points 5 days ago So prices are down. That’s what I keep telling people. permalink parent award report block reply RedStoneDeepState -1 points 6 days ago Lanthanides are not oil. permalink parent award report block reply PitfallHarry 1 points 5 days ago Mine. Drill. All the same thing. permalink parent award report block reply\nphro 1 points 5 days ago Are you not paying attention? We are already setting new all time high production and not slowing down. https://www.eia.gov/dnav/pet/hist/LeafHandler.ashx?n=PET&s=MCRFPUS2&f=M permalink parent award report block reply PitfallHarry 1 points 5 days ago So prices are down. That’s what I keep telling people. permalink parent award report block reply\nPitfallHarry 1 points 5 days ago So prices are down. That’s what I keep telling people. permalink parent award report block reply\nRedStoneDeepState -1 points 6 days ago Lanthanides are not oil. permalink parent award report block reply PitfallHarry 1 points 5 days ago Mine. Drill. All the same thing. permalink parent award report block reply\nPitfallHarry 1 points 5 days ago Mine. Drill. All the same thing. permalink parent award report block reply\nBirthHole 1 points 5 days ago we could mine them, but the overhead to mine then 'environmentally safe' doesnt make it profitable. permalink parent award report block reply\nSkogin 12 points 6 days ago Right on, right on. permalink parent award report block reply DeportThemAllForever 3 points 6 days ago Another “stan” country. permalink parent award report block reply carpetxparmesan 2 points 5 days ago I'm more interested in a different offshoot of that thinking. This \"stan\" is in Russia's backyard. VERY backyard. Russia's had some disagreements with these 'stanis, sure, but they still control this stan. Two options present itself: A. US wants to go balls deep in another ukraine-like front which is unlikely B. They struck a deal with russia. which leads us to B.1. They've reached a \"deal\" on ukraine B.2. They're doing this deal with russia as an aside without reaching a deal on ukraine. This is a big story. Not really a story about mining at all. permalink parent award report block reply Yawnz13 1 points 6 days ago What about it? permalink parent award report block reply\nDeportThemAllForever 3 points 6 days ago Another “stan” country. permalink parent award report block reply carpetxparmesan 2 points 5 days ago I'm more interested in a different offshoot of that thinking. This \"stan\" is in Russia's backyard. VERY backyard. Russia's had some disagreements with these 'stanis, sure, but they still control this stan. Two options present itself: A. US wants to go balls deep in another ukraine-like front which is unlikely B. They struck a deal with russia. which leads us to B.1. They've reached a \"deal\" on ukraine B.2. They're doing this deal with russia as an aside without reaching a deal on ukraine. This is a big story. Not really a story about mining at all. permalink parent award report block reply Yawnz13 1 points 6 days ago What about it? permalink parent award report block reply\ncarpetxparmesan 2 points 5 days ago I'm more interested in a different offshoot of that thinking. This \"stan\" is in Russia's backyard. VERY backyard. Russia's had some disagreements with these 'stanis, sure, but they still control this stan. Two options present itself: A. US wants to go balls deep in another ukraine-like front which is unlikely B. They struck a deal with russia. which leads us to B.1. They've reached a \"deal\" on ukraine B.2. They're doing this deal with russia as an aside without reaching a deal on ukraine. This is a big story. Not really a story about mining at all. permalink parent award report block reply\nYawnz13 1 points 6 days ago What about it? permalink parent award report block reply\nAfrikaanerBoer 3 points 6 days ago SUPERIOR POTASSIUM 💯 permalink parent award report block reply\nFatigueIsReal 2 points 6 days ago Yes, but I think its broader than that. Trump is effectively encircling China and Russia with economic partners and trade deals. He's using America's strengths to essentially choke out China and Russia, and India too if they keep their shit up. And though most people on here are blind to it, this includes Israel and Muslim ME nations. permalink parent award report block reply carpetxparmesan 1 points 5 days ago This 'stan isn't one of russia's \"neighbors\", this is like germany buying ng from russia while chanting slava ukraina. permalink parent award report block reply FatigueIsReal 2 points 5 days ago True, but it is a China neighbor. permalink parent award report block reply carpetxparmesan 2 points 5 days ago I don't try to figure this stuff out, we're too low on the information pole. I just entertain and educate youse and let you think things for yourself. I'm sure half this thread doesn't know crimean dirt from uzbeki dirt. I really doubt most people on TD keep track of which \"client states\" russia has and which stage of maskerovka or false feud or actual feud or uzbek daytime telenovela russia and uzbekistan are in at the moment. TBQH, I don't exactly remember why the uzbeks aren't yet another state within the russian \"federation\" even though I've got a little uzbek starik on my shelf right now. Don't worry, he gets potato vodka and the AC is on. Aight, here we go... 5min history of the squints uzbekistan: https://youtu.be/Wf3e9omI9ok KEK. That 3 min video went about like I expected. Enjoy! permalink parent award report block reply\ncarpetxparmesan 1 points 5 days ago This 'stan isn't one of russia's \"neighbors\", this is like germany buying ng from russia while chanting slava ukraina. permalink parent award report block reply FatigueIsReal 2 points 5 days ago True, but it is a China neighbor. permalink parent award report block reply carpetxparmesan 2 points 5 days ago I don't try to figure this stuff out, we're too low on the information pole. I just entertain and educate youse and let you think things for yourself. I'm sure half this thread doesn't know crimean dirt from uzbeki dirt. I really doubt most people on TD keep track of which \"client states\" russia has and which stage of maskerovka or false feud or actual feud or uzbek daytime telenovela russia and uzbekistan are in at the moment. TBQH, I don't exactly remember why the uzbeks aren't yet another state within the russian \"federation\" even though I've got a little uzbek starik on my shelf right now. Don't worry, he gets potato vodka and the AC is on. Aight, here we go... 5min history of the squints uzbekistan: https://youtu.be/Wf3e9omI9ok KEK. That 3 min video went about like I expected. Enjoy! permalink parent award report block reply\nFatigueIsReal 2 points 5 days ago True, but it is a China neighbor. permalink parent award report block reply carpetxparmesan 2 points 5 days ago I don't try to figure this stuff out, we're too low on the information pole. I just entertain and educate youse and let you think things for yourself. I'm sure half this thread doesn't know crimean dirt from uzbeki dirt. I really doubt most people on TD keep track of which \"client states\" russia has and which stage of maskerovka or false feud or actual feud or uzbek daytime telenovela russia and uzbekistan are in at the moment. TBQH, I don't exactly remember why the uzbeks aren't yet another state within the russian \"federation\" even though I've got a little uzbek starik on my shelf right now. Don't worry, he gets potato vodka and the AC is on. Aight, here we go... 5min history of the squints uzbekistan: https://youtu.be/Wf3e9omI9ok KEK. That 3 min video went about like I expected. Enjoy! permalink parent award report block reply\ncarpetxparmesan 2 points 5 days ago I don't try to figure this stuff out, we're too low on the information pole. I just entertain and educate youse and let you think things for yourself. I'm sure half this thread doesn't know crimean dirt from uzbeki dirt. I really doubt most people on TD keep track of which \"client states\" russia has and which stage of maskerovka or false feud or actual feud or uzbek daytime telenovela russia and uzbekistan are in at the moment. TBQH, I don't exactly remember why the uzbeks aren't yet another state within the russian \"federation\" even though I've got a little uzbek starik on my shelf right now. Don't worry, he gets potato vodka and the AC is on. Aight, here we go... 5min history of the squints uzbekistan: https://youtu.be/Wf3e9omI9ok KEK. That 3 min video went about like I expected. Enjoy! permalink parent award report block reply\nDITTOPatriot 1 points 5 days ago That the illusion they meant for you to see. permalink parent award report block reply\nZskills 32 points 6 days ago The chess pieces are moving.   Rare earth mineral deals.   Investment in nuclear power.  Domestic chip production.  The race to super artificial intelligence.  Whoever wins controls the fate of humanity.   It's all about this. permalink award report block reply Krat 40 points 6 days ago All will be undone by democrats in hours permalink parent award report block reply staroframphansbhole 17 points 6 days ago Nah they’ll just keep the good parts of Trump’s economic policies but pretend it was their idea all along, then reintroduce gayness into everything permalink parent award report block reply Decepticons-superior 3 points 6 days ago Yes gayness is the crucial piece. permalink parent award report block reply Retard_Strength 3 points 5 days ago \"President AOC today announced a ground-breaking incentive to hire more LGBTQIA++ miners...\" permalink parent award report block reply Senaleb 3 points 6 days ago Mining rare earths inside a mans hairy butthole -Democrat mining permalink parent award report block reply LordKuroTheGreat 3 points 6 days ago They'd start spinning around spewing pea soup like a scene from The Exorcist if they tried to retain something objectively good but related to Trump. permalink parent award report block reply staroframphansbhole 1 points 5 days ago They did though! Biden kept many of Trump's tariffs in place particularly on China and the left just ignored it or said it was cool because it was their guy doing it. permalink parent award report block reply snoopy3210 4 points 6 days ago Let’s hope it wont be an artificial economy too permalink parent award report block reply PitfallHarry 1 points 6 days ago Domestic chip production was increased 3 years ago with the chips act. permalink parent award report block reply Zskills 1 points 6 days ago Correct.  And when do you think power brokers saw the gravity of China controlling a super artificial intelligence?  Last week? permalink parent award report block reply PitfallHarry 2 points 6 days ago Nope. 3+ years ago. That’s why we kept the chip supply from flowing to China. That however forced them to do more with less and they now have some of the most efficient model available. That’s why deepseek was so disruptive. permalink parent award report block reply carpetxparmesan 2 points 5 days ago That other guy was a bit too mean, but I was going to post a youtube video on why and how this \"chip investment\" has been a failure just a few weeks ago. I'm not going to insult you personally, it's not about that, but I am getting pretty tired of normies on this site talking about the chips thing without actually knowing details about what's going on with the chips; not YOU personally. To summarize the problem, I'm going to relay an anecdote. Allegedly, the taiwanese JUMPED on this Trump opportunity and wanted to take advantage of it. So they TRIED. And, this is not my word, or my spin, this is how they presented it... they could not even get CLEAN ENOUGH WATER for their yields. As they presented (spin or not), they said they found out that the supply chain here does not even come close to what taiwan has set up over there. They imply, at a minimum, that supply chain problem would need to be fixed. Meaning, and these are my words now, it would take another 3-4 years before the supply chain could yield results and here's the BIG kicker... few people are even trying to work on supply chain issues. My interpretation of all this is the chip program is in big trouble here in the USA and it'll be ripe to be called a failure whenever democrats gain the least bit of power. I don't think it's a complete failure, but there's a lot more to be talked about on the issue. We might want to talk to the mods about doing a series of posts on the issue, maybe get some AMA from someone actually in the trenches in the admin or something. I think there's a lot to be unpacked (good and bad). But it's such a small part of the \"program\" right now and things are moving at such breakneck speed... it might be pointless just to inform people. permalink parent award report block reply view 1 more comments... Zskills 1 points 6 days ago Ah, so you do know what's going on 👌  yep.  A lot more makes sense when you're clued in to this issue permalink parent award report block reply KernalMustard 1 points 6 days ago Then Skynet permalink parent award report block reply load 2 more comments...\nKrat 40 points 6 days ago All will be undone by democrats in hours permalink parent award report block reply staroframphansbhole 17 points 6 days ago Nah they’ll just keep the good parts of Trump’s economic policies but pretend it was their idea all along, then reintroduce gayness into everything permalink parent award report block reply Decepticons-superior 3 points 6 days ago Yes gayness is the crucial piece. permalink parent award report block reply Retard_Strength 3 points 5 days ago \"President AOC today announced a ground-breaking incentive to hire more LGBTQIA++ miners...\" permalink parent award report block reply Senaleb 3 points 6 days ago Mining rare earths inside a mans hairy butthole -Democrat mining permalink parent award report block reply LordKuroTheGreat 3 points 6 days ago They'd start spinning around spewing pea soup like a scene from The Exorcist if they tried to retain something objectively good but related to Trump. permalink parent award report block reply staroframphansbhole 1 points 5 days ago They did though! Biden kept many of Trump's tariffs in place particularly on China and the left just ignored it or said it was cool because it was their guy doing it. permalink parent award report block reply\nstaroframphansbhole 17 points 6 days ago Nah they’ll just keep the good parts of Trump’s economic policies but pretend it was their idea all along, then reintroduce gayness into everything permalink parent award report block reply Decepticons-superior 3 points 6 days ago Yes gayness is the crucial piece. permalink parent award report block reply Retard_Strength 3 points 5 days ago \"President AOC today announced a ground-breaking incentive to hire more LGBTQIA++ miners...\" permalink parent award report block reply Senaleb 3 points 6 days ago Mining rare earths inside a mans hairy butthole -Democrat mining permalink parent award report block reply LordKuroTheGreat 3 points 6 days ago They'd start spinning around spewing pea soup like a scene from The Exorcist if they tried to retain something objectively good but related to Trump. permalink parent award report block reply staroframphansbhole 1 points 5 days ago They did though! Biden kept many of Trump's tariffs in place particularly on China and the left just ignored it or said it was cool because it was their guy doing it. permalink parent award report block reply\nDecepticons-superior 3 points 6 days ago Yes gayness is the crucial piece. permalink parent award report block reply Retard_Strength 3 points 5 days ago \"President AOC today announced a ground-breaking incentive to hire more LGBTQIA++ miners...\" permalink parent award report block reply\nRetard_Strength 3 points 5 days ago \"President AOC today announced a ground-breaking incentive to hire more LGBTQIA++ miners...\" permalink parent award report block reply\nSenaleb 3 points 6 days ago Mining rare earths inside a mans hairy butthole -Democrat mining permalink parent award report block reply\nLordKuroTheGreat 3 points 6 days ago They'd start spinning around spewing pea soup like a scene from The Exorcist if they tried to retain something objectively good but related to Trump. permalink parent award report block reply staroframphansbhole 1 points 5 days ago They did though! Biden kept many of Trump's tariffs in place particularly on China and the left just ignored it or said it was cool because it was their guy doing it. permalink parent award report block reply\nstaroframphansbhole 1 points 5 days ago They did though! Biden kept many of Trump's tariffs in place particularly on China and the left just ignored it or said it was cool because it was their guy doing it. permalink parent award report block reply\nsnoopy3210 4 points 6 days ago Let’s hope it wont be an artificial economy too permalink parent award report block reply\nPitfallHarry 1 points 6 days ago Domestic chip production was increased 3 years ago with the chips act. permalink parent award report block reply Zskills 1 points 6 days ago Correct.  And when do you think power brokers saw the gravity of China controlling a super artificial intelligence?  Last week? permalink parent award report block reply PitfallHarry 2 points 6 days ago Nope. 3+ years ago. That’s why we kept the chip supply from flowing to China. That however forced them to do more with less and they now have some of the most efficient model available. That’s why deepseek was so disruptive. permalink parent award report block reply carpetxparmesan 2 points 5 days ago That other guy was a bit too mean, but I was going to post a youtube video on why and how this \"chip investment\" has been a failure just a few weeks ago. I'm not going to insult you personally, it's not about that, but I am getting pretty tired of normies on this site talking about the chips thing without actually knowing details about what's going on with the chips; not YOU personally. To summarize the problem, I'm going to relay an anecdote. Allegedly, the taiwanese JUMPED on this Trump opportunity and wanted to take advantage of it. So they TRIED. And, this is not my word, or my spin, this is how they presented it... they could not even get CLEAN ENOUGH WATER for their yields. As they presented (spin or not), they said they found out that the supply chain here does not even come close to what taiwan has set up over there. They imply, at a minimum, that supply chain problem would need to be fixed. Meaning, and these are my words now, it would take another 3-4 years before the supply chain could yield results and here's the BIG kicker... few people are even trying to work on supply chain issues. My interpretation of all this is the chip program is in big trouble here in the USA and it'll be ripe to be called a failure whenever democrats gain the least bit of power. I don't think it's a complete failure, but there's a lot more to be talked about on the issue. We might want to talk to the mods about doing a series of posts on the issue, maybe get some AMA from someone actually in the trenches in the admin or something. I think there's a lot to be unpacked (good and bad). But it's such a small part of the \"program\" right now and things are moving at such breakneck speed... it might be pointless just to inform people. permalink parent award report block reply view 1 more comments... Zskills 1 points 6 days ago Ah, so you do know what's going on 👌  yep.  A lot more makes sense when you're clued in to this issue permalink parent award report block reply\nZskills 1 points 6 days ago Correct.  And when do you think power brokers saw the gravity of China controlling a super artificial intelligence?  Last week? permalink parent award report block reply PitfallHarry 2 points 6 days ago Nope. 3+ years ago. That’s why we kept the chip supply from flowing to China. That however forced them to do more with less and they now have some of the most efficient model available. That’s why deepseek was so disruptive. permalink parent award report block reply carpetxparmesan 2 points 5 days ago That other guy was a bit too mean, but I was going to post a youtube video on why and how this \"chip investment\" has been a failure just a few weeks ago. I'm not going to insult you personally, it's not about that, but I am getting pretty tired of normies on this site talking about the chips thing without actually knowing details about what's going on with the chips; not YOU personally. To summarize the problem, I'm going to relay an anecdote. Allegedly, the taiwanese JUMPED on this Trump opportunity and wanted to take advantage of it. So they TRIED. And, this is not my word, or my spin, this is how they presented it... they could not even get CLEAN ENOUGH WATER for their yields. As they presented (spin or not), they said they found out that the supply chain here does not even come close to what taiwan has set up over there. They imply, at a minimum, that supply chain problem would need to be fixed. Meaning, and these are my words now, it would take another 3-4 years before the supply chain could yield results and here's the BIG kicker... few people are even trying to work on supply chain issues. My interpretation of all this is the chip program is in big trouble here in the USA and it'll be ripe to be called a failure whenever democrats gain the least bit of power. I don't think it's a complete failure, but there's a lot more to be talked about on the issue. We might want to talk to the mods about doing a series of posts on the issue, maybe get some AMA from someone actually in the trenches in the admin or something. I think there's a lot to be unpacked (good and bad). But it's such a small part of the \"program\" right now and things are moving at such breakneck speed... it might be pointless just to inform people. permalink parent award report block reply view 1 more comments... Zskills 1 points 6 days ago Ah, so you do know what's going on 👌  yep.  A lot more makes sense when you're clued in to this issue permalink parent award report block reply\nPitfallHarry 2 points 6 days ago Nope. 3+ years ago. That’s why we kept the chip supply from flowing to China. That however forced them to do more with less and they now have some of the most efficient model available. That’s why deepseek was so disruptive. permalink parent award report block reply carpetxparmesan 2 points 5 days ago That other guy was a bit too mean, but I was going to post a youtube video on why and how this \"chip investment\" has been a failure just a few weeks ago. I'm not going to insult you personally, it's not about that, but I am getting pretty tired of normies on this site talking about the chips thing without actually knowing details about what's going on with the chips; not YOU personally. To summarize the problem, I'm going to relay an anecdote. Allegedly, the taiwanese JUMPED on this Trump opportunity and wanted to take advantage of it. So they TRIED. And, this is not my word, or my spin, this is how they presented it... they could not even get CLEAN ENOUGH WATER for their yields. As they presented (spin or not), they said they found out that the supply chain here does not even come close to what taiwan has set up over there. They imply, at a minimum, that supply chain problem would need to be fixed. Meaning, and these are my words now, it would take another 3-4 years before the supply chain could yield results and here's the BIG kicker... few people are even trying to work on supply chain issues. My interpretation of all this is the chip program is in big trouble here in the USA and it'll be ripe to be called a failure whenever democrats gain the least bit of power. I don't think it's a complete failure, but there's a lot more to be talked about on the issue. We might want to talk to the mods about doing a series of posts on the issue, maybe get some AMA from someone actually in the trenches in the admin or something. I think there's a lot to be unpacked (good and bad). But it's such a small part of the \"program\" right now and things are moving at such breakneck speed... it might be pointless just to inform people. permalink parent award report block reply view 1 more comments... Zskills 1 points 6 days ago Ah, so you do know what's going on 👌  yep.  A lot more makes sense when you're clued in to this issue permalink parent award report block reply\ncarpetxparmesan 2 points 5 days ago That other guy was a bit too mean, but I was going to post a youtube video on why and how this \"chip investment\" has been a failure just a few weeks ago. I'm not going to insult you personally, it's not about that, but I am getting pretty tired of normies on this site talking about the chips thing without actually knowing details about what's going on with the chips; not YOU personally. To summarize the problem, I'm going to relay an anecdote. Allegedly, the taiwanese JUMPED on this Trump opportunity and wanted to take advantage of it. So they TRIED. And, this is not my word, or my spin, this is how they presented it... they could not even get CLEAN ENOUGH WATER for their yields. As they presented (spin or not), they said they found out that the supply chain here does not even come close to what taiwan has set up over there. They imply, at a minimum, that supply chain problem would need to be fixed. Meaning, and these are my words now, it would take another 3-4 years before the supply chain could yield results and here's the BIG kicker... few people are even trying to work on supply chain issues. My interpretation of all this is the chip program is in big trouble here in the USA and it'll be ripe to be called a failure whenever democrats gain the least bit of power. I don't think it's a complete failure, but there's a lot more to be talked about on the issue. We might want to talk to the mods about doing a series of posts on the issue, maybe get some AMA from someone actually in the trenches in the admin or something. I think there's a lot to be unpacked (good and bad). But it's such a small part of the \"program\" right now and things are moving at such breakneck speed... it might be pointless just to inform people. permalink parent award report block reply view 1 more comments...\nZskills 1 points 6 days ago Ah, so you do know what's going on 👌  yep.  A lot more makes sense when you're clued in to this issue permalink parent award report block reply\nKernalMustard 1 points 6 days ago Then Skynet permalink parent award report block reply\nDJT_MFers1 32 points 6 days ago Hey President Trump, can we get a trade deal for Pam Bondi? permalink award report block reply guywholikesDjtof2024 6 points 6 days ago deport scam bondi to Uzbekistanistan. permalink parent award report block reply carpetxparmesan 2 points 5 days ago But what do we get in return? permalink parent award report block reply\nguywholikesDjtof2024 6 points 6 days ago deport scam bondi to Uzbekistanistan. permalink parent award report block reply carpetxparmesan 2 points 5 days ago But what do we get in return? permalink parent award report block reply\ncarpetxparmesan 2 points 5 days ago But what do we get in return? permalink parent award report block reply\nShadowInv 28 points 6 days ago I don’t care, I can’t afford a house without going into crazy debt and the streetshitters all got theirs for half the current asking price. We don’t care about ubequizstan. permalink award report block reply\n24601 27 points 6 days ago I don't know... but it really looks like Trump misses the impeachment process.... because that's what's going to happen when the Communists take back Congress next fall. MAGA ?  Where is MAGA ? Calling MAGA. permalink award report block reply Lurker404 8 points 6 days ago Yea, nobody cares about all that foreign policy stuff when the issues at home aren't addressed. permalink parent award report block reply EgregiousPhilbin 0 points 6 days ago The reason Congress goes D this time is because of Congress, not Trump. Trump is a boomer and he's not perfect, but I'd still vote for him. I will never, and I mean never, vote for a RINO congress fag. permalink parent award report block reply\nLurker404 8 points 6 days ago Yea, nobody cares about all that foreign policy stuff when the issues at home aren't addressed. permalink parent award report block reply\nEgregiousPhilbin 0 points 6 days ago The reason Congress goes D this time is because of Congress, not Trump. Trump is a boomer and he's not perfect, but I'd still vote for him. I will never, and I mean never, vote for a RINO congress fag. permalink parent award report block reply\ndeleted 21 points 6 days ago RuleoVicus 15 points 6 days ago Doesn't. permalink parent award report block reply 1_Badcop 13 points 6 days ago More importantly, how does this benefit Israel? permalink parent award report block reply Yawnz13 -1 points 6 days ago Who said that it would?  Why are you acting as if those are the only extant issues? permalink parent award report block reply Pongpagongbatibot 0 points 6 days ago These are groypers. They pretend to be America first and white nationalists but in reality they are Iranian trolls. Notice that for every topic in discussion, majority of comments are anti-trump.. that's a sign that PDW is now overran by Iranian agents permalink parent award report block reply Yawnz13 1 points 5 days ago Nah, just a concern troll. permalink parent award report block reply deleted 1 points 5 days ago Yawnz13 1 points 5 days ago Yeah, you. permalink parent award report block reply SenorTrumper 1 points 5 days ago We have a far worse problem than Iranians. Iranians didn't murder Charlie. permalink parent award report block reply AR_MAGA -8 points 6 days ago Typical socialist phrase, don't expect anything from the government. permalink parent award report block reply 1_Badcop 6 points 6 days ago Expecting the man who promised to Make America Great Again to actually do something to Make America Great Again is, in no way, socialist. permalink parent award report block reply Yawnz13 3 points 6 days ago And acting like this doesn't help make that is peak stupid. permalink parent award report block reply AR_MAGA -1 points 5 days ago If your family rely on another man, not you, you're either a socialist or lazy. permalink parent award report block reply 1_Badcop 2 points 5 days ago You are fucking retarded. Can you even comprehend the English language? WTF are you talking about? Holding a man accountable for doing his job is neither socialist nor lazy, and has nothing to do with one's family. Go back wherever you came from, Pidgen English speaker. permalink parent award report block reply view 2 more comments...\nRuleoVicus 15 points 6 days ago Doesn't. permalink parent award report block reply\n1_Badcop 13 points 6 days ago More importantly, how does this benefit Israel? permalink parent award report block reply\nYawnz13 -1 points 6 days ago Who said that it would?  Why are you acting as if those are the only extant issues? permalink parent award report block reply Pongpagongbatibot 0 points 6 days ago These are groypers. They pretend to be America first and white nationalists but in reality they are Iranian trolls. Notice that for every topic in discussion, majority of comments are anti-trump.. that's a sign that PDW is now overran by Iranian agents permalink parent award report block reply Yawnz13 1 points 5 days ago Nah, just a concern troll. permalink parent award report block reply deleted 1 points 5 days ago Yawnz13 1 points 5 days ago Yeah, you. permalink parent award report block reply SenorTrumper 1 points 5 days ago We have a far worse problem than Iranians. Iranians didn't murder Charlie. permalink parent award report block reply\nPongpagongbatibot 0 points 6 days ago These are groypers. They pretend to be America first and white nationalists but in reality they are Iranian trolls. Notice that for every topic in discussion, majority of comments are anti-trump.. that's a sign that PDW is now overran by Iranian agents permalink parent award report block reply Yawnz13 1 points 5 days ago Nah, just a concern troll. permalink parent award report block reply deleted 1 points 5 days ago Yawnz13 1 points 5 days ago Yeah, you. permalink parent award report block reply SenorTrumper 1 points 5 days ago We have a far worse problem than Iranians. Iranians didn't murder Charlie. permalink parent award report block reply\nYawnz13 1 points 5 days ago Nah, just a concern troll. permalink parent award report block reply\ndeleted 1 points 5 days ago Yawnz13 1 points 5 days ago Yeah, you. permalink parent award report block reply\nYawnz13 1 points 5 days ago Yeah, you. permalink parent award report block reply\nSenorTrumper 1 points 5 days ago We have a far worse problem than Iranians. Iranians didn't murder Charlie. permalink parent award report block reply\nAR_MAGA -8 points 6 days ago Typical socialist phrase, don't expect anything from the government. permalink parent award report block reply 1_Badcop 6 points 6 days ago Expecting the man who promised to Make America Great Again to actually do something to Make America Great Again is, in no way, socialist. permalink parent award report block reply Yawnz13 3 points 6 days ago And acting like this doesn't help make that is peak stupid. permalink parent award report block reply AR_MAGA -1 points 5 days ago If your family rely on another man, not you, you're either a socialist or lazy. permalink parent award report block reply 1_Badcop 2 points 5 days ago You are fucking retarded. Can you even comprehend the English language? WTF are you talking about? Holding a man accountable for doing his job is neither socialist nor lazy, and has nothing to do with one's family. Go back wherever you came from, Pidgen English speaker. permalink parent award report block reply view 2 more comments...\n1_Badcop 6 points 6 days ago Expecting the man who promised to Make America Great Again to actually do something to Make America Great Again is, in no way, socialist. permalink parent award report block reply Yawnz13 3 points 6 days ago And acting like this doesn't help make that is peak stupid. permalink parent award report block reply AR_MAGA -1 points 5 days ago If your family rely on another man, not you, you're either a socialist or lazy. permalink parent award report block reply 1_Badcop 2 points 5 days ago You are fucking retarded. Can you even comprehend the English language? WTF are you talking about? Holding a man accountable for doing his job is neither socialist nor lazy, and has nothing to do with one's family. Go back wherever you came from, Pidgen English speaker. permalink parent award report block reply view 2 more comments...\nYawnz13 3 points 6 days ago And acting like this doesn't help make that is peak stupid. permalink parent award report block reply\nAR_MAGA -1 points 5 days ago If your family rely on another man, not you, you're either a socialist or lazy. permalink parent award report block reply 1_Badcop 2 points 5 days ago You are fucking retarded. Can you even comprehend the English language? WTF are you talking about? Holding a man accountable for doing his job is neither socialist nor lazy, and has nothing to do with one's family. Go back wherever you came from, Pidgen English speaker. permalink parent award report block reply view 2 more comments...\n1_Badcop 2 points 5 days ago You are fucking retarded. Can you even comprehend the English language? WTF are you talking about? Holding a man accountable for doing his job is neither socialist nor lazy, and has nothing to do with one's family. Go back wherever you came from, Pidgen English speaker. permalink parent award report block reply view 2 more comments...\nJoeBidensDementia1 18 points 6 days ago Who? Fuck this shit. The Muslims are taking over on of our greatest cities! DEPORT THEM ALL! permalink award report block reply Wallllllllllllllllll 4 points 6 days ago Uzbeki-beki-bekistan permalink parent award report block reply guywholikesDjtof2024 3 points 6 days ago uzburkaburkastan permalink parent award report block reply SenorTrumper 2 points 5 days ago First the juice ran it, now the muzzies. permalink parent award report block reply RedStoneDeepState 1 points 6 days ago Uzbekistan was the center of the Soviet rocketry program and effectively colonized India for 500 years. permalink parent award report block reply Yawnz13 1 points 6 days ago Uzbekistan colonized India?  You mean the Mongols.  The Mongols invaded and destroyed the Khwarazmians who ruled what is now Uzbekistan at the time (13th century).  Timur/Tamerlane founded the Timurid dynasty in the area (14th, and his descendent Babur founded the Mughal dynasty in India.  \"Mughal\" = \"Mongol\". permalink parent award report block reply RedStoneDeepState 1 points 6 days ago I mean Uzbekistan not the Mongols. Tamerlane is the national hero of Uzbekistan, being born in Transoxiana as a Muslim. That is Uzbekistan. The capitol of his empire was Samarkand, again Uzbekistan. He claimed legitimacy from the Mongols but at the end of the day he was a Muslim not a Tengrist, it was squarely a different culture than Mongols. Hence why they get called Mughals, the Perzianization of Mongol. Babur was from Andijan - again Uzbekistan. permalink parent award report block reply Yawnz13 0 points 6 days ago I mean Uzbekistan not the Mongols You're still wrong though. Tamerlane is the national hero of Uzbekistan, being born in Transoxiana as a Muslim. That is Uzbekistan. The capitol of his empire was Samarkand, again Uzbekistan. Cool story, and who was he born of?  Turkified Mongols.  Transoxiana was at the time part of the Mongol confederation known as Barlas.  He shared common ancestry with Genghis Khan on his father's side, saw himself as Genghis' legitimate heir, and wanted to restore the Mongol Empire. He claimed legitimacy from the Mongols but at the end of the day he was a Muslim not a Tengrist, it was squarely a different culture than Mongols. You do understand that large portions of the Mongols converted to Islam, yes?  Being a Mongol and being a Muslim are not mutually exclusive concepts.  Timur claimed common ancestry with Genghis Khan, said ancestor being Tumbinai Khan. Had the Mongol invasion and subsequent destruction of the Khwarazmian Empire not happened, Timur wouldn't have been born.  Had Timur not been born, Babur wouldn't have been born.  Had Babur not been born, the Mughal Empire would never have been founded. permalink parent award report block reply view 9 more comments... lefty295 1 points 6 days ago Yeah but Uzbeks are the descendants of Timur or the people his ancestors brought partly. Timur was the result of a migration to that region by Mongolians. After they depopulated it. then mixed with the remaining locals and Turkic tribes into what are now Uzbeks. They're more similar to Timur than modern Mongolians are. Modern Uzbeks would have more of a claim to him as part of their national identity than a modern Mongolian would. Timur was born in modern day Uzbekistan. It doesn't matter who his ancestors are when he is their ancestor. Modern Mongolians are not his descendants. They're the people that stayed in that region. permalink parent award report block reply Yawnz13 1 points 5 days ago Yeah but Uzbeks are the descendants of Timur or the people his ancestors brought partly. Most are Turkic.  Timur was entirely Mongol. They're more similar to Timur than modern Mongolians are. Timur was entirely Mongol. Modern Uzbeks would have more of a claim to him as part of their national identity than a modern Mongolian would. What they claim doesn't matter.  Genetics is what matters. Timur was born in modern day Uzbekistan. No, Timur was born It doesn't matter who his ancestors are when he is their ancestor. Modern Mongolians are not his descendants. They're the people that stayed in that region. Retarded argument.  Someone is German because their ancestors were German, yes?  German is a definable genetic group not dependent on place.  Likewise, so is \"Mongol\". Modern Uzbeks are a mix of Mongol and Turkic.  Timur wouldn't have had Turkic admixture given that he was born to Mongol parents. https://www.protobulgarians.com/Statii%20ot%20drugi%20avtori/Turks%20-%20race%20apearance%20and%20origin.htm permalink parent award report block reply\nWallllllllllllllllll 4 points 6 days ago Uzbeki-beki-bekistan permalink parent award report block reply guywholikesDjtof2024 3 points 6 days ago uzburkaburkastan permalink parent award report block reply\nguywholikesDjtof2024 3 points 6 days ago uzburkaburkastan permalink parent award report block reply\nSenorTrumper 2 points 5 days ago First the juice ran it, now the muzzies. permalink parent award report block reply\nRedStoneDeepState 1 points 6 days ago Uzbekistan was the center of the Soviet rocketry program and effectively colonized India for 500 years. permalink parent award report block reply Yawnz13 1 points 6 days ago Uzbekistan colonized India?  You mean the Mongols.  The Mongols invaded and destroyed the Khwarazmians who ruled what is now Uzbekistan at the time (13th century).  Timur/Tamerlane founded the Timurid dynasty in the area (14th, and his descendent Babur founded the Mughal dynasty in India.  \"Mughal\" = \"Mongol\". permalink parent award report block reply RedStoneDeepState 1 points 6 days ago I mean Uzbekistan not the Mongols. Tamerlane is the national hero of Uzbekistan, being born in Transoxiana as a Muslim. That is Uzbekistan. The capitol of his empire was Samarkand, again Uzbekistan. He claimed legitimacy from the Mongols but at the end of the day he was a Muslim not a Tengrist, it was squarely a different culture than Mongols. Hence why they get called Mughals, the Perzianization of Mongol. Babur was from Andijan - again Uzbekistan. permalink parent award report block reply Yawnz13 0 points 6 days ago I mean Uzbekistan not the Mongols You're still wrong though. Tamerlane is the national hero of Uzbekistan, being born in Transoxiana as a Muslim. That is Uzbekistan. The capitol of his empire was Samarkand, again Uzbekistan. Cool story, and who was he born of?  Turkified Mongols.  Transoxiana was at the time part of the Mongol confederation known as Barlas.  He shared common ancestry with Genghis Khan on his father's side, saw himself as Genghis' legitimate heir, and wanted to restore the Mongol Empire. He claimed legitimacy from the Mongols but at the end of the day he was a Muslim not a Tengrist, it was squarely a different culture than Mongols. You do understand that large portions of the Mongols converted to Islam, yes?  Being a Mongol and being a Muslim are not mutually exclusive concepts.  Timur claimed common ancestry with Genghis Khan, said ancestor being Tumbinai Khan. Had the Mongol invasion and subsequent destruction of the Khwarazmian Empire not happened, Timur wouldn't have been born.  Had Timur not been born, Babur wouldn't have been born.  Had Babur not been born, the Mughal Empire would never have been founded. permalink parent award report block reply view 9 more comments... lefty295 1 points 6 days ago Yeah but Uzbeks are the descendants of Timur or the people his ancestors brought partly. Timur was the result of a migration to that region by Mongolians. After they depopulated it. then mixed with the remaining locals and Turkic tribes into what are now Uzbeks. They're more similar to Timur than modern Mongolians are. Modern Uzbeks would have more of a claim to him as part of their national identity than a modern Mongolian would. Timur was born in modern day Uzbekistan. It doesn't matter who his ancestors are when he is their ancestor. Modern Mongolians are not his descendants. They're the people that stayed in that region. permalink parent award report block reply Yawnz13 1 points 5 days ago Yeah but Uzbeks are the descendants of Timur or the people his ancestors brought partly. Most are Turkic.  Timur was entirely Mongol. They're more similar to Timur than modern Mongolians are. Timur was entirely Mongol. Modern Uzbeks would have more of a claim to him as part of their national identity than a modern Mongolian would. What they claim doesn't matter.  Genetics is what matters. Timur was born in modern day Uzbekistan. No, Timur was born It doesn't matter who his ancestors are when he is their ancestor. Modern Mongolians are not his descendants. They're the people that stayed in that region. Retarded argument.  Someone is German because their ancestors were German, yes?  German is a definable genetic group not dependent on place.  Likewise, so is \"Mongol\". Modern Uzbeks are a mix of Mongol and Turkic.  Timur wouldn't have had Turkic admixture given that he was born to Mongol parents. https://www.protobulgarians.com/Statii%20ot%20drugi%20avtori/Turks%20-%20race%20apearance%20and%20origin.htm permalink parent award report block reply\nYawnz13 1 points 6 days ago Uzbekistan colonized India?  You mean the Mongols.  The Mongols invaded and destroyed the Khwarazmians who ruled what is now Uzbekistan at the time (13th century).  Timur/Tamerlane founded the Timurid dynasty in the area (14th, and his descendent Babur founded the Mughal dynasty in India.  \"Mughal\" = \"Mongol\". permalink parent award report block reply RedStoneDeepState 1 points 6 days ago I mean Uzbekistan not the Mongols. Tamerlane is the national hero of Uzbekistan, being born in Transoxiana as a Muslim. That is Uzbekistan. The capitol of his empire was Samarkand, again Uzbekistan. He claimed legitimacy from the Mongols but at the end of the day he was a Muslim not a Tengrist, it was squarely a different culture than Mongols. Hence why they get called Mughals, the Perzianization of Mongol. Babur was from Andijan - again Uzbekistan. permalink parent award report block reply Yawnz13 0 points 6 days ago I mean Uzbekistan not the Mongols You're still wrong though. Tamerlane is the national hero of Uzbekistan, being born in Transoxiana as a Muslim. That is Uzbekistan. The capitol of his empire was Samarkand, again Uzbekistan. Cool story, and who was he born of?  Turkified Mongols.  Transoxiana was at the time part of the Mongol confederation known as Barlas.  He shared common ancestry with Genghis Khan on his father's side, saw himself as Genghis' legitimate heir, and wanted to restore the Mongol Empire. He claimed legitimacy from the Mongols but at the end of the day he was a Muslim not a Tengrist, it was squarely a different culture than Mongols. You do understand that large portions of the Mongols converted to Islam, yes?  Being a Mongol and being a Muslim are not mutually exclusive concepts.  Timur claimed common ancestry with Genghis Khan, said ancestor being Tumbinai Khan. Had the Mongol invasion and subsequent destruction of the Khwarazmian Empire not happened, Timur wouldn't have been born.  Had Timur not been born, Babur wouldn't have been born.  Had Babur not been born, the Mughal Empire would never have been founded. permalink parent award report block reply view 9 more comments... lefty295 1 points 6 days ago Yeah but Uzbeks are the descendants of Timur or the people his ancestors brought partly. Timur was the result of a migration to that region by Mongolians. After they depopulated it. then mixed with the remaining locals and Turkic tribes into what are now Uzbeks. They're more similar to Timur than modern Mongolians are. Modern Uzbeks would have more of a claim to him as part of their national identity than a modern Mongolian would. Timur was born in modern day Uzbekistan. It doesn't matter who his ancestors are when he is their ancestor. Modern Mongolians are not his descendants. They're the people that stayed in that region. permalink parent award report block reply Yawnz13 1 points 5 days ago Yeah but Uzbeks are the descendants of Timur or the people his ancestors brought partly. Most are Turkic.  Timur was entirely Mongol. They're more similar to Timur than modern Mongolians are. Timur was entirely Mongol. Modern Uzbeks would have more of a claim to him as part of their national identity than a modern Mongolian would. What they claim doesn't matter.  Genetics is what matters. Timur was born in modern day Uzbekistan. No, Timur was born It doesn't matter who his ancestors are when he is their ancestor. Modern Mongolians are not his descendants. They're the people that stayed in that region. Retarded argument.  Someone is German because their ancestors were German, yes?  German is a definable genetic group not dependent on place.  Likewise, so is \"Mongol\". Modern Uzbeks are a mix of Mongol and Turkic.  Timur wouldn't have had Turkic admixture given that he was born to Mongol parents. https://www.protobulgarians.com/Statii%20ot%20drugi%20avtori/Turks%20-%20race%20apearance%20and%20origin.htm permalink parent award report block reply\nRedStoneDeepState 1 points 6 days ago I mean Uzbekistan not the Mongols. Tamerlane is the national hero of Uzbekistan, being born in Transoxiana as a Muslim. That is Uzbekistan. The capitol of his empire was Samarkand, again Uzbekistan. He claimed legitimacy from the Mongols but at the end of the day he was a Muslim not a Tengrist, it was squarely a different culture than Mongols. Hence why they get called Mughals, the Perzianization of Mongol. Babur was from Andijan - again Uzbekistan. permalink parent award report block reply Yawnz13 0 points 6 days ago I mean Uzbekistan not the Mongols You're still wrong though. Tamerlane is the national hero of Uzbekistan, being born in Transoxiana as a Muslim. That is Uzbekistan. The capitol of his empire was Samarkand, again Uzbekistan. Cool story, and who was he born of?  Turkified Mongols.  Transoxiana was at the time part of the Mongol confederation known as Barlas.  He shared common ancestry with Genghis Khan on his father's side, saw himself as Genghis' legitimate heir, and wanted to restore the Mongol Empire. He claimed legitimacy from the Mongols but at the end of the day he was a Muslim not a Tengrist, it was squarely a different culture than Mongols. You do understand that large portions of the Mongols converted to Islam, yes?  Being a Mongol and being a Muslim are not mutually exclusive concepts.  Timur claimed common ancestry with Genghis Khan, said ancestor being Tumbinai Khan. Had the Mongol invasion and subsequent destruction of the Khwarazmian Empire not happened, Timur wouldn't have been born.  Had Timur not been born, Babur wouldn't have been born.  Had Babur not been born, the Mughal Empire would never have been founded. permalink parent award report block reply view 9 more comments...\nYawnz13 0 points 6 days ago I mean Uzbekistan not the Mongols You're still wrong though. Tamerlane is the national hero of Uzbekistan, being born in Transoxiana as a Muslim. That is Uzbekistan. The capitol of his empire was Samarkand, again Uzbekistan. Cool story, and who was he born of?  Turkified Mongols.  Transoxiana was at the time part of the Mongol confederation known as Barlas.  He shared common ancestry with Genghis Khan on his father's side, saw himself as Genghis' legitimate heir, and wanted to restore the Mongol Empire. He claimed legitimacy from the Mongols but at the end of the day he was a Muslim not a Tengrist, it was squarely a different culture than Mongols. You do understand that large portions of the Mongols converted to Islam, yes?  Being a Mongol and being a Muslim are not mutually exclusive concepts.  Timur claimed common ancestry with Genghis Khan, said ancestor being Tumbinai Khan. Had the Mongol invasion and subsequent destruction of the Khwarazmian Empire not happened, Timur wouldn't have been born.  Had Timur not been born, Babur wouldn't have been born.  Had Babur not been born, the Mughal Empire would never have been founded. permalink parent award report block reply view 9 more comments...\nlefty295 1 points 6 days ago Yeah but Uzbeks are the descendants of Timur or the people his ancestors brought partly. Timur was the result of a migration to that region by Mongolians. After they depopulated it. then mixed with the remaining locals and Turkic tribes into what are now Uzbeks. They're more similar to Timur than modern Mongolians are. Modern Uzbeks would have more of a claim to him as part of their national identity than a modern Mongolian would. Timur was born in modern day Uzbekistan. It doesn't matter who his ancestors are when he is their ancestor. Modern Mongolians are not his descendants. They're the people that stayed in that region. permalink parent award report block reply Yawnz13 1 points 5 days ago Yeah but Uzbeks are the descendants of Timur or the people his ancestors brought partly. Most are Turkic.  Timur was entirely Mongol. They're more similar to Timur than modern Mongolians are. Timur was entirely Mongol. Modern Uzbeks would have more of a claim to him as part of their national identity than a modern Mongolian would. What they claim doesn't matter.  Genetics is what matters. Timur was born in modern day Uzbekistan. No, Timur was born It doesn't matter who his ancestors are when he is their ancestor. Modern Mongolians are not his descendants. They're the people that stayed in that region. Retarded argument.  Someone is German because their ancestors were German, yes?  German is a definable genetic group not dependent on place.  Likewise, so is \"Mongol\". Modern Uzbeks are a mix of Mongol and Turkic.  Timur wouldn't have had Turkic admixture given that he was born to Mongol parents. https://www.protobulgarians.com/Statii%20ot%20drugi%20avtori/Turks%20-%20race%20apearance%20and%20origin.htm permalink parent award report block reply\nYawnz13 1 points 5 days ago Yeah but Uzbeks are the descendants of Timur or the people his ancestors brought partly. Most are Turkic.  Timur was entirely Mongol. They're more similar to Timur than modern Mongolians are. Timur was entirely Mongol. Modern Uzbeks would have more of a claim to him as part of their national identity than a modern Mongolian would. What they claim doesn't matter.  Genetics is what matters. Timur was born in modern day Uzbekistan. No, Timur was born It doesn't matter who his ancestors are when he is their ancestor. Modern Mongolians are not his descendants. They're the people that stayed in that region. Retarded argument.  Someone is German because their ancestors were German, yes?  German is a definable genetic group not dependent on place.  Likewise, so is \"Mongol\". Modern Uzbeks are a mix of Mongol and Turkic.  Timur wouldn't have had Turkic admixture given that he was born to Mongol parents. https://www.protobulgarians.com/Statii%20ot%20drugi%20avtori/Turks%20-%20race%20apearance%20and%20origin.htm permalink parent award report block reply\nMaxdady01 17 points 6 days ago Election reform, Voter Id, Mail-in Ballots here at home? permalink award report block reply\nTexasRepublic 16 points 6 days ago Whatever. Where are those Epstein files you promised? permalink award report block reply\nflp999 15 points 6 days ago I DON'T CARE ABOUT THIS AT ALL. Where is my fucking scamdemic truth? WTF is this bullshit? Fuck Uzbekistan. Fuck this whole economy. I WANT THE GODDAMN TRUTH ABOUT WHAT THIS GOVERNMENT DID TO US!!! permalink award report block reply RedStoneDeepState -2 points 6 days ago Fuck this whole economy Fine, lets get you cut off from the voluntary exchange of goods and services. You would start bitching seconds after getting your power cut. permalink parent award report block reply\nRedStoneDeepState -2 points 6 days ago Fuck this whole economy Fine, lets get you cut off from the voluntary exchange of goods and services. You would start bitching seconds after getting your power cut. permalink parent award report block reply\nBrionK 14 points 6 days ago Zzzzzzzzzzzzzzzzzzzzzzzz.\nWaiting for America First results. permalink award report block reply\nknnbccb 14 points 6 days ago If you haven't noticed already. Trump is slowly and methodically peeling away China's 'good little buddies' around the world. Some of them you can't peel away, so you need surgical removal. Up next: Venezuela, then South Africa. permalink award report block reply BobDolesBanana 8 points 6 days ago If only we could trade with Russia... permalink parent award report block reply NZbacon 3 points 6 days ago When zelenski disappears it will happen. permalink parent award report block reply Skogin 5 points 6 days ago Oh, we notice. And so do all the shills. permalink parent award report block reply Lurker404 0 points 6 days ago That's nice and all but while he's busy doing that he's bleeding voters at home. Voters don't care. They care that everything is getting more expensive. They care that they can't find a job while all these H1Jeets are flooding in. And they care that Republicans are busy simping for some sandbox shithole on the other side of the ocean. permalink parent award report block reply\nBobDolesBanana 8 points 6 days ago If only we could trade with Russia... permalink parent award report block reply NZbacon 3 points 6 days ago When zelenski disappears it will happen. permalink parent award report block reply\nNZbacon 3 points 6 days ago When zelenski disappears it will happen. permalink parent award report block reply\nSkogin 5 points 6 days ago Oh, we notice. And so do all the shills. permalink parent award report block reply\nLurker404 0 points 6 days ago That's nice and all but while he's busy doing that he's bleeding voters at home. Voters don't care. They care that everything is getting more expensive. They care that they can't find a job while all these H1Jeets are flooding in. And they care that Republicans are busy simping for some sandbox shithole on the other side of the ocean. permalink parent award report block reply\nYaharaRiver 14 points 6 days ago yikes. 95% muslim, so expect them to betray you. The country has an immature and unskilled population, with 30.1% of its residents 👉 under the age of 14. The median age in Uzbekistan is 27 years as of 2025. What could possibly go wrong?! permalink award report block reply DT170x 12 points 6 days ago They can stay there and we don't need any Uzbekistani people. permalink parent award report block reply OhioRepublic 9 points 6 days ago Fuck every place ending with -stan permalink parent award report block reply RedStoneDeepState 1 points 6 days ago Uzbekistan is not Afghanistan. It was the center of the Soviet rocketry program. See the Nevich testing ground. permalink parent award report block reply guywholikesDjtof2024 0 points 6 days ago Stan is satan without the first a. permalink parent award report block reply yodayoda -1 points 6 days ago well you're going to have them, apparently. permalink parent award report block reply Skogin 8 points 6 days ago median age in Uzbekistan is 27 years That’s perfect for operating the mining equipment. permalink parent award report block reply RedStoneDeepState 1 points 6 days ago Which type? They have both. The Tajik/Uzbek border is the second most mined border in the world. permalink parent award report block reply henri_derelicte 1 points 6 days ago There was old song mentioning how Uzbeks are very nosy people with bone in their brain permalink parent award report block reply RedStoneDeepState 1 points 6 days ago Uzbekistan is a rather highly educated country bordering the truly retarded Muslims. They are effectively in a cold war with neighboring Tajikistan and mine everything that touches Tajikistan or Afghanistan. permalink parent award report block reply breadbaker 3 points 6 days ago What could possibly go wrong?! Listening to Israelis shitting on what is essentially a high-value investment deal. UZ is net energy exporter with 36 million people who are used to living near first world standard of living. Their resources won't run out soon - and apparently they like buying the stuff that makes the first world the first world from us and investing their assets here. Finally a good deal. I nominate Uzbekistan as a our greatest ally and say uzbek-christian values shall live on forever. Can someone form the American Uzbek Political Action Committee? permalink parent award report block reply BobDolesBanana 3 points 6 days ago Oh, yeah. It's called the National Endowment for Democracy, a US-based nonprofit that provides grants to support democratic institutions, human rights initiatives, and civic engagement in Uzbekistan, aligning with US foreign policy goals. We do this in nearly every country. It is how the US performs regime change. How did you think we have pointless foreign wars in the first place? permalink parent award report block reply YaharaRiver 1 points 6 days ago ok, yeah this was funny 😂👍 permalink parent award report block reply RedStoneDeepState 0 points 6 days ago Uzbekistan was the center of the Soviet rocketry program and effectively colonized India for 500 years. with 30.1% of its residents 👉 under the age of 14. The median age in Uzbekistan is 27 years as of 2025. That describes the USA in the 1970s. permalink parent award report block reply\nDT170x 12 points 6 days ago They can stay there and we don't need any Uzbekistani people. permalink parent award report block reply OhioRepublic 9 points 6 days ago Fuck every place ending with -stan permalink parent award report block reply RedStoneDeepState 1 points 6 days ago Uzbekistan is not Afghanistan. It was the center of the Soviet rocketry program. See the Nevich testing ground. permalink parent award report block reply guywholikesDjtof2024 0 points 6 days ago Stan is satan without the first a. permalink parent award report block reply yodayoda -1 points 6 days ago well you're going to have them, apparently. permalink parent award report block reply\nOhioRepublic 9 points 6 days ago Fuck every place ending with -stan permalink parent award report block reply RedStoneDeepState 1 points 6 days ago Uzbekistan is not Afghanistan. It was the center of the Soviet rocketry program. See the Nevich testing ground. permalink parent award report block reply guywholikesDjtof2024 0 points 6 days ago Stan is satan without the first a. permalink parent award report block reply\nRedStoneDeepState 1 points 6 days ago Uzbekistan is not Afghanistan. It was the center of the Soviet rocketry program. See the Nevich testing ground. permalink parent award report block reply\nguywholikesDjtof2024 0 points 6 days ago Stan is satan without the first a. permalink parent award report block reply\nyodayoda -1 points 6 days ago well you're going to have them, apparently. permalink parent award report block reply\nSkogin 8 points 6 days ago median age in Uzbekistan is 27 years That’s perfect for operating the mining equipment. permalink parent award report block reply RedStoneDeepState 1 points 6 days ago Which type? They have both. The Tajik/Uzbek border is the second most mined border in the world. permalink parent award report block reply henri_derelicte 1 points 6 days ago There was old song mentioning how Uzbeks are very nosy people with bone in their brain permalink parent award report block reply RedStoneDeepState 1 points 6 days ago Uzbekistan is a rather highly educated country bordering the truly retarded Muslims. They are effectively in a cold war with neighboring Tajikistan and mine everything that touches Tajikistan or Afghanistan. permalink parent award report block reply\nRedStoneDeepState 1 points 6 days ago Which type? They have both. The Tajik/Uzbek border is the second most mined border in the world. permalink parent award report block reply\nhenri_derelicte 1 points 6 days ago There was old song mentioning how Uzbeks are very nosy people with bone in their brain permalink parent award report block reply RedStoneDeepState 1 points 6 days ago Uzbekistan is a rather highly educated country bordering the truly retarded Muslims. They are effectively in a cold war with neighboring Tajikistan and mine everything that touches Tajikistan or Afghanistan. permalink parent award report block reply\nRedStoneDeepState 1 points 6 days ago Uzbekistan is a rather highly educated country bordering the truly retarded Muslims. They are effectively in a cold war with neighboring Tajikistan and mine everything that touches Tajikistan or Afghanistan. permalink parent award report block reply\nbreadbaker 3 points 6 days ago What could possibly go wrong?! Listening to Israelis shitting on what is essentially a high-value investment deal. UZ is net energy exporter with 36 million people who are used to living near first world standard of living. Their resources won't run out soon - and apparently they like buying the stuff that makes the first world the first world from us and investing their assets here. Finally a good deal. I nominate Uzbekistan as a our greatest ally and say uzbek-christian values shall live on forever. Can someone form the American Uzbek Political Action Committee? permalink parent award report block reply BobDolesBanana 3 points 6 days ago Oh, yeah. It's called the National Endowment for Democracy, a US-based nonprofit that provides grants to support democratic institutions, human rights initiatives, and civic engagement in Uzbekistan, aligning with US foreign policy goals. We do this in nearly every country. It is how the US performs regime change. How did you think we have pointless foreign wars in the first place? permalink parent award report block reply YaharaRiver 1 points 6 days ago ok, yeah this was funny 😂👍 permalink parent award report block reply\nBobDolesBanana 3 points 6 days ago Oh, yeah. It's called the National Endowment for Democracy, a US-based nonprofit that provides grants to support democratic institutions, human rights initiatives, and civic engagement in Uzbekistan, aligning with US foreign policy goals. We do this in nearly every country. It is how the US performs regime change. How did you think we have pointless foreign wars in the first place? permalink parent award report block reply\nYaharaRiver 1 points 6 days ago ok, yeah this was funny 😂👍 permalink parent award report block reply\nRedStoneDeepState 0 points 6 days ago Uzbekistan was the center of the Soviet rocketry program and effectively colonized India for 500 years. with 30.1% of its residents 👉 under the age of 14. The median age in Uzbekistan is 27 years as of 2025. That describes the USA in the 1970s. permalink parent award report block reply\nModernturnkey 14 points 6 days ago Awesome, how many billions are we gonna be giving them to invest in the US? permalink award report block reply guywholikesDjtof2024 6 points 6 days ago Billions and Billions permalink parent award report block reply\nguywholikesDjtof2024 6 points 6 days ago Billions and Billions permalink parent award report block reply\nImYourHuckleberry24 12 points 6 days ago I'm thrilled to announce that I don't give shit! I, like most other MAGA voters, would prefer actual JUSTICE be done! Is THAT too much to ask? permalink award report block reply 1_Badcop 5 points 6 days ago Apparently, yes, asking for justice is too much to ask. permalink parent award report block reply\n1_Badcop 5 points 6 days ago Apparently, yes, asking for justice is too much to ask. permalink parent award report block reply\nWhatTheActualFuckS 12 points 6 days ago Sorry but where is this country getting 35 billion dollars to invest in anything? Thats 30% of their gdp and then 10% over ten years? permalink award report block reply Modernturnkey 13 points 6 days ago Easy peasy, we will give them 35 billion of taxpayer money, and they'll reinvest it into US corporations that fill the pockets of politicians! permalink parent award report block reply curiousorganelle 6 points 6 days ago The israeli model of economics!! permalink parent award report block reply Modernturnkey 3 points 6 days ago coin clipping intensifies permalink parent award report block reply\nModernturnkey 13 points 6 days ago Easy peasy, we will give them 35 billion of taxpayer money, and they'll reinvest it into US corporations that fill the pockets of politicians! permalink parent award report block reply curiousorganelle 6 points 6 days ago The israeli model of economics!! permalink parent award report block reply Modernturnkey 3 points 6 days ago coin clipping intensifies permalink parent award report block reply\ncuriousorganelle 6 points 6 days ago The israeli model of economics!! permalink parent award report block reply Modernturnkey 3 points 6 days ago coin clipping intensifies permalink parent award report block reply\nModernturnkey 3 points 6 days ago coin clipping intensifies permalink parent award report block reply\nPeteJeffrey 12 points 6 days ago I. Don't. Give. A. Shit. About. Other. Countries. Neither their money nor there problems. permalink award report block reply DT170x 10 points 6 days ago If Uzbekistan buy our stuff in which pay OUR employees and expands OUR economy. That is a Win in my books. permalink parent award report block reply yodayoda 3 points 6 days ago since when in the history of modern trade deals do other countries buy substantially from us? we'll be running a trade deficit with them, like with everyone else. permalink parent award report block reply RedStoneDeepState 2 points 6 days ago The US exports over 3 trillion in goods permalink parent award report block reply AliceCooperBiden 1 points 6 days ago Doesn't matter when we import over 3 trillion... permalink parent award report block reply yodayoda -1 points 6 days ago interesting. now do imports. permalink parent award report block reply Lurker404 1 points 6 days ago Even if that happens, it'll only benefit Democrats because they'll be the ones in power by then. All these longterm issues don't solve the problems of the people right now. Trump has maybe half a year to turn things around domestically or he's done once the midterms come around. permalink parent award report block reply\nDT170x 10 points 6 days ago If Uzbekistan buy our stuff in which pay OUR employees and expands OUR economy. That is a Win in my books. permalink parent award report block reply yodayoda 3 points 6 days ago since when in the history of modern trade deals do other countries buy substantially from us? we'll be running a trade deficit with them, like with everyone else. permalink parent award report block reply RedStoneDeepState 2 points 6 days ago The US exports over 3 trillion in goods permalink parent award report block reply AliceCooperBiden 1 points 6 days ago Doesn't matter when we import over 3 trillion... permalink parent award report block reply yodayoda -1 points 6 days ago interesting. now do imports. permalink parent award report block reply Lurker404 1 points 6 days ago Even if that happens, it'll only benefit Democrats because they'll be the ones in power by then. All these longterm issues don't solve the problems of the people right now. Trump has maybe half a year to turn things around domestically or he's done once the midterms come around. permalink parent award report block reply\nyodayoda 3 points 6 days ago since when in the history of modern trade deals do other countries buy substantially from us? we'll be running a trade deficit with them, like with everyone else. permalink parent award report block reply RedStoneDeepState 2 points 6 days ago The US exports over 3 trillion in goods permalink parent award report block reply AliceCooperBiden 1 points 6 days ago Doesn't matter when we import over 3 trillion... permalink parent award report block reply yodayoda -1 points 6 days ago interesting. now do imports. permalink parent award report block reply\nRedStoneDeepState 2 points 6 days ago The US exports over 3 trillion in goods permalink parent award report block reply AliceCooperBiden 1 points 6 days ago Doesn't matter when we import over 3 trillion... permalink parent award report block reply yodayoda -1 points 6 days ago interesting. now do imports. permalink parent award report block reply\nAliceCooperBiden 1 points 6 days ago Doesn't matter when we import over 3 trillion... permalink parent award report block reply\nyodayoda -1 points 6 days ago interesting. now do imports. permalink parent award report block reply\nLurker404 1 points 6 days ago Even if that happens, it'll only benefit Democrats because they'll be the ones in power by then. All these longterm issues don't solve the problems of the people right now. Trump has maybe half a year to turn things around domestically or he's done once the midterms come around. permalink parent award report block reply\nRock9Head 11 points 6 days ago I hope they don’t get visas. permalink award report block reply\nanti_masker 10 points 6 days ago Oh, Uzbekistan. I’ve heard of that country. I think… permalink award report block reply RedStoneDeepState 4 points 6 days ago It was a core part of the Soviet Union.  It was the center of the Soviet rocketry program. See the Nevich testing ground. Separately, before being absorbed by Russia, that group went by the name of the \"Mughal Empire\" - the Mughal empire wasnt ruled by Indians, it was Uzbekistan having colonized India under Tamerlane's empire and the successor that Babur set up. So have you ever heard of the Soviet Union or Mughal empire? permalink parent award report block reply\nRedStoneDeepState 4 points 6 days ago It was a core part of the Soviet Union.  It was the center of the Soviet rocketry program. See the Nevich testing ground. Separately, before being absorbed by Russia, that group went by the name of the \"Mughal Empire\" - the Mughal empire wasnt ruled by Indians, it was Uzbekistan having colonized India under Tamerlane's empire and the successor that Babur set up. So have you ever heard of the Soviet Union or Mughal empire? permalink parent award report block reply\nmedicpatriot 8 points 6 days ago Who gives a shit? permalink award report block reply\nweltallic 7 points 6 days ago I'm sure the next Democrat administration will quietly thank you under their breath as they spend it all importing millions of migrants. While they imprison you.  And your whole team. Because you did NOTHING. permalink award report block reply\nPiratePatriotParrot 6 points 6 days ago idon'tgiveafuckistan permalink award report block reply\nGayPatriotMAGAUncle 6 points 6 days ago Why!? Why asshole Uzbekistan? Why not make great deal with Kazakhstan, #1 exporter of potassium? Kazakhstan should be greatest ally of America, not stinky Uzbekistan. Borat will not be very happy with this. permalink award report block reply AlmostFullyDilated -1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nAlmostFullyDilated -1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nflashersenpai 6 points 6 days ago would be nice to have an economic deal with Russia permalink award report block reply\nDr_Phil 5 points 6 days ago Boring. permalink award report block reply 1_Badcop 3 points 6 days ago No, more likely strip-mining. permalink parent award report block reply\n1_Badcop 3 points 6 days ago No, more likely strip-mining. permalink parent award report block reply\nI-am-Orlando OP PRO 5 points 6 days ago Link https://truthsocial.com/@realDonaldTrump/115506045885898474 permalink award report block reply\nyodayoda 5 points 6 days ago more bullshit trade deals i see. permalink award report block reply\nKungPaoMcChicken 4 points 6 days ago 99% of Americans can't point to it on the map. I'm thinking it's somewhere between Iran and Russia, but only because of the copious hours of EU4 I have played. permalink award report block reply SenorTrumper 1 points 5 days ago All the Far-away-istans are former USSR republics and therefore clustered together. permalink parent award report block reply KungPaoMcChicken 2 points 5 days ago I heard that there are some incredible USSR bus stops in some of these former soviet era nations. I imagine that travelling the world just to see all of these magical bugs stops would be incredible. Like brutalist architecture using concrete. But, not how the west does concrete in a cheap fashion, every bus stop was completely different. Usually with a tonne of curves. And not mass produced. Like someone really took a lot of effort. They believed in the future they thought they were making. permalink parent award report block reply SenorTrumper 1 points 5 days ago Turn on CCs. https://www.youtube.com/watch?v=8HZ4DnVfWYQ https://www.youtube.com/watch?v=t7kr7utvVEs&list=RDt7kr7utvVEs&start_radio=1 Those are Russian videos.  Watch closely. Every scene is a gem. permalink parent award report block reply KungPaoMcChicken 1 points 5 days ago Interesting... permalink parent award report block reply SenorTrumper 1 points 5 days ago Speaking of bus stops, have you watched the Russian epies on the Bald & Bankrupt channel on YT? permalink parent award report block reply\nSenorTrumper 1 points 5 days ago All the Far-away-istans are former USSR republics and therefore clustered together. permalink parent award report block reply KungPaoMcChicken 2 points 5 days ago I heard that there are some incredible USSR bus stops in some of these former soviet era nations. I imagine that travelling the world just to see all of these magical bugs stops would be incredible. Like brutalist architecture using concrete. But, not how the west does concrete in a cheap fashion, every bus stop was completely different. Usually with a tonne of curves. And not mass produced. Like someone really took a lot of effort. They believed in the future they thought they were making. permalink parent award report block reply SenorTrumper 1 points 5 days ago Turn on CCs. https://www.youtube.com/watch?v=8HZ4DnVfWYQ https://www.youtube.com/watch?v=t7kr7utvVEs&list=RDt7kr7utvVEs&start_radio=1 Those are Russian videos.  Watch closely. Every scene is a gem. permalink parent award report block reply KungPaoMcChicken 1 points 5 days ago Interesting... permalink parent award report block reply SenorTrumper 1 points 5 days ago Speaking of bus stops, have you watched the Russian epies on the Bald & Bankrupt channel on YT? permalink parent award report block reply\nKungPaoMcChicken 2 points 5 days ago I heard that there are some incredible USSR bus stops in some of these former soviet era nations. I imagine that travelling the world just to see all of these magical bugs stops would be incredible. Like brutalist architecture using concrete. But, not how the west does concrete in a cheap fashion, every bus stop was completely different. Usually with a tonne of curves. And not mass produced. Like someone really took a lot of effort. They believed in the future they thought they were making. permalink parent award report block reply SenorTrumper 1 points 5 days ago Turn on CCs. https://www.youtube.com/watch?v=8HZ4DnVfWYQ https://www.youtube.com/watch?v=t7kr7utvVEs&list=RDt7kr7utvVEs&start_radio=1 Those are Russian videos.  Watch closely. Every scene is a gem. permalink parent award report block reply KungPaoMcChicken 1 points 5 days ago Interesting... permalink parent award report block reply SenorTrumper 1 points 5 days ago Speaking of bus stops, have you watched the Russian epies on the Bald & Bankrupt channel on YT? permalink parent award report block reply\nSenorTrumper 1 points 5 days ago Turn on CCs. https://www.youtube.com/watch?v=8HZ4DnVfWYQ https://www.youtube.com/watch?v=t7kr7utvVEs&list=RDt7kr7utvVEs&start_radio=1 Those are Russian videos.  Watch closely. Every scene is a gem. permalink parent award report block reply KungPaoMcChicken 1 points 5 days ago Interesting... permalink parent award report block reply\nKungPaoMcChicken 1 points 5 days ago Interesting... permalink parent award report block reply\nSenorTrumper 1 points 5 days ago Speaking of bus stops, have you watched the Russian epies on the Bald & Bankrupt channel on YT? permalink parent award report block reply\nhenri_derelicte 4 points 6 days ago No mention of tariffs. How interesting… permalink award report block reply\nHantif 4 points 6 days ago Can we get them to build a few prisons? We're going to need some place to ship illegal alien criminals to. Sending a few thousand Antifa over there would be fitting, let them see the results of real socialism. permalink award report block reply RedStoneDeepState 3 points 6 days ago I'd rather live in Uzbekistan than Portland. permalink parent award report block reply\nRedStoneDeepState 3 points 6 days ago I'd rather live in Uzbekistan than Portland. permalink parent award report block reply\npanic_scam 4 points 6 days ago But Borat called them assholes :( permalink award report block reply\nTxiribiton 3 points 6 days ago ??? They don't have that money, it will be the other way, the US will purchase from them, that's why you don't see tariffs. Then there is another incognite, is the US trying to create another Ukraine 2.0 near Russia? permalink award report block reply\nFullyDilated 2 points 6 days ago asshole Uzbekistan! permalink award report block reply\nDrTar 2 points 5 days ago I bet Hillary's miffed she didn't get a taste of this action. permalink award report block reply\nWexit-Delecto 2 points 5 days ago TFW you're a leaf and Uzbeki-fuckin-stan has a deal before your country: :( permalink award report block reply\nPats5x 2 points 5 days ago Is that what maga has come to?  Trade deals with fucking Uzbekistan?  We're absolutely fucked. permalink award report block reply\nJoinTheDiscussion 2 points 6 days ago Doing his part to bring more sand people into the frey permalink award report block reply\nrugburnd 2 points 5 days ago Someone throw up the red hat and let Trump know of the plight of the working class. We can post up and prop up Wall Street but food and energy prices are too high. He is losing the MAGA base with AI and Rare earth materials. \"It's the economy stupid\".\nPeople are hurting. permalink award report block reply\nDRKMSTR 2 points 6 days ago Plz import food. Uzbek goodbek permalink award report block reply\nTheRedPilledArtist 1 points 6 days ago Based Uzbekis permalink award report block reply\nGoodvsEvil2 1 points 6 days ago Geographically Uzbekistan is only 1 country away from iran. permalink award report block reply RedStoneDeepState 2 points 6 days ago Turkmenistan is effectively North Korea. permalink parent award report block reply\nRedStoneDeepState 2 points 6 days ago Turkmenistan is effectively North Korea. permalink parent award report block reply\nRudeFrog 1 points 5 days ago What about a deal with the great country Kazakhstan, I trases you my wife and 3 other goats for Mercedes Benz! Is good deal she's very pretty.  Hey for real though all these foreign deals, are they creating American jobs? Or just making rich people richer? Kinda feels like this one is just selling off parts of the country permalink award report block reply\ntruthjusticetruth 1 points 5 days ago I don’t care. America has a judge problem and an elections problem. Work on that. permalink award report block reply\nPowhattan 1 points 6 days ago we slapping 3rd worlds with 9 inches of limp dick making them cough up cash HAHAHAHAAHHA permalink award report block reply\nmohel 1 points 5 days ago uzbeki .... beki .... beki ... stan? permalink award report block reply\nvongregormench 1 points 6 days ago That sounds like more than the total GDP of Uzbekistan. permalink award report block reply\nCruzControl 1 points 5 days ago Mandatory - https://media1.tenor.com/m/4-5dlQLi-HEAAAAd/uzbekistan-fuck.gif permalink award report block reply\nScot 1 points 5 days ago The best trade deal I could imagine would be with China - give them all of our democrats. permalink award report block reply\nPitfallHarry 1 points 6 days ago Dealing with Uzbekistan? Gross. permalink award report block reply\nYodaBannon 0 points 6 days ago cool beans permalink award report block reply\nMinn2000 -5 points 6 days ago \"Sorry Uzbekistan, I know I've been negotiating this trade deal with you for weeks if not months, but a couple state-level elections happened so now I'm gonna have to completely cut you off and ignore you and every other country for the rest of my term. Don't you know I'm literally not doing anything for the economy and lowering costs even though I literally announced a plan earlier today that would drastically lower the price of certain drugs, which objectively helps towards that?\" This is how some of you sound lately. permalink award report block reply Modernturnkey 8 points 6 days ago Costs have not been lowered on anything, and taxes have done nothing but increase. permalink parent award report block reply 1_Badcop 4 points 6 days ago Sorry America, we're not interested in doing shit about election integrity because, fuck America I guess. Hey, we've deported like a thousand illegals, way less than Obama, but like I said, fuck America. Oh! By the way, your health insurance is going up 137% (mine really did, I got the letter today).  You all are going to turn out in 2026 and vote, right? So I can continue to ignore doing anything that actually helps anybody with a net worth of less than 100 million, right? This is how you sound right now. permalink parent award report block reply\nModernturnkey 8 points 6 days ago Costs have not been lowered on anything, and taxes have done nothing but increase. permalink parent award report block reply\n1_Badcop 4 points 6 days ago Sorry America, we're not interested in doing shit about election integrity because, fuck America I guess. Hey, we've deported like a thousand illegals, way less than Obama, but like I said, fuck America. Oh! By the way, your health insurance is going up 137% (mine really did, I got the letter today).  You all are going to turn out in 2026 and vote, right? So I can continue to ignore doing anything that actually helps anybody with a net worth of less than 100 million, right? This is how you sound right now. permalink parent award report block reply"}