{"id": "1ARK58znb5", "contents": "704 Elon just sliced and diced the dude. posted 4 days ago by SomecatsareMAGA 51 comments award share download report block\n51 comments Sort by Top Top New Worst Old Save thunderpussy 45 points 4 days ago Ouch. That's gonna leave a mark.... permalink award report block reply GoldenEarz 33 points 4 days ago Nah. He's too stupid to understand what Elon said. He'll go on believing he is smarter than Elon. permalink parent award report block reply thunderpussy 18 points 4 days ago Really. The self confidence levels of the truly stupid, never cease to amaze me.... permalink parent award report block reply bigdickhangsright 12 points 4 days ago A Maker's Mark permalink parent award report block reply Elchitodote 3 points 4 days ago Mmm delicious permalink parent award report block reply thunderpussy 2 points 4 days ago HA! permalink parent award report block reply Saltyminer11 1 points 3 days ago Yep permalink parent award report block reply mikethemarine 3 points 4 days ago so the company would have to get to $9 trillion for Elon to be paid $1 trillion, he would get 12% when it hits $2 trillion which is $240 Billion NOT a Trillion like the media and Democrats say permalink parent award report block reply Standingoak 2 points 4 days ago Not until he lands ...back in Mexico permalink parent award report block reply Shitsbrokeyo 1 points 3 days ago And that's just Tesla not the other successful companies he has founded. Each rewriting tech for their given industry. permalink parent award report block reply load 2 more comments... Choppermagic 28 points 4 days ago I love the fact that the delaware judge tried to burn Elon but only made her state broke and Elon even richer permalink award report block reply NomadicKrow2 6 points 4 days ago The guy who brought the suit barely had any stock, and didn't vote in the shareholders meetings. Hilarious. permalink parent award report block reply HeatherSwanson 16 points 4 days ago Politicians are parasitic leeches. And how do you get rid of parasites? permalink award report block reply Filo76 16 points 4 days ago Ivermectin permalink parent award report block reply Knowbody 13 points 4 days ago Must be why they're so afraid of it. permalink parent award report block reply redinmn 14 points 4 days ago He is what Ayn Rand would call a Moocher. permalink award report block reply NomadicKrow2 8 points 4 days ago He's what President Commacho would call \"a fucking cock sucking faggot.\" permalink parent award report block reply DrVSGGEOTUSPhD 9 points 4 days ago He went full Atlas Shrugged permalink award report block reply Standingoak 4 points 4 days ago Would appear that Trump is the one Shrugging the World off our backs. While Elon just creates the future. permalink parent award report block reply keeman 3 points 4 days ago Would really prefer if Trump would actually drain some swamp instead of tarting around collecting peace trophies. permalink parent award report block reply Standingoak 1 points 3 days ago Those are not Trophys they are are the tools that guarantee the swamp will not been stopped up mid- drain.  No use in starting if you are not certain you can finish.   Ever build an 80 story Building ? The Chynee have a couple of 1/2 finished towers started in 2015 and stopped in 2019. I prefer he succeed. permalink parent award report block reply keeman 1 points 4 days ago Frankly, I am hoping for a Ragnar Danneskjöld at this point. permalink parent award report block reply billybaldwin2 8 points 4 days ago I read through the requirements for Tesla to pay out Elon over like 10 years. They are EXTREMELY high requirements. Dare I say impossible, even for Tesla and Elon. 25% of their vote rejected the possibility. permalink award report block reply zooty 7 points 4 days ago Musk doesn't seem to be a particularly big spender either so most of that will be reinvested back into the economy. permalink parent award report block reply keeman 2 points 4 days ago Don't care.  That is between Musk and his shareholders.  The road to communism is laid by giving credence to shit like this. permalink parent award report block reply HeavyMetalPatriot 4 points 4 days ago Deport all libtards. permalink award report block reply keeman 2 points 4 days ago Progressives.  That is the word you were looking for.  Liberals want small government.  Progressives want to solve all problems by using government.  Different. permalink parent award report block reply Maxmax 4 points 4 days ago Fire. permalink award report block reply dontdrinksoy 3 points 4 days ago I wanna see the response. Oh, no response, because he got smoked. LOL. permalink award report block reply EvJohn 3 points 4 days ago Damn permalink award report block reply jonnyuno 2 points 4 days ago Report this! This dude will be on suicide watch. permalink award report block reply CleanUpPhillyTrump24 2 points 4 days ago Who knew that Elon Musk would be: John Galt\nDagny Taggart\nFrancisco d'Anconia\nHenry Rearden\nJames Taggart\nWesley Mouch\nHoward Roark and more of Ayn Rand's protagonists, all rolled up into one. permalink award report block reply dres3 2 points 4 days ago Thank you to the person that allowed him to formulate this thought by blocking Ketamine usage. permalink award report block reply TNgirl4Trump 2 points 4 days ago https://x.com/elonmusk/status/1986833400171577503?s=46 permalink award report block reply ReleasetheList 1 points 4 days ago When you realize congress is full of bottom tier law students that would fail at making a career being ambulance chasers, you realize why the retards have no choice but to try and make their wealth through corruption. permalink award report block reply NomadicKrow2 1 points 4 days ago Bro, none of them would be competitive for a door greeter job at Walmart. permalink parent award report block reply BillyBobBrewer 1 points 4 days ago Fuck the Jeet loving African American. Elon is a transhumanist piece of shit. permalink award report block reply Saltyminer11 1 points 3 days ago Bitch slapped permalink award report block reply utfanx2 1 points 4 days ago Great deal for Elon. $2T of fiat money is soon to be the price of a roll of toilet paper. permalink award report block reply TGNX 1 points 4 days ago Hello, police? I'd like to report a murder... permalink award report block reply samgab 1 points 4 days ago That hypocrite \"Roland\" is a senator, right? He's not struggling to pay for groceries, and never has. permalink award report block reply GreyKnight 1 points 4 days ago I know which election i would trust more… permalink award report block reply Neversurrender123 -3 points 4 days ago The Elon simping on this sub is still out of control I see. He owned this moron here but stop simping, Elon is still a piece of shit. permalink award report block reply Surfsup -16 points 4 days ago Elon took. It's how he started. Now that he's made it off the backs of America's taxpayer he's playing MAGA. He's such a tool. What he says is true, which is what makes it so ironic. Get chipped. permalink award report block reply happyfave 5 points 4 days ago Yawn permalink parent award report block reply NomadicKrow2 2 points 4 days ago lmao bro, he helped start Paypal and sold his share, which is how he got rich. He could have bought a house in the Hamptons or wherever rich people go, had a train of supermodels stopping by to fuck him, and lived his life like that. But the dude kept grinding. permalink parent award report block reply Surfsup 0 points 3 days ago Just because he had money does not equate to him not grifting the taxpayer. Your response is useless. Look into it permalink parent award report block reply NomadicKrow2 1 points 3 days ago His companies have provided value for the tax money they've been given. You want to talk about Bezos and Blue Origin? Im listening. Zero value in that company but it gets corporate welfare anyway. permalink parent award report block reply BillyBobBrewer 0 points 4 days ago He's still a Jeet loving H1B supporting transhumanist. permalink parent award report block reply Standingoak 4 points 4 days ago He's still... our ... Jeet loving H1B supporting transhumanist. permalink parent award report block reply\nthunderpussy 45 points 4 days ago Ouch. That's gonna leave a mark.... permalink award report block reply GoldenEarz 33 points 4 days ago Nah. He's too stupid to understand what Elon said. He'll go on believing he is smarter than Elon. permalink parent award report block reply thunderpussy 18 points 4 days ago Really. The self confidence levels of the truly stupid, never cease to amaze me.... permalink parent award report block reply bigdickhangsright 12 points 4 days ago A Maker's Mark permalink parent award report block reply Elchitodote 3 points 4 days ago Mmm delicious permalink parent award report block reply thunderpussy 2 points 4 days ago HA! permalink parent award report block reply Saltyminer11 1 points 3 days ago Yep permalink parent award report block reply mikethemarine 3 points 4 days ago so the company would have to get to $9 trillion for Elon to be paid $1 trillion, he would get 12% when it hits $2 trillion which is $240 Billion NOT a Trillion like the media and Democrats say permalink parent award report block reply Standingoak 2 points 4 days ago Not until he lands ...back in Mexico permalink parent award report block reply Shitsbrokeyo 1 points 3 days ago And that's just Tesla not the other successful companies he has founded. Each rewriting tech for their given industry. permalink parent award report block reply load 2 more comments...\nGoldenEarz 33 points 4 days ago Nah. He's too stupid to understand what Elon said. He'll go on believing he is smarter than Elon. permalink parent award report block reply thunderpussy 18 points 4 days ago Really. The self confidence levels of the truly stupid, never cease to amaze me.... permalink parent award report block reply\nthunderpussy 18 points 4 days ago Really. The self confidence levels of the truly stupid, never cease to amaze me.... permalink parent award report block reply\nbigdickhangsright 12 points 4 days ago A Maker's Mark permalink parent award report block reply Elchitodote 3 points 4 days ago Mmm delicious permalink parent award report block reply thunderpussy 2 points 4 days ago HA! permalink parent award report block reply Saltyminer11 1 points 3 days ago Yep permalink parent award report block reply\nElchitodote 3 points 4 days ago Mmm delicious permalink parent award report block reply\nthunderpussy 2 points 4 days ago HA! permalink parent award report block reply\nSaltyminer11 1 points 3 days ago Yep permalink parent award report block reply\nmikethemarine 3 points 4 days ago so the company would have to get to $9 trillion for Elon to be paid $1 trillion, he would get 12% when it hits $2 trillion which is $240 Billion NOT a Trillion like the media and Democrats say permalink parent award report block reply\nStandingoak 2 points 4 days ago Not until he lands ...back in Mexico permalink parent award report block reply\nShitsbrokeyo 1 points 3 days ago And that's just Tesla not the other successful companies he has founded. Each rewriting tech for their given industry. permalink parent award report block reply\nChoppermagic 28 points 4 days ago I love the fact that the delaware judge tried to burn Elon but only made her state broke and Elon even richer permalink award report block reply NomadicKrow2 6 points 4 days ago The guy who brought the suit barely had any stock, and didn't vote in the shareholders meetings. Hilarious. permalink parent award report block reply\nNomadicKrow2 6 points 4 days ago The guy who brought the suit barely had any stock, and didn't vote in the shareholders meetings. Hilarious. permalink parent award report block reply\nHeatherSwanson 16 points 4 days ago Politicians are parasitic leeches. And how do you get rid of parasites? permalink award report block reply Filo76 16 points 4 days ago Ivermectin permalink parent award report block reply Knowbody 13 points 4 days ago Must be why they're so afraid of it. permalink parent award report block reply\nFilo76 16 points 4 days ago Ivermectin permalink parent award report block reply Knowbody 13 points 4 days ago Must be why they're so afraid of it. permalink parent award report block reply\nKnowbody 13 points 4 days ago Must be why they're so afraid of it. permalink parent award report block reply\nredinmn 14 points 4 days ago He is what Ayn Rand would call a Moocher. permalink award report block reply NomadicKrow2 8 points 4 days ago He's what President Commacho would call \"a fucking cock sucking faggot.\" permalink parent award report block reply\nNomadicKrow2 8 points 4 days ago He's what President Commacho would call \"a fucking cock sucking faggot.\" permalink parent award report block reply\nDrVSGGEOTUSPhD 9 points 4 days ago He went full Atlas Shrugged permalink award report block reply Standingoak 4 points 4 days ago Would appear that Trump is the one Shrugging the World off our backs. While Elon just creates the future. permalink parent award report block reply keeman 3 points 4 days ago Would really prefer if Trump would actually drain some swamp instead of tarting around collecting peace trophies. permalink parent award report block reply Standingoak 1 points 3 days ago Those are not Trophys they are are the tools that guarantee the swamp will not been stopped up mid- drain.  No use in starting if you are not certain you can finish.   Ever build an 80 story Building ? The Chynee have a couple of 1/2 finished towers started in 2015 and stopped in 2019. I prefer he succeed. permalink parent award report block reply keeman 1 points 4 days ago Frankly, I am hoping for a Ragnar Danneskjöld at this point. permalink parent award report block reply\nStandingoak 4 points 4 days ago Would appear that Trump is the one Shrugging the World off our backs. While Elon just creates the future. permalink parent award report block reply keeman 3 points 4 days ago Would really prefer if Trump would actually drain some swamp instead of tarting around collecting peace trophies. permalink parent award report block reply Standingoak 1 points 3 days ago Those are not Trophys they are are the tools that guarantee the swamp will not been stopped up mid- drain.  No use in starting if you are not certain you can finish.   Ever build an 80 story Building ? The Chynee have a couple of 1/2 finished towers started in 2015 and stopped in 2019. I prefer he succeed. permalink parent award report block reply\nkeeman 3 points 4 days ago Would really prefer if Trump would actually drain some swamp instead of tarting around collecting peace trophies. permalink parent award report block reply Standingoak 1 points 3 days ago Those are not Trophys they are are the tools that guarantee the swamp will not been stopped up mid- drain.  No use in starting if you are not certain you can finish.   Ever build an 80 story Building ? The Chynee have a couple of 1/2 finished towers started in 2015 and stopped in 2019. I prefer he succeed. permalink parent award report block reply\nStandingoak 1 points 3 days ago Those are not Trophys they are are the tools that guarantee the swamp will not been stopped up mid- drain.  No use in starting if you are not certain you can finish.   Ever build an 80 story Building ? The Chynee have a couple of 1/2 finished towers started in 2015 and stopped in 2019. I prefer he succeed. permalink parent award report block reply\nkeeman 1 points 4 days ago Frankly, I am hoping for a Ragnar Danneskjöld at this point. permalink parent award report block reply\nbillybaldwin2 8 points 4 days ago I read through the requirements for Tesla to pay out Elon over like 10 years. They are EXTREMELY high requirements. Dare I say impossible, even for Tesla and Elon. 25% of their vote rejected the possibility. permalink award report block reply zooty 7 points 4 days ago Musk doesn't seem to be a particularly big spender either so most of that will be reinvested back into the economy. permalink parent award report block reply keeman 2 points 4 days ago Don't care.  That is between Musk and his shareholders.  The road to communism is laid by giving credence to shit like this. permalink parent award report block reply\nzooty 7 points 4 days ago Musk doesn't seem to be a particularly big spender either so most of that will be reinvested back into the economy. permalink parent award report block reply\nkeeman 2 points 4 days ago Don't care.  That is between Musk and his shareholders.  The road to communism is laid by giving credence to shit like this. permalink parent award report block reply\nHeavyMetalPatriot 4 points 4 days ago Deport all libtards. permalink award report block reply keeman 2 points 4 days ago Progressives.  That is the word you were looking for.  Liberals want small government.  Progressives want to solve all problems by using government.  Different. permalink parent award report block reply\nkeeman 2 points 4 days ago Progressives.  That is the word you were looking for.  Liberals want small government.  Progressives want to solve all problems by using government.  Different. permalink parent award report block reply\nMaxmax 4 points 4 days ago Fire. permalink award report block reply\ndontdrinksoy 3 points 4 days ago I wanna see the response. Oh, no response, because he got smoked. LOL. permalink award report block reply\nEvJohn 3 points 4 days ago Damn permalink award report block reply\njonnyuno 2 points 4 days ago Report this! This dude will be on suicide watch. permalink award report block reply\nCleanUpPhillyTrump24 2 points 4 days ago Who knew that Elon Musk would be: John Galt\nDagny Taggart\nFrancisco d'Anconia\nHenry Rearden\nJames Taggart\nWesley Mouch\nHoward Roark and more of Ayn Rand's protagonists, all rolled up into one. permalink award report block reply\ndres3 2 points 4 days ago Thank you to the person that allowed him to formulate this thought by blocking Ketamine usage. permalink award report block reply\nTNgirl4Trump 2 points 4 days ago https://x.com/elonmusk/status/1986833400171577503?s=46 permalink award report block reply\nReleasetheList 1 points 4 days ago When you realize congress is full of bottom tier law students that would fail at making a career being ambulance chasers, you realize why the retards have no choice but to try and make their wealth through corruption. permalink award report block reply NomadicKrow2 1 points 4 days ago Bro, none of them would be competitive for a door greeter job at Walmart. permalink parent award report block reply\nNomadicKrow2 1 points 4 days ago Bro, none of them would be competitive for a door greeter job at Walmart. permalink parent award report block reply\nBillyBobBrewer 1 points 4 days ago Fuck the Jeet loving African American. Elon is a transhumanist piece of shit. permalink award report block reply\nSaltyminer11 1 points 3 days ago Bitch slapped permalink award report block reply\nutfanx2 1 points 4 days ago Great deal for Elon. $2T of fiat money is soon to be the price of a roll of toilet paper. permalink award report block reply\nTGNX 1 points 4 days ago Hello, police? I'd like to report a murder... permalink award report block reply\nsamgab 1 points 4 days ago That hypocrite \"Roland\" is a senator, right? He's not struggling to pay for groceries, and never has. permalink award report block reply\nGreyKnight 1 points 4 days ago I know which election i would trust more… permalink award report block reply\nNeversurrender123 -3 points 4 days ago The Elon simping on this sub is still out of control I see. He owned this moron here but stop simping, Elon is still a piece of shit. permalink award report block reply\nSurfsup -16 points 4 days ago Elon took. It's how he started. Now that he's made it off the backs of America's taxpayer he's playing MAGA. He's such a tool. What he says is true, which is what makes it so ironic. Get chipped. permalink award report block reply happyfave 5 points 4 days ago Yawn permalink parent award report block reply NomadicKrow2 2 points 4 days ago lmao bro, he helped start Paypal and sold his share, which is how he got rich. He could have bought a house in the Hamptons or wherever rich people go, had a train of supermodels stopping by to fuck him, and lived his life like that. But the dude kept grinding. permalink parent award report block reply Surfsup 0 points 3 days ago Just because he had money does not equate to him not grifting the taxpayer. Your response is useless. Look into it permalink parent award report block reply NomadicKrow2 1 points 3 days ago His companies have provided value for the tax money they've been given. You want to talk about Bezos and Blue Origin? Im listening. Zero value in that company but it gets corporate welfare anyway. permalink parent award report block reply BillyBobBrewer 0 points 4 days ago He's still a Jeet loving H1B supporting transhumanist. permalink parent award report block reply Standingoak 4 points 4 days ago He's still... our ... Jeet loving H1B supporting transhumanist. permalink parent award report block reply\nhappyfave 5 points 4 days ago Yawn permalink parent award report block reply\nNomadicKrow2 2 points 4 days ago lmao bro, he helped start Paypal and sold his share, which is how he got rich. He could have bought a house in the Hamptons or wherever rich people go, had a train of supermodels stopping by to fuck him, and lived his life like that. But the dude kept grinding. permalink parent award report block reply Surfsup 0 points 3 days ago Just because he had money does not equate to him not grifting the taxpayer. Your response is useless. Look into it permalink parent award report block reply NomadicKrow2 1 points 3 days ago His companies have provided value for the tax money they've been given. You want to talk about Bezos and Blue Origin? Im listening. Zero value in that company but it gets corporate welfare anyway. permalink parent award report block reply\nSurfsup 0 points 3 days ago Just because he had money does not equate to him not grifting the taxpayer. Your response is useless. Look into it permalink parent award report block reply NomadicKrow2 1 points 3 days ago His companies have provided value for the tax money they've been given. You want to talk about Bezos and Blue Origin? Im listening. Zero value in that company but it gets corporate welfare anyway. permalink parent award report block reply\nNomadicKrow2 1 points 3 days ago His companies have provided value for the tax money they've been given. You want to talk about Bezos and Blue Origin? Im listening. Zero value in that company but it gets corporate welfare anyway. permalink parent award report block reply\nBillyBobBrewer 0 points 4 days ago He's still a Jeet loving H1B supporting transhumanist. permalink parent award report block reply Standingoak 4 points 4 days ago He's still... our ... Jeet loving H1B supporting transhumanist. permalink parent award report block reply\nStandingoak 4 points 4 days ago He's still... our ... Jeet loving H1B supporting transhumanist. permalink parent award report block reply"}