{"id": "1ARK55bzkH", "contents": "533 It was so interesting yesterday when our Great Senator from Louisiana, John Kennedy, introduced a Bill in an attempt to withhold Members of Congress from getting paid, and Rand Paul, who never votes for anything, tried to stop it, because he wanted to be paid! TRUMP  TRUTH posted 5 days ago by I-am-Orlando PRO 31 comments award share download report block\n31 comments Sort by Top Top New Worst Old Save jdemarco2014 28 points 5 days ago Rand Paul is a aipac stooge permalink award report block reply possibletower 14 points 5 days ago He's also a Democrat in RINO clothing permalink parent award report block reply Maga0351 4 points 5 days ago Is he? He’s not ok AIPAC tracker either way. https://www.trackaipac.com/states/kentucky?rq=Kentucky%20 permalink parent award report block reply DudeNoOne 3 points 5 days ago Was going to ask whats wrong with Rand these days but this answers most of it. permalink parent award report block reply Threaper666 3 points 5 days ago I can't stand Rand Paul.  He is a contrarian.  Fuck anyone who defends him. permalink parent award report block reply MEGAMAGAULTRA 1 points 4 days ago He has turned into a massive public disappointment these past 4-5 years permalink parent award report block reply load 1 more comments... anotherrandomname 18 points 5 days ago If only there was some way to put Ron Paul's brain inside Rand's body or something. What a fucking disappointment that jackass is. permalink award report block reply heightnoise 11 points 5 days ago Attorney here. It's because Rand Paul strictly interprets the Constitution and believes the 27th Amendment does not allow for the affecting of Congressional salaries by law alone. Only by amendment. As a strict Textualist myself, I actually agree with his interpretation. He was legally (though imo not morally) correct in voting against it. That said, he needs to feel the temperature in the room and not die on stupid hills like his own paycheck. Here's the text of the 27th Amendment: No law, varying the compensation for the services of the Senators and Representatives, shall take effect, until an election of Representatives shall have intervened. permalink award report block reply BobbyTables18c 1 points 4 days ago I am not a Biologist nor Constitutional scholar. It sounds like the pay withholding cannot affect current members. Fine. Pass the law now. Might as well do some term limits while you are in there. permalink parent award report block reply heightnoise 1 points 4 days ago By my interpretation, they could pass a law punishing any senators that did not vote to open the govt who win as incumbents in their elections next year (idk how many Dems there are up at bat but that would be Constitutionally sound). Frankly, that amendment needs to be repealed via an Article 5 or something, if we are actually going to fix this damn mess. permalink parent award report block reply DJT4MoreYears 1 points 4 days ago There is no law. There's just no more money. permalink parent award report block reply eddieblasphemy 1 points 4 days ago libertarians are giant pussies.who only use  \"values\" to hide behind. isnt he supposed to be arresting fauci or something? permalink parent award report block reply heightnoise 1 points 4 days ago libertarians are giant pussies.who only use \"values\" to hide behind. Yeah, the same values you conservatives are perfectly willing to shit on when they become inconvenient obstacles to your goals. Even when I agree with the conservatives (as I often do, at least 85-90% of the time), I still will not stand for disobedience of our laws in the name of efficiency or \"doing the right thing.\" No, the \"right thing\" is to do the right thing while ALSO being legally. Don't like it? Change the law. Don't like how we vote? Don't proffer.shitty laws that are unconstitutional on their face. I heard Kennedy's speech on the floor, claiming his bill does not offend the 27th Amendment, and after reading the text I think he's flat out wrong. isnt he supposed to be arresting fauci or something? He can't arrest him and you know it, quite blowing smoke. All he can do is refer him for prosecution. He's done all he legally can, if youre pissed about it then blame the actual person responsible for Fauci being uncharged: The bimbo in the AG office. https://www.hsgac.senate.gov/media/reps/senator-rand-paul-re-refers-dr-anthony-fauci-to-the-department-of-justice/ permalink parent award report block reply HaSumBro 1 points 5 days ago That why I don't vote for lawyers, they're evil and justify evil by quoting the law. permalink parent award report block reply heightnoise 1 points 4 days ago You sound like someone who's ex-wife cleaned him out in the divorce. permalink parent award report block reply HaSumBro 1 points 4 days ago Um no...\nOur country has been run by lawyers for far too long that's why... And you sound like a redditor... permalink parent award report block reply ScholarX 1 points 4 days ago Thank you for posting the actual text. But my interpretation is that withholding payment does not affect the statutory compensation that is due;  only the time elapsed for which the compensation is received.  Furthermore, this action is not just specific to Congress, but to all Federal employees. So I beg to differ, but I believe that the 27th Amendment has not been violated with this proposal. permalink parent award report block reply Trump454748 8 points 5 days ago Hey Rand, they can still insider trade and take “campaign donations” to make ends meet, so what’s the big deal? permalink award report block reply jonnyuno 7 points 5 days ago Where's the ones on here defending Rand? I knock him last time and people were all over me. Same with Massie. permalink award report block reply America_No_1 5 points 5 days ago There's a reason that fuck didn't get called up to the cabinet permalink award report block reply Nellie_the_Beaut 1 points 4 days ago Perhaps you’ve hit on the reason he’s acting like such a bitter, petulant ass towards Trump now at every turn.  Pissy Randy didn’t get an offer to join the cabinet. permalink parent award report block reply I-am-Orlando OP PRO 4 points 5 days ago Link https://truthsocial.com/@realDonaldTrump/115510780457859130 permalink award report block reply hughjasske69 3 points 5 days ago Brand is a fag permalink award report block reply possibletower 5 points 5 days ago Rand is the very epitome of a RINO. Thank you Trump for exposing his ass permalink parent award report block reply Bboop 2 points 5 days ago Just don’t pay those who are out or voting to continue the filibuster. permalink award report block reply possibletower 12 points 5 days ago Rand votes with the Democrats on everything. He even voted for Pedo Joe on J6 🤣 permalink parent award report block reply Retardloserimsogay 6 points 5 days ago That apple fell so far from the tree. permalink parent award report block reply yepyep 1 points 4 days ago If they had to live like us it would be fixed. permalink award report block reply Nellie_the_Beaut 1 points 4 days ago Mitch McConnell, Thomas Massie, Rand Paul.  Real nice, Kentucky. Real nice. permalink award report block reply Quidnunc 1 points 5 days ago He's pissed because DOGE stole his thunder. permalink award report block reply lifeisahologram 0 points 5 days ago Rand is a fucking retard sometimes permalink award report block reply\njdemarco2014 28 points 5 days ago Rand Paul is a aipac stooge permalink award report block reply possibletower 14 points 5 days ago He's also a Democrat in RINO clothing permalink parent award report block reply Maga0351 4 points 5 days ago Is he? He’s not ok AIPAC tracker either way. https://www.trackaipac.com/states/kentucky?rq=Kentucky%20 permalink parent award report block reply DudeNoOne 3 points 5 days ago Was going to ask whats wrong with Rand these days but this answers most of it. permalink parent award report block reply Threaper666 3 points 5 days ago I can't stand Rand Paul.  He is a contrarian.  Fuck anyone who defends him. permalink parent award report block reply MEGAMAGAULTRA 1 points 4 days ago He has turned into a massive public disappointment these past 4-5 years permalink parent award report block reply load 1 more comments...\npossibletower 14 points 5 days ago He's also a Democrat in RINO clothing permalink parent award report block reply\nMaga0351 4 points 5 days ago Is he? He’s not ok AIPAC tracker either way. https://www.trackaipac.com/states/kentucky?rq=Kentucky%20 permalink parent award report block reply\nDudeNoOne 3 points 5 days ago Was going to ask whats wrong with Rand these days but this answers most of it. permalink parent award report block reply\nThreaper666 3 points 5 days ago I can't stand Rand Paul.  He is a contrarian.  Fuck anyone who defends him. permalink parent award report block reply\nMEGAMAGAULTRA 1 points 4 days ago He has turned into a massive public disappointment these past 4-5 years permalink parent award report block reply\nanotherrandomname 18 points 5 days ago If only there was some way to put Ron Paul's brain inside Rand's body or something. What a fucking disappointment that jackass is. permalink award report block reply\nheightnoise 11 points 5 days ago Attorney here. It's because Rand Paul strictly interprets the Constitution and believes the 27th Amendment does not allow for the affecting of Congressional salaries by law alone. Only by amendment. As a strict Textualist myself, I actually agree with his interpretation. He was legally (though imo not morally) correct in voting against it. That said, he needs to feel the temperature in the room and not die on stupid hills like his own paycheck. Here's the text of the 27th Amendment: No law, varying the compensation for the services of the Senators and Representatives, shall take effect, until an election of Representatives shall have intervened. permalink award report block reply BobbyTables18c 1 points 4 days ago I am not a Biologist nor Constitutional scholar. It sounds like the pay withholding cannot affect current members. Fine. Pass the law now. Might as well do some term limits while you are in there. permalink parent award report block reply heightnoise 1 points 4 days ago By my interpretation, they could pass a law punishing any senators that did not vote to open the govt who win as incumbents in their elections next year (idk how many Dems there are up at bat but that would be Constitutionally sound). Frankly, that amendment needs to be repealed via an Article 5 or something, if we are actually going to fix this damn mess. permalink parent award report block reply DJT4MoreYears 1 points 4 days ago There is no law. There's just no more money. permalink parent award report block reply eddieblasphemy 1 points 4 days ago libertarians are giant pussies.who only use  \"values\" to hide behind. isnt he supposed to be arresting fauci or something? permalink parent award report block reply heightnoise 1 points 4 days ago libertarians are giant pussies.who only use \"values\" to hide behind. Yeah, the same values you conservatives are perfectly willing to shit on when they become inconvenient obstacles to your goals. Even when I agree with the conservatives (as I often do, at least 85-90% of the time), I still will not stand for disobedience of our laws in the name of efficiency or \"doing the right thing.\" No, the \"right thing\" is to do the right thing while ALSO being legally. Don't like it? Change the law. Don't like how we vote? Don't proffer.shitty laws that are unconstitutional on their face. I heard Kennedy's speech on the floor, claiming his bill does not offend the 27th Amendment, and after reading the text I think he's flat out wrong. isnt he supposed to be arresting fauci or something? He can't arrest him and you know it, quite blowing smoke. All he can do is refer him for prosecution. He's done all he legally can, if youre pissed about it then blame the actual person responsible for Fauci being uncharged: The bimbo in the AG office. https://www.hsgac.senate.gov/media/reps/senator-rand-paul-re-refers-dr-anthony-fauci-to-the-department-of-justice/ permalink parent award report block reply HaSumBro 1 points 5 days ago That why I don't vote for lawyers, they're evil and justify evil by quoting the law. permalink parent award report block reply heightnoise 1 points 4 days ago You sound like someone who's ex-wife cleaned him out in the divorce. permalink parent award report block reply HaSumBro 1 points 4 days ago Um no...\nOur country has been run by lawyers for far too long that's why... And you sound like a redditor... permalink parent award report block reply ScholarX 1 points 4 days ago Thank you for posting the actual text. But my interpretation is that withholding payment does not affect the statutory compensation that is due;  only the time elapsed for which the compensation is received.  Furthermore, this action is not just specific to Congress, but to all Federal employees. So I beg to differ, but I believe that the 27th Amendment has not been violated with this proposal. permalink parent award report block reply\nBobbyTables18c 1 points 4 days ago I am not a Biologist nor Constitutional scholar. It sounds like the pay withholding cannot affect current members. Fine. Pass the law now. Might as well do some term limits while you are in there. permalink parent award report block reply heightnoise 1 points 4 days ago By my interpretation, they could pass a law punishing any senators that did not vote to open the govt who win as incumbents in their elections next year (idk how many Dems there are up at bat but that would be Constitutionally sound). Frankly, that amendment needs to be repealed via an Article 5 or something, if we are actually going to fix this damn mess. permalink parent award report block reply\nheightnoise 1 points 4 days ago By my interpretation, they could pass a law punishing any senators that did not vote to open the govt who win as incumbents in their elections next year (idk how many Dems there are up at bat but that would be Constitutionally sound). Frankly, that amendment needs to be repealed via an Article 5 or something, if we are actually going to fix this damn mess. permalink parent award report block reply\nDJT4MoreYears 1 points 4 days ago There is no law. There's just no more money. permalink parent award report block reply\neddieblasphemy 1 points 4 days ago libertarians are giant pussies.who only use  \"values\" to hide behind. isnt he supposed to be arresting fauci or something? permalink parent award report block reply heightnoise 1 points 4 days ago libertarians are giant pussies.who only use \"values\" to hide behind. Yeah, the same values you conservatives are perfectly willing to shit on when they become inconvenient obstacles to your goals. Even when I agree with the conservatives (as I often do, at least 85-90% of the time), I still will not stand for disobedience of our laws in the name of efficiency or \"doing the right thing.\" No, the \"right thing\" is to do the right thing while ALSO being legally. Don't like it? Change the law. Don't like how we vote? Don't proffer.shitty laws that are unconstitutional on their face. I heard Kennedy's speech on the floor, claiming his bill does not offend the 27th Amendment, and after reading the text I think he's flat out wrong. isnt he supposed to be arresting fauci or something? He can't arrest him and you know it, quite blowing smoke. All he can do is refer him for prosecution. He's done all he legally can, if youre pissed about it then blame the actual person responsible for Fauci being uncharged: The bimbo in the AG office. https://www.hsgac.senate.gov/media/reps/senator-rand-paul-re-refers-dr-anthony-fauci-to-the-department-of-justice/ permalink parent award report block reply\nheightnoise 1 points 4 days ago libertarians are giant pussies.who only use \"values\" to hide behind. Yeah, the same values you conservatives are perfectly willing to shit on when they become inconvenient obstacles to your goals. Even when I agree with the conservatives (as I often do, at least 85-90% of the time), I still will not stand for disobedience of our laws in the name of efficiency or \"doing the right thing.\" No, the \"right thing\" is to do the right thing while ALSO being legally. Don't like it? Change the law. Don't like how we vote? Don't proffer.shitty laws that are unconstitutional on their face. I heard Kennedy's speech on the floor, claiming his bill does not offend the 27th Amendment, and after reading the text I think he's flat out wrong. isnt he supposed to be arresting fauci or something? He can't arrest him and you know it, quite blowing smoke. All he can do is refer him for prosecution. He's done all he legally can, if youre pissed about it then blame the actual person responsible for Fauci being uncharged: The bimbo in the AG office. https://www.hsgac.senate.gov/media/reps/senator-rand-paul-re-refers-dr-anthony-fauci-to-the-department-of-justice/ permalink parent award report block reply\nHaSumBro 1 points 5 days ago That why I don't vote for lawyers, they're evil and justify evil by quoting the law. permalink parent award report block reply heightnoise 1 points 4 days ago You sound like someone who's ex-wife cleaned him out in the divorce. permalink parent award report block reply HaSumBro 1 points 4 days ago Um no...\nOur country has been run by lawyers for far too long that's why... And you sound like a redditor... permalink parent award report block reply\nheightnoise 1 points 4 days ago You sound like someone who's ex-wife cleaned him out in the divorce. permalink parent award report block reply HaSumBro 1 points 4 days ago Um no...\nOur country has been run by lawyers for far too long that's why... And you sound like a redditor... permalink parent award report block reply\nHaSumBro 1 points 4 days ago Um no...\nOur country has been run by lawyers for far too long that's why... And you sound like a redditor... permalink parent award report block reply\nScholarX 1 points 4 days ago Thank you for posting the actual text. But my interpretation is that withholding payment does not affect the statutory compensation that is due;  only the time elapsed for which the compensation is received.  Furthermore, this action is not just specific to Congress, but to all Federal employees. So I beg to differ, but I believe that the 27th Amendment has not been violated with this proposal. permalink parent award report block reply\nTrump454748 8 points 5 days ago Hey Rand, they can still insider trade and take “campaign donations” to make ends meet, so what’s the big deal? permalink award report block reply\njonnyuno 7 points 5 days ago Where's the ones on here defending Rand? I knock him last time and people were all over me. Same with Massie. permalink award report block reply\nAmerica_No_1 5 points 5 days ago There's a reason that fuck didn't get called up to the cabinet permalink award report block reply Nellie_the_Beaut 1 points 4 days ago Perhaps you’ve hit on the reason he’s acting like such a bitter, petulant ass towards Trump now at every turn.  Pissy Randy didn’t get an offer to join the cabinet. permalink parent award report block reply\nNellie_the_Beaut 1 points 4 days ago Perhaps you’ve hit on the reason he’s acting like such a bitter, petulant ass towards Trump now at every turn.  Pissy Randy didn’t get an offer to join the cabinet. permalink parent award report block reply\nI-am-Orlando OP PRO 4 points 5 days ago Link https://truthsocial.com/@realDonaldTrump/115510780457859130 permalink award report block reply\nhughjasske69 3 points 5 days ago Brand is a fag permalink award report block reply possibletower 5 points 5 days ago Rand is the very epitome of a RINO. Thank you Trump for exposing his ass permalink parent award report block reply\npossibletower 5 points 5 days ago Rand is the very epitome of a RINO. Thank you Trump for exposing his ass permalink parent award report block reply\nBboop 2 points 5 days ago Just don’t pay those who are out or voting to continue the filibuster. permalink award report block reply possibletower 12 points 5 days ago Rand votes with the Democrats on everything. He even voted for Pedo Joe on J6 🤣 permalink parent award report block reply Retardloserimsogay 6 points 5 days ago That apple fell so far from the tree. permalink parent award report block reply\npossibletower 12 points 5 days ago Rand votes with the Democrats on everything. He even voted for Pedo Joe on J6 🤣 permalink parent award report block reply Retardloserimsogay 6 points 5 days ago That apple fell so far from the tree. permalink parent award report block reply\nRetardloserimsogay 6 points 5 days ago That apple fell so far from the tree. permalink parent award report block reply\nyepyep 1 points 4 days ago If they had to live like us it would be fixed. permalink award report block reply\nNellie_the_Beaut 1 points 4 days ago Mitch McConnell, Thomas Massie, Rand Paul.  Real nice, Kentucky. Real nice. permalink award report block reply\nQuidnunc 1 points 5 days ago He's pissed because DOGE stole his thunder. permalink award report block reply\nlifeisahologram 0 points 5 days ago Rand is a fucking retard sometimes permalink award report block reply"}