{"id": "1ARK57qqyn", "contents": "519 Yes - these people vote posted 4 days ago by TheLawofOne- 25 comments award share download report block\n25 comments Sort by Top Top New Worst Old Save Around the Web One Piece Kills All Parasites in Your Body! Paratoxil Stossels_stach 24 points 4 days ago Wait til they see the Guadalajara dog stats permalink award report block reply bill_in_texas 16 points 4 days ago Sort of like the covid fatalities, in a way. More people died in Chihuahua than FROM chihuahua. permalink award report block reply patrioticwinning3 10 points 4 days ago Ai, Chihuahua! permalink award report block reply Maxdady01 9 points 4 days ago \"¡Yo quiero Taco Bell!\" permalink award report block reply I_Love_45-70_Gov 6 points 4 days ago Are we sure about that? permalink award report block reply Meathe 8 points 4 days ago Pretty sure.   They really don't have much of a bite... The State of Chihuahua has more than a few narco death pits that have been exhumed, recovering bodies and shell casings.   The link would have been nice, I have no idea what stats were linked. permalink parent award report block reply BruddahIz 5 points 4 days ago The chuhuahua kidnap gangs are not tto be ignored, they go after poodles and labradoodles the most. permalink parent award report block reply Schadenfreude74 2 points 4 days ago A chihuahua killed my pit bull.\nThe pit bull choked on it... permalink award report block reply Another_rando 2 points 4 days ago I remember when we all discovered the voting was totally rigged.  And I don't remember when it got fixed. Meaning we still don't live in a republic permalink award report block reply wolfsettler -7 points 4 days ago I don't respect pussy fags who are retarded and fearful of \"Assault Dogs\" permalink award report block reply flopperdog 6 points 4 days ago If you're defending pitbulls, then you're an idiot. *These are animals that were bred for fighting, and can snap on a dime and maul someone to death.  (See dog mauling statistics) **Gun's can't escape your home and murder someone, but  pitbulls can.  (And have done in many circumstances) If you want a dog, get a golden retriever, lab, or other dog which is loving, but will still defend you.  (But not murder your neighbors) permalink parent award report block reply Reefay 8 points 4 days ago But, have you met my neighbors? permalink parent award report block reply mailinvoter 6 points 4 days ago Are they Chihuahuans? permalink parent award report block reply TRexScrotum 3 points 4 days ago Sí permalink parent award report block reply SpellingContable 3 points 4 days ago I dont know. Chihuahuas are always on edge. Always just a 'hello puppy' away from snapping and losing their shit at you. Look at them with those bulging high BP eyes. Nasty bite too. Imagine if those little buggers were 2 or 3 foot tall. permalink parent award report block reply wolfsettler 1 points 4 days ago They're not real dogs.\nThey're fucking rats that people pretend are dogs because they're too pussy to get any real dog. permalink parent award report block reply IForgotToAddAnEmail 0 points 4 days ago Yea, sounds like you don't know how to raise a dog permalink parent award report block reply flopperdog 2 points 4 days ago Pitbulls were BRED to fight other dogs, dumbass. *Their instinct is to kill, and there are plenty of cases of well trained \"family pitbulls\" snapping and mauling people. **If you think \"good training\" can override their instinct to kill, then you're a fucking idiot.  (And a TERRIBLE parent if you \"trust\" your kids with a monster that could snap at any minute) permalink parent award report block reply wolfsettler -1 points 4 days ago You sound like a fucking moron permalink parent award report block reply BlackLabsMatter -1 points 4 days ago A few years ago, I would have agreed with you.  Sadly I watched a neighbor's pit go psycho on one of his friends.  She was such a gentle dog before that night, then for no reason she went wholly evil. The friend got tore up a bit but not life altering thankfully.  She 100% was socialized, obedience trained, and the family had a kid about 3 years old.  She was never harmed.  No one in her home was threatened that night. While you can train any dog, and any dog can be kind and gentle, you must always take into account what the dog is and what it was bred for.  That class of dog is absolutely not too be trusted.  Sadly. permalink parent award report block reply IForgotToAddAnEmail 1 points 3 days ago And I feel sorry for you. But if Chihuahuas were any bit bigger, they'd be the number 1 dog put down. Dog gave warning signs I bet. SEen videos of idiots let their child bounce on a dog as it continues to let growl warnings out. Only for it to snap because it doesn't want to be jumped on constantly and everyone freaks out on the dog. I don't believe it. Yes it happens, I've been bit by a black lab. Right on my lips. Friendly dog, not that day. Do I hate all dogs? Absolutely not. permalink parent award report block reply wolfsettler 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply wolfsettler -1 points 4 days ago No one cares what you have to say faggot permalink parent award report block reply flopperdog 1 points 3 days ago If you could justify owning a Pitbull, you'd say why it's worth it... *But you can't, because you're a selfish piece of trash who risks other people's safety so you can have a \"cool pet\". permalink parent award report block reply djentropyhardcore -2 points 4 days ago If you're defending \"owning\" \"pets\", you're an idiot.  Get the fucking animals out of your house you gross human. permalink parent award report block reply\nStossels_stach 24 points 4 days ago Wait til they see the Guadalajara dog stats permalink award report block reply\nbill_in_texas 16 points 4 days ago Sort of like the covid fatalities, in a way. More people died in Chihuahua than FROM chihuahua. permalink award report block reply\npatrioticwinning3 10 points 4 days ago Ai, Chihuahua! permalink award report block reply\nMaxdady01 9 points 4 days ago \"¡Yo quiero Taco Bell!\" permalink award report block reply\nI_Love_45-70_Gov 6 points 4 days ago Are we sure about that? permalink award report block reply Meathe 8 points 4 days ago Pretty sure.   They really don't have much of a bite... The State of Chihuahua has more than a few narco death pits that have been exhumed, recovering bodies and shell casings.   The link would have been nice, I have no idea what stats were linked. permalink parent award report block reply BruddahIz 5 points 4 days ago The chuhuahua kidnap gangs are not tto be ignored, they go after poodles and labradoodles the most. permalink parent award report block reply\nMeathe 8 points 4 days ago Pretty sure.   They really don't have much of a bite... The State of Chihuahua has more than a few narco death pits that have been exhumed, recovering bodies and shell casings.   The link would have been nice, I have no idea what stats were linked. permalink parent award report block reply BruddahIz 5 points 4 days ago The chuhuahua kidnap gangs are not tto be ignored, they go after poodles and labradoodles the most. permalink parent award report block reply\nBruddahIz 5 points 4 days ago The chuhuahua kidnap gangs are not tto be ignored, they go after poodles and labradoodles the most. permalink parent award report block reply\nSchadenfreude74 2 points 4 days ago A chihuahua killed my pit bull.\nThe pit bull choked on it... permalink award report block reply\nAnother_rando 2 points 4 days ago I remember when we all discovered the voting was totally rigged.  And I don't remember when it got fixed. Meaning we still don't live in a republic permalink award report block reply\nwolfsettler -7 points 4 days ago I don't respect pussy fags who are retarded and fearful of \"Assault Dogs\" permalink award report block reply flopperdog 6 points 4 days ago If you're defending pitbulls, then you're an idiot. *These are animals that were bred for fighting, and can snap on a dime and maul someone to death.  (See dog mauling statistics) **Gun's can't escape your home and murder someone, but  pitbulls can.  (And have done in many circumstances) If you want a dog, get a golden retriever, lab, or other dog which is loving, but will still defend you.  (But not murder your neighbors) permalink parent award report block reply Reefay 8 points 4 days ago But, have you met my neighbors? permalink parent award report block reply mailinvoter 6 points 4 days ago Are they Chihuahuans? permalink parent award report block reply TRexScrotum 3 points 4 days ago Sí permalink parent award report block reply SpellingContable 3 points 4 days ago I dont know. Chihuahuas are always on edge. Always just a 'hello puppy' away from snapping and losing their shit at you. Look at them with those bulging high BP eyes. Nasty bite too. Imagine if those little buggers were 2 or 3 foot tall. permalink parent award report block reply wolfsettler 1 points 4 days ago They're not real dogs.\nThey're fucking rats that people pretend are dogs because they're too pussy to get any real dog. permalink parent award report block reply IForgotToAddAnEmail 0 points 4 days ago Yea, sounds like you don't know how to raise a dog permalink parent award report block reply flopperdog 2 points 4 days ago Pitbulls were BRED to fight other dogs, dumbass. *Their instinct is to kill, and there are plenty of cases of well trained \"family pitbulls\" snapping and mauling people. **If you think \"good training\" can override their instinct to kill, then you're a fucking idiot.  (And a TERRIBLE parent if you \"trust\" your kids with a monster that could snap at any minute) permalink parent award report block reply wolfsettler -1 points 4 days ago You sound like a fucking moron permalink parent award report block reply BlackLabsMatter -1 points 4 days ago A few years ago, I would have agreed with you.  Sadly I watched a neighbor's pit go psycho on one of his friends.  She was such a gentle dog before that night, then for no reason she went wholly evil. The friend got tore up a bit but not life altering thankfully.  She 100% was socialized, obedience trained, and the family had a kid about 3 years old.  She was never harmed.  No one in her home was threatened that night. While you can train any dog, and any dog can be kind and gentle, you must always take into account what the dog is and what it was bred for.  That class of dog is absolutely not too be trusted.  Sadly. permalink parent award report block reply IForgotToAddAnEmail 1 points 3 days ago And I feel sorry for you. But if Chihuahuas were any bit bigger, they'd be the number 1 dog put down. Dog gave warning signs I bet. SEen videos of idiots let their child bounce on a dog as it continues to let growl warnings out. Only for it to snap because it doesn't want to be jumped on constantly and everyone freaks out on the dog. I don't believe it. Yes it happens, I've been bit by a black lab. Right on my lips. Friendly dog, not that day. Do I hate all dogs? Absolutely not. permalink parent award report block reply wolfsettler 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply wolfsettler -1 points 4 days ago No one cares what you have to say faggot permalink parent award report block reply flopperdog 1 points 3 days ago If you could justify owning a Pitbull, you'd say why it's worth it... *But you can't, because you're a selfish piece of trash who risks other people's safety so you can have a \"cool pet\". permalink parent award report block reply djentropyhardcore -2 points 4 days ago If you're defending \"owning\" \"pets\", you're an idiot.  Get the fucking animals out of your house you gross human. permalink parent award report block reply\nflopperdog 6 points 4 days ago If you're defending pitbulls, then you're an idiot. *These are animals that were bred for fighting, and can snap on a dime and maul someone to death.  (See dog mauling statistics) **Gun's can't escape your home and murder someone, but  pitbulls can.  (And have done in many circumstances) If you want a dog, get a golden retriever, lab, or other dog which is loving, but will still defend you.  (But not murder your neighbors) permalink parent award report block reply Reefay 8 points 4 days ago But, have you met my neighbors? permalink parent award report block reply mailinvoter 6 points 4 days ago Are they Chihuahuans? permalink parent award report block reply TRexScrotum 3 points 4 days ago Sí permalink parent award report block reply SpellingContable 3 points 4 days ago I dont know. Chihuahuas are always on edge. Always just a 'hello puppy' away from snapping and losing their shit at you. Look at them with those bulging high BP eyes. Nasty bite too. Imagine if those little buggers were 2 or 3 foot tall. permalink parent award report block reply wolfsettler 1 points 4 days ago They're not real dogs.\nThey're fucking rats that people pretend are dogs because they're too pussy to get any real dog. permalink parent award report block reply IForgotToAddAnEmail 0 points 4 days ago Yea, sounds like you don't know how to raise a dog permalink parent award report block reply flopperdog 2 points 4 days ago Pitbulls were BRED to fight other dogs, dumbass. *Their instinct is to kill, and there are plenty of cases of well trained \"family pitbulls\" snapping and mauling people. **If you think \"good training\" can override their instinct to kill, then you're a fucking idiot.  (And a TERRIBLE parent if you \"trust\" your kids with a monster that could snap at any minute) permalink parent award report block reply wolfsettler -1 points 4 days ago You sound like a fucking moron permalink parent award report block reply BlackLabsMatter -1 points 4 days ago A few years ago, I would have agreed with you.  Sadly I watched a neighbor's pit go psycho on one of his friends.  She was such a gentle dog before that night, then for no reason she went wholly evil. The friend got tore up a bit but not life altering thankfully.  She 100% was socialized, obedience trained, and the family had a kid about 3 years old.  She was never harmed.  No one in her home was threatened that night. While you can train any dog, and any dog can be kind and gentle, you must always take into account what the dog is and what it was bred for.  That class of dog is absolutely not too be trusted.  Sadly. permalink parent award report block reply IForgotToAddAnEmail 1 points 3 days ago And I feel sorry for you. But if Chihuahuas were any bit bigger, they'd be the number 1 dog put down. Dog gave warning signs I bet. SEen videos of idiots let their child bounce on a dog as it continues to let growl warnings out. Only for it to snap because it doesn't want to be jumped on constantly and everyone freaks out on the dog. I don't believe it. Yes it happens, I've been bit by a black lab. Right on my lips. Friendly dog, not that day. Do I hate all dogs? Absolutely not. permalink parent award report block reply wolfsettler 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply wolfsettler -1 points 4 days ago No one cares what you have to say faggot permalink parent award report block reply flopperdog 1 points 3 days ago If you could justify owning a Pitbull, you'd say why it's worth it... *But you can't, because you're a selfish piece of trash who risks other people's safety so you can have a \"cool pet\". permalink parent award report block reply djentropyhardcore -2 points 4 days ago If you're defending \"owning\" \"pets\", you're an idiot.  Get the fucking animals out of your house you gross human. permalink parent award report block reply\nReefay 8 points 4 days ago But, have you met my neighbors? permalink parent award report block reply mailinvoter 6 points 4 days ago Are they Chihuahuans? permalink parent award report block reply TRexScrotum 3 points 4 days ago Sí permalink parent award report block reply\nmailinvoter 6 points 4 days ago Are they Chihuahuans? permalink parent award report block reply TRexScrotum 3 points 4 days ago Sí permalink parent award report block reply\nTRexScrotum 3 points 4 days ago Sí permalink parent award report block reply\nSpellingContable 3 points 4 days ago I dont know. Chihuahuas are always on edge. Always just a 'hello puppy' away from snapping and losing their shit at you. Look at them with those bulging high BP eyes. Nasty bite too. Imagine if those little buggers were 2 or 3 foot tall. permalink parent award report block reply wolfsettler 1 points 4 days ago They're not real dogs.\nThey're fucking rats that people pretend are dogs because they're too pussy to get any real dog. permalink parent award report block reply\nwolfsettler 1 points 4 days ago They're not real dogs.\nThey're fucking rats that people pretend are dogs because they're too pussy to get any real dog. permalink parent award report block reply\nIForgotToAddAnEmail 0 points 4 days ago Yea, sounds like you don't know how to raise a dog permalink parent award report block reply flopperdog 2 points 4 days ago Pitbulls were BRED to fight other dogs, dumbass. *Their instinct is to kill, and there are plenty of cases of well trained \"family pitbulls\" snapping and mauling people. **If you think \"good training\" can override their instinct to kill, then you're a fucking idiot.  (And a TERRIBLE parent if you \"trust\" your kids with a monster that could snap at any minute) permalink parent award report block reply wolfsettler -1 points 4 days ago You sound like a fucking moron permalink parent award report block reply BlackLabsMatter -1 points 4 days ago A few years ago, I would have agreed with you.  Sadly I watched a neighbor's pit go psycho on one of his friends.  She was such a gentle dog before that night, then for no reason she went wholly evil. The friend got tore up a bit but not life altering thankfully.  She 100% was socialized, obedience trained, and the family had a kid about 3 years old.  She was never harmed.  No one in her home was threatened that night. While you can train any dog, and any dog can be kind and gentle, you must always take into account what the dog is and what it was bred for.  That class of dog is absolutely not too be trusted.  Sadly. permalink parent award report block reply IForgotToAddAnEmail 1 points 3 days ago And I feel sorry for you. But if Chihuahuas were any bit bigger, they'd be the number 1 dog put down. Dog gave warning signs I bet. SEen videos of idiots let their child bounce on a dog as it continues to let growl warnings out. Only for it to snap because it doesn't want to be jumped on constantly and everyone freaks out on the dog. I don't believe it. Yes it happens, I've been bit by a black lab. Right on my lips. Friendly dog, not that day. Do I hate all dogs? Absolutely not. permalink parent award report block reply wolfsettler 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply\nflopperdog 2 points 4 days ago Pitbulls were BRED to fight other dogs, dumbass. *Their instinct is to kill, and there are plenty of cases of well trained \"family pitbulls\" snapping and mauling people. **If you think \"good training\" can override their instinct to kill, then you're a fucking idiot.  (And a TERRIBLE parent if you \"trust\" your kids with a monster that could snap at any minute) permalink parent award report block reply wolfsettler -1 points 4 days ago You sound like a fucking moron permalink parent award report block reply\nwolfsettler -1 points 4 days ago You sound like a fucking moron permalink parent award report block reply\nBlackLabsMatter -1 points 4 days ago A few years ago, I would have agreed with you.  Sadly I watched a neighbor's pit go psycho on one of his friends.  She was such a gentle dog before that night, then for no reason she went wholly evil. The friend got tore up a bit but not life altering thankfully.  She 100% was socialized, obedience trained, and the family had a kid about 3 years old.  She was never harmed.  No one in her home was threatened that night. While you can train any dog, and any dog can be kind and gentle, you must always take into account what the dog is and what it was bred for.  That class of dog is absolutely not too be trusted.  Sadly. permalink parent award report block reply IForgotToAddAnEmail 1 points 3 days ago And I feel sorry for you. But if Chihuahuas were any bit bigger, they'd be the number 1 dog put down. Dog gave warning signs I bet. SEen videos of idiots let their child bounce on a dog as it continues to let growl warnings out. Only for it to snap because it doesn't want to be jumped on constantly and everyone freaks out on the dog. I don't believe it. Yes it happens, I've been bit by a black lab. Right on my lips. Friendly dog, not that day. Do I hate all dogs? Absolutely not. permalink parent award report block reply wolfsettler 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply\nIForgotToAddAnEmail 1 points 3 days ago And I feel sorry for you. But if Chihuahuas were any bit bigger, they'd be the number 1 dog put down. Dog gave warning signs I bet. SEen videos of idiots let their child bounce on a dog as it continues to let growl warnings out. Only for it to snap because it doesn't want to be jumped on constantly and everyone freaks out on the dog. I don't believe it. Yes it happens, I've been bit by a black lab. Right on my lips. Friendly dog, not that day. Do I hate all dogs? Absolutely not. permalink parent award report block reply\nwolfsettler 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply\nwolfsettler -1 points 4 days ago No one cares what you have to say faggot permalink parent award report block reply flopperdog 1 points 3 days ago If you could justify owning a Pitbull, you'd say why it's worth it... *But you can't, because you're a selfish piece of trash who risks other people's safety so you can have a \"cool pet\". permalink parent award report block reply\nflopperdog 1 points 3 days ago If you could justify owning a Pitbull, you'd say why it's worth it... *But you can't, because you're a selfish piece of trash who risks other people's safety so you can have a \"cool pet\". permalink parent award report block reply\ndjentropyhardcore -2 points 4 days ago If you're defending \"owning\" \"pets\", you're an idiot.  Get the fucking animals out of your house you gross human. permalink parent award report block reply"}