{"id": "1ARK52Bhaa", "contents": "1335 Zohran Says We Will Prove ‘There Is No Problem Too Large for Govt to Solve’…(we will not forget what you just said because we know better and you don't) (www.breitbart.com) posted 6 days ago by actlikewewon 167 comments award share report block Mamdani Says We Will Prove 'There Is No Problem Too Large for Government to Solve' Wednesday on \"The Alex Marlow Show,\" host and Breitbart Editor-in-Chief Alex Marlow discussed Tuesday's elections and Zohran Mamdani's victory speech. | Clips www.breitbart.com\n167 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno Magma_Biscuit 85 points 6 days ago Would be interested to know what problem the govt has actually solved, I can’t think of one permalink award report block reply IamM 57 points 6 days ago \"My wallet has too much money, what will I ever do with it?\" permalink parent award report block reply Illuminaughty 9 points 6 days ago Build a catapult and launch thy coin towards the abyss of oblivion permalink parent award report block reply Puppy528 7 points 6 days ago Way more helpful than the average government program. permalink parent award report block reply Justlooking250 3 points 6 days ago What about the remnants from the clipping ? 🤣 permalink parent award report block reply Shinydenim 3 points 6 days ago Government is going to have a few words about how big that can be if it means it can’t launch more of your coin permalink parent award report block reply BidenShowerDrool 4 points 6 days ago Govt. is free to take the lint and dead moth from mine. permalink parent award report block reply AutPaxAutBellum300 1 points 6 days ago You get lint? I am jealous. permalink parent award report block reply vongregormench 1 points 6 days ago There’s not enough aids and crime in my city! Could someone introduce more Haitians and Somalians here? permalink parent award report block reply BlackPilledMAGA 39 points 6 days ago This cunt is just another in a looooooooong line of retards who have tried socialism. It's never worked, not one time. It's a law of physics at this point. permalink parent award report block reply BidenShowerDrool 9 points 6 days ago He's a believer in Communism hasn't been done right, yet. He may just sprinkle some Sharia in there too. permalink parent award report block reply D__1 8 points 6 days ago AOC's gonna look soooo hot in that burqa. permalink parent award report block reply womp-womp-twice 3 points 6 days ago Well, I mean, if her teeth are covered... permalink parent award report block reply Puppy528 5 points 6 days ago At least when the starvation and suffering comes to NYC, most of the victims won't actually be from New York.. permalink parent award report block reply The_Yakuza 3 points 6 days ago He’s a closeted faggot indian from africa. There’s now way he would implement sharia law. He’s only “muslim” to win votes and get liberal brownie points. permalink parent award report block reply Sparks1017 2 points 6 days ago Yep, and he's just the one to do it right. Hilarious, first thing he does after winning is to say send me money. Aloha snackbar, get fucked permalink parent award report block reply CommanderOfCheese 3 points 5 days ago The fundamental reason why it has never worked is that it can't work even in theory. It's called the problem of information. No centralized body can possibly obtain sufficient information to know how much of any resource should be devoted towards producing something needed by everyone else. We see exactly the approach taken to solve this problem by the Soviets and it's hilarious. For instance, nails. Nails are such a simple and stupid sounding need, but they're essential for construction. There's no way for there to be enough communication to get the right amount of nails to everyone, and they come in a zillion different types according to purpose. The Soviets just planned the need for nail production by weight. The result was the nail makers just produced big nails for everything, because that was the easiest way to make quota. The actual solution to the problem of information is open market pricing. permalink parent award report block reply shadypollster 21 points 6 days ago Waco. They solved it and all the children with fire. permalink parent award report block reply orange_popcicle 5 points 6 days ago You know, I think the government also helped with the Ruby Ridge \"issue\" as well. permalink parent award report block reply booblitchutz 15 points 6 days ago They're working on the biggest problem (for them): an armed and free population. They've enslaved 1/4 of the population already with welfare. permalink parent award report block reply Magma_Biscuit 10 points 6 days ago And 100% of the population with taxes! permalink parent award report block reply booblitchutz 3 points 6 days ago Well as bad as taxes are, and yes they are intended to deliberately hamstring us to prevent us from thriving too much, they are not so much \"slavery\" as welfare is. If you're employed and paying taxes, most of your money (like 50.1%) goes to you. If you're on welfare, you are completely enslaved by the government. permalink parent award report block reply SteelBallRun1890 3 points 6 days ago 50% is absolutely slavery. I treat this like a seller at a card show, 80% minimum or GTFO permalink parent award report block reply KernalMustard 1 points 6 days ago Taxes? Whats that? permalink parent award report block reply sixfingerdildo 8 points 6 days ago public jobs are welfare. permalink parent award report block reply rootGoose 4 points 6 days ago They exist to fight for their own existence. permalink parent award report block reply Formerlurker92 10 points 6 days ago -people having freedom -too many of the \"wrong types\" being alive -bombing far away people -how to enrich the least capable among us permalink parent award report block reply load 19 more comments... I_Am_John_Galt 39 points 6 days ago I'm from the government and I'm here to help permalink award report block reply InterloperKO 15 points 6 days ago Islamic government* permalink parent award report block reply MrJohnnyD2078 7 points 6 days ago No one ever talks about the fist sentence in that quote, The most terrifying thing an American can hear is...Now add your sentence. permalink parent award report block reply cjsr4c90 30 points 6 days ago Reagan said it best: \"It's not that our liberal friends know so little, it's that they know so much that isn't so.\" permalink award report block reply Formerlurker92 27 points 6 days ago This should terrify everyone with a cursory historical knowledge permalink award report block reply BidenShowerDrool 5 points 6 days ago everyone with a cursory historical knowledge there you go making assumptions about the last 2 generations raised on sugar, video games and very little school and zero history. permalink parent award report block reply Formerlurker92 5 points 6 days ago The department of education has been a rousing success permalink parent award report block reply SurveilThis 3 points 6 days ago Trump should Tariffy socialist governments. permalink parent award report block reply Dev404 17 points 6 days ago Most problems are made WORSE as soon as the government gets involved. This coddled, champagne socialist muslim has never worked a day in his life and that's why he's a retard who would sell the government as the solution to everything. It's the same marketing message as every tyrant looking to weaponize the government. permalink award report block reply Tellman125 12 points 6 days ago He takes office on Jan 1, which means there's still nearly TWO WHOLE MONTHS while he's still in this hyper idealistic phase. Right now he's still in his campaign-rally/debate mode of being a 10th grader all giddy and over-eager to do his class presentation where he gets to impress the stupid woman fake-history teacher with all the bullshit he has memorized from her lectures and reading assignments. He was the most absent assembly member in his 4 years there. So, once he becomes mayor and has to start show up EVERY SINGLE DAY to 2 or 3 crisis locations (fires, gang violence, tragedies, emergencies), or tense union meetings, or business groups, or whatever ethnic group meetings (all sort of NON-Muslim ones he doesn't give a shit about), he'll start burning out fast and unravel and start saying shit that reveals how uninterested, underequipped, and unqualified he is for the job. His campaign was such a breeze, letting his TikTok videos do the work for him, and her kept up the phony grin for the 2 hours of the 2 debates, but he won't be able to keep that fucking phony grin on his face for that many hours a day, and with so many people telling him their stories, complaining to him, pleading with him, and hectoring him. permalink parent award report block reply KernalMustard 4 points 6 days ago He will Be Bidened. A figurehead while the rats have run of the house permalink parent award report block reply SPEDMan64 1 points 6 days ago Kind of hoping he can take care of my mother-in-law and her retard third husband before he unravels. permalink parent award report block reply sixfingerdildo 3 points 6 days ago this mutherfucker knows how stupid the average voter is. permalink parent award report block reply The_Yakuza 1 points 6 days ago “Muslim”. He’s a flaming homo and only muslim by name. permalink parent award report block reply npc_1234 13 points 6 days ago There is no problem too large for government to cause. FTFY. permalink award report block reply Citizen_Bob 12 points 6 days ago this is fucking insane. permalink award report block reply BigIglooActual 7 points 6 days ago Why is this man even in our country? permalink award report block reply cornpop_1988 5 points 6 days ago \"From each according to his ability, to each according to his needs\". permalink award report block reply actlikewewon OP 3 points 6 days ago Atlas Shrugged was a prophecy. permalink parent award report block reply CommanderOfCheese 3 points 5 days ago Will Elon Musk become John Galt? permalink parent award report block reply ToxicAvengerOhio 5 points 6 days ago Zzzzzz. This site is already obsessed with this  retard. How many stickies will the fag get per day? permalink award report block reply SBOJ_JOBS 4 points 6 days ago Example: Russia, China, and Cambodia had too little food Government Solution: Kill 25% or more of your population. Problem solvede. Easy Peasy! permalink award report block reply perma-maga 4 points 6 days ago Government often is the problem. permalink award report block reply booblitchutz 4 points 6 days ago So... he's just another democrat. That's the thing all of us hyperventilating about his election need to remember: he's just another democrat. Yeah he is taking off the \"moderate\" mask a little, making his socialist goals a little more obvious, but that just makes him another corrupt democrat and I'm sure by now he's already been handed more than enough money to play ball with the dem agenda 100%. So Cuomo... Mamndani... Adams... DeBlasio... it's all the same shit in different diapers. permalink award report block reply Kavantar 3 points 6 days ago Bless his little cold-blooded heart permalink award report block reply TyrantsAreCucks 3 points 6 days ago The absolute last thing I want to hear from an elected official permalink award report block reply cd3dog 3 points 6 days ago Couldn’t solve the problem of cash bar a the party.  Already no free stuff. permalink award report block reply MAGASquatch 3 points 6 days ago How does Big Government solve Big Government? permalink award report block reply you_know_GOAT 3 points 6 days ago His name sounds like some bad guy from the Flash Gordon film back in the 80's. Ming the Merciless was cooler, but his name makes me think of that. permalink award report block reply actlikewewon OP 1 points 6 days ago If I remember, the original Flash Gordon was a talkie too. permalink parent award report block reply SicSemperTyrannis2 0 points 6 days ago He doesn't have a theme song by Queen. permalink parent award report block reply killedmytv 3 points 6 days ago I'm from the Islamic government and I'm here to help myself, infidels permalink award report block reply SicSemperTyrannis2 0 points 6 days ago Read in Achmed the dead terrorist voice permalink parent award report block reply rootGoose 3 points 6 days ago New Yorkers should be more worried that he said there's no problem too small for them to be interested in, as well. No one likes to be micromanaged and it is a vehicle for profound abuse. permalink award report block reply bearhugprolapse 3 points 6 days ago pretty rich when it’s patently obvious to anyone with a functioning prefrontal cortex that government is the problem. permalink award report block reply jml1997 3 points 6 days ago The dipshit would make President Camacho a genius. permalink award report block reply Djohnsonsgagreflex 3 points 6 days ago That is a declaration of faith.  Should be considered a violation of the establishment clause. permalink award report block reply KernalMustard 0 points 6 days ago So when a Christian does it its ok..... permalink parent award report block reply IsrorOrca 3 points 6 days ago No matter how bad this guy fucks up - the non-natives will glaze you and tell you how amazing it is, or blame Trump & Capitalism for sabotaging everything. permalink award report block reply redditadminssuckit 3 points 6 days ago Watching the complete destruction in New York and the find out phase for the voting morons of that city is going to be glorious permalink award report block reply Tryhardneckbeard 2 points 6 days ago Huh? all the girls that voted cause Tik Tok said so get to move back home to mom and dads house and not suffer a single fuckin consequence of this.  So the cycle continues. permalink parent award report block reply deleted 1 points 6 days ago PenguinOfDoom 4 points 6 days ago Liberal men are women. permalink parent award report block reply deleted 1 points 6 days ago view 1 more comments... Tryhardneckbeard 2 points 6 days ago Ya but the liberal dudes don't get the same luxury, they get to see how fucked up it all gets and start having icky conservative mind think. permalink parent award report block reply GottaMemberMyPW 3 points 6 days ago That’s not the government’s job! permalink award report block reply SavingPrivateGrace 3 points 6 days ago Little orphan Latino AOC and Daddy Warbucks have a plan for NYC.  These 30 somethings pulling out of thin air enough money to solve everything is what got us into the open borders taking care of illegals the socialist way.  Formulated by a guy who never had a job in his life.  I just want to survive long enough to enjoy a retirement some day. permalink award report block reply GeorgeBailey 3 points 6 days ago Idk, the biggest problem the government has faced in the last several decades is the influx of Muslims and Indians into our country. They haven’t really “solved” that whopper of a problem now, have they. permalink award report block reply TheAttackTitan 2 points 6 days ago “I’m from the government and I’m here to help” Aaaaand here we are permalink award report block reply BoomShtick 2 points 6 days ago “I’m from the government and I am here to help” permalink award report block reply SurveilThis 2 points 6 days ago “There is no problem too large for the gov’t to make worse. The bigger the problem, the worse govt will make it. permalink award report block reply EdBuck 2 points 6 days ago This is going to get real entertaining. permalink award report block reply Jbliss 2 points 6 days ago Dude. NYC couldnt fix a skating rink in NYC. How the hell is it going to solve anything under this dipshit? Years ago I read Giuliani's book where he described the painstaking process to lower crime when he was mayor...good luck! permalink award report block reply Gadsden 2 points 6 days ago He knows better. An economic collapse is good for Islam. When chaos reigns, the \"order\" Islam promises will be welcomed. permalink award report block reply NotMyGovernor 2 points 6 days ago Muh not forgetting permalink award report block reply dr_gonzo 2 points 6 days ago Think about how unimaginably insane this whole situation is. This little idiot ideologue has never even had a job. Christ he's not even American, plus he's a fucking muslim. And on top of all that, he's a socialist which is very literally the most failed political ideology in the history of the world. But the absurdity doesn't stop there comrades. 80% of New Yorkers said \"affordability\" was their top issue, yet everything is expensive due to the money printing necessitated by our socialist social welfare programs! They seek to use socialism to solve the problem socialism caused. That's like trying to heal a gunshot wound with another gunshot. This might be THE peak level of stupidity in world history. permalink award report block reply L74ge9wr 2 points 6 days ago “… with YOUR money”\nThere, fixed it for ya permalink award report block reply Tyscribz 2 points 6 days ago every time the government tries to solve a problem \"Well it costs 5x more, it's generally a worse product, and the citizens that are still alive had everything they owned stolen from them ...\" permalink award report block reply Induceddrag 2 points 6 days ago If you don’t like your problems, wait until you see our solutions. permalink award report block reply Aut_MAGA_Aut_Nihil 2 points 6 days ago If government could solve anything it would have been solved by now. It’s not like this is a novel idea. permalink award report block reply Rock9Head 2 points 6 days ago Government is the problem. permalink award report block reply Keep_on_winning_kag 2 points 6 days ago Zohan mamadummy went full retard a long time ago. permalink award report block reply Now_On_to_Mars 2 points 6 days ago There is no Government Large enough to solve any problem permalink award report block reply The_RedWolf 2 points 6 days ago The most dangerous words you can ever hear are \"I'm from the Government and I'm here to help.\" Going off of memory of Reagan's quote. permalink award report block reply Sparks1017 2 points 6 days ago I don't want to see this commies face nor hear his voice, same as with obongos. fuck this fucking mooslime permalink award report block reply schism 2 points 6 days ago Oh he knows better, he just doesn't care.  He's not stupid. Power at any cost is the goal. permalink award report block reply Cuttinmuffins 2 points 6 days ago Any fool that actually believes a word out of the pos mouth is a serious dumbass. He is not here to help anything. He is here to pave the way for Islam or communism. Either way he was placed there to do this, like Obama was. All statements like this buy him is a bit more time while the I told you so crowd watch patiently  bemused as he digs the holes he is meant to dog on the 1st place. He needs to be deported immediately. permalink award report block reply 559throw 2 points 6 days ago Literally everything the government touches turns to flaming dogshit permalink award report block reply Sunnybats2 2 points 6 days ago Like DEPORT DEPORT DEPORT?! permalink award report block reply PunishedOrange 2 points 6 days ago no kings right? permalink award report block reply Trumpwonbidencheated 2 points 6 days ago The government can fuck up a wet dream. permalink award report block reply Kimball_Kinnison 2 points 6 days ago The quote in meme form: https://patriots.win/p/1ARK52Asi5/the-democratic-party-has-gone-fu/c/ permalink award report block reply TheWhitestOfFangs 1 points 6 days ago I think government itself is a problem too big for government to solve permalink award report block reply Imnotnorm 1 points 6 days ago Cut to Rand Paul bolting awake, sweaty....\" oh thank God, it was just a nightmare\" permalink award report block reply Snooptwo 1 points 6 days ago Hunger problem? Kill people. Consensus problem? Kill people. Housing problem? Kill people. Their problem solving always ends with killing people. permalink award report block reply PeterThielAntiChrist 1 points 6 days ago the market is not producing solutions as is. expect people to look elsewhere unless the market can free itself from monopoly corruption. permalink award report block reply gb1787 1 points 6 days ago There is no problem so small that government is capable of solving it. FIFY permalink award report block reply DITTOPatriot 1 points 6 days ago Why are the Zionists so mad at this fellow? Is kissing the wall that important? permalink award report block reply Steve56775 1 points 6 days ago Name one problem the government has solved. permalink award report block reply Noseeboh 1 points 6 days ago What does the government do when government is the big problem? permalink award report block reply ReleasetheList 1 points 6 days ago It doesn't matter how badly he runs the city. He or another communist will be elected next election. Demographics are destiny. permalink award report block reply pugsan 1 points 6 days ago No socialist or communists has ever truly believed this. It's better to just meme the constant flow a naive, propagandized sheep that do, while perhaps having the socialists/communists laughing in the background. permalink award report block reply CrackerSmurf2 1 points 6 days ago There is a problem Nazi Commie faggot Arabians decide they think they taking over this place. =) permalink award report block reply TheSHazDroid 1 points 6 days ago \"The nine most terrifying words in the English language are: I'm from the government and I'm here to help.\" Ronald Reagan permalink award report block reply Meddlesom 1 points 6 days ago He is a problem.  Can government solve him? permalink award report block reply AbrahamLincoln 1 points 6 days ago I'd like to see the \"goatfuckers invading our country\" problem solved. permalink award report block reply bluewhiteandred 1 points 6 days ago seeing the comments here: pretend the NYC government in this instance is like one corporation like amazon trying to provide services for everything obviously there are problems with this but companies like amazon do end up providing a lot of services so I could see this going in a lot of directions besides what some of the comments think (that it will simply fail, which is very possible). could be \"ok\", could even be \"really good\", could be \"pretty awful\". but important to note that it could be functional to some extent, luring more people to want socialism. (also could be functional in that it is dependent on capitalist corps around it) edit: important to note some of the downsides of \"capitalism\" and socialism here bad \"capitalist\" corps today actually can act kind of \"fascist\" and do a worse job perhaps than some \"socialist\" governments. Take John Deere for example which has tried to lock down its products and prevent farmers from working on them with closed software designs. but then take downsides of a socialist gov: might prohibit competition which could drive up costs and stifle freedom which would create disincentives. I'm not totally sure what point I want to make with this. Maybe like beware this working to some extent, of them finding a way to create an illusion of it working? or of it genuinely working as a counter to \"bad corporations\" which do a bad job? back in early 2010s we had the tea party protesting big government (that would be Mamdani here) and occupy wallstreet protesting big bad corporations (that would be john deere in my example here, but I'm not intending to single out john deere or any one big corp, just trying to point to a specific harmful behavior that I thought john deere engaged in, of limiting working on the farming equipment that farmers owned). the problem is big government AND big corporations here. Mamdani may create something functional in truly opposing big bad corporations, but doesn't address the \"big bad government\" problem. A lot of \"capitalists\" on the right don't necessarily address the \"big bad corporations\" problem, maybe? permalink award report block reply roflcopt0rz_returns 2 points 6 days ago The main difference between a mega corporation like Amazon versus the government is that Amazon at the end of the day needs to make a profit, so there’s a limit to how much they can fuck over their workers or the customers or else they will leave and Amazon stops making money. The government is not beholden to anyone as long as they get elected. And they’ve shown they will money print, assassinate, steal elections, sic their police/army lapdogs, etc., all things that the mega corps can’t do. They have zero incentive to actually appeal to the people as long as they don’t piss off the people enough to where the people rise up and slay them. permalink parent award report block reply bluewhiteandred 1 points 6 days ago I kind of agree with what you're saying but let me see if there's anything I can question about it gov does have limits like amazon, i.e. people revolting if it got too out of hand? mega corps can engage in some of the shady things you mention like influence elections they can also get away with a lot of things because the average person can't necessarily start up a competitor easily and lots of random average person choose to do business with them rather than support smaller businesses sometimes, so although they need to make a profit they still have a lot of leverage? corps and gov are often run by the same people: gov gives big corps tax breaks and grants, gov bails out failing companies and banks, corp money is used to lobby for laws and electing people to push policies that favor the corps, etc. so, not really disagreeing necessarily, just trying to further the convo and add to what you described? permalink parent award report block reply roflcopt0rz_returns 1 points 6 days ago Yes, mega corps can throw their weight around to do unlawful and immoral stuff, but nowhere near to the extent the government can. Again, the government has a monopoly on violence as they control the police, army, alphabet agencies, etc. They also have more money than megacorps because they have money printer. Stopping the government from overreach of their authority will require you to actually stand up to them and often requires overthrowing them. Much different than just simply not shopping with Amazon and giving them money. Because Amazon cannot put a gun to your head and force you to obey by threat of violence or imprisonment. The government can. Mega corps can and do bully small businesses. But government can bully small businesses AND mega corps. permalink parent award report block reply ChilledCovfefe 1 points 5 days ago Both of you made excellent points. Let me take it one step further. I think we are in quasi fascism right now. Government and corporations are married together. Not all of them but pretty much ALL of the biggest ones.  Government uses them as their browshirts. The government uses corps and NGOs by proxy to implement policies that are against the law. Like vaccine rules during Covid, censorship, immigration etc.  With Trump in office it has been curtailed for now but I think we need to sever almost all government, corporate and NGO relationships or we are toast. The NGO shit was really started by Obama with the first 2000 page stimulus bill that created the first trillion dollar injections into leftist NGOs. The NGO and foundations need to be destroyed. permalink parent award report block reply view 1 more comments... entERmyMAtrix 1 points 6 days ago HahhahBhHbBbbBbhahahahahA permalink award report block reply Tacitus1963 1 points 6 days ago Watch this short 10 minute video about Mamdani and his and his father's connection to the same political ideology that is the ANC and EFF in South Africa. https://youtu.be/KvnUIfvYV_E?si=O0BElYYCjGj8eGjO permalink award report block reply Nanteen 1 points 6 days ago Remember when the GOP starts pointing out all of his failures next August for the elections. Immediately. Mainstream media will say how everything is Trump's fault permalink award report block reply throwaway29834751 1 points 5 days ago repeal the 1965 immigration act, and limit / reduce immigration from all other countries, western hemisphere included permalink award report block reply airmaildolphin 1 points 6 days ago He worships government.  That's my take away from what he said. permalink award report block reply wmmiv2016v2 1 points 6 days ago I want to know his definition of \"solve\" permalink award report block reply Hikedelics 1 points 6 days ago Yes, worship at the altar of the all powerful state! Anything the government has the power to give you, it can and will far more readily take it away. permalink award report block reply Gosh_darn_hotdog 1 points 6 days ago The second most terrifying 9 words. permalink award report block reply nemonster 1 points 6 days ago We? permalink award report block reply knnbccb 1 points 6 days ago \"I'm from the government and I'm here to help.\" permalink award report block reply duznmatter 1 points 6 days ago Dumb bastard. Even a capitalist government that we supposedly have can't solve a damn thing. permalink award report block reply YearninNation 1 points 6 days ago Its going to be embarrassing if he does more tangible things for people that Trump. permalink award report block reply AntiCommieAktion 1 points 6 days ago Legalizing prostitution is not solving problems, Zohran permalink award report block reply ThePatriotGames2016 1 points 6 days ago ie: everything and everyone is the problem. permalink award report block reply vongregormench 1 points 6 days ago Well just ask him what problems the government has solved. permalink award report block reply MrCuriousGuy513 1 points 6 days ago Big Mama Government is coming to town.\nHow messy can it get? smh permalink award report block reply Tophat9000 1 points 6 days ago The \"let eat the seed\" thinking (and nothing left to plant for the next season) permalink award report block reply Memebot 1 points 6 days ago Government is the problem permalink award report block reply Idontevenknow 1 points 6 days ago Problems go away when you murder everyone ~Old Socialist Proverb permalink award report block reply keeman 1 points 6 days ago The first problem he intends to solve is white people having nice things.  I mean after his 5 star vacation in Puerto Rico.  He will presumably then attempt to seize the means of production.  This will be tricky as he doesn't know what the means of production looks like.  He will probably ask his butler if he knows anyone who can help him identify such things. permalink award report block reply thisisatestof2 1 points 6 days ago He also said don't give him money, then begged for more money.  Then, in his victory speech said only \"new\" people, and promptly filled his translation team the next day with NYC and even DC insiders within 24 hours. permalink award report block reply GarudaDarkblack 1 points 6 days ago If nobody claiming there is a problem is left alive then is there still a problem? That's how communism works. permalink award report block reply 10gauge 1 points 6 days ago Homelessness kicked the government's ass. permalink award report block reply FullyDilated 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply EyesSewnShut 1 points 6 days ago Comment removed by community moderators. permalink award report block reply\nMagma_Biscuit 85 points 6 days ago Would be interested to know what problem the govt has actually solved, I can’t think of one permalink award report block reply IamM 57 points 6 days ago \"My wallet has too much money, what will I ever do with it?\" permalink parent award report block reply Illuminaughty 9 points 6 days ago Build a catapult and launch thy coin towards the abyss of oblivion permalink parent award report block reply Puppy528 7 points 6 days ago Way more helpful than the average government program. permalink parent award report block reply Justlooking250 3 points 6 days ago What about the remnants from the clipping ? 🤣 permalink parent award report block reply Shinydenim 3 points 6 days ago Government is going to have a few words about how big that can be if it means it can’t launch more of your coin permalink parent award report block reply BidenShowerDrool 4 points 6 days ago Govt. is free to take the lint and dead moth from mine. permalink parent award report block reply AutPaxAutBellum300 1 points 6 days ago You get lint? I am jealous. permalink parent award report block reply vongregormench 1 points 6 days ago There’s not enough aids and crime in my city! Could someone introduce more Haitians and Somalians here? permalink parent award report block reply BlackPilledMAGA 39 points 6 days ago This cunt is just another in a looooooooong line of retards who have tried socialism. It's never worked, not one time. It's a law of physics at this point. permalink parent award report block reply BidenShowerDrool 9 points 6 days ago He's a believer in Communism hasn't been done right, yet. He may just sprinkle some Sharia in there too. permalink parent award report block reply D__1 8 points 6 days ago AOC's gonna look soooo hot in that burqa. permalink parent award report block reply womp-womp-twice 3 points 6 days ago Well, I mean, if her teeth are covered... permalink parent award report block reply Puppy528 5 points 6 days ago At least when the starvation and suffering comes to NYC, most of the victims won't actually be from New York.. permalink parent award report block reply The_Yakuza 3 points 6 days ago He’s a closeted faggot indian from africa. There’s now way he would implement sharia law. He’s only “muslim” to win votes and get liberal brownie points. permalink parent award report block reply Sparks1017 2 points 6 days ago Yep, and he's just the one to do it right. Hilarious, first thing he does after winning is to say send me money. Aloha snackbar, get fucked permalink parent award report block reply CommanderOfCheese 3 points 5 days ago The fundamental reason why it has never worked is that it can't work even in theory. It's called the problem of information. No centralized body can possibly obtain sufficient information to know how much of any resource should be devoted towards producing something needed by everyone else. We see exactly the approach taken to solve this problem by the Soviets and it's hilarious. For instance, nails. Nails are such a simple and stupid sounding need, but they're essential for construction. There's no way for there to be enough communication to get the right amount of nails to everyone, and they come in a zillion different types according to purpose. The Soviets just planned the need for nail production by weight. The result was the nail makers just produced big nails for everything, because that was the easiest way to make quota. The actual solution to the problem of information is open market pricing. permalink parent award report block reply shadypollster 21 points 6 days ago Waco. They solved it and all the children with fire. permalink parent award report block reply orange_popcicle 5 points 6 days ago You know, I think the government also helped with the Ruby Ridge \"issue\" as well. permalink parent award report block reply booblitchutz 15 points 6 days ago They're working on the biggest problem (for them): an armed and free population. They've enslaved 1/4 of the population already with welfare. permalink parent award report block reply Magma_Biscuit 10 points 6 days ago And 100% of the population with taxes! permalink parent award report block reply booblitchutz 3 points 6 days ago Well as bad as taxes are, and yes they are intended to deliberately hamstring us to prevent us from thriving too much, they are not so much \"slavery\" as welfare is. If you're employed and paying taxes, most of your money (like 50.1%) goes to you. If you're on welfare, you are completely enslaved by the government. permalink parent award report block reply SteelBallRun1890 3 points 6 days ago 50% is absolutely slavery. I treat this like a seller at a card show, 80% minimum or GTFO permalink parent award report block reply KernalMustard 1 points 6 days ago Taxes? Whats that? permalink parent award report block reply sixfingerdildo 8 points 6 days ago public jobs are welfare. permalink parent award report block reply rootGoose 4 points 6 days ago They exist to fight for their own existence. permalink parent award report block reply Formerlurker92 10 points 6 days ago -people having freedom -too many of the \"wrong types\" being alive -bombing far away people -how to enrich the least capable among us permalink parent award report block reply load 19 more comments...\nIamM 57 points 6 days ago \"My wallet has too much money, what will I ever do with it?\" permalink parent award report block reply Illuminaughty 9 points 6 days ago Build a catapult and launch thy coin towards the abyss of oblivion permalink parent award report block reply Puppy528 7 points 6 days ago Way more helpful than the average government program. permalink parent award report block reply Justlooking250 3 points 6 days ago What about the remnants from the clipping ? 🤣 permalink parent award report block reply Shinydenim 3 points 6 days ago Government is going to have a few words about how big that can be if it means it can’t launch more of your coin permalink parent award report block reply BidenShowerDrool 4 points 6 days ago Govt. is free to take the lint and dead moth from mine. permalink parent award report block reply AutPaxAutBellum300 1 points 6 days ago You get lint? I am jealous. permalink parent award report block reply vongregormench 1 points 6 days ago There’s not enough aids and crime in my city! Could someone introduce more Haitians and Somalians here? permalink parent award report block reply\nIlluminaughty 9 points 6 days ago Build a catapult and launch thy coin towards the abyss of oblivion permalink parent award report block reply Puppy528 7 points 6 days ago Way more helpful than the average government program. permalink parent award report block reply Justlooking250 3 points 6 days ago What about the remnants from the clipping ? 🤣 permalink parent award report block reply Shinydenim 3 points 6 days ago Government is going to have a few words about how big that can be if it means it can’t launch more of your coin permalink parent award report block reply\nPuppy528 7 points 6 days ago Way more helpful than the average government program. permalink parent award report block reply\nJustlooking250 3 points 6 days ago What about the remnants from the clipping ? 🤣 permalink parent award report block reply\nShinydenim 3 points 6 days ago Government is going to have a few words about how big that can be if it means it can’t launch more of your coin permalink parent award report block reply\nBidenShowerDrool 4 points 6 days ago Govt. is free to take the lint and dead moth from mine. permalink parent award report block reply AutPaxAutBellum300 1 points 6 days ago You get lint? I am jealous. permalink parent award report block reply\nAutPaxAutBellum300 1 points 6 days ago You get lint? I am jealous. permalink parent award report block reply\nvongregormench 1 points 6 days ago There’s not enough aids and crime in my city! Could someone introduce more Haitians and Somalians here? permalink parent award report block reply\nBlackPilledMAGA 39 points 6 days ago This cunt is just another in a looooooooong line of retards who have tried socialism. It's never worked, not one time. It's a law of physics at this point. permalink parent award report block reply BidenShowerDrool 9 points 6 days ago He's a believer in Communism hasn't been done right, yet. He may just sprinkle some Sharia in there too. permalink parent award report block reply D__1 8 points 6 days ago AOC's gonna look soooo hot in that burqa. permalink parent award report block reply womp-womp-twice 3 points 6 days ago Well, I mean, if her teeth are covered... permalink parent award report block reply Puppy528 5 points 6 days ago At least when the starvation and suffering comes to NYC, most of the victims won't actually be from New York.. permalink parent award report block reply The_Yakuza 3 points 6 days ago He’s a closeted faggot indian from africa. There’s now way he would implement sharia law. He’s only “muslim” to win votes and get liberal brownie points. permalink parent award report block reply Sparks1017 2 points 6 days ago Yep, and he's just the one to do it right. Hilarious, first thing he does after winning is to say send me money. Aloha snackbar, get fucked permalink parent award report block reply CommanderOfCheese 3 points 5 days ago The fundamental reason why it has never worked is that it can't work even in theory. It's called the problem of information. No centralized body can possibly obtain sufficient information to know how much of any resource should be devoted towards producing something needed by everyone else. We see exactly the approach taken to solve this problem by the Soviets and it's hilarious. For instance, nails. Nails are such a simple and stupid sounding need, but they're essential for construction. There's no way for there to be enough communication to get the right amount of nails to everyone, and they come in a zillion different types according to purpose. The Soviets just planned the need for nail production by weight. The result was the nail makers just produced big nails for everything, because that was the easiest way to make quota. The actual solution to the problem of information is open market pricing. permalink parent award report block reply\nBidenShowerDrool 9 points 6 days ago He's a believer in Communism hasn't been done right, yet. He may just sprinkle some Sharia in there too. permalink parent award report block reply D__1 8 points 6 days ago AOC's gonna look soooo hot in that burqa. permalink parent award report block reply womp-womp-twice 3 points 6 days ago Well, I mean, if her teeth are covered... permalink parent award report block reply Puppy528 5 points 6 days ago At least when the starvation and suffering comes to NYC, most of the victims won't actually be from New York.. permalink parent award report block reply The_Yakuza 3 points 6 days ago He’s a closeted faggot indian from africa. There’s now way he would implement sharia law. He’s only “muslim” to win votes and get liberal brownie points. permalink parent award report block reply Sparks1017 2 points 6 days ago Yep, and he's just the one to do it right. Hilarious, first thing he does after winning is to say send me money. Aloha snackbar, get fucked permalink parent award report block reply\nD__1 8 points 6 days ago AOC's gonna look soooo hot in that burqa. permalink parent award report block reply womp-womp-twice 3 points 6 days ago Well, I mean, if her teeth are covered... permalink parent award report block reply\nwomp-womp-twice 3 points 6 days ago Well, I mean, if her teeth are covered... permalink parent award report block reply\nPuppy528 5 points 6 days ago At least when the starvation and suffering comes to NYC, most of the victims won't actually be from New York.. permalink parent award report block reply\nThe_Yakuza 3 points 6 days ago He’s a closeted faggot indian from africa. There’s now way he would implement sharia law. He’s only “muslim” to win votes and get liberal brownie points. permalink parent award report block reply\nSparks1017 2 points 6 days ago Yep, and he's just the one to do it right. Hilarious, first thing he does after winning is to say send me money. Aloha snackbar, get fucked permalink parent award report block reply\nCommanderOfCheese 3 points 5 days ago The fundamental reason why it has never worked is that it can't work even in theory. It's called the problem of information. No centralized body can possibly obtain sufficient information to know how much of any resource should be devoted towards producing something needed by everyone else. We see exactly the approach taken to solve this problem by the Soviets and it's hilarious. For instance, nails. Nails are such a simple and stupid sounding need, but they're essential for construction. There's no way for there to be enough communication to get the right amount of nails to everyone, and they come in a zillion different types according to purpose. The Soviets just planned the need for nail production by weight. The result was the nail makers just produced big nails for everything, because that was the easiest way to make quota. The actual solution to the problem of information is open market pricing. permalink parent award report block reply\nshadypollster 21 points 6 days ago Waco. They solved it and all the children with fire. permalink parent award report block reply orange_popcicle 5 points 6 days ago You know, I think the government also helped with the Ruby Ridge \"issue\" as well. permalink parent award report block reply\norange_popcicle 5 points 6 days ago You know, I think the government also helped with the Ruby Ridge \"issue\" as well. permalink parent award report block reply\nbooblitchutz 15 points 6 days ago They're working on the biggest problem (for them): an armed and free population. They've enslaved 1/4 of the population already with welfare. permalink parent award report block reply Magma_Biscuit 10 points 6 days ago And 100% of the population with taxes! permalink parent award report block reply booblitchutz 3 points 6 days ago Well as bad as taxes are, and yes they are intended to deliberately hamstring us to prevent us from thriving too much, they are not so much \"slavery\" as welfare is. If you're employed and paying taxes, most of your money (like 50.1%) goes to you. If you're on welfare, you are completely enslaved by the government. permalink parent award report block reply SteelBallRun1890 3 points 6 days ago 50% is absolutely slavery. I treat this like a seller at a card show, 80% minimum or GTFO permalink parent award report block reply KernalMustard 1 points 6 days ago Taxes? Whats that? permalink parent award report block reply sixfingerdildo 8 points 6 days ago public jobs are welfare. permalink parent award report block reply rootGoose 4 points 6 days ago They exist to fight for their own existence. permalink parent award report block reply\nMagma_Biscuit 10 points 6 days ago And 100% of the population with taxes! permalink parent award report block reply booblitchutz 3 points 6 days ago Well as bad as taxes are, and yes they are intended to deliberately hamstring us to prevent us from thriving too much, they are not so much \"slavery\" as welfare is. If you're employed and paying taxes, most of your money (like 50.1%) goes to you. If you're on welfare, you are completely enslaved by the government. permalink parent award report block reply SteelBallRun1890 3 points 6 days ago 50% is absolutely slavery. I treat this like a seller at a card show, 80% minimum or GTFO permalink parent award report block reply KernalMustard 1 points 6 days ago Taxes? Whats that? permalink parent award report block reply\nbooblitchutz 3 points 6 days ago Well as bad as taxes are, and yes they are intended to deliberately hamstring us to prevent us from thriving too much, they are not so much \"slavery\" as welfare is. If you're employed and paying taxes, most of your money (like 50.1%) goes to you. If you're on welfare, you are completely enslaved by the government. permalink parent award report block reply SteelBallRun1890 3 points 6 days ago 50% is absolutely slavery. I treat this like a seller at a card show, 80% minimum or GTFO permalink parent award report block reply\nSteelBallRun1890 3 points 6 days ago 50% is absolutely slavery. I treat this like a seller at a card show, 80% minimum or GTFO permalink parent award report block reply\nKernalMustard 1 points 6 days ago Taxes? Whats that? permalink parent award report block reply\nsixfingerdildo 8 points 6 days ago public jobs are welfare. permalink parent award report block reply rootGoose 4 points 6 days ago They exist to fight for their own existence. permalink parent award report block reply\nrootGoose 4 points 6 days ago They exist to fight for their own existence. permalink parent award report block reply\nFormerlurker92 10 points 6 days ago -people having freedom -too many of the \"wrong types\" being alive -bombing far away people -how to enrich the least capable among us permalink parent award report block reply\nI_Am_John_Galt 39 points 6 days ago I'm from the government and I'm here to help permalink award report block reply InterloperKO 15 points 6 days ago Islamic government* permalink parent award report block reply MrJohnnyD2078 7 points 6 days ago No one ever talks about the fist sentence in that quote, The most terrifying thing an American can hear is...Now add your sentence. permalink parent award report block reply\nInterloperKO 15 points 6 days ago Islamic government* permalink parent award report block reply\nMrJohnnyD2078 7 points 6 days ago No one ever talks about the fist sentence in that quote, The most terrifying thing an American can hear is...Now add your sentence. permalink parent award report block reply\ncjsr4c90 30 points 6 days ago Reagan said it best: \"It's not that our liberal friends know so little, it's that they know so much that isn't so.\" permalink award report block reply\nFormerlurker92 27 points 6 days ago This should terrify everyone with a cursory historical knowledge permalink award report block reply BidenShowerDrool 5 points 6 days ago everyone with a cursory historical knowledge there you go making assumptions about the last 2 generations raised on sugar, video games and very little school and zero history. permalink parent award report block reply Formerlurker92 5 points 6 days ago The department of education has been a rousing success permalink parent award report block reply SurveilThis 3 points 6 days ago Trump should Tariffy socialist governments. permalink parent award report block reply\nBidenShowerDrool 5 points 6 days ago everyone with a cursory historical knowledge there you go making assumptions about the last 2 generations raised on sugar, video games and very little school and zero history. permalink parent award report block reply Formerlurker92 5 points 6 days ago The department of education has been a rousing success permalink parent award report block reply\nFormerlurker92 5 points 6 days ago The department of education has been a rousing success permalink parent award report block reply\nSurveilThis 3 points 6 days ago Trump should Tariffy socialist governments. permalink parent award report block reply\nDev404 17 points 6 days ago Most problems are made WORSE as soon as the government gets involved. This coddled, champagne socialist muslim has never worked a day in his life and that's why he's a retard who would sell the government as the solution to everything. It's the same marketing message as every tyrant looking to weaponize the government. permalink award report block reply Tellman125 12 points 6 days ago He takes office on Jan 1, which means there's still nearly TWO WHOLE MONTHS while he's still in this hyper idealistic phase. Right now he's still in his campaign-rally/debate mode of being a 10th grader all giddy and over-eager to do his class presentation where he gets to impress the stupid woman fake-history teacher with all the bullshit he has memorized from her lectures and reading assignments. He was the most absent assembly member in his 4 years there. So, once he becomes mayor and has to start show up EVERY SINGLE DAY to 2 or 3 crisis locations (fires, gang violence, tragedies, emergencies), or tense union meetings, or business groups, or whatever ethnic group meetings (all sort of NON-Muslim ones he doesn't give a shit about), he'll start burning out fast and unravel and start saying shit that reveals how uninterested, underequipped, and unqualified he is for the job. His campaign was such a breeze, letting his TikTok videos do the work for him, and her kept up the phony grin for the 2 hours of the 2 debates, but he won't be able to keep that fucking phony grin on his face for that many hours a day, and with so many people telling him their stories, complaining to him, pleading with him, and hectoring him. permalink parent award report block reply KernalMustard 4 points 6 days ago He will Be Bidened. A figurehead while the rats have run of the house permalink parent award report block reply SPEDMan64 1 points 6 days ago Kind of hoping he can take care of my mother-in-law and her retard third husband before he unravels. permalink parent award report block reply sixfingerdildo 3 points 6 days ago this mutherfucker knows how stupid the average voter is. permalink parent award report block reply The_Yakuza 1 points 6 days ago “Muslim”. He’s a flaming homo and only muslim by name. permalink parent award report block reply\nTellman125 12 points 6 days ago He takes office on Jan 1, which means there's still nearly TWO WHOLE MONTHS while he's still in this hyper idealistic phase. Right now he's still in his campaign-rally/debate mode of being a 10th grader all giddy and over-eager to do his class presentation where he gets to impress the stupid woman fake-history teacher with all the bullshit he has memorized from her lectures and reading assignments. He was the most absent assembly member in his 4 years there. So, once he becomes mayor and has to start show up EVERY SINGLE DAY to 2 or 3 crisis locations (fires, gang violence, tragedies, emergencies), or tense union meetings, or business groups, or whatever ethnic group meetings (all sort of NON-Muslim ones he doesn't give a shit about), he'll start burning out fast and unravel and start saying shit that reveals how uninterested, underequipped, and unqualified he is for the job. His campaign was such a breeze, letting his TikTok videos do the work for him, and her kept up the phony grin for the 2 hours of the 2 debates, but he won't be able to keep that fucking phony grin on his face for that many hours a day, and with so many people telling him their stories, complaining to him, pleading with him, and hectoring him. permalink parent award report block reply KernalMustard 4 points 6 days ago He will Be Bidened. A figurehead while the rats have run of the house permalink parent award report block reply SPEDMan64 1 points 6 days ago Kind of hoping he can take care of my mother-in-law and her retard third husband before he unravels. permalink parent award report block reply\nKernalMustard 4 points 6 days ago He will Be Bidened. A figurehead while the rats have run of the house permalink parent award report block reply\nSPEDMan64 1 points 6 days ago Kind of hoping he can take care of my mother-in-law and her retard third husband before he unravels. permalink parent award report block reply\nsixfingerdildo 3 points 6 days ago this mutherfucker knows how stupid the average voter is. permalink parent award report block reply\nThe_Yakuza 1 points 6 days ago “Muslim”. He’s a flaming homo and only muslim by name. permalink parent award report block reply\nnpc_1234 13 points 6 days ago There is no problem too large for government to cause. FTFY. permalink award report block reply\nCitizen_Bob 12 points 6 days ago this is fucking insane. permalink award report block reply\nBigIglooActual 7 points 6 days ago Why is this man even in our country? permalink award report block reply\ncornpop_1988 5 points 6 days ago \"From each according to his ability, to each according to his needs\". permalink award report block reply actlikewewon OP 3 points 6 days ago Atlas Shrugged was a prophecy. permalink parent award report block reply CommanderOfCheese 3 points 5 days ago Will Elon Musk become John Galt? permalink parent award report block reply\nactlikewewon OP 3 points 6 days ago Atlas Shrugged was a prophecy. permalink parent award report block reply CommanderOfCheese 3 points 5 days ago Will Elon Musk become John Galt? permalink parent award report block reply\nCommanderOfCheese 3 points 5 days ago Will Elon Musk become John Galt? permalink parent award report block reply\nToxicAvengerOhio 5 points 6 days ago Zzzzzz. This site is already obsessed with this  retard. How many stickies will the fag get per day? permalink award report block reply\nSBOJ_JOBS 4 points 6 days ago Example: Russia, China, and Cambodia had too little food Government Solution: Kill 25% or more of your population. Problem solvede. Easy Peasy! permalink award report block reply\nperma-maga 4 points 6 days ago Government often is the problem. permalink award report block reply\nbooblitchutz 4 points 6 days ago So... he's just another democrat. That's the thing all of us hyperventilating about his election need to remember: he's just another democrat. Yeah he is taking off the \"moderate\" mask a little, making his socialist goals a little more obvious, but that just makes him another corrupt democrat and I'm sure by now he's already been handed more than enough money to play ball with the dem agenda 100%. So Cuomo... Mamndani... Adams... DeBlasio... it's all the same shit in different diapers. permalink award report block reply\nKavantar 3 points 6 days ago Bless his little cold-blooded heart permalink award report block reply\nTyrantsAreCucks 3 points 6 days ago The absolute last thing I want to hear from an elected official permalink award report block reply\ncd3dog 3 points 6 days ago Couldn’t solve the problem of cash bar a the party.  Already no free stuff. permalink award report block reply\nMAGASquatch 3 points 6 days ago How does Big Government solve Big Government? permalink award report block reply\nyou_know_GOAT 3 points 6 days ago His name sounds like some bad guy from the Flash Gordon film back in the 80's. Ming the Merciless was cooler, but his name makes me think of that. permalink award report block reply actlikewewon OP 1 points 6 days ago If I remember, the original Flash Gordon was a talkie too. permalink parent award report block reply SicSemperTyrannis2 0 points 6 days ago He doesn't have a theme song by Queen. permalink parent award report block reply\nactlikewewon OP 1 points 6 days ago If I remember, the original Flash Gordon was a talkie too. permalink parent award report block reply\nSicSemperTyrannis2 0 points 6 days ago He doesn't have a theme song by Queen. permalink parent award report block reply\nkilledmytv 3 points 6 days ago I'm from the Islamic government and I'm here to help myself, infidels permalink award report block reply SicSemperTyrannis2 0 points 6 days ago Read in Achmed the dead terrorist voice permalink parent award report block reply\nSicSemperTyrannis2 0 points 6 days ago Read in Achmed the dead terrorist voice permalink parent award report block reply\nrootGoose 3 points 6 days ago New Yorkers should be more worried that he said there's no problem too small for them to be interested in, as well. No one likes to be micromanaged and it is a vehicle for profound abuse. permalink award report block reply\nbearhugprolapse 3 points 6 days ago pretty rich when it’s patently obvious to anyone with a functioning prefrontal cortex that government is the problem. permalink award report block reply\njml1997 3 points 6 days ago The dipshit would make President Camacho a genius. permalink award report block reply\nDjohnsonsgagreflex 3 points 6 days ago That is a declaration of faith.  Should be considered a violation of the establishment clause. permalink award report block reply KernalMustard 0 points 6 days ago So when a Christian does it its ok..... permalink parent award report block reply\nKernalMustard 0 points 6 days ago So when a Christian does it its ok..... permalink parent award report block reply\nIsrorOrca 3 points 6 days ago No matter how bad this guy fucks up - the non-natives will glaze you and tell you how amazing it is, or blame Trump & Capitalism for sabotaging everything. permalink award report block reply\nredditadminssuckit 3 points 6 days ago Watching the complete destruction in New York and the find out phase for the voting morons of that city is going to be glorious permalink award report block reply Tryhardneckbeard 2 points 6 days ago Huh? all the girls that voted cause Tik Tok said so get to move back home to mom and dads house and not suffer a single fuckin consequence of this.  So the cycle continues. permalink parent award report block reply deleted 1 points 6 days ago PenguinOfDoom 4 points 6 days ago Liberal men are women. permalink parent award report block reply deleted 1 points 6 days ago view 1 more comments... Tryhardneckbeard 2 points 6 days ago Ya but the liberal dudes don't get the same luxury, they get to see how fucked up it all gets and start having icky conservative mind think. permalink parent award report block reply\nTryhardneckbeard 2 points 6 days ago Huh? all the girls that voted cause Tik Tok said so get to move back home to mom and dads house and not suffer a single fuckin consequence of this.  So the cycle continues. permalink parent award report block reply deleted 1 points 6 days ago PenguinOfDoom 4 points 6 days ago Liberal men are women. permalink parent award report block reply deleted 1 points 6 days ago view 1 more comments... Tryhardneckbeard 2 points 6 days ago Ya but the liberal dudes don't get the same luxury, they get to see how fucked up it all gets and start having icky conservative mind think. permalink parent award report block reply\ndeleted 1 points 6 days ago PenguinOfDoom 4 points 6 days ago Liberal men are women. permalink parent award report block reply deleted 1 points 6 days ago view 1 more comments... Tryhardneckbeard 2 points 6 days ago Ya but the liberal dudes don't get the same luxury, they get to see how fucked up it all gets and start having icky conservative mind think. permalink parent award report block reply\nPenguinOfDoom 4 points 6 days ago Liberal men are women. permalink parent award report block reply deleted 1 points 6 days ago view 1 more comments...\ndeleted 1 points 6 days ago view 1 more comments...\nTryhardneckbeard 2 points 6 days ago Ya but the liberal dudes don't get the same luxury, they get to see how fucked up it all gets and start having icky conservative mind think. permalink parent award report block reply\nGottaMemberMyPW 3 points 6 days ago That’s not the government’s job! permalink award report block reply\nSavingPrivateGrace 3 points 6 days ago Little orphan Latino AOC and Daddy Warbucks have a plan for NYC.  These 30 somethings pulling out of thin air enough money to solve everything is what got us into the open borders taking care of illegals the socialist way.  Formulated by a guy who never had a job in his life.  I just want to survive long enough to enjoy a retirement some day. permalink award report block reply\nGeorgeBailey 3 points 6 days ago Idk, the biggest problem the government has faced in the last several decades is the influx of Muslims and Indians into our country. They haven’t really “solved” that whopper of a problem now, have they. permalink award report block reply\nTheAttackTitan 2 points 6 days ago “I’m from the government and I’m here to help” Aaaaand here we are permalink award report block reply\nBoomShtick 2 points 6 days ago “I’m from the government and I am here to help” permalink award report block reply\nSurveilThis 2 points 6 days ago “There is no problem too large for the gov’t to make worse. The bigger the problem, the worse govt will make it. permalink award report block reply\nEdBuck 2 points 6 days ago This is going to get real entertaining. permalink award report block reply\nJbliss 2 points 6 days ago Dude. NYC couldnt fix a skating rink in NYC. How the hell is it going to solve anything under this dipshit? Years ago I read Giuliani's book where he described the painstaking process to lower crime when he was mayor...good luck! permalink award report block reply\nGadsden 2 points 6 days ago He knows better. An economic collapse is good for Islam. When chaos reigns, the \"order\" Islam promises will be welcomed. permalink award report block reply\nNotMyGovernor 2 points 6 days ago Muh not forgetting permalink award report block reply\ndr_gonzo 2 points 6 days ago Think about how unimaginably insane this whole situation is. This little idiot ideologue has never even had a job. Christ he's not even American, plus he's a fucking muslim. And on top of all that, he's a socialist which is very literally the most failed political ideology in the history of the world. But the absurdity doesn't stop there comrades. 80% of New Yorkers said \"affordability\" was their top issue, yet everything is expensive due to the money printing necessitated by our socialist social welfare programs! They seek to use socialism to solve the problem socialism caused. That's like trying to heal a gunshot wound with another gunshot. This might be THE peak level of stupidity in world history. permalink award report block reply\nL74ge9wr 2 points 6 days ago “… with YOUR money”\nThere, fixed it for ya permalink award report block reply\nTyscribz 2 points 6 days ago every time the government tries to solve a problem \"Well it costs 5x more, it's generally a worse product, and the citizens that are still alive had everything they owned stolen from them ...\" permalink award report block reply\nInduceddrag 2 points 6 days ago If you don’t like your problems, wait until you see our solutions. permalink award report block reply\nAut_MAGA_Aut_Nihil 2 points 6 days ago If government could solve anything it would have been solved by now. It’s not like this is a novel idea. permalink award report block reply\nRock9Head 2 points 6 days ago Government is the problem. permalink award report block reply\nKeep_on_winning_kag 2 points 6 days ago Zohan mamadummy went full retard a long time ago. permalink award report block reply\nNow_On_to_Mars 2 points 6 days ago There is no Government Large enough to solve any problem permalink award report block reply\nThe_RedWolf 2 points 6 days ago The most dangerous words you can ever hear are \"I'm from the Government and I'm here to help.\" Going off of memory of Reagan's quote. permalink award report block reply\nSparks1017 2 points 6 days ago I don't want to see this commies face nor hear his voice, same as with obongos. fuck this fucking mooslime permalink award report block reply\nschism 2 points 6 days ago Oh he knows better, he just doesn't care.  He's not stupid. Power at any cost is the goal. permalink award report block reply\nCuttinmuffins 2 points 6 days ago Any fool that actually believes a word out of the pos mouth is a serious dumbass. He is not here to help anything. He is here to pave the way for Islam or communism. Either way he was placed there to do this, like Obama was. All statements like this buy him is a bit more time while the I told you so crowd watch patiently  bemused as he digs the holes he is meant to dog on the 1st place. He needs to be deported immediately. permalink award report block reply\n559throw 2 points 6 days ago Literally everything the government touches turns to flaming dogshit permalink award report block reply\nSunnybats2 2 points 6 days ago Like DEPORT DEPORT DEPORT?! permalink award report block reply\nPunishedOrange 2 points 6 days ago no kings right? permalink award report block reply\nTrumpwonbidencheated 2 points 6 days ago The government can fuck up a wet dream. permalink award report block reply\nKimball_Kinnison 2 points 6 days ago The quote in meme form: https://patriots.win/p/1ARK52Asi5/the-democratic-party-has-gone-fu/c/ permalink award report block reply\nTheWhitestOfFangs 1 points 6 days ago I think government itself is a problem too big for government to solve permalink award report block reply\nImnotnorm 1 points 6 days ago Cut to Rand Paul bolting awake, sweaty....\" oh thank God, it was just a nightmare\" permalink award report block reply\nSnooptwo 1 points 6 days ago Hunger problem? Kill people. Consensus problem? Kill people. Housing problem? Kill people. Their problem solving always ends with killing people. permalink award report block reply\nPeterThielAntiChrist 1 points 6 days ago the market is not producing solutions as is. expect people to look elsewhere unless the market can free itself from monopoly corruption. permalink award report block reply\ngb1787 1 points 6 days ago There is no problem so small that government is capable of solving it. FIFY permalink award report block reply\nDITTOPatriot 1 points 6 days ago Why are the Zionists so mad at this fellow? Is kissing the wall that important? permalink award report block reply\nSteve56775 1 points 6 days ago Name one problem the government has solved. permalink award report block reply\nNoseeboh 1 points 6 days ago What does the government do when government is the big problem? permalink award report block reply\nReleasetheList 1 points 6 days ago It doesn't matter how badly he runs the city. He or another communist will be elected next election. Demographics are destiny. permalink award report block reply\npugsan 1 points 6 days ago No socialist or communists has ever truly believed this. It's better to just meme the constant flow a naive, propagandized sheep that do, while perhaps having the socialists/communists laughing in the background. permalink award report block reply\nCrackerSmurf2 1 points 6 days ago There is a problem Nazi Commie faggot Arabians decide they think they taking over this place. =) permalink award report block reply\nTheSHazDroid 1 points 6 days ago \"The nine most terrifying words in the English language are: I'm from the government and I'm here to help.\" Ronald Reagan permalink award report block reply\nMeddlesom 1 points 6 days ago He is a problem.  Can government solve him? permalink award report block reply\nAbrahamLincoln 1 points 6 days ago I'd like to see the \"goatfuckers invading our country\" problem solved. permalink award report block reply\nbluewhiteandred 1 points 6 days ago seeing the comments here: pretend the NYC government in this instance is like one corporation like amazon trying to provide services for everything obviously there are problems with this but companies like amazon do end up providing a lot of services so I could see this going in a lot of directions besides what some of the comments think (that it will simply fail, which is very possible). could be \"ok\", could even be \"really good\", could be \"pretty awful\". but important to note that it could be functional to some extent, luring more people to want socialism. (also could be functional in that it is dependent on capitalist corps around it) edit: important to note some of the downsides of \"capitalism\" and socialism here bad \"capitalist\" corps today actually can act kind of \"fascist\" and do a worse job perhaps than some \"socialist\" governments. Take John Deere for example which has tried to lock down its products and prevent farmers from working on them with closed software designs. but then take downsides of a socialist gov: might prohibit competition which could drive up costs and stifle freedom which would create disincentives. I'm not totally sure what point I want to make with this. Maybe like beware this working to some extent, of them finding a way to create an illusion of it working? or of it genuinely working as a counter to \"bad corporations\" which do a bad job? back in early 2010s we had the tea party protesting big government (that would be Mamdani here) and occupy wallstreet protesting big bad corporations (that would be john deere in my example here, but I'm not intending to single out john deere or any one big corp, just trying to point to a specific harmful behavior that I thought john deere engaged in, of limiting working on the farming equipment that farmers owned). the problem is big government AND big corporations here. Mamdani may create something functional in truly opposing big bad corporations, but doesn't address the \"big bad government\" problem. A lot of \"capitalists\" on the right don't necessarily address the \"big bad corporations\" problem, maybe? permalink award report block reply roflcopt0rz_returns 2 points 6 days ago The main difference between a mega corporation like Amazon versus the government is that Amazon at the end of the day needs to make a profit, so there’s a limit to how much they can fuck over their workers or the customers or else they will leave and Amazon stops making money. The government is not beholden to anyone as long as they get elected. And they’ve shown they will money print, assassinate, steal elections, sic their police/army lapdogs, etc., all things that the mega corps can’t do. They have zero incentive to actually appeal to the people as long as they don’t piss off the people enough to where the people rise up and slay them. permalink parent award report block reply bluewhiteandred 1 points 6 days ago I kind of agree with what you're saying but let me see if there's anything I can question about it gov does have limits like amazon, i.e. people revolting if it got too out of hand? mega corps can engage in some of the shady things you mention like influence elections they can also get away with a lot of things because the average person can't necessarily start up a competitor easily and lots of random average person choose to do business with them rather than support smaller businesses sometimes, so although they need to make a profit they still have a lot of leverage? corps and gov are often run by the same people: gov gives big corps tax breaks and grants, gov bails out failing companies and banks, corp money is used to lobby for laws and electing people to push policies that favor the corps, etc. so, not really disagreeing necessarily, just trying to further the convo and add to what you described? permalink parent award report block reply roflcopt0rz_returns 1 points 6 days ago Yes, mega corps can throw their weight around to do unlawful and immoral stuff, but nowhere near to the extent the government can. Again, the government has a monopoly on violence as they control the police, army, alphabet agencies, etc. They also have more money than megacorps because they have money printer. Stopping the government from overreach of their authority will require you to actually stand up to them and often requires overthrowing them. Much different than just simply not shopping with Amazon and giving them money. Because Amazon cannot put a gun to your head and force you to obey by threat of violence or imprisonment. The government can. Mega corps can and do bully small businesses. But government can bully small businesses AND mega corps. permalink parent award report block reply ChilledCovfefe 1 points 5 days ago Both of you made excellent points. Let me take it one step further. I think we are in quasi fascism right now. Government and corporations are married together. Not all of them but pretty much ALL of the biggest ones.  Government uses them as their browshirts. The government uses corps and NGOs by proxy to implement policies that are against the law. Like vaccine rules during Covid, censorship, immigration etc.  With Trump in office it has been curtailed for now but I think we need to sever almost all government, corporate and NGO relationships or we are toast. The NGO shit was really started by Obama with the first 2000 page stimulus bill that created the first trillion dollar injections into leftist NGOs. The NGO and foundations need to be destroyed. permalink parent award report block reply view 1 more comments...\nroflcopt0rz_returns 2 points 6 days ago The main difference between a mega corporation like Amazon versus the government is that Amazon at the end of the day needs to make a profit, so there’s a limit to how much they can fuck over their workers or the customers or else they will leave and Amazon stops making money. The government is not beholden to anyone as long as they get elected. And they’ve shown they will money print, assassinate, steal elections, sic their police/army lapdogs, etc., all things that the mega corps can’t do. They have zero incentive to actually appeal to the people as long as they don’t piss off the people enough to where the people rise up and slay them. permalink parent award report block reply bluewhiteandred 1 points 6 days ago I kind of agree with what you're saying but let me see if there's anything I can question about it gov does have limits like amazon, i.e. people revolting if it got too out of hand? mega corps can engage in some of the shady things you mention like influence elections they can also get away with a lot of things because the average person can't necessarily start up a competitor easily and lots of random average person choose to do business with them rather than support smaller businesses sometimes, so although they need to make a profit they still have a lot of leverage? corps and gov are often run by the same people: gov gives big corps tax breaks and grants, gov bails out failing companies and banks, corp money is used to lobby for laws and electing people to push policies that favor the corps, etc. so, not really disagreeing necessarily, just trying to further the convo and add to what you described? permalink parent award report block reply roflcopt0rz_returns 1 points 6 days ago Yes, mega corps can throw their weight around to do unlawful and immoral stuff, but nowhere near to the extent the government can. Again, the government has a monopoly on violence as they control the police, army, alphabet agencies, etc. They also have more money than megacorps because they have money printer. Stopping the government from overreach of their authority will require you to actually stand up to them and often requires overthrowing them. Much different than just simply not shopping with Amazon and giving them money. Because Amazon cannot put a gun to your head and force you to obey by threat of violence or imprisonment. The government can. Mega corps can and do bully small businesses. But government can bully small businesses AND mega corps. permalink parent award report block reply ChilledCovfefe 1 points 5 days ago Both of you made excellent points. Let me take it one step further. I think we are in quasi fascism right now. Government and corporations are married together. Not all of them but pretty much ALL of the biggest ones.  Government uses them as their browshirts. The government uses corps and NGOs by proxy to implement policies that are against the law. Like vaccine rules during Covid, censorship, immigration etc.  With Trump in office it has been curtailed for now but I think we need to sever almost all government, corporate and NGO relationships or we are toast. The NGO shit was really started by Obama with the first 2000 page stimulus bill that created the first trillion dollar injections into leftist NGOs. The NGO and foundations need to be destroyed. permalink parent award report block reply view 1 more comments...\nbluewhiteandred 1 points 6 days ago I kind of agree with what you're saying but let me see if there's anything I can question about it gov does have limits like amazon, i.e. people revolting if it got too out of hand? mega corps can engage in some of the shady things you mention like influence elections they can also get away with a lot of things because the average person can't necessarily start up a competitor easily and lots of random average person choose to do business with them rather than support smaller businesses sometimes, so although they need to make a profit they still have a lot of leverage? corps and gov are often run by the same people: gov gives big corps tax breaks and grants, gov bails out failing companies and banks, corp money is used to lobby for laws and electing people to push policies that favor the corps, etc. so, not really disagreeing necessarily, just trying to further the convo and add to what you described? permalink parent award report block reply roflcopt0rz_returns 1 points 6 days ago Yes, mega corps can throw their weight around to do unlawful and immoral stuff, but nowhere near to the extent the government can. Again, the government has a monopoly on violence as they control the police, army, alphabet agencies, etc. They also have more money than megacorps because they have money printer. Stopping the government from overreach of their authority will require you to actually stand up to them and often requires overthrowing them. Much different than just simply not shopping with Amazon and giving them money. Because Amazon cannot put a gun to your head and force you to obey by threat of violence or imprisonment. The government can. Mega corps can and do bully small businesses. But government can bully small businesses AND mega corps. permalink parent award report block reply ChilledCovfefe 1 points 5 days ago Both of you made excellent points. Let me take it one step further. I think we are in quasi fascism right now. Government and corporations are married together. Not all of them but pretty much ALL of the biggest ones.  Government uses them as their browshirts. The government uses corps and NGOs by proxy to implement policies that are against the law. Like vaccine rules during Covid, censorship, immigration etc.  With Trump in office it has been curtailed for now but I think we need to sever almost all government, corporate and NGO relationships or we are toast. The NGO shit was really started by Obama with the first 2000 page stimulus bill that created the first trillion dollar injections into leftist NGOs. The NGO and foundations need to be destroyed. permalink parent award report block reply view 1 more comments...\nroflcopt0rz_returns 1 points 6 days ago Yes, mega corps can throw their weight around to do unlawful and immoral stuff, but nowhere near to the extent the government can. Again, the government has a monopoly on violence as they control the police, army, alphabet agencies, etc. They also have more money than megacorps because they have money printer. Stopping the government from overreach of their authority will require you to actually stand up to them and often requires overthrowing them. Much different than just simply not shopping with Amazon and giving them money. Because Amazon cannot put a gun to your head and force you to obey by threat of violence or imprisonment. The government can. Mega corps can and do bully small businesses. But government can bully small businesses AND mega corps. permalink parent award report block reply ChilledCovfefe 1 points 5 days ago Both of you made excellent points. Let me take it one step further. I think we are in quasi fascism right now. Government and corporations are married together. Not all of them but pretty much ALL of the biggest ones.  Government uses them as their browshirts. The government uses corps and NGOs by proxy to implement policies that are against the law. Like vaccine rules during Covid, censorship, immigration etc.  With Trump in office it has been curtailed for now but I think we need to sever almost all government, corporate and NGO relationships or we are toast. The NGO shit was really started by Obama with the first 2000 page stimulus bill that created the first trillion dollar injections into leftist NGOs. The NGO and foundations need to be destroyed. permalink parent award report block reply view 1 more comments...\nChilledCovfefe 1 points 5 days ago Both of you made excellent points. Let me take it one step further. I think we are in quasi fascism right now. Government and corporations are married together. Not all of them but pretty much ALL of the biggest ones.  Government uses them as their browshirts. The government uses corps and NGOs by proxy to implement policies that are against the law. Like vaccine rules during Covid, censorship, immigration etc.  With Trump in office it has been curtailed for now but I think we need to sever almost all government, corporate and NGO relationships or we are toast. The NGO shit was really started by Obama with the first 2000 page stimulus bill that created the first trillion dollar injections into leftist NGOs. The NGO and foundations need to be destroyed. permalink parent award report block reply view 1 more comments...\nentERmyMAtrix 1 points 6 days ago HahhahBhHbBbbBbhahahahahA permalink award report block reply\nTacitus1963 1 points 6 days ago Watch this short 10 minute video about Mamdani and his and his father's connection to the same political ideology that is the ANC and EFF in South Africa. https://youtu.be/KvnUIfvYV_E?si=O0BElYYCjGj8eGjO permalink award report block reply\nNanteen 1 points 6 days ago Remember when the GOP starts pointing out all of his failures next August for the elections. Immediately. Mainstream media will say how everything is Trump's fault permalink award report block reply\nthrowaway29834751 1 points 5 days ago repeal the 1965 immigration act, and limit / reduce immigration from all other countries, western hemisphere included permalink award report block reply\nairmaildolphin 1 points 6 days ago He worships government.  That's my take away from what he said. permalink award report block reply\nwmmiv2016v2 1 points 6 days ago I want to know his definition of \"solve\" permalink award report block reply\nHikedelics 1 points 6 days ago Yes, worship at the altar of the all powerful state! Anything the government has the power to give you, it can and will far more readily take it away. permalink award report block reply\nGosh_darn_hotdog 1 points 6 days ago The second most terrifying 9 words. permalink award report block reply\nnemonster 1 points 6 days ago We? permalink award report block reply\nknnbccb 1 points 6 days ago \"I'm from the government and I'm here to help.\" permalink award report block reply\nduznmatter 1 points 6 days ago Dumb bastard. Even a capitalist government that we supposedly have can't solve a damn thing. permalink award report block reply\nYearninNation 1 points 6 days ago Its going to be embarrassing if he does more tangible things for people that Trump. permalink award report block reply\nAntiCommieAktion 1 points 6 days ago Legalizing prostitution is not solving problems, Zohran permalink award report block reply\nThePatriotGames2016 1 points 6 days ago ie: everything and everyone is the problem. permalink award report block reply\nvongregormench 1 points 6 days ago Well just ask him what problems the government has solved. permalink award report block reply\nMrCuriousGuy513 1 points 6 days ago Big Mama Government is coming to town.\nHow messy can it get? smh permalink award report block reply\nTophat9000 1 points 6 days ago The \"let eat the seed\" thinking (and nothing left to plant for the next season) permalink award report block reply\nMemebot 1 points 6 days ago Government is the problem permalink award report block reply\nIdontevenknow 1 points 6 days ago Problems go away when you murder everyone ~Old Socialist Proverb permalink award report block reply\nkeeman 1 points 6 days ago The first problem he intends to solve is white people having nice things.  I mean after his 5 star vacation in Puerto Rico.  He will presumably then attempt to seize the means of production.  This will be tricky as he doesn't know what the means of production looks like.  He will probably ask his butler if he knows anyone who can help him identify such things. permalink award report block reply\nthisisatestof2 1 points 6 days ago He also said don't give him money, then begged for more money.  Then, in his victory speech said only \"new\" people, and promptly filled his translation team the next day with NYC and even DC insiders within 24 hours. permalink award report block reply\nGarudaDarkblack 1 points 6 days ago If nobody claiming there is a problem is left alive then is there still a problem? That's how communism works. permalink award report block reply\n10gauge 1 points 6 days ago Homelessness kicked the government's ass. permalink award report block reply\nFullyDilated 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply\nEyesSewnShut 1 points 6 days ago Comment removed by community moderators. permalink award report block reply"}