{"id": "1ARK9pgPy7", "contents": "44 She is destroying Europe single-handedly! posted 3 hours ago by Trump2024Train 9 comments award share download report block\n9 comments Sort by Top Top New Worst Old Save NdNcenti 2 points 2 hours ago That’s a mouth you can open beer bottles in permalink award report block reply ganachain 2 points 2 hours ago Looks like she's already been to many a frat party and used this ability! permalink parent award report block reply JtBlaze 2 points 3 hours ago Evil. Purely evil. permalink award report block reply AlwaysTrumper2020 3 points 2 hours ago THAT is the face of a Nazi....... permalink parent award report block reply Califunya 2 points 2 hours ago Pennywise permalink award report block reply SBOJ_JOBS 1 points 2 hours ago She seems nice. permalink award report block reply RudeFrog 1 points 2 hours ago Talk about a shit eating grin permalink award report block reply BigMikesBallz 1 points 1 hour ago Ursula Von snaggle tooth permalink award report block reply Nomolies 1 points 1 hour ago In Europe, even the wealthy have terrible teeth because of the lack of orthodontists and adequate dental care under socialized medicine.  This is especially noticeable in England and Ireland, because the mixture of Celtic, Saxon, Nordic, and French ancestors leaves many of their descendants with teeth that are out of proportion to their jaws.  But this is also true of many  in other European countries. Good dental care and orthodontists are for the ignorant and unenlightened capitalist bourgeoisie. Enjoy: https://www.youtube.com/watch?v=jnOhuFynUOc permalink award report block reply\nNdNcenti 2 points 2 hours ago That’s a mouth you can open beer bottles in permalink award report block reply ganachain 2 points 2 hours ago Looks like she's already been to many a frat party and used this ability! permalink parent award report block reply\nganachain 2 points 2 hours ago Looks like she's already been to many a frat party and used this ability! permalink parent award report block reply\nJtBlaze 2 points 3 hours ago Evil. Purely evil. permalink award report block reply AlwaysTrumper2020 3 points 2 hours ago THAT is the face of a Nazi....... permalink parent award report block reply\nAlwaysTrumper2020 3 points 2 hours ago THAT is the face of a Nazi....... permalink parent award report block reply\nCalifunya 2 points 2 hours ago Pennywise permalink award report block reply\nSBOJ_JOBS 1 points 2 hours ago She seems nice. permalink award report block reply\nRudeFrog 1 points 2 hours ago Talk about a shit eating grin permalink award report block reply\nBigMikesBallz 1 points 1 hour ago Ursula Von snaggle tooth permalink award report block reply\nNomolies 1 points 1 hour ago In Europe, even the wealthy have terrible teeth because of the lack of orthodontists and adequate dental care under socialized medicine.  This is especially noticeable in England and Ireland, because the mixture of Celtic, Saxon, Nordic, and French ancestors leaves many of their descendants with teeth that are out of proportion to their jaws.  But this is also true of many  in other European countries. Good dental care and orthodontists are for the ignorant and unenlightened capitalist bourgeoisie. Enjoy: https://www.youtube.com/watch?v=jnOhuFynUOc permalink award report block reply"}