{"id": "1ARK9pgQIr", "contents": "39 Michelle Obama: \"Black female beauty is so powerful, we are owed respect\" posted 2 hours ago by IlhansBrother 15 comments award share report block Matt Walsh @MattWalshBlog • 15h \"We have to educate people about our beauty\" Yes, I have often said that if anyone doesn't find me physically attractive, it's because they lack proper education End Wokeness @EndWokeness • 20h Michelle Obama: \"Black female beauty is so powerful, we are owed respect\"\n15 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno Flubadub 7 points 2 hours ago That man is so incredibly self centered, delusional, narcissistic and absolutely insane!!! permalink award report block reply Nerdrem3 5 points 2 hours ago Black women are the least desirable of all races of women, including to black men. permalink award report block reply DiamondDroid 3 points 2 hours ago Wrong on so many levels it's staggering. permalink award report block reply DeadPuppiesAreNotFun 3 points 54 minutes ago She’s not:  sexy Smart Beautiful Or A woman She is black. permalink award report block reply 202_ 3 points 47 minutes ago *he permalink parent award report block reply MagaJay02 3 points 2 hours ago Beauty is in the eye of the beholder... and nobody with true physical beauty has to \"educate\" others on their beauty... because we can all see it for ourselves. permalink award report block reply iamstadter 3 points 1 hour ago Respect is not given; it is earned. permalink award report block reply Jack_NC 3 points 2 hours ago Michelle, why do you disrespect black beauty by relaxing your hair to resemble other races? permalink award report block reply Wizard_Glick 3 points 2 hours ago Respect is earned... permalink award report block reply Scot 3 points 2 hours ago This reminds me of when demons try to tell us what a real Christian is. permalink award report block reply abstr4ct 2 points 52 minutes ago White female beauty is so powerful, we are owed respect. absolutely, absolutely. permalink award report block reply starjello 2 points 50 minutes ago Big Mike Obama is indeed a disgusting creature. permalink award report block reply 26magarat 1 points 2 hours ago There are ugly and beautiful people of all races. Most are in between, so looks shouldn't matter all that much. permalink award report block reply UntakenUsername 1 points 2 hours ago What? You guys don't like the skeleton-wrapped-in-electrical-tape look? permalink award report block reply RudeFrog 1 points 12 minutes ago Respect me because I am beautiful! Makes perfect sense when you don't think about it. permalink award report block reply Trajano 1 points 9 minutes ago It is like modern art; if you need to explain the art to understand its beauty, then it is not beautiful or artistic at all. permalink award report block reply\nFlubadub 7 points 2 hours ago That man is so incredibly self centered, delusional, narcissistic and absolutely insane!!! permalink award report block reply\nNerdrem3 5 points 2 hours ago Black women are the least desirable of all races of women, including to black men. permalink award report block reply\nDiamondDroid 3 points 2 hours ago Wrong on so many levels it's staggering. permalink award report block reply\nDeadPuppiesAreNotFun 3 points 54 minutes ago She’s not:  sexy Smart Beautiful Or A woman She is black. permalink award report block reply 202_ 3 points 47 minutes ago *he permalink parent award report block reply\n202_ 3 points 47 minutes ago *he permalink parent award report block reply\nMagaJay02 3 points 2 hours ago Beauty is in the eye of the beholder... and nobody with true physical beauty has to \"educate\" others on their beauty... because we can all see it for ourselves. permalink award report block reply\niamstadter 3 points 1 hour ago Respect is not given; it is earned. permalink award report block reply\nJack_NC 3 points 2 hours ago Michelle, why do you disrespect black beauty by relaxing your hair to resemble other races? permalink award report block reply\nWizard_Glick 3 points 2 hours ago Respect is earned... permalink award report block reply\nScot 3 points 2 hours ago This reminds me of when demons try to tell us what a real Christian is. permalink award report block reply\nabstr4ct 2 points 52 minutes ago White female beauty is so powerful, we are owed respect. absolutely, absolutely. permalink award report block reply\nstarjello 2 points 50 minutes ago Big Mike Obama is indeed a disgusting creature. permalink award report block reply\n26magarat 1 points 2 hours ago There are ugly and beautiful people of all races. Most are in between, so looks shouldn't matter all that much. permalink award report block reply\nUntakenUsername 1 points 2 hours ago What? You guys don't like the skeleton-wrapped-in-electrical-tape look? permalink award report block reply\nRudeFrog 1 points 12 minutes ago Respect me because I am beautiful! Makes perfect sense when you don't think about it. permalink award report block reply\nTrajano 1 points 9 minutes ago It is like modern art; if you need to explain the art to understand its beauty, then it is not beautiful or artistic at all. permalink award report block reply"}