{"id": "1ARK9nOo7F", "contents": "38 How It Feels Right Now posted 8 hours ago by HumblePepe 5 comments award share download report block\n5 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style TrumpWonByALandslide 2 points 8 hours ago The left one should say \"Next time I'll vote Democrat!\" permalink award report block reply NoahGav 2 points 6 hours ago It's the left leg stepping on them so it makes sense the way it is. permalink parent award report block reply TrumpWonByALandslide 1 points 6 hours ago I get that. I didn't misspeak. permalink parent award report block reply NoahGav 1 points 6 hours ago I see. permalink parent award report block reply alizarinslytherin 1 points 6 hours ago Comment removed by community moderators. permalink parent award report block reply\nTrumpWonByALandslide 2 points 8 hours ago The left one should say \"Next time I'll vote Democrat!\" permalink award report block reply NoahGav 2 points 6 hours ago It's the left leg stepping on them so it makes sense the way it is. permalink parent award report block reply TrumpWonByALandslide 1 points 6 hours ago I get that. I didn't misspeak. permalink parent award report block reply NoahGav 1 points 6 hours ago I see. permalink parent award report block reply alizarinslytherin 1 points 6 hours ago Comment removed by community moderators. permalink parent award report block reply\nNoahGav 2 points 6 hours ago It's the left leg stepping on them so it makes sense the way it is. permalink parent award report block reply TrumpWonByALandslide 1 points 6 hours ago I get that. I didn't misspeak. permalink parent award report block reply NoahGav 1 points 6 hours ago I see. permalink parent award report block reply\nTrumpWonByALandslide 1 points 6 hours ago I get that. I didn't misspeak. permalink parent award report block reply NoahGav 1 points 6 hours ago I see. permalink parent award report block reply\nNoahGav 1 points 6 hours ago I see. permalink parent award report block reply\nalizarinslytherin 1 points 6 hours ago Comment removed by community moderators. permalink parent award report block reply"}