{"id": "1ARK52Bhiv", "contents": "719 Father of the year posted 6 days ago by redditadminssuckit 94 comments award share download report block\n94 comments Sort by Top Top New Worst Old Save ESAsher 61 points 6 days ago I'd laugh but the Reddit-to-Tranny pipeline is real and that will ruin your life and kill you early. permalink award report block reply shadypollster 29 points 6 days ago Incel-to-Tranny is real as well. Self hating gay dudes in deep denial they are gay to the point they play dress up and try to convince men \"it's okay (and straight) to date chicks with dicks.\" permalink parent award report block reply goddamnmongorians 9 points 6 days ago There is no suck thing as  a chick with a dick.  There are only dudes with tits. permalink parent award report block reply shadypollster 3 points 6 days ago Yeah true. permalink parent award report block reply AmarilloArmadillo 7 points 6 days ago I shit you not, my brother had a friend do this. His \"girlfriend\" was obviously not and my brother asked him why he went gay.. dude was in major denial.. \"Hannah is a girl\" \"Does 'Hannah' have a penis?\" \"For now.. she's going to have the surgery soon\" \"Do you put yours in it's ass?\" \"Yes, sometimes she does it to me\" \"You're gay as fuck dude\" \"It's a female penis!\" \"Gay\" Guy was fat and stupid.. then he was gay permalink parent award report block reply Standingoak 5 points 6 days ago Life is Tough, But it's Tougher if You're Stupid - John Wayne permalink parent award report block reply shadypollster 2 points 6 days ago HE'S GAY! permalink parent award report block reply AmarilloArmadillo 2 points 6 days ago Gay AF permalink parent award report block reply PM-Melania-feet-pics 15 points 6 days ago Reddit-to-Pedo* (same thing, I know) permalink parent award report block reply IvotedforTrumptwice -3 points 6 days ago I would go so far to say that 99% of trannies are created from abusive parents traumatizing and neglecting their kids, then they get on Reddit looking for answers that should only be found from the loving parents that they don’t have. This father only traumatized his son further by smashing his computer which, will 100% lead to resentment and estrangement. Boomers and Gen-xers: this is not how you love your kids. permalink parent award report block reply 1_Badcop 9 points 6 days ago Young men need a healthy dose of fear of their father if they are to turn out well. That's just the nature of a healthy father/son relationship. 99% (more or less) of trannies are created from porn addiction and/or molestation. The problem is exacerbated when there is no father figure to say \"knock that shit off!\" permalink parent award report block reply Smurfection 4 points 6 days ago Trannies are made from autistic kids viewing porn and desperately wanting to fit in but really liking porn. permalink parent award report block reply MakingArrowsOrange 32 points 6 days ago Assuming it's true, Marty should probably sleep with his door locked, in case his son has thoughts about killing him in his sleep over it. permalink award report block reply GuerillaYourDreams 31 points 6 days ago They'll encourage him to do so, on Reddit. permalink parent award report block reply Liberats 15 points 6 days ago He'll need another PC first permalink parent award report block reply RolandDelacroix 5 points 6 days ago Not if he has a smartphone permalink parent award report block reply Liberats 2 points 6 days ago Of course. But it's not the same being in the basement with a smartphone. permalink parent award report block reply Lurkmoore 20 points 6 days ago This is how generations got lost. At some point, \"because I said so\" and breaking things became viewed as an acceptable substitute to establishing authority through wisdom. His son will remember that day as when r/atheism was proven correct. permalink award report block reply patrioticwinning3 14 points 6 days ago So many retarded needle dick faggots cheering this guy on.  I feel sorry for their kids... permalink parent award report block reply redditadminssuckit OP -8 points 6 days ago \"Their\"? Who's the faggot,  Mr pronoun? permalink parent award report block reply DiscountFedoras 8 points 6 days ago How else would you describe a group of people like he did? Mr. Pronouns? He was just being literate permalink parent award report block reply patrioticwinning3 1 points 6 days ago \"Retard alert!  Retard alert!  OP has triggered the Retard Alert!\" https://www.youtube.com/watch?v=eBPqksG9nbA permalink parent award report block reply view 1 more comments... Briben 9 points 6 days ago At some point every man realizes that “because I said so” is the right answer to faggotry. permalink parent award report block reply 45fan 5 points 6 days ago It sure is better than whipping his son until he bleeds. I'm not sure why anyone thinks this is an outlandish response. permalink parent award report block reply Emperorvoid 4 points 6 days ago Not an intelligent Man. An intelligent Man backs up the WHAT with the WHY. \"Because I said so\" is something a moron says who can't back up his ground with intellect. permalink parent award report block reply Fren20 -2 points 6 days ago Ha didn't work for me I spit on my dad's face with this talk permalink parent award report block reply 1_Badcop -3 points 6 days ago It's good that after tens of thousands of years of human behavior you've found a better way of doing things just now. Bravo to you, intelligent man! permalink parent award report block reply Emperorvoid -1 points 6 days ago It's called Psychology. Do you really think the majority of Humans past to present have been intelligent? I'll just cite Carlo Cipolla, David Dunning, and Dietrech Bonhoeffer. permalink parent award report block reply view 5 more comments... someguy99 5 points 6 days ago You would be better of just range-banning reddit from the router... permalink parent award report block reply eddieblasphemy 3 points 6 days ago maybe falling into the fake engagement trap of social media dog shit like this is worse though? permalink parent award report block reply canapede24 0 points 6 days ago Yup... I agree with the fathers stance and I agree with his level or alarm. But as a father who tries to he even handed so I dont make the RETARDED mistakes of my own christian authoritarian father who was a control freak narcissist who rammed christianity down our throats, my kids actually respect me because I take my fatherly inspiration from Christ and not my VERY flawed dad, because of this, they LISTEN and ACT accordingly when I warn them about things, whether its girls, shit on the internet, IDEAS...etc. I would be heart broken if I learned my sons saw me in the same way i saw my dad, and smashing my kids PC like this would be a sure fire way of making that happen. permalink parent award report block reply load 3 more comments... slopedroof 16 points 6 days ago Today on driving my son to the thing I don't want him to do... permalink award report block reply TangoMike 12 points 6 days ago Seriously. This son needs a glimpse of his Heavenly Father's love. His physical father sure isn't reflecting that. \"Fathers, do not provoke your children to wrath, but bring them up in the training and admonition of the Lord.\" Eph. 6:4 permalink parent award report block reply kc5ods 6 points 6 days ago yeah but once in awhile you gotta fashion a whip and beat the devil out of the temple. permalink parent award report block reply 1_Badcop 3 points 6 days ago ^This The post clearly says the dad caught the kid again. Kids need consequences to learn. Half the commenters in this thread are going to have sons that grow up to be fags. permalink parent award report block reply kc5ods 2 points 5 days ago tbf my dad would have never broke anything. he'd have sold it for any amount he could get to anyone who wanted it permalink parent award report block reply view 1 more comments... RolandDelacroix 3 points 6 days ago If you can find 10 good men on reddit, I'll admit the dad was wrong. permalink parent award report block reply Fren20 1 points 6 days ago Bullshit a swift kick in the ass permalink parent award report block reply patrioticwinning3 8 points 6 days ago Exactly, retarded, braindead, needle dick dad of the year :p permalink parent award report block reply Fren20 -1 points 6 days ago Nope ,got to make clear you mean business permalink parent award report block reply PM-Melania-feet-pics 4 points 6 days ago I'd assume he was already warned to stay off Reddit.  For good reason. permalink parent award report block reply Electricutie 15 points 6 days ago But destroying his stuff as a substitute for explaining why it's detrimental in a way that resonates with the child isn't likely to lead to positive results. permalink parent award report block reply ESAsher 5 points 6 days ago True and we don't have enough information form this to decide where this falls but there is certainly a time for explanation and there is a time for punishment. permalink parent award report block reply 1_Badcop 3 points 6 days ago Considering the dad specifically said \"... again ...\" I'm confident there had been a previous discussion(s). Some young men are amenable to discourse. Others need a firmer demonstration. Communication ought to be tailored to the recipient to be effective, no? permalink parent award report block reply patrioticwinning3 1 points 6 days ago Ever meet one of those hardcore Christian hating atheists?  Who won't listen to reason in the slightest?  Some may be retarded, but others were created by retarded faggots like this! permalink parent award report block reply Emperorvoid 12 points 6 days ago This is moronic. Using force to think a certain way is absolutely retarded when it comes to a Father teaching his Son. You can try to cram the WHAT down his throat as much as you want, but if you don't have the intellect to teach him the WHY, you are just a moron, no matter what side you are on. WE have the reality based, reasoned logical WHY on our side. We function more from Logos, than Pathos. Sure the Right will also operate from an Ethos argument as well, but the LOGIC IS ON OUR SIDE. Emotions are on the Left. You are using your EMOTION against your Son who will only rebel harder. Not Father of the Year. Moron! :Edit: The more I read the replies to this post, the more I understand how so many of you will fail your children. You're dumb as fuck. You just make them rebel harder. You are not good Fathers. permalink award report block reply GarudaDarkblack 4 points 6 days ago Lot's of people here complain about the left using violence to get their way and \"prove their point\" but whe our side does it they cheer. The hypocrisy is suffocating. I can't imagine doing this to my child because I'm not retarded and neither is my child. permalink parent award report block reply Emperorvoid 1 points 6 days ago There is a vast divide between opinion and conclusion. Most people have opinions. Most people, and it doesn't matter what side, are NPC's. The difference is if they had an opinion or a conclusion. If they came to know the WHY beyond the WHAT. permalink parent award report block reply Fren20 1 points 6 days ago I did this to my husbands t.v ..I guess I'm retarded I got a bigger t.v permalink parent award report block reply IForgotToAddAnEmail 1 points 6 days ago Your husband got a bigger TV, you just think you own it. permalink parent award report block reply 1_Badcop 2 points 6 days ago The more I read your comments, the harder I weep for your sons. permalink parent award report block reply Emperorvoid 2 points 6 days ago One of my Sons was taking College courses while in Jr High. He also loved Meditations by Marcus Aurelius. I could easily hand the keyboard over to him to school you on a variety of subjects. My other Son would just call you a Faggot. permalink parent award report block reply 1_Badcop -2 points 6 days ago Really? Who is their real father? permalink parent award report block reply Fren20 0 points 6 days ago Nope no dummy here, like a snake you have to move fast with quick actions...ssss permalink parent award report block reply DarthEP 5 points 6 days ago Whose PC? Who Pays The Mortgage/Rent...? And Who Sucks Up All The Food & Heat? permalink award report block reply stevethefish76 4 points 6 days ago I dunno... he could maybe try talking to his son rather than smashing stuff. My own daughter is a teenager and was going down the atheism route starting a couple of years ago due to school curriculum indoctrination. That plus global warming bullcrap. I've changed her direction back to God and I didn't have to smash anything. permalink award report block reply 1_Badcop 2 points 6 days ago If you had both daughters and sons, you'd know not to treat them the same, because they aren't the same. You see, women and men may be considered to be equal, but they are not the same. permalink parent award report block reply stevethefish76 3 points 6 days ago Smashing the kid's computer will only breed resentment. You can't just damage property like that. If anything at all, it sets a very bad example. If parents cannot control their temper, then their children will not be able to control their temper because their parents have set the precedent. Unplug the computer, ground him. Fine. Smashing property like that is terrible. permalink parent award report block reply XLNutts -1 points 5 days ago Or you could just give him a \"timeout.\" No thanks. That's the kind of faggy shit that got us into this mess. permalink parent award report block reply redditadminssuckit OP 1 points 6 days ago Perhaps.  I get the impression that talking was ineffective. permalink parent award report block reply 1_Badcop 1 points 6 days ago Based upon the \"again\" yes. I can't believe how many of your retarded commenters missed that or ignored it. permalink parent award report block reply Fren20 -1 points 6 days ago I smashed my husband's t.v nothing wrong with it permalink parent award report block reply 1_Badcop 3 points 6 days ago If there is nothing wrong with it, you obviously didn't smash it hard enough. Too bad women have such weak upper body strength! permalink parent award report block reply cosmos411 3 points 6 days ago and if the kid has a smart phone then promptly replace it with a generic flip phone. permalink award report block reply BlackJack1776 3 points 6 days ago Rotory. Plugged into the living room wall. Worked wonders for generations. permalink parent award report block reply redditadminssuckit OP 1 points 6 days ago Fuck that give him some first class stamps, a pen, paper, and a few envelopes.... or he can walk to whomever he wants to communicate with. And of course whatever you spend on writing materials will have to come out of the budget for food that he is fed permalink parent award report block reply gorilla_grip 3 points 6 days ago I wish to God I did this when my son was on Reddit. Kudos to this guy permalink award report block reply Liberats 2 points 6 days ago Fucking awesome! permalink award report block reply the-new-style 2 points 6 days ago In about 2014 you fucking farmer permalink award report block reply Bearing51 2 points 6 days ago Smart man. permalink award report block reply Emperorvoid 2 points 6 days ago Dumb Man! permalink parent award report block reply cook_does 2 points 6 days ago Marty is Based permalink award report block reply Emperorvoid 4 points 6 days ago Marty is a moron. Kids going to rebel harder now. He didn't teach him anything other than let your emotion rule you. He should have taught reason. He should have taught the WHAT, and more importantly the WHY! Why are there so many low intellect people posting this bs? No fucking smarts. NONE! permalink parent award report block reply Fren20 -2 points 6 days ago Hmmm I smashed my husband's t.v ...I got a bigger one permalink parent award report block reply Michalusmichalus 2 points 6 days ago This shit is child abuse. Posting it proudly on social media gets kids taken away. That trend a few years ago making kids cry shaving them bald got a whole lot of kids taken away. The reasoning was the parents clearly can't distinguish appropriate from inappropriate. permalink award report block reply ActNow 2 points 6 days ago When my son was a kid, his friend was given a Nintendo DS (IIRC). He had parameters for when he could play it, but started sneaking out of his room at night to get it. Went hunting with his father and was caught with the DS again. Dad had had enough and smashed it into a million pieces against a tree. permalink award report block reply Counterwhat 1 points 6 days ago Now that's parenting. Tell your son, no you can go work for your own PC and Internet. permalink award report block reply TrumpyOldMan 1 points 5 days ago This dad is a retard. Now his son will rebel and become more fervent in his atheism. The dad resorts to censorship and violent demonic behavior to get his way. What a faggot permalink award report block reply shiggins9 0 points 6 days ago This seems like Things that didn't Happen for 200. But I've never been convinced of the miracles in the Bible. A lot of great lessons in there, but if a kid is skeptical of believing the Bible because God told people these things, he definitely won't believe it now as his dad did not allow him to question it. permalink award report block reply helenvsgladys 0 points 6 days ago No that's a psycho and he's pushing his kid toward reactionary reddit identities with his psychotic behavior. permalink award report block reply Gman75 0 points 6 days ago So rather than have a talk with his son, he decides to destroy what likely his son views as important...? If you are actively trying to drive your kid further from you and your values, then yeah, great job. permalink award report block reply corntortilla 0 points 6 days ago More like idiot of the year. permalink award report block reply cltr1 0 points 6 days ago You messed up his childhood, its on you to get him an AR-15 now. permalink award report block reply\nESAsher 61 points 6 days ago I'd laugh but the Reddit-to-Tranny pipeline is real and that will ruin your life and kill you early. permalink award report block reply shadypollster 29 points 6 days ago Incel-to-Tranny is real as well. Self hating gay dudes in deep denial they are gay to the point they play dress up and try to convince men \"it's okay (and straight) to date chicks with dicks.\" permalink parent award report block reply goddamnmongorians 9 points 6 days ago There is no suck thing as  a chick with a dick.  There are only dudes with tits. permalink parent award report block reply shadypollster 3 points 6 days ago Yeah true. permalink parent award report block reply AmarilloArmadillo 7 points 6 days ago I shit you not, my brother had a friend do this. His \"girlfriend\" was obviously not and my brother asked him why he went gay.. dude was in major denial.. \"Hannah is a girl\" \"Does 'Hannah' have a penis?\" \"For now.. she's going to have the surgery soon\" \"Do you put yours in it's ass?\" \"Yes, sometimes she does it to me\" \"You're gay as fuck dude\" \"It's a female penis!\" \"Gay\" Guy was fat and stupid.. then he was gay permalink parent award report block reply Standingoak 5 points 6 days ago Life is Tough, But it's Tougher if You're Stupid - John Wayne permalink parent award report block reply shadypollster 2 points 6 days ago HE'S GAY! permalink parent award report block reply AmarilloArmadillo 2 points 6 days ago Gay AF permalink parent award report block reply PM-Melania-feet-pics 15 points 6 days ago Reddit-to-Pedo* (same thing, I know) permalink parent award report block reply IvotedforTrumptwice -3 points 6 days ago I would go so far to say that 99% of trannies are created from abusive parents traumatizing and neglecting their kids, then they get on Reddit looking for answers that should only be found from the loving parents that they don’t have. This father only traumatized his son further by smashing his computer which, will 100% lead to resentment and estrangement. Boomers and Gen-xers: this is not how you love your kids. permalink parent award report block reply 1_Badcop 9 points 6 days ago Young men need a healthy dose of fear of their father if they are to turn out well. That's just the nature of a healthy father/son relationship. 99% (more or less) of trannies are created from porn addiction and/or molestation. The problem is exacerbated when there is no father figure to say \"knock that shit off!\" permalink parent award report block reply Smurfection 4 points 6 days ago Trannies are made from autistic kids viewing porn and desperately wanting to fit in but really liking porn. permalink parent award report block reply\nshadypollster 29 points 6 days ago Incel-to-Tranny is real as well. Self hating gay dudes in deep denial they are gay to the point they play dress up and try to convince men \"it's okay (and straight) to date chicks with dicks.\" permalink parent award report block reply goddamnmongorians 9 points 6 days ago There is no suck thing as  a chick with a dick.  There are only dudes with tits. permalink parent award report block reply shadypollster 3 points 6 days ago Yeah true. permalink parent award report block reply AmarilloArmadillo 7 points 6 days ago I shit you not, my brother had a friend do this. His \"girlfriend\" was obviously not and my brother asked him why he went gay.. dude was in major denial.. \"Hannah is a girl\" \"Does 'Hannah' have a penis?\" \"For now.. she's going to have the surgery soon\" \"Do you put yours in it's ass?\" \"Yes, sometimes she does it to me\" \"You're gay as fuck dude\" \"It's a female penis!\" \"Gay\" Guy was fat and stupid.. then he was gay permalink parent award report block reply Standingoak 5 points 6 days ago Life is Tough, But it's Tougher if You're Stupid - John Wayne permalink parent award report block reply shadypollster 2 points 6 days ago HE'S GAY! permalink parent award report block reply AmarilloArmadillo 2 points 6 days ago Gay AF permalink parent award report block reply\ngoddamnmongorians 9 points 6 days ago There is no suck thing as  a chick with a dick.  There are only dudes with tits. permalink parent award report block reply shadypollster 3 points 6 days ago Yeah true. permalink parent award report block reply\nshadypollster 3 points 6 days ago Yeah true. permalink parent award report block reply\nAmarilloArmadillo 7 points 6 days ago I shit you not, my brother had a friend do this. His \"girlfriend\" was obviously not and my brother asked him why he went gay.. dude was in major denial.. \"Hannah is a girl\" \"Does 'Hannah' have a penis?\" \"For now.. she's going to have the surgery soon\" \"Do you put yours in it's ass?\" \"Yes, sometimes she does it to me\" \"You're gay as fuck dude\" \"It's a female penis!\" \"Gay\" Guy was fat and stupid.. then he was gay permalink parent award report block reply Standingoak 5 points 6 days ago Life is Tough, But it's Tougher if You're Stupid - John Wayne permalink parent award report block reply shadypollster 2 points 6 days ago HE'S GAY! permalink parent award report block reply AmarilloArmadillo 2 points 6 days ago Gay AF permalink parent award report block reply\nStandingoak 5 points 6 days ago Life is Tough, But it's Tougher if You're Stupid - John Wayne permalink parent award report block reply\nshadypollster 2 points 6 days ago HE'S GAY! permalink parent award report block reply AmarilloArmadillo 2 points 6 days ago Gay AF permalink parent award report block reply\nAmarilloArmadillo 2 points 6 days ago Gay AF permalink parent award report block reply\nPM-Melania-feet-pics 15 points 6 days ago Reddit-to-Pedo* (same thing, I know) permalink parent award report block reply\nIvotedforTrumptwice -3 points 6 days ago I would go so far to say that 99% of trannies are created from abusive parents traumatizing and neglecting their kids, then they get on Reddit looking for answers that should only be found from the loving parents that they don’t have. This father only traumatized his son further by smashing his computer which, will 100% lead to resentment and estrangement. Boomers and Gen-xers: this is not how you love your kids. permalink parent award report block reply 1_Badcop 9 points 6 days ago Young men need a healthy dose of fear of their father if they are to turn out well. That's just the nature of a healthy father/son relationship. 99% (more or less) of trannies are created from porn addiction and/or molestation. The problem is exacerbated when there is no father figure to say \"knock that shit off!\" permalink parent award report block reply Smurfection 4 points 6 days ago Trannies are made from autistic kids viewing porn and desperately wanting to fit in but really liking porn. permalink parent award report block reply\n1_Badcop 9 points 6 days ago Young men need a healthy dose of fear of their father if they are to turn out well. That's just the nature of a healthy father/son relationship. 99% (more or less) of trannies are created from porn addiction and/or molestation. The problem is exacerbated when there is no father figure to say \"knock that shit off!\" permalink parent award report block reply\nSmurfection 4 points 6 days ago Trannies are made from autistic kids viewing porn and desperately wanting to fit in but really liking porn. permalink parent award report block reply\nMakingArrowsOrange 32 points 6 days ago Assuming it's true, Marty should probably sleep with his door locked, in case his son has thoughts about killing him in his sleep over it. permalink award report block reply GuerillaYourDreams 31 points 6 days ago They'll encourage him to do so, on Reddit. permalink parent award report block reply Liberats 15 points 6 days ago He'll need another PC first permalink parent award report block reply RolandDelacroix 5 points 6 days ago Not if he has a smartphone permalink parent award report block reply Liberats 2 points 6 days ago Of course. But it's not the same being in the basement with a smartphone. permalink parent award report block reply\nGuerillaYourDreams 31 points 6 days ago They'll encourage him to do so, on Reddit. permalink parent award report block reply Liberats 15 points 6 days ago He'll need another PC first permalink parent award report block reply RolandDelacroix 5 points 6 days ago Not if he has a smartphone permalink parent award report block reply Liberats 2 points 6 days ago Of course. But it's not the same being in the basement with a smartphone. permalink parent award report block reply\nLiberats 15 points 6 days ago He'll need another PC first permalink parent award report block reply RolandDelacroix 5 points 6 days ago Not if he has a smartphone permalink parent award report block reply Liberats 2 points 6 days ago Of course. But it's not the same being in the basement with a smartphone. permalink parent award report block reply\nRolandDelacroix 5 points 6 days ago Not if he has a smartphone permalink parent award report block reply Liberats 2 points 6 days ago Of course. But it's not the same being in the basement with a smartphone. permalink parent award report block reply\nLiberats 2 points 6 days ago Of course. But it's not the same being in the basement with a smartphone. permalink parent award report block reply\nLurkmoore 20 points 6 days ago This is how generations got lost. At some point, \"because I said so\" and breaking things became viewed as an acceptable substitute to establishing authority through wisdom. His son will remember that day as when r/atheism was proven correct. permalink award report block reply patrioticwinning3 14 points 6 days ago So many retarded needle dick faggots cheering this guy on.  I feel sorry for their kids... permalink parent award report block reply redditadminssuckit OP -8 points 6 days ago \"Their\"? Who's the faggot,  Mr pronoun? permalink parent award report block reply DiscountFedoras 8 points 6 days ago How else would you describe a group of people like he did? Mr. Pronouns? He was just being literate permalink parent award report block reply patrioticwinning3 1 points 6 days ago \"Retard alert!  Retard alert!  OP has triggered the Retard Alert!\" https://www.youtube.com/watch?v=eBPqksG9nbA permalink parent award report block reply view 1 more comments... Briben 9 points 6 days ago At some point every man realizes that “because I said so” is the right answer to faggotry. permalink parent award report block reply 45fan 5 points 6 days ago It sure is better than whipping his son until he bleeds. I'm not sure why anyone thinks this is an outlandish response. permalink parent award report block reply Emperorvoid 4 points 6 days ago Not an intelligent Man. An intelligent Man backs up the WHAT with the WHY. \"Because I said so\" is something a moron says who can't back up his ground with intellect. permalink parent award report block reply Fren20 -2 points 6 days ago Ha didn't work for me I spit on my dad's face with this talk permalink parent award report block reply 1_Badcop -3 points 6 days ago It's good that after tens of thousands of years of human behavior you've found a better way of doing things just now. Bravo to you, intelligent man! permalink parent award report block reply Emperorvoid -1 points 6 days ago It's called Psychology. Do you really think the majority of Humans past to present have been intelligent? I'll just cite Carlo Cipolla, David Dunning, and Dietrech Bonhoeffer. permalink parent award report block reply view 5 more comments... someguy99 5 points 6 days ago You would be better of just range-banning reddit from the router... permalink parent award report block reply eddieblasphemy 3 points 6 days ago maybe falling into the fake engagement trap of social media dog shit like this is worse though? permalink parent award report block reply canapede24 0 points 6 days ago Yup... I agree with the fathers stance and I agree with his level or alarm. But as a father who tries to he even handed so I dont make the RETARDED mistakes of my own christian authoritarian father who was a control freak narcissist who rammed christianity down our throats, my kids actually respect me because I take my fatherly inspiration from Christ and not my VERY flawed dad, because of this, they LISTEN and ACT accordingly when I warn them about things, whether its girls, shit on the internet, IDEAS...etc. I would be heart broken if I learned my sons saw me in the same way i saw my dad, and smashing my kids PC like this would be a sure fire way of making that happen. permalink parent award report block reply load 3 more comments...\npatrioticwinning3 14 points 6 days ago So many retarded needle dick faggots cheering this guy on.  I feel sorry for their kids... permalink parent award report block reply redditadminssuckit OP -8 points 6 days ago \"Their\"? Who's the faggot,  Mr pronoun? permalink parent award report block reply DiscountFedoras 8 points 6 days ago How else would you describe a group of people like he did? Mr. Pronouns? He was just being literate permalink parent award report block reply patrioticwinning3 1 points 6 days ago \"Retard alert!  Retard alert!  OP has triggered the Retard Alert!\" https://www.youtube.com/watch?v=eBPqksG9nbA permalink parent award report block reply view 1 more comments...\nredditadminssuckit OP -8 points 6 days ago \"Their\"? Who's the faggot,  Mr pronoun? permalink parent award report block reply DiscountFedoras 8 points 6 days ago How else would you describe a group of people like he did? Mr. Pronouns? He was just being literate permalink parent award report block reply patrioticwinning3 1 points 6 days ago \"Retard alert!  Retard alert!  OP has triggered the Retard Alert!\" https://www.youtube.com/watch?v=eBPqksG9nbA permalink parent award report block reply view 1 more comments...\nDiscountFedoras 8 points 6 days ago How else would you describe a group of people like he did? Mr. Pronouns? He was just being literate permalink parent award report block reply patrioticwinning3 1 points 6 days ago \"Retard alert!  Retard alert!  OP has triggered the Retard Alert!\" https://www.youtube.com/watch?v=eBPqksG9nbA permalink parent award report block reply view 1 more comments...\npatrioticwinning3 1 points 6 days ago \"Retard alert!  Retard alert!  OP has triggered the Retard Alert!\" https://www.youtube.com/watch?v=eBPqksG9nbA permalink parent award report block reply view 1 more comments...\nBriben 9 points 6 days ago At some point every man realizes that “because I said so” is the right answer to faggotry. permalink parent award report block reply 45fan 5 points 6 days ago It sure is better than whipping his son until he bleeds. I'm not sure why anyone thinks this is an outlandish response. permalink parent award report block reply Emperorvoid 4 points 6 days ago Not an intelligent Man. An intelligent Man backs up the WHAT with the WHY. \"Because I said so\" is something a moron says who can't back up his ground with intellect. permalink parent award report block reply Fren20 -2 points 6 days ago Ha didn't work for me I spit on my dad's face with this talk permalink parent award report block reply 1_Badcop -3 points 6 days ago It's good that after tens of thousands of years of human behavior you've found a better way of doing things just now. Bravo to you, intelligent man! permalink parent award report block reply Emperorvoid -1 points 6 days ago It's called Psychology. Do you really think the majority of Humans past to present have been intelligent? I'll just cite Carlo Cipolla, David Dunning, and Dietrech Bonhoeffer. permalink parent award report block reply view 5 more comments...\n45fan 5 points 6 days ago It sure is better than whipping his son until he bleeds. I'm not sure why anyone thinks this is an outlandish response. permalink parent award report block reply\nEmperorvoid 4 points 6 days ago Not an intelligent Man. An intelligent Man backs up the WHAT with the WHY. \"Because I said so\" is something a moron says who can't back up his ground with intellect. permalink parent award report block reply Fren20 -2 points 6 days ago Ha didn't work for me I spit on my dad's face with this talk permalink parent award report block reply 1_Badcop -3 points 6 days ago It's good that after tens of thousands of years of human behavior you've found a better way of doing things just now. Bravo to you, intelligent man! permalink parent award report block reply Emperorvoid -1 points 6 days ago It's called Psychology. Do you really think the majority of Humans past to present have been intelligent? I'll just cite Carlo Cipolla, David Dunning, and Dietrech Bonhoeffer. permalink parent award report block reply view 5 more comments...\nFren20 -2 points 6 days ago Ha didn't work for me I spit on my dad's face with this talk permalink parent award report block reply\n1_Badcop -3 points 6 days ago It's good that after tens of thousands of years of human behavior you've found a better way of doing things just now. Bravo to you, intelligent man! permalink parent award report block reply Emperorvoid -1 points 6 days ago It's called Psychology. Do you really think the majority of Humans past to present have been intelligent? I'll just cite Carlo Cipolla, David Dunning, and Dietrech Bonhoeffer. permalink parent award report block reply view 5 more comments...\nEmperorvoid -1 points 6 days ago It's called Psychology. Do you really think the majority of Humans past to present have been intelligent? I'll just cite Carlo Cipolla, David Dunning, and Dietrech Bonhoeffer. permalink parent award report block reply view 5 more comments...\nsomeguy99 5 points 6 days ago You would be better of just range-banning reddit from the router... permalink parent award report block reply\neddieblasphemy 3 points 6 days ago maybe falling into the fake engagement trap of social media dog shit like this is worse though? permalink parent award report block reply\ncanapede24 0 points 6 days ago Yup... I agree with the fathers stance and I agree with his level or alarm. But as a father who tries to he even handed so I dont make the RETARDED mistakes of my own christian authoritarian father who was a control freak narcissist who rammed christianity down our throats, my kids actually respect me because I take my fatherly inspiration from Christ and not my VERY flawed dad, because of this, they LISTEN and ACT accordingly when I warn them about things, whether its girls, shit on the internet, IDEAS...etc. I would be heart broken if I learned my sons saw me in the same way i saw my dad, and smashing my kids PC like this would be a sure fire way of making that happen. permalink parent award report block reply\nslopedroof 16 points 6 days ago Today on driving my son to the thing I don't want him to do... permalink award report block reply TangoMike 12 points 6 days ago Seriously. This son needs a glimpse of his Heavenly Father's love. His physical father sure isn't reflecting that. \"Fathers, do not provoke your children to wrath, but bring them up in the training and admonition of the Lord.\" Eph. 6:4 permalink parent award report block reply kc5ods 6 points 6 days ago yeah but once in awhile you gotta fashion a whip and beat the devil out of the temple. permalink parent award report block reply 1_Badcop 3 points 6 days ago ^This The post clearly says the dad caught the kid again. Kids need consequences to learn. Half the commenters in this thread are going to have sons that grow up to be fags. permalink parent award report block reply kc5ods 2 points 5 days ago tbf my dad would have never broke anything. he'd have sold it for any amount he could get to anyone who wanted it permalink parent award report block reply view 1 more comments... RolandDelacroix 3 points 6 days ago If you can find 10 good men on reddit, I'll admit the dad was wrong. permalink parent award report block reply Fren20 1 points 6 days ago Bullshit a swift kick in the ass permalink parent award report block reply patrioticwinning3 8 points 6 days ago Exactly, retarded, braindead, needle dick dad of the year :p permalink parent award report block reply Fren20 -1 points 6 days ago Nope ,got to make clear you mean business permalink parent award report block reply PM-Melania-feet-pics 4 points 6 days ago I'd assume he was already warned to stay off Reddit.  For good reason. permalink parent award report block reply Electricutie 15 points 6 days ago But destroying his stuff as a substitute for explaining why it's detrimental in a way that resonates with the child isn't likely to lead to positive results. permalink parent award report block reply ESAsher 5 points 6 days ago True and we don't have enough information form this to decide where this falls but there is certainly a time for explanation and there is a time for punishment. permalink parent award report block reply 1_Badcop 3 points 6 days ago Considering the dad specifically said \"... again ...\" I'm confident there had been a previous discussion(s). Some young men are amenable to discourse. Others need a firmer demonstration. Communication ought to be tailored to the recipient to be effective, no? permalink parent award report block reply patrioticwinning3 1 points 6 days ago Ever meet one of those hardcore Christian hating atheists?  Who won't listen to reason in the slightest?  Some may be retarded, but others were created by retarded faggots like this! permalink parent award report block reply\nTangoMike 12 points 6 days ago Seriously. This son needs a glimpse of his Heavenly Father's love. His physical father sure isn't reflecting that. \"Fathers, do not provoke your children to wrath, but bring them up in the training and admonition of the Lord.\" Eph. 6:4 permalink parent award report block reply kc5ods 6 points 6 days ago yeah but once in awhile you gotta fashion a whip and beat the devil out of the temple. permalink parent award report block reply 1_Badcop 3 points 6 days ago ^This The post clearly says the dad caught the kid again. Kids need consequences to learn. Half the commenters in this thread are going to have sons that grow up to be fags. permalink parent award report block reply kc5ods 2 points 5 days ago tbf my dad would have never broke anything. he'd have sold it for any amount he could get to anyone who wanted it permalink parent award report block reply view 1 more comments... RolandDelacroix 3 points 6 days ago If you can find 10 good men on reddit, I'll admit the dad was wrong. permalink parent award report block reply Fren20 1 points 6 days ago Bullshit a swift kick in the ass permalink parent award report block reply\nkc5ods 6 points 6 days ago yeah but once in awhile you gotta fashion a whip and beat the devil out of the temple. permalink parent award report block reply 1_Badcop 3 points 6 days ago ^This The post clearly says the dad caught the kid again. Kids need consequences to learn. Half the commenters in this thread are going to have sons that grow up to be fags. permalink parent award report block reply kc5ods 2 points 5 days ago tbf my dad would have never broke anything. he'd have sold it for any amount he could get to anyone who wanted it permalink parent award report block reply view 1 more comments...\n1_Badcop 3 points 6 days ago ^This The post clearly says the dad caught the kid again. Kids need consequences to learn. Half the commenters in this thread are going to have sons that grow up to be fags. permalink parent award report block reply kc5ods 2 points 5 days ago tbf my dad would have never broke anything. he'd have sold it for any amount he could get to anyone who wanted it permalink parent award report block reply view 1 more comments...\nkc5ods 2 points 5 days ago tbf my dad would have never broke anything. he'd have sold it for any amount he could get to anyone who wanted it permalink parent award report block reply view 1 more comments...\nRolandDelacroix 3 points 6 days ago If you can find 10 good men on reddit, I'll admit the dad was wrong. permalink parent award report block reply\nFren20 1 points 6 days ago Bullshit a swift kick in the ass permalink parent award report block reply\npatrioticwinning3 8 points 6 days ago Exactly, retarded, braindead, needle dick dad of the year :p permalink parent award report block reply Fren20 -1 points 6 days ago Nope ,got to make clear you mean business permalink parent award report block reply\nFren20 -1 points 6 days ago Nope ,got to make clear you mean business permalink parent award report block reply\nPM-Melania-feet-pics 4 points 6 days ago I'd assume he was already warned to stay off Reddit.  For good reason. permalink parent award report block reply Electricutie 15 points 6 days ago But destroying his stuff as a substitute for explaining why it's detrimental in a way that resonates with the child isn't likely to lead to positive results. permalink parent award report block reply ESAsher 5 points 6 days ago True and we don't have enough information form this to decide where this falls but there is certainly a time for explanation and there is a time for punishment. permalink parent award report block reply 1_Badcop 3 points 6 days ago Considering the dad specifically said \"... again ...\" I'm confident there had been a previous discussion(s). Some young men are amenable to discourse. Others need a firmer demonstration. Communication ought to be tailored to the recipient to be effective, no? permalink parent award report block reply\nElectricutie 15 points 6 days ago But destroying his stuff as a substitute for explaining why it's detrimental in a way that resonates with the child isn't likely to lead to positive results. permalink parent award report block reply ESAsher 5 points 6 days ago True and we don't have enough information form this to decide where this falls but there is certainly a time for explanation and there is a time for punishment. permalink parent award report block reply 1_Badcop 3 points 6 days ago Considering the dad specifically said \"... again ...\" I'm confident there had been a previous discussion(s). Some young men are amenable to discourse. Others need a firmer demonstration. Communication ought to be tailored to the recipient to be effective, no? permalink parent award report block reply\nESAsher 5 points 6 days ago True and we don't have enough information form this to decide where this falls but there is certainly a time for explanation and there is a time for punishment. permalink parent award report block reply\n1_Badcop 3 points 6 days ago Considering the dad specifically said \"... again ...\" I'm confident there had been a previous discussion(s). Some young men are amenable to discourse. Others need a firmer demonstration. Communication ought to be tailored to the recipient to be effective, no? permalink parent award report block reply\npatrioticwinning3 1 points 6 days ago Ever meet one of those hardcore Christian hating atheists?  Who won't listen to reason in the slightest?  Some may be retarded, but others were created by retarded faggots like this! permalink parent award report block reply\nEmperorvoid 12 points 6 days ago This is moronic. Using force to think a certain way is absolutely retarded when it comes to a Father teaching his Son. You can try to cram the WHAT down his throat as much as you want, but if you don't have the intellect to teach him the WHY, you are just a moron, no matter what side you are on. WE have the reality based, reasoned logical WHY on our side. We function more from Logos, than Pathos. Sure the Right will also operate from an Ethos argument as well, but the LOGIC IS ON OUR SIDE. Emotions are on the Left. You are using your EMOTION against your Son who will only rebel harder. Not Father of the Year. Moron! :Edit: The more I read the replies to this post, the more I understand how so many of you will fail your children. You're dumb as fuck. You just make them rebel harder. You are not good Fathers. permalink award report block reply GarudaDarkblack 4 points 6 days ago Lot's of people here complain about the left using violence to get their way and \"prove their point\" but whe our side does it they cheer. The hypocrisy is suffocating. I can't imagine doing this to my child because I'm not retarded and neither is my child. permalink parent award report block reply Emperorvoid 1 points 6 days ago There is a vast divide between opinion and conclusion. Most people have opinions. Most people, and it doesn't matter what side, are NPC's. The difference is if they had an opinion or a conclusion. If they came to know the WHY beyond the WHAT. permalink parent award report block reply Fren20 1 points 6 days ago I did this to my husbands t.v ..I guess I'm retarded I got a bigger t.v permalink parent award report block reply IForgotToAddAnEmail 1 points 6 days ago Your husband got a bigger TV, you just think you own it. permalink parent award report block reply 1_Badcop 2 points 6 days ago The more I read your comments, the harder I weep for your sons. permalink parent award report block reply Emperorvoid 2 points 6 days ago One of my Sons was taking College courses while in Jr High. He also loved Meditations by Marcus Aurelius. I could easily hand the keyboard over to him to school you on a variety of subjects. My other Son would just call you a Faggot. permalink parent award report block reply 1_Badcop -2 points 6 days ago Really? Who is their real father? permalink parent award report block reply Fren20 0 points 6 days ago Nope no dummy here, like a snake you have to move fast with quick actions...ssss permalink parent award report block reply\nGarudaDarkblack 4 points 6 days ago Lot's of people here complain about the left using violence to get their way and \"prove their point\" but whe our side does it they cheer. The hypocrisy is suffocating. I can't imagine doing this to my child because I'm not retarded and neither is my child. permalink parent award report block reply Emperorvoid 1 points 6 days ago There is a vast divide between opinion and conclusion. Most people have opinions. Most people, and it doesn't matter what side, are NPC's. The difference is if they had an opinion or a conclusion. If they came to know the WHY beyond the WHAT. permalink parent award report block reply Fren20 1 points 6 days ago I did this to my husbands t.v ..I guess I'm retarded I got a bigger t.v permalink parent award report block reply IForgotToAddAnEmail 1 points 6 days ago Your husband got a bigger TV, you just think you own it. permalink parent award report block reply\nEmperorvoid 1 points 6 days ago There is a vast divide between opinion and conclusion. Most people have opinions. Most people, and it doesn't matter what side, are NPC's. The difference is if they had an opinion or a conclusion. If they came to know the WHY beyond the WHAT. permalink parent award report block reply\nFren20 1 points 6 days ago I did this to my husbands t.v ..I guess I'm retarded I got a bigger t.v permalink parent award report block reply IForgotToAddAnEmail 1 points 6 days ago Your husband got a bigger TV, you just think you own it. permalink parent award report block reply\nIForgotToAddAnEmail 1 points 6 days ago Your husband got a bigger TV, you just think you own it. permalink parent award report block reply\n1_Badcop 2 points 6 days ago The more I read your comments, the harder I weep for your sons. permalink parent award report block reply Emperorvoid 2 points 6 days ago One of my Sons was taking College courses while in Jr High. He also loved Meditations by Marcus Aurelius. I could easily hand the keyboard over to him to school you on a variety of subjects. My other Son would just call you a Faggot. permalink parent award report block reply 1_Badcop -2 points 6 days ago Really? Who is their real father? permalink parent award report block reply\nEmperorvoid 2 points 6 days ago One of my Sons was taking College courses while in Jr High. He also loved Meditations by Marcus Aurelius. I could easily hand the keyboard over to him to school you on a variety of subjects. My other Son would just call you a Faggot. permalink parent award report block reply 1_Badcop -2 points 6 days ago Really? Who is their real father? permalink parent award report block reply\n1_Badcop -2 points 6 days ago Really? Who is their real father? permalink parent award report block reply\nFren20 0 points 6 days ago Nope no dummy here, like a snake you have to move fast with quick actions...ssss permalink parent award report block reply\nDarthEP 5 points 6 days ago Whose PC? Who Pays The Mortgage/Rent...? And Who Sucks Up All The Food & Heat? permalink award report block reply\nstevethefish76 4 points 6 days ago I dunno... he could maybe try talking to his son rather than smashing stuff. My own daughter is a teenager and was going down the atheism route starting a couple of years ago due to school curriculum indoctrination. That plus global warming bullcrap. I've changed her direction back to God and I didn't have to smash anything. permalink award report block reply 1_Badcop 2 points 6 days ago If you had both daughters and sons, you'd know not to treat them the same, because they aren't the same. You see, women and men may be considered to be equal, but they are not the same. permalink parent award report block reply stevethefish76 3 points 6 days ago Smashing the kid's computer will only breed resentment. You can't just damage property like that. If anything at all, it sets a very bad example. If parents cannot control their temper, then their children will not be able to control their temper because their parents have set the precedent. Unplug the computer, ground him. Fine. Smashing property like that is terrible. permalink parent award report block reply XLNutts -1 points 5 days ago Or you could just give him a \"timeout.\" No thanks. That's the kind of faggy shit that got us into this mess. permalink parent award report block reply redditadminssuckit OP 1 points 6 days ago Perhaps.  I get the impression that talking was ineffective. permalink parent award report block reply 1_Badcop 1 points 6 days ago Based upon the \"again\" yes. I can't believe how many of your retarded commenters missed that or ignored it. permalink parent award report block reply Fren20 -1 points 6 days ago I smashed my husband's t.v nothing wrong with it permalink parent award report block reply 1_Badcop 3 points 6 days ago If there is nothing wrong with it, you obviously didn't smash it hard enough. Too bad women have such weak upper body strength! permalink parent award report block reply\n1_Badcop 2 points 6 days ago If you had both daughters and sons, you'd know not to treat them the same, because they aren't the same. You see, women and men may be considered to be equal, but they are not the same. permalink parent award report block reply stevethefish76 3 points 6 days ago Smashing the kid's computer will only breed resentment. You can't just damage property like that. If anything at all, it sets a very bad example. If parents cannot control their temper, then their children will not be able to control their temper because their parents have set the precedent. Unplug the computer, ground him. Fine. Smashing property like that is terrible. permalink parent award report block reply XLNutts -1 points 5 days ago Or you could just give him a \"timeout.\" No thanks. That's the kind of faggy shit that got us into this mess. permalink parent award report block reply\nstevethefish76 3 points 6 days ago Smashing the kid's computer will only breed resentment. You can't just damage property like that. If anything at all, it sets a very bad example. If parents cannot control their temper, then their children will not be able to control their temper because their parents have set the precedent. Unplug the computer, ground him. Fine. Smashing property like that is terrible. permalink parent award report block reply XLNutts -1 points 5 days ago Or you could just give him a \"timeout.\" No thanks. That's the kind of faggy shit that got us into this mess. permalink parent award report block reply\nXLNutts -1 points 5 days ago Or you could just give him a \"timeout.\" No thanks. That's the kind of faggy shit that got us into this mess. permalink parent award report block reply\nredditadminssuckit OP 1 points 6 days ago Perhaps.  I get the impression that talking was ineffective. permalink parent award report block reply 1_Badcop 1 points 6 days ago Based upon the \"again\" yes. I can't believe how many of your retarded commenters missed that or ignored it. permalink parent award report block reply\n1_Badcop 1 points 6 days ago Based upon the \"again\" yes. I can't believe how many of your retarded commenters missed that or ignored it. permalink parent award report block reply\nFren20 -1 points 6 days ago I smashed my husband's t.v nothing wrong with it permalink parent award report block reply 1_Badcop 3 points 6 days ago If there is nothing wrong with it, you obviously didn't smash it hard enough. Too bad women have such weak upper body strength! permalink parent award report block reply\n1_Badcop 3 points 6 days ago If there is nothing wrong with it, you obviously didn't smash it hard enough. Too bad women have such weak upper body strength! permalink parent award report block reply\ncosmos411 3 points 6 days ago and if the kid has a smart phone then promptly replace it with a generic flip phone. permalink award report block reply BlackJack1776 3 points 6 days ago Rotory. Plugged into the living room wall. Worked wonders for generations. permalink parent award report block reply redditadminssuckit OP 1 points 6 days ago Fuck that give him some first class stamps, a pen, paper, and a few envelopes.... or he can walk to whomever he wants to communicate with. And of course whatever you spend on writing materials will have to come out of the budget for food that he is fed permalink parent award report block reply\nBlackJack1776 3 points 6 days ago Rotory. Plugged into the living room wall. Worked wonders for generations. permalink parent award report block reply redditadminssuckit OP 1 points 6 days ago Fuck that give him some first class stamps, a pen, paper, and a few envelopes.... or he can walk to whomever he wants to communicate with. And of course whatever you spend on writing materials will have to come out of the budget for food that he is fed permalink parent award report block reply\nredditadminssuckit OP 1 points 6 days ago Fuck that give him some first class stamps, a pen, paper, and a few envelopes.... or he can walk to whomever he wants to communicate with. And of course whatever you spend on writing materials will have to come out of the budget for food that he is fed permalink parent award report block reply\ngorilla_grip 3 points 6 days ago I wish to God I did this when my son was on Reddit. Kudos to this guy permalink award report block reply\nLiberats 2 points 6 days ago Fucking awesome! permalink award report block reply\nthe-new-style 2 points 6 days ago In about 2014 you fucking farmer permalink award report block reply\nBearing51 2 points 6 days ago Smart man. permalink award report block reply Emperorvoid 2 points 6 days ago Dumb Man! permalink parent award report block reply\nEmperorvoid 2 points 6 days ago Dumb Man! permalink parent award report block reply\ncook_does 2 points 6 days ago Marty is Based permalink award report block reply Emperorvoid 4 points 6 days ago Marty is a moron. Kids going to rebel harder now. He didn't teach him anything other than let your emotion rule you. He should have taught reason. He should have taught the WHAT, and more importantly the WHY! Why are there so many low intellect people posting this bs? No fucking smarts. NONE! permalink parent award report block reply Fren20 -2 points 6 days ago Hmmm I smashed my husband's t.v ...I got a bigger one permalink parent award report block reply\nEmperorvoid 4 points 6 days ago Marty is a moron. Kids going to rebel harder now. He didn't teach him anything other than let your emotion rule you. He should have taught reason. He should have taught the WHAT, and more importantly the WHY! Why are there so many low intellect people posting this bs? No fucking smarts. NONE! permalink parent award report block reply Fren20 -2 points 6 days ago Hmmm I smashed my husband's t.v ...I got a bigger one permalink parent award report block reply\nFren20 -2 points 6 days ago Hmmm I smashed my husband's t.v ...I got a bigger one permalink parent award report block reply\nMichalusmichalus 2 points 6 days ago This shit is child abuse. Posting it proudly on social media gets kids taken away. That trend a few years ago making kids cry shaving them bald got a whole lot of kids taken away. The reasoning was the parents clearly can't distinguish appropriate from inappropriate. permalink award report block reply\nActNow 2 points 6 days ago When my son was a kid, his friend was given a Nintendo DS (IIRC). He had parameters for when he could play it, but started sneaking out of his room at night to get it. Went hunting with his father and was caught with the DS again. Dad had had enough and smashed it into a million pieces against a tree. permalink award report block reply\nCounterwhat 1 points 6 days ago Now that's parenting. Tell your son, no you can go work for your own PC and Internet. permalink award report block reply\nTrumpyOldMan 1 points 5 days ago This dad is a retard. Now his son will rebel and become more fervent in his atheism. The dad resorts to censorship and violent demonic behavior to get his way. What a faggot permalink award report block reply\nshiggins9 0 points 6 days ago This seems like Things that didn't Happen for 200. But I've never been convinced of the miracles in the Bible. A lot of great lessons in there, but if a kid is skeptical of believing the Bible because God told people these things, he definitely won't believe it now as his dad did not allow him to question it. permalink award report block reply\nhelenvsgladys 0 points 6 days ago No that's a psycho and he's pushing his kid toward reactionary reddit identities with his psychotic behavior. permalink award report block reply\nGman75 0 points 6 days ago So rather than have a talk with his son, he decides to destroy what likely his son views as important...? If you are actively trying to drive your kid further from you and your values, then yeah, great job. permalink award report block reply\ncorntortilla 0 points 6 days ago More like idiot of the year. permalink award report block reply\ncltr1 0 points 6 days ago You messed up his childhood, its on you to get him an AR-15 now. permalink award report block reply"}