{"id": "1ARK9isbPY", "contents": "773 The biggest scourge in science ain’t funding slashes—it’s the relentless deluge of wanker slop, bunch of innovation-crushing slack-jawed pedantics! YOU GUYS ARE GAY posted 2 days ago by davidac1982 53 comments award share report block Josie Zayner @josiezayner • 2d Academic science cranks out ~5 million papers a year ~1 million will never be cited ~2 million will get fewer than 10 citations The biggest problem in science isn’t funding cuts it’s that we’re drowning in scientific slop 60 Minutes @60Minutes • 3d “We are truly putting the brakes on scientific innovation in this country at a time when our ostensible adversary, China, is going faster and faster and faster,” says Harvard scientist Don Ingber. “If we can’t be the leader, we’re going to be the follower.”\n53 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style MAGAguitar 31 points 2 days ago It's not science - it's grift. permalink award report block reply Patrick_Bateman 13 points 2 days ago Wanna know how you know this? Private funding would be flooding in from profiteers if there were any real potential here. permalink parent award report block reply vongregormench 6 points 2 days ago There’s plenty of private funding for science. It’s just dwarfed by the public funding. You could probably justify some of the spending by public funds but how much? permalink parent award report block reply Aambrick 2 points 2 days ago 15% of the total if not critical to National Security. 85% of total if critical to National Security. Food Military Medical Energy Education Are the only 5 that are critical to National Security. Even then they actually have to relate to National Security Which for food and military is quite obvious, Medical is a little bit more nuanced, and Education has to be specific which would be much less critical compared to the other 4, but in total as a country is directly related. Industry and other aspects are not exactly up there, but the major difference is that they are much more in the private sector than these 5. Now here is the funny part about it is that any one of these can change depending on the country and their most critical elements that are vital to their nation. What I described is America because Education is a national security factor in enemies using colleges and schools to brainwash children to their ideology. I would talk about energy, but I tend to be long winded whenever I start going into details. So to put simply everything else runs on energy therefore Energy is Critical. permalink parent award report block reply DebunkTheLeft 8 points 2 days ago All these science niggaz are total grifters. The only reason they write papers is to get grant money (aka welfare for pseudo-scientists) for wine and cheese parties and fish and goose soirees. permalink parent award report block reply patrioticwinning3 9 points 2 days ago It's because every PHD and most Master's/specialty degrees (eg law degrees) require the candidate (student) to be \"published.\"  So every grad student has a paper that is published but that will most likely never be read outside of their professors and themselves. permalink parent award report block reply fskfsk 8 points 2 days ago I was in a PhD program for Math, before I realized how pointless it is.  \"Publish original result\" is the main goal, but all the important and solvable problems have been solved already.  The only way you can prove something new is to do something hyper-specialized, so that it would take someone outside your specialty 5 years to get to the point where they can understand it.  That means it's just a tower of babel, where everyone is working in silos, and there are maybe 5 people in the entire world who can understand any paper.  It's a complete waste of time to spend your life writing papers that only 5 people might ever read or understand or appreciate.  It also means that, if everyone is in their own narrow specialty, it's impossible to tell if someone else is really good or just faking it. If Math isn't objective anymore, there absolutely no hope for any other area. permalink parent award report block reply patrioticwinning3 1 points 1 day ago I understand the concept of \"Specialized Labor\" but IRL there is a limit... permalink parent award report block reply they-see-me-trollin 3 points 2 days ago depending on the field, 70-99% fail replicability too.  some of this is just genuine honest mistakes, but more and more have been outed for outright scientific fraud... shit that's made up. some of it is just for the money... by getting novel results, they get more funding for the next study.  and the next.  and they get book deals.  and private research contracts.  and they need to keep coming up with novel and interesting results, or they wouldn't get more attention and money.  a lot of the 2000s/2010s behavioral econ researchers who got tons of money for figuring out \"how stuff AKSHUALLY works\" were busted in this. but then others are being paid literally to falsify data that fraudulently supports extremist political narratives.  a TON of stuff in DEI, LGBT, and climate are in this category.  like there was one study where they claimed black pregnant women who went to black doctors had better child outcomes than if they went to white doctors.  not only did they make basic scientific mistakes, e.g. no stratifying for socioeconomic status, whether the mother uses drugs, obesity level of the mother, etc... the data was so poorly falsified that when they released the raw data, it was clear that black women going to black doctors were significantly worse off regardless of whether you stratify.  it was literally the opposite of what they claimed, and when the data didn't support their narrative, they just made shit up.  that shit happens all the fucking time. permalink parent award report block reply duehuckleberry 18 points 2 days ago Science is in the middle of a replication crisis. It's a big problem because reproducibility is a fundamental principle of the scientific method. permalink award report block reply MSG1000 14 points 2 days ago 5 million a year should’ve already netted us anti-gravity, nuclear fusion and total limb regeneration, bare minimum, by now. permalink award report block reply patrioticwinning3 8 points 2 days ago Lol, the government probably already has the patents for all that shit, but is keeping it under wraps, you know, can't have us \"little people\" benefiting from the benefits of our tax dollars :p permalink parent award report block reply MSG1000 4 points 2 days ago Then the government would be using them and the nature of the government right now, with sloppiness and DEI, etc. means they’re incapable of developing such things or keeping them secret. The system that produces military boondoggle after boondoggle can’t magically be ultra secret, brilliant and efficient too. permalink parent award report block reply ronnietherocket 13 points 2 days ago Honestly, I'm more surprised that 80% of papers get at least one citation.  I was expecting closer to 60%. permalink award report block reply Psarg 9 points 2 days ago 4 authors each write a paper, cite each others papers, and they put everyone's name as an author on all of the papers. They judge academics on paper numbers, not quality.  So people team to inflate their numbers. permalink parent award report block reply footinmouth 4 points 1 day ago Self citations do not count. But there are labs that will cite other labs papers all the time. permalink parent award report block reply fskfsk 12 points 2 days ago Problem #1: The measure of \"how good an academic you are\" is number of papers.  Papers went from \"this is how scientists communicate with each other\" to \"this is how you get and keep your career\". Problem #2: The way publications and hiring works is \"peer review\".  This means political censorship and favoritism enter the picture.  \"I don't like X, so I won't publish his paper, and I won't vote to hire him or give him tenure.\" Problem #3: If a scientist wanted to go and check already-published papers to see if they're valid, or present them in a more understandable format, that's a \"waste of time\" and he would not get hired or promoted. permalink award report block reply TPMJB 10 points 2 days ago China steals all our pharma insider information anyway. And yet they still can't make biosimilars for shit. Though I guess it's only a matter of time. Wuxi is a very large player in pharma. permalink award report block reply davidac1982 OP 9 points 2 days ago “Academic science cranks out ~5 million papers a year ~1 million will never be cited\n~2 million will get fewer than 10 citations The biggest problem in science isn’t funding cuts it’s that we’re drowning in scientific slop.” https://x.com/josiezayner/status/1987882889317683685 permalink award report block reply guywholikesDjtof2024 1 points 2 days ago Brought to you by evolution, millions of years, and life from non life. I thought atheistic naturalistic anti-Biblical origin fantasies wrre supposed to advance us. Seems like they are doing the opposite. If BIBLICAL Christianity ruled science, we'd have far less problems and far better socieities. permalink parent award report block reply CommanderOfCheese 0 points 2 days ago Lol I've seen what comes out of \"Christian\" \"science\" institutes and it's useless drivel that appeals to preconceived biases but doesn't end up yielding any useful results. permalink parent award report block reply guywholikesDjtof2024 0 points 2 days ago Like? At least that's better than \"A giraffe's neck evolved because lots of its ancestor giraffes' necks stretched repeatedly.\" permalink parent award report block reply CommanderOfCheese 1 points 2 days ago Lol what you've just described is Lysenkoism, something long debunked, which only proves your ignorance on science. Here's one. \"All the sedimentary rock was from sediments laid out in the flood.\" If we had to rely on your camp then the only oil we'd ever find would be what already comes up from time to time. permalink parent award report block reply view 2 more comments... AbrahamLincoln 7 points 2 days ago I can only imagine how shitty China's \"research\" is. permalink award report block reply patrioticwinning3 6 points 2 days ago Close your eyes...Imagine a zerox machine... Open your eyes... you now understand China's \"research program.\" :p permalink parent award report block reply DT170x 3 points 2 days ago It's really bad. You need innovation and free thinking to produce quality research. For an average Chinese person their  creativity get beaten out and the CCP install conformity throughout their life. permalink parent award report block reply Momus 2 points 2 days ago You should see India. They make China seem super innovative. And our geniuses in government are putting their eggs in the India basket. permalink parent award report block reply Eatinglue 7 points 2 days ago Research telling people what they want to hear = more grant dollars. Stop funding research grants. Research needs to happen without outside pressure. permalink award report block reply patrioticwinning3 5 points 2 days ago Scientists will agree with whoever funds their projects :p permalink parent award report block reply 10MeV 4 points 2 days ago Usually I say this when some “consensus” discussion stopper has been thrown out.  I respond with “98% of scientists agree… with whomever funded their research”. permalink parent award report block reply Moose_Antlers 6 points 2 days ago So much of medical research is low-quality slop. 85% of it is not reproducible, even the \"landmark\" studies. Why? They've turned universities into grant farms. The real scientists are told they have to spend their time teaching students instead of doing lab work, and the time they do get in the lab, they're going to spend 1/3 of it writing grants and begging for money to pay for the privilege of being employed at that university. It's such a scam. They don't hire professors who want to teach and are good at teaching to teach. They don't hire scientists who are good a research to do that. They hire people and force them to do both, and pay their own way. And that's before I start talking about computer modeling and the fraud that is \"climate science.\" If we wanted to spend a lot of money to build knowledge as a society, this system would be the last way you'd design to do it - and yet, here we are. I'd love love love to do research full-time, but there's no way in hell I'd step into that rat race. permalink award report block reply 10MeV 6 points 2 days ago I saw this first hand even back in the early 90s.  We were working with an NSF “Center”at a major state university.  One of the profs was despairing of getting tenure because he wasn’t pulling in enough grants. It was very clear that “publish or perish” was very real indeed. permalink award report block reply Light_HIV_Effect 5 points 2 days ago It's all done for grant money, and has little to do with actually science or innovation. permalink award report block reply vongregormench 4 points 2 days ago Is this counting phd thesis? permalink award report block reply patrioticwinning3 6 points 2 days ago Yes, all PHD a lot of Master's and many professional degrees (eg law degrees) require the candidate to be published.  So every student who has graduated those programs has a \"published paper\" that most likely no one will read except them and their professors. permalink parent award report block reply barwhack 4 points 2 days ago I left academics, because academics is only left turns*; because of woke retarded gay faggotry. Whatever I was going to produce? it's forever private now . No touchy. * bent science just goes around in anus-circles. permalink award report block reply DingleBalls 4 points 2 days ago Their theories are the worst kind of popular tripe, their methods are sloppy, and their conclusions are highly questionable! permalink award report block reply patrioticwinning3 3 points 2 days ago It's because every PHD and most Master's/specialty degrees (eg law degrees) require you to be \"published.\"  So every grad student has a paper that is published but that will most likely never be read outside of their professors and themselves. permalink award report block reply Hantif 3 points 2 days ago What percentage is written by AI? Most papers and studies I've seen lately are \"meta papers\" where the author does no research beyond comparing earlier research papers. permalink award report block reply Scot 2 points 1 day ago At least 80% of $cience, isn't. permalink award report block reply Glory-Unto-God 2 points 1 day ago Send the Chinese back to China and dont allow network traffic into your country and they will stagnate. They advance through IP theft and subterfuge. Most advancements they list are total horse shit. Or just blow up the three gorges dam and be extremely done with being bothered by a paper tiger permalink award report block reply ViagraFalls 2 points 2 days ago I contributed to science once. I did research on adding a particular type of fiber to yogurt. I’m sure other fields have similarly boring research that isn’t groundbreaking stuff. permalink award report block reply MeMargie 2 points 2 days ago Been doing it since the beginning of time.... permalink award report block reply hairless_ap3 2 points 1 day ago They're too busy giving people poison and talking them into cutting their dicks off and boobs off to bother with science permalink award report block reply bluewhiteandred 2 points 1 day ago Privatize scientific research permalink award report block reply jermzdeejd 2 points 1 day ago It's by design permalink award report block reply ThreeTimeTrumper 2 points 2 days ago I was able to publish 3 papers as a chemistry graduate student between 2020 and 2024 with 23 total citations so just under 8 average per paper. Not getting 10 citations on a paper if you're a professional is embarassing. permalink award report block reply SoulSnipper 2 points 1 day ago I'm sick of the \"research\" that is just scrolling through other people's published work. Meta-researchers should have meta-jibs with meta-pay. permalink award report block reply fponick 1 points 1 day ago “Ostensible” - stated or appearing to be true, but not necessarily so.\nAn academic word that means the speaker is waffling mightily! permalink award report block reply 1amS3lly 1 points 1 day ago “We’re gonna be followers (in scientific advancement to China)” You mean you wanna be leaders in “what is a woman?” And “tax people to change the weather!” And “take this rna slop therapy to avoid getting a cold or you’re fired!” That science? permalink award report block reply redditadminssuckit -1 points 2 days ago Oy have nose idea how this could happen. Do joo? permalink award report block reply\nMAGAguitar 31 points 2 days ago It's not science - it's grift. permalink award report block reply Patrick_Bateman 13 points 2 days ago Wanna know how you know this? Private funding would be flooding in from profiteers if there were any real potential here. permalink parent award report block reply vongregormench 6 points 2 days ago There’s plenty of private funding for science. It’s just dwarfed by the public funding. You could probably justify some of the spending by public funds but how much? permalink parent award report block reply Aambrick 2 points 2 days ago 15% of the total if not critical to National Security. 85% of total if critical to National Security. Food Military Medical Energy Education Are the only 5 that are critical to National Security. Even then they actually have to relate to National Security Which for food and military is quite obvious, Medical is a little bit more nuanced, and Education has to be specific which would be much less critical compared to the other 4, but in total as a country is directly related. Industry and other aspects are not exactly up there, but the major difference is that they are much more in the private sector than these 5. Now here is the funny part about it is that any one of these can change depending on the country and their most critical elements that are vital to their nation. What I described is America because Education is a national security factor in enemies using colleges and schools to brainwash children to their ideology. I would talk about energy, but I tend to be long winded whenever I start going into details. So to put simply everything else runs on energy therefore Energy is Critical. permalink parent award report block reply DebunkTheLeft 8 points 2 days ago All these science niggaz are total grifters. The only reason they write papers is to get grant money (aka welfare for pseudo-scientists) for wine and cheese parties and fish and goose soirees. permalink parent award report block reply patrioticwinning3 9 points 2 days ago It's because every PHD and most Master's/specialty degrees (eg law degrees) require the candidate (student) to be \"published.\"  So every grad student has a paper that is published but that will most likely never be read outside of their professors and themselves. permalink parent award report block reply fskfsk 8 points 2 days ago I was in a PhD program for Math, before I realized how pointless it is.  \"Publish original result\" is the main goal, but all the important and solvable problems have been solved already.  The only way you can prove something new is to do something hyper-specialized, so that it would take someone outside your specialty 5 years to get to the point where they can understand it.  That means it's just a tower of babel, where everyone is working in silos, and there are maybe 5 people in the entire world who can understand any paper.  It's a complete waste of time to spend your life writing papers that only 5 people might ever read or understand or appreciate.  It also means that, if everyone is in their own narrow specialty, it's impossible to tell if someone else is really good or just faking it. If Math isn't objective anymore, there absolutely no hope for any other area. permalink parent award report block reply patrioticwinning3 1 points 1 day ago I understand the concept of \"Specialized Labor\" but IRL there is a limit... permalink parent award report block reply they-see-me-trollin 3 points 2 days ago depending on the field, 70-99% fail replicability too.  some of this is just genuine honest mistakes, but more and more have been outed for outright scientific fraud... shit that's made up. some of it is just for the money... by getting novel results, they get more funding for the next study.  and the next.  and they get book deals.  and private research contracts.  and they need to keep coming up with novel and interesting results, or they wouldn't get more attention and money.  a lot of the 2000s/2010s behavioral econ researchers who got tons of money for figuring out \"how stuff AKSHUALLY works\" were busted in this. but then others are being paid literally to falsify data that fraudulently supports extremist political narratives.  a TON of stuff in DEI, LGBT, and climate are in this category.  like there was one study where they claimed black pregnant women who went to black doctors had better child outcomes than if they went to white doctors.  not only did they make basic scientific mistakes, e.g. no stratifying for socioeconomic status, whether the mother uses drugs, obesity level of the mother, etc... the data was so poorly falsified that when they released the raw data, it was clear that black women going to black doctors were significantly worse off regardless of whether you stratify.  it was literally the opposite of what they claimed, and when the data didn't support their narrative, they just made shit up.  that shit happens all the fucking time. permalink parent award report block reply\nPatrick_Bateman 13 points 2 days ago Wanna know how you know this? Private funding would be flooding in from profiteers if there were any real potential here. permalink parent award report block reply vongregormench 6 points 2 days ago There’s plenty of private funding for science. It’s just dwarfed by the public funding. You could probably justify some of the spending by public funds but how much? permalink parent award report block reply Aambrick 2 points 2 days ago 15% of the total if not critical to National Security. 85% of total if critical to National Security. Food Military Medical Energy Education Are the only 5 that are critical to National Security. Even then they actually have to relate to National Security Which for food and military is quite obvious, Medical is a little bit more nuanced, and Education has to be specific which would be much less critical compared to the other 4, but in total as a country is directly related. Industry and other aspects are not exactly up there, but the major difference is that they are much more in the private sector than these 5. Now here is the funny part about it is that any one of these can change depending on the country and their most critical elements that are vital to their nation. What I described is America because Education is a national security factor in enemies using colleges and schools to brainwash children to their ideology. I would talk about energy, but I tend to be long winded whenever I start going into details. So to put simply everything else runs on energy therefore Energy is Critical. permalink parent award report block reply\nvongregormench 6 points 2 days ago There’s plenty of private funding for science. It’s just dwarfed by the public funding. You could probably justify some of the spending by public funds but how much? permalink parent award report block reply Aambrick 2 points 2 days ago 15% of the total if not critical to National Security. 85% of total if critical to National Security. Food Military Medical Energy Education Are the only 5 that are critical to National Security. Even then they actually have to relate to National Security Which for food and military is quite obvious, Medical is a little bit more nuanced, and Education has to be specific which would be much less critical compared to the other 4, but in total as a country is directly related. Industry and other aspects are not exactly up there, but the major difference is that they are much more in the private sector than these 5. Now here is the funny part about it is that any one of these can change depending on the country and their most critical elements that are vital to their nation. What I described is America because Education is a national security factor in enemies using colleges and schools to brainwash children to their ideology. I would talk about energy, but I tend to be long winded whenever I start going into details. So to put simply everything else runs on energy therefore Energy is Critical. permalink parent award report block reply\nAambrick 2 points 2 days ago 15% of the total if not critical to National Security. 85% of total if critical to National Security. Food Military Medical Energy Education Are the only 5 that are critical to National Security. Even then they actually have to relate to National Security Which for food and military is quite obvious, Medical is a little bit more nuanced, and Education has to be specific which would be much less critical compared to the other 4, but in total as a country is directly related. Industry and other aspects are not exactly up there, but the major difference is that they are much more in the private sector than these 5. Now here is the funny part about it is that any one of these can change depending on the country and their most critical elements that are vital to their nation. What I described is America because Education is a national security factor in enemies using colleges and schools to brainwash children to their ideology. I would talk about energy, but I tend to be long winded whenever I start going into details. So to put simply everything else runs on energy therefore Energy is Critical. permalink parent award report block reply\nDebunkTheLeft 8 points 2 days ago All these science niggaz are total grifters. The only reason they write papers is to get grant money (aka welfare for pseudo-scientists) for wine and cheese parties and fish and goose soirees. permalink parent award report block reply patrioticwinning3 9 points 2 days ago It's because every PHD and most Master's/specialty degrees (eg law degrees) require the candidate (student) to be \"published.\"  So every grad student has a paper that is published but that will most likely never be read outside of their professors and themselves. permalink parent award report block reply fskfsk 8 points 2 days ago I was in a PhD program for Math, before I realized how pointless it is.  \"Publish original result\" is the main goal, but all the important and solvable problems have been solved already.  The only way you can prove something new is to do something hyper-specialized, so that it would take someone outside your specialty 5 years to get to the point where they can understand it.  That means it's just a tower of babel, where everyone is working in silos, and there are maybe 5 people in the entire world who can understand any paper.  It's a complete waste of time to spend your life writing papers that only 5 people might ever read or understand or appreciate.  It also means that, if everyone is in their own narrow specialty, it's impossible to tell if someone else is really good or just faking it. If Math isn't objective anymore, there absolutely no hope for any other area. permalink parent award report block reply patrioticwinning3 1 points 1 day ago I understand the concept of \"Specialized Labor\" but IRL there is a limit... permalink parent award report block reply\npatrioticwinning3 9 points 2 days ago It's because every PHD and most Master's/specialty degrees (eg law degrees) require the candidate (student) to be \"published.\"  So every grad student has a paper that is published but that will most likely never be read outside of their professors and themselves. permalink parent award report block reply fskfsk 8 points 2 days ago I was in a PhD program for Math, before I realized how pointless it is.  \"Publish original result\" is the main goal, but all the important and solvable problems have been solved already.  The only way you can prove something new is to do something hyper-specialized, so that it would take someone outside your specialty 5 years to get to the point where they can understand it.  That means it's just a tower of babel, where everyone is working in silos, and there are maybe 5 people in the entire world who can understand any paper.  It's a complete waste of time to spend your life writing papers that only 5 people might ever read or understand or appreciate.  It also means that, if everyone is in their own narrow specialty, it's impossible to tell if someone else is really good or just faking it. If Math isn't objective anymore, there absolutely no hope for any other area. permalink parent award report block reply patrioticwinning3 1 points 1 day ago I understand the concept of \"Specialized Labor\" but IRL there is a limit... permalink parent award report block reply\nfskfsk 8 points 2 days ago I was in a PhD program for Math, before I realized how pointless it is.  \"Publish original result\" is the main goal, but all the important and solvable problems have been solved already.  The only way you can prove something new is to do something hyper-specialized, so that it would take someone outside your specialty 5 years to get to the point where they can understand it.  That means it's just a tower of babel, where everyone is working in silos, and there are maybe 5 people in the entire world who can understand any paper.  It's a complete waste of time to spend your life writing papers that only 5 people might ever read or understand or appreciate.  It also means that, if everyone is in their own narrow specialty, it's impossible to tell if someone else is really good or just faking it. If Math isn't objective anymore, there absolutely no hope for any other area. permalink parent award report block reply patrioticwinning3 1 points 1 day ago I understand the concept of \"Specialized Labor\" but IRL there is a limit... permalink parent award report block reply\npatrioticwinning3 1 points 1 day ago I understand the concept of \"Specialized Labor\" but IRL there is a limit... permalink parent award report block reply\nthey-see-me-trollin 3 points 2 days ago depending on the field, 70-99% fail replicability too.  some of this is just genuine honest mistakes, but more and more have been outed for outright scientific fraud... shit that's made up. some of it is just for the money... by getting novel results, they get more funding for the next study.  and the next.  and they get book deals.  and private research contracts.  and they need to keep coming up with novel and interesting results, or they wouldn't get more attention and money.  a lot of the 2000s/2010s behavioral econ researchers who got tons of money for figuring out \"how stuff AKSHUALLY works\" were busted in this. but then others are being paid literally to falsify data that fraudulently supports extremist political narratives.  a TON of stuff in DEI, LGBT, and climate are in this category.  like there was one study where they claimed black pregnant women who went to black doctors had better child outcomes than if they went to white doctors.  not only did they make basic scientific mistakes, e.g. no stratifying for socioeconomic status, whether the mother uses drugs, obesity level of the mother, etc... the data was so poorly falsified that when they released the raw data, it was clear that black women going to black doctors were significantly worse off regardless of whether you stratify.  it was literally the opposite of what they claimed, and when the data didn't support their narrative, they just made shit up.  that shit happens all the fucking time. permalink parent award report block reply\nduehuckleberry 18 points 2 days ago Science is in the middle of a replication crisis. It's a big problem because reproducibility is a fundamental principle of the scientific method. permalink award report block reply\nMSG1000 14 points 2 days ago 5 million a year should’ve already netted us anti-gravity, nuclear fusion and total limb regeneration, bare minimum, by now. permalink award report block reply patrioticwinning3 8 points 2 days ago Lol, the government probably already has the patents for all that shit, but is keeping it under wraps, you know, can't have us \"little people\" benefiting from the benefits of our tax dollars :p permalink parent award report block reply MSG1000 4 points 2 days ago Then the government would be using them and the nature of the government right now, with sloppiness and DEI, etc. means they’re incapable of developing such things or keeping them secret. The system that produces military boondoggle after boondoggle can’t magically be ultra secret, brilliant and efficient too. permalink parent award report block reply\npatrioticwinning3 8 points 2 days ago Lol, the government probably already has the patents for all that shit, but is keeping it under wraps, you know, can't have us \"little people\" benefiting from the benefits of our tax dollars :p permalink parent award report block reply MSG1000 4 points 2 days ago Then the government would be using them and the nature of the government right now, with sloppiness and DEI, etc. means they’re incapable of developing such things or keeping them secret. The system that produces military boondoggle after boondoggle can’t magically be ultra secret, brilliant and efficient too. permalink parent award report block reply\nMSG1000 4 points 2 days ago Then the government would be using them and the nature of the government right now, with sloppiness and DEI, etc. means they’re incapable of developing such things or keeping them secret. The system that produces military boondoggle after boondoggle can’t magically be ultra secret, brilliant and efficient too. permalink parent award report block reply\nronnietherocket 13 points 2 days ago Honestly, I'm more surprised that 80% of papers get at least one citation.  I was expecting closer to 60%. permalink award report block reply Psarg 9 points 2 days ago 4 authors each write a paper, cite each others papers, and they put everyone's name as an author on all of the papers. They judge academics on paper numbers, not quality.  So people team to inflate their numbers. permalink parent award report block reply footinmouth 4 points 1 day ago Self citations do not count. But there are labs that will cite other labs papers all the time. permalink parent award report block reply\nPsarg 9 points 2 days ago 4 authors each write a paper, cite each others papers, and they put everyone's name as an author on all of the papers. They judge academics on paper numbers, not quality.  So people team to inflate their numbers. permalink parent award report block reply footinmouth 4 points 1 day ago Self citations do not count. But there are labs that will cite other labs papers all the time. permalink parent award report block reply\nfootinmouth 4 points 1 day ago Self citations do not count. But there are labs that will cite other labs papers all the time. permalink parent award report block reply\nfskfsk 12 points 2 days ago Problem #1: The measure of \"how good an academic you are\" is number of papers.  Papers went from \"this is how scientists communicate with each other\" to \"this is how you get and keep your career\". Problem #2: The way publications and hiring works is \"peer review\".  This means political censorship and favoritism enter the picture.  \"I don't like X, so I won't publish his paper, and I won't vote to hire him or give him tenure.\" Problem #3: If a scientist wanted to go and check already-published papers to see if they're valid, or present them in a more understandable format, that's a \"waste of time\" and he would not get hired or promoted. permalink award report block reply\nTPMJB 10 points 2 days ago China steals all our pharma insider information anyway. And yet they still can't make biosimilars for shit. Though I guess it's only a matter of time. Wuxi is a very large player in pharma. permalink award report block reply\ndavidac1982 OP 9 points 2 days ago “Academic science cranks out ~5 million papers a year ~1 million will never be cited\n~2 million will get fewer than 10 citations The biggest problem in science isn’t funding cuts it’s that we’re drowning in scientific slop.” https://x.com/josiezayner/status/1987882889317683685 permalink award report block reply guywholikesDjtof2024 1 points 2 days ago Brought to you by evolution, millions of years, and life from non life. I thought atheistic naturalistic anti-Biblical origin fantasies wrre supposed to advance us. Seems like they are doing the opposite. If BIBLICAL Christianity ruled science, we'd have far less problems and far better socieities. permalink parent award report block reply CommanderOfCheese 0 points 2 days ago Lol I've seen what comes out of \"Christian\" \"science\" institutes and it's useless drivel that appeals to preconceived biases but doesn't end up yielding any useful results. permalink parent award report block reply guywholikesDjtof2024 0 points 2 days ago Like? At least that's better than \"A giraffe's neck evolved because lots of its ancestor giraffes' necks stretched repeatedly.\" permalink parent award report block reply CommanderOfCheese 1 points 2 days ago Lol what you've just described is Lysenkoism, something long debunked, which only proves your ignorance on science. Here's one. \"All the sedimentary rock was from sediments laid out in the flood.\" If we had to rely on your camp then the only oil we'd ever find would be what already comes up from time to time. permalink parent award report block reply view 2 more comments...\nguywholikesDjtof2024 1 points 2 days ago Brought to you by evolution, millions of years, and life from non life. I thought atheistic naturalistic anti-Biblical origin fantasies wrre supposed to advance us. Seems like they are doing the opposite. If BIBLICAL Christianity ruled science, we'd have far less problems and far better socieities. permalink parent award report block reply CommanderOfCheese 0 points 2 days ago Lol I've seen what comes out of \"Christian\" \"science\" institutes and it's useless drivel that appeals to preconceived biases but doesn't end up yielding any useful results. permalink parent award report block reply guywholikesDjtof2024 0 points 2 days ago Like? At least that's better than \"A giraffe's neck evolved because lots of its ancestor giraffes' necks stretched repeatedly.\" permalink parent award report block reply CommanderOfCheese 1 points 2 days ago Lol what you've just described is Lysenkoism, something long debunked, which only proves your ignorance on science. Here's one. \"All the sedimentary rock was from sediments laid out in the flood.\" If we had to rely on your camp then the only oil we'd ever find would be what already comes up from time to time. permalink parent award report block reply view 2 more comments...\nCommanderOfCheese 0 points 2 days ago Lol I've seen what comes out of \"Christian\" \"science\" institutes and it's useless drivel that appeals to preconceived biases but doesn't end up yielding any useful results. permalink parent award report block reply guywholikesDjtof2024 0 points 2 days ago Like? At least that's better than \"A giraffe's neck evolved because lots of its ancestor giraffes' necks stretched repeatedly.\" permalink parent award report block reply CommanderOfCheese 1 points 2 days ago Lol what you've just described is Lysenkoism, something long debunked, which only proves your ignorance on science. Here's one. \"All the sedimentary rock was from sediments laid out in the flood.\" If we had to rely on your camp then the only oil we'd ever find would be what already comes up from time to time. permalink parent award report block reply view 2 more comments...\nguywholikesDjtof2024 0 points 2 days ago Like? At least that's better than \"A giraffe's neck evolved because lots of its ancestor giraffes' necks stretched repeatedly.\" permalink parent award report block reply CommanderOfCheese 1 points 2 days ago Lol what you've just described is Lysenkoism, something long debunked, which only proves your ignorance on science. Here's one. \"All the sedimentary rock was from sediments laid out in the flood.\" If we had to rely on your camp then the only oil we'd ever find would be what already comes up from time to time. permalink parent award report block reply view 2 more comments...\nCommanderOfCheese 1 points 2 days ago Lol what you've just described is Lysenkoism, something long debunked, which only proves your ignorance on science. Here's one. \"All the sedimentary rock was from sediments laid out in the flood.\" If we had to rely on your camp then the only oil we'd ever find would be what already comes up from time to time. permalink parent award report block reply view 2 more comments...\nAbrahamLincoln 7 points 2 days ago I can only imagine how shitty China's \"research\" is. permalink award report block reply patrioticwinning3 6 points 2 days ago Close your eyes...Imagine a zerox machine... Open your eyes... you now understand China's \"research program.\" :p permalink parent award report block reply DT170x 3 points 2 days ago It's really bad. You need innovation and free thinking to produce quality research. For an average Chinese person their  creativity get beaten out and the CCP install conformity throughout their life. permalink parent award report block reply Momus 2 points 2 days ago You should see India. They make China seem super innovative. And our geniuses in government are putting their eggs in the India basket. permalink parent award report block reply\npatrioticwinning3 6 points 2 days ago Close your eyes...Imagine a zerox machine... Open your eyes... you now understand China's \"research program.\" :p permalink parent award report block reply\nDT170x 3 points 2 days ago It's really bad. You need innovation and free thinking to produce quality research. For an average Chinese person their  creativity get beaten out and the CCP install conformity throughout their life. permalink parent award report block reply\nMomus 2 points 2 days ago You should see India. They make China seem super innovative. And our geniuses in government are putting their eggs in the India basket. permalink parent award report block reply\nEatinglue 7 points 2 days ago Research telling people what they want to hear = more grant dollars. Stop funding research grants. Research needs to happen without outside pressure. permalink award report block reply patrioticwinning3 5 points 2 days ago Scientists will agree with whoever funds their projects :p permalink parent award report block reply 10MeV 4 points 2 days ago Usually I say this when some “consensus” discussion stopper has been thrown out.  I respond with “98% of scientists agree… with whomever funded their research”. permalink parent award report block reply\npatrioticwinning3 5 points 2 days ago Scientists will agree with whoever funds their projects :p permalink parent award report block reply 10MeV 4 points 2 days ago Usually I say this when some “consensus” discussion stopper has been thrown out.  I respond with “98% of scientists agree… with whomever funded their research”. permalink parent award report block reply\n10MeV 4 points 2 days ago Usually I say this when some “consensus” discussion stopper has been thrown out.  I respond with “98% of scientists agree… with whomever funded their research”. permalink parent award report block reply\nMoose_Antlers 6 points 2 days ago So much of medical research is low-quality slop. 85% of it is not reproducible, even the \"landmark\" studies. Why? They've turned universities into grant farms. The real scientists are told they have to spend their time teaching students instead of doing lab work, and the time they do get in the lab, they're going to spend 1/3 of it writing grants and begging for money to pay for the privilege of being employed at that university. It's such a scam. They don't hire professors who want to teach and are good at teaching to teach. They don't hire scientists who are good a research to do that. They hire people and force them to do both, and pay their own way. And that's before I start talking about computer modeling and the fraud that is \"climate science.\" If we wanted to spend a lot of money to build knowledge as a society, this system would be the last way you'd design to do it - and yet, here we are. I'd love love love to do research full-time, but there's no way in hell I'd step into that rat race. permalink award report block reply\n10MeV 6 points 2 days ago I saw this first hand even back in the early 90s.  We were working with an NSF “Center”at a major state university.  One of the profs was despairing of getting tenure because he wasn’t pulling in enough grants. It was very clear that “publish or perish” was very real indeed. permalink award report block reply\nLight_HIV_Effect 5 points 2 days ago It's all done for grant money, and has little to do with actually science or innovation. permalink award report block reply\nvongregormench 4 points 2 days ago Is this counting phd thesis? permalink award report block reply patrioticwinning3 6 points 2 days ago Yes, all PHD a lot of Master's and many professional degrees (eg law degrees) require the candidate to be published.  So every student who has graduated those programs has a \"published paper\" that most likely no one will read except them and their professors. permalink parent award report block reply\npatrioticwinning3 6 points 2 days ago Yes, all PHD a lot of Master's and many professional degrees (eg law degrees) require the candidate to be published.  So every student who has graduated those programs has a \"published paper\" that most likely no one will read except them and their professors. permalink parent award report block reply\nbarwhack 4 points 2 days ago I left academics, because academics is only left turns*; because of woke retarded gay faggotry. Whatever I was going to produce? it's forever private now . No touchy. * bent science just goes around in anus-circles. permalink award report block reply\nDingleBalls 4 points 2 days ago Their theories are the worst kind of popular tripe, their methods are sloppy, and their conclusions are highly questionable! permalink award report block reply\npatrioticwinning3 3 points 2 days ago It's because every PHD and most Master's/specialty degrees (eg law degrees) require you to be \"published.\"  So every grad student has a paper that is published but that will most likely never be read outside of their professors and themselves. permalink award report block reply\nHantif 3 points 2 days ago What percentage is written by AI? Most papers and studies I've seen lately are \"meta papers\" where the author does no research beyond comparing earlier research papers. permalink award report block reply\nScot 2 points 1 day ago At least 80% of $cience, isn't. permalink award report block reply\nGlory-Unto-God 2 points 1 day ago Send the Chinese back to China and dont allow network traffic into your country and they will stagnate. They advance through IP theft and subterfuge. Most advancements they list are total horse shit. Or just blow up the three gorges dam and be extremely done with being bothered by a paper tiger permalink award report block reply\nViagraFalls 2 points 2 days ago I contributed to science once. I did research on adding a particular type of fiber to yogurt. I’m sure other fields have similarly boring research that isn’t groundbreaking stuff. permalink award report block reply\nMeMargie 2 points 2 days ago Been doing it since the beginning of time.... permalink award report block reply\nhairless_ap3 2 points 1 day ago They're too busy giving people poison and talking them into cutting their dicks off and boobs off to bother with science permalink award report block reply\nbluewhiteandred 2 points 1 day ago Privatize scientific research permalink award report block reply\njermzdeejd 2 points 1 day ago It's by design permalink award report block reply\nThreeTimeTrumper 2 points 2 days ago I was able to publish 3 papers as a chemistry graduate student between 2020 and 2024 with 23 total citations so just under 8 average per paper. Not getting 10 citations on a paper if you're a professional is embarassing. permalink award report block reply\nSoulSnipper 2 points 1 day ago I'm sick of the \"research\" that is just scrolling through other people's published work. Meta-researchers should have meta-jibs with meta-pay. permalink award report block reply\nfponick 1 points 1 day ago “Ostensible” - stated or appearing to be true, but not necessarily so.\nAn academic word that means the speaker is waffling mightily! permalink award report block reply\n1amS3lly 1 points 1 day ago “We’re gonna be followers (in scientific advancement to China)” You mean you wanna be leaders in “what is a woman?” And “tax people to change the weather!” And “take this rna slop therapy to avoid getting a cold or you’re fired!” That science? permalink award report block reply\nredditadminssuckit -1 points 2 days ago Oy have nose idea how this could happen. Do joo? permalink award report block reply"}