{"id": "1ARK9nNhv4", "contents": "19 Hemp Ban in New CR posted 10 hours ago by flashersenpai 12 comments award share report block Owen Shroyer @OwenShroyer1776 • 1d So, guess Rand Paul knew what he was doing because he's more in touch with the American people than every other Republican in the Senate. And he gets attacked the most because he answers to the people not the donors. ThePersistence @ScottPresler • 1d I’m receiving messages from panicked business owners about the hemp ban. The Senate snuck in hemp ban language into the gov’t reopen package. I’m hearing it will kill a lot of jobs & Republicans will lose a lot of votes. Passing this on.\n12 comments Sort by Top Top New Worst Old Save JimQPublic 6 points 10 hours ago What is it with Republicans and doing everything they possibly can to lose in 2026? Who is advising these people?   Nobody asked for this. permalink award report block reply Cakes4077 4 points 10 hours ago They like being on bottom. permalink parent award report block reply Porkbut -1 points 9 hours ago Somehow this is Trumps fault for the bots here like op, who constantly post anti trump fake MAGA propaganda daily. And its not a ban on hemp, its a reclassification of certain THC products. He should just move marijuana off schedule 1 and this bullshit stops immediately, so this isnt as big a deal as owen is making it, who has also gone full TDS lately over bullshit media headlines. So either owen is too slow to understand the things hes reporting on, or he knows how to manipulate people through sensational reporting. Wonder which it is? permalink parent award report block reply flashersenpai OP 2 points 8 hours ago He should just move marijuana off schedule 1 but he's not going to though, is he? permalink parent award report block reply Porkbut 0 points 8 hours ago Wrong as usual TDSbot. https://themarijuanaherald.com/2025/06/president-trump-says-marijuana-rescheduling-will-happen-soon-in-meeting-with-house-lawmakers/ https://abcnews.go.com/Politics/trump-administration-reclassifying-marijuana/story?id=124552149 It takes some time, but the process has started already. permalink parent award report block reply AktionT4 1 points 2 hours ago Comment removed by community moderators. permalink parent award report block reply FreedomFlowerDelta 2 points 10 hours ago Alcohol jews permalink award report block reply T471 2 points 9 hours ago Clean CR they say....they are all assholes. permalink award report block reply GhostOfTheRepublic 2 points 10 hours ago What’s the purpose of that I wonder? permalink award report block reply nuhbin3 2 points 10 hours ago the stated reason was that most of the hemp becomes a legal smoke/vape product that gets sprayed with unregulated Chinese chemicals (thca etc) to make gas station weed vapes... who knows if the money behind it is from somewhere else like booze or the medical marijuana growers or whoever permalink parent award report block reply GhostOfTheRepublic 1 points 9 hours ago unfortunately, hemp as a plant has many useful purposes.  But, this is the way of centralized government - one rule to govern them all regardless of the consequences locally. permalink parent award report block reply RINO_fatigue -1 points 8 hours ago marijuana should be illegal, the people who use it are all total losers, most of them are negro or the moral equivalent permalink award report block reply\nJimQPublic 6 points 10 hours ago What is it with Republicans and doing everything they possibly can to lose in 2026? Who is advising these people?   Nobody asked for this. permalink award report block reply Cakes4077 4 points 10 hours ago They like being on bottom. permalink parent award report block reply Porkbut -1 points 9 hours ago Somehow this is Trumps fault for the bots here like op, who constantly post anti trump fake MAGA propaganda daily. And its not a ban on hemp, its a reclassification of certain THC products. He should just move marijuana off schedule 1 and this bullshit stops immediately, so this isnt as big a deal as owen is making it, who has also gone full TDS lately over bullshit media headlines. So either owen is too slow to understand the things hes reporting on, or he knows how to manipulate people through sensational reporting. Wonder which it is? permalink parent award report block reply flashersenpai OP 2 points 8 hours ago He should just move marijuana off schedule 1 but he's not going to though, is he? permalink parent award report block reply Porkbut 0 points 8 hours ago Wrong as usual TDSbot. https://themarijuanaherald.com/2025/06/president-trump-says-marijuana-rescheduling-will-happen-soon-in-meeting-with-house-lawmakers/ https://abcnews.go.com/Politics/trump-administration-reclassifying-marijuana/story?id=124552149 It takes some time, but the process has started already. permalink parent award report block reply AktionT4 1 points 2 hours ago Comment removed by community moderators. permalink parent award report block reply\nCakes4077 4 points 10 hours ago They like being on bottom. permalink parent award report block reply\nPorkbut -1 points 9 hours ago Somehow this is Trumps fault for the bots here like op, who constantly post anti trump fake MAGA propaganda daily. And its not a ban on hemp, its a reclassification of certain THC products. He should just move marijuana off schedule 1 and this bullshit stops immediately, so this isnt as big a deal as owen is making it, who has also gone full TDS lately over bullshit media headlines. So either owen is too slow to understand the things hes reporting on, or he knows how to manipulate people through sensational reporting. Wonder which it is? permalink parent award report block reply flashersenpai OP 2 points 8 hours ago He should just move marijuana off schedule 1 but he's not going to though, is he? permalink parent award report block reply Porkbut 0 points 8 hours ago Wrong as usual TDSbot. https://themarijuanaherald.com/2025/06/president-trump-says-marijuana-rescheduling-will-happen-soon-in-meeting-with-house-lawmakers/ https://abcnews.go.com/Politics/trump-administration-reclassifying-marijuana/story?id=124552149 It takes some time, but the process has started already. permalink parent award report block reply\nflashersenpai OP 2 points 8 hours ago He should just move marijuana off schedule 1 but he's not going to though, is he? permalink parent award report block reply Porkbut 0 points 8 hours ago Wrong as usual TDSbot. https://themarijuanaherald.com/2025/06/president-trump-says-marijuana-rescheduling-will-happen-soon-in-meeting-with-house-lawmakers/ https://abcnews.go.com/Politics/trump-administration-reclassifying-marijuana/story?id=124552149 It takes some time, but the process has started already. permalink parent award report block reply\nPorkbut 0 points 8 hours ago Wrong as usual TDSbot. https://themarijuanaherald.com/2025/06/president-trump-says-marijuana-rescheduling-will-happen-soon-in-meeting-with-house-lawmakers/ https://abcnews.go.com/Politics/trump-administration-reclassifying-marijuana/story?id=124552149 It takes some time, but the process has started already. permalink parent award report block reply\nAktionT4 1 points 2 hours ago Comment removed by community moderators. permalink parent award report block reply\nFreedomFlowerDelta 2 points 10 hours ago Alcohol jews permalink award report block reply\nT471 2 points 9 hours ago Clean CR they say....they are all assholes. permalink award report block reply\nGhostOfTheRepublic 2 points 10 hours ago What’s the purpose of that I wonder? permalink award report block reply nuhbin3 2 points 10 hours ago the stated reason was that most of the hemp becomes a legal smoke/vape product that gets sprayed with unregulated Chinese chemicals (thca etc) to make gas station weed vapes... who knows if the money behind it is from somewhere else like booze or the medical marijuana growers or whoever permalink parent award report block reply GhostOfTheRepublic 1 points 9 hours ago unfortunately, hemp as a plant has many useful purposes.  But, this is the way of centralized government - one rule to govern them all regardless of the consequences locally. permalink parent award report block reply\nnuhbin3 2 points 10 hours ago the stated reason was that most of the hemp becomes a legal smoke/vape product that gets sprayed with unregulated Chinese chemicals (thca etc) to make gas station weed vapes... who knows if the money behind it is from somewhere else like booze or the medical marijuana growers or whoever permalink parent award report block reply GhostOfTheRepublic 1 points 9 hours ago unfortunately, hemp as a plant has many useful purposes.  But, this is the way of centralized government - one rule to govern them all regardless of the consequences locally. permalink parent award report block reply\nGhostOfTheRepublic 1 points 9 hours ago unfortunately, hemp as a plant has many useful purposes.  But, this is the way of centralized government - one rule to govern them all regardless of the consequences locally. permalink parent award report block reply\nRINO_fatigue -1 points 8 hours ago marijuana should be illegal, the people who use it are all total losers, most of them are negro or the moral equivalent permalink award report block reply"}