{"id": "1ARK9pfap1", "contents": "62 Comments Turned Off on White House YouTube posted 9 hours ago by FartOnLibtards 13 comments award share download report block\n13 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget EvJohn 16 points 9 hours ago We sure gave biden and obama hell for this... permalink award report block reply couranto 7 points 8 hours ago Biden shut them off, never turned on. permalink award report block reply FartOnLibtards OP 3 points 7 hours ago Trump ok with that? permalink parent award report block reply Seatacjoe 1 points 3 hours ago YouTube removed the down vote button to protect Joepedo permalink parent award report block reply punishedvin 4 points 9 hours ago They're always shut off. permalink award report block reply Goozmania 3 points 9 hours ago Have been for a couple months, at least. permalink award report block reply guywholikesDjtof2024 3 points 9 hours ago So it's been in bad condition for months. All the worse. permalink parent award report block reply guywholikesDjtof2024 3 points 9 hours ago Probably YT's doing. YT is woke. permalink award report block reply Gletkin 3 points 8 hours ago Epstein, Israel, Iran, H1B’s, Netanyahu. Trump is destroying MAGA and he should hear about it. permalink award report block reply BidenShowerDrool 2 points 8 hours ago Too true,....MAGA is ripping itself apart over the principles and promises it pitched. I knew it the moment the Heavy Hitter Donor Class Barged in with its big checks  and Trump's rhetoric changed greatly as he started kissing their rings in return. permalink parent award report block reply FartOnLibtards OP 2 points 7 hours ago The big warning sign was when Elon and tech bros showed up like they owned the place.  But even worse was when Trump fell for their scam.  Trump still hasn't recovered from the Elon sabotage and likely won't. permalink parent award report block reply BidenShowerDrool 2 points 7 hours ago He seems to speak highly of Peter Thiel, Larry Ellison and all the other Tech mafia in California looking to snag mega Billion dollar contracts for life ....like the Amazon Web Services, Bezos snagged and it allowed him to get into bed with the Pentagon which then turned his entire company fortunes around into teh black and Amazon started making money for the first time, up until then Amazon was an internet  financial black hole money pit and the stock-market was getting very weary of the enterprise. permalink parent award report block reply NoStepNovember 1 points 6 hours ago What the fuck are you even on about? That shit might work on bluesky, but not here faggot.  Deported. permalink parent award report block reply\nEvJohn 16 points 9 hours ago We sure gave biden and obama hell for this... permalink award report block reply\ncouranto 7 points 8 hours ago Biden shut them off, never turned on. permalink award report block reply FartOnLibtards OP 3 points 7 hours ago Trump ok with that? permalink parent award report block reply Seatacjoe 1 points 3 hours ago YouTube removed the down vote button to protect Joepedo permalink parent award report block reply\nFartOnLibtards OP 3 points 7 hours ago Trump ok with that? permalink parent award report block reply\nSeatacjoe 1 points 3 hours ago YouTube removed the down vote button to protect Joepedo permalink parent award report block reply\npunishedvin 4 points 9 hours ago They're always shut off. permalink award report block reply\nGoozmania 3 points 9 hours ago Have been for a couple months, at least. permalink award report block reply guywholikesDjtof2024 3 points 9 hours ago So it's been in bad condition for months. All the worse. permalink parent award report block reply\nguywholikesDjtof2024 3 points 9 hours ago So it's been in bad condition for months. All the worse. permalink parent award report block reply\nguywholikesDjtof2024 3 points 9 hours ago Probably YT's doing. YT is woke. permalink award report block reply\nGletkin 3 points 8 hours ago Epstein, Israel, Iran, H1B’s, Netanyahu. Trump is destroying MAGA and he should hear about it. permalink award report block reply BidenShowerDrool 2 points 8 hours ago Too true,....MAGA is ripping itself apart over the principles and promises it pitched. I knew it the moment the Heavy Hitter Donor Class Barged in with its big checks  and Trump's rhetoric changed greatly as he started kissing their rings in return. permalink parent award report block reply FartOnLibtards OP 2 points 7 hours ago The big warning sign was when Elon and tech bros showed up like they owned the place.  But even worse was when Trump fell for their scam.  Trump still hasn't recovered from the Elon sabotage and likely won't. permalink parent award report block reply BidenShowerDrool 2 points 7 hours ago He seems to speak highly of Peter Thiel, Larry Ellison and all the other Tech mafia in California looking to snag mega Billion dollar contracts for life ....like the Amazon Web Services, Bezos snagged and it allowed him to get into bed with the Pentagon which then turned his entire company fortunes around into teh black and Amazon started making money for the first time, up until then Amazon was an internet  financial black hole money pit and the stock-market was getting very weary of the enterprise. permalink parent award report block reply NoStepNovember 1 points 6 hours ago What the fuck are you even on about? That shit might work on bluesky, but not here faggot.  Deported. permalink parent award report block reply\nBidenShowerDrool 2 points 8 hours ago Too true,....MAGA is ripping itself apart over the principles and promises it pitched. I knew it the moment the Heavy Hitter Donor Class Barged in with its big checks  and Trump's rhetoric changed greatly as he started kissing their rings in return. permalink parent award report block reply FartOnLibtards OP 2 points 7 hours ago The big warning sign was when Elon and tech bros showed up like they owned the place.  But even worse was when Trump fell for their scam.  Trump still hasn't recovered from the Elon sabotage and likely won't. permalink parent award report block reply BidenShowerDrool 2 points 7 hours ago He seems to speak highly of Peter Thiel, Larry Ellison and all the other Tech mafia in California looking to snag mega Billion dollar contracts for life ....like the Amazon Web Services, Bezos snagged and it allowed him to get into bed with the Pentagon which then turned his entire company fortunes around into teh black and Amazon started making money for the first time, up until then Amazon was an internet  financial black hole money pit and the stock-market was getting very weary of the enterprise. permalink parent award report block reply NoStepNovember 1 points 6 hours ago What the fuck are you even on about? That shit might work on bluesky, but not here faggot.  Deported. permalink parent award report block reply\nFartOnLibtards OP 2 points 7 hours ago The big warning sign was when Elon and tech bros showed up like they owned the place.  But even worse was when Trump fell for their scam.  Trump still hasn't recovered from the Elon sabotage and likely won't. permalink parent award report block reply BidenShowerDrool 2 points 7 hours ago He seems to speak highly of Peter Thiel, Larry Ellison and all the other Tech mafia in California looking to snag mega Billion dollar contracts for life ....like the Amazon Web Services, Bezos snagged and it allowed him to get into bed with the Pentagon which then turned his entire company fortunes around into teh black and Amazon started making money for the first time, up until then Amazon was an internet  financial black hole money pit and the stock-market was getting very weary of the enterprise. permalink parent award report block reply NoStepNovember 1 points 6 hours ago What the fuck are you even on about? That shit might work on bluesky, but not here faggot.  Deported. permalink parent award report block reply\nBidenShowerDrool 2 points 7 hours ago He seems to speak highly of Peter Thiel, Larry Ellison and all the other Tech mafia in California looking to snag mega Billion dollar contracts for life ....like the Amazon Web Services, Bezos snagged and it allowed him to get into bed with the Pentagon which then turned his entire company fortunes around into teh black and Amazon started making money for the first time, up until then Amazon was an internet  financial black hole money pit and the stock-market was getting very weary of the enterprise. permalink parent award report block reply\nNoStepNovember 1 points 6 hours ago What the fuck are you even on about? That shit might work on bluesky, but not here faggot.  Deported. permalink parent award report block reply"}