{"id": "1ARK53LTYT", "contents": "314 Maine elects woman convicted of killing Canadian tourist to city council posted 6 days ago by Quiznos585 9 comments award share report block New York Post @nypost • 6d Maine elects woman convicted of killing Canadian tourist to city council: ‘So broken’ https://t.co/NzuwBUEclO\n9 comments Sort by Top Top New Worst Old Save Odyssey 11 points 6 days ago The 1st year of Trump's Presidency was supposed to be about eradicating mail-in ballot fraud. Now the consequences of not focusing on voter fraud are devastating. permalink award report block reply lul_cheto 2 points 5 days ago Best we can do is infinite money for azzreal permalink parent award report block reply Counterwhat 5 points 6 days ago Democrats are fine with violence. Look the killed the debater and even in Virginia. The elected Jay Jones. permalink award report block reply ChinchillaCapitalism 3 points 5 days ago We need to be hammering this message home with low propensity voters: If you don't get out and vote, you will never be left alone, you will be killed as convenient. The left hates you, unconditionally, and will push as far as they can as fast as they can, without any hesitation or care for morality. permalink parent award report block reply Counterwhat 1 points 5 days ago Exactly. They don't understand. They think it won't affect them. Ultimately, they are the ones that are mostly hurt. They wonder why it happened to them. permalink parent award report block reply BaldyGull 2 points 5 days ago They must really hate Canadians up there. Quite the neighborly dispute, eh. permalink award report block reply Gildoom 2 points 5 days ago If the tourists was from Quebec it is okay. permalink award report block reply brutustyberius 1 points 5 days ago She got my vote...Just kidding Canadians! permalink award report block reply\nOdyssey 11 points 6 days ago The 1st year of Trump's Presidency was supposed to be about eradicating mail-in ballot fraud. Now the consequences of not focusing on voter fraud are devastating. permalink award report block reply lul_cheto 2 points 5 days ago Best we can do is infinite money for azzreal permalink parent award report block reply\nlul_cheto 2 points 5 days ago Best we can do is infinite money for azzreal permalink parent award report block reply\nCounterwhat 5 points 6 days ago Democrats are fine with violence. Look the killed the debater and even in Virginia. The elected Jay Jones. permalink award report block reply ChinchillaCapitalism 3 points 5 days ago We need to be hammering this message home with low propensity voters: If you don't get out and vote, you will never be left alone, you will be killed as convenient. The left hates you, unconditionally, and will push as far as they can as fast as they can, without any hesitation or care for morality. permalink parent award report block reply Counterwhat 1 points 5 days ago Exactly. They don't understand. They think it won't affect them. Ultimately, they are the ones that are mostly hurt. They wonder why it happened to them. permalink parent award report block reply\nChinchillaCapitalism 3 points 5 days ago We need to be hammering this message home with low propensity voters: If you don't get out and vote, you will never be left alone, you will be killed as convenient. The left hates you, unconditionally, and will push as far as they can as fast as they can, without any hesitation or care for morality. permalink parent award report block reply Counterwhat 1 points 5 days ago Exactly. They don't understand. They think it won't affect them. Ultimately, they are the ones that are mostly hurt. They wonder why it happened to them. permalink parent award report block reply\nCounterwhat 1 points 5 days ago Exactly. They don't understand. They think it won't affect them. Ultimately, they are the ones that are mostly hurt. They wonder why it happened to them. permalink parent award report block reply\nBaldyGull 2 points 5 days ago They must really hate Canadians up there. Quite the neighborly dispute, eh. permalink award report block reply\nGildoom 2 points 5 days ago If the tourists was from Quebec it is okay. permalink award report block reply\nbrutustyberius 1 points 5 days ago She got my vote...Just kidding Canadians! permalink award report block reply"}