{"id": "1ARK55acVF", "contents": "824 Tucker says quiet part out loud. They all need to go. DEPORT posted 5 days ago by FBIAREFAGGOTS 64 comments award share report block iamyesyouareno @iamyesyouareno • 6d Tucker Carlson on mass immigration: “It’s to humiliate & degrade the White population. It’s the biggest and darkest thing that has happened in the last 1000 years!” He’s speaking absolute facts here.\n64 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Wexit-Delecto 75 points 5 days ago In other news, Israel really hates Tucker these days. permalink award report block reply Taqiyya_Mockingbird 36 points 5 days ago Lets hear what Barbara Lerner Spectre thinks permalink parent award report block reply TruthWillOut 6 points 5 days ago Barbara Lerner Spectre calls for destruction of Christian European ethnic societies. permalink parent award report block reply ParadigmShift2070 13 points 5 days ago The white replacement is Qatari conspiracy theory! permalink parent award report block reply patrioticwinning3 14 points 5 days ago \"Oh yea, you think Whites are being replaced?  yOu ArE a GoAt FuCkEr!\" -Every mossad faggot on pdw  :p permalink parent award report block reply okboomer59 4 points 4 days ago Whites are being replaced by goatfuckers. permalink parent award report block reply Prussian_Pepe 2 points 4 days ago And Bibi's boys will say you are funded by goat fuckers for saying that. It makes since when you live in a web of altered reality and lies like the left does... To anyone with a functional brain though.... permalink parent award report block reply view 1 more comments... patrioticwinning3 1 points 3 days ago And poojeets, and beaners, basically anyone who hates America and isn't White... permalink parent award report block reply Shitsbrokeyo 42 points 5 days ago This is why they pray in the street, blast the call to prayer etc dominance and humiliation. permalink award report block reply Modernturnkey 4 points 5 days ago They need to be Brenton'd permalink parent award report block reply itsallascam6 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply HumblePepe 33 points 5 days ago Remember, Tucker is now the \"Woke Reich\" for saying these things. permalink award report block reply patrioticwinning3 15 points 5 days ago I thought bibi labeled us all, \"Woke Reich\" :p permalink parent award report block reply TrumpAndGodWin 12 points 5 days ago Didn't Randy Fine (congressman?) call Tucker the new head if the Hitler youth, and also use tricks to put you in prison for five years for free speech against Israel if you hang a sign over a highway. permalink parent award report block reply Prussian_Pepe 2 points 4 days ago Florida doesn't allow the first amendment anymore. bAsEd dEsAnTiS made sure he signed that into law. That some animals are more equal than others. And you can't say anything bad about them. Just like the laws in Europe. And check out how well it's going for them!! permalink parent award report block reply stillbringingitback 6 points 5 days ago The Reich is back on the menu boys! permalink parent award report block reply ACActual 28 points 5 days ago Short of the total Mass Deportation of All foreigners beginning 8 months ago I don't see a peaceful way to avoid losing our country.   Am I wrong?  Explain why permalink award report block reply budgsxr 21 points 5 days ago Yup. We’re not voting our way out of this shit. permalink parent award report block reply genericamerican69 11 points 5 days ago I literally had an illegal Mexican walk up to me speaking in rapid fire Spanish asking for free shit and telling me he came to the country 6 months ago. How in the fuck is that possible? I literally voted for this exact situation to not happen anymore and it's been happening anyway. There will be a civil war due to this before the next presidential election. permalink parent award report block reply Weezinglvl100 13 points 5 days ago There is no voting out of this. It's gonna be a fight if we want to keep it imho permalink parent award report block reply covok48 6 points 5 days ago Correct. It’s nice we’re ramping it up, but we won’t even get out the illegals Biden let in. Much less anyone coming in since the 70s. permalink parent award report block reply ColonelKlink 25 points 5 days ago The commie democrats have been trying to destroy our country for a very long time. This is part of it. permalink award report block reply abstr4ct 27 points 5 days ago \"The Cloward–Piven strategy is a political strategy outlined in 1966 by American sociologists and political activists Richard Cloward and Frances Fox Piven. The strategy aims to utilize \"militant anti poverty groups\" to facilitate a \"political crisis\" by overloading the welfare system via an increase in welfare claims, forcing the creation of a system of guaranteed minimum income and \"redistributing income through the federal government\"\" permalink parent award report block reply TrumpAndGodWin 10 points 5 days ago All to prepare for their cashless society and communist style social credit score where they will wage war on you with the push of a button to make you homeless and starving. Reminder that they used their covid plan to also test cashless at places like Walmart. permalink parent award report block reply ParadigmShift2070 10 points 5 days ago They were married and Frances fox piven is Jewish permalink parent award report block reply Prussian_Pepe 2 points 4 days ago Someone got really butt hurt for you pointing out 2 facts. That are facts...\nJust the usual yid serial lying shit heads at it again I guess. permalink parent award report block reply GuerillaYourDreams 6 points 5 days ago Thank you. permalink parent award report block reply Another_ID 17 points 5 days ago Stunned that Morgan could be quiet for so long. permalink award report block reply MadRussian 12 points 5 days ago There's a reason Mark Jewine is dying mad about Tucker these days. permalink award report block reply patrioticwinning3 10 points 5 days ago Can't cuck the Tuck! permalink award report block reply stillbringingitback 10 points 5 days ago Jews.  That’s your answer lol. permalink award report block reply BillboDickens 9 points 5 days ago But Ben Shapiro told me this is antisemitic permalink award report block reply stillbringingitback 8 points 5 days ago Remember it’s not the “woke reich.”  It’s MAGA formally displacing the “Old Guard” conservatives.  The “reich” reference is our position on Israel and foreign interference AIPAC, SPLC and the like.  Now this is constantly referenced  as antisemitism…but that’s bc Jews control these marauding gangs lol. permalink award report block reply NonbinaryPotatohead 6 points 5 days ago The Noticing in Chief permalink award report block reply worldowedexplanation 3 points 5 days ago We should invade all of Africa and gentrify it. Slaughter them all and take it over. You know, like the British did. permalink award report block reply NoticesBugleOWO -1 points 5 days ago Pretty sure WWII was the biggest, darkest thing of the last 1000 years. ...but we could be headed for something worse due to the third world migrant crisis, that much is true. permalink award report block reply Constantin2024 -1 points 5 days ago I know that there's a massive battle within the \"conservative right\" but I don't understand why. Thinking people are allowed to have disagreements, and even believe other rational adults are making mistakes. As a Christian, I believe that Tucker Carlson truly tries to live up to Christ's command to 'love your neighbor as yourself.'  I also believe he is a flawed human being who has made mistakes. If the \"conservative right\" is going to destroy anyone that doesn't 'toe the party line,' then it is no better than the left. I don't think Tucker should have given a softball interview to Fuentes without challenging the horrid things that young man has said, but I will not support a \"conservative\" movement that eviscerates people who make mistakes. permalink award report block reply ParadigmShift2070 11 points 5 days ago Tell that to the Judeo-cons, they're the ones doing the cancelings permalink parent award report block reply covok48 9 points 5 days ago All this talk and you haven’t defined what “conservative right” even is. permalink parent award report block reply invalid_data 3 points 5 days ago Name one horrid thing Nick Fuentes said. Ohhhh, is it because he just straight calls out the consistency of the jewish people always being involved in suspicious and nefarious activities. Ohhh its because he noticed the truth that Israel has been trying to squash for a century. permalink parent award report block reply Constantin2024 1 points 4 days ago I'm talking more about his fawning admiration for Hitler and openly calling on his followers to r*pe. There have been plenty of \"angry young men\" across time and the good ones do not go around advocating vile acts against their fellow man nor idolizing those who do. But you do you. permalink parent award report block reply TrumpAndGodWin 2 points 5 days ago It wasn't softball and it's not a mistake to interview anyone of any kind, anyone against free speech should be exiled. permalink parent award report block reply Constantin2024 1 points 4 days ago You do realize that the whole \"free speech\" Amendment bars the GOVERNMENT from curtailing speech, correct? A private citizen can choose not to listen to or amplify anyone they disagree with. permalink parent award report block reply Goozmania -26 points 5 days ago America should be multi-ethnic. I support civic nationalism in America; regardless of what people look like, if they are \"culturally white\" they are welcome here. Europe, however, should not be. Europe is the ancestral homeland of white people, and should remain as such. If any European country exceeds 5% in non-white population, there is a massive problem... and they all have. Edit: And my reasoning for this is that, throughout the last 400 years, America has invited people from various countries, both from non-English Europe and outside of Europe, for various reasons... indigenous population on conquered land (latinos and natives), slavery (blacks), railroad construction (chinese and mexicans), hawaiian plantation farming (phillipinos, koreans, chinese and japanese), farming in california (more mexicans), cannery and fishery workers (see hawaiian plantation), the construction of the state of Florida (bahamian and carribbean). permalink award report block reply Electricutie 34 points 5 days ago America should be hyper-majority white.  I say this as a child of legal Chinese immigrants.  American culture and history will be eroded and destroyed if it is not majority white.  I don't want to see that happen. permalink parent award report block reply TrumpAndGodWin 6 points 5 days ago Whites are only seven percent of the world's population so naturally as minorities the US should be overwhelmingly white as a 'natural preserve' to protect them against the many tribalistic threats. permalink parent award report block reply genericamerican69 2 points 5 days ago I literally said that it wouldn't make sense to teach the history of America to an entire generation of non western kids who are brown and couldn't see themselves as members of the civilization that produced the founding fathers and the Anglo american culture. If everyone in the country is Asian and Indian, how would it make sense to teach a history that is essentially an extension of white people's civilizational history? This is why they are rewriting history with all the movies/TV shows/commercials. The globalist technocrat corporations would prefer the US to simply be the vehicle for their products and they cant endlessly expand their markets if the US explicitly belongs to its majority founding demographic (english speaking white people), so they need to replace everyone as quickly as possible with non westerners. Therefore most of the people in north America will be Indians Asians and mexicans by the end of the century. It will no longer make sense to teach western history at that point. For some reason people just dont understand that even though it's just basic math and cause and effect. permalink parent award report block reply HumblePepe 17 points 5 days ago It always have been. Germans. British. Scottish. Irish. Polish. Portuguese. Spanish. French. And, many, many more, all living together and putting down ancient grudges for the new world. But because they all constitute \"White\" that's not the correct multi-ethnic ideal. And it's only one way for other races. Whites give up their identity for the sake of multiculturalism while every other race keeps their own. permalink parent award report block reply SimaYi 12 points 5 days ago Access to White people is not a human right. But don't worry. Enough people see it your way that nothing will change. The thing is that you're wrong. America was great because it took the best of the White population of the West and let them be free. America needs to be a White supremacist nation to be America. That's what it has always been. A White country, ruled by Whites.\nCivic nationalism is a cope by still too afraid to be called racist. permalink parent award report block reply LordCommissarYarrick 8 points 5 days ago Someone forgot about the various exclusion acts and immigration laws as well as removals. White countries were always prioritized; asians, slavs, greeks, turks,  africans, arabs, dot indians were all barred or had heavy quotas placed on them. Americans born prior to 1940s would be horrified at what it has become with synagogues, asiatic temples, mosques, and pagan monkey god statues being blatantly present or US politicians celebrating Indian holidays. permalink parent award report block reply Dangerous 4 points 5 days ago I wouldn't say \"SHOULD be multi ethnic\", but the reality of US identity is that while majority Anglo Christian in origin, culture, and nature, the body of the national identity has at least since the Civil War been compacted by all manner of global minority for whatever reason that minority found itself here. US identitarianism, for right or wrong, can't ever really \"escape\" its multi ethnic build: its identity should be based off of citizenship, and the status of citizenship needs to be severely scrutinized going back 100+ years European nations have no such foundational or cultural tieback and should absolutely make their national identities based solely on ethnicity permalink parent award report block reply load 12 more comments... TheGoyimWhisperer 0 points 5 days ago Comment removed upon the user being banned. permalink award report block reply\nWexit-Delecto 75 points 5 days ago In other news, Israel really hates Tucker these days. permalink award report block reply Taqiyya_Mockingbird 36 points 5 days ago Lets hear what Barbara Lerner Spectre thinks permalink parent award report block reply TruthWillOut 6 points 5 days ago Barbara Lerner Spectre calls for destruction of Christian European ethnic societies. permalink parent award report block reply ParadigmShift2070 13 points 5 days ago The white replacement is Qatari conspiracy theory! permalink parent award report block reply patrioticwinning3 14 points 5 days ago \"Oh yea, you think Whites are being replaced?  yOu ArE a GoAt FuCkEr!\" -Every mossad faggot on pdw  :p permalink parent award report block reply okboomer59 4 points 4 days ago Whites are being replaced by goatfuckers. permalink parent award report block reply Prussian_Pepe 2 points 4 days ago And Bibi's boys will say you are funded by goat fuckers for saying that. It makes since when you live in a web of altered reality and lies like the left does... To anyone with a functional brain though.... permalink parent award report block reply view 1 more comments... patrioticwinning3 1 points 3 days ago And poojeets, and beaners, basically anyone who hates America and isn't White... permalink parent award report block reply\nTaqiyya_Mockingbird 36 points 5 days ago Lets hear what Barbara Lerner Spectre thinks permalink parent award report block reply TruthWillOut 6 points 5 days ago Barbara Lerner Spectre calls for destruction of Christian European ethnic societies. permalink parent award report block reply\nTruthWillOut 6 points 5 days ago Barbara Lerner Spectre calls for destruction of Christian European ethnic societies. permalink parent award report block reply\nParadigmShift2070 13 points 5 days ago The white replacement is Qatari conspiracy theory! permalink parent award report block reply patrioticwinning3 14 points 5 days ago \"Oh yea, you think Whites are being replaced?  yOu ArE a GoAt FuCkEr!\" -Every mossad faggot on pdw  :p permalink parent award report block reply okboomer59 4 points 4 days ago Whites are being replaced by goatfuckers. permalink parent award report block reply Prussian_Pepe 2 points 4 days ago And Bibi's boys will say you are funded by goat fuckers for saying that. It makes since when you live in a web of altered reality and lies like the left does... To anyone with a functional brain though.... permalink parent award report block reply view 1 more comments... patrioticwinning3 1 points 3 days ago And poojeets, and beaners, basically anyone who hates America and isn't White... permalink parent award report block reply\npatrioticwinning3 14 points 5 days ago \"Oh yea, you think Whites are being replaced?  yOu ArE a GoAt FuCkEr!\" -Every mossad faggot on pdw  :p permalink parent award report block reply okboomer59 4 points 4 days ago Whites are being replaced by goatfuckers. permalink parent award report block reply Prussian_Pepe 2 points 4 days ago And Bibi's boys will say you are funded by goat fuckers for saying that. It makes since when you live in a web of altered reality and lies like the left does... To anyone with a functional brain though.... permalink parent award report block reply view 1 more comments... patrioticwinning3 1 points 3 days ago And poojeets, and beaners, basically anyone who hates America and isn't White... permalink parent award report block reply\nokboomer59 4 points 4 days ago Whites are being replaced by goatfuckers. permalink parent award report block reply Prussian_Pepe 2 points 4 days ago And Bibi's boys will say you are funded by goat fuckers for saying that. It makes since when you live in a web of altered reality and lies like the left does... To anyone with a functional brain though.... permalink parent award report block reply view 1 more comments... patrioticwinning3 1 points 3 days ago And poojeets, and beaners, basically anyone who hates America and isn't White... permalink parent award report block reply\nPrussian_Pepe 2 points 4 days ago And Bibi's boys will say you are funded by goat fuckers for saying that. It makes since when you live in a web of altered reality and lies like the left does... To anyone with a functional brain though.... permalink parent award report block reply view 1 more comments...\npatrioticwinning3 1 points 3 days ago And poojeets, and beaners, basically anyone who hates America and isn't White... permalink parent award report block reply\nShitsbrokeyo 42 points 5 days ago This is why they pray in the street, blast the call to prayer etc dominance and humiliation. permalink award report block reply Modernturnkey 4 points 5 days ago They need to be Brenton'd permalink parent award report block reply itsallascam6 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply\nModernturnkey 4 points 5 days ago They need to be Brenton'd permalink parent award report block reply\nitsallascam6 1 points 5 days ago Comment removed by community moderators. permalink parent award report block reply\nHumblePepe 33 points 5 days ago Remember, Tucker is now the \"Woke Reich\" for saying these things. permalink award report block reply patrioticwinning3 15 points 5 days ago I thought bibi labeled us all, \"Woke Reich\" :p permalink parent award report block reply TrumpAndGodWin 12 points 5 days ago Didn't Randy Fine (congressman?) call Tucker the new head if the Hitler youth, and also use tricks to put you in prison for five years for free speech against Israel if you hang a sign over a highway. permalink parent award report block reply Prussian_Pepe 2 points 4 days ago Florida doesn't allow the first amendment anymore. bAsEd dEsAnTiS made sure he signed that into law. That some animals are more equal than others. And you can't say anything bad about them. Just like the laws in Europe. And check out how well it's going for them!! permalink parent award report block reply stillbringingitback 6 points 5 days ago The Reich is back on the menu boys! permalink parent award report block reply\npatrioticwinning3 15 points 5 days ago I thought bibi labeled us all, \"Woke Reich\" :p permalink parent award report block reply\nTrumpAndGodWin 12 points 5 days ago Didn't Randy Fine (congressman?) call Tucker the new head if the Hitler youth, and also use tricks to put you in prison for five years for free speech against Israel if you hang a sign over a highway. permalink parent award report block reply Prussian_Pepe 2 points 4 days ago Florida doesn't allow the first amendment anymore. bAsEd dEsAnTiS made sure he signed that into law. That some animals are more equal than others. And you can't say anything bad about them. Just like the laws in Europe. And check out how well it's going for them!! permalink parent award report block reply\nPrussian_Pepe 2 points 4 days ago Florida doesn't allow the first amendment anymore. bAsEd dEsAnTiS made sure he signed that into law. That some animals are more equal than others. And you can't say anything bad about them. Just like the laws in Europe. And check out how well it's going for them!! permalink parent award report block reply\nstillbringingitback 6 points 5 days ago The Reich is back on the menu boys! permalink parent award report block reply\nACActual 28 points 5 days ago Short of the total Mass Deportation of All foreigners beginning 8 months ago I don't see a peaceful way to avoid losing our country.   Am I wrong?  Explain why permalink award report block reply budgsxr 21 points 5 days ago Yup. We’re not voting our way out of this shit. permalink parent award report block reply genericamerican69 11 points 5 days ago I literally had an illegal Mexican walk up to me speaking in rapid fire Spanish asking for free shit and telling me he came to the country 6 months ago. How in the fuck is that possible? I literally voted for this exact situation to not happen anymore and it's been happening anyway. There will be a civil war due to this before the next presidential election. permalink parent award report block reply Weezinglvl100 13 points 5 days ago There is no voting out of this. It's gonna be a fight if we want to keep it imho permalink parent award report block reply covok48 6 points 5 days ago Correct. It’s nice we’re ramping it up, but we won’t even get out the illegals Biden let in. Much less anyone coming in since the 70s. permalink parent award report block reply\nbudgsxr 21 points 5 days ago Yup. We’re not voting our way out of this shit. permalink parent award report block reply genericamerican69 11 points 5 days ago I literally had an illegal Mexican walk up to me speaking in rapid fire Spanish asking for free shit and telling me he came to the country 6 months ago. How in the fuck is that possible? I literally voted for this exact situation to not happen anymore and it's been happening anyway. There will be a civil war due to this before the next presidential election. permalink parent award report block reply\ngenericamerican69 11 points 5 days ago I literally had an illegal Mexican walk up to me speaking in rapid fire Spanish asking for free shit and telling me he came to the country 6 months ago. How in the fuck is that possible? I literally voted for this exact situation to not happen anymore and it's been happening anyway. There will be a civil war due to this before the next presidential election. permalink parent award report block reply\nWeezinglvl100 13 points 5 days ago There is no voting out of this. It's gonna be a fight if we want to keep it imho permalink parent award report block reply\ncovok48 6 points 5 days ago Correct. It’s nice we’re ramping it up, but we won’t even get out the illegals Biden let in. Much less anyone coming in since the 70s. permalink parent award report block reply\nColonelKlink 25 points 5 days ago The commie democrats have been trying to destroy our country for a very long time. This is part of it. permalink award report block reply abstr4ct 27 points 5 days ago \"The Cloward–Piven strategy is a political strategy outlined in 1966 by American sociologists and political activists Richard Cloward and Frances Fox Piven. The strategy aims to utilize \"militant anti poverty groups\" to facilitate a \"political crisis\" by overloading the welfare system via an increase in welfare claims, forcing the creation of a system of guaranteed minimum income and \"redistributing income through the federal government\"\" permalink parent award report block reply TrumpAndGodWin 10 points 5 days ago All to prepare for their cashless society and communist style social credit score where they will wage war on you with the push of a button to make you homeless and starving. Reminder that they used their covid plan to also test cashless at places like Walmart. permalink parent award report block reply ParadigmShift2070 10 points 5 days ago They were married and Frances fox piven is Jewish permalink parent award report block reply Prussian_Pepe 2 points 4 days ago Someone got really butt hurt for you pointing out 2 facts. That are facts...\nJust the usual yid serial lying shit heads at it again I guess. permalink parent award report block reply GuerillaYourDreams 6 points 5 days ago Thank you. permalink parent award report block reply\nabstr4ct 27 points 5 days ago \"The Cloward–Piven strategy is a political strategy outlined in 1966 by American sociologists and political activists Richard Cloward and Frances Fox Piven. The strategy aims to utilize \"militant anti poverty groups\" to facilitate a \"political crisis\" by overloading the welfare system via an increase in welfare claims, forcing the creation of a system of guaranteed minimum income and \"redistributing income through the federal government\"\" permalink parent award report block reply TrumpAndGodWin 10 points 5 days ago All to prepare for their cashless society and communist style social credit score where they will wage war on you with the push of a button to make you homeless and starving. Reminder that they used their covid plan to also test cashless at places like Walmart. permalink parent award report block reply ParadigmShift2070 10 points 5 days ago They were married and Frances fox piven is Jewish permalink parent award report block reply Prussian_Pepe 2 points 4 days ago Someone got really butt hurt for you pointing out 2 facts. That are facts...\nJust the usual yid serial lying shit heads at it again I guess. permalink parent award report block reply GuerillaYourDreams 6 points 5 days ago Thank you. permalink parent award report block reply\nTrumpAndGodWin 10 points 5 days ago All to prepare for their cashless society and communist style social credit score where they will wage war on you with the push of a button to make you homeless and starving. Reminder that they used their covid plan to also test cashless at places like Walmart. permalink parent award report block reply\nParadigmShift2070 10 points 5 days ago They were married and Frances fox piven is Jewish permalink parent award report block reply Prussian_Pepe 2 points 4 days ago Someone got really butt hurt for you pointing out 2 facts. That are facts...\nJust the usual yid serial lying shit heads at it again I guess. permalink parent award report block reply\nPrussian_Pepe 2 points 4 days ago Someone got really butt hurt for you pointing out 2 facts. That are facts...\nJust the usual yid serial lying shit heads at it again I guess. permalink parent award report block reply\nGuerillaYourDreams 6 points 5 days ago Thank you. permalink parent award report block reply\nAnother_ID 17 points 5 days ago Stunned that Morgan could be quiet for so long. permalink award report block reply\nMadRussian 12 points 5 days ago There's a reason Mark Jewine is dying mad about Tucker these days. permalink award report block reply\npatrioticwinning3 10 points 5 days ago Can't cuck the Tuck! permalink award report block reply\nstillbringingitback 10 points 5 days ago Jews.  That’s your answer lol. permalink award report block reply\nBillboDickens 9 points 5 days ago But Ben Shapiro told me this is antisemitic permalink award report block reply\nstillbringingitback 8 points 5 days ago Remember it’s not the “woke reich.”  It’s MAGA formally displacing the “Old Guard” conservatives.  The “reich” reference is our position on Israel and foreign interference AIPAC, SPLC and the like.  Now this is constantly referenced  as antisemitism…but that’s bc Jews control these marauding gangs lol. permalink award report block reply\nNonbinaryPotatohead 6 points 5 days ago The Noticing in Chief permalink award report block reply\nworldowedexplanation 3 points 5 days ago We should invade all of Africa and gentrify it. Slaughter them all and take it over. You know, like the British did. permalink award report block reply\nNoticesBugleOWO -1 points 5 days ago Pretty sure WWII was the biggest, darkest thing of the last 1000 years. ...but we could be headed for something worse due to the third world migrant crisis, that much is true. permalink award report block reply\nConstantin2024 -1 points 5 days ago I know that there's a massive battle within the \"conservative right\" but I don't understand why. Thinking people are allowed to have disagreements, and even believe other rational adults are making mistakes. As a Christian, I believe that Tucker Carlson truly tries to live up to Christ's command to 'love your neighbor as yourself.'  I also believe he is a flawed human being who has made mistakes. If the \"conservative right\" is going to destroy anyone that doesn't 'toe the party line,' then it is no better than the left. I don't think Tucker should have given a softball interview to Fuentes without challenging the horrid things that young man has said, but I will not support a \"conservative\" movement that eviscerates people who make mistakes. permalink award report block reply ParadigmShift2070 11 points 5 days ago Tell that to the Judeo-cons, they're the ones doing the cancelings permalink parent award report block reply covok48 9 points 5 days ago All this talk and you haven’t defined what “conservative right” even is. permalink parent award report block reply invalid_data 3 points 5 days ago Name one horrid thing Nick Fuentes said. Ohhhh, is it because he just straight calls out the consistency of the jewish people always being involved in suspicious and nefarious activities. Ohhh its because he noticed the truth that Israel has been trying to squash for a century. permalink parent award report block reply Constantin2024 1 points 4 days ago I'm talking more about his fawning admiration for Hitler and openly calling on his followers to r*pe. There have been plenty of \"angry young men\" across time and the good ones do not go around advocating vile acts against their fellow man nor idolizing those who do. But you do you. permalink parent award report block reply TrumpAndGodWin 2 points 5 days ago It wasn't softball and it's not a mistake to interview anyone of any kind, anyone against free speech should be exiled. permalink parent award report block reply Constantin2024 1 points 4 days ago You do realize that the whole \"free speech\" Amendment bars the GOVERNMENT from curtailing speech, correct? A private citizen can choose not to listen to or amplify anyone they disagree with. permalink parent award report block reply\nParadigmShift2070 11 points 5 days ago Tell that to the Judeo-cons, they're the ones doing the cancelings permalink parent award report block reply\ncovok48 9 points 5 days ago All this talk and you haven’t defined what “conservative right” even is. permalink parent award report block reply\ninvalid_data 3 points 5 days ago Name one horrid thing Nick Fuentes said. Ohhhh, is it because he just straight calls out the consistency of the jewish people always being involved in suspicious and nefarious activities. Ohhh its because he noticed the truth that Israel has been trying to squash for a century. permalink parent award report block reply Constantin2024 1 points 4 days ago I'm talking more about his fawning admiration for Hitler and openly calling on his followers to r*pe. There have been plenty of \"angry young men\" across time and the good ones do not go around advocating vile acts against their fellow man nor idolizing those who do. But you do you. permalink parent award report block reply\nConstantin2024 1 points 4 days ago I'm talking more about his fawning admiration for Hitler and openly calling on his followers to r*pe. There have been plenty of \"angry young men\" across time and the good ones do not go around advocating vile acts against their fellow man nor idolizing those who do. But you do you. permalink parent award report block reply\nTrumpAndGodWin 2 points 5 days ago It wasn't softball and it's not a mistake to interview anyone of any kind, anyone against free speech should be exiled. permalink parent award report block reply Constantin2024 1 points 4 days ago You do realize that the whole \"free speech\" Amendment bars the GOVERNMENT from curtailing speech, correct? A private citizen can choose not to listen to or amplify anyone they disagree with. permalink parent award report block reply\nConstantin2024 1 points 4 days ago You do realize that the whole \"free speech\" Amendment bars the GOVERNMENT from curtailing speech, correct? A private citizen can choose not to listen to or amplify anyone they disagree with. permalink parent award report block reply\nGoozmania -26 points 5 days ago America should be multi-ethnic. I support civic nationalism in America; regardless of what people look like, if they are \"culturally white\" they are welcome here. Europe, however, should not be. Europe is the ancestral homeland of white people, and should remain as such. If any European country exceeds 5% in non-white population, there is a massive problem... and they all have. Edit: And my reasoning for this is that, throughout the last 400 years, America has invited people from various countries, both from non-English Europe and outside of Europe, for various reasons... indigenous population on conquered land (latinos and natives), slavery (blacks), railroad construction (chinese and mexicans), hawaiian plantation farming (phillipinos, koreans, chinese and japanese), farming in california (more mexicans), cannery and fishery workers (see hawaiian plantation), the construction of the state of Florida (bahamian and carribbean). permalink award report block reply Electricutie 34 points 5 days ago America should be hyper-majority white.  I say this as a child of legal Chinese immigrants.  American culture and history will be eroded and destroyed if it is not majority white.  I don't want to see that happen. permalink parent award report block reply TrumpAndGodWin 6 points 5 days ago Whites are only seven percent of the world's population so naturally as minorities the US should be overwhelmingly white as a 'natural preserve' to protect them against the many tribalistic threats. permalink parent award report block reply genericamerican69 2 points 5 days ago I literally said that it wouldn't make sense to teach the history of America to an entire generation of non western kids who are brown and couldn't see themselves as members of the civilization that produced the founding fathers and the Anglo american culture. If everyone in the country is Asian and Indian, how would it make sense to teach a history that is essentially an extension of white people's civilizational history? This is why they are rewriting history with all the movies/TV shows/commercials. The globalist technocrat corporations would prefer the US to simply be the vehicle for their products and they cant endlessly expand their markets if the US explicitly belongs to its majority founding demographic (english speaking white people), so they need to replace everyone as quickly as possible with non westerners. Therefore most of the people in north America will be Indians Asians and mexicans by the end of the century. It will no longer make sense to teach western history at that point. For some reason people just dont understand that even though it's just basic math and cause and effect. permalink parent award report block reply HumblePepe 17 points 5 days ago It always have been. Germans. British. Scottish. Irish. Polish. Portuguese. Spanish. French. And, many, many more, all living together and putting down ancient grudges for the new world. But because they all constitute \"White\" that's not the correct multi-ethnic ideal. And it's only one way for other races. Whites give up their identity for the sake of multiculturalism while every other race keeps their own. permalink parent award report block reply SimaYi 12 points 5 days ago Access to White people is not a human right. But don't worry. Enough people see it your way that nothing will change. The thing is that you're wrong. America was great because it took the best of the White population of the West and let them be free. America needs to be a White supremacist nation to be America. That's what it has always been. A White country, ruled by Whites.\nCivic nationalism is a cope by still too afraid to be called racist. permalink parent award report block reply LordCommissarYarrick 8 points 5 days ago Someone forgot about the various exclusion acts and immigration laws as well as removals. White countries were always prioritized; asians, slavs, greeks, turks,  africans, arabs, dot indians were all barred or had heavy quotas placed on them. Americans born prior to 1940s would be horrified at what it has become with synagogues, asiatic temples, mosques, and pagan monkey god statues being blatantly present or US politicians celebrating Indian holidays. permalink parent award report block reply Dangerous 4 points 5 days ago I wouldn't say \"SHOULD be multi ethnic\", but the reality of US identity is that while majority Anglo Christian in origin, culture, and nature, the body of the national identity has at least since the Civil War been compacted by all manner of global minority for whatever reason that minority found itself here. US identitarianism, for right or wrong, can't ever really \"escape\" its multi ethnic build: its identity should be based off of citizenship, and the status of citizenship needs to be severely scrutinized going back 100+ years European nations have no such foundational or cultural tieback and should absolutely make their national identities based solely on ethnicity permalink parent award report block reply load 12 more comments...\nElectricutie 34 points 5 days ago America should be hyper-majority white.  I say this as a child of legal Chinese immigrants.  American culture and history will be eroded and destroyed if it is not majority white.  I don't want to see that happen. permalink parent award report block reply TrumpAndGodWin 6 points 5 days ago Whites are only seven percent of the world's population so naturally as minorities the US should be overwhelmingly white as a 'natural preserve' to protect them against the many tribalistic threats. permalink parent award report block reply genericamerican69 2 points 5 days ago I literally said that it wouldn't make sense to teach the history of America to an entire generation of non western kids who are brown and couldn't see themselves as members of the civilization that produced the founding fathers and the Anglo american culture. If everyone in the country is Asian and Indian, how would it make sense to teach a history that is essentially an extension of white people's civilizational history? This is why they are rewriting history with all the movies/TV shows/commercials. The globalist technocrat corporations would prefer the US to simply be the vehicle for their products and they cant endlessly expand their markets if the US explicitly belongs to its majority founding demographic (english speaking white people), so they need to replace everyone as quickly as possible with non westerners. Therefore most of the people in north America will be Indians Asians and mexicans by the end of the century. It will no longer make sense to teach western history at that point. For some reason people just dont understand that even though it's just basic math and cause and effect. permalink parent award report block reply\nTrumpAndGodWin 6 points 5 days ago Whites are only seven percent of the world's population so naturally as minorities the US should be overwhelmingly white as a 'natural preserve' to protect them against the many tribalistic threats. permalink parent award report block reply\ngenericamerican69 2 points 5 days ago I literally said that it wouldn't make sense to teach the history of America to an entire generation of non western kids who are brown and couldn't see themselves as members of the civilization that produced the founding fathers and the Anglo american culture. If everyone in the country is Asian and Indian, how would it make sense to teach a history that is essentially an extension of white people's civilizational history? This is why they are rewriting history with all the movies/TV shows/commercials. The globalist technocrat corporations would prefer the US to simply be the vehicle for their products and they cant endlessly expand their markets if the US explicitly belongs to its majority founding demographic (english speaking white people), so they need to replace everyone as quickly as possible with non westerners. Therefore most of the people in north America will be Indians Asians and mexicans by the end of the century. It will no longer make sense to teach western history at that point. For some reason people just dont understand that even though it's just basic math and cause and effect. permalink parent award report block reply\nHumblePepe 17 points 5 days ago It always have been. Germans. British. Scottish. Irish. Polish. Portuguese. Spanish. French. And, many, many more, all living together and putting down ancient grudges for the new world. But because they all constitute \"White\" that's not the correct multi-ethnic ideal. And it's only one way for other races. Whites give up their identity for the sake of multiculturalism while every other race keeps their own. permalink parent award report block reply\nSimaYi 12 points 5 days ago Access to White people is not a human right. But don't worry. Enough people see it your way that nothing will change. The thing is that you're wrong. America was great because it took the best of the White population of the West and let them be free. America needs to be a White supremacist nation to be America. That's what it has always been. A White country, ruled by Whites.\nCivic nationalism is a cope by still too afraid to be called racist. permalink parent award report block reply\nLordCommissarYarrick 8 points 5 days ago Someone forgot about the various exclusion acts and immigration laws as well as removals. White countries were always prioritized; asians, slavs, greeks, turks,  africans, arabs, dot indians were all barred or had heavy quotas placed on them. Americans born prior to 1940s would be horrified at what it has become with synagogues, asiatic temples, mosques, and pagan monkey god statues being blatantly present or US politicians celebrating Indian holidays. permalink parent award report block reply\nDangerous 4 points 5 days ago I wouldn't say \"SHOULD be multi ethnic\", but the reality of US identity is that while majority Anglo Christian in origin, culture, and nature, the body of the national identity has at least since the Civil War been compacted by all manner of global minority for whatever reason that minority found itself here. US identitarianism, for right or wrong, can't ever really \"escape\" its multi ethnic build: its identity should be based off of citizenship, and the status of citizenship needs to be severely scrutinized going back 100+ years European nations have no such foundational or cultural tieback and should absolutely make their national identities based solely on ethnicity permalink parent award report block reply\nTheGoyimWhisperer 0 points 5 days ago Comment removed upon the user being banned. permalink award report block reply"}