{"id": "1ARK9jzcDj", "contents": "1150 Anti-corruption agencies controlled by the US are conducting searches at the main partner of Zelensky. \n\nHe escaped from Ukraine in a few hours. Zelensky managed to warn him. Searches are also taking place at the former Minister of Energy.\n\nSo far, this is just a drop in the ocean posted 2 days ago by Trump2024Train 51 comments award share download report block\n51 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Wozzing 91 points 2 days ago You guys know that the United States has been paying for the entire government of Ukraine, all the salaries, all the retirement checks all the food stamps. permalink award report block reply LabTech 47 points 2 days ago Only ~30% of the sent funds actually reaching the front lines has been known for a long time; most of that, I suspect, immediately went back to the US by way of anonymous offshore accounts as tribute, but I'm sure all the oligarchs who were on the same page got their cut, and I'm sure all of them have had Plan B's and bug-out bags ready and waiting on a moment's notice if the whole scam went tits up. Even Zelensky has his fallback options:  I'm sure he's got a cadre of well-paid goons who can get him out of the country, even if they have to run over the last young people in the country, to get him to a NATO country, and then from there it's a hop, skip, and a jump to the office of some high ranking WEF official, who'll finalize his \"retirement\", where he'll spend the rest of his life in some well-guarded compound or estate in some picturesque location, or any of the properties his family's bought with the ill-gotten gains.  His family will have some businesses lined up for steady income, they'll probably create NPOs and organizations to get further kickbacks under cover, and probably 3-4 times a year he'll appear in the background of some globalist event where he'll claim to be fighting the good fight for his people, but he'll just be there to rub elbows with his fellow Elites and network on further scams at our expense. permalink parent award report block reply anotherthing 28 points 2 days ago FTX should have been a bigger scandal than it was. It was basically proof that the Ukraine funding was being laundered. permalink parent award report block reply aoneleggedduck 7 points 2 days ago where he'll spend the rest of his life in some well-guarded compound or estate in some picturesque location, or any of the properties his family's bought with the ill-gotten gains. Have you heard of the 916,000 acre ranch his company just bought in Wyoming? He's now the 9th top landowner in the US. permalink parent award report block reply noPTSDforMePlease 13 points 1 day ago He didn't purchase the ranch, it's still listed for sale. permalink parent award report block reply hansgruber7 10 points 1 day ago Fake and Gay. permalink parent award report block reply aoneleggedduck 7 points 1 day ago I've been bamboozled?! permalink parent award report block reply view 2 more comments... Gnometard 8 points 1 day ago Yep, but we're more focused on what social media tells us to look at... which always seems to align with causing more division and anger among the population. If not for social media, 80% of the country would be united. At the root, most people see the same problems but the influence of social media won't let people recognize that using divisive framing and rhetoric to prevent folks from seeing it. In 2016, before I stopped using everything but the Donald then PDW, I had a 10x gilded comment showing how Bernie Sanders and Trump both had the SAME problems they wanted to address. I broke it down bullet by bullet from each campaign website. Then when Bernie joined the black eye club and the dems screwed Bernie voters with polling places and other similar issues (the same shit they try to do with Republicans or anyone not on the left),  Bernie bros became Trump supporters. It was still a divisive time, but social media wasn't as prominent so there were still a lot of people able to think. Nobody can remember that far back because their attention span has been cut down through years of constant shifting of focus. People supporting the removal of filibuster don't even remember when democrats wanted that not too long ago.... and they can't think ahead to what would happen if it's removed and democrats win more seats (the left votes more than the right, only for Trump does that change) permalink parent award report block reply Smurfection 1 points 1 day ago It's not that the left votes more than the right per se.  It's that for nearly a century, the Dem vote was a reliable turnout.  General to General, primary to primary, mid-term to mid-term, the vote numbers for Dem stayed pretty much the same except due to a rise in population.   For almost a century, big turnouts meant the Dems had an advantage because big turnouts meant more uninformed and welfare recipients were voting. For almost a century, Republican voter turnout varied widely.   Here's a startling fact:  If McCain had as many Republican voters turn out as George W Bush did in 2004, McCain would have won.   If Romney had as many Republicans turn out to vote as McCain did, Romney would have won.   Obama is the first president to win re-election with substantially fewer votes than he did when he was first elected.  Also in 2012, down ballot races went badly for Democrats.  That should have been a warning sign for them. In the Trump era, in the movement to reshape the Republican party, the biggest problem we have is Republicans, conservatives, independents and libertarians not showing up at the polls.   For the last couple of elections (looking at what is real 2020 election data, not the fake stuff from the stolen states), high voter turnout for the first time is favoring Republicans and specifically MAGA candidates. The Republican vote, which is the MAGA vote, has become even more unreliable.  If MAGA shows up, MAGA wins but MAGA doesn't always show up to vote.  While GOPe has never focused on Get Out The Vote before, it's very crucial now.  Also because MAGA support is strongest in ex-urban and rural areas, it's hard to mobilize GOTV efforts.   On the flip side, Democrats have started to understand this so you notice, there are no efforts from Democrats to register voters or GOTV efforts anymore.  Democrats are using direct mail and text messages. In the dynamic and changing landscape, Republicans must make a huge effort to get the polls, register voters and GOTV.   TheNews™ isn't going to help because they'd rather ignore upcoming elections now since GOTV doesn't favor the Democrats anymore.   Dem partisans and lefties pretty much always turn out to vote but they can't rely on overwhelming black, Hispanic and welfare recipient votes like they have in the past to carry them over the top. Scott Presler, may God bless that man, has done more for the MAGA movement than most of us admit.  Yes, I know he's gay but God's Mercy is for him as much as it's for each and everyone else who is a sinner, and that's all of us.  I'm going to tell you right now, Scott Presler is showing us the way forward and I hope God has a special place reserved for Scott Presler in Heaven for his efforts. permalink parent award report block reply Scumbag-reddit 5 points 1 day ago You guys know that the Ukraine is the central hub for money laundering and black market activity in all of Europe, made possible by a CIA revolution that installed a hand-picked Zelensky, among other Ukrainian \"leaders\" and that's why they're all getting paid by the US govt permalink parent award report block reply SicSemperTyrannis2 1 points 1 day ago Trying to read the OP title would give Godzilla a stroke, wtf is he trying to say? permalink parent award report block reply Standingoak 1 points 1 day ago Panama papers show they aren't alone.  And that they can run but not hide. permalink parent award report block reply totktonikak 26 points 1 day ago For some reason Diana doesn't name \"the main partner of Zelensky\". It's Mindich, someone with extensive links to Israel. Where he is now, btw. If \"anti-corruption agencies\" are indeed controlled by the US, the greatest ally wouldn't hesitate to extradite someone so obviously corrupt, would they? Oh, and Mindich also conducts business in Russia, which is probably an uncomfortable topic with Diana. Well, folks, it's a big club, and you ain't in it. permalink award report block reply Bullseyed 12 points 1 day ago For some reason Diana doesn't mention this guy is the Minister of Justice for Ukraine and was covering up kickback bribes in the energy sector. Do we know of anybiden who was involved in energy sector corruption in Ukraine? permalink parent award report block reply DeepStateParasite 4 points 1 day ago No, and whatever self-incriminating laptop documentation you may have read about Ukrainian energy sector kickbacks to the son of a sitting Vice President of the United States - and any comments that VP made about firing the lead investigator into that corruption - are clearly just Russian propaganda, and any other President asking about it should be impeached! permalink parent award report block reply x79q3pb 6 points 1 day ago Same as it ever was. permalink parent award report block reply PlantTrees 3 points 1 day ago Thank you permalink parent award report block reply Smurfection 1 points 1 day ago Do you have a link showing that Mindich fled to Israel?   I'm not doubting you, I'm just asking how you know this. permalink parent award report block reply Drewniverse 15 points 2 days ago Who leaves this much cash behind? permalink award report block reply Thep1mp 15 points 2 days ago Nobody. The only way is if you are literally fleeing from immediate danger…so fast that you’re running out of a place with seconds notice. Nobody leaves cash like that unless you’re extremely damned rich- most are not. permalink parent award report block reply henri_derelicte -6 points 1 day ago I’m starting to wonder if it’s fake news. Russian shills seems to have more influence here when Americans are asleep permalink parent award report block reply Smurfection 2 points 1 day ago Yep.  That's when Europe is awake and posting.   That's why the shills come at night. permalink parent award report block reply Repentnow 0 points 1 day ago Somebody on the internet said something. What's not to believe? And that Ukrainian flag in their name makes it double believable. permalink parent award report block reply CharlieMike 6 points 1 day ago Somebody on SNAP. permalink parent award report block reply guywholikesDjtof2024 -1 points 2 days ago Patel does. Lol. permalink parent award report block reply orange_popcicle 0 points 2 days ago Saar, how dare you saar! permalink parent award report block reply MemoryHoleyeO 10 points 2 days ago Blessed thy Lord; let me become the tax collector to the corrupt foreigners that have stolen our futures. We should create an agency that collects taxes from foreigners that have abused our aid. And also stop giving aid. Maybe give it out once every 5 years and make it an event they show their appreciation to the USA. Maybe make it an Olympic event. The best countries receive money permalink award report block reply f_bastiat 6 points 1 day ago Fake and gay without a source, even if it's true and straight. Random pictures of money don't do it for me. permalink award report block reply DaayTerkErJerbs 1 points 1 day ago There were reports of ukraine politicians an generals wives crossing borders with millions in cash n gold a while back. Seemed like it was happening quite frequently a year or two ago permalink parent award report block reply buckeyeminuteman 5 points 1 day ago I want all of our money back and I want it all applied to the national debt balance! permalink award report block reply sorrytodisagree 5 points 1 day ago Link: https://x.com/Panchenko_X/status/1987796574445990174 https://nitter.net/Panchenko_X/status/1987796574445990174 permalink award report block reply TheWhitestOfFangs 3 points 1 day ago Thank you permalink parent award report block reply FudgyFudgeBots 4 points 1 day ago Per Grok.... Mindich reportedly fled Ukraine hours before the raid, possibly to Israel (where he spends much time), per flight records cited by Ukrainska Pravda. NABU seized items including stacks of $100 bills and luxury fixtures (e.g., a \"golden toilet\" highlighted in media reports).\nThe probe also targeted Justice Minister Herman Halushchenko (former Energy Minister) and others in Zelenskyy's circle. permalink award report block reply Canadiapede7 3 points 1 day ago Now do that Coke head Zelensky permalink award report block reply Smdlegend 2 points 1 day ago How true is this? Sounds legit. permalink award report block reply Repentnow 0 points 1 day ago Really? Sounds like total BS to me. But, it's on the interwebs, so it must be true. permalink parent award report block reply patrioticwinning3 2 points 1 day ago Yay, more crimes, \"EXPOSED\" \"BTFOD\" yet no arrests, trials, or convictions that fit the crimes.  Trump still says Patel, Bondi, Blanche et al, are, \"doing a great job!\" :p permalink award report block reply Repentnow 0 points 1 day ago You are angsting at Patel & Bondi over a BS story in another country. permalink parent award report block reply BillGateCanSuckIt 2 points 1 day ago Corruption in Ukraine?!, Pikachu shocked face permalink award report block reply SanityGumby 2 points 1 day ago Why would I believe this nobody ukricunt permalink award report block reply Repentnow 1 points 1 day ago Obviously because of the Ukrainian flag in thier name. permalink parent award report block reply DeepStateParasite 1 points 1 day ago I wish my stack of stolen $100 bills were barcoded, it would make my billions so much easier to count. permalink award report block reply Smurfection 1 points 1 day ago What does it mean \"anti corruption agencies controlled by the US\"  Is the US actually controlling Ukraine's anti corruption agencies? permalink award report block reply I_Love_45-70_Gov 1 points 1 day ago Hey!  That's my money and your money! permalink award report block reply knnbccb 1 points 1 day ago Should have taken my advice a long time ago. You even let Zel visit the White House for a photo op several times. If he is problematic, then he needs to be eradicated. https://forum.policiesforpeople.com/t/drone-zelensky/25276 permalink award report block reply Liberats 1 points 1 day ago That's your money in those bags that these vermin have been given for the 'war effort' folks. permalink award report block reply NoticesBugleOWO 1 points 1 day ago Where is she getting this story? I see pictures of money and no context. Are we really just taking the word of a twitter bot? permalink award report block reply WanderingStar 1 points 1 day ago This is on Lindsey Graham! permalink award report block reply Sunnywindows 1 points 1 day ago Will the legacy media ever ever report of this type of stuff so that the majority of normies will hear about it? permalink award report block reply Redeemable 1 points 2 days ago I am guessing English is not his first language. permalink award report block reply HoodooOperator 1 points 1 day ago Comment removed by community moderators. permalink award report block reply\nWozzing 91 points 2 days ago You guys know that the United States has been paying for the entire government of Ukraine, all the salaries, all the retirement checks all the food stamps. permalink award report block reply LabTech 47 points 2 days ago Only ~30% of the sent funds actually reaching the front lines has been known for a long time; most of that, I suspect, immediately went back to the US by way of anonymous offshore accounts as tribute, but I'm sure all the oligarchs who were on the same page got their cut, and I'm sure all of them have had Plan B's and bug-out bags ready and waiting on a moment's notice if the whole scam went tits up. Even Zelensky has his fallback options:  I'm sure he's got a cadre of well-paid goons who can get him out of the country, even if they have to run over the last young people in the country, to get him to a NATO country, and then from there it's a hop, skip, and a jump to the office of some high ranking WEF official, who'll finalize his \"retirement\", where he'll spend the rest of his life in some well-guarded compound or estate in some picturesque location, or any of the properties his family's bought with the ill-gotten gains.  His family will have some businesses lined up for steady income, they'll probably create NPOs and organizations to get further kickbacks under cover, and probably 3-4 times a year he'll appear in the background of some globalist event where he'll claim to be fighting the good fight for his people, but he'll just be there to rub elbows with his fellow Elites and network on further scams at our expense. permalink parent award report block reply anotherthing 28 points 2 days ago FTX should have been a bigger scandal than it was. It was basically proof that the Ukraine funding was being laundered. permalink parent award report block reply aoneleggedduck 7 points 2 days ago where he'll spend the rest of his life in some well-guarded compound or estate in some picturesque location, or any of the properties his family's bought with the ill-gotten gains. Have you heard of the 916,000 acre ranch his company just bought in Wyoming? He's now the 9th top landowner in the US. permalink parent award report block reply noPTSDforMePlease 13 points 1 day ago He didn't purchase the ranch, it's still listed for sale. permalink parent award report block reply hansgruber7 10 points 1 day ago Fake and Gay. permalink parent award report block reply aoneleggedduck 7 points 1 day ago I've been bamboozled?! permalink parent award report block reply view 2 more comments... Gnometard 8 points 1 day ago Yep, but we're more focused on what social media tells us to look at... which always seems to align with causing more division and anger among the population. If not for social media, 80% of the country would be united. At the root, most people see the same problems but the influence of social media won't let people recognize that using divisive framing and rhetoric to prevent folks from seeing it. In 2016, before I stopped using everything but the Donald then PDW, I had a 10x gilded comment showing how Bernie Sanders and Trump both had the SAME problems they wanted to address. I broke it down bullet by bullet from each campaign website. Then when Bernie joined the black eye club and the dems screwed Bernie voters with polling places and other similar issues (the same shit they try to do with Republicans or anyone not on the left),  Bernie bros became Trump supporters. It was still a divisive time, but social media wasn't as prominent so there were still a lot of people able to think. Nobody can remember that far back because their attention span has been cut down through years of constant shifting of focus. People supporting the removal of filibuster don't even remember when democrats wanted that not too long ago.... and they can't think ahead to what would happen if it's removed and democrats win more seats (the left votes more than the right, only for Trump does that change) permalink parent award report block reply Smurfection 1 points 1 day ago It's not that the left votes more than the right per se.  It's that for nearly a century, the Dem vote was a reliable turnout.  General to General, primary to primary, mid-term to mid-term, the vote numbers for Dem stayed pretty much the same except due to a rise in population.   For almost a century, big turnouts meant the Dems had an advantage because big turnouts meant more uninformed and welfare recipients were voting. For almost a century, Republican voter turnout varied widely.   Here's a startling fact:  If McCain had as many Republican voters turn out as George W Bush did in 2004, McCain would have won.   If Romney had as many Republicans turn out to vote as McCain did, Romney would have won.   Obama is the first president to win re-election with substantially fewer votes than he did when he was first elected.  Also in 2012, down ballot races went badly for Democrats.  That should have been a warning sign for them. In the Trump era, in the movement to reshape the Republican party, the biggest problem we have is Republicans, conservatives, independents and libertarians not showing up at the polls.   For the last couple of elections (looking at what is real 2020 election data, not the fake stuff from the stolen states), high voter turnout for the first time is favoring Republicans and specifically MAGA candidates. The Republican vote, which is the MAGA vote, has become even more unreliable.  If MAGA shows up, MAGA wins but MAGA doesn't always show up to vote.  While GOPe has never focused on Get Out The Vote before, it's very crucial now.  Also because MAGA support is strongest in ex-urban and rural areas, it's hard to mobilize GOTV efforts.   On the flip side, Democrats have started to understand this so you notice, there are no efforts from Democrats to register voters or GOTV efforts anymore.  Democrats are using direct mail and text messages. In the dynamic and changing landscape, Republicans must make a huge effort to get the polls, register voters and GOTV.   TheNews™ isn't going to help because they'd rather ignore upcoming elections now since GOTV doesn't favor the Democrats anymore.   Dem partisans and lefties pretty much always turn out to vote but they can't rely on overwhelming black, Hispanic and welfare recipient votes like they have in the past to carry them over the top. Scott Presler, may God bless that man, has done more for the MAGA movement than most of us admit.  Yes, I know he's gay but God's Mercy is for him as much as it's for each and everyone else who is a sinner, and that's all of us.  I'm going to tell you right now, Scott Presler is showing us the way forward and I hope God has a special place reserved for Scott Presler in Heaven for his efforts. permalink parent award report block reply Scumbag-reddit 5 points 1 day ago You guys know that the Ukraine is the central hub for money laundering and black market activity in all of Europe, made possible by a CIA revolution that installed a hand-picked Zelensky, among other Ukrainian \"leaders\" and that's why they're all getting paid by the US govt permalink parent award report block reply SicSemperTyrannis2 1 points 1 day ago Trying to read the OP title would give Godzilla a stroke, wtf is he trying to say? permalink parent award report block reply Standingoak 1 points 1 day ago Panama papers show they aren't alone.  And that they can run but not hide. permalink parent award report block reply\nLabTech 47 points 2 days ago Only ~30% of the sent funds actually reaching the front lines has been known for a long time; most of that, I suspect, immediately went back to the US by way of anonymous offshore accounts as tribute, but I'm sure all the oligarchs who were on the same page got their cut, and I'm sure all of them have had Plan B's and bug-out bags ready and waiting on a moment's notice if the whole scam went tits up. Even Zelensky has his fallback options:  I'm sure he's got a cadre of well-paid goons who can get him out of the country, even if they have to run over the last young people in the country, to get him to a NATO country, and then from there it's a hop, skip, and a jump to the office of some high ranking WEF official, who'll finalize his \"retirement\", where he'll spend the rest of his life in some well-guarded compound or estate in some picturesque location, or any of the properties his family's bought with the ill-gotten gains.  His family will have some businesses lined up for steady income, they'll probably create NPOs and organizations to get further kickbacks under cover, and probably 3-4 times a year he'll appear in the background of some globalist event where he'll claim to be fighting the good fight for his people, but he'll just be there to rub elbows with his fellow Elites and network on further scams at our expense. permalink parent award report block reply anotherthing 28 points 2 days ago FTX should have been a bigger scandal than it was. It was basically proof that the Ukraine funding was being laundered. permalink parent award report block reply aoneleggedduck 7 points 2 days ago where he'll spend the rest of his life in some well-guarded compound or estate in some picturesque location, or any of the properties his family's bought with the ill-gotten gains. Have you heard of the 916,000 acre ranch his company just bought in Wyoming? He's now the 9th top landowner in the US. permalink parent award report block reply noPTSDforMePlease 13 points 1 day ago He didn't purchase the ranch, it's still listed for sale. permalink parent award report block reply hansgruber7 10 points 1 day ago Fake and Gay. permalink parent award report block reply aoneleggedduck 7 points 1 day ago I've been bamboozled?! permalink parent award report block reply view 2 more comments...\nanotherthing 28 points 2 days ago FTX should have been a bigger scandal than it was. It was basically proof that the Ukraine funding was being laundered. permalink parent award report block reply\naoneleggedduck 7 points 2 days ago where he'll spend the rest of his life in some well-guarded compound or estate in some picturesque location, or any of the properties his family's bought with the ill-gotten gains. Have you heard of the 916,000 acre ranch his company just bought in Wyoming? He's now the 9th top landowner in the US. permalink parent award report block reply noPTSDforMePlease 13 points 1 day ago He didn't purchase the ranch, it's still listed for sale. permalink parent award report block reply hansgruber7 10 points 1 day ago Fake and Gay. permalink parent award report block reply aoneleggedduck 7 points 1 day ago I've been bamboozled?! permalink parent award report block reply view 2 more comments...\nnoPTSDforMePlease 13 points 1 day ago He didn't purchase the ranch, it's still listed for sale. permalink parent award report block reply\nhansgruber7 10 points 1 day ago Fake and Gay. permalink parent award report block reply aoneleggedduck 7 points 1 day ago I've been bamboozled?! permalink parent award report block reply view 2 more comments...\naoneleggedduck 7 points 1 day ago I've been bamboozled?! permalink parent award report block reply view 2 more comments...\nGnometard 8 points 1 day ago Yep, but we're more focused on what social media tells us to look at... which always seems to align with causing more division and anger among the population. If not for social media, 80% of the country would be united. At the root, most people see the same problems but the influence of social media won't let people recognize that using divisive framing and rhetoric to prevent folks from seeing it. In 2016, before I stopped using everything but the Donald then PDW, I had a 10x gilded comment showing how Bernie Sanders and Trump both had the SAME problems they wanted to address. I broke it down bullet by bullet from each campaign website. Then when Bernie joined the black eye club and the dems screwed Bernie voters with polling places and other similar issues (the same shit they try to do with Republicans or anyone not on the left),  Bernie bros became Trump supporters. It was still a divisive time, but social media wasn't as prominent so there were still a lot of people able to think. Nobody can remember that far back because their attention span has been cut down through years of constant shifting of focus. People supporting the removal of filibuster don't even remember when democrats wanted that not too long ago.... and they can't think ahead to what would happen if it's removed and democrats win more seats (the left votes more than the right, only for Trump does that change) permalink parent award report block reply Smurfection 1 points 1 day ago It's not that the left votes more than the right per se.  It's that for nearly a century, the Dem vote was a reliable turnout.  General to General, primary to primary, mid-term to mid-term, the vote numbers for Dem stayed pretty much the same except due to a rise in population.   For almost a century, big turnouts meant the Dems had an advantage because big turnouts meant more uninformed and welfare recipients were voting. For almost a century, Republican voter turnout varied widely.   Here's a startling fact:  If McCain had as many Republican voters turn out as George W Bush did in 2004, McCain would have won.   If Romney had as many Republicans turn out to vote as McCain did, Romney would have won.   Obama is the first president to win re-election with substantially fewer votes than he did when he was first elected.  Also in 2012, down ballot races went badly for Democrats.  That should have been a warning sign for them. In the Trump era, in the movement to reshape the Republican party, the biggest problem we have is Republicans, conservatives, independents and libertarians not showing up at the polls.   For the last couple of elections (looking at what is real 2020 election data, not the fake stuff from the stolen states), high voter turnout for the first time is favoring Republicans and specifically MAGA candidates. The Republican vote, which is the MAGA vote, has become even more unreliable.  If MAGA shows up, MAGA wins but MAGA doesn't always show up to vote.  While GOPe has never focused on Get Out The Vote before, it's very crucial now.  Also because MAGA support is strongest in ex-urban and rural areas, it's hard to mobilize GOTV efforts.   On the flip side, Democrats have started to understand this so you notice, there are no efforts from Democrats to register voters or GOTV efforts anymore.  Democrats are using direct mail and text messages. In the dynamic and changing landscape, Republicans must make a huge effort to get the polls, register voters and GOTV.   TheNews™ isn't going to help because they'd rather ignore upcoming elections now since GOTV doesn't favor the Democrats anymore.   Dem partisans and lefties pretty much always turn out to vote but they can't rely on overwhelming black, Hispanic and welfare recipient votes like they have in the past to carry them over the top. Scott Presler, may God bless that man, has done more for the MAGA movement than most of us admit.  Yes, I know he's gay but God's Mercy is for him as much as it's for each and everyone else who is a sinner, and that's all of us.  I'm going to tell you right now, Scott Presler is showing us the way forward and I hope God has a special place reserved for Scott Presler in Heaven for his efforts. permalink parent award report block reply\nSmurfection 1 points 1 day ago It's not that the left votes more than the right per se.  It's that for nearly a century, the Dem vote was a reliable turnout.  General to General, primary to primary, mid-term to mid-term, the vote numbers for Dem stayed pretty much the same except due to a rise in population.   For almost a century, big turnouts meant the Dems had an advantage because big turnouts meant more uninformed and welfare recipients were voting. For almost a century, Republican voter turnout varied widely.   Here's a startling fact:  If McCain had as many Republican voters turn out as George W Bush did in 2004, McCain would have won.   If Romney had as many Republicans turn out to vote as McCain did, Romney would have won.   Obama is the first president to win re-election with substantially fewer votes than he did when he was first elected.  Also in 2012, down ballot races went badly for Democrats.  That should have been a warning sign for them. In the Trump era, in the movement to reshape the Republican party, the biggest problem we have is Republicans, conservatives, independents and libertarians not showing up at the polls.   For the last couple of elections (looking at what is real 2020 election data, not the fake stuff from the stolen states), high voter turnout for the first time is favoring Republicans and specifically MAGA candidates. The Republican vote, which is the MAGA vote, has become even more unreliable.  If MAGA shows up, MAGA wins but MAGA doesn't always show up to vote.  While GOPe has never focused on Get Out The Vote before, it's very crucial now.  Also because MAGA support is strongest in ex-urban and rural areas, it's hard to mobilize GOTV efforts.   On the flip side, Democrats have started to understand this so you notice, there are no efforts from Democrats to register voters or GOTV efforts anymore.  Democrats are using direct mail and text messages. In the dynamic and changing landscape, Republicans must make a huge effort to get the polls, register voters and GOTV.   TheNews™ isn't going to help because they'd rather ignore upcoming elections now since GOTV doesn't favor the Democrats anymore.   Dem partisans and lefties pretty much always turn out to vote but they can't rely on overwhelming black, Hispanic and welfare recipient votes like they have in the past to carry them over the top. Scott Presler, may God bless that man, has done more for the MAGA movement than most of us admit.  Yes, I know he's gay but God's Mercy is for him as much as it's for each and everyone else who is a sinner, and that's all of us.  I'm going to tell you right now, Scott Presler is showing us the way forward and I hope God has a special place reserved for Scott Presler in Heaven for his efforts. permalink parent award report block reply\nScumbag-reddit 5 points 1 day ago You guys know that the Ukraine is the central hub for money laundering and black market activity in all of Europe, made possible by a CIA revolution that installed a hand-picked Zelensky, among other Ukrainian \"leaders\" and that's why they're all getting paid by the US govt permalink parent award report block reply\nSicSemperTyrannis2 1 points 1 day ago Trying to read the OP title would give Godzilla a stroke, wtf is he trying to say? permalink parent award report block reply\nStandingoak 1 points 1 day ago Panama papers show they aren't alone.  And that they can run but not hide. permalink parent award report block reply\ntotktonikak 26 points 1 day ago For some reason Diana doesn't name \"the main partner of Zelensky\". It's Mindich, someone with extensive links to Israel. Where he is now, btw. If \"anti-corruption agencies\" are indeed controlled by the US, the greatest ally wouldn't hesitate to extradite someone so obviously corrupt, would they? Oh, and Mindich also conducts business in Russia, which is probably an uncomfortable topic with Diana. Well, folks, it's a big club, and you ain't in it. permalink award report block reply Bullseyed 12 points 1 day ago For some reason Diana doesn't mention this guy is the Minister of Justice for Ukraine and was covering up kickback bribes in the energy sector. Do we know of anybiden who was involved in energy sector corruption in Ukraine? permalink parent award report block reply DeepStateParasite 4 points 1 day ago No, and whatever self-incriminating laptop documentation you may have read about Ukrainian energy sector kickbacks to the son of a sitting Vice President of the United States - and any comments that VP made about firing the lead investigator into that corruption - are clearly just Russian propaganda, and any other President asking about it should be impeached! permalink parent award report block reply x79q3pb 6 points 1 day ago Same as it ever was. permalink parent award report block reply PlantTrees 3 points 1 day ago Thank you permalink parent award report block reply Smurfection 1 points 1 day ago Do you have a link showing that Mindich fled to Israel?   I'm not doubting you, I'm just asking how you know this. permalink parent award report block reply\nBullseyed 12 points 1 day ago For some reason Diana doesn't mention this guy is the Minister of Justice for Ukraine and was covering up kickback bribes in the energy sector. Do we know of anybiden who was involved in energy sector corruption in Ukraine? permalink parent award report block reply DeepStateParasite 4 points 1 day ago No, and whatever self-incriminating laptop documentation you may have read about Ukrainian energy sector kickbacks to the son of a sitting Vice President of the United States - and any comments that VP made about firing the lead investigator into that corruption - are clearly just Russian propaganda, and any other President asking about it should be impeached! permalink parent award report block reply\nDeepStateParasite 4 points 1 day ago No, and whatever self-incriminating laptop documentation you may have read about Ukrainian energy sector kickbacks to the son of a sitting Vice President of the United States - and any comments that VP made about firing the lead investigator into that corruption - are clearly just Russian propaganda, and any other President asking about it should be impeached! permalink parent award report block reply\nx79q3pb 6 points 1 day ago Same as it ever was. permalink parent award report block reply\nPlantTrees 3 points 1 day ago Thank you permalink parent award report block reply\nSmurfection 1 points 1 day ago Do you have a link showing that Mindich fled to Israel?   I'm not doubting you, I'm just asking how you know this. permalink parent award report block reply\nDrewniverse 15 points 2 days ago Who leaves this much cash behind? permalink award report block reply Thep1mp 15 points 2 days ago Nobody. The only way is if you are literally fleeing from immediate danger…so fast that you’re running out of a place with seconds notice. Nobody leaves cash like that unless you’re extremely damned rich- most are not. permalink parent award report block reply henri_derelicte -6 points 1 day ago I’m starting to wonder if it’s fake news. Russian shills seems to have more influence here when Americans are asleep permalink parent award report block reply Smurfection 2 points 1 day ago Yep.  That's when Europe is awake and posting.   That's why the shills come at night. permalink parent award report block reply Repentnow 0 points 1 day ago Somebody on the internet said something. What's not to believe? And that Ukrainian flag in their name makes it double believable. permalink parent award report block reply CharlieMike 6 points 1 day ago Somebody on SNAP. permalink parent award report block reply guywholikesDjtof2024 -1 points 2 days ago Patel does. Lol. permalink parent award report block reply orange_popcicle 0 points 2 days ago Saar, how dare you saar! permalink parent award report block reply\nThep1mp 15 points 2 days ago Nobody. The only way is if you are literally fleeing from immediate danger…so fast that you’re running out of a place with seconds notice. Nobody leaves cash like that unless you’re extremely damned rich- most are not. permalink parent award report block reply henri_derelicte -6 points 1 day ago I’m starting to wonder if it’s fake news. Russian shills seems to have more influence here when Americans are asleep permalink parent award report block reply Smurfection 2 points 1 day ago Yep.  That's when Europe is awake and posting.   That's why the shills come at night. permalink parent award report block reply Repentnow 0 points 1 day ago Somebody on the internet said something. What's not to believe? And that Ukrainian flag in their name makes it double believable. permalink parent award report block reply\nhenri_derelicte -6 points 1 day ago I’m starting to wonder if it’s fake news. Russian shills seems to have more influence here when Americans are asleep permalink parent award report block reply Smurfection 2 points 1 day ago Yep.  That's when Europe is awake and posting.   That's why the shills come at night. permalink parent award report block reply Repentnow 0 points 1 day ago Somebody on the internet said something. What's not to believe? And that Ukrainian flag in their name makes it double believable. permalink parent award report block reply\nSmurfection 2 points 1 day ago Yep.  That's when Europe is awake and posting.   That's why the shills come at night. permalink parent award report block reply\nRepentnow 0 points 1 day ago Somebody on the internet said something. What's not to believe? And that Ukrainian flag in their name makes it double believable. permalink parent award report block reply\nCharlieMike 6 points 1 day ago Somebody on SNAP. permalink parent award report block reply\nguywholikesDjtof2024 -1 points 2 days ago Patel does. Lol. permalink parent award report block reply orange_popcicle 0 points 2 days ago Saar, how dare you saar! permalink parent award report block reply\norange_popcicle 0 points 2 days ago Saar, how dare you saar! permalink parent award report block reply\nMemoryHoleyeO 10 points 2 days ago Blessed thy Lord; let me become the tax collector to the corrupt foreigners that have stolen our futures. We should create an agency that collects taxes from foreigners that have abused our aid. And also stop giving aid. Maybe give it out once every 5 years and make it an event they show their appreciation to the USA. Maybe make it an Olympic event. The best countries receive money permalink award report block reply\nf_bastiat 6 points 1 day ago Fake and gay without a source, even if it's true and straight. Random pictures of money don't do it for me. permalink award report block reply DaayTerkErJerbs 1 points 1 day ago There were reports of ukraine politicians an generals wives crossing borders with millions in cash n gold a while back. Seemed like it was happening quite frequently a year or two ago permalink parent award report block reply\nDaayTerkErJerbs 1 points 1 day ago There were reports of ukraine politicians an generals wives crossing borders with millions in cash n gold a while back. Seemed like it was happening quite frequently a year or two ago permalink parent award report block reply\nbuckeyeminuteman 5 points 1 day ago I want all of our money back and I want it all applied to the national debt balance! permalink award report block reply\nsorrytodisagree 5 points 1 day ago Link: https://x.com/Panchenko_X/status/1987796574445990174 https://nitter.net/Panchenko_X/status/1987796574445990174 permalink award report block reply TheWhitestOfFangs 3 points 1 day ago Thank you permalink parent award report block reply\nTheWhitestOfFangs 3 points 1 day ago Thank you permalink parent award report block reply\nFudgyFudgeBots 4 points 1 day ago Per Grok.... Mindich reportedly fled Ukraine hours before the raid, possibly to Israel (where he spends much time), per flight records cited by Ukrainska Pravda. NABU seized items including stacks of $100 bills and luxury fixtures (e.g., a \"golden toilet\" highlighted in media reports).\nThe probe also targeted Justice Minister Herman Halushchenko (former Energy Minister) and others in Zelenskyy's circle. permalink award report block reply\nCanadiapede7 3 points 1 day ago Now do that Coke head Zelensky permalink award report block reply\nSmdlegend 2 points 1 day ago How true is this? Sounds legit. permalink award report block reply Repentnow 0 points 1 day ago Really? Sounds like total BS to me. But, it's on the interwebs, so it must be true. permalink parent award report block reply\nRepentnow 0 points 1 day ago Really? Sounds like total BS to me. But, it's on the interwebs, so it must be true. permalink parent award report block reply\npatrioticwinning3 2 points 1 day ago Yay, more crimes, \"EXPOSED\" \"BTFOD\" yet no arrests, trials, or convictions that fit the crimes.  Trump still says Patel, Bondi, Blanche et al, are, \"doing a great job!\" :p permalink award report block reply Repentnow 0 points 1 day ago You are angsting at Patel & Bondi over a BS story in another country. permalink parent award report block reply\nRepentnow 0 points 1 day ago You are angsting at Patel & Bondi over a BS story in another country. permalink parent award report block reply\nBillGateCanSuckIt 2 points 1 day ago Corruption in Ukraine?!, Pikachu shocked face permalink award report block reply\nSanityGumby 2 points 1 day ago Why would I believe this nobody ukricunt permalink award report block reply Repentnow 1 points 1 day ago Obviously because of the Ukrainian flag in thier name. permalink parent award report block reply\nRepentnow 1 points 1 day ago Obviously because of the Ukrainian flag in thier name. permalink parent award report block reply\nDeepStateParasite 1 points 1 day ago I wish my stack of stolen $100 bills were barcoded, it would make my billions so much easier to count. permalink award report block reply\nSmurfection 1 points 1 day ago What does it mean \"anti corruption agencies controlled by the US\"  Is the US actually controlling Ukraine's anti corruption agencies? permalink award report block reply\nI_Love_45-70_Gov 1 points 1 day ago Hey!  That's my money and your money! permalink award report block reply\nknnbccb 1 points 1 day ago Should have taken my advice a long time ago. You even let Zel visit the White House for a photo op several times. If he is problematic, then he needs to be eradicated. https://forum.policiesforpeople.com/t/drone-zelensky/25276 permalink award report block reply\nLiberats 1 points 1 day ago That's your money in those bags that these vermin have been given for the 'war effort' folks. permalink award report block reply\nNoticesBugleOWO 1 points 1 day ago Where is she getting this story? I see pictures of money and no context. Are we really just taking the word of a twitter bot? permalink award report block reply\nWanderingStar 1 points 1 day ago This is on Lindsey Graham! permalink award report block reply\nSunnywindows 1 points 1 day ago Will the legacy media ever ever report of this type of stuff so that the majority of normies will hear about it? permalink award report block reply\nRedeemable 1 points 2 days ago I am guessing English is not his first language. permalink award report block reply\nHoodooOperator 1 points 1 day ago Comment removed by community moderators. permalink award report block reply"}