{"id": "1ARK56ijq8", "contents": "721 💲 BREAKING: Supreme Court rules President Trump does NOT have to spend money the government does not have for SNAP during the shutdown... 👋    IT'S  HAPPENING!   🖐️ posted 5 days ago by TheRedPilledArtist 26 comments award share download report block\n26 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Save on Your Electric Bill (Try Tonight) GadgetCyno henri_derelicte 23 points 5 days ago Liberals can get bent! permalink award report block reply yodayoda 17 points 5 days ago whether the gubment has the money or not, who is this fucking judge to order the executive to spend money? permalink award report block reply zooty 6 points 5 days ago More importantly, why isn't something being done about these fucktards? Have a Trump judge rule he has to lock them up or something then they can sit behind bars until it goes up to the SC. permalink parent award report block reply FlyCatcher94 2 points 4 days ago It’s worse than that.  His branch is ordering another branch to use money that yet another branch hasn’t allocated. permalink parent award report block reply yodayoda 1 points 4 days ago you are right permalink parent award report block reply MajorClark 12 points 5 days ago This is what happens when communist demonrats and socialists welcome the world to nations.   They become dependents & drain the system. permalink award report block reply GreatestAmericanHero 11 points 5 days ago Oh, NOW the gov can't spend money it doesn't have?!?!?!?! HONK HONK permalink award report block reply preferredfault 10 points 5 days ago They didn't \"rule\", they just blocked the court order temporarily. There's still legal fighting to be done. Of course it's obvious as to why Trump shouldn't fund food stamps: He legally can't. It's crazy how courts are telling Trump to pay for something that congress must first fund. But it's not just the Democrats doing this, it's the food companies lobbying like crazy, because without food stamps, they instantly lose a good 20% or more of all their business. That's a huge loss. At the same time, they can't raise prices, they'll be forced to lower them, especially when you consider perishables like milk and eggs and beef, basically anything that would expire in a month or a few months. They'll have to lower prices to keep up sales, and try to make up the difference through volume sales. permalink award report block reply FireTheCannons1776 2 points 4 days ago POTUS has no money.  How can POTUS be responsible to turn on any money, if it's not allocated by congress.  This is the reason that the money isn't flowing.  Those benefits were temporary and expired.  They are not backed by money or law. permalink parent award report block reply FlyCatcher94 2 points 4 days ago Coca-Cola company especially.  They are all in on poison for the poor. permalink parent award report block reply possibletower 5 points 5 days ago Based SCOTUS. Now don't cuck up on the tariffs even though if they nuke them I blame whatever Heritage Foundation retard told Trump that he can do whatever tariffs he wants by declaring a state of emergency or state of war with no precedents from any previous legislation or presidents backing up that claim. All the SCOTUS justices grilled the lawyer for Trump who didn't do a great job arguing for Trump at all, hoping that the LARP from the Heritage Foundation retard was going to win just based on copium. permalink award report block reply zooty 1 points 5 days ago I don't know about this specific case but I have been appalled at the competence we have seen from some of the lawyers in court at the national level. Yet another reason the university system needs to be fixed or replaced. permalink parent award report block reply HillaryRodhamCunton 4 points 5 days ago People who have iPhones shouldn't get food stamps.  period permalink award report block reply Ligersrule1 1 points 4 days ago \"But I already have an iPhone...\" permalink parent award report block reply AVeryNakedMan 3 points 5 days ago Now arrest the leftist judge for sedition; trying to seize powers that he never had. permalink award report block reply TheRedPilledArtist OP 2 points 5 days ago SOURCE: https://x.com/LeadingReport/status/1986984022484955234 permalink award report block reply Deplora 2 points 5 days ago Real source: https://xcancel.com/AGPamBondi/status/1986985866900738242 permalink parent award report block reply JohnN 2 points 5 days ago Thanks. permalink parent award report block reply Deplora 2 points 5 days ago Welcome! permalink parent award report block reply zooty 2 points 5 days ago Shocker. When can 'something be done' about this judicial tyranny from the left? permalink award report block reply zooty 2 points 5 days ago Trump should have printed a bunch of $300 bill Trump bucks on his HP printer, handed them to the judge and made the him rule them legal tender if he wanted to proceed. permalink award report block reply tired-of-crap 1 points 4 days ago Just think of the trouble California is going to get in with its lenders because it's not going to get reimbursed for Money it has advanced for snap. permalink award report block reply ProfessorJagoff 1 points 4 days ago Didn't the payments already go out, and that some states gave full payments for the month already? permalink award report block reply Logan051361 1 points 4 days ago Tossing trump a bone cause then they will go against him for tariffs permalink award report block reply sl1738 1 points 4 days ago This is so POORLY WORDED!!!. Trump doesn't have the ability to use tax money to fund SNAP without consent congress consent. It's literally says it in the constitution!!! permalink award report block reply FlyinHeadlock 1 points 5 days ago Not free at last. Not free at last!!!!! permalink award report block reply PatriotSkorzeny 1 points 5 days ago Precedent. “Improper budget is unconstitutional.” permalink award report block reply\nhenri_derelicte 23 points 5 days ago Liberals can get bent! permalink award report block reply\nyodayoda 17 points 5 days ago whether the gubment has the money or not, who is this fucking judge to order the executive to spend money? permalink award report block reply zooty 6 points 5 days ago More importantly, why isn't something being done about these fucktards? Have a Trump judge rule he has to lock them up or something then they can sit behind bars until it goes up to the SC. permalink parent award report block reply FlyCatcher94 2 points 4 days ago It’s worse than that.  His branch is ordering another branch to use money that yet another branch hasn’t allocated. permalink parent award report block reply yodayoda 1 points 4 days ago you are right permalink parent award report block reply\nzooty 6 points 5 days ago More importantly, why isn't something being done about these fucktards? Have a Trump judge rule he has to lock them up or something then they can sit behind bars until it goes up to the SC. permalink parent award report block reply\nFlyCatcher94 2 points 4 days ago It’s worse than that.  His branch is ordering another branch to use money that yet another branch hasn’t allocated. permalink parent award report block reply yodayoda 1 points 4 days ago you are right permalink parent award report block reply\nyodayoda 1 points 4 days ago you are right permalink parent award report block reply\nMajorClark 12 points 5 days ago This is what happens when communist demonrats and socialists welcome the world to nations.   They become dependents & drain the system. permalink award report block reply\nGreatestAmericanHero 11 points 5 days ago Oh, NOW the gov can't spend money it doesn't have?!?!?!?! HONK HONK permalink award report block reply\npreferredfault 10 points 5 days ago They didn't \"rule\", they just blocked the court order temporarily. There's still legal fighting to be done. Of course it's obvious as to why Trump shouldn't fund food stamps: He legally can't. It's crazy how courts are telling Trump to pay for something that congress must first fund. But it's not just the Democrats doing this, it's the food companies lobbying like crazy, because without food stamps, they instantly lose a good 20% or more of all their business. That's a huge loss. At the same time, they can't raise prices, they'll be forced to lower them, especially when you consider perishables like milk and eggs and beef, basically anything that would expire in a month or a few months. They'll have to lower prices to keep up sales, and try to make up the difference through volume sales. permalink award report block reply FireTheCannons1776 2 points 4 days ago POTUS has no money.  How can POTUS be responsible to turn on any money, if it's not allocated by congress.  This is the reason that the money isn't flowing.  Those benefits were temporary and expired.  They are not backed by money or law. permalink parent award report block reply FlyCatcher94 2 points 4 days ago Coca-Cola company especially.  They are all in on poison for the poor. permalink parent award report block reply\nFireTheCannons1776 2 points 4 days ago POTUS has no money.  How can POTUS be responsible to turn on any money, if it's not allocated by congress.  This is the reason that the money isn't flowing.  Those benefits were temporary and expired.  They are not backed by money or law. permalink parent award report block reply\nFlyCatcher94 2 points 4 days ago Coca-Cola company especially.  They are all in on poison for the poor. permalink parent award report block reply\npossibletower 5 points 5 days ago Based SCOTUS. Now don't cuck up on the tariffs even though if they nuke them I blame whatever Heritage Foundation retard told Trump that he can do whatever tariffs he wants by declaring a state of emergency or state of war with no precedents from any previous legislation or presidents backing up that claim. All the SCOTUS justices grilled the lawyer for Trump who didn't do a great job arguing for Trump at all, hoping that the LARP from the Heritage Foundation retard was going to win just based on copium. permalink award report block reply zooty 1 points 5 days ago I don't know about this specific case but I have been appalled at the competence we have seen from some of the lawyers in court at the national level. Yet another reason the university system needs to be fixed or replaced. permalink parent award report block reply\nzooty 1 points 5 days ago I don't know about this specific case but I have been appalled at the competence we have seen from some of the lawyers in court at the national level. Yet another reason the university system needs to be fixed or replaced. permalink parent award report block reply\nHillaryRodhamCunton 4 points 5 days ago People who have iPhones shouldn't get food stamps.  period permalink award report block reply Ligersrule1 1 points 4 days ago \"But I already have an iPhone...\" permalink parent award report block reply\nLigersrule1 1 points 4 days ago \"But I already have an iPhone...\" permalink parent award report block reply\nAVeryNakedMan 3 points 5 days ago Now arrest the leftist judge for sedition; trying to seize powers that he never had. permalink award report block reply\nTheRedPilledArtist OP 2 points 5 days ago SOURCE: https://x.com/LeadingReport/status/1986984022484955234 permalink award report block reply Deplora 2 points 5 days ago Real source: https://xcancel.com/AGPamBondi/status/1986985866900738242 permalink parent award report block reply JohnN 2 points 5 days ago Thanks. permalink parent award report block reply Deplora 2 points 5 days ago Welcome! permalink parent award report block reply\nDeplora 2 points 5 days ago Real source: https://xcancel.com/AGPamBondi/status/1986985866900738242 permalink parent award report block reply JohnN 2 points 5 days ago Thanks. permalink parent award report block reply Deplora 2 points 5 days ago Welcome! permalink parent award report block reply\nJohnN 2 points 5 days ago Thanks. permalink parent award report block reply Deplora 2 points 5 days ago Welcome! permalink parent award report block reply\nDeplora 2 points 5 days ago Welcome! permalink parent award report block reply\nzooty 2 points 5 days ago Shocker. When can 'something be done' about this judicial tyranny from the left? permalink award report block reply\nzooty 2 points 5 days ago Trump should have printed a bunch of $300 bill Trump bucks on his HP printer, handed them to the judge and made the him rule them legal tender if he wanted to proceed. permalink award report block reply\ntired-of-crap 1 points 4 days ago Just think of the trouble California is going to get in with its lenders because it's not going to get reimbursed for Money it has advanced for snap. permalink award report block reply\nProfessorJagoff 1 points 4 days ago Didn't the payments already go out, and that some states gave full payments for the month already? permalink award report block reply\nLogan051361 1 points 4 days ago Tossing trump a bone cause then they will go against him for tariffs permalink award report block reply\nsl1738 1 points 4 days ago This is so POORLY WORDED!!!. Trump doesn't have the ability to use tax money to fund SNAP without consent congress consent. It's literally says it in the constitution!!! permalink award report block reply\nFlyinHeadlock 1 points 5 days ago Not free at last. Not free at last!!!!! permalink award report block reply\nPatriotSkorzeny 1 points 5 days ago Precedent. “Improper budget is unconstitutional.” permalink award report block reply"}