{"id": "1ARK52DLwx", "contents": "444 BRENNAN COULD BE TRIED IN A FLORIDA FEDERAL COURT.. OUTSIDE THE REACH OF THE CORRUPT, LEFTY JUDGES HE WAS HOPING FOR. (www.thegatewaypundit.com) posted 6 days ago by blvntbr 11 comments award share report block JUST IN: Federal Prosecutors in SOUTH FLORIDA Preparing Grand Jury Subpoenas in Investigation Into John Brennan Related to Russi... Federal prosecutors in South Florida are preparing grand jury subpoenas as part of an investigation into former CIA Director John Brennan. www.thegatewaypundit.com\n11 comments Sort by Top Top New Worst Old Save Badfinz_FL 13 points 6 days ago He will be tried in the federal district in Florida as will clapper and wray permalink award report block reply Mungo 6 points 6 days ago Hopefully permalink parent award report block reply Oldman1234 6 points 6 days ago Judge Boasberg will order the case moved to his courtroom. permalink award report block reply bill_in_texas 6 points 6 days ago All the RICO conspirators need to be prosecuted in Florida. permalink award report block reply Liberats 1 points 5 days ago Good place to enjoy your last day.\nOh, you said prosecuted. permalink parent award report block reply Mungo 5 points 6 days ago Yes please.  He needs a noose more than most. permalink award report block reply AngryPoop 3 points 6 days ago He was the head of the CIA, he's got blackmail and leverage on hundreds of well positioned people. All it takes is one of them to lean on the judge permalink award report block reply AfterGlow 1 points 6 days ago Where was Brennan on election night 2016? Was it Sarasota, Florida? What was he doing? How was it thwarted? How did Trump possibly win? Maybe somebody will ask one of the witnesses. permalink award report block reply blueeyephoto 1 points 5 days ago Good.  They venue shop to stop Trump,  it's about time we do to permalink award report block reply drmrboy 0 points 6 days ago The case will be dropped.  🤓 permalink award report block reply\nBadfinz_FL 13 points 6 days ago He will be tried in the federal district in Florida as will clapper and wray permalink award report block reply Mungo 6 points 6 days ago Hopefully permalink parent award report block reply\nMungo 6 points 6 days ago Hopefully permalink parent award report block reply\nOldman1234 6 points 6 days ago Judge Boasberg will order the case moved to his courtroom. permalink award report block reply\nbill_in_texas 6 points 6 days ago All the RICO conspirators need to be prosecuted in Florida. permalink award report block reply Liberats 1 points 5 days ago Good place to enjoy your last day.\nOh, you said prosecuted. permalink parent award report block reply\nLiberats 1 points 5 days ago Good place to enjoy your last day.\nOh, you said prosecuted. permalink parent award report block reply\nMungo 5 points 6 days ago Yes please.  He needs a noose more than most. permalink award report block reply\nAngryPoop 3 points 6 days ago He was the head of the CIA, he's got blackmail and leverage on hundreds of well positioned people. All it takes is one of them to lean on the judge permalink award report block reply\nAfterGlow 1 points 6 days ago Where was Brennan on election night 2016? Was it Sarasota, Florida? What was he doing? How was it thwarted? How did Trump possibly win? Maybe somebody will ask one of the witnesses. permalink award report block reply\nblueeyephoto 1 points 5 days ago Good.  They venue shop to stop Trump,  it's about time we do to permalink award report block reply\ndrmrboy 0 points 6 days ago The case will be dropped.  🤓 permalink award report block reply"}