{"id": "1ARK9k0ANx", "contents": "517 Dear Republicans just in case you missed this friendly note:  Putin banned George Soros in 2015. The Russian government shut down Soros’ entire network — the Open Society Foundations and all connected NGOs. (substack.com) 🚽   DRAIN THE SWAMP   🚽 posted 1 day ago by SenorTrumper 34 comments award share report block Rob E. Bobby ♟️ (@whistlingwhistler) Dear Republicans just in case you missed this friendly note:  Putin banned George Soros in 2015. The Russian government shut down Soros’ entire network — the Open Society Foundations and all connected NGOs.They ruled his operations were “a threat to nation... substack.com\n34 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Hambonemcgee 16 points 1 day ago But, for some reason, we allow Soros to infiltrate every major city, funding commie candidates for all the local offices.  Even when \"our side\" is in charge, nothing happens. permalink award report block reply keeptherepublic1776 12 points 1 day ago Because the old fucks running our country only care about getting themselves rich. We the people be damned permalink parent award report block reply TrumpDupedMAGA 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply MastaJoda 9 points 1 day ago They cant hear you over the CIA's latest attempt to start WWIII. https://www.newsweek.com/us-gets-serious-about-drone-threat-after-russias-pearl-harbor-11026452 permalink award report block reply patrioticwinning3 4 points 1 day ago To be fair, I don't think Putin had Bondi, Blanche and Patel in charge.... permalink award report block reply HoganP 4 points 1 day ago That's why the globalists have been trying to provoke him into a war for over a decade.  He doesn't play ball with the subversion. permalink award report block reply Magma_Biscuit 3 points 1 day ago Putin knew permalink award report block reply SteveRogers42 2 points 1 day ago A very mild and moderate response from Putin. permalink award report block reply Kiwipede22 2 points 1 day ago Putin is the best leader in the world.  He is unemotional and logical in his decision making and he understands that his primary job is to look after and protect the Russian people.  There is no need for MRGA simply because they never lost sight of what the governments role is supposed to be. permalink award report block reply Quidnunc 2 points 1 day ago The Pelosi mafia is tight with Soros. Hillary's right hand woman, Huma Abedine, is married to Alex Soros. It's an orgy of evil at the top of the U.S. food chain. permalink award report block reply 24601 1 points 1 day ago I remember at the time, I knew someone who was part of an international \"education program\" which was basically \"teaching\" from the Communist International textbook. The education program was banned in Russia as a result of the above actions. Although it's a good thing to ban Communists.... It's also good to remember that Russia is NOT a Free Nation.  It's Authoritarian and no friend to America.  At the moment, Russia is arming the dictator in Venezuela and supplying China with fuel and military technology. The enemy of a bad ideology is not necessarily a friend of Freedom. permalink award report block reply SenorTrumper OP 5 points 1 day ago At the moment, Russia is arming the dictator in Venezuela and That's payback for how we have tried to fuck Russia by using the retard nation of Ukraine as a proxy. No surprise there. What goes round comes around. Remember the Cuban Missile Crisis? Well that was payback for us putting nukes in Turkey right on the USSR border. After the USSR pulled out of Cuba the US withdrew its nukes from Turkey, but for some strange reason you never hear about the Turkey part. permalink parent award report block reply 24601 -3 points 1 day ago That's payback for how we have tried to fuck Russia by using the retard nation of Ukraine as a proxy. No, it's not.... You need to review the Tucker - Putin interview again.  Putin lays claim to much of Ukraine.  He believes the land is Russian territory.  He was always going to try to get it back within the borders of Russia. In any case, Russia is not a Free Nation, nor a friend to America.  It's an unfriendly nation, and has consistently supported nations unfriendly to America.... both during and after the fall of the Iron Curtain. Sadly, there's a large contingent of simpletons posting around here who like to claim that Russia is somehow akin to MAGA.  And it's just not. Russia is an unfriendly and Non-Free Nation. She is a dangerous adversary armed with stolen American nuclear weapon technology and easy access to Chinese factories where the vast majority of the world's technology is manufactured. permalink parent award report block reply SenorTrumper OP 4 points 1 day ago Son, you sound young and naive. You are a victim of propaganda. NATO pushed cocainsky into provoking a military response from Russia.  Why?  Well, Europe is swirling the drain economically.  So they came up with the brilliant idea of going to war with Russia, breaking it up into pieces which would then be distributed to the UK, France, Germany, Poland and a few others. Unfortunately for the EU/NATO, Russia kicked ass. It went to war with the 32 members of NATO and neutralized them.  NATO has shown itself that without the US it's a collection of barking chihuahuas. We now know that Ukraine has suffered almost 2 million KIA based on the leaked data. In contrast, Russia has at most 150K KIA. The USA had around 500K KIA in all of WW II. NATO is expected to breakup shortly as most members realize it's a paper tiger and the cost of membership is no longer worth it. permalink parent award report block reply SenorTrumper OP 2 points 1 day ago That's payback for how we have tried to fuck Russia by using the retard nation of Ukraine as a proxy. No, it's not.... Oh yes it is. permalink parent award report block reply 24601 1 points 1 day ago No, it's not.... Oh yes it is. Your rebuttal is both well informed and substantial.  I yield to your argument, of course. permalink parent award report block reply view 1 more comments... iamherefortheluls 2 points 1 day ago It's Authoritarian and no friend to America. Russia spent 40 years trying to be a friend to America and what that got Russia was getting military encircled, every ally it had left being systematically demolished and their country facing constant infiltration with obvious intent to foster dissent and stage a revolution. Russia's alliance with China is 100% American's fault because it left them literally no other choice except to either form those close ties with their neighbor or be wiped out. All that said, Russia is currently closest to US ideologically in terms of what a country should be on paper and I would argue that its actually closer to what the founding fathers envisioned than what USA currently is. The biggest difference in their constitution and legal framework is the right to own weapons. words like 'authoritarian' are meaningless today. Their country is at war and yet they've never arrested thousands as political prisoners as USA has done with J6ers and they've not done anything as egregious with restricting free speech in their country as USA has done over last decade. Even the constant accusations of 'Putin murders his opposition' - US  and EU each has a much longer list of dead dissidents that were murdered. That's not even going into how a lot of the 'dissidents' that Putin allegedly had killed, died in custody of the British or EU. Being a dissident in Russia gets you investigated and thrown in jail often, but leaving Russia for the warm embrace of the collective west, consistently gets you dead. permalink parent award report block reply 24601 0 points 1 day ago Russia's alliance with China is 100% American's fault because it left them Sino-Russian alliance.... Um.... well... what's this? https://history.state.gov/historicaldocuments/frus1950v06/d157 On February 14, 1950, the Governments of the Soviet Union and the People’s Republic of China signed a 30-year Treaty of Friendship, Alliance, and Mutual Assistance which was ratified by both sides and entered into force on April 11, 1950. In addition, the two states concluded two agreements and three exchanges of notes. Th.... Oh! That was BEFORE.... Ah... so much different than now. Maybe not. All you Russia fans are idiots. permalink parent award report block reply iamherefortheluls 2 points 1 day ago the idiot thing here is to look at diplomatic platitudes rather than actions. Soviet Union never handed over the entire western economy to China or invested hundreds of billions of US dollars into them. China would be just another Pakistan if US hasn't made it into the global power it is today. permalink parent award report block reply 24601 1 points 1 day ago China - Russia - India .... all products of the theft of US technology and cash via the US branch of the Communist International embedded within the State Department and other areas of US Government during the early to late 20th Century. permalink parent award report block reply view 2 more comments... ariloulaleelay 1 points 1 day ago An absolutely ignorant take. It's true that USSR funded Chinese revolution, hoping to receive a vassal that way. It's also true that China have gained everything it could from USSR and then told it to fuck itself sideways, and afterwards their relationships have been pretty much a cold war with some hot phases too: https://en.wikipedia.org/wiki/Sino-Soviet_border_conflict Do you think USA would've moved its industrial potential to China if it was USSR's ally? It did so because China was its enemy so it was an enemy of the enemy thing. permalink parent award report block reply 24601 1 points 1 day ago Do you think USA would've moved its industrial potential to China if it was USSR's ally? It did so because China was its enemy so it was an enemy of the enemy thing. Manufacturing everything in China has absolutely nothing whatsoever to do with Russia-China-India alliances past, present, or future. Your attempt at such an assertion necessarily means that I should not take you seriously on this subject. Those people attempting to elevate Russia to the status of a somewhat MAGA aligned nation are morons.  All one needs to do is actually listen to Putin himself: https://rumble.com/v4c9a1i-exclusive-tucker-carlson-interviews-vladimir-putin.html permalink parent award report block reply SteveRogers42 1 points 1 day ago The enemy of my enemy is my friend. permalink parent award report block reply 24601 0 points 1 day ago No.  That doesn't work. The world is more complex than two or three competing ideological entities. The only way \"the enemy of my enemy is my friend\" functions to the benefit of the speaker, is if the speaker is Machiavelli. One must be prepared to destroy the \"friend.\"  Otherwise, one will lose. A much better idea is, the enemy of Constitutional governance is my enemy. permalink parent award report block reply DCYR66 1 points 1 day ago Vlad gets it! permalink award report block reply keeptherepublic1776 1 points 1 day ago Wait. You can do something like that? Want no way. permalink award report block reply Tradstew 1 points 1 day ago And here we dilly dally with the devil. permalink award report block reply SpeekFreely 1 points 1 day ago I believe we’re going to find Soro’s is funding some of them too. In fact if you look up George’s brother Paul Soros, and search John McCain those two were collaborators on certain projects. permalink award report block reply Obambi 1 points 1 day ago That’s why they went after Putin. Soros media goons too. permalink award report block reply Be_The_Change 1 points 1 day ago Comment removed by community moderators. permalink award report block reply SCHULTZ 1 points 1 day ago Comment removed by community moderators. permalink award report block reply\nHambonemcgee 16 points 1 day ago But, for some reason, we allow Soros to infiltrate every major city, funding commie candidates for all the local offices.  Even when \"our side\" is in charge, nothing happens. permalink award report block reply keeptherepublic1776 12 points 1 day ago Because the old fucks running our country only care about getting themselves rich. We the people be damned permalink parent award report block reply TrumpDupedMAGA 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nkeeptherepublic1776 12 points 1 day ago Because the old fucks running our country only care about getting themselves rich. We the people be damned permalink parent award report block reply\nTrumpDupedMAGA 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nMastaJoda 9 points 1 day ago They cant hear you over the CIA's latest attempt to start WWIII. https://www.newsweek.com/us-gets-serious-about-drone-threat-after-russias-pearl-harbor-11026452 permalink award report block reply\npatrioticwinning3 4 points 1 day ago To be fair, I don't think Putin had Bondi, Blanche and Patel in charge.... permalink award report block reply\nHoganP 4 points 1 day ago That's why the globalists have been trying to provoke him into a war for over a decade.  He doesn't play ball with the subversion. permalink award report block reply\nMagma_Biscuit 3 points 1 day ago Putin knew permalink award report block reply\nSteveRogers42 2 points 1 day ago A very mild and moderate response from Putin. permalink award report block reply\nKiwipede22 2 points 1 day ago Putin is the best leader in the world.  He is unemotional and logical in his decision making and he understands that his primary job is to look after and protect the Russian people.  There is no need for MRGA simply because they never lost sight of what the governments role is supposed to be. permalink award report block reply\nQuidnunc 2 points 1 day ago The Pelosi mafia is tight with Soros. Hillary's right hand woman, Huma Abedine, is married to Alex Soros. It's an orgy of evil at the top of the U.S. food chain. permalink award report block reply\n24601 1 points 1 day ago I remember at the time, I knew someone who was part of an international \"education program\" which was basically \"teaching\" from the Communist International textbook. The education program was banned in Russia as a result of the above actions. Although it's a good thing to ban Communists.... It's also good to remember that Russia is NOT a Free Nation.  It's Authoritarian and no friend to America.  At the moment, Russia is arming the dictator in Venezuela and supplying China with fuel and military technology. The enemy of a bad ideology is not necessarily a friend of Freedom. permalink award report block reply SenorTrumper OP 5 points 1 day ago At the moment, Russia is arming the dictator in Venezuela and That's payback for how we have tried to fuck Russia by using the retard nation of Ukraine as a proxy. No surprise there. What goes round comes around. Remember the Cuban Missile Crisis? Well that was payback for us putting nukes in Turkey right on the USSR border. After the USSR pulled out of Cuba the US withdrew its nukes from Turkey, but for some strange reason you never hear about the Turkey part. permalink parent award report block reply 24601 -3 points 1 day ago That's payback for how we have tried to fuck Russia by using the retard nation of Ukraine as a proxy. No, it's not.... You need to review the Tucker - Putin interview again.  Putin lays claim to much of Ukraine.  He believes the land is Russian territory.  He was always going to try to get it back within the borders of Russia. In any case, Russia is not a Free Nation, nor a friend to America.  It's an unfriendly nation, and has consistently supported nations unfriendly to America.... both during and after the fall of the Iron Curtain. Sadly, there's a large contingent of simpletons posting around here who like to claim that Russia is somehow akin to MAGA.  And it's just not. Russia is an unfriendly and Non-Free Nation. She is a dangerous adversary armed with stolen American nuclear weapon technology and easy access to Chinese factories where the vast majority of the world's technology is manufactured. permalink parent award report block reply SenorTrumper OP 4 points 1 day ago Son, you sound young and naive. You are a victim of propaganda. NATO pushed cocainsky into provoking a military response from Russia.  Why?  Well, Europe is swirling the drain economically.  So they came up with the brilliant idea of going to war with Russia, breaking it up into pieces which would then be distributed to the UK, France, Germany, Poland and a few others. Unfortunately for the EU/NATO, Russia kicked ass. It went to war with the 32 members of NATO and neutralized them.  NATO has shown itself that without the US it's a collection of barking chihuahuas. We now know that Ukraine has suffered almost 2 million KIA based on the leaked data. In contrast, Russia has at most 150K KIA. The USA had around 500K KIA in all of WW II. NATO is expected to breakup shortly as most members realize it's a paper tiger and the cost of membership is no longer worth it. permalink parent award report block reply SenorTrumper OP 2 points 1 day ago That's payback for how we have tried to fuck Russia by using the retard nation of Ukraine as a proxy. No, it's not.... Oh yes it is. permalink parent award report block reply 24601 1 points 1 day ago No, it's not.... Oh yes it is. Your rebuttal is both well informed and substantial.  I yield to your argument, of course. permalink parent award report block reply view 1 more comments... iamherefortheluls 2 points 1 day ago It's Authoritarian and no friend to America. Russia spent 40 years trying to be a friend to America and what that got Russia was getting military encircled, every ally it had left being systematically demolished and their country facing constant infiltration with obvious intent to foster dissent and stage a revolution. Russia's alliance with China is 100% American's fault because it left them literally no other choice except to either form those close ties with their neighbor or be wiped out. All that said, Russia is currently closest to US ideologically in terms of what a country should be on paper and I would argue that its actually closer to what the founding fathers envisioned than what USA currently is. The biggest difference in their constitution and legal framework is the right to own weapons. words like 'authoritarian' are meaningless today. Their country is at war and yet they've never arrested thousands as political prisoners as USA has done with J6ers and they've not done anything as egregious with restricting free speech in their country as USA has done over last decade. Even the constant accusations of 'Putin murders his opposition' - US  and EU each has a much longer list of dead dissidents that were murdered. That's not even going into how a lot of the 'dissidents' that Putin allegedly had killed, died in custody of the British or EU. Being a dissident in Russia gets you investigated and thrown in jail often, but leaving Russia for the warm embrace of the collective west, consistently gets you dead. permalink parent award report block reply 24601 0 points 1 day ago Russia's alliance with China is 100% American's fault because it left them Sino-Russian alliance.... Um.... well... what's this? https://history.state.gov/historicaldocuments/frus1950v06/d157 On February 14, 1950, the Governments of the Soviet Union and the People’s Republic of China signed a 30-year Treaty of Friendship, Alliance, and Mutual Assistance which was ratified by both sides and entered into force on April 11, 1950. In addition, the two states concluded two agreements and three exchanges of notes. Th.... Oh! That was BEFORE.... Ah... so much different than now. Maybe not. All you Russia fans are idiots. permalink parent award report block reply iamherefortheluls 2 points 1 day ago the idiot thing here is to look at diplomatic platitudes rather than actions. Soviet Union never handed over the entire western economy to China or invested hundreds of billions of US dollars into them. China would be just another Pakistan if US hasn't made it into the global power it is today. permalink parent award report block reply 24601 1 points 1 day ago China - Russia - India .... all products of the theft of US technology and cash via the US branch of the Communist International embedded within the State Department and other areas of US Government during the early to late 20th Century. permalink parent award report block reply view 2 more comments... ariloulaleelay 1 points 1 day ago An absolutely ignorant take. It's true that USSR funded Chinese revolution, hoping to receive a vassal that way. It's also true that China have gained everything it could from USSR and then told it to fuck itself sideways, and afterwards their relationships have been pretty much a cold war with some hot phases too: https://en.wikipedia.org/wiki/Sino-Soviet_border_conflict Do you think USA would've moved its industrial potential to China if it was USSR's ally? It did so because China was its enemy so it was an enemy of the enemy thing. permalink parent award report block reply 24601 1 points 1 day ago Do you think USA would've moved its industrial potential to China if it was USSR's ally? It did so because China was its enemy so it was an enemy of the enemy thing. Manufacturing everything in China has absolutely nothing whatsoever to do with Russia-China-India alliances past, present, or future. Your attempt at such an assertion necessarily means that I should not take you seriously on this subject. Those people attempting to elevate Russia to the status of a somewhat MAGA aligned nation are morons.  All one needs to do is actually listen to Putin himself: https://rumble.com/v4c9a1i-exclusive-tucker-carlson-interviews-vladimir-putin.html permalink parent award report block reply SteveRogers42 1 points 1 day ago The enemy of my enemy is my friend. permalink parent award report block reply 24601 0 points 1 day ago No.  That doesn't work. The world is more complex than two or three competing ideological entities. The only way \"the enemy of my enemy is my friend\" functions to the benefit of the speaker, is if the speaker is Machiavelli. One must be prepared to destroy the \"friend.\"  Otherwise, one will lose. A much better idea is, the enemy of Constitutional governance is my enemy. permalink parent award report block reply\nSenorTrumper OP 5 points 1 day ago At the moment, Russia is arming the dictator in Venezuela and That's payback for how we have tried to fuck Russia by using the retard nation of Ukraine as a proxy. No surprise there. What goes round comes around. Remember the Cuban Missile Crisis? Well that was payback for us putting nukes in Turkey right on the USSR border. After the USSR pulled out of Cuba the US withdrew its nukes from Turkey, but for some strange reason you never hear about the Turkey part. permalink parent award report block reply 24601 -3 points 1 day ago That's payback for how we have tried to fuck Russia by using the retard nation of Ukraine as a proxy. No, it's not.... You need to review the Tucker - Putin interview again.  Putin lays claim to much of Ukraine.  He believes the land is Russian territory.  He was always going to try to get it back within the borders of Russia. In any case, Russia is not a Free Nation, nor a friend to America.  It's an unfriendly nation, and has consistently supported nations unfriendly to America.... both during and after the fall of the Iron Curtain. Sadly, there's a large contingent of simpletons posting around here who like to claim that Russia is somehow akin to MAGA.  And it's just not. Russia is an unfriendly and Non-Free Nation. She is a dangerous adversary armed with stolen American nuclear weapon technology and easy access to Chinese factories where the vast majority of the world's technology is manufactured. permalink parent award report block reply SenorTrumper OP 4 points 1 day ago Son, you sound young and naive. You are a victim of propaganda. NATO pushed cocainsky into provoking a military response from Russia.  Why?  Well, Europe is swirling the drain economically.  So they came up with the brilliant idea of going to war with Russia, breaking it up into pieces which would then be distributed to the UK, France, Germany, Poland and a few others. Unfortunately for the EU/NATO, Russia kicked ass. It went to war with the 32 members of NATO and neutralized them.  NATO has shown itself that without the US it's a collection of barking chihuahuas. We now know that Ukraine has suffered almost 2 million KIA based on the leaked data. In contrast, Russia has at most 150K KIA. The USA had around 500K KIA in all of WW II. NATO is expected to breakup shortly as most members realize it's a paper tiger and the cost of membership is no longer worth it. permalink parent award report block reply SenorTrumper OP 2 points 1 day ago That's payback for how we have tried to fuck Russia by using the retard nation of Ukraine as a proxy. No, it's not.... Oh yes it is. permalink parent award report block reply 24601 1 points 1 day ago No, it's not.... Oh yes it is. Your rebuttal is both well informed and substantial.  I yield to your argument, of course. permalink parent award report block reply view 1 more comments...\n24601 -3 points 1 day ago That's payback for how we have tried to fuck Russia by using the retard nation of Ukraine as a proxy. No, it's not.... You need to review the Tucker - Putin interview again.  Putin lays claim to much of Ukraine.  He believes the land is Russian territory.  He was always going to try to get it back within the borders of Russia. In any case, Russia is not a Free Nation, nor a friend to America.  It's an unfriendly nation, and has consistently supported nations unfriendly to America.... both during and after the fall of the Iron Curtain. Sadly, there's a large contingent of simpletons posting around here who like to claim that Russia is somehow akin to MAGA.  And it's just not. Russia is an unfriendly and Non-Free Nation. She is a dangerous adversary armed with stolen American nuclear weapon technology and easy access to Chinese factories where the vast majority of the world's technology is manufactured. permalink parent award report block reply SenorTrumper OP 4 points 1 day ago Son, you sound young and naive. You are a victim of propaganda. NATO pushed cocainsky into provoking a military response from Russia.  Why?  Well, Europe is swirling the drain economically.  So they came up with the brilliant idea of going to war with Russia, breaking it up into pieces which would then be distributed to the UK, France, Germany, Poland and a few others. Unfortunately for the EU/NATO, Russia kicked ass. It went to war with the 32 members of NATO and neutralized them.  NATO has shown itself that without the US it's a collection of barking chihuahuas. We now know that Ukraine has suffered almost 2 million KIA based on the leaked data. In contrast, Russia has at most 150K KIA. The USA had around 500K KIA in all of WW II. NATO is expected to breakup shortly as most members realize it's a paper tiger and the cost of membership is no longer worth it. permalink parent award report block reply SenorTrumper OP 2 points 1 day ago That's payback for how we have tried to fuck Russia by using the retard nation of Ukraine as a proxy. No, it's not.... Oh yes it is. permalink parent award report block reply 24601 1 points 1 day ago No, it's not.... Oh yes it is. Your rebuttal is both well informed and substantial.  I yield to your argument, of course. permalink parent award report block reply view 1 more comments...\nSenorTrumper OP 4 points 1 day ago Son, you sound young and naive. You are a victim of propaganda. NATO pushed cocainsky into provoking a military response from Russia.  Why?  Well, Europe is swirling the drain economically.  So they came up with the brilliant idea of going to war with Russia, breaking it up into pieces which would then be distributed to the UK, France, Germany, Poland and a few others. Unfortunately for the EU/NATO, Russia kicked ass. It went to war with the 32 members of NATO and neutralized them.  NATO has shown itself that without the US it's a collection of barking chihuahuas. We now know that Ukraine has suffered almost 2 million KIA based on the leaked data. In contrast, Russia has at most 150K KIA. The USA had around 500K KIA in all of WW II. NATO is expected to breakup shortly as most members realize it's a paper tiger and the cost of membership is no longer worth it. permalink parent award report block reply\nSenorTrumper OP 2 points 1 day ago That's payback for how we have tried to fuck Russia by using the retard nation of Ukraine as a proxy. No, it's not.... Oh yes it is. permalink parent award report block reply 24601 1 points 1 day ago No, it's not.... Oh yes it is. Your rebuttal is both well informed and substantial.  I yield to your argument, of course. permalink parent award report block reply view 1 more comments...\n24601 1 points 1 day ago No, it's not.... Oh yes it is. Your rebuttal is both well informed and substantial.  I yield to your argument, of course. permalink parent award report block reply view 1 more comments...\niamherefortheluls 2 points 1 day ago It's Authoritarian and no friend to America. Russia spent 40 years trying to be a friend to America and what that got Russia was getting military encircled, every ally it had left being systematically demolished and their country facing constant infiltration with obvious intent to foster dissent and stage a revolution. Russia's alliance with China is 100% American's fault because it left them literally no other choice except to either form those close ties with their neighbor or be wiped out. All that said, Russia is currently closest to US ideologically in terms of what a country should be on paper and I would argue that its actually closer to what the founding fathers envisioned than what USA currently is. The biggest difference in their constitution and legal framework is the right to own weapons. words like 'authoritarian' are meaningless today. Their country is at war and yet they've never arrested thousands as political prisoners as USA has done with J6ers and they've not done anything as egregious with restricting free speech in their country as USA has done over last decade. Even the constant accusations of 'Putin murders his opposition' - US  and EU each has a much longer list of dead dissidents that were murdered. That's not even going into how a lot of the 'dissidents' that Putin allegedly had killed, died in custody of the British or EU. Being a dissident in Russia gets you investigated and thrown in jail often, but leaving Russia for the warm embrace of the collective west, consistently gets you dead. permalink parent award report block reply 24601 0 points 1 day ago Russia's alliance with China is 100% American's fault because it left them Sino-Russian alliance.... Um.... well... what's this? https://history.state.gov/historicaldocuments/frus1950v06/d157 On February 14, 1950, the Governments of the Soviet Union and the People’s Republic of China signed a 30-year Treaty of Friendship, Alliance, and Mutual Assistance which was ratified by both sides and entered into force on April 11, 1950. In addition, the two states concluded two agreements and three exchanges of notes. Th.... Oh! That was BEFORE.... Ah... so much different than now. Maybe not. All you Russia fans are idiots. permalink parent award report block reply iamherefortheluls 2 points 1 day ago the idiot thing here is to look at diplomatic platitudes rather than actions. Soviet Union never handed over the entire western economy to China or invested hundreds of billions of US dollars into them. China would be just another Pakistan if US hasn't made it into the global power it is today. permalink parent award report block reply 24601 1 points 1 day ago China - Russia - India .... all products of the theft of US technology and cash via the US branch of the Communist International embedded within the State Department and other areas of US Government during the early to late 20th Century. permalink parent award report block reply view 2 more comments... ariloulaleelay 1 points 1 day ago An absolutely ignorant take. It's true that USSR funded Chinese revolution, hoping to receive a vassal that way. It's also true that China have gained everything it could from USSR and then told it to fuck itself sideways, and afterwards their relationships have been pretty much a cold war with some hot phases too: https://en.wikipedia.org/wiki/Sino-Soviet_border_conflict Do you think USA would've moved its industrial potential to China if it was USSR's ally? It did so because China was its enemy so it was an enemy of the enemy thing. permalink parent award report block reply 24601 1 points 1 day ago Do you think USA would've moved its industrial potential to China if it was USSR's ally? It did so because China was its enemy so it was an enemy of the enemy thing. Manufacturing everything in China has absolutely nothing whatsoever to do with Russia-China-India alliances past, present, or future. Your attempt at such an assertion necessarily means that I should not take you seriously on this subject. Those people attempting to elevate Russia to the status of a somewhat MAGA aligned nation are morons.  All one needs to do is actually listen to Putin himself: https://rumble.com/v4c9a1i-exclusive-tucker-carlson-interviews-vladimir-putin.html permalink parent award report block reply\n24601 0 points 1 day ago Russia's alliance with China is 100% American's fault because it left them Sino-Russian alliance.... Um.... well... what's this? https://history.state.gov/historicaldocuments/frus1950v06/d157 On February 14, 1950, the Governments of the Soviet Union and the People’s Republic of China signed a 30-year Treaty of Friendship, Alliance, and Mutual Assistance which was ratified by both sides and entered into force on April 11, 1950. In addition, the two states concluded two agreements and three exchanges of notes. Th.... Oh! That was BEFORE.... Ah... so much different than now. Maybe not. All you Russia fans are idiots. permalink parent award report block reply iamherefortheluls 2 points 1 day ago the idiot thing here is to look at diplomatic platitudes rather than actions. Soviet Union never handed over the entire western economy to China or invested hundreds of billions of US dollars into them. China would be just another Pakistan if US hasn't made it into the global power it is today. permalink parent award report block reply 24601 1 points 1 day ago China - Russia - India .... all products of the theft of US technology and cash via the US branch of the Communist International embedded within the State Department and other areas of US Government during the early to late 20th Century. permalink parent award report block reply view 2 more comments... ariloulaleelay 1 points 1 day ago An absolutely ignorant take. It's true that USSR funded Chinese revolution, hoping to receive a vassal that way. It's also true that China have gained everything it could from USSR and then told it to fuck itself sideways, and afterwards their relationships have been pretty much a cold war with some hot phases too: https://en.wikipedia.org/wiki/Sino-Soviet_border_conflict Do you think USA would've moved its industrial potential to China if it was USSR's ally? It did so because China was its enemy so it was an enemy of the enemy thing. permalink parent award report block reply 24601 1 points 1 day ago Do you think USA would've moved its industrial potential to China if it was USSR's ally? It did so because China was its enemy so it was an enemy of the enemy thing. Manufacturing everything in China has absolutely nothing whatsoever to do with Russia-China-India alliances past, present, or future. Your attempt at such an assertion necessarily means that I should not take you seriously on this subject. Those people attempting to elevate Russia to the status of a somewhat MAGA aligned nation are morons.  All one needs to do is actually listen to Putin himself: https://rumble.com/v4c9a1i-exclusive-tucker-carlson-interviews-vladimir-putin.html permalink parent award report block reply\niamherefortheluls 2 points 1 day ago the idiot thing here is to look at diplomatic platitudes rather than actions. Soviet Union never handed over the entire western economy to China or invested hundreds of billions of US dollars into them. China would be just another Pakistan if US hasn't made it into the global power it is today. permalink parent award report block reply 24601 1 points 1 day ago China - Russia - India .... all products of the theft of US technology and cash via the US branch of the Communist International embedded within the State Department and other areas of US Government during the early to late 20th Century. permalink parent award report block reply view 2 more comments...\n24601 1 points 1 day ago China - Russia - India .... all products of the theft of US technology and cash via the US branch of the Communist International embedded within the State Department and other areas of US Government during the early to late 20th Century. permalink parent award report block reply view 2 more comments...\nariloulaleelay 1 points 1 day ago An absolutely ignorant take. It's true that USSR funded Chinese revolution, hoping to receive a vassal that way. It's also true that China have gained everything it could from USSR and then told it to fuck itself sideways, and afterwards their relationships have been pretty much a cold war with some hot phases too: https://en.wikipedia.org/wiki/Sino-Soviet_border_conflict Do you think USA would've moved its industrial potential to China if it was USSR's ally? It did so because China was its enemy so it was an enemy of the enemy thing. permalink parent award report block reply 24601 1 points 1 day ago Do you think USA would've moved its industrial potential to China if it was USSR's ally? It did so because China was its enemy so it was an enemy of the enemy thing. Manufacturing everything in China has absolutely nothing whatsoever to do with Russia-China-India alliances past, present, or future. Your attempt at such an assertion necessarily means that I should not take you seriously on this subject. Those people attempting to elevate Russia to the status of a somewhat MAGA aligned nation are morons.  All one needs to do is actually listen to Putin himself: https://rumble.com/v4c9a1i-exclusive-tucker-carlson-interviews-vladimir-putin.html permalink parent award report block reply\n24601 1 points 1 day ago Do you think USA would've moved its industrial potential to China if it was USSR's ally? It did so because China was its enemy so it was an enemy of the enemy thing. Manufacturing everything in China has absolutely nothing whatsoever to do with Russia-China-India alliances past, present, or future. Your attempt at such an assertion necessarily means that I should not take you seriously on this subject. Those people attempting to elevate Russia to the status of a somewhat MAGA aligned nation are morons.  All one needs to do is actually listen to Putin himself: https://rumble.com/v4c9a1i-exclusive-tucker-carlson-interviews-vladimir-putin.html permalink parent award report block reply\nSteveRogers42 1 points 1 day ago The enemy of my enemy is my friend. permalink parent award report block reply 24601 0 points 1 day ago No.  That doesn't work. The world is more complex than two or three competing ideological entities. The only way \"the enemy of my enemy is my friend\" functions to the benefit of the speaker, is if the speaker is Machiavelli. One must be prepared to destroy the \"friend.\"  Otherwise, one will lose. A much better idea is, the enemy of Constitutional governance is my enemy. permalink parent award report block reply\n24601 0 points 1 day ago No.  That doesn't work. The world is more complex than two or three competing ideological entities. The only way \"the enemy of my enemy is my friend\" functions to the benefit of the speaker, is if the speaker is Machiavelli. One must be prepared to destroy the \"friend.\"  Otherwise, one will lose. A much better idea is, the enemy of Constitutional governance is my enemy. permalink parent award report block reply\nDCYR66 1 points 1 day ago Vlad gets it! permalink award report block reply\nkeeptherepublic1776 1 points 1 day ago Wait. You can do something like that? Want no way. permalink award report block reply\nTradstew 1 points 1 day ago And here we dilly dally with the devil. permalink award report block reply\nSpeekFreely 1 points 1 day ago I believe we’re going to find Soro’s is funding some of them too. In fact if you look up George’s brother Paul Soros, and search John McCain those two were collaborators on certain projects. permalink award report block reply\nObambi 1 points 1 day ago That’s why they went after Putin. Soros media goons too. permalink award report block reply\nBe_The_Change 1 points 1 day ago Comment removed by community moderators. permalink award report block reply\nSCHULTZ 1 points 1 day ago Comment removed by community moderators. permalink award report block reply"}