{"id": "1ARK9jztnk", "contents": "1748 And that’s a fact Jack…. 🐸 YES posted 1 day ago by Deadpool 99 comments award share download report block\n99 comments Sort by Top Top New Worst Old Save MrTexan 45 points 1 day ago These type of politicians remind me of the what Judas said when the woman used the expensive perfume to anoint Jesus. John 12:5-6\n5“Why wasn’t this perfume sold for three hundred denarii and the money given to the poor?” 6 Judas did not say this because he cared about the poor, but because he was a thief. As keeper of the money bag, he used to take from what was put into it. permalink award report block reply conservativefrank 23 points 1 day ago \"Why wasn't it sold so I could steal the money?\" permalink parent award report block reply Deportthemall23 -2 points 1 day ago They don't love the poor they hate the rich They don't love gay people They just hate straight people They don't support women they just hate men They don't care about Mexicans They just hate white people They don't give a shit about Palestine they just hate Jews They don't care about trans people They just hate Americans permalink parent award report block reply Deadpool OP 16 points 1 day ago Exactly permalink parent award report block reply NADSAQ 8 points 1 day ago don’t mention he was jewish… don’t mention he was jewish… ah, shit permalink parent award report block reply 5DchessWatch 5 points 1 day ago btw, I looked into it.  Asian spikenard--the perfume you mentioned--is the essential oil of Nardostachys jatamansi. https://en.wikipedia.org/wiki/Nardostachys It is a source of a type of intensely aromatic amber-colored essential oil, spikenard. The oil has, since ancient times, been used as a perfume, as a traditional medicine, and in religious ceremonies. It is also called spikenard, nard, nardin, or muskroot.* This is also interesting.   The gospel, according to some bish name Qwen via Brave LEO LLM: Mary of Bethany used her own expensive perfume, likely a family heirloom worth a year’s wages. The objection came primarily from Judas Iscariot, who complained it should have been sold and given to the poor—but the Gospel of John clarifies he did not care about the poor, as he was a thief who stole from the disciples’ money bag (John 12:6). While some disciples also questioned the act (Matthew 26:8, Mark 14:4), Jesus defended Mary, calling it a “beautiful thing” and stating she had anointed him for his burial (Mark 14:6–8). He emphasized that her devotion was more important in that moment than even charitable giving. SO if \"Qwen\" is correct, then Christians throughout history are still getting on this poor woman's case based on the insistence of JUDAS Why the F do we care what Judas thinks? Forgive this Mary, and remember how she was a great Patriot to Jesus.  The best kind.  Using her family heirloom on him. She did it right permalink parent award report block reply 5DchessWatch 3 points 1 day ago Also, I obtained this essential oil before.  Tiny amount It was very terrible smelling permalink parent award report block reply iamherefortheluls 4 points 1 day ago besides that firs lesson, there is a second - in a society where everyone becomes so 'righteous' as to want to do that, that perfume becomes worthless. 'the poor' get no money in that one either. Desire for luxury is what drives people to work toward prosperity and is why today our poor live in what kings of old would see as luxury. permalink parent award report block reply load 2 more comments... TheTelltaleFly 26 points 1 day ago It’s worse. The progressive catchphrase is actually “eat the rich.” permalink award report block reply Hanging_Chad 17 points 1 day ago that’s Haiti’s motto permalink parent award report block reply Mortal_Wombat 7 points 1 day ago <BBQ has entered the chat> permalink parent award report block reply Meister_Bockmist 2 points 1 day ago Haitians are a CATastrophe for western values and cuisine. Spez: cousin is cusine for dumbos... permalink parent award report block reply Bullet3250 3 points 1 day ago Year after year after year.... Century after Century... An utter shithole - that makes other shitholes blush with envy. permalink parent award report block reply Mortal_Wombat 2 points 1 day ago *cuisine 😉 am former pro-chef permalink parent award report block reply view 1 more comments... Timbo1965 2 points 1 day ago <Biden's uncle runs> permalink parent award report block reply 5DchessWatch 3 points 1 day ago They eat the rich and the poor (cats, dogs).   Petco basically went out of business there.  Everyone thought it was a food court. permalink parent award report block reply Haiti_kid 2 points 1 day ago Yes.  It is. permalink parent award report block reply Hanging_Chad 1 points 23 hours ago kek permalink parent award report block reply airborne3502 2 points 1 day ago \"Eat the Rich\" is a better than average Aerosmith song. permalink parent award report block reply booblitchutz 3 points 1 day ago “Kill the Poor” is a really good Dead Kennedys song. permalink parent award report block reply zooty 2 points 1 day ago Also a Motorhead song (with no connection) but I'd say below average in their case. It was written for a film of the same name which was very below average. permalink parent award report block reply JanOctSept 17 points 1 day ago “Tax the rich! So we can take those tax dollars and funnel them through NGO’s, which then go into the pockets of wealthy democrats and billionaires!” permalink award report block reply zooty 3 points 1 day ago Dollars which were otherwise invested in the economy and being far more productive than anything the government can do with them. permalink parent award report block reply Purple_Drank 9 points 1 day ago I need a thesaurus for this meme permalink award report block reply CommieCucker 16 points 1 day ago \"performative altruism\" = \"virtue signaling\" permalink parent award report block reply Deadpool OP 13 points 1 day ago I see the public school system is continuing to fail permalink parent award report block reply guywholikesDjtof2024 7 points 1 day ago It teaches contra-Biblical worldviews. That is why. permalink parent award report block reply Purple_Drank 3 points 1 day ago yes.  yes it is..... permalink parent award report block reply Aquamine-Amarine 2 points 1 day ago By design. permalink parent award report block reply guywholikesDjtof2024 4 points 1 day ago I bet the 19A did exactly zero to slow the fail rate! permalink parent award report block reply NADSAQ 2 points 1 day ago i find the whole thing shallow and pedantic permalink parent award report block reply fazaman 6 points 1 day ago That's because \"tax the rich\" is a specific thing that's hard to misinterpret. \"Help the poor\" could be interpreted in ways that they wouldn't like. Taxing the rich won't really help the poor. Reducing government regulations likely would, but they don't want that. They want a totalitarian government, and taxing the rich disproportionately is a step in hat direction. permalink award report block reply booblitchutz 5 points 1 day ago “Help the poor” tries to help poor white people in Appalachia “NOOOO NOT THOSE POOR!!!” permalink parent award report block reply Dev404 5 points 1 day ago Socialists/communists are what they've always been - losers who want to partake in the winnings without putting in the effort. They scream it's on behalf of the \"poor\" while they enrich themselves to become champagne socialists. AOC and Bernie Sanders come to mind, how many poor people have they helped while they, themselves, became multimillionaires who aren't remotely interested in redistributing their own ill-gained wealth? That's the scam of socialism, to con people by using their feelings. permalink award report block reply PillarOfWisdom 4 points 1 day ago They'd make more inroads with Christians if they focused on helping the poor instead of their revenge mentality. permalink award report block reply booblitchutz 3 points 1 day ago They don’t give a wet shit about Christians. permalink parent award report block reply zooty 3 points 1 day ago Other human beings are only a means to political power. permalink parent award report block reply Alred 4 points 1 day ago All the EV and solar credits helped the poor only. hahahaha permalink award report block reply SavingPrivateGrace 3 points 1 day ago Grifters.  The progressives figure out how they can get every piece of the pie, and the more they are in politics, some a lifetime, the more they take and take.  Again and again, term limits would keep their dirty hands away from our tax dollars.  Progressives got so powerful stealing from the rich to give to the poor, they are 'the rich'. permalink award report block reply Tophat9000 3 points 1 day ago There's more truth in this than people realize permalink award report block reply A_Little_White_Duck 3 points 1 day ago I always wondered why the lyrics for Ten Years After's song \"I'd Love to Change the World\": Tax the rich\nFeed the poor\nTil there are no\nRich no more Didn't have the more charitable \"Til there are no poor no more\" 55 years of me thinking many charitable-minded intentions were just envy. permalink award report block reply Texar1991 1 points 1 day ago It even rhymes better!!! permalink parent award report block reply Covfefebrulee 3 points 1 day ago also known as Evil. permalink award report block reply imwithhair 2 points 1 day ago If you pay further attention you will see that it is millionaire democrats screaming “tax the rich” and “billionaires should not exist”. It’s ok to be a millionaire rich hypocrite asshole but not a billionaire in liberal clowntown. permalink award report block reply booblitchutz 1 points 1 day ago Ah but it most certainly IS okay to be a billionaire, provided you have the right opinions! permalink parent award report block reply 5DchessWatch 2 points 1 day ago All taxes should go away except for sales tax and it should never ever be higher than 25% and it should apply equally to ALL sale items.  12.5% goes to the state in which the item or service is sold, 12.5% goes to federal.   Federal obligations to state, therefore, should only be supplemental. People should be allowed to give more taxes voluntarily.  25% is the minimum.  And the additional amount should be voluntarily recorded in a kind of public leaderboard, so people can prove they gave to charity, if they want to.  But they don't have to.  It can be recorded with or without your name.  You could record it anonymously in such a way that you could prove it in court (unseal the name) if you ever have to. permalink award report block reply 5DchessWatch 1 points 1 day ago So for example, if you're a p diddy and you are in court, and you're a multi millionaire rich guy having orgies and such but you gave tremendously to the public for the public good, they might (\"ought to\"--I would) consider this in any punishments. permalink parent award report block reply GhostOfTheRepublic 2 points 1 day ago 100% permalink award report block reply Ferretman 2 points 1 day ago Accurate. permalink award report block reply behemoth887 2 points 1 day ago tax the rich by passing investment focused taxes that can be easily dodged by the rich but not dodged by the middle class permalink award report block reply Mungo 2 points 1 day ago Exactly permalink award report block reply blitzstrasse 2 points 1 day ago That's God's own truth. permalink award report block reply Another_rando 2 points 1 day ago It also assumes that taxes go back to the government and then the people. But we all know the mass corruption doesn't allow that permalink award report block reply RhodesianRidgeback 2 points 1 day ago The catchphrase is \"Eat The Rich\" permalink award report block reply Rockmanneo 1 points 21 hours ago Being a facade while walking on eggshells is what they do best. permalink award report block reply Liberats 1 points 1 day ago \"The altruism\" is used to buy their votes. permalink award report block reply YodaBannon 1 points 1 day ago these retards should want smaller government and less taxes, maybe they will come around to that once they complete a full thought permalink award report block reply Trumpwon306 1 points 1 day ago Hey--I totally agree with this and I'm morally and intellectually developed enough to recognize that \"Tax the Rich\" is a self-serving slogan designed to exploit envy, resentment and economic anxiety amongst the bottom 90% of the American public. So what? Recognizing this doesn't do anything substantive for us. While this administration and the Republican party continues to give Israel blowjobs and paying them for the trouble, the American people are in a cost of living crisis. Things are not getting better. Every day, week, month and year that we continue running a gargantuan budgetary deficit means every single American is taxed via inflation. We have had ZERO solutions to this issue. Not only that, but the Trump administration has been made to look totally ineffective and weak as a result of the government shutdown. A MINORITY PARTY shut down the government. The fact that everyone here knows the filibuster won't be removed by republicans despite President Trump's tweets is sad and pathetic. It's illustrative of how utterly weak and useless elected Republicans are. It demoralizes the base, and will be part of the reason 2026 is going to be an even worse wipeout than 2018. The base is at the end of its rope. The American people are at the end of their rope. Between a politician offering a shitty solution that makes them feel good or no solution, guess which one they will be picking? This year has been the biggest blue balls for voters of a President in American history. We started off so promising with energy and movement, executive orders and Democrats in disarray. Then we got Scam Blondi. Then we got bug-eyed patel. Then we got no Epstein list. Then we got foreign interventions on behalf of Israel. All the while, the people are suffering under a cost of living crisis. ZERO solutions have been proposed about this. The President has wasted this year chasing after his own tail in international politics while utterly neglecting domestic policy. Just like every Republican President since Eisenhower. Buy ammo and stock up on beans my friends. JD Vindaloo isn't going to be any better. permalink award report block reply DanIsSwell 1 points 1 day ago Yes, and who benefits off of higher taxes? The tax collectors themselves. They do whatever they want with it, and we have no benefit and no say. Anyone who’s really waking up wants NO taxes until we can fix this grifting system. The same low IQ liberals call for raising minimum wage, so the burden falls on businesses owners, who then go out of business. You’ll never hear them say the government should stop stealing so much of their pay checks, so they can keep the money they already earned. permalink award report block reply SurveilThis 1 points 1 day ago Taxing the rich has absolutely nothing to do with helping the poor. permalink award report block reply try4gain PRO 1 points 1 day ago rich people already pay HUGE sums of taxes.  way way more than the middle class or poor people.  and it's not even close (literally). permalink award report block reply MissileToad 1 points 1 day ago What we should be saying is \"love your neighbor\" as Jesus told us. And if our culture was more biblically literate people would know what that means. permalink award report block reply Now_On_to_Mars 1 points 1 day ago They didn't fold when the SNAP stopped permalink award report block reply Texar1991 1 points 1 day ago We should give the poor the GIFT of desperation: if you don’t work- you don’t eat. permalink award report block reply Chancho69 1 points 1 day ago Steal from the rich. Line the pockets of the politicians. Use the poor to stay in power. “Fuck\nThe Poor” permalink award report block reply no_antifa 1 points 1 day ago Lefties simultaneously do and don’t understand that the people they want to tax run world governments. They push for regulation and taxes that hinder their competition. permalink award report block reply Rock9Head 1 points 1 day ago “Fuck the doomed” is more accurate. permalink award report block reply bluewhiteandred 1 points 1 day ago I was realizing this is a big part of the left's opposition to AI, Redditors are mad they don't see a penny for their comments that get scraped while companies like OpenAI are worth billions (But I consider this to be a bit misguided as the AI models are open source so we do get the benefit of being able to use them to make $ if you so desire) permalink award report block reply Bilabrin 0 points 1 day ago I keep saying this about the abolitionists that started the Civil war. It wasn't altruism, it was jealousy. permalink award report block reply TrumpTrain2099 0 points 1 day ago Being rich is an anomaly. Poor is the “normal” state for humans, and it was for thousands of years for the vast majority of humans. Socialism/ Communism is the promise to the return to that state. permalink award report block reply spezi 0 points 1 day ago Billionaires have an obscene level of money though. You'd need to constantly purchse ridiculously decadant things to go broke. No man needs that much money. May as well make a balance patch. And how are you going to help the poor wothout funding? We live in civilization, not the jungle where it's everyone for themselves. We help those who are struggling. If they use society's help for drugs, cigs, or drinks, then suspend them from relief. permalink award report block reply Klaus73 0 points 1 day ago Import prices are up; admin talks about tariff cheques to the public. Admin is just taxing businesses in other ways and expanding the welfare state. permalink award report block reply Shinydenim 0 points 1 day ago Ugh gross too many words on a picture permalink award report block reply Deadpool OP 2 points 1 day ago I don’t make memes for retarded faggots who can’t read.  You liberal jizz moppers can cry all you want but no one cares permalink parent award report block reply Shinydenim 0 points 1 day ago Even worse…you’ve got sensitive little peen energy and think a million words on an unrelated picture is a meme. That part is the real travesty. You actually think that a meme is speaking your mind in an unstructured format. permalink parent award report block reply Deadpool OP 1 points 1 day ago You pinko commie faggots think your opinion matters here.  It doesn’t.  Go spread AIDS and monkey pox elsewhere faggot.   It is clear that you are triggered by this meme.  I know you cross dressing troons disappear 41% of the time, so feel free to disappear you cross dressing knob goblin. permalink parent award report block reply Shinydenim 0 points 1 day ago That’s pretty presumptuous. Memes are not pictures with words. There is a better way to craft permalink parent award report block reply view 17 more comments... flabbergast 0 points 1 day ago how is not taxing the rich helping the poor ? I think by now we can safely assume trickle down economics is bs. permalink award report block reply ShitFromShinola -1 points 1 day ago The government can only raise money via taxes and fees. So where are they supposed to get the money from? It's not like they are going to hold a bake sale. And they probably also say it because they realize that billionaires pay taxes at a lower rate than nurses and firefighters. permalink award report block reply\nMrTexan 45 points 1 day ago These type of politicians remind me of the what Judas said when the woman used the expensive perfume to anoint Jesus. John 12:5-6\n5“Why wasn’t this perfume sold for three hundred denarii and the money given to the poor?” 6 Judas did not say this because he cared about the poor, but because he was a thief. As keeper of the money bag, he used to take from what was put into it. permalink award report block reply conservativefrank 23 points 1 day ago \"Why wasn't it sold so I could steal the money?\" permalink parent award report block reply Deportthemall23 -2 points 1 day ago They don't love the poor they hate the rich They don't love gay people They just hate straight people They don't support women they just hate men They don't care about Mexicans They just hate white people They don't give a shit about Palestine they just hate Jews They don't care about trans people They just hate Americans permalink parent award report block reply Deadpool OP 16 points 1 day ago Exactly permalink parent award report block reply NADSAQ 8 points 1 day ago don’t mention he was jewish… don’t mention he was jewish… ah, shit permalink parent award report block reply 5DchessWatch 5 points 1 day ago btw, I looked into it.  Asian spikenard--the perfume you mentioned--is the essential oil of Nardostachys jatamansi. https://en.wikipedia.org/wiki/Nardostachys It is a source of a type of intensely aromatic amber-colored essential oil, spikenard. The oil has, since ancient times, been used as a perfume, as a traditional medicine, and in religious ceremonies. It is also called spikenard, nard, nardin, or muskroot.* This is also interesting.   The gospel, according to some bish name Qwen via Brave LEO LLM: Mary of Bethany used her own expensive perfume, likely a family heirloom worth a year’s wages. The objection came primarily from Judas Iscariot, who complained it should have been sold and given to the poor—but the Gospel of John clarifies he did not care about the poor, as he was a thief who stole from the disciples’ money bag (John 12:6). While some disciples also questioned the act (Matthew 26:8, Mark 14:4), Jesus defended Mary, calling it a “beautiful thing” and stating she had anointed him for his burial (Mark 14:6–8). He emphasized that her devotion was more important in that moment than even charitable giving. SO if \"Qwen\" is correct, then Christians throughout history are still getting on this poor woman's case based on the insistence of JUDAS Why the F do we care what Judas thinks? Forgive this Mary, and remember how she was a great Patriot to Jesus.  The best kind.  Using her family heirloom on him. She did it right permalink parent award report block reply 5DchessWatch 3 points 1 day ago Also, I obtained this essential oil before.  Tiny amount It was very terrible smelling permalink parent award report block reply iamherefortheluls 4 points 1 day ago besides that firs lesson, there is a second - in a society where everyone becomes so 'righteous' as to want to do that, that perfume becomes worthless. 'the poor' get no money in that one either. Desire for luxury is what drives people to work toward prosperity and is why today our poor live in what kings of old would see as luxury. permalink parent award report block reply load 2 more comments...\nconservativefrank 23 points 1 day ago \"Why wasn't it sold so I could steal the money?\" permalink parent award report block reply Deportthemall23 -2 points 1 day ago They don't love the poor they hate the rich They don't love gay people They just hate straight people They don't support women they just hate men They don't care about Mexicans They just hate white people They don't give a shit about Palestine they just hate Jews They don't care about trans people They just hate Americans permalink parent award report block reply\nDeportthemall23 -2 points 1 day ago They don't love the poor they hate the rich They don't love gay people They just hate straight people They don't support women they just hate men They don't care about Mexicans They just hate white people They don't give a shit about Palestine they just hate Jews They don't care about trans people They just hate Americans permalink parent award report block reply\nDeadpool OP 16 points 1 day ago Exactly permalink parent award report block reply\nNADSAQ 8 points 1 day ago don’t mention he was jewish… don’t mention he was jewish… ah, shit permalink parent award report block reply\n5DchessWatch 5 points 1 day ago btw, I looked into it.  Asian spikenard--the perfume you mentioned--is the essential oil of Nardostachys jatamansi. https://en.wikipedia.org/wiki/Nardostachys It is a source of a type of intensely aromatic amber-colored essential oil, spikenard. The oil has, since ancient times, been used as a perfume, as a traditional medicine, and in religious ceremonies. It is also called spikenard, nard, nardin, or muskroot.* This is also interesting.   The gospel, according to some bish name Qwen via Brave LEO LLM: Mary of Bethany used her own expensive perfume, likely a family heirloom worth a year’s wages. The objection came primarily from Judas Iscariot, who complained it should have been sold and given to the poor—but the Gospel of John clarifies he did not care about the poor, as he was a thief who stole from the disciples’ money bag (John 12:6). While some disciples also questioned the act (Matthew 26:8, Mark 14:4), Jesus defended Mary, calling it a “beautiful thing” and stating she had anointed him for his burial (Mark 14:6–8). He emphasized that her devotion was more important in that moment than even charitable giving. SO if \"Qwen\" is correct, then Christians throughout history are still getting on this poor woman's case based on the insistence of JUDAS Why the F do we care what Judas thinks? Forgive this Mary, and remember how she was a great Patriot to Jesus.  The best kind.  Using her family heirloom on him. She did it right permalink parent award report block reply 5DchessWatch 3 points 1 day ago Also, I obtained this essential oil before.  Tiny amount It was very terrible smelling permalink parent award report block reply\n5DchessWatch 3 points 1 day ago Also, I obtained this essential oil before.  Tiny amount It was very terrible smelling permalink parent award report block reply\niamherefortheluls 4 points 1 day ago besides that firs lesson, there is a second - in a society where everyone becomes so 'righteous' as to want to do that, that perfume becomes worthless. 'the poor' get no money in that one either. Desire for luxury is what drives people to work toward prosperity and is why today our poor live in what kings of old would see as luxury. permalink parent award report block reply\nTheTelltaleFly 26 points 1 day ago It’s worse. The progressive catchphrase is actually “eat the rich.” permalink award report block reply Hanging_Chad 17 points 1 day ago that’s Haiti’s motto permalink parent award report block reply Mortal_Wombat 7 points 1 day ago <BBQ has entered the chat> permalink parent award report block reply Meister_Bockmist 2 points 1 day ago Haitians are a CATastrophe for western values and cuisine. Spez: cousin is cusine for dumbos... permalink parent award report block reply Bullet3250 3 points 1 day ago Year after year after year.... Century after Century... An utter shithole - that makes other shitholes blush with envy. permalink parent award report block reply Mortal_Wombat 2 points 1 day ago *cuisine 😉 am former pro-chef permalink parent award report block reply view 1 more comments... Timbo1965 2 points 1 day ago <Biden's uncle runs> permalink parent award report block reply 5DchessWatch 3 points 1 day ago They eat the rich and the poor (cats, dogs).   Petco basically went out of business there.  Everyone thought it was a food court. permalink parent award report block reply Haiti_kid 2 points 1 day ago Yes.  It is. permalink parent award report block reply Hanging_Chad 1 points 23 hours ago kek permalink parent award report block reply airborne3502 2 points 1 day ago \"Eat the Rich\" is a better than average Aerosmith song. permalink parent award report block reply booblitchutz 3 points 1 day ago “Kill the Poor” is a really good Dead Kennedys song. permalink parent award report block reply zooty 2 points 1 day ago Also a Motorhead song (with no connection) but I'd say below average in their case. It was written for a film of the same name which was very below average. permalink parent award report block reply\nHanging_Chad 17 points 1 day ago that’s Haiti’s motto permalink parent award report block reply Mortal_Wombat 7 points 1 day ago <BBQ has entered the chat> permalink parent award report block reply Meister_Bockmist 2 points 1 day ago Haitians are a CATastrophe for western values and cuisine. Spez: cousin is cusine for dumbos... permalink parent award report block reply Bullet3250 3 points 1 day ago Year after year after year.... Century after Century... An utter shithole - that makes other shitholes blush with envy. permalink parent award report block reply Mortal_Wombat 2 points 1 day ago *cuisine 😉 am former pro-chef permalink parent award report block reply view 1 more comments... Timbo1965 2 points 1 day ago <Biden's uncle runs> permalink parent award report block reply 5DchessWatch 3 points 1 day ago They eat the rich and the poor (cats, dogs).   Petco basically went out of business there.  Everyone thought it was a food court. permalink parent award report block reply Haiti_kid 2 points 1 day ago Yes.  It is. permalink parent award report block reply Hanging_Chad 1 points 23 hours ago kek permalink parent award report block reply\nMortal_Wombat 7 points 1 day ago <BBQ has entered the chat> permalink parent award report block reply Meister_Bockmist 2 points 1 day ago Haitians are a CATastrophe for western values and cuisine. Spez: cousin is cusine for dumbos... permalink parent award report block reply Bullet3250 3 points 1 day ago Year after year after year.... Century after Century... An utter shithole - that makes other shitholes blush with envy. permalink parent award report block reply Mortal_Wombat 2 points 1 day ago *cuisine 😉 am former pro-chef permalink parent award report block reply view 1 more comments... Timbo1965 2 points 1 day ago <Biden's uncle runs> permalink parent award report block reply\nMeister_Bockmist 2 points 1 day ago Haitians are a CATastrophe for western values and cuisine. Spez: cousin is cusine for dumbos... permalink parent award report block reply Bullet3250 3 points 1 day ago Year after year after year.... Century after Century... An utter shithole - that makes other shitholes blush with envy. permalink parent award report block reply Mortal_Wombat 2 points 1 day ago *cuisine 😉 am former pro-chef permalink parent award report block reply view 1 more comments...\nBullet3250 3 points 1 day ago Year after year after year.... Century after Century... An utter shithole - that makes other shitholes blush with envy. permalink parent award report block reply\nMortal_Wombat 2 points 1 day ago *cuisine 😉 am former pro-chef permalink parent award report block reply view 1 more comments...\nTimbo1965 2 points 1 day ago <Biden's uncle runs> permalink parent award report block reply\n5DchessWatch 3 points 1 day ago They eat the rich and the poor (cats, dogs).   Petco basically went out of business there.  Everyone thought it was a food court. permalink parent award report block reply\nHaiti_kid 2 points 1 day ago Yes.  It is. permalink parent award report block reply Hanging_Chad 1 points 23 hours ago kek permalink parent award report block reply\nHanging_Chad 1 points 23 hours ago kek permalink parent award report block reply\nairborne3502 2 points 1 day ago \"Eat the Rich\" is a better than average Aerosmith song. permalink parent award report block reply booblitchutz 3 points 1 day ago “Kill the Poor” is a really good Dead Kennedys song. permalink parent award report block reply zooty 2 points 1 day ago Also a Motorhead song (with no connection) but I'd say below average in their case. It was written for a film of the same name which was very below average. permalink parent award report block reply\nbooblitchutz 3 points 1 day ago “Kill the Poor” is a really good Dead Kennedys song. permalink parent award report block reply\nzooty 2 points 1 day ago Also a Motorhead song (with no connection) but I'd say below average in their case. It was written for a film of the same name which was very below average. permalink parent award report block reply\nJanOctSept 17 points 1 day ago “Tax the rich! So we can take those tax dollars and funnel them through NGO’s, which then go into the pockets of wealthy democrats and billionaires!” permalink award report block reply zooty 3 points 1 day ago Dollars which were otherwise invested in the economy and being far more productive than anything the government can do with them. permalink parent award report block reply\nzooty 3 points 1 day ago Dollars which were otherwise invested in the economy and being far more productive than anything the government can do with them. permalink parent award report block reply\nPurple_Drank 9 points 1 day ago I need a thesaurus for this meme permalink award report block reply CommieCucker 16 points 1 day ago \"performative altruism\" = \"virtue signaling\" permalink parent award report block reply Deadpool OP 13 points 1 day ago I see the public school system is continuing to fail permalink parent award report block reply guywholikesDjtof2024 7 points 1 day ago It teaches contra-Biblical worldviews. That is why. permalink parent award report block reply Purple_Drank 3 points 1 day ago yes.  yes it is..... permalink parent award report block reply Aquamine-Amarine 2 points 1 day ago By design. permalink parent award report block reply guywholikesDjtof2024 4 points 1 day ago I bet the 19A did exactly zero to slow the fail rate! permalink parent award report block reply NADSAQ 2 points 1 day ago i find the whole thing shallow and pedantic permalink parent award report block reply\nCommieCucker 16 points 1 day ago \"performative altruism\" = \"virtue signaling\" permalink parent award report block reply\nDeadpool OP 13 points 1 day ago I see the public school system is continuing to fail permalink parent award report block reply guywholikesDjtof2024 7 points 1 day ago It teaches contra-Biblical worldviews. That is why. permalink parent award report block reply Purple_Drank 3 points 1 day ago yes.  yes it is..... permalink parent award report block reply Aquamine-Amarine 2 points 1 day ago By design. permalink parent award report block reply guywholikesDjtof2024 4 points 1 day ago I bet the 19A did exactly zero to slow the fail rate! permalink parent award report block reply\nguywholikesDjtof2024 7 points 1 day ago It teaches contra-Biblical worldviews. That is why. permalink parent award report block reply\nPurple_Drank 3 points 1 day ago yes.  yes it is..... permalink parent award report block reply\nAquamine-Amarine 2 points 1 day ago By design. permalink parent award report block reply guywholikesDjtof2024 4 points 1 day ago I bet the 19A did exactly zero to slow the fail rate! permalink parent award report block reply\nguywholikesDjtof2024 4 points 1 day ago I bet the 19A did exactly zero to slow the fail rate! permalink parent award report block reply\nNADSAQ 2 points 1 day ago i find the whole thing shallow and pedantic permalink parent award report block reply\nfazaman 6 points 1 day ago That's because \"tax the rich\" is a specific thing that's hard to misinterpret. \"Help the poor\" could be interpreted in ways that they wouldn't like. Taxing the rich won't really help the poor. Reducing government regulations likely would, but they don't want that. They want a totalitarian government, and taxing the rich disproportionately is a step in hat direction. permalink award report block reply booblitchutz 5 points 1 day ago “Help the poor” tries to help poor white people in Appalachia “NOOOO NOT THOSE POOR!!!” permalink parent award report block reply\nbooblitchutz 5 points 1 day ago “Help the poor” tries to help poor white people in Appalachia “NOOOO NOT THOSE POOR!!!” permalink parent award report block reply\nDev404 5 points 1 day ago Socialists/communists are what they've always been - losers who want to partake in the winnings without putting in the effort. They scream it's on behalf of the \"poor\" while they enrich themselves to become champagne socialists. AOC and Bernie Sanders come to mind, how many poor people have they helped while they, themselves, became multimillionaires who aren't remotely interested in redistributing their own ill-gained wealth? That's the scam of socialism, to con people by using their feelings. permalink award report block reply\nPillarOfWisdom 4 points 1 day ago They'd make more inroads with Christians if they focused on helping the poor instead of their revenge mentality. permalink award report block reply booblitchutz 3 points 1 day ago They don’t give a wet shit about Christians. permalink parent award report block reply zooty 3 points 1 day ago Other human beings are only a means to political power. permalink parent award report block reply\nbooblitchutz 3 points 1 day ago They don’t give a wet shit about Christians. permalink parent award report block reply zooty 3 points 1 day ago Other human beings are only a means to political power. permalink parent award report block reply\nzooty 3 points 1 day ago Other human beings are only a means to political power. permalink parent award report block reply\nAlred 4 points 1 day ago All the EV and solar credits helped the poor only. hahahaha permalink award report block reply\nSavingPrivateGrace 3 points 1 day ago Grifters.  The progressives figure out how they can get every piece of the pie, and the more they are in politics, some a lifetime, the more they take and take.  Again and again, term limits would keep their dirty hands away from our tax dollars.  Progressives got so powerful stealing from the rich to give to the poor, they are 'the rich'. permalink award report block reply\nTophat9000 3 points 1 day ago There's more truth in this than people realize permalink award report block reply\nA_Little_White_Duck 3 points 1 day ago I always wondered why the lyrics for Ten Years After's song \"I'd Love to Change the World\": Tax the rich\nFeed the poor\nTil there are no\nRich no more Didn't have the more charitable \"Til there are no poor no more\" 55 years of me thinking many charitable-minded intentions were just envy. permalink award report block reply Texar1991 1 points 1 day ago It even rhymes better!!! permalink parent award report block reply\nTexar1991 1 points 1 day ago It even rhymes better!!! permalink parent award report block reply\nCovfefebrulee 3 points 1 day ago also known as Evil. permalink award report block reply\nimwithhair 2 points 1 day ago If you pay further attention you will see that it is millionaire democrats screaming “tax the rich” and “billionaires should not exist”. It’s ok to be a millionaire rich hypocrite asshole but not a billionaire in liberal clowntown. permalink award report block reply booblitchutz 1 points 1 day ago Ah but it most certainly IS okay to be a billionaire, provided you have the right opinions! permalink parent award report block reply\nbooblitchutz 1 points 1 day ago Ah but it most certainly IS okay to be a billionaire, provided you have the right opinions! permalink parent award report block reply\n5DchessWatch 2 points 1 day ago All taxes should go away except for sales tax and it should never ever be higher than 25% and it should apply equally to ALL sale items.  12.5% goes to the state in which the item or service is sold, 12.5% goes to federal.   Federal obligations to state, therefore, should only be supplemental. People should be allowed to give more taxes voluntarily.  25% is the minimum.  And the additional amount should be voluntarily recorded in a kind of public leaderboard, so people can prove they gave to charity, if they want to.  But they don't have to.  It can be recorded with or without your name.  You could record it anonymously in such a way that you could prove it in court (unseal the name) if you ever have to. permalink award report block reply 5DchessWatch 1 points 1 day ago So for example, if you're a p diddy and you are in court, and you're a multi millionaire rich guy having orgies and such but you gave tremendously to the public for the public good, they might (\"ought to\"--I would) consider this in any punishments. permalink parent award report block reply\n5DchessWatch 1 points 1 day ago So for example, if you're a p diddy and you are in court, and you're a multi millionaire rich guy having orgies and such but you gave tremendously to the public for the public good, they might (\"ought to\"--I would) consider this in any punishments. permalink parent award report block reply\nGhostOfTheRepublic 2 points 1 day ago 100% permalink award report block reply\nFerretman 2 points 1 day ago Accurate. permalink award report block reply\nbehemoth887 2 points 1 day ago tax the rich by passing investment focused taxes that can be easily dodged by the rich but not dodged by the middle class permalink award report block reply\nMungo 2 points 1 day ago Exactly permalink award report block reply\nblitzstrasse 2 points 1 day ago That's God's own truth. permalink award report block reply\nAnother_rando 2 points 1 day ago It also assumes that taxes go back to the government and then the people. But we all know the mass corruption doesn't allow that permalink award report block reply\nRhodesianRidgeback 2 points 1 day ago The catchphrase is \"Eat The Rich\" permalink award report block reply\nRockmanneo 1 points 21 hours ago Being a facade while walking on eggshells is what they do best. permalink award report block reply\nLiberats 1 points 1 day ago \"The altruism\" is used to buy their votes. permalink award report block reply\nYodaBannon 1 points 1 day ago these retards should want smaller government and less taxes, maybe they will come around to that once they complete a full thought permalink award report block reply\nTrumpwon306 1 points 1 day ago Hey--I totally agree with this and I'm morally and intellectually developed enough to recognize that \"Tax the Rich\" is a self-serving slogan designed to exploit envy, resentment and economic anxiety amongst the bottom 90% of the American public. So what? Recognizing this doesn't do anything substantive for us. While this administration and the Republican party continues to give Israel blowjobs and paying them for the trouble, the American people are in a cost of living crisis. Things are not getting better. Every day, week, month and year that we continue running a gargantuan budgetary deficit means every single American is taxed via inflation. We have had ZERO solutions to this issue. Not only that, but the Trump administration has been made to look totally ineffective and weak as a result of the government shutdown. A MINORITY PARTY shut down the government. The fact that everyone here knows the filibuster won't be removed by republicans despite President Trump's tweets is sad and pathetic. It's illustrative of how utterly weak and useless elected Republicans are. It demoralizes the base, and will be part of the reason 2026 is going to be an even worse wipeout than 2018. The base is at the end of its rope. The American people are at the end of their rope. Between a politician offering a shitty solution that makes them feel good or no solution, guess which one they will be picking? This year has been the biggest blue balls for voters of a President in American history. We started off so promising with energy and movement, executive orders and Democrats in disarray. Then we got Scam Blondi. Then we got bug-eyed patel. Then we got no Epstein list. Then we got foreign interventions on behalf of Israel. All the while, the people are suffering under a cost of living crisis. ZERO solutions have been proposed about this. The President has wasted this year chasing after his own tail in international politics while utterly neglecting domestic policy. Just like every Republican President since Eisenhower. Buy ammo and stock up on beans my friends. JD Vindaloo isn't going to be any better. permalink award report block reply\nDanIsSwell 1 points 1 day ago Yes, and who benefits off of higher taxes? The tax collectors themselves. They do whatever they want with it, and we have no benefit and no say. Anyone who’s really waking up wants NO taxes until we can fix this grifting system. The same low IQ liberals call for raising minimum wage, so the burden falls on businesses owners, who then go out of business. You’ll never hear them say the government should stop stealing so much of their pay checks, so they can keep the money they already earned. permalink award report block reply\nSurveilThis 1 points 1 day ago Taxing the rich has absolutely nothing to do with helping the poor. permalink award report block reply\ntry4gain PRO 1 points 1 day ago rich people already pay HUGE sums of taxes.  way way more than the middle class or poor people.  and it's not even close (literally). permalink award report block reply\nMissileToad 1 points 1 day ago What we should be saying is \"love your neighbor\" as Jesus told us. And if our culture was more biblically literate people would know what that means. permalink award report block reply\nNow_On_to_Mars 1 points 1 day ago They didn't fold when the SNAP stopped permalink award report block reply\nTexar1991 1 points 1 day ago We should give the poor the GIFT of desperation: if you don’t work- you don’t eat. permalink award report block reply\nChancho69 1 points 1 day ago Steal from the rich. Line the pockets of the politicians. Use the poor to stay in power. “Fuck\nThe Poor” permalink award report block reply\nno_antifa 1 points 1 day ago Lefties simultaneously do and don’t understand that the people they want to tax run world governments. They push for regulation and taxes that hinder their competition. permalink award report block reply\nRock9Head 1 points 1 day ago “Fuck the doomed” is more accurate. permalink award report block reply\nbluewhiteandred 1 points 1 day ago I was realizing this is a big part of the left's opposition to AI, Redditors are mad they don't see a penny for their comments that get scraped while companies like OpenAI are worth billions (But I consider this to be a bit misguided as the AI models are open source so we do get the benefit of being able to use them to make $ if you so desire) permalink award report block reply\nBilabrin 0 points 1 day ago I keep saying this about the abolitionists that started the Civil war. It wasn't altruism, it was jealousy. permalink award report block reply\nTrumpTrain2099 0 points 1 day ago Being rich is an anomaly. Poor is the “normal” state for humans, and it was for thousands of years for the vast majority of humans. Socialism/ Communism is the promise to the return to that state. permalink award report block reply\nspezi 0 points 1 day ago Billionaires have an obscene level of money though. You'd need to constantly purchse ridiculously decadant things to go broke. No man needs that much money. May as well make a balance patch. And how are you going to help the poor wothout funding? We live in civilization, not the jungle where it's everyone for themselves. We help those who are struggling. If they use society's help for drugs, cigs, or drinks, then suspend them from relief. permalink award report block reply\nKlaus73 0 points 1 day ago Import prices are up; admin talks about tariff cheques to the public. Admin is just taxing businesses in other ways and expanding the welfare state. permalink award report block reply\nShinydenim 0 points 1 day ago Ugh gross too many words on a picture permalink award report block reply Deadpool OP 2 points 1 day ago I don’t make memes for retarded faggots who can’t read.  You liberal jizz moppers can cry all you want but no one cares permalink parent award report block reply Shinydenim 0 points 1 day ago Even worse…you’ve got sensitive little peen energy and think a million words on an unrelated picture is a meme. That part is the real travesty. You actually think that a meme is speaking your mind in an unstructured format. permalink parent award report block reply Deadpool OP 1 points 1 day ago You pinko commie faggots think your opinion matters here.  It doesn’t.  Go spread AIDS and monkey pox elsewhere faggot.   It is clear that you are triggered by this meme.  I know you cross dressing troons disappear 41% of the time, so feel free to disappear you cross dressing knob goblin. permalink parent award report block reply Shinydenim 0 points 1 day ago That’s pretty presumptuous. Memes are not pictures with words. There is a better way to craft permalink parent award report block reply view 17 more comments...\nDeadpool OP 2 points 1 day ago I don’t make memes for retarded faggots who can’t read.  You liberal jizz moppers can cry all you want but no one cares permalink parent award report block reply Shinydenim 0 points 1 day ago Even worse…you’ve got sensitive little peen energy and think a million words on an unrelated picture is a meme. That part is the real travesty. You actually think that a meme is speaking your mind in an unstructured format. permalink parent award report block reply Deadpool OP 1 points 1 day ago You pinko commie faggots think your opinion matters here.  It doesn’t.  Go spread AIDS and monkey pox elsewhere faggot.   It is clear that you are triggered by this meme.  I know you cross dressing troons disappear 41% of the time, so feel free to disappear you cross dressing knob goblin. permalink parent award report block reply Shinydenim 0 points 1 day ago That’s pretty presumptuous. Memes are not pictures with words. There is a better way to craft permalink parent award report block reply view 17 more comments...\nShinydenim 0 points 1 day ago Even worse…you’ve got sensitive little peen energy and think a million words on an unrelated picture is a meme. That part is the real travesty. You actually think that a meme is speaking your mind in an unstructured format. permalink parent award report block reply Deadpool OP 1 points 1 day ago You pinko commie faggots think your opinion matters here.  It doesn’t.  Go spread AIDS and monkey pox elsewhere faggot.   It is clear that you are triggered by this meme.  I know you cross dressing troons disappear 41% of the time, so feel free to disappear you cross dressing knob goblin. permalink parent award report block reply Shinydenim 0 points 1 day ago That’s pretty presumptuous. Memes are not pictures with words. There is a better way to craft permalink parent award report block reply view 17 more comments...\nDeadpool OP 1 points 1 day ago You pinko commie faggots think your opinion matters here.  It doesn’t.  Go spread AIDS and monkey pox elsewhere faggot.   It is clear that you are triggered by this meme.  I know you cross dressing troons disappear 41% of the time, so feel free to disappear you cross dressing knob goblin. permalink parent award report block reply Shinydenim 0 points 1 day ago That’s pretty presumptuous. Memes are not pictures with words. There is a better way to craft permalink parent award report block reply view 17 more comments...\nShinydenim 0 points 1 day ago That’s pretty presumptuous. Memes are not pictures with words. There is a better way to craft permalink parent award report block reply view 17 more comments...\nflabbergast 0 points 1 day ago how is not taxing the rich helping the poor ? I think by now we can safely assume trickle down economics is bs. permalink award report block reply\nShitFromShinola -1 points 1 day ago The government can only raise money via taxes and fees. So where are they supposed to get the money from? It's not like they are going to hold a bake sale. And they probably also say it because they realize that billionaires pay taxes at a lower rate than nurses and firefighters. permalink award report block reply"}