{"id": "1ARK56ijyN", "contents": "585 Mods are hard to please. posted 5 days ago by Th3Cho0sing0ne 21 comments award share download report block\n21 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Double_D 29 points 5 days ago You have to know their mating call to catch a mod. Just post a Gateway pundit article that’s already been posted 5 times today and it’ll be stickied within minutes… permalink award report block reply Deplora 13 points 5 days ago Only if it's posted by that GatewaySpamdit bot. permalink parent award report block reply War_Hamster 7 points 5 days ago I wish this wasn’t so freakin true. I actually like the mods here, but it really has become Gateway Pundit Central. And there’s a lot of cool stuff posted from elsewhere that deserves stickies. permalink parent award report block reply RuprechtThaMonkeyBoy 1 points 5 days ago Don’t get your milkers in a knot Double D. permalink parent award report block reply TooTrue-translation 0 points 5 days ago Comment removed by community moderators. permalink parent award report block reply Patrick_Bateman 11 points 5 days ago Yes. I truly can't wait for the next Nick Sortor sticky. BREAKING! permalink award report block reply Th3Cho0sing0ne OP 6 points 5 days ago 10 things you NEED TO KNOW about this MEME!⚠️ permalink parent award report block reply I-am-Orlando PRO 10 points 5 days ago The perfect meme from the last 5 hours has arrived. permalink award report block reply Th3Cho0sing0ne OP 9 points 5 days ago You inspired it, Sir.  fr permalink parent award report block reply schnazzmizzle 9 points 5 days ago So they sticky post about themselves..  smh. permalink award report block reply Whenagain 4 points 5 days ago At least it's some self-defecating humor. permalink parent award report block reply Th3Cho0sing0ne OP 7 points 5 days ago Love you, Mods. ❤️ permalink award report block reply YodaBannon 5 points 5 days ago Hillary Clitton nazi salutes are back permalink award report block reply TooTrue-translation 4 points 5 days ago There used to be a Hillary Duff is a Nazi meme on the ol internet permalink parent award report block reply MinneMAGA 4 points 5 days ago Sorry, best they can do is another screenshot of a tweet that may or may not be real from i-am-orlando permalink award report block reply Skogin 3 points 5 days ago Sticky Icky, my fren. permalink award report block reply OMC-RADIO 1 points 5 days ago There are 5 user accounts that get 99% of all stickies. What does that really mean is happening here? permalink award report block reply Whenagain 2 points 5 days ago have you not noticed what those 5 users do better than the other 99% ? permalink parent award report block reply OMC-RADIO 1 points 4 days ago Yeah I have.  They simply repost the same thing other users have and it magically becomes stickied. 5 users.  Watch it for a few days.  It ain’t a mystery. permalink parent award report block reply Whenagain 2 points 4 days ago I've been watching it for almost a decade. You're still missing it. permalink parent award report block reply Givesgunstogrannies 1 points 5 days ago Comment removed by community filter. permalink award report block reply\nDouble_D 29 points 5 days ago You have to know their mating call to catch a mod. Just post a Gateway pundit article that’s already been posted 5 times today and it’ll be stickied within minutes… permalink award report block reply Deplora 13 points 5 days ago Only if it's posted by that GatewaySpamdit bot. permalink parent award report block reply War_Hamster 7 points 5 days ago I wish this wasn’t so freakin true. I actually like the mods here, but it really has become Gateway Pundit Central. And there’s a lot of cool stuff posted from elsewhere that deserves stickies. permalink parent award report block reply RuprechtThaMonkeyBoy 1 points 5 days ago Don’t get your milkers in a knot Double D. permalink parent award report block reply TooTrue-translation 0 points 5 days ago Comment removed by community moderators. permalink parent award report block reply\nDeplora 13 points 5 days ago Only if it's posted by that GatewaySpamdit bot. permalink parent award report block reply\nWar_Hamster 7 points 5 days ago I wish this wasn’t so freakin true. I actually like the mods here, but it really has become Gateway Pundit Central. And there’s a lot of cool stuff posted from elsewhere that deserves stickies. permalink parent award report block reply\nRuprechtThaMonkeyBoy 1 points 5 days ago Don’t get your milkers in a knot Double D. permalink parent award report block reply\nTooTrue-translation 0 points 5 days ago Comment removed by community moderators. permalink parent award report block reply\nPatrick_Bateman 11 points 5 days ago Yes. I truly can't wait for the next Nick Sortor sticky. BREAKING! permalink award report block reply Th3Cho0sing0ne OP 6 points 5 days ago 10 things you NEED TO KNOW about this MEME!⚠️ permalink parent award report block reply\nTh3Cho0sing0ne OP 6 points 5 days ago 10 things you NEED TO KNOW about this MEME!⚠️ permalink parent award report block reply\nI-am-Orlando PRO 10 points 5 days ago The perfect meme from the last 5 hours has arrived. permalink award report block reply Th3Cho0sing0ne OP 9 points 5 days ago You inspired it, Sir.  fr permalink parent award report block reply\nTh3Cho0sing0ne OP 9 points 5 days ago You inspired it, Sir.  fr permalink parent award report block reply\nschnazzmizzle 9 points 5 days ago So they sticky post about themselves..  smh. permalink award report block reply Whenagain 4 points 5 days ago At least it's some self-defecating humor. permalink parent award report block reply\nWhenagain 4 points 5 days ago At least it's some self-defecating humor. permalink parent award report block reply\nTh3Cho0sing0ne OP 7 points 5 days ago Love you, Mods. ❤️ permalink award report block reply\nYodaBannon 5 points 5 days ago Hillary Clitton nazi salutes are back permalink award report block reply TooTrue-translation 4 points 5 days ago There used to be a Hillary Duff is a Nazi meme on the ol internet permalink parent award report block reply\nTooTrue-translation 4 points 5 days ago There used to be a Hillary Duff is a Nazi meme on the ol internet permalink parent award report block reply\nMinneMAGA 4 points 5 days ago Sorry, best they can do is another screenshot of a tweet that may or may not be real from i-am-orlando permalink award report block reply\nSkogin 3 points 5 days ago Sticky Icky, my fren. permalink award report block reply\nOMC-RADIO 1 points 5 days ago There are 5 user accounts that get 99% of all stickies. What does that really mean is happening here? permalink award report block reply Whenagain 2 points 5 days ago have you not noticed what those 5 users do better than the other 99% ? permalink parent award report block reply OMC-RADIO 1 points 4 days ago Yeah I have.  They simply repost the same thing other users have and it magically becomes stickied. 5 users.  Watch it for a few days.  It ain’t a mystery. permalink parent award report block reply Whenagain 2 points 4 days ago I've been watching it for almost a decade. You're still missing it. permalink parent award report block reply\nWhenagain 2 points 5 days ago have you not noticed what those 5 users do better than the other 99% ? permalink parent award report block reply OMC-RADIO 1 points 4 days ago Yeah I have.  They simply repost the same thing other users have and it magically becomes stickied. 5 users.  Watch it for a few days.  It ain’t a mystery. permalink parent award report block reply Whenagain 2 points 4 days ago I've been watching it for almost a decade. You're still missing it. permalink parent award report block reply\nOMC-RADIO 1 points 4 days ago Yeah I have.  They simply repost the same thing other users have and it magically becomes stickied. 5 users.  Watch it for a few days.  It ain’t a mystery. permalink parent award report block reply Whenagain 2 points 4 days ago I've been watching it for almost a decade. You're still missing it. permalink parent award report block reply\nWhenagain 2 points 4 days ago I've been watching it for almost a decade. You're still missing it. permalink parent award report block reply\nGivesgunstogrannies 1 points 5 days ago Comment removed by community filter. permalink award report block reply"}