{"id": "1ARK9nNhv3", "contents": "80 Anyone else feel like nothing is being accomplished or followed thru? posted 10 hours ago by UH60MAGA 27 comments award share report block So far just feel like we have more setbacks than any gains. -Antifa declared domestic terrorist yet no arrests -Deportations are going slow and not at a pace that is noticeable. -Bringing in H1B people instead of helping citizens/pushing trade schools -600k Chinese students? Was this something from the talks with winnie the pooh last week? -Whatever happened to those talks of the Doge check talks? Or the audit of Fort Knox? -no arrests of the deep state for their roles in J6 Sure we have had some wins, but they have felt minor when the big stuff people voted for seems to have been backburnered or ignored. Did the deep state get to Trump? Or is he making the same mistake as last term and surronding himself with people who are sabotaging him?\n27 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno SHILL_DETECTOR 10 points 10 hours ago i dont think he has the guts to do what needs to be done permalink award report block reply Be_The_Change 2 points 10 hours ago Comment removed by community moderators. permalink parent award report block reply hilboggins 7 points 9 hours ago Almost feels like they replaced trump with a reptilian clone permalink award report block reply PresElectKekPede 7 points 9 hours ago Trump is a living paradox in that he cares so much about what people think of him that he ran for President but that same obsession is preventing him from doing the things that made us vote for him. permalink award report block reply BannedAccount 5 points 8 hours ago His ego and legacy are more important to him than the American people with the irony being that actually helping Americans would hand him the legacy of being the greatest American in our history on par with the likes of George Washington. permalink parent award report block reply PresElectKekPede 1 points 6 hours ago I fully agree. permalink parent award report block reply DarthEP 3 points 9 hours ago Weird. permalink parent award report block reply someguy7738 6 points 9 hours ago And absolutely nothing done about election fraud, at all. We're fucking cooked. permalink award report block reply SCHULTZ 1 points 8 hours ago Comment removed by community moderators. permalink parent award report block reply 19American62Woman 6 points 9 hours ago I’m frustrated with so much evidence and zero follow through. Bondi has been a disappointment for me. permalink award report block reply SilentSniper 6 points 9 hours ago So far it has been disappointing.\nThe recent elections tell what’s in store if the republicans don’t start chopping fucking heads off. permalink award report block reply MewThat 5 points 8 hours ago It started out great the first few months.  Then it started to go south with Bongino/Kash saying there's no there there.  then Trump saying Epstein is a hoax?  Then RFK saying we'd know about autism in September and we get Tylenol thrown under the bus.  (I believe it, but no mention on vax's).  Then Trump loving up to Bibi.  And Bondi is terrible.  I saw these things and thought I'd give them more time, because of 4d chess, etc..  The clock is ticking though.  Accountability has gotta hit soon or the mid-terms are f'd and the window will be forever gone. permalink award report block reply MewThat 4 points 8 hours ago And hero Tina Peters is still in jail. permalink parent award report block reply E-dantes 5 points 10 hours ago The reason they didn't audit fort Knox is because there's nothing there. Letting that out would crash the system. The illusion of a financially sound money system. permalink award report block reply Cakes4077 7 points 9 hours ago End the Fed permalink parent award report block reply someguy7738 4 points 9 hours ago You'd have to have a room temp IQ to actually believe there's anything sound about \"our\" financial system. permalink parent award report block reply E-dantes 4 points 9 hours ago You just described the average voter. permalink parent award report block reply someguy7738 3 points 9 hours ago Fair enough lol. permalink parent award report block reply SHILL_DETECTOR 2 points 10 hours ago so where did all the gold we stole from iraq and libya and such go??? permalink parent award report block reply Thomm 6 points 10 hours ago Israel permalink parent award report block reply E-dantes 3 points 9 hours ago Probably to Canada, and e.u. to pay for their free healthcare. Why does every country on the planet owe some other country a financial debt? You would think there would be at least one country breaking even due to debts being equalized. permalink parent award report block reply DarthEP 4 points 9 hours ago There Is, But We're NOT Allowed To Discuss It. permalink parent award report block reply Zeleskys_WH_Clothing 4 points 8 hours ago This is what happens when you need billions of dollars to get anything accomplished and only the billionaire have that kind of money. The government yields to Money, plain and simple anyone telling you otherwise is full of horseshit. You cannot elect a politician wit out billions of dollars being spent on their campaign. Therefore they are all OWNED by the people who PAID to put them in office.  This has been happening for many, many years. Trump isn't changing shit and it's a damned shame to be honest. permalink award report block reply WI-Patriot 3 points 7 hours ago Trump's agenda is running up against deep state realities. permalink award report block reply DarthEP 2 points 9 hours ago Absolutely Everything Must Go According To Plan. permalink award report block reply Callsign_Fox1 2 points 10 hours ago Its not all bad. We are about to attack Venezuela and oust Maduro in a regime change op, that's pretty cool. permalink award report block reply breezily 2 points 9 hours ago some Rs said some things that you liked, smh. permalink award report block reply SCHULTZ 1 points 8 hours ago Comment removed by community moderators. permalink award report block reply\nSHILL_DETECTOR 10 points 10 hours ago i dont think he has the guts to do what needs to be done permalink award report block reply Be_The_Change 2 points 10 hours ago Comment removed by community moderators. permalink parent award report block reply\nBe_The_Change 2 points 10 hours ago Comment removed by community moderators. permalink parent award report block reply\nhilboggins 7 points 9 hours ago Almost feels like they replaced trump with a reptilian clone permalink award report block reply\nPresElectKekPede 7 points 9 hours ago Trump is a living paradox in that he cares so much about what people think of him that he ran for President but that same obsession is preventing him from doing the things that made us vote for him. permalink award report block reply BannedAccount 5 points 8 hours ago His ego and legacy are more important to him than the American people with the irony being that actually helping Americans would hand him the legacy of being the greatest American in our history on par with the likes of George Washington. permalink parent award report block reply PresElectKekPede 1 points 6 hours ago I fully agree. permalink parent award report block reply DarthEP 3 points 9 hours ago Weird. permalink parent award report block reply\nBannedAccount 5 points 8 hours ago His ego and legacy are more important to him than the American people with the irony being that actually helping Americans would hand him the legacy of being the greatest American in our history on par with the likes of George Washington. permalink parent award report block reply PresElectKekPede 1 points 6 hours ago I fully agree. permalink parent award report block reply\nPresElectKekPede 1 points 6 hours ago I fully agree. permalink parent award report block reply\nDarthEP 3 points 9 hours ago Weird. permalink parent award report block reply\nsomeguy7738 6 points 9 hours ago And absolutely nothing done about election fraud, at all. We're fucking cooked. permalink award report block reply SCHULTZ 1 points 8 hours ago Comment removed by community moderators. permalink parent award report block reply\nSCHULTZ 1 points 8 hours ago Comment removed by community moderators. permalink parent award report block reply\n19American62Woman 6 points 9 hours ago I’m frustrated with so much evidence and zero follow through. Bondi has been a disappointment for me. permalink award report block reply\nSilentSniper 6 points 9 hours ago So far it has been disappointing.\nThe recent elections tell what’s in store if the republicans don’t start chopping fucking heads off. permalink award report block reply\nMewThat 5 points 8 hours ago It started out great the first few months.  Then it started to go south with Bongino/Kash saying there's no there there.  then Trump saying Epstein is a hoax?  Then RFK saying we'd know about autism in September and we get Tylenol thrown under the bus.  (I believe it, but no mention on vax's).  Then Trump loving up to Bibi.  And Bondi is terrible.  I saw these things and thought I'd give them more time, because of 4d chess, etc..  The clock is ticking though.  Accountability has gotta hit soon or the mid-terms are f'd and the window will be forever gone. permalink award report block reply MewThat 4 points 8 hours ago And hero Tina Peters is still in jail. permalink parent award report block reply\nMewThat 4 points 8 hours ago And hero Tina Peters is still in jail. permalink parent award report block reply\nE-dantes 5 points 10 hours ago The reason they didn't audit fort Knox is because there's nothing there. Letting that out would crash the system. The illusion of a financially sound money system. permalink award report block reply Cakes4077 7 points 9 hours ago End the Fed permalink parent award report block reply someguy7738 4 points 9 hours ago You'd have to have a room temp IQ to actually believe there's anything sound about \"our\" financial system. permalink parent award report block reply E-dantes 4 points 9 hours ago You just described the average voter. permalink parent award report block reply someguy7738 3 points 9 hours ago Fair enough lol. permalink parent award report block reply SHILL_DETECTOR 2 points 10 hours ago so where did all the gold we stole from iraq and libya and such go??? permalink parent award report block reply Thomm 6 points 10 hours ago Israel permalink parent award report block reply E-dantes 3 points 9 hours ago Probably to Canada, and e.u. to pay for their free healthcare. Why does every country on the planet owe some other country a financial debt? You would think there would be at least one country breaking even due to debts being equalized. permalink parent award report block reply DarthEP 4 points 9 hours ago There Is, But We're NOT Allowed To Discuss It. permalink parent award report block reply\nCakes4077 7 points 9 hours ago End the Fed permalink parent award report block reply\nsomeguy7738 4 points 9 hours ago You'd have to have a room temp IQ to actually believe there's anything sound about \"our\" financial system. permalink parent award report block reply E-dantes 4 points 9 hours ago You just described the average voter. permalink parent award report block reply someguy7738 3 points 9 hours ago Fair enough lol. permalink parent award report block reply\nE-dantes 4 points 9 hours ago You just described the average voter. permalink parent award report block reply someguy7738 3 points 9 hours ago Fair enough lol. permalink parent award report block reply\nsomeguy7738 3 points 9 hours ago Fair enough lol. permalink parent award report block reply\nSHILL_DETECTOR 2 points 10 hours ago so where did all the gold we stole from iraq and libya and such go??? permalink parent award report block reply Thomm 6 points 10 hours ago Israel permalink parent award report block reply E-dantes 3 points 9 hours ago Probably to Canada, and e.u. to pay for their free healthcare. Why does every country on the planet owe some other country a financial debt? You would think there would be at least one country breaking even due to debts being equalized. permalink parent award report block reply DarthEP 4 points 9 hours ago There Is, But We're NOT Allowed To Discuss It. permalink parent award report block reply\nThomm 6 points 10 hours ago Israel permalink parent award report block reply\nE-dantes 3 points 9 hours ago Probably to Canada, and e.u. to pay for their free healthcare. Why does every country on the planet owe some other country a financial debt? You would think there would be at least one country breaking even due to debts being equalized. permalink parent award report block reply DarthEP 4 points 9 hours ago There Is, But We're NOT Allowed To Discuss It. permalink parent award report block reply\nDarthEP 4 points 9 hours ago There Is, But We're NOT Allowed To Discuss It. permalink parent award report block reply\nZeleskys_WH_Clothing 4 points 8 hours ago This is what happens when you need billions of dollars to get anything accomplished and only the billionaire have that kind of money. The government yields to Money, plain and simple anyone telling you otherwise is full of horseshit. You cannot elect a politician wit out billions of dollars being spent on their campaign. Therefore they are all OWNED by the people who PAID to put them in office.  This has been happening for many, many years. Trump isn't changing shit and it's a damned shame to be honest. permalink award report block reply\nWI-Patriot 3 points 7 hours ago Trump's agenda is running up against deep state realities. permalink award report block reply\nDarthEP 2 points 9 hours ago Absolutely Everything Must Go According To Plan. permalink award report block reply\nCallsign_Fox1 2 points 10 hours ago Its not all bad. We are about to attack Venezuela and oust Maduro in a regime change op, that's pretty cool. permalink award report block reply\nbreezily 2 points 9 hours ago some Rs said some things that you liked, smh. permalink award report block reply\nSCHULTZ 1 points 8 hours ago Comment removed by community moderators. permalink award report block reply"}