{"id": "1ARK9nOWvw", "contents": "9 WATCH VIDEO - \"DHS Secretary Noem: “Under the Trump Administration, we’ve sped up our process and added integrity to the visa programs. More people are becoming naturalized citizens under this administration than ever before.”\" posted 8 hours ago by bleeje 6 comments award share report block TheBlaze @theblaze • 10h DHS Secretary Noem: “Under the Trump Administration, we’ve sped up our process and added integrity to the visa programs. More people are becoming naturalized citizens under this administration than ever before.”\n6 comments Sort by Top Top New Worst Old Save CanadianMeathead 5 points 8 hours ago Trump loves him some H1Bs permalink award report block reply Ronaldus 4 points 8 hours ago Some will call you a doomer for noticing. permalink award report block reply Iremembermypassword 1 points 8 hours ago YoU mUsT bE aNtI tRuMp!?!?!? permalink parent award report block reply Ronaldus 1 points 5 hours ago Or did Trump do something that is anti-me? I am worried about me and America and voted for Trump to deport, not import. permalink parent award report block reply Jack_NC 3 points 8 hours ago More naturalized citizens, exactly at the time that we need fewer. It's about Quality, not Quantity , Ms. Noem. permalink award report block reply rapskull 1 points 8 hours ago DHS is a GLOBO HOMO Agency.  It's W Bush's BABY. END DHS NOW permalink award report block reply\nCanadianMeathead 5 points 8 hours ago Trump loves him some H1Bs permalink award report block reply\nRonaldus 4 points 8 hours ago Some will call you a doomer for noticing. permalink award report block reply Iremembermypassword 1 points 8 hours ago YoU mUsT bE aNtI tRuMp!?!?!? permalink parent award report block reply Ronaldus 1 points 5 hours ago Or did Trump do something that is anti-me? I am worried about me and America and voted for Trump to deport, not import. permalink parent award report block reply\nIremembermypassword 1 points 8 hours ago YoU mUsT bE aNtI tRuMp!?!?!? permalink parent award report block reply Ronaldus 1 points 5 hours ago Or did Trump do something that is anti-me? I am worried about me and America and voted for Trump to deport, not import. permalink parent award report block reply\nRonaldus 1 points 5 hours ago Or did Trump do something that is anti-me? I am worried about me and America and voted for Trump to deport, not import. permalink parent award report block reply\nJack_NC 3 points 8 hours ago More naturalized citizens, exactly at the time that we need fewer. It's about Quality, not Quantity , Ms. Noem. permalink award report block reply\nrapskull 1 points 8 hours ago DHS is a GLOBO HOMO Agency.  It's W Bush's BABY. END DHS NOW permalink award report block reply"}