{"id": "1ARK9hjvRY", "contents": "525 People would be arrested if we had gotten what we wanted posted 2 days ago by Trumpymctrumpface 17 comments award share download report block\n17 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style RED_WAVE 18 points 2 days ago I knew it was a bad sign when Bondi sailed through the approval process. But Gates' premature resignation from Congress and then his withdrawal as an AG candidate was odd.  There was a BS smear attempt made in FL, but other than that I have no idea why he would abandon politics. permalink award report block reply snoopy3210 5 points 2 days ago He should have stayed in Congress. Mike Johnson needs Gates’ smartness because he’s way too naive. He needs backup. Gates for speaker! permalink parent award report block reply Tacitus1963 2 points 2 days ago I don't think the little weasel Johnson is naive. I think he is compromised AF and does whatever the rest of the uniparty tells him to do. permalink parent award report block reply deleted 7 points 2 days ago Bullet_Tooth_Tony 4 points 2 days ago How much are you paying per month on copium?? Fren, we need to schedule you an intervention. permalink parent award report block reply RINOssuck 3 points 2 days ago Then go out and elect a Senate that will approve what you wanted. permalink award report block reply PhantomShield72 2 points 2 days ago Truth. permalink award report block reply fuck__cnn 2 points 2 days ago Has there been any action by this administration that can't be undone? I believe nobody in this administration stood up for Gaetz was because he was going to do something that couldn't be undone. permalink award report block reply MAGALADON9 1 points 2 days ago Bovineous Malfoy permalink award report block reply patrioticwinning3 1 points 2 days ago MAGA MATT FOR AG! permalink award report block reply KennyKetchem 1 points 2 days ago Bill Barbie permalink award report block reply tuaris 1 points 2 days ago \"Sex\" is an effective weapon against your character when your country is majority christian.  I don't blame him for wanting out of the spotlight. permalink award report block reply grenades_and_ham 1 points 2 days ago Tits Gowdy. permalink award report block reply MAG-n-KAG 1 points 2 days ago https://media.patriots.win/post/gMbasN5oHh3u.jpeg permalink award report block reply I_Love_45-70_Gov 1 points 2 days ago 🤣🤣 permalink award report block reply\nRED_WAVE 18 points 2 days ago I knew it was a bad sign when Bondi sailed through the approval process. But Gates' premature resignation from Congress and then his withdrawal as an AG candidate was odd.  There was a BS smear attempt made in FL, but other than that I have no idea why he would abandon politics. permalink award report block reply snoopy3210 5 points 2 days ago He should have stayed in Congress. Mike Johnson needs Gates’ smartness because he’s way too naive. He needs backup. Gates for speaker! permalink parent award report block reply Tacitus1963 2 points 2 days ago I don't think the little weasel Johnson is naive. I think he is compromised AF and does whatever the rest of the uniparty tells him to do. permalink parent award report block reply\nsnoopy3210 5 points 2 days ago He should have stayed in Congress. Mike Johnson needs Gates’ smartness because he’s way too naive. He needs backup. Gates for speaker! permalink parent award report block reply Tacitus1963 2 points 2 days ago I don't think the little weasel Johnson is naive. I think he is compromised AF and does whatever the rest of the uniparty tells him to do. permalink parent award report block reply\nTacitus1963 2 points 2 days ago I don't think the little weasel Johnson is naive. I think he is compromised AF and does whatever the rest of the uniparty tells him to do. permalink parent award report block reply\ndeleted 7 points 2 days ago Bullet_Tooth_Tony 4 points 2 days ago How much are you paying per month on copium?? Fren, we need to schedule you an intervention. permalink parent award report block reply\nBullet_Tooth_Tony 4 points 2 days ago How much are you paying per month on copium?? Fren, we need to schedule you an intervention. permalink parent award report block reply\nRINOssuck 3 points 2 days ago Then go out and elect a Senate that will approve what you wanted. permalink award report block reply\nPhantomShield72 2 points 2 days ago Truth. permalink award report block reply\nfuck__cnn 2 points 2 days ago Has there been any action by this administration that can't be undone? I believe nobody in this administration stood up for Gaetz was because he was going to do something that couldn't be undone. permalink award report block reply\nMAGALADON9 1 points 2 days ago Bovineous Malfoy permalink award report block reply\npatrioticwinning3 1 points 2 days ago MAGA MATT FOR AG! permalink award report block reply\nKennyKetchem 1 points 2 days ago Bill Barbie permalink award report block reply\ntuaris 1 points 2 days ago \"Sex\" is an effective weapon against your character when your country is majority christian.  I don't blame him for wanting out of the spotlight. permalink award report block reply\ngrenades_and_ham 1 points 2 days ago Tits Gowdy. permalink award report block reply\nMAG-n-KAG 1 points 2 days ago https://media.patriots.win/post/gMbasN5oHh3u.jpeg permalink award report block reply\nI_Love_45-70_Gov 1 points 2 days ago 🤣🤣 permalink award report block reply"}