{"id": "1ARK591B2b", "contents": "434 I don't want a 50 year mortgage. I want 50 million deportations posted 4 days ago by ColonelKlink 19 comments award share download report block\n19 comments Sort by Top Top New Worst Old Save SubmarineGuy 6 points 4 days ago Somali's first! permalink award report block reply Crucible 6 points 4 days ago Breeders First. They're the ones dropping the anchor babies. permalink parent award report block reply FusionBlack 2 points 3 days ago Start in Dearborn and Minneapolis. They are afraid to. What an embarrassment. permalink parent award report block reply magapatriot_pa 6 points 4 days ago 50 year mortgage might be one of the stupidest ideas of all time. Imagine buying a house when you're 20 years old (then remember that the average age of the actual first-time homebuyer is somewhere in the 40s) and then by the time you retire, still not owning it permalink award report block reply tingo999 -3 points 4 days ago Are people on this forum really this stupid? If you couldn't afford a shorter term mortgage you weren't going to pay it off anyways. Why do you ever need to pay off the mortgage? You don't live in the same house forever at 20. If you are buying a 50 year mortgage it's due to financial reasons. Ideally you want to pay it off so you can retire more easily. The alternative is being a renter forever? Being a renter is very difficult you have very little control. You people are weird. It's fucking exhausting how suddenly stupid and difficult everyone is. permalink parent award report block reply justicein2020 5 points 4 days ago As a home seller, if i know that everyone can get a 50 year and not just a 30. I'm raising my asking price by almost double. It's just good business. permalink parent award report block reply magapatriot_pa 5 points 4 days ago If you have to pay mortgage payments at 70, you ARE a renter forever, as you wouldn't have really any of the benefits of home ownership (other than having a place to live I guess) but would have all of the disadvantages of home ownership (property taxes, repair costs, etc), it would really be the worst of both worlds As for solutions, mass deportations would help, as would an overall cultural shift back toward marriage, since a man and a woman sharing a house instead of having two separate houses would not only make the cost of living cheaper for both of them, it would also add houses to the market which would reduce prices even further If we can get all of Biden's illegals out, and people to actually get married again, your average worker would be able to afford a 15 year mortgage with money to spare permalink parent award report block reply perma-maga 3 points 4 days ago focus donny, focus. deport all the illegals, prosecute the coup plotters, election integrity. that's everything! do it! i don't give a damn about ukr or the m.e. i love you permalink award report block reply Crucible 2 points 4 days ago It would immediately solve the housing problems. permalink award report block reply patrioticwinning3 2 points 4 days ago Agreed!  If you look at the numbers a 50 year mortgage ONLY saves you about a $200 a month...and you get 20 more years of that shit! $300,000 30-year fixed: $1,529 principal and interest 40-year fixed: $1,418 principal and interest 50-year fixed: $1,366 principal and interest $400,000 30-year fixed: $2,038 principal and interest 40-year fixed: $1,891 principal and interest 50-year fixed: $1,822 principal and interest $500,000 30-year fixed: $2,548 principal and interest 40-year fixed: $2,363 principal and interest 50-year fixed: $2,277 principal and interest https://www.housingwire.com/articles/trump-proposes-50-year-mortgage-to-help-affordability/ permalink award report block reply DJT4547 3 points 3 days ago You missed something: property tax over 50 years instead of 30 years. I cannot believe Trump even mentioned this nonsense. permalink parent award report block reply Zippitydoodah 4 points 3 days ago You pay property tax even after the house is paid off. You do in my state, anyway. That never goes away, whether your mortgage is 10 year, 15 year, or 30. permalink parent award report block reply DJT4547 2 points 3 days ago Oh yeah, I was just telling him to add that in too, because it's even more expensive throughout the 30 and 40 term loans. permalink parent award report block reply patrioticwinning3 1 points 3 days ago Taxes, plus insurance, plus home repairs, yes there is a lot to add in, this is just the mortgages. permalink parent award report block reply tingo999 1 points 4 days ago You can do multiple things at once stupid. permalink award report block reply BlackLabsMatter 1 points 3 days ago I think we have more than 50 million that are not here illegally. permalink award report block reply everylastjuan 1 points 3 days ago This is unfair. I should be able to get 100 million deportations and a 100 year mortgage if I choose. My body my choice. permalink award report block reply Freedom2020 1 points 3 days ago Why not both? permalink award report block reply starjello 1 points 4 days ago The electoral asskicking last Tuesday is making Trump start to look desperate. Down vote away cultist zombies. permalink award report block reply\nSubmarineGuy 6 points 4 days ago Somali's first! permalink award report block reply Crucible 6 points 4 days ago Breeders First. They're the ones dropping the anchor babies. permalink parent award report block reply FusionBlack 2 points 3 days ago Start in Dearborn and Minneapolis. They are afraid to. What an embarrassment. permalink parent award report block reply\nCrucible 6 points 4 days ago Breeders First. They're the ones dropping the anchor babies. permalink parent award report block reply\nFusionBlack 2 points 3 days ago Start in Dearborn and Minneapolis. They are afraid to. What an embarrassment. permalink parent award report block reply\nmagapatriot_pa 6 points 4 days ago 50 year mortgage might be one of the stupidest ideas of all time. Imagine buying a house when you're 20 years old (then remember that the average age of the actual first-time homebuyer is somewhere in the 40s) and then by the time you retire, still not owning it permalink award report block reply tingo999 -3 points 4 days ago Are people on this forum really this stupid? If you couldn't afford a shorter term mortgage you weren't going to pay it off anyways. Why do you ever need to pay off the mortgage? You don't live in the same house forever at 20. If you are buying a 50 year mortgage it's due to financial reasons. Ideally you want to pay it off so you can retire more easily. The alternative is being a renter forever? Being a renter is very difficult you have very little control. You people are weird. It's fucking exhausting how suddenly stupid and difficult everyone is. permalink parent award report block reply justicein2020 5 points 4 days ago As a home seller, if i know that everyone can get a 50 year and not just a 30. I'm raising my asking price by almost double. It's just good business. permalink parent award report block reply magapatriot_pa 5 points 4 days ago If you have to pay mortgage payments at 70, you ARE a renter forever, as you wouldn't have really any of the benefits of home ownership (other than having a place to live I guess) but would have all of the disadvantages of home ownership (property taxes, repair costs, etc), it would really be the worst of both worlds As for solutions, mass deportations would help, as would an overall cultural shift back toward marriage, since a man and a woman sharing a house instead of having two separate houses would not only make the cost of living cheaper for both of them, it would also add houses to the market which would reduce prices even further If we can get all of Biden's illegals out, and people to actually get married again, your average worker would be able to afford a 15 year mortgage with money to spare permalink parent award report block reply\ntingo999 -3 points 4 days ago Are people on this forum really this stupid? If you couldn't afford a shorter term mortgage you weren't going to pay it off anyways. Why do you ever need to pay off the mortgage? You don't live in the same house forever at 20. If you are buying a 50 year mortgage it's due to financial reasons. Ideally you want to pay it off so you can retire more easily. The alternative is being a renter forever? Being a renter is very difficult you have very little control. You people are weird. It's fucking exhausting how suddenly stupid and difficult everyone is. permalink parent award report block reply justicein2020 5 points 4 days ago As a home seller, if i know that everyone can get a 50 year and not just a 30. I'm raising my asking price by almost double. It's just good business. permalink parent award report block reply magapatriot_pa 5 points 4 days ago If you have to pay mortgage payments at 70, you ARE a renter forever, as you wouldn't have really any of the benefits of home ownership (other than having a place to live I guess) but would have all of the disadvantages of home ownership (property taxes, repair costs, etc), it would really be the worst of both worlds As for solutions, mass deportations would help, as would an overall cultural shift back toward marriage, since a man and a woman sharing a house instead of having two separate houses would not only make the cost of living cheaper for both of them, it would also add houses to the market which would reduce prices even further If we can get all of Biden's illegals out, and people to actually get married again, your average worker would be able to afford a 15 year mortgage with money to spare permalink parent award report block reply\njusticein2020 5 points 4 days ago As a home seller, if i know that everyone can get a 50 year and not just a 30. I'm raising my asking price by almost double. It's just good business. permalink parent award report block reply\nmagapatriot_pa 5 points 4 days ago If you have to pay mortgage payments at 70, you ARE a renter forever, as you wouldn't have really any of the benefits of home ownership (other than having a place to live I guess) but would have all of the disadvantages of home ownership (property taxes, repair costs, etc), it would really be the worst of both worlds As for solutions, mass deportations would help, as would an overall cultural shift back toward marriage, since a man and a woman sharing a house instead of having two separate houses would not only make the cost of living cheaper for both of them, it would also add houses to the market which would reduce prices even further If we can get all of Biden's illegals out, and people to actually get married again, your average worker would be able to afford a 15 year mortgage with money to spare permalink parent award report block reply\nperma-maga 3 points 4 days ago focus donny, focus. deport all the illegals, prosecute the coup plotters, election integrity. that's everything! do it! i don't give a damn about ukr or the m.e. i love you permalink award report block reply\nCrucible 2 points 4 days ago It would immediately solve the housing problems. permalink award report block reply\npatrioticwinning3 2 points 4 days ago Agreed!  If you look at the numbers a 50 year mortgage ONLY saves you about a $200 a month...and you get 20 more years of that shit! $300,000 30-year fixed: $1,529 principal and interest 40-year fixed: $1,418 principal and interest 50-year fixed: $1,366 principal and interest $400,000 30-year fixed: $2,038 principal and interest 40-year fixed: $1,891 principal and interest 50-year fixed: $1,822 principal and interest $500,000 30-year fixed: $2,548 principal and interest 40-year fixed: $2,363 principal and interest 50-year fixed: $2,277 principal and interest https://www.housingwire.com/articles/trump-proposes-50-year-mortgage-to-help-affordability/ permalink award report block reply DJT4547 3 points 3 days ago You missed something: property tax over 50 years instead of 30 years. I cannot believe Trump even mentioned this nonsense. permalink parent award report block reply Zippitydoodah 4 points 3 days ago You pay property tax even after the house is paid off. You do in my state, anyway. That never goes away, whether your mortgage is 10 year, 15 year, or 30. permalink parent award report block reply DJT4547 2 points 3 days ago Oh yeah, I was just telling him to add that in too, because it's even more expensive throughout the 30 and 40 term loans. permalink parent award report block reply patrioticwinning3 1 points 3 days ago Taxes, plus insurance, plus home repairs, yes there is a lot to add in, this is just the mortgages. permalink parent award report block reply\nDJT4547 3 points 3 days ago You missed something: property tax over 50 years instead of 30 years. I cannot believe Trump even mentioned this nonsense. permalink parent award report block reply Zippitydoodah 4 points 3 days ago You pay property tax even after the house is paid off. You do in my state, anyway. That never goes away, whether your mortgage is 10 year, 15 year, or 30. permalink parent award report block reply DJT4547 2 points 3 days ago Oh yeah, I was just telling him to add that in too, because it's even more expensive throughout the 30 and 40 term loans. permalink parent award report block reply patrioticwinning3 1 points 3 days ago Taxes, plus insurance, plus home repairs, yes there is a lot to add in, this is just the mortgages. permalink parent award report block reply\nZippitydoodah 4 points 3 days ago You pay property tax even after the house is paid off. You do in my state, anyway. That never goes away, whether your mortgage is 10 year, 15 year, or 30. permalink parent award report block reply DJT4547 2 points 3 days ago Oh yeah, I was just telling him to add that in too, because it's even more expensive throughout the 30 and 40 term loans. permalink parent award report block reply patrioticwinning3 1 points 3 days ago Taxes, plus insurance, plus home repairs, yes there is a lot to add in, this is just the mortgages. permalink parent award report block reply\nDJT4547 2 points 3 days ago Oh yeah, I was just telling him to add that in too, because it's even more expensive throughout the 30 and 40 term loans. permalink parent award report block reply patrioticwinning3 1 points 3 days ago Taxes, plus insurance, plus home repairs, yes there is a lot to add in, this is just the mortgages. permalink parent award report block reply\npatrioticwinning3 1 points 3 days ago Taxes, plus insurance, plus home repairs, yes there is a lot to add in, this is just the mortgages. permalink parent award report block reply\ntingo999 1 points 4 days ago You can do multiple things at once stupid. permalink award report block reply\nBlackLabsMatter 1 points 3 days ago I think we have more than 50 million that are not here illegally. permalink award report block reply\neverylastjuan 1 points 3 days ago This is unfair. I should be able to get 100 million deportations and a 100 year mortgage if I choose. My body my choice. permalink award report block reply\nFreedom2020 1 points 3 days ago Why not both? permalink award report block reply\nstarjello 1 points 4 days ago The electoral asskicking last Tuesday is making Trump start to look desperate. Down vote away cultist zombies. permalink award report block reply"}