{"id": "1ARK9mFrUr", "contents": "169 What is the point of America or voting for Republicans if the result is foreigners inheriting our birthright? posted 21 hours ago by 2Scoops2Terms2Walls 15 comments award share report block Orcbrand: The Dark Secret Tragedy @orkbrandly • 22h Please... Mr. Trump... in 1942 we took people off the unemployment line and said \"go make missiles\" and that worked out incredibly well. You don't want foreigners making missiles..  we'll probably bomb their cousins with it. Laura Ingraham @IngrahamAngle • 23h 🚨I PRESSED President Trump on H-1B visas.🚨 “If you want to RAISE WAGES for Americans, you can’t flood the country with THOUSANDS of foreign workers.” @POTUS: “You have to bring in talent… You can’t take people off the unemployment line and say, ‘go make missiles.’” The\n15 comments Sort by Top Top New Worst Old Save bcfromfl 13 points 21 hours ago Perfect example of a false dichotomy.  No, Mr. President, an employer wouldn't take people off an unemployment line to hire them to build missiles.  The U.S. has PLENTY of highly skilled workers who could easily be trained for any position that is now being given to H-1B hires. permalink award report block reply newestofnew 6 points 21 hours ago why not? unemployment doesn't mean someone lost all their skills and everything they have ever learned. permalink parent award report block reply bcfromfl 4 points 21 hours ago True, but what he did was intentionally propose a controversial alternative to falsely make using H1-B workers a more attractive option. permalink parent award report block reply Mydogisbetter 4 points 21 hours ago I spent 7 months looking for a job 14 years in the software industry.  Things very close like 99% a match i wouldn't even get an interview.   A local company needed an a network and all not connected to software development they hired on the spot.  I dont have the school or the direct experience. Doing the job just fine.  Only saw this trump interview tonight.  Definitely makes me rethink a vote towards his base.  The fact that I lost a 14 year career at a company I helped build to H1Bs and have had a hard time finding something else really makes me fucking pissed.  I am basically starting all over again and I am not in my 20s anymore. permalink parent award report block reply GoldenSpirals 3 points 21 hours ago Same here, lost my job of 7 years at a startup I helped build from the ground up, now I'm getting ghosted after 3 interviews. permalink parent award report block reply Toecutter7N6 5 points 21 hours ago The problem stems from one thing. 2 words. White Nation Makes 98% of white women scream bloody murder. permalink award report block reply hazelknut 3 points 17 hours ago Trump is obviously rewarding the high rollers that want cheap labor at the expense of Americans. Shameful. permalink award report block reply SpeekFreely -2 points 21 hours ago Those foreign workers were part of the deal to bring in that foreign money. Ya’ll understand that don’t you ? permalink award report block reply Mydogisbetter 8 points 21 hours ago Don't care at this point.  I lost a 14 year career to H1Bs.  Makes me second guess the voting for the MAGA base if it is so willing to fuck over Americans.   Problem is there ain't another base because all the rest sell out also. permalink parent award report block reply SpeekFreely 3 points 21 hours ago I heard someone suggest the other day that another visit to DC may be in order. A peaceful protest to air these grievances, and get some attention to these matters. permalink parent award report block reply Hambonemcgee 1 points 12 hours ago Stuart Rhoades suggested it in an interview with Alex Jones. permalink parent award report block reply SpeekFreely 1 points 12 hours ago That’s correct, that’s where i heard it. permalink parent award report block reply DeadOverRed 1 points 19 hours ago Peaceful isn't going to do shit. permalink parent award report block reply Aggrieved03 2 points 21 hours ago If they’re sending all that money home, only hiring foreigners, what’s the point? The government makes tax money. permalink parent award report block reply SpeekFreely 1 points 21 hours ago Foreign money in terms of the large amount of CAPEX spending to build the plants. permalink parent award report block reply\nbcfromfl 13 points 21 hours ago Perfect example of a false dichotomy.  No, Mr. President, an employer wouldn't take people off an unemployment line to hire them to build missiles.  The U.S. has PLENTY of highly skilled workers who could easily be trained for any position that is now being given to H-1B hires. permalink award report block reply newestofnew 6 points 21 hours ago why not? unemployment doesn't mean someone lost all their skills and everything they have ever learned. permalink parent award report block reply bcfromfl 4 points 21 hours ago True, but what he did was intentionally propose a controversial alternative to falsely make using H1-B workers a more attractive option. permalink parent award report block reply Mydogisbetter 4 points 21 hours ago I spent 7 months looking for a job 14 years in the software industry.  Things very close like 99% a match i wouldn't even get an interview.   A local company needed an a network and all not connected to software development they hired on the spot.  I dont have the school or the direct experience. Doing the job just fine.  Only saw this trump interview tonight.  Definitely makes me rethink a vote towards his base.  The fact that I lost a 14 year career at a company I helped build to H1Bs and have had a hard time finding something else really makes me fucking pissed.  I am basically starting all over again and I am not in my 20s anymore. permalink parent award report block reply GoldenSpirals 3 points 21 hours ago Same here, lost my job of 7 years at a startup I helped build from the ground up, now I'm getting ghosted after 3 interviews. permalink parent award report block reply\nnewestofnew 6 points 21 hours ago why not? unemployment doesn't mean someone lost all their skills and everything they have ever learned. permalink parent award report block reply bcfromfl 4 points 21 hours ago True, but what he did was intentionally propose a controversial alternative to falsely make using H1-B workers a more attractive option. permalink parent award report block reply Mydogisbetter 4 points 21 hours ago I spent 7 months looking for a job 14 years in the software industry.  Things very close like 99% a match i wouldn't even get an interview.   A local company needed an a network and all not connected to software development they hired on the spot.  I dont have the school or the direct experience. Doing the job just fine.  Only saw this trump interview tonight.  Definitely makes me rethink a vote towards his base.  The fact that I lost a 14 year career at a company I helped build to H1Bs and have had a hard time finding something else really makes me fucking pissed.  I am basically starting all over again and I am not in my 20s anymore. permalink parent award report block reply GoldenSpirals 3 points 21 hours ago Same here, lost my job of 7 years at a startup I helped build from the ground up, now I'm getting ghosted after 3 interviews. permalink parent award report block reply\nbcfromfl 4 points 21 hours ago True, but what he did was intentionally propose a controversial alternative to falsely make using H1-B workers a more attractive option. permalink parent award report block reply Mydogisbetter 4 points 21 hours ago I spent 7 months looking for a job 14 years in the software industry.  Things very close like 99% a match i wouldn't even get an interview.   A local company needed an a network and all not connected to software development they hired on the spot.  I dont have the school or the direct experience. Doing the job just fine.  Only saw this trump interview tonight.  Definitely makes me rethink a vote towards his base.  The fact that I lost a 14 year career at a company I helped build to H1Bs and have had a hard time finding something else really makes me fucking pissed.  I am basically starting all over again and I am not in my 20s anymore. permalink parent award report block reply GoldenSpirals 3 points 21 hours ago Same here, lost my job of 7 years at a startup I helped build from the ground up, now I'm getting ghosted after 3 interviews. permalink parent award report block reply\nMydogisbetter 4 points 21 hours ago I spent 7 months looking for a job 14 years in the software industry.  Things very close like 99% a match i wouldn't even get an interview.   A local company needed an a network and all not connected to software development they hired on the spot.  I dont have the school or the direct experience. Doing the job just fine.  Only saw this trump interview tonight.  Definitely makes me rethink a vote towards his base.  The fact that I lost a 14 year career at a company I helped build to H1Bs and have had a hard time finding something else really makes me fucking pissed.  I am basically starting all over again and I am not in my 20s anymore. permalink parent award report block reply GoldenSpirals 3 points 21 hours ago Same here, lost my job of 7 years at a startup I helped build from the ground up, now I'm getting ghosted after 3 interviews. permalink parent award report block reply\nGoldenSpirals 3 points 21 hours ago Same here, lost my job of 7 years at a startup I helped build from the ground up, now I'm getting ghosted after 3 interviews. permalink parent award report block reply\nToecutter7N6 5 points 21 hours ago The problem stems from one thing. 2 words. White Nation Makes 98% of white women scream bloody murder. permalink award report block reply\nhazelknut 3 points 17 hours ago Trump is obviously rewarding the high rollers that want cheap labor at the expense of Americans. Shameful. permalink award report block reply\nSpeekFreely -2 points 21 hours ago Those foreign workers were part of the deal to bring in that foreign money. Ya’ll understand that don’t you ? permalink award report block reply Mydogisbetter 8 points 21 hours ago Don't care at this point.  I lost a 14 year career to H1Bs.  Makes me second guess the voting for the MAGA base if it is so willing to fuck over Americans.   Problem is there ain't another base because all the rest sell out also. permalink parent award report block reply SpeekFreely 3 points 21 hours ago I heard someone suggest the other day that another visit to DC may be in order. A peaceful protest to air these grievances, and get some attention to these matters. permalink parent award report block reply Hambonemcgee 1 points 12 hours ago Stuart Rhoades suggested it in an interview with Alex Jones. permalink parent award report block reply SpeekFreely 1 points 12 hours ago That’s correct, that’s where i heard it. permalink parent award report block reply DeadOverRed 1 points 19 hours ago Peaceful isn't going to do shit. permalink parent award report block reply Aggrieved03 2 points 21 hours ago If they’re sending all that money home, only hiring foreigners, what’s the point? The government makes tax money. permalink parent award report block reply SpeekFreely 1 points 21 hours ago Foreign money in terms of the large amount of CAPEX spending to build the plants. permalink parent award report block reply\nMydogisbetter 8 points 21 hours ago Don't care at this point.  I lost a 14 year career to H1Bs.  Makes me second guess the voting for the MAGA base if it is so willing to fuck over Americans.   Problem is there ain't another base because all the rest sell out also. permalink parent award report block reply SpeekFreely 3 points 21 hours ago I heard someone suggest the other day that another visit to DC may be in order. A peaceful protest to air these grievances, and get some attention to these matters. permalink parent award report block reply Hambonemcgee 1 points 12 hours ago Stuart Rhoades suggested it in an interview with Alex Jones. permalink parent award report block reply SpeekFreely 1 points 12 hours ago That’s correct, that’s where i heard it. permalink parent award report block reply DeadOverRed 1 points 19 hours ago Peaceful isn't going to do shit. permalink parent award report block reply\nSpeekFreely 3 points 21 hours ago I heard someone suggest the other day that another visit to DC may be in order. A peaceful protest to air these grievances, and get some attention to these matters. permalink parent award report block reply Hambonemcgee 1 points 12 hours ago Stuart Rhoades suggested it in an interview with Alex Jones. permalink parent award report block reply SpeekFreely 1 points 12 hours ago That’s correct, that’s where i heard it. permalink parent award report block reply DeadOverRed 1 points 19 hours ago Peaceful isn't going to do shit. permalink parent award report block reply\nHambonemcgee 1 points 12 hours ago Stuart Rhoades suggested it in an interview with Alex Jones. permalink parent award report block reply SpeekFreely 1 points 12 hours ago That’s correct, that’s where i heard it. permalink parent award report block reply\nSpeekFreely 1 points 12 hours ago That’s correct, that’s where i heard it. permalink parent award report block reply\nDeadOverRed 1 points 19 hours ago Peaceful isn't going to do shit. permalink parent award report block reply\nAggrieved03 2 points 21 hours ago If they’re sending all that money home, only hiring foreigners, what’s the point? The government makes tax money. permalink parent award report block reply SpeekFreely 1 points 21 hours ago Foreign money in terms of the large amount of CAPEX spending to build the plants. permalink parent award report block reply\nSpeekFreely 1 points 21 hours ago Foreign money in terms of the large amount of CAPEX spending to build the plants. permalink parent award report block reply"}