{"id": "1ARK9nPu6z", "contents": "14 Kash Patel declares victory in the fight against fentanyl, shutting the deadly production network in Mexico and across the globe as well as cutting off the supply chain fueling its production. posted 5 hours ago by CatalystForChange 6 comments award share report block Shadow of Ezra @ShadowofEzra • 5h FBI Director Kash Patel declares victory in the fight against fentanyl, confirming the shutdown of the deadly production network in Mexico and across the globe, saving countless American lives. He says Mexican cartels will no longer have access to the chemicals used to make the\n6 comments Sort by Top Top New Worst Old Save 0Sum 2 points 5 hours ago this is good, but get ready for the zombies to wake up and get crazy as they hunt for ways to avoid dope sickness. permalink award report block reply BonginosRac1stCowboy 1 points 4 hours ago Comment removed by community moderators. permalink parent award report block reply Returningtogod 2 points 3 hours ago I’d rather Kash declare victory over CORRUPT POLITICIANS. permalink award report block reply JoePlumber 1 points 4 hours ago Cool. From what I hear the street price of fentanyl/\"tranq\" has fallen slightly since January. But cool cool cool. permalink award report block reply CaptainWinston 0 points 3 hours ago I don’t trust the street shitter. He has delivered nothing of substance permalink award report block reply rapskull 1 points 4 hours ago Comment removed by community moderators. permalink award report block reply\n0Sum 2 points 5 hours ago this is good, but get ready for the zombies to wake up and get crazy as they hunt for ways to avoid dope sickness. permalink award report block reply BonginosRac1stCowboy 1 points 4 hours ago Comment removed by community moderators. permalink parent award report block reply\nBonginosRac1stCowboy 1 points 4 hours ago Comment removed by community moderators. permalink parent award report block reply\nReturningtogod 2 points 3 hours ago I’d rather Kash declare victory over CORRUPT POLITICIANS. permalink award report block reply\nJoePlumber 1 points 4 hours ago Cool. From what I hear the street price of fentanyl/\"tranq\" has fallen slightly since January. But cool cool cool. permalink award report block reply\nCaptainWinston 0 points 3 hours ago I don’t trust the street shitter. He has delivered nothing of substance permalink award report block reply\nrapskull 1 points 4 hours ago Comment removed by community moderators. permalink award report block reply"}