{"id": "1ARK591jGt", "contents": "788 Chinese USC PhD student admits to drugging, raping multiple women (postmillennialnews.com) DEPORT posted 3 days ago by neosin 87 comments award share report block Chinese USC PhD student admits to drugging, raping multiple women The September 2 motion from LA County Deputy Dist. Atty. Catherine Mariano stated that Weng described the assaults “at length and in detail” to LA Police Department detectives. postmillennialnews.com\n87 comments Sort by Top Top New Worst Old Save RowardHoark 42 points 3 days ago As someone in the sciences, the Chinese here are not a benefit. They cheat, steal, and generally don’t add to our country apart from paying the universities a lot. Cancel all their visas and deport! permalink award report block reply Nanteen 23 points 3 days ago If you look at it from the Chinese government's point of view. Paying universities full tuition for several hundred students to be able to come in and steal ideas worth billions of dollars is far cheaper than r&D on their own part permalink parent award report block reply glow-operator-2-0 6 points 3 days ago Sun Tsu's treatise was about total war. Change my mind. permalink parent award report block reply invalid_data 15 points 3 days ago Oh so all foreigners who have culture and morals based on nothing, tyrannt pedophiles, or demonic animal idols. permalink parent award report block reply NotYourMan 3 points 3 days ago Are you talking about Indians on H1B-visa? permalink parent award report block reply Standingoak 1 points 3 days ago A red devil at the USC TROJAN's or the Duke \"BLUE DEVIL's\" their mascots tell the story. permalink parent award report block reply PatriotSkorzeny 30 points 3 days ago CCP agent attempts to murder American. Very lackadaisical response from everyone with any semblance of power or authority concerning the number of CCP agents on the ground in the US. permalink award report block reply Aggrieved03 10 points 3 days ago Easily hundreds of thousands. We find bio labs and do nothing but invaded a country over rumors of a bio lab a world away. permalink parent award report block reply KarenLukasik 5 points 3 days ago rumors that Nuland testified to? permalink parent award report block reply nautilus 3 points 3 days ago I think you meant to say \"we FUND bio labs and do nothing.\" permalink parent award report block reply Nanteen 2 points 3 days ago I wish we would release a short life bio weapon in China. permalink parent award report block reply LUXURY_USERNAME 4 points 3 days ago this guy might just be a CPP agent permalink parent award report block reply Hikedelics 2 points 3 days ago It sounds like at least 2/3 were Chinese. Possibly the third too. permalink parent award report block reply Skogin 1 points 3 days ago Wouldn’t want to make people uncomfy. permalink parent award report block reply Wexit-Delecto 2 points 3 days ago Or be rude. permalink parent award report block reply Executarian2 13 points 3 days ago Execute him! permalink award report block reply bagel_fragility 4 points 3 days ago and his family. permalink parent award report block reply Hawksendoom 1 points 3 days ago start with any children first and then move your way up permalink parent award report block reply monkadelic 1 points 3 days ago wow, that is dark permalink parent award report block reply Hawksendoom 1 points 3 days ago and so is reality and you are no monk as you would know this permalink parent award report block reply schnazzmizzle 1 points 3 days ago I'm with you on this one. permalink parent award report block reply Smurfection 8 points 3 days ago The stupid lefty feminists are just offering up America's young women to be raped, assaulted, harassed and murdered and those dumb clucks think abortion is going to solve this. No human problem was ever solved by killing human beings.  That just adds to the problem. permalink award report block reply Hawksendoom 2 points 3 days ago they will run towards them with their abortions in their hands! also nah i disagree, violence solves everything. looks at dead human. yeah it's solved. permalink parent award report block reply chinigga 6 points 3 days ago University of Spoiled Children University of Southern Compton University of Sedating Chinese permalink award report block reply guywholikesDjtof2024 2 points 3 days ago university of billions of years, and \"God is fake\" rhetoric. permalink parent award report block reply lifeisahologram 6 points 3 days ago This is another example why open borders are bad. People traveling between them for work and school believe they are above laws. If one law they don’t like appears to be coming down, they just escape and leave. It’s not even just horrific stories like this. Debt too. You rack up 50k in debt in a new country and leave, nothing will happen to you. And it’s even worse in stories where people kill. Which is what so many Latin American illegal aliens are doing when they flee their countries in the first place, they murder, so they flee home and claim asylum here or other western countries using some random name and escape justice permalink award report block reply bagel_fragility 5 points 3 days ago open season on western civilization permalink award report block reply Kraken_V_Algorithm 3 points 3 days ago 2 of the victims were women he knew visiting from China.  The third was someone he knew living in the U.S. but also may have been Asian. permalink parent award report block reply Hawksendoom 2 points 3 days ago lets go to china and rape their women how would that work right? permalink parent award report block reply Wexit-Delecto 2 points 3 days ago You expect your enemies to send you rapists. If any of us tried that there we’d be quickly and unceremoniously executed behind the latrines. The question is why our side isn’t defending itself. permalink parent award report block reply Hawksendoom 2 points 3 days ago Nicely said permalink parent award report block reply bagel_fragility 2 points 3 days ago china would fly agents back to the USA to kill the whole family here permalink parent award report block reply Hawksendoom 1 points 3 days ago so we should too right? XD (looks up plane tickets) permalink parent award report block reply nautilus 2 points 3 days ago Why not just pretend to be a prominent US Rep and discuss politicy over dinner? permalink parent award report block reply guywholikesDjtof2024 5 points 3 days ago DEPORT THEM ALL FOREVER!! THEY MUST GO BACK!! permalink award report block reply Hawksendoom 2 points 3 days ago Deport? we are way past \"deport\" permalink parent award report block reply Wexit-Delecto 2 points 3 days ago Deport him…. TO HELL! permalink parent award report block reply flp999 5 points 3 days ago We’re bringing a lot of people into the country that are raping our women. That’s an inexcusable sin of the highest order. permalink award report block reply Hawksendoom 4 points 3 days ago why? the dumb white liberal bitch karens voting for this let them enjoy their votes. permalink parent award report block reply IForgotToAddAnEmail 1 points 3 days ago Yeah, most men were warning them not to. They screamed they were oppressed left right and center. Women, the absolute problem. Take their vote away, don't let them 'lead' ever again. The old generation and women, sold this Country out so they could feel better about themselves. permalink parent award report block reply Hawksendoom 1 points 3 days ago thank you for your reply and i agree permalink parent award report block reply Kickass2001 1 points 3 days ago They weren’t our women. Two came with him from China. Another was also from China but did not travel with him. permalink parent award report block reply Kraken_V_Algorithm 1 points 3 days ago Why do people feel compelled to comment without reading the article? permalink parent award report block reply Blackmore 2 points 3 days ago Because they have room temperature IQ, and don’t think too much. permalink parent award report block reply RIPcharlie -1 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply indigo_truther 1 points 3 days ago wtf permalink parent award report block reply Senaleb 4 points 3 days ago LA will label him as a white man. permalink award report block reply Friar_Pede 4 points 3 days ago Victims were foreigners permalink award report block reply The_Emperor 3 points 3 days ago At least 2 traveling w him, and one let him onto her home\nAlso he's a sicko permalink parent award report block reply Riehlpissed 3 points 3 days ago What secrets did he steal? permalink award report block reply Hawksendoom 2 points 3 days ago oh you know, the usual things that bill clinton didnt sell them. permalink parent award report block reply guywholikesDjtof2024 1 points 3 days ago yes. permalink parent award report block reply bn1856 2 points 3 days ago so newscum is giving him an award I presume permalink award report block reply Ligersrule1 2 points 3 days ago Sum Ting Wong (yet again) permalink award report block reply ThurstonHowell4th 2 points 2 days ago Bang din Hoosegow permalink parent award report block reply GreyKnight 2 points 3 days ago Deport them all, execute those who violently resist. permalink award report block reply MAGA1773 2 points 3 days ago Dr Rape. Awesome. permalink award report block reply Wexit-Delecto 2 points 3 days ago It’s Dr. Lape to you! permalink parent award report block reply Live_free_or_die_55 2 points 3 days ago Hang the communist POS!!! permalink award report block reply rivetjoint2 1 points 3 days ago Penis so small, did they know they were raped? permalink award report block reply ProbablyASockAccount 1 points 3 days ago And they didn't even notice because...you know... permalink award report block reply Dr_Phil 1 points 3 days ago Yellow peril. permalink award report block reply ParadigmShift2070 1 points 3 days ago Check his parents, they're either high communist party members or ultra rich (through ccp national business) permalink award report block reply Klaus73 1 points 3 days ago At least the offspring will be smarter then Muslims... permalink award report block reply Registered 1 points 3 days ago Just gonna say that if this occurred in China and the role was played by a foreigner, he would be put to death pretty quickly permalink award report block reply XxxRDTPRNxxX 1 points 3 days ago University women. They're just mad their rapist wasn't black and had a tiny penis. permalink award report block reply Ritchie_Blackadder 1 points 3 days ago Ancient Chinese secret, eh? permalink award report block reply GottaSitStand 1 points 3 days ago Oxford Study in reverse. permalink award report block reply DeltaSierra -8 points 3 days ago Comment removed upon the user being banned. permalink award report block reply SimaYi 5 points 3 days ago What the fuck is a racist? Is that some boomer shit? permalink parent award report block reply DeltaSierra -5 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply Whatyougotson 3 points 3 days ago Yeah chinese. Not american.. gtfo permalink parent award report block reply DeltaSierra -4 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply view 4 more comments... lifeisahologram 2 points 3 days ago It’s directly relevant because he is not an American, and in the article he explicitly said he would flee to China once he got bail (which is why they requested to deny his bail) this issue is a matter of immigration, and race and nationality because he was/is attempting to exploit a lack of extradition laws to escape justice for the women he raped. If we don’t acknowledge that and give him bail because we don’t want to be “racist” well, bye bye Bing Bong, I hope your victims can feel good knowing you are living as a wealthy Doctor in China with no consequences. permalink parent award report block reply DeltaSierra -1 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply view 1 more comments... DeltaSierra -2 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply Female 1 points 3 days ago We care a lot (faith no more) No seriously there are some very hardcore feminists here. Depends how you define feminism. Misandry? nah. I would love to kill rapists, and I'm sure that the General George Washington killed rapists. Legally through the law permalink parent award report block reply view 2 more comments... Hawksendoom 4 points 3 days ago would a muslim make it better for you or nah? permalink parent award report block reply DeltaSierra -1 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply Wexit-Delecto 1 points 3 days ago Western countries have more than enough criminals without importing the scum of the second and third world. They all need to go back, along with their sympathizers. permalink parent award report block reply\nRowardHoark 42 points 3 days ago As someone in the sciences, the Chinese here are not a benefit. They cheat, steal, and generally don’t add to our country apart from paying the universities a lot. Cancel all their visas and deport! permalink award report block reply Nanteen 23 points 3 days ago If you look at it from the Chinese government's point of view. Paying universities full tuition for several hundred students to be able to come in and steal ideas worth billions of dollars is far cheaper than r&D on their own part permalink parent award report block reply glow-operator-2-0 6 points 3 days ago Sun Tsu's treatise was about total war. Change my mind. permalink parent award report block reply invalid_data 15 points 3 days ago Oh so all foreigners who have culture and morals based on nothing, tyrannt pedophiles, or demonic animal idols. permalink parent award report block reply NotYourMan 3 points 3 days ago Are you talking about Indians on H1B-visa? permalink parent award report block reply Standingoak 1 points 3 days ago A red devil at the USC TROJAN's or the Duke \"BLUE DEVIL's\" their mascots tell the story. permalink parent award report block reply\nNanteen 23 points 3 days ago If you look at it from the Chinese government's point of view. Paying universities full tuition for several hundred students to be able to come in and steal ideas worth billions of dollars is far cheaper than r&D on their own part permalink parent award report block reply glow-operator-2-0 6 points 3 days ago Sun Tsu's treatise was about total war. Change my mind. permalink parent award report block reply\nglow-operator-2-0 6 points 3 days ago Sun Tsu's treatise was about total war. Change my mind. permalink parent award report block reply\ninvalid_data 15 points 3 days ago Oh so all foreigners who have culture and morals based on nothing, tyrannt pedophiles, or demonic animal idols. permalink parent award report block reply\nNotYourMan 3 points 3 days ago Are you talking about Indians on H1B-visa? permalink parent award report block reply\nStandingoak 1 points 3 days ago A red devil at the USC TROJAN's or the Duke \"BLUE DEVIL's\" their mascots tell the story. permalink parent award report block reply\nPatriotSkorzeny 30 points 3 days ago CCP agent attempts to murder American. Very lackadaisical response from everyone with any semblance of power or authority concerning the number of CCP agents on the ground in the US. permalink award report block reply Aggrieved03 10 points 3 days ago Easily hundreds of thousands. We find bio labs and do nothing but invaded a country over rumors of a bio lab a world away. permalink parent award report block reply KarenLukasik 5 points 3 days ago rumors that Nuland testified to? permalink parent award report block reply nautilus 3 points 3 days ago I think you meant to say \"we FUND bio labs and do nothing.\" permalink parent award report block reply Nanteen 2 points 3 days ago I wish we would release a short life bio weapon in China. permalink parent award report block reply LUXURY_USERNAME 4 points 3 days ago this guy might just be a CPP agent permalink parent award report block reply Hikedelics 2 points 3 days ago It sounds like at least 2/3 were Chinese. Possibly the third too. permalink parent award report block reply Skogin 1 points 3 days ago Wouldn’t want to make people uncomfy. permalink parent award report block reply Wexit-Delecto 2 points 3 days ago Or be rude. permalink parent award report block reply\nAggrieved03 10 points 3 days ago Easily hundreds of thousands. We find bio labs and do nothing but invaded a country over rumors of a bio lab a world away. permalink parent award report block reply KarenLukasik 5 points 3 days ago rumors that Nuland testified to? permalink parent award report block reply nautilus 3 points 3 days ago I think you meant to say \"we FUND bio labs and do nothing.\" permalink parent award report block reply Nanteen 2 points 3 days ago I wish we would release a short life bio weapon in China. permalink parent award report block reply\nKarenLukasik 5 points 3 days ago rumors that Nuland testified to? permalink parent award report block reply\nnautilus 3 points 3 days ago I think you meant to say \"we FUND bio labs and do nothing.\" permalink parent award report block reply\nNanteen 2 points 3 days ago I wish we would release a short life bio weapon in China. permalink parent award report block reply\nLUXURY_USERNAME 4 points 3 days ago this guy might just be a CPP agent permalink parent award report block reply\nHikedelics 2 points 3 days ago It sounds like at least 2/3 were Chinese. Possibly the third too. permalink parent award report block reply\nSkogin 1 points 3 days ago Wouldn’t want to make people uncomfy. permalink parent award report block reply Wexit-Delecto 2 points 3 days ago Or be rude. permalink parent award report block reply\nWexit-Delecto 2 points 3 days ago Or be rude. permalink parent award report block reply\nExecutarian2 13 points 3 days ago Execute him! permalink award report block reply bagel_fragility 4 points 3 days ago and his family. permalink parent award report block reply Hawksendoom 1 points 3 days ago start with any children first and then move your way up permalink parent award report block reply monkadelic 1 points 3 days ago wow, that is dark permalink parent award report block reply Hawksendoom 1 points 3 days ago and so is reality and you are no monk as you would know this permalink parent award report block reply schnazzmizzle 1 points 3 days ago I'm with you on this one. permalink parent award report block reply\nbagel_fragility 4 points 3 days ago and his family. permalink parent award report block reply Hawksendoom 1 points 3 days ago start with any children first and then move your way up permalink parent award report block reply monkadelic 1 points 3 days ago wow, that is dark permalink parent award report block reply Hawksendoom 1 points 3 days ago and so is reality and you are no monk as you would know this permalink parent award report block reply\nHawksendoom 1 points 3 days ago start with any children first and then move your way up permalink parent award report block reply monkadelic 1 points 3 days ago wow, that is dark permalink parent award report block reply Hawksendoom 1 points 3 days ago and so is reality and you are no monk as you would know this permalink parent award report block reply\nmonkadelic 1 points 3 days ago wow, that is dark permalink parent award report block reply Hawksendoom 1 points 3 days ago and so is reality and you are no monk as you would know this permalink parent award report block reply\nHawksendoom 1 points 3 days ago and so is reality and you are no monk as you would know this permalink parent award report block reply\nschnazzmizzle 1 points 3 days ago I'm with you on this one. permalink parent award report block reply\nSmurfection 8 points 3 days ago The stupid lefty feminists are just offering up America's young women to be raped, assaulted, harassed and murdered and those dumb clucks think abortion is going to solve this. No human problem was ever solved by killing human beings.  That just adds to the problem. permalink award report block reply Hawksendoom 2 points 3 days ago they will run towards them with their abortions in their hands! also nah i disagree, violence solves everything. looks at dead human. yeah it's solved. permalink parent award report block reply\nHawksendoom 2 points 3 days ago they will run towards them with their abortions in their hands! also nah i disagree, violence solves everything. looks at dead human. yeah it's solved. permalink parent award report block reply\nchinigga 6 points 3 days ago University of Spoiled Children University of Southern Compton University of Sedating Chinese permalink award report block reply guywholikesDjtof2024 2 points 3 days ago university of billions of years, and \"God is fake\" rhetoric. permalink parent award report block reply\nguywholikesDjtof2024 2 points 3 days ago university of billions of years, and \"God is fake\" rhetoric. permalink parent award report block reply\nlifeisahologram 6 points 3 days ago This is another example why open borders are bad. People traveling between them for work and school believe they are above laws. If one law they don’t like appears to be coming down, they just escape and leave. It’s not even just horrific stories like this. Debt too. You rack up 50k in debt in a new country and leave, nothing will happen to you. And it’s even worse in stories where people kill. Which is what so many Latin American illegal aliens are doing when they flee their countries in the first place, they murder, so they flee home and claim asylum here or other western countries using some random name and escape justice permalink award report block reply\nbagel_fragility 5 points 3 days ago open season on western civilization permalink award report block reply Kraken_V_Algorithm 3 points 3 days ago 2 of the victims were women he knew visiting from China.  The third was someone he knew living in the U.S. but also may have been Asian. permalink parent award report block reply Hawksendoom 2 points 3 days ago lets go to china and rape their women how would that work right? permalink parent award report block reply Wexit-Delecto 2 points 3 days ago You expect your enemies to send you rapists. If any of us tried that there we’d be quickly and unceremoniously executed behind the latrines. The question is why our side isn’t defending itself. permalink parent award report block reply Hawksendoom 2 points 3 days ago Nicely said permalink parent award report block reply bagel_fragility 2 points 3 days ago china would fly agents back to the USA to kill the whole family here permalink parent award report block reply Hawksendoom 1 points 3 days ago so we should too right? XD (looks up plane tickets) permalink parent award report block reply nautilus 2 points 3 days ago Why not just pretend to be a prominent US Rep and discuss politicy over dinner? permalink parent award report block reply\nKraken_V_Algorithm 3 points 3 days ago 2 of the victims were women he knew visiting from China.  The third was someone he knew living in the U.S. but also may have been Asian. permalink parent award report block reply\nHawksendoom 2 points 3 days ago lets go to china and rape their women how would that work right? permalink parent award report block reply Wexit-Delecto 2 points 3 days ago You expect your enemies to send you rapists. If any of us tried that there we’d be quickly and unceremoniously executed behind the latrines. The question is why our side isn’t defending itself. permalink parent award report block reply Hawksendoom 2 points 3 days ago Nicely said permalink parent award report block reply bagel_fragility 2 points 3 days ago china would fly agents back to the USA to kill the whole family here permalink parent award report block reply Hawksendoom 1 points 3 days ago so we should too right? XD (looks up plane tickets) permalink parent award report block reply nautilus 2 points 3 days ago Why not just pretend to be a prominent US Rep and discuss politicy over dinner? permalink parent award report block reply\nWexit-Delecto 2 points 3 days ago You expect your enemies to send you rapists. If any of us tried that there we’d be quickly and unceremoniously executed behind the latrines. The question is why our side isn’t defending itself. permalink parent award report block reply Hawksendoom 2 points 3 days ago Nicely said permalink parent award report block reply\nHawksendoom 2 points 3 days ago Nicely said permalink parent award report block reply\nbagel_fragility 2 points 3 days ago china would fly agents back to the USA to kill the whole family here permalink parent award report block reply Hawksendoom 1 points 3 days ago so we should too right? XD (looks up plane tickets) permalink parent award report block reply\nHawksendoom 1 points 3 days ago so we should too right? XD (looks up plane tickets) permalink parent award report block reply\nnautilus 2 points 3 days ago Why not just pretend to be a prominent US Rep and discuss politicy over dinner? permalink parent award report block reply\nguywholikesDjtof2024 5 points 3 days ago DEPORT THEM ALL FOREVER!! THEY MUST GO BACK!! permalink award report block reply Hawksendoom 2 points 3 days ago Deport? we are way past \"deport\" permalink parent award report block reply Wexit-Delecto 2 points 3 days ago Deport him…. TO HELL! permalink parent award report block reply\nHawksendoom 2 points 3 days ago Deport? we are way past \"deport\" permalink parent award report block reply Wexit-Delecto 2 points 3 days ago Deport him…. TO HELL! permalink parent award report block reply\nWexit-Delecto 2 points 3 days ago Deport him…. TO HELL! permalink parent award report block reply\nflp999 5 points 3 days ago We’re bringing a lot of people into the country that are raping our women. That’s an inexcusable sin of the highest order. permalink award report block reply Hawksendoom 4 points 3 days ago why? the dumb white liberal bitch karens voting for this let them enjoy their votes. permalink parent award report block reply IForgotToAddAnEmail 1 points 3 days ago Yeah, most men were warning them not to. They screamed they were oppressed left right and center. Women, the absolute problem. Take their vote away, don't let them 'lead' ever again. The old generation and women, sold this Country out so they could feel better about themselves. permalink parent award report block reply Hawksendoom 1 points 3 days ago thank you for your reply and i agree permalink parent award report block reply Kickass2001 1 points 3 days ago They weren’t our women. Two came with him from China. Another was also from China but did not travel with him. permalink parent award report block reply Kraken_V_Algorithm 1 points 3 days ago Why do people feel compelled to comment without reading the article? permalink parent award report block reply Blackmore 2 points 3 days ago Because they have room temperature IQ, and don’t think too much. permalink parent award report block reply RIPcharlie -1 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply indigo_truther 1 points 3 days ago wtf permalink parent award report block reply\nHawksendoom 4 points 3 days ago why? the dumb white liberal bitch karens voting for this let them enjoy their votes. permalink parent award report block reply IForgotToAddAnEmail 1 points 3 days ago Yeah, most men were warning them not to. They screamed they were oppressed left right and center. Women, the absolute problem. Take their vote away, don't let them 'lead' ever again. The old generation and women, sold this Country out so they could feel better about themselves. permalink parent award report block reply Hawksendoom 1 points 3 days ago thank you for your reply and i agree permalink parent award report block reply\nIForgotToAddAnEmail 1 points 3 days ago Yeah, most men were warning them not to. They screamed they were oppressed left right and center. Women, the absolute problem. Take their vote away, don't let them 'lead' ever again. The old generation and women, sold this Country out so they could feel better about themselves. permalink parent award report block reply Hawksendoom 1 points 3 days ago thank you for your reply and i agree permalink parent award report block reply\nHawksendoom 1 points 3 days ago thank you for your reply and i agree permalink parent award report block reply\nKickass2001 1 points 3 days ago They weren’t our women. Two came with him from China. Another was also from China but did not travel with him. permalink parent award report block reply\nKraken_V_Algorithm 1 points 3 days ago Why do people feel compelled to comment without reading the article? permalink parent award report block reply Blackmore 2 points 3 days ago Because they have room temperature IQ, and don’t think too much. permalink parent award report block reply\nBlackmore 2 points 3 days ago Because they have room temperature IQ, and don’t think too much. permalink parent award report block reply\nRIPcharlie -1 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply indigo_truther 1 points 3 days ago wtf permalink parent award report block reply\nindigo_truther 1 points 3 days ago wtf permalink parent award report block reply\nSenaleb 4 points 3 days ago LA will label him as a white man. permalink award report block reply\nFriar_Pede 4 points 3 days ago Victims were foreigners permalink award report block reply The_Emperor 3 points 3 days ago At least 2 traveling w him, and one let him onto her home\nAlso he's a sicko permalink parent award report block reply\nThe_Emperor 3 points 3 days ago At least 2 traveling w him, and one let him onto her home\nAlso he's a sicko permalink parent award report block reply\nRiehlpissed 3 points 3 days ago What secrets did he steal? permalink award report block reply Hawksendoom 2 points 3 days ago oh you know, the usual things that bill clinton didnt sell them. permalink parent award report block reply guywholikesDjtof2024 1 points 3 days ago yes. permalink parent award report block reply\nHawksendoom 2 points 3 days ago oh you know, the usual things that bill clinton didnt sell them. permalink parent award report block reply\nguywholikesDjtof2024 1 points 3 days ago yes. permalink parent award report block reply\nbn1856 2 points 3 days ago so newscum is giving him an award I presume permalink award report block reply\nLigersrule1 2 points 3 days ago Sum Ting Wong (yet again) permalink award report block reply ThurstonHowell4th 2 points 2 days ago Bang din Hoosegow permalink parent award report block reply\nThurstonHowell4th 2 points 2 days ago Bang din Hoosegow permalink parent award report block reply\nGreyKnight 2 points 3 days ago Deport them all, execute those who violently resist. permalink award report block reply\nMAGA1773 2 points 3 days ago Dr Rape. Awesome. permalink award report block reply Wexit-Delecto 2 points 3 days ago It’s Dr. Lape to you! permalink parent award report block reply\nWexit-Delecto 2 points 3 days ago It’s Dr. Lape to you! permalink parent award report block reply\nLive_free_or_die_55 2 points 3 days ago Hang the communist POS!!! permalink award report block reply\nrivetjoint2 1 points 3 days ago Penis so small, did they know they were raped? permalink award report block reply\nProbablyASockAccount 1 points 3 days ago And they didn't even notice because...you know... permalink award report block reply\nDr_Phil 1 points 3 days ago Yellow peril. permalink award report block reply\nParadigmShift2070 1 points 3 days ago Check his parents, they're either high communist party members or ultra rich (through ccp national business) permalink award report block reply\nKlaus73 1 points 3 days ago At least the offspring will be smarter then Muslims... permalink award report block reply\nRegistered 1 points 3 days ago Just gonna say that if this occurred in China and the role was played by a foreigner, he would be put to death pretty quickly permalink award report block reply\nXxxRDTPRNxxX 1 points 3 days ago University women. They're just mad their rapist wasn't black and had a tiny penis. permalink award report block reply\nRitchie_Blackadder 1 points 3 days ago Ancient Chinese secret, eh? permalink award report block reply\nGottaSitStand 1 points 3 days ago Oxford Study in reverse. permalink award report block reply\nDeltaSierra -8 points 3 days ago Comment removed upon the user being banned. permalink award report block reply SimaYi 5 points 3 days ago What the fuck is a racist? Is that some boomer shit? permalink parent award report block reply DeltaSierra -5 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply Whatyougotson 3 points 3 days ago Yeah chinese. Not american.. gtfo permalink parent award report block reply DeltaSierra -4 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply view 4 more comments... lifeisahologram 2 points 3 days ago It’s directly relevant because he is not an American, and in the article he explicitly said he would flee to China once he got bail (which is why they requested to deny his bail) this issue is a matter of immigration, and race and nationality because he was/is attempting to exploit a lack of extradition laws to escape justice for the women he raped. If we don’t acknowledge that and give him bail because we don’t want to be “racist” well, bye bye Bing Bong, I hope your victims can feel good knowing you are living as a wealthy Doctor in China with no consequences. permalink parent award report block reply DeltaSierra -1 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply view 1 more comments... DeltaSierra -2 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply Female 1 points 3 days ago We care a lot (faith no more) No seriously there are some very hardcore feminists here. Depends how you define feminism. Misandry? nah. I would love to kill rapists, and I'm sure that the General George Washington killed rapists. Legally through the law permalink parent award report block reply view 2 more comments... Hawksendoom 4 points 3 days ago would a muslim make it better for you or nah? permalink parent award report block reply DeltaSierra -1 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply Wexit-Delecto 1 points 3 days ago Western countries have more than enough criminals without importing the scum of the second and third world. They all need to go back, along with their sympathizers. permalink parent award report block reply\nSimaYi 5 points 3 days ago What the fuck is a racist? Is that some boomer shit? permalink parent award report block reply DeltaSierra -5 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply Whatyougotson 3 points 3 days ago Yeah chinese. Not american.. gtfo permalink parent award report block reply DeltaSierra -4 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply view 4 more comments... lifeisahologram 2 points 3 days ago It’s directly relevant because he is not an American, and in the article he explicitly said he would flee to China once he got bail (which is why they requested to deny his bail) this issue is a matter of immigration, and race and nationality because he was/is attempting to exploit a lack of extradition laws to escape justice for the women he raped. If we don’t acknowledge that and give him bail because we don’t want to be “racist” well, bye bye Bing Bong, I hope your victims can feel good knowing you are living as a wealthy Doctor in China with no consequences. permalink parent award report block reply DeltaSierra -1 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply view 1 more comments... DeltaSierra -2 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply Female 1 points 3 days ago We care a lot (faith no more) No seriously there are some very hardcore feminists here. Depends how you define feminism. Misandry? nah. I would love to kill rapists, and I'm sure that the General George Washington killed rapists. Legally through the law permalink parent award report block reply view 2 more comments...\nDeltaSierra -5 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply Whatyougotson 3 points 3 days ago Yeah chinese. Not american.. gtfo permalink parent award report block reply DeltaSierra -4 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply view 4 more comments... lifeisahologram 2 points 3 days ago It’s directly relevant because he is not an American, and in the article he explicitly said he would flee to China once he got bail (which is why they requested to deny his bail) this issue is a matter of immigration, and race and nationality because he was/is attempting to exploit a lack of extradition laws to escape justice for the women he raped. If we don’t acknowledge that and give him bail because we don’t want to be “racist” well, bye bye Bing Bong, I hope your victims can feel good knowing you are living as a wealthy Doctor in China with no consequences. permalink parent award report block reply DeltaSierra -1 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply view 1 more comments... DeltaSierra -2 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply Female 1 points 3 days ago We care a lot (faith no more) No seriously there are some very hardcore feminists here. Depends how you define feminism. Misandry? nah. I would love to kill rapists, and I'm sure that the General George Washington killed rapists. Legally through the law permalink parent award report block reply view 2 more comments...\nWhatyougotson 3 points 3 days ago Yeah chinese. Not american.. gtfo permalink parent award report block reply DeltaSierra -4 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply view 4 more comments...\nDeltaSierra -4 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply view 4 more comments...\nlifeisahologram 2 points 3 days ago It’s directly relevant because he is not an American, and in the article he explicitly said he would flee to China once he got bail (which is why they requested to deny his bail) this issue is a matter of immigration, and race and nationality because he was/is attempting to exploit a lack of extradition laws to escape justice for the women he raped. If we don’t acknowledge that and give him bail because we don’t want to be “racist” well, bye bye Bing Bong, I hope your victims can feel good knowing you are living as a wealthy Doctor in China with no consequences. permalink parent award report block reply DeltaSierra -1 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply view 1 more comments...\nDeltaSierra -1 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply view 1 more comments...\nDeltaSierra -2 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply Female 1 points 3 days ago We care a lot (faith no more) No seriously there are some very hardcore feminists here. Depends how you define feminism. Misandry? nah. I would love to kill rapists, and I'm sure that the General George Washington killed rapists. Legally through the law permalink parent award report block reply view 2 more comments...\nFemale 1 points 3 days ago We care a lot (faith no more) No seriously there are some very hardcore feminists here. Depends how you define feminism. Misandry? nah. I would love to kill rapists, and I'm sure that the General George Washington killed rapists. Legally through the law permalink parent award report block reply view 2 more comments...\nHawksendoom 4 points 3 days ago would a muslim make it better for you or nah? permalink parent award report block reply DeltaSierra -1 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply Wexit-Delecto 1 points 3 days ago Western countries have more than enough criminals without importing the scum of the second and third world. They all need to go back, along with their sympathizers. permalink parent award report block reply\nDeltaSierra -1 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply Wexit-Delecto 1 points 3 days ago Western countries have more than enough criminals without importing the scum of the second and third world. They all need to go back, along with their sympathizers. permalink parent award report block reply\nWexit-Delecto 1 points 3 days ago Western countries have more than enough criminals without importing the scum of the second and third world. They all need to go back, along with their sympathizers. permalink parent award report block reply"}