{"id": "1ARK9mFJ46", "contents": "141 A Muslim far-left extremist who severely beat a TPUSA attendee on the face after robbing him at UC Berkeley has been identified as Jihad Dphrepaulezz. \nThe 25-year-old listed CA Public Health as his employer and attends the Lighthouse Mosque in Oakland, Calif. posted 23 hours ago by Capoditutticapi1 13 comments award share report block Andy Ngo @MrAndyNgo • 1d A Muslim far-left extremist who severely beat a TPUSA attendee on the face after robbing him at UC Berkeley has been identified as Jihad Dphrepaulezz. The 25-year-old listed @CAPublicHealth as his employer. Dphrepaulezz is a rapper known as \"A.R. The Believer.\" He tried Andy Ngo @MrAndyNgo • 2d UC Berkeley (Nov. 10) — A far-left extremist stole a conservative man's necklace & then punched him repeatedly in the face when he tried to take it back outside the TPUSA event. The victim was bloodied, and the leftists racially mocked him for being white.\n13 comments Sort by Top Top New Worst Old Save DingleBalls 7 points 23 hours ago The muzzie's actually name is \"Jihad\" permalink award report block reply Filo76 4 points 22 hours ago Durka durka mohammed jihad permalink parent award report block reply TrumpMagaNoBama 1 points 21 hours ago jihad moehammud jihad Derka Derka! permalink parent award report block reply punkalicious 2 points 22 hours ago Imagine mingling at a party Hi, my name is Dave... and you are? Jihad I'm sorry... w-what's that again? Jihad ... Thinks to self I need a bomb sniffing German shepherd that is fed nothing but bacon permalink parent award report block reply 0illuminated1 7 points 23 hours ago Classic Jihad, what a silly goose he is. permalink award report block reply abstr4ct 6 points 22 hours ago so this is like, a \"hate\" crime right? permalink award report block reply genericamerican69 4 points 23 hours ago Another potential doctor or astronaut i presume permalink award report block reply abstr4ct 3 points 22 hours ago yes he was a astronaut doctor. permalink parent award report block reply Capoditutticapi1 OP 2 points 23 hours ago Was on his way to a PhD in \"Global Engineering\"... Must've been a field test today... permalink parent award report block reply Smashley 3 points 22 hours ago I'm so sick of the fags with cameras acting important. Cities suck. I'm not sure we we have them anymore. permalink award report block reply Prandogolio 3 points 22 hours ago The muslims and commies won't leave so they all need to be shot. permalink award report block reply me-no-likely3 2 points 19 hours ago Anybody else miss the Proud Boys? permalink award report block reply RYTHMICRIOT 1 points 22 hours ago Pam Bondi is \"looking into it\". permalink award report block reply\nDingleBalls 7 points 23 hours ago The muzzie's actually name is \"Jihad\" permalink award report block reply Filo76 4 points 22 hours ago Durka durka mohammed jihad permalink parent award report block reply TrumpMagaNoBama 1 points 21 hours ago jihad moehammud jihad Derka Derka! permalink parent award report block reply punkalicious 2 points 22 hours ago Imagine mingling at a party Hi, my name is Dave... and you are? Jihad I'm sorry... w-what's that again? Jihad ... Thinks to self I need a bomb sniffing German shepherd that is fed nothing but bacon permalink parent award report block reply\nFilo76 4 points 22 hours ago Durka durka mohammed jihad permalink parent award report block reply TrumpMagaNoBama 1 points 21 hours ago jihad moehammud jihad Derka Derka! permalink parent award report block reply\nTrumpMagaNoBama 1 points 21 hours ago jihad moehammud jihad Derka Derka! permalink parent award report block reply\npunkalicious 2 points 22 hours ago Imagine mingling at a party Hi, my name is Dave... and you are? Jihad I'm sorry... w-what's that again? Jihad ... Thinks to self I need a bomb sniffing German shepherd that is fed nothing but bacon permalink parent award report block reply\n0illuminated1 7 points 23 hours ago Classic Jihad, what a silly goose he is. permalink award report block reply\nabstr4ct 6 points 22 hours ago so this is like, a \"hate\" crime right? permalink award report block reply\ngenericamerican69 4 points 23 hours ago Another potential doctor or astronaut i presume permalink award report block reply abstr4ct 3 points 22 hours ago yes he was a astronaut doctor. permalink parent award report block reply Capoditutticapi1 OP 2 points 23 hours ago Was on his way to a PhD in \"Global Engineering\"... Must've been a field test today... permalink parent award report block reply\nabstr4ct 3 points 22 hours ago yes he was a astronaut doctor. permalink parent award report block reply\nCapoditutticapi1 OP 2 points 23 hours ago Was on his way to a PhD in \"Global Engineering\"... Must've been a field test today... permalink parent award report block reply\nSmashley 3 points 22 hours ago I'm so sick of the fags with cameras acting important. Cities suck. I'm not sure we we have them anymore. permalink award report block reply\nPrandogolio 3 points 22 hours ago The muslims and commies won't leave so they all need to be shot. permalink award report block reply\nme-no-likely3 2 points 19 hours ago Anybody else miss the Proud Boys? permalink award report block reply\nRYTHMICRIOT 1 points 22 hours ago Pam Bondi is \"looking into it\". permalink award report block reply"}