{"id": "1ARK9nPd3t", "contents": "58 America Needs to Follow Suit! (substack.com) posted 3 hours ago by SenorTrumper 3 comments award share report block JULIE LUVSMILE (@julieluvsmile) Russia is finalizing a groundbreaking law: stay-at-home moms will be recognized as officially employed, with maternity leave fully counting toward their pensions.  No more gaps in retirement savings for raising the next generation.  THIS is real support fo... substack.com\n3 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget Elencher 3 points 2 hours ago These Hungary/Russia pro family policies are great, but they work because they are both relatively homogeneous societies. We're already not even 50% white, similar polices in the US will just bring us down even faster. permalink award report block reply Ifeargovtmorethan 2 points 2 hours ago Yeah sorry but I'm not giving welfare sistas and mexican marias any more benefits for having kids ...... permalink award report block reply BenDoverAssho 2 points 3 hours ago At the same time, however,  1- close the border,\n2- greatly reduce legal immigration and restrict it to White Western people, and 3- ramp up mass deportations of illegal foreigners by a hundred-fold. permalink award report block reply\nElencher 3 points 2 hours ago These Hungary/Russia pro family policies are great, but they work because they are both relatively homogeneous societies. We're already not even 50% white, similar polices in the US will just bring us down even faster. permalink award report block reply\nIfeargovtmorethan 2 points 2 hours ago Yeah sorry but I'm not giving welfare sistas and mexican marias any more benefits for having kids ...... permalink award report block reply\nBenDoverAssho 2 points 3 hours ago At the same time, however,  1- close the border,\n2- greatly reduce legal immigration and restrict it to White Western people, and 3- ramp up mass deportations of illegal foreigners by a hundred-fold. permalink award report block reply"}