{"id": "1ARK56jqEf", "contents": "376 Trump deported roughly 145,000 in his first 6 months, as per ICE via FOIA. This is NOT mass deportation. posted 5 days ago by Crucible 52 comments award share download report block\n52 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno genericamerican69 19 points 5 days ago Biden imported 5 million in that time permalink award report block reply Toohershat 3 points 4 days ago True, and yet I'm sure it's important to understand the context - it's a lot easier to open the border and allow millions in than it is to organize mass deportations. Just like it's easier to destroy something than it is to build it. permalink parent award report block reply booblitchutz 1 points 4 days ago Well and with every lever of bureaucracy turned against deportations, too permalink parent award report block reply HoodooOperator 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply BurtMcGirt 16 points 5 days ago How many new illegals are being spawned every six months? Are we even reducing the number factoring in new ones getting in/overstaying visas/being spawned? permalink award report block reply snoopy3210 4 points 4 days ago There’s almost no addition, and Mark Dice forgot to mention the self deportations, which are real and massive. You also have to do it properly, as you don’t want to be stopped in court. It’s on a good pace. permalink parent award report block reply PegasoSeiya 5 points 4 days ago Self deportations are increasing like crazy. Before you would say you’re gonna fight your asylum case, get scheduled for 4 years later, and released. Now you don’t he released, assigned to the toughest judges (that are the ones assigned to detained clients) and end up\nEither detained for 4 months and then deported, or you can choose voluntary departure and get removed within a month to your country. Family usually follows permalink parent award report block reply BurtMcGirt 1 points 4 days ago If we are \"on a good pace\", approximately in which year will we be below the number of illegals who were here at the beginning of 2021? Also, I'm assuming \"no addition\" doesn't include illegals reproducing, which they do. permalink parent award report block reply Spiritof2015 11 points 5 days ago https://www.ice.gov/careers permalink award report block reply GainesvilleFlorida 6 points 4 days ago I know someone that applied over a month ago and hasn’t heard back or even an email. permalink parent award report block reply grassshrimp 11 points 5 days ago They aren't being deported fast enough! So elect Democrats to open the borders back up again! Republican logic. permalink award report block reply possibletower -3 points 5 days ago Mark Dice and OP are cucked faggots who are actually Democrats I also see no documentation proving the allegation. Showing that faggot Mark Dice's comment is not the FOIA document that supposedly proves the numbers. permalink parent award report block reply madisonmaga 2 points 4 days ago Dice is not saying that people shouldn't vote for GOP. He's warning that voters might not bother to vote for the GOP even though we need them to do so. There's a difference. permalink parent award report block reply RememberCharlieKirk 8 points 5 days ago Deportation is the compromise. Throughout history, invasions were met with physical (bloody) resistance. This modern sort of invaders do not realize how good they have it. permalink award report block reply Stolen 7 points 5 days ago 483 a day. That is way below 3000. permalink award report block reply Crucible OP 7 points 5 days ago 30,000 per day to make any significant difference. permalink parent award report block reply MastaJoda 2 points 4 days ago Yeah, but have you seen the egg prices, bigot? permalink parent award report block reply Roadpower 6 points 5 days ago It needs to be a conveyor belt. Or do the filibuster and set things up so that they are deporting themselves by the boatload. permalink award report block reply Seeker_17 5 points 5 days ago Disappointing. They should increase the pressure to get more self deportations. I also want them to focus on muzzies. permalink award report block reply genericamerican69 9 points 5 days ago They need to focus on Indians. They are cannibalising every industry and corporation. It's unbearable permalink parent award report block reply possibletower 2 points 5 days ago Especially Hindu Muslims. Not the copout \"Muslim Indians\" that the \"based Hindus\" keep trying to blame everything on. permalink parent award report block reply treadelsewhere 4 points 4 days ago It literally needs to be 2.5 million in 6 months, just to break even with Biden permalink award report block reply MastaJoda 2 points 4 days ago Best we can do is cheap eggs, bigot. Stop being a Nazi. permalink parent award report block reply Beaverstatemilitia 4 points 5 days ago This won’t due!  It will take a 100 years at this rate permalink award report block reply Scuffers 4 points 5 days ago and how many self deportations in the same 6  months? permalink award report block reply MastaJoda -1 points 4 days ago lol GTFOH here with that fucking bs!! permalink parent award report block reply Crucible OP -1 points 5 days ago There is no empirical data because some of them were expired or close to expiring visas. Just because someone leaves the country, it doesn't mean they were deported. So that two \"million self-deported\" is a lie, with zero evidence of it. It was just a press release, nothing else. permalink parent award report block reply Scuffers 2 points 4 days ago hang on a sec... so you're telling me there are no figures for how many people have used the CBP app to self deport? permalink parent award report block reply madisonmaga 3 points 4 days ago Mark Dice is one of the few public right-wing people saying what others are afraid to say. permalink award report block reply Abovethefray 3 points 4 days ago I was promised mass deportation. permalink award report block reply Ivleeeg 2 points 4 days ago It is. I don't know why you guys aren't understanding this. Prior deportation numbers included turn aways at the border. The purpose of the very public deportation show of force is to make people self deport, which they are. Overall, more than 2 million have left either voluntarily or forced. https://www.dhs.gov/news/2025/09/23/new-milestone-over-2-million-illegal-aliens-out-united-states-less-250-days permalink award report block reply DelendaEstMarxismo 2 points 4 days ago It's ridiculous how many people post bullshit without any sources and even more ridiculous how many upvote bullshit without ever checking it. The current numbers are 527,000 deportations plus another 1.6 million who have voluntarily self-deported. You can debate whether this is enough but stop mindlessly believing every low effort shitpost. https://www.dhs.gov/news/2025/10/27/dhs-removes-more-half-million-illegal-aliens-us permalink award report block reply Weezinglvl100 2 points 4 days ago Trump better get busy or maga will not exist by next year permalink award report block reply DeplorableDreg 2 points 4 days ago ICE is hiring. Hit the streets big guy.. time to do your part. permalink award report block reply Crucible OP 1 points 4 days ago Filled out the application months ago. No response, little guy. Now shut the fuck up. permalink parent award report block reply ShinAkuma 1 points 4 days ago We have only had 4 months with the BBB passed. The next 6 months will tell the true story on deportations. If that number has increased significantly by April 2026, we are in trouble. permalink award report block reply RINOssuck 1 points 4 days ago Bitch bitch bitch permalink award report block reply ReleasetheList 1 points 4 days ago So we were lied to about even that. permalink award report block reply MAG_n_KAG 1 points 4 days ago That's why I don't get the Homan glazing.  He talks big, but delivers on maybe 10% of what he says. permalink award report block reply PillarOfWisdom 1 points 4 days ago Exactly!  There isn't a single Republican I know who is happy at the pace of \"the plan\" and know we're running out of time. permalink award report block reply Spunas1 0 points 4 days ago They aren’t going anywhere. Who do you think is building all these data centers🤨? Don’t get me going on Construction and Infrastructure jobs. As an OTR step deck driver, It is obvious to me that this planned White obsolescence. Turns out the White power groups from the 70’s and 80’s were right after all. permalink award report block reply SanityGumby 0 points 4 days ago Mark Dice is a dishonest piece of shit historically so sorry, not going to just trust this idiot saying numbers at random especially since you are so niggardly to not even include the post permalink award report block reply possibletower 0 points 5 days ago Hey retarded OP. Where is the evidence proving your title? You show a photo of that faggot Mark Dice making a comment instead of the FOIA document. I see no documentation proving the allegation. Showing that faggot Mark Dice's comment is not the FOIA document that supposedly proves the numbers. permalink award report block reply ShinAkuma 1 points 4 days ago Dice is a patriot. He's just sounding the alarm on an obvious outcome for midterms is shit doesn't start ramping up. permalink parent award report block reply Crucible OP 0 points 5 days ago Do you have an internet you pea brained faggot? In July Newsweek filed a FOIA request because the administration refused to release their deportation numbers. The only previous release was from the last quarter of 2024 prior to the request. The whole fucking world knows about this except for you and you cry like a little bitch because you're too goddamned lazy and stupid to look it up yourself. I'm not your fucking Google librarian, shit for brains. permalink parent award report block reply DelendaEstMarxismo 2 points 4 days ago Don't get all hysterical like a woman because someone asked you to prove your allegations. I have an internet and what I see here is that there have been 527,000 deportations plus an additional 1.6 million who have voluntarily self-deported. https://www.dhs.gov/news/2025/10/27/dhs-removes-more-half-million-illegal-aliens-us permalink parent award report block reply Crucible OP -1 points 4 days ago That's a press release you imbecile. The cope with you guys is astounding. permalink parent award report block reply DelendaEstMarxismo 2 points 4 days ago And what do you have? Absolutely nothing. \"Trust me bro.\" The words of an idiot nobody. permalink parent award report block reply HeatherSwanson -1 points 5 days ago Duped by Homan. Lol. I told you so permalink award report block reply MediaBro -3 points 4 days ago You wil not get mass deportations because the US economy relies on their labour. The average American, and I mean genuinely the average American, who is living comfortably, isn't going to do the hard labour it takes to do the jobs needed. Of course it's because pay is terrible but really, it's because a lot of these jobs are also back breaking and the internet is a lot more fun. So Trump will mostly just target the violent ones and mostly keep the rest in the country. At least most of your illegals are Brown South and Central American Catholics and most are not violent and keep on the down low. Half these ppl are also going to join Mormon or Evangelical groups. Your actual real problem isn't really them - it's the legal migrants coming in, from your airports. Look around the neighbourhoods, where international airports are located and half are these neighborhoods are globalist slopfests. That's where the real powers that be play around. permalink award report block reply TheGoyimWhisperer 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply\ngenericamerican69 19 points 5 days ago Biden imported 5 million in that time permalink award report block reply Toohershat 3 points 4 days ago True, and yet I'm sure it's important to understand the context - it's a lot easier to open the border and allow millions in than it is to organize mass deportations. Just like it's easier to destroy something than it is to build it. permalink parent award report block reply booblitchutz 1 points 4 days ago Well and with every lever of bureaucracy turned against deportations, too permalink parent award report block reply HoodooOperator 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nToohershat 3 points 4 days ago True, and yet I'm sure it's important to understand the context - it's a lot easier to open the border and allow millions in than it is to organize mass deportations. Just like it's easier to destroy something than it is to build it. permalink parent award report block reply booblitchutz 1 points 4 days ago Well and with every lever of bureaucracy turned against deportations, too permalink parent award report block reply\nbooblitchutz 1 points 4 days ago Well and with every lever of bureaucracy turned against deportations, too permalink parent award report block reply\nHoodooOperator 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nBurtMcGirt 16 points 5 days ago How many new illegals are being spawned every six months? Are we even reducing the number factoring in new ones getting in/overstaying visas/being spawned? permalink award report block reply snoopy3210 4 points 4 days ago There’s almost no addition, and Mark Dice forgot to mention the self deportations, which are real and massive. You also have to do it properly, as you don’t want to be stopped in court. It’s on a good pace. permalink parent award report block reply PegasoSeiya 5 points 4 days ago Self deportations are increasing like crazy. Before you would say you’re gonna fight your asylum case, get scheduled for 4 years later, and released. Now you don’t he released, assigned to the toughest judges (that are the ones assigned to detained clients) and end up\nEither detained for 4 months and then deported, or you can choose voluntary departure and get removed within a month to your country. Family usually follows permalink parent award report block reply BurtMcGirt 1 points 4 days ago If we are \"on a good pace\", approximately in which year will we be below the number of illegals who were here at the beginning of 2021? Also, I'm assuming \"no addition\" doesn't include illegals reproducing, which they do. permalink parent award report block reply\nsnoopy3210 4 points 4 days ago There’s almost no addition, and Mark Dice forgot to mention the self deportations, which are real and massive. You also have to do it properly, as you don’t want to be stopped in court. It’s on a good pace. permalink parent award report block reply PegasoSeiya 5 points 4 days ago Self deportations are increasing like crazy. Before you would say you’re gonna fight your asylum case, get scheduled for 4 years later, and released. Now you don’t he released, assigned to the toughest judges (that are the ones assigned to detained clients) and end up\nEither detained for 4 months and then deported, or you can choose voluntary departure and get removed within a month to your country. Family usually follows permalink parent award report block reply BurtMcGirt 1 points 4 days ago If we are \"on a good pace\", approximately in which year will we be below the number of illegals who were here at the beginning of 2021? Also, I'm assuming \"no addition\" doesn't include illegals reproducing, which they do. permalink parent award report block reply\nPegasoSeiya 5 points 4 days ago Self deportations are increasing like crazy. Before you would say you’re gonna fight your asylum case, get scheduled for 4 years later, and released. Now you don’t he released, assigned to the toughest judges (that are the ones assigned to detained clients) and end up\nEither detained for 4 months and then deported, or you can choose voluntary departure and get removed within a month to your country. Family usually follows permalink parent award report block reply\nBurtMcGirt 1 points 4 days ago If we are \"on a good pace\", approximately in which year will we be below the number of illegals who were here at the beginning of 2021? Also, I'm assuming \"no addition\" doesn't include illegals reproducing, which they do. permalink parent award report block reply\nSpiritof2015 11 points 5 days ago https://www.ice.gov/careers permalink award report block reply GainesvilleFlorida 6 points 4 days ago I know someone that applied over a month ago and hasn’t heard back or even an email. permalink parent award report block reply\nGainesvilleFlorida 6 points 4 days ago I know someone that applied over a month ago and hasn’t heard back or even an email. permalink parent award report block reply\ngrassshrimp 11 points 5 days ago They aren't being deported fast enough! So elect Democrats to open the borders back up again! Republican logic. permalink award report block reply possibletower -3 points 5 days ago Mark Dice and OP are cucked faggots who are actually Democrats I also see no documentation proving the allegation. Showing that faggot Mark Dice's comment is not the FOIA document that supposedly proves the numbers. permalink parent award report block reply madisonmaga 2 points 4 days ago Dice is not saying that people shouldn't vote for GOP. He's warning that voters might not bother to vote for the GOP even though we need them to do so. There's a difference. permalink parent award report block reply\npossibletower -3 points 5 days ago Mark Dice and OP are cucked faggots who are actually Democrats I also see no documentation proving the allegation. Showing that faggot Mark Dice's comment is not the FOIA document that supposedly proves the numbers. permalink parent award report block reply madisonmaga 2 points 4 days ago Dice is not saying that people shouldn't vote for GOP. He's warning that voters might not bother to vote for the GOP even though we need them to do so. There's a difference. permalink parent award report block reply\nmadisonmaga 2 points 4 days ago Dice is not saying that people shouldn't vote for GOP. He's warning that voters might not bother to vote for the GOP even though we need them to do so. There's a difference. permalink parent award report block reply\nRememberCharlieKirk 8 points 5 days ago Deportation is the compromise. Throughout history, invasions were met with physical (bloody) resistance. This modern sort of invaders do not realize how good they have it. permalink award report block reply\nStolen 7 points 5 days ago 483 a day. That is way below 3000. permalink award report block reply Crucible OP 7 points 5 days ago 30,000 per day to make any significant difference. permalink parent award report block reply MastaJoda 2 points 4 days ago Yeah, but have you seen the egg prices, bigot? permalink parent award report block reply\nCrucible OP 7 points 5 days ago 30,000 per day to make any significant difference. permalink parent award report block reply\nMastaJoda 2 points 4 days ago Yeah, but have you seen the egg prices, bigot? permalink parent award report block reply\nRoadpower 6 points 5 days ago It needs to be a conveyor belt. Or do the filibuster and set things up so that they are deporting themselves by the boatload. permalink award report block reply\nSeeker_17 5 points 5 days ago Disappointing. They should increase the pressure to get more self deportations. I also want them to focus on muzzies. permalink award report block reply genericamerican69 9 points 5 days ago They need to focus on Indians. They are cannibalising every industry and corporation. It's unbearable permalink parent award report block reply possibletower 2 points 5 days ago Especially Hindu Muslims. Not the copout \"Muslim Indians\" that the \"based Hindus\" keep trying to blame everything on. permalink parent award report block reply\ngenericamerican69 9 points 5 days ago They need to focus on Indians. They are cannibalising every industry and corporation. It's unbearable permalink parent award report block reply possibletower 2 points 5 days ago Especially Hindu Muslims. Not the copout \"Muslim Indians\" that the \"based Hindus\" keep trying to blame everything on. permalink parent award report block reply\npossibletower 2 points 5 days ago Especially Hindu Muslims. Not the copout \"Muslim Indians\" that the \"based Hindus\" keep trying to blame everything on. permalink parent award report block reply\ntreadelsewhere 4 points 4 days ago It literally needs to be 2.5 million in 6 months, just to break even with Biden permalink award report block reply MastaJoda 2 points 4 days ago Best we can do is cheap eggs, bigot. Stop being a Nazi. permalink parent award report block reply\nMastaJoda 2 points 4 days ago Best we can do is cheap eggs, bigot. Stop being a Nazi. permalink parent award report block reply\nBeaverstatemilitia 4 points 5 days ago This won’t due!  It will take a 100 years at this rate permalink award report block reply\nScuffers 4 points 5 days ago and how many self deportations in the same 6  months? permalink award report block reply MastaJoda -1 points 4 days ago lol GTFOH here with that fucking bs!! permalink parent award report block reply Crucible OP -1 points 5 days ago There is no empirical data because some of them were expired or close to expiring visas. Just because someone leaves the country, it doesn't mean they were deported. So that two \"million self-deported\" is a lie, with zero evidence of it. It was just a press release, nothing else. permalink parent award report block reply Scuffers 2 points 4 days ago hang on a sec... so you're telling me there are no figures for how many people have used the CBP app to self deport? permalink parent award report block reply\nMastaJoda -1 points 4 days ago lol GTFOH here with that fucking bs!! permalink parent award report block reply\nCrucible OP -1 points 5 days ago There is no empirical data because some of them were expired or close to expiring visas. Just because someone leaves the country, it doesn't mean they were deported. So that two \"million self-deported\" is a lie, with zero evidence of it. It was just a press release, nothing else. permalink parent award report block reply Scuffers 2 points 4 days ago hang on a sec... so you're telling me there are no figures for how many people have used the CBP app to self deport? permalink parent award report block reply\nScuffers 2 points 4 days ago hang on a sec... so you're telling me there are no figures for how many people have used the CBP app to self deport? permalink parent award report block reply\nmadisonmaga 3 points 4 days ago Mark Dice is one of the few public right-wing people saying what others are afraid to say. permalink award report block reply\nAbovethefray 3 points 4 days ago I was promised mass deportation. permalink award report block reply\nIvleeeg 2 points 4 days ago It is. I don't know why you guys aren't understanding this. Prior deportation numbers included turn aways at the border. The purpose of the very public deportation show of force is to make people self deport, which they are. Overall, more than 2 million have left either voluntarily or forced. https://www.dhs.gov/news/2025/09/23/new-milestone-over-2-million-illegal-aliens-out-united-states-less-250-days permalink award report block reply\nDelendaEstMarxismo 2 points 4 days ago It's ridiculous how many people post bullshit without any sources and even more ridiculous how many upvote bullshit without ever checking it. The current numbers are 527,000 deportations plus another 1.6 million who have voluntarily self-deported. You can debate whether this is enough but stop mindlessly believing every low effort shitpost. https://www.dhs.gov/news/2025/10/27/dhs-removes-more-half-million-illegal-aliens-us permalink award report block reply\nWeezinglvl100 2 points 4 days ago Trump better get busy or maga will not exist by next year permalink award report block reply\nDeplorableDreg 2 points 4 days ago ICE is hiring. Hit the streets big guy.. time to do your part. permalink award report block reply Crucible OP 1 points 4 days ago Filled out the application months ago. No response, little guy. Now shut the fuck up. permalink parent award report block reply\nCrucible OP 1 points 4 days ago Filled out the application months ago. No response, little guy. Now shut the fuck up. permalink parent award report block reply\nShinAkuma 1 points 4 days ago We have only had 4 months with the BBB passed. The next 6 months will tell the true story on deportations. If that number has increased significantly by April 2026, we are in trouble. permalink award report block reply\nRINOssuck 1 points 4 days ago Bitch bitch bitch permalink award report block reply\nReleasetheList 1 points 4 days ago So we were lied to about even that. permalink award report block reply\nMAG_n_KAG 1 points 4 days ago That's why I don't get the Homan glazing.  He talks big, but delivers on maybe 10% of what he says. permalink award report block reply\nPillarOfWisdom 1 points 4 days ago Exactly!  There isn't a single Republican I know who is happy at the pace of \"the plan\" and know we're running out of time. permalink award report block reply\nSpunas1 0 points 4 days ago They aren’t going anywhere. Who do you think is building all these data centers🤨? Don’t get me going on Construction and Infrastructure jobs. As an OTR step deck driver, It is obvious to me that this planned White obsolescence. Turns out the White power groups from the 70’s and 80’s were right after all. permalink award report block reply\nSanityGumby 0 points 4 days ago Mark Dice is a dishonest piece of shit historically so sorry, not going to just trust this idiot saying numbers at random especially since you are so niggardly to not even include the post permalink award report block reply\npossibletower 0 points 5 days ago Hey retarded OP. Where is the evidence proving your title? You show a photo of that faggot Mark Dice making a comment instead of the FOIA document. I see no documentation proving the allegation. Showing that faggot Mark Dice's comment is not the FOIA document that supposedly proves the numbers. permalink award report block reply ShinAkuma 1 points 4 days ago Dice is a patriot. He's just sounding the alarm on an obvious outcome for midterms is shit doesn't start ramping up. permalink parent award report block reply Crucible OP 0 points 5 days ago Do you have an internet you pea brained faggot? In July Newsweek filed a FOIA request because the administration refused to release their deportation numbers. The only previous release was from the last quarter of 2024 prior to the request. The whole fucking world knows about this except for you and you cry like a little bitch because you're too goddamned lazy and stupid to look it up yourself. I'm not your fucking Google librarian, shit for brains. permalink parent award report block reply DelendaEstMarxismo 2 points 4 days ago Don't get all hysterical like a woman because someone asked you to prove your allegations. I have an internet and what I see here is that there have been 527,000 deportations plus an additional 1.6 million who have voluntarily self-deported. https://www.dhs.gov/news/2025/10/27/dhs-removes-more-half-million-illegal-aliens-us permalink parent award report block reply Crucible OP -1 points 4 days ago That's a press release you imbecile. The cope with you guys is astounding. permalink parent award report block reply DelendaEstMarxismo 2 points 4 days ago And what do you have? Absolutely nothing. \"Trust me bro.\" The words of an idiot nobody. permalink parent award report block reply\nShinAkuma 1 points 4 days ago Dice is a patriot. He's just sounding the alarm on an obvious outcome for midterms is shit doesn't start ramping up. permalink parent award report block reply\nCrucible OP 0 points 5 days ago Do you have an internet you pea brained faggot? In July Newsweek filed a FOIA request because the administration refused to release their deportation numbers. The only previous release was from the last quarter of 2024 prior to the request. The whole fucking world knows about this except for you and you cry like a little bitch because you're too goddamned lazy and stupid to look it up yourself. I'm not your fucking Google librarian, shit for brains. permalink parent award report block reply DelendaEstMarxismo 2 points 4 days ago Don't get all hysterical like a woman because someone asked you to prove your allegations. I have an internet and what I see here is that there have been 527,000 deportations plus an additional 1.6 million who have voluntarily self-deported. https://www.dhs.gov/news/2025/10/27/dhs-removes-more-half-million-illegal-aliens-us permalink parent award report block reply Crucible OP -1 points 4 days ago That's a press release you imbecile. The cope with you guys is astounding. permalink parent award report block reply DelendaEstMarxismo 2 points 4 days ago And what do you have? Absolutely nothing. \"Trust me bro.\" The words of an idiot nobody. permalink parent award report block reply\nDelendaEstMarxismo 2 points 4 days ago Don't get all hysterical like a woman because someone asked you to prove your allegations. I have an internet and what I see here is that there have been 527,000 deportations plus an additional 1.6 million who have voluntarily self-deported. https://www.dhs.gov/news/2025/10/27/dhs-removes-more-half-million-illegal-aliens-us permalink parent award report block reply Crucible OP -1 points 4 days ago That's a press release you imbecile. The cope with you guys is astounding. permalink parent award report block reply DelendaEstMarxismo 2 points 4 days ago And what do you have? Absolutely nothing. \"Trust me bro.\" The words of an idiot nobody. permalink parent award report block reply\nCrucible OP -1 points 4 days ago That's a press release you imbecile. The cope with you guys is astounding. permalink parent award report block reply DelendaEstMarxismo 2 points 4 days ago And what do you have? Absolutely nothing. \"Trust me bro.\" The words of an idiot nobody. permalink parent award report block reply\nDelendaEstMarxismo 2 points 4 days ago And what do you have? Absolutely nothing. \"Trust me bro.\" The words of an idiot nobody. permalink parent award report block reply\nHeatherSwanson -1 points 5 days ago Duped by Homan. Lol. I told you so permalink award report block reply\nMediaBro -3 points 4 days ago You wil not get mass deportations because the US economy relies on their labour. The average American, and I mean genuinely the average American, who is living comfortably, isn't going to do the hard labour it takes to do the jobs needed. Of course it's because pay is terrible but really, it's because a lot of these jobs are also back breaking and the internet is a lot more fun. So Trump will mostly just target the violent ones and mostly keep the rest in the country. At least most of your illegals are Brown South and Central American Catholics and most are not violent and keep on the down low. Half these ppl are also going to join Mormon or Evangelical groups. Your actual real problem isn't really them - it's the legal migrants coming in, from your airports. Look around the neighbourhoods, where international airports are located and half are these neighborhoods are globalist slopfests. That's where the real powers that be play around. permalink award report block reply\nTheGoyimWhisperer 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply"}