{"id": "1ARK9oYZoX", "contents": "106 📣 𝐌𝐢𝐤𝐞 𝐉𝐨𝐡𝐧𝐬𝐨𝐧: \"The Democrats were responsible for this… they openly admitted that they used the American people as leverage in this political game. They knew that it would cause that pain to the people, and they did it anyway.\" THE  BADDIES posted 13 hours ago by TheRedPilledArtist 5 comments award share report block Mario Nawfal @MarioNawfal • 13h 🚨🇺🇸 SPEAKER MIKE JOHNSON: THE DEM SHUTDOWN IS FINALLY OVER “The Democrats were responsible for this… they openly admitted that they used the American people as leverage in this political game. They knew that it would cause that pain to the people, and they did it anyway. Mario Nawfal @MarioNawfal • 13h 🇺🇸 SPEAKER JOHNSON: I AM VERY ANGRY ABOUT THAT LAST-MINUTE PROVISION PUT IN THE RESOLUTION \"I did call Leader Thune this morning. I want to say that he is a principled leader. I've enjoyed working with him. We've had a great working relationship and a good friendship.\n5 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Save on Your Electric Bill (Try Tonight) GadgetCyno SERP-SERP 3 points 11 hours ago What was the last minute addition? permalink award report block reply hazelknut 1 points 2 hours ago a 500,000.00 (payment?) to the senators because they were spied on. pigs to the slop. permalink parent award report block reply Brinakitis 1 points 11 hours ago So end the filibuster? Nah that sounds like work permalink award report block reply Aggrieved03 1 points 12 hours ago Aren’t see just continuing Democrat spending? permalink award report block reply hazelknut 1 points 2 hours ago We needed Hulk Hogan. We got Mr. Rogers. permalink award report block reply\nSERP-SERP 3 points 11 hours ago What was the last minute addition? permalink award report block reply hazelknut 1 points 2 hours ago a 500,000.00 (payment?) to the senators because they were spied on. pigs to the slop. permalink parent award report block reply\nhazelknut 1 points 2 hours ago a 500,000.00 (payment?) to the senators because they were spied on. pigs to the slop. permalink parent award report block reply\nBrinakitis 1 points 11 hours ago So end the filibuster? Nah that sounds like work permalink award report block reply\nAggrieved03 1 points 12 hours ago Aren’t see just continuing Democrat spending? permalink award report block reply\nhazelknut 1 points 2 hours ago We needed Hulk Hogan. We got Mr. Rogers. permalink award report block reply"}