{"id": "1ARK55cGWm", "contents": "303 😡The entire system is Abuse Fraud and Waste. 100% treason. END H-1B NOW!!!! TREASON posted 5 days ago by GodIsPerfect 4 comments award share report block Eric Daugherty @EricLDaugh • 5d 🚨 JUST IN: The Trump administration now has at least 175 investigations into H-1B VISA ABUSE by companies seeking to replace American jobs with foreigners. Good. We need MORE!\n4 comments Sort by Top Top New Worst Old Save magnokor 8 points 5 days ago No. Not nice to say. Not abuse and fraud. It is complete replacement. The backdoor citizenship loophole. You need zero skilled Third Worlders. There are no skilled Third Worlders. If anyone in that area had a skill, the Third World would not be the disaster it is. permalink award report block reply Awakened 6 points 5 days ago What we need are arrests. Lots of arrests and he may start seeing his support come back. Though if he really wanted his support to take off again, just end the damn thing. permalink award report block reply CommanderOfCheese 2 points 5 days ago Investigations? We need PROSECUTIONS. permalink award report block reply Cville123 2 points 5 days ago Just state renewals are 150k.  End this. permalink award report block reply\nmagnokor 8 points 5 days ago No. Not nice to say. Not abuse and fraud. It is complete replacement. The backdoor citizenship loophole. You need zero skilled Third Worlders. There are no skilled Third Worlders. If anyone in that area had a skill, the Third World would not be the disaster it is. permalink award report block reply\nAwakened 6 points 5 days ago What we need are arrests. Lots of arrests and he may start seeing his support come back. Though if he really wanted his support to take off again, just end the damn thing. permalink award report block reply\nCommanderOfCheese 2 points 5 days ago Investigations? We need PROSECUTIONS. permalink award report block reply\nCville123 2 points 5 days ago Just state renewals are 150k.  End this. permalink award report block reply"}