{"id": "1ARK9oWNYP", "contents": "553 John fetterman appears on CNN to say that the far left is a much more bitter poison than the far right. CNN rees. posted 2 hours ago by PatriotSam 46 comments award share report block Jason Cohen 🇺🇸 @JasonJournoDC • 6h 🚨NEW: John Fetterman *STUNS* CNN's Dana Bash by telling her how Left crueler than Right🚨 FETTERMAN: \"The Right would say really rough things and names ... but on the Left, it was like they want me to die or that 'We're cheering for your next stroke' ... they even have a gif\n46 comments Sort by Top Top New Worst Old Save Ikon 27 points 2 hours ago Are we seeing a correlation with you need to have a stroke to finally stop being a brain dead democrat? permalink award report block reply MedicallyReddit 15 points 2 hours ago Maybe it caused some kind of short circuit or rewiring permalink parent award report block reply whataboob 10 points 2 hours ago An experience, a shock to the system, especially a tragedy of some sort, will often lead people to “wake up” and reassess reality. *No idea if that happened here, but lately when I see a clip of this guy speak, I’m not kidding, it brings me to the verge of tears of joy and sadness, that this guy is so sincere, that it’s so needed, and that it’s in such short supply. It’s so basic what he’s saying, and it’s shocking how honest and sincere he is and so contrarian to the psychotic party line, and that his “democrat” team actually told him the truth (sounds like they’re getting redpilled also…). It’s like MTG and this guy, and sometimes I feel like this guy comes off even more sincere. permalink parent award report block reply Sparks1017 2 points 1 hour ago I agree, he's written a book about  all he's gone through, called Unfettered, which I have to admit is a great title, Think I will see if library has it, i'd like to read it, but I'm not willing to buy it permalink parent award report block reply wartooth6 3 points 1 hour ago Or the near-death experience made him rethink some things. permalink parent award report block reply BastardSonOfCastro 1 points 38 minutes ago You know if he did die, they would blame Republicans... While they were the ones cheering for it! permalink parent award report block reply Here_we_go 1 points 2 hours ago He still votes in lockstep with dems. permalink parent award report block reply fskfsk 2 points 1 hour ago He was voting against the shutdown back in September. permalink parent award report block reply daveyistheman 1 points 1 hour ago No, not lockstep permalink parent award report block reply LibtardBusterMAGA 4 points 2 hours ago Your comment made me chuckle and the answer is yes. Yes, a democrat has to stroke out to snap out of it. permalink parent award report block reply Tacitus1963 4 points 2 hours ago That seems to be the case!\nLiberalism is a mental disorder.\nN/J permalink parent award report block reply IncredibleMrE1 2 points 2 hours ago Fetterlump = Manchin, blue dog rope-a-doper. permalink parent award report block reply Modernturnkey 1 points 2 minutes ago Head injuries have a direct correlation with increased levels of racism. Hence the term \"knock some sense into\" a person. permalink parent award report block reply load 4 more comments... peterstrzoked 17 points 2 hours ago Why does he do all his interviews from inside a dungeon? permalink award report block reply guywholikesDjtof2024 18 points 2 hours ago Because Charles Kirk didn't. That's why. permalink parent award report block reply TrumpNeverBarked 1 points 2 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply Here_we_go 8 points 2 hours ago Thats his house. Its a renovated car shop or some bs. \"Working man\" thats really a trust fund baby. permalink parent award report block reply Afeazo 2 points 2 hours ago Mom and dad never got around to finishing the basement he lives in permalink parent award report block reply Rob_Belmonte 2 points 1 hour ago He can't leave until the Baby Ruth drops through the hatch. permalink parent award report block reply EuphoricTrillby 14 points 2 hours ago Fetterman represents the biggest swing state. Even his stroke-struck brain knows moderates still carry such elections. permalink award report block reply Sparks1017 3 points 1 hour ago Yes, he's said that very thing in an interview I saw yesterday, and he commented that Pa. is a purple state and crucial in the electoral college,  unlike other solid blue states. But still I have to love him calling out the other ghouls permalink parent award report block reply whataboob 1 points 2 hours ago Yeah, but if he’s just playing politics, he’s really stepping over the line here I think. Like, I think they can’t just go on CNN for example and start saying “well look guys, it’s just that we’re fake news and they’re not” just to score some points with moderates. It feels like saying “the left is more vitriolic and violent” than the right is a big no no. Eh? permalink parent award report block reply NotYourMan 10 points 2 hours ago The number of violent attacks by democrats is 1000 times more than republicans. permalink award report block reply guywholikesDjtof2024 5 points 2 hours ago Kirk permalink parent award report block reply PatriotSam OP 4 points 2 hours ago Far right guy: calls you a naughty word maybe smacks you in the face if you piss him off enough. Far left guy: engraves bullets and shoots you in the neck while you are peacefully speaking to other college kids. permalink parent award report block reply kippo_hard 6 points 2 hours ago Broken clocks are right twice a day. permalink award report block reply Aquamine-Amarine 5 points 2 hours ago He's trying really hard to be a moderate, huh. permalink award report block reply PatriotSam OP 4 points 2 hours ago Pennsylvania is moving to the right, he has no choice if he wants to be a life senator and they all want to be life senators permalink parent award report block reply Sparks1017 4 points 1 hour ago We all thought he would be terrible, brain damaged from a stroke, and he turns out to be the most sane of all these demons permalink award report block reply Apersonofinterest 2 points 2 hours ago Dana Bash knows the left is more violent and nasty. She pretends not to know but after all of the celebrations after Charlie Kirk, it’s pretty hard to deny with a straight face. permalink award report block reply SavingPrivateGrace 2 points 2 hours ago He's around the bitterest of leftists.  All that misery made him a changed man.  He's the only Democrat that wants them all to be Republican while he remains the Democrat leader.  He should change Parties before he gets primarried by the D's. permalink award report block reply PatriotSam OP 2 points 2 hours ago The biggest irony is that the left wing did everything they could to hide the fact that he had a stroke mid campaign, only for him to turn on them permalink parent award report block reply DonsChair 2 points 2 hours ago Welcome to your own party of Satan, John! permalink award report block reply switchhand 2 points 1 hour ago It wasn't on my bingo card, but I think Fetterman actually recognizes how insane the modern left is and just can't perform the mental gymnastics required to defend their ideology. permalink award report block reply Ivleeeg 2 points 2 hours ago He's wrong. They're the same bitter poison. But the far left is inches from power while the far right is miles away. permalink award report block reply utfanx2 1 points 4 minutes ago If they were smart they would rally behind RFK Jr. permalink award report block reply wartooth6 1 points 1 hour ago Next on CNN: John Fetterman's main body double says the leftists of Bluesky are actually the most kindest, supportive community on the internet, body double #2 disagrees and says reddit is even kinder and gentler permalink award report block reply Viejoconfiable 1 points 16 minutes ago I like how he is incapable of evading a question and just answers it. Never got to see him pre stroke, don’t wish that on anyone. permalink award report block reply 45fan 1 points 1 hour ago Fetterman talks to a horse who says, \"Neiiigh!\" permalink award report block reply Herc130 1 points 10 minutes ago The guy with brain damage explaining things to people with no brains! THEY are making progress. permalink award report block reply lukenator1 1 points 1 hour ago sad but true probably permalink award report block reply DJT4MoreYears 1 points 20 minutes ago This Dana Schwartz is trying to primary Fetterman for the Democrats next election. She's trying to show all the left that Fetterman is not on their side so he'll be voted out..because sometimes Fetterman will occasionally have a brain fart moment and actually vote for something that's common sense and not full blown lefty. permalink award report block reply Mhmm2MoreWeeks -1 points 2 hours ago Both are lower life forms. The left just attracts more of them. permalink award report block reply guywholikesDjtof2024 4 points 2 hours ago The more right you go,  the freer you get. Facism belongs on the left. Ditch the communist propaganda the MSM keeps promoting that \"facism/nazzissm is on the Right\", because it isn't. permalink parent award report block reply clearasabell 1 points 2 hours ago Comment removed by community moderators. permalink award report block reply\nIkon 27 points 2 hours ago Are we seeing a correlation with you need to have a stroke to finally stop being a brain dead democrat? permalink award report block reply MedicallyReddit 15 points 2 hours ago Maybe it caused some kind of short circuit or rewiring permalink parent award report block reply whataboob 10 points 2 hours ago An experience, a shock to the system, especially a tragedy of some sort, will often lead people to “wake up” and reassess reality. *No idea if that happened here, but lately when I see a clip of this guy speak, I’m not kidding, it brings me to the verge of tears of joy and sadness, that this guy is so sincere, that it’s so needed, and that it’s in such short supply. It’s so basic what he’s saying, and it’s shocking how honest and sincere he is and so contrarian to the psychotic party line, and that his “democrat” team actually told him the truth (sounds like they’re getting redpilled also…). It’s like MTG and this guy, and sometimes I feel like this guy comes off even more sincere. permalink parent award report block reply Sparks1017 2 points 1 hour ago I agree, he's written a book about  all he's gone through, called Unfettered, which I have to admit is a great title, Think I will see if library has it, i'd like to read it, but I'm not willing to buy it permalink parent award report block reply wartooth6 3 points 1 hour ago Or the near-death experience made him rethink some things. permalink parent award report block reply BastardSonOfCastro 1 points 38 minutes ago You know if he did die, they would blame Republicans... While they were the ones cheering for it! permalink parent award report block reply Here_we_go 1 points 2 hours ago He still votes in lockstep with dems. permalink parent award report block reply fskfsk 2 points 1 hour ago He was voting against the shutdown back in September. permalink parent award report block reply daveyistheman 1 points 1 hour ago No, not lockstep permalink parent award report block reply LibtardBusterMAGA 4 points 2 hours ago Your comment made me chuckle and the answer is yes. Yes, a democrat has to stroke out to snap out of it. permalink parent award report block reply Tacitus1963 4 points 2 hours ago That seems to be the case!\nLiberalism is a mental disorder.\nN/J permalink parent award report block reply IncredibleMrE1 2 points 2 hours ago Fetterlump = Manchin, blue dog rope-a-doper. permalink parent award report block reply Modernturnkey 1 points 2 minutes ago Head injuries have a direct correlation with increased levels of racism. Hence the term \"knock some sense into\" a person. permalink parent award report block reply load 4 more comments...\nMedicallyReddit 15 points 2 hours ago Maybe it caused some kind of short circuit or rewiring permalink parent award report block reply whataboob 10 points 2 hours ago An experience, a shock to the system, especially a tragedy of some sort, will often lead people to “wake up” and reassess reality. *No idea if that happened here, but lately when I see a clip of this guy speak, I’m not kidding, it brings me to the verge of tears of joy and sadness, that this guy is so sincere, that it’s so needed, and that it’s in such short supply. It’s so basic what he’s saying, and it’s shocking how honest and sincere he is and so contrarian to the psychotic party line, and that his “democrat” team actually told him the truth (sounds like they’re getting redpilled also…). It’s like MTG and this guy, and sometimes I feel like this guy comes off even more sincere. permalink parent award report block reply Sparks1017 2 points 1 hour ago I agree, he's written a book about  all he's gone through, called Unfettered, which I have to admit is a great title, Think I will see if library has it, i'd like to read it, but I'm not willing to buy it permalink parent award report block reply wartooth6 3 points 1 hour ago Or the near-death experience made him rethink some things. permalink parent award report block reply BastardSonOfCastro 1 points 38 minutes ago You know if he did die, they would blame Republicans... While they were the ones cheering for it! permalink parent award report block reply Here_we_go 1 points 2 hours ago He still votes in lockstep with dems. permalink parent award report block reply fskfsk 2 points 1 hour ago He was voting against the shutdown back in September. permalink parent award report block reply daveyistheman 1 points 1 hour ago No, not lockstep permalink parent award report block reply\nwhataboob 10 points 2 hours ago An experience, a shock to the system, especially a tragedy of some sort, will often lead people to “wake up” and reassess reality. *No idea if that happened here, but lately when I see a clip of this guy speak, I’m not kidding, it brings me to the verge of tears of joy and sadness, that this guy is so sincere, that it’s so needed, and that it’s in such short supply. It’s so basic what he’s saying, and it’s shocking how honest and sincere he is and so contrarian to the psychotic party line, and that his “democrat” team actually told him the truth (sounds like they’re getting redpilled also…). It’s like MTG and this guy, and sometimes I feel like this guy comes off even more sincere. permalink parent award report block reply Sparks1017 2 points 1 hour ago I agree, he's written a book about  all he's gone through, called Unfettered, which I have to admit is a great title, Think I will see if library has it, i'd like to read it, but I'm not willing to buy it permalink parent award report block reply\nSparks1017 2 points 1 hour ago I agree, he's written a book about  all he's gone through, called Unfettered, which I have to admit is a great title, Think I will see if library has it, i'd like to read it, but I'm not willing to buy it permalink parent award report block reply\nwartooth6 3 points 1 hour ago Or the near-death experience made him rethink some things. permalink parent award report block reply BastardSonOfCastro 1 points 38 minutes ago You know if he did die, they would blame Republicans... While they were the ones cheering for it! permalink parent award report block reply\nBastardSonOfCastro 1 points 38 minutes ago You know if he did die, they would blame Republicans... While they were the ones cheering for it! permalink parent award report block reply\nHere_we_go 1 points 2 hours ago He still votes in lockstep with dems. permalink parent award report block reply fskfsk 2 points 1 hour ago He was voting against the shutdown back in September. permalink parent award report block reply daveyistheman 1 points 1 hour ago No, not lockstep permalink parent award report block reply\nfskfsk 2 points 1 hour ago He was voting against the shutdown back in September. permalink parent award report block reply\ndaveyistheman 1 points 1 hour ago No, not lockstep permalink parent award report block reply\nLibtardBusterMAGA 4 points 2 hours ago Your comment made me chuckle and the answer is yes. Yes, a democrat has to stroke out to snap out of it. permalink parent award report block reply\nTacitus1963 4 points 2 hours ago That seems to be the case!\nLiberalism is a mental disorder.\nN/J permalink parent award report block reply\nIncredibleMrE1 2 points 2 hours ago Fetterlump = Manchin, blue dog rope-a-doper. permalink parent award report block reply\nModernturnkey 1 points 2 minutes ago Head injuries have a direct correlation with increased levels of racism. Hence the term \"knock some sense into\" a person. permalink parent award report block reply\npeterstrzoked 17 points 2 hours ago Why does he do all his interviews from inside a dungeon? permalink award report block reply guywholikesDjtof2024 18 points 2 hours ago Because Charles Kirk didn't. That's why. permalink parent award report block reply TrumpNeverBarked 1 points 2 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply Here_we_go 8 points 2 hours ago Thats his house. Its a renovated car shop or some bs. \"Working man\" thats really a trust fund baby. permalink parent award report block reply Afeazo 2 points 2 hours ago Mom and dad never got around to finishing the basement he lives in permalink parent award report block reply Rob_Belmonte 2 points 1 hour ago He can't leave until the Baby Ruth drops through the hatch. permalink parent award report block reply\nguywholikesDjtof2024 18 points 2 hours ago Because Charles Kirk didn't. That's why. permalink parent award report block reply TrumpNeverBarked 1 points 2 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply\nTrumpNeverBarked 1 points 2 hours ago Comment removed by community filter, pending further review. permalink parent award report block reply\nHere_we_go 8 points 2 hours ago Thats his house. Its a renovated car shop or some bs. \"Working man\" thats really a trust fund baby. permalink parent award report block reply\nAfeazo 2 points 2 hours ago Mom and dad never got around to finishing the basement he lives in permalink parent award report block reply\nRob_Belmonte 2 points 1 hour ago He can't leave until the Baby Ruth drops through the hatch. permalink parent award report block reply\nEuphoricTrillby 14 points 2 hours ago Fetterman represents the biggest swing state. Even his stroke-struck brain knows moderates still carry such elections. permalink award report block reply Sparks1017 3 points 1 hour ago Yes, he's said that very thing in an interview I saw yesterday, and he commented that Pa. is a purple state and crucial in the electoral college,  unlike other solid blue states. But still I have to love him calling out the other ghouls permalink parent award report block reply whataboob 1 points 2 hours ago Yeah, but if he’s just playing politics, he’s really stepping over the line here I think. Like, I think they can’t just go on CNN for example and start saying “well look guys, it’s just that we’re fake news and they’re not” just to score some points with moderates. It feels like saying “the left is more vitriolic and violent” than the right is a big no no. Eh? permalink parent award report block reply\nSparks1017 3 points 1 hour ago Yes, he's said that very thing in an interview I saw yesterday, and he commented that Pa. is a purple state and crucial in the electoral college,  unlike other solid blue states. But still I have to love him calling out the other ghouls permalink parent award report block reply\nwhataboob 1 points 2 hours ago Yeah, but if he’s just playing politics, he’s really stepping over the line here I think. Like, I think they can’t just go on CNN for example and start saying “well look guys, it’s just that we’re fake news and they’re not” just to score some points with moderates. It feels like saying “the left is more vitriolic and violent” than the right is a big no no. Eh? permalink parent award report block reply\nNotYourMan 10 points 2 hours ago The number of violent attacks by democrats is 1000 times more than republicans. permalink award report block reply guywholikesDjtof2024 5 points 2 hours ago Kirk permalink parent award report block reply PatriotSam OP 4 points 2 hours ago Far right guy: calls you a naughty word maybe smacks you in the face if you piss him off enough. Far left guy: engraves bullets and shoots you in the neck while you are peacefully speaking to other college kids. permalink parent award report block reply\nguywholikesDjtof2024 5 points 2 hours ago Kirk permalink parent award report block reply\nPatriotSam OP 4 points 2 hours ago Far right guy: calls you a naughty word maybe smacks you in the face if you piss him off enough. Far left guy: engraves bullets and shoots you in the neck while you are peacefully speaking to other college kids. permalink parent award report block reply\nkippo_hard 6 points 2 hours ago Broken clocks are right twice a day. permalink award report block reply\nAquamine-Amarine 5 points 2 hours ago He's trying really hard to be a moderate, huh. permalink award report block reply PatriotSam OP 4 points 2 hours ago Pennsylvania is moving to the right, he has no choice if he wants to be a life senator and they all want to be life senators permalink parent award report block reply\nPatriotSam OP 4 points 2 hours ago Pennsylvania is moving to the right, he has no choice if he wants to be a life senator and they all want to be life senators permalink parent award report block reply\nSparks1017 4 points 1 hour ago We all thought he would be terrible, brain damaged from a stroke, and he turns out to be the most sane of all these demons permalink award report block reply\nApersonofinterest 2 points 2 hours ago Dana Bash knows the left is more violent and nasty. She pretends not to know but after all of the celebrations after Charlie Kirk, it’s pretty hard to deny with a straight face. permalink award report block reply\nSavingPrivateGrace 2 points 2 hours ago He's around the bitterest of leftists.  All that misery made him a changed man.  He's the only Democrat that wants them all to be Republican while he remains the Democrat leader.  He should change Parties before he gets primarried by the D's. permalink award report block reply PatriotSam OP 2 points 2 hours ago The biggest irony is that the left wing did everything they could to hide the fact that he had a stroke mid campaign, only for him to turn on them permalink parent award report block reply\nPatriotSam OP 2 points 2 hours ago The biggest irony is that the left wing did everything they could to hide the fact that he had a stroke mid campaign, only for him to turn on them permalink parent award report block reply\nDonsChair 2 points 2 hours ago Welcome to your own party of Satan, John! permalink award report block reply\nswitchhand 2 points 1 hour ago It wasn't on my bingo card, but I think Fetterman actually recognizes how insane the modern left is and just can't perform the mental gymnastics required to defend their ideology. permalink award report block reply\nIvleeeg 2 points 2 hours ago He's wrong. They're the same bitter poison. But the far left is inches from power while the far right is miles away. permalink award report block reply\nutfanx2 1 points 4 minutes ago If they were smart they would rally behind RFK Jr. permalink award report block reply\nwartooth6 1 points 1 hour ago Next on CNN: John Fetterman's main body double says the leftists of Bluesky are actually the most kindest, supportive community on the internet, body double #2 disagrees and says reddit is even kinder and gentler permalink award report block reply\nViejoconfiable 1 points 16 minutes ago I like how he is incapable of evading a question and just answers it. Never got to see him pre stroke, don’t wish that on anyone. permalink award report block reply\n45fan 1 points 1 hour ago Fetterman talks to a horse who says, \"Neiiigh!\" permalink award report block reply\nHerc130 1 points 10 minutes ago The guy with brain damage explaining things to people with no brains! THEY are making progress. permalink award report block reply\nlukenator1 1 points 1 hour ago sad but true probably permalink award report block reply\nDJT4MoreYears 1 points 20 minutes ago This Dana Schwartz is trying to primary Fetterman for the Democrats next election. She's trying to show all the left that Fetterman is not on their side so he'll be voted out..because sometimes Fetterman will occasionally have a brain fart moment and actually vote for something that's common sense and not full blown lefty. permalink award report block reply\nMhmm2MoreWeeks -1 points 2 hours ago Both are lower life forms. The left just attracts more of them. permalink award report block reply guywholikesDjtof2024 4 points 2 hours ago The more right you go,  the freer you get. Facism belongs on the left. Ditch the communist propaganda the MSM keeps promoting that \"facism/nazzissm is on the Right\", because it isn't. permalink parent award report block reply\nguywholikesDjtof2024 4 points 2 hours ago The more right you go,  the freer you get. Facism belongs on the left. Ditch the communist propaganda the MSM keeps promoting that \"facism/nazzissm is on the Right\", because it isn't. permalink parent award report block reply\nclearasabell 1 points 2 hours ago Comment removed by community moderators. permalink award report block reply"}