{"id": "1ARK591j4U", "contents": "245 Euro Countries that are converting to Islam fastest have highest rape rates posted 3 days ago by FuckAllDemocrats 9 comments award share report block David Atherton @DaveAtherton20 • 4d Britain is the rape capital of the world. It was previously held by Lesotho in Africa at 90.\n9 comments Sort by Top Top New Worst Old Save deleted 10 points 3 days ago NotYourMan 4 points 3 days ago Young women would rather be raped then called \"racist\" which is why the term \"racist\" or \"islamaphobe\" is nothing more than oppression to import invaders to the country. permalink parent award report block reply Bullet3250 7 points 3 days ago And this is where 'Women like to be raped'  concept comes from - because they won't VOTE against their Rapists.... The Police are ORDERED by Leftist Gov's to 'stop investigating Rape accusations' and the MEDIA won't make these RAPES a major issue... actually working very hard to cover up the Crimes. and the LEFT doesn't care Women are being Raped. So the Rapes will continue to increase. And instantly \"Sweden is the Rape Capital of Europe\" crosses the screen on some news ticker for  2 seconds - and no one cares. permalink award report block reply NotYourMan 4 points 3 days ago Being called \"racist\" is too terrifying so they go with the rape.  Its crazy to think about this but eventually either they live in a Muslim country or they fight back causing civil war.  Either a Muslim government or civil war ends with tyranny or a form of fascism where the protected class is  Muslims and the original Brits end up in camps. permalink parent award report block reply Bullet3250 2 points 3 days ago English Fabianists, Bankers,  and the EU' want that ... And they are going to get it. permalink parent award report block reply BenDoverAssho 4 points 3 days ago If women would just wear burquas and stay inside their homes, we wouldn't have this problem. It's obviously the women's fault because they show too much bare skin in public. So what do they expect men to do?    /s permalink award report block reply Floppybutthole 2 points 3 days ago It's want women want apparently. Nope not being sarcastic at all. Give them burquas. permalink parent award report block reply remindmelater 2 points 3 days ago If you don't convert they cut your head off....... permalink award report block reply Dwoj 2 points 3 days ago It is satanism permalink award report block reply Steve56775 1 points 3 days ago Is it every liberal white women’s secret desire to be raped by a violent Muslim? Just asking. permalink award report block reply\ndeleted 10 points 3 days ago NotYourMan 4 points 3 days ago Young women would rather be raped then called \"racist\" which is why the term \"racist\" or \"islamaphobe\" is nothing more than oppression to import invaders to the country. permalink parent award report block reply\nNotYourMan 4 points 3 days ago Young women would rather be raped then called \"racist\" which is why the term \"racist\" or \"islamaphobe\" is nothing more than oppression to import invaders to the country. permalink parent award report block reply\nBullet3250 7 points 3 days ago And this is where 'Women like to be raped'  concept comes from - because they won't VOTE against their Rapists.... The Police are ORDERED by Leftist Gov's to 'stop investigating Rape accusations' and the MEDIA won't make these RAPES a major issue... actually working very hard to cover up the Crimes. and the LEFT doesn't care Women are being Raped. So the Rapes will continue to increase. And instantly \"Sweden is the Rape Capital of Europe\" crosses the screen on some news ticker for  2 seconds - and no one cares. permalink award report block reply NotYourMan 4 points 3 days ago Being called \"racist\" is too terrifying so they go with the rape.  Its crazy to think about this but eventually either they live in a Muslim country or they fight back causing civil war.  Either a Muslim government or civil war ends with tyranny or a form of fascism where the protected class is  Muslims and the original Brits end up in camps. permalink parent award report block reply Bullet3250 2 points 3 days ago English Fabianists, Bankers,  and the EU' want that ... And they are going to get it. permalink parent award report block reply\nNotYourMan 4 points 3 days ago Being called \"racist\" is too terrifying so they go with the rape.  Its crazy to think about this but eventually either they live in a Muslim country or they fight back causing civil war.  Either a Muslim government or civil war ends with tyranny or a form of fascism where the protected class is  Muslims and the original Brits end up in camps. permalink parent award report block reply Bullet3250 2 points 3 days ago English Fabianists, Bankers,  and the EU' want that ... And they are going to get it. permalink parent award report block reply\nBullet3250 2 points 3 days ago English Fabianists, Bankers,  and the EU' want that ... And they are going to get it. permalink parent award report block reply\nBenDoverAssho 4 points 3 days ago If women would just wear burquas and stay inside their homes, we wouldn't have this problem. It's obviously the women's fault because they show too much bare skin in public. So what do they expect men to do?    /s permalink award report block reply Floppybutthole 2 points 3 days ago It's want women want apparently. Nope not being sarcastic at all. Give them burquas. permalink parent award report block reply\nFloppybutthole 2 points 3 days ago It's want women want apparently. Nope not being sarcastic at all. Give them burquas. permalink parent award report block reply\nremindmelater 2 points 3 days ago If you don't convert they cut your head off....... permalink award report block reply\nDwoj 2 points 3 days ago It is satanism permalink award report block reply\nSteve56775 1 points 3 days ago Is it every liberal white women’s secret desire to be raped by a violent Muslim? Just asking. permalink award report block reply"}