{"id": "1ARK9nP4td", "contents": "449 \"A lot of people who know literally nothing about tech think that \"Tech\" is some kind of field that only rare super geniuses can master. The reality is that many American eighth-graders can code better than the average Indian job-holder in the USA.\" posted 7 hours ago by bleeje 59 comments award share report block Patrick Howley @HowleyReporter • 9h A lot of people who know literally nothing about tech think that \"Tech\" is some kind of field that only rare super geniuses can master. The reality is that many American eighth-graders can code better than the average Indian job-holder in the USA.\n59 comments Sort by Top Top New Worst Old Save Around the Web Scipio_Americanus 23 points 6 hours ago Yep, the dot Indians really love to just copy and paste code, lol. They have an inordinately difficult time when it comes to streamlining code. permalink award report block reply Jack_NC 22 points 6 hours ago Because inventing and creating takes talent. Copying the work of others takes very little at all. According to my programmer friend, you'd be shocked at how many programmers fail the most basic assignments during an interview. Print a list of numbers 1-10. If the number is evenly divisible by 2 print \"fizz\". If it's divisible by 3 print \"buzz.\"  If both, \"fizzbuzz.\" That's it. Apparently that is really, really simple but most \"programmers\" can't do it! He said he has interviewed dozens of supposedly experienced programmers who can't do this. To use an analogue, it would be like asking a chef to boil an egg and he had to look at a cookbook, then still failed to do it. Or asked a carpenter to build a 1' square box out of wood, but couldn't do it. Yet we're importing people who are supposedly \"skilled\"? Seems like a total scam to me. (now, I hope this is right and I've probably confused something - my programmer friend explained this just this weekend and showed me how to do it -- wrote it out on a napkin at a restaurant, and it seemed to make sense but I'm not a programmer so who knows.\nBTW, my programmer friend has been out of work for 2 years and now drives a beer truck just to make ends meet. Can't get a job in software because he's not indian and is \"too old\" (over 50).\nWhat a mess our country has become.) permalink parent award report block reply MAGALADON9 8 points 5 hours ago SAAR! YOU ARE THE FIZZBUZZ FIZZ YOU BLOODY BASTARD! YOUR OWN MOTHER IS BUZZING THE FIZZ RIGHT NAO!!! permalink parent award report block reply Scipio_Americanus 7 points 6 hours ago My gosh, that is sad! I could write that code without too much difficulty (it's been a decade since I took any programming courses, so I'd have to refresh my knowledge of syntax,) so actual CS \"professionals\" should be able to do it. I hope your friend can persevere and find something in his field. It's absolutely criminal what's happened in the US tech sector. permalink parent award report block reply Crappydatum 6 points 5 hours ago Microsoft used to give IQ test style questions in interviews. My son was one of the last group that got to do that, because naturally they got sued for discriminating against... Dumb people permalink parent award report block reply Scipio_Americanus 4 points 3 hours ago I remember that! One of the questions was \"How would you move Mt. Fuji?\" There's a book with that title that goes into their interview style. Had no idea they got sued for it, but I'm not surprised. permalink parent award report block reply Crappydatum 4 points 3 hours ago Thanks for the recommendation I love puzzles so might pick it up just for that reason. I was at a Microsoft VP's house and all around the walls were mechanical puzzles. It was a massive house and there seemed to be hundreds. I wasn't involved in the conversation so I just started going around the other room picking up the puzzle, solving it, and moving on to the next. After I'd solved several dozen the owner came up behind me and yelled, \"Would you stop solving all my puzzles?\" I never got invited back😆 permalink parent award report block reply gunteh 7 points 5 hours ago And don't ask them to explain their work to you, they'll have to get back to you after a few internal meetings, and even then they might say, \"well, we decided to do that feature that way because we did it that way, don't ask us to explain it anymore than that because it would take more meetings to do that...\". An American could just say, \"I did this feature this way and heres why...\" and explain it in 5 minutes tops. You could actually discuss design choices in about 30-40 minutes. permalink parent award report block reply TD_Covfefe_Crusader 4 points 5 hours ago Some of the shittiest code I've ever seen was written by Indians. permalink parent award report block reply HamPrepper 18 points 6 hours ago 40 years as a software engineer have taught me 5% of the engineers are always responsible for 95% of the high quality code. The rest are time wasters, slackers and pretenders. That’s even true with Indian coders but they are suppressed by their team mates like union workers so they do not show up their mates. I have great success taking good students from middle to low tier colleges and teaching them the profession. Management just hates it though, they are too expensive compared to the H1b hove. This is not a technical problem it’s a corporate greed problem. permalink award report block reply Crappydatum 6 points 5 hours ago You are most correct Saar permalink parent award report block reply Standingoak -1 points 6 hours ago This is not a technical problem... or a ... corporate greed problem... it's a currency inflation problem . Hiding who causes/controls inflation is Job 1 for our owners. permalink parent award report block reply RedStoneDeepState 2 points 6 hours ago No. Inflation doesn't change this. permalink parent award report block reply Standingoak 0 points 5 hours ago Not understanding (separating) cause from effect is difficult. Bringing in the cheap labor happens for a reason. permalink parent award report block reply RedStoneDeepState 2 points 5 hours ago You are just screeching inflation in a nonsensical manner permalink parent award report block reply sir_rockness 13 points 6 hours ago The vast majority of Indians I've dealt with are terrible at their jobs. they can't think outside the box they aren't kind or helpful they can't communicate well they aren't willing to learn new things or come up with inventive solutions But WTF do I know I've only been in this industry for 30 years and worked everywhere from tech support to mgmt permalink award report block reply RedStoneDeepState 10 points 6 hours ago 8th graders can be smart. permalink award report block reply Standingoak 4 points 6 hours ago Bill Gates has no college degree. permalink parent award report block reply Trumpican 6 points 5 hours ago He also likes 8th grade boys. permalink parent award report block reply MAGALADON9 5 points 5 hours ago Bill Gates is the devil permalink parent award report block reply YaharaRiver 4 points 5 hours ago Technically true. Bill Gates attended Harvard, enrolling in 1973 with an SAT score of 1590 (which made him a National Merit Scholar). In 1975, Gates dropped out, and though he never completed his undergraduate degree, Harvard later awarded him an honorary doctorate in 2007, recognizing his achievements. Pretty CHEAP degree if you ask me, lol. He shot up like a rocket by joining forces with Steve Jobs and stealing “windows” from the MacIntosh design. Proof that you gotta nip that shit in the bud before it grows into world genocide by a Superman villain for personal entertainment. permalink parent award report block reply Crappydatum 2 points 5 hours ago Steve Jobs stole it from Xerox Parc first. That's why he couldn't complain much permalink parent award report block reply YaharaRiver 2 points 5 hours ago I found this in 2 seconds flat.  Why didn’t you?? “The claim that Steve Jobs stole ideas from Xerox PARC is a myth that has been thoroughly debunked by multiple sources. Xerox PARC did not own the foundational ideas of the graphical user interface (GUI) or the computer mouse; these concepts originated with researchers like Douglas Engelbart, whose work predates Xerox's development. When Steve Jobs visited Xerox PARC in 1979, he was shown the Alto computer, which featured a GUI with icons and a mouse, but Xerox had no intention of commercializing the technology for the mass market. The visit was a strategic exchange: Xerox allowed Apple to see the technology in return for stock options before Apple’s IPO, as Xerox’s management had rejected the project due to its high cost, bulkiness, and lack of consumer appeal.” permalink parent award report block reply view 1 more comments... South_Florida_Guy 9 points 6 hours ago A lot of people in \"tech\" are diversity hires, girl bosses and/or plain idiots. The entire IT field is swimming in them. permalink award report block reply Trumpican 9 points 5 hours ago I make fantastic money fixing other organizations' mistakes. It is easy work, low overhead, and sometimes, when I find someone in the org that was the person that had the right ideas, but overlooked or dismissed, I hire them and make them rich along with me and others. permalink parent award report block reply Jack_NC 5 points 5 hours ago Brought to you by grrrlboss HR diversity hires who \"pre-screen\" the applications and only present ones from the desired groups. permalink parent award report block reply Tad48 8 points 6 hours ago Yes, but I'm hearing that AI is making those jobs obsolete as we speak permalink award report block reply sir_rockness 8 points 6 hours ago It's not.   I use AI daily for scripting and it sucks.  I have to dip into my deep knowledge all the time to fix the code it creates permalink parent award report block reply Watermelons 3 points 5 hours ago You need to learn to use it properly then.  I suggest one of the CLI tools (codex or claude).  You have to set up a lot of things prior to get it to work well. Basically, treat it like a junior developer who can get things done but has a short memory.  So, making guides, rules and tests is the very first step before unleashing it on anything.  It will excel at problem solving through logs and guides once you give it correct context. permalink parent award report block reply Elencher 3 points 5 hours ago This to me is the ultimate damning of AI. People have kept saying \"just imagine how good it will be in 5 years\" when in reality we've entered into the plateau stage where they're throwing exponentially more resources at the problem for epsilon improvement. Meanwhile AI pulls off an impressive magic trick that almost looks like it works but doesn't quite get there, so you have to review everything. Except why do you know how to review the AI code? Because you've spent 10,000 hours of your life writing code. So in order to use AI to code....I need to code. But if nobody's writing code then nobody has the experience to actually use AI... Honestly I think the original \"vibe coding\" idea was the most pragmatic approach for this tech, where you intentionally don't even look at the code, but that barely got you to shitty half-assed demo stage, which is why they're all going down the agent road, but that just gets you writing reams of markdown instead of a small bit of code, so how the fuck is that an improvement? permalink parent award report block reply Crappydatum 2 points 5 hours ago AI can't create code, but it Can be used to repair code created by humans. The Tesla self driving code has been completely rewritten by AI. It's demonstrably better now. YMMV if you're using the free AI. permalink parent award report block reply DestroyerofCobwebs 7 points 5 hours ago There's a whole angle on this topic most Americans have forgotten about completely. We used to have tech schools in this country, DeVry being the biggest, but one of many.  Barack Obama's DoJ went after all of them in every way they could, with a clear goal of shutting them down.  It worked.  None of those tech schools that provided hundreds of thousands of American Citizens with tech education are around today, they've all closed up shop. The shit Eric Holder destroyed these institutions over were things the public universities were far more guilty of, but strangely they were untouched. So the US tech employee market hasn't just been betrayed, it's been actively sabotaged. permalink award report block reply Crappydatum 2 points 5 hours ago This ☝️☝️ permalink parent award report block reply NazisWereSocialist 6 points 5 hours ago Yeah first of all it's just not fucking true that we need H1-B's, it's not a genius visa, but even if we did need them I simply do not give a fuck, I don't want more minorities here. permalink award report block reply YaharaRiver 1 points 5 hours ago well, step one is Stop calling them minorities. By their own proclamation, they are the majority, therefore White American Christians must take precedence over commonplace, needy leeches. This should always be the case. Forever. #MAPA! Make America Paradise Again ✨ permalink parent award report block reply NazisWereSocialist 1 points 2 hours ago MAWA permalink parent award report block reply CheeseAndOnion 5 points 6 hours ago That might be true but can the americans shit in the alley saaarrrrrr permalink award report block reply Jack_NC 4 points 6 hours ago final interview question - eat with left hand or right hand? And WHY??? permalink parent award report block reply MAGALADON9 3 points 5 hours ago That's Muslims! Saar! permalink parent award report block reply Crappydatum 2 points 5 hours ago Sadly it's both permalink parent award report block reply Jack_NC 1 points 5 hours ago so I guess this means I didn't get the job? permalink parent award report block reply MAGALADON9 1 points 5 hours ago Is your name Gopal? permalink parent award report block reply dtrap 5 points 6 hours ago It is because they hide tech behind complex mathematics that are only useful for edge case computing. Most coding is no more complex than a moderately complex DIY home improvement project. Learn the basics of tools, figure out what you want to do, try it, evaluate, repeat. Employers love that 3 year sponsorship control. permalink award report block reply Realassman 4 points 6 hours ago I disagree. They can probably write a good for loop at best, but cannot actually do domain specific programming.\nNot saying we need H1B for that,  but it requires a college level understanding of various domains. I have worked in medical imagine, reinsurance, real estate, fin tech and many more I don’t see an 8th grader giving me what I need .\nA college kid, yes and yes, I agree with OP, we don’t need H1B. permalink award report block reply dr_gonzo 4 points 4 hours ago I'm a developer and I've had to clean up the mess made by Indian consulting companies at my current job AND my last job. In both cases the projects were completely unsalvageable. It was as if the code was written by a an illiterate child. Spelling mistakes everywhere, 1500 line functions, nested conditionals inside nested loops inside other nested conditionals, variables named exactly the same except one character case difference...and BOTH misspelled. Try debugging THAT shit. Every basic 1st year CS rule was broken without exception. And these were both fairly expensive projects. The companies got nothing but headaches, followed by throwing them in the trashcan. I think a lot more employers have learned this lesson than some on PDW seem to think though. permalink award report block reply Crappydatum 1 points 23 minutes ago This ☝️☝️ Remember, Most corporations are run by bean counters. They look down their noses at the engineers who created the products the companies sell. It's amazing any of these companies manage to stay in business permalink parent award report block reply LastHearth 3 points 5 hours ago Can code is not the same thing as being able to hold a coding job.  In additional to being able to code, you also need to listening to instructions, work consistently and not whenever you want, and organize your time to meet deadlines, owe up to mistakes and take responsibility for them and not have a emotional breakdown because one got called out for those mistakes. The problem we have is the education system, which is not building the habits of  of maturity, responsibility, and diligence in the individuals that go through the system.  Yes some of them will still have those habits because they had good parents, or they are just naturally inclined to those habits. The current education system has failed, and until that is fixed it will never produce enough individuals to fill the labor demands of the high tech corporations. permalink award report block reply Crappydatum 0 points 5 hours ago This ☝️☝️ permalink parent award report block reply gunteh 3 points 5 hours ago The problem is H1-B's and Indian/Chinese managers have messed it up to the point where they would rather hire their own sh!tty programmers than to hire Americans who could cost more but do a better job, while gaslighting everyone else by saying, \"The Americans are too lazy or not interested in the jobs we are hiring in.\" BS. That's what they say about the wetbacks picking the fields: \"if we didn't hire illegals no American would work the fields...\" permalink award report block reply Crappydatum -2 points 5 hours ago Show me Americans picking the fields I'll wait permalink parent award report block reply gunteh 2 points 5 hours ago Show me Americans on H1-B's I'll wait. permalink parent award report block reply Crappydatum 1 points 5 hours ago Nonsensical question permalink parent award report block reply gunteh 1 points 5 hours ago Exactly, I got a mirror here on my side. permalink parent award report block reply MAGALADON9 3 points 5 hours ago Saaaaar saaaar!!!! You are telling the lie saar!!!  You are needing 71% of all h1b to be from India, you bloody bastard! JD is being captured by his wife who he call \"guru\" for serious saar. And Elon? Most his kids are Punjabi also he was h1b no way he will stop doing the needful. Then vivek who is still hating on high schoolers doing many mean things to him he will have revenge saar! Believe this true! (Head Bobbles) Many others nikki radhawa and even kamala, saar you are surrounded by the might of India! You will not be reeeeeedeeeeeeeming! permalink award report block reply CocaineNewsome 2 points 3 hours ago There's a different visa for geniuses. H1b is just regular workers most of the time. permalink award report block reply Reclaimer69 2 points 5 hours ago People constantly forget, that people are stupid. The business owners know this. Industry is designed around retards. You can definitely learn to do ANY job. Relatively easily at that, as long as you are not afraid of physical and mental effort. permalink award report block reply Awakened 1 points 6 hours ago I know some. permalink award report block reply SanityGumby 1 points 40 minutes ago This is a fact permalink award report block reply\nScipio_Americanus 23 points 6 hours ago Yep, the dot Indians really love to just copy and paste code, lol. They have an inordinately difficult time when it comes to streamlining code. permalink award report block reply Jack_NC 22 points 6 hours ago Because inventing and creating takes talent. Copying the work of others takes very little at all. According to my programmer friend, you'd be shocked at how many programmers fail the most basic assignments during an interview. Print a list of numbers 1-10. If the number is evenly divisible by 2 print \"fizz\". If it's divisible by 3 print \"buzz.\"  If both, \"fizzbuzz.\" That's it. Apparently that is really, really simple but most \"programmers\" can't do it! He said he has interviewed dozens of supposedly experienced programmers who can't do this. To use an analogue, it would be like asking a chef to boil an egg and he had to look at a cookbook, then still failed to do it. Or asked a carpenter to build a 1' square box out of wood, but couldn't do it. Yet we're importing people who are supposedly \"skilled\"? Seems like a total scam to me. (now, I hope this is right and I've probably confused something - my programmer friend explained this just this weekend and showed me how to do it -- wrote it out on a napkin at a restaurant, and it seemed to make sense but I'm not a programmer so who knows.\nBTW, my programmer friend has been out of work for 2 years and now drives a beer truck just to make ends meet. Can't get a job in software because he's not indian and is \"too old\" (over 50).\nWhat a mess our country has become.) permalink parent award report block reply MAGALADON9 8 points 5 hours ago SAAR! YOU ARE THE FIZZBUZZ FIZZ YOU BLOODY BASTARD! YOUR OWN MOTHER IS BUZZING THE FIZZ RIGHT NAO!!! permalink parent award report block reply Scipio_Americanus 7 points 6 hours ago My gosh, that is sad! I could write that code without too much difficulty (it's been a decade since I took any programming courses, so I'd have to refresh my knowledge of syntax,) so actual CS \"professionals\" should be able to do it. I hope your friend can persevere and find something in his field. It's absolutely criminal what's happened in the US tech sector. permalink parent award report block reply Crappydatum 6 points 5 hours ago Microsoft used to give IQ test style questions in interviews. My son was one of the last group that got to do that, because naturally they got sued for discriminating against... Dumb people permalink parent award report block reply Scipio_Americanus 4 points 3 hours ago I remember that! One of the questions was \"How would you move Mt. Fuji?\" There's a book with that title that goes into their interview style. Had no idea they got sued for it, but I'm not surprised. permalink parent award report block reply Crappydatum 4 points 3 hours ago Thanks for the recommendation I love puzzles so might pick it up just for that reason. I was at a Microsoft VP's house and all around the walls were mechanical puzzles. It was a massive house and there seemed to be hundreds. I wasn't involved in the conversation so I just started going around the other room picking up the puzzle, solving it, and moving on to the next. After I'd solved several dozen the owner came up behind me and yelled, \"Would you stop solving all my puzzles?\" I never got invited back😆 permalink parent award report block reply gunteh 7 points 5 hours ago And don't ask them to explain their work to you, they'll have to get back to you after a few internal meetings, and even then they might say, \"well, we decided to do that feature that way because we did it that way, don't ask us to explain it anymore than that because it would take more meetings to do that...\". An American could just say, \"I did this feature this way and heres why...\" and explain it in 5 minutes tops. You could actually discuss design choices in about 30-40 minutes. permalink parent award report block reply TD_Covfefe_Crusader 4 points 5 hours ago Some of the shittiest code I've ever seen was written by Indians. permalink parent award report block reply\nJack_NC 22 points 6 hours ago Because inventing and creating takes talent. Copying the work of others takes very little at all. According to my programmer friend, you'd be shocked at how many programmers fail the most basic assignments during an interview. Print a list of numbers 1-10. If the number is evenly divisible by 2 print \"fizz\". If it's divisible by 3 print \"buzz.\"  If both, \"fizzbuzz.\" That's it. Apparently that is really, really simple but most \"programmers\" can't do it! He said he has interviewed dozens of supposedly experienced programmers who can't do this. To use an analogue, it would be like asking a chef to boil an egg and he had to look at a cookbook, then still failed to do it. Or asked a carpenter to build a 1' square box out of wood, but couldn't do it. Yet we're importing people who are supposedly \"skilled\"? Seems like a total scam to me. (now, I hope this is right and I've probably confused something - my programmer friend explained this just this weekend and showed me how to do it -- wrote it out on a napkin at a restaurant, and it seemed to make sense but I'm not a programmer so who knows.\nBTW, my programmer friend has been out of work for 2 years and now drives a beer truck just to make ends meet. Can't get a job in software because he's not indian and is \"too old\" (over 50).\nWhat a mess our country has become.) permalink parent award report block reply MAGALADON9 8 points 5 hours ago SAAR! YOU ARE THE FIZZBUZZ FIZZ YOU BLOODY BASTARD! YOUR OWN MOTHER IS BUZZING THE FIZZ RIGHT NAO!!! permalink parent award report block reply Scipio_Americanus 7 points 6 hours ago My gosh, that is sad! I could write that code without too much difficulty (it's been a decade since I took any programming courses, so I'd have to refresh my knowledge of syntax,) so actual CS \"professionals\" should be able to do it. I hope your friend can persevere and find something in his field. It's absolutely criminal what's happened in the US tech sector. permalink parent award report block reply Crappydatum 6 points 5 hours ago Microsoft used to give IQ test style questions in interviews. My son was one of the last group that got to do that, because naturally they got sued for discriminating against... Dumb people permalink parent award report block reply Scipio_Americanus 4 points 3 hours ago I remember that! One of the questions was \"How would you move Mt. Fuji?\" There's a book with that title that goes into their interview style. Had no idea they got sued for it, but I'm not surprised. permalink parent award report block reply Crappydatum 4 points 3 hours ago Thanks for the recommendation I love puzzles so might pick it up just for that reason. I was at a Microsoft VP's house and all around the walls were mechanical puzzles. It was a massive house and there seemed to be hundreds. I wasn't involved in the conversation so I just started going around the other room picking up the puzzle, solving it, and moving on to the next. After I'd solved several dozen the owner came up behind me and yelled, \"Would you stop solving all my puzzles?\" I never got invited back😆 permalink parent award report block reply\nMAGALADON9 8 points 5 hours ago SAAR! YOU ARE THE FIZZBUZZ FIZZ YOU BLOODY BASTARD! YOUR OWN MOTHER IS BUZZING THE FIZZ RIGHT NAO!!! permalink parent award report block reply\nScipio_Americanus 7 points 6 hours ago My gosh, that is sad! I could write that code without too much difficulty (it's been a decade since I took any programming courses, so I'd have to refresh my knowledge of syntax,) so actual CS \"professionals\" should be able to do it. I hope your friend can persevere and find something in his field. It's absolutely criminal what's happened in the US tech sector. permalink parent award report block reply\nCrappydatum 6 points 5 hours ago Microsoft used to give IQ test style questions in interviews. My son was one of the last group that got to do that, because naturally they got sued for discriminating against... Dumb people permalink parent award report block reply Scipio_Americanus 4 points 3 hours ago I remember that! One of the questions was \"How would you move Mt. Fuji?\" There's a book with that title that goes into their interview style. Had no idea they got sued for it, but I'm not surprised. permalink parent award report block reply Crappydatum 4 points 3 hours ago Thanks for the recommendation I love puzzles so might pick it up just for that reason. I was at a Microsoft VP's house and all around the walls were mechanical puzzles. It was a massive house and there seemed to be hundreds. I wasn't involved in the conversation so I just started going around the other room picking up the puzzle, solving it, and moving on to the next. After I'd solved several dozen the owner came up behind me and yelled, \"Would you stop solving all my puzzles?\" I never got invited back😆 permalink parent award report block reply\nScipio_Americanus 4 points 3 hours ago I remember that! One of the questions was \"How would you move Mt. Fuji?\" There's a book with that title that goes into their interview style. Had no idea they got sued for it, but I'm not surprised. permalink parent award report block reply Crappydatum 4 points 3 hours ago Thanks for the recommendation I love puzzles so might pick it up just for that reason. I was at a Microsoft VP's house and all around the walls were mechanical puzzles. It was a massive house and there seemed to be hundreds. I wasn't involved in the conversation so I just started going around the other room picking up the puzzle, solving it, and moving on to the next. After I'd solved several dozen the owner came up behind me and yelled, \"Would you stop solving all my puzzles?\" I never got invited back😆 permalink parent award report block reply\nCrappydatum 4 points 3 hours ago Thanks for the recommendation I love puzzles so might pick it up just for that reason. I was at a Microsoft VP's house and all around the walls were mechanical puzzles. It was a massive house and there seemed to be hundreds. I wasn't involved in the conversation so I just started going around the other room picking up the puzzle, solving it, and moving on to the next. After I'd solved several dozen the owner came up behind me and yelled, \"Would you stop solving all my puzzles?\" I never got invited back😆 permalink parent award report block reply\ngunteh 7 points 5 hours ago And don't ask them to explain their work to you, they'll have to get back to you after a few internal meetings, and even then they might say, \"well, we decided to do that feature that way because we did it that way, don't ask us to explain it anymore than that because it would take more meetings to do that...\". An American could just say, \"I did this feature this way and heres why...\" and explain it in 5 minutes tops. You could actually discuss design choices in about 30-40 minutes. permalink parent award report block reply\nTD_Covfefe_Crusader 4 points 5 hours ago Some of the shittiest code I've ever seen was written by Indians. permalink parent award report block reply\nHamPrepper 18 points 6 hours ago 40 years as a software engineer have taught me 5% of the engineers are always responsible for 95% of the high quality code. The rest are time wasters, slackers and pretenders. That’s even true with Indian coders but they are suppressed by their team mates like union workers so they do not show up their mates. I have great success taking good students from middle to low tier colleges and teaching them the profession. Management just hates it though, they are too expensive compared to the H1b hove. This is not a technical problem it’s a corporate greed problem. permalink award report block reply Crappydatum 6 points 5 hours ago You are most correct Saar permalink parent award report block reply Standingoak -1 points 6 hours ago This is not a technical problem... or a ... corporate greed problem... it's a currency inflation problem . Hiding who causes/controls inflation is Job 1 for our owners. permalink parent award report block reply RedStoneDeepState 2 points 6 hours ago No. Inflation doesn't change this. permalink parent award report block reply Standingoak 0 points 5 hours ago Not understanding (separating) cause from effect is difficult. Bringing in the cheap labor happens for a reason. permalink parent award report block reply RedStoneDeepState 2 points 5 hours ago You are just screeching inflation in a nonsensical manner permalink parent award report block reply\nCrappydatum 6 points 5 hours ago You are most correct Saar permalink parent award report block reply\nStandingoak -1 points 6 hours ago This is not a technical problem... or a ... corporate greed problem... it's a currency inflation problem . Hiding who causes/controls inflation is Job 1 for our owners. permalink parent award report block reply RedStoneDeepState 2 points 6 hours ago No. Inflation doesn't change this. permalink parent award report block reply Standingoak 0 points 5 hours ago Not understanding (separating) cause from effect is difficult. Bringing in the cheap labor happens for a reason. permalink parent award report block reply RedStoneDeepState 2 points 5 hours ago You are just screeching inflation in a nonsensical manner permalink parent award report block reply\nRedStoneDeepState 2 points 6 hours ago No. Inflation doesn't change this. permalink parent award report block reply Standingoak 0 points 5 hours ago Not understanding (separating) cause from effect is difficult. Bringing in the cheap labor happens for a reason. permalink parent award report block reply RedStoneDeepState 2 points 5 hours ago You are just screeching inflation in a nonsensical manner permalink parent award report block reply\nStandingoak 0 points 5 hours ago Not understanding (separating) cause from effect is difficult. Bringing in the cheap labor happens for a reason. permalink parent award report block reply RedStoneDeepState 2 points 5 hours ago You are just screeching inflation in a nonsensical manner permalink parent award report block reply\nRedStoneDeepState 2 points 5 hours ago You are just screeching inflation in a nonsensical manner permalink parent award report block reply\nsir_rockness 13 points 6 hours ago The vast majority of Indians I've dealt with are terrible at their jobs. they can't think outside the box they aren't kind or helpful they can't communicate well they aren't willing to learn new things or come up with inventive solutions But WTF do I know I've only been in this industry for 30 years and worked everywhere from tech support to mgmt permalink award report block reply\nRedStoneDeepState 10 points 6 hours ago 8th graders can be smart. permalink award report block reply Standingoak 4 points 6 hours ago Bill Gates has no college degree. permalink parent award report block reply Trumpican 6 points 5 hours ago He also likes 8th grade boys. permalink parent award report block reply MAGALADON9 5 points 5 hours ago Bill Gates is the devil permalink parent award report block reply YaharaRiver 4 points 5 hours ago Technically true. Bill Gates attended Harvard, enrolling in 1973 with an SAT score of 1590 (which made him a National Merit Scholar). In 1975, Gates dropped out, and though he never completed his undergraduate degree, Harvard later awarded him an honorary doctorate in 2007, recognizing his achievements. Pretty CHEAP degree if you ask me, lol. He shot up like a rocket by joining forces with Steve Jobs and stealing “windows” from the MacIntosh design. Proof that you gotta nip that shit in the bud before it grows into world genocide by a Superman villain for personal entertainment. permalink parent award report block reply Crappydatum 2 points 5 hours ago Steve Jobs stole it from Xerox Parc first. That's why he couldn't complain much permalink parent award report block reply YaharaRiver 2 points 5 hours ago I found this in 2 seconds flat.  Why didn’t you?? “The claim that Steve Jobs stole ideas from Xerox PARC is a myth that has been thoroughly debunked by multiple sources. Xerox PARC did not own the foundational ideas of the graphical user interface (GUI) or the computer mouse; these concepts originated with researchers like Douglas Engelbart, whose work predates Xerox's development. When Steve Jobs visited Xerox PARC in 1979, he was shown the Alto computer, which featured a GUI with icons and a mouse, but Xerox had no intention of commercializing the technology for the mass market. The visit was a strategic exchange: Xerox allowed Apple to see the technology in return for stock options before Apple’s IPO, as Xerox’s management had rejected the project due to its high cost, bulkiness, and lack of consumer appeal.” permalink parent award report block reply view 1 more comments...\nStandingoak 4 points 6 hours ago Bill Gates has no college degree. permalink parent award report block reply Trumpican 6 points 5 hours ago He also likes 8th grade boys. permalink parent award report block reply MAGALADON9 5 points 5 hours ago Bill Gates is the devil permalink parent award report block reply YaharaRiver 4 points 5 hours ago Technically true. Bill Gates attended Harvard, enrolling in 1973 with an SAT score of 1590 (which made him a National Merit Scholar). In 1975, Gates dropped out, and though he never completed his undergraduate degree, Harvard later awarded him an honorary doctorate in 2007, recognizing his achievements. Pretty CHEAP degree if you ask me, lol. He shot up like a rocket by joining forces with Steve Jobs and stealing “windows” from the MacIntosh design. Proof that you gotta nip that shit in the bud before it grows into world genocide by a Superman villain for personal entertainment. permalink parent award report block reply Crappydatum 2 points 5 hours ago Steve Jobs stole it from Xerox Parc first. That's why he couldn't complain much permalink parent award report block reply YaharaRiver 2 points 5 hours ago I found this in 2 seconds flat.  Why didn’t you?? “The claim that Steve Jobs stole ideas from Xerox PARC is a myth that has been thoroughly debunked by multiple sources. Xerox PARC did not own the foundational ideas of the graphical user interface (GUI) or the computer mouse; these concepts originated with researchers like Douglas Engelbart, whose work predates Xerox's development. When Steve Jobs visited Xerox PARC in 1979, he was shown the Alto computer, which featured a GUI with icons and a mouse, but Xerox had no intention of commercializing the technology for the mass market. The visit was a strategic exchange: Xerox allowed Apple to see the technology in return for stock options before Apple’s IPO, as Xerox’s management had rejected the project due to its high cost, bulkiness, and lack of consumer appeal.” permalink parent award report block reply view 1 more comments...\nTrumpican 6 points 5 hours ago He also likes 8th grade boys. permalink parent award report block reply\nMAGALADON9 5 points 5 hours ago Bill Gates is the devil permalink parent award report block reply\nYaharaRiver 4 points 5 hours ago Technically true. Bill Gates attended Harvard, enrolling in 1973 with an SAT score of 1590 (which made him a National Merit Scholar). In 1975, Gates dropped out, and though he never completed his undergraduate degree, Harvard later awarded him an honorary doctorate in 2007, recognizing his achievements. Pretty CHEAP degree if you ask me, lol. He shot up like a rocket by joining forces with Steve Jobs and stealing “windows” from the MacIntosh design. Proof that you gotta nip that shit in the bud before it grows into world genocide by a Superman villain for personal entertainment. permalink parent award report block reply Crappydatum 2 points 5 hours ago Steve Jobs stole it from Xerox Parc first. That's why he couldn't complain much permalink parent award report block reply YaharaRiver 2 points 5 hours ago I found this in 2 seconds flat.  Why didn’t you?? “The claim that Steve Jobs stole ideas from Xerox PARC is a myth that has been thoroughly debunked by multiple sources. Xerox PARC did not own the foundational ideas of the graphical user interface (GUI) or the computer mouse; these concepts originated with researchers like Douglas Engelbart, whose work predates Xerox's development. When Steve Jobs visited Xerox PARC in 1979, he was shown the Alto computer, which featured a GUI with icons and a mouse, but Xerox had no intention of commercializing the technology for the mass market. The visit was a strategic exchange: Xerox allowed Apple to see the technology in return for stock options before Apple’s IPO, as Xerox’s management had rejected the project due to its high cost, bulkiness, and lack of consumer appeal.” permalink parent award report block reply view 1 more comments...\nCrappydatum 2 points 5 hours ago Steve Jobs stole it from Xerox Parc first. That's why he couldn't complain much permalink parent award report block reply YaharaRiver 2 points 5 hours ago I found this in 2 seconds flat.  Why didn’t you?? “The claim that Steve Jobs stole ideas from Xerox PARC is a myth that has been thoroughly debunked by multiple sources. Xerox PARC did not own the foundational ideas of the graphical user interface (GUI) or the computer mouse; these concepts originated with researchers like Douglas Engelbart, whose work predates Xerox's development. When Steve Jobs visited Xerox PARC in 1979, he was shown the Alto computer, which featured a GUI with icons and a mouse, but Xerox had no intention of commercializing the technology for the mass market. The visit was a strategic exchange: Xerox allowed Apple to see the technology in return for stock options before Apple’s IPO, as Xerox’s management had rejected the project due to its high cost, bulkiness, and lack of consumer appeal.” permalink parent award report block reply view 1 more comments...\nYaharaRiver 2 points 5 hours ago I found this in 2 seconds flat.  Why didn’t you?? “The claim that Steve Jobs stole ideas from Xerox PARC is a myth that has been thoroughly debunked by multiple sources. Xerox PARC did not own the foundational ideas of the graphical user interface (GUI) or the computer mouse; these concepts originated with researchers like Douglas Engelbart, whose work predates Xerox's development. When Steve Jobs visited Xerox PARC in 1979, he was shown the Alto computer, which featured a GUI with icons and a mouse, but Xerox had no intention of commercializing the technology for the mass market. The visit was a strategic exchange: Xerox allowed Apple to see the technology in return for stock options before Apple’s IPO, as Xerox’s management had rejected the project due to its high cost, bulkiness, and lack of consumer appeal.” permalink parent award report block reply view 1 more comments...\nSouth_Florida_Guy 9 points 6 hours ago A lot of people in \"tech\" are diversity hires, girl bosses and/or plain idiots. The entire IT field is swimming in them. permalink award report block reply Trumpican 9 points 5 hours ago I make fantastic money fixing other organizations' mistakes. It is easy work, low overhead, and sometimes, when I find someone in the org that was the person that had the right ideas, but overlooked or dismissed, I hire them and make them rich along with me and others. permalink parent award report block reply Jack_NC 5 points 5 hours ago Brought to you by grrrlboss HR diversity hires who \"pre-screen\" the applications and only present ones from the desired groups. permalink parent award report block reply\nTrumpican 9 points 5 hours ago I make fantastic money fixing other organizations' mistakes. It is easy work, low overhead, and sometimes, when I find someone in the org that was the person that had the right ideas, but overlooked or dismissed, I hire them and make them rich along with me and others. permalink parent award report block reply\nJack_NC 5 points 5 hours ago Brought to you by grrrlboss HR diversity hires who \"pre-screen\" the applications and only present ones from the desired groups. permalink parent award report block reply\nTad48 8 points 6 hours ago Yes, but I'm hearing that AI is making those jobs obsolete as we speak permalink award report block reply sir_rockness 8 points 6 hours ago It's not.   I use AI daily for scripting and it sucks.  I have to dip into my deep knowledge all the time to fix the code it creates permalink parent award report block reply Watermelons 3 points 5 hours ago You need to learn to use it properly then.  I suggest one of the CLI tools (codex or claude).  You have to set up a lot of things prior to get it to work well. Basically, treat it like a junior developer who can get things done but has a short memory.  So, making guides, rules and tests is the very first step before unleashing it on anything.  It will excel at problem solving through logs and guides once you give it correct context. permalink parent award report block reply Elencher 3 points 5 hours ago This to me is the ultimate damning of AI. People have kept saying \"just imagine how good it will be in 5 years\" when in reality we've entered into the plateau stage where they're throwing exponentially more resources at the problem for epsilon improvement. Meanwhile AI pulls off an impressive magic trick that almost looks like it works but doesn't quite get there, so you have to review everything. Except why do you know how to review the AI code? Because you've spent 10,000 hours of your life writing code. So in order to use AI to code....I need to code. But if nobody's writing code then nobody has the experience to actually use AI... Honestly I think the original \"vibe coding\" idea was the most pragmatic approach for this tech, where you intentionally don't even look at the code, but that barely got you to shitty half-assed demo stage, which is why they're all going down the agent road, but that just gets you writing reams of markdown instead of a small bit of code, so how the fuck is that an improvement? permalink parent award report block reply Crappydatum 2 points 5 hours ago AI can't create code, but it Can be used to repair code created by humans. The Tesla self driving code has been completely rewritten by AI. It's demonstrably better now. YMMV if you're using the free AI. permalink parent award report block reply\nsir_rockness 8 points 6 hours ago It's not.   I use AI daily for scripting and it sucks.  I have to dip into my deep knowledge all the time to fix the code it creates permalink parent award report block reply Watermelons 3 points 5 hours ago You need to learn to use it properly then.  I suggest one of the CLI tools (codex or claude).  You have to set up a lot of things prior to get it to work well. Basically, treat it like a junior developer who can get things done but has a short memory.  So, making guides, rules and tests is the very first step before unleashing it on anything.  It will excel at problem solving through logs and guides once you give it correct context. permalink parent award report block reply Elencher 3 points 5 hours ago This to me is the ultimate damning of AI. People have kept saying \"just imagine how good it will be in 5 years\" when in reality we've entered into the plateau stage where they're throwing exponentially more resources at the problem for epsilon improvement. Meanwhile AI pulls off an impressive magic trick that almost looks like it works but doesn't quite get there, so you have to review everything. Except why do you know how to review the AI code? Because you've spent 10,000 hours of your life writing code. So in order to use AI to code....I need to code. But if nobody's writing code then nobody has the experience to actually use AI... Honestly I think the original \"vibe coding\" idea was the most pragmatic approach for this tech, where you intentionally don't even look at the code, but that barely got you to shitty half-assed demo stage, which is why they're all going down the agent road, but that just gets you writing reams of markdown instead of a small bit of code, so how the fuck is that an improvement? permalink parent award report block reply Crappydatum 2 points 5 hours ago AI can't create code, but it Can be used to repair code created by humans. The Tesla self driving code has been completely rewritten by AI. It's demonstrably better now. YMMV if you're using the free AI. permalink parent award report block reply\nWatermelons 3 points 5 hours ago You need to learn to use it properly then.  I suggest one of the CLI tools (codex or claude).  You have to set up a lot of things prior to get it to work well. Basically, treat it like a junior developer who can get things done but has a short memory.  So, making guides, rules and tests is the very first step before unleashing it on anything.  It will excel at problem solving through logs and guides once you give it correct context. permalink parent award report block reply\nElencher 3 points 5 hours ago This to me is the ultimate damning of AI. People have kept saying \"just imagine how good it will be in 5 years\" when in reality we've entered into the plateau stage where they're throwing exponentially more resources at the problem for epsilon improvement. Meanwhile AI pulls off an impressive magic trick that almost looks like it works but doesn't quite get there, so you have to review everything. Except why do you know how to review the AI code? Because you've spent 10,000 hours of your life writing code. So in order to use AI to code....I need to code. But if nobody's writing code then nobody has the experience to actually use AI... Honestly I think the original \"vibe coding\" idea was the most pragmatic approach for this tech, where you intentionally don't even look at the code, but that barely got you to shitty half-assed demo stage, which is why they're all going down the agent road, but that just gets you writing reams of markdown instead of a small bit of code, so how the fuck is that an improvement? permalink parent award report block reply\nCrappydatum 2 points 5 hours ago AI can't create code, but it Can be used to repair code created by humans. The Tesla self driving code has been completely rewritten by AI. It's demonstrably better now. YMMV if you're using the free AI. permalink parent award report block reply\nDestroyerofCobwebs 7 points 5 hours ago There's a whole angle on this topic most Americans have forgotten about completely. We used to have tech schools in this country, DeVry being the biggest, but one of many.  Barack Obama's DoJ went after all of them in every way they could, with a clear goal of shutting them down.  It worked.  None of those tech schools that provided hundreds of thousands of American Citizens with tech education are around today, they've all closed up shop. The shit Eric Holder destroyed these institutions over were things the public universities were far more guilty of, but strangely they were untouched. So the US tech employee market hasn't just been betrayed, it's been actively sabotaged. permalink award report block reply Crappydatum 2 points 5 hours ago This ☝️☝️ permalink parent award report block reply\nCrappydatum 2 points 5 hours ago This ☝️☝️ permalink parent award report block reply\nNazisWereSocialist 6 points 5 hours ago Yeah first of all it's just not fucking true that we need H1-B's, it's not a genius visa, but even if we did need them I simply do not give a fuck, I don't want more minorities here. permalink award report block reply YaharaRiver 1 points 5 hours ago well, step one is Stop calling them minorities. By their own proclamation, they are the majority, therefore White American Christians must take precedence over commonplace, needy leeches. This should always be the case. Forever. #MAPA! Make America Paradise Again ✨ permalink parent award report block reply NazisWereSocialist 1 points 2 hours ago MAWA permalink parent award report block reply\nYaharaRiver 1 points 5 hours ago well, step one is Stop calling them minorities. By their own proclamation, they are the majority, therefore White American Christians must take precedence over commonplace, needy leeches. This should always be the case. Forever. #MAPA! Make America Paradise Again ✨ permalink parent award report block reply NazisWereSocialist 1 points 2 hours ago MAWA permalink parent award report block reply\nNazisWereSocialist 1 points 2 hours ago MAWA permalink parent award report block reply\nCheeseAndOnion 5 points 6 hours ago That might be true but can the americans shit in the alley saaarrrrrr permalink award report block reply Jack_NC 4 points 6 hours ago final interview question - eat with left hand or right hand? And WHY??? permalink parent award report block reply MAGALADON9 3 points 5 hours ago That's Muslims! Saar! permalink parent award report block reply Crappydatum 2 points 5 hours ago Sadly it's both permalink parent award report block reply Jack_NC 1 points 5 hours ago so I guess this means I didn't get the job? permalink parent award report block reply MAGALADON9 1 points 5 hours ago Is your name Gopal? permalink parent award report block reply\nJack_NC 4 points 6 hours ago final interview question - eat with left hand or right hand? And WHY??? permalink parent award report block reply MAGALADON9 3 points 5 hours ago That's Muslims! Saar! permalink parent award report block reply Crappydatum 2 points 5 hours ago Sadly it's both permalink parent award report block reply Jack_NC 1 points 5 hours ago so I guess this means I didn't get the job? permalink parent award report block reply MAGALADON9 1 points 5 hours ago Is your name Gopal? permalink parent award report block reply\nMAGALADON9 3 points 5 hours ago That's Muslims! Saar! permalink parent award report block reply Crappydatum 2 points 5 hours ago Sadly it's both permalink parent award report block reply Jack_NC 1 points 5 hours ago so I guess this means I didn't get the job? permalink parent award report block reply MAGALADON9 1 points 5 hours ago Is your name Gopal? permalink parent award report block reply\nCrappydatum 2 points 5 hours ago Sadly it's both permalink parent award report block reply\nJack_NC 1 points 5 hours ago so I guess this means I didn't get the job? permalink parent award report block reply MAGALADON9 1 points 5 hours ago Is your name Gopal? permalink parent award report block reply\nMAGALADON9 1 points 5 hours ago Is your name Gopal? permalink parent award report block reply\ndtrap 5 points 6 hours ago It is because they hide tech behind complex mathematics that are only useful for edge case computing. Most coding is no more complex than a moderately complex DIY home improvement project. Learn the basics of tools, figure out what you want to do, try it, evaluate, repeat. Employers love that 3 year sponsorship control. permalink award report block reply\nRealassman 4 points 6 hours ago I disagree. They can probably write a good for loop at best, but cannot actually do domain specific programming.\nNot saying we need H1B for that,  but it requires a college level understanding of various domains. I have worked in medical imagine, reinsurance, real estate, fin tech and many more I don’t see an 8th grader giving me what I need .\nA college kid, yes and yes, I agree with OP, we don’t need H1B. permalink award report block reply\ndr_gonzo 4 points 4 hours ago I'm a developer and I've had to clean up the mess made by Indian consulting companies at my current job AND my last job. In both cases the projects were completely unsalvageable. It was as if the code was written by a an illiterate child. Spelling mistakes everywhere, 1500 line functions, nested conditionals inside nested loops inside other nested conditionals, variables named exactly the same except one character case difference...and BOTH misspelled. Try debugging THAT shit. Every basic 1st year CS rule was broken without exception. And these were both fairly expensive projects. The companies got nothing but headaches, followed by throwing them in the trashcan. I think a lot more employers have learned this lesson than some on PDW seem to think though. permalink award report block reply Crappydatum 1 points 23 minutes ago This ☝️☝️ Remember, Most corporations are run by bean counters. They look down their noses at the engineers who created the products the companies sell. It's amazing any of these companies manage to stay in business permalink parent award report block reply\nCrappydatum 1 points 23 minutes ago This ☝️☝️ Remember, Most corporations are run by bean counters. They look down their noses at the engineers who created the products the companies sell. It's amazing any of these companies manage to stay in business permalink parent award report block reply\nLastHearth 3 points 5 hours ago Can code is not the same thing as being able to hold a coding job.  In additional to being able to code, you also need to listening to instructions, work consistently and not whenever you want, and organize your time to meet deadlines, owe up to mistakes and take responsibility for them and not have a emotional breakdown because one got called out for those mistakes. The problem we have is the education system, which is not building the habits of  of maturity, responsibility, and diligence in the individuals that go through the system.  Yes some of them will still have those habits because they had good parents, or they are just naturally inclined to those habits. The current education system has failed, and until that is fixed it will never produce enough individuals to fill the labor demands of the high tech corporations. permalink award report block reply Crappydatum 0 points 5 hours ago This ☝️☝️ permalink parent award report block reply\nCrappydatum 0 points 5 hours ago This ☝️☝️ permalink parent award report block reply\ngunteh 3 points 5 hours ago The problem is H1-B's and Indian/Chinese managers have messed it up to the point where they would rather hire their own sh!tty programmers than to hire Americans who could cost more but do a better job, while gaslighting everyone else by saying, \"The Americans are too lazy or not interested in the jobs we are hiring in.\" BS. That's what they say about the wetbacks picking the fields: \"if we didn't hire illegals no American would work the fields...\" permalink award report block reply Crappydatum -2 points 5 hours ago Show me Americans picking the fields I'll wait permalink parent award report block reply gunteh 2 points 5 hours ago Show me Americans on H1-B's I'll wait. permalink parent award report block reply Crappydatum 1 points 5 hours ago Nonsensical question permalink parent award report block reply gunteh 1 points 5 hours ago Exactly, I got a mirror here on my side. permalink parent award report block reply\nCrappydatum -2 points 5 hours ago Show me Americans picking the fields I'll wait permalink parent award report block reply gunteh 2 points 5 hours ago Show me Americans on H1-B's I'll wait. permalink parent award report block reply Crappydatum 1 points 5 hours ago Nonsensical question permalink parent award report block reply gunteh 1 points 5 hours ago Exactly, I got a mirror here on my side. permalink parent award report block reply\ngunteh 2 points 5 hours ago Show me Americans on H1-B's I'll wait. permalink parent award report block reply Crappydatum 1 points 5 hours ago Nonsensical question permalink parent award report block reply gunteh 1 points 5 hours ago Exactly, I got a mirror here on my side. permalink parent award report block reply\nCrappydatum 1 points 5 hours ago Nonsensical question permalink parent award report block reply gunteh 1 points 5 hours ago Exactly, I got a mirror here on my side. permalink parent award report block reply\ngunteh 1 points 5 hours ago Exactly, I got a mirror here on my side. permalink parent award report block reply\nMAGALADON9 3 points 5 hours ago Saaaaar saaaar!!!! You are telling the lie saar!!!  You are needing 71% of all h1b to be from India, you bloody bastard! JD is being captured by his wife who he call \"guru\" for serious saar. And Elon? Most his kids are Punjabi also he was h1b no way he will stop doing the needful. Then vivek who is still hating on high schoolers doing many mean things to him he will have revenge saar! Believe this true! (Head Bobbles) Many others nikki radhawa and even kamala, saar you are surrounded by the might of India! You will not be reeeeeedeeeeeeeming! permalink award report block reply\nCocaineNewsome 2 points 3 hours ago There's a different visa for geniuses. H1b is just regular workers most of the time. permalink award report block reply\nReclaimer69 2 points 5 hours ago People constantly forget, that people are stupid. The business owners know this. Industry is designed around retards. You can definitely learn to do ANY job. Relatively easily at that, as long as you are not afraid of physical and mental effort. permalink award report block reply\nAwakened 1 points 6 hours ago I know some. permalink award report block reply\nSanityGumby 1 points 40 minutes ago This is a fact permalink award report block reply"}