{"id": "1ARK57sEch", "contents": "310 HEY PAM, we showed you the evidence, NOW GO ARREST SOMEBODY! posted 4 days ago by VanillaCupCake 7 comments award share download report block\n7 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style OlivaireBandaloo 12 points 4 days ago \"Arrest?  Ive been taking a rest for months\"  Blondi probably. permalink award report block reply Reefay 1 points 4 days ago Excellent dad joke. Now log off, Mom needs you to take out the garbage permalink parent award report block reply BlackPilledMAGA 6 points 4 days ago Tell it to her boss. He sees what's happening and he chooses to let it continue... and he showers her with praise. She's never going to leave and she's never going to do anything, but trump won't fire her. permalink award report block reply Zacktopia33 5 points 4 days ago This episode of Blondie is brought to you by her close friend Susie Wiles! permalink parent award report block reply SanityGumby 2 points 3 days ago Several people have been arrested and more are about to permalink award report block reply keeman 1 points 3 days ago Not possible.  She has TV appearances scheduled to discuss arresting sportspall players for bullshit. permalink award report block reply etcetera 1 points 4 days ago Comment removed by community moderators. permalink award report block reply\nOlivaireBandaloo 12 points 4 days ago \"Arrest?  Ive been taking a rest for months\"  Blondi probably. permalink award report block reply Reefay 1 points 4 days ago Excellent dad joke. Now log off, Mom needs you to take out the garbage permalink parent award report block reply\nReefay 1 points 4 days ago Excellent dad joke. Now log off, Mom needs you to take out the garbage permalink parent award report block reply\nBlackPilledMAGA 6 points 4 days ago Tell it to her boss. He sees what's happening and he chooses to let it continue... and he showers her with praise. She's never going to leave and she's never going to do anything, but trump won't fire her. permalink award report block reply Zacktopia33 5 points 4 days ago This episode of Blondie is brought to you by her close friend Susie Wiles! permalink parent award report block reply\nZacktopia33 5 points 4 days ago This episode of Blondie is brought to you by her close friend Susie Wiles! permalink parent award report block reply\nSanityGumby 2 points 3 days ago Several people have been arrested and more are about to permalink award report block reply\nkeeman 1 points 3 days ago Not possible.  She has TV appearances scheduled to discuss arresting sportspall players for bullshit. permalink award report block reply\netcetera 1 points 4 days ago Comment removed by community moderators. permalink award report block reply"}