{"id": "1ARK58zFZ7", "contents": "1469 🔴President Trump DOUBLES DOWN on his demands to send Obamacare money to the PEOPLE — “TAKING THE “FAT CAT” INSURANCE COMPANIES OUT OF THE CORRUPT SYSTEM OF HEALTHCARE.” TRUMP  TRUTH posted 4 days ago by DeusVult1096 193 comments award share download report block\n193 comments Sort by Top Top New Worst Old Save Around the Web Hair Will Grow Back! No Matter How Severe The Baldness HaloGrow TheGreatWhiteNorth 57 points 4 days ago We need to get rid of the tyrannical socialist healthcare scam system in Canada, too.  This facade of a country that calls itself Canada -- in every way, shape, and form -- needs President Trump to take over and claw it back from the Marxist-globalists. Monroe Doctrine, Manifest Destiny https://truthsocial.com/@realDonaldTrump/posts/113794510592692386 permalink award report block reply goldkeyboardwarrior 17 points 4 days ago The Canadians can handle their own shit. I’m more concerned about what happens within our borders. permalink parent award report block reply TheGreatWhiteNorth 7 points 4 days ago No, we can't.  We're only around 43 million people uselessly spread across a vast winter wasteland.  Our last hurrah was the Freedom Convoy.  Remember how that turned out?  Right.  Explain how we can handle the Marxist-globalist attack on our own when even the United States was about to be written off if it wasn't for Trump backed by the US military. permalink parent award report block reply FrmrAmericanRepublic 8 points 4 days ago Assuming that firearms still exist in Canada, I'd use USA history as a guide on that score. Like we hear often here, you don't vote your way out of communism/marxism. permalink parent award report block reply TheGreatWhiteNorth 1 points 4 days ago Like I already said, we're only around 43 million people uselessly spread across vast distances from each other.  You think Canadians can 'get together' and shoot their way out of this?  Trump would never allow for the slaughter of innocent Canadians.  Meantime, he has made it very clear that Canada can only work as the 51st State. permalink parent award report block reply view 16 more comments... Kingoftheroad 3 points 4 days ago Canada isnt 43 million people lol unless you count 10 million muslim and indian foreigners who have fraudulent citizenship given by corrupted government agencies permalink parent award report block reply TheGreatWhiteNorth 2 points 3 days ago If you don't like the padded number, then make it 33 million lol.  That makes my argument even better.  Clearly, Canada is doomed unless Trump takes over. permalink parent award report block reply view 1 more comments... Moose_Antlers 2 points 4 days ago This is important. Geopolitically we need our Canadian northern shield. They're our missile shield and first strike detection for Russian ICBMs. They're our northern flank and our bridge between Alaska and the lower 48. They're resource-rich and come from a common ethnic and cultural heritage. We'll even tolerate the French. The Cajuns can bridge the gap, there =) There is no rational reason on this Earth to give up on Canada, or to find ourselves in an intractable squabble with them. If the Marxists are a problem, we need to help them with that, for our own good as well as theirs. It may take some courage to sever from the Commonwealth and figure out precisely what a new path truly independent of the British Parliament and Crown really looks like. Junior partnership with the US isn't a great solution to try and sell. True partnership (ie statehood) is much better - but I can understand the immense pushback such a suggestion receives from proud and patriotic Canadians who value their own unique identity. Hard choices. permalink parent award report block reply TheGreatWhiteNorth 1 points 3 days ago I can agree with you on this. With the way things are rolling out step by step (as if on schedule), I'd say our 'connection' with the Commonwealth has already been severed.  We're simply going through the motions that will conclude with Canada becoming the 51st State.  What's important here is optics, and getting everyone on both sides of the border to (gladly) accept the inevitable first.  Meantime, the 'squeeze' continues on Canada.  Carnage Carney is doing his 'best' to make sure Canada breaks apart.  I'd be tempted to call him Central Casting at this point. permalink parent award report block reply goldkeyboardwarrior 1 points 4 days ago I answered under the assumption that you were an American saying we need to go into Canada to fix what is going on up there. I feel your pain but we’re going to have to try and get what’s going on down here fixed before we can give you guys an hand. permalink parent award report block reply TheGreatWhiteNorth 0 points 3 days ago President Trump is the GOAT.  Don't underestimate that man.  The progress he's made for America and the rest of the world so far is mind-blowing. Meantime, think national security.  Don't forget the Golden Dome. May 27, 2025 https://truthsocial.com/@realDonaldTrump/posts/114581970051938528 TRUMP:  I told Canada, which very much wants to be part of our fabulous Golden Dome System, that it will cost $61 Billion Dollars if they remain a separate, but unequal, Nation, but will cost ZERO DOLLARS if they become our cherished 51st State. They are considering the offer!\n. September 30, 2025 President Donald Trump Address Military Leaders at Quantico https://www.youtube.com/watch?v=hk_rdU0-UTI TRUMP:  We're investing tens of billions of 32:04\ndollars in modernizing our nuclear deterrence capabilities like never before. And we've begun construction on 32:10\nwhat we call the Golden Dome missile defense shield. It'll be the most sophisticated in the world. You watched 32:15\nit do well until they had some problems at the end with a little bit of a lack 32:23\nof ammunition, defensive ammunition, but they've got that taken care of. But I 32:30\ntell you, it's uh what we're doing is so good and we deserve it. You know, we we help other countries with it. We don't 32:36\nhave it ourselves. And Canada called me a couple of weeks ago. They want to be part of it. to\n32:42\nwhich I said,\"Well, why don't you just join our country? You become 51, become the 51st state and you get it for free.\" 32:51\nSo, I don't know if that made a big impact, but it does make a lot of sense. It actually because they're having a 32:57\nhard time up there in Canada now because, as you know, with tariffs, everyone's coming into our country. We 33:02\nhave more investment than we've ever had before. 17 trillion dollars coming in. permalink parent award report block reply Than0sIII 17 points 4 days ago United Continent of America, lesgo. permalink parent award report block reply TheGreatWhiteNorth 17 points 4 days ago Fortress America.  Oh yeah. permalink parent award report block reply tralbolh 12 points 4 days ago I don't want Mezoamerica. permalink parent award report block reply Smurfection 6 points 4 days ago No one wants an alliance with Mexico on anything.  The Cartels are basically running the country. permalink parent award report block reply Washington_Redskins 4 points 4 days ago If a new government didn't mind killing a million or two cartel members and associates or puppets it could be fixed..? I don't think that's likely to happen anytime soon permalink parent award report block reply Moose_Antlers 1 points 4 days ago US + Canada, sure. But the imports have to go first. I'm not interested in the Chinese and Indian subcontinent contingents being annexed and added, and the Marxist Francophones can stay too (non-Marxists welcome). But I'm ruling out the Hispanics. They've had 70 years since Eisenhower's mass deportation to prove that they could come in legally and integrate. They don't. And I don't ever want to have to speak Spanish to some ... client... because he's unable to speak a word of English despite being in the country for a decade or more. They can unite in Mexico if they want. permalink parent award report block reply tpactionchasethevote 13 points 4 days ago Obamacare forces everyone to contribute to the Rockefeller allopathic system of petroleum based pharmaceuticals, symptoms, and surgeries while ignoring cheap or natural cures, prevention, nutrition, and root causes permalink parent award report block reply TheGreatWhiteNorth 6 points 4 days ago Same in Canada but much worse. permalink parent award report block reply Mathelm 6 points 4 days ago Well good for Canada, that because someone's grandfather MAY have fished by an area they can now take your home. One trial court judge invalidated ALL property rights, so yeah. permalink parent award report block reply Washington_Redskins 3 points 4 days ago Teach a man to fish and feed him for a day.. Let a man fish from your property and lose it for a lifetime. permalink parent award report block reply TheGreatWhiteNorth 0 points 4 days ago That makes no sense at all. permalink parent award report block reply TheGreatWhiteNorth 1 points 4 days ago Yup.  There's that, too. permalink parent award report block reply NomadicKrow2 1 points 4 days ago Woah, what happened? permalink parent award report block reply Mathelm 1 points 4 days ago ‘Cowichan case’ : Injin tribe sued for land, on the \"reconciliation\" principle, that they hold some Indigenous Title to 750 Hectares of Land; So a judge awarded them this land, the land is within Richmond BC, which is almost completely developed with homes. So this slice of land has been given to this tribe, forcing all of the current property owners to lose their titles to their homes. 95% of British Columbia wasn't officially \"ceded\" with each individual tribe, so now there are numerous bullshit tribes coming out of the literal woodwork, suing to take the land. Currently the entire city of Kamaloops is now under lawsuit. This is just further proof that humanity can never leave a single survivor when conquering another civilization. European politeness has just destroyed all notion of property rights in BC if not Canada. permalink parent award report block reply NomadicKrow2 2 points 4 days ago I think I'd have to tell Chief Steals Your Home to suck my dick or get off my property. Any words after that would be met with gunfire. I worked too fucking hard to let some dipshit redskin pie face drunkard take my house without a fight. permalink parent award report block reply view 2 more comments... TheGreatWhiteNorth 0 points 3 days ago It's not the survivors that are the problem.  Most of the native Indians don't like this shite either.  They don't get much say, they don't get heard.  Their Chiefs are corrupt.  Guess who's getting paid off. The problem is our corrupt government.  We have Marxist-globalists running (collapsing) Canada.  They're doing it on purpose.  It's what they do.  That's a HUGE problem. permalink parent award report block reply DCPower 5 points 4 days ago Heh, years ago, Canadian healthcare was touted as way better than American. I told them to give it time. Now Canadian Healthcare prescribes death if the treatment is too expensive or the wait is too long. Reminds me of an old joke: a farmer is going along with his horse pulling a cart. Unfortunately, a car ends up colliding with them and the horse is badly wounded while the farmer has a banged up leg. A police officer comes along, hearing the horse crying out in pain and seeing that it’s not going to make it, pulls his gun out and puts the horse out of its misery. The officer than approaches the farmer, “I’m so sorry, you’re horse was so badly injured, that I had to put it down so it wouldn’t suffer anymore. How are you doing?” The farmer replied, “I’m fine!” permalink parent award report block reply TheGreatWhiteNorth 3 points 4 days ago Not such a funny joke for those living in Canada. Logan's Run.  50 is the new 30 with the option to off yourself sooner should you feel a little down. permalink parent award report block reply DCPower 2 points 4 days ago Well the irony is that those who are now offered death as healthcare were the ones shoving it in our faces about their great system. The American system is an abomination, but it still beats getting prescribed death. permalink parent award report block reply TheGreatWhiteNorth 2 points 3 days ago I'd argue that the original American system was excellent.  It is currently being restored by President Trump.  Good men need to be at the top if you want 'The Great Experiment' in freedom and sovereignty to succeed.  The world is learning a big lesson about this fundamental fact. permalink parent award report block reply view 1 more comments... load 22 more comments... hughjasske69 48 points 4 days ago Hurry up and get it done so I can buy a policy that I need and can afford instead of subsidizing all the lazy fuckers who refuse to work permalink award report block reply anotherthing 15 points 4 days ago I'm not sure why Trump is blaming the insurance companies on this. It's the same insurance companies that were providing my coverage before ObamaCare at a reasonable rate that still exist today with the insane premiums. The only difference would be ObamaCare. I thought they were expensive at the time, before ObamaCare, but holy shit. They're so much worse now. permalink parent award report block reply Here_we_go 13 points 4 days ago $300 a week for me and husband with an 8k deductible.  Its basically for a catastrophic incident. permalink parent award report block reply ScamBlondie 1 points 4 days ago I’m a young male with no prior medical conditions and in 2023 had a minimally invasive laparoscopic procedure for a torn labrum with no complications and was out of hospital the same day. They billed my insurance $62k. That $8k deductible won’t cover shit. permalink parent award report block reply NomadicKrow2 5 points 4 days ago My company's insurance now has like an 8k deductible. Once that's paid, they'll cover 100% of anything aft- Oh wait, no. Nope! This year, after the deductible, they cover 75%! permalink parent award report block reply glasscrawler 4 points 4 days ago And your insurance company probably said to the hospital: \"we negotiated 15k, here's 7k and bill the rest to the patient\". permalink parent award report block reply AVeryNakedMan 8 points 4 days ago I'm not sure why Trump is blaming the insurance companies on this. Because it's popular. Trump has a political sense of how to appeal to people that RINO's have never had. Trump can say he's fighting the insurance companies, but then sneak in some actual good policy ideas if Republicans actually pass a healthcare bill. permalink parent award report block reply MastaJoda 4 points 4 days ago I paid $320/mon full health and dental for my wife and son before it tripled under Obamacare. permalink parent award report block reply anotherthing 1 points 4 days ago My company dropped the highest tier insurance, added a lower tier so there were still three tiers, and it still went up. That company was still paying the same percentage. permalink parent award report block reply ADAM_SCHITT 4 points 4 days ago The insurance companies pushed for and helped create 0bamacare because it would lead to higher profits for them. permalink parent award report block reply anotherthing 1 points 4 days ago Except they didn't. The AHIP, which is a PAC for health insurance companies, was warning that ObamaCare would raise insurance rates back in 2010. https://www.politico.com/story/2010/03/health-groups-duke-it-out-033730 https://obamawhitehouse.archives.gov/the-press-office/excerpts-secretary-sebeliuss-address-americas-health-insurance-plans https://www.ahip.org/news/articles/five-steps-congress-can-take-to-make-health-care-more-affordable permalink parent award report block reply Washington_Redskins 2 points 4 days ago Guranteed customer base. Lets them do what they want.. Plus the government probably just goes along with any price increases rather than dropping the insurance company like most businesses would and switch to another. permalink parent award report block reply load 9 more comments... DCPower 3 points 4 days ago Nah it will do the same thing snap and section 8 did, raise the prices on everything. permalink parent award report block reply thunderpussy 1 points 4 days ago You will be subsidizing them anyway at twice the cost when they show up at an emergency room even sicker.... permalink parent award report block reply breadbaker 1 points 4 days ago You are not going to get it buying on your own a la Trump style. Insurance companies are profit making companies. The premium is set to make money relative to the information they have from very large data sets of people who were as old and as sick as you and data sets of costs to treat these conditions. On the other hand, healthcare is a losing proposition. You are sick and needs treatment will cost a certain amount and then you are cured, but you will not repay the costs to cure you. The most cost effective way to cure you would be to death panel you. Government is in the loss business. It either takes over excess medial costs from insurers (leaving them to manage the medical settings that diagnose and provide treatment options within a predefined set of frameworks) or take over catastrophic insurance costs regardless of insurer management of medical practices. If you find something new outside those options, in 30 years they might hand you a Nobel Prize in Economics. permalink parent award report block reply glasscrawler 2 points 4 days ago I would want a discount plan or insurance for anything above 10k, handling everything below that by myself. But I can't get anything like that because of government regulations, and I can't switch insurance whenever I want, also because of government regulations. permalink parent award report block reply josiborg 24 points 4 days ago I paid $300/mo for the best amazing BCBS pre-obamacare. It won't get back to that good but it's gotta get better than now. permalink award report block reply LostElf 16 points 4 days ago Never thought I'd be nostalgic for insurance. BCBS was so good back in the day. Got \"the letter\" this week. Cost doubled. Bye-bye insurance, thanks for sucking on me like a lamprey all these years that I never once met the deductible, not like all those thousands and thousands of dollars couldn't've been so much better invested/spent.... permalink parent award report block reply CastIronBeaver 5 points 4 days ago Sketchy story, but about 45 years ago I was told by a retired hospital administrator that BCBS virtually  built many rural hospitals because they would cover and pay for just about anything (including padded bills I'll assume). permalink parent award report block reply H0rse 3 points 4 days ago Which bcbs? permalink parent award report block reply Greenblatts_4skin 1 points 4 days ago Blue Cross Blue Shield permalink parent award report block reply H0rse 1 points 3 days ago Of Alabama? Texas? North Carolina? They're not all the same organization. They have different plans and shit. permalink parent award report block reply Greenblatts_4skin 1 points 4 days ago dont even get me started on Kaiser Permanente. That was great. WAS permalink parent award report block reply Greenblatts_4skin 3 points 4 days ago unless it was for a family, $300 was way too much pre-ACA permalink parent award report block reply josiborg 3 points 4 days ago Family permalink parent award report block reply MastaJoda 1 points 4 days ago mine was for wife and son with dental $320/month permalink parent award report block reply cslagenhop 2 points 4 days ago I remember $75/month.  No pregnancy coverage and no mental health coverage!   I don’t need/want either but am forced to buy!!!! permalink parent award report block reply MastaJoda 1 points 4 days ago BCBS $320/mon for my wife and son, also included dental... permalink parent award report block reply Reassess_Reevaluate 1 points 3 days ago Prior to Obamacare, I was paying $300'ish a month for an amazing family plan.  No co-pays, no minimum out-of-pocket before insurance kicks in.   Dental and vision. Now, if I want a similar plan I had in 2008, I have to spend $650 a PAYCHECK.  Now, granted, I'm paid very well.  But for a family with little to no health care issues, 8% of my paycheck every two weeks is fucking absurd. So I had to drop down to one of the mid-tier plans, which means the first $5,000 worth of medical expenses every year comes out of my pocket first before insurance even starts to kick in. permalink parent award report block reply Iliterallylovejv 23 points 4 days ago I just did open enrollment at my company. Currently, I have an amazing PPO plan for Family coverage at $1020 a month. They’ve now scrapped that plan, and all that remains is high deductible plans at basically the same price ($10 more a month). I must meet the deductible before insurance kicks in. Insurance is a scam. These companies deserve the worst fates. permalink award report block reply NY2KCMO1776 -1 points 4 days ago LUIGI  did nothing wrong and that's a hill I will die on.  As a cancer survivor the hell UHC put me through to get medicine I needed so I wouldn't die is inexcusable.   It's all greed to them.   People want to bitch and moan and complain about the corrupt, incestuous system but will do nothing to correct it.  Evil continues, persecution continues because weak men sit back and do nothing.  If we all stood up and fought back, this shit would end.  But they don't fear us so we continue to be slaves. 🤷🏾‍♀️ permalink parent award report block reply NutPsaki 6 points 4 days ago Nah Luigi definitely did something wrong. And if he’s that mad about it, shouldn’t he have targeted the actual architect of this system - Obama? permalink parent award report block reply Klown_Kutz 1 points 3 days ago That faggot didn’t have a clue. He just let congress put his name on it. permalink parent award report block reply yummy_yumm_yumms 2 points 4 days ago You sound like a vaccinated leftist permalink parent award report block reply bearhugprolapse 2 points 4 days ago maybe i’m just an old chunk of coal, but i never thought about shooting a guy in a suit on a weekday morning. fuck, i’ve got cancer, but i think i’d rather shoot cancer. if i’m at the ol’ scoreboard, i’m looking at that and going, “whoa there! looks like cancer needs shootin’ more than a guy in a suit on a weekday morning!” permalink parent award report block reply maverick202 2 points 4 days ago Oh yah let's support killing all these CEOs because you had hard time getting approval for your medicines. What a great plan. With that logic, it's justified when they attempted to murder Trump and took Charlie's life because they thought Trump and Charlie were existential threat to democracy and trans movement right? permalink parent award report block reply UCantStumpTheTrump -1 points 4 days ago keep in mind u/maverick202 is a self-admitted troll who comes here to insult \"white trash\" and \"incels\" (his words) and occasionally makes acceptable posts to blend in. permalink parent award report block reply Combat_Hamster 0 points 4 days ago You first. permalink parent award report block reply NY2KCMO1776 2 points 4 days ago Lol stay weak and cowardly. permalink parent award report block reply Combat_Hamster 2 points 4 days ago No seriously, lead the way so us weak and cowardly can be inspired by your example. What are waiting for? permalink parent award report block reply view 1 more comments... orca77 1 points 1 day ago Comment removed by community filter, pending further review. permalink parent award report block reply assblast 21 points 4 days ago Drain the swamp!!! Abolish property taxes!!! No more income tax!!! Deport all illegals!!! End the fillibuster!!! No more Obamacare!!! Lots of promises. Nothing really happening. Just saying \"everything is cheaper now\" when it's not doesn't count, either. permalink award report block reply Here_we_go 9 points 4 days ago I remember when no tax on overtime meant all overtime.  Now it is just on the 1/2 part. What happened to fort knox audit? Did the middle class get anything? permalink parent award report block reply NY2KCMO1776 4 points 4 days ago A big black Dildo up the ass no lube permalink parent award report block reply KernalMustard 6 points 4 days ago Eventually the Doomers will be proven right. People will fail you. Depend on yourselves. Its time to prepare for the worst permalink parent award report block reply Awakened 3 points 4 days ago Great advice. permalink parent award report block reply MastaJoda 1 points 4 days ago bro you seen egg prices bro!🤡👍 permalink parent award report block reply MasterChief 21 points 4 days ago A lot of talk, let's see some action. permalink award report block reply trumpORbust 11 points 4 days ago It's the same on everything Voter fraud Rouge judiciary Obviously corrupt politicians Money laundering act blue Auto Pen Mass deportation Blah blah blah talk talk talk permalink parent award report block reply Krat 10 points 4 days ago And no arrests permalink parent award report block reply DatTrumpDoh -1 points 4 days ago Most of those problems could be solved by nuking the filibuster permalink parent award report block reply NutPsaki 5 points 4 days ago But then you still need actual MAGA senators, which we don’t have. permalink parent award report block reply MastaJoda 3 points 4 days ago ☝This is the biggest obstacle. permalink parent award report block reply Awakened 4 points 4 days ago Yep, this is past being old. permalink parent award report block reply AFferalAF 16 points 4 days ago So the insurance companies haven't given him what he wants yet. Y'all get so excited to be bait. permalink award report block reply thelastlast 3 points 4 days ago sanest take unfortunately permalink parent award report block reply GdotLee 11 points 4 days ago Blame the evil insurance companies? Give me a fucking break.  It’s a fucking loot fest top to bottom.  Fraud everywhere.   Malpractice all over the place. permalink award report block reply thunderpussy 7 points 4 days ago I know. The level   of stupid and naive on this topic is stunning. The entire system is loaded with every grifting hand in it imaginable, from government, private equity, banks, Big pharma, pharmacy middle men, IT companies, medical outsourcing companies, law firms, insurance companies, you name it. Blaming just the insurance companies or Obamacare is nuts. That's a tiny tip of the iceberg. Add to that an aging, and sicker populace on top of it, too. permalink parent award report block reply MastaJoda 1 points 4 days ago And the just Congress. permalink parent award report block reply 5854110203868847 8 points 4 days ago Lefty retards:  WTF I LOVE INSURANCE COMPANIES NOW !!! permalink award report block reply Kiowa4Trump 6 points 4 days ago I’ve been shopping for insurance all weekend for my new small business.  With my previous employer I was paying $2300/month for my family to have a $10k family deductible!  To buy a similar plan will cost me $3300/month!!!   I am leaning towards Christian Healthcare Ministries as an alternative to have the peace of mind of a serious health event. permalink award report block reply MastaJoda 1 points 4 days ago Fuck, dude...I hope you're a millionaire. Thats insane. permalink parent award report block reply ChilledCovfefe 1 points 3 days ago I’m paying 2000 a month for my family in 2026 and that’s with an estimated 130k household income.  And it’s for the crappiest bronze policy. permalink parent award report block reply hillaryforprison 6 points 4 days ago please Trump end all taxes, especially property tax and income tax. Let the tariffs pay for a small government and close everything else. If there's leftover, send us a check. Throw Obiden in prison and all his cronies. permalink award report block reply Here_we_go 4 points 4 days ago Property taxes is local. He has no say. permalink parent award report block reply TrumpTheory 3 points 4 days ago Need an amendment against that. Even local state doesn't have a right to forcibly help itself to your property. permalink parent award report block reply thunderpussy 3 points 4 days ago Not remotely realistic. permalink parent award report block reply Pb82_Awards 5 points 4 days ago Some of y'all seem to forget we have an increasingly old and sick population so even without Obamacare, rates would be up a ton. permalink award report block reply thunderpussy 3 points 4 days ago Correct. permalink parent award report block reply Smurfection 5 points 4 days ago Yep.  People should be in charge of buying their own healthcare and paying for what they need.  Make insurance companies offer services directly to the consumers, like car insurance. permalink award report block reply Taupkek 5 points 4 days ago He's softening them up for negotiations. \"Lower prices or I send all your money away\" Literal 4D Chessmaster! permalink award report block reply MajorClark 5 points 4 days ago Obama, Schumer, Biden & other corrupt dems and rinos won't get their kickbacks either!    Defund the failed Obamacare! permalink award report block reply Creepy_Joe 5 points 4 days ago I haven't had health insurance or been to a doctor since Obamacare came out. Fuck it. When it's time to die I'll just die. permalink award report block reply Beardholder 4 points 4 days ago Get rid of Health insurance entirely.\nPut all Hospitals up on the competitive market and let their hospitals grow in greatness or shit down completely from either their great customer service or not. permalink award report block reply beansieman1911 4 points 4 days ago What exactly is he proposing here? permalink award report block reply Here_we_go 4 points 4 days ago Basically buy your own shit and youll get tax credits the year after Im guessing. permalink parent award report block reply America_No_1 4 points 4 days ago Worked for a healthcare plan most of my life - can confirm. permalink award report block reply GoldwaterVoter 4 points 4 days ago 2004 -- single male in my 60's with no health problems, never smoked, etc. Blue Cross full medical $350/month as individual payer. WTF happened to health insurance??? Somebody's getting rich. permalink award report block reply Keith 3 points 4 days ago Where do we get an insurance policy from without insurance companies? permalink award report block reply Kiowa4Trump 1 points 3 days ago Christian Health Ministries is the closest I’ve found.  Medishare is another one. permalink parent award report block reply hey_spike 3 points 4 days ago What would Luigi M. (one of the leftist's patron saints) do?  Eliminate the insurance middleman? permalink award report block reply booblitchutz 3 points 4 days ago Honest and transparent cash only pricing and competition among providers would put insurance companies out of business. Allow people to still contribute pre-tax dollars to HSAs permalink award report block reply keeman 3 points 4 days ago The problem with Obamacare is that it is socialism.  End it.  Replace it with nothing. permalink award report block reply IllKissYourBoobies 3 points 4 days ago HOOOOOOOOOOOLLLD!!!!! permalink award report block reply GeneticsGuy 3 points 4 days ago In case anyone is wondering, he very likely doesn't actually mean it, but this really is going to throw a wrench into the Democrats plans when people start saying \"Yes, give us the money directly!\" As in reality, 80% + of the country, most-likely, would pocket that money than send it and pay for insurance. Also, the Obamacare subsidies are INSANE. I lost my job for about 4 months so we were only on my wife's income at $82,000 a year for a family of 5, and we qualified for a plan that was the equivalent of $950/month at ZERO dollars a month for me. Then plan was mediocre. Think about that for a second, my wife and I earned over $80,000/year and they were still giving us nearly $12,000 in subsidies for an ACA plan. Absolutely bonkers. Oh and once I got a job it didn't matter, I didn't fall off the plan as you are enrolled for the whole year. The amount of cash handouts is exactly why inflation has been so bad. In reality though, this is nothing more than taxpayer money going direct into the pockets of the insurance companies. Of that $12,000 that went to the insurance companies, I used exactly ZERO claims this last year. It was just a big fat check to them. They are making BILLIONS on the American people. permalink award report block reply BlackPilledMAGA 3 points 4 days ago The insurance companies are the ones behind the whole thing. Them and Big Pharma have more or less owned DC for years. permalink award report block reply Synonymity 3 points 4 days ago Look at medical billing. It is a money laundering scheme. permalink award report block reply thunderpussy 2 points 4 days ago And medical upcoding is nearly an artform..... permalink parent award report block reply EdBuck 2 points 4 days ago So now all the Luigi Mangioni fan fags like Trump? Hahahahah not a chance they only like it when you murder people permalink award report block reply KarlHungus53 2 points 4 days ago So what do those of us idiots that pay to supply our employees with health insurance get? permalink award report block reply TNgirl4Trump 2 points 4 days ago Was wondering the same thing. permalink parent award report block reply Slamdangles2024 2 points 4 days ago Spoiler Alert: People will have to pay more, because anytime any politician makes any sort of move, we pay more. permalink award report block reply JustInTime2_ 2 points 4 days ago Yes. It must happen. permalink award report block reply NotInFormation 2 points 4 days ago Eliminate the trial lawyer scam that started it all with the need for malpractice insurance and doctors can again serve patients. Until then doctors must serve to mitigate legal risk and nothing else. permalink award report block reply Awakened 2 points 4 days ago But you can't make that happen and the GOP will stop you if you try, let alone the democrats. permalink award report block reply KeepMarxInTheGround 1 points 4 days ago I had to use COBRA a few months back until my insurance at a new job kicked in. $1700 per month for myself, wife, and three children. Not for any special plan, just regular healthcare. Before Obamacare, it would've been around $300 per month. permalink award report block reply Pb82_Awards 1 points 4 days ago Now we're talking! permalink award report block reply thisisatestof2 1 points 4 days ago Watch, all of a sudden the Dems will decide they love big insurance and big business. permalink award report block reply Klaus73 1 points 4 days ago So...the republicans have a insurance plan was a lie then? permalink award report block reply Here_we_go 2 points 4 days ago But medicaid and medicare get fat meds for cheap. Except medicaid people pay for nothing. But we're supposed to be elated permalink parent award report block reply Michalusmichalus 1 points 4 days ago This is taking away the medical industrial complex's monopoly. It's a good step. permalink award report block reply Klown_Kutz 1 points 4 days ago Corporations are not our friends. Insurance companies WROTE Obamacare. permalink award report block reply MAGA9428 1 points 3 days ago Oh fuck no. My health insurance is amazing and my boss pays for every penny of it. I don’t want to have to buy a policy myself. permalink award report block reply Tmntnyc 1 points 4 days ago Most people here would not have qualified for insurance before ACA. With ACA there is a mandate that preexisting conditions cannot be used to deny health insurance or to adjust pricing. Used to be that many people were “uninsurable” or had to buy plans that would cost much much more with exclusions for their known conditions. Survived cancer in your 30’s? Diabetic? Heart condition? You literally had to buy insurance that excluded those things while paying more or go without any insurance. Oh, you have new onset migraines? I see in your medical record that you complained about a headache 5 years ago in a PCP visit…sorry, no coverage for that. When they abolish ACA (Obamacare), most people will actually end up paying more or go uninsured. permalink award report block reply PoleWatcher 1 points 3 days ago Like I said it's all talk, but we really need to feel these changes and ideas that actually are pipe dreams. Are we being continually baited or something? GOP really needs to support Trump and get things happening, and not in 2028, NOW permalink award report block reply MoreGuns 1 points 4 days ago 2 more weeks! permalink award report block reply Reassess_Reevaluate 1 points 3 days ago Get my fucking employer out of my healthcare chain. Why in the flying fuck are they giving me the illusion of choice every year between several shitty plans? permalink award report block reply thelastlast 1 points 4 days ago you know just when i get pissed at him he does something i really like permalink award report block reply LakeAmeritaga 1 points 3 days ago forget letting people buying their own policies too!  Just buying their own healthcare as needed will be immensely cheaper permalink award report block reply PearlyGaits57 1 points 3 days ago I am all in! permalink award report block reply Psalm-118_24 1 points 3 days ago Mr POTUS, hospitals, pharma and illegals contribute to the astronomical costs of Healthcare too.  If you're like our state, look around you at hospital expansion. Our hospitals made a killing during covid, not only of patients but on their finances too. Also, if all the illegals and freeloaders are removed from taxpayer funded programs, the rest of us will have our costs go way down because we won't be paying for the illegals/freeloaders. permalink award report block reply PoleWatcher 0 points 4 days ago Better staet feeling so e relief,  his talk is just vaporizing. Hope he makes some changes for the people to benefit from permalink award report block reply flashersenpai 0 points 4 days ago wat dis mean? i haven't paid for insurance in years. And it still scalds my ass when they drop prices 50% and pretend they're giving me a discount. permalink award report block reply bill_in_texas -2 points 4 days ago Trump seems like he's just throwing shit at the wall now, seeing what sticks.  The recent election shellacking must have shook him, or at least brought him back to reality. permalink award report block reply\nTheGreatWhiteNorth 57 points 4 days ago We need to get rid of the tyrannical socialist healthcare scam system in Canada, too.  This facade of a country that calls itself Canada -- in every way, shape, and form -- needs President Trump to take over and claw it back from the Marxist-globalists. Monroe Doctrine, Manifest Destiny https://truthsocial.com/@realDonaldTrump/posts/113794510592692386 permalink award report block reply goldkeyboardwarrior 17 points 4 days ago The Canadians can handle their own shit. I’m more concerned about what happens within our borders. permalink parent award report block reply TheGreatWhiteNorth 7 points 4 days ago No, we can't.  We're only around 43 million people uselessly spread across a vast winter wasteland.  Our last hurrah was the Freedom Convoy.  Remember how that turned out?  Right.  Explain how we can handle the Marxist-globalist attack on our own when even the United States was about to be written off if it wasn't for Trump backed by the US military. permalink parent award report block reply FrmrAmericanRepublic 8 points 4 days ago Assuming that firearms still exist in Canada, I'd use USA history as a guide on that score. Like we hear often here, you don't vote your way out of communism/marxism. permalink parent award report block reply TheGreatWhiteNorth 1 points 4 days ago Like I already said, we're only around 43 million people uselessly spread across vast distances from each other.  You think Canadians can 'get together' and shoot their way out of this?  Trump would never allow for the slaughter of innocent Canadians.  Meantime, he has made it very clear that Canada can only work as the 51st State. permalink parent award report block reply view 16 more comments... Kingoftheroad 3 points 4 days ago Canada isnt 43 million people lol unless you count 10 million muslim and indian foreigners who have fraudulent citizenship given by corrupted government agencies permalink parent award report block reply TheGreatWhiteNorth 2 points 3 days ago If you don't like the padded number, then make it 33 million lol.  That makes my argument even better.  Clearly, Canada is doomed unless Trump takes over. permalink parent award report block reply view 1 more comments... Moose_Antlers 2 points 4 days ago This is important. Geopolitically we need our Canadian northern shield. They're our missile shield and first strike detection for Russian ICBMs. They're our northern flank and our bridge between Alaska and the lower 48. They're resource-rich and come from a common ethnic and cultural heritage. We'll even tolerate the French. The Cajuns can bridge the gap, there =) There is no rational reason on this Earth to give up on Canada, or to find ourselves in an intractable squabble with them. If the Marxists are a problem, we need to help them with that, for our own good as well as theirs. It may take some courage to sever from the Commonwealth and figure out precisely what a new path truly independent of the British Parliament and Crown really looks like. Junior partnership with the US isn't a great solution to try and sell. True partnership (ie statehood) is much better - but I can understand the immense pushback such a suggestion receives from proud and patriotic Canadians who value their own unique identity. Hard choices. permalink parent award report block reply TheGreatWhiteNorth 1 points 3 days ago I can agree with you on this. With the way things are rolling out step by step (as if on schedule), I'd say our 'connection' with the Commonwealth has already been severed.  We're simply going through the motions that will conclude with Canada becoming the 51st State.  What's important here is optics, and getting everyone on both sides of the border to (gladly) accept the inevitable first.  Meantime, the 'squeeze' continues on Canada.  Carnage Carney is doing his 'best' to make sure Canada breaks apart.  I'd be tempted to call him Central Casting at this point. permalink parent award report block reply goldkeyboardwarrior 1 points 4 days ago I answered under the assumption that you were an American saying we need to go into Canada to fix what is going on up there. I feel your pain but we’re going to have to try and get what’s going on down here fixed before we can give you guys an hand. permalink parent award report block reply TheGreatWhiteNorth 0 points 3 days ago President Trump is the GOAT.  Don't underestimate that man.  The progress he's made for America and the rest of the world so far is mind-blowing. Meantime, think national security.  Don't forget the Golden Dome. May 27, 2025 https://truthsocial.com/@realDonaldTrump/posts/114581970051938528 TRUMP:  I told Canada, which very much wants to be part of our fabulous Golden Dome System, that it will cost $61 Billion Dollars if they remain a separate, but unequal, Nation, but will cost ZERO DOLLARS if they become our cherished 51st State. They are considering the offer!\n. September 30, 2025 President Donald Trump Address Military Leaders at Quantico https://www.youtube.com/watch?v=hk_rdU0-UTI TRUMP:  We're investing tens of billions of 32:04\ndollars in modernizing our nuclear deterrence capabilities like never before. And we've begun construction on 32:10\nwhat we call the Golden Dome missile defense shield. It'll be the most sophisticated in the world. You watched 32:15\nit do well until they had some problems at the end with a little bit of a lack 32:23\nof ammunition, defensive ammunition, but they've got that taken care of. But I 32:30\ntell you, it's uh what we're doing is so good and we deserve it. You know, we we help other countries with it. We don't 32:36\nhave it ourselves. And Canada called me a couple of weeks ago. They want to be part of it. to\n32:42\nwhich I said,\"Well, why don't you just join our country? You become 51, become the 51st state and you get it for free.\" 32:51\nSo, I don't know if that made a big impact, but it does make a lot of sense. It actually because they're having a 32:57\nhard time up there in Canada now because, as you know, with tariffs, everyone's coming into our country. We 33:02\nhave more investment than we've ever had before. 17 trillion dollars coming in. permalink parent award report block reply Than0sIII 17 points 4 days ago United Continent of America, lesgo. permalink parent award report block reply TheGreatWhiteNorth 17 points 4 days ago Fortress America.  Oh yeah. permalink parent award report block reply tralbolh 12 points 4 days ago I don't want Mezoamerica. permalink parent award report block reply Smurfection 6 points 4 days ago No one wants an alliance with Mexico on anything.  The Cartels are basically running the country. permalink parent award report block reply Washington_Redskins 4 points 4 days ago If a new government didn't mind killing a million or two cartel members and associates or puppets it could be fixed..? I don't think that's likely to happen anytime soon permalink parent award report block reply Moose_Antlers 1 points 4 days ago US + Canada, sure. But the imports have to go first. I'm not interested in the Chinese and Indian subcontinent contingents being annexed and added, and the Marxist Francophones can stay too (non-Marxists welcome). But I'm ruling out the Hispanics. They've had 70 years since Eisenhower's mass deportation to prove that they could come in legally and integrate. They don't. And I don't ever want to have to speak Spanish to some ... client... because he's unable to speak a word of English despite being in the country for a decade or more. They can unite in Mexico if they want. permalink parent award report block reply tpactionchasethevote 13 points 4 days ago Obamacare forces everyone to contribute to the Rockefeller allopathic system of petroleum based pharmaceuticals, symptoms, and surgeries while ignoring cheap or natural cures, prevention, nutrition, and root causes permalink parent award report block reply TheGreatWhiteNorth 6 points 4 days ago Same in Canada but much worse. permalink parent award report block reply Mathelm 6 points 4 days ago Well good for Canada, that because someone's grandfather MAY have fished by an area they can now take your home. One trial court judge invalidated ALL property rights, so yeah. permalink parent award report block reply Washington_Redskins 3 points 4 days ago Teach a man to fish and feed him for a day.. Let a man fish from your property and lose it for a lifetime. permalink parent award report block reply TheGreatWhiteNorth 0 points 4 days ago That makes no sense at all. permalink parent award report block reply TheGreatWhiteNorth 1 points 4 days ago Yup.  There's that, too. permalink parent award report block reply NomadicKrow2 1 points 4 days ago Woah, what happened? permalink parent award report block reply Mathelm 1 points 4 days ago ‘Cowichan case’ : Injin tribe sued for land, on the \"reconciliation\" principle, that they hold some Indigenous Title to 750 Hectares of Land; So a judge awarded them this land, the land is within Richmond BC, which is almost completely developed with homes. So this slice of land has been given to this tribe, forcing all of the current property owners to lose their titles to their homes. 95% of British Columbia wasn't officially \"ceded\" with each individual tribe, so now there are numerous bullshit tribes coming out of the literal woodwork, suing to take the land. Currently the entire city of Kamaloops is now under lawsuit. This is just further proof that humanity can never leave a single survivor when conquering another civilization. European politeness has just destroyed all notion of property rights in BC if not Canada. permalink parent award report block reply NomadicKrow2 2 points 4 days ago I think I'd have to tell Chief Steals Your Home to suck my dick or get off my property. Any words after that would be met with gunfire. I worked too fucking hard to let some dipshit redskin pie face drunkard take my house without a fight. permalink parent award report block reply view 2 more comments... TheGreatWhiteNorth 0 points 3 days ago It's not the survivors that are the problem.  Most of the native Indians don't like this shite either.  They don't get much say, they don't get heard.  Their Chiefs are corrupt.  Guess who's getting paid off. The problem is our corrupt government.  We have Marxist-globalists running (collapsing) Canada.  They're doing it on purpose.  It's what they do.  That's a HUGE problem. permalink parent award report block reply DCPower 5 points 4 days ago Heh, years ago, Canadian healthcare was touted as way better than American. I told them to give it time. Now Canadian Healthcare prescribes death if the treatment is too expensive or the wait is too long. Reminds me of an old joke: a farmer is going along with his horse pulling a cart. Unfortunately, a car ends up colliding with them and the horse is badly wounded while the farmer has a banged up leg. A police officer comes along, hearing the horse crying out in pain and seeing that it’s not going to make it, pulls his gun out and puts the horse out of its misery. The officer than approaches the farmer, “I’m so sorry, you’re horse was so badly injured, that I had to put it down so it wouldn’t suffer anymore. How are you doing?” The farmer replied, “I’m fine!” permalink parent award report block reply TheGreatWhiteNorth 3 points 4 days ago Not such a funny joke for those living in Canada. Logan's Run.  50 is the new 30 with the option to off yourself sooner should you feel a little down. permalink parent award report block reply DCPower 2 points 4 days ago Well the irony is that those who are now offered death as healthcare were the ones shoving it in our faces about their great system. The American system is an abomination, but it still beats getting prescribed death. permalink parent award report block reply TheGreatWhiteNorth 2 points 3 days ago I'd argue that the original American system was excellent.  It is currently being restored by President Trump.  Good men need to be at the top if you want 'The Great Experiment' in freedom and sovereignty to succeed.  The world is learning a big lesson about this fundamental fact. permalink parent award report block reply view 1 more comments... load 22 more comments...\ngoldkeyboardwarrior 17 points 4 days ago The Canadians can handle their own shit. I’m more concerned about what happens within our borders. permalink parent award report block reply TheGreatWhiteNorth 7 points 4 days ago No, we can't.  We're only around 43 million people uselessly spread across a vast winter wasteland.  Our last hurrah was the Freedom Convoy.  Remember how that turned out?  Right.  Explain how we can handle the Marxist-globalist attack on our own when even the United States was about to be written off if it wasn't for Trump backed by the US military. permalink parent award report block reply FrmrAmericanRepublic 8 points 4 days ago Assuming that firearms still exist in Canada, I'd use USA history as a guide on that score. Like we hear often here, you don't vote your way out of communism/marxism. permalink parent award report block reply TheGreatWhiteNorth 1 points 4 days ago Like I already said, we're only around 43 million people uselessly spread across vast distances from each other.  You think Canadians can 'get together' and shoot their way out of this?  Trump would never allow for the slaughter of innocent Canadians.  Meantime, he has made it very clear that Canada can only work as the 51st State. permalink parent award report block reply view 16 more comments... Kingoftheroad 3 points 4 days ago Canada isnt 43 million people lol unless you count 10 million muslim and indian foreigners who have fraudulent citizenship given by corrupted government agencies permalink parent award report block reply TheGreatWhiteNorth 2 points 3 days ago If you don't like the padded number, then make it 33 million lol.  That makes my argument even better.  Clearly, Canada is doomed unless Trump takes over. permalink parent award report block reply view 1 more comments... Moose_Antlers 2 points 4 days ago This is important. Geopolitically we need our Canadian northern shield. They're our missile shield and first strike detection for Russian ICBMs. They're our northern flank and our bridge between Alaska and the lower 48. They're resource-rich and come from a common ethnic and cultural heritage. We'll even tolerate the French. The Cajuns can bridge the gap, there =) There is no rational reason on this Earth to give up on Canada, or to find ourselves in an intractable squabble with them. If the Marxists are a problem, we need to help them with that, for our own good as well as theirs. It may take some courage to sever from the Commonwealth and figure out precisely what a new path truly independent of the British Parliament and Crown really looks like. Junior partnership with the US isn't a great solution to try and sell. True partnership (ie statehood) is much better - but I can understand the immense pushback such a suggestion receives from proud and patriotic Canadians who value their own unique identity. Hard choices. permalink parent award report block reply TheGreatWhiteNorth 1 points 3 days ago I can agree with you on this. With the way things are rolling out step by step (as if on schedule), I'd say our 'connection' with the Commonwealth has already been severed.  We're simply going through the motions that will conclude with Canada becoming the 51st State.  What's important here is optics, and getting everyone on both sides of the border to (gladly) accept the inevitable first.  Meantime, the 'squeeze' continues on Canada.  Carnage Carney is doing his 'best' to make sure Canada breaks apart.  I'd be tempted to call him Central Casting at this point. permalink parent award report block reply goldkeyboardwarrior 1 points 4 days ago I answered under the assumption that you were an American saying we need to go into Canada to fix what is going on up there. I feel your pain but we’re going to have to try and get what’s going on down here fixed before we can give you guys an hand. permalink parent award report block reply TheGreatWhiteNorth 0 points 3 days ago President Trump is the GOAT.  Don't underestimate that man.  The progress he's made for America and the rest of the world so far is mind-blowing. Meantime, think national security.  Don't forget the Golden Dome. May 27, 2025 https://truthsocial.com/@realDonaldTrump/posts/114581970051938528 TRUMP:  I told Canada, which very much wants to be part of our fabulous Golden Dome System, that it will cost $61 Billion Dollars if they remain a separate, but unequal, Nation, but will cost ZERO DOLLARS if they become our cherished 51st State. They are considering the offer!\n. September 30, 2025 President Donald Trump Address Military Leaders at Quantico https://www.youtube.com/watch?v=hk_rdU0-UTI TRUMP:  We're investing tens of billions of 32:04\ndollars in modernizing our nuclear deterrence capabilities like never before. And we've begun construction on 32:10\nwhat we call the Golden Dome missile defense shield. It'll be the most sophisticated in the world. You watched 32:15\nit do well until they had some problems at the end with a little bit of a lack 32:23\nof ammunition, defensive ammunition, but they've got that taken care of. But I 32:30\ntell you, it's uh what we're doing is so good and we deserve it. You know, we we help other countries with it. We don't 32:36\nhave it ourselves. And Canada called me a couple of weeks ago. They want to be part of it. to\n32:42\nwhich I said,\"Well, why don't you just join our country? You become 51, become the 51st state and you get it for free.\" 32:51\nSo, I don't know if that made a big impact, but it does make a lot of sense. It actually because they're having a 32:57\nhard time up there in Canada now because, as you know, with tariffs, everyone's coming into our country. We 33:02\nhave more investment than we've ever had before. 17 trillion dollars coming in. permalink parent award report block reply\nTheGreatWhiteNorth 7 points 4 days ago No, we can't.  We're only around 43 million people uselessly spread across a vast winter wasteland.  Our last hurrah was the Freedom Convoy.  Remember how that turned out?  Right.  Explain how we can handle the Marxist-globalist attack on our own when even the United States was about to be written off if it wasn't for Trump backed by the US military. permalink parent award report block reply FrmrAmericanRepublic 8 points 4 days ago Assuming that firearms still exist in Canada, I'd use USA history as a guide on that score. Like we hear often here, you don't vote your way out of communism/marxism. permalink parent award report block reply TheGreatWhiteNorth 1 points 4 days ago Like I already said, we're only around 43 million people uselessly spread across vast distances from each other.  You think Canadians can 'get together' and shoot their way out of this?  Trump would never allow for the slaughter of innocent Canadians.  Meantime, he has made it very clear that Canada can only work as the 51st State. permalink parent award report block reply view 16 more comments... Kingoftheroad 3 points 4 days ago Canada isnt 43 million people lol unless you count 10 million muslim and indian foreigners who have fraudulent citizenship given by corrupted government agencies permalink parent award report block reply TheGreatWhiteNorth 2 points 3 days ago If you don't like the padded number, then make it 33 million lol.  That makes my argument even better.  Clearly, Canada is doomed unless Trump takes over. permalink parent award report block reply view 1 more comments... Moose_Antlers 2 points 4 days ago This is important. Geopolitically we need our Canadian northern shield. They're our missile shield and first strike detection for Russian ICBMs. They're our northern flank and our bridge between Alaska and the lower 48. They're resource-rich and come from a common ethnic and cultural heritage. We'll even tolerate the French. The Cajuns can bridge the gap, there =) There is no rational reason on this Earth to give up on Canada, or to find ourselves in an intractable squabble with them. If the Marxists are a problem, we need to help them with that, for our own good as well as theirs. It may take some courage to sever from the Commonwealth and figure out precisely what a new path truly independent of the British Parliament and Crown really looks like. Junior partnership with the US isn't a great solution to try and sell. True partnership (ie statehood) is much better - but I can understand the immense pushback such a suggestion receives from proud and patriotic Canadians who value their own unique identity. Hard choices. permalink parent award report block reply TheGreatWhiteNorth 1 points 3 days ago I can agree with you on this. With the way things are rolling out step by step (as if on schedule), I'd say our 'connection' with the Commonwealth has already been severed.  We're simply going through the motions that will conclude with Canada becoming the 51st State.  What's important here is optics, and getting everyone on both sides of the border to (gladly) accept the inevitable first.  Meantime, the 'squeeze' continues on Canada.  Carnage Carney is doing his 'best' to make sure Canada breaks apart.  I'd be tempted to call him Central Casting at this point. permalink parent award report block reply goldkeyboardwarrior 1 points 4 days ago I answered under the assumption that you were an American saying we need to go into Canada to fix what is going on up there. I feel your pain but we’re going to have to try and get what’s going on down here fixed before we can give you guys an hand. permalink parent award report block reply TheGreatWhiteNorth 0 points 3 days ago President Trump is the GOAT.  Don't underestimate that man.  The progress he's made for America and the rest of the world so far is mind-blowing. Meantime, think national security.  Don't forget the Golden Dome. May 27, 2025 https://truthsocial.com/@realDonaldTrump/posts/114581970051938528 TRUMP:  I told Canada, which very much wants to be part of our fabulous Golden Dome System, that it will cost $61 Billion Dollars if they remain a separate, but unequal, Nation, but will cost ZERO DOLLARS if they become our cherished 51st State. They are considering the offer!\n. September 30, 2025 President Donald Trump Address Military Leaders at Quantico https://www.youtube.com/watch?v=hk_rdU0-UTI TRUMP:  We're investing tens of billions of 32:04\ndollars in modernizing our nuclear deterrence capabilities like never before. And we've begun construction on 32:10\nwhat we call the Golden Dome missile defense shield. It'll be the most sophisticated in the world. You watched 32:15\nit do well until they had some problems at the end with a little bit of a lack 32:23\nof ammunition, defensive ammunition, but they've got that taken care of. But I 32:30\ntell you, it's uh what we're doing is so good and we deserve it. You know, we we help other countries with it. We don't 32:36\nhave it ourselves. And Canada called me a couple of weeks ago. They want to be part of it. to\n32:42\nwhich I said,\"Well, why don't you just join our country? You become 51, become the 51st state and you get it for free.\" 32:51\nSo, I don't know if that made a big impact, but it does make a lot of sense. It actually because they're having a 32:57\nhard time up there in Canada now because, as you know, with tariffs, everyone's coming into our country. We 33:02\nhave more investment than we've ever had before. 17 trillion dollars coming in. permalink parent award report block reply\nFrmrAmericanRepublic 8 points 4 days ago Assuming that firearms still exist in Canada, I'd use USA history as a guide on that score. Like we hear often here, you don't vote your way out of communism/marxism. permalink parent award report block reply TheGreatWhiteNorth 1 points 4 days ago Like I already said, we're only around 43 million people uselessly spread across vast distances from each other.  You think Canadians can 'get together' and shoot their way out of this?  Trump would never allow for the slaughter of innocent Canadians.  Meantime, he has made it very clear that Canada can only work as the 51st State. permalink parent award report block reply view 16 more comments...\nTheGreatWhiteNorth 1 points 4 days ago Like I already said, we're only around 43 million people uselessly spread across vast distances from each other.  You think Canadians can 'get together' and shoot their way out of this?  Trump would never allow for the slaughter of innocent Canadians.  Meantime, he has made it very clear that Canada can only work as the 51st State. permalink parent award report block reply view 16 more comments...\nKingoftheroad 3 points 4 days ago Canada isnt 43 million people lol unless you count 10 million muslim and indian foreigners who have fraudulent citizenship given by corrupted government agencies permalink parent award report block reply TheGreatWhiteNorth 2 points 3 days ago If you don't like the padded number, then make it 33 million lol.  That makes my argument even better.  Clearly, Canada is doomed unless Trump takes over. permalink parent award report block reply view 1 more comments...\nTheGreatWhiteNorth 2 points 3 days ago If you don't like the padded number, then make it 33 million lol.  That makes my argument even better.  Clearly, Canada is doomed unless Trump takes over. permalink parent award report block reply view 1 more comments...\nMoose_Antlers 2 points 4 days ago This is important. Geopolitically we need our Canadian northern shield. They're our missile shield and first strike detection for Russian ICBMs. They're our northern flank and our bridge between Alaska and the lower 48. They're resource-rich and come from a common ethnic and cultural heritage. We'll even tolerate the French. The Cajuns can bridge the gap, there =) There is no rational reason on this Earth to give up on Canada, or to find ourselves in an intractable squabble with them. If the Marxists are a problem, we need to help them with that, for our own good as well as theirs. It may take some courage to sever from the Commonwealth and figure out precisely what a new path truly independent of the British Parliament and Crown really looks like. Junior partnership with the US isn't a great solution to try and sell. True partnership (ie statehood) is much better - but I can understand the immense pushback such a suggestion receives from proud and patriotic Canadians who value their own unique identity. Hard choices. permalink parent award report block reply TheGreatWhiteNorth 1 points 3 days ago I can agree with you on this. With the way things are rolling out step by step (as if on schedule), I'd say our 'connection' with the Commonwealth has already been severed.  We're simply going through the motions that will conclude with Canada becoming the 51st State.  What's important here is optics, and getting everyone on both sides of the border to (gladly) accept the inevitable first.  Meantime, the 'squeeze' continues on Canada.  Carnage Carney is doing his 'best' to make sure Canada breaks apart.  I'd be tempted to call him Central Casting at this point. permalink parent award report block reply\nTheGreatWhiteNorth 1 points 3 days ago I can agree with you on this. With the way things are rolling out step by step (as if on schedule), I'd say our 'connection' with the Commonwealth has already been severed.  We're simply going through the motions that will conclude with Canada becoming the 51st State.  What's important here is optics, and getting everyone on both sides of the border to (gladly) accept the inevitable first.  Meantime, the 'squeeze' continues on Canada.  Carnage Carney is doing his 'best' to make sure Canada breaks apart.  I'd be tempted to call him Central Casting at this point. permalink parent award report block reply\ngoldkeyboardwarrior 1 points 4 days ago I answered under the assumption that you were an American saying we need to go into Canada to fix what is going on up there. I feel your pain but we’re going to have to try and get what’s going on down here fixed before we can give you guys an hand. permalink parent award report block reply TheGreatWhiteNorth 0 points 3 days ago President Trump is the GOAT.  Don't underestimate that man.  The progress he's made for America and the rest of the world so far is mind-blowing. Meantime, think national security.  Don't forget the Golden Dome. May 27, 2025 https://truthsocial.com/@realDonaldTrump/posts/114581970051938528 TRUMP:  I told Canada, which very much wants to be part of our fabulous Golden Dome System, that it will cost $61 Billion Dollars if they remain a separate, but unequal, Nation, but will cost ZERO DOLLARS if they become our cherished 51st State. They are considering the offer!\n. September 30, 2025 President Donald Trump Address Military Leaders at Quantico https://www.youtube.com/watch?v=hk_rdU0-UTI TRUMP:  We're investing tens of billions of 32:04\ndollars in modernizing our nuclear deterrence capabilities like never before. And we've begun construction on 32:10\nwhat we call the Golden Dome missile defense shield. It'll be the most sophisticated in the world. You watched 32:15\nit do well until they had some problems at the end with a little bit of a lack 32:23\nof ammunition, defensive ammunition, but they've got that taken care of. But I 32:30\ntell you, it's uh what we're doing is so good and we deserve it. You know, we we help other countries with it. We don't 32:36\nhave it ourselves. And Canada called me a couple of weeks ago. They want to be part of it. to\n32:42\nwhich I said,\"Well, why don't you just join our country? You become 51, become the 51st state and you get it for free.\" 32:51\nSo, I don't know if that made a big impact, but it does make a lot of sense. It actually because they're having a 32:57\nhard time up there in Canada now because, as you know, with tariffs, everyone's coming into our country. We 33:02\nhave more investment than we've ever had before. 17 trillion dollars coming in. permalink parent award report block reply\nTheGreatWhiteNorth 0 points 3 days ago President Trump is the GOAT.  Don't underestimate that man.  The progress he's made for America and the rest of the world so far is mind-blowing. Meantime, think national security.  Don't forget the Golden Dome. May 27, 2025 https://truthsocial.com/@realDonaldTrump/posts/114581970051938528 TRUMP:  I told Canada, which very much wants to be part of our fabulous Golden Dome System, that it will cost $61 Billion Dollars if they remain a separate, but unequal, Nation, but will cost ZERO DOLLARS if they become our cherished 51st State. They are considering the offer!\n. September 30, 2025 President Donald Trump Address Military Leaders at Quantico https://www.youtube.com/watch?v=hk_rdU0-UTI TRUMP:  We're investing tens of billions of 32:04\ndollars in modernizing our nuclear deterrence capabilities like never before. And we've begun construction on 32:10\nwhat we call the Golden Dome missile defense shield. It'll be the most sophisticated in the world. You watched 32:15\nit do well until they had some problems at the end with a little bit of a lack 32:23\nof ammunition, defensive ammunition, but they've got that taken care of. But I 32:30\ntell you, it's uh what we're doing is so good and we deserve it. You know, we we help other countries with it. We don't 32:36\nhave it ourselves. And Canada called me a couple of weeks ago. They want to be part of it. to\n32:42\nwhich I said,\"Well, why don't you just join our country? You become 51, become the 51st state and you get it for free.\" 32:51\nSo, I don't know if that made a big impact, but it does make a lot of sense. It actually because they're having a 32:57\nhard time up there in Canada now because, as you know, with tariffs, everyone's coming into our country. We 33:02\nhave more investment than we've ever had before. 17 trillion dollars coming in. permalink parent award report block reply\nThan0sIII 17 points 4 days ago United Continent of America, lesgo. permalink parent award report block reply TheGreatWhiteNorth 17 points 4 days ago Fortress America.  Oh yeah. permalink parent award report block reply tralbolh 12 points 4 days ago I don't want Mezoamerica. permalink parent award report block reply Smurfection 6 points 4 days ago No one wants an alliance with Mexico on anything.  The Cartels are basically running the country. permalink parent award report block reply Washington_Redskins 4 points 4 days ago If a new government didn't mind killing a million or two cartel members and associates or puppets it could be fixed..? I don't think that's likely to happen anytime soon permalink parent award report block reply Moose_Antlers 1 points 4 days ago US + Canada, sure. But the imports have to go first. I'm not interested in the Chinese and Indian subcontinent contingents being annexed and added, and the Marxist Francophones can stay too (non-Marxists welcome). But I'm ruling out the Hispanics. They've had 70 years since Eisenhower's mass deportation to prove that they could come in legally and integrate. They don't. And I don't ever want to have to speak Spanish to some ... client... because he's unable to speak a word of English despite being in the country for a decade or more. They can unite in Mexico if they want. permalink parent award report block reply\nTheGreatWhiteNorth 17 points 4 days ago Fortress America.  Oh yeah. permalink parent award report block reply\ntralbolh 12 points 4 days ago I don't want Mezoamerica. permalink parent award report block reply Smurfection 6 points 4 days ago No one wants an alliance with Mexico on anything.  The Cartels are basically running the country. permalink parent award report block reply Washington_Redskins 4 points 4 days ago If a new government didn't mind killing a million or two cartel members and associates or puppets it could be fixed..? I don't think that's likely to happen anytime soon permalink parent award report block reply\nSmurfection 6 points 4 days ago No one wants an alliance with Mexico on anything.  The Cartels are basically running the country. permalink parent award report block reply Washington_Redskins 4 points 4 days ago If a new government didn't mind killing a million or two cartel members and associates or puppets it could be fixed..? I don't think that's likely to happen anytime soon permalink parent award report block reply\nWashington_Redskins 4 points 4 days ago If a new government didn't mind killing a million or two cartel members and associates or puppets it could be fixed..? I don't think that's likely to happen anytime soon permalink parent award report block reply\nMoose_Antlers 1 points 4 days ago US + Canada, sure. But the imports have to go first. I'm not interested in the Chinese and Indian subcontinent contingents being annexed and added, and the Marxist Francophones can stay too (non-Marxists welcome). But I'm ruling out the Hispanics. They've had 70 years since Eisenhower's mass deportation to prove that they could come in legally and integrate. They don't. And I don't ever want to have to speak Spanish to some ... client... because he's unable to speak a word of English despite being in the country for a decade or more. They can unite in Mexico if they want. permalink parent award report block reply\ntpactionchasethevote 13 points 4 days ago Obamacare forces everyone to contribute to the Rockefeller allopathic system of petroleum based pharmaceuticals, symptoms, and surgeries while ignoring cheap or natural cures, prevention, nutrition, and root causes permalink parent award report block reply TheGreatWhiteNorth 6 points 4 days ago Same in Canada but much worse. permalink parent award report block reply\nTheGreatWhiteNorth 6 points 4 days ago Same in Canada but much worse. permalink parent award report block reply\nMathelm 6 points 4 days ago Well good for Canada, that because someone's grandfather MAY have fished by an area they can now take your home. One trial court judge invalidated ALL property rights, so yeah. permalink parent award report block reply Washington_Redskins 3 points 4 days ago Teach a man to fish and feed him for a day.. Let a man fish from your property and lose it for a lifetime. permalink parent award report block reply TheGreatWhiteNorth 0 points 4 days ago That makes no sense at all. permalink parent award report block reply TheGreatWhiteNorth 1 points 4 days ago Yup.  There's that, too. permalink parent award report block reply NomadicKrow2 1 points 4 days ago Woah, what happened? permalink parent award report block reply Mathelm 1 points 4 days ago ‘Cowichan case’ : Injin tribe sued for land, on the \"reconciliation\" principle, that they hold some Indigenous Title to 750 Hectares of Land; So a judge awarded them this land, the land is within Richmond BC, which is almost completely developed with homes. So this slice of land has been given to this tribe, forcing all of the current property owners to lose their titles to their homes. 95% of British Columbia wasn't officially \"ceded\" with each individual tribe, so now there are numerous bullshit tribes coming out of the literal woodwork, suing to take the land. Currently the entire city of Kamaloops is now under lawsuit. This is just further proof that humanity can never leave a single survivor when conquering another civilization. European politeness has just destroyed all notion of property rights in BC if not Canada. permalink parent award report block reply NomadicKrow2 2 points 4 days ago I think I'd have to tell Chief Steals Your Home to suck my dick or get off my property. Any words after that would be met with gunfire. I worked too fucking hard to let some dipshit redskin pie face drunkard take my house without a fight. permalink parent award report block reply view 2 more comments... TheGreatWhiteNorth 0 points 3 days ago It's not the survivors that are the problem.  Most of the native Indians don't like this shite either.  They don't get much say, they don't get heard.  Their Chiefs are corrupt.  Guess who's getting paid off. The problem is our corrupt government.  We have Marxist-globalists running (collapsing) Canada.  They're doing it on purpose.  It's what they do.  That's a HUGE problem. permalink parent award report block reply\nWashington_Redskins 3 points 4 days ago Teach a man to fish and feed him for a day.. Let a man fish from your property and lose it for a lifetime. permalink parent award report block reply TheGreatWhiteNorth 0 points 4 days ago That makes no sense at all. permalink parent award report block reply\nTheGreatWhiteNorth 0 points 4 days ago That makes no sense at all. permalink parent award report block reply\nTheGreatWhiteNorth 1 points 4 days ago Yup.  There's that, too. permalink parent award report block reply\nNomadicKrow2 1 points 4 days ago Woah, what happened? permalink parent award report block reply Mathelm 1 points 4 days ago ‘Cowichan case’ : Injin tribe sued for land, on the \"reconciliation\" principle, that they hold some Indigenous Title to 750 Hectares of Land; So a judge awarded them this land, the land is within Richmond BC, which is almost completely developed with homes. So this slice of land has been given to this tribe, forcing all of the current property owners to lose their titles to their homes. 95% of British Columbia wasn't officially \"ceded\" with each individual tribe, so now there are numerous bullshit tribes coming out of the literal woodwork, suing to take the land. Currently the entire city of Kamaloops is now under lawsuit. This is just further proof that humanity can never leave a single survivor when conquering another civilization. European politeness has just destroyed all notion of property rights in BC if not Canada. permalink parent award report block reply NomadicKrow2 2 points 4 days ago I think I'd have to tell Chief Steals Your Home to suck my dick or get off my property. Any words after that would be met with gunfire. I worked too fucking hard to let some dipshit redskin pie face drunkard take my house without a fight. permalink parent award report block reply view 2 more comments... TheGreatWhiteNorth 0 points 3 days ago It's not the survivors that are the problem.  Most of the native Indians don't like this shite either.  They don't get much say, they don't get heard.  Their Chiefs are corrupt.  Guess who's getting paid off. The problem is our corrupt government.  We have Marxist-globalists running (collapsing) Canada.  They're doing it on purpose.  It's what they do.  That's a HUGE problem. permalink parent award report block reply\nMathelm 1 points 4 days ago ‘Cowichan case’ : Injin tribe sued for land, on the \"reconciliation\" principle, that they hold some Indigenous Title to 750 Hectares of Land; So a judge awarded them this land, the land is within Richmond BC, which is almost completely developed with homes. So this slice of land has been given to this tribe, forcing all of the current property owners to lose their titles to their homes. 95% of British Columbia wasn't officially \"ceded\" with each individual tribe, so now there are numerous bullshit tribes coming out of the literal woodwork, suing to take the land. Currently the entire city of Kamaloops is now under lawsuit. This is just further proof that humanity can never leave a single survivor when conquering another civilization. European politeness has just destroyed all notion of property rights in BC if not Canada. permalink parent award report block reply NomadicKrow2 2 points 4 days ago I think I'd have to tell Chief Steals Your Home to suck my dick or get off my property. Any words after that would be met with gunfire. I worked too fucking hard to let some dipshit redskin pie face drunkard take my house without a fight. permalink parent award report block reply view 2 more comments... TheGreatWhiteNorth 0 points 3 days ago It's not the survivors that are the problem.  Most of the native Indians don't like this shite either.  They don't get much say, they don't get heard.  Their Chiefs are corrupt.  Guess who's getting paid off. The problem is our corrupt government.  We have Marxist-globalists running (collapsing) Canada.  They're doing it on purpose.  It's what they do.  That's a HUGE problem. permalink parent award report block reply\nNomadicKrow2 2 points 4 days ago I think I'd have to tell Chief Steals Your Home to suck my dick or get off my property. Any words after that would be met with gunfire. I worked too fucking hard to let some dipshit redskin pie face drunkard take my house without a fight. permalink parent award report block reply view 2 more comments...\nTheGreatWhiteNorth 0 points 3 days ago It's not the survivors that are the problem.  Most of the native Indians don't like this shite either.  They don't get much say, they don't get heard.  Their Chiefs are corrupt.  Guess who's getting paid off. The problem is our corrupt government.  We have Marxist-globalists running (collapsing) Canada.  They're doing it on purpose.  It's what they do.  That's a HUGE problem. permalink parent award report block reply\nDCPower 5 points 4 days ago Heh, years ago, Canadian healthcare was touted as way better than American. I told them to give it time. Now Canadian Healthcare prescribes death if the treatment is too expensive or the wait is too long. Reminds me of an old joke: a farmer is going along with his horse pulling a cart. Unfortunately, a car ends up colliding with them and the horse is badly wounded while the farmer has a banged up leg. A police officer comes along, hearing the horse crying out in pain and seeing that it’s not going to make it, pulls his gun out and puts the horse out of its misery. The officer than approaches the farmer, “I’m so sorry, you’re horse was so badly injured, that I had to put it down so it wouldn’t suffer anymore. How are you doing?” The farmer replied, “I’m fine!” permalink parent award report block reply TheGreatWhiteNorth 3 points 4 days ago Not such a funny joke for those living in Canada. Logan's Run.  50 is the new 30 with the option to off yourself sooner should you feel a little down. permalink parent award report block reply DCPower 2 points 4 days ago Well the irony is that those who are now offered death as healthcare were the ones shoving it in our faces about their great system. The American system is an abomination, but it still beats getting prescribed death. permalink parent award report block reply TheGreatWhiteNorth 2 points 3 days ago I'd argue that the original American system was excellent.  It is currently being restored by President Trump.  Good men need to be at the top if you want 'The Great Experiment' in freedom and sovereignty to succeed.  The world is learning a big lesson about this fundamental fact. permalink parent award report block reply view 1 more comments...\nTheGreatWhiteNorth 3 points 4 days ago Not such a funny joke for those living in Canada. Logan's Run.  50 is the new 30 with the option to off yourself sooner should you feel a little down. permalink parent award report block reply DCPower 2 points 4 days ago Well the irony is that those who are now offered death as healthcare were the ones shoving it in our faces about their great system. The American system is an abomination, but it still beats getting prescribed death. permalink parent award report block reply TheGreatWhiteNorth 2 points 3 days ago I'd argue that the original American system was excellent.  It is currently being restored by President Trump.  Good men need to be at the top if you want 'The Great Experiment' in freedom and sovereignty to succeed.  The world is learning a big lesson about this fundamental fact. permalink parent award report block reply view 1 more comments...\nDCPower 2 points 4 days ago Well the irony is that those who are now offered death as healthcare were the ones shoving it in our faces about their great system. The American system is an abomination, but it still beats getting prescribed death. permalink parent award report block reply TheGreatWhiteNorth 2 points 3 days ago I'd argue that the original American system was excellent.  It is currently being restored by President Trump.  Good men need to be at the top if you want 'The Great Experiment' in freedom and sovereignty to succeed.  The world is learning a big lesson about this fundamental fact. permalink parent award report block reply view 1 more comments...\nTheGreatWhiteNorth 2 points 3 days ago I'd argue that the original American system was excellent.  It is currently being restored by President Trump.  Good men need to be at the top if you want 'The Great Experiment' in freedom and sovereignty to succeed.  The world is learning a big lesson about this fundamental fact. permalink parent award report block reply view 1 more comments...\nhughjasske69 48 points 4 days ago Hurry up and get it done so I can buy a policy that I need and can afford instead of subsidizing all the lazy fuckers who refuse to work permalink award report block reply anotherthing 15 points 4 days ago I'm not sure why Trump is blaming the insurance companies on this. It's the same insurance companies that were providing my coverage before ObamaCare at a reasonable rate that still exist today with the insane premiums. The only difference would be ObamaCare. I thought they were expensive at the time, before ObamaCare, but holy shit. They're so much worse now. permalink parent award report block reply Here_we_go 13 points 4 days ago $300 a week for me and husband with an 8k deductible.  Its basically for a catastrophic incident. permalink parent award report block reply ScamBlondie 1 points 4 days ago I’m a young male with no prior medical conditions and in 2023 had a minimally invasive laparoscopic procedure for a torn labrum with no complications and was out of hospital the same day. They billed my insurance $62k. That $8k deductible won’t cover shit. permalink parent award report block reply NomadicKrow2 5 points 4 days ago My company's insurance now has like an 8k deductible. Once that's paid, they'll cover 100% of anything aft- Oh wait, no. Nope! This year, after the deductible, they cover 75%! permalink parent award report block reply glasscrawler 4 points 4 days ago And your insurance company probably said to the hospital: \"we negotiated 15k, here's 7k and bill the rest to the patient\". permalink parent award report block reply AVeryNakedMan 8 points 4 days ago I'm not sure why Trump is blaming the insurance companies on this. Because it's popular. Trump has a political sense of how to appeal to people that RINO's have never had. Trump can say he's fighting the insurance companies, but then sneak in some actual good policy ideas if Republicans actually pass a healthcare bill. permalink parent award report block reply MastaJoda 4 points 4 days ago I paid $320/mon full health and dental for my wife and son before it tripled under Obamacare. permalink parent award report block reply anotherthing 1 points 4 days ago My company dropped the highest tier insurance, added a lower tier so there were still three tiers, and it still went up. That company was still paying the same percentage. permalink parent award report block reply ADAM_SCHITT 4 points 4 days ago The insurance companies pushed for and helped create 0bamacare because it would lead to higher profits for them. permalink parent award report block reply anotherthing 1 points 4 days ago Except they didn't. The AHIP, which is a PAC for health insurance companies, was warning that ObamaCare would raise insurance rates back in 2010. https://www.politico.com/story/2010/03/health-groups-duke-it-out-033730 https://obamawhitehouse.archives.gov/the-press-office/excerpts-secretary-sebeliuss-address-americas-health-insurance-plans https://www.ahip.org/news/articles/five-steps-congress-can-take-to-make-health-care-more-affordable permalink parent award report block reply Washington_Redskins 2 points 4 days ago Guranteed customer base. Lets them do what they want.. Plus the government probably just goes along with any price increases rather than dropping the insurance company like most businesses would and switch to another. permalink parent award report block reply load 9 more comments... DCPower 3 points 4 days ago Nah it will do the same thing snap and section 8 did, raise the prices on everything. permalink parent award report block reply thunderpussy 1 points 4 days ago You will be subsidizing them anyway at twice the cost when they show up at an emergency room even sicker.... permalink parent award report block reply breadbaker 1 points 4 days ago You are not going to get it buying on your own a la Trump style. Insurance companies are profit making companies. The premium is set to make money relative to the information they have from very large data sets of people who were as old and as sick as you and data sets of costs to treat these conditions. On the other hand, healthcare is a losing proposition. You are sick and needs treatment will cost a certain amount and then you are cured, but you will not repay the costs to cure you. The most cost effective way to cure you would be to death panel you. Government is in the loss business. It either takes over excess medial costs from insurers (leaving them to manage the medical settings that diagnose and provide treatment options within a predefined set of frameworks) or take over catastrophic insurance costs regardless of insurer management of medical practices. If you find something new outside those options, in 30 years they might hand you a Nobel Prize in Economics. permalink parent award report block reply glasscrawler 2 points 4 days ago I would want a discount plan or insurance for anything above 10k, handling everything below that by myself. But I can't get anything like that because of government regulations, and I can't switch insurance whenever I want, also because of government regulations. permalink parent award report block reply\nanotherthing 15 points 4 days ago I'm not sure why Trump is blaming the insurance companies on this. It's the same insurance companies that were providing my coverage before ObamaCare at a reasonable rate that still exist today with the insane premiums. The only difference would be ObamaCare. I thought they were expensive at the time, before ObamaCare, but holy shit. They're so much worse now. permalink parent award report block reply Here_we_go 13 points 4 days ago $300 a week for me and husband with an 8k deductible.  Its basically for a catastrophic incident. permalink parent award report block reply ScamBlondie 1 points 4 days ago I’m a young male with no prior medical conditions and in 2023 had a minimally invasive laparoscopic procedure for a torn labrum with no complications and was out of hospital the same day. They billed my insurance $62k. That $8k deductible won’t cover shit. permalink parent award report block reply NomadicKrow2 5 points 4 days ago My company's insurance now has like an 8k deductible. Once that's paid, they'll cover 100% of anything aft- Oh wait, no. Nope! This year, after the deductible, they cover 75%! permalink parent award report block reply glasscrawler 4 points 4 days ago And your insurance company probably said to the hospital: \"we negotiated 15k, here's 7k and bill the rest to the patient\". permalink parent award report block reply AVeryNakedMan 8 points 4 days ago I'm not sure why Trump is blaming the insurance companies on this. Because it's popular. Trump has a political sense of how to appeal to people that RINO's have never had. Trump can say he's fighting the insurance companies, but then sneak in some actual good policy ideas if Republicans actually pass a healthcare bill. permalink parent award report block reply MastaJoda 4 points 4 days ago I paid $320/mon full health and dental for my wife and son before it tripled under Obamacare. permalink parent award report block reply anotherthing 1 points 4 days ago My company dropped the highest tier insurance, added a lower tier so there were still three tiers, and it still went up. That company was still paying the same percentage. permalink parent award report block reply ADAM_SCHITT 4 points 4 days ago The insurance companies pushed for and helped create 0bamacare because it would lead to higher profits for them. permalink parent award report block reply anotherthing 1 points 4 days ago Except they didn't. The AHIP, which is a PAC for health insurance companies, was warning that ObamaCare would raise insurance rates back in 2010. https://www.politico.com/story/2010/03/health-groups-duke-it-out-033730 https://obamawhitehouse.archives.gov/the-press-office/excerpts-secretary-sebeliuss-address-americas-health-insurance-plans https://www.ahip.org/news/articles/five-steps-congress-can-take-to-make-health-care-more-affordable permalink parent award report block reply Washington_Redskins 2 points 4 days ago Guranteed customer base. Lets them do what they want.. Plus the government probably just goes along with any price increases rather than dropping the insurance company like most businesses would and switch to another. permalink parent award report block reply load 9 more comments...\nHere_we_go 13 points 4 days ago $300 a week for me and husband with an 8k deductible.  Its basically for a catastrophic incident. permalink parent award report block reply ScamBlondie 1 points 4 days ago I’m a young male with no prior medical conditions and in 2023 had a minimally invasive laparoscopic procedure for a torn labrum with no complications and was out of hospital the same day. They billed my insurance $62k. That $8k deductible won’t cover shit. permalink parent award report block reply NomadicKrow2 5 points 4 days ago My company's insurance now has like an 8k deductible. Once that's paid, they'll cover 100% of anything aft- Oh wait, no. Nope! This year, after the deductible, they cover 75%! permalink parent award report block reply glasscrawler 4 points 4 days ago And your insurance company probably said to the hospital: \"we negotiated 15k, here's 7k and bill the rest to the patient\". permalink parent award report block reply\nScamBlondie 1 points 4 days ago I’m a young male with no prior medical conditions and in 2023 had a minimally invasive laparoscopic procedure for a torn labrum with no complications and was out of hospital the same day. They billed my insurance $62k. That $8k deductible won’t cover shit. permalink parent award report block reply NomadicKrow2 5 points 4 days ago My company's insurance now has like an 8k deductible. Once that's paid, they'll cover 100% of anything aft- Oh wait, no. Nope! This year, after the deductible, they cover 75%! permalink parent award report block reply glasscrawler 4 points 4 days ago And your insurance company probably said to the hospital: \"we negotiated 15k, here's 7k and bill the rest to the patient\". permalink parent award report block reply\nNomadicKrow2 5 points 4 days ago My company's insurance now has like an 8k deductible. Once that's paid, they'll cover 100% of anything aft- Oh wait, no. Nope! This year, after the deductible, they cover 75%! permalink parent award report block reply\nglasscrawler 4 points 4 days ago And your insurance company probably said to the hospital: \"we negotiated 15k, here's 7k and bill the rest to the patient\". permalink parent award report block reply\nAVeryNakedMan 8 points 4 days ago I'm not sure why Trump is blaming the insurance companies on this. Because it's popular. Trump has a political sense of how to appeal to people that RINO's have never had. Trump can say he's fighting the insurance companies, but then sneak in some actual good policy ideas if Republicans actually pass a healthcare bill. permalink parent award report block reply\nMastaJoda 4 points 4 days ago I paid $320/mon full health and dental for my wife and son before it tripled under Obamacare. permalink parent award report block reply anotherthing 1 points 4 days ago My company dropped the highest tier insurance, added a lower tier so there were still three tiers, and it still went up. That company was still paying the same percentage. permalink parent award report block reply\nanotherthing 1 points 4 days ago My company dropped the highest tier insurance, added a lower tier so there were still three tiers, and it still went up. That company was still paying the same percentage. permalink parent award report block reply\nADAM_SCHITT 4 points 4 days ago The insurance companies pushed for and helped create 0bamacare because it would lead to higher profits for them. permalink parent award report block reply anotherthing 1 points 4 days ago Except they didn't. The AHIP, which is a PAC for health insurance companies, was warning that ObamaCare would raise insurance rates back in 2010. https://www.politico.com/story/2010/03/health-groups-duke-it-out-033730 https://obamawhitehouse.archives.gov/the-press-office/excerpts-secretary-sebeliuss-address-americas-health-insurance-plans https://www.ahip.org/news/articles/five-steps-congress-can-take-to-make-health-care-more-affordable permalink parent award report block reply\nanotherthing 1 points 4 days ago Except they didn't. The AHIP, which is a PAC for health insurance companies, was warning that ObamaCare would raise insurance rates back in 2010. https://www.politico.com/story/2010/03/health-groups-duke-it-out-033730 https://obamawhitehouse.archives.gov/the-press-office/excerpts-secretary-sebeliuss-address-americas-health-insurance-plans https://www.ahip.org/news/articles/five-steps-congress-can-take-to-make-health-care-more-affordable permalink parent award report block reply\nWashington_Redskins 2 points 4 days ago Guranteed customer base. Lets them do what they want.. Plus the government probably just goes along with any price increases rather than dropping the insurance company like most businesses would and switch to another. permalink parent award report block reply\nDCPower 3 points 4 days ago Nah it will do the same thing snap and section 8 did, raise the prices on everything. permalink parent award report block reply\nthunderpussy 1 points 4 days ago You will be subsidizing them anyway at twice the cost when they show up at an emergency room even sicker.... permalink parent award report block reply\nbreadbaker 1 points 4 days ago You are not going to get it buying on your own a la Trump style. Insurance companies are profit making companies. The premium is set to make money relative to the information they have from very large data sets of people who were as old and as sick as you and data sets of costs to treat these conditions. On the other hand, healthcare is a losing proposition. You are sick and needs treatment will cost a certain amount and then you are cured, but you will not repay the costs to cure you. The most cost effective way to cure you would be to death panel you. Government is in the loss business. It either takes over excess medial costs from insurers (leaving them to manage the medical settings that diagnose and provide treatment options within a predefined set of frameworks) or take over catastrophic insurance costs regardless of insurer management of medical practices. If you find something new outside those options, in 30 years they might hand you a Nobel Prize in Economics. permalink parent award report block reply glasscrawler 2 points 4 days ago I would want a discount plan or insurance for anything above 10k, handling everything below that by myself. But I can't get anything like that because of government regulations, and I can't switch insurance whenever I want, also because of government regulations. permalink parent award report block reply\nglasscrawler 2 points 4 days ago I would want a discount plan or insurance for anything above 10k, handling everything below that by myself. But I can't get anything like that because of government regulations, and I can't switch insurance whenever I want, also because of government regulations. permalink parent award report block reply\njosiborg 24 points 4 days ago I paid $300/mo for the best amazing BCBS pre-obamacare. It won't get back to that good but it's gotta get better than now. permalink award report block reply LostElf 16 points 4 days ago Never thought I'd be nostalgic for insurance. BCBS was so good back in the day. Got \"the letter\" this week. Cost doubled. Bye-bye insurance, thanks for sucking on me like a lamprey all these years that I never once met the deductible, not like all those thousands and thousands of dollars couldn't've been so much better invested/spent.... permalink parent award report block reply CastIronBeaver 5 points 4 days ago Sketchy story, but about 45 years ago I was told by a retired hospital administrator that BCBS virtually  built many rural hospitals because they would cover and pay for just about anything (including padded bills I'll assume). permalink parent award report block reply H0rse 3 points 4 days ago Which bcbs? permalink parent award report block reply Greenblatts_4skin 1 points 4 days ago Blue Cross Blue Shield permalink parent award report block reply H0rse 1 points 3 days ago Of Alabama? Texas? North Carolina? They're not all the same organization. They have different plans and shit. permalink parent award report block reply Greenblatts_4skin 1 points 4 days ago dont even get me started on Kaiser Permanente. That was great. WAS permalink parent award report block reply Greenblatts_4skin 3 points 4 days ago unless it was for a family, $300 was way too much pre-ACA permalink parent award report block reply josiborg 3 points 4 days ago Family permalink parent award report block reply MastaJoda 1 points 4 days ago mine was for wife and son with dental $320/month permalink parent award report block reply cslagenhop 2 points 4 days ago I remember $75/month.  No pregnancy coverage and no mental health coverage!   I don’t need/want either but am forced to buy!!!! permalink parent award report block reply MastaJoda 1 points 4 days ago BCBS $320/mon for my wife and son, also included dental... permalink parent award report block reply Reassess_Reevaluate 1 points 3 days ago Prior to Obamacare, I was paying $300'ish a month for an amazing family plan.  No co-pays, no minimum out-of-pocket before insurance kicks in.   Dental and vision. Now, if I want a similar plan I had in 2008, I have to spend $650 a PAYCHECK.  Now, granted, I'm paid very well.  But for a family with little to no health care issues, 8% of my paycheck every two weeks is fucking absurd. So I had to drop down to one of the mid-tier plans, which means the first $5,000 worth of medical expenses every year comes out of my pocket first before insurance even starts to kick in. permalink parent award report block reply\nLostElf 16 points 4 days ago Never thought I'd be nostalgic for insurance. BCBS was so good back in the day. Got \"the letter\" this week. Cost doubled. Bye-bye insurance, thanks for sucking on me like a lamprey all these years that I never once met the deductible, not like all those thousands and thousands of dollars couldn't've been so much better invested/spent.... permalink parent award report block reply CastIronBeaver 5 points 4 days ago Sketchy story, but about 45 years ago I was told by a retired hospital administrator that BCBS virtually  built many rural hospitals because they would cover and pay for just about anything (including padded bills I'll assume). permalink parent award report block reply H0rse 3 points 4 days ago Which bcbs? permalink parent award report block reply Greenblatts_4skin 1 points 4 days ago Blue Cross Blue Shield permalink parent award report block reply H0rse 1 points 3 days ago Of Alabama? Texas? North Carolina? They're not all the same organization. They have different plans and shit. permalink parent award report block reply Greenblatts_4skin 1 points 4 days ago dont even get me started on Kaiser Permanente. That was great. WAS permalink parent award report block reply\nCastIronBeaver 5 points 4 days ago Sketchy story, but about 45 years ago I was told by a retired hospital administrator that BCBS virtually  built many rural hospitals because they would cover and pay for just about anything (including padded bills I'll assume). permalink parent award report block reply\nH0rse 3 points 4 days ago Which bcbs? permalink parent award report block reply Greenblatts_4skin 1 points 4 days ago Blue Cross Blue Shield permalink parent award report block reply H0rse 1 points 3 days ago Of Alabama? Texas? North Carolina? They're not all the same organization. They have different plans and shit. permalink parent award report block reply\nGreenblatts_4skin 1 points 4 days ago Blue Cross Blue Shield permalink parent award report block reply H0rse 1 points 3 days ago Of Alabama? Texas? North Carolina? They're not all the same organization. They have different plans and shit. permalink parent award report block reply\nH0rse 1 points 3 days ago Of Alabama? Texas? North Carolina? They're not all the same organization. They have different plans and shit. permalink parent award report block reply\nGreenblatts_4skin 1 points 4 days ago dont even get me started on Kaiser Permanente. That was great. WAS permalink parent award report block reply\nGreenblatts_4skin 3 points 4 days ago unless it was for a family, $300 was way too much pre-ACA permalink parent award report block reply josiborg 3 points 4 days ago Family permalink parent award report block reply MastaJoda 1 points 4 days ago mine was for wife and son with dental $320/month permalink parent award report block reply\njosiborg 3 points 4 days ago Family permalink parent award report block reply MastaJoda 1 points 4 days ago mine was for wife and son with dental $320/month permalink parent award report block reply\nMastaJoda 1 points 4 days ago mine was for wife and son with dental $320/month permalink parent award report block reply\ncslagenhop 2 points 4 days ago I remember $75/month.  No pregnancy coverage and no mental health coverage!   I don’t need/want either but am forced to buy!!!! permalink parent award report block reply\nMastaJoda 1 points 4 days ago BCBS $320/mon for my wife and son, also included dental... permalink parent award report block reply\nReassess_Reevaluate 1 points 3 days ago Prior to Obamacare, I was paying $300'ish a month for an amazing family plan.  No co-pays, no minimum out-of-pocket before insurance kicks in.   Dental and vision. Now, if I want a similar plan I had in 2008, I have to spend $650 a PAYCHECK.  Now, granted, I'm paid very well.  But for a family with little to no health care issues, 8% of my paycheck every two weeks is fucking absurd. So I had to drop down to one of the mid-tier plans, which means the first $5,000 worth of medical expenses every year comes out of my pocket first before insurance even starts to kick in. permalink parent award report block reply\nIliterallylovejv 23 points 4 days ago I just did open enrollment at my company. Currently, I have an amazing PPO plan for Family coverage at $1020 a month. They’ve now scrapped that plan, and all that remains is high deductible plans at basically the same price ($10 more a month). I must meet the deductible before insurance kicks in. Insurance is a scam. These companies deserve the worst fates. permalink award report block reply NY2KCMO1776 -1 points 4 days ago LUIGI  did nothing wrong and that's a hill I will die on.  As a cancer survivor the hell UHC put me through to get medicine I needed so I wouldn't die is inexcusable.   It's all greed to them.   People want to bitch and moan and complain about the corrupt, incestuous system but will do nothing to correct it.  Evil continues, persecution continues because weak men sit back and do nothing.  If we all stood up and fought back, this shit would end.  But they don't fear us so we continue to be slaves. 🤷🏾‍♀️ permalink parent award report block reply NutPsaki 6 points 4 days ago Nah Luigi definitely did something wrong. And if he’s that mad about it, shouldn’t he have targeted the actual architect of this system - Obama? permalink parent award report block reply Klown_Kutz 1 points 3 days ago That faggot didn’t have a clue. He just let congress put his name on it. permalink parent award report block reply yummy_yumm_yumms 2 points 4 days ago You sound like a vaccinated leftist permalink parent award report block reply bearhugprolapse 2 points 4 days ago maybe i’m just an old chunk of coal, but i never thought about shooting a guy in a suit on a weekday morning. fuck, i’ve got cancer, but i think i’d rather shoot cancer. if i’m at the ol’ scoreboard, i’m looking at that and going, “whoa there! looks like cancer needs shootin’ more than a guy in a suit on a weekday morning!” permalink parent award report block reply maverick202 2 points 4 days ago Oh yah let's support killing all these CEOs because you had hard time getting approval for your medicines. What a great plan. With that logic, it's justified when they attempted to murder Trump and took Charlie's life because they thought Trump and Charlie were existential threat to democracy and trans movement right? permalink parent award report block reply UCantStumpTheTrump -1 points 4 days ago keep in mind u/maverick202 is a self-admitted troll who comes here to insult \"white trash\" and \"incels\" (his words) and occasionally makes acceptable posts to blend in. permalink parent award report block reply Combat_Hamster 0 points 4 days ago You first. permalink parent award report block reply NY2KCMO1776 2 points 4 days ago Lol stay weak and cowardly. permalink parent award report block reply Combat_Hamster 2 points 4 days ago No seriously, lead the way so us weak and cowardly can be inspired by your example. What are waiting for? permalink parent award report block reply view 1 more comments... orca77 1 points 1 day ago Comment removed by community filter, pending further review. permalink parent award report block reply\nNY2KCMO1776 -1 points 4 days ago LUIGI  did nothing wrong and that's a hill I will die on.  As a cancer survivor the hell UHC put me through to get medicine I needed so I wouldn't die is inexcusable.   It's all greed to them.   People want to bitch and moan and complain about the corrupt, incestuous system but will do nothing to correct it.  Evil continues, persecution continues because weak men sit back and do nothing.  If we all stood up and fought back, this shit would end.  But they don't fear us so we continue to be slaves. 🤷🏾‍♀️ permalink parent award report block reply NutPsaki 6 points 4 days ago Nah Luigi definitely did something wrong. And if he’s that mad about it, shouldn’t he have targeted the actual architect of this system - Obama? permalink parent award report block reply Klown_Kutz 1 points 3 days ago That faggot didn’t have a clue. He just let congress put his name on it. permalink parent award report block reply yummy_yumm_yumms 2 points 4 days ago You sound like a vaccinated leftist permalink parent award report block reply bearhugprolapse 2 points 4 days ago maybe i’m just an old chunk of coal, but i never thought about shooting a guy in a suit on a weekday morning. fuck, i’ve got cancer, but i think i’d rather shoot cancer. if i’m at the ol’ scoreboard, i’m looking at that and going, “whoa there! looks like cancer needs shootin’ more than a guy in a suit on a weekday morning!” permalink parent award report block reply maverick202 2 points 4 days ago Oh yah let's support killing all these CEOs because you had hard time getting approval for your medicines. What a great plan. With that logic, it's justified when they attempted to murder Trump and took Charlie's life because they thought Trump and Charlie were existential threat to democracy and trans movement right? permalink parent award report block reply UCantStumpTheTrump -1 points 4 days ago keep in mind u/maverick202 is a self-admitted troll who comes here to insult \"white trash\" and \"incels\" (his words) and occasionally makes acceptable posts to blend in. permalink parent award report block reply Combat_Hamster 0 points 4 days ago You first. permalink parent award report block reply NY2KCMO1776 2 points 4 days ago Lol stay weak and cowardly. permalink parent award report block reply Combat_Hamster 2 points 4 days ago No seriously, lead the way so us weak and cowardly can be inspired by your example. What are waiting for? permalink parent award report block reply view 1 more comments... orca77 1 points 1 day ago Comment removed by community filter, pending further review. permalink parent award report block reply\nNutPsaki 6 points 4 days ago Nah Luigi definitely did something wrong. And if he’s that mad about it, shouldn’t he have targeted the actual architect of this system - Obama? permalink parent award report block reply Klown_Kutz 1 points 3 days ago That faggot didn’t have a clue. He just let congress put his name on it. permalink parent award report block reply\nKlown_Kutz 1 points 3 days ago That faggot didn’t have a clue. He just let congress put his name on it. permalink parent award report block reply\nyummy_yumm_yumms 2 points 4 days ago You sound like a vaccinated leftist permalink parent award report block reply\nbearhugprolapse 2 points 4 days ago maybe i’m just an old chunk of coal, but i never thought about shooting a guy in a suit on a weekday morning. fuck, i’ve got cancer, but i think i’d rather shoot cancer. if i’m at the ol’ scoreboard, i’m looking at that and going, “whoa there! looks like cancer needs shootin’ more than a guy in a suit on a weekday morning!” permalink parent award report block reply\nmaverick202 2 points 4 days ago Oh yah let's support killing all these CEOs because you had hard time getting approval for your medicines. What a great plan. With that logic, it's justified when they attempted to murder Trump and took Charlie's life because they thought Trump and Charlie were existential threat to democracy and trans movement right? permalink parent award report block reply UCantStumpTheTrump -1 points 4 days ago keep in mind u/maverick202 is a self-admitted troll who comes here to insult \"white trash\" and \"incels\" (his words) and occasionally makes acceptable posts to blend in. permalink parent award report block reply\nUCantStumpTheTrump -1 points 4 days ago keep in mind u/maverick202 is a self-admitted troll who comes here to insult \"white trash\" and \"incels\" (his words) and occasionally makes acceptable posts to blend in. permalink parent award report block reply\nCombat_Hamster 0 points 4 days ago You first. permalink parent award report block reply NY2KCMO1776 2 points 4 days ago Lol stay weak and cowardly. permalink parent award report block reply Combat_Hamster 2 points 4 days ago No seriously, lead the way so us weak and cowardly can be inspired by your example. What are waiting for? permalink parent award report block reply view 1 more comments... orca77 1 points 1 day ago Comment removed by community filter, pending further review. permalink parent award report block reply\nNY2KCMO1776 2 points 4 days ago Lol stay weak and cowardly. permalink parent award report block reply Combat_Hamster 2 points 4 days ago No seriously, lead the way so us weak and cowardly can be inspired by your example. What are waiting for? permalink parent award report block reply view 1 more comments... orca77 1 points 1 day ago Comment removed by community filter, pending further review. permalink parent award report block reply\nCombat_Hamster 2 points 4 days ago No seriously, lead the way so us weak and cowardly can be inspired by your example. What are waiting for? permalink parent award report block reply view 1 more comments...\norca77 1 points 1 day ago Comment removed by community filter, pending further review. permalink parent award report block reply\nassblast 21 points 4 days ago Drain the swamp!!! Abolish property taxes!!! No more income tax!!! Deport all illegals!!! End the fillibuster!!! No more Obamacare!!! Lots of promises. Nothing really happening. Just saying \"everything is cheaper now\" when it's not doesn't count, either. permalink award report block reply Here_we_go 9 points 4 days ago I remember when no tax on overtime meant all overtime.  Now it is just on the 1/2 part. What happened to fort knox audit? Did the middle class get anything? permalink parent award report block reply NY2KCMO1776 4 points 4 days ago A big black Dildo up the ass no lube permalink parent award report block reply KernalMustard 6 points 4 days ago Eventually the Doomers will be proven right. People will fail you. Depend on yourselves. Its time to prepare for the worst permalink parent award report block reply Awakened 3 points 4 days ago Great advice. permalink parent award report block reply MastaJoda 1 points 4 days ago bro you seen egg prices bro!🤡👍 permalink parent award report block reply\nHere_we_go 9 points 4 days ago I remember when no tax on overtime meant all overtime.  Now it is just on the 1/2 part. What happened to fort knox audit? Did the middle class get anything? permalink parent award report block reply NY2KCMO1776 4 points 4 days ago A big black Dildo up the ass no lube permalink parent award report block reply\nNY2KCMO1776 4 points 4 days ago A big black Dildo up the ass no lube permalink parent award report block reply\nKernalMustard 6 points 4 days ago Eventually the Doomers will be proven right. People will fail you. Depend on yourselves. Its time to prepare for the worst permalink parent award report block reply Awakened 3 points 4 days ago Great advice. permalink parent award report block reply\nAwakened 3 points 4 days ago Great advice. permalink parent award report block reply\nMastaJoda 1 points 4 days ago bro you seen egg prices bro!🤡👍 permalink parent award report block reply\nMasterChief 21 points 4 days ago A lot of talk, let's see some action. permalink award report block reply trumpORbust 11 points 4 days ago It's the same on everything Voter fraud Rouge judiciary Obviously corrupt politicians Money laundering act blue Auto Pen Mass deportation Blah blah blah talk talk talk permalink parent award report block reply Krat 10 points 4 days ago And no arrests permalink parent award report block reply DatTrumpDoh -1 points 4 days ago Most of those problems could be solved by nuking the filibuster permalink parent award report block reply NutPsaki 5 points 4 days ago But then you still need actual MAGA senators, which we don’t have. permalink parent award report block reply MastaJoda 3 points 4 days ago ☝This is the biggest obstacle. permalink parent award report block reply Awakened 4 points 4 days ago Yep, this is past being old. permalink parent award report block reply\ntrumpORbust 11 points 4 days ago It's the same on everything Voter fraud Rouge judiciary Obviously corrupt politicians Money laundering act blue Auto Pen Mass deportation Blah blah blah talk talk talk permalink parent award report block reply Krat 10 points 4 days ago And no arrests permalink parent award report block reply DatTrumpDoh -1 points 4 days ago Most of those problems could be solved by nuking the filibuster permalink parent award report block reply NutPsaki 5 points 4 days ago But then you still need actual MAGA senators, which we don’t have. permalink parent award report block reply MastaJoda 3 points 4 days ago ☝This is the biggest obstacle. permalink parent award report block reply\nKrat 10 points 4 days ago And no arrests permalink parent award report block reply\nDatTrumpDoh -1 points 4 days ago Most of those problems could be solved by nuking the filibuster permalink parent award report block reply NutPsaki 5 points 4 days ago But then you still need actual MAGA senators, which we don’t have. permalink parent award report block reply MastaJoda 3 points 4 days ago ☝This is the biggest obstacle. permalink parent award report block reply\nNutPsaki 5 points 4 days ago But then you still need actual MAGA senators, which we don’t have. permalink parent award report block reply MastaJoda 3 points 4 days ago ☝This is the biggest obstacle. permalink parent award report block reply\nMastaJoda 3 points 4 days ago ☝This is the biggest obstacle. permalink parent award report block reply\nAwakened 4 points 4 days ago Yep, this is past being old. permalink parent award report block reply\nAFferalAF 16 points 4 days ago So the insurance companies haven't given him what he wants yet. Y'all get so excited to be bait. permalink award report block reply thelastlast 3 points 4 days ago sanest take unfortunately permalink parent award report block reply\nthelastlast 3 points 4 days ago sanest take unfortunately permalink parent award report block reply\nGdotLee 11 points 4 days ago Blame the evil insurance companies? Give me a fucking break.  It’s a fucking loot fest top to bottom.  Fraud everywhere.   Malpractice all over the place. permalink award report block reply thunderpussy 7 points 4 days ago I know. The level   of stupid and naive on this topic is stunning. The entire system is loaded with every grifting hand in it imaginable, from government, private equity, banks, Big pharma, pharmacy middle men, IT companies, medical outsourcing companies, law firms, insurance companies, you name it. Blaming just the insurance companies or Obamacare is nuts. That's a tiny tip of the iceberg. Add to that an aging, and sicker populace on top of it, too. permalink parent award report block reply MastaJoda 1 points 4 days ago And the just Congress. permalink parent award report block reply\nthunderpussy 7 points 4 days ago I know. The level   of stupid and naive on this topic is stunning. The entire system is loaded with every grifting hand in it imaginable, from government, private equity, banks, Big pharma, pharmacy middle men, IT companies, medical outsourcing companies, law firms, insurance companies, you name it. Blaming just the insurance companies or Obamacare is nuts. That's a tiny tip of the iceberg. Add to that an aging, and sicker populace on top of it, too. permalink parent award report block reply\nMastaJoda 1 points 4 days ago And the just Congress. permalink parent award report block reply\n5854110203868847 8 points 4 days ago Lefty retards:  WTF I LOVE INSURANCE COMPANIES NOW !!! permalink award report block reply\nKiowa4Trump 6 points 4 days ago I’ve been shopping for insurance all weekend for my new small business.  With my previous employer I was paying $2300/month for my family to have a $10k family deductible!  To buy a similar plan will cost me $3300/month!!!   I am leaning towards Christian Healthcare Ministries as an alternative to have the peace of mind of a serious health event. permalink award report block reply MastaJoda 1 points 4 days ago Fuck, dude...I hope you're a millionaire. Thats insane. permalink parent award report block reply ChilledCovfefe 1 points 3 days ago I’m paying 2000 a month for my family in 2026 and that’s with an estimated 130k household income.  And it’s for the crappiest bronze policy. permalink parent award report block reply\nMastaJoda 1 points 4 days ago Fuck, dude...I hope you're a millionaire. Thats insane. permalink parent award report block reply ChilledCovfefe 1 points 3 days ago I’m paying 2000 a month for my family in 2026 and that’s with an estimated 130k household income.  And it’s for the crappiest bronze policy. permalink parent award report block reply\nChilledCovfefe 1 points 3 days ago I’m paying 2000 a month for my family in 2026 and that’s with an estimated 130k household income.  And it’s for the crappiest bronze policy. permalink parent award report block reply\nhillaryforprison 6 points 4 days ago please Trump end all taxes, especially property tax and income tax. Let the tariffs pay for a small government and close everything else. If there's leftover, send us a check. Throw Obiden in prison and all his cronies. permalink award report block reply Here_we_go 4 points 4 days ago Property taxes is local. He has no say. permalink parent award report block reply TrumpTheory 3 points 4 days ago Need an amendment against that. Even local state doesn't have a right to forcibly help itself to your property. permalink parent award report block reply thunderpussy 3 points 4 days ago Not remotely realistic. permalink parent award report block reply\nHere_we_go 4 points 4 days ago Property taxes is local. He has no say. permalink parent award report block reply TrumpTheory 3 points 4 days ago Need an amendment against that. Even local state doesn't have a right to forcibly help itself to your property. permalink parent award report block reply\nTrumpTheory 3 points 4 days ago Need an amendment against that. Even local state doesn't have a right to forcibly help itself to your property. permalink parent award report block reply\nthunderpussy 3 points 4 days ago Not remotely realistic. permalink parent award report block reply\nPb82_Awards 5 points 4 days ago Some of y'all seem to forget we have an increasingly old and sick population so even without Obamacare, rates would be up a ton. permalink award report block reply thunderpussy 3 points 4 days ago Correct. permalink parent award report block reply\nthunderpussy 3 points 4 days ago Correct. permalink parent award report block reply\nSmurfection 5 points 4 days ago Yep.  People should be in charge of buying their own healthcare and paying for what they need.  Make insurance companies offer services directly to the consumers, like car insurance. permalink award report block reply\nTaupkek 5 points 4 days ago He's softening them up for negotiations. \"Lower prices or I send all your money away\" Literal 4D Chessmaster! permalink award report block reply\nMajorClark 5 points 4 days ago Obama, Schumer, Biden & other corrupt dems and rinos won't get their kickbacks either!    Defund the failed Obamacare! permalink award report block reply\nCreepy_Joe 5 points 4 days ago I haven't had health insurance or been to a doctor since Obamacare came out. Fuck it. When it's time to die I'll just die. permalink award report block reply\nBeardholder 4 points 4 days ago Get rid of Health insurance entirely.\nPut all Hospitals up on the competitive market and let their hospitals grow in greatness or shit down completely from either their great customer service or not. permalink award report block reply\nbeansieman1911 4 points 4 days ago What exactly is he proposing here? permalink award report block reply Here_we_go 4 points 4 days ago Basically buy your own shit and youll get tax credits the year after Im guessing. permalink parent award report block reply\nHere_we_go 4 points 4 days ago Basically buy your own shit and youll get tax credits the year after Im guessing. permalink parent award report block reply\nAmerica_No_1 4 points 4 days ago Worked for a healthcare plan most of my life - can confirm. permalink award report block reply\nGoldwaterVoter 4 points 4 days ago 2004 -- single male in my 60's with no health problems, never smoked, etc. Blue Cross full medical $350/month as individual payer. WTF happened to health insurance??? Somebody's getting rich. permalink award report block reply\nKeith 3 points 4 days ago Where do we get an insurance policy from without insurance companies? permalink award report block reply Kiowa4Trump 1 points 3 days ago Christian Health Ministries is the closest I’ve found.  Medishare is another one. permalink parent award report block reply\nKiowa4Trump 1 points 3 days ago Christian Health Ministries is the closest I’ve found.  Medishare is another one. permalink parent award report block reply\nhey_spike 3 points 4 days ago What would Luigi M. (one of the leftist's patron saints) do?  Eliminate the insurance middleman? permalink award report block reply\nbooblitchutz 3 points 4 days ago Honest and transparent cash only pricing and competition among providers would put insurance companies out of business. Allow people to still contribute pre-tax dollars to HSAs permalink award report block reply\nkeeman 3 points 4 days ago The problem with Obamacare is that it is socialism.  End it.  Replace it with nothing. permalink award report block reply\nIllKissYourBoobies 3 points 4 days ago HOOOOOOOOOOOLLLD!!!!! permalink award report block reply\nGeneticsGuy 3 points 4 days ago In case anyone is wondering, he very likely doesn't actually mean it, but this really is going to throw a wrench into the Democrats plans when people start saying \"Yes, give us the money directly!\" As in reality, 80% + of the country, most-likely, would pocket that money than send it and pay for insurance. Also, the Obamacare subsidies are INSANE. I lost my job for about 4 months so we were only on my wife's income at $82,000 a year for a family of 5, and we qualified for a plan that was the equivalent of $950/month at ZERO dollars a month for me. Then plan was mediocre. Think about that for a second, my wife and I earned over $80,000/year and they were still giving us nearly $12,000 in subsidies for an ACA plan. Absolutely bonkers. Oh and once I got a job it didn't matter, I didn't fall off the plan as you are enrolled for the whole year. The amount of cash handouts is exactly why inflation has been so bad. In reality though, this is nothing more than taxpayer money going direct into the pockets of the insurance companies. Of that $12,000 that went to the insurance companies, I used exactly ZERO claims this last year. It was just a big fat check to them. They are making BILLIONS on the American people. permalink award report block reply\nBlackPilledMAGA 3 points 4 days ago The insurance companies are the ones behind the whole thing. Them and Big Pharma have more or less owned DC for years. permalink award report block reply\nSynonymity 3 points 4 days ago Look at medical billing. It is a money laundering scheme. permalink award report block reply thunderpussy 2 points 4 days ago And medical upcoding is nearly an artform..... permalink parent award report block reply\nthunderpussy 2 points 4 days ago And medical upcoding is nearly an artform..... permalink parent award report block reply\nEdBuck 2 points 4 days ago So now all the Luigi Mangioni fan fags like Trump? Hahahahah not a chance they only like it when you murder people permalink award report block reply\nKarlHungus53 2 points 4 days ago So what do those of us idiots that pay to supply our employees with health insurance get? permalink award report block reply TNgirl4Trump 2 points 4 days ago Was wondering the same thing. permalink parent award report block reply\nTNgirl4Trump 2 points 4 days ago Was wondering the same thing. permalink parent award report block reply\nSlamdangles2024 2 points 4 days ago Spoiler Alert: People will have to pay more, because anytime any politician makes any sort of move, we pay more. permalink award report block reply\nJustInTime2_ 2 points 4 days ago Yes. It must happen. permalink award report block reply\nNotInFormation 2 points 4 days ago Eliminate the trial lawyer scam that started it all with the need for malpractice insurance and doctors can again serve patients. Until then doctors must serve to mitigate legal risk and nothing else. permalink award report block reply\nAwakened 2 points 4 days ago But you can't make that happen and the GOP will stop you if you try, let alone the democrats. permalink award report block reply\nKeepMarxInTheGround 1 points 4 days ago I had to use COBRA a few months back until my insurance at a new job kicked in. $1700 per month for myself, wife, and three children. Not for any special plan, just regular healthcare. Before Obamacare, it would've been around $300 per month. permalink award report block reply\nPb82_Awards 1 points 4 days ago Now we're talking! permalink award report block reply\nthisisatestof2 1 points 4 days ago Watch, all of a sudden the Dems will decide they love big insurance and big business. permalink award report block reply\nKlaus73 1 points 4 days ago So...the republicans have a insurance plan was a lie then? permalink award report block reply Here_we_go 2 points 4 days ago But medicaid and medicare get fat meds for cheap. Except medicaid people pay for nothing. But we're supposed to be elated permalink parent award report block reply\nHere_we_go 2 points 4 days ago But medicaid and medicare get fat meds for cheap. Except medicaid people pay for nothing. But we're supposed to be elated permalink parent award report block reply\nMichalusmichalus 1 points 4 days ago This is taking away the medical industrial complex's monopoly. It's a good step. permalink award report block reply\nKlown_Kutz 1 points 4 days ago Corporations are not our friends. Insurance companies WROTE Obamacare. permalink award report block reply\nMAGA9428 1 points 3 days ago Oh fuck no. My health insurance is amazing and my boss pays for every penny of it. I don’t want to have to buy a policy myself. permalink award report block reply\nTmntnyc 1 points 4 days ago Most people here would not have qualified for insurance before ACA. With ACA there is a mandate that preexisting conditions cannot be used to deny health insurance or to adjust pricing. Used to be that many people were “uninsurable” or had to buy plans that would cost much much more with exclusions for their known conditions. Survived cancer in your 30’s? Diabetic? Heart condition? You literally had to buy insurance that excluded those things while paying more or go without any insurance. Oh, you have new onset migraines? I see in your medical record that you complained about a headache 5 years ago in a PCP visit…sorry, no coverage for that. When they abolish ACA (Obamacare), most people will actually end up paying more or go uninsured. permalink award report block reply\nPoleWatcher 1 points 3 days ago Like I said it's all talk, but we really need to feel these changes and ideas that actually are pipe dreams. Are we being continually baited or something? GOP really needs to support Trump and get things happening, and not in 2028, NOW permalink award report block reply\nMoreGuns 1 points 4 days ago 2 more weeks! permalink award report block reply\nReassess_Reevaluate 1 points 3 days ago Get my fucking employer out of my healthcare chain. Why in the flying fuck are they giving me the illusion of choice every year between several shitty plans? permalink award report block reply\nthelastlast 1 points 4 days ago you know just when i get pissed at him he does something i really like permalink award report block reply\nLakeAmeritaga 1 points 3 days ago forget letting people buying their own policies too!  Just buying their own healthcare as needed will be immensely cheaper permalink award report block reply\nPearlyGaits57 1 points 3 days ago I am all in! permalink award report block reply\nPsalm-118_24 1 points 3 days ago Mr POTUS, hospitals, pharma and illegals contribute to the astronomical costs of Healthcare too.  If you're like our state, look around you at hospital expansion. Our hospitals made a killing during covid, not only of patients but on their finances too. Also, if all the illegals and freeloaders are removed from taxpayer funded programs, the rest of us will have our costs go way down because we won't be paying for the illegals/freeloaders. permalink award report block reply\nPoleWatcher 0 points 4 days ago Better staet feeling so e relief,  his talk is just vaporizing. Hope he makes some changes for the people to benefit from permalink award report block reply\nflashersenpai 0 points 4 days ago wat dis mean? i haven't paid for insurance in years. And it still scalds my ass when they drop prices 50% and pretend they're giving me a discount. permalink award report block reply\nbill_in_texas -2 points 4 days ago Trump seems like he's just throwing shit at the wall now, seeing what sticks.  The recent election shellacking must have shook him, or at least brought him back to reality. permalink award report block reply"}