{"id": "1ARK9pgQR4", "contents": "86 Layoffs and H1-Bs  shouldn't be in the same sentence... posted 2 hours ago by TrustYourself 5 comments award share report block It's time for a white country to put white people first.  No visas is needed.\n5 comments Sort by Top Top New Worst Old Save NotYourMan 3 points 1 hour ago This is what happened.  My company had a layoff.  Our group had to layoff two people.  The worst two people in reviews consistently over a year were on H1B-visas.  All the managers voted to lay them off based on HR rules.  But it was overruled by our manager because those H1B-visa employees would have a hardship that Americans don't have.  They could be told to go leave the US.  So, we were forced to layoff two Americans who had to find other jobs. permalink award report block reply MAPatriot1966 4 points 1 hour ago Not sure how sending the HB1 back to their country while on a temporary stay wualifies as hardship. Also, many indians on HB1 ive known regularly go home to India for six weeks at a time “working “ remotely.  They dont even have to be in the damn country permalink parent award report block reply Tunk 2 points 53 minutes ago H1B if it is not eliminated, at least needs a new rule. If there are layoffs from ANY company in a sector, the ENTIRE sector is ineligible for H1B for the next two years, including renewals. Amazon lays off 30,000 citizens? Congrats all their H1B applications are rejected.\nAnd google, and microsoft, and facebook, the myriad of consulting companies, and everyone else in Tech. Medical sector lays off people? Yep no medical H1Bs for hospitals, clinics, labs and the likes. A bank lays off people? Congratulations the entire financial sector loses H1Bs. permalink award report block reply Elephant_Trump 2 points 2 hours ago we should layoff all the H1B visas and hire Americans. permalink award report block reply CleanUpPhillyTrump24 1 points 40 minutes ago Is it even about race - put the MOST QUALIFIED first. That's the dirty little secret. The proud and effective American corporation is being hollowed out from within by unscrupulous fast-buck conartists who are hiring cheaper and calling it some kind of business miracle. It's just codified organized crime. permalink award report block reply DarthEP 1 points 14 minutes ago White Primacy. permalink award report block reply\nNotYourMan 3 points 1 hour ago This is what happened.  My company had a layoff.  Our group had to layoff two people.  The worst two people in reviews consistently over a year were on H1B-visas.  All the managers voted to lay them off based on HR rules.  But it was overruled by our manager because those H1B-visa employees would have a hardship that Americans don't have.  They could be told to go leave the US.  So, we were forced to layoff two Americans who had to find other jobs. permalink award report block reply MAPatriot1966 4 points 1 hour ago Not sure how sending the HB1 back to their country while on a temporary stay wualifies as hardship. Also, many indians on HB1 ive known regularly go home to India for six weeks at a time “working “ remotely.  They dont even have to be in the damn country permalink parent award report block reply\nMAPatriot1966 4 points 1 hour ago Not sure how sending the HB1 back to their country while on a temporary stay wualifies as hardship. Also, many indians on HB1 ive known regularly go home to India for six weeks at a time “working “ remotely.  They dont even have to be in the damn country permalink parent award report block reply\nTunk 2 points 53 minutes ago H1B if it is not eliminated, at least needs a new rule. If there are layoffs from ANY company in a sector, the ENTIRE sector is ineligible for H1B for the next two years, including renewals. Amazon lays off 30,000 citizens? Congrats all their H1B applications are rejected.\nAnd google, and microsoft, and facebook, the myriad of consulting companies, and everyone else in Tech. Medical sector lays off people? Yep no medical H1Bs for hospitals, clinics, labs and the likes. A bank lays off people? Congratulations the entire financial sector loses H1Bs. permalink award report block reply\nElephant_Trump 2 points 2 hours ago we should layoff all the H1B visas and hire Americans. permalink award report block reply\nCleanUpPhillyTrump24 1 points 40 minutes ago Is it even about race - put the MOST QUALIFIED first. That's the dirty little secret. The proud and effective American corporation is being hollowed out from within by unscrupulous fast-buck conartists who are hiring cheaper and calling it some kind of business miracle. It's just codified organized crime. permalink award report block reply\nDarthEP 1 points 14 minutes ago White Primacy. permalink award report block reply"}