{"id": "1ARK9nPdCB", "contents": "45 The US and Israel are not even allies on paper. There is no reason for Trump to be covering for them like this. posted 5 hours ago by FBIAREFAGGOTS 7 comments award share report block Disclose.tv @disclosetv • 12h NEW - Trump sends a letter to President Herzog formally asking him to pardon Netanyahu, saying the case against him is \"a political, unjustified prosecution.\"\n7 comments Sort by Top Top New Worst Old Save Thomm 8 points 5 hours ago Well, at least we know who trumps handler is now. As if there was any doubt prior to this. permalink award report block reply TakingCoatsWIN -1 points 4 hours ago How does this make him a handler of Trump? It's just a letter. permalink parent award report block reply CrazyPope 7 points 5 hours ago What a fucking joke permalink award report block reply Mulletgunning 5 points 5 hours ago Booooooooooo! Fuck that gargoyle. MAGA AF permalink award report block reply Givesgunstogrannies 4 points 4 hours ago 3,000 years?  Where do people get these numbers?  Islam is a 5th century creation. permalink award report block reply bill_in_texas 3 points 3 hours ago Netanyahu was one of the first to throw Trump under the bus and congratulate Brandon for cheating his way into office. permalink award report block reply Mulletgunning 1 points 1 hour ago Yep! Someone here tried to get me to provide SOURCES! Lol permalink parent award report block reply\nThomm 8 points 5 hours ago Well, at least we know who trumps handler is now. As if there was any doubt prior to this. permalink award report block reply TakingCoatsWIN -1 points 4 hours ago How does this make him a handler of Trump? It's just a letter. permalink parent award report block reply\nTakingCoatsWIN -1 points 4 hours ago How does this make him a handler of Trump? It's just a letter. permalink parent award report block reply\nCrazyPope 7 points 5 hours ago What a fucking joke permalink award report block reply\nMulletgunning 5 points 5 hours ago Booooooooooo! Fuck that gargoyle. MAGA AF permalink award report block reply\nGivesgunstogrannies 4 points 4 hours ago 3,000 years?  Where do people get these numbers?  Islam is a 5th century creation. permalink award report block reply\nbill_in_texas 3 points 3 hours ago Netanyahu was one of the first to throw Trump under the bus and congratulate Brandon for cheating his way into office. permalink award report block reply Mulletgunning 1 points 1 hour ago Yep! Someone here tried to get me to provide SOURCES! Lol permalink parent award report block reply\nMulletgunning 1 points 1 hour ago Yep! Someone here tried to get me to provide SOURCES! Lol permalink parent award report block reply"}