{"id": "1ARK9pghU1", "contents": "13 \"MAGA IS DEAD\" - ALL THESE PEOPLE ARE BEING PAID TO POST THIS SHIT IN THE SAME HOUR TO MAKE IT TREND. posted 36 minutes ago by Antenna 7 comments award share download report block\n7 comments Sort by Top Top New Worst Old Save redditadminssuckit 6 points 29 minutes ago Oy have nose idea who's funding this. Do joo? permalink award report block reply newestofnew 5 points 32 minutes ago wowowow all the miga bots post other bots. maga is dead unless a severe course correction is made fast. permalink award report block reply 19American62Woman 2 points 22 minutes ago The names alone kinda gave it away permalink award report block reply 1st_Covfefe 1 points 8 minutes ago So they're all gay? permalink award report block reply Blackmore 1 points 16 minutes ago NO< MAGA IS ALIVE SHE CRIED>>>>> permalink award report block reply Duce30 1 points 27 minutes ago I made that comment on here and I haven't gotten any money, live in Missouri and pay taxes and voted for Trump all 3 times he won. Things change. We need America 1st and only not America 1st but still send money to other countries. permalink award report block reply SpeekFreely 1 points 14 minutes ago They’re referring to the MIGA infiltration permalink award report block reply\nredditadminssuckit 6 points 29 minutes ago Oy have nose idea who's funding this. Do joo? permalink award report block reply\nnewestofnew 5 points 32 minutes ago wowowow all the miga bots post other bots. maga is dead unless a severe course correction is made fast. permalink award report block reply\n19American62Woman 2 points 22 minutes ago The names alone kinda gave it away permalink award report block reply\n1st_Covfefe 1 points 8 minutes ago So they're all gay? permalink award report block reply\nBlackmore 1 points 16 minutes ago NO< MAGA IS ALIVE SHE CRIED>>>>> permalink award report block reply\nDuce30 1 points 27 minutes ago I made that comment on here and I haven't gotten any money, live in Missouri and pay taxes and voted for Trump all 3 times he won. Things change. We need America 1st and only not America 1st but still send money to other countries. permalink award report block reply\nSpeekFreely 1 points 14 minutes ago They’re referring to the MIGA infiltration permalink award report block reply"}