{"id": "1ARK58zX4y", "contents": "944 The Department of Homeland Security has released a new video 🇺🇸 posted 4 days ago by MEME-SUPREME 112 comments award share report block Breaking911 @Breaking911 • 4d The Department of Homeland Security has released a new video 🇺🇸\n112 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget Here_we_go 66 points 4 days ago Yeah thats nice. Can we get 40 million new and 30 million old illegals out? Kthxbi. permalink award report block reply Jaqen 19 points 4 days ago Best they can do is a video with creepy symbolic clips depicting a blue butterfly and woman with one eye closed. permalink parent award report block reply ileantotheright 15 points 4 days ago Did I see bigfoot? Lol permalink parent award report block reply BillPigg 4 points 4 days ago Yep. permalink parent award report block reply Voight-Kampff 3 points 4 days ago https://en.wikipedia.org/wiki/Celastrina_iryna permalink parent award report block reply Shitsbrokeyo 1 points 3 days ago Followed by Angelina Jolie. permalink parent award report block reply ConvergenceMan 3 points 4 days ago Not to mention it being a seizure inducing Tiktok slopfest backed by a shitty remix of a Boomer song permalink parent award report block reply Aggrieved03 9 points 4 days ago Why take action when they can just release edgy videos and everyone clap like seals. permalink parent award report block reply Voight-Kampff 1 points 4 days ago ICE agents getting rammed by fucking soccer mom's in minvans inhibits action. This beautiful art is powerful. permalink parent award report block reply Mortal_Wombat 2 points 3 days ago It's fucking retarded. permalink parent award report block reply Voight-Kampff -1 points 3 days ago 2 million views in 14 hours... your projected analysis reveals you may need some tissues. permalink parent award report block reply view 2 more comments... Standingoak 5 points 4 days ago Finally someone else that remembers the time before covid time. permalink parent award report block reply RedStoneDeepState -26 points 4 days ago There are not that many illegals. permalink parent award report block reply PatriotGeneral 15 points 4 days ago Probably more permalink parent award report block reply RedStoneDeepState -17 points 4 days ago Fucking retard, all you are proving is you can't do math permalink parent award report block reply HelluvaEngineer 10 points 4 days ago Are you done failing for the night? permalink parent award report block reply view 2 more comments... PatriotGeneral 7 points 4 days ago Womp womp permalink parent award report block reply SanityGumby 5 points 4 days ago The total has to be between 40-50 million at this point permalink parent award report block reply view 4 more comments... HeavyMetalPatriot 3 points 4 days ago Illegals plus anchor babies plus anchor grandbabies. permalink parent award report block reply view 3 more comments... Hoshi 3 points 4 days ago I guess you don't live in California. I can find 50 of them in the Home Depot parking lot in the morning on a slow day and those are just the older ones who want to work. permalink parent award report block reply RedStoneDeepState -3 points 4 days ago Because 50 equals 70 million permalink parent award report block reply Hoshi 3 points 4 days ago Just the ones sucking on the tits of California Medi-cal system is 1.6 million. 9% of the labor in California is illegal by conservative estimates. Hard to get accurate numbers when they are like rats hiding all over the place. permalink parent award report block reply 1inchgroup 2 points 4 days ago Are you legally dumb?  Cuz you sound dumb permalink parent award report block reply view 5 more comments... Shitsbrokeyo 1 points 3 days ago Fine call them Visa over stays. Still illegals. permalink parent award report block reply view 1 more comments... Standingoak 3 points 4 days ago Anchor babies are illegal. permalink parent award report block reply RedStoneDeepState 1 points 4 days ago Anchor babies are not a thing, permalink parent award report block reply Standingoak 3 points 4 days ago Neither is \"covid vaccine.\"  Didn't stop hundreds of millions from using the term and playing the game. permalink parent award report block reply view 7 more comments... 1inchgroup 3 points 4 days ago There were 20 million estimated in the mid 90's when Save Our State started screaming, and nobody paid attention. permalink parent award report block reply RedStoneDeepState 0 points 4 days ago Show that estimate from the 90s permalink parent award report block reply 1inchgroup 2 points 4 days ago fuck off you're the crazy one.  do your own research. permalink parent award report block reply view 10 more comments... Rock9Head 1 points 4 days ago Anchoritos permalink parent award report block reply BlackJack1776 31 points 4 days ago Oddly, no diversity. Almost, as if THEY built it all was a lie. permalink award report block reply Svaap 7 points 4 days ago Hey, doesn't Bigfoot count!?  LOL permalink parent award report block reply BlackJack1776 5 points 4 days ago Bigfeet never demanded reparations, nor EBT from me. So, sure. permalink parent award report block reply swimmingguy 21 points 4 days ago A legit memelord is working at DHS permalink award report block reply aoneleggedduck 3 points 3 days ago video almost gave me a seizure, lol permalink parent award report block reply Rikki_Tikki 21 points 4 days ago NOTHING more American than Bigfoot!!!! Love this! permalink award report block reply HelluvaEngineer 19 points 4 days ago Let's all remember that Bigfoot is a Freemason. permalink award report block reply BKav 9 points 4 days ago That was pretty funny to slip that in there permalink parent award report block reply GuerillaYourDreams 9 points 4 days ago And a freebird! permalink parent award report block reply Skogin 14 points 4 days ago 🇺🇸 USA 🇺🇸 permalink award report block reply EvJohn 13 points 4 days ago Didn't know this was possible, but I probably just contracted epilepsy from a clip. Albeit a neat one. permalink award report block reply Skogin 7 points 4 days ago You are beginning to see… permalink parent award report block reply SparkleMTN 12 points 4 days ago I have no idea what's going on besides pure unadulterated Americana Badassery. I'm cool with it. permalink award report block reply deepbake 12 points 4 days ago HIGH ENERGY permalink award report block reply cptkloss5 10 points 4 days ago beautiful! not a single jogger! permalink award report block reply hospitalier 9 points 4 days ago RARE BIGFOOT SIGHTING permalink award report block reply roadrunner0 8 points 4 days ago Very motivating and invigorating, Now if we had several hundred of those box truck video billboards driving around cities and towns all day every day blasting this out with patriotic messages playing on the screens I would be very happy.. permalink award report block reply CaliAli 8 points 4 days ago I'm touching myself tonight. permalink award report block reply HeavyMetalPatriot 3 points 4 days ago Thank you for sharing! permalink parent award report block reply _M_A_G_A_ 1 points 4 days ago OK COOMER permalink parent award report block reply ReturnOfSmarm 6 points 4 days ago Bigfoot is a nice touch.  He may be a myth, but he's OUR myth you fuckers! permalink award report block reply Steve56775 2 points 3 days ago What about Yetti’s? permalink parent award report block reply ReturnOfSmarm 1 points 3 days ago What about Yetti's what?  Best I know ..... Yetti's aren't into possessions/having things. permalink parent award report block reply Ifeargovtmorethan 6 points 4 days ago FREEBIRD!!!!! permalink award report block reply henri_derelicte 6 points 4 days ago The administration’s social media game is on point. Not a faggot or tranny in sight permalink award report block reply Maxmax 6 points 4 days ago More of this, please. permalink award report block reply AnnieMm 5 points 4 days ago Excellent. permalink award report block reply Pepe_longcockings 4 points 4 days ago Fire permalink award report block reply Quiznos585 4 points 4 days ago Great, start arresting leftist activist judges. Thanks. permalink award report block reply TravelingSalesman 4 points 4 days ago Globe earth Washington in the baphomet pose Osiris obelisk Bigfoot Moon landing Vegas pyramid Multi generational butterfly migration I think they’re trying to tell us something permalink award report block reply Kendoextendo 4 points 4 days ago Eh, nothing better than the original freebird guitar solo. Adding the gay bass and drums takes away from the perfection of the OG song. permalink award report block reply _Liberty_Prime_ 4 points 4 days ago And we were on top of it. 😃 https://patriots.win/p/1ARK57tKYJ/homeland-security-/c permalink award report block reply KartoffelPuffer 3 points 4 days ago Time to gather the Western Canadian orphans and red-headed stepchildren under the flag of the USA. permalink award report block reply bluewhiteandred 3 points 4 days ago goes hard permalink award report block reply Fren20 2 points 3 days ago Love it❤️❤️❤️❤️❤️keep it going permalink award report block reply Nate_Higgersalot 2 points 4 days ago Bigfoot! permalink award report block reply RolandDelacroix 2 points 3 days ago I don't understand how anyone can say White America has no culture. permalink award report block reply Rango 2 points 4 days ago I'm not deaf. Well, I wasn't. permalink award report block reply Hikedelics 2 points 4 days ago Goddamn it feels like the Fourth of July in this bitch!! For real though, this is a rip-off of a very similar vid that A-10 Dale guy posted on X a year and a half ago. Set to the same exact song too. permalink award report block reply Alldayeveryday 2 points 4 days ago Less videos more deportations thanks permalink award report block reply AwShitHereWeGoAgain 2 points 4 days ago Awesome.... except for all the fake moon landing bullshit. permalink award report block reply Voight-Kampff 2 points 3 days ago I think deep down, we all knew that music videos could actually end up saving the world. permalink award report block reply OGRapHat 1 points 3 days ago Bigfoot permalink award report block reply Filledwithfire 1 points 4 days ago I’m convinced they’re scouting meme pages on IG, X, and TikTok and just commissioning creators to make these permalink award report block reply bananafone 1 points 3 days ago Cringe permalink award report block reply Aggrieved03 0 points 4 days ago They're releasing videos while our country is unrecognizable. More and more Muslims everywhere I go with half a dozen wives in tow. They don't even try to hide it. permalink award report block reply SanityGumby 2 points 4 days ago That’s not their fault and they are fixing it. Faggot. permalink parent award report block reply wmmiv2016v2 0 points 4 days ago Gay. permalink award report block reply HoodooOperator 1 points 3 days ago Comment removed by community moderators. permalink award report block reply\nHere_we_go 66 points 4 days ago Yeah thats nice. Can we get 40 million new and 30 million old illegals out? Kthxbi. permalink award report block reply Jaqen 19 points 4 days ago Best they can do is a video with creepy symbolic clips depicting a blue butterfly and woman with one eye closed. permalink parent award report block reply ileantotheright 15 points 4 days ago Did I see bigfoot? Lol permalink parent award report block reply BillPigg 4 points 4 days ago Yep. permalink parent award report block reply Voight-Kampff 3 points 4 days ago https://en.wikipedia.org/wiki/Celastrina_iryna permalink parent award report block reply Shitsbrokeyo 1 points 3 days ago Followed by Angelina Jolie. permalink parent award report block reply ConvergenceMan 3 points 4 days ago Not to mention it being a seizure inducing Tiktok slopfest backed by a shitty remix of a Boomer song permalink parent award report block reply Aggrieved03 9 points 4 days ago Why take action when they can just release edgy videos and everyone clap like seals. permalink parent award report block reply Voight-Kampff 1 points 4 days ago ICE agents getting rammed by fucking soccer mom's in minvans inhibits action. This beautiful art is powerful. permalink parent award report block reply Mortal_Wombat 2 points 3 days ago It's fucking retarded. permalink parent award report block reply Voight-Kampff -1 points 3 days ago 2 million views in 14 hours... your projected analysis reveals you may need some tissues. permalink parent award report block reply view 2 more comments... Standingoak 5 points 4 days ago Finally someone else that remembers the time before covid time. permalink parent award report block reply RedStoneDeepState -26 points 4 days ago There are not that many illegals. permalink parent award report block reply PatriotGeneral 15 points 4 days ago Probably more permalink parent award report block reply RedStoneDeepState -17 points 4 days ago Fucking retard, all you are proving is you can't do math permalink parent award report block reply HelluvaEngineer 10 points 4 days ago Are you done failing for the night? permalink parent award report block reply view 2 more comments... PatriotGeneral 7 points 4 days ago Womp womp permalink parent award report block reply SanityGumby 5 points 4 days ago The total has to be between 40-50 million at this point permalink parent award report block reply view 4 more comments... HeavyMetalPatriot 3 points 4 days ago Illegals plus anchor babies plus anchor grandbabies. permalink parent award report block reply view 3 more comments... Hoshi 3 points 4 days ago I guess you don't live in California. I can find 50 of them in the Home Depot parking lot in the morning on a slow day and those are just the older ones who want to work. permalink parent award report block reply RedStoneDeepState -3 points 4 days ago Because 50 equals 70 million permalink parent award report block reply Hoshi 3 points 4 days ago Just the ones sucking on the tits of California Medi-cal system is 1.6 million. 9% of the labor in California is illegal by conservative estimates. Hard to get accurate numbers when they are like rats hiding all over the place. permalink parent award report block reply 1inchgroup 2 points 4 days ago Are you legally dumb?  Cuz you sound dumb permalink parent award report block reply view 5 more comments... Shitsbrokeyo 1 points 3 days ago Fine call them Visa over stays. Still illegals. permalink parent award report block reply view 1 more comments... Standingoak 3 points 4 days ago Anchor babies are illegal. permalink parent award report block reply RedStoneDeepState 1 points 4 days ago Anchor babies are not a thing, permalink parent award report block reply Standingoak 3 points 4 days ago Neither is \"covid vaccine.\"  Didn't stop hundreds of millions from using the term and playing the game. permalink parent award report block reply view 7 more comments... 1inchgroup 3 points 4 days ago There were 20 million estimated in the mid 90's when Save Our State started screaming, and nobody paid attention. permalink parent award report block reply RedStoneDeepState 0 points 4 days ago Show that estimate from the 90s permalink parent award report block reply 1inchgroup 2 points 4 days ago fuck off you're the crazy one.  do your own research. permalink parent award report block reply view 10 more comments... Rock9Head 1 points 4 days ago Anchoritos permalink parent award report block reply\nJaqen 19 points 4 days ago Best they can do is a video with creepy symbolic clips depicting a blue butterfly and woman with one eye closed. permalink parent award report block reply ileantotheright 15 points 4 days ago Did I see bigfoot? Lol permalink parent award report block reply BillPigg 4 points 4 days ago Yep. permalink parent award report block reply Voight-Kampff 3 points 4 days ago https://en.wikipedia.org/wiki/Celastrina_iryna permalink parent award report block reply Shitsbrokeyo 1 points 3 days ago Followed by Angelina Jolie. permalink parent award report block reply ConvergenceMan 3 points 4 days ago Not to mention it being a seizure inducing Tiktok slopfest backed by a shitty remix of a Boomer song permalink parent award report block reply\nileantotheright 15 points 4 days ago Did I see bigfoot? Lol permalink parent award report block reply BillPigg 4 points 4 days ago Yep. permalink parent award report block reply\nBillPigg 4 points 4 days ago Yep. permalink parent award report block reply\nVoight-Kampff 3 points 4 days ago https://en.wikipedia.org/wiki/Celastrina_iryna permalink parent award report block reply Shitsbrokeyo 1 points 3 days ago Followed by Angelina Jolie. permalink parent award report block reply\nShitsbrokeyo 1 points 3 days ago Followed by Angelina Jolie. permalink parent award report block reply\nConvergenceMan 3 points 4 days ago Not to mention it being a seizure inducing Tiktok slopfest backed by a shitty remix of a Boomer song permalink parent award report block reply\nAggrieved03 9 points 4 days ago Why take action when they can just release edgy videos and everyone clap like seals. permalink parent award report block reply Voight-Kampff 1 points 4 days ago ICE agents getting rammed by fucking soccer mom's in minvans inhibits action. This beautiful art is powerful. permalink parent award report block reply Mortal_Wombat 2 points 3 days ago It's fucking retarded. permalink parent award report block reply Voight-Kampff -1 points 3 days ago 2 million views in 14 hours... your projected analysis reveals you may need some tissues. permalink parent award report block reply view 2 more comments...\nVoight-Kampff 1 points 4 days ago ICE agents getting rammed by fucking soccer mom's in minvans inhibits action. This beautiful art is powerful. permalink parent award report block reply Mortal_Wombat 2 points 3 days ago It's fucking retarded. permalink parent award report block reply Voight-Kampff -1 points 3 days ago 2 million views in 14 hours... your projected analysis reveals you may need some tissues. permalink parent award report block reply view 2 more comments...\nMortal_Wombat 2 points 3 days ago It's fucking retarded. permalink parent award report block reply Voight-Kampff -1 points 3 days ago 2 million views in 14 hours... your projected analysis reveals you may need some tissues. permalink parent award report block reply view 2 more comments...\nVoight-Kampff -1 points 3 days ago 2 million views in 14 hours... your projected analysis reveals you may need some tissues. permalink parent award report block reply view 2 more comments...\nStandingoak 5 points 4 days ago Finally someone else that remembers the time before covid time. permalink parent award report block reply\nRedStoneDeepState -26 points 4 days ago There are not that many illegals. permalink parent award report block reply PatriotGeneral 15 points 4 days ago Probably more permalink parent award report block reply RedStoneDeepState -17 points 4 days ago Fucking retard, all you are proving is you can't do math permalink parent award report block reply HelluvaEngineer 10 points 4 days ago Are you done failing for the night? permalink parent award report block reply view 2 more comments... PatriotGeneral 7 points 4 days ago Womp womp permalink parent award report block reply SanityGumby 5 points 4 days ago The total has to be between 40-50 million at this point permalink parent award report block reply view 4 more comments... HeavyMetalPatriot 3 points 4 days ago Illegals plus anchor babies plus anchor grandbabies. permalink parent award report block reply view 3 more comments... Hoshi 3 points 4 days ago I guess you don't live in California. I can find 50 of them in the Home Depot parking lot in the morning on a slow day and those are just the older ones who want to work. permalink parent award report block reply RedStoneDeepState -3 points 4 days ago Because 50 equals 70 million permalink parent award report block reply Hoshi 3 points 4 days ago Just the ones sucking on the tits of California Medi-cal system is 1.6 million. 9% of the labor in California is illegal by conservative estimates. Hard to get accurate numbers when they are like rats hiding all over the place. permalink parent award report block reply 1inchgroup 2 points 4 days ago Are you legally dumb?  Cuz you sound dumb permalink parent award report block reply view 5 more comments... Shitsbrokeyo 1 points 3 days ago Fine call them Visa over stays. Still illegals. permalink parent award report block reply view 1 more comments... Standingoak 3 points 4 days ago Anchor babies are illegal. permalink parent award report block reply RedStoneDeepState 1 points 4 days ago Anchor babies are not a thing, permalink parent award report block reply Standingoak 3 points 4 days ago Neither is \"covid vaccine.\"  Didn't stop hundreds of millions from using the term and playing the game. permalink parent award report block reply view 7 more comments... 1inchgroup 3 points 4 days ago There were 20 million estimated in the mid 90's when Save Our State started screaming, and nobody paid attention. permalink parent award report block reply RedStoneDeepState 0 points 4 days ago Show that estimate from the 90s permalink parent award report block reply 1inchgroup 2 points 4 days ago fuck off you're the crazy one.  do your own research. permalink parent award report block reply view 10 more comments... Rock9Head 1 points 4 days ago Anchoritos permalink parent award report block reply\nPatriotGeneral 15 points 4 days ago Probably more permalink parent award report block reply RedStoneDeepState -17 points 4 days ago Fucking retard, all you are proving is you can't do math permalink parent award report block reply HelluvaEngineer 10 points 4 days ago Are you done failing for the night? permalink parent award report block reply view 2 more comments... PatriotGeneral 7 points 4 days ago Womp womp permalink parent award report block reply SanityGumby 5 points 4 days ago The total has to be between 40-50 million at this point permalink parent award report block reply view 4 more comments... HeavyMetalPatriot 3 points 4 days ago Illegals plus anchor babies plus anchor grandbabies. permalink parent award report block reply view 3 more comments...\nRedStoneDeepState -17 points 4 days ago Fucking retard, all you are proving is you can't do math permalink parent award report block reply HelluvaEngineer 10 points 4 days ago Are you done failing for the night? permalink parent award report block reply view 2 more comments... PatriotGeneral 7 points 4 days ago Womp womp permalink parent award report block reply SanityGumby 5 points 4 days ago The total has to be between 40-50 million at this point permalink parent award report block reply view 4 more comments... HeavyMetalPatriot 3 points 4 days ago Illegals plus anchor babies plus anchor grandbabies. permalink parent award report block reply view 3 more comments...\nHelluvaEngineer 10 points 4 days ago Are you done failing for the night? permalink parent award report block reply view 2 more comments...\nPatriotGeneral 7 points 4 days ago Womp womp permalink parent award report block reply\nSanityGumby 5 points 4 days ago The total has to be between 40-50 million at this point permalink parent award report block reply view 4 more comments...\nHeavyMetalPatriot 3 points 4 days ago Illegals plus anchor babies plus anchor grandbabies. permalink parent award report block reply view 3 more comments...\nHoshi 3 points 4 days ago I guess you don't live in California. I can find 50 of them in the Home Depot parking lot in the morning on a slow day and those are just the older ones who want to work. permalink parent award report block reply RedStoneDeepState -3 points 4 days ago Because 50 equals 70 million permalink parent award report block reply Hoshi 3 points 4 days ago Just the ones sucking on the tits of California Medi-cal system is 1.6 million. 9% of the labor in California is illegal by conservative estimates. Hard to get accurate numbers when they are like rats hiding all over the place. permalink parent award report block reply 1inchgroup 2 points 4 days ago Are you legally dumb?  Cuz you sound dumb permalink parent award report block reply view 5 more comments... Shitsbrokeyo 1 points 3 days ago Fine call them Visa over stays. Still illegals. permalink parent award report block reply view 1 more comments...\nRedStoneDeepState -3 points 4 days ago Because 50 equals 70 million permalink parent award report block reply Hoshi 3 points 4 days ago Just the ones sucking on the tits of California Medi-cal system is 1.6 million. 9% of the labor in California is illegal by conservative estimates. Hard to get accurate numbers when they are like rats hiding all over the place. permalink parent award report block reply 1inchgroup 2 points 4 days ago Are you legally dumb?  Cuz you sound dumb permalink parent award report block reply view 5 more comments... Shitsbrokeyo 1 points 3 days ago Fine call them Visa over stays. Still illegals. permalink parent award report block reply view 1 more comments...\nHoshi 3 points 4 days ago Just the ones sucking on the tits of California Medi-cal system is 1.6 million. 9% of the labor in California is illegal by conservative estimates. Hard to get accurate numbers when they are like rats hiding all over the place. permalink parent award report block reply\n1inchgroup 2 points 4 days ago Are you legally dumb?  Cuz you sound dumb permalink parent award report block reply view 5 more comments...\nShitsbrokeyo 1 points 3 days ago Fine call them Visa over stays. Still illegals. permalink parent award report block reply view 1 more comments...\nStandingoak 3 points 4 days ago Anchor babies are illegal. permalink parent award report block reply RedStoneDeepState 1 points 4 days ago Anchor babies are not a thing, permalink parent award report block reply Standingoak 3 points 4 days ago Neither is \"covid vaccine.\"  Didn't stop hundreds of millions from using the term and playing the game. permalink parent award report block reply view 7 more comments...\nRedStoneDeepState 1 points 4 days ago Anchor babies are not a thing, permalink parent award report block reply Standingoak 3 points 4 days ago Neither is \"covid vaccine.\"  Didn't stop hundreds of millions from using the term and playing the game. permalink parent award report block reply view 7 more comments...\nStandingoak 3 points 4 days ago Neither is \"covid vaccine.\"  Didn't stop hundreds of millions from using the term and playing the game. permalink parent award report block reply view 7 more comments...\n1inchgroup 3 points 4 days ago There were 20 million estimated in the mid 90's when Save Our State started screaming, and nobody paid attention. permalink parent award report block reply RedStoneDeepState 0 points 4 days ago Show that estimate from the 90s permalink parent award report block reply 1inchgroup 2 points 4 days ago fuck off you're the crazy one.  do your own research. permalink parent award report block reply view 10 more comments...\nRedStoneDeepState 0 points 4 days ago Show that estimate from the 90s permalink parent award report block reply 1inchgroup 2 points 4 days ago fuck off you're the crazy one.  do your own research. permalink parent award report block reply view 10 more comments...\n1inchgroup 2 points 4 days ago fuck off you're the crazy one.  do your own research. permalink parent award report block reply view 10 more comments...\nRock9Head 1 points 4 days ago Anchoritos permalink parent award report block reply\nBlackJack1776 31 points 4 days ago Oddly, no diversity. Almost, as if THEY built it all was a lie. permalink award report block reply Svaap 7 points 4 days ago Hey, doesn't Bigfoot count!?  LOL permalink parent award report block reply BlackJack1776 5 points 4 days ago Bigfeet never demanded reparations, nor EBT from me. So, sure. permalink parent award report block reply\nSvaap 7 points 4 days ago Hey, doesn't Bigfoot count!?  LOL permalink parent award report block reply BlackJack1776 5 points 4 days ago Bigfeet never demanded reparations, nor EBT from me. So, sure. permalink parent award report block reply\nBlackJack1776 5 points 4 days ago Bigfeet never demanded reparations, nor EBT from me. So, sure. permalink parent award report block reply\nswimmingguy 21 points 4 days ago A legit memelord is working at DHS permalink award report block reply aoneleggedduck 3 points 3 days ago video almost gave me a seizure, lol permalink parent award report block reply\naoneleggedduck 3 points 3 days ago video almost gave me a seizure, lol permalink parent award report block reply\nRikki_Tikki 21 points 4 days ago NOTHING more American than Bigfoot!!!! Love this! permalink award report block reply\nHelluvaEngineer 19 points 4 days ago Let's all remember that Bigfoot is a Freemason. permalink award report block reply BKav 9 points 4 days ago That was pretty funny to slip that in there permalink parent award report block reply GuerillaYourDreams 9 points 4 days ago And a freebird! permalink parent award report block reply\nBKav 9 points 4 days ago That was pretty funny to slip that in there permalink parent award report block reply\nGuerillaYourDreams 9 points 4 days ago And a freebird! permalink parent award report block reply\nSkogin 14 points 4 days ago 🇺🇸 USA 🇺🇸 permalink award report block reply\nEvJohn 13 points 4 days ago Didn't know this was possible, but I probably just contracted epilepsy from a clip. Albeit a neat one. permalink award report block reply Skogin 7 points 4 days ago You are beginning to see… permalink parent award report block reply\nSkogin 7 points 4 days ago You are beginning to see… permalink parent award report block reply\nSparkleMTN 12 points 4 days ago I have no idea what's going on besides pure unadulterated Americana Badassery. I'm cool with it. permalink award report block reply\ndeepbake 12 points 4 days ago HIGH ENERGY permalink award report block reply\ncptkloss5 10 points 4 days ago beautiful! not a single jogger! permalink award report block reply\nhospitalier 9 points 4 days ago RARE BIGFOOT SIGHTING permalink award report block reply\nroadrunner0 8 points 4 days ago Very motivating and invigorating, Now if we had several hundred of those box truck video billboards driving around cities and towns all day every day blasting this out with patriotic messages playing on the screens I would be very happy.. permalink award report block reply\nCaliAli 8 points 4 days ago I'm touching myself tonight. permalink award report block reply HeavyMetalPatriot 3 points 4 days ago Thank you for sharing! permalink parent award report block reply _M_A_G_A_ 1 points 4 days ago OK COOMER permalink parent award report block reply\nHeavyMetalPatriot 3 points 4 days ago Thank you for sharing! permalink parent award report block reply\n_M_A_G_A_ 1 points 4 days ago OK COOMER permalink parent award report block reply\nReturnOfSmarm 6 points 4 days ago Bigfoot is a nice touch.  He may be a myth, but he's OUR myth you fuckers! permalink award report block reply Steve56775 2 points 3 days ago What about Yetti’s? permalink parent award report block reply ReturnOfSmarm 1 points 3 days ago What about Yetti's what?  Best I know ..... Yetti's aren't into possessions/having things. permalink parent award report block reply\nSteve56775 2 points 3 days ago What about Yetti’s? permalink parent award report block reply ReturnOfSmarm 1 points 3 days ago What about Yetti's what?  Best I know ..... Yetti's aren't into possessions/having things. permalink parent award report block reply\nReturnOfSmarm 1 points 3 days ago What about Yetti's what?  Best I know ..... Yetti's aren't into possessions/having things. permalink parent award report block reply\nIfeargovtmorethan 6 points 4 days ago FREEBIRD!!!!! permalink award report block reply\nhenri_derelicte 6 points 4 days ago The administration’s social media game is on point. Not a faggot or tranny in sight permalink award report block reply\nMaxmax 6 points 4 days ago More of this, please. permalink award report block reply\nAnnieMm 5 points 4 days ago Excellent. permalink award report block reply\nPepe_longcockings 4 points 4 days ago Fire permalink award report block reply\nQuiznos585 4 points 4 days ago Great, start arresting leftist activist judges. Thanks. permalink award report block reply\nTravelingSalesman 4 points 4 days ago Globe earth Washington in the baphomet pose Osiris obelisk Bigfoot Moon landing Vegas pyramid Multi generational butterfly migration I think they’re trying to tell us something permalink award report block reply\nKendoextendo 4 points 4 days ago Eh, nothing better than the original freebird guitar solo. Adding the gay bass and drums takes away from the perfection of the OG song. permalink award report block reply\n_Liberty_Prime_ 4 points 4 days ago And we were on top of it. 😃 https://patriots.win/p/1ARK57tKYJ/homeland-security-/c permalink award report block reply\nKartoffelPuffer 3 points 4 days ago Time to gather the Western Canadian orphans and red-headed stepchildren under the flag of the USA. permalink award report block reply\nbluewhiteandred 3 points 4 days ago goes hard permalink award report block reply\nFren20 2 points 3 days ago Love it❤️❤️❤️❤️❤️keep it going permalink award report block reply\nNate_Higgersalot 2 points 4 days ago Bigfoot! permalink award report block reply\nRolandDelacroix 2 points 3 days ago I don't understand how anyone can say White America has no culture. permalink award report block reply\nRango 2 points 4 days ago I'm not deaf. Well, I wasn't. permalink award report block reply\nHikedelics 2 points 4 days ago Goddamn it feels like the Fourth of July in this bitch!! For real though, this is a rip-off of a very similar vid that A-10 Dale guy posted on X a year and a half ago. Set to the same exact song too. permalink award report block reply\nAlldayeveryday 2 points 4 days ago Less videos more deportations thanks permalink award report block reply\nAwShitHereWeGoAgain 2 points 4 days ago Awesome.... except for all the fake moon landing bullshit. permalink award report block reply\nVoight-Kampff 2 points 3 days ago I think deep down, we all knew that music videos could actually end up saving the world. permalink award report block reply\nOGRapHat 1 points 3 days ago Bigfoot permalink award report block reply\nFilledwithfire 1 points 4 days ago I’m convinced they’re scouting meme pages on IG, X, and TikTok and just commissioning creators to make these permalink award report block reply\nbananafone 1 points 3 days ago Cringe permalink award report block reply\nAggrieved03 0 points 4 days ago They're releasing videos while our country is unrecognizable. More and more Muslims everywhere I go with half a dozen wives in tow. They don't even try to hide it. permalink award report block reply SanityGumby 2 points 4 days ago That’s not their fault and they are fixing it. Faggot. permalink parent award report block reply\nSanityGumby 2 points 4 days ago That’s not their fault and they are fixing it. Faggot. permalink parent award report block reply\nwmmiv2016v2 0 points 4 days ago Gay. permalink award report block reply\nHoodooOperator 1 points 3 days ago Comment removed by community moderators. permalink award report block reply"}