{"id": "1ARK9nNhmq", "contents": "55 Trump Invites Financial Execs including Nasdaq, JPMorgan, to Private Dinner at White House posted 11 hours ago by flashersenpai 6 comments award share report block Robert Barnes @barnes_law • 20h This is what happens when SwampySuzie runs your White House. Jennifer Jacobs @JenniferJJacobs • 24h Scoop: Some financial industry execs have been invited to dinner at White House tomorrow night with Trump, including Nasdaq CEO Adena Friedman and JPMorgan Chase's Jamie Dimon, sources told @olivialarinaldi @RichardEscobedo and me. It comes a couple months after Trump hosted a\n6 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget SpeekFreely 4 points 10 hours ago A discussion for who gets a bailout after the coming AI Ponzi collapse. permalink award report block reply ahamrbond 2 points 10 hours ago We're hitting a really significant moment in the global economy. A lot of things are going to change. Trump is smarter than you think, and probably a lot less corrupt than this guy is insinuating. It's not good to look at every little thing Trump does and try and read into it. Relax. Focus on what Trump is actually doing rather than what you think he might be doing. permalink award report block reply Lurker404 4 points 10 hours ago Trump just went on TV and said the US needs H1Pajeets because Americans are too dumb. Noem went on TV and bragged they naturalized record numbers of foreigners and streamlined mass migration. Trump sent a letter to Israel asking for a pardon for Netanyahu. Trump has completely lost ist. Ever since he made a 180 on the Epstein files he changed completely. permalink parent award report block reply flashersenpai OP 1 points 9 hours ago Focus on what Trump is actually doing Yeah either nothing or countersignaling on America First priorities. permalink parent award report block reply Grindelwald 2 points 10 hours ago Hope he asks about Chase funding Epstein and debanking the a Trump family. permalink award report block reply flashersenpai OP 1 points 11 hours ago They should be in prison instead. permalink award report block reply sleepinggiant 0 points 10 hours ago Kind of makes you wonder how the shutdown really ended. permalink award report block reply\nSpeekFreely 4 points 10 hours ago A discussion for who gets a bailout after the coming AI Ponzi collapse. permalink award report block reply\nahamrbond 2 points 10 hours ago We're hitting a really significant moment in the global economy. A lot of things are going to change. Trump is smarter than you think, and probably a lot less corrupt than this guy is insinuating. It's not good to look at every little thing Trump does and try and read into it. Relax. Focus on what Trump is actually doing rather than what you think he might be doing. permalink award report block reply Lurker404 4 points 10 hours ago Trump just went on TV and said the US needs H1Pajeets because Americans are too dumb. Noem went on TV and bragged they naturalized record numbers of foreigners and streamlined mass migration. Trump sent a letter to Israel asking for a pardon for Netanyahu. Trump has completely lost ist. Ever since he made a 180 on the Epstein files he changed completely. permalink parent award report block reply flashersenpai OP 1 points 9 hours ago Focus on what Trump is actually doing Yeah either nothing or countersignaling on America First priorities. permalink parent award report block reply\nLurker404 4 points 10 hours ago Trump just went on TV and said the US needs H1Pajeets because Americans are too dumb. Noem went on TV and bragged they naturalized record numbers of foreigners and streamlined mass migration. Trump sent a letter to Israel asking for a pardon for Netanyahu. Trump has completely lost ist. Ever since he made a 180 on the Epstein files he changed completely. permalink parent award report block reply\nflashersenpai OP 1 points 9 hours ago Focus on what Trump is actually doing Yeah either nothing or countersignaling on America First priorities. permalink parent award report block reply\nGrindelwald 2 points 10 hours ago Hope he asks about Chase funding Epstein and debanking the a Trump family. permalink award report block reply\nflashersenpai OP 1 points 11 hours ago They should be in prison instead. permalink award report block reply\nsleepinggiant 0 points 10 hours ago Kind of makes you wonder how the shutdown really ended. permalink award report block reply"}