{"id": "1ARK9mFa7C", "contents": "1343 BREAKING: Colombia president orders suspension of intelligence sharing with US until Washington stops attacking boats in the Caribbean - Reuters posted 19 hours ago by PiratePatriotParrot 215 comments award share report block Breaking911 @Breaking911 • 20h BREAKING: Colombia president orders suspension of intelligence sharing with US until Washington stops attacking boats in the Caribbean - Reuters\n215 comments Sort by Top Top New Worst Old Save Beaverstatemilitia 265 points 19 hours ago Oh no what will we ever do? permalink award report block reply invalid_data 137 points 19 hours ago Oh no, the narcos government wont tell us secrets about their narcos enemies movements. Columbia doesnt matter and should be treated as such. permalink parent award report block reply MAGASQUAD 50 points 19 hours ago Are the narcos actually enemies of the colombian government though permalink parent award report block reply Moebius 39 points 19 hours ago Nope. permalink parent award report block reply ScrewReddit 10 points 18 hours ago Yeah, this is the same guy who made coy death threats against Trump: Colombia’s president muses about getting ‘rid of’ Trump in menacing interview as drug feud intensifies permalink parent award report block reply view 6 more comments... Hanging_Chad 18 points 19 hours ago Colombia's main legal crop is coffee, with the country being a major global producer known for high-quality mild coffee. Other significant crops include bananas, cut flowers, palm oil, and sugarcane. While coffee is the most prominent legal crop, coca is also grown for the illegal drug trade.  🌿🍚👃🏻 permalink parent award report block reply saltyviewer123 9 points 19 hours ago Tim Hortons might be getting expensive real soon.  Best get ready to short that stock! permalink parent award report block reply MehNahMehNah 7 points 19 hours ago Where's Hunter? permalink parent award report block reply Ghost_0f_Kiev 4 points 18 hours ago 🧐 permalink parent award report block reply Aggrieved03 4 points 19 hours ago CIA competition. permalink parent award report block reply BruddahIz 7 points 18 hours ago They are consolidating around a new formed cartel org now that they have a new head of mangement in Mexico.  All the cartels not part of this new CIA grouup will get the boat treatment via the US Military. Convienent. permalink parent award report block reply view 2 more comments... schiff_for_brains 1 points 16 hours ago More like partners. permalink parent award report block reply BaldyGull 1 points 17 hours ago Depends on whether they've paid their dues. permalink parent award report block reply load 1 more comments... Moebius 59 points 19 hours ago I bet you a Donut we're not relying on Colombian 'Intelligence' to target their Drug shipments... permalink parent award report block reply PROCIsAsshoe 23 points 19 hours ago ikr? saw a similar headline about the British govt a few hours ago. as if we need British or Colombian intelligence for this effort.  I guess the faggots are just letting us know who they're beholden to, right? crazy to think \"I won't help you identify narcotics traffickers!\" permalink parent award report block reply Moebius 12 points 18 hours ago Because the President of Colombia is totally in the Cartels' pockets. It's not at all unprecedented.  Remember Manuel Noriega... permalink parent award report block reply covok48 1 points 8 hours ago He’s also a Coke head. permalink parent award report block reply crimsonfancy 7 points 18 hours ago The faggots are letting the traffickers know..... \"don't blame us.  We still maintain the deals we have and won't ever sell you out....just keep delivering our cut.\" permalink parent award report block reply learntocode 3 points 14 hours ago We are staging an invasion of their off shore banks - British Virgin Isles, Cayman, and Bermuda permalink parent award report block reply Jmricht 1 points 13 hours ago Do it permalink parent award report block reply view 1 more comments... SanityGumby 2 points 15 hours ago Does sound like a great opportunity to step in and topple starmer though. Without that communist faggot at the helm maybe the UK can survive permalink parent award report block reply IllKissYourBoobies 1 points 4 hours ago I bet you a Donut... High stakes for a cop. permalink parent award report block reply corntortilla 1 points 15 hours ago I decline your bet. permalink parent award report block reply BlackPilledMAGA 10 points 18 hours ago \"we're gonna stop telling you which boats are loaded with drugs until you stop blowing them up\" ? permalink parent award report block reply conservatarian 2 points 17 hours ago underrated comment permalink parent award report block reply NoticesBugleOWO 6 points 18 hours ago Bomb more boats I hope! permalink parent award report block reply TearsAficionado 4 points 18 hours ago Add British and Columbian boats to the target list permalink parent award report block reply cyberrigger 1 points 12 hours ago Here's the punchline, their 'intelligence' --- is what the US is doing. permalink parent award report block reply load 2 more comments... South_Florida_Guy 143 points 19 hours ago Looks like we're just gonna have to blow up every boat leaving there now permalink award report block reply PhilipeNegro 41 points 19 hours ago Sharks bout to eat fr permalink parent award report block reply MAGALADON9 26 points 19 hours ago No cap. permalink parent award report block reply yummy_yumm_yumms 10 points 19 hours ago Username checks out permalink parent award report block reply DT170x 5 points 18 hours ago Username also checks out permalink parent award report block reply view 3 more comments... FakeNametag 17 points 19 hours ago Sharks on coke, raging out.  I wouldn't wanna be the boat guys permalink parent award report block reply 4444444444444 7 points 18 hours ago Will it be the sequel to cocaine bear? permalink parent award report block reply LurkNoMore 3 points 16 hours ago It better fucking be the sequel! Great White Powder Mayhem!  Though, I legit would looove to see what coked out dolphins would be like. permalink parent award report block reply view 2 more comments... Necrovoter 3 points 10 hours ago They're gonna need a bigger straw. permalink parent award report block reply tired-of-crap 3 points 9 hours ago Yes they better conceal that loading process a little better.  If we can read license plates from space we certainly could tell if they're loading drugs on a boat. This of course does not require Colombian intelligence. permalink parent award report block reply AnonByTheLake 3 points 19 hours ago I want my coffee! permalink parent award report block reply Informationinsider 1 points 10 hours ago We have \"Cocaine Bear\" now we need \"Cocain Sharks\". permalink parent award report block reply DingleBalls 55 points 19 hours ago No. permalink award report block reply DeportThemAllForever 42 points 19 hours ago We were sharing intelligence with Columbia?  wtf, are the only people we don’t share with is American public?  Rest of the world already knows everything apparently. permalink parent award report block reply justicein2020 7 points 15 hours ago Thats how mcafee found out everything. made himself a player. he gave 3rd world countries computers with his software.. we share with the 3rd world. their security is a joke.  so yes! americans are the only ones clueless in the loop. permalink parent award report block reply Leporidae 3 points 10 hours ago That man was a true legend. permalink parent award report block reply SanityGumby -1 points 15 hours ago I see you are retarded and don’t comprehend how governments function permalink parent award report block reply ShlomoJoe 1 points 19 hours ago Time for strategic air strikes on Columbia now. permalink parent award report block reply StankoniusMaximus -6 points 19 hours ago Oh fck right off war machine permalink parent award report block reply Run_over_Antifa 5 points 19 hours ago Stopping whats killing us is not a war machine permalink parent award report block reply RuprechtThaMonkeyBoy 44 points 19 hours ago We’ve seen what migrates here, so we’re cool with y’all not sharing your intelligence. permalink award report block reply Formerlurker92 24 points 19 hours ago Or your people. Total immigration, visa, and visitor moratorium from that country permalink parent award report block reply Buce-Nudo 3 points 17 hours ago Stop all foreign aid right away. permalink parent award report block reply DelendaEstMarxismo 41 points 19 hours ago Sounds like he's mad that some of those drugs being destroyed are Columbian product. permalink award report block reply Bythrfruitsyknow 33 points 19 hours ago lol I am so sure we were relying on intelligence from Columbia and the United Kingdom. permalink award report block reply SanityGumby 4 points 15 hours ago Out of the two the UK is the only one with possible intelligence that would matter. Columbia is in bed with the cartels so nothing they say would be handy. Meanwhile the UK still owns several Caribbean islands permalink parent award report block reply FartherRight 1 points 11 hours ago The UK has nothing useful and we should cut them out of five eyes. permalink parent award report block reply Vorticity1 25 points 19 hours ago Trump stops all aid to Colombia and blows up a distribution center. permalink award report block reply vongregormench 24 points 19 hours ago Colombia is run by a Marxist. Fuck them. permalink award report block reply PiratePatriotParrot OP 4 points 19 hours ago https://www.youtube.com/watch?v=WmaVNKlU6d8 permalink parent award report block reply PhantomShield72 23 points 19 hours ago First the UK, now Columbia. Apparently a new \"axis of evil\" is revealing itself... permalink award report block reply Trumportellagain 11 points 18 hours ago Shithole countries. The United Caliphate has fallen to Islam unless Tommy Robinson forcibly removes them. permalink parent award report block reply FartherRight 2 points 11 hours ago Tommy is controlled opposition and will redirect your anger into parades and your money into Israel while the UK dies. permalink parent award report block reply SupFrens 15 points 19 hours ago Awwww, is Colombia's GDP falling because they can't illegally import their drugs? GOOD. permalink award report block reply f_bastiat 12 points 19 hours ago As much as I hate the NSA, the US doesn't need intelligence from anyone, we already have everything that ever existed and are set up to receive everything that hasn't come to be yet. permalink award report block reply The_Bloofy_Bullshark 3 points 14 hours ago NSA is only a small piece to the puzzle too. The US has a good number of spooky units, and most folks barely know they exist. The ISA (The Activity) is JSOC’s covert brain and muscle, running live HUMINT, SIGINT, and targeting for the shooters. INSCOM runs field signals and human intel, often buried deep with JSOC teams. DIA’s Defense Clandestine Service is the Pentagon’s own network of spies working long-term sources in denied zones. ONI’s deep ops teams handle undersea and maritime reconnaissance that never makes the news. The Air Force’s 24th SOW and 17th STS tie ISR and precision targeting directly into special ops. MARSOC’s tech teams manage digital recon and exploitation for Raider missions. Cyber Command and NSA’s hunt teams do the dirty work in the digital battlespace, finding, breaking, and weaponizing access. Together they form the quiet layer between SOF and the three-letter agencies, the ones who see everything before the lights go out. I’ve seen a number of these guys in action and it’s something else entirely. Pure competence of the highest order. The ISA is in its own class. Every major nation has its own “shadow service” for technical reconnaissance and covert HUMINT, but the Activity sits in a category that most allies don’t even attempt to replicate. Basically we have eyes, ears, and then some all over the globe at all times. permalink parent award report block reply BreakingCNN 2 points 19 hours ago Well that explains the WMDs in Iraq.\nFyi: the most surprised person to find out that Iraq did not have WMDs was Saddam Hussein. permalink parent award report block reply PhantomShield72 12 points 19 hours ago You're confusing the concepts of an intelligence failure and a disinformation op utilized as Casus Belli. permalink parent award report block reply PROCIsAsshoe 4 points 18 hours ago seriously, it's such an easy situation to parse out: Saddam would've known that his regime was doomed in the early hours of a ground invasion. Why wouldn't he have just used a WMD against our invasion forces out in the desert as we began the campaign? He had nothing left to lose and, generally, the entire motivation for possessing WMD's is that it precludes the ability for an enemy force to conduct a ground invasion of your country. He didn't ever have them, like you've said! permalink parent award report block reply FatigueIsReal 3 points 17 hours ago I'll never buy that Iraq didn't have WMDs or the capability of making them simply based on their actions for over a decade. I'm not sure how anti-government you have to be to watch a country obstruct nuclear capability inspections dozens of times over 10+ years and then when you finally invade with tons of warning, posturing and time ahead of it, and believe that they suddenly don't have any WMD capabilities. Agreeing with the invasion is separate.  That was a terrible mistake.  Iraq should have been handled like Trump handled Syria and Iran. permalink parent award report block reply BreakingCNN 3 points 19 hours ago No, it was not a disinformation op.\nRemember what happened to the Iraqi soccer coach who lost? The heads of the Iraqi N, B, and C we're all sending reports to Saddam telling him what great progress they were making. These reports were intercepted by Echelon.  Additionally, as they already had these reports drafted they went ahead and sold them to the Mossad for a sizable chunk of change. And finally the US was picking up some of the chatter which was then confirmed by the British and the Israelis. Plus, just cause, oh wait I think that was Grenada or something, never mind permalink parent award report block reply learntocode 1 points 14 hours ago Except for Our Greatest Ally. Cannot touch them. permalink parent award report block reply SimaYi 0 points 13 hours ago We get everything from Israel. permalink parent award report block reply f_bastiat 1 points 8 hours ago You are mistaken, Israel gets everything from us and gives back what's needed when using the information in an investigation presents a rights violation if we are the source. Israel is essentially a government agency that does nothing without us, it's quite comical how deep people go on here with the IsRaEl CoNtRoLs EvErYtHiNg. They are a population smaller than some of our smaller states, surrounded by blood thirsty mudslimes, and their land is essentially useless other than as the American base it is. permalink parent award report block reply Coprolite 11 points 19 hours ago So anyway I blew up another one. permalink award report block reply mty_green_go 4 points 12 hours ago So anyway we started blasting permalink parent award report block reply RichardCranium88 9 points 17 hours ago That's a laugh. as if the Colombia president isn't complicit in drug trafficking. permalink award report block reply Beelzy 8 points 19 hours ago Shit, we know what they eat for dinner before they head out. Suck a bag of dicks, Columbia. permalink award report block reply Hanging_Chad 8 points 19 hours ago fair, next permalink award report block reply Beat_to_Quarters 7 points 19 hours ago I guess they weren't sharing \"intelligence\" about the boats with us already. permalink award report block reply Skywise 7 points 19 hours ago Tell me you're complicit in the drug trade without telling me you're complicit in the drug trade permalink award report block reply The_Bloofy_Bullshark 6 points 19 hours ago Between CIA, DIA, NSA, NGA, NRO, and the ISA as well as DEA assets, I think we will be ok. permalink award report block reply American-Patriot 6 points 19 hours ago Looks like we gotta bomb more boats into submission permalink award report block reply BreakingCNN 8 points 19 hours ago I believe it's now referred to as the:\nTerrific Tariff on Terror permalink parent award report block reply Ligersrule1 5 points 19 hours ago Your terms are acceptable permalink award report block reply cryptoapebot 5 points 19 hours ago they about to get spanked. permalink award report block reply RogueLeaderX 5 points 19 hours ago What intelligence wont they be sharing? How theyre screwing us behind our back? permalink award report block reply Yawnz13 5 points 19 hours ago https://www.reuters.com/world/americas/colombia-president-orders-suspension-intelligence-sharing-with-us-2025-11-12/ https://x.com/petrogustavo/status/1988393441999593891 Unlike the post about the UK, this actually comes from someone in the Colombian government. permalink award report block reply MajorClark 5 points 19 hours ago The UN doesn't like the USA bombing their drug smugglers.  King Charles bowed to the UN & the UK will no longer share their knowledge of drug smugglers. permalink award report block reply I_Love_45-70_Gov 5 points 19 hours ago Columbia sharing intelligence with the U.S. is like a dog sharing its shit with its master. permalink award report block reply Counterwhat 5 points 19 hours ago Stop sending money. We send a lot of money and equipment. We can take on the cartels ourselves and we will win. permalink award report block reply RedCalifornia 5 points 19 hours ago Oh no! Sounds like time to cut foreign aid permalink award report block reply GabeC1997 4 points 19 hours ago Just blow up anything that doesn’t have a transponder, problem solved. permalink award report block reply ancroidubh 4 points 9 hours ago <snort> Intelligence sharing with Columbia… <snort>. I’m certain that any product from that failed narco-terrorist State is chock full of lies and disinformation. permalink award report block reply Trump4Infinity 4 points 19 hours ago Flak over the target. Something other than drugs and humans are being smuggled. At this point those things are cover. permalink award report block reply Nerdrem3 4 points 19 hours ago Uh... I'd imagine most of the intelligence \"sharing\" is us giving them information. Probably costs us money so stopping it sounds like good news to me. permalink award report block reply 4886Battery 4 points 19 hours ago Damn, how will we get their fake intelligence reports now?   We're cooked. permalink award report block reply Badfinz_FL 4 points 10 hours ago Yeah, no permalink award report block reply IlhanOmarsFagBrother 4 points 19 hours ago OK terms are acceptable permalink award report block reply Logan051361 4 points 19 hours ago bomb his house permalink award report block reply Dewormed_Patriot 4 points 17 hours ago Lack of Colombian intelligence.  Is that like a double negative? Tell me you're a failed narco state without telling me you are a failed narco state. permalink award report block reply dres3 4 points 19 hours ago Colombia confirms that they were in on the smuggling. permalink award report block reply SimaYi 4 points 13 hours ago Can we get proper syntax from a news organization? Thanks. Columbia president? It's either Colombian president or The president of Columbia. permalink award report block reply yodayoda 4 points 17 hours ago why is this BREAKING? permalink award report block reply Ch3f4554551n 4 points 12 hours ago BREAKING: REUTERS and \"Colombian Intelligence\" are just both branches of the CIA. permalink award report block reply ColonelKlink 4 points 19 hours ago Keep getting rid of cartels and drug boats. This means anything  they tell you from now on, could be false. permalink award report block reply Internet_hugs 3 points 19 hours ago Oh no, you mean we're going to lose tin cans with string and hollow tree trunk and sticks? Just tragic. permalink award report block reply Xahnel 3 points 18 hours ago Weird that a country that totally isn't run by drug cartels would defend the drug cartels... permalink award report block reply cbonez416 3 points 19 hours ago Lol what? What fucking losers. permalink award report block reply OG_BACONndEGGs 3 points 19 hours ago Colombians are not intelligent. permalink award report block reply _Sully_ 3 points 19 hours ago I think the order of these announcements will be very curious. permalink award report block reply Choppermagic 3 points 16 hours ago bomb a few colombian military boats then...ooopsie, you didn't tell us. permalink award report block reply SanityGumby 1 points 15 hours ago They have like 5 permalink parent award report block reply SicSemperTyrannis2 1 points 15 hours ago Bomb 6 just to be sure. permalink parent award report block reply knnbccb 3 points 18 hours ago LOL, the death throes of a dying regime. Please also take out Venezuela. China will throw a hissy fit because its launchpad for initiating a 'revenge' drug war against America will be gone, and also a source of cheap oil. Why did you think Maduro and a bunch of socialist cretins had this Zoom meeting with Xi Jinping some years ago? https://patriots.win/p/1ARJd11QpD/this-is-a-partial-list-of-americ/c Take special note of leaders from South Africa and Serbia in the photo, they will be next after Venezuela. The others from central Asia and other third world countries, they can be ignored. permalink award report block reply LawyersPlayDota 3 points 18 hours ago Cool, cut their funding. permalink award report block reply PhantomShield72 3 points 19 hours ago \"Allow the drug and human smuggling or we won't provide you with information...\" permalink award report block reply Hikedelics 3 points 19 hours ago Oh darn… Everyone knows how heavily we rely on Columbia for our intelligence gathering. permalink award report block reply Tacitus1963 3 points 13 hours ago Gustavo Petro, like Claudia Sheinbaum, Senator Gallegos (AZ) et al clearly all work for the cartels.\nNo more of our taxpayer $s should be going to either Columbia or Mexico. permalink award report block reply guypatriot 3 points 14 hours ago How about we just blow up all known cartel locations. permalink award report block reply DEPORT50M 3 points 13 hours ago When the turd countries try to flex it's funny. Bitch, shut up and make the ________ thing we let you make as part of the global supply chain. permalink award report block reply Praetor_Sean 3 points 18 hours ago So they are admitting that the drug boats are Colombian government property? permalink award report block reply R3tro 3 points 16 hours ago Columbia is to intelligence as temu is to quality…. LOL permalink award report block reply h203h 3 points 18 hours ago Colombia is fake and gay!\nThank you for your attention to this matter! permalink award report block reply henri_derelicte 3 points 18 hours ago Maybe Colombia needs some “new management” alongside Venezuela permalink award report block reply john9985 3 points 19 hours ago 😂😂 .. cut off all bullshit funding! permalink award report block reply BreakingCNN 1 points 19 hours ago Not quite  I think Eli Lilly hit a new all time high today. permalink parent award report block reply djentropyhardcore 3 points 18 hours ago Who runs Real Time Alerts on telegram, and why is it posted here verbatim? permalink award report block reply MAGALADON9 3 points 19 hours ago Lol get fucked drug dealers permalink award report block reply EJay_Scott 3 points 19 hours ago Bomb Columbia. Problem solved. permalink award report block reply Arobb 3 points 17 hours ago All this tells me is that our strikes are starting to have an impact. permalink award report block reply MJPalazzolo 3 points 14 hours ago Colombia, a cesspool of cartel activity and corruption. Intelligence sharing...Right. How much of the \"sharing\" was false information contrived to confuse, divert, and distract the DEA from enforcing United States law. permalink award report block reply Rock9Head 2 points 18 hours ago Gotta have intelligence to share it. permalink award report block reply Jmricht 2 points 19 hours ago A-4  B-3 permalink award report block reply barwhack 2 points 18 hours ago More boats to sink. permalink award report block reply BobDolesBanana 2 points 17 hours ago LOL!  This is a Deep State cover story! 😂 permalink award report block reply brewser724 2 points 15 hours ago Columbia is far from intelligent, so they should try to keep some of it. permalink award report block reply TwoArizonaPedes 2 points 18 hours ago Oh no. Anyway... permalink award report block reply America_No_1 2 points 18 hours ago Weird how all the countries are suddenly upset about drug money being cut off.  Hmmmm permalink award report block reply Testamernt 2 points 16 hours ago What an odd stance to take. permalink award report block reply Michalusmichalus 2 points 9 hours ago I don't drink coffee, I don't do cocaine. I guess I don't need Columbia. A country named after a Goddess. permalink award report block reply raptormissle 2 points 14 hours ago Columbia has intelligence? permalink award report block reply UNfreeNewZealand 2 points 13 hours ago …….and? permalink award report block reply njb425 2 points 18 hours ago That means start bombing Columbia’s ports permalink award report block reply MadRussian 2 points 17 hours ago Then just blow anything up that looks funny permalink award report block reply tholinz 2 points 19 hours ago Okay bye bye lol permalink award report block reply BOHICA2021 2 points 19 hours ago WE DON'T NEED NO STINKING PERMISSION... permalink award report block reply Goatboy66 2 points 18 hours ago Obviously the Columbian President is bring paid by the Drug Dealers. Just like all the other Presidents here and around the world who haven't been blowning up the Drug Dealers like President Trump has.🤔 permalink award report block reply HoganP 2 points 12 hours ago In a sense, the South American version of a tariff? permalink award report block reply presticus 2 points 17 hours ago Sounds like an admission that the Colombian government is working with the cartels. permalink award report block reply SavingPrivateGrace 2 points 19 hours ago FAFO permalink award report block reply MOLON-LABE 2 points 18 hours ago Breaking.... fuck you bitchachos! permalink award report block reply BaldyGull 2 points 17 hours ago Siding with Narcos? Way to dodge those stereotypes. permalink award report block reply shadily0524 2 points 16 hours ago Intel sharing with Columbia! 😂😂😂😂😂😂😂 permalink award report block reply geekesmind 2 points 18 hours ago they can FUCK OFF permalink award report block reply LightBeacons 2 points 19 hours ago who knew? As the French put it, C'est La Vie!! Does the idiot really think the US is gonna stop??? permalink award report block reply Thereyago 2 points 15 hours ago Isn't this the guy that went to a rally after the UN and called for american troops to disobey lawful orders from thier commanding officer? permalink award report block reply macocontentfarmer 2 points 18 hours ago Can we please stop funding the rest of the world? Especially since they hate us despite draining the life force of every taxpayer to their benefit. permalink award report block reply AmericanForever 2 points 18 hours ago Tariff Colombia harder and get their illegals back to them permalink award report block reply RizzlieDoodad 2 points 18 hours ago Like it even matters. We have satellites permalink award report block reply thechill 2 points 8 hours ago No. permalink award report block reply entERmyMAtrix 2 points 17 hours ago That’s a weird thing to do. permalink award report block reply BeanieRed 2 points 18 hours ago Even governments virtual signal.  UK, now Columbia…how will we survive! permalink award report block reply Eurpoean 2 points 7 hours ago lmao permalink award report block reply Oodles 2 points 18 hours ago Your terms are acceptable permalink award report block reply deleted 1 points 16 hours ago Ryker 1 points 16 hours ago I should probably at least read the title before I comment.. lol permalink parent award report block reply PhilipeNegro 1 points 19 hours ago Press “N” for “I don’t care” permalink award report block reply Desensitized 1 points 18 hours ago \"Wait, we can do that?\" permalink award report block reply MocksFordComma 1 points 18 hours ago https://www.youtube.com/watch?v=yhK6dPj-O-c permalink award report block reply TearsAficionado 1 points 18 hours ago Willie Wonka: ...no, stop, don't ... permalink award report block reply HeavenlyTrumpets 1 points 19 hours ago Drug boats? permalink award report block reply Mhmm2MoreWeeks 1 points 17 hours ago Lets conquer all of the Americas by Force. Canada to Argentina. Or Just put Tomahawks on the homes of the Cartel Bosses until they get the message. permalink award report block reply Papabravo12 1 points 18 hours ago Haha permalink award report block reply RedPillosopher1776 1 points 17 hours ago What is the point of the intelligence if not to stop the problem. permalink award report block reply corntortilla 1 points 15 hours ago Their president appears to be one dumb motherfucker. Someone might want to sit his ass down and give him a brief history lesson. Maybe remind him that, without our help,  he could become the next Ingrid betancourt. permalink award report block reply KiekhaeferSoldier 1 points 6 hours ago \"Columbian Intelligence\"...  fire the meme cannon! permalink award report block reply Plutossextape1 1 points 3 hours ago Alternative headline - Drug cartel opposes product being destroyed permalink award report block reply ElectionMeddler 1 points 14 hours ago Were they even sharing anything in the first place? permalink award report block reply learntocode 1 points 14 hours ago Chu bettah not bam my dam moaney laundry bancos Trahmp!! permalink award report block reply learntocode 1 points 14 hours ago Bomb their off shore banks into oblivion. permalink award report block reply ProtonicK 1 points 18 hours ago Oh no! Ok, we promise to stop! permalink award report block reply R3tro 1 points 7 hours ago The funny thing here, is that Columbia’s intel, is probably our intel, that they probably just share back to us…. permalink award report block reply Saltyminer11 1 points 19 hours ago Over the target. permalink award report block reply warlord30 1 points 16 hours ago 🤷‍♂️ permalink award report block reply MAGAnificent700 1 points 18 hours ago Boo hoo permalink award report block reply friedchicken 1 points 18 hours ago I hate intelligence agencies.  Do the shit the old fashioned way. permalink award report block reply behemoth887 1 points 18 hours ago lol these responses are retarded. \"stop attacking our illegal drug dealers! i mean....oh shit!!!\" permalink award report block reply suckmycorona 1 points 18 hours ago Why are we sharing intelligence in the first place permalink award report block reply Formerlurker92 1 points 19 hours ago The nsa has a data center the size of an Amazon warehouse and when Snowden blew the whistle they were already spying on half of Americans and half a billion worldwide. I'm sure its worse now,  so why not use it permalink award report block reply ThorsonTT 3 points 19 hours ago I'm pretty sure they were mostly spying on Americans.  They probably still are.  Including everything on TheDonald. permalink parent award report block reply KernalMustard 2 points 19 hours ago Hi NSA ✋ permalink parent award report block reply turdinthepunch 1 points 19 hours ago how original permalink award report block reply Greenhills 1 points 19 hours ago Ok, we’ll get everything from Russia. permalink award report block reply suckmycorona 1 points 18 hours ago BRAAKING permalink award report block reply TheArchAngel 0 points 18 hours ago Israel and the Mossad can do the funniest thing right now. permalink award report block reply tuaris -2 points 18 hours ago Colombia no longer interested in being the USA's bitch?   Yes. Petro has been the only Colombian president with balls to stand up and stop sucking the USA's dick. permalink award report block reply flashersenpai -2 points 19 hours ago Good. Allegedly Hegseth and Rubio were telling congress they weren't going to attack land targets and didn't have a legal justification to do so anyway. Starting a taco war didn't work for Bush and it wont work for Trump either. Foreign wars wont fix domestic misery. permalink award report block reply new_guy2 1 points 19 hours ago Comment removed by community moderators. permalink award report block reply SCHULTZ 1 points 19 hours ago Comment removed by community moderators. permalink award report block reply\nBeaverstatemilitia 265 points 19 hours ago Oh no what will we ever do? permalink award report block reply invalid_data 137 points 19 hours ago Oh no, the narcos government wont tell us secrets about their narcos enemies movements. Columbia doesnt matter and should be treated as such. permalink parent award report block reply MAGASQUAD 50 points 19 hours ago Are the narcos actually enemies of the colombian government though permalink parent award report block reply Moebius 39 points 19 hours ago Nope. permalink parent award report block reply ScrewReddit 10 points 18 hours ago Yeah, this is the same guy who made coy death threats against Trump: Colombia’s president muses about getting ‘rid of’ Trump in menacing interview as drug feud intensifies permalink parent award report block reply view 6 more comments... Hanging_Chad 18 points 19 hours ago Colombia's main legal crop is coffee, with the country being a major global producer known for high-quality mild coffee. Other significant crops include bananas, cut flowers, palm oil, and sugarcane. While coffee is the most prominent legal crop, coca is also grown for the illegal drug trade.  🌿🍚👃🏻 permalink parent award report block reply saltyviewer123 9 points 19 hours ago Tim Hortons might be getting expensive real soon.  Best get ready to short that stock! permalink parent award report block reply MehNahMehNah 7 points 19 hours ago Where's Hunter? permalink parent award report block reply Ghost_0f_Kiev 4 points 18 hours ago 🧐 permalink parent award report block reply Aggrieved03 4 points 19 hours ago CIA competition. permalink parent award report block reply BruddahIz 7 points 18 hours ago They are consolidating around a new formed cartel org now that they have a new head of mangement in Mexico.  All the cartels not part of this new CIA grouup will get the boat treatment via the US Military. Convienent. permalink parent award report block reply view 2 more comments... schiff_for_brains 1 points 16 hours ago More like partners. permalink parent award report block reply BaldyGull 1 points 17 hours ago Depends on whether they've paid their dues. permalink parent award report block reply load 1 more comments... Moebius 59 points 19 hours ago I bet you a Donut we're not relying on Colombian 'Intelligence' to target their Drug shipments... permalink parent award report block reply PROCIsAsshoe 23 points 19 hours ago ikr? saw a similar headline about the British govt a few hours ago. as if we need British or Colombian intelligence for this effort.  I guess the faggots are just letting us know who they're beholden to, right? crazy to think \"I won't help you identify narcotics traffickers!\" permalink parent award report block reply Moebius 12 points 18 hours ago Because the President of Colombia is totally in the Cartels' pockets. It's not at all unprecedented.  Remember Manuel Noriega... permalink parent award report block reply covok48 1 points 8 hours ago He’s also a Coke head. permalink parent award report block reply crimsonfancy 7 points 18 hours ago The faggots are letting the traffickers know..... \"don't blame us.  We still maintain the deals we have and won't ever sell you out....just keep delivering our cut.\" permalink parent award report block reply learntocode 3 points 14 hours ago We are staging an invasion of their off shore banks - British Virgin Isles, Cayman, and Bermuda permalink parent award report block reply Jmricht 1 points 13 hours ago Do it permalink parent award report block reply view 1 more comments... SanityGumby 2 points 15 hours ago Does sound like a great opportunity to step in and topple starmer though. Without that communist faggot at the helm maybe the UK can survive permalink parent award report block reply IllKissYourBoobies 1 points 4 hours ago I bet you a Donut... High stakes for a cop. permalink parent award report block reply corntortilla 1 points 15 hours ago I decline your bet. permalink parent award report block reply BlackPilledMAGA 10 points 18 hours ago \"we're gonna stop telling you which boats are loaded with drugs until you stop blowing them up\" ? permalink parent award report block reply conservatarian 2 points 17 hours ago underrated comment permalink parent award report block reply NoticesBugleOWO 6 points 18 hours ago Bomb more boats I hope! permalink parent award report block reply TearsAficionado 4 points 18 hours ago Add British and Columbian boats to the target list permalink parent award report block reply cyberrigger 1 points 12 hours ago Here's the punchline, their 'intelligence' --- is what the US is doing. permalink parent award report block reply load 2 more comments...\ninvalid_data 137 points 19 hours ago Oh no, the narcos government wont tell us secrets about their narcos enemies movements. Columbia doesnt matter and should be treated as such. permalink parent award report block reply MAGASQUAD 50 points 19 hours ago Are the narcos actually enemies of the colombian government though permalink parent award report block reply Moebius 39 points 19 hours ago Nope. permalink parent award report block reply ScrewReddit 10 points 18 hours ago Yeah, this is the same guy who made coy death threats against Trump: Colombia’s president muses about getting ‘rid of’ Trump in menacing interview as drug feud intensifies permalink parent award report block reply view 6 more comments... Hanging_Chad 18 points 19 hours ago Colombia's main legal crop is coffee, with the country being a major global producer known for high-quality mild coffee. Other significant crops include bananas, cut flowers, palm oil, and sugarcane. While coffee is the most prominent legal crop, coca is also grown for the illegal drug trade.  🌿🍚👃🏻 permalink parent award report block reply saltyviewer123 9 points 19 hours ago Tim Hortons might be getting expensive real soon.  Best get ready to short that stock! permalink parent award report block reply MehNahMehNah 7 points 19 hours ago Where's Hunter? permalink parent award report block reply Ghost_0f_Kiev 4 points 18 hours ago 🧐 permalink parent award report block reply Aggrieved03 4 points 19 hours ago CIA competition. permalink parent award report block reply BruddahIz 7 points 18 hours ago They are consolidating around a new formed cartel org now that they have a new head of mangement in Mexico.  All the cartels not part of this new CIA grouup will get the boat treatment via the US Military. Convienent. permalink parent award report block reply view 2 more comments... schiff_for_brains 1 points 16 hours ago More like partners. permalink parent award report block reply BaldyGull 1 points 17 hours ago Depends on whether they've paid their dues. permalink parent award report block reply load 1 more comments...\nMAGASQUAD 50 points 19 hours ago Are the narcos actually enemies of the colombian government though permalink parent award report block reply Moebius 39 points 19 hours ago Nope. permalink parent award report block reply ScrewReddit 10 points 18 hours ago Yeah, this is the same guy who made coy death threats against Trump: Colombia’s president muses about getting ‘rid of’ Trump in menacing interview as drug feud intensifies permalink parent award report block reply view 6 more comments... Hanging_Chad 18 points 19 hours ago Colombia's main legal crop is coffee, with the country being a major global producer known for high-quality mild coffee. Other significant crops include bananas, cut flowers, palm oil, and sugarcane. While coffee is the most prominent legal crop, coca is also grown for the illegal drug trade.  🌿🍚👃🏻 permalink parent award report block reply saltyviewer123 9 points 19 hours ago Tim Hortons might be getting expensive real soon.  Best get ready to short that stock! permalink parent award report block reply MehNahMehNah 7 points 19 hours ago Where's Hunter? permalink parent award report block reply Ghost_0f_Kiev 4 points 18 hours ago 🧐 permalink parent award report block reply Aggrieved03 4 points 19 hours ago CIA competition. permalink parent award report block reply BruddahIz 7 points 18 hours ago They are consolidating around a new formed cartel org now that they have a new head of mangement in Mexico.  All the cartels not part of this new CIA grouup will get the boat treatment via the US Military. Convienent. permalink parent award report block reply view 2 more comments... schiff_for_brains 1 points 16 hours ago More like partners. permalink parent award report block reply BaldyGull 1 points 17 hours ago Depends on whether they've paid their dues. permalink parent award report block reply load 1 more comments...\nMoebius 39 points 19 hours ago Nope. permalink parent award report block reply ScrewReddit 10 points 18 hours ago Yeah, this is the same guy who made coy death threats against Trump: Colombia’s president muses about getting ‘rid of’ Trump in menacing interview as drug feud intensifies permalink parent award report block reply view 6 more comments...\nScrewReddit 10 points 18 hours ago Yeah, this is the same guy who made coy death threats against Trump: Colombia’s president muses about getting ‘rid of’ Trump in menacing interview as drug feud intensifies permalink parent award report block reply view 6 more comments...\nHanging_Chad 18 points 19 hours ago Colombia's main legal crop is coffee, with the country being a major global producer known for high-quality mild coffee. Other significant crops include bananas, cut flowers, palm oil, and sugarcane. While coffee is the most prominent legal crop, coca is also grown for the illegal drug trade.  🌿🍚👃🏻 permalink parent award report block reply saltyviewer123 9 points 19 hours ago Tim Hortons might be getting expensive real soon.  Best get ready to short that stock! permalink parent award report block reply MehNahMehNah 7 points 19 hours ago Where's Hunter? permalink parent award report block reply Ghost_0f_Kiev 4 points 18 hours ago 🧐 permalink parent award report block reply\nsaltyviewer123 9 points 19 hours ago Tim Hortons might be getting expensive real soon.  Best get ready to short that stock! permalink parent award report block reply\nMehNahMehNah 7 points 19 hours ago Where's Hunter? permalink parent award report block reply\nGhost_0f_Kiev 4 points 18 hours ago 🧐 permalink parent award report block reply\nAggrieved03 4 points 19 hours ago CIA competition. permalink parent award report block reply BruddahIz 7 points 18 hours ago They are consolidating around a new formed cartel org now that they have a new head of mangement in Mexico.  All the cartels not part of this new CIA grouup will get the boat treatment via the US Military. Convienent. permalink parent award report block reply view 2 more comments... schiff_for_brains 1 points 16 hours ago More like partners. permalink parent award report block reply\nBruddahIz 7 points 18 hours ago They are consolidating around a new formed cartel org now that they have a new head of mangement in Mexico.  All the cartels not part of this new CIA grouup will get the boat treatment via the US Military. Convienent. permalink parent award report block reply view 2 more comments...\nschiff_for_brains 1 points 16 hours ago More like partners. permalink parent award report block reply\nBaldyGull 1 points 17 hours ago Depends on whether they've paid their dues. permalink parent award report block reply\nMoebius 59 points 19 hours ago I bet you a Donut we're not relying on Colombian 'Intelligence' to target their Drug shipments... permalink parent award report block reply PROCIsAsshoe 23 points 19 hours ago ikr? saw a similar headline about the British govt a few hours ago. as if we need British or Colombian intelligence for this effort.  I guess the faggots are just letting us know who they're beholden to, right? crazy to think \"I won't help you identify narcotics traffickers!\" permalink parent award report block reply Moebius 12 points 18 hours ago Because the President of Colombia is totally in the Cartels' pockets. It's not at all unprecedented.  Remember Manuel Noriega... permalink parent award report block reply covok48 1 points 8 hours ago He’s also a Coke head. permalink parent award report block reply crimsonfancy 7 points 18 hours ago The faggots are letting the traffickers know..... \"don't blame us.  We still maintain the deals we have and won't ever sell you out....just keep delivering our cut.\" permalink parent award report block reply learntocode 3 points 14 hours ago We are staging an invasion of their off shore banks - British Virgin Isles, Cayman, and Bermuda permalink parent award report block reply Jmricht 1 points 13 hours ago Do it permalink parent award report block reply view 1 more comments... SanityGumby 2 points 15 hours ago Does sound like a great opportunity to step in and topple starmer though. Without that communist faggot at the helm maybe the UK can survive permalink parent award report block reply IllKissYourBoobies 1 points 4 hours ago I bet you a Donut... High stakes for a cop. permalink parent award report block reply corntortilla 1 points 15 hours ago I decline your bet. permalink parent award report block reply\nPROCIsAsshoe 23 points 19 hours ago ikr? saw a similar headline about the British govt a few hours ago. as if we need British or Colombian intelligence for this effort.  I guess the faggots are just letting us know who they're beholden to, right? crazy to think \"I won't help you identify narcotics traffickers!\" permalink parent award report block reply Moebius 12 points 18 hours ago Because the President of Colombia is totally in the Cartels' pockets. It's not at all unprecedented.  Remember Manuel Noriega... permalink parent award report block reply covok48 1 points 8 hours ago He’s also a Coke head. permalink parent award report block reply crimsonfancy 7 points 18 hours ago The faggots are letting the traffickers know..... \"don't blame us.  We still maintain the deals we have and won't ever sell you out....just keep delivering our cut.\" permalink parent award report block reply learntocode 3 points 14 hours ago We are staging an invasion of their off shore banks - British Virgin Isles, Cayman, and Bermuda permalink parent award report block reply Jmricht 1 points 13 hours ago Do it permalink parent award report block reply view 1 more comments... SanityGumby 2 points 15 hours ago Does sound like a great opportunity to step in and topple starmer though. Without that communist faggot at the helm maybe the UK can survive permalink parent award report block reply\nMoebius 12 points 18 hours ago Because the President of Colombia is totally in the Cartels' pockets. It's not at all unprecedented.  Remember Manuel Noriega... permalink parent award report block reply covok48 1 points 8 hours ago He’s also a Coke head. permalink parent award report block reply\ncovok48 1 points 8 hours ago He’s also a Coke head. permalink parent award report block reply\ncrimsonfancy 7 points 18 hours ago The faggots are letting the traffickers know..... \"don't blame us.  We still maintain the deals we have and won't ever sell you out....just keep delivering our cut.\" permalink parent award report block reply\nlearntocode 3 points 14 hours ago We are staging an invasion of their off shore banks - British Virgin Isles, Cayman, and Bermuda permalink parent award report block reply Jmricht 1 points 13 hours ago Do it permalink parent award report block reply view 1 more comments...\nJmricht 1 points 13 hours ago Do it permalink parent award report block reply view 1 more comments...\nSanityGumby 2 points 15 hours ago Does sound like a great opportunity to step in and topple starmer though. Without that communist faggot at the helm maybe the UK can survive permalink parent award report block reply\nIllKissYourBoobies 1 points 4 hours ago I bet you a Donut... High stakes for a cop. permalink parent award report block reply\ncorntortilla 1 points 15 hours ago I decline your bet. permalink parent award report block reply\nBlackPilledMAGA 10 points 18 hours ago \"we're gonna stop telling you which boats are loaded with drugs until you stop blowing them up\" ? permalink parent award report block reply conservatarian 2 points 17 hours ago underrated comment permalink parent award report block reply\nconservatarian 2 points 17 hours ago underrated comment permalink parent award report block reply\nNoticesBugleOWO 6 points 18 hours ago Bomb more boats I hope! permalink parent award report block reply TearsAficionado 4 points 18 hours ago Add British and Columbian boats to the target list permalink parent award report block reply\nTearsAficionado 4 points 18 hours ago Add British and Columbian boats to the target list permalink parent award report block reply\ncyberrigger 1 points 12 hours ago Here's the punchline, their 'intelligence' --- is what the US is doing. permalink parent award report block reply\nSouth_Florida_Guy 143 points 19 hours ago Looks like we're just gonna have to blow up every boat leaving there now permalink award report block reply PhilipeNegro 41 points 19 hours ago Sharks bout to eat fr permalink parent award report block reply MAGALADON9 26 points 19 hours ago No cap. permalink parent award report block reply yummy_yumm_yumms 10 points 19 hours ago Username checks out permalink parent award report block reply DT170x 5 points 18 hours ago Username also checks out permalink parent award report block reply view 3 more comments... FakeNametag 17 points 19 hours ago Sharks on coke, raging out.  I wouldn't wanna be the boat guys permalink parent award report block reply 4444444444444 7 points 18 hours ago Will it be the sequel to cocaine bear? permalink parent award report block reply LurkNoMore 3 points 16 hours ago It better fucking be the sequel! Great White Powder Mayhem!  Though, I legit would looove to see what coked out dolphins would be like. permalink parent award report block reply view 2 more comments... Necrovoter 3 points 10 hours ago They're gonna need a bigger straw. permalink parent award report block reply tired-of-crap 3 points 9 hours ago Yes they better conceal that loading process a little better.  If we can read license plates from space we certainly could tell if they're loading drugs on a boat. This of course does not require Colombian intelligence. permalink parent award report block reply AnonByTheLake 3 points 19 hours ago I want my coffee! permalink parent award report block reply Informationinsider 1 points 10 hours ago We have \"Cocaine Bear\" now we need \"Cocain Sharks\". permalink parent award report block reply\nPhilipeNegro 41 points 19 hours ago Sharks bout to eat fr permalink parent award report block reply MAGALADON9 26 points 19 hours ago No cap. permalink parent award report block reply yummy_yumm_yumms 10 points 19 hours ago Username checks out permalink parent award report block reply DT170x 5 points 18 hours ago Username also checks out permalink parent award report block reply view 3 more comments... FakeNametag 17 points 19 hours ago Sharks on coke, raging out.  I wouldn't wanna be the boat guys permalink parent award report block reply 4444444444444 7 points 18 hours ago Will it be the sequel to cocaine bear? permalink parent award report block reply LurkNoMore 3 points 16 hours ago It better fucking be the sequel! Great White Powder Mayhem!  Though, I legit would looove to see what coked out dolphins would be like. permalink parent award report block reply view 2 more comments... Necrovoter 3 points 10 hours ago They're gonna need a bigger straw. permalink parent award report block reply tired-of-crap 3 points 9 hours ago Yes they better conceal that loading process a little better.  If we can read license plates from space we certainly could tell if they're loading drugs on a boat. This of course does not require Colombian intelligence. permalink parent award report block reply\nMAGALADON9 26 points 19 hours ago No cap. permalink parent award report block reply yummy_yumm_yumms 10 points 19 hours ago Username checks out permalink parent award report block reply DT170x 5 points 18 hours ago Username also checks out permalink parent award report block reply view 3 more comments...\nyummy_yumm_yumms 10 points 19 hours ago Username checks out permalink parent award report block reply DT170x 5 points 18 hours ago Username also checks out permalink parent award report block reply view 3 more comments...\nDT170x 5 points 18 hours ago Username also checks out permalink parent award report block reply view 3 more comments...\nFakeNametag 17 points 19 hours ago Sharks on coke, raging out.  I wouldn't wanna be the boat guys permalink parent award report block reply 4444444444444 7 points 18 hours ago Will it be the sequel to cocaine bear? permalink parent award report block reply LurkNoMore 3 points 16 hours ago It better fucking be the sequel! Great White Powder Mayhem!  Though, I legit would looove to see what coked out dolphins would be like. permalink parent award report block reply view 2 more comments... Necrovoter 3 points 10 hours ago They're gonna need a bigger straw. permalink parent award report block reply tired-of-crap 3 points 9 hours ago Yes they better conceal that loading process a little better.  If we can read license plates from space we certainly could tell if they're loading drugs on a boat. This of course does not require Colombian intelligence. permalink parent award report block reply\n4444444444444 7 points 18 hours ago Will it be the sequel to cocaine bear? permalink parent award report block reply LurkNoMore 3 points 16 hours ago It better fucking be the sequel! Great White Powder Mayhem!  Though, I legit would looove to see what coked out dolphins would be like. permalink parent award report block reply view 2 more comments...\nLurkNoMore 3 points 16 hours ago It better fucking be the sequel! Great White Powder Mayhem!  Though, I legit would looove to see what coked out dolphins would be like. permalink parent award report block reply view 2 more comments...\nNecrovoter 3 points 10 hours ago They're gonna need a bigger straw. permalink parent award report block reply\ntired-of-crap 3 points 9 hours ago Yes they better conceal that loading process a little better.  If we can read license plates from space we certainly could tell if they're loading drugs on a boat. This of course does not require Colombian intelligence. permalink parent award report block reply\nAnonByTheLake 3 points 19 hours ago I want my coffee! permalink parent award report block reply\nInformationinsider 1 points 10 hours ago We have \"Cocaine Bear\" now we need \"Cocain Sharks\". permalink parent award report block reply\nDingleBalls 55 points 19 hours ago No. permalink award report block reply DeportThemAllForever 42 points 19 hours ago We were sharing intelligence with Columbia?  wtf, are the only people we don’t share with is American public?  Rest of the world already knows everything apparently. permalink parent award report block reply justicein2020 7 points 15 hours ago Thats how mcafee found out everything. made himself a player. he gave 3rd world countries computers with his software.. we share with the 3rd world. their security is a joke.  so yes! americans are the only ones clueless in the loop. permalink parent award report block reply Leporidae 3 points 10 hours ago That man was a true legend. permalink parent award report block reply SanityGumby -1 points 15 hours ago I see you are retarded and don’t comprehend how governments function permalink parent award report block reply ShlomoJoe 1 points 19 hours ago Time for strategic air strikes on Columbia now. permalink parent award report block reply StankoniusMaximus -6 points 19 hours ago Oh fck right off war machine permalink parent award report block reply Run_over_Antifa 5 points 19 hours ago Stopping whats killing us is not a war machine permalink parent award report block reply\nDeportThemAllForever 42 points 19 hours ago We were sharing intelligence with Columbia?  wtf, are the only people we don’t share with is American public?  Rest of the world already knows everything apparently. permalink parent award report block reply justicein2020 7 points 15 hours ago Thats how mcafee found out everything. made himself a player. he gave 3rd world countries computers with his software.. we share with the 3rd world. their security is a joke.  so yes! americans are the only ones clueless in the loop. permalink parent award report block reply Leporidae 3 points 10 hours ago That man was a true legend. permalink parent award report block reply SanityGumby -1 points 15 hours ago I see you are retarded and don’t comprehend how governments function permalink parent award report block reply\njusticein2020 7 points 15 hours ago Thats how mcafee found out everything. made himself a player. he gave 3rd world countries computers with his software.. we share with the 3rd world. their security is a joke.  so yes! americans are the only ones clueless in the loop. permalink parent award report block reply Leporidae 3 points 10 hours ago That man was a true legend. permalink parent award report block reply\nLeporidae 3 points 10 hours ago That man was a true legend. permalink parent award report block reply\nSanityGumby -1 points 15 hours ago I see you are retarded and don’t comprehend how governments function permalink parent award report block reply\nShlomoJoe 1 points 19 hours ago Time for strategic air strikes on Columbia now. permalink parent award report block reply StankoniusMaximus -6 points 19 hours ago Oh fck right off war machine permalink parent award report block reply Run_over_Antifa 5 points 19 hours ago Stopping whats killing us is not a war machine permalink parent award report block reply\nStankoniusMaximus -6 points 19 hours ago Oh fck right off war machine permalink parent award report block reply Run_over_Antifa 5 points 19 hours ago Stopping whats killing us is not a war machine permalink parent award report block reply\nRun_over_Antifa 5 points 19 hours ago Stopping whats killing us is not a war machine permalink parent award report block reply\nRuprechtThaMonkeyBoy 44 points 19 hours ago We’ve seen what migrates here, so we’re cool with y’all not sharing your intelligence. permalink award report block reply Formerlurker92 24 points 19 hours ago Or your people. Total immigration, visa, and visitor moratorium from that country permalink parent award report block reply Buce-Nudo 3 points 17 hours ago Stop all foreign aid right away. permalink parent award report block reply\nFormerlurker92 24 points 19 hours ago Or your people. Total immigration, visa, and visitor moratorium from that country permalink parent award report block reply\nBuce-Nudo 3 points 17 hours ago Stop all foreign aid right away. permalink parent award report block reply\nDelendaEstMarxismo 41 points 19 hours ago Sounds like he's mad that some of those drugs being destroyed are Columbian product. permalink award report block reply\nBythrfruitsyknow 33 points 19 hours ago lol I am so sure we were relying on intelligence from Columbia and the United Kingdom. permalink award report block reply SanityGumby 4 points 15 hours ago Out of the two the UK is the only one with possible intelligence that would matter. Columbia is in bed with the cartels so nothing they say would be handy. Meanwhile the UK still owns several Caribbean islands permalink parent award report block reply FartherRight 1 points 11 hours ago The UK has nothing useful and we should cut them out of five eyes. permalink parent award report block reply\nSanityGumby 4 points 15 hours ago Out of the two the UK is the only one with possible intelligence that would matter. Columbia is in bed with the cartels so nothing they say would be handy. Meanwhile the UK still owns several Caribbean islands permalink parent award report block reply FartherRight 1 points 11 hours ago The UK has nothing useful and we should cut them out of five eyes. permalink parent award report block reply\nFartherRight 1 points 11 hours ago The UK has nothing useful and we should cut them out of five eyes. permalink parent award report block reply\nVorticity1 25 points 19 hours ago Trump stops all aid to Colombia and blows up a distribution center. permalink award report block reply\nvongregormench 24 points 19 hours ago Colombia is run by a Marxist. Fuck them. permalink award report block reply PiratePatriotParrot OP 4 points 19 hours ago https://www.youtube.com/watch?v=WmaVNKlU6d8 permalink parent award report block reply\nPiratePatriotParrot OP 4 points 19 hours ago https://www.youtube.com/watch?v=WmaVNKlU6d8 permalink parent award report block reply\nPhantomShield72 23 points 19 hours ago First the UK, now Columbia. Apparently a new \"axis of evil\" is revealing itself... permalink award report block reply Trumportellagain 11 points 18 hours ago Shithole countries. The United Caliphate has fallen to Islam unless Tommy Robinson forcibly removes them. permalink parent award report block reply FartherRight 2 points 11 hours ago Tommy is controlled opposition and will redirect your anger into parades and your money into Israel while the UK dies. permalink parent award report block reply\nTrumportellagain 11 points 18 hours ago Shithole countries. The United Caliphate has fallen to Islam unless Tommy Robinson forcibly removes them. permalink parent award report block reply FartherRight 2 points 11 hours ago Tommy is controlled opposition and will redirect your anger into parades and your money into Israel while the UK dies. permalink parent award report block reply\nFartherRight 2 points 11 hours ago Tommy is controlled opposition and will redirect your anger into parades and your money into Israel while the UK dies. permalink parent award report block reply\nSupFrens 15 points 19 hours ago Awwww, is Colombia's GDP falling because they can't illegally import their drugs? GOOD. permalink award report block reply\nf_bastiat 12 points 19 hours ago As much as I hate the NSA, the US doesn't need intelligence from anyone, we already have everything that ever existed and are set up to receive everything that hasn't come to be yet. permalink award report block reply The_Bloofy_Bullshark 3 points 14 hours ago NSA is only a small piece to the puzzle too. The US has a good number of spooky units, and most folks barely know they exist. The ISA (The Activity) is JSOC’s covert brain and muscle, running live HUMINT, SIGINT, and targeting for the shooters. INSCOM runs field signals and human intel, often buried deep with JSOC teams. DIA’s Defense Clandestine Service is the Pentagon’s own network of spies working long-term sources in denied zones. ONI’s deep ops teams handle undersea and maritime reconnaissance that never makes the news. The Air Force’s 24th SOW and 17th STS tie ISR and precision targeting directly into special ops. MARSOC’s tech teams manage digital recon and exploitation for Raider missions. Cyber Command and NSA’s hunt teams do the dirty work in the digital battlespace, finding, breaking, and weaponizing access. Together they form the quiet layer between SOF and the three-letter agencies, the ones who see everything before the lights go out. I’ve seen a number of these guys in action and it’s something else entirely. Pure competence of the highest order. The ISA is in its own class. Every major nation has its own “shadow service” for technical reconnaissance and covert HUMINT, but the Activity sits in a category that most allies don’t even attempt to replicate. Basically we have eyes, ears, and then some all over the globe at all times. permalink parent award report block reply BreakingCNN 2 points 19 hours ago Well that explains the WMDs in Iraq.\nFyi: the most surprised person to find out that Iraq did not have WMDs was Saddam Hussein. permalink parent award report block reply PhantomShield72 12 points 19 hours ago You're confusing the concepts of an intelligence failure and a disinformation op utilized as Casus Belli. permalink parent award report block reply PROCIsAsshoe 4 points 18 hours ago seriously, it's such an easy situation to parse out: Saddam would've known that his regime was doomed in the early hours of a ground invasion. Why wouldn't he have just used a WMD against our invasion forces out in the desert as we began the campaign? He had nothing left to lose and, generally, the entire motivation for possessing WMD's is that it precludes the ability for an enemy force to conduct a ground invasion of your country. He didn't ever have them, like you've said! permalink parent award report block reply FatigueIsReal 3 points 17 hours ago I'll never buy that Iraq didn't have WMDs or the capability of making them simply based on their actions for over a decade. I'm not sure how anti-government you have to be to watch a country obstruct nuclear capability inspections dozens of times over 10+ years and then when you finally invade with tons of warning, posturing and time ahead of it, and believe that they suddenly don't have any WMD capabilities. Agreeing with the invasion is separate.  That was a terrible mistake.  Iraq should have been handled like Trump handled Syria and Iran. permalink parent award report block reply BreakingCNN 3 points 19 hours ago No, it was not a disinformation op.\nRemember what happened to the Iraqi soccer coach who lost? The heads of the Iraqi N, B, and C we're all sending reports to Saddam telling him what great progress they were making. These reports were intercepted by Echelon.  Additionally, as they already had these reports drafted they went ahead and sold them to the Mossad for a sizable chunk of change. And finally the US was picking up some of the chatter which was then confirmed by the British and the Israelis. Plus, just cause, oh wait I think that was Grenada or something, never mind permalink parent award report block reply learntocode 1 points 14 hours ago Except for Our Greatest Ally. Cannot touch them. permalink parent award report block reply SimaYi 0 points 13 hours ago We get everything from Israel. permalink parent award report block reply f_bastiat 1 points 8 hours ago You are mistaken, Israel gets everything from us and gives back what's needed when using the information in an investigation presents a rights violation if we are the source. Israel is essentially a government agency that does nothing without us, it's quite comical how deep people go on here with the IsRaEl CoNtRoLs EvErYtHiNg. They are a population smaller than some of our smaller states, surrounded by blood thirsty mudslimes, and their land is essentially useless other than as the American base it is. permalink parent award report block reply\nThe_Bloofy_Bullshark 3 points 14 hours ago NSA is only a small piece to the puzzle too. The US has a good number of spooky units, and most folks barely know they exist. The ISA (The Activity) is JSOC’s covert brain and muscle, running live HUMINT, SIGINT, and targeting for the shooters. INSCOM runs field signals and human intel, often buried deep with JSOC teams. DIA’s Defense Clandestine Service is the Pentagon’s own network of spies working long-term sources in denied zones. ONI’s deep ops teams handle undersea and maritime reconnaissance that never makes the news. The Air Force’s 24th SOW and 17th STS tie ISR and precision targeting directly into special ops. MARSOC’s tech teams manage digital recon and exploitation for Raider missions. Cyber Command and NSA’s hunt teams do the dirty work in the digital battlespace, finding, breaking, and weaponizing access. Together they form the quiet layer between SOF and the three-letter agencies, the ones who see everything before the lights go out. I’ve seen a number of these guys in action and it’s something else entirely. Pure competence of the highest order. The ISA is in its own class. Every major nation has its own “shadow service” for technical reconnaissance and covert HUMINT, but the Activity sits in a category that most allies don’t even attempt to replicate. Basically we have eyes, ears, and then some all over the globe at all times. permalink parent award report block reply\nBreakingCNN 2 points 19 hours ago Well that explains the WMDs in Iraq.\nFyi: the most surprised person to find out that Iraq did not have WMDs was Saddam Hussein. permalink parent award report block reply PhantomShield72 12 points 19 hours ago You're confusing the concepts of an intelligence failure and a disinformation op utilized as Casus Belli. permalink parent award report block reply PROCIsAsshoe 4 points 18 hours ago seriously, it's such an easy situation to parse out: Saddam would've known that his regime was doomed in the early hours of a ground invasion. Why wouldn't he have just used a WMD against our invasion forces out in the desert as we began the campaign? He had nothing left to lose and, generally, the entire motivation for possessing WMD's is that it precludes the ability for an enemy force to conduct a ground invasion of your country. He didn't ever have them, like you've said! permalink parent award report block reply FatigueIsReal 3 points 17 hours ago I'll never buy that Iraq didn't have WMDs or the capability of making them simply based on their actions for over a decade. I'm not sure how anti-government you have to be to watch a country obstruct nuclear capability inspections dozens of times over 10+ years and then when you finally invade with tons of warning, posturing and time ahead of it, and believe that they suddenly don't have any WMD capabilities. Agreeing with the invasion is separate.  That was a terrible mistake.  Iraq should have been handled like Trump handled Syria and Iran. permalink parent award report block reply BreakingCNN 3 points 19 hours ago No, it was not a disinformation op.\nRemember what happened to the Iraqi soccer coach who lost? The heads of the Iraqi N, B, and C we're all sending reports to Saddam telling him what great progress they were making. These reports were intercepted by Echelon.  Additionally, as they already had these reports drafted they went ahead and sold them to the Mossad for a sizable chunk of change. And finally the US was picking up some of the chatter which was then confirmed by the British and the Israelis. Plus, just cause, oh wait I think that was Grenada or something, never mind permalink parent award report block reply\nPhantomShield72 12 points 19 hours ago You're confusing the concepts of an intelligence failure and a disinformation op utilized as Casus Belli. permalink parent award report block reply PROCIsAsshoe 4 points 18 hours ago seriously, it's such an easy situation to parse out: Saddam would've known that his regime was doomed in the early hours of a ground invasion. Why wouldn't he have just used a WMD against our invasion forces out in the desert as we began the campaign? He had nothing left to lose and, generally, the entire motivation for possessing WMD's is that it precludes the ability for an enemy force to conduct a ground invasion of your country. He didn't ever have them, like you've said! permalink parent award report block reply FatigueIsReal 3 points 17 hours ago I'll never buy that Iraq didn't have WMDs or the capability of making them simply based on their actions for over a decade. I'm not sure how anti-government you have to be to watch a country obstruct nuclear capability inspections dozens of times over 10+ years and then when you finally invade with tons of warning, posturing and time ahead of it, and believe that they suddenly don't have any WMD capabilities. Agreeing with the invasion is separate.  That was a terrible mistake.  Iraq should have been handled like Trump handled Syria and Iran. permalink parent award report block reply BreakingCNN 3 points 19 hours ago No, it was not a disinformation op.\nRemember what happened to the Iraqi soccer coach who lost? The heads of the Iraqi N, B, and C we're all sending reports to Saddam telling him what great progress they were making. These reports were intercepted by Echelon.  Additionally, as they already had these reports drafted they went ahead and sold them to the Mossad for a sizable chunk of change. And finally the US was picking up some of the chatter which was then confirmed by the British and the Israelis. Plus, just cause, oh wait I think that was Grenada or something, never mind permalink parent award report block reply\nPROCIsAsshoe 4 points 18 hours ago seriously, it's such an easy situation to parse out: Saddam would've known that his regime was doomed in the early hours of a ground invasion. Why wouldn't he have just used a WMD against our invasion forces out in the desert as we began the campaign? He had nothing left to lose and, generally, the entire motivation for possessing WMD's is that it precludes the ability for an enemy force to conduct a ground invasion of your country. He didn't ever have them, like you've said! permalink parent award report block reply FatigueIsReal 3 points 17 hours ago I'll never buy that Iraq didn't have WMDs or the capability of making them simply based on their actions for over a decade. I'm not sure how anti-government you have to be to watch a country obstruct nuclear capability inspections dozens of times over 10+ years and then when you finally invade with tons of warning, posturing and time ahead of it, and believe that they suddenly don't have any WMD capabilities. Agreeing with the invasion is separate.  That was a terrible mistake.  Iraq should have been handled like Trump handled Syria and Iran. permalink parent award report block reply\nFatigueIsReal 3 points 17 hours ago I'll never buy that Iraq didn't have WMDs or the capability of making them simply based on their actions for over a decade. I'm not sure how anti-government you have to be to watch a country obstruct nuclear capability inspections dozens of times over 10+ years and then when you finally invade with tons of warning, posturing and time ahead of it, and believe that they suddenly don't have any WMD capabilities. Agreeing with the invasion is separate.  That was a terrible mistake.  Iraq should have been handled like Trump handled Syria and Iran. permalink parent award report block reply\nBreakingCNN 3 points 19 hours ago No, it was not a disinformation op.\nRemember what happened to the Iraqi soccer coach who lost? The heads of the Iraqi N, B, and C we're all sending reports to Saddam telling him what great progress they were making. These reports were intercepted by Echelon.  Additionally, as they already had these reports drafted they went ahead and sold them to the Mossad for a sizable chunk of change. And finally the US was picking up some of the chatter which was then confirmed by the British and the Israelis. Plus, just cause, oh wait I think that was Grenada or something, never mind permalink parent award report block reply\nlearntocode 1 points 14 hours ago Except for Our Greatest Ally. Cannot touch them. permalink parent award report block reply\nSimaYi 0 points 13 hours ago We get everything from Israel. permalink parent award report block reply f_bastiat 1 points 8 hours ago You are mistaken, Israel gets everything from us and gives back what's needed when using the information in an investigation presents a rights violation if we are the source. Israel is essentially a government agency that does nothing without us, it's quite comical how deep people go on here with the IsRaEl CoNtRoLs EvErYtHiNg. They are a population smaller than some of our smaller states, surrounded by blood thirsty mudslimes, and their land is essentially useless other than as the American base it is. permalink parent award report block reply\nf_bastiat 1 points 8 hours ago You are mistaken, Israel gets everything from us and gives back what's needed when using the information in an investigation presents a rights violation if we are the source. Israel is essentially a government agency that does nothing without us, it's quite comical how deep people go on here with the IsRaEl CoNtRoLs EvErYtHiNg. They are a population smaller than some of our smaller states, surrounded by blood thirsty mudslimes, and their land is essentially useless other than as the American base it is. permalink parent award report block reply\nCoprolite 11 points 19 hours ago So anyway I blew up another one. permalink award report block reply mty_green_go 4 points 12 hours ago So anyway we started blasting permalink parent award report block reply\nmty_green_go 4 points 12 hours ago So anyway we started blasting permalink parent award report block reply\nRichardCranium88 9 points 17 hours ago That's a laugh. as if the Colombia president isn't complicit in drug trafficking. permalink award report block reply\nBeelzy 8 points 19 hours ago Shit, we know what they eat for dinner before they head out. Suck a bag of dicks, Columbia. permalink award report block reply\nHanging_Chad 8 points 19 hours ago fair, next permalink award report block reply\nBeat_to_Quarters 7 points 19 hours ago I guess they weren't sharing \"intelligence\" about the boats with us already. permalink award report block reply\nSkywise 7 points 19 hours ago Tell me you're complicit in the drug trade without telling me you're complicit in the drug trade permalink award report block reply\nThe_Bloofy_Bullshark 6 points 19 hours ago Between CIA, DIA, NSA, NGA, NRO, and the ISA as well as DEA assets, I think we will be ok. permalink award report block reply\nAmerican-Patriot 6 points 19 hours ago Looks like we gotta bomb more boats into submission permalink award report block reply BreakingCNN 8 points 19 hours ago I believe it's now referred to as the:\nTerrific Tariff on Terror permalink parent award report block reply\nBreakingCNN 8 points 19 hours ago I believe it's now referred to as the:\nTerrific Tariff on Terror permalink parent award report block reply\nLigersrule1 5 points 19 hours ago Your terms are acceptable permalink award report block reply\ncryptoapebot 5 points 19 hours ago they about to get spanked. permalink award report block reply\nRogueLeaderX 5 points 19 hours ago What intelligence wont they be sharing? How theyre screwing us behind our back? permalink award report block reply\nYawnz13 5 points 19 hours ago https://www.reuters.com/world/americas/colombia-president-orders-suspension-intelligence-sharing-with-us-2025-11-12/ https://x.com/petrogustavo/status/1988393441999593891 Unlike the post about the UK, this actually comes from someone in the Colombian government. permalink award report block reply\nMajorClark 5 points 19 hours ago The UN doesn't like the USA bombing their drug smugglers.  King Charles bowed to the UN & the UK will no longer share their knowledge of drug smugglers. permalink award report block reply\nI_Love_45-70_Gov 5 points 19 hours ago Columbia sharing intelligence with the U.S. is like a dog sharing its shit with its master. permalink award report block reply\nCounterwhat 5 points 19 hours ago Stop sending money. We send a lot of money and equipment. We can take on the cartels ourselves and we will win. permalink award report block reply\nRedCalifornia 5 points 19 hours ago Oh no! Sounds like time to cut foreign aid permalink award report block reply\nGabeC1997 4 points 19 hours ago Just blow up anything that doesn’t have a transponder, problem solved. permalink award report block reply\nancroidubh 4 points 9 hours ago <snort> Intelligence sharing with Columbia… <snort>. I’m certain that any product from that failed narco-terrorist State is chock full of lies and disinformation. permalink award report block reply\nTrump4Infinity 4 points 19 hours ago Flak over the target. Something other than drugs and humans are being smuggled. At this point those things are cover. permalink award report block reply\nNerdrem3 4 points 19 hours ago Uh... I'd imagine most of the intelligence \"sharing\" is us giving them information. Probably costs us money so stopping it sounds like good news to me. permalink award report block reply\n4886Battery 4 points 19 hours ago Damn, how will we get their fake intelligence reports now?   We're cooked. permalink award report block reply\nBadfinz_FL 4 points 10 hours ago Yeah, no permalink award report block reply\nIlhanOmarsFagBrother 4 points 19 hours ago OK terms are acceptable permalink award report block reply\nLogan051361 4 points 19 hours ago bomb his house permalink award report block reply\nDewormed_Patriot 4 points 17 hours ago Lack of Colombian intelligence.  Is that like a double negative? Tell me you're a failed narco state without telling me you are a failed narco state. permalink award report block reply\ndres3 4 points 19 hours ago Colombia confirms that they were in on the smuggling. permalink award report block reply\nSimaYi 4 points 13 hours ago Can we get proper syntax from a news organization? Thanks. Columbia president? It's either Colombian president or The president of Columbia. permalink award report block reply\nyodayoda 4 points 17 hours ago why is this BREAKING? permalink award report block reply\nCh3f4554551n 4 points 12 hours ago BREAKING: REUTERS and \"Colombian Intelligence\" are just both branches of the CIA. permalink award report block reply\nColonelKlink 4 points 19 hours ago Keep getting rid of cartels and drug boats. This means anything  they tell you from now on, could be false. permalink award report block reply\nInternet_hugs 3 points 19 hours ago Oh no, you mean we're going to lose tin cans with string and hollow tree trunk and sticks? Just tragic. permalink award report block reply\nXahnel 3 points 18 hours ago Weird that a country that totally isn't run by drug cartels would defend the drug cartels... permalink award report block reply\ncbonez416 3 points 19 hours ago Lol what? What fucking losers. permalink award report block reply\nOG_BACONndEGGs 3 points 19 hours ago Colombians are not intelligent. permalink award report block reply\n_Sully_ 3 points 19 hours ago I think the order of these announcements will be very curious. permalink award report block reply\nChoppermagic 3 points 16 hours ago bomb a few colombian military boats then...ooopsie, you didn't tell us. permalink award report block reply SanityGumby 1 points 15 hours ago They have like 5 permalink parent award report block reply SicSemperTyrannis2 1 points 15 hours ago Bomb 6 just to be sure. permalink parent award report block reply\nSanityGumby 1 points 15 hours ago They have like 5 permalink parent award report block reply SicSemperTyrannis2 1 points 15 hours ago Bomb 6 just to be sure. permalink parent award report block reply\nSicSemperTyrannis2 1 points 15 hours ago Bomb 6 just to be sure. permalink parent award report block reply\nknnbccb 3 points 18 hours ago LOL, the death throes of a dying regime. Please also take out Venezuela. China will throw a hissy fit because its launchpad for initiating a 'revenge' drug war against America will be gone, and also a source of cheap oil. Why did you think Maduro and a bunch of socialist cretins had this Zoom meeting with Xi Jinping some years ago? https://patriots.win/p/1ARJd11QpD/this-is-a-partial-list-of-americ/c Take special note of leaders from South Africa and Serbia in the photo, they will be next after Venezuela. The others from central Asia and other third world countries, they can be ignored. permalink award report block reply\nLawyersPlayDota 3 points 18 hours ago Cool, cut their funding. permalink award report block reply\nPhantomShield72 3 points 19 hours ago \"Allow the drug and human smuggling or we won't provide you with information...\" permalink award report block reply\nHikedelics 3 points 19 hours ago Oh darn… Everyone knows how heavily we rely on Columbia for our intelligence gathering. permalink award report block reply\nTacitus1963 3 points 13 hours ago Gustavo Petro, like Claudia Sheinbaum, Senator Gallegos (AZ) et al clearly all work for the cartels.\nNo more of our taxpayer $s should be going to either Columbia or Mexico. permalink award report block reply\nguypatriot 3 points 14 hours ago How about we just blow up all known cartel locations. permalink award report block reply\nDEPORT50M 3 points 13 hours ago When the turd countries try to flex it's funny. Bitch, shut up and make the ________ thing we let you make as part of the global supply chain. permalink award report block reply\nPraetor_Sean 3 points 18 hours ago So they are admitting that the drug boats are Colombian government property? permalink award report block reply\nR3tro 3 points 16 hours ago Columbia is to intelligence as temu is to quality…. LOL permalink award report block reply\nh203h 3 points 18 hours ago Colombia is fake and gay!\nThank you for your attention to this matter! permalink award report block reply\nhenri_derelicte 3 points 18 hours ago Maybe Colombia needs some “new management” alongside Venezuela permalink award report block reply\njohn9985 3 points 19 hours ago 😂😂 .. cut off all bullshit funding! permalink award report block reply BreakingCNN 1 points 19 hours ago Not quite  I think Eli Lilly hit a new all time high today. permalink parent award report block reply\nBreakingCNN 1 points 19 hours ago Not quite  I think Eli Lilly hit a new all time high today. permalink parent award report block reply\ndjentropyhardcore 3 points 18 hours ago Who runs Real Time Alerts on telegram, and why is it posted here verbatim? permalink award report block reply\nMAGALADON9 3 points 19 hours ago Lol get fucked drug dealers permalink award report block reply\nEJay_Scott 3 points 19 hours ago Bomb Columbia. Problem solved. permalink award report block reply\nArobb 3 points 17 hours ago All this tells me is that our strikes are starting to have an impact. permalink award report block reply\nMJPalazzolo 3 points 14 hours ago Colombia, a cesspool of cartel activity and corruption. Intelligence sharing...Right. How much of the \"sharing\" was false information contrived to confuse, divert, and distract the DEA from enforcing United States law. permalink award report block reply\nRock9Head 2 points 18 hours ago Gotta have intelligence to share it. permalink award report block reply\nJmricht 2 points 19 hours ago A-4  B-3 permalink award report block reply\nbarwhack 2 points 18 hours ago More boats to sink. permalink award report block reply\nBobDolesBanana 2 points 17 hours ago LOL!  This is a Deep State cover story! 😂 permalink award report block reply\nbrewser724 2 points 15 hours ago Columbia is far from intelligent, so they should try to keep some of it. permalink award report block reply\nTwoArizonaPedes 2 points 18 hours ago Oh no. Anyway... permalink award report block reply\nAmerica_No_1 2 points 18 hours ago Weird how all the countries are suddenly upset about drug money being cut off.  Hmmmm permalink award report block reply\nTestamernt 2 points 16 hours ago What an odd stance to take. permalink award report block reply\nMichalusmichalus 2 points 9 hours ago I don't drink coffee, I don't do cocaine. I guess I don't need Columbia. A country named after a Goddess. permalink award report block reply\nraptormissle 2 points 14 hours ago Columbia has intelligence? permalink award report block reply\nUNfreeNewZealand 2 points 13 hours ago …….and? permalink award report block reply\nnjb425 2 points 18 hours ago That means start bombing Columbia’s ports permalink award report block reply\nMadRussian 2 points 17 hours ago Then just blow anything up that looks funny permalink award report block reply\ntholinz 2 points 19 hours ago Okay bye bye lol permalink award report block reply\nBOHICA2021 2 points 19 hours ago WE DON'T NEED NO STINKING PERMISSION... permalink award report block reply\nGoatboy66 2 points 18 hours ago Obviously the Columbian President is bring paid by the Drug Dealers. Just like all the other Presidents here and around the world who haven't been blowning up the Drug Dealers like President Trump has.🤔 permalink award report block reply\nHoganP 2 points 12 hours ago In a sense, the South American version of a tariff? permalink award report block reply\npresticus 2 points 17 hours ago Sounds like an admission that the Colombian government is working with the cartels. permalink award report block reply\nSavingPrivateGrace 2 points 19 hours ago FAFO permalink award report block reply\nMOLON-LABE 2 points 18 hours ago Breaking.... fuck you bitchachos! permalink award report block reply\nBaldyGull 2 points 17 hours ago Siding with Narcos? Way to dodge those stereotypes. permalink award report block reply\nshadily0524 2 points 16 hours ago Intel sharing with Columbia! 😂😂😂😂😂😂😂 permalink award report block reply\ngeekesmind 2 points 18 hours ago they can FUCK OFF permalink award report block reply\nLightBeacons 2 points 19 hours ago who knew? As the French put it, C'est La Vie!! Does the idiot really think the US is gonna stop??? permalink award report block reply\nThereyago 2 points 15 hours ago Isn't this the guy that went to a rally after the UN and called for american troops to disobey lawful orders from thier commanding officer? permalink award report block reply\nmacocontentfarmer 2 points 18 hours ago Can we please stop funding the rest of the world? Especially since they hate us despite draining the life force of every taxpayer to their benefit. permalink award report block reply\nAmericanForever 2 points 18 hours ago Tariff Colombia harder and get their illegals back to them permalink award report block reply\nRizzlieDoodad 2 points 18 hours ago Like it even matters. We have satellites permalink award report block reply\nthechill 2 points 8 hours ago No. permalink award report block reply\nentERmyMAtrix 2 points 17 hours ago That’s a weird thing to do. permalink award report block reply\nBeanieRed 2 points 18 hours ago Even governments virtual signal.  UK, now Columbia…how will we survive! permalink award report block reply\nEurpoean 2 points 7 hours ago lmao permalink award report block reply\nOodles 2 points 18 hours ago Your terms are acceptable permalink award report block reply\ndeleted 1 points 16 hours ago Ryker 1 points 16 hours ago I should probably at least read the title before I comment.. lol permalink parent award report block reply\nRyker 1 points 16 hours ago I should probably at least read the title before I comment.. lol permalink parent award report block reply\nPhilipeNegro 1 points 19 hours ago Press “N” for “I don’t care” permalink award report block reply\nDesensitized 1 points 18 hours ago \"Wait, we can do that?\" permalink award report block reply\nMocksFordComma 1 points 18 hours ago https://www.youtube.com/watch?v=yhK6dPj-O-c permalink award report block reply\nTearsAficionado 1 points 18 hours ago Willie Wonka: ...no, stop, don't ... permalink award report block reply\nHeavenlyTrumpets 1 points 19 hours ago Drug boats? permalink award report block reply\nMhmm2MoreWeeks 1 points 17 hours ago Lets conquer all of the Americas by Force. Canada to Argentina. Or Just put Tomahawks on the homes of the Cartel Bosses until they get the message. permalink award report block reply\nPapabravo12 1 points 18 hours ago Haha permalink award report block reply\nRedPillosopher1776 1 points 17 hours ago What is the point of the intelligence if not to stop the problem. permalink award report block reply\ncorntortilla 1 points 15 hours ago Their president appears to be one dumb motherfucker. Someone might want to sit his ass down and give him a brief history lesson. Maybe remind him that, without our help,  he could become the next Ingrid betancourt. permalink award report block reply\nKiekhaeferSoldier 1 points 6 hours ago \"Columbian Intelligence\"...  fire the meme cannon! permalink award report block reply\nPlutossextape1 1 points 3 hours ago Alternative headline - Drug cartel opposes product being destroyed permalink award report block reply\nElectionMeddler 1 points 14 hours ago Were they even sharing anything in the first place? permalink award report block reply\nlearntocode 1 points 14 hours ago Chu bettah not bam my dam moaney laundry bancos Trahmp!! permalink award report block reply\nlearntocode 1 points 14 hours ago Bomb their off shore banks into oblivion. permalink award report block reply\nProtonicK 1 points 18 hours ago Oh no! Ok, we promise to stop! permalink award report block reply\nR3tro 1 points 7 hours ago The funny thing here, is that Columbia’s intel, is probably our intel, that they probably just share back to us…. permalink award report block reply\nSaltyminer11 1 points 19 hours ago Over the target. permalink award report block reply\nwarlord30 1 points 16 hours ago 🤷‍♂️ permalink award report block reply\nMAGAnificent700 1 points 18 hours ago Boo hoo permalink award report block reply\nfriedchicken 1 points 18 hours ago I hate intelligence agencies.  Do the shit the old fashioned way. permalink award report block reply\nbehemoth887 1 points 18 hours ago lol these responses are retarded. \"stop attacking our illegal drug dealers! i mean....oh shit!!!\" permalink award report block reply\nsuckmycorona 1 points 18 hours ago Why are we sharing intelligence in the first place permalink award report block reply\nFormerlurker92 1 points 19 hours ago The nsa has a data center the size of an Amazon warehouse and when Snowden blew the whistle they were already spying on half of Americans and half a billion worldwide. I'm sure its worse now,  so why not use it permalink award report block reply ThorsonTT 3 points 19 hours ago I'm pretty sure they were mostly spying on Americans.  They probably still are.  Including everything on TheDonald. permalink parent award report block reply KernalMustard 2 points 19 hours ago Hi NSA ✋ permalink parent award report block reply\nThorsonTT 3 points 19 hours ago I'm pretty sure they were mostly spying on Americans.  They probably still are.  Including everything on TheDonald. permalink parent award report block reply KernalMustard 2 points 19 hours ago Hi NSA ✋ permalink parent award report block reply\nKernalMustard 2 points 19 hours ago Hi NSA ✋ permalink parent award report block reply\nturdinthepunch 1 points 19 hours ago how original permalink award report block reply\nGreenhills 1 points 19 hours ago Ok, we’ll get everything from Russia. permalink award report block reply\nsuckmycorona 1 points 18 hours ago BRAAKING permalink award report block reply\nTheArchAngel 0 points 18 hours ago Israel and the Mossad can do the funniest thing right now. permalink award report block reply\ntuaris -2 points 18 hours ago Colombia no longer interested in being the USA's bitch?   Yes. Petro has been the only Colombian president with balls to stand up and stop sucking the USA's dick. permalink award report block reply\nflashersenpai -2 points 19 hours ago Good. Allegedly Hegseth and Rubio were telling congress they weren't going to attack land targets and didn't have a legal justification to do so anyway. Starting a taco war didn't work for Bush and it wont work for Trump either. Foreign wars wont fix domestic misery. permalink award report block reply\nnew_guy2 1 points 19 hours ago Comment removed by community moderators. permalink award report block reply\nSCHULTZ 1 points 19 hours ago Comment removed by community moderators. permalink award report block reply"}