{"id": "1ARK9nPdOZ", "contents": "6 If Trump Derangement Syndrome means Liberals/progressives/retards will be opposed to every Trump action, maybe he SHOULD be in favor of H1b for a bit? posted 5 hours ago by MidnightDriver 6 comments award share download report block\n6 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style darkmodeforgotpass 5 points 5 hours ago now this is some RETARDED cope. permalink award report block reply Nezmith 1 points 5 hours ago Quick, drink poison so our enemies might decide not to drink poison! permalink award report block reply Ostia 1 points 4 hours ago They never say a word when it's what they want to happen. permalink award report block reply Warp9 1 points 3 hours ago Could be the case.  He does this a lot.  Usually he has a dual purpose to anything he proposes.  I cant see the play on this one though. permalink award report block reply MidnightDriver OP 0 points 5 hours ago Just trying to figure out the play.  I agree do not want. permalink award report block reply Ostia 1 points 4 hours ago Uhh... Do the? Right thing? permalink parent award report block reply\ndarkmodeforgotpass 5 points 5 hours ago now this is some RETARDED cope. permalink award report block reply\nNezmith 1 points 5 hours ago Quick, drink poison so our enemies might decide not to drink poison! permalink award report block reply\nOstia 1 points 4 hours ago They never say a word when it's what they want to happen. permalink award report block reply\nWarp9 1 points 3 hours ago Could be the case.  He does this a lot.  Usually he has a dual purpose to anything he proposes.  I cant see the play on this one though. permalink award report block reply\nMidnightDriver OP 0 points 5 hours ago Just trying to figure out the play.  I agree do not want. permalink award report block reply Ostia 1 points 4 hours ago Uhh... Do the? Right thing? permalink parent award report block reply\nOstia 1 points 4 hours ago Uhh... Do the? Right thing? permalink parent award report block reply"}