{"id": "1ARK512Tn6", "contents": "830 Mike Johnson endorsed Mamdani by not passing a single fucking thing to protect our elections. posted 7 days ago by Spotlight 59 comments award share download report block\n59 comments Sort by Top Top New Worst Old Save CounterStrike 39 points 7 days ago He hasn't passed shit. Everything is an EO and not codified permalink award report block reply Lamal 6 points 7 days ago how do you do that? Republicans don't have 60 in the Senate and it's up to Thune to end the filibuster (but it is quite a hard decision to make) permalink parent award report block reply MastaJoda 1 points 6 days ago not everything needs 60 votes... permalink parent award report block reply Oracle 3 points 6 days ago Any type of law that’s going to mandate how states conduct their elections would absolutely need 60 votes unless the senate gets off their ass and ditches the filibuster.  Then you’re going to have major legal challenges since, I think states are supposed to choose how to do their elections. permalink parent award report block reply HOSEQ 2 points 6 days ago No, but Every MAGA Group needs Division.... permalink parent award report block reply Lamal 2 points 6 days ago Exactly.  Spelling it out for those here, the people here (and even well known e-celebs) wishing that MJ could pass more legislation usually can't define the terms FILIBUSTER, CLOTURE, or RECONCILIATION. Knowing this, a lot of agitators use this to get people to be mad at congress for \"Not doing anything\" i.e. not passing new bills. PLEASE ALL HELP EDUCATE FOLKS HERE so we can block this tactic. permalink parent award report block reply view 1 more comments... Lamal 1 points 6 days ago Once per session of congress, Budget items (ONLY !) can pass the senate with only a simple majority. This is called the reconciliation process. Mike Johnson used this process for the \"One Big Beautiful Bill\" which had in it practically everything we could legally do. Besides this, I know of no other type of legislation that only needs less than 60 votes. (feel free to educate me on it) permalink parent award report block reply trumpORbust 1 points 6 days ago It's an easy decision -- fillabuster has been an delay and stall trick for years, let's try a few without it and lock in AF policies permalink parent award report block reply aaafirefly123 2 points 6 days ago Both sides are afraid to get rid of it for a number of reasons. Reason #1: Fear of what will happen when the opposition takes over and you become powerless to do anything to force them to compromise. Reason #2: Getting rid of the filibuster is basically an admission that bipartisanship is a failure and that compromise is impossible. This all but ensures a civil war as now control over Congress is a winner take all game in which the winners can force whatever they want down the throats of the defeated and them being powerless to do anything about it. permalink parent award report block reply trumpORbust 1 points 6 days ago Getting 61 senators does the same thing -- we have one little chance to strike and must take it... Hell, put the fillabuster back before the next election that matters permalink parent award report block reply view 2 more comments... FractalRoar 2 points 6 days ago Federal ability to control elections is limited to federal government positions. permalink parent award report block reply joa2eEri 1 points 6 days ago I can’t believe Mike Johnson hasn’t secured the dog catcher elections in my town. What a disgrace! Impeach him!!!!11!11! permalink parent award report block reply patrioticwinning3 21 points 7 days ago Don't let that RINO faggot Thune off the hook either! permalink award report block reply MastaJoda 2 points 6 days ago or the entire GOP for that matter... permalink parent award report block reply Raetchel 9 points 7 days ago just republican things permalink award report block reply Patrick_Bateman 2 points 6 days ago But like, what exactly was he, or even Trump, for that matter, supposed to do at a federal level when they have no jurisdiction/authority? permalink parent award report block reply SubmarineGuy 7 points 7 days ago Not quite true. The increase funding for ICE will toss out a.lot of the haters who are voting against America. permalink award report block reply WhereEaglesDare 5 points 7 days ago congress should have been dragged down to gitmo for treason tribunals years ago. permalink award report block reply greatpumpkin 5 points 7 days ago Fact check : True. permalink award report block reply FlyCatcher94 4 points 6 days ago He is a complete piece of shit. permalink award report block reply Nomad899 4 points 7 days ago He is a fed…nothing to do with state election..but needs to codify all of the EOs but there is a big risk in trying to do so permalink award report block reply deleted 7 points 6 days ago MastaJoda 2 points 6 days ago ☝now is not the time for half measures. We need a full on fix bayonets and CHARGE. permalink parent award report block reply BillGateCanSuckIt 2 points 6 days ago He is staying real close so he can twist the dagger in the back of the country permalink parent award report block reply Banfir 3 points 6 days ago He is just a pawn stalling Trumps term. permalink award report block reply JimmyRussler 2 points 6 days ago Him and Pam must be related. permalink parent award report block reply MR__K 1 points 6 days ago I feel like pam is a plant. And has always been opposition hidden right in front of trump. permalink parent award report block reply PepeMania 3 points 6 days ago Israel first. Elections last permalink award report block reply HenkZeilstra 2 points 6 days ago Wearing a fucking Rolex GMT and proudly showing it just shows you what kind of shit person it is. The government system in the US is rotten to the core, the entire government system in the West is only showing now how broken it is. permalink award report block reply Repentnow 1 points 6 days ago Rolex GMT Nope. It a $200 Fossil FB-01 FS5671 High quality photo - you can easily zoom in: https://upload.wikimedia.org/wikipedia/commons/0/05/Speaker_Mike_Johnson_Official_Portrait.jpg permalink parent award report block reply Define_Assault 2 points 6 days ago It’s like I’ve been watching the\nHarlem Globetrotters(democrats) vs the Washington Generals(republicans)…for DECADES…occasionally, the Generals pull it off, but consistently get abused and demoralized while the Globetrotters put on a show for the morons in the stands permalink award report block reply VanDeKoik 2 points 7 days ago So you seriously are so delusional that you think some bill would have let to Curtis Silva winning? Dude, please. permalink award report block reply deleted 3 points 6 days ago Repentnow 0 points 6 days ago It's not election fraud—NYC is a deep blue shithole—1 out of every 3 persons is foreign-born. permalink parent award report block reply BrewSwillis 2 points 6 days ago That election had nothing to do with election integrity. The \"people\" that live in New York City wanted, and deserve, that result. Other elections, like the one in New Jersey, could have benefitted from some election reform. permalink award report block reply buckeyeminuteman 2 points 6 days ago As if Cuomo was a better choice. permalink award report block reply SanityGumby 0 points 6 days ago He literally was permalink parent award report block reply buckeyeminuteman 2 points 6 days ago Remember how we all hated him for putting Covid patients in nursing homes and locking down the entire state. He was chased out of office. permalink parent award report block reply SanityGumby 1 points 6 days ago No shit. He is still better than a muslim communist permalink parent award report block reply Zamperinishoe11 1 points 6 days ago This guy! Goes out practically every day pointing out how bad Democrats are. No S$%t Sherlock! Do Something already! permalink award report block reply DITTOPatriot 1 points 6 days ago MIGA has entered the chat. Wait, you guys aren't getting top billing? He's going to be in the minority very soon. permalink award report block reply HeatherSwanson 1 points 7 days ago Faggots love Islam permalink award report block reply Trumpvitative 1 points 6 days ago No fan of Johnson but this is on Thune. The SAVE Act passed the House 4/10/25 and has been sitting in the Senate with zero movement since then. permalink award report block reply Repentnow 2 points 6 days ago It's sitting in the Senate because it can't come to a vote unless there is 60 votes. permalink parent award report block reply 5DchessWatch 1 points 6 days ago Dollar store Colbert is a useless republican't permalink award report block reply corntortilla 1 points 6 days ago This is retarded. permalink award report block reply Pats5x 1 points 6 days ago he's a fucking useless cuck rino faggot.  think about it....the best R speaker of late has been Kevin McCarthy.  that's saying something.  Johnson and Paul ryan are the worst of the worst permalink award report block reply Lamal 1 points 6 days ago Would you care to elaborate on why you liked McCarthy more? Btw I like them both. Facing the 60 vote cloture threshold in the Senate, there's not too much any of them can do. The One Big Beautiful bill (in the reconciliation process) was about them most we can hope for unless Thune uses the nuclear option. permalink parent award report block reply Pats5x 1 points 6 days ago mccarthy is lesser of two evils. permalink parent award report block reply SanityGumby 1 points 6 days ago Found the low iq faggot that doesn’t know that Congress doesn’t pass New York laws permalink award report block reply Mhmm2MoreWeeks 1 points 6 days ago Speaker Johnson and AG Bondi are proof that Trump is either... Full of Shit and all of this is a big Show. Duped by those around him. Operating under Duress / Threat. And we saw the same shit last term with Bill Barr. History will remember the bad guys are the ones who got prosecuted. Either we bring Traitors to Justice or history will remember Trump and his supporters as the bad guys. permalink award report block reply RudeFrog 1 points 6 days ago Maybe start electing real humans instead of fucking skin suits. Who votes for smug little faggots like this? permalink award report block reply NewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply BillGateCanSuckIt 0 points 6 days ago That face smirk of his just screams I eat dude ass permalink award report block reply cltr1 -2 points 6 days ago Mamdani was endorsed by Trump when he joined hands with Cuomo. permalink award report block reply Juzeza -2 points 7 days ago Correct permalink award report block reply\nCounterStrike 39 points 7 days ago He hasn't passed shit. Everything is an EO and not codified permalink award report block reply Lamal 6 points 7 days ago how do you do that? Republicans don't have 60 in the Senate and it's up to Thune to end the filibuster (but it is quite a hard decision to make) permalink parent award report block reply MastaJoda 1 points 6 days ago not everything needs 60 votes... permalink parent award report block reply Oracle 3 points 6 days ago Any type of law that’s going to mandate how states conduct their elections would absolutely need 60 votes unless the senate gets off their ass and ditches the filibuster.  Then you’re going to have major legal challenges since, I think states are supposed to choose how to do their elections. permalink parent award report block reply HOSEQ 2 points 6 days ago No, but Every MAGA Group needs Division.... permalink parent award report block reply Lamal 2 points 6 days ago Exactly.  Spelling it out for those here, the people here (and even well known e-celebs) wishing that MJ could pass more legislation usually can't define the terms FILIBUSTER, CLOTURE, or RECONCILIATION. Knowing this, a lot of agitators use this to get people to be mad at congress for \"Not doing anything\" i.e. not passing new bills. PLEASE ALL HELP EDUCATE FOLKS HERE so we can block this tactic. permalink parent award report block reply view 1 more comments... Lamal 1 points 6 days ago Once per session of congress, Budget items (ONLY !) can pass the senate with only a simple majority. This is called the reconciliation process. Mike Johnson used this process for the \"One Big Beautiful Bill\" which had in it practically everything we could legally do. Besides this, I know of no other type of legislation that only needs less than 60 votes. (feel free to educate me on it) permalink parent award report block reply trumpORbust 1 points 6 days ago It's an easy decision -- fillabuster has been an delay and stall trick for years, let's try a few without it and lock in AF policies permalink parent award report block reply aaafirefly123 2 points 6 days ago Both sides are afraid to get rid of it for a number of reasons. Reason #1: Fear of what will happen when the opposition takes over and you become powerless to do anything to force them to compromise. Reason #2: Getting rid of the filibuster is basically an admission that bipartisanship is a failure and that compromise is impossible. This all but ensures a civil war as now control over Congress is a winner take all game in which the winners can force whatever they want down the throats of the defeated and them being powerless to do anything about it. permalink parent award report block reply trumpORbust 1 points 6 days ago Getting 61 senators does the same thing -- we have one little chance to strike and must take it... Hell, put the fillabuster back before the next election that matters permalink parent award report block reply view 2 more comments... FractalRoar 2 points 6 days ago Federal ability to control elections is limited to federal government positions. permalink parent award report block reply joa2eEri 1 points 6 days ago I can’t believe Mike Johnson hasn’t secured the dog catcher elections in my town. What a disgrace! Impeach him!!!!11!11! permalink parent award report block reply\nLamal 6 points 7 days ago how do you do that? Republicans don't have 60 in the Senate and it's up to Thune to end the filibuster (but it is quite a hard decision to make) permalink parent award report block reply MastaJoda 1 points 6 days ago not everything needs 60 votes... permalink parent award report block reply Oracle 3 points 6 days ago Any type of law that’s going to mandate how states conduct their elections would absolutely need 60 votes unless the senate gets off their ass and ditches the filibuster.  Then you’re going to have major legal challenges since, I think states are supposed to choose how to do their elections. permalink parent award report block reply HOSEQ 2 points 6 days ago No, but Every MAGA Group needs Division.... permalink parent award report block reply Lamal 2 points 6 days ago Exactly.  Spelling it out for those here, the people here (and even well known e-celebs) wishing that MJ could pass more legislation usually can't define the terms FILIBUSTER, CLOTURE, or RECONCILIATION. Knowing this, a lot of agitators use this to get people to be mad at congress for \"Not doing anything\" i.e. not passing new bills. PLEASE ALL HELP EDUCATE FOLKS HERE so we can block this tactic. permalink parent award report block reply view 1 more comments... Lamal 1 points 6 days ago Once per session of congress, Budget items (ONLY !) can pass the senate with only a simple majority. This is called the reconciliation process. Mike Johnson used this process for the \"One Big Beautiful Bill\" which had in it practically everything we could legally do. Besides this, I know of no other type of legislation that only needs less than 60 votes. (feel free to educate me on it) permalink parent award report block reply trumpORbust 1 points 6 days ago It's an easy decision -- fillabuster has been an delay and stall trick for years, let's try a few without it and lock in AF policies permalink parent award report block reply aaafirefly123 2 points 6 days ago Both sides are afraid to get rid of it for a number of reasons. Reason #1: Fear of what will happen when the opposition takes over and you become powerless to do anything to force them to compromise. Reason #2: Getting rid of the filibuster is basically an admission that bipartisanship is a failure and that compromise is impossible. This all but ensures a civil war as now control over Congress is a winner take all game in which the winners can force whatever they want down the throats of the defeated and them being powerless to do anything about it. permalink parent award report block reply trumpORbust 1 points 6 days ago Getting 61 senators does the same thing -- we have one little chance to strike and must take it... Hell, put the fillabuster back before the next election that matters permalink parent award report block reply view 2 more comments...\nMastaJoda 1 points 6 days ago not everything needs 60 votes... permalink parent award report block reply Oracle 3 points 6 days ago Any type of law that’s going to mandate how states conduct their elections would absolutely need 60 votes unless the senate gets off their ass and ditches the filibuster.  Then you’re going to have major legal challenges since, I think states are supposed to choose how to do their elections. permalink parent award report block reply HOSEQ 2 points 6 days ago No, but Every MAGA Group needs Division.... permalink parent award report block reply Lamal 2 points 6 days ago Exactly.  Spelling it out for those here, the people here (and even well known e-celebs) wishing that MJ could pass more legislation usually can't define the terms FILIBUSTER, CLOTURE, or RECONCILIATION. Knowing this, a lot of agitators use this to get people to be mad at congress for \"Not doing anything\" i.e. not passing new bills. PLEASE ALL HELP EDUCATE FOLKS HERE so we can block this tactic. permalink parent award report block reply view 1 more comments... Lamal 1 points 6 days ago Once per session of congress, Budget items (ONLY !) can pass the senate with only a simple majority. This is called the reconciliation process. Mike Johnson used this process for the \"One Big Beautiful Bill\" which had in it practically everything we could legally do. Besides this, I know of no other type of legislation that only needs less than 60 votes. (feel free to educate me on it) permalink parent award report block reply\nOracle 3 points 6 days ago Any type of law that’s going to mandate how states conduct their elections would absolutely need 60 votes unless the senate gets off their ass and ditches the filibuster.  Then you’re going to have major legal challenges since, I think states are supposed to choose how to do their elections. permalink parent award report block reply\nHOSEQ 2 points 6 days ago No, but Every MAGA Group needs Division.... permalink parent award report block reply Lamal 2 points 6 days ago Exactly.  Spelling it out for those here, the people here (and even well known e-celebs) wishing that MJ could pass more legislation usually can't define the terms FILIBUSTER, CLOTURE, or RECONCILIATION. Knowing this, a lot of agitators use this to get people to be mad at congress for \"Not doing anything\" i.e. not passing new bills. PLEASE ALL HELP EDUCATE FOLKS HERE so we can block this tactic. permalink parent award report block reply view 1 more comments...\nLamal 2 points 6 days ago Exactly.  Spelling it out for those here, the people here (and even well known e-celebs) wishing that MJ could pass more legislation usually can't define the terms FILIBUSTER, CLOTURE, or RECONCILIATION. Knowing this, a lot of agitators use this to get people to be mad at congress for \"Not doing anything\" i.e. not passing new bills. PLEASE ALL HELP EDUCATE FOLKS HERE so we can block this tactic. permalink parent award report block reply view 1 more comments...\nLamal 1 points 6 days ago Once per session of congress, Budget items (ONLY !) can pass the senate with only a simple majority. This is called the reconciliation process. Mike Johnson used this process for the \"One Big Beautiful Bill\" which had in it practically everything we could legally do. Besides this, I know of no other type of legislation that only needs less than 60 votes. (feel free to educate me on it) permalink parent award report block reply\ntrumpORbust 1 points 6 days ago It's an easy decision -- fillabuster has been an delay and stall trick for years, let's try a few without it and lock in AF policies permalink parent award report block reply aaafirefly123 2 points 6 days ago Both sides are afraid to get rid of it for a number of reasons. Reason #1: Fear of what will happen when the opposition takes over and you become powerless to do anything to force them to compromise. Reason #2: Getting rid of the filibuster is basically an admission that bipartisanship is a failure and that compromise is impossible. This all but ensures a civil war as now control over Congress is a winner take all game in which the winners can force whatever they want down the throats of the defeated and them being powerless to do anything about it. permalink parent award report block reply trumpORbust 1 points 6 days ago Getting 61 senators does the same thing -- we have one little chance to strike and must take it... Hell, put the fillabuster back before the next election that matters permalink parent award report block reply view 2 more comments...\naaafirefly123 2 points 6 days ago Both sides are afraid to get rid of it for a number of reasons. Reason #1: Fear of what will happen when the opposition takes over and you become powerless to do anything to force them to compromise. Reason #2: Getting rid of the filibuster is basically an admission that bipartisanship is a failure and that compromise is impossible. This all but ensures a civil war as now control over Congress is a winner take all game in which the winners can force whatever they want down the throats of the defeated and them being powerless to do anything about it. permalink parent award report block reply trumpORbust 1 points 6 days ago Getting 61 senators does the same thing -- we have one little chance to strike and must take it... Hell, put the fillabuster back before the next election that matters permalink parent award report block reply view 2 more comments...\ntrumpORbust 1 points 6 days ago Getting 61 senators does the same thing -- we have one little chance to strike and must take it... Hell, put the fillabuster back before the next election that matters permalink parent award report block reply view 2 more comments...\nFractalRoar 2 points 6 days ago Federal ability to control elections is limited to federal government positions. permalink parent award report block reply joa2eEri 1 points 6 days ago I can’t believe Mike Johnson hasn’t secured the dog catcher elections in my town. What a disgrace! Impeach him!!!!11!11! permalink parent award report block reply\njoa2eEri 1 points 6 days ago I can’t believe Mike Johnson hasn’t secured the dog catcher elections in my town. What a disgrace! Impeach him!!!!11!11! permalink parent award report block reply\npatrioticwinning3 21 points 7 days ago Don't let that RINO faggot Thune off the hook either! permalink award report block reply MastaJoda 2 points 6 days ago or the entire GOP for that matter... permalink parent award report block reply\nMastaJoda 2 points 6 days ago or the entire GOP for that matter... permalink parent award report block reply\nRaetchel 9 points 7 days ago just republican things permalink award report block reply Patrick_Bateman 2 points 6 days ago But like, what exactly was he, or even Trump, for that matter, supposed to do at a federal level when they have no jurisdiction/authority? permalink parent award report block reply\nPatrick_Bateman 2 points 6 days ago But like, what exactly was he, or even Trump, for that matter, supposed to do at a federal level when they have no jurisdiction/authority? permalink parent award report block reply\nSubmarineGuy 7 points 7 days ago Not quite true. The increase funding for ICE will toss out a.lot of the haters who are voting against America. permalink award report block reply\nWhereEaglesDare 5 points 7 days ago congress should have been dragged down to gitmo for treason tribunals years ago. permalink award report block reply\ngreatpumpkin 5 points 7 days ago Fact check : True. permalink award report block reply\nFlyCatcher94 4 points 6 days ago He is a complete piece of shit. permalink award report block reply\nNomad899 4 points 7 days ago He is a fed…nothing to do with state election..but needs to codify all of the EOs but there is a big risk in trying to do so permalink award report block reply deleted 7 points 6 days ago MastaJoda 2 points 6 days ago ☝now is not the time for half measures. We need a full on fix bayonets and CHARGE. permalink parent award report block reply BillGateCanSuckIt 2 points 6 days ago He is staying real close so he can twist the dagger in the back of the country permalink parent award report block reply\ndeleted 7 points 6 days ago MastaJoda 2 points 6 days ago ☝now is not the time for half measures. We need a full on fix bayonets and CHARGE. permalink parent award report block reply BillGateCanSuckIt 2 points 6 days ago He is staying real close so he can twist the dagger in the back of the country permalink parent award report block reply\nMastaJoda 2 points 6 days ago ☝now is not the time for half measures. We need a full on fix bayonets and CHARGE. permalink parent award report block reply\nBillGateCanSuckIt 2 points 6 days ago He is staying real close so he can twist the dagger in the back of the country permalink parent award report block reply\nBanfir 3 points 6 days ago He is just a pawn stalling Trumps term. permalink award report block reply JimmyRussler 2 points 6 days ago Him and Pam must be related. permalink parent award report block reply MR__K 1 points 6 days ago I feel like pam is a plant. And has always been opposition hidden right in front of trump. permalink parent award report block reply\nJimmyRussler 2 points 6 days ago Him and Pam must be related. permalink parent award report block reply MR__K 1 points 6 days ago I feel like pam is a plant. And has always been opposition hidden right in front of trump. permalink parent award report block reply\nMR__K 1 points 6 days ago I feel like pam is a plant. And has always been opposition hidden right in front of trump. permalink parent award report block reply\nPepeMania 3 points 6 days ago Israel first. Elections last permalink award report block reply\nHenkZeilstra 2 points 6 days ago Wearing a fucking Rolex GMT and proudly showing it just shows you what kind of shit person it is. The government system in the US is rotten to the core, the entire government system in the West is only showing now how broken it is. permalink award report block reply Repentnow 1 points 6 days ago Rolex GMT Nope. It a $200 Fossil FB-01 FS5671 High quality photo - you can easily zoom in: https://upload.wikimedia.org/wikipedia/commons/0/05/Speaker_Mike_Johnson_Official_Portrait.jpg permalink parent award report block reply\nRepentnow 1 points 6 days ago Rolex GMT Nope. It a $200 Fossil FB-01 FS5671 High quality photo - you can easily zoom in: https://upload.wikimedia.org/wikipedia/commons/0/05/Speaker_Mike_Johnson_Official_Portrait.jpg permalink parent award report block reply\nDefine_Assault 2 points 6 days ago It’s like I’ve been watching the\nHarlem Globetrotters(democrats) vs the Washington Generals(republicans)…for DECADES…occasionally, the Generals pull it off, but consistently get abused and demoralized while the Globetrotters put on a show for the morons in the stands permalink award report block reply\nVanDeKoik 2 points 7 days ago So you seriously are so delusional that you think some bill would have let to Curtis Silva winning? Dude, please. permalink award report block reply deleted 3 points 6 days ago Repentnow 0 points 6 days ago It's not election fraud—NYC is a deep blue shithole—1 out of every 3 persons is foreign-born. permalink parent award report block reply\ndeleted 3 points 6 days ago Repentnow 0 points 6 days ago It's not election fraud—NYC is a deep blue shithole—1 out of every 3 persons is foreign-born. permalink parent award report block reply\nRepentnow 0 points 6 days ago It's not election fraud—NYC is a deep blue shithole—1 out of every 3 persons is foreign-born. permalink parent award report block reply\nBrewSwillis 2 points 6 days ago That election had nothing to do with election integrity. The \"people\" that live in New York City wanted, and deserve, that result. Other elections, like the one in New Jersey, could have benefitted from some election reform. permalink award report block reply\nbuckeyeminuteman 2 points 6 days ago As if Cuomo was a better choice. permalink award report block reply SanityGumby 0 points 6 days ago He literally was permalink parent award report block reply buckeyeminuteman 2 points 6 days ago Remember how we all hated him for putting Covid patients in nursing homes and locking down the entire state. He was chased out of office. permalink parent award report block reply SanityGumby 1 points 6 days ago No shit. He is still better than a muslim communist permalink parent award report block reply\nSanityGumby 0 points 6 days ago He literally was permalink parent award report block reply buckeyeminuteman 2 points 6 days ago Remember how we all hated him for putting Covid patients in nursing homes and locking down the entire state. He was chased out of office. permalink parent award report block reply SanityGumby 1 points 6 days ago No shit. He is still better than a muslim communist permalink parent award report block reply\nbuckeyeminuteman 2 points 6 days ago Remember how we all hated him for putting Covid patients in nursing homes and locking down the entire state. He was chased out of office. permalink parent award report block reply SanityGumby 1 points 6 days ago No shit. He is still better than a muslim communist permalink parent award report block reply\nSanityGumby 1 points 6 days ago No shit. He is still better than a muslim communist permalink parent award report block reply\nZamperinishoe11 1 points 6 days ago This guy! Goes out practically every day pointing out how bad Democrats are. No S$%t Sherlock! Do Something already! permalink award report block reply\nDITTOPatriot 1 points 6 days ago MIGA has entered the chat. Wait, you guys aren't getting top billing? He's going to be in the minority very soon. permalink award report block reply\nHeatherSwanson 1 points 7 days ago Faggots love Islam permalink award report block reply\nTrumpvitative 1 points 6 days ago No fan of Johnson but this is on Thune. The SAVE Act passed the House 4/10/25 and has been sitting in the Senate with zero movement since then. permalink award report block reply Repentnow 2 points 6 days ago It's sitting in the Senate because it can't come to a vote unless there is 60 votes. permalink parent award report block reply\nRepentnow 2 points 6 days ago It's sitting in the Senate because it can't come to a vote unless there is 60 votes. permalink parent award report block reply\n5DchessWatch 1 points 6 days ago Dollar store Colbert is a useless republican't permalink award report block reply\ncorntortilla 1 points 6 days ago This is retarded. permalink award report block reply\nPats5x 1 points 6 days ago he's a fucking useless cuck rino faggot.  think about it....the best R speaker of late has been Kevin McCarthy.  that's saying something.  Johnson and Paul ryan are the worst of the worst permalink award report block reply Lamal 1 points 6 days ago Would you care to elaborate on why you liked McCarthy more? Btw I like them both. Facing the 60 vote cloture threshold in the Senate, there's not too much any of them can do. The One Big Beautiful bill (in the reconciliation process) was about them most we can hope for unless Thune uses the nuclear option. permalink parent award report block reply Pats5x 1 points 6 days ago mccarthy is lesser of two evils. permalink parent award report block reply\nLamal 1 points 6 days ago Would you care to elaborate on why you liked McCarthy more? Btw I like them both. Facing the 60 vote cloture threshold in the Senate, there's not too much any of them can do. The One Big Beautiful bill (in the reconciliation process) was about them most we can hope for unless Thune uses the nuclear option. permalink parent award report block reply Pats5x 1 points 6 days ago mccarthy is lesser of two evils. permalink parent award report block reply\nPats5x 1 points 6 days ago mccarthy is lesser of two evils. permalink parent award report block reply\nSanityGumby 1 points 6 days ago Found the low iq faggot that doesn’t know that Congress doesn’t pass New York laws permalink award report block reply\nMhmm2MoreWeeks 1 points 6 days ago Speaker Johnson and AG Bondi are proof that Trump is either... Full of Shit and all of this is a big Show. Duped by those around him. Operating under Duress / Threat. And we saw the same shit last term with Bill Barr. History will remember the bad guys are the ones who got prosecuted. Either we bring Traitors to Justice or history will remember Trump and his supporters as the bad guys. permalink award report block reply\nRudeFrog 1 points 6 days ago Maybe start electing real humans instead of fucking skin suits. Who votes for smug little faggots like this? permalink award report block reply NewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nNewGovModOnDutyBans 1 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nBillGateCanSuckIt 0 points 6 days ago That face smirk of his just screams I eat dude ass permalink award report block reply\ncltr1 -2 points 6 days ago Mamdani was endorsed by Trump when he joined hands with Cuomo. permalink award report block reply\nJuzeza -2 points 7 days ago Correct permalink award report block reply"}