{"id": "1ARK5A8TAM", "contents": "269 Eric Trump knew the length the FBI would go to screw you over\\. He told them to pound sand when they told him to turn off his security camera posted 3 days ago by OrangeCatBad 10 comments award share report block Big Fish @BigFish3000 • 4d Eric Trump knew the length the FBI would go to screw you over. He told them to pound sand when they told him to turn off his security cameras. Credit: @mirandadevine\n10 comments Sort by Top Top New Worst Old Save greatpumpkin 10 points 3 days ago Never talk to the FBI. If they want to question you, that means they don't have enough to charge you.  Yet.  Don't give them the ammunition for your firing squad. If you are forced into it, get on video: You are invoking your 5th amendment right to remain silent. You are invoking your 6th amendment right to have an attorney present. You are invoking your 4th amendment right to refuse all searches. Then, SHUT UP ... until your attorney is present. perjury trap Broadly defined, a “perjury trap” occurs when a person commits one of two closely-related “process” crimes: perjury or false statement. Perjury is a lie in a legal proceeding while under oath. False statement is a lie in an unsworn statement to a government official, such as an FBI interview. The hazards of speaking to government officials, especially without counsel, and particularly during an impromptu visit from investigators, usually outweigh any possible benefit. In United States v. Brogan, the United States Supreme Court held that even an “exculpatory no,” that is, a simple denial of wrongdoing followed by a prompt termination of a conversation by the defendant, without any affirmative lie, constitutes a prosecutable false statement. permalink award report block reply SicSemperTyrannis2 2 points 3 days ago Is it shut the fuck up Friday? permalink parent award report block reply Scuffers 6 points 3 days ago anybody got a link to the full interview? permalink award report block reply Filter_Off 3 points 3 days ago https://m.youtube.com/watch?v=DDiulHEWW-U permalink parent award report block reply Scuffers 1 points 3 days ago Thanks! permalink parent award report block reply NadlersNads 4 points 3 days ago Anyone in cuffs yet? permalink award report block reply Formerlurker92 1 points 3 days ago Nope permalink parent award report block reply NadlersNads 1 points 3 days ago Demoralizing. The longest most painful yet.. \"HEY EVERYONE, HERE IS MORE AND MORE EVIDENCE FOR YOU TO SEE....watch what we do with it\"...... forever permalink parent award report block reply JBlaze056 3 points 3 days ago These guys need to realize this is an example why we in the America First movement want this type of behavior held accountable.   We are not all able to make millions off of crypto while Trump is in office.  We need bad actors held accountable while the opportunity is upon us not more platitudes. permalink award report block reply NecturusMaculosus 3 points 3 days ago Never trust anyone who is in government. Never. permalink award report block reply\ngreatpumpkin 10 points 3 days ago Never talk to the FBI. If they want to question you, that means they don't have enough to charge you.  Yet.  Don't give them the ammunition for your firing squad. If you are forced into it, get on video: You are invoking your 5th amendment right to remain silent. You are invoking your 6th amendment right to have an attorney present. You are invoking your 4th amendment right to refuse all searches. Then, SHUT UP ... until your attorney is present. perjury trap Broadly defined, a “perjury trap” occurs when a person commits one of two closely-related “process” crimes: perjury or false statement. Perjury is a lie in a legal proceeding while under oath. False statement is a lie in an unsworn statement to a government official, such as an FBI interview. The hazards of speaking to government officials, especially without counsel, and particularly during an impromptu visit from investigators, usually outweigh any possible benefit. In United States v. Brogan, the United States Supreme Court held that even an “exculpatory no,” that is, a simple denial of wrongdoing followed by a prompt termination of a conversation by the defendant, without any affirmative lie, constitutes a prosecutable false statement. permalink award report block reply SicSemperTyrannis2 2 points 3 days ago Is it shut the fuck up Friday? permalink parent award report block reply\nSicSemperTyrannis2 2 points 3 days ago Is it shut the fuck up Friday? permalink parent award report block reply\nScuffers 6 points 3 days ago anybody got a link to the full interview? permalink award report block reply Filter_Off 3 points 3 days ago https://m.youtube.com/watch?v=DDiulHEWW-U permalink parent award report block reply Scuffers 1 points 3 days ago Thanks! permalink parent award report block reply\nFilter_Off 3 points 3 days ago https://m.youtube.com/watch?v=DDiulHEWW-U permalink parent award report block reply Scuffers 1 points 3 days ago Thanks! permalink parent award report block reply\nScuffers 1 points 3 days ago Thanks! permalink parent award report block reply\nNadlersNads 4 points 3 days ago Anyone in cuffs yet? permalink award report block reply Formerlurker92 1 points 3 days ago Nope permalink parent award report block reply NadlersNads 1 points 3 days ago Demoralizing. The longest most painful yet.. \"HEY EVERYONE, HERE IS MORE AND MORE EVIDENCE FOR YOU TO SEE....watch what we do with it\"...... forever permalink parent award report block reply\nFormerlurker92 1 points 3 days ago Nope permalink parent award report block reply NadlersNads 1 points 3 days ago Demoralizing. The longest most painful yet.. \"HEY EVERYONE, HERE IS MORE AND MORE EVIDENCE FOR YOU TO SEE....watch what we do with it\"...... forever permalink parent award report block reply\nNadlersNads 1 points 3 days ago Demoralizing. The longest most painful yet.. \"HEY EVERYONE, HERE IS MORE AND MORE EVIDENCE FOR YOU TO SEE....watch what we do with it\"...... forever permalink parent award report block reply\nJBlaze056 3 points 3 days ago These guys need to realize this is an example why we in the America First movement want this type of behavior held accountable.   We are not all able to make millions off of crypto while Trump is in office.  We need bad actors held accountable while the opportunity is upon us not more platitudes. permalink award report block reply\nNecturusMaculosus 3 points 3 days ago Never trust anyone who is in government. Never. permalink award report block reply"}