{"id": "1ARK5904e2", "contents": "386 The Capitol Police on in January 6th. Planted the pipe bombs.\n-Shot and tear gassed peaceful protesters in efforts to agitate them.\n-Removed barriers and literally waived people to go towards the Capitol building.-Opened giant magnetic doors from the inside to allow people in the building. posted 4 days ago by MEME-SUPREME 15 comments award share report block Gain of Fauci @DschlopesIsBack • 4d The Capitol Police on in January 6th: -Planted the pipe bombs. -Shot and tear gassed peaceful protesters in efforts to agitate them. -Removed barriers and literally waived people to go towards the Capitol building. -Opened giant magnetic doors from the inside to allow people\n15 comments Sort by Top Top New Worst Old Save _Sully_ 8 points 4 days ago I'm positive the pipe bombs were an insurance policy. If they weren't able to get people to react like they wanted them to they were gonna use the pipe bombs as reason to shut down debate. permalink award report block reply TidewaterYank 5 points 4 days ago Evil Multi-Taskers permalink award report block reply Comanche_Moon 3 points 4 days ago Arrests?   When? permalink award report block reply MastaJoda 1 points 4 days ago 😂🤣😂🤣😂🤣😂🤣😂 Thats a good one! permalink parent award report block reply memechallenger33 2 points 4 days ago Gain of Fauci.  Hahahahahaha. permalink award report block reply journalist 2 points 4 days ago They look gay. permalink award report block reply PatriotSkorzeny 2 points 4 days ago They gassed themselves too. And they bodycam’d it all. permalink award report block reply MastaJoda 2 points 4 days ago I'd bet there were many CP who didnt know what was going on and were used like cannon fodder as well. The MANY suicided CP probably connected too many dots and had to be silenced. permalink parent award report block reply 2025WhatIsTrue 1 points 4 days ago Fire ALL Capital police.  They are criminals. permalink award report block reply mikethemarine 1 points 4 days ago and they ALL got the congressional GOLD medal, made of solid GOLD, worth at minimum of $30,000+ I think the MOB got their kickbacks with our tax dollars given by Nancy Pelosi at the capital. Follow the money permalink award report block reply Aggrieved03 1 points 4 days ago Moved barriers for bus loads of Antifa, whatever happened to Clay Higgins promise to release the names of those involved? permalink award report block reply wmmiv2016v2 1 points 4 days ago Turds larping as LEOs permalink award report block reply Ligersrule1 1 points 3 days ago These \"officers\" are very fake and very gay permalink award report block reply RyanKeyOh 1 points 4 days ago And many of them committed suicide after permalink award report block reply Apersonofinterest 1 points 4 days ago Comment removed by community filter. permalink award report block reply\n_Sully_ 8 points 4 days ago I'm positive the pipe bombs were an insurance policy. If they weren't able to get people to react like they wanted them to they were gonna use the pipe bombs as reason to shut down debate. permalink award report block reply\nTidewaterYank 5 points 4 days ago Evil Multi-Taskers permalink award report block reply\nComanche_Moon 3 points 4 days ago Arrests?   When? permalink award report block reply MastaJoda 1 points 4 days ago 😂🤣😂🤣😂🤣😂🤣😂 Thats a good one! permalink parent award report block reply\nMastaJoda 1 points 4 days ago 😂🤣😂🤣😂🤣😂🤣😂 Thats a good one! permalink parent award report block reply\nmemechallenger33 2 points 4 days ago Gain of Fauci.  Hahahahahaha. permalink award report block reply\njournalist 2 points 4 days ago They look gay. permalink award report block reply\nPatriotSkorzeny 2 points 4 days ago They gassed themselves too. And they bodycam’d it all. permalink award report block reply MastaJoda 2 points 4 days ago I'd bet there were many CP who didnt know what was going on and were used like cannon fodder as well. The MANY suicided CP probably connected too many dots and had to be silenced. permalink parent award report block reply\nMastaJoda 2 points 4 days ago I'd bet there were many CP who didnt know what was going on and were used like cannon fodder as well. The MANY suicided CP probably connected too many dots and had to be silenced. permalink parent award report block reply\n2025WhatIsTrue 1 points 4 days ago Fire ALL Capital police.  They are criminals. permalink award report block reply\nmikethemarine 1 points 4 days ago and they ALL got the congressional GOLD medal, made of solid GOLD, worth at minimum of $30,000+ I think the MOB got their kickbacks with our tax dollars given by Nancy Pelosi at the capital. Follow the money permalink award report block reply\nAggrieved03 1 points 4 days ago Moved barriers for bus loads of Antifa, whatever happened to Clay Higgins promise to release the names of those involved? permalink award report block reply\nwmmiv2016v2 1 points 4 days ago Turds larping as LEOs permalink award report block reply\nLigersrule1 1 points 3 days ago These \"officers\" are very fake and very gay permalink award report block reply\nRyanKeyOh 1 points 4 days ago And many of them committed suicide after permalink award report block reply\nApersonofinterest 1 points 4 days ago Comment removed by community filter. permalink award report block reply"}