{"id": "1ARK9nOoJd", "contents": "330 Open your own coffee shop collective and allow employees to share in the profits and also the losses.  Fucking retards. posted 4 hours ago by KuzoKevin 70 comments award share report block Libs of TikTok @libsoftiktok • 5h Starbucks employees are now dancing and singing to demand higher wages. I saw it, so now you have to\n70 comments Sort by Top Top New Worst Old Save SERP-SERP 16 points 4 hours ago Fvck you Kuzo...I think I got the brain aids from this 🤮 permalink award report block reply BlackJack1776 10 points 4 hours ago I got a good laugh at this, while sipping my homebrewed covfefe. Hmmm, need a refill. Shadilay. permalink parent award report block reply UsernameChexOut 6 points 4 hours ago That was my first thought as well. Why does Kuzo hate us all this much to subjugate us to such torture?! permalink parent award report block reply Pederella 5 points 4 hours ago At least it had clothes on. permalink parent award report block reply RizzlieDoodad 14 points 4 hours ago Sure they can get shared profits. But they also have to share the losses permalink award report block reply RedStoneDeepState 9 points 4 hours ago It's pretty rare for a company like this to be unprofitable with zero labor cost. But they should be required to buy-in. 8 staff, about 1.1 million to open... 150k for 1/8th the profit with zero salary. Either they can all buy out the owner or they need to shut up. Oh wait if they could do that they would start their own coffee shop like the Asians do, and they would be required to make better coffee. If I am spending 8 dollars on a fucking coffee I want my red eye Vietnamese coffee with quad espresso, not Starbuck's burned watery shit with the option of sugar. permalink parent award report block reply mty_green_go 5 points 3 hours ago if you visit the right Vietnamese coffee houses you also get topless puerto rican girls\nƪ(ړײ)‎ƪ​​ permalink parent award report block reply RedStoneDeepState 4 points 3 hours ago Let in some low crime Asian women between 18 and 25 years old and let them open coffee shops. permalink parent award report block reply RedFoxOnFire 1 points 2 hours ago What do you call a coffee shop like that? Tits and beans? Boobs and brew? permalink parent award report block reply Tordah 2 points 27 minutes ago Can I get a tits coffee with milk? permalink parent award report block reply TD_Covfefe_Crusader 1 points 2 hours ago These communist shit stains don't have the work ethic, the financial responsibility, or the tolerance for risk and sacrifice that is required to own a business. permalink parent award report block reply TheThreeSeashells 4 points 3 hours ago And, here's the key, someone else has to do the work of setting it up for them. permalink parent award report block reply JoePlumber 11 points 4 hours ago Tesla robots will pour better lattes much faster in the next few years and work 24 hours a day for free after initial investment. permalink award report block reply RedStoneDeepState 5 points 4 hours ago Tesla robots are a retarded scam. If people want a coffee from a machine, that has been tech for 80 years. Out the door you can get a machine that can make Starbuck's entire drink menu for 15k.  No need for that piece of crap. permalink parent award report block reply JoePlumber 3 points 3 hours ago Lol 80 years that's not true permalink parent award report block reply RedStoneDeepState 3 points 3 hours ago The Rudd-Melikian company was founded to sell the first such machines in 1946, and they were fully available in 1947. The drawings were from even earlier but limited due to wartime.  It's November 2025. 80 years. permalink parent award report block reply JoePlumber 1 points 3 hours ago vending machines are not the same thing as an actually prepared beverage and you guys must know that. permalink parent award report block reply view 7 more comments... spez_this 3 points 3 hours ago Couldn't help but look it up: The first coffee vending machine, called the Kwik Kafe, was introduced in 1947 in Philadelphia, Pennsylvania. So, yeah, ~80 years. I was surprised too. permalink parent award report block reply RedStoneDeepState 1 points 3 hours ago Selling caffeine to WWII veterans was easy. permalink parent award report block reply JoePlumber 1 points 3 hours ago I think you're being generous saying that a coffee vending machine is the same as a barista-prepared one. If a vending machine could actually squirt out a quality product then no coffee shops would even exist now. I say this as someone who just makes coffee at home. permalink parent award report block reply view 1 more comments... ciaramella_is_gay 4 points 4 hours ago Shit's going to happen, and if Starbucks doesn't do it some fucking Asian country will. It's literally the same fucking process and if you make whatever customizations, the robot will do it perfectly each time after they've dialed in their settings to you, which will be saved to your profile/app and you can have the same exact, perfect drink at any location anywhere in the fucking world because we won't need some hippy asshat with mushrooms growing in their crotch isn't making $20/hr while complaining about it to you to do it anymore. permalink parent award report block reply RedStoneDeepState 3 points 4 hours ago People pay for a coffee shop due to the human element. Canned drinks and coffee vending machines have been a thing for decades, people prefer a human giving them coffee. The real solution is the immigrant owned coffee shops. Let in some low crime Asian women between 18 and 25 years old and let them open coffee shops. permalink parent award report block reply ciaramella_is_gay 2 points 3 hours ago Have you been to Starbucks during morning rush? I would be 90% of Starbuck's revenue comes from people that just want it made when they order it and they could give a shit about who's making it since they're going through a drive-through or ordering from a mobile app and just running into pick it up. And they can still staff the coffee shop with 1-2 phd grads in sociology to heat up the pastries and clean the robots when they need maintenance. permalink parent award report block reply RedStoneDeepState 2 points 3 hours ago I would be 90% of Starbuck's revenue comes from people that just want it made when they order it The existence of Starbucks proves you would lose the bet. McDonald's, 7/11, etc will sell you the same coffee for half the price permalink parent award report block reply view 1 more comments... TD_Covfefe_Crusader 2 points 2 hours ago One of the biggest reasons for the proliferation of self check out in grocery stores is the unions making ridiculous demands. Add in the government fuckery and It's cheaper to make the financial investment to automate and get rid of employees. This is what happened here in Oregon with Kroger. permalink parent award report block reply utfanx2 1 points 16 minutes ago Meanwhile countertop espresso machines are getting cheaper, better, and more automated. Why wait in line for a $10 latte when you can push a button and have one in under a minute at home? permalink parent award report block reply JoePlumber 1 points 10 minutes ago i'm a black drip coffee kind of guy but yeah i've heard these are pretty good. as i understand it the key to fancy espresso machines is high pressure and if that can be achieved at home then who would pay $10? permalink parent award report block reply throwaway777b 6 points 4 hours ago You sip what you percolate permalink award report block reply User25000 6 points 4 hours ago Starbucks fucked up with 20 years of DEI hiring. They've been doing it longer than anyone and I am sure it has only escalated in the last 6 years Anyone remember when the majority of people who worked at coffee shops, fast food spots, grocery stores were in there teens and early 20's? These aren't supposed to be supporting 30 and 40 year olds. permalink award report block reply rebuildingMyself 1 points 2 hours ago Yes it used to be one of the better places to work if you're in college. Flexible schedules, decent pay, cool benefits like free bag of coffee each week, etc. Unfortunately a lot of those college kids never thought two steps ahead so kept on working there even after graduation since nobody hires Karens with underwater basketweaving degrees. permalink parent award report block reply HumphreyPlowjogger 5 points 4 hours ago Starbucks hires some really weird people. I guess it’s their culture, permalink award report block reply ciaramella_is_gay 4 points 3 hours ago Maybe it's really weird people that end up there and the normies don't go because they don't want to be around these faggoty retards? Or they have actual life skills they can rely on to make money? permalink parent award report block reply sir_rockness 4 points 4 hours ago You make coffees.... try working on a farm you little pricks permalink award report block reply BlackJack1776 2 points 4 hours ago Very first job at 12 was a summer job on family member's dairy farm. Worked Jr high and high-school summers weeding bean fields and detasseling corn. Apon graduation, I found Infantry as an easier job. permalink parent award report block reply sir_rockness 2 points 3 hours ago Tending and harvesting a garden is without a doubt one of the most labor intensive and humbling jobs on the planet permalink parent award report block reply DingleBalls 4 points 4 hours ago If you dont like the conditions, then you quit and go work somewhere else. The management doesnt need to accommodate you permalink award report block reply JerryNadlerBeltFund 2 points 3 hours ago \"b-b-b-b-b-but. . .  we're note QUALIFIED to work anywhere else.   We're not qualified to work at Starbucks, either, but they're the only ones dumb enough to hire us. . .\" -Protesters, if only they had self awareness. permalink parent award report block reply GunsWithGooglyEyes 3 points 2 hours ago There are kids working as cooks in restaurants in Kansas making $17 an hour. Fuck off. permalink award report block reply Lower 3 points 2 hours ago There are other jobs out there? Starbucks isn't meant to be a career (for most). It's there until you find something better. permalink award report block reply HunterBidensPC 3 points 4 hours ago We’re all watching this from work… permalink award report block reply someguy7738 3 points 4 hours ago Higher wages? 99% of their \"work\" is already completely automated, they're literally just there to hand you a cup. permalink award report block reply MayorOfCentralia 3 points 3 hours ago This is an example of protesting your job out of existence. permalink award report block reply t-bone 3 points 2 hours ago You dumb faggots…. you are serving 16 ounces of coffee one at a time. permalink award report block reply Farqquard 3 points 4 hours ago You can be replaced in a second because you never EARNED any real skills so you have no leverage. That's why the ranks of coffee servers are weirdos and otherwise unemployable people. Plus they are all butt hurt whiny victim class. permalink award report block reply rebuildingMyself 1 points 2 hours ago Yeah they act like it's some highly skilled job when essentially you just need to memorize a small binder of recipes, build some muscle memory, and not be an asshole to customers to be an expert. In other words, you're highly replaceable. permalink parent award report block reply mikethemarine 3 points 3 hours ago Ever since they gave them an important sounding name baristas they all think a high-school starting job is worth something permalink award report block reply barwhack 2 points 4 hours ago I have an idea: don't drink leftist-infused Flintwater coffee . Then \"raises\" won't be an issue. permalink award report block reply bluedevilga 2 points 3 hours ago Burger King is hiring, but they’d probably rather prepare lattes permalink award report block reply BeanieRed 2 points 4 hours ago Dems, dims, commies and socialists are only leaches.  They want what others have done without the sacrifice, risk and work.  They can only take; they cannot create. permalink award report block reply Drdonaldjtrump1776 2 points 4 hours ago Maybe cause ur an adult, working a highschool kids retail job\nIt's not meant to support a living. Go get a call center job, the next step up .more money, better benefits, and easy enough work you don't have to take home with you permalink award report block reply Lol_Garrus 2 points 3 hours ago They are so bad at protest chants that they just find random words so they have a rhyme? The fuck does your neck or back have to do with anything? permalink award report block reply rebuildingMyself 2 points 1 hour ago \"ChatGPT help me come up with a witty chant for our commie rally\" permalink parent award report block reply Wildwind 2 points 4 hours ago Just a group of retarded commies. permalink award report block reply rebuildingMyself 2 points 2 hours ago And then they'll whine when automation becomes economically feasible and easier to deal with than a bunch of entitled Commies with piercings and six figure school loans for their \"fuck white people\" degree permalink award report block reply RedditStillSucks 2 points 4 hours ago My taxes are wack. permalink award report block reply MeMargie 1 points 3 hours ago Brain cells are Whack. permalink award report block reply JBlaze056 1 points 4 hours ago \"Doctor said I need a backiodomy\". permalink award report block reply ncswicn 1 points 2 hours ago Sigh! #LiberalismIsAMentalDisorder permalink award report block reply Formerlurker92 1 points 15 minutes ago They'll have no one to blame but themselves when the one company catering to them folds like a cardboard box permalink award report block reply Redpilled2Depression 1 points 1 hour ago I wonder how much painkillers and alcohol does the CEO of this company have to consume everyday having to deal with these adult children. permalink award report block reply\nSERP-SERP 16 points 4 hours ago Fvck you Kuzo...I think I got the brain aids from this 🤮 permalink award report block reply BlackJack1776 10 points 4 hours ago I got a good laugh at this, while sipping my homebrewed covfefe. Hmmm, need a refill. Shadilay. permalink parent award report block reply UsernameChexOut 6 points 4 hours ago That was my first thought as well. Why does Kuzo hate us all this much to subjugate us to such torture?! permalink parent award report block reply Pederella 5 points 4 hours ago At least it had clothes on. permalink parent award report block reply\nBlackJack1776 10 points 4 hours ago I got a good laugh at this, while sipping my homebrewed covfefe. Hmmm, need a refill. Shadilay. permalink parent award report block reply\nUsernameChexOut 6 points 4 hours ago That was my first thought as well. Why does Kuzo hate us all this much to subjugate us to such torture?! permalink parent award report block reply\nPederella 5 points 4 hours ago At least it had clothes on. permalink parent award report block reply\nRizzlieDoodad 14 points 4 hours ago Sure they can get shared profits. But they also have to share the losses permalink award report block reply RedStoneDeepState 9 points 4 hours ago It's pretty rare for a company like this to be unprofitable with zero labor cost. But they should be required to buy-in. 8 staff, about 1.1 million to open... 150k for 1/8th the profit with zero salary. Either they can all buy out the owner or they need to shut up. Oh wait if they could do that they would start their own coffee shop like the Asians do, and they would be required to make better coffee. If I am spending 8 dollars on a fucking coffee I want my red eye Vietnamese coffee with quad espresso, not Starbuck's burned watery shit with the option of sugar. permalink parent award report block reply mty_green_go 5 points 3 hours ago if you visit the right Vietnamese coffee houses you also get topless puerto rican girls\nƪ(ړײ)‎ƪ​​ permalink parent award report block reply RedStoneDeepState 4 points 3 hours ago Let in some low crime Asian women between 18 and 25 years old and let them open coffee shops. permalink parent award report block reply RedFoxOnFire 1 points 2 hours ago What do you call a coffee shop like that? Tits and beans? Boobs and brew? permalink parent award report block reply Tordah 2 points 27 minutes ago Can I get a tits coffee with milk? permalink parent award report block reply TD_Covfefe_Crusader 1 points 2 hours ago These communist shit stains don't have the work ethic, the financial responsibility, or the tolerance for risk and sacrifice that is required to own a business. permalink parent award report block reply TheThreeSeashells 4 points 3 hours ago And, here's the key, someone else has to do the work of setting it up for them. permalink parent award report block reply\nRedStoneDeepState 9 points 4 hours ago It's pretty rare for a company like this to be unprofitable with zero labor cost. But they should be required to buy-in. 8 staff, about 1.1 million to open... 150k for 1/8th the profit with zero salary. Either they can all buy out the owner or they need to shut up. Oh wait if they could do that they would start their own coffee shop like the Asians do, and they would be required to make better coffee. If I am spending 8 dollars on a fucking coffee I want my red eye Vietnamese coffee with quad espresso, not Starbuck's burned watery shit with the option of sugar. permalink parent award report block reply mty_green_go 5 points 3 hours ago if you visit the right Vietnamese coffee houses you also get topless puerto rican girls\nƪ(ړײ)‎ƪ​​ permalink parent award report block reply RedStoneDeepState 4 points 3 hours ago Let in some low crime Asian women between 18 and 25 years old and let them open coffee shops. permalink parent award report block reply RedFoxOnFire 1 points 2 hours ago What do you call a coffee shop like that? Tits and beans? Boobs and brew? permalink parent award report block reply Tordah 2 points 27 minutes ago Can I get a tits coffee with milk? permalink parent award report block reply TD_Covfefe_Crusader 1 points 2 hours ago These communist shit stains don't have the work ethic, the financial responsibility, or the tolerance for risk and sacrifice that is required to own a business. permalink parent award report block reply\nmty_green_go 5 points 3 hours ago if you visit the right Vietnamese coffee houses you also get topless puerto rican girls\nƪ(ړײ)‎ƪ​​ permalink parent award report block reply RedStoneDeepState 4 points 3 hours ago Let in some low crime Asian women between 18 and 25 years old and let them open coffee shops. permalink parent award report block reply RedFoxOnFire 1 points 2 hours ago What do you call a coffee shop like that? Tits and beans? Boobs and brew? permalink parent award report block reply Tordah 2 points 27 minutes ago Can I get a tits coffee with milk? permalink parent award report block reply\nRedStoneDeepState 4 points 3 hours ago Let in some low crime Asian women between 18 and 25 years old and let them open coffee shops. permalink parent award report block reply\nRedFoxOnFire 1 points 2 hours ago What do you call a coffee shop like that? Tits and beans? Boobs and brew? permalink parent award report block reply Tordah 2 points 27 minutes ago Can I get a tits coffee with milk? permalink parent award report block reply\nTordah 2 points 27 minutes ago Can I get a tits coffee with milk? permalink parent award report block reply\nTD_Covfefe_Crusader 1 points 2 hours ago These communist shit stains don't have the work ethic, the financial responsibility, or the tolerance for risk and sacrifice that is required to own a business. permalink parent award report block reply\nTheThreeSeashells 4 points 3 hours ago And, here's the key, someone else has to do the work of setting it up for them. permalink parent award report block reply\nJoePlumber 11 points 4 hours ago Tesla robots will pour better lattes much faster in the next few years and work 24 hours a day for free after initial investment. permalink award report block reply RedStoneDeepState 5 points 4 hours ago Tesla robots are a retarded scam. If people want a coffee from a machine, that has been tech for 80 years. Out the door you can get a machine that can make Starbuck's entire drink menu for 15k.  No need for that piece of crap. permalink parent award report block reply JoePlumber 3 points 3 hours ago Lol 80 years that's not true permalink parent award report block reply RedStoneDeepState 3 points 3 hours ago The Rudd-Melikian company was founded to sell the first such machines in 1946, and they were fully available in 1947. The drawings were from even earlier but limited due to wartime.  It's November 2025. 80 years. permalink parent award report block reply JoePlumber 1 points 3 hours ago vending machines are not the same thing as an actually prepared beverage and you guys must know that. permalink parent award report block reply view 7 more comments... spez_this 3 points 3 hours ago Couldn't help but look it up: The first coffee vending machine, called the Kwik Kafe, was introduced in 1947 in Philadelphia, Pennsylvania. So, yeah, ~80 years. I was surprised too. permalink parent award report block reply RedStoneDeepState 1 points 3 hours ago Selling caffeine to WWII veterans was easy. permalink parent award report block reply JoePlumber 1 points 3 hours ago I think you're being generous saying that a coffee vending machine is the same as a barista-prepared one. If a vending machine could actually squirt out a quality product then no coffee shops would even exist now. I say this as someone who just makes coffee at home. permalink parent award report block reply view 1 more comments... ciaramella_is_gay 4 points 4 hours ago Shit's going to happen, and if Starbucks doesn't do it some fucking Asian country will. It's literally the same fucking process and if you make whatever customizations, the robot will do it perfectly each time after they've dialed in their settings to you, which will be saved to your profile/app and you can have the same exact, perfect drink at any location anywhere in the fucking world because we won't need some hippy asshat with mushrooms growing in their crotch isn't making $20/hr while complaining about it to you to do it anymore. permalink parent award report block reply RedStoneDeepState 3 points 4 hours ago People pay for a coffee shop due to the human element. Canned drinks and coffee vending machines have been a thing for decades, people prefer a human giving them coffee. The real solution is the immigrant owned coffee shops. Let in some low crime Asian women between 18 and 25 years old and let them open coffee shops. permalink parent award report block reply ciaramella_is_gay 2 points 3 hours ago Have you been to Starbucks during morning rush? I would be 90% of Starbuck's revenue comes from people that just want it made when they order it and they could give a shit about who's making it since they're going through a drive-through or ordering from a mobile app and just running into pick it up. And they can still staff the coffee shop with 1-2 phd grads in sociology to heat up the pastries and clean the robots when they need maintenance. permalink parent award report block reply RedStoneDeepState 2 points 3 hours ago I would be 90% of Starbuck's revenue comes from people that just want it made when they order it The existence of Starbucks proves you would lose the bet. McDonald's, 7/11, etc will sell you the same coffee for half the price permalink parent award report block reply view 1 more comments... TD_Covfefe_Crusader 2 points 2 hours ago One of the biggest reasons for the proliferation of self check out in grocery stores is the unions making ridiculous demands. Add in the government fuckery and It's cheaper to make the financial investment to automate and get rid of employees. This is what happened here in Oregon with Kroger. permalink parent award report block reply utfanx2 1 points 16 minutes ago Meanwhile countertop espresso machines are getting cheaper, better, and more automated. Why wait in line for a $10 latte when you can push a button and have one in under a minute at home? permalink parent award report block reply JoePlumber 1 points 10 minutes ago i'm a black drip coffee kind of guy but yeah i've heard these are pretty good. as i understand it the key to fancy espresso machines is high pressure and if that can be achieved at home then who would pay $10? permalink parent award report block reply\nRedStoneDeepState 5 points 4 hours ago Tesla robots are a retarded scam. If people want a coffee from a machine, that has been tech for 80 years. Out the door you can get a machine that can make Starbuck's entire drink menu for 15k.  No need for that piece of crap. permalink parent award report block reply JoePlumber 3 points 3 hours ago Lol 80 years that's not true permalink parent award report block reply RedStoneDeepState 3 points 3 hours ago The Rudd-Melikian company was founded to sell the first such machines in 1946, and they were fully available in 1947. The drawings were from even earlier but limited due to wartime.  It's November 2025. 80 years. permalink parent award report block reply JoePlumber 1 points 3 hours ago vending machines are not the same thing as an actually prepared beverage and you guys must know that. permalink parent award report block reply view 7 more comments... spez_this 3 points 3 hours ago Couldn't help but look it up: The first coffee vending machine, called the Kwik Kafe, was introduced in 1947 in Philadelphia, Pennsylvania. So, yeah, ~80 years. I was surprised too. permalink parent award report block reply RedStoneDeepState 1 points 3 hours ago Selling caffeine to WWII veterans was easy. permalink parent award report block reply JoePlumber 1 points 3 hours ago I think you're being generous saying that a coffee vending machine is the same as a barista-prepared one. If a vending machine could actually squirt out a quality product then no coffee shops would even exist now. I say this as someone who just makes coffee at home. permalink parent award report block reply view 1 more comments...\nJoePlumber 3 points 3 hours ago Lol 80 years that's not true permalink parent award report block reply RedStoneDeepState 3 points 3 hours ago The Rudd-Melikian company was founded to sell the first such machines in 1946, and they were fully available in 1947. The drawings were from even earlier but limited due to wartime.  It's November 2025. 80 years. permalink parent award report block reply JoePlumber 1 points 3 hours ago vending machines are not the same thing as an actually prepared beverage and you guys must know that. permalink parent award report block reply view 7 more comments... spez_this 3 points 3 hours ago Couldn't help but look it up: The first coffee vending machine, called the Kwik Kafe, was introduced in 1947 in Philadelphia, Pennsylvania. So, yeah, ~80 years. I was surprised too. permalink parent award report block reply RedStoneDeepState 1 points 3 hours ago Selling caffeine to WWII veterans was easy. permalink parent award report block reply JoePlumber 1 points 3 hours ago I think you're being generous saying that a coffee vending machine is the same as a barista-prepared one. If a vending machine could actually squirt out a quality product then no coffee shops would even exist now. I say this as someone who just makes coffee at home. permalink parent award report block reply view 1 more comments...\nRedStoneDeepState 3 points 3 hours ago The Rudd-Melikian company was founded to sell the first such machines in 1946, and they were fully available in 1947. The drawings were from even earlier but limited due to wartime.  It's November 2025. 80 years. permalink parent award report block reply JoePlumber 1 points 3 hours ago vending machines are not the same thing as an actually prepared beverage and you guys must know that. permalink parent award report block reply view 7 more comments...\nJoePlumber 1 points 3 hours ago vending machines are not the same thing as an actually prepared beverage and you guys must know that. permalink parent award report block reply view 7 more comments...\nspez_this 3 points 3 hours ago Couldn't help but look it up: The first coffee vending machine, called the Kwik Kafe, was introduced in 1947 in Philadelphia, Pennsylvania. So, yeah, ~80 years. I was surprised too. permalink parent award report block reply RedStoneDeepState 1 points 3 hours ago Selling caffeine to WWII veterans was easy. permalink parent award report block reply JoePlumber 1 points 3 hours ago I think you're being generous saying that a coffee vending machine is the same as a barista-prepared one. If a vending machine could actually squirt out a quality product then no coffee shops would even exist now. I say this as someone who just makes coffee at home. permalink parent award report block reply view 1 more comments...\nRedStoneDeepState 1 points 3 hours ago Selling caffeine to WWII veterans was easy. permalink parent award report block reply\nJoePlumber 1 points 3 hours ago I think you're being generous saying that a coffee vending machine is the same as a barista-prepared one. If a vending machine could actually squirt out a quality product then no coffee shops would even exist now. I say this as someone who just makes coffee at home. permalink parent award report block reply view 1 more comments...\nciaramella_is_gay 4 points 4 hours ago Shit's going to happen, and if Starbucks doesn't do it some fucking Asian country will. It's literally the same fucking process and if you make whatever customizations, the robot will do it perfectly each time after they've dialed in their settings to you, which will be saved to your profile/app and you can have the same exact, perfect drink at any location anywhere in the fucking world because we won't need some hippy asshat with mushrooms growing in their crotch isn't making $20/hr while complaining about it to you to do it anymore. permalink parent award report block reply RedStoneDeepState 3 points 4 hours ago People pay for a coffee shop due to the human element. Canned drinks and coffee vending machines have been a thing for decades, people prefer a human giving them coffee. The real solution is the immigrant owned coffee shops. Let in some low crime Asian women between 18 and 25 years old and let them open coffee shops. permalink parent award report block reply ciaramella_is_gay 2 points 3 hours ago Have you been to Starbucks during morning rush? I would be 90% of Starbuck's revenue comes from people that just want it made when they order it and they could give a shit about who's making it since they're going through a drive-through or ordering from a mobile app and just running into pick it up. And they can still staff the coffee shop with 1-2 phd grads in sociology to heat up the pastries and clean the robots when they need maintenance. permalink parent award report block reply RedStoneDeepState 2 points 3 hours ago I would be 90% of Starbuck's revenue comes from people that just want it made when they order it The existence of Starbucks proves you would lose the bet. McDonald's, 7/11, etc will sell you the same coffee for half the price permalink parent award report block reply view 1 more comments...\nRedStoneDeepState 3 points 4 hours ago People pay for a coffee shop due to the human element. Canned drinks and coffee vending machines have been a thing for decades, people prefer a human giving them coffee. The real solution is the immigrant owned coffee shops. Let in some low crime Asian women between 18 and 25 years old and let them open coffee shops. permalink parent award report block reply ciaramella_is_gay 2 points 3 hours ago Have you been to Starbucks during morning rush? I would be 90% of Starbuck's revenue comes from people that just want it made when they order it and they could give a shit about who's making it since they're going through a drive-through or ordering from a mobile app and just running into pick it up. And they can still staff the coffee shop with 1-2 phd grads in sociology to heat up the pastries and clean the robots when they need maintenance. permalink parent award report block reply RedStoneDeepState 2 points 3 hours ago I would be 90% of Starbuck's revenue comes from people that just want it made when they order it The existence of Starbucks proves you would lose the bet. McDonald's, 7/11, etc will sell you the same coffee for half the price permalink parent award report block reply view 1 more comments...\nciaramella_is_gay 2 points 3 hours ago Have you been to Starbucks during morning rush? I would be 90% of Starbuck's revenue comes from people that just want it made when they order it and they could give a shit about who's making it since they're going through a drive-through or ordering from a mobile app and just running into pick it up. And they can still staff the coffee shop with 1-2 phd grads in sociology to heat up the pastries and clean the robots when they need maintenance. permalink parent award report block reply RedStoneDeepState 2 points 3 hours ago I would be 90% of Starbuck's revenue comes from people that just want it made when they order it The existence of Starbucks proves you would lose the bet. McDonald's, 7/11, etc will sell you the same coffee for half the price permalink parent award report block reply view 1 more comments...\nRedStoneDeepState 2 points 3 hours ago I would be 90% of Starbuck's revenue comes from people that just want it made when they order it The existence of Starbucks proves you would lose the bet. McDonald's, 7/11, etc will sell you the same coffee for half the price permalink parent award report block reply view 1 more comments...\nTD_Covfefe_Crusader 2 points 2 hours ago One of the biggest reasons for the proliferation of self check out in grocery stores is the unions making ridiculous demands. Add in the government fuckery and It's cheaper to make the financial investment to automate and get rid of employees. This is what happened here in Oregon with Kroger. permalink parent award report block reply\nutfanx2 1 points 16 minutes ago Meanwhile countertop espresso machines are getting cheaper, better, and more automated. Why wait in line for a $10 latte when you can push a button and have one in under a minute at home? permalink parent award report block reply JoePlumber 1 points 10 minutes ago i'm a black drip coffee kind of guy but yeah i've heard these are pretty good. as i understand it the key to fancy espresso machines is high pressure and if that can be achieved at home then who would pay $10? permalink parent award report block reply\nJoePlumber 1 points 10 minutes ago i'm a black drip coffee kind of guy but yeah i've heard these are pretty good. as i understand it the key to fancy espresso machines is high pressure and if that can be achieved at home then who would pay $10? permalink parent award report block reply\nthrowaway777b 6 points 4 hours ago You sip what you percolate permalink award report block reply\nUser25000 6 points 4 hours ago Starbucks fucked up with 20 years of DEI hiring. They've been doing it longer than anyone and I am sure it has only escalated in the last 6 years Anyone remember when the majority of people who worked at coffee shops, fast food spots, grocery stores were in there teens and early 20's? These aren't supposed to be supporting 30 and 40 year olds. permalink award report block reply rebuildingMyself 1 points 2 hours ago Yes it used to be one of the better places to work if you're in college. Flexible schedules, decent pay, cool benefits like free bag of coffee each week, etc. Unfortunately a lot of those college kids never thought two steps ahead so kept on working there even after graduation since nobody hires Karens with underwater basketweaving degrees. permalink parent award report block reply\nrebuildingMyself 1 points 2 hours ago Yes it used to be one of the better places to work if you're in college. Flexible schedules, decent pay, cool benefits like free bag of coffee each week, etc. Unfortunately a lot of those college kids never thought two steps ahead so kept on working there even after graduation since nobody hires Karens with underwater basketweaving degrees. permalink parent award report block reply\nHumphreyPlowjogger 5 points 4 hours ago Starbucks hires some really weird people. I guess it’s their culture, permalink award report block reply ciaramella_is_gay 4 points 3 hours ago Maybe it's really weird people that end up there and the normies don't go because they don't want to be around these faggoty retards? Or they have actual life skills they can rely on to make money? permalink parent award report block reply\nciaramella_is_gay 4 points 3 hours ago Maybe it's really weird people that end up there and the normies don't go because they don't want to be around these faggoty retards? Or they have actual life skills they can rely on to make money? permalink parent award report block reply\nsir_rockness 4 points 4 hours ago You make coffees.... try working on a farm you little pricks permalink award report block reply BlackJack1776 2 points 4 hours ago Very first job at 12 was a summer job on family member's dairy farm. Worked Jr high and high-school summers weeding bean fields and detasseling corn. Apon graduation, I found Infantry as an easier job. permalink parent award report block reply sir_rockness 2 points 3 hours ago Tending and harvesting a garden is without a doubt one of the most labor intensive and humbling jobs on the planet permalink parent award report block reply\nBlackJack1776 2 points 4 hours ago Very first job at 12 was a summer job on family member's dairy farm. Worked Jr high and high-school summers weeding bean fields and detasseling corn. Apon graduation, I found Infantry as an easier job. permalink parent award report block reply sir_rockness 2 points 3 hours ago Tending and harvesting a garden is without a doubt one of the most labor intensive and humbling jobs on the planet permalink parent award report block reply\nsir_rockness 2 points 3 hours ago Tending and harvesting a garden is without a doubt one of the most labor intensive and humbling jobs on the planet permalink parent award report block reply\nDingleBalls 4 points 4 hours ago If you dont like the conditions, then you quit and go work somewhere else. The management doesnt need to accommodate you permalink award report block reply JerryNadlerBeltFund 2 points 3 hours ago \"b-b-b-b-b-but. . .  we're note QUALIFIED to work anywhere else.   We're not qualified to work at Starbucks, either, but they're the only ones dumb enough to hire us. . .\" -Protesters, if only they had self awareness. permalink parent award report block reply\nJerryNadlerBeltFund 2 points 3 hours ago \"b-b-b-b-b-but. . .  we're note QUALIFIED to work anywhere else.   We're not qualified to work at Starbucks, either, but they're the only ones dumb enough to hire us. . .\" -Protesters, if only they had self awareness. permalink parent award report block reply\nGunsWithGooglyEyes 3 points 2 hours ago There are kids working as cooks in restaurants in Kansas making $17 an hour. Fuck off. permalink award report block reply\nLower 3 points 2 hours ago There are other jobs out there? Starbucks isn't meant to be a career (for most). It's there until you find something better. permalink award report block reply\nHunterBidensPC 3 points 4 hours ago We’re all watching this from work… permalink award report block reply\nsomeguy7738 3 points 4 hours ago Higher wages? 99% of their \"work\" is already completely automated, they're literally just there to hand you a cup. permalink award report block reply\nMayorOfCentralia 3 points 3 hours ago This is an example of protesting your job out of existence. permalink award report block reply\nt-bone 3 points 2 hours ago You dumb faggots…. you are serving 16 ounces of coffee one at a time. permalink award report block reply\nFarqquard 3 points 4 hours ago You can be replaced in a second because you never EARNED any real skills so you have no leverage. That's why the ranks of coffee servers are weirdos and otherwise unemployable people. Plus they are all butt hurt whiny victim class. permalink award report block reply rebuildingMyself 1 points 2 hours ago Yeah they act like it's some highly skilled job when essentially you just need to memorize a small binder of recipes, build some muscle memory, and not be an asshole to customers to be an expert. In other words, you're highly replaceable. permalink parent award report block reply\nrebuildingMyself 1 points 2 hours ago Yeah they act like it's some highly skilled job when essentially you just need to memorize a small binder of recipes, build some muscle memory, and not be an asshole to customers to be an expert. In other words, you're highly replaceable. permalink parent award report block reply\nmikethemarine 3 points 3 hours ago Ever since they gave them an important sounding name baristas they all think a high-school starting job is worth something permalink award report block reply\nbarwhack 2 points 4 hours ago I have an idea: don't drink leftist-infused Flintwater coffee . Then \"raises\" won't be an issue. permalink award report block reply\nbluedevilga 2 points 3 hours ago Burger King is hiring, but they’d probably rather prepare lattes permalink award report block reply\nBeanieRed 2 points 4 hours ago Dems, dims, commies and socialists are only leaches.  They want what others have done without the sacrifice, risk and work.  They can only take; they cannot create. permalink award report block reply\nDrdonaldjtrump1776 2 points 4 hours ago Maybe cause ur an adult, working a highschool kids retail job\nIt's not meant to support a living. Go get a call center job, the next step up .more money, better benefits, and easy enough work you don't have to take home with you permalink award report block reply\nLol_Garrus 2 points 3 hours ago They are so bad at protest chants that they just find random words so they have a rhyme? The fuck does your neck or back have to do with anything? permalink award report block reply rebuildingMyself 2 points 1 hour ago \"ChatGPT help me come up with a witty chant for our commie rally\" permalink parent award report block reply\nrebuildingMyself 2 points 1 hour ago \"ChatGPT help me come up with a witty chant for our commie rally\" permalink parent award report block reply\nWildwind 2 points 4 hours ago Just a group of retarded commies. permalink award report block reply\nrebuildingMyself 2 points 2 hours ago And then they'll whine when automation becomes economically feasible and easier to deal with than a bunch of entitled Commies with piercings and six figure school loans for their \"fuck white people\" degree permalink award report block reply\nRedditStillSucks 2 points 4 hours ago My taxes are wack. permalink award report block reply\nMeMargie 1 points 3 hours ago Brain cells are Whack. permalink award report block reply\nJBlaze056 1 points 4 hours ago \"Doctor said I need a backiodomy\". permalink award report block reply\nncswicn 1 points 2 hours ago Sigh! #LiberalismIsAMentalDisorder permalink award report block reply\nFormerlurker92 1 points 15 minutes ago They'll have no one to blame but themselves when the one company catering to them folds like a cardboard box permalink award report block reply\nRedpilled2Depression 1 points 1 hour ago I wonder how much painkillers and alcohol does the CEO of this company have to consume everyday having to deal with these adult children. permalink award report block reply"}