{"id": "1ARK52Byhq", "contents": "304 President Trump stuns America by saying if the Supreme Court takes down his Tariffs, the American people will have to pay back trillions\n\n“We’re taking in TRILLIONS. European union $950 billion. Japan $650 billion. South Korea $350” LAWFARE posted 6 days ago by Eruditio 9 comments award share report block MAGA Voice @MAGAVoice • 6d BREAKING 🚨 President Trump stuns America by saying if the Supreme Court takes down his Tariffs, the American people will have to pay back trillions “We’re taking in TRILLIONS. European union $950 billion. Japan $650 billion. South Korea $350” DO THE RIGHT THING\n9 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Grindelwald 10 points 6 days ago See what Mamdani voters think about that. permalink award report block reply Trooph-Hurts 12 points 6 days ago They love it…… but if America cannot place tariffs on items then WTF are we even involved in any trade at all! permalink parent award report block reply MastaJoda 4 points 6 days ago Do we get to sue them in their country and have their courts force them to end the tariffs on our products? Hell to tf NO! This shit is pure madness. Watch our SC side with the leeching ''allies'' who rip us tf off every chance they get. permalink parent award report block reply Trooph-Hurts 3 points 6 days ago Well, they haven’t ruled yet but you’re absolutely right…. Why on earth would we not be able to foreign entities any damn well we please on our homeland! It would be pure insanity and madness to think otherwise…. But people who hate America would definitely try doing it permalink parent award report block reply Krat 7 points 6 days ago Thats what the democrats want, a collapse so they can impeach and finish enslaving you permalink award report block reply Firespawn 1 points 6 days ago Are you not an American? If you are, then *us. permalink parent award report block reply Muttsbitetoo 7 points 6 days ago Seems like a “don’t be a pussy Mike” moment permalink award report block reply MastaJoda 7 points 6 days ago So, expect the SC to fold like midget Mike did every time he was called upon to do the right thing. permalink parent award report block reply Hangmhigh 2 points 6 days ago Why the Fk would we pay them?? Domestic importers paid that money. permalink award report block reply\nGrindelwald 10 points 6 days ago See what Mamdani voters think about that. permalink award report block reply Trooph-Hurts 12 points 6 days ago They love it…… but if America cannot place tariffs on items then WTF are we even involved in any trade at all! permalink parent award report block reply MastaJoda 4 points 6 days ago Do we get to sue them in their country and have their courts force them to end the tariffs on our products? Hell to tf NO! This shit is pure madness. Watch our SC side with the leeching ''allies'' who rip us tf off every chance they get. permalink parent award report block reply Trooph-Hurts 3 points 6 days ago Well, they haven’t ruled yet but you’re absolutely right…. Why on earth would we not be able to foreign entities any damn well we please on our homeland! It would be pure insanity and madness to think otherwise…. But people who hate America would definitely try doing it permalink parent award report block reply\nTrooph-Hurts 12 points 6 days ago They love it…… but if America cannot place tariffs on items then WTF are we even involved in any trade at all! permalink parent award report block reply MastaJoda 4 points 6 days ago Do we get to sue them in their country and have their courts force them to end the tariffs on our products? Hell to tf NO! This shit is pure madness. Watch our SC side with the leeching ''allies'' who rip us tf off every chance they get. permalink parent award report block reply Trooph-Hurts 3 points 6 days ago Well, they haven’t ruled yet but you’re absolutely right…. Why on earth would we not be able to foreign entities any damn well we please on our homeland! It would be pure insanity and madness to think otherwise…. But people who hate America would definitely try doing it permalink parent award report block reply\nMastaJoda 4 points 6 days ago Do we get to sue them in their country and have their courts force them to end the tariffs on our products? Hell to tf NO! This shit is pure madness. Watch our SC side with the leeching ''allies'' who rip us tf off every chance they get. permalink parent award report block reply Trooph-Hurts 3 points 6 days ago Well, they haven’t ruled yet but you’re absolutely right…. Why on earth would we not be able to foreign entities any damn well we please on our homeland! It would be pure insanity and madness to think otherwise…. But people who hate America would definitely try doing it permalink parent award report block reply\nTrooph-Hurts 3 points 6 days ago Well, they haven’t ruled yet but you’re absolutely right…. Why on earth would we not be able to foreign entities any damn well we please on our homeland! It would be pure insanity and madness to think otherwise…. But people who hate America would definitely try doing it permalink parent award report block reply\nKrat 7 points 6 days ago Thats what the democrats want, a collapse so they can impeach and finish enslaving you permalink award report block reply Firespawn 1 points 6 days ago Are you not an American? If you are, then *us. permalink parent award report block reply\nFirespawn 1 points 6 days ago Are you not an American? If you are, then *us. permalink parent award report block reply\nMuttsbitetoo 7 points 6 days ago Seems like a “don’t be a pussy Mike” moment permalink award report block reply MastaJoda 7 points 6 days ago So, expect the SC to fold like midget Mike did every time he was called upon to do the right thing. permalink parent award report block reply\nMastaJoda 7 points 6 days ago So, expect the SC to fold like midget Mike did every time he was called upon to do the right thing. permalink parent award report block reply\nHangmhigh 2 points 6 days ago Why the Fk would we pay them?? Domestic importers paid that money. permalink award report block reply"}