{"id": "1ARK53LkTF", "contents": "620 BREAKING: Ukrainian parliament passed a bill that prohibits journalists from investigating corruption. \n\n- Any media coverage of corruption in the country is prohibited. \n\n- People involved in corruption investigations have right to request the removal of materials containing criticism or exposure. posted 5 days ago by Royall 29 comments award share download report block\n29 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style deleted 19 points 5 days ago IForgotToAddAnEmail 4 points 5 days ago But big bad soviet union. permalink parent award report block reply tchouk 3 points 5 days ago Like half the soviet leadership was from Ukraine. And it is still the most soviet of the soviet republics aside from Belarus. permalink parent award report block reply Transparency 1 points 5 days ago IMO, it's now past time for us to hand Ukraine over to Russia on a silver platter. Problem is that TPTB of the WEST LOVE the depth and breath of Ukraine's corruption. permalink parent award report block reply MarshallB 10 points 5 days ago CORRUPT Audit on it's way. Hollywood writers on their way. permalink award report block reply NotYourMan 7 points 5 days ago They don't have elections in Ukraine.  Its a dictatorship now. permalink parent award report block reply tchouk 3 points 5 days ago Always has been. permalink parent award report block reply MarshallB 1 points 5 days ago So like Blue States Election here? permalink parent award report block reply billybaldwin2 9 points 5 days ago It's fun watching movies from 10 - 15 years ago and seeing all the mobsters are Ukrainian. Harold & Kumar's White Christmas comes to mind. AI refuses to cite me examples. permalink award report block reply Pats5x 4 points 5 days ago And Trump and Congress are going to keep the gravy train going no doubt permalink award report block reply knnbccb 4 points 5 days ago Now you know why Zel needs the war to not stop. He has made plenty of enemies in Ukraine. He needs to keep up his 'war hero' persona, for his own survival. Should have taken my advice long ago. Stolen election and Biden regime was bad. But it has been many months after Trump's inauguration. You need to make hard decisions. https://forum.policiesforpeople.com/t/drone-zelensky/25276 permalink award report block reply duckduck 3 points 5 days ago That's what Democrats want here. They support Ukraine. permalink award report block reply TheSwampThang 2 points 5 days ago Just remember Zelensky can have his coke money but air traffic controllers and people too disabled to work have to just suck it up. permalink award report block reply Urinetensions 2 points 5 days ago Gonzalo Lira might prefer arrest to murder... permalink award report block reply shadowbanana 2 points 5 days ago CRP was an idiot that got what he deserved. You guys obviously don't know the guys history and it shows. permalink parent award report block reply Im_Not_Rattled 2 points 5 days ago Nothing screams total corruption like outlawing investigating for corruption. permalink award report block reply Oldman1234 1 points 5 days ago No wonder Democrats admire Zelensky so much.  He's called off elections so his party can stay in power indefinitely, jailed his political opponents, arrested anyone who dares speak out against him, censored free speech, controls all news media and newspapers, regulates the internet, and he's now made it illegal to investigate corruption!  A Democrat Party wet dream! permalink award report block reply josiborg 1 points 5 days ago It's like they get their legal consulting from Obama and Hunter permalink award report block reply Idontevenknow 1 points 5 days ago obvious squeaky clean is obvious permalink award report block reply mass55th 1 points 5 days ago In July of this year, Zelensky signed a Bill that effectively stripped Ukraine’s key anti-corruption bodies, the National Anti-Corruption Bureau (NABU) and the Specialized Anti-Corruption Prosecutor's Office (SAPO) of independence. Thousands of Ukrainians poured onto the streets to protest this move. The protests lasted several days. Ukraine's Parliament was forced to pass a new Bill that restored the independence of those two agencies, however, the Bill also required polygraphs for officers. Now this. It's obvious Zelensky and the Ukraine Parliament are colluding to hide the corruption that is taking place in the government. Every 90 days, the Ukraine Parliament extends martial law in the country, and Zelensky signs that extension. He's signed 17 martial law extensions so far. The longer the Parliament and Zelensky can keep this charade going, the people of Ukraine can't vote get rid of the shit their government is doing. Recently, I read an article that they have been arresting people who enter closed Orthodox Churches to pray. permalink award report block reply Liberats 1 points 5 days ago This is going to put Ukraine at number 1 in the globalists NWO of countries following their rules. permalink award report block reply TheTelltaleFly 1 points 5 days ago United States Congress learning to use Copy-Paste as soon as they get back to work. permalink award report block reply Riehlpissed 1 points 5 days ago What a commie thing to do. permalink award report block reply Wizard_Glick 1 points 5 days ago Coming to a state near you! permalink award report block reply Formerlurker92 1 points 5 days ago As part of the peace treaty we should mandate the execution of all government officials permalink award report block reply\ndeleted 19 points 5 days ago IForgotToAddAnEmail 4 points 5 days ago But big bad soviet union. permalink parent award report block reply tchouk 3 points 5 days ago Like half the soviet leadership was from Ukraine. And it is still the most soviet of the soviet republics aside from Belarus. permalink parent award report block reply Transparency 1 points 5 days ago IMO, it's now past time for us to hand Ukraine over to Russia on a silver platter. Problem is that TPTB of the WEST LOVE the depth and breath of Ukraine's corruption. permalink parent award report block reply\nIForgotToAddAnEmail 4 points 5 days ago But big bad soviet union. permalink parent award report block reply tchouk 3 points 5 days ago Like half the soviet leadership was from Ukraine. And it is still the most soviet of the soviet republics aside from Belarus. permalink parent award report block reply Transparency 1 points 5 days ago IMO, it's now past time for us to hand Ukraine over to Russia on a silver platter. Problem is that TPTB of the WEST LOVE the depth and breath of Ukraine's corruption. permalink parent award report block reply\ntchouk 3 points 5 days ago Like half the soviet leadership was from Ukraine. And it is still the most soviet of the soviet republics aside from Belarus. permalink parent award report block reply\nTransparency 1 points 5 days ago IMO, it's now past time for us to hand Ukraine over to Russia on a silver platter. Problem is that TPTB of the WEST LOVE the depth and breath of Ukraine's corruption. permalink parent award report block reply\nMarshallB 10 points 5 days ago CORRUPT Audit on it's way. Hollywood writers on their way. permalink award report block reply NotYourMan 7 points 5 days ago They don't have elections in Ukraine.  Its a dictatorship now. permalink parent award report block reply tchouk 3 points 5 days ago Always has been. permalink parent award report block reply MarshallB 1 points 5 days ago So like Blue States Election here? permalink parent award report block reply\nNotYourMan 7 points 5 days ago They don't have elections in Ukraine.  Its a dictatorship now. permalink parent award report block reply tchouk 3 points 5 days ago Always has been. permalink parent award report block reply MarshallB 1 points 5 days ago So like Blue States Election here? permalink parent award report block reply\ntchouk 3 points 5 days ago Always has been. permalink parent award report block reply\nMarshallB 1 points 5 days ago So like Blue States Election here? permalink parent award report block reply\nbillybaldwin2 9 points 5 days ago It's fun watching movies from 10 - 15 years ago and seeing all the mobsters are Ukrainian. Harold & Kumar's White Christmas comes to mind. AI refuses to cite me examples. permalink award report block reply\nPats5x 4 points 5 days ago And Trump and Congress are going to keep the gravy train going no doubt permalink award report block reply\nknnbccb 4 points 5 days ago Now you know why Zel needs the war to not stop. He has made plenty of enemies in Ukraine. He needs to keep up his 'war hero' persona, for his own survival. Should have taken my advice long ago. Stolen election and Biden regime was bad. But it has been many months after Trump's inauguration. You need to make hard decisions. https://forum.policiesforpeople.com/t/drone-zelensky/25276 permalink award report block reply\nduckduck 3 points 5 days ago That's what Democrats want here. They support Ukraine. permalink award report block reply\nTheSwampThang 2 points 5 days ago Just remember Zelensky can have his coke money but air traffic controllers and people too disabled to work have to just suck it up. permalink award report block reply\nUrinetensions 2 points 5 days ago Gonzalo Lira might prefer arrest to murder... permalink award report block reply shadowbanana 2 points 5 days ago CRP was an idiot that got what he deserved. You guys obviously don't know the guys history and it shows. permalink parent award report block reply\nshadowbanana 2 points 5 days ago CRP was an idiot that got what he deserved. You guys obviously don't know the guys history and it shows. permalink parent award report block reply\nIm_Not_Rattled 2 points 5 days ago Nothing screams total corruption like outlawing investigating for corruption. permalink award report block reply\nOldman1234 1 points 5 days ago No wonder Democrats admire Zelensky so much.  He's called off elections so his party can stay in power indefinitely, jailed his political opponents, arrested anyone who dares speak out against him, censored free speech, controls all news media and newspapers, regulates the internet, and he's now made it illegal to investigate corruption!  A Democrat Party wet dream! permalink award report block reply\njosiborg 1 points 5 days ago It's like they get their legal consulting from Obama and Hunter permalink award report block reply\nIdontevenknow 1 points 5 days ago obvious squeaky clean is obvious permalink award report block reply\nmass55th 1 points 5 days ago In July of this year, Zelensky signed a Bill that effectively stripped Ukraine’s key anti-corruption bodies, the National Anti-Corruption Bureau (NABU) and the Specialized Anti-Corruption Prosecutor's Office (SAPO) of independence. Thousands of Ukrainians poured onto the streets to protest this move. The protests lasted several days. Ukraine's Parliament was forced to pass a new Bill that restored the independence of those two agencies, however, the Bill also required polygraphs for officers. Now this. It's obvious Zelensky and the Ukraine Parliament are colluding to hide the corruption that is taking place in the government. Every 90 days, the Ukraine Parliament extends martial law in the country, and Zelensky signs that extension. He's signed 17 martial law extensions so far. The longer the Parliament and Zelensky can keep this charade going, the people of Ukraine can't vote get rid of the shit their government is doing. Recently, I read an article that they have been arresting people who enter closed Orthodox Churches to pray. permalink award report block reply\nLiberats 1 points 5 days ago This is going to put Ukraine at number 1 in the globalists NWO of countries following their rules. permalink award report block reply\nTheTelltaleFly 1 points 5 days ago United States Congress learning to use Copy-Paste as soon as they get back to work. permalink award report block reply\nRiehlpissed 1 points 5 days ago What a commie thing to do. permalink award report block reply\nWizard_Glick 1 points 5 days ago Coming to a state near you! permalink award report block reply\nFormerlurker92 1 points 5 days ago As part of the peace treaty we should mandate the execution of all government officials permalink award report block reply"}