{"id": "1ARK9pgQAa", "contents": "40 Get ready for 2008 again! 620 credit score is off the table now. (nationalmortgageprofessional.com) posted 2 hours ago by Here_we_go 10 comments award share report block Fannie Mae Ending Its Hard 620 Score Cutoff Starting next week, Fannie Mae is eliminating its minimum 620 credit score requirement for borrowers seeking loans that will be sold to the government-sponsored enterprise (GSE).The move, which is in line with a previous change at Freddie Mac, is designed ... nationalmortgageprofessional.com\n10 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno armyofpedes4usa 5 points 2 hours ago Barney Frank is smiling. permalink award report block reply sobriquet 3 points 2 hours ago With his nipples protruding permalink parent award report block reply armyofpedes4usa 2 points 1 hour ago Very disrespectful. permalink parent award report block reply kamalas_knees 2 points 2 hours ago Standing by with cash to buy more rental property. permalink award report block reply Here_we_go OP 1 points 2 hours ago Exactly this. permalink parent award report block reply someguy7738 2 points 55 minutes ago Gotta keep that bubble inflated! permalink award report block reply starjello 1 points 49 minutes ago This is part of the plan. This is why the deep state allowed Trump back in. They're going to implode the economy under him it is so damn obvious. What a great plan for the retards over at the gay awakening to trust permalink award report block reply suckmycorona 1 points 45 minutes ago It’s been played out this same way since Reagan. permalink parent award report block reply starjello 1 points 44 minutes ago Been played out a lot longer than before Reagan. Life didn't start when you were born. They're going to pull the trigger under Trump this house of cards is going to come down. permalink parent award report block reply Logan051361 1 points 2 hours ago I dont think it will get that bad. permalink award report block reply Here_we_go OP 2 points 2 hours ago No doc mortgage was crazy. But no hard credit score is equally retarded. permalink parent award report block reply\narmyofpedes4usa 5 points 2 hours ago Barney Frank is smiling. permalink award report block reply sobriquet 3 points 2 hours ago With his nipples protruding permalink parent award report block reply armyofpedes4usa 2 points 1 hour ago Very disrespectful. permalink parent award report block reply\nsobriquet 3 points 2 hours ago With his nipples protruding permalink parent award report block reply armyofpedes4usa 2 points 1 hour ago Very disrespectful. permalink parent award report block reply\narmyofpedes4usa 2 points 1 hour ago Very disrespectful. permalink parent award report block reply\nkamalas_knees 2 points 2 hours ago Standing by with cash to buy more rental property. permalink award report block reply Here_we_go OP 1 points 2 hours ago Exactly this. permalink parent award report block reply\nHere_we_go OP 1 points 2 hours ago Exactly this. permalink parent award report block reply\nsomeguy7738 2 points 55 minutes ago Gotta keep that bubble inflated! permalink award report block reply\nstarjello 1 points 49 minutes ago This is part of the plan. This is why the deep state allowed Trump back in. They're going to implode the economy under him it is so damn obvious. What a great plan for the retards over at the gay awakening to trust permalink award report block reply suckmycorona 1 points 45 minutes ago It’s been played out this same way since Reagan. permalink parent award report block reply starjello 1 points 44 minutes ago Been played out a lot longer than before Reagan. Life didn't start when you were born. They're going to pull the trigger under Trump this house of cards is going to come down. permalink parent award report block reply\nsuckmycorona 1 points 45 minutes ago It’s been played out this same way since Reagan. permalink parent award report block reply starjello 1 points 44 minutes ago Been played out a lot longer than before Reagan. Life didn't start when you were born. They're going to pull the trigger under Trump this house of cards is going to come down. permalink parent award report block reply\nstarjello 1 points 44 minutes ago Been played out a lot longer than before Reagan. Life didn't start when you were born. They're going to pull the trigger under Trump this house of cards is going to come down. permalink parent award report block reply\nLogan051361 1 points 2 hours ago I dont think it will get that bad. permalink award report block reply Here_we_go OP 2 points 2 hours ago No doc mortgage was crazy. But no hard credit score is equally retarded. permalink parent award report block reply\nHere_we_go OP 2 points 2 hours ago No doc mortgage was crazy. But no hard credit score is equally retarded. permalink parent award report block reply"}