{"id": "1ARK54U9G2", "contents": "779 Pretty Neat posted 5 days ago by sjw_injection 37 comments award share report block Oliver Burdick @oliverburdick • 6d Left side is a human lung. Right side is a tree. The tree breathes in what the lung breathes out. The lung breathes in what the tree breathes out. God's design is incredible.\n37 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno dburt2 31 points 5 days ago Yes, Gods design is wonderful and frugal. permalink award report block reply Tardigrade 7 points 5 days ago Parsimonious even. permalink parent award report block reply Mortal_Wombat 5 points 5 days ago Now do mycelium and the mychorrhizal relationships underground 😉 permalink parent award report block reply Livereating_johnson 1 points 5 days ago Total fucking bullshit though. Trees breath oxygen the same as we do. Its called respiration. They just so happen to create more oxygen than they use when making their carbohydrates from CO2 and H2O. permalink parent award report block reply anotherthing 1 points 4 days ago You're downvoted, but you're right. During the day, trees use sunlight, water and CO2 to fix sugars to store that energy. At night, they do respiration where they take oxygen in and break down those sugars for the energy they need to grow similar to what animals do. This is why hospitals limit the amount of plants patients can have in their hospital rooms. During the day, everything is fine. At night, the plants start sucking up the oxygen in the room. https://www.pthorticulture.com/en-us/training-center/basics-of-plant-respiration It's almost like people never bothered to wonder where the carbohydrates in vegetables come from and why the plants need those carbohydrates. Photosynthesis is CO2 + H2O + energy = carbohydrate. Respiration is Carbohydrate + 02 = H20 + CO2 + Energy. permalink parent award report block reply Zskills 24 points 5 days ago Maximizing surface area being the common factor permalink award report block reply MAGABOND 14 points 5 days ago This photo is one of the reasons I became a believer, after a long journey of enlightenment. permalink award report block reply Constantin2024 1 points 5 days ago Stephen Meyer's lectures were what did it for me. The tiny machines within the mitochondria blew my mind. permalink parent award report block reply Madnote1984 14 points 5 days ago Here's another fact: grasses actually inhale more carbon and output more oxygen than trees do. Grasses have a natural growth spurt where they grow extremely fast. Any man who mows his lawn knows that the grass grows like crazy after being cut, but after it gets long, it slows down. They think the yearly greening of large grasslands like the steps of mongolia, the African savannah, or the North American plains does more for oxygen/c02 cycle than the rainforests. permalink award report block reply TooLazy 7 points 5 days ago I have heard that algae produces more oxygen than trees. I always thought it was because of the volume of it, but it would make sense that the shorter life cycle would drive that as well. permalink parent award report block reply SPEDMan64 3 points 5 days ago Phytoplankton is what you're thinking of. The oceans are full of it. permalink parent award report block reply Constantin2024 4 points 5 days ago And that the large herds of herbivores were designed to keep them all cropped to ensure the cycle continued. Once you see the delicate cycles of nature, I don't understand how anyone can continue to claim there is no God. permalink parent award report block reply AmericanJawa 1 points 5 days ago Any man who mows his lawn knows that the grass grows like crazy after being cut, but after it gets long, it slows down. As someone who mows a lawn, I have not in fact ever noticed this. permalink parent award report block reply Madnote1984 3 points 5 days ago It's called the vegitative stage. During that time the plant puts all of its energy into growth. At a certain point, growth slows and it begins to sprout and seed. During the reproductive phase, growth in height/thickness slows as the grass puts more energy into seed production. permalink parent award report block reply SicSemperTyrannis2 0 points 4 days ago Cannabis does WAY more. In 6 months of growth cannabis sequesters as much CO2 as trees will in 30 years. permalink parent award report block reply 4022a 10 points 5 days ago its math bro permalink award report block reply Standingoak 5 points 5 days ago It's ALL Math...if only we could count. permalink parent award report block reply NadlersNads 10 points 5 days ago I saw a cool lecture video of a guy holding up fruits and nuts and what the body does with them.. they all looked like the organ they impacted the most. Walnuts look like brains etc permalink award report block reply Constantin2024 1 points 5 days ago Do you have a link? I'd really like to see that video. permalink parent award report block reply NadlersNads 1 points 5 days ago No i saw it a couple yrs back and dont know how to find it permalink parent award report block reply SPEDMan64 1 points 5 days ago So my eating bananas is why my nipples are long and curvy? permalink parent award report block reply fluffykitten 9 points 5 days ago Wait 'til you see the MRI image of my nuts permalink award report block reply Say_what_again 19 points 5 days ago Scan failed due to signal too low (MRI engineer here) 😛 permalink parent award report block reply GreatestAmericanHero 3 points 5 days ago Truly God's greatest work. permalink parent award report block reply kanikilee2024 6 points 5 days ago AMEN BROTHER! permalink award report block reply Constantin2024 6 points 5 days ago Even the leading mathematicians will freely admit that math was discovered, not created. God made a universe based on mathematic principles that we humans are capable of understanding. If that's not \"made in the image of\" I don't know what is. permalink award report block reply Shitsbrokeyo 5 points 5 days ago Quick, fill it with vape oil! permalink award report block reply Aisle-is-closed 5 points 5 days ago One looks at the Mona Lisa and contemplates the inspiration of the artist. You can even glance at some smears of baby food and know a baby did it. But look at nature and the midwit decides it can only time, matter and chaos. That which is ordered has a creator. permalink award report block reply WeaponizedSmirk 3 points 5 days ago Almost all the oxygen on the planet comes from algae. permalink award report block reply no_antifa 3 points 5 days ago They’re the same Creation. It is the mind that chops up experience into this/that. permalink award report block reply Ritchie_Blackadder 2 points 5 days ago Can confirm, I have watched trees breathe. permalink award report block reply MiserySnake 1 points 5 days ago As above, so below. permalink award report block reply greenroomsh 1 points 5 days ago Amen! permalink award report block reply lustmorden 1 points 5 days ago Fractals. They're mindblowing. permalink award report block reply doug2 -3 points 5 days ago Because two things remotely resemble eachother god? This is such bullshit. We know how lungs evolved. We know how trees evolved. If god designed them, why did they evolve? You people are low iq when it comes to this shit permalink award report block reply TenchuStealthAss 3 points 5 days ago No, you're retarded.\nThe more you look at shit, the clearer it is that shit was programmed/created by God to \"evolve\" (develop) to the potential that they were designed to reach. It's pretty obvious that we were intentionally created to only be able to understand life from our level/perspective because we'd be overwhelmed by how much life exists all around us on an infinite number of levels. permalink parent award report block reply SicSemperTyrannis2 0 points 4 days ago You also believe the official narrative about 9/11, the Vegas shooter, and elections. permalink parent award report block reply\ndburt2 31 points 5 days ago Yes, Gods design is wonderful and frugal. permalink award report block reply Tardigrade 7 points 5 days ago Parsimonious even. permalink parent award report block reply Mortal_Wombat 5 points 5 days ago Now do mycelium and the mychorrhizal relationships underground 😉 permalink parent award report block reply Livereating_johnson 1 points 5 days ago Total fucking bullshit though. Trees breath oxygen the same as we do. Its called respiration. They just so happen to create more oxygen than they use when making their carbohydrates from CO2 and H2O. permalink parent award report block reply anotherthing 1 points 4 days ago You're downvoted, but you're right. During the day, trees use sunlight, water and CO2 to fix sugars to store that energy. At night, they do respiration where they take oxygen in and break down those sugars for the energy they need to grow similar to what animals do. This is why hospitals limit the amount of plants patients can have in their hospital rooms. During the day, everything is fine. At night, the plants start sucking up the oxygen in the room. https://www.pthorticulture.com/en-us/training-center/basics-of-plant-respiration It's almost like people never bothered to wonder where the carbohydrates in vegetables come from and why the plants need those carbohydrates. Photosynthesis is CO2 + H2O + energy = carbohydrate. Respiration is Carbohydrate + 02 = H20 + CO2 + Energy. permalink parent award report block reply\nTardigrade 7 points 5 days ago Parsimonious even. permalink parent award report block reply Mortal_Wombat 5 points 5 days ago Now do mycelium and the mychorrhizal relationships underground 😉 permalink parent award report block reply\nMortal_Wombat 5 points 5 days ago Now do mycelium and the mychorrhizal relationships underground 😉 permalink parent award report block reply\nLivereating_johnson 1 points 5 days ago Total fucking bullshit though. Trees breath oxygen the same as we do. Its called respiration. They just so happen to create more oxygen than they use when making their carbohydrates from CO2 and H2O. permalink parent award report block reply anotherthing 1 points 4 days ago You're downvoted, but you're right. During the day, trees use sunlight, water and CO2 to fix sugars to store that energy. At night, they do respiration where they take oxygen in and break down those sugars for the energy they need to grow similar to what animals do. This is why hospitals limit the amount of plants patients can have in their hospital rooms. During the day, everything is fine. At night, the plants start sucking up the oxygen in the room. https://www.pthorticulture.com/en-us/training-center/basics-of-plant-respiration It's almost like people never bothered to wonder where the carbohydrates in vegetables come from and why the plants need those carbohydrates. Photosynthesis is CO2 + H2O + energy = carbohydrate. Respiration is Carbohydrate + 02 = H20 + CO2 + Energy. permalink parent award report block reply\nanotherthing 1 points 4 days ago You're downvoted, but you're right. During the day, trees use sunlight, water and CO2 to fix sugars to store that energy. At night, they do respiration where they take oxygen in and break down those sugars for the energy they need to grow similar to what animals do. This is why hospitals limit the amount of plants patients can have in their hospital rooms. During the day, everything is fine. At night, the plants start sucking up the oxygen in the room. https://www.pthorticulture.com/en-us/training-center/basics-of-plant-respiration It's almost like people never bothered to wonder where the carbohydrates in vegetables come from and why the plants need those carbohydrates. Photosynthesis is CO2 + H2O + energy = carbohydrate. Respiration is Carbohydrate + 02 = H20 + CO2 + Energy. permalink parent award report block reply\nZskills 24 points 5 days ago Maximizing surface area being the common factor permalink award report block reply\nMAGABOND 14 points 5 days ago This photo is one of the reasons I became a believer, after a long journey of enlightenment. permalink award report block reply Constantin2024 1 points 5 days ago Stephen Meyer's lectures were what did it for me. The tiny machines within the mitochondria blew my mind. permalink parent award report block reply\nConstantin2024 1 points 5 days ago Stephen Meyer's lectures were what did it for me. The tiny machines within the mitochondria blew my mind. permalink parent award report block reply\nMadnote1984 14 points 5 days ago Here's another fact: grasses actually inhale more carbon and output more oxygen than trees do. Grasses have a natural growth spurt where they grow extremely fast. Any man who mows his lawn knows that the grass grows like crazy after being cut, but after it gets long, it slows down. They think the yearly greening of large grasslands like the steps of mongolia, the African savannah, or the North American plains does more for oxygen/c02 cycle than the rainforests. permalink award report block reply TooLazy 7 points 5 days ago I have heard that algae produces more oxygen than trees. I always thought it was because of the volume of it, but it would make sense that the shorter life cycle would drive that as well. permalink parent award report block reply SPEDMan64 3 points 5 days ago Phytoplankton is what you're thinking of. The oceans are full of it. permalink parent award report block reply Constantin2024 4 points 5 days ago And that the large herds of herbivores were designed to keep them all cropped to ensure the cycle continued. Once you see the delicate cycles of nature, I don't understand how anyone can continue to claim there is no God. permalink parent award report block reply AmericanJawa 1 points 5 days ago Any man who mows his lawn knows that the grass grows like crazy after being cut, but after it gets long, it slows down. As someone who mows a lawn, I have not in fact ever noticed this. permalink parent award report block reply Madnote1984 3 points 5 days ago It's called the vegitative stage. During that time the plant puts all of its energy into growth. At a certain point, growth slows and it begins to sprout and seed. During the reproductive phase, growth in height/thickness slows as the grass puts more energy into seed production. permalink parent award report block reply SicSemperTyrannis2 0 points 4 days ago Cannabis does WAY more. In 6 months of growth cannabis sequesters as much CO2 as trees will in 30 years. permalink parent award report block reply\nTooLazy 7 points 5 days ago I have heard that algae produces more oxygen than trees. I always thought it was because of the volume of it, but it would make sense that the shorter life cycle would drive that as well. permalink parent award report block reply SPEDMan64 3 points 5 days ago Phytoplankton is what you're thinking of. The oceans are full of it. permalink parent award report block reply\nSPEDMan64 3 points 5 days ago Phytoplankton is what you're thinking of. The oceans are full of it. permalink parent award report block reply\nConstantin2024 4 points 5 days ago And that the large herds of herbivores were designed to keep them all cropped to ensure the cycle continued. Once you see the delicate cycles of nature, I don't understand how anyone can continue to claim there is no God. permalink parent award report block reply\nAmericanJawa 1 points 5 days ago Any man who mows his lawn knows that the grass grows like crazy after being cut, but after it gets long, it slows down. As someone who mows a lawn, I have not in fact ever noticed this. permalink parent award report block reply Madnote1984 3 points 5 days ago It's called the vegitative stage. During that time the plant puts all of its energy into growth. At a certain point, growth slows and it begins to sprout and seed. During the reproductive phase, growth in height/thickness slows as the grass puts more energy into seed production. permalink parent award report block reply\nMadnote1984 3 points 5 days ago It's called the vegitative stage. During that time the plant puts all of its energy into growth. At a certain point, growth slows and it begins to sprout and seed. During the reproductive phase, growth in height/thickness slows as the grass puts more energy into seed production. permalink parent award report block reply\nSicSemperTyrannis2 0 points 4 days ago Cannabis does WAY more. In 6 months of growth cannabis sequesters as much CO2 as trees will in 30 years. permalink parent award report block reply\n4022a 10 points 5 days ago its math bro permalink award report block reply Standingoak 5 points 5 days ago It's ALL Math...if only we could count. permalink parent award report block reply\nStandingoak 5 points 5 days ago It's ALL Math...if only we could count. permalink parent award report block reply\nNadlersNads 10 points 5 days ago I saw a cool lecture video of a guy holding up fruits and nuts and what the body does with them.. they all looked like the organ they impacted the most. Walnuts look like brains etc permalink award report block reply Constantin2024 1 points 5 days ago Do you have a link? I'd really like to see that video. permalink parent award report block reply NadlersNads 1 points 5 days ago No i saw it a couple yrs back and dont know how to find it permalink parent award report block reply SPEDMan64 1 points 5 days ago So my eating bananas is why my nipples are long and curvy? permalink parent award report block reply\nConstantin2024 1 points 5 days ago Do you have a link? I'd really like to see that video. permalink parent award report block reply NadlersNads 1 points 5 days ago No i saw it a couple yrs back and dont know how to find it permalink parent award report block reply\nNadlersNads 1 points 5 days ago No i saw it a couple yrs back and dont know how to find it permalink parent award report block reply\nSPEDMan64 1 points 5 days ago So my eating bananas is why my nipples are long and curvy? permalink parent award report block reply\nfluffykitten 9 points 5 days ago Wait 'til you see the MRI image of my nuts permalink award report block reply Say_what_again 19 points 5 days ago Scan failed due to signal too low (MRI engineer here) 😛 permalink parent award report block reply GreatestAmericanHero 3 points 5 days ago Truly God's greatest work. permalink parent award report block reply\nSay_what_again 19 points 5 days ago Scan failed due to signal too low (MRI engineer here) 😛 permalink parent award report block reply\nGreatestAmericanHero 3 points 5 days ago Truly God's greatest work. permalink parent award report block reply\nkanikilee2024 6 points 5 days ago AMEN BROTHER! permalink award report block reply\nConstantin2024 6 points 5 days ago Even the leading mathematicians will freely admit that math was discovered, not created. God made a universe based on mathematic principles that we humans are capable of understanding. If that's not \"made in the image of\" I don't know what is. permalink award report block reply\nShitsbrokeyo 5 points 5 days ago Quick, fill it with vape oil! permalink award report block reply\nAisle-is-closed 5 points 5 days ago One looks at the Mona Lisa and contemplates the inspiration of the artist. You can even glance at some smears of baby food and know a baby did it. But look at nature and the midwit decides it can only time, matter and chaos. That which is ordered has a creator. permalink award report block reply\nWeaponizedSmirk 3 points 5 days ago Almost all the oxygen on the planet comes from algae. permalink award report block reply\nno_antifa 3 points 5 days ago They’re the same Creation. It is the mind that chops up experience into this/that. permalink award report block reply\nRitchie_Blackadder 2 points 5 days ago Can confirm, I have watched trees breathe. permalink award report block reply\nMiserySnake 1 points 5 days ago As above, so below. permalink award report block reply\ngreenroomsh 1 points 5 days ago Amen! permalink award report block reply\nlustmorden 1 points 5 days ago Fractals. They're mindblowing. permalink award report block reply\ndoug2 -3 points 5 days ago Because two things remotely resemble eachother god? This is such bullshit. We know how lungs evolved. We know how trees evolved. If god designed them, why did they evolve? You people are low iq when it comes to this shit permalink award report block reply TenchuStealthAss 3 points 5 days ago No, you're retarded.\nThe more you look at shit, the clearer it is that shit was programmed/created by God to \"evolve\" (develop) to the potential that they were designed to reach. It's pretty obvious that we were intentionally created to only be able to understand life from our level/perspective because we'd be overwhelmed by how much life exists all around us on an infinite number of levels. permalink parent award report block reply SicSemperTyrannis2 0 points 4 days ago You also believe the official narrative about 9/11, the Vegas shooter, and elections. permalink parent award report block reply\nTenchuStealthAss 3 points 5 days ago No, you're retarded.\nThe more you look at shit, the clearer it is that shit was programmed/created by God to \"evolve\" (develop) to the potential that they were designed to reach. It's pretty obvious that we were intentionally created to only be able to understand life from our level/perspective because we'd be overwhelmed by how much life exists all around us on an infinite number of levels. permalink parent award report block reply\nSicSemperTyrannis2 0 points 4 days ago You also believe the official narrative about 9/11, the Vegas shooter, and elections. permalink parent award report block reply"}