{"id": "1ARK55acAZ", "contents": "1728 The Trump administration now has at least 175 investigations into H-1B VISA ABUSE by companies seeking to replace American jobs with foreigners. \n\nGood. We need MORE! posted 5 days ago by PiratePatriotParrot 178 comments award share report block Eric Daugherty @EricLDaugh • 5d 🚨 JUST IN: The Trump administration now has at least 175 investigations into H-1B VISA ABUSE by companies seeking to replace American jobs with foreigners. Good. We need MORE!\n178 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style john9985 109 points 5 days ago Add about four more zeros permalink award report block reply DT170x 57 points 5 days ago Just add another zero just in case. permalink parent award report block reply Govtizbad 44 points 5 days ago edit: I'm being downvoted by feds and commies. Updoot! You know how there's all those job listings that seem to be a black void and people apply and never hear back? For how there will be job listings for like entry-level jobs requiring 50 years of experience in a program that only existed for 10? Or non-entry level jobs but paying entry level wages? That's because legally these companies cannot hire H1B unless they first opened it up to Americans.. so they create these BS job listings withoutrageous qualifications that nobody could meet or that the few people who can meet that aren't going to work for such little money and then when predictably no Americans apply and know Americans could meet the qualifications they then go out and hire the Indian workers for pennies on the dollar like they wanted to in the first place permalink parent award report block reply CS_McFisticuffs_III 35 points 5 days ago Need to make H1B so expensive to obtain and retain that it makes no sense to hire one unless there is literally nobody in the country capable of doing the job. permalink parent award report block reply Vorticity1 14 points 5 days ago Exactly. They take away from an American. permalink parent award report block reply view 1 more comments... mohel 8 points 5 days ago A lot of companies hiring H1Bs pay no taxes as they make no profits and exit via inflated IPOs/acquisitions. Had RINOs decided to tax them on their H1B employees we could have a nice conversation. Too bad RINOs are too dumb for such moves. permalink parent award report block reply view 1 more comments... Aquamine-Amarine 13 points 5 days ago This is a huge problem. The only solution is to make it extremely expensive to hire someone that isn't an American. Fine the fuck out of that company for every H1B they have. Make them realize it's cheaper to hire the American. They only learn if you hurt them financially. permalink parent award report block reply negative_entropy 5 points 5 days ago one of the worst things Trump did was to take away the Section174A R&D tax exemption for hiring domestically (part of the 2017 tax bill), it was taken away cuz companies got tax cuts, but removing the special domestic tax exemption caused it to be even cheaper to hire foreigners. it was only restored as part of the BBB in July. permalink parent award report block reply PiratePatriotParrot OP 11 points 5 days ago Yup, no why idiots are down voting those truths permalink parent award report block reply Jmricht 3 points 5 days ago Prime Therapeutics. permalink parent award report block reply Shitsbrokeyo 3 points 5 days ago There was a scattergraph on here yesterday. Pull that bitch up. It's BAD. permalink parent award report block reply load 1 more comments... BeauHD 21 points 5 days ago Go after TCS. They fire all the Americans at big corps and replace them with smelly jeets. permalink parent award report block reply LawyersPlayDota 21 points 5 days ago Companies, not cases. The ones abusing the system are scummy middlemen that fake a bunch of applicants' qualifications and structure it to scam the government. permalink parent award report block reply Hikedelics 3 points 5 days ago Exactly. Depending on the companies, there could be 175,000 cases. Though something tells me they will be looking the other way for Amazon or other major offenders if they donated money to his campaign. permalink parent award report block reply SanityGumby 11 points 5 days ago It’s companies. These companies are likely each committing a thousand violations minimum depending if Microsoft, Amazon, cognizant, etc are on the list permalink parent award report block reply sixfingerdildo 2 points 5 days ago Honestly who wants to work for these scumbags permalink parent award report block reply Aoikaze2000 5 points 5 days ago Tbh, working for Microsoft was a rather sweet deal... Amazon OTOH, is a meatgrinder. permalink parent award report block reply SanityGumby 4 points 5 days ago Not me. I interviewed with Microsoft and before I even finished half the day's interviews I decided I was done and not interested. permalink parent award report block reply Bigstick7 3 points 5 days ago Anyone living in India to get to America. I've been to India it's literally like living in a garage dump. permalink parent award report block reply HoganT 1 points 5 days ago Violations of what, exactly? What law? H1B’s are legal to use. It’s stupid. But I’m just interested to find out what grounds this literal who is claiming were investigating them on. permalink parent award report block reply TheGamerToTheRight 6 points 5 days ago H1B is legal, but they have to follow specific rules. They can't just replace an American with a foreigner. They do lots of tricks to follow the letter, but not intention, of the law, such as advertising in local newspapers and then saying no qualified Americans exist when no one applies. Or requiring people to fax their resume to the immigration team if they find the hidden job board the job was posted on. H1B is a scam, and companies are engaging in borderline, if not actual, illegal practices to obtain the cut-rate foreigners. Why should Amazon be getting 10s of thousands of H1Bs, while laying off 30k Americans? permalink parent award report block reply HoganT 0 points 5 days ago Why should Amazon be getting 10s of thousands of H1Bs, while laying off 30k Americans? I don’t disagree. I’m just stating what you tacitly admitted in your reply here. It’s not illegal. If violating the spirit of a law, but not the letter, gets you in trouble, our entire corporate structure is in trouble. You’ll notice it is not, however. permalink parent award report block reply view 1 more comments... nemonster 2 points 5 days ago Need to hire more gvnmt people permalink parent award report block reply bananaguard62 2 points 5 days ago It started with call centers.  Bring those jobs back too. permalink parent award report block reply load 4 more comments... utfanx2 46 points 5 days ago Every H1B is fraudulent. permalink award report block reply henri_derelicte 21 points 5 days ago There’s been so many layoffs in positions/job sectors hiring from H1B that I’m struggling to see how they can justify saying there’s no American talent available. Hire these Americans as remote workers if you have to permalink parent award report block reply HelluvaEngineer 19 points 5 days ago Most people have no idea how bad it is.  I recently posted a job listing for an entry-level position and got 25 resumes in 2 hours.  Many applicants had 15-20 years of experience.  They have no work.  No one will hire a white person. There were also many grads with masters degrees in tech that are now working at places like tire shops as managers.  I felt really bad emailing one of those grads today and telling him that normally we would hire him but we have overqualified people competing at the same rate. permalink parent award report block reply PiratePatriotParrot OP 11 points 5 days ago 230 applications this year, 560 in 2023 permalink parent award report block reply Spicy_cat 10 points 5 days ago Any corporate creature that pushes DEI should be punished severely.  Heads should roll. permalink parent award report block reply user2827 7 points 5 days ago The last time I looked for work seriously, I was looking for engineering work for about 1 year, give or take a month, and would be applying to about every job where I was even tangentially qualified (ex; PLC programming, \"Oh, I've done that a couple times.\"). Over the year, it must have been 2-300 applications sent out, had about 10 interviews, when I finally got a call back for an offer I was flabbergasted... permalink parent award report block reply HelluvaEngineer 3 points 5 days ago Glad it worked out.  I had a brief exposure to PLCs. permalink parent award report block reply view 1 more comments... The_Bloofy_Bullshark 9 points 5 days ago I have American recent college grads reaching out to me for interviews and referrals. Problem is we don’t even have reqs open I can bring them in for. It’s insane bullshit. Somehow, though, I constantly get emails about how Sandeep Poo or Deepstink Singhe has just joined our org. It’s insane. permalink parent award report block reply HelluvaEngineer 7 points 5 days ago It's obvious racial discrimination.  They even discriminate by caste and region within their own country. permalink parent award report block reply flashersenpai 0 points 5 days ago sad LMAO permalink parent award report block reply booblitchutz 4 points 5 days ago Veddy soddy Saar, we are having no jobs here. permalink parent award report block reply TennesseeBorn 3 points 5 days ago Conspiracy. The approval part of \"yes, we agree you are having trouble hiring Americans for this role\" is completely compromised. permalink parent award report block reply Jack_NC 1 points 5 days ago Now that millions of Americans have been out of work for a year or two (or more!) due to H1Bs taking their place, they can say \"no relevant up-to-date experience: DISQUALIFIED!\" permalink parent award report block reply TrumpRideorDie74 7 points 5 days ago I feel the exact same way. permalink parent award report block reply DontDoxMeBro1 3 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply McFatty7 35 points 5 days ago Lol there's wayyyyy more than 175 cases of H-1B visa abuse. https://www.myvisajobs.com/reports/h1b/ permalink award report block reply SanityGumby 8 points 5 days ago It’s not cases retard. It’s 175 companies. They didn’t each only commit one violation permalink parent award report block reply maverick202 7 points 5 days ago Where does it say they're investigating 175 companies? The tweet says 175 investigations. On that note, All we have is tweet by this X grifter.. Is there a verifiable source of these investigations? permalink parent award report block reply UCantStumpTheTrump -1 points 5 days ago u/maverick202 is a self-admitted troll who comes here and insults our community, calling people “white trash” and “incels.” Hit that deport button! permalink parent award report block reply UCantStumpTheTrump 1 points 5 days ago The guy who replied to you, u/maverick202 is a self-admitted shill who says he comes here to “troll white trash.” He’s not here to debate in good faith permalink parent award report block reply maverick202 0 points 4 days ago This incel is trying hard to deport me. But I'm here enjoying his tears every morning, kek! permalink parent award report block reply GentleSlayer 28 points 5 days ago How about the fucking civil rights act. There are US companies where only Brahmin can work on certain code, or that only hire specific families from Bangalore. A whole company full of a particular tribe, foreign nationality, or religious sect is a flagrant violator.\nBiden's DOJ was even punishing companies for not hiring enough foreign nationals. permalink award report block reply Spicy_cat 19 points 5 days ago Trump's head of the DOJ Civil rights division is a woman from Punjab, India.  Harmeet Dhillon permalink parent award report block reply TrumpRideorDie74 12 points 5 days ago My stomach just bottomed out reading that 🤦🏼 permalink parent award report block reply SanityGumby -2 points 5 days ago Why. She is one of the only people in justice that seems to be doing anything permalink parent award report block reply YouEssAye 8 points 5 days ago Lol permalink parent award report block reply GentleSlayer 6 points 5 days ago Then send her after the other sects. permalink parent award report block reply Spicy_cat 6 points 5 days ago She hates white people the most and won't do anything to stop companies hiring H1B Indians instead of Americans. permalink parent award report block reply flashersenpai 1 points 5 days ago Harmeet has a good reputation. I'd have to see something big to believe she's getting in the way. permalink parent award report block reply Spicy_cat 1 points 4 days ago People were tweeting at her to do something about companies that were discriminating against Americans to get Indian H1Bs and she just responds \"blocked racist\" permalink parent award report block reply SanityGumby 2 points 5 days ago Need someone to sue or file an EEO complaint. permalink parent award report block reply GentleSlayer 2 points 5 days ago The courts established a process by which white peepo need documented proof to even file, while others just need the appearance of improper hiring. permalink parent award report block reply one_cool 2 points 5 days ago that was overthrown by us supreme court in june.  people dont know it yet.  there should be thousands of lawsuits. permalink parent award report block reply one_cool 1 points 5 days ago EEOC relies on state offices and where are all the jeet problems: blue states.  EEOC needs federalized.  right now they are saying they are shut down.  EEOC comission is designed worse than congress.  Even though libshits are not in power they ge ttwo of five seats and can block quorum to get anything done.  dem fuckers are literally blocking civil rights because they know whites are pissed. permalink parent award report block reply RandyMoss 15 points 5 days ago End the program. permalink award report block reply SanityGumby -2 points 5 days ago Usually to have justification for doing something that drastic it’s better to justify it. Like investigating a few hundred companies that are committing mass H1b fraud permalink parent award report block reply RandyMoss 6 points 5 days ago I'm not opposed to the investigations but we don't need justification to end a program designed to screw the American workers. Just fucking end it. I'm so tired of cowardly politicians. permalink parent award report block reply Jack_NC 1 points 5 days ago one word \"DREAMERS\" Obama invented that shit and you'd think it was carved into the backside of the 10 Commandments, or scrawled in George Washington's own blood across the front of the US Constitution. The courts refuse to shut down the DREAM immigration act because orange man bad, black muslim indonesian good. edit: the \"DREAM\" action is clearcut, but no court will allow its revocation. In the same way, any immigration policy change that would reverse the actions of a democrat will be overruled. The courts seem determined to flood America with 3rd world garbage (e.g. haiti). permalink parent award report block reply RandyMoss 1 points 5 days ago We are talking about H1B. Dreamers don't have anything to do with that. permalink parent award report block reply view 2 more comments... Bearing51 12 points 5 days ago Is Amazon or Microsoft included in any of these? permalink award report block reply The_Bloofy_Bullshark 6 points 5 days ago What’s funny (sad) is Amazon and Microsoft are Indian H1B shops. Meta is mostly Chinese. Nothing ever happens to them though. If you’re American and hired on, you’re almost certainly not making it to your cliff since you’ll be PIP long before that. permalink parent award report block reply DontDoxMeBro1 14 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply SanityGumby -9 points 5 days ago / u/f-b-i can you start banning the hundreds of turbo faggots that are saying this kind of shit non stop. It violates the site content policy and because not enough is being done it’s virtually every post flooded with these idiots. permalink parent award report block reply Awan-CIA-Car-Lot 6 points 5 days ago It's u/-f-b-i- The user you linked is banned, lol permalink parent award report block reply SanityGumby -1 points 5 days ago Thanks. It's the only mod I rarely ever see even show up. permalink parent award report block reply view 4 more comments... LongerThanTheNile 0 points 5 days ago Found the Pajeet crying for mods. Back to Reddit with you, soyboy. permalink parent award report block reply SanityGumby 1 points 5 days ago Based on your posts you are far more likely to be a pajeet than me. permalink parent award report block reply flashersenpai -1 points 5 days ago dont be so sensitive damn just downvote permalink parent award report block reply UntakenUsername 12 points 5 days ago I've trained my jeet replacement twice in my career. End this shit completely and immediately. Not a single foreigner should have a job in this country if a single American doesn't. permalink award report block reply obar1 7 points 5 days ago imagine waking up and going to work doing that shit.... I feel for you Fren... permalink parent award report block reply UntakenUsername 7 points 5 days ago In one case, it was 3 months of getting his access sorted and doing knowledge transfer. I sat next to this dude for 3 months who could barely speak English and smelled like an open grave. Not a fun time, I can assure you.\nThe other time wasn't much better. At least he could speak English enough to understand 90% of the time. I had a choice both times to train them or lose severance. permalink parent award report block reply LongerThanTheNile 1 points 5 days ago How long ago did this shit occur? And I don't suppose you'd want to name and shame? (Completely understand if you don't.) permalink parent award report block reply throat_GOAT_charlie 1 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply Aoikaze2000 8 points 5 days ago Time for the administration to gut the tech industry. permalink award report block reply throat_GOAT_charlie 1 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply Viewer01 7 points 5 days ago I made a post about this. A h1b got yoinked back to India at my work. It was not any kind of specialized role. Hell, they posted for a job that’s 90% outsourced over there. It’s a small long term win and a drop in the bucket, but it’s something. permalink award report block reply flashersenpai 0 points 5 days ago nice permalink parent award report block reply MathletesFoot 7 points 5 days ago That's 175 more than I was aware of. Why aren't they trumpeting this shit from the rooftops? permalink award report block reply TPMJB 9 points 5 days ago Because DaS rACiSt! All the curry worshippers are seething right now. permalink parent award report block reply SanityGumby 7 points 5 days ago Vance said he was going to make this happen as soon as someone told him Microsoft laid off 12k employees and immediately hired 9k Indians. Months ago. They are also going to ban anyone coming in with chronic illnesses without a specific visa to get healthcare and means testing. https://www.msn.com/en-us/health/other/immigrants-with-health-conditions-may-be-denied-visas-under-new-guidance/ar-AA1Q0pmv?ocid=BingNewsSerp permalink parent award report block reply FatigueIsReal -3 points 5 days ago That microsoft situation is still hilarious to me. That simple sentence isn't at all what happened, but oh well. I guess if it got people off their ass it doesn't matter how honest the reporting was. permalink parent award report block reply SanityGumby 6 points 5 days ago It literally did happen. Repeatedly. In July they laid off 9k American employees and immediately filed for nearly 14k H1bs. permalink parent award report block reply FatigueIsReal -2 points 5 days ago You just reversed your numbers. If you go and review it, the 13k layoffs included H1Bs and were in an entirely different part of the company from where the hiring was. Additionally a company can't directly \"hire H1Bs.\" They post jobs and if no americans apply they can consider H1Bs. Microsoft only has 5,000 H1B approvals in total in 2025.  The numbers you are posting are not numerically possible. permalink parent award report block reply view 2 more comments... DT170x 3 points 5 days ago News won't report any good news because it make Trump look good. Best bet to look at the rapidly growing alternative news market. permalink parent award report block reply one_cool 6 points 5 days ago i reported one large chip maker for having parallel hiring systems (one for jeets, one for everyone else)  I think they are investigating. permalink award report block reply Jack_NC 1 points 5 days ago If you look at the H1b jobs posted at https://www.myvisajobs.com/reports/h1b/ you'll be shocked at how many of them request a resume be sent to 'immigration@<companyname.com>' permalink parent award report block reply flashersenpai 0 points 5 days ago good job permalink parent award report block reply BuenoDrake 5 points 5 days ago Hammer Ebay and Microsoft permalink award report block reply DeportThemAllForever 6 points 5 days ago And Apple, Facebook, Amazon, ibm, ho, Oracle, .. every tech company. permalink parent award report block reply booblitchutz 3 points 5 days ago EVERY one permalink parent award report block reply Vorticity1 5 points 5 days ago How about 1 arrest Blondi? permalink award report block reply Bubbahax 5 points 5 days ago They could eliminate H1-Bs entirely and these companies would just offshore positions and keep hiring Indians. permalink award report block reply HelluvaEngineer 7 points 5 days ago At least they won't live around me. permalink parent award report block reply Foxbat 5 points 5 days ago How about we end all job based immigration? Ya there may be some one in a million job where the right person is hard to find. But guess what? Thats ok. It just means you need to train someone. Invest in your personnel. Pay your corporate taxes instead of trying to evade them. Hire American workers. permalink award report block reply knnbccb 5 points 5 days ago Once the jeets get into the HR department of a company, or assume the role of someone who makes hiring decisions, give it a few more years and that company will eventually be jeet-ified. It's an observable, empirical fact that can be replicated anywhere in the world. permalink award report block reply RusherOfDin 5 points 5 days ago I was restructured out of my company 5 years ago just before covid hit and I am not kidding when I say I was literally the last white guy in the building except for the building manager who was in charge of making sure the HVAC worked and the elevators went up and down. The break room was like New Delhi. Nobody even bothered speaking English anymore. That was after 12 years at that company. Luckily with all the extra covid unemployment money I was able to sit on my ass until crypto took off in such a way that I was able to retire early and move out to the country. Sold my house to some Pakistani H-1Bs at the top of the market. Again not even kidding. permalink award report block reply flashersenpai 0 points 5 days ago damn permalink parent award report block reply henri_derelicte 5 points 5 days ago If you want to end work visa abuse, stop issuing visas to India and China would cut down on the bulk of it. Adding a few other shithole countries to the list beyond that would get rid of 98-99% of the problem permalink award report block reply HelluvaEngineer 3 points 5 days ago They are already moving into Bangladesh and the Philippines. permalink parent award report block reply KernalMustard 4 points 5 days ago \"Investigations\" permalink award report block reply RizzlieDoodad 4 points 5 days ago wow only 175?  Such an impact! permalink award report block reply Jack_NC 1 points 5 days ago And dozens or even a hundred illegals deported every day. Why, in only a few thousand years we'll be back to pre-Biden levels. permalink parent award report block reply RizzlieDoodad 2 points 4 days ago We got the Temu version permalink parent award report block reply halfstep 4 points 5 days ago Moar investigations yay!! permalink award report block reply josiborg 4 points 5 days ago 1.75M isn't enough and it needs to include all not just H1B. permalink award report block reply mailinvoter 4 points 5 days ago They should investigate the FBI.  I hear there's a DEI panjeet running the place. permalink award report block reply nzsvz9 4 points 5 days ago I voted for this. American jobs for Americans. Let the world create their own jobs - GTFO! permalink award report block reply fjzappa 3 points 5 days ago Every single high tech company. permalink award report block reply UndercoverSpez 3 points 5 days ago So why keep the program? Already abused. Will be further abused when Trumps not around. More loopholes will be found. Crazy, stop illegal immigration but import people to bring the same issues illegals bring. permalink award report block reply AmericanMan00 3 points 5 days ago Hey Guy's, in my American town a Swedish guy moved in and built a factory.  He H1B's all his employee's from Sweden.  He pays high wages which allows them to buy most of the housing in the area. It's always good to look at a problem from multiple angles. Amazon @ 12k+ H1B's permalink award report block reply Bramage 3 points 5 days ago ...unless bondi is involved... permalink award report block reply patrioticwinning3 3 points 5 days ago If they ended H1Bs, THERE WOULD BE NO NEED FOR THESE INVESTIGATIONS! permalink award report block reply hansgruber7 3 points 5 days ago H1B just needs to be eliminated entirely.  It has been abused far too often. permalink award report block reply Lynnforthetruth 2 points 5 days ago Check Home Depot permalink award report block reply Lol_Garrus 2 points 5 days ago Wouldnt have abuse if there was no system at all permalink award report block reply TrumpRideorDie74 2 points 5 days ago Instead of focusing on the companies right now, how about we abolish the entire visa system AND THEN go after the companies. This is like scooping the water out of a flood without addressing the leak itself. permalink award report block reply Royalseq 2 points 5 days ago CitiusTech.  Investigate them. permalink award report block reply FCUK_REDDIT 2 points 5 days ago Check US airports. Theyre hiring people that dont speak English. permalink award report block reply MinneMAGA 2 points 5 days ago This could easily be solved by ending the H1B program permalink award report block reply friedchicken 2 points 5 days ago Keep pushing.  Ignore the media, ignore the politics of it, ignore everything and just go. This is enforcement of the law, not negotiable. permalink award report block reply StruggleSession 2 points 5 days ago off the top of my head Vanguard, Well Fargos, Bank of America, Lowes, Apple, Microsoft, Walmart, USAA permalink award report block reply BlippiIsAPedo 2 points 5 days ago I hope that is companies, not people permalink award report block reply GoUSA 2 points 5 days ago B******* smoke screens. They don't need any investigations. They just need to enforce the laws that are already on the books and punish those who are breaking them. They're taking us for fools. And maybe we are permalink award report block reply LongerThanTheNile 2 points 5 days ago H-1B program needs to be abolished, not \"enhanced.\" It's pure fraud from top to bottom. MAGA voters are nearly unanimous in wanting this shit gone, and Trump can do it TODAY via EO. I don't understand why he's putting big tech before his base. That won't end well come midterm time. If the H-1B program hasn't been ended by then, it will be a bloodbath. permalink award report block reply Jack_NC 1 points 5 days ago the courts would never, EVER let him end a program that benefits foreigners. Just look at Obama's DREAM act. We're still dealing with those fucking \"dreamers\" after a decade. All illegal. And yet somehow we can't get them out. permalink parent award report block reply yurimodin 0 points 5 days ago He has joos whispering in his ear that we need street shitters for Ai permalink parent award report block reply TruculentGoose 2 points 5 days ago There is so much swamp to drain its going to take 10+ years permalink award report block reply SanityGumby 2 points 5 days ago Yet all the turbo faggots are here saying trump isn’t doing anything permalink award report block reply dtrap 2 points 5 days ago USA! USA! USA! permalink award report block reply jatergator 2 points 5 days ago Where’s the source, fuck all X handle? permalink award report block reply TrancePhreak 2 points 5 days ago Nuke H1B permalink award report block reply deleted 2 points 5 days ago SanityGumby 1 points 5 days ago They very well may be in the 175 permalink parent award report block reply Reefay 2 points 5 days ago Why can't the H1B's be paused? It makes no sense. permalink award report block reply PiratePatriotParrot OP 3 points 5 days ago They put 100k on NEW ones but there's even workarounds for that. Doesn't affect spouses, doesn't affect new grads or people who convert from a grad to a H1-B etc. It's all bullshit. permalink parent award report block reply MPitcher1776 2 points 5 days ago Check Verizon. permalink award report block reply booblitchutz 2 points 5 days ago H1B and PERM and OPT… permalink award report block reply axiy 2 points 5 days ago Needs at least 175,000 investigations. Why is it that every single time I interview with JPMorgan, Goldman Sachs, Bank of America, it's ALWAYS a foreigner (non-white, not even Hispanics). Every single time. permalink award report block reply SanityGumby 1 points 5 days ago There are easily that many being investigated. You don’t investigate a company for one violation. It’s likely 175,000 minimum under review. permalink parent award report block reply PiratePatriotParrot OP 1 points 5 days ago Every company is h1b or outsourcing,  especially tech permalink parent award report block reply LolitaExpressPilot 1 points 5 days ago 100 billion and a sacrifice for prison from each and we can settle this matter. permalink award report block reply jedfag 1 points 4 days ago They should go after Global Payments! (Yeah you see their name every time you swipe your card)  They're dev department had two subcontractor companies they used to skirt H1B laws.  About 20 locals and 300 Indians.  I was replaced with an H1B while I was on vacation.  She just got off the airplane.  Cognizant and their many subsidiaries should also be investigated.  You'll be doing them a favor.  They would spend way less on development if they were using American workers.  There are some good Indians but most are SHITE! permalink award report block reply NeoAeon 1 points 4 days ago As long as the 175 include the top 100 companies we'll be fine. They're the vanguard of this. If they go after 175 easy to beat little guys it will accomplish nothing. Microsoft, Amazon, Tesla, Intel, Facebook, Google, Walmart, American Airlines, Bank of America have all got to be in that list and they've got to be prioritized. Same with any and all major financial funds, Black Rock, Goldman Sachs, State Street. If those firms aren't being investigated and their transgressions fully prosecuted, this is a psyop to make it look like somethings happening. The small firms are just riding the big firms' coat tails. We can keep going down the list and get them all, but the most important are the big guys. We can't go up the list and win. We have to start big and take out the ones that are providing the infrastructural support for it all. I admit that I include American Airlines and Bank of America not due to their influence, but their hypocrisy. They've got to be call out and renamed H1B airlines and bank of H1B for truth in advertising. permalink award report block reply bonedancr 1 points 5 days ago Wish there was a tip/hotline Americans could call or email. permalink award report block reply MajJamesMcFarlane 1 points 5 days ago Wow. \"Investigations?\" I can't wait to hear about zero penalties or arrests after the investigations are concluded permalink award report block reply flashersenpai 1 points 5 days ago Sugar shill is pinned again with no sources Nice! permalink award report block reply JoinTheDiscussion 1 points 5 days ago no investigations into 2020/22/24 voting fraud though... this wont mean SHIT if the democrats win 26/28!!! permalink award report block reply PillarOfWisdom 1 points 5 days ago That'll make a dent. permalink award report block reply MudDog 1 points 5 days ago we investigated ourselves and we found nothing permalink award report block reply Yeti2 1 points 5 days ago Good. But close the program to make it better. permalink award report block reply Klaus73 1 points 5 days ago Let me know the results snd punishment. permalink award report block reply auntjemima 1 points 5 days ago ooooh i bet musk is pissed. permalink award report block reply Rain_man 1 points 5 days ago Another investigation! 2 weeks, Pedes! permalink award report block reply 45fan 1 points 5 days ago CANCEL -THE - PROGRAM permalink award report block reply ChenZhenFromJingWu 1 points 4 days ago They need to investigate talent burst. I cannot even understand what the recruiters for this company are saying. They call me on a regular basis at 3 in the fucking morning and try to pitch jobs. I get 6 different Indians, calling me 5 minutes apart, to convince me in an accent I cannot understand for a job They know nothing about. Someone is paying these fucking idiots. permalink award report block reply projectarcturus1 1 points 5 days ago Jobs for Americans, not foreigners. permalink award report block reply new_guy2 1 points 5 days ago Comment removed by community moderators. permalink award report block reply AlmostFullyDilated 1 points 5 days ago Comment removed by community moderators. permalink award report block reply\njohn9985 109 points 5 days ago Add about four more zeros permalink award report block reply DT170x 57 points 5 days ago Just add another zero just in case. permalink parent award report block reply Govtizbad 44 points 5 days ago edit: I'm being downvoted by feds and commies. Updoot! You know how there's all those job listings that seem to be a black void and people apply and never hear back? For how there will be job listings for like entry-level jobs requiring 50 years of experience in a program that only existed for 10? Or non-entry level jobs but paying entry level wages? That's because legally these companies cannot hire H1B unless they first opened it up to Americans.. so they create these BS job listings withoutrageous qualifications that nobody could meet or that the few people who can meet that aren't going to work for such little money and then when predictably no Americans apply and know Americans could meet the qualifications they then go out and hire the Indian workers for pennies on the dollar like they wanted to in the first place permalink parent award report block reply CS_McFisticuffs_III 35 points 5 days ago Need to make H1B so expensive to obtain and retain that it makes no sense to hire one unless there is literally nobody in the country capable of doing the job. permalink parent award report block reply Vorticity1 14 points 5 days ago Exactly. They take away from an American. permalink parent award report block reply view 1 more comments... mohel 8 points 5 days ago A lot of companies hiring H1Bs pay no taxes as they make no profits and exit via inflated IPOs/acquisitions. Had RINOs decided to tax them on their H1B employees we could have a nice conversation. Too bad RINOs are too dumb for such moves. permalink parent award report block reply view 1 more comments... Aquamine-Amarine 13 points 5 days ago This is a huge problem. The only solution is to make it extremely expensive to hire someone that isn't an American. Fine the fuck out of that company for every H1B they have. Make them realize it's cheaper to hire the American. They only learn if you hurt them financially. permalink parent award report block reply negative_entropy 5 points 5 days ago one of the worst things Trump did was to take away the Section174A R&D tax exemption for hiring domestically (part of the 2017 tax bill), it was taken away cuz companies got tax cuts, but removing the special domestic tax exemption caused it to be even cheaper to hire foreigners. it was only restored as part of the BBB in July. permalink parent award report block reply PiratePatriotParrot OP 11 points 5 days ago Yup, no why idiots are down voting those truths permalink parent award report block reply Jmricht 3 points 5 days ago Prime Therapeutics. permalink parent award report block reply Shitsbrokeyo 3 points 5 days ago There was a scattergraph on here yesterday. Pull that bitch up. It's BAD. permalink parent award report block reply load 1 more comments... BeauHD 21 points 5 days ago Go after TCS. They fire all the Americans at big corps and replace them with smelly jeets. permalink parent award report block reply LawyersPlayDota 21 points 5 days ago Companies, not cases. The ones abusing the system are scummy middlemen that fake a bunch of applicants' qualifications and structure it to scam the government. permalink parent award report block reply Hikedelics 3 points 5 days ago Exactly. Depending on the companies, there could be 175,000 cases. Though something tells me they will be looking the other way for Amazon or other major offenders if they donated money to his campaign. permalink parent award report block reply SanityGumby 11 points 5 days ago It’s companies. These companies are likely each committing a thousand violations minimum depending if Microsoft, Amazon, cognizant, etc are on the list permalink parent award report block reply sixfingerdildo 2 points 5 days ago Honestly who wants to work for these scumbags permalink parent award report block reply Aoikaze2000 5 points 5 days ago Tbh, working for Microsoft was a rather sweet deal... Amazon OTOH, is a meatgrinder. permalink parent award report block reply SanityGumby 4 points 5 days ago Not me. I interviewed with Microsoft and before I even finished half the day's interviews I decided I was done and not interested. permalink parent award report block reply Bigstick7 3 points 5 days ago Anyone living in India to get to America. I've been to India it's literally like living in a garage dump. permalink parent award report block reply HoganT 1 points 5 days ago Violations of what, exactly? What law? H1B’s are legal to use. It’s stupid. But I’m just interested to find out what grounds this literal who is claiming were investigating them on. permalink parent award report block reply TheGamerToTheRight 6 points 5 days ago H1B is legal, but they have to follow specific rules. They can't just replace an American with a foreigner. They do lots of tricks to follow the letter, but not intention, of the law, such as advertising in local newspapers and then saying no qualified Americans exist when no one applies. Or requiring people to fax their resume to the immigration team if they find the hidden job board the job was posted on. H1B is a scam, and companies are engaging in borderline, if not actual, illegal practices to obtain the cut-rate foreigners. Why should Amazon be getting 10s of thousands of H1Bs, while laying off 30k Americans? permalink parent award report block reply HoganT 0 points 5 days ago Why should Amazon be getting 10s of thousands of H1Bs, while laying off 30k Americans? I don’t disagree. I’m just stating what you tacitly admitted in your reply here. It’s not illegal. If violating the spirit of a law, but not the letter, gets you in trouble, our entire corporate structure is in trouble. You’ll notice it is not, however. permalink parent award report block reply view 1 more comments... nemonster 2 points 5 days ago Need to hire more gvnmt people permalink parent award report block reply bananaguard62 2 points 5 days ago It started with call centers.  Bring those jobs back too. permalink parent award report block reply load 4 more comments...\nDT170x 57 points 5 days ago Just add another zero just in case. permalink parent award report block reply Govtizbad 44 points 5 days ago edit: I'm being downvoted by feds and commies. Updoot! You know how there's all those job listings that seem to be a black void and people apply and never hear back? For how there will be job listings for like entry-level jobs requiring 50 years of experience in a program that only existed for 10? Or non-entry level jobs but paying entry level wages? That's because legally these companies cannot hire H1B unless they first opened it up to Americans.. so they create these BS job listings withoutrageous qualifications that nobody could meet or that the few people who can meet that aren't going to work for such little money and then when predictably no Americans apply and know Americans could meet the qualifications they then go out and hire the Indian workers for pennies on the dollar like they wanted to in the first place permalink parent award report block reply CS_McFisticuffs_III 35 points 5 days ago Need to make H1B so expensive to obtain and retain that it makes no sense to hire one unless there is literally nobody in the country capable of doing the job. permalink parent award report block reply Vorticity1 14 points 5 days ago Exactly. They take away from an American. permalink parent award report block reply view 1 more comments... mohel 8 points 5 days ago A lot of companies hiring H1Bs pay no taxes as they make no profits and exit via inflated IPOs/acquisitions. Had RINOs decided to tax them on their H1B employees we could have a nice conversation. Too bad RINOs are too dumb for such moves. permalink parent award report block reply view 1 more comments... Aquamine-Amarine 13 points 5 days ago This is a huge problem. The only solution is to make it extremely expensive to hire someone that isn't an American. Fine the fuck out of that company for every H1B they have. Make them realize it's cheaper to hire the American. They only learn if you hurt them financially. permalink parent award report block reply negative_entropy 5 points 5 days ago one of the worst things Trump did was to take away the Section174A R&D tax exemption for hiring domestically (part of the 2017 tax bill), it was taken away cuz companies got tax cuts, but removing the special domestic tax exemption caused it to be even cheaper to hire foreigners. it was only restored as part of the BBB in July. permalink parent award report block reply PiratePatriotParrot OP 11 points 5 days ago Yup, no why idiots are down voting those truths permalink parent award report block reply Jmricht 3 points 5 days ago Prime Therapeutics. permalink parent award report block reply Shitsbrokeyo 3 points 5 days ago There was a scattergraph on here yesterday. Pull that bitch up. It's BAD. permalink parent award report block reply load 1 more comments... BeauHD 21 points 5 days ago Go after TCS. They fire all the Americans at big corps and replace them with smelly jeets. permalink parent award report block reply\nGovtizbad 44 points 5 days ago edit: I'm being downvoted by feds and commies. Updoot! You know how there's all those job listings that seem to be a black void and people apply and never hear back? For how there will be job listings for like entry-level jobs requiring 50 years of experience in a program that only existed for 10? Or non-entry level jobs but paying entry level wages? That's because legally these companies cannot hire H1B unless they first opened it up to Americans.. so they create these BS job listings withoutrageous qualifications that nobody could meet or that the few people who can meet that aren't going to work for such little money and then when predictably no Americans apply and know Americans could meet the qualifications they then go out and hire the Indian workers for pennies on the dollar like they wanted to in the first place permalink parent award report block reply CS_McFisticuffs_III 35 points 5 days ago Need to make H1B so expensive to obtain and retain that it makes no sense to hire one unless there is literally nobody in the country capable of doing the job. permalink parent award report block reply Vorticity1 14 points 5 days ago Exactly. They take away from an American. permalink parent award report block reply view 1 more comments... mohel 8 points 5 days ago A lot of companies hiring H1Bs pay no taxes as they make no profits and exit via inflated IPOs/acquisitions. Had RINOs decided to tax them on their H1B employees we could have a nice conversation. Too bad RINOs are too dumb for such moves. permalink parent award report block reply view 1 more comments... Aquamine-Amarine 13 points 5 days ago This is a huge problem. The only solution is to make it extremely expensive to hire someone that isn't an American. Fine the fuck out of that company for every H1B they have. Make them realize it's cheaper to hire the American. They only learn if you hurt them financially. permalink parent award report block reply negative_entropy 5 points 5 days ago one of the worst things Trump did was to take away the Section174A R&D tax exemption for hiring domestically (part of the 2017 tax bill), it was taken away cuz companies got tax cuts, but removing the special domestic tax exemption caused it to be even cheaper to hire foreigners. it was only restored as part of the BBB in July. permalink parent award report block reply PiratePatriotParrot OP 11 points 5 days ago Yup, no why idiots are down voting those truths permalink parent award report block reply Jmricht 3 points 5 days ago Prime Therapeutics. permalink parent award report block reply Shitsbrokeyo 3 points 5 days ago There was a scattergraph on here yesterday. Pull that bitch up. It's BAD. permalink parent award report block reply load 1 more comments...\nCS_McFisticuffs_III 35 points 5 days ago Need to make H1B so expensive to obtain and retain that it makes no sense to hire one unless there is literally nobody in the country capable of doing the job. permalink parent award report block reply Vorticity1 14 points 5 days ago Exactly. They take away from an American. permalink parent award report block reply view 1 more comments... mohel 8 points 5 days ago A lot of companies hiring H1Bs pay no taxes as they make no profits and exit via inflated IPOs/acquisitions. Had RINOs decided to tax them on their H1B employees we could have a nice conversation. Too bad RINOs are too dumb for such moves. permalink parent award report block reply view 1 more comments...\nVorticity1 14 points 5 days ago Exactly. They take away from an American. permalink parent award report block reply view 1 more comments...\nmohel 8 points 5 days ago A lot of companies hiring H1Bs pay no taxes as they make no profits and exit via inflated IPOs/acquisitions. Had RINOs decided to tax them on their H1B employees we could have a nice conversation. Too bad RINOs are too dumb for such moves. permalink parent award report block reply view 1 more comments...\nAquamine-Amarine 13 points 5 days ago This is a huge problem. The only solution is to make it extremely expensive to hire someone that isn't an American. Fine the fuck out of that company for every H1B they have. Make them realize it's cheaper to hire the American. They only learn if you hurt them financially. permalink parent award report block reply negative_entropy 5 points 5 days ago one of the worst things Trump did was to take away the Section174A R&D tax exemption for hiring domestically (part of the 2017 tax bill), it was taken away cuz companies got tax cuts, but removing the special domestic tax exemption caused it to be even cheaper to hire foreigners. it was only restored as part of the BBB in July. permalink parent award report block reply\nnegative_entropy 5 points 5 days ago one of the worst things Trump did was to take away the Section174A R&D tax exemption for hiring domestically (part of the 2017 tax bill), it was taken away cuz companies got tax cuts, but removing the special domestic tax exemption caused it to be even cheaper to hire foreigners. it was only restored as part of the BBB in July. permalink parent award report block reply\nPiratePatriotParrot OP 11 points 5 days ago Yup, no why idiots are down voting those truths permalink parent award report block reply\nJmricht 3 points 5 days ago Prime Therapeutics. permalink parent award report block reply\nShitsbrokeyo 3 points 5 days ago There was a scattergraph on here yesterday. Pull that bitch up. It's BAD. permalink parent award report block reply\nBeauHD 21 points 5 days ago Go after TCS. They fire all the Americans at big corps and replace them with smelly jeets. permalink parent award report block reply\nLawyersPlayDota 21 points 5 days ago Companies, not cases. The ones abusing the system are scummy middlemen that fake a bunch of applicants' qualifications and structure it to scam the government. permalink parent award report block reply Hikedelics 3 points 5 days ago Exactly. Depending on the companies, there could be 175,000 cases. Though something tells me they will be looking the other way for Amazon or other major offenders if they donated money to his campaign. permalink parent award report block reply\nHikedelics 3 points 5 days ago Exactly. Depending on the companies, there could be 175,000 cases. Though something tells me they will be looking the other way for Amazon or other major offenders if they donated money to his campaign. permalink parent award report block reply\nSanityGumby 11 points 5 days ago It’s companies. These companies are likely each committing a thousand violations minimum depending if Microsoft, Amazon, cognizant, etc are on the list permalink parent award report block reply sixfingerdildo 2 points 5 days ago Honestly who wants to work for these scumbags permalink parent award report block reply Aoikaze2000 5 points 5 days ago Tbh, working for Microsoft was a rather sweet deal... Amazon OTOH, is a meatgrinder. permalink parent award report block reply SanityGumby 4 points 5 days ago Not me. I interviewed with Microsoft and before I even finished half the day's interviews I decided I was done and not interested. permalink parent award report block reply Bigstick7 3 points 5 days ago Anyone living in India to get to America. I've been to India it's literally like living in a garage dump. permalink parent award report block reply HoganT 1 points 5 days ago Violations of what, exactly? What law? H1B’s are legal to use. It’s stupid. But I’m just interested to find out what grounds this literal who is claiming were investigating them on. permalink parent award report block reply TheGamerToTheRight 6 points 5 days ago H1B is legal, but they have to follow specific rules. They can't just replace an American with a foreigner. They do lots of tricks to follow the letter, but not intention, of the law, such as advertising in local newspapers and then saying no qualified Americans exist when no one applies. Or requiring people to fax their resume to the immigration team if they find the hidden job board the job was posted on. H1B is a scam, and companies are engaging in borderline, if not actual, illegal practices to obtain the cut-rate foreigners. Why should Amazon be getting 10s of thousands of H1Bs, while laying off 30k Americans? permalink parent award report block reply HoganT 0 points 5 days ago Why should Amazon be getting 10s of thousands of H1Bs, while laying off 30k Americans? I don’t disagree. I’m just stating what you tacitly admitted in your reply here. It’s not illegal. If violating the spirit of a law, but not the letter, gets you in trouble, our entire corporate structure is in trouble. You’ll notice it is not, however. permalink parent award report block reply view 1 more comments...\nsixfingerdildo 2 points 5 days ago Honestly who wants to work for these scumbags permalink parent award report block reply Aoikaze2000 5 points 5 days ago Tbh, working for Microsoft was a rather sweet deal... Amazon OTOH, is a meatgrinder. permalink parent award report block reply SanityGumby 4 points 5 days ago Not me. I interviewed with Microsoft and before I even finished half the day's interviews I decided I was done and not interested. permalink parent award report block reply Bigstick7 3 points 5 days ago Anyone living in India to get to America. I've been to India it's literally like living in a garage dump. permalink parent award report block reply\nAoikaze2000 5 points 5 days ago Tbh, working for Microsoft was a rather sweet deal... Amazon OTOH, is a meatgrinder. permalink parent award report block reply\nSanityGumby 4 points 5 days ago Not me. I interviewed with Microsoft and before I even finished half the day's interviews I decided I was done and not interested. permalink parent award report block reply\nBigstick7 3 points 5 days ago Anyone living in India to get to America. I've been to India it's literally like living in a garage dump. permalink parent award report block reply\nHoganT 1 points 5 days ago Violations of what, exactly? What law? H1B’s are legal to use. It’s stupid. But I’m just interested to find out what grounds this literal who is claiming were investigating them on. permalink parent award report block reply TheGamerToTheRight 6 points 5 days ago H1B is legal, but they have to follow specific rules. They can't just replace an American with a foreigner. They do lots of tricks to follow the letter, but not intention, of the law, such as advertising in local newspapers and then saying no qualified Americans exist when no one applies. Or requiring people to fax their resume to the immigration team if they find the hidden job board the job was posted on. H1B is a scam, and companies are engaging in borderline, if not actual, illegal practices to obtain the cut-rate foreigners. Why should Amazon be getting 10s of thousands of H1Bs, while laying off 30k Americans? permalink parent award report block reply HoganT 0 points 5 days ago Why should Amazon be getting 10s of thousands of H1Bs, while laying off 30k Americans? I don’t disagree. I’m just stating what you tacitly admitted in your reply here. It’s not illegal. If violating the spirit of a law, but not the letter, gets you in trouble, our entire corporate structure is in trouble. You’ll notice it is not, however. permalink parent award report block reply view 1 more comments...\nTheGamerToTheRight 6 points 5 days ago H1B is legal, but they have to follow specific rules. They can't just replace an American with a foreigner. They do lots of tricks to follow the letter, but not intention, of the law, such as advertising in local newspapers and then saying no qualified Americans exist when no one applies. Or requiring people to fax their resume to the immigration team if they find the hidden job board the job was posted on. H1B is a scam, and companies are engaging in borderline, if not actual, illegal practices to obtain the cut-rate foreigners. Why should Amazon be getting 10s of thousands of H1Bs, while laying off 30k Americans? permalink parent award report block reply HoganT 0 points 5 days ago Why should Amazon be getting 10s of thousands of H1Bs, while laying off 30k Americans? I don’t disagree. I’m just stating what you tacitly admitted in your reply here. It’s not illegal. If violating the spirit of a law, but not the letter, gets you in trouble, our entire corporate structure is in trouble. You’ll notice it is not, however. permalink parent award report block reply view 1 more comments...\nHoganT 0 points 5 days ago Why should Amazon be getting 10s of thousands of H1Bs, while laying off 30k Americans? I don’t disagree. I’m just stating what you tacitly admitted in your reply here. It’s not illegal. If violating the spirit of a law, but not the letter, gets you in trouble, our entire corporate structure is in trouble. You’ll notice it is not, however. permalink parent award report block reply view 1 more comments...\nnemonster 2 points 5 days ago Need to hire more gvnmt people permalink parent award report block reply\nbananaguard62 2 points 5 days ago It started with call centers.  Bring those jobs back too. permalink parent award report block reply\nutfanx2 46 points 5 days ago Every H1B is fraudulent. permalink award report block reply henri_derelicte 21 points 5 days ago There’s been so many layoffs in positions/job sectors hiring from H1B that I’m struggling to see how they can justify saying there’s no American talent available. Hire these Americans as remote workers if you have to permalink parent award report block reply HelluvaEngineer 19 points 5 days ago Most people have no idea how bad it is.  I recently posted a job listing for an entry-level position and got 25 resumes in 2 hours.  Many applicants had 15-20 years of experience.  They have no work.  No one will hire a white person. There were also many grads with masters degrees in tech that are now working at places like tire shops as managers.  I felt really bad emailing one of those grads today and telling him that normally we would hire him but we have overqualified people competing at the same rate. permalink parent award report block reply PiratePatriotParrot OP 11 points 5 days ago 230 applications this year, 560 in 2023 permalink parent award report block reply Spicy_cat 10 points 5 days ago Any corporate creature that pushes DEI should be punished severely.  Heads should roll. permalink parent award report block reply user2827 7 points 5 days ago The last time I looked for work seriously, I was looking for engineering work for about 1 year, give or take a month, and would be applying to about every job where I was even tangentially qualified (ex; PLC programming, \"Oh, I've done that a couple times.\"). Over the year, it must have been 2-300 applications sent out, had about 10 interviews, when I finally got a call back for an offer I was flabbergasted... permalink parent award report block reply HelluvaEngineer 3 points 5 days ago Glad it worked out.  I had a brief exposure to PLCs. permalink parent award report block reply view 1 more comments... The_Bloofy_Bullshark 9 points 5 days ago I have American recent college grads reaching out to me for interviews and referrals. Problem is we don’t even have reqs open I can bring them in for. It’s insane bullshit. Somehow, though, I constantly get emails about how Sandeep Poo or Deepstink Singhe has just joined our org. It’s insane. permalink parent award report block reply HelluvaEngineer 7 points 5 days ago It's obvious racial discrimination.  They even discriminate by caste and region within their own country. permalink parent award report block reply flashersenpai 0 points 5 days ago sad LMAO permalink parent award report block reply booblitchutz 4 points 5 days ago Veddy soddy Saar, we are having no jobs here. permalink parent award report block reply TennesseeBorn 3 points 5 days ago Conspiracy. The approval part of \"yes, we agree you are having trouble hiring Americans for this role\" is completely compromised. permalink parent award report block reply Jack_NC 1 points 5 days ago Now that millions of Americans have been out of work for a year or two (or more!) due to H1Bs taking their place, they can say \"no relevant up-to-date experience: DISQUALIFIED!\" permalink parent award report block reply TrumpRideorDie74 7 points 5 days ago I feel the exact same way. permalink parent award report block reply DontDoxMeBro1 3 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply\nhenri_derelicte 21 points 5 days ago There’s been so many layoffs in positions/job sectors hiring from H1B that I’m struggling to see how they can justify saying there’s no American talent available. Hire these Americans as remote workers if you have to permalink parent award report block reply HelluvaEngineer 19 points 5 days ago Most people have no idea how bad it is.  I recently posted a job listing for an entry-level position and got 25 resumes in 2 hours.  Many applicants had 15-20 years of experience.  They have no work.  No one will hire a white person. There were also many grads with masters degrees in tech that are now working at places like tire shops as managers.  I felt really bad emailing one of those grads today and telling him that normally we would hire him but we have overqualified people competing at the same rate. permalink parent award report block reply PiratePatriotParrot OP 11 points 5 days ago 230 applications this year, 560 in 2023 permalink parent award report block reply Spicy_cat 10 points 5 days ago Any corporate creature that pushes DEI should be punished severely.  Heads should roll. permalink parent award report block reply user2827 7 points 5 days ago The last time I looked for work seriously, I was looking for engineering work for about 1 year, give or take a month, and would be applying to about every job where I was even tangentially qualified (ex; PLC programming, \"Oh, I've done that a couple times.\"). Over the year, it must have been 2-300 applications sent out, had about 10 interviews, when I finally got a call back for an offer I was flabbergasted... permalink parent award report block reply HelluvaEngineer 3 points 5 days ago Glad it worked out.  I had a brief exposure to PLCs. permalink parent award report block reply view 1 more comments... The_Bloofy_Bullshark 9 points 5 days ago I have American recent college grads reaching out to me for interviews and referrals. Problem is we don’t even have reqs open I can bring them in for. It’s insane bullshit. Somehow, though, I constantly get emails about how Sandeep Poo or Deepstink Singhe has just joined our org. It’s insane. permalink parent award report block reply HelluvaEngineer 7 points 5 days ago It's obvious racial discrimination.  They even discriminate by caste and region within their own country. permalink parent award report block reply flashersenpai 0 points 5 days ago sad LMAO permalink parent award report block reply booblitchutz 4 points 5 days ago Veddy soddy Saar, we are having no jobs here. permalink parent award report block reply TennesseeBorn 3 points 5 days ago Conspiracy. The approval part of \"yes, we agree you are having trouble hiring Americans for this role\" is completely compromised. permalink parent award report block reply Jack_NC 1 points 5 days ago Now that millions of Americans have been out of work for a year or two (or more!) due to H1Bs taking their place, they can say \"no relevant up-to-date experience: DISQUALIFIED!\" permalink parent award report block reply\nHelluvaEngineer 19 points 5 days ago Most people have no idea how bad it is.  I recently posted a job listing for an entry-level position and got 25 resumes in 2 hours.  Many applicants had 15-20 years of experience.  They have no work.  No one will hire a white person. There were also many grads with masters degrees in tech that are now working at places like tire shops as managers.  I felt really bad emailing one of those grads today and telling him that normally we would hire him but we have overqualified people competing at the same rate. permalink parent award report block reply PiratePatriotParrot OP 11 points 5 days ago 230 applications this year, 560 in 2023 permalink parent award report block reply Spicy_cat 10 points 5 days ago Any corporate creature that pushes DEI should be punished severely.  Heads should roll. permalink parent award report block reply user2827 7 points 5 days ago The last time I looked for work seriously, I was looking for engineering work for about 1 year, give or take a month, and would be applying to about every job where I was even tangentially qualified (ex; PLC programming, \"Oh, I've done that a couple times.\"). Over the year, it must have been 2-300 applications sent out, had about 10 interviews, when I finally got a call back for an offer I was flabbergasted... permalink parent award report block reply HelluvaEngineer 3 points 5 days ago Glad it worked out.  I had a brief exposure to PLCs. permalink parent award report block reply view 1 more comments...\nPiratePatriotParrot OP 11 points 5 days ago 230 applications this year, 560 in 2023 permalink parent award report block reply\nSpicy_cat 10 points 5 days ago Any corporate creature that pushes DEI should be punished severely.  Heads should roll. permalink parent award report block reply\nuser2827 7 points 5 days ago The last time I looked for work seriously, I was looking for engineering work for about 1 year, give or take a month, and would be applying to about every job where I was even tangentially qualified (ex; PLC programming, \"Oh, I've done that a couple times.\"). Over the year, it must have been 2-300 applications sent out, had about 10 interviews, when I finally got a call back for an offer I was flabbergasted... permalink parent award report block reply HelluvaEngineer 3 points 5 days ago Glad it worked out.  I had a brief exposure to PLCs. permalink parent award report block reply view 1 more comments...\nHelluvaEngineer 3 points 5 days ago Glad it worked out.  I had a brief exposure to PLCs. permalink parent award report block reply view 1 more comments...\nThe_Bloofy_Bullshark 9 points 5 days ago I have American recent college grads reaching out to me for interviews and referrals. Problem is we don’t even have reqs open I can bring them in for. It’s insane bullshit. Somehow, though, I constantly get emails about how Sandeep Poo or Deepstink Singhe has just joined our org. It’s insane. permalink parent award report block reply HelluvaEngineer 7 points 5 days ago It's obvious racial discrimination.  They even discriminate by caste and region within their own country. permalink parent award report block reply flashersenpai 0 points 5 days ago sad LMAO permalink parent award report block reply\nHelluvaEngineer 7 points 5 days ago It's obvious racial discrimination.  They even discriminate by caste and region within their own country. permalink parent award report block reply\nflashersenpai 0 points 5 days ago sad LMAO permalink parent award report block reply\nbooblitchutz 4 points 5 days ago Veddy soddy Saar, we are having no jobs here. permalink parent award report block reply\nTennesseeBorn 3 points 5 days ago Conspiracy. The approval part of \"yes, we agree you are having trouble hiring Americans for this role\" is completely compromised. permalink parent award report block reply\nJack_NC 1 points 5 days ago Now that millions of Americans have been out of work for a year or two (or more!) due to H1Bs taking their place, they can say \"no relevant up-to-date experience: DISQUALIFIED!\" permalink parent award report block reply\nTrumpRideorDie74 7 points 5 days ago I feel the exact same way. permalink parent award report block reply\nDontDoxMeBro1 3 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply\nMcFatty7 35 points 5 days ago Lol there's wayyyyy more than 175 cases of H-1B visa abuse. https://www.myvisajobs.com/reports/h1b/ permalink award report block reply SanityGumby 8 points 5 days ago It’s not cases retard. It’s 175 companies. They didn’t each only commit one violation permalink parent award report block reply maverick202 7 points 5 days ago Where does it say they're investigating 175 companies? The tweet says 175 investigations. On that note, All we have is tweet by this X grifter.. Is there a verifiable source of these investigations? permalink parent award report block reply UCantStumpTheTrump -1 points 5 days ago u/maverick202 is a self-admitted troll who comes here and insults our community, calling people “white trash” and “incels.” Hit that deport button! permalink parent award report block reply UCantStumpTheTrump 1 points 5 days ago The guy who replied to you, u/maverick202 is a self-admitted shill who says he comes here to “troll white trash.” He’s not here to debate in good faith permalink parent award report block reply maverick202 0 points 4 days ago This incel is trying hard to deport me. But I'm here enjoying his tears every morning, kek! permalink parent award report block reply\nSanityGumby 8 points 5 days ago It’s not cases retard. It’s 175 companies. They didn’t each only commit one violation permalink parent award report block reply maverick202 7 points 5 days ago Where does it say they're investigating 175 companies? The tweet says 175 investigations. On that note, All we have is tweet by this X grifter.. Is there a verifiable source of these investigations? permalink parent award report block reply UCantStumpTheTrump -1 points 5 days ago u/maverick202 is a self-admitted troll who comes here and insults our community, calling people “white trash” and “incels.” Hit that deport button! permalink parent award report block reply UCantStumpTheTrump 1 points 5 days ago The guy who replied to you, u/maverick202 is a self-admitted shill who says he comes here to “troll white trash.” He’s not here to debate in good faith permalink parent award report block reply maverick202 0 points 4 days ago This incel is trying hard to deport me. But I'm here enjoying his tears every morning, kek! permalink parent award report block reply\nmaverick202 7 points 5 days ago Where does it say they're investigating 175 companies? The tweet says 175 investigations. On that note, All we have is tweet by this X grifter.. Is there a verifiable source of these investigations? permalink parent award report block reply UCantStumpTheTrump -1 points 5 days ago u/maverick202 is a self-admitted troll who comes here and insults our community, calling people “white trash” and “incels.” Hit that deport button! permalink parent award report block reply\nUCantStumpTheTrump -1 points 5 days ago u/maverick202 is a self-admitted troll who comes here and insults our community, calling people “white trash” and “incels.” Hit that deport button! permalink parent award report block reply\nUCantStumpTheTrump 1 points 5 days ago The guy who replied to you, u/maverick202 is a self-admitted shill who says he comes here to “troll white trash.” He’s not here to debate in good faith permalink parent award report block reply maverick202 0 points 4 days ago This incel is trying hard to deport me. But I'm here enjoying his tears every morning, kek! permalink parent award report block reply\nmaverick202 0 points 4 days ago This incel is trying hard to deport me. But I'm here enjoying his tears every morning, kek! permalink parent award report block reply\nGentleSlayer 28 points 5 days ago How about the fucking civil rights act. There are US companies where only Brahmin can work on certain code, or that only hire specific families from Bangalore. A whole company full of a particular tribe, foreign nationality, or religious sect is a flagrant violator.\nBiden's DOJ was even punishing companies for not hiring enough foreign nationals. permalink award report block reply Spicy_cat 19 points 5 days ago Trump's head of the DOJ Civil rights division is a woman from Punjab, India.  Harmeet Dhillon permalink parent award report block reply TrumpRideorDie74 12 points 5 days ago My stomach just bottomed out reading that 🤦🏼 permalink parent award report block reply SanityGumby -2 points 5 days ago Why. She is one of the only people in justice that seems to be doing anything permalink parent award report block reply YouEssAye 8 points 5 days ago Lol permalink parent award report block reply GentleSlayer 6 points 5 days ago Then send her after the other sects. permalink parent award report block reply Spicy_cat 6 points 5 days ago She hates white people the most and won't do anything to stop companies hiring H1B Indians instead of Americans. permalink parent award report block reply flashersenpai 1 points 5 days ago Harmeet has a good reputation. I'd have to see something big to believe she's getting in the way. permalink parent award report block reply Spicy_cat 1 points 4 days ago People were tweeting at her to do something about companies that were discriminating against Americans to get Indian H1Bs and she just responds \"blocked racist\" permalink parent award report block reply SanityGumby 2 points 5 days ago Need someone to sue or file an EEO complaint. permalink parent award report block reply GentleSlayer 2 points 5 days ago The courts established a process by which white peepo need documented proof to even file, while others just need the appearance of improper hiring. permalink parent award report block reply one_cool 2 points 5 days ago that was overthrown by us supreme court in june.  people dont know it yet.  there should be thousands of lawsuits. permalink parent award report block reply one_cool 1 points 5 days ago EEOC relies on state offices and where are all the jeet problems: blue states.  EEOC needs federalized.  right now they are saying they are shut down.  EEOC comission is designed worse than congress.  Even though libshits are not in power they ge ttwo of five seats and can block quorum to get anything done.  dem fuckers are literally blocking civil rights because they know whites are pissed. permalink parent award report block reply\nSpicy_cat 19 points 5 days ago Trump's head of the DOJ Civil rights division is a woman from Punjab, India.  Harmeet Dhillon permalink parent award report block reply TrumpRideorDie74 12 points 5 days ago My stomach just bottomed out reading that 🤦🏼 permalink parent award report block reply SanityGumby -2 points 5 days ago Why. She is one of the only people in justice that seems to be doing anything permalink parent award report block reply YouEssAye 8 points 5 days ago Lol permalink parent award report block reply GentleSlayer 6 points 5 days ago Then send her after the other sects. permalink parent award report block reply Spicy_cat 6 points 5 days ago She hates white people the most and won't do anything to stop companies hiring H1B Indians instead of Americans. permalink parent award report block reply flashersenpai 1 points 5 days ago Harmeet has a good reputation. I'd have to see something big to believe she's getting in the way. permalink parent award report block reply Spicy_cat 1 points 4 days ago People were tweeting at her to do something about companies that were discriminating against Americans to get Indian H1Bs and she just responds \"blocked racist\" permalink parent award report block reply\nTrumpRideorDie74 12 points 5 days ago My stomach just bottomed out reading that 🤦🏼 permalink parent award report block reply SanityGumby -2 points 5 days ago Why. She is one of the only people in justice that seems to be doing anything permalink parent award report block reply\nSanityGumby -2 points 5 days ago Why. She is one of the only people in justice that seems to be doing anything permalink parent award report block reply\nYouEssAye 8 points 5 days ago Lol permalink parent award report block reply\nGentleSlayer 6 points 5 days ago Then send her after the other sects. permalink parent award report block reply Spicy_cat 6 points 5 days ago She hates white people the most and won't do anything to stop companies hiring H1B Indians instead of Americans. permalink parent award report block reply\nSpicy_cat 6 points 5 days ago She hates white people the most and won't do anything to stop companies hiring H1B Indians instead of Americans. permalink parent award report block reply\nflashersenpai 1 points 5 days ago Harmeet has a good reputation. I'd have to see something big to believe she's getting in the way. permalink parent award report block reply Spicy_cat 1 points 4 days ago People were tweeting at her to do something about companies that were discriminating against Americans to get Indian H1Bs and she just responds \"blocked racist\" permalink parent award report block reply\nSpicy_cat 1 points 4 days ago People were tweeting at her to do something about companies that were discriminating against Americans to get Indian H1Bs and she just responds \"blocked racist\" permalink parent award report block reply\nSanityGumby 2 points 5 days ago Need someone to sue or file an EEO complaint. permalink parent award report block reply GentleSlayer 2 points 5 days ago The courts established a process by which white peepo need documented proof to even file, while others just need the appearance of improper hiring. permalink parent award report block reply one_cool 2 points 5 days ago that was overthrown by us supreme court in june.  people dont know it yet.  there should be thousands of lawsuits. permalink parent award report block reply\nGentleSlayer 2 points 5 days ago The courts established a process by which white peepo need documented proof to even file, while others just need the appearance of improper hiring. permalink parent award report block reply one_cool 2 points 5 days ago that was overthrown by us supreme court in june.  people dont know it yet.  there should be thousands of lawsuits. permalink parent award report block reply\none_cool 2 points 5 days ago that was overthrown by us supreme court in june.  people dont know it yet.  there should be thousands of lawsuits. permalink parent award report block reply\none_cool 1 points 5 days ago EEOC relies on state offices and where are all the jeet problems: blue states.  EEOC needs federalized.  right now they are saying they are shut down.  EEOC comission is designed worse than congress.  Even though libshits are not in power they ge ttwo of five seats and can block quorum to get anything done.  dem fuckers are literally blocking civil rights because they know whites are pissed. permalink parent award report block reply\nRandyMoss 15 points 5 days ago End the program. permalink award report block reply SanityGumby -2 points 5 days ago Usually to have justification for doing something that drastic it’s better to justify it. Like investigating a few hundred companies that are committing mass H1b fraud permalink parent award report block reply RandyMoss 6 points 5 days ago I'm not opposed to the investigations but we don't need justification to end a program designed to screw the American workers. Just fucking end it. I'm so tired of cowardly politicians. permalink parent award report block reply Jack_NC 1 points 5 days ago one word \"DREAMERS\" Obama invented that shit and you'd think it was carved into the backside of the 10 Commandments, or scrawled in George Washington's own blood across the front of the US Constitution. The courts refuse to shut down the DREAM immigration act because orange man bad, black muslim indonesian good. edit: the \"DREAM\" action is clearcut, but no court will allow its revocation. In the same way, any immigration policy change that would reverse the actions of a democrat will be overruled. The courts seem determined to flood America with 3rd world garbage (e.g. haiti). permalink parent award report block reply RandyMoss 1 points 5 days ago We are talking about H1B. Dreamers don't have anything to do with that. permalink parent award report block reply view 2 more comments...\nSanityGumby -2 points 5 days ago Usually to have justification for doing something that drastic it’s better to justify it. Like investigating a few hundred companies that are committing mass H1b fraud permalink parent award report block reply RandyMoss 6 points 5 days ago I'm not opposed to the investigations but we don't need justification to end a program designed to screw the American workers. Just fucking end it. I'm so tired of cowardly politicians. permalink parent award report block reply Jack_NC 1 points 5 days ago one word \"DREAMERS\" Obama invented that shit and you'd think it was carved into the backside of the 10 Commandments, or scrawled in George Washington's own blood across the front of the US Constitution. The courts refuse to shut down the DREAM immigration act because orange man bad, black muslim indonesian good. edit: the \"DREAM\" action is clearcut, but no court will allow its revocation. In the same way, any immigration policy change that would reverse the actions of a democrat will be overruled. The courts seem determined to flood America with 3rd world garbage (e.g. haiti). permalink parent award report block reply RandyMoss 1 points 5 days ago We are talking about H1B. Dreamers don't have anything to do with that. permalink parent award report block reply view 2 more comments...\nRandyMoss 6 points 5 days ago I'm not opposed to the investigations but we don't need justification to end a program designed to screw the American workers. Just fucking end it. I'm so tired of cowardly politicians. permalink parent award report block reply Jack_NC 1 points 5 days ago one word \"DREAMERS\" Obama invented that shit and you'd think it was carved into the backside of the 10 Commandments, or scrawled in George Washington's own blood across the front of the US Constitution. The courts refuse to shut down the DREAM immigration act because orange man bad, black muslim indonesian good. edit: the \"DREAM\" action is clearcut, but no court will allow its revocation. In the same way, any immigration policy change that would reverse the actions of a democrat will be overruled. The courts seem determined to flood America with 3rd world garbage (e.g. haiti). permalink parent award report block reply RandyMoss 1 points 5 days ago We are talking about H1B. Dreamers don't have anything to do with that. permalink parent award report block reply view 2 more comments...\nJack_NC 1 points 5 days ago one word \"DREAMERS\" Obama invented that shit and you'd think it was carved into the backside of the 10 Commandments, or scrawled in George Washington's own blood across the front of the US Constitution. The courts refuse to shut down the DREAM immigration act because orange man bad, black muslim indonesian good. edit: the \"DREAM\" action is clearcut, but no court will allow its revocation. In the same way, any immigration policy change that would reverse the actions of a democrat will be overruled. The courts seem determined to flood America with 3rd world garbage (e.g. haiti). permalink parent award report block reply RandyMoss 1 points 5 days ago We are talking about H1B. Dreamers don't have anything to do with that. permalink parent award report block reply view 2 more comments...\nRandyMoss 1 points 5 days ago We are talking about H1B. Dreamers don't have anything to do with that. permalink parent award report block reply view 2 more comments...\nBearing51 12 points 5 days ago Is Amazon or Microsoft included in any of these? permalink award report block reply The_Bloofy_Bullshark 6 points 5 days ago What’s funny (sad) is Amazon and Microsoft are Indian H1B shops. Meta is mostly Chinese. Nothing ever happens to them though. If you’re American and hired on, you’re almost certainly not making it to your cliff since you’ll be PIP long before that. permalink parent award report block reply DontDoxMeBro1 14 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply SanityGumby -9 points 5 days ago / u/f-b-i can you start banning the hundreds of turbo faggots that are saying this kind of shit non stop. It violates the site content policy and because not enough is being done it’s virtually every post flooded with these idiots. permalink parent award report block reply Awan-CIA-Car-Lot 6 points 5 days ago It's u/-f-b-i- The user you linked is banned, lol permalink parent award report block reply SanityGumby -1 points 5 days ago Thanks. It's the only mod I rarely ever see even show up. permalink parent award report block reply view 4 more comments... LongerThanTheNile 0 points 5 days ago Found the Pajeet crying for mods. Back to Reddit with you, soyboy. permalink parent award report block reply SanityGumby 1 points 5 days ago Based on your posts you are far more likely to be a pajeet than me. permalink parent award report block reply flashersenpai -1 points 5 days ago dont be so sensitive damn just downvote permalink parent award report block reply\nThe_Bloofy_Bullshark 6 points 5 days ago What’s funny (sad) is Amazon and Microsoft are Indian H1B shops. Meta is mostly Chinese. Nothing ever happens to them though. If you’re American and hired on, you’re almost certainly not making it to your cliff since you’ll be PIP long before that. permalink parent award report block reply\nDontDoxMeBro1 14 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply SanityGumby -9 points 5 days ago / u/f-b-i can you start banning the hundreds of turbo faggots that are saying this kind of shit non stop. It violates the site content policy and because not enough is being done it’s virtually every post flooded with these idiots. permalink parent award report block reply Awan-CIA-Car-Lot 6 points 5 days ago It's u/-f-b-i- The user you linked is banned, lol permalink parent award report block reply SanityGumby -1 points 5 days ago Thanks. It's the only mod I rarely ever see even show up. permalink parent award report block reply view 4 more comments... LongerThanTheNile 0 points 5 days ago Found the Pajeet crying for mods. Back to Reddit with you, soyboy. permalink parent award report block reply SanityGumby 1 points 5 days ago Based on your posts you are far more likely to be a pajeet than me. permalink parent award report block reply flashersenpai -1 points 5 days ago dont be so sensitive damn just downvote permalink parent award report block reply\nSanityGumby -9 points 5 days ago / u/f-b-i can you start banning the hundreds of turbo faggots that are saying this kind of shit non stop. It violates the site content policy and because not enough is being done it’s virtually every post flooded with these idiots. permalink parent award report block reply Awan-CIA-Car-Lot 6 points 5 days ago It's u/-f-b-i- The user you linked is banned, lol permalink parent award report block reply SanityGumby -1 points 5 days ago Thanks. It's the only mod I rarely ever see even show up. permalink parent award report block reply view 4 more comments... LongerThanTheNile 0 points 5 days ago Found the Pajeet crying for mods. Back to Reddit with you, soyboy. permalink parent award report block reply SanityGumby 1 points 5 days ago Based on your posts you are far more likely to be a pajeet than me. permalink parent award report block reply flashersenpai -1 points 5 days ago dont be so sensitive damn just downvote permalink parent award report block reply\nAwan-CIA-Car-Lot 6 points 5 days ago It's u/-f-b-i- The user you linked is banned, lol permalink parent award report block reply SanityGumby -1 points 5 days ago Thanks. It's the only mod I rarely ever see even show up. permalink parent award report block reply view 4 more comments...\nSanityGumby -1 points 5 days ago Thanks. It's the only mod I rarely ever see even show up. permalink parent award report block reply view 4 more comments...\nLongerThanTheNile 0 points 5 days ago Found the Pajeet crying for mods. Back to Reddit with you, soyboy. permalink parent award report block reply SanityGumby 1 points 5 days ago Based on your posts you are far more likely to be a pajeet than me. permalink parent award report block reply\nSanityGumby 1 points 5 days ago Based on your posts you are far more likely to be a pajeet than me. permalink parent award report block reply\nflashersenpai -1 points 5 days ago dont be so sensitive damn just downvote permalink parent award report block reply\nUntakenUsername 12 points 5 days ago I've trained my jeet replacement twice in my career. End this shit completely and immediately. Not a single foreigner should have a job in this country if a single American doesn't. permalink award report block reply obar1 7 points 5 days ago imagine waking up and going to work doing that shit.... I feel for you Fren... permalink parent award report block reply UntakenUsername 7 points 5 days ago In one case, it was 3 months of getting his access sorted and doing knowledge transfer. I sat next to this dude for 3 months who could barely speak English and smelled like an open grave. Not a fun time, I can assure you.\nThe other time wasn't much better. At least he could speak English enough to understand 90% of the time. I had a choice both times to train them or lose severance. permalink parent award report block reply LongerThanTheNile 1 points 5 days ago How long ago did this shit occur? And I don't suppose you'd want to name and shame? (Completely understand if you don't.) permalink parent award report block reply throat_GOAT_charlie 1 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply\nobar1 7 points 5 days ago imagine waking up and going to work doing that shit.... I feel for you Fren... permalink parent award report block reply UntakenUsername 7 points 5 days ago In one case, it was 3 months of getting his access sorted and doing knowledge transfer. I sat next to this dude for 3 months who could barely speak English and smelled like an open grave. Not a fun time, I can assure you.\nThe other time wasn't much better. At least he could speak English enough to understand 90% of the time. I had a choice both times to train them or lose severance. permalink parent award report block reply LongerThanTheNile 1 points 5 days ago How long ago did this shit occur? And I don't suppose you'd want to name and shame? (Completely understand if you don't.) permalink parent award report block reply\nUntakenUsername 7 points 5 days ago In one case, it was 3 months of getting his access sorted and doing knowledge transfer. I sat next to this dude for 3 months who could barely speak English and smelled like an open grave. Not a fun time, I can assure you.\nThe other time wasn't much better. At least he could speak English enough to understand 90% of the time. I had a choice both times to train them or lose severance. permalink parent award report block reply LongerThanTheNile 1 points 5 days ago How long ago did this shit occur? And I don't suppose you'd want to name and shame? (Completely understand if you don't.) permalink parent award report block reply\nLongerThanTheNile 1 points 5 days ago How long ago did this shit occur? And I don't suppose you'd want to name and shame? (Completely understand if you don't.) permalink parent award report block reply\nthroat_GOAT_charlie 1 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply\nAoikaze2000 8 points 5 days ago Time for the administration to gut the tech industry. permalink award report block reply throat_GOAT_charlie 1 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply\nthroat_GOAT_charlie 1 points 5 days ago Comment removed upon the user being banned. permalink parent award report block reply\nViewer01 7 points 5 days ago I made a post about this. A h1b got yoinked back to India at my work. It was not any kind of specialized role. Hell, they posted for a job that’s 90% outsourced over there. It’s a small long term win and a drop in the bucket, but it’s something. permalink award report block reply flashersenpai 0 points 5 days ago nice permalink parent award report block reply\nflashersenpai 0 points 5 days ago nice permalink parent award report block reply\nMathletesFoot 7 points 5 days ago That's 175 more than I was aware of. Why aren't they trumpeting this shit from the rooftops? permalink award report block reply TPMJB 9 points 5 days ago Because DaS rACiSt! All the curry worshippers are seething right now. permalink parent award report block reply SanityGumby 7 points 5 days ago Vance said he was going to make this happen as soon as someone told him Microsoft laid off 12k employees and immediately hired 9k Indians. Months ago. They are also going to ban anyone coming in with chronic illnesses without a specific visa to get healthcare and means testing. https://www.msn.com/en-us/health/other/immigrants-with-health-conditions-may-be-denied-visas-under-new-guidance/ar-AA1Q0pmv?ocid=BingNewsSerp permalink parent award report block reply FatigueIsReal -3 points 5 days ago That microsoft situation is still hilarious to me. That simple sentence isn't at all what happened, but oh well. I guess if it got people off their ass it doesn't matter how honest the reporting was. permalink parent award report block reply SanityGumby 6 points 5 days ago It literally did happen. Repeatedly. In July they laid off 9k American employees and immediately filed for nearly 14k H1bs. permalink parent award report block reply FatigueIsReal -2 points 5 days ago You just reversed your numbers. If you go and review it, the 13k layoffs included H1Bs and were in an entirely different part of the company from where the hiring was. Additionally a company can't directly \"hire H1Bs.\" They post jobs and if no americans apply they can consider H1Bs. Microsoft only has 5,000 H1B approvals in total in 2025.  The numbers you are posting are not numerically possible. permalink parent award report block reply view 2 more comments... DT170x 3 points 5 days ago News won't report any good news because it make Trump look good. Best bet to look at the rapidly growing alternative news market. permalink parent award report block reply\nTPMJB 9 points 5 days ago Because DaS rACiSt! All the curry worshippers are seething right now. permalink parent award report block reply\nSanityGumby 7 points 5 days ago Vance said he was going to make this happen as soon as someone told him Microsoft laid off 12k employees and immediately hired 9k Indians. Months ago. They are also going to ban anyone coming in with chronic illnesses without a specific visa to get healthcare and means testing. https://www.msn.com/en-us/health/other/immigrants-with-health-conditions-may-be-denied-visas-under-new-guidance/ar-AA1Q0pmv?ocid=BingNewsSerp permalink parent award report block reply FatigueIsReal -3 points 5 days ago That microsoft situation is still hilarious to me. That simple sentence isn't at all what happened, but oh well. I guess if it got people off their ass it doesn't matter how honest the reporting was. permalink parent award report block reply SanityGumby 6 points 5 days ago It literally did happen. Repeatedly. In July they laid off 9k American employees and immediately filed for nearly 14k H1bs. permalink parent award report block reply FatigueIsReal -2 points 5 days ago You just reversed your numbers. If you go and review it, the 13k layoffs included H1Bs and were in an entirely different part of the company from where the hiring was. Additionally a company can't directly \"hire H1Bs.\" They post jobs and if no americans apply they can consider H1Bs. Microsoft only has 5,000 H1B approvals in total in 2025.  The numbers you are posting are not numerically possible. permalink parent award report block reply view 2 more comments...\nFatigueIsReal -3 points 5 days ago That microsoft situation is still hilarious to me. That simple sentence isn't at all what happened, but oh well. I guess if it got people off their ass it doesn't matter how honest the reporting was. permalink parent award report block reply SanityGumby 6 points 5 days ago It literally did happen. Repeatedly. In July they laid off 9k American employees and immediately filed for nearly 14k H1bs. permalink parent award report block reply FatigueIsReal -2 points 5 days ago You just reversed your numbers. If you go and review it, the 13k layoffs included H1Bs and were in an entirely different part of the company from where the hiring was. Additionally a company can't directly \"hire H1Bs.\" They post jobs and if no americans apply they can consider H1Bs. Microsoft only has 5,000 H1B approvals in total in 2025.  The numbers you are posting are not numerically possible. permalink parent award report block reply view 2 more comments...\nSanityGumby 6 points 5 days ago It literally did happen. Repeatedly. In July they laid off 9k American employees and immediately filed for nearly 14k H1bs. permalink parent award report block reply FatigueIsReal -2 points 5 days ago You just reversed your numbers. If you go and review it, the 13k layoffs included H1Bs and were in an entirely different part of the company from where the hiring was. Additionally a company can't directly \"hire H1Bs.\" They post jobs and if no americans apply they can consider H1Bs. Microsoft only has 5,000 H1B approvals in total in 2025.  The numbers you are posting are not numerically possible. permalink parent award report block reply view 2 more comments...\nFatigueIsReal -2 points 5 days ago You just reversed your numbers. If you go and review it, the 13k layoffs included H1Bs and were in an entirely different part of the company from where the hiring was. Additionally a company can't directly \"hire H1Bs.\" They post jobs and if no americans apply they can consider H1Bs. Microsoft only has 5,000 H1B approvals in total in 2025.  The numbers you are posting are not numerically possible. permalink parent award report block reply view 2 more comments...\nDT170x 3 points 5 days ago News won't report any good news because it make Trump look good. Best bet to look at the rapidly growing alternative news market. permalink parent award report block reply\none_cool 6 points 5 days ago i reported one large chip maker for having parallel hiring systems (one for jeets, one for everyone else)  I think they are investigating. permalink award report block reply Jack_NC 1 points 5 days ago If you look at the H1b jobs posted at https://www.myvisajobs.com/reports/h1b/ you'll be shocked at how many of them request a resume be sent to 'immigration@<companyname.com>' permalink parent award report block reply flashersenpai 0 points 5 days ago good job permalink parent award report block reply\nJack_NC 1 points 5 days ago If you look at the H1b jobs posted at https://www.myvisajobs.com/reports/h1b/ you'll be shocked at how many of them request a resume be sent to 'immigration@<companyname.com>' permalink parent award report block reply\nflashersenpai 0 points 5 days ago good job permalink parent award report block reply\nBuenoDrake 5 points 5 days ago Hammer Ebay and Microsoft permalink award report block reply DeportThemAllForever 6 points 5 days ago And Apple, Facebook, Amazon, ibm, ho, Oracle, .. every tech company. permalink parent award report block reply booblitchutz 3 points 5 days ago EVERY one permalink parent award report block reply\nDeportThemAllForever 6 points 5 days ago And Apple, Facebook, Amazon, ibm, ho, Oracle, .. every tech company. permalink parent award report block reply booblitchutz 3 points 5 days ago EVERY one permalink parent award report block reply\nbooblitchutz 3 points 5 days ago EVERY one permalink parent award report block reply\nVorticity1 5 points 5 days ago How about 1 arrest Blondi? permalink award report block reply\nBubbahax 5 points 5 days ago They could eliminate H1-Bs entirely and these companies would just offshore positions and keep hiring Indians. permalink award report block reply HelluvaEngineer 7 points 5 days ago At least they won't live around me. permalink parent award report block reply\nHelluvaEngineer 7 points 5 days ago At least they won't live around me. permalink parent award report block reply\nFoxbat 5 points 5 days ago How about we end all job based immigration? Ya there may be some one in a million job where the right person is hard to find. But guess what? Thats ok. It just means you need to train someone. Invest in your personnel. Pay your corporate taxes instead of trying to evade them. Hire American workers. permalink award report block reply\nknnbccb 5 points 5 days ago Once the jeets get into the HR department of a company, or assume the role of someone who makes hiring decisions, give it a few more years and that company will eventually be jeet-ified. It's an observable, empirical fact that can be replicated anywhere in the world. permalink award report block reply\nRusherOfDin 5 points 5 days ago I was restructured out of my company 5 years ago just before covid hit and I am not kidding when I say I was literally the last white guy in the building except for the building manager who was in charge of making sure the HVAC worked and the elevators went up and down. The break room was like New Delhi. Nobody even bothered speaking English anymore. That was after 12 years at that company. Luckily with all the extra covid unemployment money I was able to sit on my ass until crypto took off in such a way that I was able to retire early and move out to the country. Sold my house to some Pakistani H-1Bs at the top of the market. Again not even kidding. permalink award report block reply flashersenpai 0 points 5 days ago damn permalink parent award report block reply\nflashersenpai 0 points 5 days ago damn permalink parent award report block reply\nhenri_derelicte 5 points 5 days ago If you want to end work visa abuse, stop issuing visas to India and China would cut down on the bulk of it. Adding a few other shithole countries to the list beyond that would get rid of 98-99% of the problem permalink award report block reply HelluvaEngineer 3 points 5 days ago They are already moving into Bangladesh and the Philippines. permalink parent award report block reply\nHelluvaEngineer 3 points 5 days ago They are already moving into Bangladesh and the Philippines. permalink parent award report block reply\nKernalMustard 4 points 5 days ago \"Investigations\" permalink award report block reply\nRizzlieDoodad 4 points 5 days ago wow only 175?  Such an impact! permalink award report block reply Jack_NC 1 points 5 days ago And dozens or even a hundred illegals deported every day. Why, in only a few thousand years we'll be back to pre-Biden levels. permalink parent award report block reply RizzlieDoodad 2 points 4 days ago We got the Temu version permalink parent award report block reply\nJack_NC 1 points 5 days ago And dozens or even a hundred illegals deported every day. Why, in only a few thousand years we'll be back to pre-Biden levels. permalink parent award report block reply RizzlieDoodad 2 points 4 days ago We got the Temu version permalink parent award report block reply\nRizzlieDoodad 2 points 4 days ago We got the Temu version permalink parent award report block reply\nhalfstep 4 points 5 days ago Moar investigations yay!! permalink award report block reply\njosiborg 4 points 5 days ago 1.75M isn't enough and it needs to include all not just H1B. permalink award report block reply\nmailinvoter 4 points 5 days ago They should investigate the FBI.  I hear there's a DEI panjeet running the place. permalink award report block reply\nnzsvz9 4 points 5 days ago I voted for this. American jobs for Americans. Let the world create their own jobs - GTFO! permalink award report block reply\nfjzappa 3 points 5 days ago Every single high tech company. permalink award report block reply\nUndercoverSpez 3 points 5 days ago So why keep the program? Already abused. Will be further abused when Trumps not around. More loopholes will be found. Crazy, stop illegal immigration but import people to bring the same issues illegals bring. permalink award report block reply\nAmericanMan00 3 points 5 days ago Hey Guy's, in my American town a Swedish guy moved in and built a factory.  He H1B's all his employee's from Sweden.  He pays high wages which allows them to buy most of the housing in the area. It's always good to look at a problem from multiple angles. Amazon @ 12k+ H1B's permalink award report block reply\nBramage 3 points 5 days ago ...unless bondi is involved... permalink award report block reply\npatrioticwinning3 3 points 5 days ago If they ended H1Bs, THERE WOULD BE NO NEED FOR THESE INVESTIGATIONS! permalink award report block reply\nhansgruber7 3 points 5 days ago H1B just needs to be eliminated entirely.  It has been abused far too often. permalink award report block reply\nLynnforthetruth 2 points 5 days ago Check Home Depot permalink award report block reply\nLol_Garrus 2 points 5 days ago Wouldnt have abuse if there was no system at all permalink award report block reply\nTrumpRideorDie74 2 points 5 days ago Instead of focusing on the companies right now, how about we abolish the entire visa system AND THEN go after the companies. This is like scooping the water out of a flood without addressing the leak itself. permalink award report block reply\nRoyalseq 2 points 5 days ago CitiusTech.  Investigate them. permalink award report block reply\nFCUK_REDDIT 2 points 5 days ago Check US airports. Theyre hiring people that dont speak English. permalink award report block reply\nMinneMAGA 2 points 5 days ago This could easily be solved by ending the H1B program permalink award report block reply\nfriedchicken 2 points 5 days ago Keep pushing.  Ignore the media, ignore the politics of it, ignore everything and just go. This is enforcement of the law, not negotiable. permalink award report block reply\nStruggleSession 2 points 5 days ago off the top of my head Vanguard, Well Fargos, Bank of America, Lowes, Apple, Microsoft, Walmart, USAA permalink award report block reply\nBlippiIsAPedo 2 points 5 days ago I hope that is companies, not people permalink award report block reply\nGoUSA 2 points 5 days ago B******* smoke screens. They don't need any investigations. They just need to enforce the laws that are already on the books and punish those who are breaking them. They're taking us for fools. And maybe we are permalink award report block reply\nLongerThanTheNile 2 points 5 days ago H-1B program needs to be abolished, not \"enhanced.\" It's pure fraud from top to bottom. MAGA voters are nearly unanimous in wanting this shit gone, and Trump can do it TODAY via EO. I don't understand why he's putting big tech before his base. That won't end well come midterm time. If the H-1B program hasn't been ended by then, it will be a bloodbath. permalink award report block reply Jack_NC 1 points 5 days ago the courts would never, EVER let him end a program that benefits foreigners. Just look at Obama's DREAM act. We're still dealing with those fucking \"dreamers\" after a decade. All illegal. And yet somehow we can't get them out. permalink parent award report block reply yurimodin 0 points 5 days ago He has joos whispering in his ear that we need street shitters for Ai permalink parent award report block reply\nJack_NC 1 points 5 days ago the courts would never, EVER let him end a program that benefits foreigners. Just look at Obama's DREAM act. We're still dealing with those fucking \"dreamers\" after a decade. All illegal. And yet somehow we can't get them out. permalink parent award report block reply\nyurimodin 0 points 5 days ago He has joos whispering in his ear that we need street shitters for Ai permalink parent award report block reply\nTruculentGoose 2 points 5 days ago There is so much swamp to drain its going to take 10+ years permalink award report block reply\nSanityGumby 2 points 5 days ago Yet all the turbo faggots are here saying trump isn’t doing anything permalink award report block reply\ndtrap 2 points 5 days ago USA! USA! USA! permalink award report block reply\njatergator 2 points 5 days ago Where’s the source, fuck all X handle? permalink award report block reply\nTrancePhreak 2 points 5 days ago Nuke H1B permalink award report block reply\ndeleted 2 points 5 days ago SanityGumby 1 points 5 days ago They very well may be in the 175 permalink parent award report block reply\nSanityGumby 1 points 5 days ago They very well may be in the 175 permalink parent award report block reply\nReefay 2 points 5 days ago Why can't the H1B's be paused? It makes no sense. permalink award report block reply PiratePatriotParrot OP 3 points 5 days ago They put 100k on NEW ones but there's even workarounds for that. Doesn't affect spouses, doesn't affect new grads or people who convert from a grad to a H1-B etc. It's all bullshit. permalink parent award report block reply\nPiratePatriotParrot OP 3 points 5 days ago They put 100k on NEW ones but there's even workarounds for that. Doesn't affect spouses, doesn't affect new grads or people who convert from a grad to a H1-B etc. It's all bullshit. permalink parent award report block reply\nMPitcher1776 2 points 5 days ago Check Verizon. permalink award report block reply\nbooblitchutz 2 points 5 days ago H1B and PERM and OPT… permalink award report block reply\naxiy 2 points 5 days ago Needs at least 175,000 investigations. Why is it that every single time I interview with JPMorgan, Goldman Sachs, Bank of America, it's ALWAYS a foreigner (non-white, not even Hispanics). Every single time. permalink award report block reply SanityGumby 1 points 5 days ago There are easily that many being investigated. You don’t investigate a company for one violation. It’s likely 175,000 minimum under review. permalink parent award report block reply PiratePatriotParrot OP 1 points 5 days ago Every company is h1b or outsourcing,  especially tech permalink parent award report block reply\nSanityGumby 1 points 5 days ago There are easily that many being investigated. You don’t investigate a company for one violation. It’s likely 175,000 minimum under review. permalink parent award report block reply\nPiratePatriotParrot OP 1 points 5 days ago Every company is h1b or outsourcing,  especially tech permalink parent award report block reply\nLolitaExpressPilot 1 points 5 days ago 100 billion and a sacrifice for prison from each and we can settle this matter. permalink award report block reply\njedfag 1 points 4 days ago They should go after Global Payments! (Yeah you see their name every time you swipe your card)  They're dev department had two subcontractor companies they used to skirt H1B laws.  About 20 locals and 300 Indians.  I was replaced with an H1B while I was on vacation.  She just got off the airplane.  Cognizant and their many subsidiaries should also be investigated.  You'll be doing them a favor.  They would spend way less on development if they were using American workers.  There are some good Indians but most are SHITE! permalink award report block reply\nNeoAeon 1 points 4 days ago As long as the 175 include the top 100 companies we'll be fine. They're the vanguard of this. If they go after 175 easy to beat little guys it will accomplish nothing. Microsoft, Amazon, Tesla, Intel, Facebook, Google, Walmart, American Airlines, Bank of America have all got to be in that list and they've got to be prioritized. Same with any and all major financial funds, Black Rock, Goldman Sachs, State Street. If those firms aren't being investigated and their transgressions fully prosecuted, this is a psyop to make it look like somethings happening. The small firms are just riding the big firms' coat tails. We can keep going down the list and get them all, but the most important are the big guys. We can't go up the list and win. We have to start big and take out the ones that are providing the infrastructural support for it all. I admit that I include American Airlines and Bank of America not due to their influence, but their hypocrisy. They've got to be call out and renamed H1B airlines and bank of H1B for truth in advertising. permalink award report block reply\nbonedancr 1 points 5 days ago Wish there was a tip/hotline Americans could call or email. permalink award report block reply\nMajJamesMcFarlane 1 points 5 days ago Wow. \"Investigations?\" I can't wait to hear about zero penalties or arrests after the investigations are concluded permalink award report block reply\nflashersenpai 1 points 5 days ago Sugar shill is pinned again with no sources Nice! permalink award report block reply\nJoinTheDiscussion 1 points 5 days ago no investigations into 2020/22/24 voting fraud though... this wont mean SHIT if the democrats win 26/28!!! permalink award report block reply\nPillarOfWisdom 1 points 5 days ago That'll make a dent. permalink award report block reply\nMudDog 1 points 5 days ago we investigated ourselves and we found nothing permalink award report block reply\nYeti2 1 points 5 days ago Good. But close the program to make it better. permalink award report block reply\nKlaus73 1 points 5 days ago Let me know the results snd punishment. permalink award report block reply\nauntjemima 1 points 5 days ago ooooh i bet musk is pissed. permalink award report block reply\nRain_man 1 points 5 days ago Another investigation! 2 weeks, Pedes! permalink award report block reply\n45fan 1 points 5 days ago CANCEL -THE - PROGRAM permalink award report block reply\nChenZhenFromJingWu 1 points 4 days ago They need to investigate talent burst. I cannot even understand what the recruiters for this company are saying. They call me on a regular basis at 3 in the fucking morning and try to pitch jobs. I get 6 different Indians, calling me 5 minutes apart, to convince me in an accent I cannot understand for a job They know nothing about. Someone is paying these fucking idiots. permalink award report block reply\nprojectarcturus1 1 points 5 days ago Jobs for Americans, not foreigners. permalink award report block reply\nnew_guy2 1 points 5 days ago Comment removed by community moderators. permalink award report block reply\nAlmostFullyDilated 1 points 5 days ago Comment removed by community moderators. permalink award report block reply"}