{"id": "1ARK5A8CNk", "contents": "949 Texas Democrat and Senate Candidate Who Lectured Trump Supporters on Christianity Caught Following Porn Stars, Escorts, and OnlyFans Models (www.thegatewaypundit.com) WEIRD posted 3 days ago by Trick 91 comments award share report block Texas Democrat and Senate Candidate Who Lectured Trump Supporters on Christianity Caught Following Porn Stars, Escorts, and Only... A Texas Democrat who has put his Christianity at the forefront of his senatorial campaign may not be as wholesome as he seems. www.thegatewaypundit.com\n91 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno Bldg_2019 66 points 3 days ago Yeah, check that faggot’s hard drives. permalink award report block reply NotYourMan 8 points 3 days ago FAFO! permalink parent award report block reply MAGA9428 -6 points 3 days ago Why? Nothing he did is illegal. permalink parent award report block reply donald_lincoln 12 points 3 days ago Nothing he did that we know about yet was illegal… there’s a bit of a trend with folks like this though. permalink parent award report block reply Bldg_2019 7 points 3 days ago That’s why feds have to seize his hard drives and raid his house. Have to be sure. He’s a white male democrat. Massive pedo risk based on that profile alone. A full family financial audit is also needed. permalink parent award report block reply MAGA9428 -1 points 3 days ago I don’t think you can raid a person’s house because he follows some pornstars. permalink parent award report block reply Bldg_2019 9 points 3 days ago The feds can raid someone’s home for no reason at all. Or they can just make a reason up for fun if they want and then livestream it. You been in a coma for 40 years or something? permalink parent award report block reply Taylor3006 1 points 3 days ago Remember, \"it is ok when we do it\"...... I really don't think there is much hope of voting ourselves out of Gay, Retarded, Clown World....  The Constitution is dead. The Courts are compromised. Our Politicians are all purchased by foreign or enemy interest groups. I think the way to solve our problems is to dissolve the USA and rename ourselves Israel so our politicians will defend our home with as much passion as they do for some foreign shithole. permalink parent award report block reply Klaus73 4 points 3 days ago Apparently that doesn't matter anymore...I am just waiting for the ecclesiarchy. permalink parent award report block reply MAGALADON9 3 points 3 days ago No.  We will see him tried for degeneracy and publicly beaten  and maimed on the wheel. (Nothing will happen the commie is legalizing prostitution and Jay Jones fantasizes about killing political opponents children who die in their arms. Meanwhile hunter Biden had sex with his dead brothers wife got her on crack then fucked her daughter,  his niece; all while knocking up a stripper denying the kid - found he IS the father then claimed poverty.) I mean we've seen what they will accept. permalink parent award report block reply DenturesNancy 37 points 3 days ago TX and democrat should never be in the same sentence permalink award report block reply BerkeleyKM 22 points 3 days ago Christian and democrat don’t really work in any state though permalink parent award report block reply BloodElfSupporter 11 points 3 days ago Oh didn’t you know? The Left has come up with the term “Progressive Christianity” and some even believe Jesus was a communist. Hehe permalink parent award report block reply Kraken_V_Algorithm 7 points 3 days ago Jesus promoted individual compassion and generosity.  Far cry from Lenin indeed! permalink parent award report block reply BloodElfSupporter 6 points 3 days ago Liberals’ idea of compassion and generosity: omg that person is so poor it’s so sad you over there help this poor man in need! You are cruel and heartless if you refuse to do so! permalink parent award report block reply view 1 more comments... 2016TrumpMAGA 5 points 3 days ago I have a formerly Republican acquaintance who went to some 'Christian Retreat' at Columbia and came back a full leftist.  Pro open borders and all that shit. I always knew he had a weak mind, so it was really no surprise.  Got a degree in Public Administration (where they send you when you are in danger of flunking out of business school) and then went to work for government in jobs his daddy got him.  Guy was the epitome of a well spoken fool. permalink parent award report block reply BloodElfSupporter 2 points 3 days ago What a loser permalink parent award report block reply JustInTime2_ 3 points 3 days ago BLASPHEMOUS permalink parent award report block reply Klaus73 1 points 3 days ago Did he sell the bread and fish? permalink parent award report block reply bearhugprolapse 6 points 3 days ago have you seen texas lately? it looks like the bar scene from star wars. permalink parent award report block reply brassmule 2 points 3 days ago Not familiar with the history of Texas much, are you? The trend towards \"Republican\" is a recent series of events. Many of the \"Republicans\" in the state house are RINOs at best, however. Lots of people have the wrong idea about Texas. I live here and I see it every day. permalink parent award report block reply DenturesNancy 0 points 3 days ago I get it you're a libtard commie that voted for Beta Orourke extra hard.  I give 2 shits about history, what matters is now permalink parent award report block reply brassmule 3 points 3 days ago I give 2 shits about history, what matters is now That certainly explains a lot.  Sad. permalink parent award report block reply Taylor3006 1 points 3 days ago Texas was a democrat controlled state for most of its history. It wasn't until Reagan that things started to shift to republican. The idea that they don't hold any sway in Texas is stupid and shows a total lack of knowledge about our state, our history, or our people. permalink parent award report block reply Decepticons-superior 23 points 3 days ago That guy is such a phony. permalink award report block reply Eagle_Balls3 15 points 3 days ago Looks like dollar store  Harry Sisson permalink parent award report block reply Hanging_Chad 4 points 3 days ago yup permalink parent award report block reply EvJohn 1 points 3 days ago That's a low, low blow. And he does.  Kek. permalink parent award report block reply SenorTrumper 19 points 3 days ago Universal Truth: Anyone who makes a big deal out of being deeply religious always turns out to be a scumbag. Just think of all the big evangelicals who were busted. permalink award report block reply KernalMustard 8 points 3 days ago Can confirm permalink parent award report block reply 0111000001100101 6 points 3 days ago Subscribe to my megachurch only 9.99 on apple store. permalink parent award report block reply deleted -11 points 3 days ago Morris_The_Grey 1 points 3 days ago I think a lot of people are. permalink parent award report block reply deleted 13 points 3 days ago MAGA_mantis 23 points 3 days ago So sick and tired of joe Rogan. permalink parent award report block reply TrumpRideorDie74 9 points 3 days ago He's a flip foppin faggot permalink parent award report block reply 0111000001100101 0 points 3 days ago At least he picked a side when it really really reallly mattered. permalink parent award report block reply 123breadman 9 points 3 days ago A Democrat Christian? That is called a fake Christian. You can't be Christian and support abortion. permalink award report block reply agremlinintheworks 9 points 3 days ago He follows those as part of trying to hide that he's a faggot. permalink award report block reply lul_cheto 9 points 3 days ago False Christians always trying to steal the lords wine and lecture his true followers.. permalink award report block reply Chickensaurus 8 points 3 days ago Oh noooo..... pointing out more hypocrisy again. I'm sure Dems will totally vote Republican now. 🙄 permalink award report block reply Filo76 4 points 3 days ago You can shame a true conservative because they betrayed their values. You can never shame a leftist because they have no values. permalink parent award report block reply brewser724 7 points 3 days ago He's trying to save them, guys... permalink award report block reply Hanging_Chad 6 points 3 days ago he can fix them permalink parent award report block reply Hold3r 6 points 3 days ago Ew...woke christianity... permalink award report block reply YT45 3 points 3 days ago Which is, by nature, anti-Christian. permalink parent award report block reply sleepinggiant 6 points 3 days ago this is why you dont emotionally invest in religous leaders. they are usually into the most fucked up shit permalink award report block reply TrumpRideorDie74 1 points 3 days ago 💯 permalink parent award report block reply Angel_Cor 5 points 3 days ago Through the grace of humanity's savior and Lord, Jesus Christ, I've renounced all pornography and self pleasure. The thought that such hypocrites in politics try to lecture us on such things and morality in general while, among other things, supporting the mass murder of unborn babies, is beyond absurd. permalink award report block reply Hanging_Chad 0 points 3 days ago I've renounced all pornography and self pleasure have you renounced pleasuring others? permalink parent award report block reply EdBuck 4 points 3 days ago Creep lol. Who actually \"follows\" porn stars. Pussy is not that hard to get. permalink award report block reply 308freedom 3 points 3 days ago Try being a Democrat. permalink parent award report block reply DrVSGGEOTUSPhD 2 points 3 days ago I don't support the guy but it's his s social media team, they just follow back especially big accounts,  check the article. permalink parent award report block reply Hanging_Chad 1 points 3 days ago kek permalink parent award report block reply mullethawk 1 points 3 days ago Tell me your secrets Ed Buck permalink parent award report block reply patrick_tribett 4 points 3 days ago Bet that ain't all he's following. permalink award report block reply keeponwinning 4 points 3 days ago I don't know specifically what this dude 'liked' on social media, but just a word of caution to everybody; Those porn stars and sex workers have started posting non-sexual content to try and lure in people.  So before you 'like' any content, investigate the author or you could get yourself honeytrapped. permalink award report block reply Sparks1017 4 points 3 days ago Total faggot permalink award report block reply FatigueIsReal 3 points 3 days ago Good.  If Robinson in NC can be shoved aside, so can this fuck. permalink award report block reply friedchicken 3 points 3 days ago This is not the brand of politics we should play permalink award report block reply DoMagnum 2 points 3 days ago Has a remarkable anus. permalink award report block reply SavingPrivateGrace 2 points 3 days ago If he was smart he would embrace his ability to seek glamorous pussy by interviewing them for a leadership position on his campaign.  Then when he finds the hottest pussy, tell them you can't hire them because you want to date them and marry them. permalink award report block reply Canadiapede7 2 points 3 days ago No shit, these people are so easy to spot. Always judge a book based on its cover permalink award report block reply xanax123 1 points 3 days ago At least he’s following women and not men. permalink award report block reply Owmyballz 1 points 3 days ago James Talamarico is a Presbyterian pastor.  Call the false prophet out on that and treat him according to the Bible for his behavior. permalink award report block reply gunzby 1 points 3 days ago Sounds like he should be lecturing ppl on degeneracy permalink award report block reply DoMagnum 1 points 3 days ago Pantomime High Horse. It's a democrat thing. permalink award report block reply asiatrails 1 points 3 days ago He is also a \"supposed\" man of god, a preacher. About as religious as an Islamic goat. He makes Al Sharpton look and sound middle-of-the-road, well-balanced, and reasonable. permalink award report block reply 0111000001100101 1 points 3 days ago This is the same basic pattern that's been bodyslamming our republic. permalink award report block reply MegoThor 1 points 3 days ago Were they all men? permalink award report block reply ReturnOfSmarm 1 points 3 days ago https://streamable.com/lv73mp permalink award report block reply crowdcontrol 1 points 3 days ago Imagine making a big deal about Instagram followers while the GOP is actively covering for rich pedophiles. permalink award report block reply 2016TrumpMAGA 1 points 3 days ago Never trust any 'Christian' who uses his 'religion' as a marketing tool. Whenever someone I'm thinking of doing business with starts talking about church, or especially bible study, I know they're going to try to fuck me. permalink award report block reply Hanging_Chad -2 points 3 days ago ew adult actresses gross permalink award report block reply DCPower 9 points 3 days ago I do believe you mean whore. permalink parent award report block reply Hanging_Chad 3 points 3 days ago do porn stars get to choose the actors they shoot with? permalink parent award report block reply KernalMustard 3 points 3 days ago Sometimes. permalink parent award report block reply ViagraFalls 3 points 3 days ago To some extent.. I think it’s more of a black list: I will not work with [insert name]. Of course getting too picky about it would be a problem. permalink parent award report block reply 0111000001100101 4 points 3 days ago How did it ever be allowed that prostitution is super illegal but since 1950s if it's recorded suddenly it's not illegal.  WTF permalink parent award report block reply Hanging_Chad 2 points 3 days ago solution: record all adult prostitution appointments permalink parent award report block reply 0111000001100101 3 points 3 days ago Navy employee shitposter confirmed. permalink parent award report block reply conservativefrank -4 points 3 days ago OP did the same thing the leftist did. Christianity is belief in Christ, Grace through Christ's sacrifice. It's about forgiveness for sins, not using God's Law to condemn and destroy people. permalink award report block reply DCPower 9 points 3 days ago Condemnation involves execution. Pointing out something is wrong is not condemnation. When they brought the adulteress woman to Jesus, He didn’t require her death, but He did tell her “Go and sin no more.” Nowadays people would tell Jesus He was wrong for saying she was sinning and to stop “condemning” her. permalink parent award report block reply conservativefrank -1 points 3 days ago Show me someone who commits 0 sins. permalink parent award report block reply KernalMustard -1 points 3 days ago I'm tired of being told I'm a sinner when those people accused me of sinning sin way more than I do. I dont believe any more. Take care of your own house and dont sit in judgement of others. permalink parent award report block reply conservativefrank 2 points 3 days ago Me: \"People have forgiveness for sins if they accept it.\" You: \"Stop judging me! Look at that guy sinning! He's rotten!\" permalink parent award report block reply KernalMustard 1 points 3 days ago Hypocrisy much? permalink parent award report block reply conservativefrank -1 points 3 days ago It's a sin. The leftist committed it. It's wise to call it out, so people don't vote for him. However, by God, the leftist's sin receives the same forgiveness as my sins do and as your sins do. Accept the forgiveness and it's yours. permalink parent award report block reply DCPower 2 points 3 days ago That’s just it, the leftist does not get forgiven because they claim “they have no sin”, so the sin remains in them. permalink parent award report block reply conservativefrank 0 points 3 days ago Grace is for sinners. If you accept Grace, you're forgiven. Period. permalink parent award report block reply view 1 more comments...\nBldg_2019 66 points 3 days ago Yeah, check that faggot’s hard drives. permalink award report block reply NotYourMan 8 points 3 days ago FAFO! permalink parent award report block reply MAGA9428 -6 points 3 days ago Why? Nothing he did is illegal. permalink parent award report block reply donald_lincoln 12 points 3 days ago Nothing he did that we know about yet was illegal… there’s a bit of a trend with folks like this though. permalink parent award report block reply Bldg_2019 7 points 3 days ago That’s why feds have to seize his hard drives and raid his house. Have to be sure. He’s a white male democrat. Massive pedo risk based on that profile alone. A full family financial audit is also needed. permalink parent award report block reply MAGA9428 -1 points 3 days ago I don’t think you can raid a person’s house because he follows some pornstars. permalink parent award report block reply Bldg_2019 9 points 3 days ago The feds can raid someone’s home for no reason at all. Or they can just make a reason up for fun if they want and then livestream it. You been in a coma for 40 years or something? permalink parent award report block reply Taylor3006 1 points 3 days ago Remember, \"it is ok when we do it\"...... I really don't think there is much hope of voting ourselves out of Gay, Retarded, Clown World....  The Constitution is dead. The Courts are compromised. Our Politicians are all purchased by foreign or enemy interest groups. I think the way to solve our problems is to dissolve the USA and rename ourselves Israel so our politicians will defend our home with as much passion as they do for some foreign shithole. permalink parent award report block reply Klaus73 4 points 3 days ago Apparently that doesn't matter anymore...I am just waiting for the ecclesiarchy. permalink parent award report block reply MAGALADON9 3 points 3 days ago No.  We will see him tried for degeneracy and publicly beaten  and maimed on the wheel. (Nothing will happen the commie is legalizing prostitution and Jay Jones fantasizes about killing political opponents children who die in their arms. Meanwhile hunter Biden had sex with his dead brothers wife got her on crack then fucked her daughter,  his niece; all while knocking up a stripper denying the kid - found he IS the father then claimed poverty.) I mean we've seen what they will accept. permalink parent award report block reply\nNotYourMan 8 points 3 days ago FAFO! permalink parent award report block reply\nMAGA9428 -6 points 3 days ago Why? Nothing he did is illegal. permalink parent award report block reply donald_lincoln 12 points 3 days ago Nothing he did that we know about yet was illegal… there’s a bit of a trend with folks like this though. permalink parent award report block reply Bldg_2019 7 points 3 days ago That’s why feds have to seize his hard drives and raid his house. Have to be sure. He’s a white male democrat. Massive pedo risk based on that profile alone. A full family financial audit is also needed. permalink parent award report block reply MAGA9428 -1 points 3 days ago I don’t think you can raid a person’s house because he follows some pornstars. permalink parent award report block reply Bldg_2019 9 points 3 days ago The feds can raid someone’s home for no reason at all. Or they can just make a reason up for fun if they want and then livestream it. You been in a coma for 40 years or something? permalink parent award report block reply Taylor3006 1 points 3 days ago Remember, \"it is ok when we do it\"...... I really don't think there is much hope of voting ourselves out of Gay, Retarded, Clown World....  The Constitution is dead. The Courts are compromised. Our Politicians are all purchased by foreign or enemy interest groups. I think the way to solve our problems is to dissolve the USA and rename ourselves Israel so our politicians will defend our home with as much passion as they do for some foreign shithole. permalink parent award report block reply Klaus73 4 points 3 days ago Apparently that doesn't matter anymore...I am just waiting for the ecclesiarchy. permalink parent award report block reply MAGALADON9 3 points 3 days ago No.  We will see him tried for degeneracy and publicly beaten  and maimed on the wheel. (Nothing will happen the commie is legalizing prostitution and Jay Jones fantasizes about killing political opponents children who die in their arms. Meanwhile hunter Biden had sex with his dead brothers wife got her on crack then fucked her daughter,  his niece; all while knocking up a stripper denying the kid - found he IS the father then claimed poverty.) I mean we've seen what they will accept. permalink parent award report block reply\ndonald_lincoln 12 points 3 days ago Nothing he did that we know about yet was illegal… there’s a bit of a trend with folks like this though. permalink parent award report block reply\nBldg_2019 7 points 3 days ago That’s why feds have to seize his hard drives and raid his house. Have to be sure. He’s a white male democrat. Massive pedo risk based on that profile alone. A full family financial audit is also needed. permalink parent award report block reply MAGA9428 -1 points 3 days ago I don’t think you can raid a person’s house because he follows some pornstars. permalink parent award report block reply Bldg_2019 9 points 3 days ago The feds can raid someone’s home for no reason at all. Or they can just make a reason up for fun if they want and then livestream it. You been in a coma for 40 years or something? permalink parent award report block reply Taylor3006 1 points 3 days ago Remember, \"it is ok when we do it\"...... I really don't think there is much hope of voting ourselves out of Gay, Retarded, Clown World....  The Constitution is dead. The Courts are compromised. Our Politicians are all purchased by foreign or enemy interest groups. I think the way to solve our problems is to dissolve the USA and rename ourselves Israel so our politicians will defend our home with as much passion as they do for some foreign shithole. permalink parent award report block reply\nMAGA9428 -1 points 3 days ago I don’t think you can raid a person’s house because he follows some pornstars. permalink parent award report block reply Bldg_2019 9 points 3 days ago The feds can raid someone’s home for no reason at all. Or they can just make a reason up for fun if they want and then livestream it. You been in a coma for 40 years or something? permalink parent award report block reply Taylor3006 1 points 3 days ago Remember, \"it is ok when we do it\"...... I really don't think there is much hope of voting ourselves out of Gay, Retarded, Clown World....  The Constitution is dead. The Courts are compromised. Our Politicians are all purchased by foreign or enemy interest groups. I think the way to solve our problems is to dissolve the USA and rename ourselves Israel so our politicians will defend our home with as much passion as they do for some foreign shithole. permalink parent award report block reply\nBldg_2019 9 points 3 days ago The feds can raid someone’s home for no reason at all. Or they can just make a reason up for fun if they want and then livestream it. You been in a coma for 40 years or something? permalink parent award report block reply\nTaylor3006 1 points 3 days ago Remember, \"it is ok when we do it\"...... I really don't think there is much hope of voting ourselves out of Gay, Retarded, Clown World....  The Constitution is dead. The Courts are compromised. Our Politicians are all purchased by foreign or enemy interest groups. I think the way to solve our problems is to dissolve the USA and rename ourselves Israel so our politicians will defend our home with as much passion as they do for some foreign shithole. permalink parent award report block reply\nKlaus73 4 points 3 days ago Apparently that doesn't matter anymore...I am just waiting for the ecclesiarchy. permalink parent award report block reply\nMAGALADON9 3 points 3 days ago No.  We will see him tried for degeneracy and publicly beaten  and maimed on the wheel. (Nothing will happen the commie is legalizing prostitution and Jay Jones fantasizes about killing political opponents children who die in their arms. Meanwhile hunter Biden had sex with his dead brothers wife got her on crack then fucked her daughter,  his niece; all while knocking up a stripper denying the kid - found he IS the father then claimed poverty.) I mean we've seen what they will accept. permalink parent award report block reply\nDenturesNancy 37 points 3 days ago TX and democrat should never be in the same sentence permalink award report block reply BerkeleyKM 22 points 3 days ago Christian and democrat don’t really work in any state though permalink parent award report block reply BloodElfSupporter 11 points 3 days ago Oh didn’t you know? The Left has come up with the term “Progressive Christianity” and some even believe Jesus was a communist. Hehe permalink parent award report block reply Kraken_V_Algorithm 7 points 3 days ago Jesus promoted individual compassion and generosity.  Far cry from Lenin indeed! permalink parent award report block reply BloodElfSupporter 6 points 3 days ago Liberals’ idea of compassion and generosity: omg that person is so poor it’s so sad you over there help this poor man in need! You are cruel and heartless if you refuse to do so! permalink parent award report block reply view 1 more comments... 2016TrumpMAGA 5 points 3 days ago I have a formerly Republican acquaintance who went to some 'Christian Retreat' at Columbia and came back a full leftist.  Pro open borders and all that shit. I always knew he had a weak mind, so it was really no surprise.  Got a degree in Public Administration (where they send you when you are in danger of flunking out of business school) and then went to work for government in jobs his daddy got him.  Guy was the epitome of a well spoken fool. permalink parent award report block reply BloodElfSupporter 2 points 3 days ago What a loser permalink parent award report block reply JustInTime2_ 3 points 3 days ago BLASPHEMOUS permalink parent award report block reply Klaus73 1 points 3 days ago Did he sell the bread and fish? permalink parent award report block reply bearhugprolapse 6 points 3 days ago have you seen texas lately? it looks like the bar scene from star wars. permalink parent award report block reply brassmule 2 points 3 days ago Not familiar with the history of Texas much, are you? The trend towards \"Republican\" is a recent series of events. Many of the \"Republicans\" in the state house are RINOs at best, however. Lots of people have the wrong idea about Texas. I live here and I see it every day. permalink parent award report block reply DenturesNancy 0 points 3 days ago I get it you're a libtard commie that voted for Beta Orourke extra hard.  I give 2 shits about history, what matters is now permalink parent award report block reply brassmule 3 points 3 days ago I give 2 shits about history, what matters is now That certainly explains a lot.  Sad. permalink parent award report block reply Taylor3006 1 points 3 days ago Texas was a democrat controlled state for most of its history. It wasn't until Reagan that things started to shift to republican. The idea that they don't hold any sway in Texas is stupid and shows a total lack of knowledge about our state, our history, or our people. permalink parent award report block reply\nBerkeleyKM 22 points 3 days ago Christian and democrat don’t really work in any state though permalink parent award report block reply BloodElfSupporter 11 points 3 days ago Oh didn’t you know? The Left has come up with the term “Progressive Christianity” and some even believe Jesus was a communist. Hehe permalink parent award report block reply Kraken_V_Algorithm 7 points 3 days ago Jesus promoted individual compassion and generosity.  Far cry from Lenin indeed! permalink parent award report block reply BloodElfSupporter 6 points 3 days ago Liberals’ idea of compassion and generosity: omg that person is so poor it’s so sad you over there help this poor man in need! You are cruel and heartless if you refuse to do so! permalink parent award report block reply view 1 more comments... 2016TrumpMAGA 5 points 3 days ago I have a formerly Republican acquaintance who went to some 'Christian Retreat' at Columbia and came back a full leftist.  Pro open borders and all that shit. I always knew he had a weak mind, so it was really no surprise.  Got a degree in Public Administration (where they send you when you are in danger of flunking out of business school) and then went to work for government in jobs his daddy got him.  Guy was the epitome of a well spoken fool. permalink parent award report block reply BloodElfSupporter 2 points 3 days ago What a loser permalink parent award report block reply JustInTime2_ 3 points 3 days ago BLASPHEMOUS permalink parent award report block reply Klaus73 1 points 3 days ago Did he sell the bread and fish? permalink parent award report block reply\nBloodElfSupporter 11 points 3 days ago Oh didn’t you know? The Left has come up with the term “Progressive Christianity” and some even believe Jesus was a communist. Hehe permalink parent award report block reply Kraken_V_Algorithm 7 points 3 days ago Jesus promoted individual compassion and generosity.  Far cry from Lenin indeed! permalink parent award report block reply BloodElfSupporter 6 points 3 days ago Liberals’ idea of compassion and generosity: omg that person is so poor it’s so sad you over there help this poor man in need! You are cruel and heartless if you refuse to do so! permalink parent award report block reply view 1 more comments... 2016TrumpMAGA 5 points 3 days ago I have a formerly Republican acquaintance who went to some 'Christian Retreat' at Columbia and came back a full leftist.  Pro open borders and all that shit. I always knew he had a weak mind, so it was really no surprise.  Got a degree in Public Administration (where they send you when you are in danger of flunking out of business school) and then went to work for government in jobs his daddy got him.  Guy was the epitome of a well spoken fool. permalink parent award report block reply BloodElfSupporter 2 points 3 days ago What a loser permalink parent award report block reply JustInTime2_ 3 points 3 days ago BLASPHEMOUS permalink parent award report block reply Klaus73 1 points 3 days ago Did he sell the bread and fish? permalink parent award report block reply\nKraken_V_Algorithm 7 points 3 days ago Jesus promoted individual compassion and generosity.  Far cry from Lenin indeed! permalink parent award report block reply BloodElfSupporter 6 points 3 days ago Liberals’ idea of compassion and generosity: omg that person is so poor it’s so sad you over there help this poor man in need! You are cruel and heartless if you refuse to do so! permalink parent award report block reply view 1 more comments...\nBloodElfSupporter 6 points 3 days ago Liberals’ idea of compassion and generosity: omg that person is so poor it’s so sad you over there help this poor man in need! You are cruel and heartless if you refuse to do so! permalink parent award report block reply view 1 more comments...\n2016TrumpMAGA 5 points 3 days ago I have a formerly Republican acquaintance who went to some 'Christian Retreat' at Columbia and came back a full leftist.  Pro open borders and all that shit. I always knew he had a weak mind, so it was really no surprise.  Got a degree in Public Administration (where they send you when you are in danger of flunking out of business school) and then went to work for government in jobs his daddy got him.  Guy was the epitome of a well spoken fool. permalink parent award report block reply BloodElfSupporter 2 points 3 days ago What a loser permalink parent award report block reply\nBloodElfSupporter 2 points 3 days ago What a loser permalink parent award report block reply\nJustInTime2_ 3 points 3 days ago BLASPHEMOUS permalink parent award report block reply\nKlaus73 1 points 3 days ago Did he sell the bread and fish? permalink parent award report block reply\nbearhugprolapse 6 points 3 days ago have you seen texas lately? it looks like the bar scene from star wars. permalink parent award report block reply\nbrassmule 2 points 3 days ago Not familiar with the history of Texas much, are you? The trend towards \"Republican\" is a recent series of events. Many of the \"Republicans\" in the state house are RINOs at best, however. Lots of people have the wrong idea about Texas. I live here and I see it every day. permalink parent award report block reply DenturesNancy 0 points 3 days ago I get it you're a libtard commie that voted for Beta Orourke extra hard.  I give 2 shits about history, what matters is now permalink parent award report block reply brassmule 3 points 3 days ago I give 2 shits about history, what matters is now That certainly explains a lot.  Sad. permalink parent award report block reply\nDenturesNancy 0 points 3 days ago I get it you're a libtard commie that voted for Beta Orourke extra hard.  I give 2 shits about history, what matters is now permalink parent award report block reply brassmule 3 points 3 days ago I give 2 shits about history, what matters is now That certainly explains a lot.  Sad. permalink parent award report block reply\nbrassmule 3 points 3 days ago I give 2 shits about history, what matters is now That certainly explains a lot.  Sad. permalink parent award report block reply\nTaylor3006 1 points 3 days ago Texas was a democrat controlled state for most of its history. It wasn't until Reagan that things started to shift to republican. The idea that they don't hold any sway in Texas is stupid and shows a total lack of knowledge about our state, our history, or our people. permalink parent award report block reply\nDecepticons-superior 23 points 3 days ago That guy is such a phony. permalink award report block reply Eagle_Balls3 15 points 3 days ago Looks like dollar store  Harry Sisson permalink parent award report block reply Hanging_Chad 4 points 3 days ago yup permalink parent award report block reply EvJohn 1 points 3 days ago That's a low, low blow. And he does.  Kek. permalink parent award report block reply\nEagle_Balls3 15 points 3 days ago Looks like dollar store  Harry Sisson permalink parent award report block reply Hanging_Chad 4 points 3 days ago yup permalink parent award report block reply EvJohn 1 points 3 days ago That's a low, low blow. And he does.  Kek. permalink parent award report block reply\nHanging_Chad 4 points 3 days ago yup permalink parent award report block reply\nEvJohn 1 points 3 days ago That's a low, low blow. And he does.  Kek. permalink parent award report block reply\nSenorTrumper 19 points 3 days ago Universal Truth: Anyone who makes a big deal out of being deeply religious always turns out to be a scumbag. Just think of all the big evangelicals who were busted. permalink award report block reply KernalMustard 8 points 3 days ago Can confirm permalink parent award report block reply 0111000001100101 6 points 3 days ago Subscribe to my megachurch only 9.99 on apple store. permalink parent award report block reply deleted -11 points 3 days ago Morris_The_Grey 1 points 3 days ago I think a lot of people are. permalink parent award report block reply\nKernalMustard 8 points 3 days ago Can confirm permalink parent award report block reply\n0111000001100101 6 points 3 days ago Subscribe to my megachurch only 9.99 on apple store. permalink parent award report block reply\ndeleted -11 points 3 days ago Morris_The_Grey 1 points 3 days ago I think a lot of people are. permalink parent award report block reply\nMorris_The_Grey 1 points 3 days ago I think a lot of people are. permalink parent award report block reply\ndeleted 13 points 3 days ago MAGA_mantis 23 points 3 days ago So sick and tired of joe Rogan. permalink parent award report block reply TrumpRideorDie74 9 points 3 days ago He's a flip foppin faggot permalink parent award report block reply 0111000001100101 0 points 3 days ago At least he picked a side when it really really reallly mattered. permalink parent award report block reply\nMAGA_mantis 23 points 3 days ago So sick and tired of joe Rogan. permalink parent award report block reply TrumpRideorDie74 9 points 3 days ago He's a flip foppin faggot permalink parent award report block reply 0111000001100101 0 points 3 days ago At least he picked a side when it really really reallly mattered. permalink parent award report block reply\nTrumpRideorDie74 9 points 3 days ago He's a flip foppin faggot permalink parent award report block reply 0111000001100101 0 points 3 days ago At least he picked a side when it really really reallly mattered. permalink parent award report block reply\n0111000001100101 0 points 3 days ago At least he picked a side when it really really reallly mattered. permalink parent award report block reply\n123breadman 9 points 3 days ago A Democrat Christian? That is called a fake Christian. You can't be Christian and support abortion. permalink award report block reply\nagremlinintheworks 9 points 3 days ago He follows those as part of trying to hide that he's a faggot. permalink award report block reply\nlul_cheto 9 points 3 days ago False Christians always trying to steal the lords wine and lecture his true followers.. permalink award report block reply\nChickensaurus 8 points 3 days ago Oh noooo..... pointing out more hypocrisy again. I'm sure Dems will totally vote Republican now. 🙄 permalink award report block reply Filo76 4 points 3 days ago You can shame a true conservative because they betrayed their values. You can never shame a leftist because they have no values. permalink parent award report block reply\nFilo76 4 points 3 days ago You can shame a true conservative because they betrayed their values. You can never shame a leftist because they have no values. permalink parent award report block reply\nbrewser724 7 points 3 days ago He's trying to save them, guys... permalink award report block reply Hanging_Chad 6 points 3 days ago he can fix them permalink parent award report block reply\nHanging_Chad 6 points 3 days ago he can fix them permalink parent award report block reply\nHold3r 6 points 3 days ago Ew...woke christianity... permalink award report block reply YT45 3 points 3 days ago Which is, by nature, anti-Christian. permalink parent award report block reply\nYT45 3 points 3 days ago Which is, by nature, anti-Christian. permalink parent award report block reply\nsleepinggiant 6 points 3 days ago this is why you dont emotionally invest in religous leaders. they are usually into the most fucked up shit permalink award report block reply TrumpRideorDie74 1 points 3 days ago 💯 permalink parent award report block reply\nTrumpRideorDie74 1 points 3 days ago 💯 permalink parent award report block reply\nAngel_Cor 5 points 3 days ago Through the grace of humanity's savior and Lord, Jesus Christ, I've renounced all pornography and self pleasure. The thought that such hypocrites in politics try to lecture us on such things and morality in general while, among other things, supporting the mass murder of unborn babies, is beyond absurd. permalink award report block reply Hanging_Chad 0 points 3 days ago I've renounced all pornography and self pleasure have you renounced pleasuring others? permalink parent award report block reply\nHanging_Chad 0 points 3 days ago I've renounced all pornography and self pleasure have you renounced pleasuring others? permalink parent award report block reply\nEdBuck 4 points 3 days ago Creep lol. Who actually \"follows\" porn stars. Pussy is not that hard to get. permalink award report block reply 308freedom 3 points 3 days ago Try being a Democrat. permalink parent award report block reply DrVSGGEOTUSPhD 2 points 3 days ago I don't support the guy but it's his s social media team, they just follow back especially big accounts,  check the article. permalink parent award report block reply Hanging_Chad 1 points 3 days ago kek permalink parent award report block reply mullethawk 1 points 3 days ago Tell me your secrets Ed Buck permalink parent award report block reply\n308freedom 3 points 3 days ago Try being a Democrat. permalink parent award report block reply\nDrVSGGEOTUSPhD 2 points 3 days ago I don't support the guy but it's his s social media team, they just follow back especially big accounts,  check the article. permalink parent award report block reply\nHanging_Chad 1 points 3 days ago kek permalink parent award report block reply\nmullethawk 1 points 3 days ago Tell me your secrets Ed Buck permalink parent award report block reply\npatrick_tribett 4 points 3 days ago Bet that ain't all he's following. permalink award report block reply\nkeeponwinning 4 points 3 days ago I don't know specifically what this dude 'liked' on social media, but just a word of caution to everybody; Those porn stars and sex workers have started posting non-sexual content to try and lure in people.  So before you 'like' any content, investigate the author or you could get yourself honeytrapped. permalink award report block reply\nSparks1017 4 points 3 days ago Total faggot permalink award report block reply\nFatigueIsReal 3 points 3 days ago Good.  If Robinson in NC can be shoved aside, so can this fuck. permalink award report block reply\nfriedchicken 3 points 3 days ago This is not the brand of politics we should play permalink award report block reply\nDoMagnum 2 points 3 days ago Has a remarkable anus. permalink award report block reply\nSavingPrivateGrace 2 points 3 days ago If he was smart he would embrace his ability to seek glamorous pussy by interviewing them for a leadership position on his campaign.  Then when he finds the hottest pussy, tell them you can't hire them because you want to date them and marry them. permalink award report block reply\nCanadiapede7 2 points 3 days ago No shit, these people are so easy to spot. Always judge a book based on its cover permalink award report block reply\nxanax123 1 points 3 days ago At least he’s following women and not men. permalink award report block reply\nOwmyballz 1 points 3 days ago James Talamarico is a Presbyterian pastor.  Call the false prophet out on that and treat him according to the Bible for his behavior. permalink award report block reply\ngunzby 1 points 3 days ago Sounds like he should be lecturing ppl on degeneracy permalink award report block reply\nDoMagnum 1 points 3 days ago Pantomime High Horse. It's a democrat thing. permalink award report block reply\nasiatrails 1 points 3 days ago He is also a \"supposed\" man of god, a preacher. About as religious as an Islamic goat. He makes Al Sharpton look and sound middle-of-the-road, well-balanced, and reasonable. permalink award report block reply\n0111000001100101 1 points 3 days ago This is the same basic pattern that's been bodyslamming our republic. permalink award report block reply\nMegoThor 1 points 3 days ago Were they all men? permalink award report block reply\nReturnOfSmarm 1 points 3 days ago https://streamable.com/lv73mp permalink award report block reply\ncrowdcontrol 1 points 3 days ago Imagine making a big deal about Instagram followers while the GOP is actively covering for rich pedophiles. permalink award report block reply\n2016TrumpMAGA 1 points 3 days ago Never trust any 'Christian' who uses his 'religion' as a marketing tool. Whenever someone I'm thinking of doing business with starts talking about church, or especially bible study, I know they're going to try to fuck me. permalink award report block reply\nHanging_Chad -2 points 3 days ago ew adult actresses gross permalink award report block reply DCPower 9 points 3 days ago I do believe you mean whore. permalink parent award report block reply Hanging_Chad 3 points 3 days ago do porn stars get to choose the actors they shoot with? permalink parent award report block reply KernalMustard 3 points 3 days ago Sometimes. permalink parent award report block reply ViagraFalls 3 points 3 days ago To some extent.. I think it’s more of a black list: I will not work with [insert name]. Of course getting too picky about it would be a problem. permalink parent award report block reply 0111000001100101 4 points 3 days ago How did it ever be allowed that prostitution is super illegal but since 1950s if it's recorded suddenly it's not illegal.  WTF permalink parent award report block reply Hanging_Chad 2 points 3 days ago solution: record all adult prostitution appointments permalink parent award report block reply 0111000001100101 3 points 3 days ago Navy employee shitposter confirmed. permalink parent award report block reply\nDCPower 9 points 3 days ago I do believe you mean whore. permalink parent award report block reply Hanging_Chad 3 points 3 days ago do porn stars get to choose the actors they shoot with? permalink parent award report block reply KernalMustard 3 points 3 days ago Sometimes. permalink parent award report block reply ViagraFalls 3 points 3 days ago To some extent.. I think it’s more of a black list: I will not work with [insert name]. Of course getting too picky about it would be a problem. permalink parent award report block reply\nHanging_Chad 3 points 3 days ago do porn stars get to choose the actors they shoot with? permalink parent award report block reply KernalMustard 3 points 3 days ago Sometimes. permalink parent award report block reply ViagraFalls 3 points 3 days ago To some extent.. I think it’s more of a black list: I will not work with [insert name]. Of course getting too picky about it would be a problem. permalink parent award report block reply\nKernalMustard 3 points 3 days ago Sometimes. permalink parent award report block reply\nViagraFalls 3 points 3 days ago To some extent.. I think it’s more of a black list: I will not work with [insert name]. Of course getting too picky about it would be a problem. permalink parent award report block reply\n0111000001100101 4 points 3 days ago How did it ever be allowed that prostitution is super illegal but since 1950s if it's recorded suddenly it's not illegal.  WTF permalink parent award report block reply Hanging_Chad 2 points 3 days ago solution: record all adult prostitution appointments permalink parent award report block reply 0111000001100101 3 points 3 days ago Navy employee shitposter confirmed. permalink parent award report block reply\nHanging_Chad 2 points 3 days ago solution: record all adult prostitution appointments permalink parent award report block reply 0111000001100101 3 points 3 days ago Navy employee shitposter confirmed. permalink parent award report block reply\n0111000001100101 3 points 3 days ago Navy employee shitposter confirmed. permalink parent award report block reply\nconservativefrank -4 points 3 days ago OP did the same thing the leftist did. Christianity is belief in Christ, Grace through Christ's sacrifice. It's about forgiveness for sins, not using God's Law to condemn and destroy people. permalink award report block reply DCPower 9 points 3 days ago Condemnation involves execution. Pointing out something is wrong is not condemnation. When they brought the adulteress woman to Jesus, He didn’t require her death, but He did tell her “Go and sin no more.” Nowadays people would tell Jesus He was wrong for saying she was sinning and to stop “condemning” her. permalink parent award report block reply conservativefrank -1 points 3 days ago Show me someone who commits 0 sins. permalink parent award report block reply KernalMustard -1 points 3 days ago I'm tired of being told I'm a sinner when those people accused me of sinning sin way more than I do. I dont believe any more. Take care of your own house and dont sit in judgement of others. permalink parent award report block reply conservativefrank 2 points 3 days ago Me: \"People have forgiveness for sins if they accept it.\" You: \"Stop judging me! Look at that guy sinning! He's rotten!\" permalink parent award report block reply KernalMustard 1 points 3 days ago Hypocrisy much? permalink parent award report block reply conservativefrank -1 points 3 days ago It's a sin. The leftist committed it. It's wise to call it out, so people don't vote for him. However, by God, the leftist's sin receives the same forgiveness as my sins do and as your sins do. Accept the forgiveness and it's yours. permalink parent award report block reply DCPower 2 points 3 days ago That’s just it, the leftist does not get forgiven because they claim “they have no sin”, so the sin remains in them. permalink parent award report block reply conservativefrank 0 points 3 days ago Grace is for sinners. If you accept Grace, you're forgiven. Period. permalink parent award report block reply view 1 more comments...\nDCPower 9 points 3 days ago Condemnation involves execution. Pointing out something is wrong is not condemnation. When they brought the adulteress woman to Jesus, He didn’t require her death, but He did tell her “Go and sin no more.” Nowadays people would tell Jesus He was wrong for saying she was sinning and to stop “condemning” her. permalink parent award report block reply conservativefrank -1 points 3 days ago Show me someone who commits 0 sins. permalink parent award report block reply KernalMustard -1 points 3 days ago I'm tired of being told I'm a sinner when those people accused me of sinning sin way more than I do. I dont believe any more. Take care of your own house and dont sit in judgement of others. permalink parent award report block reply conservativefrank 2 points 3 days ago Me: \"People have forgiveness for sins if they accept it.\" You: \"Stop judging me! Look at that guy sinning! He's rotten!\" permalink parent award report block reply\nconservativefrank -1 points 3 days ago Show me someone who commits 0 sins. permalink parent award report block reply KernalMustard -1 points 3 days ago I'm tired of being told I'm a sinner when those people accused me of sinning sin way more than I do. I dont believe any more. Take care of your own house and dont sit in judgement of others. permalink parent award report block reply conservativefrank 2 points 3 days ago Me: \"People have forgiveness for sins if they accept it.\" You: \"Stop judging me! Look at that guy sinning! He's rotten!\" permalink parent award report block reply\nKernalMustard -1 points 3 days ago I'm tired of being told I'm a sinner when those people accused me of sinning sin way more than I do. I dont believe any more. Take care of your own house and dont sit in judgement of others. permalink parent award report block reply conservativefrank 2 points 3 days ago Me: \"People have forgiveness for sins if they accept it.\" You: \"Stop judging me! Look at that guy sinning! He's rotten!\" permalink parent award report block reply\nconservativefrank 2 points 3 days ago Me: \"People have forgiveness for sins if they accept it.\" You: \"Stop judging me! Look at that guy sinning! He's rotten!\" permalink parent award report block reply\nKernalMustard 1 points 3 days ago Hypocrisy much? permalink parent award report block reply conservativefrank -1 points 3 days ago It's a sin. The leftist committed it. It's wise to call it out, so people don't vote for him. However, by God, the leftist's sin receives the same forgiveness as my sins do and as your sins do. Accept the forgiveness and it's yours. permalink parent award report block reply DCPower 2 points 3 days ago That’s just it, the leftist does not get forgiven because they claim “they have no sin”, so the sin remains in them. permalink parent award report block reply conservativefrank 0 points 3 days ago Grace is for sinners. If you accept Grace, you're forgiven. Period. permalink parent award report block reply view 1 more comments...\nconservativefrank -1 points 3 days ago It's a sin. The leftist committed it. It's wise to call it out, so people don't vote for him. However, by God, the leftist's sin receives the same forgiveness as my sins do and as your sins do. Accept the forgiveness and it's yours. permalink parent award report block reply DCPower 2 points 3 days ago That’s just it, the leftist does not get forgiven because they claim “they have no sin”, so the sin remains in them. permalink parent award report block reply conservativefrank 0 points 3 days ago Grace is for sinners. If you accept Grace, you're forgiven. Period. permalink parent award report block reply view 1 more comments...\nDCPower 2 points 3 days ago That’s just it, the leftist does not get forgiven because they claim “they have no sin”, so the sin remains in them. permalink parent award report block reply conservativefrank 0 points 3 days ago Grace is for sinners. If you accept Grace, you're forgiven. Period. permalink parent award report block reply view 1 more comments...\nconservativefrank 0 points 3 days ago Grace is for sinners. If you accept Grace, you're forgiven. Period. permalink parent award report block reply view 1 more comments..."}