{"id": "1ARK9nNheb", "contents": "220 Video: Far-Left Extremist Who Severely Beat a TPUSA Attendee on the Face After Robbing Him at UC Berkeley Has Been Identified and His Name Is Jihad – The Real Face of Antifa Exposed! (conservativeus.com) posted 10 hours ago by MAGAHillbilly 8 comments award share report block Video: Far-Left Extremist Who Severely Beat a TPUSA Attendee on the Face After Robbing Him at UC Berkeley Has Been Identified an... You know, when the radical left’s mask slips, it’s usually ugly, but this UC Berkeley assault takes it to a conservativeus.com\n8 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget MAGAHillbilly OP 2 points 10 hours ago Another ISIS terrorist who works with the left... Jihad sounds and looks right on target. How many more clues do we need before we clue in that Islamic Jihadis are determined to take over?! permalink award report block reply SilentSniper 1 points 9 hours ago Hate crime? Or release him and nothing will happen. permalink award report block reply booblitchutz 1 points 5 hours ago Berkeley, CA Nothing is going to happen to him. He did his duty. permalink parent award report block reply Bearing51 1 points 9 hours ago The far left extremists are in UC Berkely administration and police force. permalink award report block reply Magma_Biscuit 1 points 9 hours ago Just goes to show that turning the other cheek doesn’t work. permalink award report block reply God-is-good 1 points 8 hours ago Department of public health in Cali likes to punch. permalink award report block reply reversethefraud 0 points 10 hours ago I thought jihad was an internal struggle for peace, not outward violence againt people of a different opinion,,,, permalink award report block reply Psarg 1 points 7 hours ago If you kill all your enemies there is peace.  Jihad is about peace. permalink parent award report block reply\nMAGAHillbilly OP 2 points 10 hours ago Another ISIS terrorist who works with the left... Jihad sounds and looks right on target. How many more clues do we need before we clue in that Islamic Jihadis are determined to take over?! permalink award report block reply\nSilentSniper 1 points 9 hours ago Hate crime? Or release him and nothing will happen. permalink award report block reply booblitchutz 1 points 5 hours ago Berkeley, CA Nothing is going to happen to him. He did his duty. permalink parent award report block reply\nbooblitchutz 1 points 5 hours ago Berkeley, CA Nothing is going to happen to him. He did his duty. permalink parent award report block reply\nBearing51 1 points 9 hours ago The far left extremists are in UC Berkely administration and police force. permalink award report block reply\nMagma_Biscuit 1 points 9 hours ago Just goes to show that turning the other cheek doesn’t work. permalink award report block reply\nGod-is-good 1 points 8 hours ago Department of public health in Cali likes to punch. permalink award report block reply\nreversethefraud 0 points 10 hours ago I thought jihad was an internal struggle for peace, not outward violence againt people of a different opinion,,,, permalink award report block reply Psarg 1 points 7 hours ago If you kill all your enemies there is peace.  Jihad is about peace. permalink parent award report block reply\nPsarg 1 points 7 hours ago If you kill all your enemies there is peace.  Jihad is about peace. permalink parent award report block reply"}