{"id": "1ARK514geC", "contents": "273 This is why we need outlier opinions. posted 6 days ago by Belleoffreedom 22 comments award share report block Vigilant Fox 🦊 @VigilantFox • 7d This compound is doing what inhalers, oxygen tanks, and steroids never could. It’s curing the “incurable” and helping people with COPD breathe again. Daniel (74), a man with severe COPD, said he was “ready to die.” But something remarkable happened when he started taking a\n22 comments Sort by Top Top New Worst Old Save Stossels_stach 20 points 6 days ago If most individuals knew there were natural alternatives to every medical recommendation, with less or no side effects, low to no cost comparitively, and home delivery or compounding...They would never go to the hospital again. Look for a good Naturopathic Medical Doctor. They have more training in nutrition and detox than medical doctors, and train for years longer - without a prescription being their only tool. permalink award report block reply ForceMultiplier 5 points 6 days ago I know what DMSO is, It's not \"natural\", it's an industrial solvent. I is used in some trans-dermal patches because it can help carry other medicines into the body. It's also inflammatory anti-inflammatory. The biggest side effect is allegedly a taste of garlic in the mouth after using it topically. I was only using a tiny amount so I had zero side effects. I'm not trying to bash DSMO and I'm glad it's working for him. But it's not \"natural\", and you can't make it by squeezing juice out of trees or something silly like that. permalink parent award report block reply Southernwhitebread2 5 points 6 days ago Its mainly Tree pulp permalink parent award report block reply Ptannerdactyl 9 points 6 days ago And quinine is just bark but it prevents malaria permalink parent award report block reply Shinydenim 7 points 6 days ago You’re just a clump of cells permalink parent award report block reply Stossels_stach 6 points 6 days ago All pharma drugs have come from nature's inspiration. For example, specific strains of spearmint, crosssbred to have high amounts of rosmarinic acid, can help memory and recall more than any drug available currently. permalink parent award report block reply LostElf 13 points 6 days ago Big Pharma: \"Your neighbor's a witch! Burn the witch!\" permalink award report block reply MAG-n-KAG 10 points 6 days ago \"Build a bridge out of her!\" permalink parent award report block reply deleted 12 points 6 days ago sixfingerdildo 5 points 6 days ago keep us updated. note, there was a case where a woman was using a lot of dmso who ended up burning up or something. the metabolism of dmso creates flammable fumes or something, i wish i could remember better details... Found it: https://en.wikipedia.org/wiki/Death_of_Gloria_Ramirez Not spontaneous combustion, just body oder. It's sulfur after all, she must have stank of garlic. permalink parent award report block reply LampshadeDisco 6 points 6 days ago I use it for almost instant pain relief in low back sacral area. I use it in my mouthwash for dental health. I put it on wounds that need help healing. I will say as a caution that ANYTHING you already have on your skin will be absorbed with DMSO. permalink award report block reply Reddit2016 5 points 6 days ago Which one and where do you purchase from? Would love to try this for arthritis. permalink parent award report block reply ForceMultiplier 4 points 6 days ago You could buy a bottle of that solvent off of that big river site easy enough. I used a tiny amount mixed into an ointment I was taking, never tried to huff it. It's also called dimethyl sulfoxide, if that helps permalink parent award report block reply Reddit2016 4 points 6 days ago Thank you! permalink parent award report block reply LampshadeDisco 2 points 6 days ago https://a.co/d/51BCpqn Amazon link. permalink parent award report block reply Belleoffreedom OP 5 points 6 days ago https://x.com/VigilantFox/status/1986118467620110498 permalink award report block reply Psalm-118_24 5 points 6 days ago DMSO Nature's Healer audio book https://youtu.be/8XpyL34xBhQ?si=d8oX4eT0RCQmryHD permalink award report block reply Psalm-118_24 5 points 6 days ago DMSO is used as a horse liniment and can be found at Tractor Supply or anyplace that sells horse supplies.   I've used it for arthritis relief but I cut it with a lotion.  I wonder what she uses to liquefy it for an inhaler?  Here's an update in Daniel... https://youtu.be/G6WZ5UZtb34?si=M8gSBmfeOPyOyGw7 permalink award report block reply ForceMultiplier 6 points 6 days ago I bought some pure solvent DSMO, and it came as a liquid with the viscosity of around the same as glycerin. permalink parent award report block reply LostElf 4 points 6 days ago Keep it around. It may not work for one thing, then offer blissful relief for another, or it may work for family members even if you're disappointed. Strange stuff. permalink award report block reply Reddit2016 4 points 6 days ago saved permalink award report block reply\nStossels_stach 20 points 6 days ago If most individuals knew there were natural alternatives to every medical recommendation, with less or no side effects, low to no cost comparitively, and home delivery or compounding...They would never go to the hospital again. Look for a good Naturopathic Medical Doctor. They have more training in nutrition and detox than medical doctors, and train for years longer - without a prescription being their only tool. permalink award report block reply ForceMultiplier 5 points 6 days ago I know what DMSO is, It's not \"natural\", it's an industrial solvent. I is used in some trans-dermal patches because it can help carry other medicines into the body. It's also inflammatory anti-inflammatory. The biggest side effect is allegedly a taste of garlic in the mouth after using it topically. I was only using a tiny amount so I had zero side effects. I'm not trying to bash DSMO and I'm glad it's working for him. But it's not \"natural\", and you can't make it by squeezing juice out of trees or something silly like that. permalink parent award report block reply Southernwhitebread2 5 points 6 days ago Its mainly Tree pulp permalink parent award report block reply Ptannerdactyl 9 points 6 days ago And quinine is just bark but it prevents malaria permalink parent award report block reply Shinydenim 7 points 6 days ago You’re just a clump of cells permalink parent award report block reply Stossels_stach 6 points 6 days ago All pharma drugs have come from nature's inspiration. For example, specific strains of spearmint, crosssbred to have high amounts of rosmarinic acid, can help memory and recall more than any drug available currently. permalink parent award report block reply\nForceMultiplier 5 points 6 days ago I know what DMSO is, It's not \"natural\", it's an industrial solvent. I is used in some trans-dermal patches because it can help carry other medicines into the body. It's also inflammatory anti-inflammatory. The biggest side effect is allegedly a taste of garlic in the mouth after using it topically. I was only using a tiny amount so I had zero side effects. I'm not trying to bash DSMO and I'm glad it's working for him. But it's not \"natural\", and you can't make it by squeezing juice out of trees or something silly like that. permalink parent award report block reply\nSouthernwhitebread2 5 points 6 days ago Its mainly Tree pulp permalink parent award report block reply Ptannerdactyl 9 points 6 days ago And quinine is just bark but it prevents malaria permalink parent award report block reply Shinydenim 7 points 6 days ago You’re just a clump of cells permalink parent award report block reply Stossels_stach 6 points 6 days ago All pharma drugs have come from nature's inspiration. For example, specific strains of spearmint, crosssbred to have high amounts of rosmarinic acid, can help memory and recall more than any drug available currently. permalink parent award report block reply\nPtannerdactyl 9 points 6 days ago And quinine is just bark but it prevents malaria permalink parent award report block reply\nShinydenim 7 points 6 days ago You’re just a clump of cells permalink parent award report block reply\nStossels_stach 6 points 6 days ago All pharma drugs have come from nature's inspiration. For example, specific strains of spearmint, crosssbred to have high amounts of rosmarinic acid, can help memory and recall more than any drug available currently. permalink parent award report block reply\nLostElf 13 points 6 days ago Big Pharma: \"Your neighbor's a witch! Burn the witch!\" permalink award report block reply MAG-n-KAG 10 points 6 days ago \"Build a bridge out of her!\" permalink parent award report block reply\nMAG-n-KAG 10 points 6 days ago \"Build a bridge out of her!\" permalink parent award report block reply\ndeleted 12 points 6 days ago sixfingerdildo 5 points 6 days ago keep us updated. note, there was a case where a woman was using a lot of dmso who ended up burning up or something. the metabolism of dmso creates flammable fumes or something, i wish i could remember better details... Found it: https://en.wikipedia.org/wiki/Death_of_Gloria_Ramirez Not spontaneous combustion, just body oder. It's sulfur after all, she must have stank of garlic. permalink parent award report block reply\nsixfingerdildo 5 points 6 days ago keep us updated. note, there was a case where a woman was using a lot of dmso who ended up burning up or something. the metabolism of dmso creates flammable fumes or something, i wish i could remember better details... Found it: https://en.wikipedia.org/wiki/Death_of_Gloria_Ramirez Not spontaneous combustion, just body oder. It's sulfur after all, she must have stank of garlic. permalink parent award report block reply\nLampshadeDisco 6 points 6 days ago I use it for almost instant pain relief in low back sacral area. I use it in my mouthwash for dental health. I put it on wounds that need help healing. I will say as a caution that ANYTHING you already have on your skin will be absorbed with DMSO. permalink award report block reply Reddit2016 5 points 6 days ago Which one and where do you purchase from? Would love to try this for arthritis. permalink parent award report block reply ForceMultiplier 4 points 6 days ago You could buy a bottle of that solvent off of that big river site easy enough. I used a tiny amount mixed into an ointment I was taking, never tried to huff it. It's also called dimethyl sulfoxide, if that helps permalink parent award report block reply Reddit2016 4 points 6 days ago Thank you! permalink parent award report block reply LampshadeDisco 2 points 6 days ago https://a.co/d/51BCpqn Amazon link. permalink parent award report block reply\nReddit2016 5 points 6 days ago Which one and where do you purchase from? Would love to try this for arthritis. permalink parent award report block reply ForceMultiplier 4 points 6 days ago You could buy a bottle of that solvent off of that big river site easy enough. I used a tiny amount mixed into an ointment I was taking, never tried to huff it. It's also called dimethyl sulfoxide, if that helps permalink parent award report block reply Reddit2016 4 points 6 days ago Thank you! permalink parent award report block reply LampshadeDisco 2 points 6 days ago https://a.co/d/51BCpqn Amazon link. permalink parent award report block reply\nForceMultiplier 4 points 6 days ago You could buy a bottle of that solvent off of that big river site easy enough. I used a tiny amount mixed into an ointment I was taking, never tried to huff it. It's also called dimethyl sulfoxide, if that helps permalink parent award report block reply Reddit2016 4 points 6 days ago Thank you! permalink parent award report block reply\nReddit2016 4 points 6 days ago Thank you! permalink parent award report block reply\nLampshadeDisco 2 points 6 days ago https://a.co/d/51BCpqn Amazon link. permalink parent award report block reply\nBelleoffreedom OP 5 points 6 days ago https://x.com/VigilantFox/status/1986118467620110498 permalink award report block reply\nPsalm-118_24 5 points 6 days ago DMSO Nature's Healer audio book https://youtu.be/8XpyL34xBhQ?si=d8oX4eT0RCQmryHD permalink award report block reply\nPsalm-118_24 5 points 6 days ago DMSO is used as a horse liniment and can be found at Tractor Supply or anyplace that sells horse supplies.   I've used it for arthritis relief but I cut it with a lotion.  I wonder what she uses to liquefy it for an inhaler?  Here's an update in Daniel... https://youtu.be/G6WZ5UZtb34?si=M8gSBmfeOPyOyGw7 permalink award report block reply ForceMultiplier 6 points 6 days ago I bought some pure solvent DSMO, and it came as a liquid with the viscosity of around the same as glycerin. permalink parent award report block reply\nForceMultiplier 6 points 6 days ago I bought some pure solvent DSMO, and it came as a liquid with the viscosity of around the same as glycerin. permalink parent award report block reply\nLostElf 4 points 6 days ago Keep it around. It may not work for one thing, then offer blissful relief for another, or it may work for family members even if you're disappointed. Strange stuff. permalink award report block reply\nReddit2016 4 points 6 days ago saved permalink award report block reply"}