{"id": "1ARK9pemH3", "contents": "346 THE REAL DANGER TO DEMOCRACY... TREASON posted 11 hours ago by 3Always3Victorious3 21 comments award share download report block\n21 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget JayKay1776 11 points 11 hours ago The danger to our constitutional republic is fucking retards calling it a democracy permalink award report block reply OnceADroplet 2 points 10 hours ago The danger is the media swaying the moderates giving them surface level opinions to grasp without second thought to the downstream repercussions.  This naturally creates extremists from intelligent observers who care to peek beneath the surface with honest intentions.  These extremists echo back to the moderates through media manipulation causing them to either blow with the breeze or disengage with the madness entirely. permalink parent award report block reply patrioticwinning3 2 points 10 hours ago That grinds my gears so much!  At least educate yourself on what form of government we have! permalink parent award report block reply guywholikesDjtof2024 1 points 11 hours ago u/pdwbot quad brick permalink parent award report block reply SimaYi 1 points 8 hours ago It's a liberal democracy. Look it up. This semantics horseshit is retarded. It's the non-Whites who are the problem and always have been. permalink parent award report block reply JayKay1776 1 points 2 hours ago I'll give you $1,000 if you can name one spot in the Constitution where it says democracy. I'll wait permalink parent award report block reply JayKay1776 1 points 1 hour ago First Use of the Term 'Liberal Democracy'\nThe term \"liberal democracy\" was first coined in 1860s France by liberal opponents of Napoleon III. During the Second Empire (1852–1870), particularly in its \"liberal moment\" of the 1860s, figures such as Eugène Pelletan and Jules Simon used the French phrase \"démocratie libérale\" to advocate for democratic reforms within an authoritarian regime, emphasizing freedom and civil liberties. You're made up bullshit word wasn't even an invented before The Constitution was ratified so therefore we're a fucking constitutional republic you fucking retard. permalink parent award report block reply guywholikesDjtof2024 1 points 8 hours ago non-Christians* permalink parent award report block reply patrioticwinning3 4 points 10 hours ago Yea! Democrats don't want to deport the illegals! Democrats want to flood the country with H1Bs and \"legal\" immigrants undercutting Americans and taking our jobs, while suggesting 50 year mortgages for Americans! Democrats want to import millions of Chicom spies into our colleges! Oh, wait, that's \"our guy...\" my bad.... permalink award report block reply SavingPrivateGrace 3 points 11 hours ago Was there any substantial contribution of greatness they made to America over 10 years that can be proven and repeated successfully? permalink award report block reply guywholikesDjtof2024 2 points 11 hours ago getting Charlie Kirk murdered. Substantial: CHECK Great for them: CHECK (they celebrated it) The answer is YES. YES. And they would happily do it to YOU, TOO . permalink parent award report block reply SavingPrivateGrace 2 points 10 hours ago I know.  That's how I became an expert camouflage and faster than them.  I wouldn't have been that stupid to be the only one on the mic. permalink parent award report block reply ragnarokrobo 2 points 11 hours ago Cool meme grandpa permalink award report block reply TrumpSmashLibtards 2 points 10 hours ago The biggest threat to democracy is white women, single, \"university\" graduates. George Orwell summed it up in 1984: \"It was always the women, and above all the young ones, who were the most bigoted adherents of the Party, the swallowers of slogans, the amateur spies and nosers-out of unorthodoxy.\" permalink award report block reply guywholikesDjtof2024 2 points 10 hours ago The biggest threat is them, only if they believe and follow un-Biblical beliefs. permalink parent award report block reply SimaYi 1 points 8 hours ago The biggest threat to democracy is white women Absolutely false. The biggest threat to \"democracy\" is hordes of foreign non-Whites. permalink parent award report block reply TrumpSmashLibtards 1 points 5 hours ago But look at who voted Mamdani in...he won't condemn 9/11 or sharia law. 70% of women<20 years of age...madness. permalink parent award report block reply Hanging_Chad 2 points 11 hours ago kinda looks like Eeyore permalink award report block reply itspancakees 4 points 11 hours ago Most liberal behavior is explained by depression so it fits permalink parent award report block reply KekPlusOne 1 points 7 hours ago I wish they'd leave donkeys out of this. permalink award report block reply Melodicgrog 1 points 9 hours ago What leftist meme factory came up with this? It’s so long and dull. Get to the point now or come back come back when you can explains it in a word or picture permalink award report block reply\nJayKay1776 11 points 11 hours ago The danger to our constitutional republic is fucking retards calling it a democracy permalink award report block reply OnceADroplet 2 points 10 hours ago The danger is the media swaying the moderates giving them surface level opinions to grasp without second thought to the downstream repercussions.  This naturally creates extremists from intelligent observers who care to peek beneath the surface with honest intentions.  These extremists echo back to the moderates through media manipulation causing them to either blow with the breeze or disengage with the madness entirely. permalink parent award report block reply patrioticwinning3 2 points 10 hours ago That grinds my gears so much!  At least educate yourself on what form of government we have! permalink parent award report block reply guywholikesDjtof2024 1 points 11 hours ago u/pdwbot quad brick permalink parent award report block reply SimaYi 1 points 8 hours ago It's a liberal democracy. Look it up. This semantics horseshit is retarded. It's the non-Whites who are the problem and always have been. permalink parent award report block reply JayKay1776 1 points 2 hours ago I'll give you $1,000 if you can name one spot in the Constitution where it says democracy. I'll wait permalink parent award report block reply JayKay1776 1 points 1 hour ago First Use of the Term 'Liberal Democracy'\nThe term \"liberal democracy\" was first coined in 1860s France by liberal opponents of Napoleon III. During the Second Empire (1852–1870), particularly in its \"liberal moment\" of the 1860s, figures such as Eugène Pelletan and Jules Simon used the French phrase \"démocratie libérale\" to advocate for democratic reforms within an authoritarian regime, emphasizing freedom and civil liberties. You're made up bullshit word wasn't even an invented before The Constitution was ratified so therefore we're a fucking constitutional republic you fucking retard. permalink parent award report block reply guywholikesDjtof2024 1 points 8 hours ago non-Christians* permalink parent award report block reply\nOnceADroplet 2 points 10 hours ago The danger is the media swaying the moderates giving them surface level opinions to grasp without second thought to the downstream repercussions.  This naturally creates extremists from intelligent observers who care to peek beneath the surface with honest intentions.  These extremists echo back to the moderates through media manipulation causing them to either blow with the breeze or disengage with the madness entirely. permalink parent award report block reply\npatrioticwinning3 2 points 10 hours ago That grinds my gears so much!  At least educate yourself on what form of government we have! permalink parent award report block reply\nguywholikesDjtof2024 1 points 11 hours ago u/pdwbot quad brick permalink parent award report block reply\nSimaYi 1 points 8 hours ago It's a liberal democracy. Look it up. This semantics horseshit is retarded. It's the non-Whites who are the problem and always have been. permalink parent award report block reply JayKay1776 1 points 2 hours ago I'll give you $1,000 if you can name one spot in the Constitution where it says democracy. I'll wait permalink parent award report block reply JayKay1776 1 points 1 hour ago First Use of the Term 'Liberal Democracy'\nThe term \"liberal democracy\" was first coined in 1860s France by liberal opponents of Napoleon III. During the Second Empire (1852–1870), particularly in its \"liberal moment\" of the 1860s, figures such as Eugène Pelletan and Jules Simon used the French phrase \"démocratie libérale\" to advocate for democratic reforms within an authoritarian regime, emphasizing freedom and civil liberties. You're made up bullshit word wasn't even an invented before The Constitution was ratified so therefore we're a fucking constitutional republic you fucking retard. permalink parent award report block reply guywholikesDjtof2024 1 points 8 hours ago non-Christians* permalink parent award report block reply\nJayKay1776 1 points 2 hours ago I'll give you $1,000 if you can name one spot in the Constitution where it says democracy. I'll wait permalink parent award report block reply\nJayKay1776 1 points 1 hour ago First Use of the Term 'Liberal Democracy'\nThe term \"liberal democracy\" was first coined in 1860s France by liberal opponents of Napoleon III. During the Second Empire (1852–1870), particularly in its \"liberal moment\" of the 1860s, figures such as Eugène Pelletan and Jules Simon used the French phrase \"démocratie libérale\" to advocate for democratic reforms within an authoritarian regime, emphasizing freedom and civil liberties. You're made up bullshit word wasn't even an invented before The Constitution was ratified so therefore we're a fucking constitutional republic you fucking retard. permalink parent award report block reply\nguywholikesDjtof2024 1 points 8 hours ago non-Christians* permalink parent award report block reply\npatrioticwinning3 4 points 10 hours ago Yea! Democrats don't want to deport the illegals! Democrats want to flood the country with H1Bs and \"legal\" immigrants undercutting Americans and taking our jobs, while suggesting 50 year mortgages for Americans! Democrats want to import millions of Chicom spies into our colleges! Oh, wait, that's \"our guy...\" my bad.... permalink award report block reply\nSavingPrivateGrace 3 points 11 hours ago Was there any substantial contribution of greatness they made to America over 10 years that can be proven and repeated successfully? permalink award report block reply guywholikesDjtof2024 2 points 11 hours ago getting Charlie Kirk murdered. Substantial: CHECK Great for them: CHECK (they celebrated it) The answer is YES. YES. And they would happily do it to YOU, TOO . permalink parent award report block reply SavingPrivateGrace 2 points 10 hours ago I know.  That's how I became an expert camouflage and faster than them.  I wouldn't have been that stupid to be the only one on the mic. permalink parent award report block reply\nguywholikesDjtof2024 2 points 11 hours ago getting Charlie Kirk murdered. Substantial: CHECK Great for them: CHECK (they celebrated it) The answer is YES. YES. And they would happily do it to YOU, TOO . permalink parent award report block reply SavingPrivateGrace 2 points 10 hours ago I know.  That's how I became an expert camouflage and faster than them.  I wouldn't have been that stupid to be the only one on the mic. permalink parent award report block reply\nSavingPrivateGrace 2 points 10 hours ago I know.  That's how I became an expert camouflage and faster than them.  I wouldn't have been that stupid to be the only one on the mic. permalink parent award report block reply\nragnarokrobo 2 points 11 hours ago Cool meme grandpa permalink award report block reply\nTrumpSmashLibtards 2 points 10 hours ago The biggest threat to democracy is white women, single, \"university\" graduates. George Orwell summed it up in 1984: \"It was always the women, and above all the young ones, who were the most bigoted adherents of the Party, the swallowers of slogans, the amateur spies and nosers-out of unorthodoxy.\" permalink award report block reply guywholikesDjtof2024 2 points 10 hours ago The biggest threat is them, only if they believe and follow un-Biblical beliefs. permalink parent award report block reply SimaYi 1 points 8 hours ago The biggest threat to democracy is white women Absolutely false. The biggest threat to \"democracy\" is hordes of foreign non-Whites. permalink parent award report block reply TrumpSmashLibtards 1 points 5 hours ago But look at who voted Mamdani in...he won't condemn 9/11 or sharia law. 70% of women<20 years of age...madness. permalink parent award report block reply\nguywholikesDjtof2024 2 points 10 hours ago The biggest threat is them, only if they believe and follow un-Biblical beliefs. permalink parent award report block reply\nSimaYi 1 points 8 hours ago The biggest threat to democracy is white women Absolutely false. The biggest threat to \"democracy\" is hordes of foreign non-Whites. permalink parent award report block reply TrumpSmashLibtards 1 points 5 hours ago But look at who voted Mamdani in...he won't condemn 9/11 or sharia law. 70% of women<20 years of age...madness. permalink parent award report block reply\nTrumpSmashLibtards 1 points 5 hours ago But look at who voted Mamdani in...he won't condemn 9/11 or sharia law. 70% of women<20 years of age...madness. permalink parent award report block reply\nHanging_Chad 2 points 11 hours ago kinda looks like Eeyore permalink award report block reply itspancakees 4 points 11 hours ago Most liberal behavior is explained by depression so it fits permalink parent award report block reply\nitspancakees 4 points 11 hours ago Most liberal behavior is explained by depression so it fits permalink parent award report block reply\nKekPlusOne 1 points 7 hours ago I wish they'd leave donkeys out of this. permalink award report block reply\nMelodicgrog 1 points 9 hours ago What leftist meme factory came up with this? It’s so long and dull. Get to the point now or come back come back when you can explains it in a word or picture permalink award report block reply"}