{"id": "1ARK9pfKIy", "contents": "894 A very wise man once said: posted 9 hours ago by FBIAREFAGGOTS 66 comments award share report block Charlie Kirk @charliekirk11 • 3M This is the social compact breaking down. We need urgency to restore it: 1 - Mass deportations 2 - Stop the H-1B scam 3 - Dramatically reduce LEGAL Immigration 4 - End chain migration and the Visa Lottery 5 - Build 10 million homes for Americans 6 - Crush the College Cartel\n66 comments Sort by Top Top New Worst Old Save Around the Web One Piece Kills All Parasites in Your Body! Paratoxil Necrovoter 45 points 9 hours ago Point # 6 is vastly underrated.   We need to include the K-12 public education indoctrination system as well. permalink award report block reply BigMikesSwingingCock 24 points 9 hours ago $100k+ debt just to be fed a bunch of bullshit unrelated to the field you want to work in. Flunked or targeted for having a different opinion politically. Professors that don't know half the shit they should know for their field. They remove critical thinking. permalink parent award report block reply ViagraFalls 5 points 8 hours ago We could do IQ-style testing before we even let people into a field. I say IQ-style because IQ tests include math/logic, visual-spatial, and verbal intelligence. If you’re going into engineering or math, I don’t care what your verbal ability is. A plain IQ test would uplift unqualified people with high verbal intelligence who are lacking in math/logic and visual-spatial and possibly closer to average in these areas. Men tend to do better at math/logic and visual-spatial while women tend to do better at verbal. It will favor men as it should in a proper society. permalink parent award report block reply DeepFrozenOcean 3 points 7 hours ago Early education is the key. Some countries never lost that cold war education mentality, and they're striving to make more STEM majors to power industry, but we've declared victory and moved on to push gender studies majors. Law school used to require LSAT. I've heard they don't do that anymore, lol. permalink parent award report block reply NotYourMan 1 points 4 hours ago This came from HEA 1998 by Bill Clinton and the democrats.  HEA 1998 enabled loans with a minimum down payment that didn't effect the principle so it fooled people into decades of payments to the banks.  Democrats always give in to the banks so they can get rich. permalink parent award report block reply LibertarianXian 14 points 9 hours ago Repealing property taxes would help with the K-12. School districts get so much money from that and build these empires of Karens and pantifa. permalink parent award report block reply UCantStumpTheTrump 8 points 7 hours ago Literally most of education is administrative overhead and bloat. Goy daycare for women that serves a dual purpose of indoctrinating children AND destroying the family unit by giving women useless email jobs permalink parent award report block reply DT170x 7 points 9 hours ago Hollywood/Media Pushed Collage Hard throughout the 90's. permalink parent award report block reply BidenShowerDrool 3 points 8 hours ago it had too...they knew the country was being sold out to China along with all those STEM jobs so they pivoted to \"more education to get them out of the factories and into white collar jobs of any description for a smarter future\". permalink parent award report block reply ViagraFalls 5 points 8 hours ago People with any kind of college degree make more money, so let’s send everyone to college and everyone will make more money. Except, we’re actually sending most of the college degree jobs out of the country or importing H1-Bs to do the jobs for peanuts. permalink parent award report block reply BidenShowerDrool 3 points 7 hours ago Correct...the system found a new to fuck over the students with massive scholastic debt by hiring internationals to do their jobs for less money because the Jeets don't have school debts and are happy to live in a hotbed house with 20 other men where as the American needs coin to buy a house adn hopefully start a family. This is where AMERICAN CORPORATE AND POLITICAL GREED  stacked against and fucked the American Dream. permalink parent award report block reply guywholikesDjtof2024 5 points 9 hours ago the \"you must believe in evolution\"-cation system? permalink parent award report block reply patrioticwinning3 4 points 8 hours ago I actually think 10 million homes is underrated, 50+ million! permalink parent award report block reply BidenShowerDrool 3 points 8 hours ago 50 million , 2 and 3 bedroom 1000 sq ft homes is what is needed and it needs to be worthwhile for the contractor to build such entry level smaller homes for family new starters. Problem is there isn't enough juice in the squeeze for builders to bother with such builds nowadays. permalink parent award report block reply HeavyMetalPatriot 3 points 6 hours ago We need ZERO new homes on new land. We do need to deport 50M people and more, then crush crime in the cities. Utterly crush it. Then you have massive urban real estate that needs renovation. AKA, \"gentrify\" the ghettos. Check out pictures of Baltimore, Detroit and Chicago before they got blessed with diversity. permalink parent award report block reply load 5 more comments... MocksFordComma 27 points 9 hours ago He was SO far ahead of his time and he was only 31 permalink award report block reply starjello 2 points 31 minutes ago He was a very good man but to say he was ahead of his time his is underrating many of the people here. By your definition then most of us are ahead of our time permalink parent award report block reply ParadigmShift2070 27 points 9 hours ago Best I can do is 50 year mortgage, 600k Chinese students, and even more h1b pajeets permalink award report block reply Hunter_loves_2_feet 9 points 7 hours ago 30 year was retarded enough. Especially for the crap being built today. permalink parent award report block reply DeportThemAllForever 1 points 22 minutes ago 30 year is an ACA of home loans. permalink parent award report block reply tribunabessica 5 points 8 hours ago Six gorillion jeets permalink parent award report block reply HeavyMetalPatriot 2 points 6 hours ago They aren't potty trained, but they have magical skills no American can imagine!!! permalink parent award report block reply MySidesGoUp 1 points 4 hours ago We have the best street shitters, don’t we? permalink parent award report block reply FakeNametag 15 points 9 hours ago Let's also remember that most of the people aren't homeowners even if they have a house.  Unless it is paid off. I can't imagine my grandfather, who had a 640 acre farm, ever had a mortgage on his house. When did we become corporate slaves who had to work 30 years just to own the roof over our heads? permalink award report block reply Awan-CIA-Car-Lot 10 points 8 hours ago As long as we have to pay property taxes, we never really own our houses and land. permalink parent award report block reply Necrovoter 4 points 6 hours ago The infinitely long period of property taxes is disgusting, especially in states that have primary tax revenue like sales and income tax. permalink parent award report block reply TwoArizonaPedes 10 points 9 hours ago End anchor babies. permalink award report block reply HeavyMetalPatriot 2 points 6 hours ago Anchor's aweigh! Deport them all!! permalink parent award report block reply knnbccb 9 points 9 hours ago I would add another one: abolish 501c3 tax exempt status for ALL organizations. especially churches. permalink award report block reply ThunderSizzle 2 points 3 hours ago Abolish income tax. permalink parent award report block reply guywholikesDjtof2024 0 points 9 hours ago Where on the doll did Churches bite you, you poor oppressed BIPOCLGTBQIA++1+1+P permalink parent award report block reply HeavyMetalPatriot 5 points 6 hours ago 501c3s are a major funding and grifting tool used by mosques. permalink parent award report block reply FatigueIsReal 9 points 9 hours ago Wonder what it looks like with only white people. permalink award report block reply Right_of_Sinner 7 points 8 hours ago You don’t need to build 10 million homes when you deport 50 million leeches permalink award report block reply ThunderSizzle 1 points 3 hours ago With homes being more than twice the price for 5 years....yes you do. We need to build so many homes that buying homes up becomes a very bad business. permalink parent award report block reply cardinaldrones 4 points 8 hours ago I’d rather wait till 37 midlife crisis age before getting married.  Then buy the home and fun car then marry a  much younger woman permalink award report block reply Necrovoter 2 points 6 hours ago Hope you can find a pre-carousel one. permalink parent award report block reply kwakkles 3 points 9 hours ago Must deport permalink award report block reply patrioticwinning3 3 points 8 hours ago God Bless Charlie!  OP username checks out! permalink award report block reply It_takes_10_years 2 points 1 hour ago Wise? \"America will cease to be America if it does not have a Christian foundation and underpinning. So if it is 90 % Indian Christian, is that still America?” — AusPill question “If it’s Christian, yes.” — Charlie Kirk Sorry, but my country is not just an IDEA.\nIdeas are abstract. Ideas don’t bleed, fight, build, or preserve anything on their own. A nation isn’t a TED Talk it’s a real people, with a real culture, a real history, a real lineage, and a real way of life that existed long before think-tanks started calling everything ‘an idea. America didn’t spring out of thin air because someone scribbled principles on parchment.\nThose principles came from the people who built it their traditions, their culture, their worldview, their identity. You don’t get America by swapping out the entire population like a software update and saying, \"Don’t worry guys, the idea is still here!\" Nations are built by the continuity of the people who formed them. Ideas guide a nation people make it exist. When you reduce a country to a floating ideology, you’re basically saying anyone, anywhere, at any time can magically be the same nation just by repeating a slogan. That’s not how nations work. That’s how marketing campaigns work. Call it harsh, but it’s reality:\nAmerica is not just a constitutional pamphlet.\nIt’s a civilization and civilization comes from the people who created it, their shared memory, their culture, and their way of life carried forward through generations. You change the people, you change the nation.\nYou don’t get to swap the entire demographic core and pretend nothing happened\nMy country is not just an idea it’s a people. permalink award report block reply ClarenceBeeks 2 points 9 hours ago Really says it all right there permalink award report block reply barronwin 2 points 7 hours ago lmao build 10 million homes permalink award report block reply FusionBlack 2 points 2 hours ago Then they killed him for it. permalink award report block reply barwhack 1 points 2 hours ago And they killed him for saying it. permalink award report block reply SteveRogers42 1 points 20 minutes ago If we do 1, we won’t need to do 5. permalink award report block reply AlmostFullyDilated 1 points 7 hours ago wise man don't stand in path of bullet -ancient chinese proverb permalink award report block reply conservativefrank 1 points 1 hour ago It isn't happening with Trump. He's now very low energy, seems sickly. permalink award report block reply warlord30 1 points 3 hours ago That’s why they killed him. He understood the metaphysical aspects. Edit: They always kill the prophets. “A prophet is not without honor except in his hometown and in his own household.” Matt 13:57 ESV permalink award report block reply Hanging_Chad 1 points 9 hours ago 10 & 5 are missing from the y-axis 🤔 permalink award report block reply AndyCuomoIsAMobster 1 points 1 hour ago Who's building the 10 million new homes? The corporations that own most of the property in the USA now? How much will they be? Will my gas and grocery prices ever go down? permalink award report block reply LeRiverDanube -1 points 9 hours ago Fuck utah permalink award report block reply guywholikesDjtof2024 1 points 9 hours ago explain please. permalink parent award report block reply LeRiverDanube 6 points 9 hours ago Utah judge allows Charlie Kirk murder suspect Tyler Robinson to wear civilian clothes, bans cameras from filming his entrances, exits Utah state GOP lawmaker is filing to IMPEACH a radical leftist judge who unilaterally created a new Democrat Congressional district. FUCK UTAH permalink parent award report block reply guywholikesDjtof2024 4 points 9 hours ago So attack the JUDGE. You can bet criminals, DEI, and fraud got him in. Not the whole state. permalink parent award report block reply LeRiverDanube 5 points 9 hours ago 'Despite the frustration, Lt. Gov. Deidre Henderson said that she would “comply with Judge Gibson’s order” and begin implementing the map selected by the judge “unless otherwise ordered by an appeals court.' nice representation utah permalink parent award report block reply view 1 more comments... LearnAboutRoaches -6 points 9 hours ago Who's the Faggot Ass mod that stickied this Deport that fucking bitch. Get the fuck off my Trump supporter website you piece of shit Long live President Trump and true Trump supporters. permalink award report block reply PdwH4tesMAGA 0 points 44 minutes ago I love how the Trump simps have taken the mask off and openly parade how Anti-MAGA they always have been. permalink parent award report block reply LearnAboutRoaches 1 points 39 minutes ago Source? permalink parent award report block reply tuaris -9 points 9 hours ago I don't see how points 1 - 4 are at all related to the chart.  Point 5 is retarded and fails to address the root cause.  The only item on that list that makes any type of sense is point 6. permalink award report block reply Raekith 11 points 9 hours ago Illegals take space.  This means goods and services designed for citizens.  This includes housing.  Getting rid of them means opening up those goods and services for Americans. H1B Visas are being used to import cheap third world labor, often (always) for jobs Americans are willing and capable of doing.  The lie about finding the talent abroad is just that - a lie.  Every single H1B sent back home is another job available for an American. Immigrants, even legal ones, take space.  Same as point 1.  Lower the caps on legal immigration and you'll see a reduction in job competition.  Remember basic economics: If you have 10 people competing for 1 job, the job sets the salary.  If you have 1 person competing for 10 jobs, the person sets the salary.  Stop overwhelming the supply of labor, and you'll see an increase in demand from jobs. Compounding on problems 1 and 3.  Chain migration should never have been a thing, just like anchor babies.  Birth Tourism is a very real, and hugely problematic thing for our country.  I can't wait for it to end so we can stop having these 9-month pregnant illegal aliens undergoing potentially dangerous border crossings just to drop their baby before they rightly get deported, then immediately claim they need to stay to keep their family together (because obviously the American child of two illegal aliens needs to stay in America, for some inexplicable reason). permalink parent award report block reply 12345SIX 1 points 3 hours ago Comment removed by community moderators. permalink award report block reply EyesSewnShut 1 points 21 minutes ago Comment removed by community moderators. permalink award report block reply\nNecrovoter 45 points 9 hours ago Point # 6 is vastly underrated.   We need to include the K-12 public education indoctrination system as well. permalink award report block reply BigMikesSwingingCock 24 points 9 hours ago $100k+ debt just to be fed a bunch of bullshit unrelated to the field you want to work in. Flunked or targeted for having a different opinion politically. Professors that don't know half the shit they should know for their field. They remove critical thinking. permalink parent award report block reply ViagraFalls 5 points 8 hours ago We could do IQ-style testing before we even let people into a field. I say IQ-style because IQ tests include math/logic, visual-spatial, and verbal intelligence. If you’re going into engineering or math, I don’t care what your verbal ability is. A plain IQ test would uplift unqualified people with high verbal intelligence who are lacking in math/logic and visual-spatial and possibly closer to average in these areas. Men tend to do better at math/logic and visual-spatial while women tend to do better at verbal. It will favor men as it should in a proper society. permalink parent award report block reply DeepFrozenOcean 3 points 7 hours ago Early education is the key. Some countries never lost that cold war education mentality, and they're striving to make more STEM majors to power industry, but we've declared victory and moved on to push gender studies majors. Law school used to require LSAT. I've heard they don't do that anymore, lol. permalink parent award report block reply NotYourMan 1 points 4 hours ago This came from HEA 1998 by Bill Clinton and the democrats.  HEA 1998 enabled loans with a minimum down payment that didn't effect the principle so it fooled people into decades of payments to the banks.  Democrats always give in to the banks so they can get rich. permalink parent award report block reply LibertarianXian 14 points 9 hours ago Repealing property taxes would help with the K-12. School districts get so much money from that and build these empires of Karens and pantifa. permalink parent award report block reply UCantStumpTheTrump 8 points 7 hours ago Literally most of education is administrative overhead and bloat. Goy daycare for women that serves a dual purpose of indoctrinating children AND destroying the family unit by giving women useless email jobs permalink parent award report block reply DT170x 7 points 9 hours ago Hollywood/Media Pushed Collage Hard throughout the 90's. permalink parent award report block reply BidenShowerDrool 3 points 8 hours ago it had too...they knew the country was being sold out to China along with all those STEM jobs so they pivoted to \"more education to get them out of the factories and into white collar jobs of any description for a smarter future\". permalink parent award report block reply ViagraFalls 5 points 8 hours ago People with any kind of college degree make more money, so let’s send everyone to college and everyone will make more money. Except, we’re actually sending most of the college degree jobs out of the country or importing H1-Bs to do the jobs for peanuts. permalink parent award report block reply BidenShowerDrool 3 points 7 hours ago Correct...the system found a new to fuck over the students with massive scholastic debt by hiring internationals to do their jobs for less money because the Jeets don't have school debts and are happy to live in a hotbed house with 20 other men where as the American needs coin to buy a house adn hopefully start a family. This is where AMERICAN CORPORATE AND POLITICAL GREED  stacked against and fucked the American Dream. permalink parent award report block reply guywholikesDjtof2024 5 points 9 hours ago the \"you must believe in evolution\"-cation system? permalink parent award report block reply patrioticwinning3 4 points 8 hours ago I actually think 10 million homes is underrated, 50+ million! permalink parent award report block reply BidenShowerDrool 3 points 8 hours ago 50 million , 2 and 3 bedroom 1000 sq ft homes is what is needed and it needs to be worthwhile for the contractor to build such entry level smaller homes for family new starters. Problem is there isn't enough juice in the squeeze for builders to bother with such builds nowadays. permalink parent award report block reply HeavyMetalPatriot 3 points 6 hours ago We need ZERO new homes on new land. We do need to deport 50M people and more, then crush crime in the cities. Utterly crush it. Then you have massive urban real estate that needs renovation. AKA, \"gentrify\" the ghettos. Check out pictures of Baltimore, Detroit and Chicago before they got blessed with diversity. permalink parent award report block reply load 5 more comments...\nBigMikesSwingingCock 24 points 9 hours ago $100k+ debt just to be fed a bunch of bullshit unrelated to the field you want to work in. Flunked or targeted for having a different opinion politically. Professors that don't know half the shit they should know for their field. They remove critical thinking. permalink parent award report block reply ViagraFalls 5 points 8 hours ago We could do IQ-style testing before we even let people into a field. I say IQ-style because IQ tests include math/logic, visual-spatial, and verbal intelligence. If you’re going into engineering or math, I don’t care what your verbal ability is. A plain IQ test would uplift unqualified people with high verbal intelligence who are lacking in math/logic and visual-spatial and possibly closer to average in these areas. Men tend to do better at math/logic and visual-spatial while women tend to do better at verbal. It will favor men as it should in a proper society. permalink parent award report block reply DeepFrozenOcean 3 points 7 hours ago Early education is the key. Some countries never lost that cold war education mentality, and they're striving to make more STEM majors to power industry, but we've declared victory and moved on to push gender studies majors. Law school used to require LSAT. I've heard they don't do that anymore, lol. permalink parent award report block reply NotYourMan 1 points 4 hours ago This came from HEA 1998 by Bill Clinton and the democrats.  HEA 1998 enabled loans with a minimum down payment that didn't effect the principle so it fooled people into decades of payments to the banks.  Democrats always give in to the banks so they can get rich. permalink parent award report block reply\nViagraFalls 5 points 8 hours ago We could do IQ-style testing before we even let people into a field. I say IQ-style because IQ tests include math/logic, visual-spatial, and verbal intelligence. If you’re going into engineering or math, I don’t care what your verbal ability is. A plain IQ test would uplift unqualified people with high verbal intelligence who are lacking in math/logic and visual-spatial and possibly closer to average in these areas. Men tend to do better at math/logic and visual-spatial while women tend to do better at verbal. It will favor men as it should in a proper society. permalink parent award report block reply DeepFrozenOcean 3 points 7 hours ago Early education is the key. Some countries never lost that cold war education mentality, and they're striving to make more STEM majors to power industry, but we've declared victory and moved on to push gender studies majors. Law school used to require LSAT. I've heard they don't do that anymore, lol. permalink parent award report block reply\nDeepFrozenOcean 3 points 7 hours ago Early education is the key. Some countries never lost that cold war education mentality, and they're striving to make more STEM majors to power industry, but we've declared victory and moved on to push gender studies majors. Law school used to require LSAT. I've heard they don't do that anymore, lol. permalink parent award report block reply\nNotYourMan 1 points 4 hours ago This came from HEA 1998 by Bill Clinton and the democrats.  HEA 1998 enabled loans with a minimum down payment that didn't effect the principle so it fooled people into decades of payments to the banks.  Democrats always give in to the banks so they can get rich. permalink parent award report block reply\nLibertarianXian 14 points 9 hours ago Repealing property taxes would help with the K-12. School districts get so much money from that and build these empires of Karens and pantifa. permalink parent award report block reply UCantStumpTheTrump 8 points 7 hours ago Literally most of education is administrative overhead and bloat. Goy daycare for women that serves a dual purpose of indoctrinating children AND destroying the family unit by giving women useless email jobs permalink parent award report block reply\nUCantStumpTheTrump 8 points 7 hours ago Literally most of education is administrative overhead and bloat. Goy daycare for women that serves a dual purpose of indoctrinating children AND destroying the family unit by giving women useless email jobs permalink parent award report block reply\nDT170x 7 points 9 hours ago Hollywood/Media Pushed Collage Hard throughout the 90's. permalink parent award report block reply BidenShowerDrool 3 points 8 hours ago it had too...they knew the country was being sold out to China along with all those STEM jobs so they pivoted to \"more education to get them out of the factories and into white collar jobs of any description for a smarter future\". permalink parent award report block reply ViagraFalls 5 points 8 hours ago People with any kind of college degree make more money, so let’s send everyone to college and everyone will make more money. Except, we’re actually sending most of the college degree jobs out of the country or importing H1-Bs to do the jobs for peanuts. permalink parent award report block reply BidenShowerDrool 3 points 7 hours ago Correct...the system found a new to fuck over the students with massive scholastic debt by hiring internationals to do their jobs for less money because the Jeets don't have school debts and are happy to live in a hotbed house with 20 other men where as the American needs coin to buy a house adn hopefully start a family. This is where AMERICAN CORPORATE AND POLITICAL GREED  stacked against and fucked the American Dream. permalink parent award report block reply\nBidenShowerDrool 3 points 8 hours ago it had too...they knew the country was being sold out to China along with all those STEM jobs so they pivoted to \"more education to get them out of the factories and into white collar jobs of any description for a smarter future\". permalink parent award report block reply ViagraFalls 5 points 8 hours ago People with any kind of college degree make more money, so let’s send everyone to college and everyone will make more money. Except, we’re actually sending most of the college degree jobs out of the country or importing H1-Bs to do the jobs for peanuts. permalink parent award report block reply BidenShowerDrool 3 points 7 hours ago Correct...the system found a new to fuck over the students with massive scholastic debt by hiring internationals to do their jobs for less money because the Jeets don't have school debts and are happy to live in a hotbed house with 20 other men where as the American needs coin to buy a house adn hopefully start a family. This is where AMERICAN CORPORATE AND POLITICAL GREED  stacked against and fucked the American Dream. permalink parent award report block reply\nViagraFalls 5 points 8 hours ago People with any kind of college degree make more money, so let’s send everyone to college and everyone will make more money. Except, we’re actually sending most of the college degree jobs out of the country or importing H1-Bs to do the jobs for peanuts. permalink parent award report block reply BidenShowerDrool 3 points 7 hours ago Correct...the system found a new to fuck over the students with massive scholastic debt by hiring internationals to do their jobs for less money because the Jeets don't have school debts and are happy to live in a hotbed house with 20 other men where as the American needs coin to buy a house adn hopefully start a family. This is where AMERICAN CORPORATE AND POLITICAL GREED  stacked against and fucked the American Dream. permalink parent award report block reply\nBidenShowerDrool 3 points 7 hours ago Correct...the system found a new to fuck over the students with massive scholastic debt by hiring internationals to do their jobs for less money because the Jeets don't have school debts and are happy to live in a hotbed house with 20 other men where as the American needs coin to buy a house adn hopefully start a family. This is where AMERICAN CORPORATE AND POLITICAL GREED  stacked against and fucked the American Dream. permalink parent award report block reply\nguywholikesDjtof2024 5 points 9 hours ago the \"you must believe in evolution\"-cation system? permalink parent award report block reply\npatrioticwinning3 4 points 8 hours ago I actually think 10 million homes is underrated, 50+ million! permalink parent award report block reply BidenShowerDrool 3 points 8 hours ago 50 million , 2 and 3 bedroom 1000 sq ft homes is what is needed and it needs to be worthwhile for the contractor to build such entry level smaller homes for family new starters. Problem is there isn't enough juice in the squeeze for builders to bother with such builds nowadays. permalink parent award report block reply HeavyMetalPatriot 3 points 6 hours ago We need ZERO new homes on new land. We do need to deport 50M people and more, then crush crime in the cities. Utterly crush it. Then you have massive urban real estate that needs renovation. AKA, \"gentrify\" the ghettos. Check out pictures of Baltimore, Detroit and Chicago before they got blessed with diversity. permalink parent award report block reply\nBidenShowerDrool 3 points 8 hours ago 50 million , 2 and 3 bedroom 1000 sq ft homes is what is needed and it needs to be worthwhile for the contractor to build such entry level smaller homes for family new starters. Problem is there isn't enough juice in the squeeze for builders to bother with such builds nowadays. permalink parent award report block reply\nHeavyMetalPatriot 3 points 6 hours ago We need ZERO new homes on new land. We do need to deport 50M people and more, then crush crime in the cities. Utterly crush it. Then you have massive urban real estate that needs renovation. AKA, \"gentrify\" the ghettos. Check out pictures of Baltimore, Detroit and Chicago before they got blessed with diversity. permalink parent award report block reply\nMocksFordComma 27 points 9 hours ago He was SO far ahead of his time and he was only 31 permalink award report block reply starjello 2 points 31 minutes ago He was a very good man but to say he was ahead of his time his is underrating many of the people here. By your definition then most of us are ahead of our time permalink parent award report block reply\nstarjello 2 points 31 minutes ago He was a very good man but to say he was ahead of his time his is underrating many of the people here. By your definition then most of us are ahead of our time permalink parent award report block reply\nParadigmShift2070 27 points 9 hours ago Best I can do is 50 year mortgage, 600k Chinese students, and even more h1b pajeets permalink award report block reply Hunter_loves_2_feet 9 points 7 hours ago 30 year was retarded enough. Especially for the crap being built today. permalink parent award report block reply DeportThemAllForever 1 points 22 minutes ago 30 year is an ACA of home loans. permalink parent award report block reply tribunabessica 5 points 8 hours ago Six gorillion jeets permalink parent award report block reply HeavyMetalPatriot 2 points 6 hours ago They aren't potty trained, but they have magical skills no American can imagine!!! permalink parent award report block reply MySidesGoUp 1 points 4 hours ago We have the best street shitters, don’t we? permalink parent award report block reply\nHunter_loves_2_feet 9 points 7 hours ago 30 year was retarded enough. Especially for the crap being built today. permalink parent award report block reply DeportThemAllForever 1 points 22 minutes ago 30 year is an ACA of home loans. permalink parent award report block reply\nDeportThemAllForever 1 points 22 minutes ago 30 year is an ACA of home loans. permalink parent award report block reply\ntribunabessica 5 points 8 hours ago Six gorillion jeets permalink parent award report block reply HeavyMetalPatriot 2 points 6 hours ago They aren't potty trained, but they have magical skills no American can imagine!!! permalink parent award report block reply MySidesGoUp 1 points 4 hours ago We have the best street shitters, don’t we? permalink parent award report block reply\nHeavyMetalPatriot 2 points 6 hours ago They aren't potty trained, but they have magical skills no American can imagine!!! permalink parent award report block reply MySidesGoUp 1 points 4 hours ago We have the best street shitters, don’t we? permalink parent award report block reply\nMySidesGoUp 1 points 4 hours ago We have the best street shitters, don’t we? permalink parent award report block reply\nFakeNametag 15 points 9 hours ago Let's also remember that most of the people aren't homeowners even if they have a house.  Unless it is paid off. I can't imagine my grandfather, who had a 640 acre farm, ever had a mortgage on his house. When did we become corporate slaves who had to work 30 years just to own the roof over our heads? permalink award report block reply Awan-CIA-Car-Lot 10 points 8 hours ago As long as we have to pay property taxes, we never really own our houses and land. permalink parent award report block reply Necrovoter 4 points 6 hours ago The infinitely long period of property taxes is disgusting, especially in states that have primary tax revenue like sales and income tax. permalink parent award report block reply\nAwan-CIA-Car-Lot 10 points 8 hours ago As long as we have to pay property taxes, we never really own our houses and land. permalink parent award report block reply Necrovoter 4 points 6 hours ago The infinitely long period of property taxes is disgusting, especially in states that have primary tax revenue like sales and income tax. permalink parent award report block reply\nNecrovoter 4 points 6 hours ago The infinitely long period of property taxes is disgusting, especially in states that have primary tax revenue like sales and income tax. permalink parent award report block reply\nTwoArizonaPedes 10 points 9 hours ago End anchor babies. permalink award report block reply HeavyMetalPatriot 2 points 6 hours ago Anchor's aweigh! Deport them all!! permalink parent award report block reply\nHeavyMetalPatriot 2 points 6 hours ago Anchor's aweigh! Deport them all!! permalink parent award report block reply\nknnbccb 9 points 9 hours ago I would add another one: abolish 501c3 tax exempt status for ALL organizations. especially churches. permalink award report block reply ThunderSizzle 2 points 3 hours ago Abolish income tax. permalink parent award report block reply guywholikesDjtof2024 0 points 9 hours ago Where on the doll did Churches bite you, you poor oppressed BIPOCLGTBQIA++1+1+P permalink parent award report block reply HeavyMetalPatriot 5 points 6 hours ago 501c3s are a major funding and grifting tool used by mosques. permalink parent award report block reply\nThunderSizzle 2 points 3 hours ago Abolish income tax. permalink parent award report block reply\nguywholikesDjtof2024 0 points 9 hours ago Where on the doll did Churches bite you, you poor oppressed BIPOCLGTBQIA++1+1+P permalink parent award report block reply HeavyMetalPatriot 5 points 6 hours ago 501c3s are a major funding and grifting tool used by mosques. permalink parent award report block reply\nHeavyMetalPatriot 5 points 6 hours ago 501c3s are a major funding and grifting tool used by mosques. permalink parent award report block reply\nFatigueIsReal 9 points 9 hours ago Wonder what it looks like with only white people. permalink award report block reply\nRight_of_Sinner 7 points 8 hours ago You don’t need to build 10 million homes when you deport 50 million leeches permalink award report block reply ThunderSizzle 1 points 3 hours ago With homes being more than twice the price for 5 years....yes you do. We need to build so many homes that buying homes up becomes a very bad business. permalink parent award report block reply\nThunderSizzle 1 points 3 hours ago With homes being more than twice the price for 5 years....yes you do. We need to build so many homes that buying homes up becomes a very bad business. permalink parent award report block reply\ncardinaldrones 4 points 8 hours ago I’d rather wait till 37 midlife crisis age before getting married.  Then buy the home and fun car then marry a  much younger woman permalink award report block reply Necrovoter 2 points 6 hours ago Hope you can find a pre-carousel one. permalink parent award report block reply\nNecrovoter 2 points 6 hours ago Hope you can find a pre-carousel one. permalink parent award report block reply\nkwakkles 3 points 9 hours ago Must deport permalink award report block reply\npatrioticwinning3 3 points 8 hours ago God Bless Charlie!  OP username checks out! permalink award report block reply\nIt_takes_10_years 2 points 1 hour ago Wise? \"America will cease to be America if it does not have a Christian foundation and underpinning. So if it is 90 % Indian Christian, is that still America?” — AusPill question “If it’s Christian, yes.” — Charlie Kirk Sorry, but my country is not just an IDEA.\nIdeas are abstract. Ideas don’t bleed, fight, build, or preserve anything on their own. A nation isn’t a TED Talk it’s a real people, with a real culture, a real history, a real lineage, and a real way of life that existed long before think-tanks started calling everything ‘an idea. America didn’t spring out of thin air because someone scribbled principles on parchment.\nThose principles came from the people who built it their traditions, their culture, their worldview, their identity. You don’t get America by swapping out the entire population like a software update and saying, \"Don’t worry guys, the idea is still here!\" Nations are built by the continuity of the people who formed them. Ideas guide a nation people make it exist. When you reduce a country to a floating ideology, you’re basically saying anyone, anywhere, at any time can magically be the same nation just by repeating a slogan. That’s not how nations work. That’s how marketing campaigns work. Call it harsh, but it’s reality:\nAmerica is not just a constitutional pamphlet.\nIt’s a civilization and civilization comes from the people who created it, their shared memory, their culture, and their way of life carried forward through generations. You change the people, you change the nation.\nYou don’t get to swap the entire demographic core and pretend nothing happened\nMy country is not just an idea it’s a people. permalink award report block reply\nClarenceBeeks 2 points 9 hours ago Really says it all right there permalink award report block reply\nbarronwin 2 points 7 hours ago lmao build 10 million homes permalink award report block reply\nFusionBlack 2 points 2 hours ago Then they killed him for it. permalink award report block reply\nbarwhack 1 points 2 hours ago And they killed him for saying it. permalink award report block reply\nSteveRogers42 1 points 20 minutes ago If we do 1, we won’t need to do 5. permalink award report block reply\nAlmostFullyDilated 1 points 7 hours ago wise man don't stand in path of bullet -ancient chinese proverb permalink award report block reply\nconservativefrank 1 points 1 hour ago It isn't happening with Trump. He's now very low energy, seems sickly. permalink award report block reply\nwarlord30 1 points 3 hours ago That’s why they killed him. He understood the metaphysical aspects. Edit: They always kill the prophets. “A prophet is not without honor except in his hometown and in his own household.” Matt 13:57 ESV permalink award report block reply\nHanging_Chad 1 points 9 hours ago 10 & 5 are missing from the y-axis 🤔 permalink award report block reply\nAndyCuomoIsAMobster 1 points 1 hour ago Who's building the 10 million new homes? The corporations that own most of the property in the USA now? How much will they be? Will my gas and grocery prices ever go down? permalink award report block reply\nLeRiverDanube -1 points 9 hours ago Fuck utah permalink award report block reply guywholikesDjtof2024 1 points 9 hours ago explain please. permalink parent award report block reply LeRiverDanube 6 points 9 hours ago Utah judge allows Charlie Kirk murder suspect Tyler Robinson to wear civilian clothes, bans cameras from filming his entrances, exits Utah state GOP lawmaker is filing to IMPEACH a radical leftist judge who unilaterally created a new Democrat Congressional district. FUCK UTAH permalink parent award report block reply guywholikesDjtof2024 4 points 9 hours ago So attack the JUDGE. You can bet criminals, DEI, and fraud got him in. Not the whole state. permalink parent award report block reply LeRiverDanube 5 points 9 hours ago 'Despite the frustration, Lt. Gov. Deidre Henderson said that she would “comply with Judge Gibson’s order” and begin implementing the map selected by the judge “unless otherwise ordered by an appeals court.' nice representation utah permalink parent award report block reply view 1 more comments...\nguywholikesDjtof2024 1 points 9 hours ago explain please. permalink parent award report block reply LeRiverDanube 6 points 9 hours ago Utah judge allows Charlie Kirk murder suspect Tyler Robinson to wear civilian clothes, bans cameras from filming his entrances, exits Utah state GOP lawmaker is filing to IMPEACH a radical leftist judge who unilaterally created a new Democrat Congressional district. FUCK UTAH permalink parent award report block reply guywholikesDjtof2024 4 points 9 hours ago So attack the JUDGE. You can bet criminals, DEI, and fraud got him in. Not the whole state. permalink parent award report block reply LeRiverDanube 5 points 9 hours ago 'Despite the frustration, Lt. Gov. Deidre Henderson said that she would “comply with Judge Gibson’s order” and begin implementing the map selected by the judge “unless otherwise ordered by an appeals court.' nice representation utah permalink parent award report block reply view 1 more comments...\nLeRiverDanube 6 points 9 hours ago Utah judge allows Charlie Kirk murder suspect Tyler Robinson to wear civilian clothes, bans cameras from filming his entrances, exits Utah state GOP lawmaker is filing to IMPEACH a radical leftist judge who unilaterally created a new Democrat Congressional district. FUCK UTAH permalink parent award report block reply guywholikesDjtof2024 4 points 9 hours ago So attack the JUDGE. You can bet criminals, DEI, and fraud got him in. Not the whole state. permalink parent award report block reply LeRiverDanube 5 points 9 hours ago 'Despite the frustration, Lt. Gov. Deidre Henderson said that she would “comply with Judge Gibson’s order” and begin implementing the map selected by the judge “unless otherwise ordered by an appeals court.' nice representation utah permalink parent award report block reply view 1 more comments...\nguywholikesDjtof2024 4 points 9 hours ago So attack the JUDGE. You can bet criminals, DEI, and fraud got him in. Not the whole state. permalink parent award report block reply LeRiverDanube 5 points 9 hours ago 'Despite the frustration, Lt. Gov. Deidre Henderson said that she would “comply with Judge Gibson’s order” and begin implementing the map selected by the judge “unless otherwise ordered by an appeals court.' nice representation utah permalink parent award report block reply view 1 more comments...\nLeRiverDanube 5 points 9 hours ago 'Despite the frustration, Lt. Gov. Deidre Henderson said that she would “comply with Judge Gibson’s order” and begin implementing the map selected by the judge “unless otherwise ordered by an appeals court.' nice representation utah permalink parent award report block reply view 1 more comments...\nLearnAboutRoaches -6 points 9 hours ago Who's the Faggot Ass mod that stickied this Deport that fucking bitch. Get the fuck off my Trump supporter website you piece of shit Long live President Trump and true Trump supporters. permalink award report block reply PdwH4tesMAGA 0 points 44 minutes ago I love how the Trump simps have taken the mask off and openly parade how Anti-MAGA they always have been. permalink parent award report block reply LearnAboutRoaches 1 points 39 minutes ago Source? permalink parent award report block reply\nPdwH4tesMAGA 0 points 44 minutes ago I love how the Trump simps have taken the mask off and openly parade how Anti-MAGA they always have been. permalink parent award report block reply LearnAboutRoaches 1 points 39 minutes ago Source? permalink parent award report block reply\nLearnAboutRoaches 1 points 39 minutes ago Source? permalink parent award report block reply\ntuaris -9 points 9 hours ago I don't see how points 1 - 4 are at all related to the chart.  Point 5 is retarded and fails to address the root cause.  The only item on that list that makes any type of sense is point 6. permalink award report block reply Raekith 11 points 9 hours ago Illegals take space.  This means goods and services designed for citizens.  This includes housing.  Getting rid of them means opening up those goods and services for Americans. H1B Visas are being used to import cheap third world labor, often (always) for jobs Americans are willing and capable of doing.  The lie about finding the talent abroad is just that - a lie.  Every single H1B sent back home is another job available for an American. Immigrants, even legal ones, take space.  Same as point 1.  Lower the caps on legal immigration and you'll see a reduction in job competition.  Remember basic economics: If you have 10 people competing for 1 job, the job sets the salary.  If you have 1 person competing for 10 jobs, the person sets the salary.  Stop overwhelming the supply of labor, and you'll see an increase in demand from jobs. Compounding on problems 1 and 3.  Chain migration should never have been a thing, just like anchor babies.  Birth Tourism is a very real, and hugely problematic thing for our country.  I can't wait for it to end so we can stop having these 9-month pregnant illegal aliens undergoing potentially dangerous border crossings just to drop their baby before they rightly get deported, then immediately claim they need to stay to keep their family together (because obviously the American child of two illegal aliens needs to stay in America, for some inexplicable reason). permalink parent award report block reply\nRaekith 11 points 9 hours ago Illegals take space.  This means goods and services designed for citizens.  This includes housing.  Getting rid of them means opening up those goods and services for Americans. H1B Visas are being used to import cheap third world labor, often (always) for jobs Americans are willing and capable of doing.  The lie about finding the talent abroad is just that - a lie.  Every single H1B sent back home is another job available for an American. Immigrants, even legal ones, take space.  Same as point 1.  Lower the caps on legal immigration and you'll see a reduction in job competition.  Remember basic economics: If you have 10 people competing for 1 job, the job sets the salary.  If you have 1 person competing for 10 jobs, the person sets the salary.  Stop overwhelming the supply of labor, and you'll see an increase in demand from jobs. Compounding on problems 1 and 3.  Chain migration should never have been a thing, just like anchor babies.  Birth Tourism is a very real, and hugely problematic thing for our country.  I can't wait for it to end so we can stop having these 9-month pregnant illegal aliens undergoing potentially dangerous border crossings just to drop their baby before they rightly get deported, then immediately claim they need to stay to keep their family together (because obviously the American child of two illegal aliens needs to stay in America, for some inexplicable reason). permalink parent award report block reply\n12345SIX 1 points 3 hours ago Comment removed by community moderators. permalink award report block reply\nEyesSewnShut 1 points 21 minutes ago Comment removed by community moderators. permalink award report block reply"}