{"id": "1ARK9oXkjV", "contents": "198 . posted 15 hours ago by TheLawofOne- 3 comments award share download report block\n3 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style GuerillaYourDreams 3 points 15 hours ago This is NOT the kind of post that should be stickied, fren. Ask your senior mods why not, k? permalink award report block reply okboomer59 1 points 4 hours ago It's called regulatory capture, and the FDA is far from alone in it. permalink award report block reply Ghost_Soul167 1 points 3 hours ago Yep.  Federal Regulations aren't about safety or process, it's about protecting the large corporations from competition by smaller more efficient companies.  Case in point, the USDA and it's Organic regulations getting more and more onerous about records keeping and retention so that small organic  farmers basically have to have a compliance officer on staff. permalink parent award report block reply\nGuerillaYourDreams 3 points 15 hours ago This is NOT the kind of post that should be stickied, fren. Ask your senior mods why not, k? permalink award report block reply\nokboomer59 1 points 4 hours ago It's called regulatory capture, and the FDA is far from alone in it. permalink award report block reply Ghost_Soul167 1 points 3 hours ago Yep.  Federal Regulations aren't about safety or process, it's about protecting the large corporations from competition by smaller more efficient companies.  Case in point, the USDA and it's Organic regulations getting more and more onerous about records keeping and retention so that small organic  farmers basically have to have a compliance officer on staff. permalink parent award report block reply\nGhost_Soul167 1 points 3 hours ago Yep.  Federal Regulations aren't about safety or process, it's about protecting the large corporations from competition by smaller more efficient companies.  Case in point, the USDA and it's Organic regulations getting more and more onerous about records keeping and retention so that small organic  farmers basically have to have a compliance officer on staff. permalink parent award report block reply"}