{"id": "1ARK9nQBE5", "contents": "16 Don't get your hopes up but this might be some good news: BlackRock Credit Collapses 100% Becoming Worthless As Corporate Defaults Skyrocket (www.youtube.com) posted 3 hours ago by 1DontTreadOnMe1 3 comments award share report block\n3 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style CloudNine 0 points 2 hours ago The claim that BlackRock’s credit has collapsed and become worthless is false. The firm is financially stable, holds strong credit ratings, and manages record levels of assets.  The claim appears to stem from recent news that BlackRock faces a 100% loss on a single private loan to a struggling home improvement company called Renovo Home Partners, which recently filed for bankruptcy. Key facts about BlackRock’s financial status: Strong Financial Health: BlackRock’s overall financial position is strong. Moody’s has affirmed BlackRock’s senior unsecured ratings at Aa3 with a stable outlook, reflecting high earnings capacity and strong profitability.\nRecord Assets Under Management (AUM): As of September 30, 2025, BlackRock’s AUM reached a record $13.46 trillion, up from $11.48 trillion a year earlier.\nStock Performance: BlackRock’s stock (BLK) has a consensus analyst rating of “Strong Buy”, with analysts forecasting a potential increase in the stock price, not a collapse.\nIsolated Loan Loss: The 100% loss applies only to the specific $150 million private loan to Renovo, not BlackRock’s entire credit or assets. This is an isolated incident within BlackRock’s vast, diversified portfolio.\nIndustry Context: While there are some concerns about stress in certain pockets of the private credit market (such as subprime auto lending, which also led to BlackRock winding down a specific impact fund that invested in the now-bankrupt lender Tricolor), BlackRock executives have stated that overall credit quality for borrowers is “generally strong” and that these appear to be “idiosyncratic pockets of stress”. In summary, BlackRock is experiencing a loss on one specific investment, but this does not indicate a collapse of the entire firm or its creditworthiness. permalink award report block reply 1DontTreadOnMe1 OP 1 points 2 hours ago AI slop response. permalink parent award report block reply dems_be_crazy 1 points 2 hours ago That doesn't make it wrong. Yes, corporate defaults are up, but that doesn't mean Blackrock's credit has collapsed based on a bad investment. There was decent info wrapped in a click bait title. permalink parent award report block reply\nCloudNine 0 points 2 hours ago The claim that BlackRock’s credit has collapsed and become worthless is false. The firm is financially stable, holds strong credit ratings, and manages record levels of assets.  The claim appears to stem from recent news that BlackRock faces a 100% loss on a single private loan to a struggling home improvement company called Renovo Home Partners, which recently filed for bankruptcy. Key facts about BlackRock’s financial status: Strong Financial Health: BlackRock’s overall financial position is strong. Moody’s has affirmed BlackRock’s senior unsecured ratings at Aa3 with a stable outlook, reflecting high earnings capacity and strong profitability.\nRecord Assets Under Management (AUM): As of September 30, 2025, BlackRock’s AUM reached a record $13.46 trillion, up from $11.48 trillion a year earlier.\nStock Performance: BlackRock’s stock (BLK) has a consensus analyst rating of “Strong Buy”, with analysts forecasting a potential increase in the stock price, not a collapse.\nIsolated Loan Loss: The 100% loss applies only to the specific $150 million private loan to Renovo, not BlackRock’s entire credit or assets. This is an isolated incident within BlackRock’s vast, diversified portfolio.\nIndustry Context: While there are some concerns about stress in certain pockets of the private credit market (such as subprime auto lending, which also led to BlackRock winding down a specific impact fund that invested in the now-bankrupt lender Tricolor), BlackRock executives have stated that overall credit quality for borrowers is “generally strong” and that these appear to be “idiosyncratic pockets of stress”. In summary, BlackRock is experiencing a loss on one specific investment, but this does not indicate a collapse of the entire firm or its creditworthiness. permalink award report block reply 1DontTreadOnMe1 OP 1 points 2 hours ago AI slop response. permalink parent award report block reply dems_be_crazy 1 points 2 hours ago That doesn't make it wrong. Yes, corporate defaults are up, but that doesn't mean Blackrock's credit has collapsed based on a bad investment. There was decent info wrapped in a click bait title. permalink parent award report block reply\n1DontTreadOnMe1 OP 1 points 2 hours ago AI slop response. permalink parent award report block reply dems_be_crazy 1 points 2 hours ago That doesn't make it wrong. Yes, corporate defaults are up, but that doesn't mean Blackrock's credit has collapsed based on a bad investment. There was decent info wrapped in a click bait title. permalink parent award report block reply\ndems_be_crazy 1 points 2 hours ago That doesn't make it wrong. Yes, corporate defaults are up, but that doesn't mean Blackrock's credit has collapsed based on a bad investment. There was decent info wrapped in a click bait title. permalink parent award report block reply"}