{"id": "1ARK9nQB1c", "contents": "246 Deport, Deport, FUKIN DEPORT, NOW!!! Nearly half of all Islamic immigrants in the Minnesota found to have committed Ilhan Omar—immigration fraud, marriage fraud, tax fraud, loan fraud, bribery, forgery, perjury, bigamy and incest during a recent sweep by the Department of Homeland Security. posted 4 hours ago by Capoditutticapi1 11 comments award share report block 🇺🇸RealRobert🇺🇸 @Real_RobN • 6h Here it is: Nearly half of all Islamic immigrants in the Minnesota found to have committed Ilhan Omar—immigration fraud, marriage fraud, tax fraud, loan fraud, bribery, forgery, perjury, bigamy and incest during a recent sweep by the Department of Homeland Security, US\n11 comments Sort by Top Top New Worst Old Save MacGordon 5 points 3 hours ago Deport Them ALL! permalink award report block reply Awakened 5 points 4 hours ago Obviously you will have to remove them all to be sure. permalink award report block reply Capoditutticapi1 OP 4 points 3 hours ago EVERY..., SINGLE..., ONE... permalink parent award report block reply Formerlurker92 3 points 3 hours ago We can vote our way into Islamic colonization, but we're gonna have to shoot our way out permalink award report block reply NewBurner04 2 points 3 hours ago Wow I'm sure knowing what they did is punishment enough. permalink award report block reply freedom-thinker 2 points 3 hours ago I'll bet if we really try we can connect this  to ALL OF THEM! permalink award report block reply Capoditutticapi1 OP 3 points 3 hours ago EVERY..., SINGLE..., ONE... permalink parent award report block reply FORMERCHILDSTAR 2 points 4 hours ago Close the border and all entry points to immigration immediately until we get this crap figured out and eliminate all who defrauded us. NO MORE LEGAL IMMIGRATION FOR FIVE YEARS WITH EXCEPTIONS TO ONLY THOSE IMMIGRANTS THAT HAVE UNIQUE OR SPECIAL SKILLS THAT CAN BENIFIT THE USA....and even those immigrants should be limited to small numbers. permalink award report block reply Zacktopia33 2 points 2 hours ago Islam is an unending fraud in every possible way. If Muslims aren't defrauding, they're butchering, massacring, slaughtering, raping, and forcibly converting. See also https://www.thereligionofpeace.com/pages/quran/taqiyya.aspx permalink award report block reply 3stepsahead 1 points 2 hours ago Yes!  There needs to be consequences! There were none for 2020, and they stole the elections in VA.  That should be the only thing on his plate.  Thats it, fair elections, or the country is fucked.  The people are smart enough to elect the right person everytime, as ling as there is no fraud. permalink award report block reply magnokor 1 points 2 hours ago Hold up, hold up, chew soap. Maybe think of the other half, who did not commit immigration fraud. Do not be putting them in with the guilty half who do that fraud. Yes. The other half there, they are doing the childcare fraud. In May 2018, KMSP-Fox 9 aired a story about $100 million in child care welfare fraud, some of which allegedly funded terrorists in Somalia and the Middle East. Also, autism fraud. First Defendant Charged in Autism Fraud Scheme Hassan Defrauded Autism Program of $14M, Carried Out Feeding Our Future Fraud, Bought Real Estate in Kenya with Taxpayer Money MINNEAPOLIS – Asha Farhan Hassan, age 28, was charged today by federal information with wire fraud for her role in a $14 million autism fraud scheme.  Hassan was also charged with participating in the Feeding Our Future fraud scheme, for which she received $465,000. https://www.justice.gov/usao-mn/pr/first-defendant-charged-autism-fraud-scheme-0 permalink award report block reply\nMacGordon 5 points 3 hours ago Deport Them ALL! permalink award report block reply\nAwakened 5 points 4 hours ago Obviously you will have to remove them all to be sure. permalink award report block reply Capoditutticapi1 OP 4 points 3 hours ago EVERY..., SINGLE..., ONE... permalink parent award report block reply\nCapoditutticapi1 OP 4 points 3 hours ago EVERY..., SINGLE..., ONE... permalink parent award report block reply\nFormerlurker92 3 points 3 hours ago We can vote our way into Islamic colonization, but we're gonna have to shoot our way out permalink award report block reply\nNewBurner04 2 points 3 hours ago Wow I'm sure knowing what they did is punishment enough. permalink award report block reply\nfreedom-thinker 2 points 3 hours ago I'll bet if we really try we can connect this  to ALL OF THEM! permalink award report block reply Capoditutticapi1 OP 3 points 3 hours ago EVERY..., SINGLE..., ONE... permalink parent award report block reply\nCapoditutticapi1 OP 3 points 3 hours ago EVERY..., SINGLE..., ONE... permalink parent award report block reply\nFORMERCHILDSTAR 2 points 4 hours ago Close the border and all entry points to immigration immediately until we get this crap figured out and eliminate all who defrauded us. NO MORE LEGAL IMMIGRATION FOR FIVE YEARS WITH EXCEPTIONS TO ONLY THOSE IMMIGRANTS THAT HAVE UNIQUE OR SPECIAL SKILLS THAT CAN BENIFIT THE USA....and even those immigrants should be limited to small numbers. permalink award report block reply\nZacktopia33 2 points 2 hours ago Islam is an unending fraud in every possible way. If Muslims aren't defrauding, they're butchering, massacring, slaughtering, raping, and forcibly converting. See also https://www.thereligionofpeace.com/pages/quran/taqiyya.aspx permalink award report block reply\n3stepsahead 1 points 2 hours ago Yes!  There needs to be consequences! There were none for 2020, and they stole the elections in VA.  That should be the only thing on his plate.  Thats it, fair elections, or the country is fucked.  The people are smart enough to elect the right person everytime, as ling as there is no fraud. permalink award report block reply\nmagnokor 1 points 2 hours ago Hold up, hold up, chew soap. Maybe think of the other half, who did not commit immigration fraud. Do not be putting them in with the guilty half who do that fraud. Yes. The other half there, they are doing the childcare fraud. In May 2018, KMSP-Fox 9 aired a story about $100 million in child care welfare fraud, some of which allegedly funded terrorists in Somalia and the Middle East. Also, autism fraud. First Defendant Charged in Autism Fraud Scheme Hassan Defrauded Autism Program of $14M, Carried Out Feeding Our Future Fraud, Bought Real Estate in Kenya with Taxpayer Money MINNEAPOLIS – Asha Farhan Hassan, age 28, was charged today by federal information with wire fraud for her role in a $14 million autism fraud scheme.  Hassan was also charged with participating in the Feeding Our Future fraud scheme, for which she received $465,000. https://www.justice.gov/usao-mn/pr/first-defendant-charged-autism-fraud-scheme-0 permalink award report block reply"}