{"id": "1ARK55cGKQ", "contents": "1000 Elon Musk: The reason government programs are so inefficient is that, unlike a commercial company, the feedback loop for improvement is broken, because they have a state-mandated monopoly and can’t go out of business if customers are unhappy. posted 5 days ago by I-am-Orlando PRO 51 comments award share download report block\n51 comments Sort by Top Top New Worst Old Save _Sully_ 20 points 5 days ago Also, the horrific bureaucracy forces a free lunch sandwich to cost $1 to produce but $50 to get it to the student. permalink award report block reply NomadicKrow2 12 points 5 days ago YES. Everybody in the loop wants a huge payday for their service. permalink parent award report block reply terribletwos 7 points 5 days ago Bureaucracy is wild because it assumes itself and once you get like a Frank Fontaine, you get entrenched bureaucracy that's harder to destroy than almost any other form of corruption. Even if you get rid of the villain, the system itself is corrupted forever. It's one of the tools the progressives used to take over every position of power. Even with an improvement loop, you'd only get improved corruption. permalink parent award report block reply Crlsniper 15 points 5 days ago It’s why monopolies are terrible regardless of corporate or governmental monopoly. They can become very authoritarian and inefficient. permalink award report block reply possibletower 2 points 5 days ago I highly doubt SpaceX would recover from fatal space disasters like Apollo and the Space Shuttle did. That is the silver lining about government-owned operations for large projects like space-related ones. And Starship still has failed to achieve one single orbit despite it supposed to land astronauts on the Moon on Artemis III. NASA's SLS, which uses recycled and proven Space Shuttle rockets and other parts, meanwhile has already launched Artemis I and will launch Artemis II next year. Musk is not serious about Moon exploration. Mars is a fucking retarded idea right now due to the extreme radiation on Mars and while in transit in space between Earth and Mars. The Moon OTOH is shielded from radiatoin 50% of every month thanks to the Earth's magnetosphere protecting the Moon when the Moon is behind Earth and Earth stands between the Sun and the Moon. permalink parent award report block reply AVeryNakedMan 5 points 5 days ago SpaceX has had many rockets blow up. But they were smart enough to plan in such a way that a rocket blowing up was not the end of the company. permalink parent award report block reply Maskurbator 0 points 5 days ago I mean, aside from the cool points of doing either, I think both are retarded. Not to parrot the left but we spend billions on shit like that and can't even get litter of the side of the highway, or get clean water in Flint. permalink parent award report block reply friendlyratz 6 points 5 days ago We spend billions on worthless welfare recipients and apparently they don't even have to be citizens. It's not retarded to want to advance space exploration. permalink parent award report block reply Maskurbator 1 points 4 days ago What is the benefit to the citizens in space exploration? permalink parent award report block reply IAmRetard 7 points 5 days ago Look at DMV’s. Classic example! permalink award report block reply TrumpAndGodWin 1 points 5 days ago My Florida dmv was actually pretty good until recently. permalink parent award report block reply 5DchessWatch 7 points 5 days ago I've been saying a similar thing for the last 5 yrs.  It boils down to \"we can hire a legislator, but we can't fire them once they're in\" We need strict term limits on congress We need all electronic voting machines to be mothballed and go to paper only.  Electronic voting can work but only with OPEN SOURCE and 3rd party security audited; blockchain is a good example since if people are using it for money then you can use it safely for vote.  The key thing is you need to be able to verify your vote was 1) counted and 2) counted correctly and 3) yours was included in the total, because its on a chain of encryption autheticated transactions We need a way to FIRE congresspeople We also need a way to impeach judges at all levels We also need a way to fire any US employee other than the president (says specifically in const only congress can do that) We (the people) can achieve the above with a citizens national referendum, which would act as a 4th branch of government, that will bridge that 'broken feedback loop'. Citizens Federal level Referendum is permanent, not temporary and created by an amendment, so it sticks. It's like a 1-3% genpop quorum, so 3.5million people have to be present (in zoom) to vote on an issue.  >50% on referendum issues passes them.  So > 1.25M yea Citizens referendum can impeach any US employee, it strikes the word 'sole' (if any) power of impeachment reserved to congress and says reserved to legislative branch and citizens referendum, which has precendent over the legistlative branch in mutually-interested, conflicting matters. Citizens can't make laws, can't modify but they can delete them.  Forcing congress to rewrite.  After doing this to an approximately same bill 3 times (<10% different), then congress is barred from ever making the bill again (this is like a double veto) permalink award report block reply invalid_data 6 points 5 days ago Well the feedback loop is supposed to be us the citizenry. We vote people out if they do a bad job, neew guys cleans house, the cycle repeats. Problem is the government is too big, elections are rigged, propaganda is rampant, and so many citizens too lazy and uninformed. So thats why the feedback loop is broken. permalink award report block reply DangleBarry 5 points 5 days ago The feedback loop used to involve tar and feathers - which worked pretty well. permalink parent award report block reply sixfingerdildo 6 points 5 days ago yeah!  and like, look at that worthless government agency Microsoft... permalink award report block reply Deplorable_Yankee 6 points 5 days ago Well, considering the DMV in multiple blue states decided to issues CDLs to low IQ non English speaking third worlders, I’m pretty sure they suck really bad. permalink award report block reply Liberats 5 points 5 days ago It's because nobody at the top is fired for it. The worst they get is moved to another taxpayer funded job. permalink award report block reply I-am-Orlando OP PRO 4 points 5 days ago Link https://x.com/elonmusk/status/1986836508092080197?s=20 permalink award report block reply BOHICA2021 4 points 5 days ago ...AND in this scenario, EVERY TIME,  failure or \"missing the mark\" results in more $$$ while incentivizinng poor performance.  It is intentionally structured to lose money by the simple fact that  the more efficient it is  the less money is allocated AND  the more inefficient it is, the more monies are rewarded / allocated. This is a false dichotomy built into the entire every level.structure of Government at every level and every suit in the foodchain knows that. permalink award report block reply ForTheLulz 4 points 5 days ago They have no duty to profit. Simple as that. permalink award report block reply SonOfThunder 3 points 5 days ago No shit Sherlock permalink award report block reply Megaboom2025 5 points 5 days ago The average leftist doesn’t understand it permalink parent award report block reply jsphere256 3 points 5 days ago If you can't fail, you can't grow permalink award report block reply Maskurbator 3 points 5 days ago That and they are literally incentivized to not perform their core function because doing so would result in them being rendered unnecessary. It's the the idea that if Johnson and Johnson actually cured cancer, their profit would go down. If the department of energy somehow managed to fart out some unlimited energy device that was clean and cheap and the size of a fucking toaster, there'd be no need for a department of energy. If schools did a decent job we wouldn't need a department of education. permalink award report block reply Oodles 3 points 5 days ago If a government agency solves a problem, they get a smaller budget next year because they do not have to address that problem anymore Conversely, if they make a problem worse, they get a bigger budget next year permalink award report block reply tholinz 3 points 5 days ago Yup. I've also heard it described this way: private industry is designed around making money, but the government's only job is to spend it. Creates a much different mindset in employees. permalink award report block reply FattyWatt 3 points 5 days ago I'm glad Elon KNOWS the definition of a Monopoly. permalink award report block reply jonnyuno 2 points 4 days ago True but pols don't want feedback loop.  They campaign their lies and then operate for themselves by money laundering without ever flinching at the constituents. permalink award report block reply throttlejohnson 2 points 5 days ago social security has entered the chat....oops, looks like the VA has entered the chat now too... permalink award report block reply awsure 1 points 4 days ago I use a 3rd party DMV in AZ. I pay a couple bucks but they’re way better permalink award report block reply Glenlaw 1 points 4 days ago I actually thought that my most recent experience at the DMV was a surprisingly good one.  Of course that was in Nassau County NY, which is a red wall to the city of New York. permalink award report block reply SimaYi 1 points 5 days ago The only monopoly on earth, anywhere, is the government. permalink award report block reply billybaldwin2 1 points 5 days ago I'll give a shout out to my DMV. Imperfect? Yes. However, leaps and bounds better than it was only a decade ago. Now, you take a number and sit. Don't gotta stay in an endless line and keep your place. permalink award report block reply ParticleCannon 1 points 4 days ago ... They just started doing the number thing? permalink parent award report block reply wolfsettler 1 points 4 days ago I've been saying this since 1999. permalink award report block reply least_counties_ever 1 points 5 days ago He's just realizing this now? permalink award report block reply dontdrinksoy 1 points 5 days ago Yup, and it's fucking bullshit. permalink award report block reply Cjsmith87 1 points 4 days ago Welcome to competitive capitalism 101 permalink award report block reply SimaYi 1 points 5 days ago No shit. permalink award report block reply KOMMISSARofMAGA 1 points 5 days ago No shit. This guy’s a genius, huh? permalink award report block reply julianleroux 1 points 5 days ago BTW this is all explained at length by free market economists (Milton Friedman, Hayek, Mises, Hazlitt) permalink award report block reply Rudy_DankMemer 1 points 4 days ago I can drive 15 minutes to a DMV with less DEI - and I'm in and out in under 20 minutes. The one that's 5 mins from my house is now overrun with gibsmedats & social justice retards on either side of the counter, so I no longer bother. permalink award report block reply JnrelMcLibrtee 1 points 5 days ago Unless the companies are \"too big to fail\" 😡 permalink award report block reply Powhattan 1 points 4 days ago You should be able choose your own government. 🤔 permalink award report block reply mechdork 1 points 5 days ago after Missouri switched to privately run DMV offices the experience got infinitely better. They add a few bucks for it but totally worth it. permalink award report block reply NeoAeon 1 points 4 days ago Put a different way: Running a business that provides real value is hard. Business competition only works because the only the lucky ones who manage to break the code and get it right win. Corporatism, top-down - Government run planning doesn't work not only because they bypass the normal free-enterprise business algorithms. The free-enterprise business algorithm is that 100s of people have what they think is a good idea. They all try it. Almost all of them fail miserably. But occassionally one of them is right and makes a great business, one that serves the customers, employees and stock holders. It's the 100s of efforts that are invisible, but necessary for the one lucky winner to emerge helping everyone. The tricky part is what happens next. Once that winner has won, they'll be tempted to use their winnings to lock in their high position by lobbying the government for favorable rules. That's when everything gets screwed up again. Edison wasn't wrong when he said, in hisearly days, that he hadn't failed at making a light bulb. He's found 1,000 things that don't work. That's what free enterprise is all about. Trying and finding the thousand things that don't work until you finds the ones that do. But the next step can't be to lock the doors on those good things. Instead the next step is to allow another thousand things to be tried to find even better things. permalink award report block reply possibletower 0 points 5 days ago I highly doubt SpaceX would recover from fatal space disasters like Apollo and the Space Shuttle did. That is the silver lining about government-owned operations for large projects like space-related ones. And Starship still has failed to achieve one single orbit despite it supposed to land astronauts on the Moon on Artemis III. NASA's SLS, which uses recycled and proven Space Shuttle rockets and other parts, meanwhile has already launched Artemis I and will launch Artemis II next year. Musk is not serious about Moon exploration. Mars is a fucking retarded idea right now due to the extreme radiation on Mars and while in transit in space between Earth and Mars. The Moon OTOH is shielded from radiatoin 50% of every month thanks to the Earth's magnetosphere protecting the Moon when the Moon is behind Earth and Earth stands between the Sun and the Moon. permalink award report block reply dontdrinksoy 2 points 5 days ago Sorry, I think you're failing to understand the complexities of what Elon Musk is doing. First, his space vehicles are reusable. It's not one, and done. Second, Musk's rockets explode because he is testing them, and pushing them as much as possible. You have to. He doesn't want a disaster where cargo is destroyed. When you make something, like a spaceship, you have to test the fuck out of it. permalink parent award report block reply Repeal19 1 points 5 days ago Probably why they are focusing on the money making portion and perfecting the craft first. There’s no public support of nasa now and honestly I wouldn’t want there to be. I guarantee you they hired the gayest people possible in the past ten years. permalink parent award report block reply\n_Sully_ 20 points 5 days ago Also, the horrific bureaucracy forces a free lunch sandwich to cost $1 to produce but $50 to get it to the student. permalink award report block reply NomadicKrow2 12 points 5 days ago YES. Everybody in the loop wants a huge payday for their service. permalink parent award report block reply terribletwos 7 points 5 days ago Bureaucracy is wild because it assumes itself and once you get like a Frank Fontaine, you get entrenched bureaucracy that's harder to destroy than almost any other form of corruption. Even if you get rid of the villain, the system itself is corrupted forever. It's one of the tools the progressives used to take over every position of power. Even with an improvement loop, you'd only get improved corruption. permalink parent award report block reply\nNomadicKrow2 12 points 5 days ago YES. Everybody in the loop wants a huge payday for their service. permalink parent award report block reply\nterribletwos 7 points 5 days ago Bureaucracy is wild because it assumes itself and once you get like a Frank Fontaine, you get entrenched bureaucracy that's harder to destroy than almost any other form of corruption. Even if you get rid of the villain, the system itself is corrupted forever. It's one of the tools the progressives used to take over every position of power. Even with an improvement loop, you'd only get improved corruption. permalink parent award report block reply\nCrlsniper 15 points 5 days ago It’s why monopolies are terrible regardless of corporate or governmental monopoly. They can become very authoritarian and inefficient. permalink award report block reply possibletower 2 points 5 days ago I highly doubt SpaceX would recover from fatal space disasters like Apollo and the Space Shuttle did. That is the silver lining about government-owned operations for large projects like space-related ones. And Starship still has failed to achieve one single orbit despite it supposed to land astronauts on the Moon on Artemis III. NASA's SLS, which uses recycled and proven Space Shuttle rockets and other parts, meanwhile has already launched Artemis I and will launch Artemis II next year. Musk is not serious about Moon exploration. Mars is a fucking retarded idea right now due to the extreme radiation on Mars and while in transit in space between Earth and Mars. The Moon OTOH is shielded from radiatoin 50% of every month thanks to the Earth's magnetosphere protecting the Moon when the Moon is behind Earth and Earth stands between the Sun and the Moon. permalink parent award report block reply AVeryNakedMan 5 points 5 days ago SpaceX has had many rockets blow up. But they were smart enough to plan in such a way that a rocket blowing up was not the end of the company. permalink parent award report block reply Maskurbator 0 points 5 days ago I mean, aside from the cool points of doing either, I think both are retarded. Not to parrot the left but we spend billions on shit like that and can't even get litter of the side of the highway, or get clean water in Flint. permalink parent award report block reply friendlyratz 6 points 5 days ago We spend billions on worthless welfare recipients and apparently they don't even have to be citizens. It's not retarded to want to advance space exploration. permalink parent award report block reply Maskurbator 1 points 4 days ago What is the benefit to the citizens in space exploration? permalink parent award report block reply\npossibletower 2 points 5 days ago I highly doubt SpaceX would recover from fatal space disasters like Apollo and the Space Shuttle did. That is the silver lining about government-owned operations for large projects like space-related ones. And Starship still has failed to achieve one single orbit despite it supposed to land astronauts on the Moon on Artemis III. NASA's SLS, which uses recycled and proven Space Shuttle rockets and other parts, meanwhile has already launched Artemis I and will launch Artemis II next year. Musk is not serious about Moon exploration. Mars is a fucking retarded idea right now due to the extreme radiation on Mars and while in transit in space between Earth and Mars. The Moon OTOH is shielded from radiatoin 50% of every month thanks to the Earth's magnetosphere protecting the Moon when the Moon is behind Earth and Earth stands between the Sun and the Moon. permalink parent award report block reply AVeryNakedMan 5 points 5 days ago SpaceX has had many rockets blow up. But they were smart enough to plan in such a way that a rocket blowing up was not the end of the company. permalink parent award report block reply Maskurbator 0 points 5 days ago I mean, aside from the cool points of doing either, I think both are retarded. Not to parrot the left but we spend billions on shit like that and can't even get litter of the side of the highway, or get clean water in Flint. permalink parent award report block reply friendlyratz 6 points 5 days ago We spend billions on worthless welfare recipients and apparently they don't even have to be citizens. It's not retarded to want to advance space exploration. permalink parent award report block reply Maskurbator 1 points 4 days ago What is the benefit to the citizens in space exploration? permalink parent award report block reply\nAVeryNakedMan 5 points 5 days ago SpaceX has had many rockets blow up. But they were smart enough to plan in such a way that a rocket blowing up was not the end of the company. permalink parent award report block reply\nMaskurbator 0 points 5 days ago I mean, aside from the cool points of doing either, I think both are retarded. Not to parrot the left but we spend billions on shit like that and can't even get litter of the side of the highway, or get clean water in Flint. permalink parent award report block reply friendlyratz 6 points 5 days ago We spend billions on worthless welfare recipients and apparently they don't even have to be citizens. It's not retarded to want to advance space exploration. permalink parent award report block reply Maskurbator 1 points 4 days ago What is the benefit to the citizens in space exploration? permalink parent award report block reply\nfriendlyratz 6 points 5 days ago We spend billions on worthless welfare recipients and apparently they don't even have to be citizens. It's not retarded to want to advance space exploration. permalink parent award report block reply Maskurbator 1 points 4 days ago What is the benefit to the citizens in space exploration? permalink parent award report block reply\nMaskurbator 1 points 4 days ago What is the benefit to the citizens in space exploration? permalink parent award report block reply\nIAmRetard 7 points 5 days ago Look at DMV’s. Classic example! permalink award report block reply TrumpAndGodWin 1 points 5 days ago My Florida dmv was actually pretty good until recently. permalink parent award report block reply\nTrumpAndGodWin 1 points 5 days ago My Florida dmv was actually pretty good until recently. permalink parent award report block reply\n5DchessWatch 7 points 5 days ago I've been saying a similar thing for the last 5 yrs.  It boils down to \"we can hire a legislator, but we can't fire them once they're in\" We need strict term limits on congress We need all electronic voting machines to be mothballed and go to paper only.  Electronic voting can work but only with OPEN SOURCE and 3rd party security audited; blockchain is a good example since if people are using it for money then you can use it safely for vote.  The key thing is you need to be able to verify your vote was 1) counted and 2) counted correctly and 3) yours was included in the total, because its on a chain of encryption autheticated transactions We need a way to FIRE congresspeople We also need a way to impeach judges at all levels We also need a way to fire any US employee other than the president (says specifically in const only congress can do that) We (the people) can achieve the above with a citizens national referendum, which would act as a 4th branch of government, that will bridge that 'broken feedback loop'. Citizens Federal level Referendum is permanent, not temporary and created by an amendment, so it sticks. It's like a 1-3% genpop quorum, so 3.5million people have to be present (in zoom) to vote on an issue.  >50% on referendum issues passes them.  So > 1.25M yea Citizens referendum can impeach any US employee, it strikes the word 'sole' (if any) power of impeachment reserved to congress and says reserved to legislative branch and citizens referendum, which has precendent over the legistlative branch in mutually-interested, conflicting matters. Citizens can't make laws, can't modify but they can delete them.  Forcing congress to rewrite.  After doing this to an approximately same bill 3 times (<10% different), then congress is barred from ever making the bill again (this is like a double veto) permalink award report block reply\ninvalid_data 6 points 5 days ago Well the feedback loop is supposed to be us the citizenry. We vote people out if they do a bad job, neew guys cleans house, the cycle repeats. Problem is the government is too big, elections are rigged, propaganda is rampant, and so many citizens too lazy and uninformed. So thats why the feedback loop is broken. permalink award report block reply DangleBarry 5 points 5 days ago The feedback loop used to involve tar and feathers - which worked pretty well. permalink parent award report block reply\nDangleBarry 5 points 5 days ago The feedback loop used to involve tar and feathers - which worked pretty well. permalink parent award report block reply\nsixfingerdildo 6 points 5 days ago yeah!  and like, look at that worthless government agency Microsoft... permalink award report block reply\nDeplorable_Yankee 6 points 5 days ago Well, considering the DMV in multiple blue states decided to issues CDLs to low IQ non English speaking third worlders, I’m pretty sure they suck really bad. permalink award report block reply\nLiberats 5 points 5 days ago It's because nobody at the top is fired for it. The worst they get is moved to another taxpayer funded job. permalink award report block reply\nI-am-Orlando OP PRO 4 points 5 days ago Link https://x.com/elonmusk/status/1986836508092080197?s=20 permalink award report block reply\nBOHICA2021 4 points 5 days ago ...AND in this scenario, EVERY TIME,  failure or \"missing the mark\" results in more $$$ while incentivizinng poor performance.  It is intentionally structured to lose money by the simple fact that  the more efficient it is  the less money is allocated AND  the more inefficient it is, the more monies are rewarded / allocated. This is a false dichotomy built into the entire every level.structure of Government at every level and every suit in the foodchain knows that. permalink award report block reply\nForTheLulz 4 points 5 days ago They have no duty to profit. Simple as that. permalink award report block reply\nSonOfThunder 3 points 5 days ago No shit Sherlock permalink award report block reply Megaboom2025 5 points 5 days ago The average leftist doesn’t understand it permalink parent award report block reply\nMegaboom2025 5 points 5 days ago The average leftist doesn’t understand it permalink parent award report block reply\njsphere256 3 points 5 days ago If you can't fail, you can't grow permalink award report block reply\nMaskurbator 3 points 5 days ago That and they are literally incentivized to not perform their core function because doing so would result in them being rendered unnecessary. It's the the idea that if Johnson and Johnson actually cured cancer, their profit would go down. If the department of energy somehow managed to fart out some unlimited energy device that was clean and cheap and the size of a fucking toaster, there'd be no need for a department of energy. If schools did a decent job we wouldn't need a department of education. permalink award report block reply\nOodles 3 points 5 days ago If a government agency solves a problem, they get a smaller budget next year because they do not have to address that problem anymore Conversely, if they make a problem worse, they get a bigger budget next year permalink award report block reply\ntholinz 3 points 5 days ago Yup. I've also heard it described this way: private industry is designed around making money, but the government's only job is to spend it. Creates a much different mindset in employees. permalink award report block reply\nFattyWatt 3 points 5 days ago I'm glad Elon KNOWS the definition of a Monopoly. permalink award report block reply\njonnyuno 2 points 4 days ago True but pols don't want feedback loop.  They campaign their lies and then operate for themselves by money laundering without ever flinching at the constituents. permalink award report block reply\nthrottlejohnson 2 points 5 days ago social security has entered the chat....oops, looks like the VA has entered the chat now too... permalink award report block reply\nawsure 1 points 4 days ago I use a 3rd party DMV in AZ. I pay a couple bucks but they’re way better permalink award report block reply\nGlenlaw 1 points 4 days ago I actually thought that my most recent experience at the DMV was a surprisingly good one.  Of course that was in Nassau County NY, which is a red wall to the city of New York. permalink award report block reply\nSimaYi 1 points 5 days ago The only monopoly on earth, anywhere, is the government. permalink award report block reply\nbillybaldwin2 1 points 5 days ago I'll give a shout out to my DMV. Imperfect? Yes. However, leaps and bounds better than it was only a decade ago. Now, you take a number and sit. Don't gotta stay in an endless line and keep your place. permalink award report block reply ParticleCannon 1 points 4 days ago ... They just started doing the number thing? permalink parent award report block reply\nParticleCannon 1 points 4 days ago ... They just started doing the number thing? permalink parent award report block reply\nwolfsettler 1 points 4 days ago I've been saying this since 1999. permalink award report block reply\nleast_counties_ever 1 points 5 days ago He's just realizing this now? permalink award report block reply\ndontdrinksoy 1 points 5 days ago Yup, and it's fucking bullshit. permalink award report block reply\nCjsmith87 1 points 4 days ago Welcome to competitive capitalism 101 permalink award report block reply\nSimaYi 1 points 5 days ago No shit. permalink award report block reply\nKOMMISSARofMAGA 1 points 5 days ago No shit. This guy’s a genius, huh? permalink award report block reply\njulianleroux 1 points 5 days ago BTW this is all explained at length by free market economists (Milton Friedman, Hayek, Mises, Hazlitt) permalink award report block reply\nRudy_DankMemer 1 points 4 days ago I can drive 15 minutes to a DMV with less DEI - and I'm in and out in under 20 minutes. The one that's 5 mins from my house is now overrun with gibsmedats & social justice retards on either side of the counter, so I no longer bother. permalink award report block reply\nJnrelMcLibrtee 1 points 5 days ago Unless the companies are \"too big to fail\" 😡 permalink award report block reply\nPowhattan 1 points 4 days ago You should be able choose your own government. 🤔 permalink award report block reply\nmechdork 1 points 5 days ago after Missouri switched to privately run DMV offices the experience got infinitely better. They add a few bucks for it but totally worth it. permalink award report block reply\nNeoAeon 1 points 4 days ago Put a different way: Running a business that provides real value is hard. Business competition only works because the only the lucky ones who manage to break the code and get it right win. Corporatism, top-down - Government run planning doesn't work not only because they bypass the normal free-enterprise business algorithms. The free-enterprise business algorithm is that 100s of people have what they think is a good idea. They all try it. Almost all of them fail miserably. But occassionally one of them is right and makes a great business, one that serves the customers, employees and stock holders. It's the 100s of efforts that are invisible, but necessary for the one lucky winner to emerge helping everyone. The tricky part is what happens next. Once that winner has won, they'll be tempted to use their winnings to lock in their high position by lobbying the government for favorable rules. That's when everything gets screwed up again. Edison wasn't wrong when he said, in hisearly days, that he hadn't failed at making a light bulb. He's found 1,000 things that don't work. That's what free enterprise is all about. Trying and finding the thousand things that don't work until you finds the ones that do. But the next step can't be to lock the doors on those good things. Instead the next step is to allow another thousand things to be tried to find even better things. permalink award report block reply\npossibletower 0 points 5 days ago I highly doubt SpaceX would recover from fatal space disasters like Apollo and the Space Shuttle did. That is the silver lining about government-owned operations for large projects like space-related ones. And Starship still has failed to achieve one single orbit despite it supposed to land astronauts on the Moon on Artemis III. NASA's SLS, which uses recycled and proven Space Shuttle rockets and other parts, meanwhile has already launched Artemis I and will launch Artemis II next year. Musk is not serious about Moon exploration. Mars is a fucking retarded idea right now due to the extreme radiation on Mars and while in transit in space between Earth and Mars. The Moon OTOH is shielded from radiatoin 50% of every month thanks to the Earth's magnetosphere protecting the Moon when the Moon is behind Earth and Earth stands between the Sun and the Moon. permalink award report block reply dontdrinksoy 2 points 5 days ago Sorry, I think you're failing to understand the complexities of what Elon Musk is doing. First, his space vehicles are reusable. It's not one, and done. Second, Musk's rockets explode because he is testing them, and pushing them as much as possible. You have to. He doesn't want a disaster where cargo is destroyed. When you make something, like a spaceship, you have to test the fuck out of it. permalink parent award report block reply Repeal19 1 points 5 days ago Probably why they are focusing on the money making portion and perfecting the craft first. There’s no public support of nasa now and honestly I wouldn’t want there to be. I guarantee you they hired the gayest people possible in the past ten years. permalink parent award report block reply\ndontdrinksoy 2 points 5 days ago Sorry, I think you're failing to understand the complexities of what Elon Musk is doing. First, his space vehicles are reusable. It's not one, and done. Second, Musk's rockets explode because he is testing them, and pushing them as much as possible. You have to. He doesn't want a disaster where cargo is destroyed. When you make something, like a spaceship, you have to test the fuck out of it. permalink parent award report block reply\nRepeal19 1 points 5 days ago Probably why they are focusing on the money making portion and perfecting the craft first. There’s no public support of nasa now and honestly I wouldn’t want there to be. I guarantee you they hired the gayest people possible in the past ten years. permalink parent award report block reply"}