{"id": "1ARK9jzcox", "contents": "262 Brainwashed Ukrainians, blinded by their fanatical hatred, bullying elderly Germans in Germany into supporting a suicidal war against Russia,even as this older generation, who actually understand the cost of war, try to stop this madness before it spirals into catastrophe posted 1 day ago by Bidensuckscocks 12 comments award share report block\n12 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Save on Your Electric Bill (Try Tonight) GadgetCyno KuzoKevin 10 points 1 day ago They are such Ukrainian patriots, they are taking refuge in Germany. Go back to Ukraine and defend your homeland. permalink award report block reply snoopy3210 2 points 1 day ago Ask Ukrainians if they believe that Yanukovich stole the Ukrainian bank and transferred their money to Russia. A president cannot go to the bank, a bank controlled by western Ukrainians BTW, and just transfer money out. What a bunch of dumb propaganda they believe. That was pushed online by Hillary Clinton’ tech camp in Kiev to get them in the streets. All fake. But It worked. Naive people easily driven by their hatred of Russia on social media. And they burned civilians alive based on these lies. Never forget who they are. permalink parent award report block reply Trump43v3r 4 points 1 day ago How do these retards think anyone will ever want to work with them? They’re entitled brats. Go fuck yourselves. It’s not germanys job, or americas job, or anyone else’s job to send you money to fight Russia you stupid cunt. If we do it it’s out of the kindness of our hearts. And believe me, I don’t care if this shit hope corrupt country gets wiped off the face of the earth. I wouldn’t piss on them to put out a fire permalink award report block reply Saxonlady 4 points 1 day ago Wisdom counts for nothing. If young people want it, I'll let them have it. They'll have to live with the consequences of their actions for 50+ years. I'm not fighting their disrespectful and arrogant asses when I'll be lucky to live just another decade. permalink award report block reply Run_over_Antifa 4 points 1 day ago Why are they in Germany? permalink award report block reply SaxonRealm 1 points 1 day ago Because they’re pussies. permalink parent award report block reply DrVSGGEOTUSPhD 1 points 1 day ago I sure would be permalink parent award report block reply Just_dumping_fuel 2 points 1 day ago able body Ukrainian males... one guess why they are protesting in another country permalink award report block reply mydogma8yourkarma 1 points 1 day ago She makes a good argument for the second amendment, \"we need weapons for defense, not escalation\". permalink award report block reply barwhack 1 points 1 day ago It's already catastrophic addiction. Let the so-persistently-stupid off themselves , without salvation-from-consequence, and WITHOUT JOINING IN. Stop enabling. permalink award report block reply MemoryHoleyeO 1 points 1 day ago Why aren't they fighting their war? permalink award report block reply Jack_NC 1 points 1 day ago changing hearts and minds one assault at a time permalink award report block reply\nKuzoKevin 10 points 1 day ago They are such Ukrainian patriots, they are taking refuge in Germany. Go back to Ukraine and defend your homeland. permalink award report block reply snoopy3210 2 points 1 day ago Ask Ukrainians if they believe that Yanukovich stole the Ukrainian bank and transferred their money to Russia. A president cannot go to the bank, a bank controlled by western Ukrainians BTW, and just transfer money out. What a bunch of dumb propaganda they believe. That was pushed online by Hillary Clinton’ tech camp in Kiev to get them in the streets. All fake. But It worked. Naive people easily driven by their hatred of Russia on social media. And they burned civilians alive based on these lies. Never forget who they are. permalink parent award report block reply\nsnoopy3210 2 points 1 day ago Ask Ukrainians if they believe that Yanukovich stole the Ukrainian bank and transferred their money to Russia. A president cannot go to the bank, a bank controlled by western Ukrainians BTW, and just transfer money out. What a bunch of dumb propaganda they believe. That was pushed online by Hillary Clinton’ tech camp in Kiev to get them in the streets. All fake. But It worked. Naive people easily driven by their hatred of Russia on social media. And they burned civilians alive based on these lies. Never forget who they are. permalink parent award report block reply\nTrump43v3r 4 points 1 day ago How do these retards think anyone will ever want to work with them? They’re entitled brats. Go fuck yourselves. It’s not germanys job, or americas job, or anyone else’s job to send you money to fight Russia you stupid cunt. If we do it it’s out of the kindness of our hearts. And believe me, I don’t care if this shit hope corrupt country gets wiped off the face of the earth. I wouldn’t piss on them to put out a fire permalink award report block reply\nSaxonlady 4 points 1 day ago Wisdom counts for nothing. If young people want it, I'll let them have it. They'll have to live with the consequences of their actions for 50+ years. I'm not fighting their disrespectful and arrogant asses when I'll be lucky to live just another decade. permalink award report block reply\nRun_over_Antifa 4 points 1 day ago Why are they in Germany? permalink award report block reply SaxonRealm 1 points 1 day ago Because they’re pussies. permalink parent award report block reply DrVSGGEOTUSPhD 1 points 1 day ago I sure would be permalink parent award report block reply\nSaxonRealm 1 points 1 day ago Because they’re pussies. permalink parent award report block reply\nDrVSGGEOTUSPhD 1 points 1 day ago I sure would be permalink parent award report block reply\nJust_dumping_fuel 2 points 1 day ago able body Ukrainian males... one guess why they are protesting in another country permalink award report block reply\nmydogma8yourkarma 1 points 1 day ago She makes a good argument for the second amendment, \"we need weapons for defense, not escalation\". permalink award report block reply\nbarwhack 1 points 1 day ago It's already catastrophic addiction. Let the so-persistently-stupid off themselves , without salvation-from-consequence, and WITHOUT JOINING IN. Stop enabling. permalink award report block reply\nMemoryHoleyeO 1 points 1 day ago Why aren't they fighting their war? permalink award report block reply\nJack_NC 1 points 1 day ago changing hearts and minds one assault at a time permalink award report block reply"}