{"id": "1ARK58znay", "contents": "949 HINDUS ARE NOW HUNTING DOWN CHRISTIANS IN INDIA: They want us dead!! posted 4 days ago by China4Biden 161 comments award share download report block\n161 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style ColonelKlink 67 points 4 days ago Liars, rapists, and murderers. permalink award report block reply Leucophylla12 54 points 4 days ago Pajeets are genetically predisposed to being scammers permalink parent award report block reply maltese-poodle 43 points 4 days ago WHY IS TRUMP NOT STOPPING H1B VISAS??? THEY ARE PROCESSING THEM RAPIDLY EVEN DURING THE GOVT SHUTDOWN. END H1B NOW. SAVE TECH JOBS FOR AMERICANS. AMERICA FIRST. NONE OF THIS FUCKING BULLSHIT. WE ALREADY SAW WHAT HAPPENED WITH THAT STREETSHITTER RAGHEAD MAMDANI WINNING IN NEWYORK. ALL OF AMERICA WILL BE LIKE THAT NYC SHITHOLE SOON IF THE INVASION ISN'T STOPPED. END H1BS NOW TRUMP!!!!!!!! permalink parent award report block reply DeportThemAllForever 13 points 4 days ago He tried, but then lots of tech buddies started screaming \"bloody murder\" because they are all H1B staffed, so he backed off. permalink parent award report block reply Bigstick7 15 points 4 days ago Yep and issue is H1Bs killed the tech industry for Americans. Drove Americans out and wages down. So really what kids in college wants to get a CIS/CS degree to compete with a bunch of Indians for 50k a year? Most likely now with an Indian hiring manager who is guaranteed to only hire Indians. Really your at the breaking point to do this is your going to. Deport them and pay the aging white engineering further a ton to train up the next generation. Hope that wages go up, but then you have to be more productive than 3 Indians. Not hard to do. permalink parent award report block reply view 1 more comments... guywholikesDjtof2024 9 points 4 days ago Investigate those tech buddies. Then jail them. Use the full extent of the law. Tax them. Drain the Swamp. permalink parent award report block reply view 2 more comments... Pied-Trumper 7 points 4 days ago We didn’t elect his tech buddies. permalink parent award report block reply geckofishknight 4 points 4 days ago bloody bastard permalink parent award report block reply etcetera 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply DontTreadOnSnek 7 points 4 days ago WHY IS TRUMP NOT STOPPING H1B VISAS??? He's too busy endorsing Vivek Ramaswamy for Ohio governor. permalink parent award report block reply Covfefe_Commando 1 points 3 days ago Rampyswampy! permalink parent award report block reply 7PC_Principle 6 points 4 days ago Exactly...but these morons who are hoped on muh God Emperor Trump bandwagon and bending over to every propaganda bullshit that comes out Trump's mouth wouldn't believe it. Those who are actually paying attention pass the bullshit propaganda sees it for what it is. But don't expect losers here who are hoped on muh God muh Emperor bandwagon to see it. permalink parent award report block reply 10MeV 3 points 4 days ago I don’t completely disagree.  And yet, FWIW, this site is expressly designed for Trump supporters.  If you want to attack the GEOTUS side, this isn’t really the place for it.  Unless you’re just trolling, in which case I have a terse two-word response. permalink parent award report block reply view 3 more comments... Megascandal 4 points 4 days ago He increased the application fee from 2k-5k to 100k. Now companies will either commit financial suicide and keep hiring no-skills. Or they will hire Americans. permalink parent award report block reply Hanging_Chad 1 points 4 days ago because the new H1B fees are a juicy revenue stream? permalink parent award report block reply load 2 more comments... AlmostFullyDilated 4 points 4 days ago they call my phone 30 times a day and pretend like I don't hear the Indian accent right out the gate permalink parent award report block reply DeportThemAllForever 5 points 4 days ago Welcome to big tech permalink parent award report block reply Prach 2 points 3 days ago Comment removed by community moderators, pending further review. permalink parent award report block reply Prach 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply LordCommissarYarrick 4 points 4 days ago Imagine looking at these cow shit eating monkey god worshipping savages and thinking that they are perfect to let into your country as so many western politicians seem to do. There's nothing redeeming about them at all, and they will bring their bullshit with them. permalink parent award report block reply Pied-Trumper 1 points 4 days ago The best summarization I’ve seen. permalink parent award report block reply mohel 0 points 4 days ago Who let them in? permalink parent award report block reply AlmostFullyDilated 1 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply Lol_Garrus 31 points 4 days ago Were gonna have to conquer the world if we want any kind of peace. Empire Earth permalink award report block reply Testamernt 25 points 4 days ago What would the world be like if only Christians were left? permalink parent award report block reply Sideways 30 points 4 days ago That would be Heaven. permalink parent award report block reply keeman 4 points 4 days ago Don't care.  Make America Great Again.  We have enough nukes to make all other nations leave us alone.  Let's start solving our own problems. permalink parent award report block reply Thatunknownguy 4 points 4 days ago Still a bunch of 3rd worlders permalink parent award report block reply guywholikesDjtof2024 3 points 4 days ago Why? I doubt that. The 3rd worlders would be converted to 1st worlders. And/or the ones that weren't, would not be here, because the comment said \"if only Christians were left\". permalink parent award report block reply HeavyMetalPatriot 2 points 4 days ago Turd Worlders cannot assimilate to the First World. The USA and Europe have proven that...the hard way and we may not escape our horrifying mistake. permalink parent award report block reply view 3 more comments... Thatunknownguy 1 points 3 days ago They are incapable of being like us. It's in their biology. Don't subscribe to 20th century neo-liberal talking points permalink parent award report block reply KernalMustard 1 points 4 days ago Yep. Look at places that the Christians decided they would convert people. It how is central and south America looking? How about Native Americans? How about Africa. permalink parent award report block reply HOSEQ 2 points 3 days ago Yes, many became Christians, and then, many flipped it into SANTERIA, which is a mix of pseuo-christianity and voodoo along with some other monstrous shit.... Soo, Christianity barely got to take root when it was then bastardized into something it was never meant to be.... Another \"\"Religious\"\" War Front, many aren't Christians, and of those who are, those are Catholics.... permalink parent award report block reply view 2 more comments... AlmostFullyDilated -2 points 4 days ago Comment removed by community moderators. permalink parent award report block reply Pied-Trumper 0 points 4 days ago Are you the new or old Testament? permalink parent award report block reply Newhawk237 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply sanitaryshaver 0 points 3 days ago Protestants and Catholics would start back up :( permalink parent award report block reply load 1 more comments... keeman 4 points 4 days ago No, we can mind our own business and get our own shit together.  On the current trajectory the USA will bankrupt and fail in less than 10 years.  Start with that assumption. permalink parent award report block reply magnokor 11 points 4 days ago Now? Forever. Of course, the hindu supremacists are not being specific with their attacks, they do hate everyone.  A billion immoral people who think you are dirt, and should be scammed, mocked and destroyed. They can do what they want in their hole back there, but when they invade the West with their lawyers and Caste System they implement everything here. Only hire each other, only sell to each other, and of course will find any way to get into power.  They also enjoy killing their female babies, so your neighborhoods will suddenly have a lot of male India people. The peer-reviewed study found that Indian-born women in Ontario were significantly more likely than Canadian-born women to give birth to boys As they control Silicon Valley, so much of what they do will stay hidden. A 50-year-old man in northern India was killed in a mob lynching on Monday night allegedly over rumours that his family had been storing and consuming beef at home. The northeastern Indian state of Manipur remains in a tense state of unease weeks after a devastating spate of violence led to the death of at least 73 individuals, most of them Christians, and the burning, damage or destruction of nearly 400 churches. US culture breeds 'laziness' and 'mediocrity', says Vivek Ramaswamy Over 20 Indian-origin persons have been sentenced up to 20 years in prison in the U.S. for their involvement in a multimillion-dollar India-based call center scam which defrauded thousands Sugar Land-area Hindu temple now home to third largest statue in the U.S. permalink award report block reply HOSEQ 3 points 3 days ago Call them exactly what they are:: MUSLIMS.... permalink parent award report block reply PegasoSeiya 4 points 3 days ago Nah Hindus hate Muslims and Muslim hate Hindus. They both hate us so it doesn’t matter but Pakistan is their greatest enemy permalink parent award report block reply HOSEQ 1 points 3 days ago \"\"Hindu\"\", WAS their Religion some 1500 Years ago, but Islam Change all of that, even though the Religious Name stuck and became their National Name.... About the year 712 A.D. a Muslim Army  Invaded India, but it really didn't stick, so they came back in the 12th Century and again in the 18th Century.... India IS Muslim, it may also have Christianity, and Buddism, but the entire \"\"Hindu\"\"Religion is 100% Completely gone, only the name remains.... permalink parent award report block reply keeman 2 points 4 days ago So deport the problematic Indians in Silicon Valley and then we have no more interest in this shit.  That is a good outcome for me.  Not only do I not care who controls India, but the Constitution does not authorize the fedgov to do anything about it.  This empire shit is destroying what is left of our republic. permalink parent award report block reply Twitter 10 points 4 days ago Man if you're christian over the last few years you've been getting Genocide, churches burned, spit on, humiliated, and the list goes on with how much bullshit has been happening to the point it's uncanny. Liberals treat Christians like they are ISIS but accept them into their gay degenerate arms not knowing the same 'alt-right' extremist they fear so much is ISLAM FULL send. permalink award report block reply HeavyMetalPatriot 2 points 4 days ago Then perhaps Christians should embrace their history. https://www.youtube.com/watch?v=YL_APKnLtJo permalink parent award report block reply MSG1000 10 points 4 days ago Dear Jesus, I pray for intercession from You, and all Your Angels and Saints, to aid our fellow christians around the world who are being oppressed. For this I pray. Amen. permalink award report block reply guywholikesDjtof2024 -7 points 4 days ago The Bible does or does not teach that dead Believers can do things in the physical realm after death? Do believers go to Heaven right away, or when the Rapture happens, or when Jesus returns? permalink parent award report block reply America1stAndOnly -2 points 3 days ago Rapture Catholic apocrypha. Completely made up by them and not alluded to anywhere in the Holy Bible. permalink parent award report block reply TheOneWhoKnocks 2 points 3 days ago The \"rapture\" is not part of Catholic belief. That is protestant stuff. permalink parent award report block reply guywholikesDjtof2024 2 points 3 days ago No, Matthew 24:40 . But it's very good to see you know catholicism is compromise and addition, not consistent Christian tradition. permalink parent award report block reply America1stAndOnly 0 points 3 days ago No, that's talking about the return of Christ and how not everyone will pass judgment and make it to Heaven. It is not the Catholic's rapture in which they claim all the true believers will just vanish in a puff of smoke one day. But thank you for pointing me to one of the verse's that led to this kind of thinking. permalink parent award report block reply view 1 more comments... KernalMustard -9 points 4 days ago Like praying does anything permalink parent award report block reply guywholikesDjtof2024 3 points 4 days ago You'd have to be Omniscient to know prayer to God never does anything. The world is too complex for you to definitely claim \"NO\". The best you can do and still be not Christian, is to be agnostic on whether God answers prayers or not. Try Deism. Some of the founders were deist. permalink parent award report block reply kadromcs 8 points 4 days ago I read that as 7-Eleven Indians, and it still made sense. permalink award report block reply patrioticwinning3 8 points 4 days ago Yet the do nothing about the mooslims.... permalink award report block reply DrVSGGEOTUSPhD 12 points 4 days ago They actually go pretty hard on jihaddis. permalink parent award report block reply JustACitizenWarrior 8 points 4 days ago @china4biden. i notice you put up a bunch of indian related content, constantly. whats your fascination with this? its always nearly off-topic to the site. permalink award report block reply POT80 2 points 3 days ago He is a Pakistani permalink parent award report block reply POT80 2 points 3 days ago https://x.com/TheChronology__/status/1938559118828077328 https://threadreaderapp.com/thread/1938559118828077328.html read the whole thread permalink parent award report block reply OneMoreHome 1 points 3 days ago Now it makes sense. permalink parent award report block reply journalist 7 points 4 days ago Let’s help by deporting all Hindus out of America. permalink award report block reply _Liberty_Prime_ 7 points 4 days ago Mods. I hope you verified this image as real news. https://www.lemonde.fr/en/pixels/article/2025/10/03/a-fake-news-website-impersonates-le-monde-and-brut_6746062_13.html Edit: here's the link: https://www.lemonde.fr/en/international/article/2024/01/06/hindu-extremists-ruthlessly-hunt-down-christians-in-india_6406265_4.html Seems to have a paywall? permalink award report block reply TwoArizonaPedes 5 points 4 days ago https://www.lemonde.fr/en/pixels/article/2025/10/03/a-fake-news-website-impersonates-le-monde-and-brut_6746062_13.html Interesting. Good to know. Seems to have a paywall? https://archive.is/nH9Ng permalink parent award report block reply Prandogolio 1 points 4 days ago Mods don't verify anything.  They see a headline that sounds important and they pin it. permalink parent award report block reply DJT_MFers1 6 points 4 days ago I knew that Gandhi shit was a fraud permalink award report block reply Easzq8 2 points 4 days ago Socialist permalink parent award report block reply captainmundane 2 points 3 days ago Gandhi was a pervert. permalink parent award report block reply LordCommissarYarrick 1 points 4 days ago Ghandi was actually quite racist and discrimatory to the lower castes. As a lawyer in south africa he got pissy because british authorities made him ride with the blacks despite his Brahmin status that pissed him off. He also tried to have india side with the Japanese and made overtures to Hitler. permalink parent award report block reply guywholikesDjtof2024 1 points 4 days ago elaborate permalink parent award report block reply America1stAndOnly 1 points 3 days ago Gandhi was only for non-violent revolution because violent revolution had been tried repeatedly and didn't work. He knew that White people possess a trait unique to them, compassion. Knowing this, his goal was to make the White rulers feel guilty about what they were doing there. Now that the White man no longer rules India, they are finally free to shit in the street, throw trash in their rivers, and get him by trains. Truly, the White man was a terrible evil for them. permalink parent award report block reply Prandogolio 5 points 4 days ago We should be doing this with muslims in the USA permalink award report block reply ACActual 2 points 4 days ago Should?   Must permalink parent award report block reply ACActual 2 points 4 days ago Should?   Must permalink parent award report block reply ACActual 2 points 4 days ago Should?   Must permalink parent award report block reply Megaboom2025 -2 points 4 days ago Jews too permalink parent award report block reply 5DchessWatch 5 points 4 days ago Hindu nuffin' permalink award report block reply MindPhantom109 5 points 4 days ago Deport all poopjeets - they are stealing our jobs. permalink award report block reply HeavyMetalPatriot -1 points 4 days ago YEET THE JEETS!!! permalink parent award report block reply SCP0073 5 points 4 days ago HinduDindu permalink award report block reply TrancePhreak 4 points 4 days ago HINDUS ARE NOW... The article is from 2024, so it has been going on for a while. permalink award report block reply guywholikesDjtof2024 2 points 4 days ago Pretty sure they still do that. And don't expect the Fake news to be honest about people who believe the TRUE Worldview. permalink parent award report block reply TrancePhreak 3 points 4 days ago Yeah, just critiquing the poor choice of wording in the title. with 579 incidents recorded in the first nine months of 2025 alone permalink parent award report block reply ltbadpuppy 3 points 4 days ago Jan 2024... permalink award report block reply America1stAndOnly 0 points 3 days ago Oh gosh, I guess that means everything is totally fine now. Hooray! There haven't been any Hindus attacking Christians for the past 2 years now! Right? permalink parent award report block reply ltbadpuppy 0 points 3 days ago Well lets look at your post title... permalink parent award report block reply America1stAndOnly 1 points 3 days ago I notice you didn't say it's not still happening. Get flushed down the toilet jeet. permalink parent award report block reply ltbadpuppy 1 points 3 days ago Oh golly, you called me a name how will i ever live with myself?! Speaking of toilets, i got myself a nice TOTO with one of those heated bidet things. Ground breaking, totally recommend it. permalink parent award report block reply keeman 2 points 4 days ago This is a Make America Great Again forum.  What does this have to do with this? permalink award report block reply LORDFALCONE 2 points 4 days ago No laws against shitting in the street? permalink award report block reply MaoHadOnly1Testicle 2 points 3 days ago I already hate India, you don't have to sell it to me permalink award report block reply keeman 2 points 4 days ago Don't care.  This is India.  We are America.  Can we fucking Make AMERICA great again already? permalink award report block reply Smurfection 2 points 4 days ago Shithole people always try to make conversions illegal. permalink award report block reply guywholikesDjtof2024 2 points 4 days ago Fake news needs censorship to thrive. permalink parent award report block reply Smurfection 1 points 4 days ago Yep.  It's because lies always rely on repetition of the lie and overton window in order to gain ascendency.  Especially when young women are brainwashed into being the enforcers of the \"correct\" narrative. permalink parent award report block reply Juzeza 1 points 4 days ago Shit hole permalink award report block reply kornesque 1 points 3 days ago The article uses the term \"hunt down\" after mentioning religious conversion is unlawful. Does that term mean \"seek out\" or \"find and kill\"? Meaning are these Christians being killed or just incarcerated? permalink award report block reply knnbccb 1 points 4 days ago (Dhalsim theme plays) permalink award report block reply Jaunty_Haul 1 points 3 days ago criminalized religious conversion? fuck that place permalink award report block reply terribletwos 1 points 4 days ago Sounds just like what they did in China. permalink award report block reply Peekov3 1 points 4 days ago Arm yourself with a bar of soap necklace permalink award report block reply MedicallyReddit 1 points 4 days ago Saaaaar permalink award report block reply bubadmt 1 points 4 days ago In India. They can do whatever the fuck they want to there. permalink award report block reply arebee 1 points 3 days ago Those poor Hindus. We should bring them to a white country and pay for all their needs! permalink award report block reply America1stAndOnly 1 points 3 days ago Evil, nasty woman. permalink award report block reply Formerlurker92 1 points 4 days ago The experiment with multiculturalism has been going on for a while, and we have the results. Not great. Can we cut the bullshit yet? permalink award report block reply Dreddhead13 1 points 3 days ago Can we do this here? 😁 Get rid of all those 3rd world Baal worshippers, and the useless dotheads. permalink award report block reply lifeisahologram 1 points 4 days ago What’s hilarious is that profile pic, whoever that is, it almost certainly is artificially manipulated to have whiter skin, in addition to other enhancements and photoshopping, and the woman probably spends tons of money on skin creams in real life to get clearer whiter skin, and her entire life is constantly concerned and worried about desiring to be whiter. lol Indians are pathetic permalink award report block reply Induceddrag 1 points 4 days ago Life in the turd world. permalink award report block reply unitedspeedalarm 0 points 4 days ago Here is a channel run by a Hindu American spreading misinformation against Christianity just last week. https://www.youtube.com/watch?v=hrHRO0uV7SI permalink award report block reply AlmostFullyDilated 0 points 4 days ago Indians are retarded and skinny they wouldn't last long in a death match permalink award report block reply Agent_86 0 points 4 days ago Then ditch the label. I did. It works. 😁 permalink award report block reply ramennov -1 points 4 days ago Killing people over imaginary beliefs is beyond retarded. But this is who we are. permalink award report block reply guywholikesDjtof2024 2 points 4 days ago Like when lenin, mao, stalin, and pol pot did? Hint: What did they believe about history, human purpose, origins, age of earth, the Supernatural, and God? permalink parent award report block reply KernalMustard 0 points 4 days ago To them the State was GOD. Cant have religions compete. Theres old scifi show called Babylon 5. They had this faction called the psicorp. They had this mantra. The corp is mother, the corp is father. It was pretty fascist if anyone strayed. They would hunt them down and either kill(if they resisted) or imprison them and reeducate them? Sound famlier. permalink parent award report block reply guywholikesDjtof2024 3 points 4 days ago And their athiesm did zero to stop it. Biblical Christianity is true, and provides anti communist beliefs. Their beliefs were downstream fron atheism. The strong survive in Darwinism/atheism. The Shadows and Evil Vorlons (they became evil later on) were strong. They lacked morality, and yet were fit as a fiddle. So much for \"the golden rule\" keeping them in check. If atheism is true, there is no actual reason to be moral. See soros, gates, and fauci. Just be the best of the best in this world and you're in luck. permalink parent award report block reply KernalMustard -4 points 4 days ago No its not. Desert people religion thought up 4k years ago. Theres nothing real about it. Go find Zeus for me why dont you. Wheres odin? How about Vishnu? Marduk? Osirus? There are no Gods or God or will there ever be Gods. Its 2025. Its time to move on from the  Sky God nonsense. Now that doesnt mean there isnt anything to learn from your bible. Its there to teach. Its in the form of history and its in the form of stories. Sometimes a mixture of both. Knowing how the 2 are seperate is key. permalink parent award report block reply Internet_hugs -1 points 4 days ago Reminder, Vivek wants to bring millions more like him here. If it's brown, flush it down. permalink award report block reply Ihateallliars -1 points 4 days ago What a joke these organized religions are. They want you to kill each other and make women into slaves. In no way does either one honor God, or what they are calling God. Some of these religions even say that evil (named) entities or angels are God, knowing full well they aren't, but they elevate them to the status of God. F that. permalink award report block reply guywholikesDjtof2024 1 points 4 days ago Agreed that hinduism is evil. Which worldview out of all the worldviews is the true one? Which moral system is the correct one? permalink parent award report block reply Hikedelics -1 points 4 days ago Time to start sprinkling carfentanyl or similar on the cow patties. Those nasty fucks will never know what hit them. And even if authorities figure it out they’ll be too ashamed to admit it. permalink award report block reply Prandogolio 1 points 4 days ago Is that fentanyl for cars? permalink parent award report block reply clocker23 1 points 4 days ago kek permalink parent award report block reply TheSonOfGadsden -1 points 4 days ago That cunt should get hunted down permalink award report block reply Modernturnkey -2 points 4 days ago You have no idea how much I'd love open season on Indians. permalink award report block reply AlmostFullyDilated -3 points 4 days ago Indians can barely cook food. they would all die if we cut off their food stamps permalink award report block reply yodayoda -3 points 4 days ago it's India, morons permalink award report block reply 3-10 -3 points 4 days ago There is clearly a reason why everyone hates Christians more than they hate Jews. permalink award report block reply MAGA_NRG 2 points 4 days ago What's the reason permalink parent award report block reply 3-10 1 points 3 days ago Because Christ is truly the one and only way to the Father and heaven/New Earth. Satan isn’t going to focus his attacks on false religions like Hinduism and Buddhism, he already has those people. permalink parent award report block reply Chickensaurus -4 points 4 days ago Meanwhile, Christians submit like cuckolds. permalink award report block reply guywholikesDjtof2024 2 points 4 days ago And people with your worldview fare better.... how, exactly? Please do tell us permalink parent award report block reply XlDEN -5 points 4 days ago The King of the Jews instructed them to turn the other cheek. permalink parent award report block reply guywholikesDjtof2024 7 points 4 days ago That was a symbol of defiance and a 2nd chance rather than mere submission. Also, \"Sell your cloak and buy a sword\" permalink parent award report block reply KernalMustard -5 points 4 days ago So when you were killing your own brothers and sisters all over europe over whos flavor of Chistianity was the best was turning the other cheek. How about all those proto-protestants who were either killed, exiled or excommunicated because they questioned the divinity of christ. That sure was turning the other cheek. How about the Slavs that were forced to convert by the sword. That sure waa turning the other cheek. I could do this all day. Your hands are bloody and you refuse to admit that its not innocent as you make it out to be. permalink parent award report block reply guywholikesDjtof2024 6 points 4 days ago do this all day I love this! So when you were killing your own brothers and sisters all over europe A. Were or were not the numbers exaggerated? B. How does that not violate \"thou shalt not murder\"? What commands does athiesm give people? over whos flavor of Chistianity was the best was turning the other cheek. Breaking news: people rebel against the Bible. You're proving my belief that people should be BIBLICAL Christians instead of inconsistent ones. How about all those proto-protestants who were either killed, exiled or excommunicated because they questioned the divinity of Christ. Catholics believe in purgatory, which is nowhere in the Bible. The catholics did what they did because they rebelled. If they obeyed God they would not do that. Atheists always get confused between unBiblical catholicism and Biblical Christianity. Not surprising, given they lack knowledge. How about the Slavs that were forced to convert by the sword. By the islamic sword? That sure waa turning the other cheek. I could do this all day. Your hands are bloody and you refuse to admit that its not innocent as you make it out to be. Rebellion against God is bad no matter who does it. Everything bad you just mentioned violates God's Commands. God says He will judge all. Christianity is true. permalink parent award report block reply Shih_Tabed -8 points 4 days ago If people refuse to defend themselves, it is tough to have any sympathy for them. permalink award report block reply berserkerbarrage 7 points 4 days ago Well, there's about 20 million Christians and over 1 billion Hindus in India. Good luck. permalink parent award report block reply Shih_Tabed -4 points 4 days ago 20 million is plenty.  Plus, just give up anyway is your solution?  Just kneel and accept? permalink parent award report block reply FatigueIsReal 3 points 4 days ago They're being \"chased out of town.\"  They aren't being murdered.  Lol permalink parent award report block reply Shih_Tabed -2 points 4 days ago So just give up and turn tail is your solution? permalink parent award report block reply FatigueIsReal 1 points 4 days ago Do whatever the situation calls for. I'm not in the situation. permalink parent award report block reply Shih_Tabed 1 points 4 days ago Well complain to OP about the title, not me. permalink parent award report block reply IHateUntruth -12 points 4 days ago Based India. This is what they should do. permalink award report block reply guywholikesDjtof2024 1 points 4 days ago What do you mean? #CharlesKirkCool permalink parent award report block reply IHateUntruth 1 points 3 days ago They're protecting their society from corrosive forces. Americans can learn from this, including the Christians. permalink parent award report block reply etcetera 1 points 3 days ago Comment removed by community moderators. permalink award report block reply Meddlesom 0 points 4 days ago Comment removed by community filter. permalink award report block reply TheDarkEmperor 0 points 4 days ago Comment removed by community moderators. permalink award report block reply rapskull -1 points 4 days ago Comment removed by community moderators. permalink award report block reply\nColonelKlink 67 points 4 days ago Liars, rapists, and murderers. permalink award report block reply Leucophylla12 54 points 4 days ago Pajeets are genetically predisposed to being scammers permalink parent award report block reply maltese-poodle 43 points 4 days ago WHY IS TRUMP NOT STOPPING H1B VISAS??? THEY ARE PROCESSING THEM RAPIDLY EVEN DURING THE GOVT SHUTDOWN. END H1B NOW. SAVE TECH JOBS FOR AMERICANS. AMERICA FIRST. NONE OF THIS FUCKING BULLSHIT. WE ALREADY SAW WHAT HAPPENED WITH THAT STREETSHITTER RAGHEAD MAMDANI WINNING IN NEWYORK. ALL OF AMERICA WILL BE LIKE THAT NYC SHITHOLE SOON IF THE INVASION ISN'T STOPPED. END H1BS NOW TRUMP!!!!!!!! permalink parent award report block reply DeportThemAllForever 13 points 4 days ago He tried, but then lots of tech buddies started screaming \"bloody murder\" because they are all H1B staffed, so he backed off. permalink parent award report block reply Bigstick7 15 points 4 days ago Yep and issue is H1Bs killed the tech industry for Americans. Drove Americans out and wages down. So really what kids in college wants to get a CIS/CS degree to compete with a bunch of Indians for 50k a year? Most likely now with an Indian hiring manager who is guaranteed to only hire Indians. Really your at the breaking point to do this is your going to. Deport them and pay the aging white engineering further a ton to train up the next generation. Hope that wages go up, but then you have to be more productive than 3 Indians. Not hard to do. permalink parent award report block reply view 1 more comments... guywholikesDjtof2024 9 points 4 days ago Investigate those tech buddies. Then jail them. Use the full extent of the law. Tax them. Drain the Swamp. permalink parent award report block reply view 2 more comments... Pied-Trumper 7 points 4 days ago We didn’t elect his tech buddies. permalink parent award report block reply geckofishknight 4 points 4 days ago bloody bastard permalink parent award report block reply etcetera 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply DontTreadOnSnek 7 points 4 days ago WHY IS TRUMP NOT STOPPING H1B VISAS??? He's too busy endorsing Vivek Ramaswamy for Ohio governor. permalink parent award report block reply Covfefe_Commando 1 points 3 days ago Rampyswampy! permalink parent award report block reply 7PC_Principle 6 points 4 days ago Exactly...but these morons who are hoped on muh God Emperor Trump bandwagon and bending over to every propaganda bullshit that comes out Trump's mouth wouldn't believe it. Those who are actually paying attention pass the bullshit propaganda sees it for what it is. But don't expect losers here who are hoped on muh God muh Emperor bandwagon to see it. permalink parent award report block reply 10MeV 3 points 4 days ago I don’t completely disagree.  And yet, FWIW, this site is expressly designed for Trump supporters.  If you want to attack the GEOTUS side, this isn’t really the place for it.  Unless you’re just trolling, in which case I have a terse two-word response. permalink parent award report block reply view 3 more comments... Megascandal 4 points 4 days ago He increased the application fee from 2k-5k to 100k. Now companies will either commit financial suicide and keep hiring no-skills. Or they will hire Americans. permalink parent award report block reply Hanging_Chad 1 points 4 days ago because the new H1B fees are a juicy revenue stream? permalink parent award report block reply load 2 more comments... AlmostFullyDilated 4 points 4 days ago they call my phone 30 times a day and pretend like I don't hear the Indian accent right out the gate permalink parent award report block reply DeportThemAllForever 5 points 4 days ago Welcome to big tech permalink parent award report block reply Prach 2 points 3 days ago Comment removed by community moderators, pending further review. permalink parent award report block reply Prach 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply LordCommissarYarrick 4 points 4 days ago Imagine looking at these cow shit eating monkey god worshipping savages and thinking that they are perfect to let into your country as so many western politicians seem to do. There's nothing redeeming about them at all, and they will bring their bullshit with them. permalink parent award report block reply Pied-Trumper 1 points 4 days ago The best summarization I’ve seen. permalink parent award report block reply mohel 0 points 4 days ago Who let them in? permalink parent award report block reply AlmostFullyDilated 1 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nLeucophylla12 54 points 4 days ago Pajeets are genetically predisposed to being scammers permalink parent award report block reply maltese-poodle 43 points 4 days ago WHY IS TRUMP NOT STOPPING H1B VISAS??? THEY ARE PROCESSING THEM RAPIDLY EVEN DURING THE GOVT SHUTDOWN. END H1B NOW. SAVE TECH JOBS FOR AMERICANS. AMERICA FIRST. NONE OF THIS FUCKING BULLSHIT. WE ALREADY SAW WHAT HAPPENED WITH THAT STREETSHITTER RAGHEAD MAMDANI WINNING IN NEWYORK. ALL OF AMERICA WILL BE LIKE THAT NYC SHITHOLE SOON IF THE INVASION ISN'T STOPPED. END H1BS NOW TRUMP!!!!!!!! permalink parent award report block reply DeportThemAllForever 13 points 4 days ago He tried, but then lots of tech buddies started screaming \"bloody murder\" because they are all H1B staffed, so he backed off. permalink parent award report block reply Bigstick7 15 points 4 days ago Yep and issue is H1Bs killed the tech industry for Americans. Drove Americans out and wages down. So really what kids in college wants to get a CIS/CS degree to compete with a bunch of Indians for 50k a year? Most likely now with an Indian hiring manager who is guaranteed to only hire Indians. Really your at the breaking point to do this is your going to. Deport them and pay the aging white engineering further a ton to train up the next generation. Hope that wages go up, but then you have to be more productive than 3 Indians. Not hard to do. permalink parent award report block reply view 1 more comments... guywholikesDjtof2024 9 points 4 days ago Investigate those tech buddies. Then jail them. Use the full extent of the law. Tax them. Drain the Swamp. permalink parent award report block reply view 2 more comments... Pied-Trumper 7 points 4 days ago We didn’t elect his tech buddies. permalink parent award report block reply geckofishknight 4 points 4 days ago bloody bastard permalink parent award report block reply etcetera 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply DontTreadOnSnek 7 points 4 days ago WHY IS TRUMP NOT STOPPING H1B VISAS??? He's too busy endorsing Vivek Ramaswamy for Ohio governor. permalink parent award report block reply Covfefe_Commando 1 points 3 days ago Rampyswampy! permalink parent award report block reply 7PC_Principle 6 points 4 days ago Exactly...but these morons who are hoped on muh God Emperor Trump bandwagon and bending over to every propaganda bullshit that comes out Trump's mouth wouldn't believe it. Those who are actually paying attention pass the bullshit propaganda sees it for what it is. But don't expect losers here who are hoped on muh God muh Emperor bandwagon to see it. permalink parent award report block reply 10MeV 3 points 4 days ago I don’t completely disagree.  And yet, FWIW, this site is expressly designed for Trump supporters.  If you want to attack the GEOTUS side, this isn’t really the place for it.  Unless you’re just trolling, in which case I have a terse two-word response. permalink parent award report block reply view 3 more comments... Megascandal 4 points 4 days ago He increased the application fee from 2k-5k to 100k. Now companies will either commit financial suicide and keep hiring no-skills. Or they will hire Americans. permalink parent award report block reply Hanging_Chad 1 points 4 days ago because the new H1B fees are a juicy revenue stream? permalink parent award report block reply load 2 more comments... AlmostFullyDilated 4 points 4 days ago they call my phone 30 times a day and pretend like I don't hear the Indian accent right out the gate permalink parent award report block reply\nmaltese-poodle 43 points 4 days ago WHY IS TRUMP NOT STOPPING H1B VISAS??? THEY ARE PROCESSING THEM RAPIDLY EVEN DURING THE GOVT SHUTDOWN. END H1B NOW. SAVE TECH JOBS FOR AMERICANS. AMERICA FIRST. NONE OF THIS FUCKING BULLSHIT. WE ALREADY SAW WHAT HAPPENED WITH THAT STREETSHITTER RAGHEAD MAMDANI WINNING IN NEWYORK. ALL OF AMERICA WILL BE LIKE THAT NYC SHITHOLE SOON IF THE INVASION ISN'T STOPPED. END H1BS NOW TRUMP!!!!!!!! permalink parent award report block reply DeportThemAllForever 13 points 4 days ago He tried, but then lots of tech buddies started screaming \"bloody murder\" because they are all H1B staffed, so he backed off. permalink parent award report block reply Bigstick7 15 points 4 days ago Yep and issue is H1Bs killed the tech industry for Americans. Drove Americans out and wages down. So really what kids in college wants to get a CIS/CS degree to compete with a bunch of Indians for 50k a year? Most likely now with an Indian hiring manager who is guaranteed to only hire Indians. Really your at the breaking point to do this is your going to. Deport them and pay the aging white engineering further a ton to train up the next generation. Hope that wages go up, but then you have to be more productive than 3 Indians. Not hard to do. permalink parent award report block reply view 1 more comments... guywholikesDjtof2024 9 points 4 days ago Investigate those tech buddies. Then jail them. Use the full extent of the law. Tax them. Drain the Swamp. permalink parent award report block reply view 2 more comments... Pied-Trumper 7 points 4 days ago We didn’t elect his tech buddies. permalink parent award report block reply geckofishknight 4 points 4 days ago bloody bastard permalink parent award report block reply etcetera 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply DontTreadOnSnek 7 points 4 days ago WHY IS TRUMP NOT STOPPING H1B VISAS??? He's too busy endorsing Vivek Ramaswamy for Ohio governor. permalink parent award report block reply Covfefe_Commando 1 points 3 days ago Rampyswampy! permalink parent award report block reply 7PC_Principle 6 points 4 days ago Exactly...but these morons who are hoped on muh God Emperor Trump bandwagon and bending over to every propaganda bullshit that comes out Trump's mouth wouldn't believe it. Those who are actually paying attention pass the bullshit propaganda sees it for what it is. But don't expect losers here who are hoped on muh God muh Emperor bandwagon to see it. permalink parent award report block reply 10MeV 3 points 4 days ago I don’t completely disagree.  And yet, FWIW, this site is expressly designed for Trump supporters.  If you want to attack the GEOTUS side, this isn’t really the place for it.  Unless you’re just trolling, in which case I have a terse two-word response. permalink parent award report block reply view 3 more comments... Megascandal 4 points 4 days ago He increased the application fee from 2k-5k to 100k. Now companies will either commit financial suicide and keep hiring no-skills. Or they will hire Americans. permalink parent award report block reply Hanging_Chad 1 points 4 days ago because the new H1B fees are a juicy revenue stream? permalink parent award report block reply load 2 more comments...\nDeportThemAllForever 13 points 4 days ago He tried, but then lots of tech buddies started screaming \"bloody murder\" because they are all H1B staffed, so he backed off. permalink parent award report block reply Bigstick7 15 points 4 days ago Yep and issue is H1Bs killed the tech industry for Americans. Drove Americans out and wages down. So really what kids in college wants to get a CIS/CS degree to compete with a bunch of Indians for 50k a year? Most likely now with an Indian hiring manager who is guaranteed to only hire Indians. Really your at the breaking point to do this is your going to. Deport them and pay the aging white engineering further a ton to train up the next generation. Hope that wages go up, but then you have to be more productive than 3 Indians. Not hard to do. permalink parent award report block reply view 1 more comments... guywholikesDjtof2024 9 points 4 days ago Investigate those tech buddies. Then jail them. Use the full extent of the law. Tax them. Drain the Swamp. permalink parent award report block reply view 2 more comments... Pied-Trumper 7 points 4 days ago We didn’t elect his tech buddies. permalink parent award report block reply geckofishknight 4 points 4 days ago bloody bastard permalink parent award report block reply etcetera 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply\nBigstick7 15 points 4 days ago Yep and issue is H1Bs killed the tech industry for Americans. Drove Americans out and wages down. So really what kids in college wants to get a CIS/CS degree to compete with a bunch of Indians for 50k a year? Most likely now with an Indian hiring manager who is guaranteed to only hire Indians. Really your at the breaking point to do this is your going to. Deport them and pay the aging white engineering further a ton to train up the next generation. Hope that wages go up, but then you have to be more productive than 3 Indians. Not hard to do. permalink parent award report block reply view 1 more comments...\nguywholikesDjtof2024 9 points 4 days ago Investigate those tech buddies. Then jail them. Use the full extent of the law. Tax them. Drain the Swamp. permalink parent award report block reply view 2 more comments...\nPied-Trumper 7 points 4 days ago We didn’t elect his tech buddies. permalink parent award report block reply\ngeckofishknight 4 points 4 days ago bloody bastard permalink parent award report block reply\netcetera 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply\nDontTreadOnSnek 7 points 4 days ago WHY IS TRUMP NOT STOPPING H1B VISAS??? He's too busy endorsing Vivek Ramaswamy for Ohio governor. permalink parent award report block reply Covfefe_Commando 1 points 3 days ago Rampyswampy! permalink parent award report block reply\nCovfefe_Commando 1 points 3 days ago Rampyswampy! permalink parent award report block reply\n7PC_Principle 6 points 4 days ago Exactly...but these morons who are hoped on muh God Emperor Trump bandwagon and bending over to every propaganda bullshit that comes out Trump's mouth wouldn't believe it. Those who are actually paying attention pass the bullshit propaganda sees it for what it is. But don't expect losers here who are hoped on muh God muh Emperor bandwagon to see it. permalink parent award report block reply 10MeV 3 points 4 days ago I don’t completely disagree.  And yet, FWIW, this site is expressly designed for Trump supporters.  If you want to attack the GEOTUS side, this isn’t really the place for it.  Unless you’re just trolling, in which case I have a terse two-word response. permalink parent award report block reply view 3 more comments...\n10MeV 3 points 4 days ago I don’t completely disagree.  And yet, FWIW, this site is expressly designed for Trump supporters.  If you want to attack the GEOTUS side, this isn’t really the place for it.  Unless you’re just trolling, in which case I have a terse two-word response. permalink parent award report block reply view 3 more comments...\nMegascandal 4 points 4 days ago He increased the application fee from 2k-5k to 100k. Now companies will either commit financial suicide and keep hiring no-skills. Or they will hire Americans. permalink parent award report block reply\nHanging_Chad 1 points 4 days ago because the new H1B fees are a juicy revenue stream? permalink parent award report block reply\nAlmostFullyDilated 4 points 4 days ago they call my phone 30 times a day and pretend like I don't hear the Indian accent right out the gate permalink parent award report block reply\nDeportThemAllForever 5 points 4 days ago Welcome to big tech permalink parent award report block reply Prach 2 points 3 days ago Comment removed by community moderators, pending further review. permalink parent award report block reply Prach 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply\nPrach 2 points 3 days ago Comment removed by community moderators, pending further review. permalink parent award report block reply Prach 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply\nPrach 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply\nLordCommissarYarrick 4 points 4 days ago Imagine looking at these cow shit eating monkey god worshipping savages and thinking that they are perfect to let into your country as so many western politicians seem to do. There's nothing redeeming about them at all, and they will bring their bullshit with them. permalink parent award report block reply\nPied-Trumper 1 points 4 days ago The best summarization I’ve seen. permalink parent award report block reply\nmohel 0 points 4 days ago Who let them in? permalink parent award report block reply AlmostFullyDilated 1 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nAlmostFullyDilated 1 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nLol_Garrus 31 points 4 days ago Were gonna have to conquer the world if we want any kind of peace. Empire Earth permalink award report block reply Testamernt 25 points 4 days ago What would the world be like if only Christians were left? permalink parent award report block reply Sideways 30 points 4 days ago That would be Heaven. permalink parent award report block reply keeman 4 points 4 days ago Don't care.  Make America Great Again.  We have enough nukes to make all other nations leave us alone.  Let's start solving our own problems. permalink parent award report block reply Thatunknownguy 4 points 4 days ago Still a bunch of 3rd worlders permalink parent award report block reply guywholikesDjtof2024 3 points 4 days ago Why? I doubt that. The 3rd worlders would be converted to 1st worlders. And/or the ones that weren't, would not be here, because the comment said \"if only Christians were left\". permalink parent award report block reply HeavyMetalPatriot 2 points 4 days ago Turd Worlders cannot assimilate to the First World. The USA and Europe have proven that...the hard way and we may not escape our horrifying mistake. permalink parent award report block reply view 3 more comments... Thatunknownguy 1 points 3 days ago They are incapable of being like us. It's in their biology. Don't subscribe to 20th century neo-liberal talking points permalink parent award report block reply KernalMustard 1 points 4 days ago Yep. Look at places that the Christians decided they would convert people. It how is central and south America looking? How about Native Americans? How about Africa. permalink parent award report block reply HOSEQ 2 points 3 days ago Yes, many became Christians, and then, many flipped it into SANTERIA, which is a mix of pseuo-christianity and voodoo along with some other monstrous shit.... Soo, Christianity barely got to take root when it was then bastardized into something it was never meant to be.... Another \"\"Religious\"\" War Front, many aren't Christians, and of those who are, those are Catholics.... permalink parent award report block reply view 2 more comments... AlmostFullyDilated -2 points 4 days ago Comment removed by community moderators. permalink parent award report block reply Pied-Trumper 0 points 4 days ago Are you the new or old Testament? permalink parent award report block reply Newhawk237 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply sanitaryshaver 0 points 3 days ago Protestants and Catholics would start back up :( permalink parent award report block reply load 1 more comments... keeman 4 points 4 days ago No, we can mind our own business and get our own shit together.  On the current trajectory the USA will bankrupt and fail in less than 10 years.  Start with that assumption. permalink parent award report block reply\nTestamernt 25 points 4 days ago What would the world be like if only Christians were left? permalink parent award report block reply Sideways 30 points 4 days ago That would be Heaven. permalink parent award report block reply keeman 4 points 4 days ago Don't care.  Make America Great Again.  We have enough nukes to make all other nations leave us alone.  Let's start solving our own problems. permalink parent award report block reply Thatunknownguy 4 points 4 days ago Still a bunch of 3rd worlders permalink parent award report block reply guywholikesDjtof2024 3 points 4 days ago Why? I doubt that. The 3rd worlders would be converted to 1st worlders. And/or the ones that weren't, would not be here, because the comment said \"if only Christians were left\". permalink parent award report block reply HeavyMetalPatriot 2 points 4 days ago Turd Worlders cannot assimilate to the First World. The USA and Europe have proven that...the hard way and we may not escape our horrifying mistake. permalink parent award report block reply view 3 more comments... Thatunknownguy 1 points 3 days ago They are incapable of being like us. It's in their biology. Don't subscribe to 20th century neo-liberal talking points permalink parent award report block reply KernalMustard 1 points 4 days ago Yep. Look at places that the Christians decided they would convert people. It how is central and south America looking? How about Native Americans? How about Africa. permalink parent award report block reply HOSEQ 2 points 3 days ago Yes, many became Christians, and then, many flipped it into SANTERIA, which is a mix of pseuo-christianity and voodoo along with some other monstrous shit.... Soo, Christianity barely got to take root when it was then bastardized into something it was never meant to be.... Another \"\"Religious\"\" War Front, many aren't Christians, and of those who are, those are Catholics.... permalink parent award report block reply view 2 more comments... AlmostFullyDilated -2 points 4 days ago Comment removed by community moderators. permalink parent award report block reply Pied-Trumper 0 points 4 days ago Are you the new or old Testament? permalink parent award report block reply Newhawk237 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply sanitaryshaver 0 points 3 days ago Protestants and Catholics would start back up :( permalink parent award report block reply load 1 more comments...\nSideways 30 points 4 days ago That would be Heaven. permalink parent award report block reply\nkeeman 4 points 4 days ago Don't care.  Make America Great Again.  We have enough nukes to make all other nations leave us alone.  Let's start solving our own problems. permalink parent award report block reply\nThatunknownguy 4 points 4 days ago Still a bunch of 3rd worlders permalink parent award report block reply guywholikesDjtof2024 3 points 4 days ago Why? I doubt that. The 3rd worlders would be converted to 1st worlders. And/or the ones that weren't, would not be here, because the comment said \"if only Christians were left\". permalink parent award report block reply HeavyMetalPatriot 2 points 4 days ago Turd Worlders cannot assimilate to the First World. The USA and Europe have proven that...the hard way and we may not escape our horrifying mistake. permalink parent award report block reply view 3 more comments... Thatunknownguy 1 points 3 days ago They are incapable of being like us. It's in their biology. Don't subscribe to 20th century neo-liberal talking points permalink parent award report block reply KernalMustard 1 points 4 days ago Yep. Look at places that the Christians decided they would convert people. It how is central and south America looking? How about Native Americans? How about Africa. permalink parent award report block reply HOSEQ 2 points 3 days ago Yes, many became Christians, and then, many flipped it into SANTERIA, which is a mix of pseuo-christianity and voodoo along with some other monstrous shit.... Soo, Christianity barely got to take root when it was then bastardized into something it was never meant to be.... Another \"\"Religious\"\" War Front, many aren't Christians, and of those who are, those are Catholics.... permalink parent award report block reply view 2 more comments... AlmostFullyDilated -2 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nguywholikesDjtof2024 3 points 4 days ago Why? I doubt that. The 3rd worlders would be converted to 1st worlders. And/or the ones that weren't, would not be here, because the comment said \"if only Christians were left\". permalink parent award report block reply HeavyMetalPatriot 2 points 4 days ago Turd Worlders cannot assimilate to the First World. The USA and Europe have proven that...the hard way and we may not escape our horrifying mistake. permalink parent award report block reply view 3 more comments... Thatunknownguy 1 points 3 days ago They are incapable of being like us. It's in their biology. Don't subscribe to 20th century neo-liberal talking points permalink parent award report block reply\nHeavyMetalPatriot 2 points 4 days ago Turd Worlders cannot assimilate to the First World. The USA and Europe have proven that...the hard way and we may not escape our horrifying mistake. permalink parent award report block reply view 3 more comments...\nThatunknownguy 1 points 3 days ago They are incapable of being like us. It's in their biology. Don't subscribe to 20th century neo-liberal talking points permalink parent award report block reply\nKernalMustard 1 points 4 days ago Yep. Look at places that the Christians decided they would convert people. It how is central and south America looking? How about Native Americans? How about Africa. permalink parent award report block reply HOSEQ 2 points 3 days ago Yes, many became Christians, and then, many flipped it into SANTERIA, which is a mix of pseuo-christianity and voodoo along with some other monstrous shit.... Soo, Christianity barely got to take root when it was then bastardized into something it was never meant to be.... Another \"\"Religious\"\" War Front, many aren't Christians, and of those who are, those are Catholics.... permalink parent award report block reply view 2 more comments... AlmostFullyDilated -2 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nHOSEQ 2 points 3 days ago Yes, many became Christians, and then, many flipped it into SANTERIA, which is a mix of pseuo-christianity and voodoo along with some other monstrous shit.... Soo, Christianity barely got to take root when it was then bastardized into something it was never meant to be.... Another \"\"Religious\"\" War Front, many aren't Christians, and of those who are, those are Catholics.... permalink parent award report block reply view 2 more comments...\nAlmostFullyDilated -2 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nPied-Trumper 0 points 4 days ago Are you the new or old Testament? permalink parent award report block reply Newhawk237 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nNewhawk237 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nsanitaryshaver 0 points 3 days ago Protestants and Catholics would start back up :( permalink parent award report block reply\nkeeman 4 points 4 days ago No, we can mind our own business and get our own shit together.  On the current trajectory the USA will bankrupt and fail in less than 10 years.  Start with that assumption. permalink parent award report block reply\nmagnokor 11 points 4 days ago Now? Forever. Of course, the hindu supremacists are not being specific with their attacks, they do hate everyone.  A billion immoral people who think you are dirt, and should be scammed, mocked and destroyed. They can do what they want in their hole back there, but when they invade the West with their lawyers and Caste System they implement everything here. Only hire each other, only sell to each other, and of course will find any way to get into power.  They also enjoy killing their female babies, so your neighborhoods will suddenly have a lot of male India people. The peer-reviewed study found that Indian-born women in Ontario were significantly more likely than Canadian-born women to give birth to boys As they control Silicon Valley, so much of what they do will stay hidden. A 50-year-old man in northern India was killed in a mob lynching on Monday night allegedly over rumours that his family had been storing and consuming beef at home. The northeastern Indian state of Manipur remains in a tense state of unease weeks after a devastating spate of violence led to the death of at least 73 individuals, most of them Christians, and the burning, damage or destruction of nearly 400 churches. US culture breeds 'laziness' and 'mediocrity', says Vivek Ramaswamy Over 20 Indian-origin persons have been sentenced up to 20 years in prison in the U.S. for their involvement in a multimillion-dollar India-based call center scam which defrauded thousands Sugar Land-area Hindu temple now home to third largest statue in the U.S. permalink award report block reply HOSEQ 3 points 3 days ago Call them exactly what they are:: MUSLIMS.... permalink parent award report block reply PegasoSeiya 4 points 3 days ago Nah Hindus hate Muslims and Muslim hate Hindus. They both hate us so it doesn’t matter but Pakistan is their greatest enemy permalink parent award report block reply HOSEQ 1 points 3 days ago \"\"Hindu\"\", WAS their Religion some 1500 Years ago, but Islam Change all of that, even though the Religious Name stuck and became their National Name.... About the year 712 A.D. a Muslim Army  Invaded India, but it really didn't stick, so they came back in the 12th Century and again in the 18th Century.... India IS Muslim, it may also have Christianity, and Buddism, but the entire \"\"Hindu\"\"Religion is 100% Completely gone, only the name remains.... permalink parent award report block reply keeman 2 points 4 days ago So deport the problematic Indians in Silicon Valley and then we have no more interest in this shit.  That is a good outcome for me.  Not only do I not care who controls India, but the Constitution does not authorize the fedgov to do anything about it.  This empire shit is destroying what is left of our republic. permalink parent award report block reply\nHOSEQ 3 points 3 days ago Call them exactly what they are:: MUSLIMS.... permalink parent award report block reply PegasoSeiya 4 points 3 days ago Nah Hindus hate Muslims and Muslim hate Hindus. They both hate us so it doesn’t matter but Pakistan is their greatest enemy permalink parent award report block reply HOSEQ 1 points 3 days ago \"\"Hindu\"\", WAS their Religion some 1500 Years ago, but Islam Change all of that, even though the Religious Name stuck and became their National Name.... About the year 712 A.D. a Muslim Army  Invaded India, but it really didn't stick, so they came back in the 12th Century and again in the 18th Century.... India IS Muslim, it may also have Christianity, and Buddism, but the entire \"\"Hindu\"\"Religion is 100% Completely gone, only the name remains.... permalink parent award report block reply\nPegasoSeiya 4 points 3 days ago Nah Hindus hate Muslims and Muslim hate Hindus. They both hate us so it doesn’t matter but Pakistan is their greatest enemy permalink parent award report block reply HOSEQ 1 points 3 days ago \"\"Hindu\"\", WAS their Religion some 1500 Years ago, but Islam Change all of that, even though the Religious Name stuck and became their National Name.... About the year 712 A.D. a Muslim Army  Invaded India, but it really didn't stick, so they came back in the 12th Century and again in the 18th Century.... India IS Muslim, it may also have Christianity, and Buddism, but the entire \"\"Hindu\"\"Religion is 100% Completely gone, only the name remains.... permalink parent award report block reply\nHOSEQ 1 points 3 days ago \"\"Hindu\"\", WAS their Religion some 1500 Years ago, but Islam Change all of that, even though the Religious Name stuck and became their National Name.... About the year 712 A.D. a Muslim Army  Invaded India, but it really didn't stick, so they came back in the 12th Century and again in the 18th Century.... India IS Muslim, it may also have Christianity, and Buddism, but the entire \"\"Hindu\"\"Religion is 100% Completely gone, only the name remains.... permalink parent award report block reply\nkeeman 2 points 4 days ago So deport the problematic Indians in Silicon Valley and then we have no more interest in this shit.  That is a good outcome for me.  Not only do I not care who controls India, but the Constitution does not authorize the fedgov to do anything about it.  This empire shit is destroying what is left of our republic. permalink parent award report block reply\nTwitter 10 points 4 days ago Man if you're christian over the last few years you've been getting Genocide, churches burned, spit on, humiliated, and the list goes on with how much bullshit has been happening to the point it's uncanny. Liberals treat Christians like they are ISIS but accept them into their gay degenerate arms not knowing the same 'alt-right' extremist they fear so much is ISLAM FULL send. permalink award report block reply HeavyMetalPatriot 2 points 4 days ago Then perhaps Christians should embrace their history. https://www.youtube.com/watch?v=YL_APKnLtJo permalink parent award report block reply\nHeavyMetalPatriot 2 points 4 days ago Then perhaps Christians should embrace their history. https://www.youtube.com/watch?v=YL_APKnLtJo permalink parent award report block reply\nMSG1000 10 points 4 days ago Dear Jesus, I pray for intercession from You, and all Your Angels and Saints, to aid our fellow christians around the world who are being oppressed. For this I pray. Amen. permalink award report block reply guywholikesDjtof2024 -7 points 4 days ago The Bible does or does not teach that dead Believers can do things in the physical realm after death? Do believers go to Heaven right away, or when the Rapture happens, or when Jesus returns? permalink parent award report block reply America1stAndOnly -2 points 3 days ago Rapture Catholic apocrypha. Completely made up by them and not alluded to anywhere in the Holy Bible. permalink parent award report block reply TheOneWhoKnocks 2 points 3 days ago The \"rapture\" is not part of Catholic belief. That is protestant stuff. permalink parent award report block reply guywholikesDjtof2024 2 points 3 days ago No, Matthew 24:40 . But it's very good to see you know catholicism is compromise and addition, not consistent Christian tradition. permalink parent award report block reply America1stAndOnly 0 points 3 days ago No, that's talking about the return of Christ and how not everyone will pass judgment and make it to Heaven. It is not the Catholic's rapture in which they claim all the true believers will just vanish in a puff of smoke one day. But thank you for pointing me to one of the verse's that led to this kind of thinking. permalink parent award report block reply view 1 more comments... KernalMustard -9 points 4 days ago Like praying does anything permalink parent award report block reply guywholikesDjtof2024 3 points 4 days ago You'd have to be Omniscient to know prayer to God never does anything. The world is too complex for you to definitely claim \"NO\". The best you can do and still be not Christian, is to be agnostic on whether God answers prayers or not. Try Deism. Some of the founders were deist. permalink parent award report block reply\nguywholikesDjtof2024 -7 points 4 days ago The Bible does or does not teach that dead Believers can do things in the physical realm after death? Do believers go to Heaven right away, or when the Rapture happens, or when Jesus returns? permalink parent award report block reply America1stAndOnly -2 points 3 days ago Rapture Catholic apocrypha. Completely made up by them and not alluded to anywhere in the Holy Bible. permalink parent award report block reply TheOneWhoKnocks 2 points 3 days ago The \"rapture\" is not part of Catholic belief. That is protestant stuff. permalink parent award report block reply guywholikesDjtof2024 2 points 3 days ago No, Matthew 24:40 . But it's very good to see you know catholicism is compromise and addition, not consistent Christian tradition. permalink parent award report block reply America1stAndOnly 0 points 3 days ago No, that's talking about the return of Christ and how not everyone will pass judgment and make it to Heaven. It is not the Catholic's rapture in which they claim all the true believers will just vanish in a puff of smoke one day. But thank you for pointing me to one of the verse's that led to this kind of thinking. permalink parent award report block reply view 1 more comments... KernalMustard -9 points 4 days ago Like praying does anything permalink parent award report block reply guywholikesDjtof2024 3 points 4 days ago You'd have to be Omniscient to know prayer to God never does anything. The world is too complex for you to definitely claim \"NO\". The best you can do and still be not Christian, is to be agnostic on whether God answers prayers or not. Try Deism. Some of the founders were deist. permalink parent award report block reply\nAmerica1stAndOnly -2 points 3 days ago Rapture Catholic apocrypha. Completely made up by them and not alluded to anywhere in the Holy Bible. permalink parent award report block reply TheOneWhoKnocks 2 points 3 days ago The \"rapture\" is not part of Catholic belief. That is protestant stuff. permalink parent award report block reply guywholikesDjtof2024 2 points 3 days ago No, Matthew 24:40 . But it's very good to see you know catholicism is compromise and addition, not consistent Christian tradition. permalink parent award report block reply America1stAndOnly 0 points 3 days ago No, that's talking about the return of Christ and how not everyone will pass judgment and make it to Heaven. It is not the Catholic's rapture in which they claim all the true believers will just vanish in a puff of smoke one day. But thank you for pointing me to one of the verse's that led to this kind of thinking. permalink parent award report block reply view 1 more comments...\nTheOneWhoKnocks 2 points 3 days ago The \"rapture\" is not part of Catholic belief. That is protestant stuff. permalink parent award report block reply\nguywholikesDjtof2024 2 points 3 days ago No, Matthew 24:40 . But it's very good to see you know catholicism is compromise and addition, not consistent Christian tradition. permalink parent award report block reply America1stAndOnly 0 points 3 days ago No, that's talking about the return of Christ and how not everyone will pass judgment and make it to Heaven. It is not the Catholic's rapture in which they claim all the true believers will just vanish in a puff of smoke one day. But thank you for pointing me to one of the verse's that led to this kind of thinking. permalink parent award report block reply view 1 more comments...\nAmerica1stAndOnly 0 points 3 days ago No, that's talking about the return of Christ and how not everyone will pass judgment and make it to Heaven. It is not the Catholic's rapture in which they claim all the true believers will just vanish in a puff of smoke one day. But thank you for pointing me to one of the verse's that led to this kind of thinking. permalink parent award report block reply view 1 more comments...\nKernalMustard -9 points 4 days ago Like praying does anything permalink parent award report block reply guywholikesDjtof2024 3 points 4 days ago You'd have to be Omniscient to know prayer to God never does anything. The world is too complex for you to definitely claim \"NO\". The best you can do and still be not Christian, is to be agnostic on whether God answers prayers or not. Try Deism. Some of the founders were deist. permalink parent award report block reply\nguywholikesDjtof2024 3 points 4 days ago You'd have to be Omniscient to know prayer to God never does anything. The world is too complex for you to definitely claim \"NO\". The best you can do and still be not Christian, is to be agnostic on whether God answers prayers or not. Try Deism. Some of the founders were deist. permalink parent award report block reply\nkadromcs 8 points 4 days ago I read that as 7-Eleven Indians, and it still made sense. permalink award report block reply\npatrioticwinning3 8 points 4 days ago Yet the do nothing about the mooslims.... permalink award report block reply DrVSGGEOTUSPhD 12 points 4 days ago They actually go pretty hard on jihaddis. permalink parent award report block reply\nDrVSGGEOTUSPhD 12 points 4 days ago They actually go pretty hard on jihaddis. permalink parent award report block reply\nJustACitizenWarrior 8 points 4 days ago @china4biden. i notice you put up a bunch of indian related content, constantly. whats your fascination with this? its always nearly off-topic to the site. permalink award report block reply POT80 2 points 3 days ago He is a Pakistani permalink parent award report block reply POT80 2 points 3 days ago https://x.com/TheChronology__/status/1938559118828077328 https://threadreaderapp.com/thread/1938559118828077328.html read the whole thread permalink parent award report block reply OneMoreHome 1 points 3 days ago Now it makes sense. permalink parent award report block reply\nPOT80 2 points 3 days ago He is a Pakistani permalink parent award report block reply POT80 2 points 3 days ago https://x.com/TheChronology__/status/1938559118828077328 https://threadreaderapp.com/thread/1938559118828077328.html read the whole thread permalink parent award report block reply OneMoreHome 1 points 3 days ago Now it makes sense. permalink parent award report block reply\nPOT80 2 points 3 days ago https://x.com/TheChronology__/status/1938559118828077328 https://threadreaderapp.com/thread/1938559118828077328.html read the whole thread permalink parent award report block reply\nOneMoreHome 1 points 3 days ago Now it makes sense. permalink parent award report block reply\njournalist 7 points 4 days ago Let’s help by deporting all Hindus out of America. permalink award report block reply\n_Liberty_Prime_ 7 points 4 days ago Mods. I hope you verified this image as real news. https://www.lemonde.fr/en/pixels/article/2025/10/03/a-fake-news-website-impersonates-le-monde-and-brut_6746062_13.html Edit: here's the link: https://www.lemonde.fr/en/international/article/2024/01/06/hindu-extremists-ruthlessly-hunt-down-christians-in-india_6406265_4.html Seems to have a paywall? permalink award report block reply TwoArizonaPedes 5 points 4 days ago https://www.lemonde.fr/en/pixels/article/2025/10/03/a-fake-news-website-impersonates-le-monde-and-brut_6746062_13.html Interesting. Good to know. Seems to have a paywall? https://archive.is/nH9Ng permalink parent award report block reply Prandogolio 1 points 4 days ago Mods don't verify anything.  They see a headline that sounds important and they pin it. permalink parent award report block reply\nTwoArizonaPedes 5 points 4 days ago https://www.lemonde.fr/en/pixels/article/2025/10/03/a-fake-news-website-impersonates-le-monde-and-brut_6746062_13.html Interesting. Good to know. Seems to have a paywall? https://archive.is/nH9Ng permalink parent award report block reply\nPrandogolio 1 points 4 days ago Mods don't verify anything.  They see a headline that sounds important and they pin it. permalink parent award report block reply\nDJT_MFers1 6 points 4 days ago I knew that Gandhi shit was a fraud permalink award report block reply Easzq8 2 points 4 days ago Socialist permalink parent award report block reply captainmundane 2 points 3 days ago Gandhi was a pervert. permalink parent award report block reply LordCommissarYarrick 1 points 4 days ago Ghandi was actually quite racist and discrimatory to the lower castes. As a lawyer in south africa he got pissy because british authorities made him ride with the blacks despite his Brahmin status that pissed him off. He also tried to have india side with the Japanese and made overtures to Hitler. permalink parent award report block reply guywholikesDjtof2024 1 points 4 days ago elaborate permalink parent award report block reply America1stAndOnly 1 points 3 days ago Gandhi was only for non-violent revolution because violent revolution had been tried repeatedly and didn't work. He knew that White people possess a trait unique to them, compassion. Knowing this, his goal was to make the White rulers feel guilty about what they were doing there. Now that the White man no longer rules India, they are finally free to shit in the street, throw trash in their rivers, and get him by trains. Truly, the White man was a terrible evil for them. permalink parent award report block reply\nEaszq8 2 points 4 days ago Socialist permalink parent award report block reply\ncaptainmundane 2 points 3 days ago Gandhi was a pervert. permalink parent award report block reply\nLordCommissarYarrick 1 points 4 days ago Ghandi was actually quite racist and discrimatory to the lower castes. As a lawyer in south africa he got pissy because british authorities made him ride with the blacks despite his Brahmin status that pissed him off. He also tried to have india side with the Japanese and made overtures to Hitler. permalink parent award report block reply\nguywholikesDjtof2024 1 points 4 days ago elaborate permalink parent award report block reply\nAmerica1stAndOnly 1 points 3 days ago Gandhi was only for non-violent revolution because violent revolution had been tried repeatedly and didn't work. He knew that White people possess a trait unique to them, compassion. Knowing this, his goal was to make the White rulers feel guilty about what they were doing there. Now that the White man no longer rules India, they are finally free to shit in the street, throw trash in their rivers, and get him by trains. Truly, the White man was a terrible evil for them. permalink parent award report block reply\nPrandogolio 5 points 4 days ago We should be doing this with muslims in the USA permalink award report block reply ACActual 2 points 4 days ago Should?   Must permalink parent award report block reply ACActual 2 points 4 days ago Should?   Must permalink parent award report block reply ACActual 2 points 4 days ago Should?   Must permalink parent award report block reply Megaboom2025 -2 points 4 days ago Jews too permalink parent award report block reply\nACActual 2 points 4 days ago Should?   Must permalink parent award report block reply\nACActual 2 points 4 days ago Should?   Must permalink parent award report block reply\nACActual 2 points 4 days ago Should?   Must permalink parent award report block reply\nMegaboom2025 -2 points 4 days ago Jews too permalink parent award report block reply\n5DchessWatch 5 points 4 days ago Hindu nuffin' permalink award report block reply\nMindPhantom109 5 points 4 days ago Deport all poopjeets - they are stealing our jobs. permalink award report block reply HeavyMetalPatriot -1 points 4 days ago YEET THE JEETS!!! permalink parent award report block reply\nHeavyMetalPatriot -1 points 4 days ago YEET THE JEETS!!! permalink parent award report block reply\nSCP0073 5 points 4 days ago HinduDindu permalink award report block reply\nTrancePhreak 4 points 4 days ago HINDUS ARE NOW... The article is from 2024, so it has been going on for a while. permalink award report block reply guywholikesDjtof2024 2 points 4 days ago Pretty sure they still do that. And don't expect the Fake news to be honest about people who believe the TRUE Worldview. permalink parent award report block reply TrancePhreak 3 points 4 days ago Yeah, just critiquing the poor choice of wording in the title. with 579 incidents recorded in the first nine months of 2025 alone permalink parent award report block reply\nguywholikesDjtof2024 2 points 4 days ago Pretty sure they still do that. And don't expect the Fake news to be honest about people who believe the TRUE Worldview. permalink parent award report block reply TrancePhreak 3 points 4 days ago Yeah, just critiquing the poor choice of wording in the title. with 579 incidents recorded in the first nine months of 2025 alone permalink parent award report block reply\nTrancePhreak 3 points 4 days ago Yeah, just critiquing the poor choice of wording in the title. with 579 incidents recorded in the first nine months of 2025 alone permalink parent award report block reply\nltbadpuppy 3 points 4 days ago Jan 2024... permalink award report block reply America1stAndOnly 0 points 3 days ago Oh gosh, I guess that means everything is totally fine now. Hooray! There haven't been any Hindus attacking Christians for the past 2 years now! Right? permalink parent award report block reply ltbadpuppy 0 points 3 days ago Well lets look at your post title... permalink parent award report block reply America1stAndOnly 1 points 3 days ago I notice you didn't say it's not still happening. Get flushed down the toilet jeet. permalink parent award report block reply ltbadpuppy 1 points 3 days ago Oh golly, you called me a name how will i ever live with myself?! Speaking of toilets, i got myself a nice TOTO with one of those heated bidet things. Ground breaking, totally recommend it. permalink parent award report block reply\nAmerica1stAndOnly 0 points 3 days ago Oh gosh, I guess that means everything is totally fine now. Hooray! There haven't been any Hindus attacking Christians for the past 2 years now! Right? permalink parent award report block reply ltbadpuppy 0 points 3 days ago Well lets look at your post title... permalink parent award report block reply America1stAndOnly 1 points 3 days ago I notice you didn't say it's not still happening. Get flushed down the toilet jeet. permalink parent award report block reply ltbadpuppy 1 points 3 days ago Oh golly, you called me a name how will i ever live with myself?! Speaking of toilets, i got myself a nice TOTO with one of those heated bidet things. Ground breaking, totally recommend it. permalink parent award report block reply\nltbadpuppy 0 points 3 days ago Well lets look at your post title... permalink parent award report block reply America1stAndOnly 1 points 3 days ago I notice you didn't say it's not still happening. Get flushed down the toilet jeet. permalink parent award report block reply ltbadpuppy 1 points 3 days ago Oh golly, you called me a name how will i ever live with myself?! Speaking of toilets, i got myself a nice TOTO with one of those heated bidet things. Ground breaking, totally recommend it. permalink parent award report block reply\nAmerica1stAndOnly 1 points 3 days ago I notice you didn't say it's not still happening. Get flushed down the toilet jeet. permalink parent award report block reply ltbadpuppy 1 points 3 days ago Oh golly, you called me a name how will i ever live with myself?! Speaking of toilets, i got myself a nice TOTO with one of those heated bidet things. Ground breaking, totally recommend it. permalink parent award report block reply\nltbadpuppy 1 points 3 days ago Oh golly, you called me a name how will i ever live with myself?! Speaking of toilets, i got myself a nice TOTO with one of those heated bidet things. Ground breaking, totally recommend it. permalink parent award report block reply\nkeeman 2 points 4 days ago This is a Make America Great Again forum.  What does this have to do with this? permalink award report block reply\nLORDFALCONE 2 points 4 days ago No laws against shitting in the street? permalink award report block reply\nMaoHadOnly1Testicle 2 points 3 days ago I already hate India, you don't have to sell it to me permalink award report block reply\nkeeman 2 points 4 days ago Don't care.  This is India.  We are America.  Can we fucking Make AMERICA great again already? permalink award report block reply\nSmurfection 2 points 4 days ago Shithole people always try to make conversions illegal. permalink award report block reply guywholikesDjtof2024 2 points 4 days ago Fake news needs censorship to thrive. permalink parent award report block reply Smurfection 1 points 4 days ago Yep.  It's because lies always rely on repetition of the lie and overton window in order to gain ascendency.  Especially when young women are brainwashed into being the enforcers of the \"correct\" narrative. permalink parent award report block reply\nguywholikesDjtof2024 2 points 4 days ago Fake news needs censorship to thrive. permalink parent award report block reply Smurfection 1 points 4 days ago Yep.  It's because lies always rely on repetition of the lie and overton window in order to gain ascendency.  Especially when young women are brainwashed into being the enforcers of the \"correct\" narrative. permalink parent award report block reply\nSmurfection 1 points 4 days ago Yep.  It's because lies always rely on repetition of the lie and overton window in order to gain ascendency.  Especially when young women are brainwashed into being the enforcers of the \"correct\" narrative. permalink parent award report block reply\nJuzeza 1 points 4 days ago Shit hole permalink award report block reply\nkornesque 1 points 3 days ago The article uses the term \"hunt down\" after mentioning religious conversion is unlawful. Does that term mean \"seek out\" or \"find and kill\"? Meaning are these Christians being killed or just incarcerated? permalink award report block reply\nknnbccb 1 points 4 days ago (Dhalsim theme plays) permalink award report block reply\nJaunty_Haul 1 points 3 days ago criminalized religious conversion? fuck that place permalink award report block reply\nterribletwos 1 points 4 days ago Sounds just like what they did in China. permalink award report block reply\nPeekov3 1 points 4 days ago Arm yourself with a bar of soap necklace permalink award report block reply\nMedicallyReddit 1 points 4 days ago Saaaaar permalink award report block reply\nbubadmt 1 points 4 days ago In India. They can do whatever the fuck they want to there. permalink award report block reply\narebee 1 points 3 days ago Those poor Hindus. We should bring them to a white country and pay for all their needs! permalink award report block reply\nAmerica1stAndOnly 1 points 3 days ago Evil, nasty woman. permalink award report block reply\nFormerlurker92 1 points 4 days ago The experiment with multiculturalism has been going on for a while, and we have the results. Not great. Can we cut the bullshit yet? permalink award report block reply\nDreddhead13 1 points 3 days ago Can we do this here? 😁 Get rid of all those 3rd world Baal worshippers, and the useless dotheads. permalink award report block reply\nlifeisahologram 1 points 4 days ago What’s hilarious is that profile pic, whoever that is, it almost certainly is artificially manipulated to have whiter skin, in addition to other enhancements and photoshopping, and the woman probably spends tons of money on skin creams in real life to get clearer whiter skin, and her entire life is constantly concerned and worried about desiring to be whiter. lol Indians are pathetic permalink award report block reply\nInduceddrag 1 points 4 days ago Life in the turd world. permalink award report block reply\nunitedspeedalarm 0 points 4 days ago Here is a channel run by a Hindu American spreading misinformation against Christianity just last week. https://www.youtube.com/watch?v=hrHRO0uV7SI permalink award report block reply\nAlmostFullyDilated 0 points 4 days ago Indians are retarded and skinny they wouldn't last long in a death match permalink award report block reply\nAgent_86 0 points 4 days ago Then ditch the label. I did. It works. 😁 permalink award report block reply\nramennov -1 points 4 days ago Killing people over imaginary beliefs is beyond retarded. But this is who we are. permalink award report block reply guywholikesDjtof2024 2 points 4 days ago Like when lenin, mao, stalin, and pol pot did? Hint: What did they believe about history, human purpose, origins, age of earth, the Supernatural, and God? permalink parent award report block reply KernalMustard 0 points 4 days ago To them the State was GOD. Cant have religions compete. Theres old scifi show called Babylon 5. They had this faction called the psicorp. They had this mantra. The corp is mother, the corp is father. It was pretty fascist if anyone strayed. They would hunt them down and either kill(if they resisted) or imprison them and reeducate them? Sound famlier. permalink parent award report block reply guywholikesDjtof2024 3 points 4 days ago And their athiesm did zero to stop it. Biblical Christianity is true, and provides anti communist beliefs. Their beliefs were downstream fron atheism. The strong survive in Darwinism/atheism. The Shadows and Evil Vorlons (they became evil later on) were strong. They lacked morality, and yet were fit as a fiddle. So much for \"the golden rule\" keeping them in check. If atheism is true, there is no actual reason to be moral. See soros, gates, and fauci. Just be the best of the best in this world and you're in luck. permalink parent award report block reply KernalMustard -4 points 4 days ago No its not. Desert people religion thought up 4k years ago. Theres nothing real about it. Go find Zeus for me why dont you. Wheres odin? How about Vishnu? Marduk? Osirus? There are no Gods or God or will there ever be Gods. Its 2025. Its time to move on from the  Sky God nonsense. Now that doesnt mean there isnt anything to learn from your bible. Its there to teach. Its in the form of history and its in the form of stories. Sometimes a mixture of both. Knowing how the 2 are seperate is key. permalink parent award report block reply\nguywholikesDjtof2024 2 points 4 days ago Like when lenin, mao, stalin, and pol pot did? Hint: What did they believe about history, human purpose, origins, age of earth, the Supernatural, and God? permalink parent award report block reply KernalMustard 0 points 4 days ago To them the State was GOD. Cant have religions compete. Theres old scifi show called Babylon 5. They had this faction called the psicorp. They had this mantra. The corp is mother, the corp is father. It was pretty fascist if anyone strayed. They would hunt them down and either kill(if they resisted) or imprison them and reeducate them? Sound famlier. permalink parent award report block reply guywholikesDjtof2024 3 points 4 days ago And their athiesm did zero to stop it. Biblical Christianity is true, and provides anti communist beliefs. Their beliefs were downstream fron atheism. The strong survive in Darwinism/atheism. The Shadows and Evil Vorlons (they became evil later on) were strong. They lacked morality, and yet were fit as a fiddle. So much for \"the golden rule\" keeping them in check. If atheism is true, there is no actual reason to be moral. See soros, gates, and fauci. Just be the best of the best in this world and you're in luck. permalink parent award report block reply KernalMustard -4 points 4 days ago No its not. Desert people religion thought up 4k years ago. Theres nothing real about it. Go find Zeus for me why dont you. Wheres odin? How about Vishnu? Marduk? Osirus? There are no Gods or God or will there ever be Gods. Its 2025. Its time to move on from the  Sky God nonsense. Now that doesnt mean there isnt anything to learn from your bible. Its there to teach. Its in the form of history and its in the form of stories. Sometimes a mixture of both. Knowing how the 2 are seperate is key. permalink parent award report block reply\nKernalMustard 0 points 4 days ago To them the State was GOD. Cant have religions compete. Theres old scifi show called Babylon 5. They had this faction called the psicorp. They had this mantra. The corp is mother, the corp is father. It was pretty fascist if anyone strayed. They would hunt them down and either kill(if they resisted) or imprison them and reeducate them? Sound famlier. permalink parent award report block reply guywholikesDjtof2024 3 points 4 days ago And their athiesm did zero to stop it. Biblical Christianity is true, and provides anti communist beliefs. Their beliefs were downstream fron atheism. The strong survive in Darwinism/atheism. The Shadows and Evil Vorlons (they became evil later on) were strong. They lacked morality, and yet were fit as a fiddle. So much for \"the golden rule\" keeping them in check. If atheism is true, there is no actual reason to be moral. See soros, gates, and fauci. Just be the best of the best in this world and you're in luck. permalink parent award report block reply KernalMustard -4 points 4 days ago No its not. Desert people religion thought up 4k years ago. Theres nothing real about it. Go find Zeus for me why dont you. Wheres odin? How about Vishnu? Marduk? Osirus? There are no Gods or God or will there ever be Gods. Its 2025. Its time to move on from the  Sky God nonsense. Now that doesnt mean there isnt anything to learn from your bible. Its there to teach. Its in the form of history and its in the form of stories. Sometimes a mixture of both. Knowing how the 2 are seperate is key. permalink parent award report block reply\nguywholikesDjtof2024 3 points 4 days ago And their athiesm did zero to stop it. Biblical Christianity is true, and provides anti communist beliefs. Their beliefs were downstream fron atheism. The strong survive in Darwinism/atheism. The Shadows and Evil Vorlons (they became evil later on) were strong. They lacked morality, and yet were fit as a fiddle. So much for \"the golden rule\" keeping them in check. If atheism is true, there is no actual reason to be moral. See soros, gates, and fauci. Just be the best of the best in this world and you're in luck. permalink parent award report block reply KernalMustard -4 points 4 days ago No its not. Desert people religion thought up 4k years ago. Theres nothing real about it. Go find Zeus for me why dont you. Wheres odin? How about Vishnu? Marduk? Osirus? There are no Gods or God or will there ever be Gods. Its 2025. Its time to move on from the  Sky God nonsense. Now that doesnt mean there isnt anything to learn from your bible. Its there to teach. Its in the form of history and its in the form of stories. Sometimes a mixture of both. Knowing how the 2 are seperate is key. permalink parent award report block reply\nKernalMustard -4 points 4 days ago No its not. Desert people religion thought up 4k years ago. Theres nothing real about it. Go find Zeus for me why dont you. Wheres odin? How about Vishnu? Marduk? Osirus? There are no Gods or God or will there ever be Gods. Its 2025. Its time to move on from the  Sky God nonsense. Now that doesnt mean there isnt anything to learn from your bible. Its there to teach. Its in the form of history and its in the form of stories. Sometimes a mixture of both. Knowing how the 2 are seperate is key. permalink parent award report block reply\nInternet_hugs -1 points 4 days ago Reminder, Vivek wants to bring millions more like him here. If it's brown, flush it down. permalink award report block reply\nIhateallliars -1 points 4 days ago What a joke these organized religions are. They want you to kill each other and make women into slaves. In no way does either one honor God, or what they are calling God. Some of these religions even say that evil (named) entities or angels are God, knowing full well they aren't, but they elevate them to the status of God. F that. permalink award report block reply guywholikesDjtof2024 1 points 4 days ago Agreed that hinduism is evil. Which worldview out of all the worldviews is the true one? Which moral system is the correct one? permalink parent award report block reply\nguywholikesDjtof2024 1 points 4 days ago Agreed that hinduism is evil. Which worldview out of all the worldviews is the true one? Which moral system is the correct one? permalink parent award report block reply\nHikedelics -1 points 4 days ago Time to start sprinkling carfentanyl or similar on the cow patties. Those nasty fucks will never know what hit them. And even if authorities figure it out they’ll be too ashamed to admit it. permalink award report block reply Prandogolio 1 points 4 days ago Is that fentanyl for cars? permalink parent award report block reply clocker23 1 points 4 days ago kek permalink parent award report block reply\nPrandogolio 1 points 4 days ago Is that fentanyl for cars? permalink parent award report block reply clocker23 1 points 4 days ago kek permalink parent award report block reply\nclocker23 1 points 4 days ago kek permalink parent award report block reply\nTheSonOfGadsden -1 points 4 days ago That cunt should get hunted down permalink award report block reply\nModernturnkey -2 points 4 days ago You have no idea how much I'd love open season on Indians. permalink award report block reply\nAlmostFullyDilated -3 points 4 days ago Indians can barely cook food. they would all die if we cut off their food stamps permalink award report block reply\nyodayoda -3 points 4 days ago it's India, morons permalink award report block reply\n3-10 -3 points 4 days ago There is clearly a reason why everyone hates Christians more than they hate Jews. permalink award report block reply MAGA_NRG 2 points 4 days ago What's the reason permalink parent award report block reply 3-10 1 points 3 days ago Because Christ is truly the one and only way to the Father and heaven/New Earth. Satan isn’t going to focus his attacks on false religions like Hinduism and Buddhism, he already has those people. permalink parent award report block reply\nMAGA_NRG 2 points 4 days ago What's the reason permalink parent award report block reply 3-10 1 points 3 days ago Because Christ is truly the one and only way to the Father and heaven/New Earth. Satan isn’t going to focus his attacks on false religions like Hinduism and Buddhism, he already has those people. permalink parent award report block reply\n3-10 1 points 3 days ago Because Christ is truly the one and only way to the Father and heaven/New Earth. Satan isn’t going to focus his attacks on false religions like Hinduism and Buddhism, he already has those people. permalink parent award report block reply\nChickensaurus -4 points 4 days ago Meanwhile, Christians submit like cuckolds. permalink award report block reply guywholikesDjtof2024 2 points 4 days ago And people with your worldview fare better.... how, exactly? Please do tell us permalink parent award report block reply XlDEN -5 points 4 days ago The King of the Jews instructed them to turn the other cheek. permalink parent award report block reply guywholikesDjtof2024 7 points 4 days ago That was a symbol of defiance and a 2nd chance rather than mere submission. Also, \"Sell your cloak and buy a sword\" permalink parent award report block reply KernalMustard -5 points 4 days ago So when you were killing your own brothers and sisters all over europe over whos flavor of Chistianity was the best was turning the other cheek. How about all those proto-protestants who were either killed, exiled or excommunicated because they questioned the divinity of christ. That sure was turning the other cheek. How about the Slavs that were forced to convert by the sword. That sure waa turning the other cheek. I could do this all day. Your hands are bloody and you refuse to admit that its not innocent as you make it out to be. permalink parent award report block reply guywholikesDjtof2024 6 points 4 days ago do this all day I love this! So when you were killing your own brothers and sisters all over europe A. Were or were not the numbers exaggerated? B. How does that not violate \"thou shalt not murder\"? What commands does athiesm give people? over whos flavor of Chistianity was the best was turning the other cheek. Breaking news: people rebel against the Bible. You're proving my belief that people should be BIBLICAL Christians instead of inconsistent ones. How about all those proto-protestants who were either killed, exiled or excommunicated because they questioned the divinity of Christ. Catholics believe in purgatory, which is nowhere in the Bible. The catholics did what they did because they rebelled. If they obeyed God they would not do that. Atheists always get confused between unBiblical catholicism and Biblical Christianity. Not surprising, given they lack knowledge. How about the Slavs that were forced to convert by the sword. By the islamic sword? That sure waa turning the other cheek. I could do this all day. Your hands are bloody and you refuse to admit that its not innocent as you make it out to be. Rebellion against God is bad no matter who does it. Everything bad you just mentioned violates God's Commands. God says He will judge all. Christianity is true. permalink parent award report block reply\nguywholikesDjtof2024 2 points 4 days ago And people with your worldview fare better.... how, exactly? Please do tell us permalink parent award report block reply\nXlDEN -5 points 4 days ago The King of the Jews instructed them to turn the other cheek. permalink parent award report block reply guywholikesDjtof2024 7 points 4 days ago That was a symbol of defiance and a 2nd chance rather than mere submission. Also, \"Sell your cloak and buy a sword\" permalink parent award report block reply KernalMustard -5 points 4 days ago So when you were killing your own brothers and sisters all over europe over whos flavor of Chistianity was the best was turning the other cheek. How about all those proto-protestants who were either killed, exiled or excommunicated because they questioned the divinity of christ. That sure was turning the other cheek. How about the Slavs that were forced to convert by the sword. That sure waa turning the other cheek. I could do this all day. Your hands are bloody and you refuse to admit that its not innocent as you make it out to be. permalink parent award report block reply guywholikesDjtof2024 6 points 4 days ago do this all day I love this! So when you were killing your own brothers and sisters all over europe A. Were or were not the numbers exaggerated? B. How does that not violate \"thou shalt not murder\"? What commands does athiesm give people? over whos flavor of Chistianity was the best was turning the other cheek. Breaking news: people rebel against the Bible. You're proving my belief that people should be BIBLICAL Christians instead of inconsistent ones. How about all those proto-protestants who were either killed, exiled or excommunicated because they questioned the divinity of Christ. Catholics believe in purgatory, which is nowhere in the Bible. The catholics did what they did because they rebelled. If they obeyed God they would not do that. Atheists always get confused between unBiblical catholicism and Biblical Christianity. Not surprising, given they lack knowledge. How about the Slavs that were forced to convert by the sword. By the islamic sword? That sure waa turning the other cheek. I could do this all day. Your hands are bloody and you refuse to admit that its not innocent as you make it out to be. Rebellion against God is bad no matter who does it. Everything bad you just mentioned violates God's Commands. God says He will judge all. Christianity is true. permalink parent award report block reply\nguywholikesDjtof2024 7 points 4 days ago That was a symbol of defiance and a 2nd chance rather than mere submission. Also, \"Sell your cloak and buy a sword\" permalink parent award report block reply KernalMustard -5 points 4 days ago So when you were killing your own brothers and sisters all over europe over whos flavor of Chistianity was the best was turning the other cheek. How about all those proto-protestants who were either killed, exiled or excommunicated because they questioned the divinity of christ. That sure was turning the other cheek. How about the Slavs that were forced to convert by the sword. That sure waa turning the other cheek. I could do this all day. Your hands are bloody and you refuse to admit that its not innocent as you make it out to be. permalink parent award report block reply guywholikesDjtof2024 6 points 4 days ago do this all day I love this! So when you were killing your own brothers and sisters all over europe A. Were or were not the numbers exaggerated? B. How does that not violate \"thou shalt not murder\"? What commands does athiesm give people? over whos flavor of Chistianity was the best was turning the other cheek. Breaking news: people rebel against the Bible. You're proving my belief that people should be BIBLICAL Christians instead of inconsistent ones. How about all those proto-protestants who were either killed, exiled or excommunicated because they questioned the divinity of Christ. Catholics believe in purgatory, which is nowhere in the Bible. The catholics did what they did because they rebelled. If they obeyed God they would not do that. Atheists always get confused between unBiblical catholicism and Biblical Christianity. Not surprising, given they lack knowledge. How about the Slavs that were forced to convert by the sword. By the islamic sword? That sure waa turning the other cheek. I could do this all day. Your hands are bloody and you refuse to admit that its not innocent as you make it out to be. Rebellion against God is bad no matter who does it. Everything bad you just mentioned violates God's Commands. God says He will judge all. Christianity is true. permalink parent award report block reply\nKernalMustard -5 points 4 days ago So when you were killing your own brothers and sisters all over europe over whos flavor of Chistianity was the best was turning the other cheek. How about all those proto-protestants who were either killed, exiled or excommunicated because they questioned the divinity of christ. That sure was turning the other cheek. How about the Slavs that were forced to convert by the sword. That sure waa turning the other cheek. I could do this all day. Your hands are bloody and you refuse to admit that its not innocent as you make it out to be. permalink parent award report block reply guywholikesDjtof2024 6 points 4 days ago do this all day I love this! So when you were killing your own brothers and sisters all over europe A. Were or were not the numbers exaggerated? B. How does that not violate \"thou shalt not murder\"? What commands does athiesm give people? over whos flavor of Chistianity was the best was turning the other cheek. Breaking news: people rebel against the Bible. You're proving my belief that people should be BIBLICAL Christians instead of inconsistent ones. How about all those proto-protestants who were either killed, exiled or excommunicated because they questioned the divinity of Christ. Catholics believe in purgatory, which is nowhere in the Bible. The catholics did what they did because they rebelled. If they obeyed God they would not do that. Atheists always get confused between unBiblical catholicism and Biblical Christianity. Not surprising, given they lack knowledge. How about the Slavs that were forced to convert by the sword. By the islamic sword? That sure waa turning the other cheek. I could do this all day. Your hands are bloody and you refuse to admit that its not innocent as you make it out to be. Rebellion against God is bad no matter who does it. Everything bad you just mentioned violates God's Commands. God says He will judge all. Christianity is true. permalink parent award report block reply\nguywholikesDjtof2024 6 points 4 days ago do this all day I love this! So when you were killing your own brothers and sisters all over europe A. Were or were not the numbers exaggerated? B. How does that not violate \"thou shalt not murder\"? What commands does athiesm give people? over whos flavor of Chistianity was the best was turning the other cheek. Breaking news: people rebel against the Bible. You're proving my belief that people should be BIBLICAL Christians instead of inconsistent ones. How about all those proto-protestants who were either killed, exiled or excommunicated because they questioned the divinity of Christ. Catholics believe in purgatory, which is nowhere in the Bible. The catholics did what they did because they rebelled. If they obeyed God they would not do that. Atheists always get confused between unBiblical catholicism and Biblical Christianity. Not surprising, given they lack knowledge. How about the Slavs that were forced to convert by the sword. By the islamic sword? That sure waa turning the other cheek. I could do this all day. Your hands are bloody and you refuse to admit that its not innocent as you make it out to be. Rebellion against God is bad no matter who does it. Everything bad you just mentioned violates God's Commands. God says He will judge all. Christianity is true. permalink parent award report block reply\nShih_Tabed -8 points 4 days ago If people refuse to defend themselves, it is tough to have any sympathy for them. permalink award report block reply berserkerbarrage 7 points 4 days ago Well, there's about 20 million Christians and over 1 billion Hindus in India. Good luck. permalink parent award report block reply Shih_Tabed -4 points 4 days ago 20 million is plenty.  Plus, just give up anyway is your solution?  Just kneel and accept? permalink parent award report block reply FatigueIsReal 3 points 4 days ago They're being \"chased out of town.\"  They aren't being murdered.  Lol permalink parent award report block reply Shih_Tabed -2 points 4 days ago So just give up and turn tail is your solution? permalink parent award report block reply FatigueIsReal 1 points 4 days ago Do whatever the situation calls for. I'm not in the situation. permalink parent award report block reply Shih_Tabed 1 points 4 days ago Well complain to OP about the title, not me. permalink parent award report block reply\nberserkerbarrage 7 points 4 days ago Well, there's about 20 million Christians and over 1 billion Hindus in India. Good luck. permalink parent award report block reply Shih_Tabed -4 points 4 days ago 20 million is plenty.  Plus, just give up anyway is your solution?  Just kneel and accept? permalink parent award report block reply\nShih_Tabed -4 points 4 days ago 20 million is plenty.  Plus, just give up anyway is your solution?  Just kneel and accept? permalink parent award report block reply\nFatigueIsReal 3 points 4 days ago They're being \"chased out of town.\"  They aren't being murdered.  Lol permalink parent award report block reply Shih_Tabed -2 points 4 days ago So just give up and turn tail is your solution? permalink parent award report block reply FatigueIsReal 1 points 4 days ago Do whatever the situation calls for. I'm not in the situation. permalink parent award report block reply Shih_Tabed 1 points 4 days ago Well complain to OP about the title, not me. permalink parent award report block reply\nShih_Tabed -2 points 4 days ago So just give up and turn tail is your solution? permalink parent award report block reply FatigueIsReal 1 points 4 days ago Do whatever the situation calls for. I'm not in the situation. permalink parent award report block reply Shih_Tabed 1 points 4 days ago Well complain to OP about the title, not me. permalink parent award report block reply\nFatigueIsReal 1 points 4 days ago Do whatever the situation calls for. I'm not in the situation. permalink parent award report block reply Shih_Tabed 1 points 4 days ago Well complain to OP about the title, not me. permalink parent award report block reply\nShih_Tabed 1 points 4 days ago Well complain to OP about the title, not me. permalink parent award report block reply\nIHateUntruth -12 points 4 days ago Based India. This is what they should do. permalink award report block reply guywholikesDjtof2024 1 points 4 days ago What do you mean? #CharlesKirkCool permalink parent award report block reply IHateUntruth 1 points 3 days ago They're protecting their society from corrosive forces. Americans can learn from this, including the Christians. permalink parent award report block reply\nguywholikesDjtof2024 1 points 4 days ago What do you mean? #CharlesKirkCool permalink parent award report block reply IHateUntruth 1 points 3 days ago They're protecting their society from corrosive forces. Americans can learn from this, including the Christians. permalink parent award report block reply\nIHateUntruth 1 points 3 days ago They're protecting their society from corrosive forces. Americans can learn from this, including the Christians. permalink parent award report block reply\netcetera 1 points 3 days ago Comment removed by community moderators. permalink award report block reply\nMeddlesom 0 points 4 days ago Comment removed by community filter. permalink award report block reply\nTheDarkEmperor 0 points 4 days ago Comment removed by community moderators. permalink award report block reply\nrapskull -1 points 4 days ago Comment removed by community moderators. permalink award report block reply"}