{"id": "1ARK591j4W", "contents": "1061 Obama’s “Affordable” Care Act made healthcare anything but affordable. It lined the pockets of insurance companies while driving costs through the roof for everyone else. Health insurance has become one of the biggest scams in America. posted 3 days ago by ALT26 86 comments award share report block I Meme Therefore I Am 🇺🇸 @ImMeme0 • 3d Obama’s “Affordable” Care Act made healthcare anything but affordable. It lined the pockets of insurance companies while driving costs through the roof for everyone else. Health insurance has become one of the biggest scams in America. A family medicine doctor just blew the lid\n86 comments Sort by Top Top New Worst Old Save deleted 50 points 3 days ago MastaJoda 23 points 3 days ago Lol Fuck I still remeber Lush Pelosi saying that, and the RINOs who went along with it. What does Congress care though? We pay for their top notch private insurance plans. permalink parent award report block reply NotYourMan 7 points 3 days ago It was forced on all of us by democrats.  ACA is the worst law for the middle class in history.  ACA will drive the lower middle into poverty to pay for health insurance and it will get lots of executives (and politicians) very, very rich increasing the wealth spread between the poor and the rich. permalink parent award report block reply Bullet3250 38 points 3 days ago Average Health Insurance for a family is now around $27,000 per year. Gee, Thanks Obama. permalink award report block reply ModernKnight 28 points 3 days ago But health insurance costs were SKYROCKETING before Obamacare!  The year before it was passed my health insurance went up a whole $3 per month, from $58/month to $61/month!  After it passed I had a health insurance plan that was an easy, affordable $675/month! permalink parent award report block reply HockeyMom4Trump 9 points 3 days ago Yeah, but you could keep your doctor!!!! permalink parent award report block reply flyover_deplorable 2 points 3 days ago But your \"subsidy\" probably brought that price down!! LOL permalink parent award report block reply AllisterTwo 1 points 3 days ago Even being entirely unemployed as a stay at home father at the time, I didn't qualify for any subsidies (and still don't) not one due to the significant others income level...  And I didn't qualify for her employers insurance (not that I would have got it as it jumped to nearly $600/month for spousal coverage after the ACA passed) because even after 25 years of being together we were were not officially married, so no insurance qualification through her employer....  ACA subsidies are based on household income not individual income...  Really stupid when you are not married and thus their income is not in any legal way your income even if you live together... permalink parent award report block reply South_Florida_Guy 9 points 3 days ago All according to plan permalink parent award report block reply BadCompany 5 points 3 days ago I member when it kicked in I was a broke 23 year old working a shit job barely getting by. That time I couldn’t afford health insurance, then this fucking retarded Obamacare was implemented. You HAD to buy health insurance or else you would be fined. Absolute fucking scam. Cheapest was like $300 per month!! Wtf. Never went to the doctor and now that’s like a massive amount of my income that I literally couldn’t afford. Ended up taking the fine vs paying because I’d be on the streets. I’ll never forget early Trump days when he said it was cruel to do this to people barely getting by - to fine them. That moment I knew he was the real deal. A politician that finally speaks for me, been a huge fan ever since. permalink parent award report block reply Bullet3250 2 points 2 days ago This is all going to be really painful - but the Nation needs to start up a giant FREE MARKET HEALTH CARE SYSTEM THAT IS CASH ONLY. 'NO INSURANCE COMPANIES' - no Health Care \"Providers\" checking boxes.... no Blob of Administrators... no for profit 'Inc.' behind the scenes.... No 100 testing procedures to rule out 1% chance of some 'Legal Issue' - because that is a massive overhang in health care costs. They have to go back to the 1970's - when Doctors were in charge of everything - and Administrators jobs were limited to filling supply shelves and making sure the facility was clean.  Hospital Administrators now are basically in charge of Care. Health Administration Cost (including legal costs) - and Insurance costs - and the Government.... are why the monthly  cost is $27,000 per year and not $4,000 per year permalink parent award report block reply MastaJoda 5 points 3 days ago In-fucking-sane! permalink parent award report block reply NotYourMan 4 points 3 days ago My Dad is retired.  80% of his bills are taxes and health insurance.  When he goes on medicare it will cost him money too! permalink parent award report block reply load 1 more comments... Somebody157 30 points 3 days ago They always call the bill the opposite of what it will do. permalink award report block reply McFatty7 22 points 3 days ago \"Inflation Reduction Act\" 🤡 \"American Rescue Plan\" 🤡 permalink parent award report block reply sobriquet 15 points 3 days ago I guess we should hope for the \"Drown America in a dirty bar toilet\" act then. permalink parent award report block reply ConvergenceMan 2 points 3 days ago Nah they'll call it something like \"The American Domestic Kindness Act\" which outlaws MAGA and authorizes summary executions on sight permalink parent award report block reply HockeyMom4Trump 2 points 3 days ago That should be a yes vote. permalink parent award report block reply FelixtheMan 11 points 3 days ago Patriot Act permalink parent award report block reply MastaJoda 5 points 3 days ago ☝This one permalink parent award report block reply South_Florida_Guy 4 points 3 days ago The sunshine rainbows puppy dogs and lollipops act will legalize abortions up until 10 years after birth permalink parent award report block reply Right0hio 4 points 3 days ago Absolutely, remember the “inflation reduction act” permalink parent award report block reply tholinz 22 points 3 days ago Insurance should cover catastrophic situations and everything else should be out of pocket. And prices should be set. No more insurance companies negotiating deals, no more illegals soaking up services for free and causing hospitals to jack up prices. One fee for everyone regardless of how they're paying. I guarantee you too that there would be a ton of charity money and grants out there if we had a system like that. permalink award report block reply zooty 10 points 3 days ago The current style of healthcare insurance comes from a time when companies were limited in the wages they could offer and had to come up with other ways to offer compensation to attract top employees. It's government interference all the way down. permalink parent award report block reply Kolob64 5 points 3 days ago I remember that.  Nixon's wage and price controls.  Not only did we self pay for most things, the doctors wee independent businesses and could say what they believed. permalink parent award report block reply joggin_noggin 2 points 3 days ago Nah, this started under crypto-fascist FDR, who limited direct monetary compensation and created the entire 'benefits' scheme. permalink parent award report block reply Kolob64 2 points 3 days ago I remember my dad telling me about how his grandfather would rant and rave every time FDR came on the radio. permalink parent award report block reply HuggableBear 9 points 3 days ago And prices should be set. NO. ABSOLUTELY NOT. Have you learned nothing? \"We need government out of <X>, except for this one part where I want it involved.\" NOOOOOO. The government should stay out of it. COMPLETELY. That includes price controls, you idiot. You're asking for Communism from a different direction. Government's only function should be guard rails on the system to prevent fraud. Let the market set prices and the government's only function should be to prevent monopoly. Hospitals and doctors should be competing for your dollars with quality, and higher quality care and service should cost more, just like any other service. permalink parent award report block reply joggin_noggin 4 points 3 days ago Forcing companies to publicly list their prices and not hide them until the bill comes due is not over-burdensome government interference. It does not require the government to dictate the price for goods and services. All it does is remove the option for one healthcare company to screw prospective patients with gotcha fees. permalink parent award report block reply HuggableBear 2 points 2 days ago I apologize, I thought you meant prices should be set for services and be the same everywhere. Yes, prices should be publicly available and the same no matter how they are paid. permalink parent award report block reply AndanteAndante 6 points 3 days ago We had that growing up from my dads job. It was called Major Medical. permalink parent award report block reply Kolob64 4 points 3 days ago I had it until the ACA took over. permalink parent award report block reply Greenhills 11 points 3 days ago The problem is, medical providers sign contracts with insurance companies forbidding them from allowing you to pay cash if you are insured. Trust me, I’ve tried it for this reason. Some wont even allow you to make an appt without proof of insurance. I thought trump signed an executive order Biden never overturned requiring providers and hospitals to provide transparent pricing. What a new law should require providers to show you the cash price for fixed procedures and tests. permalink award report block reply Datamancer 6 points 3 days ago Sounds like grounds for a 'tortious interference with contract' class action suit against all insurance companies in all markets. permalink parent award report block reply remindmelater 11 points 3 days ago Who would have figured that if they added a middleman/middlemen who wants to make a darned good living that the medical bill will be much much higher....? permalink award report block reply BBvarn 10 points 3 days ago Don't bitch to Trump about your healthcare. Bitch to Obama and your brown and black neighbors who get free healthcare. permalink award report block reply MastaJoda 9 points 3 days ago I'll bitch at whoever is in gov NOW who isnt doing their job and fixing that Obamanation. Obama cant fix it today. Gfy permalink parent award report block reply zooty 2 points 3 days ago Yeah, what's that going to accomplish? permalink parent award report block reply Nibba2 1 points 3 days ago Go watch the 2012 presidential debates. Mittens Romney was proposing the same dead. Almost identical. The uniparty was going to force it one way or another. permalink parent award report block reply TallGlassofMelonade 10 points 3 days ago My wife had cancer.   We self paid for most of her scans even though we had “good” insurance.  Didn’t go towards my high deductible but cash is cash. permalink award report block reply markolbb 10 points 3 days ago Hope she's okay now pede. permalink parent award report block reply NoMoreShinesBilly 9 points 3 days ago fraud from the first page to the last page.  Everything that was said was a lie, including when it was greenlit by the supreme court with John Roberts as the lead bullshitter.  Next round - executive powers. permalink award report block reply RandoBudster 7 points 3 days ago ObamaCare wouldn't exist without McCain permalink award report block reply flyover_deplorable 3 points 3 days ago Don't forget Ben Nelson! permalink parent award report block reply RandoBudster 2 points 3 days ago And Chief Justice Roberts claiming the 'fine' for opt-out as just a  ' tax' so it was ok permalink parent award report block reply LilaQuartermaine 6 points 3 days ago Obama Inc. successfully conflated 2 terms: Healthcare and Health Insurance. Healthcare is the delivery of goods and services to maintain health and heal ailments.\nHealth insurance is a financial instrument. permalink award report block reply empiretc 6 points 3 days ago yeah.... what was the problem with just having affordable walk-in clinics?  those do not seem to exist anymore. permalink award report block reply Kolob64 1 points 3 days ago They are all over Utah and we have them here in Nevada as well. permalink parent award report block reply Skabliggum2 6 points 3 days ago Not a single pajeet on any of those calls permalink award report block reply OldMule68 5 points 3 days ago We had good insurance for our family before ACA.  When our state finally adopted their rules, every insurance company fled the state and the marketplace was a nightmare.  We dropped it and did self pay with the Medi Share.  Never once used it, but it was in case of an emergency--car accident or cancer or something. Prayed a lot and God is good--didn't have a problem.  Saved us about 9K per year. permalink award report block reply Kolob64 6 points 3 days ago We have been on Medishare for over a decade now, have never used it.  We just pay cash for everything. permalink parent award report block reply South_Florida_Guy 5 points 3 days ago There was nothing wrong with the healthcare insurance market before Obongo came along and ruined it. The only thing that ever needing fixing to make it better was to kick out all of the illegals from the county that used ERs like a McDonald's drive thru which drove up costs of the actual healthcare. Besides that it was perfectly affordable. permalink award report block reply RememberCharlieKirk 5 points 3 days ago Given that the wrongly titled Affordable Care Act was passed in 2010, how did Obama ever win his 2012 re-election? Did the true horrors of the Act occur years later? Were the high costs not felt immediately? permalink award report block reply Nameless_Mofo 5 points 3 days ago First of all, he won through voter fraud of course. Second, yes the true horrors (individual mandate and such) kicked in years later, as he was about to leave office. permalink parent award report block reply Kolob64 4 points 3 days ago Romney did the same in Mass which left them with a fiscal nightmare after he left office. permalink parent award report block reply AbrahamLincoln 4 points 3 days ago Romney ran against him and he sucks. permalink parent award report block reply YodaBannon 3 points 3 days ago Obama really milked that shit like he saved the world with this bullshit. permalink award report block reply ThisTrainHasNoBrakes 3 points 3 days ago ACA and insurance are bullshit, but so is this video.  She is knowingly comparing bill amount (which is high and always fake) to actual negotiated amount/allowable/expected to be paid.  Insurance will pay around the self pay amounts too after “discount”. permalink award report block reply SHILL_DETECTOR 2 points 3 days ago wrong permalink parent award report block reply ThisTrainHasNoBrakes 0 points 3 days ago You are clearly ignorant on how healthcare billing works so you probably shouldn’t be speaking on it permalink parent award report block reply SHILL_DETECTOR 0 points 3 days ago bitch! permalink parent award report block reply joggin_noggin 1 points 3 days ago Why is there 5x variance between nearby hospitals from the highest self-pay price to the lowest if hospitals aren't fake and gay? It's the same with prescriptions; when I was younger I drove to a pharmacy 90m away four times a year to pick up a prescription for $100 instead of $800 at the pharmacies in town. That's a broken market if ever there was one. permalink parent award report block reply ThisTrainHasNoBrakes 2 points 3 days ago Oh it’s absolutely a broken market, I build medical systems could teach a whole college course on it. The short version is because there is no real capitalist market because the payments are often divorced from the need for care.  And we are all “forced” into the market by “needing” insurance.  It’s all a scam. permalink parent award report block reply Wozzing 3 points 3 days ago Healthcare would be a lot cheaper if every American didn’t spend a couple hundred dollars a month for medication just so they can remain fat.  Sure the insurance company pays for it, but that money is coming from somewhere. permalink award report block reply ACActual 3 points 3 days ago Im quitting Insurance permalink award report block reply BasedBoyScout 3 points 3 days ago I liked how it was Obamacare when it was going to let you keep your doctor and lower your premiums. Then it was the Affordable Care Act when all that turned out to not be true. Then it somehow became Trumps fault in 2025 because he won't let Democrats subsidize infinite brown people. permalink award report block reply Psalm-118_24 3 points 3 days ago Insurance companies  and HOSPITALS.  If you're like our state, look around you at hospital expansion.  Our hospitals made a killing during covid, not only of patients but on their finances too.  Also, if all the illegals and freeloaders are removed from taxpayer funded programs, the rest of us will have our costs wgo down because we won't be  paying for the illegals/freeloaders. permalink award report block reply conservativefrank 3 points 3 days ago My insurance was $97 per month with a $2000 deductible and $4000 out of pocket limit before Obamacare. Today, it's $1600 per month with a $5000 deductible and $8000 out of pocket limit. Thanks Obamacare. At least I, a 58 year old single man, have maternity coverage. permalink award report block reply zooty 2 points 3 days ago The doctor will order something you maybe don't need, the insurance company will deny your claim and you'll be stuck with the bills for overpriced insurance and the services you wanted it to cover. permalink award report block reply lul_cheto 2 points 3 days ago A big reason for the discount is because insurance companies drag their feet and require tons of paperwork for doctors to get paid.. so if you pay out of pocket you eliminate the middle man saving the doctors a ton of money.. A friend helps run a company that's makes millions a year just buying debt off of doctors , paying the doctors up front and waiting for the insurance company to pay out years later.. One doctor sold them 6m in debt for 3million.. took 3 years for them to get the money. permalink award report block reply Maganifice7 2 points 3 days ago When they wanted me to pay $500 a month for health insurance, I said no. Still don't have insurance to this day. If it wasn't required for my mortgage or diving, I wouldn't have that either. permalink award report block reply Oodles 2 points 3 days ago This will not change. The people pocketing all of this graft are the ones buying Congress to make sure this never changes Your congressional representative may tell you they will change this, but they are lying right to your face permalink award report block reply TPMJB 2 points 3 days ago It's weird shopping around for this type of thing because prices vary WILDLY between practices. I have a location near to me that deals in just MRIs and CT scans. MRI costs $250 self-pay, which I feel is reasonable. permalink award report block reply Dwoj 2 points 3 days ago This statement is not wrong permalink award report block reply invalid_data 2 points 3 days ago Novel concept, how about kicking out all the immigrants and watch how the cost of everything drops. We can still blow up Obama shit insurance but focus on the nation ending problem, the invasion. permalink award report block reply RuprechtThaMonkeyBoy 2 points 3 days ago Amazing permalink award report block reply henri_derelicte 2 points 3 days ago One of the things we can do if we get rid of the filibuster is repeal the part of EMTALA that requires hospitals to provide service to whoever comes in, regardless of their ability to pay. Getting rid of that would drastically cut down the cost of care by literally killing off the freeloaders permalink award report block reply dburt2 1 points 3 days ago Car and house insurance is a scam too. permalink award report block reply FrmrAmericanRepublic 1 points 3 days ago I didn't pay a single dollar into NogCare. And I knew the moment they had a 'mandate' to force everyone into it that it was bullshit. Sorry if you had to for whatever reason, but fuck these communist faggots and all their fucking bullshit. permalink award report block reply presticus 1 points 3 days ago Before Obamacare i was paying about $50 a month for a catastrophic plan that had $1000 deductible, and a cost share after deductible where i only paid 20% upto a cap i forget after which the insurance paid 100%. After Obamacare the insurance company ended that plan and i went on the State exchange created by the ACA. I was paying $140ish a month for a plan that covered more stuff upfront but ultimately i would pay more out of pocket in the event if an emergency. By the time i found a job 4 years ago that offered health insurance i was paying $220 a month for plan on the exchange that was worse then the one i was forced to get due to Obamacare. Because of rising insurance costs last year my employer had to switch from a plan where they covered 100% of the monthly premium to a different plan where the employee has to pay 10% of the monthly and the out of pocket deductible doubled. permalink award report block reply Stlpoolguy 1 points 3 days ago There's always been a huge cash discount.   I knew a carpenter that would pay cash for all medical services ( bar the emergency room) and then submit the paid receipt to the insurance company for reimbursement.  He just wanted to save his local some money.  This was mid-late 90's permalink award report block reply flp999 1 points 3 days ago We all hate SCAMS and SCAMMERS. DJT, declare an all out war on all SCAMS and SCAMMERS. permalink award report block reply Nomad899 1 points 3 days ago And BHOle bought 3 beach properties permalink award report block reply PowerOfBlues 0 points 3 days ago Preventative medicine is a giant scam...... Anyone who goes for screenings is a cucked Normie People used to just live their lives without fretting over their freaking \"numbers\" If everyone was like me..... 80% of checkup doctors would have to close their offices within a year or two permalink award report block reply Klown_Kutz -1 points 3 days ago Lose this boomer mindset that corporations are our friends and all profit is good profit. “You will own nothing and be happy” didn’t come from government. It came from the private sector who would in fact benefit greatly from that idea permalink award report block reply corporateshizer 1 points 3 days ago Comment removed by community filter, pending further review. permalink award report block reply\ndeleted 50 points 3 days ago MastaJoda 23 points 3 days ago Lol Fuck I still remeber Lush Pelosi saying that, and the RINOs who went along with it. What does Congress care though? We pay for their top notch private insurance plans. permalink parent award report block reply NotYourMan 7 points 3 days ago It was forced on all of us by democrats.  ACA is the worst law for the middle class in history.  ACA will drive the lower middle into poverty to pay for health insurance and it will get lots of executives (and politicians) very, very rich increasing the wealth spread between the poor and the rich. permalink parent award report block reply\nMastaJoda 23 points 3 days ago Lol Fuck I still remeber Lush Pelosi saying that, and the RINOs who went along with it. What does Congress care though? We pay for their top notch private insurance plans. permalink parent award report block reply\nNotYourMan 7 points 3 days ago It was forced on all of us by democrats.  ACA is the worst law for the middle class in history.  ACA will drive the lower middle into poverty to pay for health insurance and it will get lots of executives (and politicians) very, very rich increasing the wealth spread between the poor and the rich. permalink parent award report block reply\nBullet3250 38 points 3 days ago Average Health Insurance for a family is now around $27,000 per year. Gee, Thanks Obama. permalink award report block reply ModernKnight 28 points 3 days ago But health insurance costs were SKYROCKETING before Obamacare!  The year before it was passed my health insurance went up a whole $3 per month, from $58/month to $61/month!  After it passed I had a health insurance plan that was an easy, affordable $675/month! permalink parent award report block reply HockeyMom4Trump 9 points 3 days ago Yeah, but you could keep your doctor!!!! permalink parent award report block reply flyover_deplorable 2 points 3 days ago But your \"subsidy\" probably brought that price down!! LOL permalink parent award report block reply AllisterTwo 1 points 3 days ago Even being entirely unemployed as a stay at home father at the time, I didn't qualify for any subsidies (and still don't) not one due to the significant others income level...  And I didn't qualify for her employers insurance (not that I would have got it as it jumped to nearly $600/month for spousal coverage after the ACA passed) because even after 25 years of being together we were were not officially married, so no insurance qualification through her employer....  ACA subsidies are based on household income not individual income...  Really stupid when you are not married and thus their income is not in any legal way your income even if you live together... permalink parent award report block reply South_Florida_Guy 9 points 3 days ago All according to plan permalink parent award report block reply BadCompany 5 points 3 days ago I member when it kicked in I was a broke 23 year old working a shit job barely getting by. That time I couldn’t afford health insurance, then this fucking retarded Obamacare was implemented. You HAD to buy health insurance or else you would be fined. Absolute fucking scam. Cheapest was like $300 per month!! Wtf. Never went to the doctor and now that’s like a massive amount of my income that I literally couldn’t afford. Ended up taking the fine vs paying because I’d be on the streets. I’ll never forget early Trump days when he said it was cruel to do this to people barely getting by - to fine them. That moment I knew he was the real deal. A politician that finally speaks for me, been a huge fan ever since. permalink parent award report block reply Bullet3250 2 points 2 days ago This is all going to be really painful - but the Nation needs to start up a giant FREE MARKET HEALTH CARE SYSTEM THAT IS CASH ONLY. 'NO INSURANCE COMPANIES' - no Health Care \"Providers\" checking boxes.... no Blob of Administrators... no for profit 'Inc.' behind the scenes.... No 100 testing procedures to rule out 1% chance of some 'Legal Issue' - because that is a massive overhang in health care costs. They have to go back to the 1970's - when Doctors were in charge of everything - and Administrators jobs were limited to filling supply shelves and making sure the facility was clean.  Hospital Administrators now are basically in charge of Care. Health Administration Cost (including legal costs) - and Insurance costs - and the Government.... are why the monthly  cost is $27,000 per year and not $4,000 per year permalink parent award report block reply MastaJoda 5 points 3 days ago In-fucking-sane! permalink parent award report block reply NotYourMan 4 points 3 days ago My Dad is retired.  80% of his bills are taxes and health insurance.  When he goes on medicare it will cost him money too! permalink parent award report block reply load 1 more comments...\nModernKnight 28 points 3 days ago But health insurance costs were SKYROCKETING before Obamacare!  The year before it was passed my health insurance went up a whole $3 per month, from $58/month to $61/month!  After it passed I had a health insurance plan that was an easy, affordable $675/month! permalink parent award report block reply HockeyMom4Trump 9 points 3 days ago Yeah, but you could keep your doctor!!!! permalink parent award report block reply flyover_deplorable 2 points 3 days ago But your \"subsidy\" probably brought that price down!! LOL permalink parent award report block reply AllisterTwo 1 points 3 days ago Even being entirely unemployed as a stay at home father at the time, I didn't qualify for any subsidies (and still don't) not one due to the significant others income level...  And I didn't qualify for her employers insurance (not that I would have got it as it jumped to nearly $600/month for spousal coverage after the ACA passed) because even after 25 years of being together we were were not officially married, so no insurance qualification through her employer....  ACA subsidies are based on household income not individual income...  Really stupid when you are not married and thus their income is not in any legal way your income even if you live together... permalink parent award report block reply\nHockeyMom4Trump 9 points 3 days ago Yeah, but you could keep your doctor!!!! permalink parent award report block reply\nflyover_deplorable 2 points 3 days ago But your \"subsidy\" probably brought that price down!! LOL permalink parent award report block reply AllisterTwo 1 points 3 days ago Even being entirely unemployed as a stay at home father at the time, I didn't qualify for any subsidies (and still don't) not one due to the significant others income level...  And I didn't qualify for her employers insurance (not that I would have got it as it jumped to nearly $600/month for spousal coverage after the ACA passed) because even after 25 years of being together we were were not officially married, so no insurance qualification through her employer....  ACA subsidies are based on household income not individual income...  Really stupid when you are not married and thus their income is not in any legal way your income even if you live together... permalink parent award report block reply\nAllisterTwo 1 points 3 days ago Even being entirely unemployed as a stay at home father at the time, I didn't qualify for any subsidies (and still don't) not one due to the significant others income level...  And I didn't qualify for her employers insurance (not that I would have got it as it jumped to nearly $600/month for spousal coverage after the ACA passed) because even after 25 years of being together we were were not officially married, so no insurance qualification through her employer....  ACA subsidies are based on household income not individual income...  Really stupid when you are not married and thus their income is not in any legal way your income even if you live together... permalink parent award report block reply\nSouth_Florida_Guy 9 points 3 days ago All according to plan permalink parent award report block reply\nBadCompany 5 points 3 days ago I member when it kicked in I was a broke 23 year old working a shit job barely getting by. That time I couldn’t afford health insurance, then this fucking retarded Obamacare was implemented. You HAD to buy health insurance or else you would be fined. Absolute fucking scam. Cheapest was like $300 per month!! Wtf. Never went to the doctor and now that’s like a massive amount of my income that I literally couldn’t afford. Ended up taking the fine vs paying because I’d be on the streets. I’ll never forget early Trump days when he said it was cruel to do this to people barely getting by - to fine them. That moment I knew he was the real deal. A politician that finally speaks for me, been a huge fan ever since. permalink parent award report block reply Bullet3250 2 points 2 days ago This is all going to be really painful - but the Nation needs to start up a giant FREE MARKET HEALTH CARE SYSTEM THAT IS CASH ONLY. 'NO INSURANCE COMPANIES' - no Health Care \"Providers\" checking boxes.... no Blob of Administrators... no for profit 'Inc.' behind the scenes.... No 100 testing procedures to rule out 1% chance of some 'Legal Issue' - because that is a massive overhang in health care costs. They have to go back to the 1970's - when Doctors were in charge of everything - and Administrators jobs were limited to filling supply shelves and making sure the facility was clean.  Hospital Administrators now are basically in charge of Care. Health Administration Cost (including legal costs) - and Insurance costs - and the Government.... are why the monthly  cost is $27,000 per year and not $4,000 per year permalink parent award report block reply\nBullet3250 2 points 2 days ago This is all going to be really painful - but the Nation needs to start up a giant FREE MARKET HEALTH CARE SYSTEM THAT IS CASH ONLY. 'NO INSURANCE COMPANIES' - no Health Care \"Providers\" checking boxes.... no Blob of Administrators... no for profit 'Inc.' behind the scenes.... No 100 testing procedures to rule out 1% chance of some 'Legal Issue' - because that is a massive overhang in health care costs. They have to go back to the 1970's - when Doctors were in charge of everything - and Administrators jobs were limited to filling supply shelves and making sure the facility was clean.  Hospital Administrators now are basically in charge of Care. Health Administration Cost (including legal costs) - and Insurance costs - and the Government.... are why the monthly  cost is $27,000 per year and not $4,000 per year permalink parent award report block reply\nMastaJoda 5 points 3 days ago In-fucking-sane! permalink parent award report block reply\nNotYourMan 4 points 3 days ago My Dad is retired.  80% of his bills are taxes and health insurance.  When he goes on medicare it will cost him money too! permalink parent award report block reply\nSomebody157 30 points 3 days ago They always call the bill the opposite of what it will do. permalink award report block reply McFatty7 22 points 3 days ago \"Inflation Reduction Act\" 🤡 \"American Rescue Plan\" 🤡 permalink parent award report block reply sobriquet 15 points 3 days ago I guess we should hope for the \"Drown America in a dirty bar toilet\" act then. permalink parent award report block reply ConvergenceMan 2 points 3 days ago Nah they'll call it something like \"The American Domestic Kindness Act\" which outlaws MAGA and authorizes summary executions on sight permalink parent award report block reply HockeyMom4Trump 2 points 3 days ago That should be a yes vote. permalink parent award report block reply FelixtheMan 11 points 3 days ago Patriot Act permalink parent award report block reply MastaJoda 5 points 3 days ago ☝This one permalink parent award report block reply South_Florida_Guy 4 points 3 days ago The sunshine rainbows puppy dogs and lollipops act will legalize abortions up until 10 years after birth permalink parent award report block reply Right0hio 4 points 3 days ago Absolutely, remember the “inflation reduction act” permalink parent award report block reply\nMcFatty7 22 points 3 days ago \"Inflation Reduction Act\" 🤡 \"American Rescue Plan\" 🤡 permalink parent award report block reply sobriquet 15 points 3 days ago I guess we should hope for the \"Drown America in a dirty bar toilet\" act then. permalink parent award report block reply ConvergenceMan 2 points 3 days ago Nah they'll call it something like \"The American Domestic Kindness Act\" which outlaws MAGA and authorizes summary executions on sight permalink parent award report block reply HockeyMom4Trump 2 points 3 days ago That should be a yes vote. permalink parent award report block reply FelixtheMan 11 points 3 days ago Patriot Act permalink parent award report block reply MastaJoda 5 points 3 days ago ☝This one permalink parent award report block reply\nsobriquet 15 points 3 days ago I guess we should hope for the \"Drown America in a dirty bar toilet\" act then. permalink parent award report block reply ConvergenceMan 2 points 3 days ago Nah they'll call it something like \"The American Domestic Kindness Act\" which outlaws MAGA and authorizes summary executions on sight permalink parent award report block reply HockeyMom4Trump 2 points 3 days ago That should be a yes vote. permalink parent award report block reply\nConvergenceMan 2 points 3 days ago Nah they'll call it something like \"The American Domestic Kindness Act\" which outlaws MAGA and authorizes summary executions on sight permalink parent award report block reply\nHockeyMom4Trump 2 points 3 days ago That should be a yes vote. permalink parent award report block reply\nFelixtheMan 11 points 3 days ago Patriot Act permalink parent award report block reply MastaJoda 5 points 3 days ago ☝This one permalink parent award report block reply\nMastaJoda 5 points 3 days ago ☝This one permalink parent award report block reply\nSouth_Florida_Guy 4 points 3 days ago The sunshine rainbows puppy dogs and lollipops act will legalize abortions up until 10 years after birth permalink parent award report block reply\nRight0hio 4 points 3 days ago Absolutely, remember the “inflation reduction act” permalink parent award report block reply\ntholinz 22 points 3 days ago Insurance should cover catastrophic situations and everything else should be out of pocket. And prices should be set. No more insurance companies negotiating deals, no more illegals soaking up services for free and causing hospitals to jack up prices. One fee for everyone regardless of how they're paying. I guarantee you too that there would be a ton of charity money and grants out there if we had a system like that. permalink award report block reply zooty 10 points 3 days ago The current style of healthcare insurance comes from a time when companies were limited in the wages they could offer and had to come up with other ways to offer compensation to attract top employees. It's government interference all the way down. permalink parent award report block reply Kolob64 5 points 3 days ago I remember that.  Nixon's wage and price controls.  Not only did we self pay for most things, the doctors wee independent businesses and could say what they believed. permalink parent award report block reply joggin_noggin 2 points 3 days ago Nah, this started under crypto-fascist FDR, who limited direct monetary compensation and created the entire 'benefits' scheme. permalink parent award report block reply Kolob64 2 points 3 days ago I remember my dad telling me about how his grandfather would rant and rave every time FDR came on the radio. permalink parent award report block reply HuggableBear 9 points 3 days ago And prices should be set. NO. ABSOLUTELY NOT. Have you learned nothing? \"We need government out of <X>, except for this one part where I want it involved.\" NOOOOOO. The government should stay out of it. COMPLETELY. That includes price controls, you idiot. You're asking for Communism from a different direction. Government's only function should be guard rails on the system to prevent fraud. Let the market set prices and the government's only function should be to prevent monopoly. Hospitals and doctors should be competing for your dollars with quality, and higher quality care and service should cost more, just like any other service. permalink parent award report block reply joggin_noggin 4 points 3 days ago Forcing companies to publicly list their prices and not hide them until the bill comes due is not over-burdensome government interference. It does not require the government to dictate the price for goods and services. All it does is remove the option for one healthcare company to screw prospective patients with gotcha fees. permalink parent award report block reply HuggableBear 2 points 2 days ago I apologize, I thought you meant prices should be set for services and be the same everywhere. Yes, prices should be publicly available and the same no matter how they are paid. permalink parent award report block reply AndanteAndante 6 points 3 days ago We had that growing up from my dads job. It was called Major Medical. permalink parent award report block reply Kolob64 4 points 3 days ago I had it until the ACA took over. permalink parent award report block reply\nzooty 10 points 3 days ago The current style of healthcare insurance comes from a time when companies were limited in the wages they could offer and had to come up with other ways to offer compensation to attract top employees. It's government interference all the way down. permalink parent award report block reply Kolob64 5 points 3 days ago I remember that.  Nixon's wage and price controls.  Not only did we self pay for most things, the doctors wee independent businesses and could say what they believed. permalink parent award report block reply joggin_noggin 2 points 3 days ago Nah, this started under crypto-fascist FDR, who limited direct monetary compensation and created the entire 'benefits' scheme. permalink parent award report block reply Kolob64 2 points 3 days ago I remember my dad telling me about how his grandfather would rant and rave every time FDR came on the radio. permalink parent award report block reply\nKolob64 5 points 3 days ago I remember that.  Nixon's wage and price controls.  Not only did we self pay for most things, the doctors wee independent businesses and could say what they believed. permalink parent award report block reply joggin_noggin 2 points 3 days ago Nah, this started under crypto-fascist FDR, who limited direct monetary compensation and created the entire 'benefits' scheme. permalink parent award report block reply Kolob64 2 points 3 days ago I remember my dad telling me about how his grandfather would rant and rave every time FDR came on the radio. permalink parent award report block reply\njoggin_noggin 2 points 3 days ago Nah, this started under crypto-fascist FDR, who limited direct monetary compensation and created the entire 'benefits' scheme. permalink parent award report block reply Kolob64 2 points 3 days ago I remember my dad telling me about how his grandfather would rant and rave every time FDR came on the radio. permalink parent award report block reply\nKolob64 2 points 3 days ago I remember my dad telling me about how his grandfather would rant and rave every time FDR came on the radio. permalink parent award report block reply\nHuggableBear 9 points 3 days ago And prices should be set. NO. ABSOLUTELY NOT. Have you learned nothing? \"We need government out of <X>, except for this one part where I want it involved.\" NOOOOOO. The government should stay out of it. COMPLETELY. That includes price controls, you idiot. You're asking for Communism from a different direction. Government's only function should be guard rails on the system to prevent fraud. Let the market set prices and the government's only function should be to prevent monopoly. Hospitals and doctors should be competing for your dollars with quality, and higher quality care and service should cost more, just like any other service. permalink parent award report block reply joggin_noggin 4 points 3 days ago Forcing companies to publicly list their prices and not hide them until the bill comes due is not over-burdensome government interference. It does not require the government to dictate the price for goods and services. All it does is remove the option for one healthcare company to screw prospective patients with gotcha fees. permalink parent award report block reply HuggableBear 2 points 2 days ago I apologize, I thought you meant prices should be set for services and be the same everywhere. Yes, prices should be publicly available and the same no matter how they are paid. permalink parent award report block reply\njoggin_noggin 4 points 3 days ago Forcing companies to publicly list their prices and not hide them until the bill comes due is not over-burdensome government interference. It does not require the government to dictate the price for goods and services. All it does is remove the option for one healthcare company to screw prospective patients with gotcha fees. permalink parent award report block reply HuggableBear 2 points 2 days ago I apologize, I thought you meant prices should be set for services and be the same everywhere. Yes, prices should be publicly available and the same no matter how they are paid. permalink parent award report block reply\nHuggableBear 2 points 2 days ago I apologize, I thought you meant prices should be set for services and be the same everywhere. Yes, prices should be publicly available and the same no matter how they are paid. permalink parent award report block reply\nAndanteAndante 6 points 3 days ago We had that growing up from my dads job. It was called Major Medical. permalink parent award report block reply Kolob64 4 points 3 days ago I had it until the ACA took over. permalink parent award report block reply\nKolob64 4 points 3 days ago I had it until the ACA took over. permalink parent award report block reply\nGreenhills 11 points 3 days ago The problem is, medical providers sign contracts with insurance companies forbidding them from allowing you to pay cash if you are insured. Trust me, I’ve tried it for this reason. Some wont even allow you to make an appt without proof of insurance. I thought trump signed an executive order Biden never overturned requiring providers and hospitals to provide transparent pricing. What a new law should require providers to show you the cash price for fixed procedures and tests. permalink award report block reply Datamancer 6 points 3 days ago Sounds like grounds for a 'tortious interference with contract' class action suit against all insurance companies in all markets. permalink parent award report block reply\nDatamancer 6 points 3 days ago Sounds like grounds for a 'tortious interference with contract' class action suit against all insurance companies in all markets. permalink parent award report block reply\nremindmelater 11 points 3 days ago Who would have figured that if they added a middleman/middlemen who wants to make a darned good living that the medical bill will be much much higher....? permalink award report block reply\nBBvarn 10 points 3 days ago Don't bitch to Trump about your healthcare. Bitch to Obama and your brown and black neighbors who get free healthcare. permalink award report block reply MastaJoda 9 points 3 days ago I'll bitch at whoever is in gov NOW who isnt doing their job and fixing that Obamanation. Obama cant fix it today. Gfy permalink parent award report block reply zooty 2 points 3 days ago Yeah, what's that going to accomplish? permalink parent award report block reply Nibba2 1 points 3 days ago Go watch the 2012 presidential debates. Mittens Romney was proposing the same dead. Almost identical. The uniparty was going to force it one way or another. permalink parent award report block reply\nMastaJoda 9 points 3 days ago I'll bitch at whoever is in gov NOW who isnt doing their job and fixing that Obamanation. Obama cant fix it today. Gfy permalink parent award report block reply\nzooty 2 points 3 days ago Yeah, what's that going to accomplish? permalink parent award report block reply\nNibba2 1 points 3 days ago Go watch the 2012 presidential debates. Mittens Romney was proposing the same dead. Almost identical. The uniparty was going to force it one way or another. permalink parent award report block reply\nTallGlassofMelonade 10 points 3 days ago My wife had cancer.   We self paid for most of her scans even though we had “good” insurance.  Didn’t go towards my high deductible but cash is cash. permalink award report block reply markolbb 10 points 3 days ago Hope she's okay now pede. permalink parent award report block reply\nmarkolbb 10 points 3 days ago Hope she's okay now pede. permalink parent award report block reply\nNoMoreShinesBilly 9 points 3 days ago fraud from the first page to the last page.  Everything that was said was a lie, including when it was greenlit by the supreme court with John Roberts as the lead bullshitter.  Next round - executive powers. permalink award report block reply\nRandoBudster 7 points 3 days ago ObamaCare wouldn't exist without McCain permalink award report block reply flyover_deplorable 3 points 3 days ago Don't forget Ben Nelson! permalink parent award report block reply RandoBudster 2 points 3 days ago And Chief Justice Roberts claiming the 'fine' for opt-out as just a  ' tax' so it was ok permalink parent award report block reply\nflyover_deplorable 3 points 3 days ago Don't forget Ben Nelson! permalink parent award report block reply RandoBudster 2 points 3 days ago And Chief Justice Roberts claiming the 'fine' for opt-out as just a  ' tax' so it was ok permalink parent award report block reply\nRandoBudster 2 points 3 days ago And Chief Justice Roberts claiming the 'fine' for opt-out as just a  ' tax' so it was ok permalink parent award report block reply\nLilaQuartermaine 6 points 3 days ago Obama Inc. successfully conflated 2 terms: Healthcare and Health Insurance. Healthcare is the delivery of goods and services to maintain health and heal ailments.\nHealth insurance is a financial instrument. permalink award report block reply\nempiretc 6 points 3 days ago yeah.... what was the problem with just having affordable walk-in clinics?  those do not seem to exist anymore. permalink award report block reply Kolob64 1 points 3 days ago They are all over Utah and we have them here in Nevada as well. permalink parent award report block reply\nKolob64 1 points 3 days ago They are all over Utah and we have them here in Nevada as well. permalink parent award report block reply\nSkabliggum2 6 points 3 days ago Not a single pajeet on any of those calls permalink award report block reply\nOldMule68 5 points 3 days ago We had good insurance for our family before ACA.  When our state finally adopted their rules, every insurance company fled the state and the marketplace was a nightmare.  We dropped it and did self pay with the Medi Share.  Never once used it, but it was in case of an emergency--car accident or cancer or something. Prayed a lot and God is good--didn't have a problem.  Saved us about 9K per year. permalink award report block reply Kolob64 6 points 3 days ago We have been on Medishare for over a decade now, have never used it.  We just pay cash for everything. permalink parent award report block reply\nKolob64 6 points 3 days ago We have been on Medishare for over a decade now, have never used it.  We just pay cash for everything. permalink parent award report block reply\nSouth_Florida_Guy 5 points 3 days ago There was nothing wrong with the healthcare insurance market before Obongo came along and ruined it. The only thing that ever needing fixing to make it better was to kick out all of the illegals from the county that used ERs like a McDonald's drive thru which drove up costs of the actual healthcare. Besides that it was perfectly affordable. permalink award report block reply\nRememberCharlieKirk 5 points 3 days ago Given that the wrongly titled Affordable Care Act was passed in 2010, how did Obama ever win his 2012 re-election? Did the true horrors of the Act occur years later? Were the high costs not felt immediately? permalink award report block reply Nameless_Mofo 5 points 3 days ago First of all, he won through voter fraud of course. Second, yes the true horrors (individual mandate and such) kicked in years later, as he was about to leave office. permalink parent award report block reply Kolob64 4 points 3 days ago Romney did the same in Mass which left them with a fiscal nightmare after he left office. permalink parent award report block reply AbrahamLincoln 4 points 3 days ago Romney ran against him and he sucks. permalink parent award report block reply\nNameless_Mofo 5 points 3 days ago First of all, he won through voter fraud of course. Second, yes the true horrors (individual mandate and such) kicked in years later, as he was about to leave office. permalink parent award report block reply Kolob64 4 points 3 days ago Romney did the same in Mass which left them with a fiscal nightmare after he left office. permalink parent award report block reply\nKolob64 4 points 3 days ago Romney did the same in Mass which left them with a fiscal nightmare after he left office. permalink parent award report block reply\nAbrahamLincoln 4 points 3 days ago Romney ran against him and he sucks. permalink parent award report block reply\nYodaBannon 3 points 3 days ago Obama really milked that shit like he saved the world with this bullshit. permalink award report block reply\nThisTrainHasNoBrakes 3 points 3 days ago ACA and insurance are bullshit, but so is this video.  She is knowingly comparing bill amount (which is high and always fake) to actual negotiated amount/allowable/expected to be paid.  Insurance will pay around the self pay amounts too after “discount”. permalink award report block reply SHILL_DETECTOR 2 points 3 days ago wrong permalink parent award report block reply ThisTrainHasNoBrakes 0 points 3 days ago You are clearly ignorant on how healthcare billing works so you probably shouldn’t be speaking on it permalink parent award report block reply SHILL_DETECTOR 0 points 3 days ago bitch! permalink parent award report block reply joggin_noggin 1 points 3 days ago Why is there 5x variance between nearby hospitals from the highest self-pay price to the lowest if hospitals aren't fake and gay? It's the same with prescriptions; when I was younger I drove to a pharmacy 90m away four times a year to pick up a prescription for $100 instead of $800 at the pharmacies in town. That's a broken market if ever there was one. permalink parent award report block reply ThisTrainHasNoBrakes 2 points 3 days ago Oh it’s absolutely a broken market, I build medical systems could teach a whole college course on it. The short version is because there is no real capitalist market because the payments are often divorced from the need for care.  And we are all “forced” into the market by “needing” insurance.  It’s all a scam. permalink parent award report block reply\nSHILL_DETECTOR 2 points 3 days ago wrong permalink parent award report block reply ThisTrainHasNoBrakes 0 points 3 days ago You are clearly ignorant on how healthcare billing works so you probably shouldn’t be speaking on it permalink parent award report block reply SHILL_DETECTOR 0 points 3 days ago bitch! permalink parent award report block reply\nThisTrainHasNoBrakes 0 points 3 days ago You are clearly ignorant on how healthcare billing works so you probably shouldn’t be speaking on it permalink parent award report block reply SHILL_DETECTOR 0 points 3 days ago bitch! permalink parent award report block reply\nSHILL_DETECTOR 0 points 3 days ago bitch! permalink parent award report block reply\njoggin_noggin 1 points 3 days ago Why is there 5x variance between nearby hospitals from the highest self-pay price to the lowest if hospitals aren't fake and gay? It's the same with prescriptions; when I was younger I drove to a pharmacy 90m away four times a year to pick up a prescription for $100 instead of $800 at the pharmacies in town. That's a broken market if ever there was one. permalink parent award report block reply ThisTrainHasNoBrakes 2 points 3 days ago Oh it’s absolutely a broken market, I build medical systems could teach a whole college course on it. The short version is because there is no real capitalist market because the payments are often divorced from the need for care.  And we are all “forced” into the market by “needing” insurance.  It’s all a scam. permalink parent award report block reply\nThisTrainHasNoBrakes 2 points 3 days ago Oh it’s absolutely a broken market, I build medical systems could teach a whole college course on it. The short version is because there is no real capitalist market because the payments are often divorced from the need for care.  And we are all “forced” into the market by “needing” insurance.  It’s all a scam. permalink parent award report block reply\nWozzing 3 points 3 days ago Healthcare would be a lot cheaper if every American didn’t spend a couple hundred dollars a month for medication just so they can remain fat.  Sure the insurance company pays for it, but that money is coming from somewhere. permalink award report block reply\nACActual 3 points 3 days ago Im quitting Insurance permalink award report block reply\nBasedBoyScout 3 points 3 days ago I liked how it was Obamacare when it was going to let you keep your doctor and lower your premiums. Then it was the Affordable Care Act when all that turned out to not be true. Then it somehow became Trumps fault in 2025 because he won't let Democrats subsidize infinite brown people. permalink award report block reply\nPsalm-118_24 3 points 3 days ago Insurance companies  and HOSPITALS.  If you're like our state, look around you at hospital expansion.  Our hospitals made a killing during covid, not only of patients but on their finances too.  Also, if all the illegals and freeloaders are removed from taxpayer funded programs, the rest of us will have our costs wgo down because we won't be  paying for the illegals/freeloaders. permalink award report block reply\nconservativefrank 3 points 3 days ago My insurance was $97 per month with a $2000 deductible and $4000 out of pocket limit before Obamacare. Today, it's $1600 per month with a $5000 deductible and $8000 out of pocket limit. Thanks Obamacare. At least I, a 58 year old single man, have maternity coverage. permalink award report block reply\nzooty 2 points 3 days ago The doctor will order something you maybe don't need, the insurance company will deny your claim and you'll be stuck with the bills for overpriced insurance and the services you wanted it to cover. permalink award report block reply\nlul_cheto 2 points 3 days ago A big reason for the discount is because insurance companies drag their feet and require tons of paperwork for doctors to get paid.. so if you pay out of pocket you eliminate the middle man saving the doctors a ton of money.. A friend helps run a company that's makes millions a year just buying debt off of doctors , paying the doctors up front and waiting for the insurance company to pay out years later.. One doctor sold them 6m in debt for 3million.. took 3 years for them to get the money. permalink award report block reply\nMaganifice7 2 points 3 days ago When they wanted me to pay $500 a month for health insurance, I said no. Still don't have insurance to this day. If it wasn't required for my mortgage or diving, I wouldn't have that either. permalink award report block reply\nOodles 2 points 3 days ago This will not change. The people pocketing all of this graft are the ones buying Congress to make sure this never changes Your congressional representative may tell you they will change this, but they are lying right to your face permalink award report block reply\nTPMJB 2 points 3 days ago It's weird shopping around for this type of thing because prices vary WILDLY between practices. I have a location near to me that deals in just MRIs and CT scans. MRI costs $250 self-pay, which I feel is reasonable. permalink award report block reply\nDwoj 2 points 3 days ago This statement is not wrong permalink award report block reply\ninvalid_data 2 points 3 days ago Novel concept, how about kicking out all the immigrants and watch how the cost of everything drops. We can still blow up Obama shit insurance but focus on the nation ending problem, the invasion. permalink award report block reply\nRuprechtThaMonkeyBoy 2 points 3 days ago Amazing permalink award report block reply\nhenri_derelicte 2 points 3 days ago One of the things we can do if we get rid of the filibuster is repeal the part of EMTALA that requires hospitals to provide service to whoever comes in, regardless of their ability to pay. Getting rid of that would drastically cut down the cost of care by literally killing off the freeloaders permalink award report block reply\ndburt2 1 points 3 days ago Car and house insurance is a scam too. permalink award report block reply\nFrmrAmericanRepublic 1 points 3 days ago I didn't pay a single dollar into NogCare. And I knew the moment they had a 'mandate' to force everyone into it that it was bullshit. Sorry if you had to for whatever reason, but fuck these communist faggots and all their fucking bullshit. permalink award report block reply\npresticus 1 points 3 days ago Before Obamacare i was paying about $50 a month for a catastrophic plan that had $1000 deductible, and a cost share after deductible where i only paid 20% upto a cap i forget after which the insurance paid 100%. After Obamacare the insurance company ended that plan and i went on the State exchange created by the ACA. I was paying $140ish a month for a plan that covered more stuff upfront but ultimately i would pay more out of pocket in the event if an emergency. By the time i found a job 4 years ago that offered health insurance i was paying $220 a month for plan on the exchange that was worse then the one i was forced to get due to Obamacare. Because of rising insurance costs last year my employer had to switch from a plan where they covered 100% of the monthly premium to a different plan where the employee has to pay 10% of the monthly and the out of pocket deductible doubled. permalink award report block reply\nStlpoolguy 1 points 3 days ago There's always been a huge cash discount.   I knew a carpenter that would pay cash for all medical services ( bar the emergency room) and then submit the paid receipt to the insurance company for reimbursement.  He just wanted to save his local some money.  This was mid-late 90's permalink award report block reply\nflp999 1 points 3 days ago We all hate SCAMS and SCAMMERS. DJT, declare an all out war on all SCAMS and SCAMMERS. permalink award report block reply\nNomad899 1 points 3 days ago And BHOle bought 3 beach properties permalink award report block reply\nPowerOfBlues 0 points 3 days ago Preventative medicine is a giant scam...... Anyone who goes for screenings is a cucked Normie People used to just live their lives without fretting over their freaking \"numbers\" If everyone was like me..... 80% of checkup doctors would have to close their offices within a year or two permalink award report block reply\nKlown_Kutz -1 points 3 days ago Lose this boomer mindset that corporations are our friends and all profit is good profit. “You will own nothing and be happy” didn’t come from government. It came from the private sector who would in fact benefit greatly from that idea permalink award report block reply\ncorporateshizer 1 points 3 days ago Comment removed by community filter, pending further review. permalink award report block reply"}