{"id": "1ARK591is9", "contents": "858 BBC chairman Samir Shah will apologize on Monday, expressing regret for misleading viewers by splicing together clips from Trump’s “Stop the Steal” rally posted 3 days ago by CounterStrike 43 comments award share download report block\n43 comments Sort by Top Top New Worst Old Save Lol_Garrus 58 points 3 days ago \"Samir Shah\" permalink award report block reply FusionBlack 27 points 3 days ago Interpretation -Street shitter. permalink parent award report block reply MAGAguitar 16 points 3 days ago That’s “Chairman Street Shitter” to you Sarr! permalink parent award report block reply SuperHonkey 7 points 3 days ago Aka, this guy: https://share.google/f14Qw8Ro8wSBYISOd permalink parent award report block reply behemoth887 5 points 3 days ago if he actually apologizes for lying he's immediately better than all libs though permalink parent award report block reply lispboy 8 points 3 days ago Dude like really? They've even infiltrated one of the biggest broadcasters in the world? permalink parent award report block reply Seldom_Seen_Kid 5 points 3 days ago Quit being over smart, saar permalink parent award report block reply Tookens 29 points 3 days ago No matter how much you hate the media, it isn't nearly enough. permalink award report block reply bigdickhangsright 10 points 3 days ago If we even hang 100 people for treason, the media should make up at least 20. permalink parent award report block reply PhilipeNegro 10 points 3 days ago YOU GOTTA PUMP THOSE NUMBERS UP permalink parent award report block reply Christineblaseyford 2 points 3 days ago Rookie numbers, millions should hang.  Media should make up at least 25%.  After a speedy trial obviously. permalink parent award report block reply Johnkimble111 2 points 3 days ago It’s bad enough the most media outlets are evil globalists, but the situation with the BBC (and the equivalents elewhere such as NPR, CBC, ABC (Australia)), is far worse. The entire justification for their existence and extortion of taxpayers is supposed “impartiality”. So not only are they being evil.by pushing endless lies, they’ve also completely breached their contract that allows them to exist and get funding. permalink parent award report block reply Im_Not_Rattled 22 points 3 days ago A half-baked, forced apology will never undo the damage that was done from the deliberate misinformation spewed by the MSM propaganda organizations. permalink award report block reply PhilipeNegro 3 points 3 days ago I’m thinking strategic drone strike permalink parent award report block reply brainphreeze 12 points 3 days ago Great too see propagandists bend the knee, the problem is it then gets used as a \"Trump fascist forces BBC to kiss the ring\" piece, accomplishes nothing Destroy them financially, take away their broadcasting rights The two biggest problems have still not been fixed at all: the media and corrupt partisan courts permalink award report block reply Rock9Head 10 points 3 days ago Kinda like a NYT retraction the next day on page 19. permalink award report block reply South_Florida_Guy 8 points 3 days ago Too late faggot, get your checkbook ready permalink award report block reply MAGA_APN 3 points 3 days ago Hope Trump sues for billions permalink parent award report block reply NotYourMan 7 points 3 days ago Without a law suit and millions lost due to this mistake, they will do it again.  Do not be fooled, an apology is worth nothing. permalink award report block reply the-new-style 7 points 3 days ago What about the 5 years of lies before then? permalink award report block reply Bohemyth_2 6 points 3 days ago BBC as in nwo permalink award report block reply Purple_Drank 5 points 3 days ago Too late faggot.  Damage has been done.  Lawyers up permalink award report block reply PearlyGaits57 5 points 3 days ago BBC, the equivalent CNN. Or maybe worse. Corruption to no end. permalink award report block reply MAGA_APN 3 points 3 days ago Worse because every person in UK pays a tv license fee which funds BBC- who like CNN claim to be fair and balanced but are really left wing hacks aka NPR permalink parent award report block reply Senaleb 5 points 3 days ago apology not accepted. Ban them from entering the US ...ever. permalink award report block reply CounterStrike OP 4 points 3 days ago https://nypost.com/2025/11/08/world-news/bbc-expected-to-apologize-after-using-doctored-footage-of-trumps-jan-6-speech-in-documentary-report/ permalink award report block reply JoeBidensDementia1 4 points 3 days ago Feel free to resign and then deport back to whatever shithole you came from. permalink award report block reply Oodles 4 points 3 days ago MSM propaganda strategy Damage done = 10 Apology mitigation = 2 Net damage done = 8 Rinse and repeat permalink award report block reply Patrick_Bateman 3 points 3 days ago In the newspaper biz this used to be accomplished by printing the lie on the front page and burying the ensuing retraction in the middle. Probably still happens that way for the 9 people still getting papers delivered. 😂 permalink parent award report block reply Riehlpissed 2 points 3 days ago Bury Shamir and stone him. permalink award report block reply Bboop 2 points 3 days ago Gasp! A Muslim did that?! permalink award report block reply Easzq8 2 points 3 days ago I can’t imagine how someone name Samir Shah could ever be dishonest! permalink award report block reply weltallic 2 points 3 days ago They knew they would have to apologise.  They didn't care. The doctored footage was seen and shared by 100,000% more people than the apology will be. They got the result they wanted.  A bell cannot be unrung. \"Call the police; they can't unrape you.\" permalink award report block reply Deplorable556 2 points 3 days ago lawsuit time! take everything including his riding lawn mower permalink award report block reply MasterChief08 2 points 3 days ago Fuck these people. I want them gone permalink award report block reply LibtardBusterMAGA 1 points 3 days ago Trump should sue them into oblivion permalink award report block reply 16BeatsAOne 1 points 3 days ago Apology?  Meh. The big question is -- will the BBC write a check more than or less than $100M to the GEOTUS Presidential Library? permalink award report block reply Oodles 1 points 3 days ago Shah was born in Aurangabad, India There used to be your problem permalink award report block reply Datamancer 1 points 3 days ago Fuck apologies, hang him in the Tower. permalink award report block reply Michalusmichalus 1 points 3 days ago Sue them. permalink award report block reply VirtusHonos 1 points 3 days ago Sue BBC for defamation and fraud, duh - Samir's apology will be worth bupkis permalink award report block reply FailSayf 1 points 3 days ago That’s it?!? No punishment? permalink award report block reply\nLol_Garrus 58 points 3 days ago \"Samir Shah\" permalink award report block reply FusionBlack 27 points 3 days ago Interpretation -Street shitter. permalink parent award report block reply MAGAguitar 16 points 3 days ago That’s “Chairman Street Shitter” to you Sarr! permalink parent award report block reply SuperHonkey 7 points 3 days ago Aka, this guy: https://share.google/f14Qw8Ro8wSBYISOd permalink parent award report block reply behemoth887 5 points 3 days ago if he actually apologizes for lying he's immediately better than all libs though permalink parent award report block reply lispboy 8 points 3 days ago Dude like really? They've even infiltrated one of the biggest broadcasters in the world? permalink parent award report block reply Seldom_Seen_Kid 5 points 3 days ago Quit being over smart, saar permalink parent award report block reply\nFusionBlack 27 points 3 days ago Interpretation -Street shitter. permalink parent award report block reply MAGAguitar 16 points 3 days ago That’s “Chairman Street Shitter” to you Sarr! permalink parent award report block reply SuperHonkey 7 points 3 days ago Aka, this guy: https://share.google/f14Qw8Ro8wSBYISOd permalink parent award report block reply behemoth887 5 points 3 days ago if he actually apologizes for lying he's immediately better than all libs though permalink parent award report block reply\nMAGAguitar 16 points 3 days ago That’s “Chairman Street Shitter” to you Sarr! permalink parent award report block reply\nSuperHonkey 7 points 3 days ago Aka, this guy: https://share.google/f14Qw8Ro8wSBYISOd permalink parent award report block reply\nbehemoth887 5 points 3 days ago if he actually apologizes for lying he's immediately better than all libs though permalink parent award report block reply\nlispboy 8 points 3 days ago Dude like really? They've even infiltrated one of the biggest broadcasters in the world? permalink parent award report block reply\nSeldom_Seen_Kid 5 points 3 days ago Quit being over smart, saar permalink parent award report block reply\nTookens 29 points 3 days ago No matter how much you hate the media, it isn't nearly enough. permalink award report block reply bigdickhangsright 10 points 3 days ago If we even hang 100 people for treason, the media should make up at least 20. permalink parent award report block reply PhilipeNegro 10 points 3 days ago YOU GOTTA PUMP THOSE NUMBERS UP permalink parent award report block reply Christineblaseyford 2 points 3 days ago Rookie numbers, millions should hang.  Media should make up at least 25%.  After a speedy trial obviously. permalink parent award report block reply Johnkimble111 2 points 3 days ago It’s bad enough the most media outlets are evil globalists, but the situation with the BBC (and the equivalents elewhere such as NPR, CBC, ABC (Australia)), is far worse. The entire justification for their existence and extortion of taxpayers is supposed “impartiality”. So not only are they being evil.by pushing endless lies, they’ve also completely breached their contract that allows them to exist and get funding. permalink parent award report block reply\nbigdickhangsright 10 points 3 days ago If we even hang 100 people for treason, the media should make up at least 20. permalink parent award report block reply PhilipeNegro 10 points 3 days ago YOU GOTTA PUMP THOSE NUMBERS UP permalink parent award report block reply Christineblaseyford 2 points 3 days ago Rookie numbers, millions should hang.  Media should make up at least 25%.  After a speedy trial obviously. permalink parent award report block reply\nPhilipeNegro 10 points 3 days ago YOU GOTTA PUMP THOSE NUMBERS UP permalink parent award report block reply Christineblaseyford 2 points 3 days ago Rookie numbers, millions should hang.  Media should make up at least 25%.  After a speedy trial obviously. permalink parent award report block reply\nChristineblaseyford 2 points 3 days ago Rookie numbers, millions should hang.  Media should make up at least 25%.  After a speedy trial obviously. permalink parent award report block reply\nJohnkimble111 2 points 3 days ago It’s bad enough the most media outlets are evil globalists, but the situation with the BBC (and the equivalents elewhere such as NPR, CBC, ABC (Australia)), is far worse. The entire justification for their existence and extortion of taxpayers is supposed “impartiality”. So not only are they being evil.by pushing endless lies, they’ve also completely breached their contract that allows them to exist and get funding. permalink parent award report block reply\nIm_Not_Rattled 22 points 3 days ago A half-baked, forced apology will never undo the damage that was done from the deliberate misinformation spewed by the MSM propaganda organizations. permalink award report block reply PhilipeNegro 3 points 3 days ago I’m thinking strategic drone strike permalink parent award report block reply\nPhilipeNegro 3 points 3 days ago I’m thinking strategic drone strike permalink parent award report block reply\nbrainphreeze 12 points 3 days ago Great too see propagandists bend the knee, the problem is it then gets used as a \"Trump fascist forces BBC to kiss the ring\" piece, accomplishes nothing Destroy them financially, take away their broadcasting rights The two biggest problems have still not been fixed at all: the media and corrupt partisan courts permalink award report block reply\nRock9Head 10 points 3 days ago Kinda like a NYT retraction the next day on page 19. permalink award report block reply\nSouth_Florida_Guy 8 points 3 days ago Too late faggot, get your checkbook ready permalink award report block reply MAGA_APN 3 points 3 days ago Hope Trump sues for billions permalink parent award report block reply\nMAGA_APN 3 points 3 days ago Hope Trump sues for billions permalink parent award report block reply\nNotYourMan 7 points 3 days ago Without a law suit and millions lost due to this mistake, they will do it again.  Do not be fooled, an apology is worth nothing. permalink award report block reply\nthe-new-style 7 points 3 days ago What about the 5 years of lies before then? permalink award report block reply\nBohemyth_2 6 points 3 days ago BBC as in nwo permalink award report block reply\nPurple_Drank 5 points 3 days ago Too late faggot.  Damage has been done.  Lawyers up permalink award report block reply\nPearlyGaits57 5 points 3 days ago BBC, the equivalent CNN. Or maybe worse. Corruption to no end. permalink award report block reply MAGA_APN 3 points 3 days ago Worse because every person in UK pays a tv license fee which funds BBC- who like CNN claim to be fair and balanced but are really left wing hacks aka NPR permalink parent award report block reply\nMAGA_APN 3 points 3 days ago Worse because every person in UK pays a tv license fee which funds BBC- who like CNN claim to be fair and balanced but are really left wing hacks aka NPR permalink parent award report block reply\nSenaleb 5 points 3 days ago apology not accepted. Ban them from entering the US ...ever. permalink award report block reply\nCounterStrike OP 4 points 3 days ago https://nypost.com/2025/11/08/world-news/bbc-expected-to-apologize-after-using-doctored-footage-of-trumps-jan-6-speech-in-documentary-report/ permalink award report block reply\nJoeBidensDementia1 4 points 3 days ago Feel free to resign and then deport back to whatever shithole you came from. permalink award report block reply\nOodles 4 points 3 days ago MSM propaganda strategy Damage done = 10 Apology mitigation = 2 Net damage done = 8 Rinse and repeat permalink award report block reply Patrick_Bateman 3 points 3 days ago In the newspaper biz this used to be accomplished by printing the lie on the front page and burying the ensuing retraction in the middle. Probably still happens that way for the 9 people still getting papers delivered. 😂 permalink parent award report block reply\nPatrick_Bateman 3 points 3 days ago In the newspaper biz this used to be accomplished by printing the lie on the front page and burying the ensuing retraction in the middle. Probably still happens that way for the 9 people still getting papers delivered. 😂 permalink parent award report block reply\nRiehlpissed 2 points 3 days ago Bury Shamir and stone him. permalink award report block reply\nBboop 2 points 3 days ago Gasp! A Muslim did that?! permalink award report block reply\nEaszq8 2 points 3 days ago I can’t imagine how someone name Samir Shah could ever be dishonest! permalink award report block reply\nweltallic 2 points 3 days ago They knew they would have to apologise.  They didn't care. The doctored footage was seen and shared by 100,000% more people than the apology will be. They got the result they wanted.  A bell cannot be unrung. \"Call the police; they can't unrape you.\" permalink award report block reply\nDeplorable556 2 points 3 days ago lawsuit time! take everything including his riding lawn mower permalink award report block reply\nMasterChief08 2 points 3 days ago Fuck these people. I want them gone permalink award report block reply\nLibtardBusterMAGA 1 points 3 days ago Trump should sue them into oblivion permalink award report block reply\n16BeatsAOne 1 points 3 days ago Apology?  Meh. The big question is -- will the BBC write a check more than or less than $100M to the GEOTUS Presidential Library? permalink award report block reply\nOodles 1 points 3 days ago Shah was born in Aurangabad, India There used to be your problem permalink award report block reply\nDatamancer 1 points 3 days ago Fuck apologies, hang him in the Tower. permalink award report block reply\nMichalusmichalus 1 points 3 days ago Sue them. permalink award report block reply\nVirtusHonos 1 points 3 days ago Sue BBC for defamation and fraud, duh - Samir's apology will be worth bupkis permalink award report block reply\nFailSayf 1 points 3 days ago That’s it?!? No punishment? permalink award report block reply"}