{"id": "1ARK56j11R", "contents": "571 \"In 12 years, I'll kill him,\" said the son of the victim after the verdict. posted 5 days ago by CyanScales 66 comments award share report block Defiant L’s @DefiantLs • 6d Italian family reaction after court announces an illegal migrant will get only 12 years after he slit the throat of their family member, leaving him to die on the street. \"In 12 years, I'll kill him,\" said the son of the victim after the verdict.\n66 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style gaijin_ronin 88 points 5 days ago The judge or who ever decided the verdict should get it too. permalink award report block reply SanityGumby 55 points 5 days ago I’m fact he should make sure to kill the judge first just in case he doesn’t get to the second person. The judge deserves it far more for betraying the people than the nignog that was let in. But hopefully he gets both. permalink parent award report block reply gaijin_ronin 23 points 5 days ago These rouge and retarded judges need consequences.  They get away with more than corrupt cops. permalink parent award report block reply SicSemperTyrannis2 16 points 4 days ago What about Judges who don't use rouge? permalink parent award report block reply I_Love_45-70_Gov 9 points 4 days ago Yeah. They run around and mascara like they are judges, but their fantasy does not match peel life.. The Foundation Fathers are rolling in their graves right now. permalink parent award report block reply view 1 more comments... Samuel_L_Bronkowitz 2 points 4 days ago Kek permalink parent award report block reply gaijin_ronin 1 points 4 days ago I hate touchscreens on the go. permalink parent award report block reply Moose_Antlers 15 points 5 days ago When the judiciary fails to deliver satisfaction people will PAY for it to be delivered for them. This is indeed, the origin story of the Italian mafia. permalink parent award report block reply SicSemperTyrannis2 -4 points 4 days ago You don't know anything. Mafia is a Sicilian invention. permalink parent award report block reply HumblePepe 5 points 5 days ago Amd the entire family of the killer, tbh. permalink parent award report block reply SicSemperTyrannis2 2 points 4 days ago Judge is more significant! permalink parent award report block reply Burneraccountno4 4 points 4 days ago At this point the judge is far more dangerous than the killer. At least the killer will be locked up in jail for a few years, unable to reoffend. During that same time this judge will have gone soft on hundreds of other violent criminals, resulting in hundreds if not thousands of additional victims. permalink parent award report block reply StCharlie 3 points 4 days ago We build a website.  We track the illegal murders.  We add the families contact information.  We help them \"resolve\" their anguish.  I think there are many Americans willing to \"help\".  The site will for supporting the families financially and offering support for \"handling\" what the victim did to the family.  Can anyone help me build a list of sites that track this information about where the events occur, who was involved, etc?  I'd like to take the first steps to help these families to get the respected response they deserve. permalink parent award report block reply Litecola2 2 points 4 days ago The website should be for helping offer thoughts and prayers for the victims and the offenders with details and fundraising for the victims' families. Random strangers can help the families in many ways, but first, prayer. permalink parent award report block reply CheeseAndOnion 43 points 5 days ago We should not have to live with sub human scum in our socities.  Bring back executions for crimes like this. And be firm with the sub humsn garbage already here. Give them a choice to leave on their own or be put in a hole. permalink award report block reply impera 34 points 5 days ago There is a timeframe when people give the justice system a chance to function as it ought to. And if it continues to fail, these chances run out. Criminals will start being found dead rather than getting merely held in place until police arrive to take them away. And people will remember the names and faces of the police chiefs and judges who chose to aid the terrorists rather than do their jobs. permalink parent award report block reply CyanScales OP 21 points 5 days ago If someone raped my daughter (I don't have one) there is no way I could live in the same planet with them. permalink parent award report block reply SicSemperTyrannis2 4 points 4 days ago \"If\" it continues to fail?!? Wtf, doing your best ostrich impersonation? Judges need to hang ... permalink parent award report block reply impera 5 points 4 days ago Not disagreeing that they need to hang. But the question hanging in the air is this - like with the china virus, with doctors doing stupid and criminal acts in harmony with their governments, all using the same messaging and lies all at the same time clearly shows terrorist and mass murder collusion. And we probably have a very good guess as to the terrorist groups and figureheads for which the treasonous world leaders subscribe to for this ideology. Who is coordinating judges and police and law enforcement and governments all over the western world to conduct terrorist operations against their citizens using enemy foreigners as the weapon? The same names who did the same thing with the china virus? You dont hang the lower totem-pole thugs and brutes without getting the identity of their command and higher ups first, by any way you can extract this information. permalink parent award report block reply SicSemperTyrannis2 1 points 4 days ago Who? Cuomo was the first to enforce restricting medicine from sick people who needed it. 40+ Governors followed his precedent. Lockdowns started on April Fool's Day, 2020. The public cooperated with this on the basis of it only being for two weeks, which would have ended on 4/15. When that didn't happen, We the People had the duty to remove 40+ Governors from Office, physically. All anybody here would talk about is \"if you do that they'll shoot you!\" So what? It's exactly what watering the tree of liberty requires. Why do you think the Summer of love began on Memorial Day, with professional protests already organized, in place, and ready to go? It put a hard time limit on our ability to do this. We are not in a stronger position now. Doctors and those actually delivering medical care to people aren't the ones who imposed the tyranny, government officials and hospital administrators were. Fauci on top. His crimes were the same as what he did to turn AIDS into an epidemic. State medical boards were used as an excuse by most Governors; almost gotta respect Cuomo and Whitmer for at least taking responsibility for their actions instead of hiding behind medical boards like everyone else. Noem single handedly put a stop to it in her State. permalink parent award report block reply TearsAficionado 2 points 4 days ago The time frame is too slow. permalink parent award report block reply StCharlie 4 points 4 days ago I hate to say it, but every time this happens there should be an outpouring of people that reach out to the family.  Many people would like to help these families financially or \"otherwise\".  There are many sites that show layoffs.  We need to build a site that shows illegal murders and how to contact the victims family.  I'm not explicitly saying people would want to help you \"resolve\" the outcome, but there are many people that would like to \"help\". permalink parent award report block reply Mintap 37 points 5 days ago Kill him now. Save 12 years. permalink award report block reply CyanScales OP 12 points 5 days ago Saves tax money. permalink parent award report block reply BlokeyMcBlokeFace 12 points 5 days ago This is valid. Anyone who sheds the blood of a human being, by a human being shall that one’s blood be shed; For in the image of God have human beings been made. https://bible.usccb.org/bible/genesis/9 permalink parent award report block reply Dangerous 8 points 5 days ago Right now he is protected by the state so he isn't able to kill him permalink parent award report block reply FrensInLowPlaces 4 points 5 days ago Technically it saves 24 years cuz the son wouldnt have to do his 12. permalink parent award report block reply StCharlie 0 points 4 days ago We add the families contact information. We help them \"resolve\" their anguish. I think there are many Americans willing to \"help\". The site will for supporting the families financially and offering support for \"handling\" what the victim did to the family. Can anyone help me build a list of sites that track this information about where the events occur, who was involved, etc? I'd like to take the first steps to help these families to get the respected response they deserve permalink parent award report block reply zooty 19 points 5 days ago \"Vendetta\" is an Italian word. permalink award report block reply HanginChad 19 points 5 days ago Don't fucking announce it. permalink award report block reply SicSemperTyrannis2 6 points 4 days ago Yeah that part was stupid. Just kill the Judge. Maybe even leave a horse head on his bed? permalink parent award report block reply Shaffro 15 points 5 days ago Maybe some hero in prison will dispatch him, soon. permalink award report block reply LookFatty 5 points 5 days ago This i pray ... Forgive me Jesus permalink parent award report block reply Dem_slayer 15 points 5 days ago Of some migrant 3rd worlder killed one of my family members id get revenge on all of them. Not just the one responsible. permalink award report block reply TearsAficionado 1 points 4 days ago ^^^this is the way. permalink parent award report block reply AwShitHereWeGoAgain 9 points 5 days ago I volunteer for his jury. permalink award report block reply Gletkin 9 points 5 days ago Seems like nearly all the media coverage of violence is just about how the perpetrators are actually the victims and what they really need is compassion. As for the actual victims or their families... crickets. permalink award report block reply SicSemperTyrannis2 1 points 4 days ago I got your compassion right here! permalink parent award report block reply DragonEnergy2 7 points 5 days ago Best guess. The authorities will secretly release him early without notifying the family. permalink award report block reply bidensmissingbrain 5 points 5 days ago “The son of the victim is now serving a life sentence for ‘hate speech’….” permalink award report block reply Moebius 4 points 5 days ago Why wait.  Vendetta is easy in Italian Prisons...and the Giudice should get it too... \"Il decesso è avvenuto per cause naturali\" ... Meaning its natural to his bullshit verdict and sentence... permalink award report block reply BahamaDon 4 points 5 days ago It is the beginning of an all out unpunishable white genocide. permalink award report block reply TrumpAndGodWin 7 points 5 days ago Democrats orchestrated the genocide of White people, we are at stage 8 out of ten on the 'ten stages of genocide.' permalink parent award report block reply SicSemperTyrannis2 2 points 4 days ago Gotta link to that list? permalink parent award report block reply TrumpAndGodWin 2 points 4 days ago https://www.genocidewatch.com/tenstages permalink parent award report block reply SicSemperTyrannis2 -1 points 3 days ago :) Thanks for keeping this place great! permalink parent award report block reply GreyKnight 4 points 5 days ago …all…” Everyday I wonder theoretically how Frank Castle funded his food and ammunition supply… permalink award report block reply Counterwhat 3 points 4 days ago It's a Gary Plauché in reverse. A son pay srespect to his elders. permalink award report block reply KennyKetchem 3 points 5 days ago Fuck 12, I am robbing a bank and becoming his cellmate. I'll do it in 6 permalink award report block reply DJT4MoreYears 1 points 4 days ago Yeah, but the murderer \"transitioned\" to a girl while in prison and was transferred to an all female prison and is now freely raping women while you're still stuck in a cell with bubba. Sorry fren. permalink parent award report block reply AR_MAGA 3 points 5 days ago The Mafia family will take care of the illegal scum inside the jail. Just wait. permalink award report block reply SicSemperTyrannis2 3 points 4 days ago What about the Judge?!? permalink parent award report block reply Bastard 3 points 5 days ago Debt to society?  Paid. Debt to me?  Not even close. permalink award report block reply Txiribiton 2 points 4 days ago First I would kill the judge and the people who allowed that illegal in the US. permalink award report block reply glow-operator-2-0 1 points 4 days ago Natural reaction, but I wouldn't telegraph my plans to the world. permalink award report block reply EastTexasMadLad 1 points 4 days ago Kill that corrupt judge first permalink award report block reply RedFoxOnFire 1 points 4 days ago This is the way. Make the courts lock the murderers up for life, not for justice but for their own protection. permalink award report block reply mcoulton 1 points 4 days ago 12 years to plan the perfect crime permalink award report block reply mcoulton 1 points 4 days ago 12 years to build a dungeon in the woods permalink award report block reply Unboosted 1 points 4 days ago The murderer should have been executed permalink award report block reply mcoulton 1 points 4 days ago Thats why they had lynch mobs, to ensure justice permalink award report block reply CaJuN-Polak 1 points 4 days ago As soon as they are back on the street, either after release from jail or the court, they belong to US. permalink award report block reply HockeyMom4Trump 0 points 4 days ago Don’t wait 12 years. Put a hit on him in prison. permalink award report block reply USNVET71 -8 points 4 days ago This is the only way to correct this is frontier justice, these judges have no consequences. It doesn't affect them. So they just randomly pick a fucking number and go home. I'm glad this guy said that in 12 years this motherfucker is going to take a dirt nap. permalink award report block reply HoodooOperator 1 points 4 days ago Comment removed by community moderators. permalink award report block reply TheGoyimWhisperer 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply\ngaijin_ronin 88 points 5 days ago The judge or who ever decided the verdict should get it too. permalink award report block reply SanityGumby 55 points 5 days ago I’m fact he should make sure to kill the judge first just in case he doesn’t get to the second person. The judge deserves it far more for betraying the people than the nignog that was let in. But hopefully he gets both. permalink parent award report block reply gaijin_ronin 23 points 5 days ago These rouge and retarded judges need consequences.  They get away with more than corrupt cops. permalink parent award report block reply SicSemperTyrannis2 16 points 4 days ago What about Judges who don't use rouge? permalink parent award report block reply I_Love_45-70_Gov 9 points 4 days ago Yeah. They run around and mascara like they are judges, but their fantasy does not match peel life.. The Foundation Fathers are rolling in their graves right now. permalink parent award report block reply view 1 more comments... Samuel_L_Bronkowitz 2 points 4 days ago Kek permalink parent award report block reply gaijin_ronin 1 points 4 days ago I hate touchscreens on the go. permalink parent award report block reply Moose_Antlers 15 points 5 days ago When the judiciary fails to deliver satisfaction people will PAY for it to be delivered for them. This is indeed, the origin story of the Italian mafia. permalink parent award report block reply SicSemperTyrannis2 -4 points 4 days ago You don't know anything. Mafia is a Sicilian invention. permalink parent award report block reply HumblePepe 5 points 5 days ago Amd the entire family of the killer, tbh. permalink parent award report block reply SicSemperTyrannis2 2 points 4 days ago Judge is more significant! permalink parent award report block reply Burneraccountno4 4 points 4 days ago At this point the judge is far more dangerous than the killer. At least the killer will be locked up in jail for a few years, unable to reoffend. During that same time this judge will have gone soft on hundreds of other violent criminals, resulting in hundreds if not thousands of additional victims. permalink parent award report block reply StCharlie 3 points 4 days ago We build a website.  We track the illegal murders.  We add the families contact information.  We help them \"resolve\" their anguish.  I think there are many Americans willing to \"help\".  The site will for supporting the families financially and offering support for \"handling\" what the victim did to the family.  Can anyone help me build a list of sites that track this information about where the events occur, who was involved, etc?  I'd like to take the first steps to help these families to get the respected response they deserve. permalink parent award report block reply Litecola2 2 points 4 days ago The website should be for helping offer thoughts and prayers for the victims and the offenders with details and fundraising for the victims' families. Random strangers can help the families in many ways, but first, prayer. permalink parent award report block reply\nSanityGumby 55 points 5 days ago I’m fact he should make sure to kill the judge first just in case he doesn’t get to the second person. The judge deserves it far more for betraying the people than the nignog that was let in. But hopefully he gets both. permalink parent award report block reply gaijin_ronin 23 points 5 days ago These rouge and retarded judges need consequences.  They get away with more than corrupt cops. permalink parent award report block reply SicSemperTyrannis2 16 points 4 days ago What about Judges who don't use rouge? permalink parent award report block reply I_Love_45-70_Gov 9 points 4 days ago Yeah. They run around and mascara like they are judges, but their fantasy does not match peel life.. The Foundation Fathers are rolling in their graves right now. permalink parent award report block reply view 1 more comments... Samuel_L_Bronkowitz 2 points 4 days ago Kek permalink parent award report block reply gaijin_ronin 1 points 4 days ago I hate touchscreens on the go. permalink parent award report block reply\ngaijin_ronin 23 points 5 days ago These rouge and retarded judges need consequences.  They get away with more than corrupt cops. permalink parent award report block reply SicSemperTyrannis2 16 points 4 days ago What about Judges who don't use rouge? permalink parent award report block reply I_Love_45-70_Gov 9 points 4 days ago Yeah. They run around and mascara like they are judges, but their fantasy does not match peel life.. The Foundation Fathers are rolling in their graves right now. permalink parent award report block reply view 1 more comments... Samuel_L_Bronkowitz 2 points 4 days ago Kek permalink parent award report block reply gaijin_ronin 1 points 4 days ago I hate touchscreens on the go. permalink parent award report block reply\nSicSemperTyrannis2 16 points 4 days ago What about Judges who don't use rouge? permalink parent award report block reply I_Love_45-70_Gov 9 points 4 days ago Yeah. They run around and mascara like they are judges, but their fantasy does not match peel life.. The Foundation Fathers are rolling in their graves right now. permalink parent award report block reply view 1 more comments... Samuel_L_Bronkowitz 2 points 4 days ago Kek permalink parent award report block reply gaijin_ronin 1 points 4 days ago I hate touchscreens on the go. permalink parent award report block reply\nI_Love_45-70_Gov 9 points 4 days ago Yeah. They run around and mascara like they are judges, but their fantasy does not match peel life.. The Foundation Fathers are rolling in their graves right now. permalink parent award report block reply view 1 more comments...\nSamuel_L_Bronkowitz 2 points 4 days ago Kek permalink parent award report block reply\ngaijin_ronin 1 points 4 days ago I hate touchscreens on the go. permalink parent award report block reply\nMoose_Antlers 15 points 5 days ago When the judiciary fails to deliver satisfaction people will PAY for it to be delivered for them. This is indeed, the origin story of the Italian mafia. permalink parent award report block reply SicSemperTyrannis2 -4 points 4 days ago You don't know anything. Mafia is a Sicilian invention. permalink parent award report block reply\nSicSemperTyrannis2 -4 points 4 days ago You don't know anything. Mafia is a Sicilian invention. permalink parent award report block reply\nHumblePepe 5 points 5 days ago Amd the entire family of the killer, tbh. permalink parent award report block reply SicSemperTyrannis2 2 points 4 days ago Judge is more significant! permalink parent award report block reply\nSicSemperTyrannis2 2 points 4 days ago Judge is more significant! permalink parent award report block reply\nBurneraccountno4 4 points 4 days ago At this point the judge is far more dangerous than the killer. At least the killer will be locked up in jail for a few years, unable to reoffend. During that same time this judge will have gone soft on hundreds of other violent criminals, resulting in hundreds if not thousands of additional victims. permalink parent award report block reply\nStCharlie 3 points 4 days ago We build a website.  We track the illegal murders.  We add the families contact information.  We help them \"resolve\" their anguish.  I think there are many Americans willing to \"help\".  The site will for supporting the families financially and offering support for \"handling\" what the victim did to the family.  Can anyone help me build a list of sites that track this information about where the events occur, who was involved, etc?  I'd like to take the first steps to help these families to get the respected response they deserve. permalink parent award report block reply Litecola2 2 points 4 days ago The website should be for helping offer thoughts and prayers for the victims and the offenders with details and fundraising for the victims' families. Random strangers can help the families in many ways, but first, prayer. permalink parent award report block reply\nLitecola2 2 points 4 days ago The website should be for helping offer thoughts and prayers for the victims and the offenders with details and fundraising for the victims' families. Random strangers can help the families in many ways, but first, prayer. permalink parent award report block reply\nCheeseAndOnion 43 points 5 days ago We should not have to live with sub human scum in our socities.  Bring back executions for crimes like this. And be firm with the sub humsn garbage already here. Give them a choice to leave on their own or be put in a hole. permalink award report block reply impera 34 points 5 days ago There is a timeframe when people give the justice system a chance to function as it ought to. And if it continues to fail, these chances run out. Criminals will start being found dead rather than getting merely held in place until police arrive to take them away. And people will remember the names and faces of the police chiefs and judges who chose to aid the terrorists rather than do their jobs. permalink parent award report block reply CyanScales OP 21 points 5 days ago If someone raped my daughter (I don't have one) there is no way I could live in the same planet with them. permalink parent award report block reply SicSemperTyrannis2 4 points 4 days ago \"If\" it continues to fail?!? Wtf, doing your best ostrich impersonation? Judges need to hang ... permalink parent award report block reply impera 5 points 4 days ago Not disagreeing that they need to hang. But the question hanging in the air is this - like with the china virus, with doctors doing stupid and criminal acts in harmony with their governments, all using the same messaging and lies all at the same time clearly shows terrorist and mass murder collusion. And we probably have a very good guess as to the terrorist groups and figureheads for which the treasonous world leaders subscribe to for this ideology. Who is coordinating judges and police and law enforcement and governments all over the western world to conduct terrorist operations against their citizens using enemy foreigners as the weapon? The same names who did the same thing with the china virus? You dont hang the lower totem-pole thugs and brutes without getting the identity of their command and higher ups first, by any way you can extract this information. permalink parent award report block reply SicSemperTyrannis2 1 points 4 days ago Who? Cuomo was the first to enforce restricting medicine from sick people who needed it. 40+ Governors followed his precedent. Lockdowns started on April Fool's Day, 2020. The public cooperated with this on the basis of it only being for two weeks, which would have ended on 4/15. When that didn't happen, We the People had the duty to remove 40+ Governors from Office, physically. All anybody here would talk about is \"if you do that they'll shoot you!\" So what? It's exactly what watering the tree of liberty requires. Why do you think the Summer of love began on Memorial Day, with professional protests already organized, in place, and ready to go? It put a hard time limit on our ability to do this. We are not in a stronger position now. Doctors and those actually delivering medical care to people aren't the ones who imposed the tyranny, government officials and hospital administrators were. Fauci on top. His crimes were the same as what he did to turn AIDS into an epidemic. State medical boards were used as an excuse by most Governors; almost gotta respect Cuomo and Whitmer for at least taking responsibility for their actions instead of hiding behind medical boards like everyone else. Noem single handedly put a stop to it in her State. permalink parent award report block reply TearsAficionado 2 points 4 days ago The time frame is too slow. permalink parent award report block reply StCharlie 4 points 4 days ago I hate to say it, but every time this happens there should be an outpouring of people that reach out to the family.  Many people would like to help these families financially or \"otherwise\".  There are many sites that show layoffs.  We need to build a site that shows illegal murders and how to contact the victims family.  I'm not explicitly saying people would want to help you \"resolve\" the outcome, but there are many people that would like to \"help\". permalink parent award report block reply\nimpera 34 points 5 days ago There is a timeframe when people give the justice system a chance to function as it ought to. And if it continues to fail, these chances run out. Criminals will start being found dead rather than getting merely held in place until police arrive to take them away. And people will remember the names and faces of the police chiefs and judges who chose to aid the terrorists rather than do their jobs. permalink parent award report block reply CyanScales OP 21 points 5 days ago If someone raped my daughter (I don't have one) there is no way I could live in the same planet with them. permalink parent award report block reply SicSemperTyrannis2 4 points 4 days ago \"If\" it continues to fail?!? Wtf, doing your best ostrich impersonation? Judges need to hang ... permalink parent award report block reply impera 5 points 4 days ago Not disagreeing that they need to hang. But the question hanging in the air is this - like with the china virus, with doctors doing stupid and criminal acts in harmony with their governments, all using the same messaging and lies all at the same time clearly shows terrorist and mass murder collusion. And we probably have a very good guess as to the terrorist groups and figureheads for which the treasonous world leaders subscribe to for this ideology. Who is coordinating judges and police and law enforcement and governments all over the western world to conduct terrorist operations against their citizens using enemy foreigners as the weapon? The same names who did the same thing with the china virus? You dont hang the lower totem-pole thugs and brutes without getting the identity of their command and higher ups first, by any way you can extract this information. permalink parent award report block reply SicSemperTyrannis2 1 points 4 days ago Who? Cuomo was the first to enforce restricting medicine from sick people who needed it. 40+ Governors followed his precedent. Lockdowns started on April Fool's Day, 2020. The public cooperated with this on the basis of it only being for two weeks, which would have ended on 4/15. When that didn't happen, We the People had the duty to remove 40+ Governors from Office, physically. All anybody here would talk about is \"if you do that they'll shoot you!\" So what? It's exactly what watering the tree of liberty requires. Why do you think the Summer of love began on Memorial Day, with professional protests already organized, in place, and ready to go? It put a hard time limit on our ability to do this. We are not in a stronger position now. Doctors and those actually delivering medical care to people aren't the ones who imposed the tyranny, government officials and hospital administrators were. Fauci on top. His crimes were the same as what he did to turn AIDS into an epidemic. State medical boards were used as an excuse by most Governors; almost gotta respect Cuomo and Whitmer for at least taking responsibility for their actions instead of hiding behind medical boards like everyone else. Noem single handedly put a stop to it in her State. permalink parent award report block reply TearsAficionado 2 points 4 days ago The time frame is too slow. permalink parent award report block reply\nCyanScales OP 21 points 5 days ago If someone raped my daughter (I don't have one) there is no way I could live in the same planet with them. permalink parent award report block reply\nSicSemperTyrannis2 4 points 4 days ago \"If\" it continues to fail?!? Wtf, doing your best ostrich impersonation? Judges need to hang ... permalink parent award report block reply impera 5 points 4 days ago Not disagreeing that they need to hang. But the question hanging in the air is this - like with the china virus, with doctors doing stupid and criminal acts in harmony with their governments, all using the same messaging and lies all at the same time clearly shows terrorist and mass murder collusion. And we probably have a very good guess as to the terrorist groups and figureheads for which the treasonous world leaders subscribe to for this ideology. Who is coordinating judges and police and law enforcement and governments all over the western world to conduct terrorist operations against their citizens using enemy foreigners as the weapon? The same names who did the same thing with the china virus? You dont hang the lower totem-pole thugs and brutes without getting the identity of their command and higher ups first, by any way you can extract this information. permalink parent award report block reply SicSemperTyrannis2 1 points 4 days ago Who? Cuomo was the first to enforce restricting medicine from sick people who needed it. 40+ Governors followed his precedent. Lockdowns started on April Fool's Day, 2020. The public cooperated with this on the basis of it only being for two weeks, which would have ended on 4/15. When that didn't happen, We the People had the duty to remove 40+ Governors from Office, physically. All anybody here would talk about is \"if you do that they'll shoot you!\" So what? It's exactly what watering the tree of liberty requires. Why do you think the Summer of love began on Memorial Day, with professional protests already organized, in place, and ready to go? It put a hard time limit on our ability to do this. We are not in a stronger position now. Doctors and those actually delivering medical care to people aren't the ones who imposed the tyranny, government officials and hospital administrators were. Fauci on top. His crimes were the same as what he did to turn AIDS into an epidemic. State medical boards were used as an excuse by most Governors; almost gotta respect Cuomo and Whitmer for at least taking responsibility for their actions instead of hiding behind medical boards like everyone else. Noem single handedly put a stop to it in her State. permalink parent award report block reply\nimpera 5 points 4 days ago Not disagreeing that they need to hang. But the question hanging in the air is this - like with the china virus, with doctors doing stupid and criminal acts in harmony with their governments, all using the same messaging and lies all at the same time clearly shows terrorist and mass murder collusion. And we probably have a very good guess as to the terrorist groups and figureheads for which the treasonous world leaders subscribe to for this ideology. Who is coordinating judges and police and law enforcement and governments all over the western world to conduct terrorist operations against their citizens using enemy foreigners as the weapon? The same names who did the same thing with the china virus? You dont hang the lower totem-pole thugs and brutes without getting the identity of their command and higher ups first, by any way you can extract this information. permalink parent award report block reply SicSemperTyrannis2 1 points 4 days ago Who? Cuomo was the first to enforce restricting medicine from sick people who needed it. 40+ Governors followed his precedent. Lockdowns started on April Fool's Day, 2020. The public cooperated with this on the basis of it only being for two weeks, which would have ended on 4/15. When that didn't happen, We the People had the duty to remove 40+ Governors from Office, physically. All anybody here would talk about is \"if you do that they'll shoot you!\" So what? It's exactly what watering the tree of liberty requires. Why do you think the Summer of love began on Memorial Day, with professional protests already organized, in place, and ready to go? It put a hard time limit on our ability to do this. We are not in a stronger position now. Doctors and those actually delivering medical care to people aren't the ones who imposed the tyranny, government officials and hospital administrators were. Fauci on top. His crimes were the same as what he did to turn AIDS into an epidemic. State medical boards were used as an excuse by most Governors; almost gotta respect Cuomo and Whitmer for at least taking responsibility for their actions instead of hiding behind medical boards like everyone else. Noem single handedly put a stop to it in her State. permalink parent award report block reply\nSicSemperTyrannis2 1 points 4 days ago Who? Cuomo was the first to enforce restricting medicine from sick people who needed it. 40+ Governors followed his precedent. Lockdowns started on April Fool's Day, 2020. The public cooperated with this on the basis of it only being for two weeks, which would have ended on 4/15. When that didn't happen, We the People had the duty to remove 40+ Governors from Office, physically. All anybody here would talk about is \"if you do that they'll shoot you!\" So what? It's exactly what watering the tree of liberty requires. Why do you think the Summer of love began on Memorial Day, with professional protests already organized, in place, and ready to go? It put a hard time limit on our ability to do this. We are not in a stronger position now. Doctors and those actually delivering medical care to people aren't the ones who imposed the tyranny, government officials and hospital administrators were. Fauci on top. His crimes were the same as what he did to turn AIDS into an epidemic. State medical boards were used as an excuse by most Governors; almost gotta respect Cuomo and Whitmer for at least taking responsibility for their actions instead of hiding behind medical boards like everyone else. Noem single handedly put a stop to it in her State. permalink parent award report block reply\nTearsAficionado 2 points 4 days ago The time frame is too slow. permalink parent award report block reply\nStCharlie 4 points 4 days ago I hate to say it, but every time this happens there should be an outpouring of people that reach out to the family.  Many people would like to help these families financially or \"otherwise\".  There are many sites that show layoffs.  We need to build a site that shows illegal murders and how to contact the victims family.  I'm not explicitly saying people would want to help you \"resolve\" the outcome, but there are many people that would like to \"help\". permalink parent award report block reply\nMintap 37 points 5 days ago Kill him now. Save 12 years. permalink award report block reply CyanScales OP 12 points 5 days ago Saves tax money. permalink parent award report block reply BlokeyMcBlokeFace 12 points 5 days ago This is valid. Anyone who sheds the blood of a human being, by a human being shall that one’s blood be shed; For in the image of God have human beings been made. https://bible.usccb.org/bible/genesis/9 permalink parent award report block reply Dangerous 8 points 5 days ago Right now he is protected by the state so he isn't able to kill him permalink parent award report block reply FrensInLowPlaces 4 points 5 days ago Technically it saves 24 years cuz the son wouldnt have to do his 12. permalink parent award report block reply StCharlie 0 points 4 days ago We add the families contact information. We help them \"resolve\" their anguish. I think there are many Americans willing to \"help\". The site will for supporting the families financially and offering support for \"handling\" what the victim did to the family. Can anyone help me build a list of sites that track this information about where the events occur, who was involved, etc? I'd like to take the first steps to help these families to get the respected response they deserve permalink parent award report block reply\nCyanScales OP 12 points 5 days ago Saves tax money. permalink parent award report block reply\nBlokeyMcBlokeFace 12 points 5 days ago This is valid. Anyone who sheds the blood of a human being, by a human being shall that one’s blood be shed; For in the image of God have human beings been made. https://bible.usccb.org/bible/genesis/9 permalink parent award report block reply\nDangerous 8 points 5 days ago Right now he is protected by the state so he isn't able to kill him permalink parent award report block reply\nFrensInLowPlaces 4 points 5 days ago Technically it saves 24 years cuz the son wouldnt have to do his 12. permalink parent award report block reply\nStCharlie 0 points 4 days ago We add the families contact information. We help them \"resolve\" their anguish. I think there are many Americans willing to \"help\". The site will for supporting the families financially and offering support for \"handling\" what the victim did to the family. Can anyone help me build a list of sites that track this information about where the events occur, who was involved, etc? I'd like to take the first steps to help these families to get the respected response they deserve permalink parent award report block reply\nzooty 19 points 5 days ago \"Vendetta\" is an Italian word. permalink award report block reply\nHanginChad 19 points 5 days ago Don't fucking announce it. permalink award report block reply SicSemperTyrannis2 6 points 4 days ago Yeah that part was stupid. Just kill the Judge. Maybe even leave a horse head on his bed? permalink parent award report block reply\nSicSemperTyrannis2 6 points 4 days ago Yeah that part was stupid. Just kill the Judge. Maybe even leave a horse head on his bed? permalink parent award report block reply\nShaffro 15 points 5 days ago Maybe some hero in prison will dispatch him, soon. permalink award report block reply LookFatty 5 points 5 days ago This i pray ... Forgive me Jesus permalink parent award report block reply\nLookFatty 5 points 5 days ago This i pray ... Forgive me Jesus permalink parent award report block reply\nDem_slayer 15 points 5 days ago Of some migrant 3rd worlder killed one of my family members id get revenge on all of them. Not just the one responsible. permalink award report block reply TearsAficionado 1 points 4 days ago ^^^this is the way. permalink parent award report block reply\nTearsAficionado 1 points 4 days ago ^^^this is the way. permalink parent award report block reply\nAwShitHereWeGoAgain 9 points 5 days ago I volunteer for his jury. permalink award report block reply\nGletkin 9 points 5 days ago Seems like nearly all the media coverage of violence is just about how the perpetrators are actually the victims and what they really need is compassion. As for the actual victims or their families... crickets. permalink award report block reply SicSemperTyrannis2 1 points 4 days ago I got your compassion right here! permalink parent award report block reply\nSicSemperTyrannis2 1 points 4 days ago I got your compassion right here! permalink parent award report block reply\nDragonEnergy2 7 points 5 days ago Best guess. The authorities will secretly release him early without notifying the family. permalink award report block reply\nbidensmissingbrain 5 points 5 days ago “The son of the victim is now serving a life sentence for ‘hate speech’….” permalink award report block reply\nMoebius 4 points 5 days ago Why wait.  Vendetta is easy in Italian Prisons...and the Giudice should get it too... \"Il decesso è avvenuto per cause naturali\" ... Meaning its natural to his bullshit verdict and sentence... permalink award report block reply\nBahamaDon 4 points 5 days ago It is the beginning of an all out unpunishable white genocide. permalink award report block reply TrumpAndGodWin 7 points 5 days ago Democrats orchestrated the genocide of White people, we are at stage 8 out of ten on the 'ten stages of genocide.' permalink parent award report block reply SicSemperTyrannis2 2 points 4 days ago Gotta link to that list? permalink parent award report block reply TrumpAndGodWin 2 points 4 days ago https://www.genocidewatch.com/tenstages permalink parent award report block reply SicSemperTyrannis2 -1 points 3 days ago :) Thanks for keeping this place great! permalink parent award report block reply\nTrumpAndGodWin 7 points 5 days ago Democrats orchestrated the genocide of White people, we are at stage 8 out of ten on the 'ten stages of genocide.' permalink parent award report block reply SicSemperTyrannis2 2 points 4 days ago Gotta link to that list? permalink parent award report block reply TrumpAndGodWin 2 points 4 days ago https://www.genocidewatch.com/tenstages permalink parent award report block reply SicSemperTyrannis2 -1 points 3 days ago :) Thanks for keeping this place great! permalink parent award report block reply\nSicSemperTyrannis2 2 points 4 days ago Gotta link to that list? permalink parent award report block reply TrumpAndGodWin 2 points 4 days ago https://www.genocidewatch.com/tenstages permalink parent award report block reply SicSemperTyrannis2 -1 points 3 days ago :) Thanks for keeping this place great! permalink parent award report block reply\nTrumpAndGodWin 2 points 4 days ago https://www.genocidewatch.com/tenstages permalink parent award report block reply SicSemperTyrannis2 -1 points 3 days ago :) Thanks for keeping this place great! permalink parent award report block reply\nSicSemperTyrannis2 -1 points 3 days ago :) Thanks for keeping this place great! permalink parent award report block reply\nGreyKnight 4 points 5 days ago …all…” Everyday I wonder theoretically how Frank Castle funded his food and ammunition supply… permalink award report block reply\nCounterwhat 3 points 4 days ago It's a Gary Plauché in reverse. A son pay srespect to his elders. permalink award report block reply\nKennyKetchem 3 points 5 days ago Fuck 12, I am robbing a bank and becoming his cellmate. I'll do it in 6 permalink award report block reply DJT4MoreYears 1 points 4 days ago Yeah, but the murderer \"transitioned\" to a girl while in prison and was transferred to an all female prison and is now freely raping women while you're still stuck in a cell with bubba. Sorry fren. permalink parent award report block reply\nDJT4MoreYears 1 points 4 days ago Yeah, but the murderer \"transitioned\" to a girl while in prison and was transferred to an all female prison and is now freely raping women while you're still stuck in a cell with bubba. Sorry fren. permalink parent award report block reply\nAR_MAGA 3 points 5 days ago The Mafia family will take care of the illegal scum inside the jail. Just wait. permalink award report block reply SicSemperTyrannis2 3 points 4 days ago What about the Judge?!? permalink parent award report block reply\nSicSemperTyrannis2 3 points 4 days ago What about the Judge?!? permalink parent award report block reply\nBastard 3 points 5 days ago Debt to society?  Paid. Debt to me?  Not even close. permalink award report block reply\nTxiribiton 2 points 4 days ago First I would kill the judge and the people who allowed that illegal in the US. permalink award report block reply\nglow-operator-2-0 1 points 4 days ago Natural reaction, but I wouldn't telegraph my plans to the world. permalink award report block reply\nEastTexasMadLad 1 points 4 days ago Kill that corrupt judge first permalink award report block reply\nRedFoxOnFire 1 points 4 days ago This is the way. Make the courts lock the murderers up for life, not for justice but for their own protection. permalink award report block reply\nmcoulton 1 points 4 days ago 12 years to plan the perfect crime permalink award report block reply\nmcoulton 1 points 4 days ago 12 years to build a dungeon in the woods permalink award report block reply\nUnboosted 1 points 4 days ago The murderer should have been executed permalink award report block reply\nmcoulton 1 points 4 days ago Thats why they had lynch mobs, to ensure justice permalink award report block reply\nCaJuN-Polak 1 points 4 days ago As soon as they are back on the street, either after release from jail or the court, they belong to US. permalink award report block reply\nHockeyMom4Trump 0 points 4 days ago Don’t wait 12 years. Put a hit on him in prison. permalink award report block reply\nUSNVET71 -8 points 4 days ago This is the only way to correct this is frontier justice, these judges have no consequences. It doesn't affect them. So they just randomly pick a fucking number and go home. I'm glad this guy said that in 12 years this motherfucker is going to take a dirt nap. permalink award report block reply\nHoodooOperator 1 points 4 days ago Comment removed by community moderators. permalink award report block reply\nTheGoyimWhisperer 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply"}