{"id": "1ARK9oY1yv", "contents": "1322 America Was A Great Country & Leading In Technological Innovation Long Before The H-1B Program (rumble.com) 🚽   DRAIN THE SWAMP   🚽 posted 14 hours ago by magaMC117 145 comments award share report block\n145 comments Sort by Top Top New Worst Old Save PedePete 74 points 13 hours ago The entire concept of H1B is anti-American, and will likely be a massive contributor to the downfall of our country and the implosion of the economy. While a few aliens are being deported - hoards of leeches are being imported to destroy our children's future.\nThere is no shortage of talent here in the USA, and the clowns that they are importing are not nearly as skilled as our fellow Americans (they are simply cheap labor who they hope to convert into new voters). permalink award report block reply fskfsk 35 points 13 hours ago Just look at how much consumer software is shit. My cable box software crashes and has to reboot once a week. It wasn't like that 10 years ago. Walgreen's AI customer support system is awful. I go to my credit card website, it takes a minute for the page to load.  Every time they update it, they take away features I was using. permalink parent award report block reply PedePete 27 points 13 hours ago ^^ This is absolutely another important factor. The enshitification is very real. And it's going to have implications that ripple into the future as our tech and software continue to decline.. This is NOT happening by mistake. permalink parent award report block reply FakeNametag 7 points 10 hours ago \"Enshitification\" 🤣 permalink parent award report block reply justicein2020 4 points 7 hours ago https://en.wikipedia.org/wiki/Enshittification permalink parent award report block reply view 1 more comments... NonyaDB 4 points 5 hours ago Probably because they're off-shoring development work. And since it's all ESLs nowadays first the ESL has to run the requirements they were emailed thru an AI to translate it (poorly) into their native tongue and then they write up an AI prompt in their native tongue which they then also run thru an AI translator (poorly) to create the shitty AI-generated English text which they then copy-pasta into yet another AI that generates poor code that they then copy-pasta into the production code without ever testing it first. And when it inevitably breaks, they lie to management about their development and testing process, usually by blaming anyone and anything other than their own incompetence. These fuckers will stab their fellow co-workers in the back like it was a new fad. Many such cases, and it's really prevalent at Microsoft in their O365 products which are always fucking up and going offline every week causing them to have to roll-back code changes. permalink parent award report block reply Pied-Trumper 7 points 11 hours ago Support is even more shit, which is ultimately what AI is for - to replace foreign support with even cheaper support at taxpayer expense. Mind you, these people have access to all your most private date, even health data, and they're from the centers of cybercrime. permalink parent award report block reply NotYourMan 6 points 4 hours ago H1B-visa is NOT about high quality.  Its about lower cost and employees that are easy to control.  In my experience, H1B-visa engineers steal from US employees and they are easy to control.  They lie steal, back stab and do exactly what management tells them because they like making millions on high-tech stock. permalink parent award report block reply cosmos411 2 points 15 minutes ago No better way to force blind loyalty than hanging an H1B over their turbans. Take the H1B away and it's back to shit filled streets. The result, an employee who will do literally anything to keep their job. permalink parent award report block reply covok48 4 points 8 hours ago My ISP is all jeets. At all working hours. Except ads which are all black. permalink parent award report block reply alucard13mmfmj 1 points 4 hours ago Banks started to offload customer service overseas... permalink parent award report block reply Truthisunpopular 3 points 7 hours ago It started with offshoring manufacturing, so we became a country that didn't produce things, then we offshored as many jobs as possible from our service industries, then we began to import as many foreign slave laborers as the corporations wanted. The devolution of America over the past few decades has been nauseating to behold and it's accelerating at a horrific pace. permalink parent award report block reply NotYourMan 2 points 4 hours ago Successful countries do not need immigrant workers at all.  Germany, France, UK, and the US didn't need any immigrants starting in the 1980s to take away jobs.  That was nothing more than a power grab by politicians.  Immigrants can't vote or they can be used to generate illegal, fake ballots.  They are easy to control because they don't want to go back.  Immigrants benefit the ruling class and if they are violent then they create chaos so that the politicians can steal without anybody noticing. permalink parent award report block reply patrioticwinning3 59 points 14 hours ago Wonder why we are getting spammed with H1B shit?  Someone is now offering $3-5k per post of \"pro-H1B\" propaganda! https://x.com/Will_Panic/status/1988676599303270490 permalink award report block reply Viewer01 48 points 13 hours ago Israel dropped a few hundred million on influencer buying and suddenly and for no reason at all were getting infinity jeets from the Trump campaign. So my guess is this is a distraction from all the Zionist shenanigans going on the last few months. It’s all over X. Faggots like bill Mitchell are posting lame ass Vivek talking points. All highly concerted. It’s basically punishment for having the temerity to standup to Ben Shapiro and Levine so now they’re going to send a few million chinks and jeets our way for not invading Iran. permalink parent award report block reply StayoutOfit 23 points 13 hours ago Tons of pro street shitters showing up here like never before as well. permalink parent award report block reply MySidesGoUp 13 points 11 hours ago Israel unleashing Hindus then Muslims.  Very slick… permalink parent award report block reply Moose_Antlers 6 points 7 hours ago Diversity for you. Ethnostate for them. Very convenient. permalink parent award report block reply EvilGreed209 2 points 7 hours ago so we can have an all out bloodbath in usa they know the street shitters and terrorists hate eachother as well. permalink parent award report block reply Datamancer -3 points 11 hours ago I haven't seen many pro street-shitter posts.  Must get nuked before I see it. permalink parent award report block reply covok48 3 points 8 hours ago You ARE a one. Go die somewhere alone. permalink parent award report block reply view 1 more comments... Pied-Trumper 7 points 11 hours ago That must be why our President's on the same page, they also backed him with tons of money. The lesson here is voters (Americans) don't matter, only money and power. permalink parent award report block reply EvilGreed209 2 points 7 hours ago Well they master sexual blackmail and there is no man more desperate for female attention than a dirty street shitter like Haji Patel at the FBI and his israeli spy gf who looks like she's running a clockwork orange operation with the acid eye dropper and all on Kash Man's buggy cross eyes all they have to do is send more spy bitches and have these indians doing whatever she says. permalink parent award report block reply vongregormench -2 points 11 hours ago Why wouldn’t the street shitters just be self interested and doing it themselves? Israel isn’t exactly rolling in dough. Their lobbying efforts are directed towards gibs from the US. Why would Israel pay to sabotage their life giving host? permalink parent award report block reply covok48 2 points 8 hours ago You are rewarded & Jewish. permalink parent award report block reply TallestSkill -2 points 10 hours ago Viewer01, you sound like you’re mixing geopolitical fanfiction with Telegram comment sections. There is no “Zionist punishment campaign” sending Indian or Chinese workers to America. The H-1B system is not run out of Tel Aviv. It is run out of the Department of Labor and Silicon Valley HR departments. The people lobbying for more visas are Google, Microsoft, and the Chamber of Commerce, companies that despise populists precisely because they want cheap and compliant labor. You are chasing ghosts instead of naming the real culprit. Corporate America bought both parties to replace citizen engineers with global wage slaves. That is the kind of globalism the establishment loves because it keeps wages low and keeps you blaming random foreign scapegoats instead of the boardrooms writing the checks. The enemy is not “jeets” or “chinks.” It is the corporate class that replaced the American middle class with an imported one and convinced you to argue about Israel while they cash out your future. permalink parent award report block reply Viewer01 2 points 4 hours ago I didn’t read any of this. permalink parent award report block reply Jaqen 1 points 5 hours ago Regarding the managerial elite: https://americanaffairsjournal.org/2017/05/new-class-war/ permalink parent award report block reply load 4 more comments... CounterStrike 13 points 13 hours ago I'm getting $0 to post against it... rethinking my position. permalink parent award report block reply Bball-gurl 10 points 12 hours ago Because the quote unquote AMERICA FIRST guy just finished telling Fox news that there aren't enough talented Americans so we have to rely on H1Bs permalink parent award report block reply asdrubael_was_right 12 points 11 hours ago Yeah fuck anyone who says something like that. A choice between democrats who want to flood the country with foreign workers and GOP who want to do the same thing is no choice at all. Trump has made some goofs in his career and we’ve always defended him but these comments are inexcusable. permalink parent award report block reply Pied-Trumper 8 points 11 hours ago The American Revolution and NASA could've never happened without 500k Chinese and 3 billion street shitters! When they say \"American\" don't have the talent, they mean Whites. Notice colleges and every center of power have been attacking Whites and Whiteness for the last 20 years, yet the only counter in return is to combat antisemitism. permalink parent award report block reply RStroud 3 points 10 hours ago There are plenty of whites, but they don't want to live 5 to a room in a rented apartment that smells like body odor and curry.  Also, being on the West Coast isn't a selling point for Americans anymore.  Finally you've got a mature technology with multiple competitors in the multi trillion dollar market cap range, the rockstar startup age of making millions on blowing smoke and hype is long, long past.  It hasn't been sexy or free money in decades. If it were about Asian talent, there are 125m Japanese and 50m Koreans, and 2/3 of them have college level education.  But they don't come as cheap as Chinese or Indians. Side note, the AI circle jerk feels like Dot Com 2.0 with two suppliers.  Cisco was $80, Intel was $70, and Oracle was $50 back in 2000. permalink parent award report block reply Datamancer 0 points 11 hours ago spammed with H1B shit.... Now that us unintentionally hilarious.  💩💩💩 permalink parent award report block reply load 4 more comments... MedicallyReddit 39 points 13 hours ago Deport all poopjeets permalink award report block reply DeportThemAllForever 25 points 13 hours ago Trump doesn’t think we can put a car battery together, but some retard overseas trained in 2 hours is qualified. It’s naive to think all these businesses will give up cheap labor, or that Trump will do anything about it considering his business hires them too. And he too benefits from inflation as every other builder. permalink parent award report block reply Pied-Trumper 12 points 11 hours ago It's not that. He knows you'll want more than slave wages for a 40 hour week, benefits, and require the company abides by legal / safety standards. Stocks must always go up. permalink parent award report block reply AngeredKabar 8 points 13 hours ago The workforce here IS retarded though. Only about 10% of people I've worked with know their ass from a hole in the ground. I think the retarded 90% can only read two syllables into a word. Some of these people came into upper management in the past 5 years. Importing thousands of low wage street shitting sex pests from a sun 80 iq peninsula is not going to help. That's basically why we're in that situation already. Nothing runs right anymore and it's because of the racial makeup of the workforce. permalink parent award report block reply DeportThemAllForever 15 points 12 hours ago Wasn’t like that, that’s cheap labor mass migration consequence.  Quite many Republicans participated in that too, and still do. permalink parent award report block reply Viewer01 14 points 12 hours ago It’s because we got over 8-10 million white men sitting at home. permalink parent award report block reply vongregormench 6 points 11 hours ago Fucking me right now. I’m a stay at home dad while my wife is a therapist for horribly raised teenagers. permalink parent award report block reply Pied-Trumper 6 points 11 hours ago It's like that because there's no incentive to learn anything. None of this happened prior to all our shit being sent overseas. Detroit is a prime example of what Americans can do when there's incentive and possibility. People lose hope and stop giving a shit when there's no possibility to move up in life. Additionally, kids getting shot at every day and starving or living off Cheetos and food stamps don't really have time to learn. Pretty soon, nobody's gonna study STEM or medical, and we'll need foreigners to do all of it. Especially when $400k Chinese come here and outbid our students for an already overpriced college system. permalink parent award report block reply covok48 0 points 8 hours ago Go fuck yourself. Jeet. permalink parent award report block reply AngeredKabar 2 points 7 hours ago Did you fucking read my post? I literally said jeets are more of a problem than just stealing jobs. permalink parent award report block reply LearnAboutRoaches -1 points 11 hours ago Nothing runs right anymore and it's because of the racial makeup of the workforce. It really is as simple as that. This damn space heater I got from wal mart for twenty bucks, it's so cheap it barely heats up the room! Until more white people are hired to make these things, they will continue to not work until we are just one big nation that doesn't work! /s lol. Racial predjudice has made you fucking retarded. permalink parent award report block reply 5DchessWatch 8 points 13 hours ago I'd like to see an Indian in a jeep first, and the jeep is an artcar decorated with poo emojis poojeet in a poo jeep I'm asking for people to dig deep and bring forth the magic permalink parent award report block reply GayPatriotMAGAUncle -7 points 12 hours ago Deport yourself you stupid fucking stormfag! permalink parent award report block reply MedicallyReddit 9 points 12 hours ago Ok Ranjeet 😂😂 permalink parent award report block reply Pied-Trumper 6 points 11 hours ago Do not deport saarrrrr! permalink parent award report block reply vongregormench 5 points 11 hours ago Wanting retard mongrel races to live peacefully in their own self made shithole is not a Nazi position. permalink parent award report block reply DeltaSierra -20 points 13 hours ago This is a typical dum shit post in the Donald.  You should get the fuk out of the conservative movement.  You are likely a leftist shill.  You can make your argument without being a racist ahole.  Get the fuk out of here.   We don’t need aholes like you.  You are a total fukin drag on our future permalink parent award report block reply Thatunknownguy 14 points 13 hours ago SARR NOOO WHAT ARE YOU DOING DO NOT REDEEM THE POST SARR NOOO FUCK YOUR MOTHER ONLYFANGS SARR permalink parent award report block reply DeltaSierra -11 points 12 hours ago Speak English you Marxist shill permalink parent award report block reply Thatunknownguy 10 points 11 hours ago FUKKIN BLOODY BITCH BASTARD FUKK YOU permalink parent award report block reply view 1 more comments... Doomers_for_Trump 9 points 12 hours ago You can't spell swear words? permalink parent award report block reply MedicallyReddit 10 points 12 hours ago You’re definitely new here lol. permalink parent award report block reply DeltaSierra -9 points 12 hours ago Yeh, no permalink parent award report block reply SimaYi 4 points 9 hours ago We're all racist bud. Go join the anti-White democrat party. You live in an multi-ethnic democracy and the only politics is identity politics. permalink parent award report block reply vongregormench 7 points 11 hours ago Hey Kumar. Go worship Satan in the shit filled Ganges and leave. permalink parent award report block reply DeltaSierra -5 points 10 hours ago Not going anywhere.  I am here to clean up this shit full site.  I have been told we need you all gone,  it is not good for the movement permalink parent award report block reply SimaYi 4 points 9 hours ago The movement is racist now. We've all had enough. We want a White country, our inheritance from our ancestors who sacrificed to give US a better life. Not you. Your parents didn't do shit except leech off their betters. So fuck off. permalink parent award report block reply Pied-Trumper 5 points 11 hours ago You're clearly the one nobody agrees with, which makes you the imposter. permalink parent award report block reply DeltaSierra -2 points 10 hours ago No, I am the sane one in the room sent to redirect the messaging. permalink parent award report block reply SimaYi 3 points 9 hours ago Tell whoever sent you it's not going to work. permalink parent award report block reply view 1 more comments... SimaYi 5 points 9 hours ago After a while, you start wondering why things are so shitty. You look around, and see that the country doesn't have the same people in it that it had when things were pretty good. And you start to notice the strong correlation between things being shitty, and the different people. Then you look at where the different people come from, and realize where they came from is shitty too. Almost like they brought the SHIT with them. Because they CREATED THE SHIT. That's not racist, that's an IQ test. So go fuck yourself. permalink parent award report block reply bemac 33 points 13 hours ago Please end it all. The tech sector is hurting from all these street shitters. permalink award report block reply Klaus73 7 points 12 hours ago Print companies in NA are all Indian or Muslim permalink parent award report block reply possibletower -25 points 13 hours ago Most of these industries haven't been in America since the 1980s. Retards here think that Antifa or BLM who lives in their mom's basements can train Americans to work in factories or tech 🤣 Trump is right. He is completely retarded on Chicom student visas though. permalink parent award report block reply Aquamine-Amarine 19 points 13 hours ago Those retards aren't training anyone. You can blame the schools for failing to teach students skills that are actually useful. And the few that were smart enough to go to a trade school or get a useful degree (no thanks to their shitty teachers though) still can't get hired because companies refuse to hire talented White men. permalink parent award report block reply IMainMako 2 points 6 hours ago Exactly, I'm a new graduate with a degree in cybersecurity and I cant even get an interview for an IT or networking position! permalink parent award report block reply 5DchessWatch 16 points 13 hours ago Indians don't do the coding.  They lie their way into IT management, and since pretty much anyone can manage IT, then they too can do it.  I say anyone can do IT management because the way you manage IT is you leave them the fuck alone to do their actual, and you keep them OUT OF MEETINGS as much as you can.  You basically read their ticket system emails and make sure they're on task, and you keep the rest of the company from making retard requests of them all day long so they can focus on doing what the higherups are telling you are priorty There I just described in a few sentences the TOTALITY of IT MANAGEMNT.  GO forth and poojeet. permalink parent award report block reply 5DchessWatch 8 points 13 hours ago btw, I'm not talking out of my ass.  I have 25 yrs experience coding and web dev and I've done some it managemnet with coding as well.  the really good coders you don't put them into management.  you take people with like phds in music and make them it managers because otherwise they're just going to sit on a trombone and wither away if you dont give them some work to do yes this sounds like dilbert tier but dilbert was fucking so accurate you wondered if it was satire or not poojeets make bad software and when you call tech support to support a shit product you inherited when you joined a company, you might end up being routed to a  lady that is fielding questions on a cellphone while they are washing their babies in the sink permalink parent award report block reply Pied-Trumper 3 points 11 hours ago I'm in an entirely separate organization than the Indians at our company, and they ping me to \"review once\" while having never spoken to me before. They find my name on shit from years ago and then just incessantly ping me to do their work. I completely ignore them, I'm just always irritated at how shitty they are. Additionally, all the hardest shit, core systems, infrastructure, etc. was built long ago by White Americans who could actually speak English. Nothing more worthless than a tech manager who's entirely separated from who they're managing and came from HR with a marketing or business degree. I'm convinced they're rarely ever working. We've actually busted ours in lies before and had their bullshit corrected by HR. permalink parent award report block reply Cetera 1 points 10 hours ago Damn... Can I work for you? permalink parent award report block reply staroframphansbhole 6 points 13 hours ago Can definitely tell that your retarded ass doesn’t know shit about technology so consider sitting this one out champ permalink parent award report block reply covok48 4 points 8 hours ago Fucking die. permalink parent award report block reply drmrboy 27 points 13 hours ago Thanks for fucking us all over Trump.  That MAGA thing ... pure genius that you stole it from Regan and sold it to all of us again.   I'd rather be told the truth at this point than be lied to, because that would be a more noble pursuit than hiding behind whatever government(s) are doing to you ... you know ... the same deep state swampy goverments you told us you would go after.  Lol ... zero fucking arrests.  What a fucking joke. At least life was awesome during Regan and my Mom and Dad could afford groceries and a house. So you're going to make America a \"new golden age?\"  What exactly does that mean?  Something Israel cooked up?  P.S. ... make sure to send out a mean Truth tonight about some shit that won't be for Middle America.  Unbelievable.  That fucking statement you made on Laura Ingram's show was almost the end for me.  I'll give you one more chance to make things right as far as it is concerned to me personally.  Do the right thing sir ... do the right thing for God's sake.  😐 permalink award report block reply MageGills 9 points 12 hours ago I fully think this nothing-burger Epstein email leak was done solely to try to distract from Trump's horrendous interview where he was openly shitting on Americans. I've been very patient with him, but this really pushed me away. If it weren't for that email leak today, that interview is all anybody would be talking about. permalink parent award report block reply mav7579 5 points 12 hours ago He already got your vote! permalink parent award report block reply Viewer01 3 points 12 hours ago Saaar. Do the needful. permalink parent award report block reply Burneraccountno4 19 points 12 hours ago Yesterday we learned Trump thinks 50% of US colleges would go bust if not for the foreign students paying double the tuition to attend. The only reason they are paying double is so they can get a job in the USA and/or steal American IP. Meanwhile, those colleges use the money they get from foreign students to subsidize their radical communist propaganda programs designed to turn normal American children into mental case tranny school shooters and assassins of prominent conservatives. Trump already had a close call with one of these individuals, but he is clearly a slow learner. The fact is 50% of colleges absolutely need to go bust and their unemployed commie groomer professors need to be banned from ever teaching again. permalink award report block reply rebuildingMyself 1 points 2 hours ago Yes agreed. Between govt guaranteed school loans and foreigners paying 2x tuition, it's allowed these universities to prop up useless departments that churn out brainwashed commies with no valuable skills. DOGE needs to be set up in every single one and that cancer needs to be purged. Then they'd find themselves being able to compete far more effectively. permalink parent award report block reply hazelknut 16 points 13 hours ago Bannon was all tongue-tied today. trying to spin it one minute, condemning it the next. kinda sad what Trump is saying to his base right now. permalink award report block reply GoUSA 16 points 13 hours ago Indians don't and can't innovate. They are drones with a bizarre amount of arrogance considering how unable they are to think creatively or pivot when life happens. I've been around them professionally in various capacity for 20 years. Button pushers at best and professional time wasters. None of them could ever take my job because they couldn't handle having a day that is 5% scripted permalink award report block reply Scottx 14 points 12 hours ago I am seeing more and more H1B's at work. As a white guy our numbers are declining. permalink award report block reply lothrop_evola 14 points 12 hours ago If you read Charles Murray's book \"Human Accomplishment\" it shows that white men are responsible for about 95% of great inventions and accomplishments, over the past 2800 years. But suddenly, our society can't function unless we're swamped with 3rd worlders to save us \"lazy, entitled whites\". The propaganda level is completely ridiculous. permalink award report block reply sovereign_citizen 11 points 12 hours ago 85% of H1-B jobs go to entry level and junior level positions.\n70% of which are filled by Indians and another 10% by Chinese. permalink award report block reply 5DchessWatch 10 points 13 hours ago Once upon a time I was making tibicos which is 'water kefir' made with a semi translucent biofilm that eats sugar in water. It was recommended to use piconcillo sugar which is natural brown sugar in these cones from latin america. Well one day I found that indian places have a similar thing called JAGGERY so I tried with JAGGERY.   The tibicos all died and there was like oily diesel bullshit floating to the top (like gas on a puddle in parking lot), and the water I used was the same, filtered water I always use. Jaggery is disgusting Indiamade bullshit that they sell and eat They eat diesel infected, unknown bits of ???? tainted industrial waste sugar called Jaggery This is all you literally need to know about India Fake food Disgusting landfill food from poors that MORE POOR THAN LATIN AMERICA They have lower standards than the poors of Latin america Nothing wrong with pooor, but You are judged by the fruits of your labor India Food = Bullshit Because Indians are bullshit USDA is bullshit too, because this got past them Probably some Indian phoneys in USDA gave this a pass This is one example among MANY.  I've basically stopped buying food from India.  Its either old.  Old and rancd.  New and Tainted with diesel and who in F knows what else.  Of unknown age and botulistic in nature.  Or just something dumb you ought not put into your mouth in the first place, full of EU banned substances, dyes (\"dies\" says it right in the name). Its all bad for you and so is India permalink award report block reply MediaBro 2 points 7 hours ago Funny thing is there is an episode of Simpsons that shows Apu keeping food in his aisles that has gone bad and still selling it past its use by dates. So, this has been the norm for a while. permalink parent award report block reply vongregormench 7 points 11 hours ago What innovation was brought to us by India? permalink award report block reply joggin_noggin 5 points 11 hours ago Zero, allegedly. permalink parent award report block reply Datamancer 5 points 11 hours ago Well .... street shitting for one. permalink parent award report block reply rebuildingMyself 1 points 2 hours ago The poop throwing festival was pretty unique tbf permalink parent award report block reply DenturesNancy 6 points 10 hours ago Trump must shake off his entourage asap, they are feeding him India shit and he is gobbling it.  Conservative Americans are the smartest most hard working people on earth.  yes we have retards but they are the product of the treasonous bastards democrats, so I try not to hold it against them.\nTrump, return to your base and to the MAGA roots, or this war is finished and America will never become great.  I suggest he does a few rallies to sync up with American people again. dammit permalink award report block reply NonyaDB 5 points 6 hours ago The problem with H1Bs are the rampant corruption brought on by a cheating mentality and the checklist mindset all H1Bs have. They're literally incapable of seeing 2nd, 3rd, 4th, 5th, etc. order effects on any systems under their purview, which is something that a lot Americans tend to do intuitively, quickly, and more efficiently than even AI does, at least when it comes to hardware and configurations. I'm constantly fixing H1B and off-shored IT admin mistakes on a daily basis at work. Take the installation and configuration of a typical ~300lbs 4U storage system. An H1B will just slap it in the rack and not once think about ensuring proper cable management so they won't cause an outage if they have to replace a part in a node or if they have to add additional storage systems in the future or hot-swap a switch or switch blade. They don't care because the task they were given was \"install that storage system in the rack\". The task never said anything about proper cable management because the person writing up the task thinks that everyone in IT would know to do that automagically. But only the Americans think ahead like that. That's just a small one of the hundreds of fuck-ups I've seen H1Bs and off-shored IT admins do over the years. The worst ones will try to blame me for their own fuck-ups and I don't stand for that shit at all. \"Who installed and configured the system?  That's right - not me.  It was you that did it wrong.  Don't ever try laying your mistakes at my feet again.\" permalink award report block reply SoldierOnFire 4 points 10 hours ago I do not agree with Trump on his H1B position. We need to invest in America and Americans. permalink award report block reply knnbccb 4 points 10 hours ago Then greed took over, outsourcing IT jobs to the jeets, then outsourcing sweatshops to the Chinks. Doesn't matter if they do a shoddy job or pose as a national security down the road, profit and instant gratification, that's the priority. Just need to kiss the ass of the shareholders and 'stakeholders' and they will toe the line. The love of money is the root of all evil. permalink award report block reply CommanderComadant 1 points 4 hours ago This is late stage capitalism. permalink parent award report block reply EvilGreed209 4 points 7 hours ago I was coding on computers in the 80's when most chinks were riding their bullshit bicycle to go pick rice for 14 hours.  Cut the shit they only want foreign workers because they are broken slaves who will lick boots and do the job for half the pay. permalink award report block reply Ghost_Division 3 points 10 hours ago Someone fucked up the code and turned all the t's to d's. permalink award report block reply covok48 3 points 8 hours ago Trump is trying to lose the midterms on purpose. Let him, permalink award report block reply Pied-Trumper 2 points 11 hours ago We all thought that was what we voted for, she's right permalink award report block reply Tellmeboutit2 2 points 9 hours ago Ask yourself whatever happened to Bell Labs permalink award report block reply barronwin 2 points 7 hours ago Germans, Greeks, Italians, Irish, Chinese, now Mexicans. This country's history of immigration has never stopped being a shitshow. Deport them all, and I mean ALL permalink award report block reply MediaBro 1 points 7 hours ago Too late with the Germans. Half of White MAGA is likely German themselves. Also, you want to even kick out the Amish?? They're still German as fk. The Greeks are a very very small community.\nThey have more of a presence in Australia. Italians are like the Germans, as are the Irish. Chinese have been here since the Civil War days. Mexicans are... well... Mexicans. None of this is going to happen. permalink parent award report block reply ZacPetkanas 1 points 53 minutes ago We went to the moon without Jeets and Chinamen. Deport, deport, deport permalink award report block reply Psalm-118_24 1 points 2 hours ago BRING BACK THIS POTUS...Statement by Donald J. Trump on Position on Visas\nMarch 03, 2016\n\"Megyn Kelly asked about highly-skilled immigration. The H-1B program is neither high-skilled nor immigration: these are temporary foreign workers, imported from abroad, for the explicit purpose of substituting for American workers at lower pay. I remain totally committed to eliminating rampant, widespread H-1B abuse and ending outrageous practices such as those that occurred at Disney in Florida when Americans were forced to train their foreign replacements. I will end forever the use of the H-1B as a cheap labor program, and institute an absolute requirement to hire American workers first for every visa and immigration program. No exceptions.\" permalink award report block reply texas4ever 1 points 11 hours ago H1B is just for cheaper labor. Some higher level immigrants do create tremendous wealth in our country, however. permalink award report block reply Counterwhat 1 points 4 hours ago This was a way to lower wages. That is all. permalink award report block reply Nanteen 1 points 4 hours ago How is it possible that there are countries out there that have technically Superior citizens that our companies need because there are none here.? We have the greatest institutions of learning in the world. Are they really trying to make us think that? Oh no! There's no one here that can work on this problem except some ending in the back water of India? With the exception of Cuban mechanics on 1950s cars, I can't imagine permalink award report block reply JanetRenosBallhair 1 points 6 hours ago I have been forced to teach chinks shit in powertrain for 20 straight years. They don’t get it until we literally give them all the IP. RIP Briggs and Stratton, told the VP to his face in 2011. Here we sit permalink award report block reply Robbybobbyrobbob 1 points 7 hours ago \"Was\"  is the keyword here. permalink award report block reply Apersonofinterest 1 points 5 hours ago Natalie looks like she’s putting on baby weight. Is she preggo? permalink award report block reply SanityGumby 1 points 11 hours ago Yet retard we no longer manufacture any drugs here permalink award report block reply CommanderComadant 1 points 4 hours ago Reflecting back now- that Chinese kid, who’s dad worked at compaq or that Cambodian kid in the neighborhood whose family ran a donut shop (who had like 15 family in 1 house). The Muslim kid who wasn’t allowed to come outside and play soccer with us. This was 96. They were h1bs. Nice people, totally unnecessary. The beginning of the flood. permalink award report block reply grannylovestrump -4 points 11 hours ago I think what Donald Trump is trying to tell everybody that it is all a balance and he is the Master at finding that balance and JD Vance too. Elon can be thrown into that mix and there are many others on that cabinet that has that balance which is so hard to find. Too far to the left or too far to the right is not the Goldilock zone and it does not sustain or allow life to thrive. And when your hearts on fire; you must realize...smoke gets in your eyes. I don't care what anybody says I adore Donald J Trump. I am so proud of his courage and his staying power. Monsters Inc is about to go through some incredible changes! Lions will lay down with lambs! We are surrounded by the Angels and it is overwhelming. Thank you Father God and please watch over our President and our Patriots.....God you are so good..... permalink award report block reply ACActual 12 points 11 hours ago 52% of Gen Z Graduates can't find jobs.  The middle ground on H1B'S is now zero.  This scam needs to end. permalink parent award report block reply grannylovestrump -4 points 11 hours ago Why  not regulated. Many of those Cubans down in Florida running from Communism voted Red and would stand by our side to fight. We just need to vet them better. Bring the cream of the crop and those that are left behind maybe they can see us succeeding economical which is what every wants AC/DC Money talks BS walks! and they can model themselves after that because technology is finally connecting the whole planet! That which is used for bad can be used for good..... permalink parent award report block reply ACActual 5 points 11 hours ago Until all Americans get a shot at the Pursuit of Happiness we need a Moratorium on all immigration.  Its our country and its being destroyed by foreigners.   Hint:  NYC.  Most of the country's problems can be solved with 50 million Deportations.  Housing, Cars, Healthcare, Inflation, food, loans, literally everything needed to get started as an American Citizen can be improved by Deportating, Denaturalizing Foreigners permalink parent award report block reply MediaBro 1 points 7 hours ago You don't have to deport the legal migrants. Just denaturalise them, have them pay 0 taxes and no govt benefits and tell them to leave in 10 yrs and most will still enthusiastically work for the US and leave. Then refocus on the White and other local population and give them all incentives to marry and have kids. permalink parent award report block reply Datamancer 4 points 11 hours ago First we put it to zero and wring out all the shit. Then we recalibrate it for the top 1% of global talent. permalink parent award report block reply Datamancer 6 points 11 hours ago A fucking balance?  Are you high?  It is a boat anchor tied around the neck of the white collar middle class. Fucking balance. permalink parent award report block reply grannylovestrump -3 points 11 hours ago He is like King Solomon praying to God to give him power over the demons that wish to destroy his people and his land. He is a good leader. We stand with our Commander in battle win or lose but I see God is at the helm anyway and no mortal man. Even President Trump knows that. permalink parent award report block reply GayPatriotMAGAUncle -5 points 12 hours ago That was 50 years ago, dumb cunt. Today's culture is completely different and H-1B's prosper in our current environment. When people don't have the skills needed we need legal immigration, something this women (revoke 19th amendment) doesn't clearly understand along with the stormfags here pushing anti-Trump propaganda. permalink award report block reply joggin_noggin 7 points 11 hours ago Of course H1Bs prosper in this environment with the deck rigged in their favor. permalink parent award report block reply vongregormench 6 points 11 hours ago We don’t need ANY immigration period. You think the world’s superpower got that way by begging other countries for help? If people don’t have the correct skills then wages for those positions should increase until Americans fill those jobs. Opening up the entire earth to fill a job opening repeated to infinity is lowering the American skill set and lowering American wages and quality of life. Almost every problem this country can be traced back to immigration of both legal and illegal types. permalink parent award report block reply possibletower -19 points 13 hours ago Most of these industries haven't been in America since the 1980s. Retards here think that Antifa or BLM who lives in their mom's basements can train Americans to work in factories or tech 🤣 Trump is right. He is completely retarded on Chicom student visas though. permalink award report block reply drmrboy 7 points 13 hours ago 🖕🫵🤖. permalink parent award report block reply vongregormench 6 points 11 hours ago It’s posted twice. Totally a bot. permalink parent award report block reply Datamancer 3 points 11 hours ago Are you vaxxed or naturally retarded?  It isn't BLM or Antifa doing the training.  How many EMs and ETs exit the Navy every fucking month.   You think that cannot train on batteries, power systems,  and simply circuitry?  Same with Air Force and Army. Fucking fuck already.  But you do prove Trump's point - there are a lot of retards in America. permalink parent award report block reply SCHULTZ 1 points 11 hours ago Comment removed by community moderators. permalink award report block reply expertnoticer 1 points 12 hours ago Comment removed by community filter, pending further review. permalink award report block reply\nPedePete 74 points 13 hours ago The entire concept of H1B is anti-American, and will likely be a massive contributor to the downfall of our country and the implosion of the economy. While a few aliens are being deported - hoards of leeches are being imported to destroy our children's future.\nThere is no shortage of talent here in the USA, and the clowns that they are importing are not nearly as skilled as our fellow Americans (they are simply cheap labor who they hope to convert into new voters). permalink award report block reply fskfsk 35 points 13 hours ago Just look at how much consumer software is shit. My cable box software crashes and has to reboot once a week. It wasn't like that 10 years ago. Walgreen's AI customer support system is awful. I go to my credit card website, it takes a minute for the page to load.  Every time they update it, they take away features I was using. permalink parent award report block reply PedePete 27 points 13 hours ago ^^ This is absolutely another important factor. The enshitification is very real. And it's going to have implications that ripple into the future as our tech and software continue to decline.. This is NOT happening by mistake. permalink parent award report block reply FakeNametag 7 points 10 hours ago \"Enshitification\" 🤣 permalink parent award report block reply justicein2020 4 points 7 hours ago https://en.wikipedia.org/wiki/Enshittification permalink parent award report block reply view 1 more comments... NonyaDB 4 points 5 hours ago Probably because they're off-shoring development work. And since it's all ESLs nowadays first the ESL has to run the requirements they were emailed thru an AI to translate it (poorly) into their native tongue and then they write up an AI prompt in their native tongue which they then also run thru an AI translator (poorly) to create the shitty AI-generated English text which they then copy-pasta into yet another AI that generates poor code that they then copy-pasta into the production code without ever testing it first. And when it inevitably breaks, they lie to management about their development and testing process, usually by blaming anyone and anything other than their own incompetence. These fuckers will stab their fellow co-workers in the back like it was a new fad. Many such cases, and it's really prevalent at Microsoft in their O365 products which are always fucking up and going offline every week causing them to have to roll-back code changes. permalink parent award report block reply Pied-Trumper 7 points 11 hours ago Support is even more shit, which is ultimately what AI is for - to replace foreign support with even cheaper support at taxpayer expense. Mind you, these people have access to all your most private date, even health data, and they're from the centers of cybercrime. permalink parent award report block reply NotYourMan 6 points 4 hours ago H1B-visa is NOT about high quality.  Its about lower cost and employees that are easy to control.  In my experience, H1B-visa engineers steal from US employees and they are easy to control.  They lie steal, back stab and do exactly what management tells them because they like making millions on high-tech stock. permalink parent award report block reply cosmos411 2 points 15 minutes ago No better way to force blind loyalty than hanging an H1B over their turbans. Take the H1B away and it's back to shit filled streets. The result, an employee who will do literally anything to keep their job. permalink parent award report block reply covok48 4 points 8 hours ago My ISP is all jeets. At all working hours. Except ads which are all black. permalink parent award report block reply alucard13mmfmj 1 points 4 hours ago Banks started to offload customer service overseas... permalink parent award report block reply Truthisunpopular 3 points 7 hours ago It started with offshoring manufacturing, so we became a country that didn't produce things, then we offshored as many jobs as possible from our service industries, then we began to import as many foreign slave laborers as the corporations wanted. The devolution of America over the past few decades has been nauseating to behold and it's accelerating at a horrific pace. permalink parent award report block reply NotYourMan 2 points 4 hours ago Successful countries do not need immigrant workers at all.  Germany, France, UK, and the US didn't need any immigrants starting in the 1980s to take away jobs.  That was nothing more than a power grab by politicians.  Immigrants can't vote or they can be used to generate illegal, fake ballots.  They are easy to control because they don't want to go back.  Immigrants benefit the ruling class and if they are violent then they create chaos so that the politicians can steal without anybody noticing. permalink parent award report block reply\nfskfsk 35 points 13 hours ago Just look at how much consumer software is shit. My cable box software crashes and has to reboot once a week. It wasn't like that 10 years ago. Walgreen's AI customer support system is awful. I go to my credit card website, it takes a minute for the page to load.  Every time they update it, they take away features I was using. permalink parent award report block reply PedePete 27 points 13 hours ago ^^ This is absolutely another important factor. The enshitification is very real. And it's going to have implications that ripple into the future as our tech and software continue to decline.. This is NOT happening by mistake. permalink parent award report block reply FakeNametag 7 points 10 hours ago \"Enshitification\" 🤣 permalink parent award report block reply justicein2020 4 points 7 hours ago https://en.wikipedia.org/wiki/Enshittification permalink parent award report block reply view 1 more comments... NonyaDB 4 points 5 hours ago Probably because they're off-shoring development work. And since it's all ESLs nowadays first the ESL has to run the requirements they were emailed thru an AI to translate it (poorly) into their native tongue and then they write up an AI prompt in their native tongue which they then also run thru an AI translator (poorly) to create the shitty AI-generated English text which they then copy-pasta into yet another AI that generates poor code that they then copy-pasta into the production code without ever testing it first. And when it inevitably breaks, they lie to management about their development and testing process, usually by blaming anyone and anything other than their own incompetence. These fuckers will stab their fellow co-workers in the back like it was a new fad. Many such cases, and it's really prevalent at Microsoft in their O365 products which are always fucking up and going offline every week causing them to have to roll-back code changes. permalink parent award report block reply Pied-Trumper 7 points 11 hours ago Support is even more shit, which is ultimately what AI is for - to replace foreign support with even cheaper support at taxpayer expense. Mind you, these people have access to all your most private date, even health data, and they're from the centers of cybercrime. permalink parent award report block reply NotYourMan 6 points 4 hours ago H1B-visa is NOT about high quality.  Its about lower cost and employees that are easy to control.  In my experience, H1B-visa engineers steal from US employees and they are easy to control.  They lie steal, back stab and do exactly what management tells them because they like making millions on high-tech stock. permalink parent award report block reply cosmos411 2 points 15 minutes ago No better way to force blind loyalty than hanging an H1B over their turbans. Take the H1B away and it's back to shit filled streets. The result, an employee who will do literally anything to keep their job. permalink parent award report block reply covok48 4 points 8 hours ago My ISP is all jeets. At all working hours. Except ads which are all black. permalink parent award report block reply alucard13mmfmj 1 points 4 hours ago Banks started to offload customer service overseas... permalink parent award report block reply\nPedePete 27 points 13 hours ago ^^ This is absolutely another important factor. The enshitification is very real. And it's going to have implications that ripple into the future as our tech and software continue to decline.. This is NOT happening by mistake. permalink parent award report block reply FakeNametag 7 points 10 hours ago \"Enshitification\" 🤣 permalink parent award report block reply justicein2020 4 points 7 hours ago https://en.wikipedia.org/wiki/Enshittification permalink parent award report block reply view 1 more comments... NonyaDB 4 points 5 hours ago Probably because they're off-shoring development work. And since it's all ESLs nowadays first the ESL has to run the requirements they were emailed thru an AI to translate it (poorly) into their native tongue and then they write up an AI prompt in their native tongue which they then also run thru an AI translator (poorly) to create the shitty AI-generated English text which they then copy-pasta into yet another AI that generates poor code that they then copy-pasta into the production code without ever testing it first. And when it inevitably breaks, they lie to management about their development and testing process, usually by blaming anyone and anything other than their own incompetence. These fuckers will stab their fellow co-workers in the back like it was a new fad. Many such cases, and it's really prevalent at Microsoft in their O365 products which are always fucking up and going offline every week causing them to have to roll-back code changes. permalink parent award report block reply\nFakeNametag 7 points 10 hours ago \"Enshitification\" 🤣 permalink parent award report block reply justicein2020 4 points 7 hours ago https://en.wikipedia.org/wiki/Enshittification permalink parent award report block reply view 1 more comments...\njusticein2020 4 points 7 hours ago https://en.wikipedia.org/wiki/Enshittification permalink parent award report block reply view 1 more comments...\nNonyaDB 4 points 5 hours ago Probably because they're off-shoring development work. And since it's all ESLs nowadays first the ESL has to run the requirements they were emailed thru an AI to translate it (poorly) into their native tongue and then they write up an AI prompt in their native tongue which they then also run thru an AI translator (poorly) to create the shitty AI-generated English text which they then copy-pasta into yet another AI that generates poor code that they then copy-pasta into the production code without ever testing it first. And when it inevitably breaks, they lie to management about their development and testing process, usually by blaming anyone and anything other than their own incompetence. These fuckers will stab their fellow co-workers in the back like it was a new fad. Many such cases, and it's really prevalent at Microsoft in their O365 products which are always fucking up and going offline every week causing them to have to roll-back code changes. permalink parent award report block reply\nPied-Trumper 7 points 11 hours ago Support is even more shit, which is ultimately what AI is for - to replace foreign support with even cheaper support at taxpayer expense. Mind you, these people have access to all your most private date, even health data, and they're from the centers of cybercrime. permalink parent award report block reply\nNotYourMan 6 points 4 hours ago H1B-visa is NOT about high quality.  Its about lower cost and employees that are easy to control.  In my experience, H1B-visa engineers steal from US employees and they are easy to control.  They lie steal, back stab and do exactly what management tells them because they like making millions on high-tech stock. permalink parent award report block reply cosmos411 2 points 15 minutes ago No better way to force blind loyalty than hanging an H1B over their turbans. Take the H1B away and it's back to shit filled streets. The result, an employee who will do literally anything to keep their job. permalink parent award report block reply\ncosmos411 2 points 15 minutes ago No better way to force blind loyalty than hanging an H1B over their turbans. Take the H1B away and it's back to shit filled streets. The result, an employee who will do literally anything to keep their job. permalink parent award report block reply\ncovok48 4 points 8 hours ago My ISP is all jeets. At all working hours. Except ads which are all black. permalink parent award report block reply\nalucard13mmfmj 1 points 4 hours ago Banks started to offload customer service overseas... permalink parent award report block reply\nTruthisunpopular 3 points 7 hours ago It started with offshoring manufacturing, so we became a country that didn't produce things, then we offshored as many jobs as possible from our service industries, then we began to import as many foreign slave laborers as the corporations wanted. The devolution of America over the past few decades has been nauseating to behold and it's accelerating at a horrific pace. permalink parent award report block reply\nNotYourMan 2 points 4 hours ago Successful countries do not need immigrant workers at all.  Germany, France, UK, and the US didn't need any immigrants starting in the 1980s to take away jobs.  That was nothing more than a power grab by politicians.  Immigrants can't vote or they can be used to generate illegal, fake ballots.  They are easy to control because they don't want to go back.  Immigrants benefit the ruling class and if they are violent then they create chaos so that the politicians can steal without anybody noticing. permalink parent award report block reply\npatrioticwinning3 59 points 14 hours ago Wonder why we are getting spammed with H1B shit?  Someone is now offering $3-5k per post of \"pro-H1B\" propaganda! https://x.com/Will_Panic/status/1988676599303270490 permalink award report block reply Viewer01 48 points 13 hours ago Israel dropped a few hundred million on influencer buying and suddenly and for no reason at all were getting infinity jeets from the Trump campaign. So my guess is this is a distraction from all the Zionist shenanigans going on the last few months. It’s all over X. Faggots like bill Mitchell are posting lame ass Vivek talking points. All highly concerted. It’s basically punishment for having the temerity to standup to Ben Shapiro and Levine so now they’re going to send a few million chinks and jeets our way for not invading Iran. permalink parent award report block reply StayoutOfit 23 points 13 hours ago Tons of pro street shitters showing up here like never before as well. permalink parent award report block reply MySidesGoUp 13 points 11 hours ago Israel unleashing Hindus then Muslims.  Very slick… permalink parent award report block reply Moose_Antlers 6 points 7 hours ago Diversity for you. Ethnostate for them. Very convenient. permalink parent award report block reply EvilGreed209 2 points 7 hours ago so we can have an all out bloodbath in usa they know the street shitters and terrorists hate eachother as well. permalink parent award report block reply Datamancer -3 points 11 hours ago I haven't seen many pro street-shitter posts.  Must get nuked before I see it. permalink parent award report block reply covok48 3 points 8 hours ago You ARE a one. Go die somewhere alone. permalink parent award report block reply view 1 more comments... Pied-Trumper 7 points 11 hours ago That must be why our President's on the same page, they also backed him with tons of money. The lesson here is voters (Americans) don't matter, only money and power. permalink parent award report block reply EvilGreed209 2 points 7 hours ago Well they master sexual blackmail and there is no man more desperate for female attention than a dirty street shitter like Haji Patel at the FBI and his israeli spy gf who looks like she's running a clockwork orange operation with the acid eye dropper and all on Kash Man's buggy cross eyes all they have to do is send more spy bitches and have these indians doing whatever she says. permalink parent award report block reply vongregormench -2 points 11 hours ago Why wouldn’t the street shitters just be self interested and doing it themselves? Israel isn’t exactly rolling in dough. Their lobbying efforts are directed towards gibs from the US. Why would Israel pay to sabotage their life giving host? permalink parent award report block reply covok48 2 points 8 hours ago You are rewarded & Jewish. permalink parent award report block reply TallestSkill -2 points 10 hours ago Viewer01, you sound like you’re mixing geopolitical fanfiction with Telegram comment sections. There is no “Zionist punishment campaign” sending Indian or Chinese workers to America. The H-1B system is not run out of Tel Aviv. It is run out of the Department of Labor and Silicon Valley HR departments. The people lobbying for more visas are Google, Microsoft, and the Chamber of Commerce, companies that despise populists precisely because they want cheap and compliant labor. You are chasing ghosts instead of naming the real culprit. Corporate America bought both parties to replace citizen engineers with global wage slaves. That is the kind of globalism the establishment loves because it keeps wages low and keeps you blaming random foreign scapegoats instead of the boardrooms writing the checks. The enemy is not “jeets” or “chinks.” It is the corporate class that replaced the American middle class with an imported one and convinced you to argue about Israel while they cash out your future. permalink parent award report block reply Viewer01 2 points 4 hours ago I didn’t read any of this. permalink parent award report block reply Jaqen 1 points 5 hours ago Regarding the managerial elite: https://americanaffairsjournal.org/2017/05/new-class-war/ permalink parent award report block reply load 4 more comments... CounterStrike 13 points 13 hours ago I'm getting $0 to post against it... rethinking my position. permalink parent award report block reply Bball-gurl 10 points 12 hours ago Because the quote unquote AMERICA FIRST guy just finished telling Fox news that there aren't enough talented Americans so we have to rely on H1Bs permalink parent award report block reply asdrubael_was_right 12 points 11 hours ago Yeah fuck anyone who says something like that. A choice between democrats who want to flood the country with foreign workers and GOP who want to do the same thing is no choice at all. Trump has made some goofs in his career and we’ve always defended him but these comments are inexcusable. permalink parent award report block reply Pied-Trumper 8 points 11 hours ago The American Revolution and NASA could've never happened without 500k Chinese and 3 billion street shitters! When they say \"American\" don't have the talent, they mean Whites. Notice colleges and every center of power have been attacking Whites and Whiteness for the last 20 years, yet the only counter in return is to combat antisemitism. permalink parent award report block reply RStroud 3 points 10 hours ago There are plenty of whites, but they don't want to live 5 to a room in a rented apartment that smells like body odor and curry.  Also, being on the West Coast isn't a selling point for Americans anymore.  Finally you've got a mature technology with multiple competitors in the multi trillion dollar market cap range, the rockstar startup age of making millions on blowing smoke and hype is long, long past.  It hasn't been sexy or free money in decades. If it were about Asian talent, there are 125m Japanese and 50m Koreans, and 2/3 of them have college level education.  But they don't come as cheap as Chinese or Indians. Side note, the AI circle jerk feels like Dot Com 2.0 with two suppliers.  Cisco was $80, Intel was $70, and Oracle was $50 back in 2000. permalink parent award report block reply Datamancer 0 points 11 hours ago spammed with H1B shit.... Now that us unintentionally hilarious.  💩💩💩 permalink parent award report block reply load 4 more comments...\nViewer01 48 points 13 hours ago Israel dropped a few hundred million on influencer buying and suddenly and for no reason at all were getting infinity jeets from the Trump campaign. So my guess is this is a distraction from all the Zionist shenanigans going on the last few months. It’s all over X. Faggots like bill Mitchell are posting lame ass Vivek talking points. All highly concerted. It’s basically punishment for having the temerity to standup to Ben Shapiro and Levine so now they’re going to send a few million chinks and jeets our way for not invading Iran. permalink parent award report block reply StayoutOfit 23 points 13 hours ago Tons of pro street shitters showing up here like never before as well. permalink parent award report block reply MySidesGoUp 13 points 11 hours ago Israel unleashing Hindus then Muslims.  Very slick… permalink parent award report block reply Moose_Antlers 6 points 7 hours ago Diversity for you. Ethnostate for them. Very convenient. permalink parent award report block reply EvilGreed209 2 points 7 hours ago so we can have an all out bloodbath in usa they know the street shitters and terrorists hate eachother as well. permalink parent award report block reply Datamancer -3 points 11 hours ago I haven't seen many pro street-shitter posts.  Must get nuked before I see it. permalink parent award report block reply covok48 3 points 8 hours ago You ARE a one. Go die somewhere alone. permalink parent award report block reply view 1 more comments... Pied-Trumper 7 points 11 hours ago That must be why our President's on the same page, they also backed him with tons of money. The lesson here is voters (Americans) don't matter, only money and power. permalink parent award report block reply EvilGreed209 2 points 7 hours ago Well they master sexual blackmail and there is no man more desperate for female attention than a dirty street shitter like Haji Patel at the FBI and his israeli spy gf who looks like she's running a clockwork orange operation with the acid eye dropper and all on Kash Man's buggy cross eyes all they have to do is send more spy bitches and have these indians doing whatever she says. permalink parent award report block reply vongregormench -2 points 11 hours ago Why wouldn’t the street shitters just be self interested and doing it themselves? Israel isn’t exactly rolling in dough. Their lobbying efforts are directed towards gibs from the US. Why would Israel pay to sabotage their life giving host? permalink parent award report block reply covok48 2 points 8 hours ago You are rewarded & Jewish. permalink parent award report block reply TallestSkill -2 points 10 hours ago Viewer01, you sound like you’re mixing geopolitical fanfiction with Telegram comment sections. There is no “Zionist punishment campaign” sending Indian or Chinese workers to America. The H-1B system is not run out of Tel Aviv. It is run out of the Department of Labor and Silicon Valley HR departments. The people lobbying for more visas are Google, Microsoft, and the Chamber of Commerce, companies that despise populists precisely because they want cheap and compliant labor. You are chasing ghosts instead of naming the real culprit. Corporate America bought both parties to replace citizen engineers with global wage slaves. That is the kind of globalism the establishment loves because it keeps wages low and keeps you blaming random foreign scapegoats instead of the boardrooms writing the checks. The enemy is not “jeets” or “chinks.” It is the corporate class that replaced the American middle class with an imported one and convinced you to argue about Israel while they cash out your future. permalink parent award report block reply Viewer01 2 points 4 hours ago I didn’t read any of this. permalink parent award report block reply Jaqen 1 points 5 hours ago Regarding the managerial elite: https://americanaffairsjournal.org/2017/05/new-class-war/ permalink parent award report block reply load 4 more comments...\nStayoutOfit 23 points 13 hours ago Tons of pro street shitters showing up here like never before as well. permalink parent award report block reply MySidesGoUp 13 points 11 hours ago Israel unleashing Hindus then Muslims.  Very slick… permalink parent award report block reply Moose_Antlers 6 points 7 hours ago Diversity for you. Ethnostate for them. Very convenient. permalink parent award report block reply EvilGreed209 2 points 7 hours ago so we can have an all out bloodbath in usa they know the street shitters and terrorists hate eachother as well. permalink parent award report block reply Datamancer -3 points 11 hours ago I haven't seen many pro street-shitter posts.  Must get nuked before I see it. permalink parent award report block reply covok48 3 points 8 hours ago You ARE a one. Go die somewhere alone. permalink parent award report block reply view 1 more comments...\nMySidesGoUp 13 points 11 hours ago Israel unleashing Hindus then Muslims.  Very slick… permalink parent award report block reply Moose_Antlers 6 points 7 hours ago Diversity for you. Ethnostate for them. Very convenient. permalink parent award report block reply EvilGreed209 2 points 7 hours ago so we can have an all out bloodbath in usa they know the street shitters and terrorists hate eachother as well. permalink parent award report block reply\nMoose_Antlers 6 points 7 hours ago Diversity for you. Ethnostate for them. Very convenient. permalink parent award report block reply\nEvilGreed209 2 points 7 hours ago so we can have an all out bloodbath in usa they know the street shitters and terrorists hate eachother as well. permalink parent award report block reply\nDatamancer -3 points 11 hours ago I haven't seen many pro street-shitter posts.  Must get nuked before I see it. permalink parent award report block reply covok48 3 points 8 hours ago You ARE a one. Go die somewhere alone. permalink parent award report block reply view 1 more comments...\ncovok48 3 points 8 hours ago You ARE a one. Go die somewhere alone. permalink parent award report block reply view 1 more comments...\nPied-Trumper 7 points 11 hours ago That must be why our President's on the same page, they also backed him with tons of money. The lesson here is voters (Americans) don't matter, only money and power. permalink parent award report block reply\nEvilGreed209 2 points 7 hours ago Well they master sexual blackmail and there is no man more desperate for female attention than a dirty street shitter like Haji Patel at the FBI and his israeli spy gf who looks like she's running a clockwork orange operation with the acid eye dropper and all on Kash Man's buggy cross eyes all they have to do is send more spy bitches and have these indians doing whatever she says. permalink parent award report block reply\nvongregormench -2 points 11 hours ago Why wouldn’t the street shitters just be self interested and doing it themselves? Israel isn’t exactly rolling in dough. Their lobbying efforts are directed towards gibs from the US. Why would Israel pay to sabotage their life giving host? permalink parent award report block reply covok48 2 points 8 hours ago You are rewarded & Jewish. permalink parent award report block reply\ncovok48 2 points 8 hours ago You are rewarded & Jewish. permalink parent award report block reply\nTallestSkill -2 points 10 hours ago Viewer01, you sound like you’re mixing geopolitical fanfiction with Telegram comment sections. There is no “Zionist punishment campaign” sending Indian or Chinese workers to America. The H-1B system is not run out of Tel Aviv. It is run out of the Department of Labor and Silicon Valley HR departments. The people lobbying for more visas are Google, Microsoft, and the Chamber of Commerce, companies that despise populists precisely because they want cheap and compliant labor. You are chasing ghosts instead of naming the real culprit. Corporate America bought both parties to replace citizen engineers with global wage slaves. That is the kind of globalism the establishment loves because it keeps wages low and keeps you blaming random foreign scapegoats instead of the boardrooms writing the checks. The enemy is not “jeets” or “chinks.” It is the corporate class that replaced the American middle class with an imported one and convinced you to argue about Israel while they cash out your future. permalink parent award report block reply Viewer01 2 points 4 hours ago I didn’t read any of this. permalink parent award report block reply Jaqen 1 points 5 hours ago Regarding the managerial elite: https://americanaffairsjournal.org/2017/05/new-class-war/ permalink parent award report block reply\nViewer01 2 points 4 hours ago I didn’t read any of this. permalink parent award report block reply\nJaqen 1 points 5 hours ago Regarding the managerial elite: https://americanaffairsjournal.org/2017/05/new-class-war/ permalink parent award report block reply\nCounterStrike 13 points 13 hours ago I'm getting $0 to post against it... rethinking my position. permalink parent award report block reply\nBball-gurl 10 points 12 hours ago Because the quote unquote AMERICA FIRST guy just finished telling Fox news that there aren't enough talented Americans so we have to rely on H1Bs permalink parent award report block reply asdrubael_was_right 12 points 11 hours ago Yeah fuck anyone who says something like that. A choice between democrats who want to flood the country with foreign workers and GOP who want to do the same thing is no choice at all. Trump has made some goofs in his career and we’ve always defended him but these comments are inexcusable. permalink parent award report block reply\nasdrubael_was_right 12 points 11 hours ago Yeah fuck anyone who says something like that. A choice between democrats who want to flood the country with foreign workers and GOP who want to do the same thing is no choice at all. Trump has made some goofs in his career and we’ve always defended him but these comments are inexcusable. permalink parent award report block reply\nPied-Trumper 8 points 11 hours ago The American Revolution and NASA could've never happened without 500k Chinese and 3 billion street shitters! When they say \"American\" don't have the talent, they mean Whites. Notice colleges and every center of power have been attacking Whites and Whiteness for the last 20 years, yet the only counter in return is to combat antisemitism. permalink parent award report block reply RStroud 3 points 10 hours ago There are plenty of whites, but they don't want to live 5 to a room in a rented apartment that smells like body odor and curry.  Also, being on the West Coast isn't a selling point for Americans anymore.  Finally you've got a mature technology with multiple competitors in the multi trillion dollar market cap range, the rockstar startup age of making millions on blowing smoke and hype is long, long past.  It hasn't been sexy or free money in decades. If it were about Asian talent, there are 125m Japanese and 50m Koreans, and 2/3 of them have college level education.  But they don't come as cheap as Chinese or Indians. Side note, the AI circle jerk feels like Dot Com 2.0 with two suppliers.  Cisco was $80, Intel was $70, and Oracle was $50 back in 2000. permalink parent award report block reply\nRStroud 3 points 10 hours ago There are plenty of whites, but they don't want to live 5 to a room in a rented apartment that smells like body odor and curry.  Also, being on the West Coast isn't a selling point for Americans anymore.  Finally you've got a mature technology with multiple competitors in the multi trillion dollar market cap range, the rockstar startup age of making millions on blowing smoke and hype is long, long past.  It hasn't been sexy or free money in decades. If it were about Asian talent, there are 125m Japanese and 50m Koreans, and 2/3 of them have college level education.  But they don't come as cheap as Chinese or Indians. Side note, the AI circle jerk feels like Dot Com 2.0 with two suppliers.  Cisco was $80, Intel was $70, and Oracle was $50 back in 2000. permalink parent award report block reply\nDatamancer 0 points 11 hours ago spammed with H1B shit.... Now that us unintentionally hilarious.  💩💩💩 permalink parent award report block reply\nMedicallyReddit 39 points 13 hours ago Deport all poopjeets permalink award report block reply DeportThemAllForever 25 points 13 hours ago Trump doesn’t think we can put a car battery together, but some retard overseas trained in 2 hours is qualified. It’s naive to think all these businesses will give up cheap labor, or that Trump will do anything about it considering his business hires them too. And he too benefits from inflation as every other builder. permalink parent award report block reply Pied-Trumper 12 points 11 hours ago It's not that. He knows you'll want more than slave wages for a 40 hour week, benefits, and require the company abides by legal / safety standards. Stocks must always go up. permalink parent award report block reply AngeredKabar 8 points 13 hours ago The workforce here IS retarded though. Only about 10% of people I've worked with know their ass from a hole in the ground. I think the retarded 90% can only read two syllables into a word. Some of these people came into upper management in the past 5 years. Importing thousands of low wage street shitting sex pests from a sun 80 iq peninsula is not going to help. That's basically why we're in that situation already. Nothing runs right anymore and it's because of the racial makeup of the workforce. permalink parent award report block reply DeportThemAllForever 15 points 12 hours ago Wasn’t like that, that’s cheap labor mass migration consequence.  Quite many Republicans participated in that too, and still do. permalink parent award report block reply Viewer01 14 points 12 hours ago It’s because we got over 8-10 million white men sitting at home. permalink parent award report block reply vongregormench 6 points 11 hours ago Fucking me right now. I’m a stay at home dad while my wife is a therapist for horribly raised teenagers. permalink parent award report block reply Pied-Trumper 6 points 11 hours ago It's like that because there's no incentive to learn anything. None of this happened prior to all our shit being sent overseas. Detroit is a prime example of what Americans can do when there's incentive and possibility. People lose hope and stop giving a shit when there's no possibility to move up in life. Additionally, kids getting shot at every day and starving or living off Cheetos and food stamps don't really have time to learn. Pretty soon, nobody's gonna study STEM or medical, and we'll need foreigners to do all of it. Especially when $400k Chinese come here and outbid our students for an already overpriced college system. permalink parent award report block reply covok48 0 points 8 hours ago Go fuck yourself. Jeet. permalink parent award report block reply AngeredKabar 2 points 7 hours ago Did you fucking read my post? I literally said jeets are more of a problem than just stealing jobs. permalink parent award report block reply LearnAboutRoaches -1 points 11 hours ago Nothing runs right anymore and it's because of the racial makeup of the workforce. It really is as simple as that. This damn space heater I got from wal mart for twenty bucks, it's so cheap it barely heats up the room! Until more white people are hired to make these things, they will continue to not work until we are just one big nation that doesn't work! /s lol. Racial predjudice has made you fucking retarded. permalink parent award report block reply 5DchessWatch 8 points 13 hours ago I'd like to see an Indian in a jeep first, and the jeep is an artcar decorated with poo emojis poojeet in a poo jeep I'm asking for people to dig deep and bring forth the magic permalink parent award report block reply GayPatriotMAGAUncle -7 points 12 hours ago Deport yourself you stupid fucking stormfag! permalink parent award report block reply MedicallyReddit 9 points 12 hours ago Ok Ranjeet 😂😂 permalink parent award report block reply Pied-Trumper 6 points 11 hours ago Do not deport saarrrrr! permalink parent award report block reply vongregormench 5 points 11 hours ago Wanting retard mongrel races to live peacefully in their own self made shithole is not a Nazi position. permalink parent award report block reply DeltaSierra -20 points 13 hours ago This is a typical dum shit post in the Donald.  You should get the fuk out of the conservative movement.  You are likely a leftist shill.  You can make your argument without being a racist ahole.  Get the fuk out of here.   We don’t need aholes like you.  You are a total fukin drag on our future permalink parent award report block reply Thatunknownguy 14 points 13 hours ago SARR NOOO WHAT ARE YOU DOING DO NOT REDEEM THE POST SARR NOOO FUCK YOUR MOTHER ONLYFANGS SARR permalink parent award report block reply DeltaSierra -11 points 12 hours ago Speak English you Marxist shill permalink parent award report block reply Thatunknownguy 10 points 11 hours ago FUKKIN BLOODY BITCH BASTARD FUKK YOU permalink parent award report block reply view 1 more comments... Doomers_for_Trump 9 points 12 hours ago You can't spell swear words? permalink parent award report block reply MedicallyReddit 10 points 12 hours ago You’re definitely new here lol. permalink parent award report block reply DeltaSierra -9 points 12 hours ago Yeh, no permalink parent award report block reply SimaYi 4 points 9 hours ago We're all racist bud. Go join the anti-White democrat party. You live in an multi-ethnic democracy and the only politics is identity politics. permalink parent award report block reply vongregormench 7 points 11 hours ago Hey Kumar. Go worship Satan in the shit filled Ganges and leave. permalink parent award report block reply DeltaSierra -5 points 10 hours ago Not going anywhere.  I am here to clean up this shit full site.  I have been told we need you all gone,  it is not good for the movement permalink parent award report block reply SimaYi 4 points 9 hours ago The movement is racist now. We've all had enough. We want a White country, our inheritance from our ancestors who sacrificed to give US a better life. Not you. Your parents didn't do shit except leech off their betters. So fuck off. permalink parent award report block reply Pied-Trumper 5 points 11 hours ago You're clearly the one nobody agrees with, which makes you the imposter. permalink parent award report block reply DeltaSierra -2 points 10 hours ago No, I am the sane one in the room sent to redirect the messaging. permalink parent award report block reply SimaYi 3 points 9 hours ago Tell whoever sent you it's not going to work. permalink parent award report block reply view 1 more comments... SimaYi 5 points 9 hours ago After a while, you start wondering why things are so shitty. You look around, and see that the country doesn't have the same people in it that it had when things were pretty good. And you start to notice the strong correlation between things being shitty, and the different people. Then you look at where the different people come from, and realize where they came from is shitty too. Almost like they brought the SHIT with them. Because they CREATED THE SHIT. That's not racist, that's an IQ test. So go fuck yourself. permalink parent award report block reply\nDeportThemAllForever 25 points 13 hours ago Trump doesn’t think we can put a car battery together, but some retard overseas trained in 2 hours is qualified. It’s naive to think all these businesses will give up cheap labor, or that Trump will do anything about it considering his business hires them too. And he too benefits from inflation as every other builder. permalink parent award report block reply Pied-Trumper 12 points 11 hours ago It's not that. He knows you'll want more than slave wages for a 40 hour week, benefits, and require the company abides by legal / safety standards. Stocks must always go up. permalink parent award report block reply AngeredKabar 8 points 13 hours ago The workforce here IS retarded though. Only about 10% of people I've worked with know their ass from a hole in the ground. I think the retarded 90% can only read two syllables into a word. Some of these people came into upper management in the past 5 years. Importing thousands of low wage street shitting sex pests from a sun 80 iq peninsula is not going to help. That's basically why we're in that situation already. Nothing runs right anymore and it's because of the racial makeup of the workforce. permalink parent award report block reply DeportThemAllForever 15 points 12 hours ago Wasn’t like that, that’s cheap labor mass migration consequence.  Quite many Republicans participated in that too, and still do. permalink parent award report block reply Viewer01 14 points 12 hours ago It’s because we got over 8-10 million white men sitting at home. permalink parent award report block reply vongregormench 6 points 11 hours ago Fucking me right now. I’m a stay at home dad while my wife is a therapist for horribly raised teenagers. permalink parent award report block reply Pied-Trumper 6 points 11 hours ago It's like that because there's no incentive to learn anything. None of this happened prior to all our shit being sent overseas. Detroit is a prime example of what Americans can do when there's incentive and possibility. People lose hope and stop giving a shit when there's no possibility to move up in life. Additionally, kids getting shot at every day and starving or living off Cheetos and food stamps don't really have time to learn. Pretty soon, nobody's gonna study STEM or medical, and we'll need foreigners to do all of it. Especially when $400k Chinese come here and outbid our students for an already overpriced college system. permalink parent award report block reply covok48 0 points 8 hours ago Go fuck yourself. Jeet. permalink parent award report block reply AngeredKabar 2 points 7 hours ago Did you fucking read my post? I literally said jeets are more of a problem than just stealing jobs. permalink parent award report block reply LearnAboutRoaches -1 points 11 hours ago Nothing runs right anymore and it's because of the racial makeup of the workforce. It really is as simple as that. This damn space heater I got from wal mart for twenty bucks, it's so cheap it barely heats up the room! Until more white people are hired to make these things, they will continue to not work until we are just one big nation that doesn't work! /s lol. Racial predjudice has made you fucking retarded. permalink parent award report block reply\nPied-Trumper 12 points 11 hours ago It's not that. He knows you'll want more than slave wages for a 40 hour week, benefits, and require the company abides by legal / safety standards. Stocks must always go up. permalink parent award report block reply\nAngeredKabar 8 points 13 hours ago The workforce here IS retarded though. Only about 10% of people I've worked with know their ass from a hole in the ground. I think the retarded 90% can only read two syllables into a word. Some of these people came into upper management in the past 5 years. Importing thousands of low wage street shitting sex pests from a sun 80 iq peninsula is not going to help. That's basically why we're in that situation already. Nothing runs right anymore and it's because of the racial makeup of the workforce. permalink parent award report block reply DeportThemAllForever 15 points 12 hours ago Wasn’t like that, that’s cheap labor mass migration consequence.  Quite many Republicans participated in that too, and still do. permalink parent award report block reply Viewer01 14 points 12 hours ago It’s because we got over 8-10 million white men sitting at home. permalink parent award report block reply vongregormench 6 points 11 hours ago Fucking me right now. I’m a stay at home dad while my wife is a therapist for horribly raised teenagers. permalink parent award report block reply Pied-Trumper 6 points 11 hours ago It's like that because there's no incentive to learn anything. None of this happened prior to all our shit being sent overseas. Detroit is a prime example of what Americans can do when there's incentive and possibility. People lose hope and stop giving a shit when there's no possibility to move up in life. Additionally, kids getting shot at every day and starving or living off Cheetos and food stamps don't really have time to learn. Pretty soon, nobody's gonna study STEM or medical, and we'll need foreigners to do all of it. Especially when $400k Chinese come here and outbid our students for an already overpriced college system. permalink parent award report block reply covok48 0 points 8 hours ago Go fuck yourself. Jeet. permalink parent award report block reply AngeredKabar 2 points 7 hours ago Did you fucking read my post? I literally said jeets are more of a problem than just stealing jobs. permalink parent award report block reply LearnAboutRoaches -1 points 11 hours ago Nothing runs right anymore and it's because of the racial makeup of the workforce. It really is as simple as that. This damn space heater I got from wal mart for twenty bucks, it's so cheap it barely heats up the room! Until more white people are hired to make these things, they will continue to not work until we are just one big nation that doesn't work! /s lol. Racial predjudice has made you fucking retarded. permalink parent award report block reply\nDeportThemAllForever 15 points 12 hours ago Wasn’t like that, that’s cheap labor mass migration consequence.  Quite many Republicans participated in that too, and still do. permalink parent award report block reply\nViewer01 14 points 12 hours ago It’s because we got over 8-10 million white men sitting at home. permalink parent award report block reply vongregormench 6 points 11 hours ago Fucking me right now. I’m a stay at home dad while my wife is a therapist for horribly raised teenagers. permalink parent award report block reply\nvongregormench 6 points 11 hours ago Fucking me right now. I’m a stay at home dad while my wife is a therapist for horribly raised teenagers. permalink parent award report block reply\nPied-Trumper 6 points 11 hours ago It's like that because there's no incentive to learn anything. None of this happened prior to all our shit being sent overseas. Detroit is a prime example of what Americans can do when there's incentive and possibility. People lose hope and stop giving a shit when there's no possibility to move up in life. Additionally, kids getting shot at every day and starving or living off Cheetos and food stamps don't really have time to learn. Pretty soon, nobody's gonna study STEM or medical, and we'll need foreigners to do all of it. Especially when $400k Chinese come here and outbid our students for an already overpriced college system. permalink parent award report block reply\ncovok48 0 points 8 hours ago Go fuck yourself. Jeet. permalink parent award report block reply AngeredKabar 2 points 7 hours ago Did you fucking read my post? I literally said jeets are more of a problem than just stealing jobs. permalink parent award report block reply\nAngeredKabar 2 points 7 hours ago Did you fucking read my post? I literally said jeets are more of a problem than just stealing jobs. permalink parent award report block reply\nLearnAboutRoaches -1 points 11 hours ago Nothing runs right anymore and it's because of the racial makeup of the workforce. It really is as simple as that. This damn space heater I got from wal mart for twenty bucks, it's so cheap it barely heats up the room! Until more white people are hired to make these things, they will continue to not work until we are just one big nation that doesn't work! /s lol. Racial predjudice has made you fucking retarded. permalink parent award report block reply\n5DchessWatch 8 points 13 hours ago I'd like to see an Indian in a jeep first, and the jeep is an artcar decorated with poo emojis poojeet in a poo jeep I'm asking for people to dig deep and bring forth the magic permalink parent award report block reply\nGayPatriotMAGAUncle -7 points 12 hours ago Deport yourself you stupid fucking stormfag! permalink parent award report block reply MedicallyReddit 9 points 12 hours ago Ok Ranjeet 😂😂 permalink parent award report block reply Pied-Trumper 6 points 11 hours ago Do not deport saarrrrr! permalink parent award report block reply vongregormench 5 points 11 hours ago Wanting retard mongrel races to live peacefully in their own self made shithole is not a Nazi position. permalink parent award report block reply\nMedicallyReddit 9 points 12 hours ago Ok Ranjeet 😂😂 permalink parent award report block reply\nPied-Trumper 6 points 11 hours ago Do not deport saarrrrr! permalink parent award report block reply\nvongregormench 5 points 11 hours ago Wanting retard mongrel races to live peacefully in their own self made shithole is not a Nazi position. permalink parent award report block reply\nDeltaSierra -20 points 13 hours ago This is a typical dum shit post in the Donald.  You should get the fuk out of the conservative movement.  You are likely a leftist shill.  You can make your argument without being a racist ahole.  Get the fuk out of here.   We don’t need aholes like you.  You are a total fukin drag on our future permalink parent award report block reply Thatunknownguy 14 points 13 hours ago SARR NOOO WHAT ARE YOU DOING DO NOT REDEEM THE POST SARR NOOO FUCK YOUR MOTHER ONLYFANGS SARR permalink parent award report block reply DeltaSierra -11 points 12 hours ago Speak English you Marxist shill permalink parent award report block reply Thatunknownguy 10 points 11 hours ago FUKKIN BLOODY BITCH BASTARD FUKK YOU permalink parent award report block reply view 1 more comments... Doomers_for_Trump 9 points 12 hours ago You can't spell swear words? permalink parent award report block reply MedicallyReddit 10 points 12 hours ago You’re definitely new here lol. permalink parent award report block reply DeltaSierra -9 points 12 hours ago Yeh, no permalink parent award report block reply SimaYi 4 points 9 hours ago We're all racist bud. Go join the anti-White democrat party. You live in an multi-ethnic democracy and the only politics is identity politics. permalink parent award report block reply vongregormench 7 points 11 hours ago Hey Kumar. Go worship Satan in the shit filled Ganges and leave. permalink parent award report block reply DeltaSierra -5 points 10 hours ago Not going anywhere.  I am here to clean up this shit full site.  I have been told we need you all gone,  it is not good for the movement permalink parent award report block reply SimaYi 4 points 9 hours ago The movement is racist now. We've all had enough. We want a White country, our inheritance from our ancestors who sacrificed to give US a better life. Not you. Your parents didn't do shit except leech off their betters. So fuck off. permalink parent award report block reply Pied-Trumper 5 points 11 hours ago You're clearly the one nobody agrees with, which makes you the imposter. permalink parent award report block reply DeltaSierra -2 points 10 hours ago No, I am the sane one in the room sent to redirect the messaging. permalink parent award report block reply SimaYi 3 points 9 hours ago Tell whoever sent you it's not going to work. permalink parent award report block reply view 1 more comments... SimaYi 5 points 9 hours ago After a while, you start wondering why things are so shitty. You look around, and see that the country doesn't have the same people in it that it had when things were pretty good. And you start to notice the strong correlation between things being shitty, and the different people. Then you look at where the different people come from, and realize where they came from is shitty too. Almost like they brought the SHIT with them. Because they CREATED THE SHIT. That's not racist, that's an IQ test. So go fuck yourself. permalink parent award report block reply\nThatunknownguy 14 points 13 hours ago SARR NOOO WHAT ARE YOU DOING DO NOT REDEEM THE POST SARR NOOO FUCK YOUR MOTHER ONLYFANGS SARR permalink parent award report block reply DeltaSierra -11 points 12 hours ago Speak English you Marxist shill permalink parent award report block reply Thatunknownguy 10 points 11 hours ago FUKKIN BLOODY BITCH BASTARD FUKK YOU permalink parent award report block reply view 1 more comments... Doomers_for_Trump 9 points 12 hours ago You can't spell swear words? permalink parent award report block reply\nDeltaSierra -11 points 12 hours ago Speak English you Marxist shill permalink parent award report block reply Thatunknownguy 10 points 11 hours ago FUKKIN BLOODY BITCH BASTARD FUKK YOU permalink parent award report block reply view 1 more comments... Doomers_for_Trump 9 points 12 hours ago You can't spell swear words? permalink parent award report block reply\nThatunknownguy 10 points 11 hours ago FUKKIN BLOODY BITCH BASTARD FUKK YOU permalink parent award report block reply view 1 more comments...\nDoomers_for_Trump 9 points 12 hours ago You can't spell swear words? permalink parent award report block reply\nMedicallyReddit 10 points 12 hours ago You’re definitely new here lol. permalink parent award report block reply DeltaSierra -9 points 12 hours ago Yeh, no permalink parent award report block reply SimaYi 4 points 9 hours ago We're all racist bud. Go join the anti-White democrat party. You live in an multi-ethnic democracy and the only politics is identity politics. permalink parent award report block reply\nDeltaSierra -9 points 12 hours ago Yeh, no permalink parent award report block reply SimaYi 4 points 9 hours ago We're all racist bud. Go join the anti-White democrat party. You live in an multi-ethnic democracy and the only politics is identity politics. permalink parent award report block reply\nSimaYi 4 points 9 hours ago We're all racist bud. Go join the anti-White democrat party. You live in an multi-ethnic democracy and the only politics is identity politics. permalink parent award report block reply\nvongregormench 7 points 11 hours ago Hey Kumar. Go worship Satan in the shit filled Ganges and leave. permalink parent award report block reply DeltaSierra -5 points 10 hours ago Not going anywhere.  I am here to clean up this shit full site.  I have been told we need you all gone,  it is not good for the movement permalink parent award report block reply SimaYi 4 points 9 hours ago The movement is racist now. We've all had enough. We want a White country, our inheritance from our ancestors who sacrificed to give US a better life. Not you. Your parents didn't do shit except leech off their betters. So fuck off. permalink parent award report block reply\nDeltaSierra -5 points 10 hours ago Not going anywhere.  I am here to clean up this shit full site.  I have been told we need you all gone,  it is not good for the movement permalink parent award report block reply SimaYi 4 points 9 hours ago The movement is racist now. We've all had enough. We want a White country, our inheritance from our ancestors who sacrificed to give US a better life. Not you. Your parents didn't do shit except leech off their betters. So fuck off. permalink parent award report block reply\nSimaYi 4 points 9 hours ago The movement is racist now. We've all had enough. We want a White country, our inheritance from our ancestors who sacrificed to give US a better life. Not you. Your parents didn't do shit except leech off their betters. So fuck off. permalink parent award report block reply\nPied-Trumper 5 points 11 hours ago You're clearly the one nobody agrees with, which makes you the imposter. permalink parent award report block reply DeltaSierra -2 points 10 hours ago No, I am the sane one in the room sent to redirect the messaging. permalink parent award report block reply SimaYi 3 points 9 hours ago Tell whoever sent you it's not going to work. permalink parent award report block reply view 1 more comments...\nDeltaSierra -2 points 10 hours ago No, I am the sane one in the room sent to redirect the messaging. permalink parent award report block reply SimaYi 3 points 9 hours ago Tell whoever sent you it's not going to work. permalink parent award report block reply view 1 more comments...\nSimaYi 3 points 9 hours ago Tell whoever sent you it's not going to work. permalink parent award report block reply view 1 more comments...\nSimaYi 5 points 9 hours ago After a while, you start wondering why things are so shitty. You look around, and see that the country doesn't have the same people in it that it had when things were pretty good. And you start to notice the strong correlation between things being shitty, and the different people. Then you look at where the different people come from, and realize where they came from is shitty too. Almost like they brought the SHIT with them. Because they CREATED THE SHIT. That's not racist, that's an IQ test. So go fuck yourself. permalink parent award report block reply\nbemac 33 points 13 hours ago Please end it all. The tech sector is hurting from all these street shitters. permalink award report block reply Klaus73 7 points 12 hours ago Print companies in NA are all Indian or Muslim permalink parent award report block reply possibletower -25 points 13 hours ago Most of these industries haven't been in America since the 1980s. Retards here think that Antifa or BLM who lives in their mom's basements can train Americans to work in factories or tech 🤣 Trump is right. He is completely retarded on Chicom student visas though. permalink parent award report block reply Aquamine-Amarine 19 points 13 hours ago Those retards aren't training anyone. You can blame the schools for failing to teach students skills that are actually useful. And the few that were smart enough to go to a trade school or get a useful degree (no thanks to their shitty teachers though) still can't get hired because companies refuse to hire talented White men. permalink parent award report block reply IMainMako 2 points 6 hours ago Exactly, I'm a new graduate with a degree in cybersecurity and I cant even get an interview for an IT or networking position! permalink parent award report block reply 5DchessWatch 16 points 13 hours ago Indians don't do the coding.  They lie their way into IT management, and since pretty much anyone can manage IT, then they too can do it.  I say anyone can do IT management because the way you manage IT is you leave them the fuck alone to do their actual, and you keep them OUT OF MEETINGS as much as you can.  You basically read their ticket system emails and make sure they're on task, and you keep the rest of the company from making retard requests of them all day long so they can focus on doing what the higherups are telling you are priorty There I just described in a few sentences the TOTALITY of IT MANAGEMNT.  GO forth and poojeet. permalink parent award report block reply 5DchessWatch 8 points 13 hours ago btw, I'm not talking out of my ass.  I have 25 yrs experience coding and web dev and I've done some it managemnet with coding as well.  the really good coders you don't put them into management.  you take people with like phds in music and make them it managers because otherwise they're just going to sit on a trombone and wither away if you dont give them some work to do yes this sounds like dilbert tier but dilbert was fucking so accurate you wondered if it was satire or not poojeets make bad software and when you call tech support to support a shit product you inherited when you joined a company, you might end up being routed to a  lady that is fielding questions on a cellphone while they are washing their babies in the sink permalink parent award report block reply Pied-Trumper 3 points 11 hours ago I'm in an entirely separate organization than the Indians at our company, and they ping me to \"review once\" while having never spoken to me before. They find my name on shit from years ago and then just incessantly ping me to do their work. I completely ignore them, I'm just always irritated at how shitty they are. Additionally, all the hardest shit, core systems, infrastructure, etc. was built long ago by White Americans who could actually speak English. Nothing more worthless than a tech manager who's entirely separated from who they're managing and came from HR with a marketing or business degree. I'm convinced they're rarely ever working. We've actually busted ours in lies before and had their bullshit corrected by HR. permalink parent award report block reply Cetera 1 points 10 hours ago Damn... Can I work for you? permalink parent award report block reply staroframphansbhole 6 points 13 hours ago Can definitely tell that your retarded ass doesn’t know shit about technology so consider sitting this one out champ permalink parent award report block reply covok48 4 points 8 hours ago Fucking die. permalink parent award report block reply\nKlaus73 7 points 12 hours ago Print companies in NA are all Indian or Muslim permalink parent award report block reply\npossibletower -25 points 13 hours ago Most of these industries haven't been in America since the 1980s. Retards here think that Antifa or BLM who lives in their mom's basements can train Americans to work in factories or tech 🤣 Trump is right. He is completely retarded on Chicom student visas though. permalink parent award report block reply Aquamine-Amarine 19 points 13 hours ago Those retards aren't training anyone. You can blame the schools for failing to teach students skills that are actually useful. And the few that were smart enough to go to a trade school or get a useful degree (no thanks to their shitty teachers though) still can't get hired because companies refuse to hire talented White men. permalink parent award report block reply IMainMako 2 points 6 hours ago Exactly, I'm a new graduate with a degree in cybersecurity and I cant even get an interview for an IT or networking position! permalink parent award report block reply 5DchessWatch 16 points 13 hours ago Indians don't do the coding.  They lie their way into IT management, and since pretty much anyone can manage IT, then they too can do it.  I say anyone can do IT management because the way you manage IT is you leave them the fuck alone to do their actual, and you keep them OUT OF MEETINGS as much as you can.  You basically read their ticket system emails and make sure they're on task, and you keep the rest of the company from making retard requests of them all day long so they can focus on doing what the higherups are telling you are priorty There I just described in a few sentences the TOTALITY of IT MANAGEMNT.  GO forth and poojeet. permalink parent award report block reply 5DchessWatch 8 points 13 hours ago btw, I'm not talking out of my ass.  I have 25 yrs experience coding and web dev and I've done some it managemnet with coding as well.  the really good coders you don't put them into management.  you take people with like phds in music and make them it managers because otherwise they're just going to sit on a trombone and wither away if you dont give them some work to do yes this sounds like dilbert tier but dilbert was fucking so accurate you wondered if it was satire or not poojeets make bad software and when you call tech support to support a shit product you inherited when you joined a company, you might end up being routed to a  lady that is fielding questions on a cellphone while they are washing their babies in the sink permalink parent award report block reply Pied-Trumper 3 points 11 hours ago I'm in an entirely separate organization than the Indians at our company, and they ping me to \"review once\" while having never spoken to me before. They find my name on shit from years ago and then just incessantly ping me to do their work. I completely ignore them, I'm just always irritated at how shitty they are. Additionally, all the hardest shit, core systems, infrastructure, etc. was built long ago by White Americans who could actually speak English. Nothing more worthless than a tech manager who's entirely separated from who they're managing and came from HR with a marketing or business degree. I'm convinced they're rarely ever working. We've actually busted ours in lies before and had their bullshit corrected by HR. permalink parent award report block reply Cetera 1 points 10 hours ago Damn... Can I work for you? permalink parent award report block reply staroframphansbhole 6 points 13 hours ago Can definitely tell that your retarded ass doesn’t know shit about technology so consider sitting this one out champ permalink parent award report block reply covok48 4 points 8 hours ago Fucking die. permalink parent award report block reply\nAquamine-Amarine 19 points 13 hours ago Those retards aren't training anyone. You can blame the schools for failing to teach students skills that are actually useful. And the few that were smart enough to go to a trade school or get a useful degree (no thanks to their shitty teachers though) still can't get hired because companies refuse to hire talented White men. permalink parent award report block reply IMainMako 2 points 6 hours ago Exactly, I'm a new graduate with a degree in cybersecurity and I cant even get an interview for an IT or networking position! permalink parent award report block reply\nIMainMako 2 points 6 hours ago Exactly, I'm a new graduate with a degree in cybersecurity and I cant even get an interview for an IT or networking position! permalink parent award report block reply\n5DchessWatch 16 points 13 hours ago Indians don't do the coding.  They lie their way into IT management, and since pretty much anyone can manage IT, then they too can do it.  I say anyone can do IT management because the way you manage IT is you leave them the fuck alone to do their actual, and you keep them OUT OF MEETINGS as much as you can.  You basically read their ticket system emails and make sure they're on task, and you keep the rest of the company from making retard requests of them all day long so they can focus on doing what the higherups are telling you are priorty There I just described in a few sentences the TOTALITY of IT MANAGEMNT.  GO forth and poojeet. permalink parent award report block reply 5DchessWatch 8 points 13 hours ago btw, I'm not talking out of my ass.  I have 25 yrs experience coding and web dev and I've done some it managemnet with coding as well.  the really good coders you don't put them into management.  you take people with like phds in music and make them it managers because otherwise they're just going to sit on a trombone and wither away if you dont give them some work to do yes this sounds like dilbert tier but dilbert was fucking so accurate you wondered if it was satire or not poojeets make bad software and when you call tech support to support a shit product you inherited when you joined a company, you might end up being routed to a  lady that is fielding questions on a cellphone while they are washing their babies in the sink permalink parent award report block reply Pied-Trumper 3 points 11 hours ago I'm in an entirely separate organization than the Indians at our company, and they ping me to \"review once\" while having never spoken to me before. They find my name on shit from years ago and then just incessantly ping me to do their work. I completely ignore them, I'm just always irritated at how shitty they are. Additionally, all the hardest shit, core systems, infrastructure, etc. was built long ago by White Americans who could actually speak English. Nothing more worthless than a tech manager who's entirely separated from who they're managing and came from HR with a marketing or business degree. I'm convinced they're rarely ever working. We've actually busted ours in lies before and had their bullshit corrected by HR. permalink parent award report block reply Cetera 1 points 10 hours ago Damn... Can I work for you? permalink parent award report block reply\n5DchessWatch 8 points 13 hours ago btw, I'm not talking out of my ass.  I have 25 yrs experience coding and web dev and I've done some it managemnet with coding as well.  the really good coders you don't put them into management.  you take people with like phds in music and make them it managers because otherwise they're just going to sit on a trombone and wither away if you dont give them some work to do yes this sounds like dilbert tier but dilbert was fucking so accurate you wondered if it was satire or not poojeets make bad software and when you call tech support to support a shit product you inherited when you joined a company, you might end up being routed to a  lady that is fielding questions on a cellphone while they are washing their babies in the sink permalink parent award report block reply\nPied-Trumper 3 points 11 hours ago I'm in an entirely separate organization than the Indians at our company, and they ping me to \"review once\" while having never spoken to me before. They find my name on shit from years ago and then just incessantly ping me to do their work. I completely ignore them, I'm just always irritated at how shitty they are. Additionally, all the hardest shit, core systems, infrastructure, etc. was built long ago by White Americans who could actually speak English. Nothing more worthless than a tech manager who's entirely separated from who they're managing and came from HR with a marketing or business degree. I'm convinced they're rarely ever working. We've actually busted ours in lies before and had their bullshit corrected by HR. permalink parent award report block reply\nCetera 1 points 10 hours ago Damn... Can I work for you? permalink parent award report block reply\nstaroframphansbhole 6 points 13 hours ago Can definitely tell that your retarded ass doesn’t know shit about technology so consider sitting this one out champ permalink parent award report block reply\ncovok48 4 points 8 hours ago Fucking die. permalink parent award report block reply\ndrmrboy 27 points 13 hours ago Thanks for fucking us all over Trump.  That MAGA thing ... pure genius that you stole it from Regan and sold it to all of us again.   I'd rather be told the truth at this point than be lied to, because that would be a more noble pursuit than hiding behind whatever government(s) are doing to you ... you know ... the same deep state swampy goverments you told us you would go after.  Lol ... zero fucking arrests.  What a fucking joke. At least life was awesome during Regan and my Mom and Dad could afford groceries and a house. So you're going to make America a \"new golden age?\"  What exactly does that mean?  Something Israel cooked up?  P.S. ... make sure to send out a mean Truth tonight about some shit that won't be for Middle America.  Unbelievable.  That fucking statement you made on Laura Ingram's show was almost the end for me.  I'll give you one more chance to make things right as far as it is concerned to me personally.  Do the right thing sir ... do the right thing for God's sake.  😐 permalink award report block reply MageGills 9 points 12 hours ago I fully think this nothing-burger Epstein email leak was done solely to try to distract from Trump's horrendous interview where he was openly shitting on Americans. I've been very patient with him, but this really pushed me away. If it weren't for that email leak today, that interview is all anybody would be talking about. permalink parent award report block reply mav7579 5 points 12 hours ago He already got your vote! permalink parent award report block reply Viewer01 3 points 12 hours ago Saaar. Do the needful. permalink parent award report block reply\nMageGills 9 points 12 hours ago I fully think this nothing-burger Epstein email leak was done solely to try to distract from Trump's horrendous interview where he was openly shitting on Americans. I've been very patient with him, but this really pushed me away. If it weren't for that email leak today, that interview is all anybody would be talking about. permalink parent award report block reply\nmav7579 5 points 12 hours ago He already got your vote! permalink parent award report block reply\nViewer01 3 points 12 hours ago Saaar. Do the needful. permalink parent award report block reply\nBurneraccountno4 19 points 12 hours ago Yesterday we learned Trump thinks 50% of US colleges would go bust if not for the foreign students paying double the tuition to attend. The only reason they are paying double is so they can get a job in the USA and/or steal American IP. Meanwhile, those colleges use the money they get from foreign students to subsidize their radical communist propaganda programs designed to turn normal American children into mental case tranny school shooters and assassins of prominent conservatives. Trump already had a close call with one of these individuals, but he is clearly a slow learner. The fact is 50% of colleges absolutely need to go bust and their unemployed commie groomer professors need to be banned from ever teaching again. permalink award report block reply rebuildingMyself 1 points 2 hours ago Yes agreed. Between govt guaranteed school loans and foreigners paying 2x tuition, it's allowed these universities to prop up useless departments that churn out brainwashed commies with no valuable skills. DOGE needs to be set up in every single one and that cancer needs to be purged. Then they'd find themselves being able to compete far more effectively. permalink parent award report block reply\nrebuildingMyself 1 points 2 hours ago Yes agreed. Between govt guaranteed school loans and foreigners paying 2x tuition, it's allowed these universities to prop up useless departments that churn out brainwashed commies with no valuable skills. DOGE needs to be set up in every single one and that cancer needs to be purged. Then they'd find themselves being able to compete far more effectively. permalink parent award report block reply\nhazelknut 16 points 13 hours ago Bannon was all tongue-tied today. trying to spin it one minute, condemning it the next. kinda sad what Trump is saying to his base right now. permalink award report block reply\nGoUSA 16 points 13 hours ago Indians don't and can't innovate. They are drones with a bizarre amount of arrogance considering how unable they are to think creatively or pivot when life happens. I've been around them professionally in various capacity for 20 years. Button pushers at best and professional time wasters. None of them could ever take my job because they couldn't handle having a day that is 5% scripted permalink award report block reply\nScottx 14 points 12 hours ago I am seeing more and more H1B's at work. As a white guy our numbers are declining. permalink award report block reply\nlothrop_evola 14 points 12 hours ago If you read Charles Murray's book \"Human Accomplishment\" it shows that white men are responsible for about 95% of great inventions and accomplishments, over the past 2800 years. But suddenly, our society can't function unless we're swamped with 3rd worlders to save us \"lazy, entitled whites\". The propaganda level is completely ridiculous. permalink award report block reply\nsovereign_citizen 11 points 12 hours ago 85% of H1-B jobs go to entry level and junior level positions.\n70% of which are filled by Indians and another 10% by Chinese. permalink award report block reply\n5DchessWatch 10 points 13 hours ago Once upon a time I was making tibicos which is 'water kefir' made with a semi translucent biofilm that eats sugar in water. It was recommended to use piconcillo sugar which is natural brown sugar in these cones from latin america. Well one day I found that indian places have a similar thing called JAGGERY so I tried with JAGGERY.   The tibicos all died and there was like oily diesel bullshit floating to the top (like gas on a puddle in parking lot), and the water I used was the same, filtered water I always use. Jaggery is disgusting Indiamade bullshit that they sell and eat They eat diesel infected, unknown bits of ???? tainted industrial waste sugar called Jaggery This is all you literally need to know about India Fake food Disgusting landfill food from poors that MORE POOR THAN LATIN AMERICA They have lower standards than the poors of Latin america Nothing wrong with pooor, but You are judged by the fruits of your labor India Food = Bullshit Because Indians are bullshit USDA is bullshit too, because this got past them Probably some Indian phoneys in USDA gave this a pass This is one example among MANY.  I've basically stopped buying food from India.  Its either old.  Old and rancd.  New and Tainted with diesel and who in F knows what else.  Of unknown age and botulistic in nature.  Or just something dumb you ought not put into your mouth in the first place, full of EU banned substances, dyes (\"dies\" says it right in the name). Its all bad for you and so is India permalink award report block reply MediaBro 2 points 7 hours ago Funny thing is there is an episode of Simpsons that shows Apu keeping food in his aisles that has gone bad and still selling it past its use by dates. So, this has been the norm for a while. permalink parent award report block reply\nMediaBro 2 points 7 hours ago Funny thing is there is an episode of Simpsons that shows Apu keeping food in his aisles that has gone bad and still selling it past its use by dates. So, this has been the norm for a while. permalink parent award report block reply\nvongregormench 7 points 11 hours ago What innovation was brought to us by India? permalink award report block reply joggin_noggin 5 points 11 hours ago Zero, allegedly. permalink parent award report block reply Datamancer 5 points 11 hours ago Well .... street shitting for one. permalink parent award report block reply rebuildingMyself 1 points 2 hours ago The poop throwing festival was pretty unique tbf permalink parent award report block reply\njoggin_noggin 5 points 11 hours ago Zero, allegedly. permalink parent award report block reply\nDatamancer 5 points 11 hours ago Well .... street shitting for one. permalink parent award report block reply rebuildingMyself 1 points 2 hours ago The poop throwing festival was pretty unique tbf permalink parent award report block reply\nrebuildingMyself 1 points 2 hours ago The poop throwing festival was pretty unique tbf permalink parent award report block reply\nDenturesNancy 6 points 10 hours ago Trump must shake off his entourage asap, they are feeding him India shit and he is gobbling it.  Conservative Americans are the smartest most hard working people on earth.  yes we have retards but they are the product of the treasonous bastards democrats, so I try not to hold it against them.\nTrump, return to your base and to the MAGA roots, or this war is finished and America will never become great.  I suggest he does a few rallies to sync up with American people again. dammit permalink award report block reply\nNonyaDB 5 points 6 hours ago The problem with H1Bs are the rampant corruption brought on by a cheating mentality and the checklist mindset all H1Bs have. They're literally incapable of seeing 2nd, 3rd, 4th, 5th, etc. order effects on any systems under their purview, which is something that a lot Americans tend to do intuitively, quickly, and more efficiently than even AI does, at least when it comes to hardware and configurations. I'm constantly fixing H1B and off-shored IT admin mistakes on a daily basis at work. Take the installation and configuration of a typical ~300lbs 4U storage system. An H1B will just slap it in the rack and not once think about ensuring proper cable management so they won't cause an outage if they have to replace a part in a node or if they have to add additional storage systems in the future or hot-swap a switch or switch blade. They don't care because the task they were given was \"install that storage system in the rack\". The task never said anything about proper cable management because the person writing up the task thinks that everyone in IT would know to do that automagically. But only the Americans think ahead like that. That's just a small one of the hundreds of fuck-ups I've seen H1Bs and off-shored IT admins do over the years. The worst ones will try to blame me for their own fuck-ups and I don't stand for that shit at all. \"Who installed and configured the system?  That's right - not me.  It was you that did it wrong.  Don't ever try laying your mistakes at my feet again.\" permalink award report block reply\nSoldierOnFire 4 points 10 hours ago I do not agree with Trump on his H1B position. We need to invest in America and Americans. permalink award report block reply\nknnbccb 4 points 10 hours ago Then greed took over, outsourcing IT jobs to the jeets, then outsourcing sweatshops to the Chinks. Doesn't matter if they do a shoddy job or pose as a national security down the road, profit and instant gratification, that's the priority. Just need to kiss the ass of the shareholders and 'stakeholders' and they will toe the line. The love of money is the root of all evil. permalink award report block reply CommanderComadant 1 points 4 hours ago This is late stage capitalism. permalink parent award report block reply\nCommanderComadant 1 points 4 hours ago This is late stage capitalism. permalink parent award report block reply\nEvilGreed209 4 points 7 hours ago I was coding on computers in the 80's when most chinks were riding their bullshit bicycle to go pick rice for 14 hours.  Cut the shit they only want foreign workers because they are broken slaves who will lick boots and do the job for half the pay. permalink award report block reply\nGhost_Division 3 points 10 hours ago Someone fucked up the code and turned all the t's to d's. permalink award report block reply\ncovok48 3 points 8 hours ago Trump is trying to lose the midterms on purpose. Let him, permalink award report block reply\nPied-Trumper 2 points 11 hours ago We all thought that was what we voted for, she's right permalink award report block reply\nTellmeboutit2 2 points 9 hours ago Ask yourself whatever happened to Bell Labs permalink award report block reply\nbarronwin 2 points 7 hours ago Germans, Greeks, Italians, Irish, Chinese, now Mexicans. This country's history of immigration has never stopped being a shitshow. Deport them all, and I mean ALL permalink award report block reply MediaBro 1 points 7 hours ago Too late with the Germans. Half of White MAGA is likely German themselves. Also, you want to even kick out the Amish?? They're still German as fk. The Greeks are a very very small community.\nThey have more of a presence in Australia. Italians are like the Germans, as are the Irish. Chinese have been here since the Civil War days. Mexicans are... well... Mexicans. None of this is going to happen. permalink parent award report block reply\nMediaBro 1 points 7 hours ago Too late with the Germans. Half of White MAGA is likely German themselves. Also, you want to even kick out the Amish?? They're still German as fk. The Greeks are a very very small community.\nThey have more of a presence in Australia. Italians are like the Germans, as are the Irish. Chinese have been here since the Civil War days. Mexicans are... well... Mexicans. None of this is going to happen. permalink parent award report block reply\nZacPetkanas 1 points 53 minutes ago We went to the moon without Jeets and Chinamen. Deport, deport, deport permalink award report block reply\nPsalm-118_24 1 points 2 hours ago BRING BACK THIS POTUS...Statement by Donald J. Trump on Position on Visas\nMarch 03, 2016\n\"Megyn Kelly asked about highly-skilled immigration. The H-1B program is neither high-skilled nor immigration: these are temporary foreign workers, imported from abroad, for the explicit purpose of substituting for American workers at lower pay. I remain totally committed to eliminating rampant, widespread H-1B abuse and ending outrageous practices such as those that occurred at Disney in Florida when Americans were forced to train their foreign replacements. I will end forever the use of the H-1B as a cheap labor program, and institute an absolute requirement to hire American workers first for every visa and immigration program. No exceptions.\" permalink award report block reply\ntexas4ever 1 points 11 hours ago H1B is just for cheaper labor. Some higher level immigrants do create tremendous wealth in our country, however. permalink award report block reply\nCounterwhat 1 points 4 hours ago This was a way to lower wages. That is all. permalink award report block reply\nNanteen 1 points 4 hours ago How is it possible that there are countries out there that have technically Superior citizens that our companies need because there are none here.? We have the greatest institutions of learning in the world. Are they really trying to make us think that? Oh no! There's no one here that can work on this problem except some ending in the back water of India? With the exception of Cuban mechanics on 1950s cars, I can't imagine permalink award report block reply\nJanetRenosBallhair 1 points 6 hours ago I have been forced to teach chinks shit in powertrain for 20 straight years. They don’t get it until we literally give them all the IP. RIP Briggs and Stratton, told the VP to his face in 2011. Here we sit permalink award report block reply\nRobbybobbyrobbob 1 points 7 hours ago \"Was\"  is the keyword here. permalink award report block reply\nApersonofinterest 1 points 5 hours ago Natalie looks like she’s putting on baby weight. Is she preggo? permalink award report block reply\nSanityGumby 1 points 11 hours ago Yet retard we no longer manufacture any drugs here permalink award report block reply\nCommanderComadant 1 points 4 hours ago Reflecting back now- that Chinese kid, who’s dad worked at compaq or that Cambodian kid in the neighborhood whose family ran a donut shop (who had like 15 family in 1 house). The Muslim kid who wasn’t allowed to come outside and play soccer with us. This was 96. They were h1bs. Nice people, totally unnecessary. The beginning of the flood. permalink award report block reply\ngrannylovestrump -4 points 11 hours ago I think what Donald Trump is trying to tell everybody that it is all a balance and he is the Master at finding that balance and JD Vance too. Elon can be thrown into that mix and there are many others on that cabinet that has that balance which is so hard to find. Too far to the left or too far to the right is not the Goldilock zone and it does not sustain or allow life to thrive. And when your hearts on fire; you must realize...smoke gets in your eyes. I don't care what anybody says I adore Donald J Trump. I am so proud of his courage and his staying power. Monsters Inc is about to go through some incredible changes! Lions will lay down with lambs! We are surrounded by the Angels and it is overwhelming. Thank you Father God and please watch over our President and our Patriots.....God you are so good..... permalink award report block reply ACActual 12 points 11 hours ago 52% of Gen Z Graduates can't find jobs.  The middle ground on H1B'S is now zero.  This scam needs to end. permalink parent award report block reply grannylovestrump -4 points 11 hours ago Why  not regulated. Many of those Cubans down in Florida running from Communism voted Red and would stand by our side to fight. We just need to vet them better. Bring the cream of the crop and those that are left behind maybe they can see us succeeding economical which is what every wants AC/DC Money talks BS walks! and they can model themselves after that because technology is finally connecting the whole planet! That which is used for bad can be used for good..... permalink parent award report block reply ACActual 5 points 11 hours ago Until all Americans get a shot at the Pursuit of Happiness we need a Moratorium on all immigration.  Its our country and its being destroyed by foreigners.   Hint:  NYC.  Most of the country's problems can be solved with 50 million Deportations.  Housing, Cars, Healthcare, Inflation, food, loans, literally everything needed to get started as an American Citizen can be improved by Deportating, Denaturalizing Foreigners permalink parent award report block reply MediaBro 1 points 7 hours ago You don't have to deport the legal migrants. Just denaturalise them, have them pay 0 taxes and no govt benefits and tell them to leave in 10 yrs and most will still enthusiastically work for the US and leave. Then refocus on the White and other local population and give them all incentives to marry and have kids. permalink parent award report block reply Datamancer 4 points 11 hours ago First we put it to zero and wring out all the shit. Then we recalibrate it for the top 1% of global talent. permalink parent award report block reply Datamancer 6 points 11 hours ago A fucking balance?  Are you high?  It is a boat anchor tied around the neck of the white collar middle class. Fucking balance. permalink parent award report block reply grannylovestrump -3 points 11 hours ago He is like King Solomon praying to God to give him power over the demons that wish to destroy his people and his land. He is a good leader. We stand with our Commander in battle win or lose but I see God is at the helm anyway and no mortal man. Even President Trump knows that. permalink parent award report block reply\nACActual 12 points 11 hours ago 52% of Gen Z Graduates can't find jobs.  The middle ground on H1B'S is now zero.  This scam needs to end. permalink parent award report block reply grannylovestrump -4 points 11 hours ago Why  not regulated. Many of those Cubans down in Florida running from Communism voted Red and would stand by our side to fight. We just need to vet them better. Bring the cream of the crop and those that are left behind maybe they can see us succeeding economical which is what every wants AC/DC Money talks BS walks! and they can model themselves after that because technology is finally connecting the whole planet! That which is used for bad can be used for good..... permalink parent award report block reply ACActual 5 points 11 hours ago Until all Americans get a shot at the Pursuit of Happiness we need a Moratorium on all immigration.  Its our country and its being destroyed by foreigners.   Hint:  NYC.  Most of the country's problems can be solved with 50 million Deportations.  Housing, Cars, Healthcare, Inflation, food, loans, literally everything needed to get started as an American Citizen can be improved by Deportating, Denaturalizing Foreigners permalink parent award report block reply MediaBro 1 points 7 hours ago You don't have to deport the legal migrants. Just denaturalise them, have them pay 0 taxes and no govt benefits and tell them to leave in 10 yrs and most will still enthusiastically work for the US and leave. Then refocus on the White and other local population and give them all incentives to marry and have kids. permalink parent award report block reply Datamancer 4 points 11 hours ago First we put it to zero and wring out all the shit. Then we recalibrate it for the top 1% of global talent. permalink parent award report block reply\ngrannylovestrump -4 points 11 hours ago Why  not regulated. Many of those Cubans down in Florida running from Communism voted Red and would stand by our side to fight. We just need to vet them better. Bring the cream of the crop and those that are left behind maybe they can see us succeeding economical which is what every wants AC/DC Money talks BS walks! and they can model themselves after that because technology is finally connecting the whole planet! That which is used for bad can be used for good..... permalink parent award report block reply ACActual 5 points 11 hours ago Until all Americans get a shot at the Pursuit of Happiness we need a Moratorium on all immigration.  Its our country and its being destroyed by foreigners.   Hint:  NYC.  Most of the country's problems can be solved with 50 million Deportations.  Housing, Cars, Healthcare, Inflation, food, loans, literally everything needed to get started as an American Citizen can be improved by Deportating, Denaturalizing Foreigners permalink parent award report block reply MediaBro 1 points 7 hours ago You don't have to deport the legal migrants. Just denaturalise them, have them pay 0 taxes and no govt benefits and tell them to leave in 10 yrs and most will still enthusiastically work for the US and leave. Then refocus on the White and other local population and give them all incentives to marry and have kids. permalink parent award report block reply Datamancer 4 points 11 hours ago First we put it to zero and wring out all the shit. Then we recalibrate it for the top 1% of global talent. permalink parent award report block reply\nACActual 5 points 11 hours ago Until all Americans get a shot at the Pursuit of Happiness we need a Moratorium on all immigration.  Its our country and its being destroyed by foreigners.   Hint:  NYC.  Most of the country's problems can be solved with 50 million Deportations.  Housing, Cars, Healthcare, Inflation, food, loans, literally everything needed to get started as an American Citizen can be improved by Deportating, Denaturalizing Foreigners permalink parent award report block reply MediaBro 1 points 7 hours ago You don't have to deport the legal migrants. Just denaturalise them, have them pay 0 taxes and no govt benefits and tell them to leave in 10 yrs and most will still enthusiastically work for the US and leave. Then refocus on the White and other local population and give them all incentives to marry and have kids. permalink parent award report block reply\nMediaBro 1 points 7 hours ago You don't have to deport the legal migrants. Just denaturalise them, have them pay 0 taxes and no govt benefits and tell them to leave in 10 yrs and most will still enthusiastically work for the US and leave. Then refocus on the White and other local population and give them all incentives to marry and have kids. permalink parent award report block reply\nDatamancer 4 points 11 hours ago First we put it to zero and wring out all the shit. Then we recalibrate it for the top 1% of global talent. permalink parent award report block reply\nDatamancer 6 points 11 hours ago A fucking balance?  Are you high?  It is a boat anchor tied around the neck of the white collar middle class. Fucking balance. permalink parent award report block reply grannylovestrump -3 points 11 hours ago He is like King Solomon praying to God to give him power over the demons that wish to destroy his people and his land. He is a good leader. We stand with our Commander in battle win or lose but I see God is at the helm anyway and no mortal man. Even President Trump knows that. permalink parent award report block reply\ngrannylovestrump -3 points 11 hours ago He is like King Solomon praying to God to give him power over the demons that wish to destroy his people and his land. He is a good leader. We stand with our Commander in battle win or lose but I see God is at the helm anyway and no mortal man. Even President Trump knows that. permalink parent award report block reply\nGayPatriotMAGAUncle -5 points 12 hours ago That was 50 years ago, dumb cunt. Today's culture is completely different and H-1B's prosper in our current environment. When people don't have the skills needed we need legal immigration, something this women (revoke 19th amendment) doesn't clearly understand along with the stormfags here pushing anti-Trump propaganda. permalink award report block reply joggin_noggin 7 points 11 hours ago Of course H1Bs prosper in this environment with the deck rigged in their favor. permalink parent award report block reply vongregormench 6 points 11 hours ago We don’t need ANY immigration period. You think the world’s superpower got that way by begging other countries for help? If people don’t have the correct skills then wages for those positions should increase until Americans fill those jobs. Opening up the entire earth to fill a job opening repeated to infinity is lowering the American skill set and lowering American wages and quality of life. Almost every problem this country can be traced back to immigration of both legal and illegal types. permalink parent award report block reply\njoggin_noggin 7 points 11 hours ago Of course H1Bs prosper in this environment with the deck rigged in their favor. permalink parent award report block reply\nvongregormench 6 points 11 hours ago We don’t need ANY immigration period. You think the world’s superpower got that way by begging other countries for help? If people don’t have the correct skills then wages for those positions should increase until Americans fill those jobs. Opening up the entire earth to fill a job opening repeated to infinity is lowering the American skill set and lowering American wages and quality of life. Almost every problem this country can be traced back to immigration of both legal and illegal types. permalink parent award report block reply\npossibletower -19 points 13 hours ago Most of these industries haven't been in America since the 1980s. Retards here think that Antifa or BLM who lives in their mom's basements can train Americans to work in factories or tech 🤣 Trump is right. He is completely retarded on Chicom student visas though. permalink award report block reply drmrboy 7 points 13 hours ago 🖕🫵🤖. permalink parent award report block reply vongregormench 6 points 11 hours ago It’s posted twice. Totally a bot. permalink parent award report block reply Datamancer 3 points 11 hours ago Are you vaxxed or naturally retarded?  It isn't BLM or Antifa doing the training.  How many EMs and ETs exit the Navy every fucking month.   You think that cannot train on batteries, power systems,  and simply circuitry?  Same with Air Force and Army. Fucking fuck already.  But you do prove Trump's point - there are a lot of retards in America. permalink parent award report block reply\ndrmrboy 7 points 13 hours ago 🖕🫵🤖. permalink parent award report block reply vongregormench 6 points 11 hours ago It’s posted twice. Totally a bot. permalink parent award report block reply\nvongregormench 6 points 11 hours ago It’s posted twice. Totally a bot. permalink parent award report block reply\nDatamancer 3 points 11 hours ago Are you vaxxed or naturally retarded?  It isn't BLM or Antifa doing the training.  How many EMs and ETs exit the Navy every fucking month.   You think that cannot train on batteries, power systems,  and simply circuitry?  Same with Air Force and Army. Fucking fuck already.  But you do prove Trump's point - there are a lot of retards in America. permalink parent award report block reply\nSCHULTZ 1 points 11 hours ago Comment removed by community moderators. permalink award report block reply\nexpertnoticer 1 points 12 hours ago Comment removed by community filter, pending further review. permalink award report block reply"}