{"id": "1ARK9pemCz", "contents": "519 Pam Bondi is the Jeff Sessions of Bill Barrs posted 11 hours ago by EgregiousPhilbin 26 comments award share report block That's the post.\n26 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style MasterChief 20 points 11 hours ago STICKY! permalink award report block reply tpactionchasethevote 11 points 11 hours ago They weren't going to let Matt Gaetz in there.  Was there a deal to allow Tulsi, RFK, and Pete as long as we also took Pam?  The Senate RINOs are to blame. permalink parent award report block reply USDMaga 17 points 11 hours ago FBI is finding trafficked children, they are attempting to shut down the fentanyol.  They are better than Sessions for Barr for that. Now I said that, they are complete disappointment and because of their inaction, next DNC DOJ will jail them and we will be right back where we were before. permalink award report block reply OldZilla 11 points 11 hours ago If initiative was gasoline, Bondi wouldn't have enough to power a mini bike around a b b. permalink award report block reply MAGAguitar 8 points 11 hours ago Gold Bondi! permalink award report block reply guywholikesDjtof2024 9 points 11 hours ago SCAM PONZI!!!! permalink parent award report block reply Mortal_Wombat 1 points 2 hours ago Bill Barrbie! permalink parent award report block reply 5DchessWatch 1 points 10 hours ago She can get sacked permalink parent award report block reply TheSwampThang 6 points 10 hours ago I don't know, she's kinda like the Trey Gowdy of Jim Jordans. permalink award report block reply Tiberius1 6 points 11 hours ago Scam Blondi needs thrown out for being a dumb lazy bitch. permalink award report block reply 5DchessWatch 5 points 10 hours ago She's all bucket no chicken permalink award report block reply Hanging_Chad 4 points 11 hours ago post of the year permalink award report block reply GayPatriotMAGAUncle 4 points 7 hours ago If Trump ever decides to kick her out, I hope they leak her nudes. She's pretty sexy for a 60 year old. 😋 permalink award report block reply keeman 2 points 8 hours ago She is less destructive than those others so far.  Her job seems to be to just gum up the works and make sure nothing MAGA gets done while continuing the usual swampy stuff. permalink award report block reply Nanteen 2 points 4 hours ago I don't like to brag but my 13 yo. Has arrested as many swamp dwellers as Pam bondi permalink award report block reply Treefiddydiddy 2 points 5 hours ago I like her 6 pointed star necklace permalink award report block reply pickleball_jones 1 points 45 seconds ago Comment removed by community filter, pending further review. permalink parent award report block reply Liberalism_is_mental 2 points 11 hours ago Still waiting for the pipe bomber to be arrested.  Total crickets. permalink award report block reply skywalk 1 points 2 hours ago Kinda sorta. permalink award report block reply Accountable_Ish 1 points 2 hours ago Right? Like, who keeps picking these retards? permalink award report block reply YodaBannon 1 points 11 hours ago is everyone on dope? permalink award report block reply Raetchel 1 points 11 hours ago you're not wrong permalink award report block reply pray4peace4 1 points 11 hours ago Well... she didn't recuse herself yet, & she is prosecuting folks like Newsom's Chief of Staff, so I don't think your comparison is anything but a fantasy. permalink award report block reply Protonboy 2 points 9 hours ago If we don't know the name of the prosecutee, it ain't even permalink parent award report block reply hellohellohellohell 2 points 11 hours ago \"she is prosecuting folks like Newsom's Chief of Staff\" What's this now? permalink parent award report block reply\nMasterChief 20 points 11 hours ago STICKY! permalink award report block reply tpactionchasethevote 11 points 11 hours ago They weren't going to let Matt Gaetz in there.  Was there a deal to allow Tulsi, RFK, and Pete as long as we also took Pam?  The Senate RINOs are to blame. permalink parent award report block reply\ntpactionchasethevote 11 points 11 hours ago They weren't going to let Matt Gaetz in there.  Was there a deal to allow Tulsi, RFK, and Pete as long as we also took Pam?  The Senate RINOs are to blame. permalink parent award report block reply\nUSDMaga 17 points 11 hours ago FBI is finding trafficked children, they are attempting to shut down the fentanyol.  They are better than Sessions for Barr for that. Now I said that, they are complete disappointment and because of their inaction, next DNC DOJ will jail them and we will be right back where we were before. permalink award report block reply\nOldZilla 11 points 11 hours ago If initiative was gasoline, Bondi wouldn't have enough to power a mini bike around a b b. permalink award report block reply\nMAGAguitar 8 points 11 hours ago Gold Bondi! permalink award report block reply guywholikesDjtof2024 9 points 11 hours ago SCAM PONZI!!!! permalink parent award report block reply Mortal_Wombat 1 points 2 hours ago Bill Barrbie! permalink parent award report block reply 5DchessWatch 1 points 10 hours ago She can get sacked permalink parent award report block reply\nguywholikesDjtof2024 9 points 11 hours ago SCAM PONZI!!!! permalink parent award report block reply\nMortal_Wombat 1 points 2 hours ago Bill Barrbie! permalink parent award report block reply\n5DchessWatch 1 points 10 hours ago She can get sacked permalink parent award report block reply\nTheSwampThang 6 points 10 hours ago I don't know, she's kinda like the Trey Gowdy of Jim Jordans. permalink award report block reply\nTiberius1 6 points 11 hours ago Scam Blondi needs thrown out for being a dumb lazy bitch. permalink award report block reply\n5DchessWatch 5 points 10 hours ago She's all bucket no chicken permalink award report block reply\nHanging_Chad 4 points 11 hours ago post of the year permalink award report block reply\nGayPatriotMAGAUncle 4 points 7 hours ago If Trump ever decides to kick her out, I hope they leak her nudes. She's pretty sexy for a 60 year old. 😋 permalink award report block reply\nkeeman 2 points 8 hours ago She is less destructive than those others so far.  Her job seems to be to just gum up the works and make sure nothing MAGA gets done while continuing the usual swampy stuff. permalink award report block reply\nNanteen 2 points 4 hours ago I don't like to brag but my 13 yo. Has arrested as many swamp dwellers as Pam bondi permalink award report block reply\nTreefiddydiddy 2 points 5 hours ago I like her 6 pointed star necklace permalink award report block reply pickleball_jones 1 points 45 seconds ago Comment removed by community filter, pending further review. permalink parent award report block reply\npickleball_jones 1 points 45 seconds ago Comment removed by community filter, pending further review. permalink parent award report block reply\nLiberalism_is_mental 2 points 11 hours ago Still waiting for the pipe bomber to be arrested.  Total crickets. permalink award report block reply\nskywalk 1 points 2 hours ago Kinda sorta. permalink award report block reply\nAccountable_Ish 1 points 2 hours ago Right? Like, who keeps picking these retards? permalink award report block reply\nYodaBannon 1 points 11 hours ago is everyone on dope? permalink award report block reply\nRaetchel 1 points 11 hours ago you're not wrong permalink award report block reply\npray4peace4 1 points 11 hours ago Well... she didn't recuse herself yet, & she is prosecuting folks like Newsom's Chief of Staff, so I don't think your comparison is anything but a fantasy. permalink award report block reply Protonboy 2 points 9 hours ago If we don't know the name of the prosecutee, it ain't even permalink parent award report block reply hellohellohellohell 2 points 11 hours ago \"she is prosecuting folks like Newsom's Chief of Staff\" What's this now? permalink parent award report block reply\nProtonboy 2 points 9 hours ago If we don't know the name of the prosecutee, it ain't even permalink parent award report block reply\nhellohellohellohell 2 points 11 hours ago \"she is prosecuting folks like Newsom's Chief of Staff\" What's this now? permalink parent award report block reply"}