{"id": "1ARK58zo41", "contents": "267 ICE Has Received More Than 200,000 Job Applications: DHS (www.theepochtimes.com) posted 4 days ago by TateDemarcus 6 comments award share report block ICE Has Received More Than 200,000 Job Applications: DHS The Coast Guard and the Citizenship and Immigration Services are also reporting record interest from candidates. www.theepochtimes.com\n6 comments Sort by Top Top New Worst Old Save TRUMPWON2020BYALOT 7 points 4 days ago Hire them all permalink award report block reply Stlpoolguy 2 points 4 days ago Probably lots of pinko infiltraters trying to gum up the works.  Hire former military permalink parent award report block reply AwShitHereWeGoAgain 3 points 4 days ago Load 'em up and deport all the illegals. permalink award report block reply PatriotSkorzeny 1 points 4 days ago It’ll be 2028 before deportations start, but by then they’ll be hunting maga. 😒 permalink award report block reply mikethemarine 1 points 4 days ago vet the shit out of them, Antifa said they were going to apply and hid them or let them go permalink award report block reply Albertepstein32 1 points 3 days ago Great more government workers sucking off taxpayer dollars. How about instead we end the welfare state so the parasites stop coming here? permalink award report block reply\nTRUMPWON2020BYALOT 7 points 4 days ago Hire them all permalink award report block reply Stlpoolguy 2 points 4 days ago Probably lots of pinko infiltraters trying to gum up the works.  Hire former military permalink parent award report block reply\nStlpoolguy 2 points 4 days ago Probably lots of pinko infiltraters trying to gum up the works.  Hire former military permalink parent award report block reply\nAwShitHereWeGoAgain 3 points 4 days ago Load 'em up and deport all the illegals. permalink award report block reply\nPatriotSkorzeny 1 points 4 days ago It’ll be 2028 before deportations start, but by then they’ll be hunting maga. 😒 permalink award report block reply\nmikethemarine 1 points 4 days ago vet the shit out of them, Antifa said they were going to apply and hid them or let them go permalink award report block reply\nAlbertepstein32 1 points 3 days ago Great more government workers sucking off taxpayer dollars. How about instead we end the welfare state so the parasites stop coming here? permalink award report block reply"}