{"id": "1ARK9mHETS", "contents": "168 Upwards of 90% of job applications sent by Gen Z college grads in STEM fields are denied.\n\nWe have plenty of talented people here.\n\nGreed cannot come before our nation’s children. posted 16 hours ago by PiratePatriotParrot 4 comments award share report block Gabe Guidarini @GabeGuidarini • 20h Upwards of 90% of job applications sent by Gen Z college grads in STEM fields are denied. We have plenty of talented people here. Greed cannot come before our nation’s children.\n4 comments Sort by Top Top New Worst Old Save Around the Web jcd_007 10 points 15 hours ago We have an opportunity to turn young people to the right if we address this issue. Why are qualified Americans being passed over for foreigners? permalink award report block reply possibletower 1 points 15 hours ago Fuck Gen Z. They are the most libshit generation in history and they aren't \"turning on Trump\" because they never voted for Trump. Also Gen Z wants Trump to do socialist price controls on housing and food and healthcare. Fuck Gen Z permalink parent award report block reply mandarb916 4 points 13 hours ago I wouldn't hire Gen Z. A pet rock has a better work ethic than them. If I didn't have enough budget to hire at least an American xennial, I'd rather not hire. Yes.  I said it.  Fight me. permalink award report block reply possibletower 1 points 15 hours ago Fuck Gen Z. They are the most libshit generation in history and they aren't \"turning on Trump\" because they never voted for Trump. Also Gen Z wants Trump to do socialist price controls on housing and food and healthcare. Fuck Gen Z permalink award report block reply\njcd_007 10 points 15 hours ago We have an opportunity to turn young people to the right if we address this issue. Why are qualified Americans being passed over for foreigners? permalink award report block reply possibletower 1 points 15 hours ago Fuck Gen Z. They are the most libshit generation in history and they aren't \"turning on Trump\" because they never voted for Trump. Also Gen Z wants Trump to do socialist price controls on housing and food and healthcare. Fuck Gen Z permalink parent award report block reply\npossibletower 1 points 15 hours ago Fuck Gen Z. They are the most libshit generation in history and they aren't \"turning on Trump\" because they never voted for Trump. Also Gen Z wants Trump to do socialist price controls on housing and food and healthcare. Fuck Gen Z permalink parent award report block reply\nmandarb916 4 points 13 hours ago I wouldn't hire Gen Z. A pet rock has a better work ethic than them. If I didn't have enough budget to hire at least an American xennial, I'd rather not hire. Yes.  I said it.  Fight me. permalink award report block reply\npossibletower 1 points 15 hours ago Fuck Gen Z. They are the most libshit generation in history and they aren't \"turning on Trump\" because they never voted for Trump. Also Gen Z wants Trump to do socialist price controls on housing and food and healthcare. Fuck Gen Z permalink award report block reply"}