{"id": "1ARK9iqP1K", "contents": "248 Rich Baris: \"Republicans had 12 months since Trump's victory to fund and expand registration and ballot chasing efforts like  @10xvotes, @TPUSA, etc. Instead, donors pulled money and threatened Charlie over event speakers. Elon Musk was cut out at the beginning. Nice job in Pennsylvania!\" posted 2 days ago by raptoris2 7 comments award share report block Rich Baris The People's Pundit @Peoples_Pundit • 2d Republicans had 12 months since Trump's victory to fund and expand registration and ballot chasing efforts like @10xvotes, @TPUSA, etc. Instead, donors pulled money and threatened Charlie over event speakers. @elonmusk was cut out at the beginning. Nice job in Pennsylvania!\n7 comments Sort by Top Top New Worst Old Save Givesgunstogrannies 4 points 2 days ago Good tweet.  Rich Baris is great permalink award report block reply cyberwar 3 points 2 days ago ze juice permalink award report block reply MAGA_VANGUARD 3 points 2 days ago They KILLED Charlie, this faggot doesnt remember that? permalink award report block reply OpusX 3 points 2 days ago Fake news media, Democrats, corrupt courts, intel agencies, foreign governments, assassins... None of them could stop President Trump... Until he met the Republicans. permalink award report block reply _Sully_ 2 points 2 days ago What speakers did they have problems with? permalink award report block reply TheTelltaleFly 2 points 2 days ago Designed to lose. permalink award report block reply patrioticwinning3 1 points 2 days ago No secure elections = America, and Trump fall... permalink award report block reply\nGivesgunstogrannies 4 points 2 days ago Good tweet.  Rich Baris is great permalink award report block reply\ncyberwar 3 points 2 days ago ze juice permalink award report block reply\nMAGA_VANGUARD 3 points 2 days ago They KILLED Charlie, this faggot doesnt remember that? permalink award report block reply\nOpusX 3 points 2 days ago Fake news media, Democrats, corrupt courts, intel agencies, foreign governments, assassins... None of them could stop President Trump... Until he met the Republicans. permalink award report block reply\n_Sully_ 2 points 2 days ago What speakers did they have problems with? permalink award report block reply\nTheTelltaleFly 2 points 2 days ago Designed to lose. permalink award report block reply\npatrioticwinning3 1 points 2 days ago No secure elections = America, and Trump fall... permalink award report block reply"}