{"id": "1ARK9oXChY", "contents": "24 🗣️\"MAGA is dead\"-\n\nSorry, but I'm too busy celebrating the first year of negative net migration in over half a century. posted 20 minutes ago by DeusVult1096 8 comments award share download report block\n8 comments Sort by Top Top New Worst Old Save Around the Web Zskills 3 points 10 minutes ago Great start on the budget they had.  I'm hoping for a doubling in July - December and another doubling for Jan - Jun 2026. By 2028 we need minimum 30 million gone permalink award report block reply Trooph-Hurts 3 points 18 minutes ago These people can’t let go of the idea of a bigger economy, a bigger economy, a bigger economy, a bigger economy……. The big economy is false and fake…. Everybody has to take a haircut and the economy has to be smaller and then we rebuild from there permalink award report block reply patrioticwinning3 2 points 12 minutes ago How does firing American workers, then giving their jobs to people overseas, who were educated in the US with US taxpayer money, make the AMERICAN economy bigger? permalink parent award report block reply Zskills 1 points 10 minutes ago But infinity 3rd worlders spending gibs increases GDP per capita measured in dollars.  Why do you hate the economy? permalink parent award report block reply Wrexxis780 1 points 1 minute ago Big economy means jack shit if tons of Americans are in poverty and can’t afford a house while foreigner have all the jobs permalink parent award report block reply patrioticwinning3 2 points 13 minutes ago I don't think its dead... I just think someone has been slipping Trump Retard Juice and he has been lapping it up.  AMERICA FIRST! permalink award report block reply lostmyoldpassword 1 points 10 minutes ago Unless you've been paying attention to New for the last hour - you won't know how batshit pyschopath behavior this post is.  But I assure you, it is. permalink award report block reply Nat4Pat 1 points 4 minutes ago Don't forget in 2024 there were 800k legal naturalizations. This year more could mean it's reaching 1m. permalink award report block reply\nZskills 3 points 10 minutes ago Great start on the budget they had.  I'm hoping for a doubling in July - December and another doubling for Jan - Jun 2026. By 2028 we need minimum 30 million gone permalink award report block reply\nTrooph-Hurts 3 points 18 minutes ago These people can’t let go of the idea of a bigger economy, a bigger economy, a bigger economy, a bigger economy……. The big economy is false and fake…. Everybody has to take a haircut and the economy has to be smaller and then we rebuild from there permalink award report block reply patrioticwinning3 2 points 12 minutes ago How does firing American workers, then giving their jobs to people overseas, who were educated in the US with US taxpayer money, make the AMERICAN economy bigger? permalink parent award report block reply Zskills 1 points 10 minutes ago But infinity 3rd worlders spending gibs increases GDP per capita measured in dollars.  Why do you hate the economy? permalink parent award report block reply Wrexxis780 1 points 1 minute ago Big economy means jack shit if tons of Americans are in poverty and can’t afford a house while foreigner have all the jobs permalink parent award report block reply\npatrioticwinning3 2 points 12 minutes ago How does firing American workers, then giving their jobs to people overseas, who were educated in the US with US taxpayer money, make the AMERICAN economy bigger? permalink parent award report block reply\nZskills 1 points 10 minutes ago But infinity 3rd worlders spending gibs increases GDP per capita measured in dollars.  Why do you hate the economy? permalink parent award report block reply\nWrexxis780 1 points 1 minute ago Big economy means jack shit if tons of Americans are in poverty and can’t afford a house while foreigner have all the jobs permalink parent award report block reply\npatrioticwinning3 2 points 13 minutes ago I don't think its dead... I just think someone has been slipping Trump Retard Juice and he has been lapping it up.  AMERICA FIRST! permalink award report block reply\nlostmyoldpassword 1 points 10 minutes ago Unless you've been paying attention to New for the last hour - you won't know how batshit pyschopath behavior this post is.  But I assure you, it is. permalink award report block reply\nNat4Pat 1 points 4 minutes ago Don't forget in 2024 there were 800k legal naturalizations. This year more could mean it's reaching 1m. permalink award report block reply"}