{"id": "1ARK9nNzAV", "contents": "1302 BREAKING: Judicial Activism in Utah. A judge just OVERTURNED the GOP-passed congressional map in deep-red Utah — and forced a Democrat-favored map instead. Translation: A judge just handed Democrats a seat in a state Trump won by nearly 30 points. They can’t win elections, so they change the rules. posted 6 hours ago by Mr_Rightside 145 comments award share report block Tony Lane 🇺🇸 @TonyLaneNV • 1d BREAKING: Judicial Activism in Utah A judge just OVERTURNED the GOP-passed congressional map in deep-red Utah — and forced a Democrat-favored map instead. Translation: A judge just handed Democrats a seat in a state Trump won by nearly 30 points. They can’t win elections, so\n145 comments Sort by Top Top New Worst Old Save DJTXLV 151 points 6 hours ago Find another judge to block that judge. permalink award report block reply Mr_Rightside OP 40 points 6 hours ago Which judge can block her, only someone from her district or any judge in Utah? If only from her district, she's from Utah's Third District and serves Salt Lake, Summit, and Tooele counties. List of 40 Third District Court Judges Articles of impeachment are being filed against Dianna Gibson, and her ruling is being appealed. Utah Governor Spencer Cox supports the legislation appealing the court's decision. Utah House of Representatives Matt MacPherson: I have opened a bill to file articles of impeachment against Judge Gibson for gross abuse of power, violating the separation of powers and failing to uphold her oath of office to the Utah Constitution. Utah House of Representatives Matt MacPherson: It’s being appealed also. Utah Governor Spencer Cox: The Utah Constitution clearly states that it is the responsibility of the Legislature to divide the state into congressional districts. While I respect the Court’s role in our system, no judge, and certainly no advocacy group, can usurp that constitutional authority. For this reason, I fully support the Legislature appealing the Court’s decision. Utah Republicans have 61/75 House seats. Utah Republicans have 22/29 Senate seats. So couldn't Republicans just vote against the map? All 5 Justices in Utah's Supreme Court are Republican as well. permalink parent award report block reply RoboGerbil 28 points 6 hours ago It's never slowed the Dems down. Send a Florida judge for all anyone cares. Also isn't this judicial overreach? Who's going to enforce it? permalink parent award report block reply TGNX 20 points 5 hours ago Just ignore the judge. permalink parent award report block reply mikethemarine 17 points 4 hours ago THIS, Judges aren't allowed to make laws from the bench, they are ONLY allowed to enforce laws MADE by congress, and the congress MADE a law to show where the voting districts are. Tell him or her to just fuck off EDIT: also impeach the piece of shit and remove them from office permalink parent award report block reply view 1 more comments... Shitsbrokeyo 4 points 5 hours ago Next one up in the food chain permalink parent award report block reply NotYourMan 9 points 4 hours ago Hmmm... King Judge is really the democrat way.  We see a demographic consistency in the judges that believe they have more power than the executive branch just like we saw that with Letitia and Fani. permalink parent award report block reply Yawnz13 5 points 3 hours ago Or just boot the judge. https://kutv.com/news/politics/utah-lawmaker-begins-process-to-impeach-judge-after-congressional-map-ruling permalink parent award report block reply Trump4prez 2 points 3 hours ago \"no kings\" But they want judges who make laws out of thin air and strike down laws out representatives make permalink parent award report block reply mass55th 2 points 2 hours ago They can appeal all the way to the Supreme Court can't they? permalink parent award report block reply surgeriot 2 points 50 minutes ago Yup, just in time to miss midterms permalink parent award report block reply Seatacjoe 1 points 1 hour ago hang tight, so we will be able to do the same in California? permalink parent award report block reply load 1 more comments... y_do_i_need_to_hide 61 points 6 hours ago That is not legal. Who knows if there are laws after elections are stolen? permalink award report block reply RedCalifornia 24 points 6 hours ago Of course there aren’t. However, men traded their birthright and responsibility for light beer and football decades ago. permalink parent award report block reply 45isthebomb 3 points 4 hours ago Nobody's drinking lite beer.... permalink parent award report block reply vongregormench 4 points 3 hours ago Boomers drink it. permalink parent award report block reply Yawnz13 -2 points 3 hours ago Boomers aren't even the problem. permalink parent award report block reply view 1 more comments... y_do_i_need_to_hide 2 points 5 hours ago Maybe. I have no idea how we would find out without trusting some media outlets word for it. permalink parent award report block reply IForgotToAddAnEmail 3 points 5 hours ago Please MSM, tell me what I want to hear! permalink parent award report block reply y_do_i_need_to_hide -1 points 5 hours ago This is the scam in general. Americans believe what we want.\nWhether you thought napkins would save you or that Israel is our greatest ally, they stole your vote. permalink parent award report block reply InfinitesimalOrange 3 points 1 hour ago Breaking the law no longer gives me any pause. I will do whatever I want, exactly when I want, just like all these rapists, traitors, and murderers. Anyone who tries to stop me will lose the game of minesweeper. permalink parent award report block reply drattastic1 3 points 2 hours ago When do outt elected \" leaders\" start ignoring these non elected criminals with black robes? permalink parent award report block reply y_do_i_need_to_hide 3 points 2 hours ago As soon as we do. There are no laws, 2020 proved that. There is only whether we comply. permalink parent award report block reply someguy7738 3 points 3 hours ago Laws only matter if you lose. permalink parent award report block reply Appeal2Heaven98 1 points 5 hours ago Quit bitching and vote harder, tax slave! /s permalink parent award report block reply y_do_i_need_to_hide 2 points 3 hours ago I am still on \"will not comply\" :) permalink parent award report block reply Mr_Rightside OP 35 points 6 hours ago Judge Dianna Gibson ruled just before a midnight deadline that the Legislature’s map “unduly favors Republicans and disfavors Democrats.” The new map, drawn by plaintiffs including the League of Women Voters of Utah and Mormon Women for Ethical Government, consolidates Salt Lake County into a single district, creating a stronger opportunity for Democrats to win a seat. Judge Dianna M. Gibson was appointed to the Third District Court in October 2018 by Governor Gary R. Herbert. She took the bench in January 2019 and serves Salt Lake, Summit, and Tooele counties. Utah House of Representatives Matt MacPherson: I have opened a bill to file articles of impeachment against Judge Gibson for gross abuse of power, violating the separation of powers and failing to uphold her oath of office to the Utah Constitution. Utah House of Representatives Matt MacPherson: It’s being appealed also. Utah Republicans have 61/75 House seats. Utah Republicans have 22/29 Senate seats. All 5 Justices in Utah's Supreme Court are Republican. In redistricting Republicans are up by +7, Democrats are by +5, possibly +6 if Gibson's ruling isn't reversed. Republicans +7 North Carolina +1 ✅ Missouri +1 ✅ Texas +5 ✅ Democrats +5, possibly +6 California +5 ✅ (Prop 50) Utah +1 (Not voted on, hopefully reversed) permalink award report block reply MikeTruk 48 points 6 hours ago Woman judge 🥱 permalink parent award report block reply yeptheguy 9 points 6 hours ago Shocking. permalink parent award report block reply Lady_MaGa -5 points 5 hours ago Oh stop that bullsht.  Men judges do the same thing. permalink parent award report block reply IForgotToAddAnEmail 7 points 5 hours ago Yeah, in all honestly the biggest issue is Soros paid off shit. But sincerely,  you need to stop being so offended that someone says women on this site. You're doing the thing - that caused most to start degrading women. Also, men don't get their fucking wads in a twist when calling out other men. permalink parent award report block reply Lady_MaGa -4 points 4 hours ago I'm doing \"the thing\" that causes men to degrade women? What? By pointing out that men do the same thing?  I guess you are saying when men do bad it is ok and not to be mentioned, but if a woman does a bad thing, it must be pointed out and make men hate women.  Such a slanted view of human beings.  And your comment about men not getting their fucking wads in a twist when calling out other men, eh hem, you know how many times I've seen on this site men calling other men faggots, losers, fucktards, idiots, etc etc?  Please check yourself. permalink parent award report block reply view 1 more comments... Moose_Antlers 2 points 3 hours ago Let's be honest about it, women are more likely to support the Left. Among the Left, it's the affluent, educated white women who are implementing and driving the push to socialism. They do it based on a moral imperative. Socialism frames the world with a new moral imperative: to create 'equal,' equity (everyone has the same amount) not equality (everyone has the same chance to succeed if they do the work). This is a moral imperative. This is critical because it allows justification of the use of power to force this goal to be achieved. You can steal from people who have stuff to give it to those who don't. You can enslave a skilled man and force him to provide \"equal\" services to those who want or need them. And you can ignore laws and corruptly wield power so long as it advances this goal of 'equal.' Women do this with a much higher propensity than men and with more zealotry because they believe in the moral component of this. So yes, male judges are part of the picture, but we're seeing a lot more of the worst activism out of female judges. It's the female judges letting black and brown criminals out of the prisons as fast as they can because they're creating 'equal' representation in the prisons. It doesn't matter if they're criminals, there are too many in the jails, you see? It's the same with these female judges trying to keep Kilmar Abrego Garcia, a known MS-13 gangster and wifebeater, in the US. They take the side of the illegal alien out of sympathy and a drive to remake America with less white people in it. 'Equal,' you see? It's not a both-sides thing. It simply reflects the demographics of the Left in the West. Don't get unnecessarily defensive. permalink parent award report block reply DeltaSierra 1 points 5 hours ago Correct.  However, I would clarify that the loner losers and antifa types that infect this site aren’t real men they are deranged boys.  This site is infected with these losers.  They can’t have a normal relationship with a woman so they hate women.  These anti-female types are very similar to many of the men in the Muslim culture they hate on.  Very strange people. permalink parent award report block reply Iremembermypassword 5 points 5 hours ago Thank god you will help them become functional members of society and allies to our side and not shit on them for no reason. Those are our guys, who are being beaten down by the Dems and we should help them. permalink parent award report block reply view 1 more comments... Aquamine-Amarine -2 points 4 hours ago They're no better than man hating feminists. permalink parent award report block reply Aquamine-Amarine 1 points 4 hours ago Thank you. Leftism is the problem, not sex. permalink parent award report block reply magaspif 3 points 4 hours ago Yeah it's just that more women support leftism than men. permalink parent award report block reply view 1 more comments... glow-operator-2-0 16 points 6 hours ago Incarcerate the judge along with their family, if needed. permalink parent award report block reply BlockWorks 6 points 6 hours ago There is a lawsuit over Prop 50 (but not holding my breath on that) permalink parent award report block reply vongregormench 0 points 3 hours ago The argument is weak. They’re claiming the districts are based on race. I think they’d have to prove that and I bet they can’t. permalink parent award report block reply Ptannerdactyl 2 points 4 hours ago I think this is great precedent actually. If the reasoning is that the districting is “unduly favors one side” and one can redraw from it, Republicans stand to gain a lot of seats. California will have an immediate challenge, as well as places like Massachusetts. permalink parent award report block reply ciaramella_is_gay 2 points 5 hours ago Laughs in California permalink parent award report block reply AVeryNakedMan 28 points 6 hours ago Just ignore the judge's ruling and run elections with the legislature-created districts. Didn't Republicans do that successfully in Ohio? permalink award report block reply hansgruber7 26 points 6 hours ago Republicans need to get better about the judges they appoint.  No more women judges. permalink award report block reply gaijin_ronin 18 points 6 hours ago We need less judges, of all kinds, at every level. permalink parent award report block reply Washington_Redskins 7 points 5 hours ago Any future Federal Judges we have should be vetted by Clarence Thomas. permalink parent award report block reply Reefay 4 points 4 hours ago Why haven't we been working on Clarence clones for the last 20 years? Can you imagine USSC with 9 Clarences? permalink parent award report block reply Lady_MaGa -4 points 5 hours ago So, are you then giving Boasberg a pass? permalink parent award report block reply hansgruber7 3 points 4 hours ago No.  You seem to struggle with reading comprehension. permalink parent award report block reply Aquamine-Amarine 0 points 4 hours ago They always forget the stupid male judges that exist. permalink parent award report block reply Lady_MaGa 1 points 1 hour ago Look at all my downvotes.  I wear them with pride because it proves that many men around here are either paid to divide us or they are just plain idiots not realizing their outlandish disrespect for women, and other people, is the very reason women, and other people, gather in groups and become radicalized against these crazy men. permalink parent award report block reply Lol_Garrus 25 points 6 hours ago We are surrounded. EU Globalists Muslims invaders Jeet scammers Illegal aliens Chinese spies Feral blacks Antifa Communists Socialist karens Tyrannical judges Jewish subversives Deep state cronies All of them working, not necessarily together, against Christian Whites. permalink award report block reply mojorisen 7 points 5 hours ago Yep and many in MAGA angrily expect Trump to have defeated all of them in 10 months.  A feat that would take at least a generation to accomplish. permalink parent award report block reply rebuildingMyself 5 points 3 hours ago A generation of work with a govt all on board with it at that permalink parent award report block reply awsure 17 points 6 hours ago Appeal permalink award report block reply Wtf_socialismreally 30 points 6 hours ago Remove them from office and hang them as a traitor to the ideals that we are meant to uphold. A bit harsh? Perhaps. But judicial activism is getting too common. Well, instead of going that far the local gov should at least vote to impeach and remove. permalink parent award report block reply LineInTheSand -3 points 4 hours ago The judge waited until the last day to make her ruling.  The deadline to change the districting map has passed, so any appeal will not affect the 2026 elections. permalink parent award report block reply Ivleeeg 5 points 4 hours ago This is not correct. Yes, that's her strategy but the appeal, if successful will reinstate the republican map for 2026. permalink parent award report block reply Gadsden 14 points 6 hours ago Not sure they understand what happens if they don't let us do this legally. permalink award report block reply Bramage 12 points 6 hours ago Yet another degenerate overstepping judge that needs the US Marshals to arrest her. permalink award report block reply victory2024 3 points 3 hours ago What happens after someone is arrested? They are brought before a judge. And judges protect their own. permalink parent award report block reply Yawnz13 1 points 3 hours ago jUdGeS pRoTeCt ThEiR oWn! https://www.cbsnews.com/losangeles/news/orange-county-judge-sentenced-to-life-in-prison-for-killing-his-wife-in-2023/ permalink parent award report block reply victory2024 2 points 1 hour ago Do you really think that relates at all to what we are talking about? A judge being charged for literal murder has nothing in common with arresting judges for their legal rulings. permalink parent award report block reply johnparker 11 points 6 hours ago Moore v Harper 2023 makes it clear that General Assemblies have power to draw maps as they see fit. permalink award report block reply tt777 2 points 3 hours ago Haha... you think liberal judges give a shit about that? permalink parent award report block reply Kalamander85 11 points 6 hours ago How is that legal? permalink award report block reply lifeisahologram 13 points 6 hours ago Didn’t you take a civics class? The rule of law goes 1. lower court judges control and rule everyone and everything and everyone has to do whatever they say And well there is no 2nd law that is the only rule apparently permalink parent award report block reply Iremembermypassword 8 points 5 hours ago The 2nd law is that this may only ever benefit Democrats. permalink parent award report block reply KernalMustard 8 points 6 hours ago I said this would happen. Everyone was cheering. I said they would countermove. This a rerun and predictable permalink award report block reply A_Colostomy_Bag 6 points 5 hours ago It's long past time that our side responds with the same coordinated lawfare.  The Democrats are more than willing to destroy the entire country to rule over the ashes, that's what they want.  We're not going to survive playing by the rules of a civilized society. permalink award report block reply POTUS_DonnieJ 6 points 4 hours ago “A judge” How about we start including their names and portraits with every tweet and article. permalink award report block reply joesfbi 5 points 5 hours ago So salt lake county will always be blue no matter who? Glad I dont live there anymore. permalink award report block reply bejeavis 3 points 4 hours ago That battle was lost decades ago permalink parent award report block reply Wexit-Delecto 5 points 5 hours ago Since punishing the corrupt judges is off the table I guess that's that. permalink award report block reply Magma_Biscuit 4 points 4 hours ago Why have elected representatives anymore when judges throw rulings around like they are the word of God himself permalink award report block reply farquhar 4 points 4 hours ago Audit the living shit out of that judge UNTIL you find the bribe or leverage used on him. permalink award report block reply Shitsbrokeyo 4 points 5 hours ago That should be easy to turn on appeal permalink award report block reply Roadpower 4 points 6 hours ago The entire argument over district lines can be eliminated overnight. The problem is that few people know about this or have given it any thought. Here is the starter pack. https://www.rangevoting.org/SplitLR.html https://www.youtube.com/watch?v=kUS9uvYyn3A permalink award report block reply Kendoextendo 3 points 5 hours ago Nothing will happen. Same as always. We'll take it and then complain on the internet about how unfair it is. That's all our side does. That's why the left doesn't take us serious. At least they have retards willing to die for their cause. permalink award report block reply tt777 3 points 3 hours ago This will happen in any state where Republicans try to redistrict. I say this as someone living in PA where judges overruled the Republican legislature a few years back. My district went from solid red to blue. I now have a Democrat representing me at all state and federal levels. My township is led by Republicans I guess. permalink award report block reply Michalusmichalus 2 points 2 hours ago It's happening in Maryland because the governor says it's in defense of what other states are doing. You read that correctly, the governor of MD is trying to redistrict the state because of other states. permalink parent award report block reply tt777 3 points 2 hours ago And no judges won't overrule them in liberal Maryland. permalink parent award report block reply Michalusmichalus 2 points 2 hours ago The current map was just in front of judge a few years ago. It was finally fixed, and Moore bullshit is intentionally trying to unfix it even after being told all attempts will be taken back to court. permalink parent award report block reply Somebody157 3 points 4 hours ago What matters is NOT what ONE judge wants but what THE PEOPLE  want. People are going to have to decide what they want and take care of the problem. permalink award report block reply Executarian2 3 points 6 hours ago Utah went 60-40 Trump-Harris in 2024. Why shouldn't they have at least one seat out of five? permalink award report block reply ReallyGayMods 5 points 5 hours ago They should in a perfect world. But democrats in the north east don't do when reps get 40% in their state. California just voted to undo that, too. Thats why permalink parent award report block reply Executarian2 3 points 4 hours ago Ah, okay. I guess I don’t agree with it on either side, but holy shit, I didn't realize that all NINE Mass reps are Dem. That's fucking nuts. permalink parent award report block reply Iremembermypassword 5 points 5 hours ago Look at New England. They have no Rep representation either. You need to fight fire with fire. permalink parent award report block reply Executarian2 2 points 4 hours ago Didn't realize how bad it was up there until now. Thanks for letting me know! permalink parent award report block reply 1amS3lly 3 points 5 hours ago Maybe when Mass gives the republicans a seat or two. Or California. Or any other blue state that also has 40% Republican voters. permalink parent award report block reply Executarian2 3 points 4 hours ago I had no idea how bad Mass was until now. Thanks for pointing that out! permalink parent award report block reply MAGALADON9 3 points 4 hours ago Get a rope permalink award report block reply Alphahorizon 3 points 5 hours ago STOP playing by the rules! It is fucking obvious to a 3rd grader that has NEEVR stopped our enemies. F your moral high ground. permalink award report block reply megakev 3 points 6 hours ago It's all theater.   Maga/ Republican's are the Washington Generals..... you're never going to win. permalink award report block reply MorningFrost 3 points 5 hours ago Judges have to much power.\nIs now the only thing they can do is impeach the judge.?\nSeparation of powers.\nThey should be able to overrule the judge by a super majority. permalink award report block reply barwhack 3 points 4 hours ago Hang the judge right in the middle of that blue square. Then ignore his activism. permalink award report block reply mass55th 3 points 2 hours ago RATS always change the rules to get what they want. Then when that new rule comes back and bites them in the ass, they say the rule is unfair, and want to change it again. They do it all the time. permalink award report block reply Godan 3 points 4 hours ago Ignore the judge. permalink award report block reply The_Bo0ch 2 points 3 hours ago So sick of these faggot judges. The only way democrats can get anything done is by CHEATING. permalink award report block reply Chickensaurus 2 points 4 hours ago Rwmove the judge.... Mario Brothers style. permalink award report block reply TrumpIsTheVictor 2 points 4 hours ago Republicans are faggots. That is why shit like this happens to them. Do you think commies would allow this to happen in their own shithole backyard? permalink award report block reply Ricky_CIA 2 points 5 hours ago Commies need helicopter flight lessons. permalink award report block reply Chihuahuaminpin 2 points 2 hours ago Well, isn't the GOP going to appeal this all the way to the Supremes? Because that's what dems would do! permalink award report block reply Obambi 2 points 4 hours ago Women permalink award report block reply mercynurse 2 points 5 hours ago Romney RINOs in Utah Bush RINOs in Texas McCain RINOs in Arizona Etcetera permalink award report block reply tw0scoops 2 points 4 hours ago Where are the similar law suits in blue states? permalink award report block reply victory2024 2 points 3 hours ago We don't have maga judges in blue states. They have leftist judges in red states. permalink parent award report block reply westrock2000 1 points 4 hours ago My question would be is it the original district map, or it an alternative map to the Republican favored one? Did the judge revert the map, or choose their favorite of the two replacement maps? permalink award report block reply Oodles 1 points 14 minutes ago Another DEI judge. Women should never be put in charge of anything permalink award report block reply ALEXNEGO8 1 points 4 hours ago I hope the fight continues. An appeal must be filed!!!!!!! permalink award report block reply Alldayeveryday 1 points 1 hour ago It's all a dog and pony show permalink award report block reply 3stepsahead 1 points 5 hours ago Ignore, and let the dems keep pushing it through the courts.  Thats all they do to us.  By the time they get around tk it 3 election cycles will have passed. permalink award report block reply tt777 1 points 2 hours ago They should just tell the judge that the judiciary doesn't have the authority to decide that and proceed as planned. They should, but Republicans don't. permalink parent award report block reply NoWorries77 1 points 1 hour ago F the communist judges … Berkle is right! permalink award report block reply Goozmania 1 points 24 minutes ago Uh what? A judge can't actually do this... permalink award report block reply BahamaDon 1 points 2 hours ago Now do California permalink award report block reply trumpdagoat 1 points 5 hours ago Asshoe. permalink award report block reply MJ_43 1 points 3 hours ago If the GOP was at all serious they would use this as precedent to challenge all electoral maps in new england.. if they're not serious they'll sit back and bitch and whine about this one judge.. permalink award report block reply DontTreadOnLego 1 points 6 hours ago Then take it up to the state supreme court! permalink award report block reply Klaus73 1 points 5 hours ago Aren't the republicans also trying to make new maps? Sounds like a breakdown of order where each state is going to have 10000 seats. permalink award report block reply exarch 1 points 2 hours ago You guys aren’t seeing what a gift this is. If the Supreme Court is forced to weigh in on the subject of gerrymandering, and they rule that it’s unconstitutional, then every dem state would need to be redistricted. I suspect that would ultimately be a net win for republicans. permalink award report block reply neosin 1 points 1 hour ago Make Guillotines Great Again permalink award report block reply BrewSwillis 1 points 35 minutes ago What's the difference? Utah produces some of the RINOest Republicans that money can buy. permalink award report block reply Agent_86 1 points 4 hours ago The judge doesn't have that authority. permalink award report block reply tt777 1 points 2 hours ago And? permalink parent award report block reply Juzeza 1 points 5 hours ago That’s what appellate courts are for permalink award report block reply BoughtByBloomberg2 1 points 3 hours ago Just ignore him. What is he going to do? Nothing. You have a R governor. Just ignore him. permalink award report block reply TheDevilMonkey 1 points 5 hours ago Nothing will be done about it. permalink award report block reply djpat 1 points 4 hours ago This happened days ago.   It is not breaking. permalink award report block reply Badfinz_FL 1 points 56 minutes ago Relax.  This gets overturned in appeal permalink award report block reply Appeal2Heaven98 1 points 5 hours ago Just vote harder. That'll solve the problem! permalink award report block reply FuckReddit4545 1 points 5 hours ago Just ignore it. Draw the maps as we see fit. permalink award report block reply IvIA6A 1 points 5 hours ago Race based district huh permalink award report block reply hey_spike 1 points 3 hours ago Is there a judge in CA that can rule to favor a Republican map? permalink award report block reply SisterCovfefeToo -9 points 6 hours ago Just the other day the board was whining about how California has the largest group of Republicans in the country and wasn’t it unfair that Prop 50 will deny them a single congressional representative? Utah is 52% Republican. Biden won Salt Lake City and the surrounding county. Harris won even more votes than Biden. It's totally diffe(R)ent, tho. permalink award report block reply tjohnson107 7 points 6 hours ago Gerrymandering is legal. This ruling is not. I would expect a Democrat to understand this considering how Illinois looks. Dumbass permalink parent award report block reply SisterCovfefeToo -4 points 6 hours ago Woosh permalink parent award report block reply Iremembermypassword 1 points 5 hours ago Have you every heard of the concept of winning? permalink parent award report block reply Meathe 0 points 3 hours ago They probably think failing upwards is the same thing. permalink parent award report block reply EyesSewnShut 1 points 6 hours ago Comment removed by community moderators. permalink award report block reply\nDJTXLV 151 points 6 hours ago Find another judge to block that judge. permalink award report block reply Mr_Rightside OP 40 points 6 hours ago Which judge can block her, only someone from her district or any judge in Utah? If only from her district, she's from Utah's Third District and serves Salt Lake, Summit, and Tooele counties. List of 40 Third District Court Judges Articles of impeachment are being filed against Dianna Gibson, and her ruling is being appealed. Utah Governor Spencer Cox supports the legislation appealing the court's decision. Utah House of Representatives Matt MacPherson: I have opened a bill to file articles of impeachment against Judge Gibson for gross abuse of power, violating the separation of powers and failing to uphold her oath of office to the Utah Constitution. Utah House of Representatives Matt MacPherson: It’s being appealed also. Utah Governor Spencer Cox: The Utah Constitution clearly states that it is the responsibility of the Legislature to divide the state into congressional districts. While I respect the Court’s role in our system, no judge, and certainly no advocacy group, can usurp that constitutional authority. For this reason, I fully support the Legislature appealing the Court’s decision. Utah Republicans have 61/75 House seats. Utah Republicans have 22/29 Senate seats. So couldn't Republicans just vote against the map? All 5 Justices in Utah's Supreme Court are Republican as well. permalink parent award report block reply RoboGerbil 28 points 6 hours ago It's never slowed the Dems down. Send a Florida judge for all anyone cares. Also isn't this judicial overreach? Who's going to enforce it? permalink parent award report block reply TGNX 20 points 5 hours ago Just ignore the judge. permalink parent award report block reply mikethemarine 17 points 4 hours ago THIS, Judges aren't allowed to make laws from the bench, they are ONLY allowed to enforce laws MADE by congress, and the congress MADE a law to show where the voting districts are. Tell him or her to just fuck off EDIT: also impeach the piece of shit and remove them from office permalink parent award report block reply view 1 more comments... Shitsbrokeyo 4 points 5 hours ago Next one up in the food chain permalink parent award report block reply NotYourMan 9 points 4 hours ago Hmmm... King Judge is really the democrat way.  We see a demographic consistency in the judges that believe they have more power than the executive branch just like we saw that with Letitia and Fani. permalink parent award report block reply Yawnz13 5 points 3 hours ago Or just boot the judge. https://kutv.com/news/politics/utah-lawmaker-begins-process-to-impeach-judge-after-congressional-map-ruling permalink parent award report block reply Trump4prez 2 points 3 hours ago \"no kings\" But they want judges who make laws out of thin air and strike down laws out representatives make permalink parent award report block reply mass55th 2 points 2 hours ago They can appeal all the way to the Supreme Court can't they? permalink parent award report block reply surgeriot 2 points 50 minutes ago Yup, just in time to miss midterms permalink parent award report block reply Seatacjoe 1 points 1 hour ago hang tight, so we will be able to do the same in California? permalink parent award report block reply load 1 more comments...\nMr_Rightside OP 40 points 6 hours ago Which judge can block her, only someone from her district or any judge in Utah? If only from her district, she's from Utah's Third District and serves Salt Lake, Summit, and Tooele counties. List of 40 Third District Court Judges Articles of impeachment are being filed against Dianna Gibson, and her ruling is being appealed. Utah Governor Spencer Cox supports the legislation appealing the court's decision. Utah House of Representatives Matt MacPherson: I have opened a bill to file articles of impeachment against Judge Gibson for gross abuse of power, violating the separation of powers and failing to uphold her oath of office to the Utah Constitution. Utah House of Representatives Matt MacPherson: It’s being appealed also. Utah Governor Spencer Cox: The Utah Constitution clearly states that it is the responsibility of the Legislature to divide the state into congressional districts. While I respect the Court’s role in our system, no judge, and certainly no advocacy group, can usurp that constitutional authority. For this reason, I fully support the Legislature appealing the Court’s decision. Utah Republicans have 61/75 House seats. Utah Republicans have 22/29 Senate seats. So couldn't Republicans just vote against the map? All 5 Justices in Utah's Supreme Court are Republican as well. permalink parent award report block reply RoboGerbil 28 points 6 hours ago It's never slowed the Dems down. Send a Florida judge for all anyone cares. Also isn't this judicial overreach? Who's going to enforce it? permalink parent award report block reply TGNX 20 points 5 hours ago Just ignore the judge. permalink parent award report block reply mikethemarine 17 points 4 hours ago THIS, Judges aren't allowed to make laws from the bench, they are ONLY allowed to enforce laws MADE by congress, and the congress MADE a law to show where the voting districts are. Tell him or her to just fuck off EDIT: also impeach the piece of shit and remove them from office permalink parent award report block reply view 1 more comments... Shitsbrokeyo 4 points 5 hours ago Next one up in the food chain permalink parent award report block reply\nRoboGerbil 28 points 6 hours ago It's never slowed the Dems down. Send a Florida judge for all anyone cares. Also isn't this judicial overreach? Who's going to enforce it? permalink parent award report block reply TGNX 20 points 5 hours ago Just ignore the judge. permalink parent award report block reply mikethemarine 17 points 4 hours ago THIS, Judges aren't allowed to make laws from the bench, they are ONLY allowed to enforce laws MADE by congress, and the congress MADE a law to show where the voting districts are. Tell him or her to just fuck off EDIT: also impeach the piece of shit and remove them from office permalink parent award report block reply view 1 more comments...\nTGNX 20 points 5 hours ago Just ignore the judge. permalink parent award report block reply mikethemarine 17 points 4 hours ago THIS, Judges aren't allowed to make laws from the bench, they are ONLY allowed to enforce laws MADE by congress, and the congress MADE a law to show where the voting districts are. Tell him or her to just fuck off EDIT: also impeach the piece of shit and remove them from office permalink parent award report block reply view 1 more comments...\nmikethemarine 17 points 4 hours ago THIS, Judges aren't allowed to make laws from the bench, they are ONLY allowed to enforce laws MADE by congress, and the congress MADE a law to show where the voting districts are. Tell him or her to just fuck off EDIT: also impeach the piece of shit and remove them from office permalink parent award report block reply view 1 more comments...\nShitsbrokeyo 4 points 5 hours ago Next one up in the food chain permalink parent award report block reply\nNotYourMan 9 points 4 hours ago Hmmm... King Judge is really the democrat way.  We see a demographic consistency in the judges that believe they have more power than the executive branch just like we saw that with Letitia and Fani. permalink parent award report block reply\nYawnz13 5 points 3 hours ago Or just boot the judge. https://kutv.com/news/politics/utah-lawmaker-begins-process-to-impeach-judge-after-congressional-map-ruling permalink parent award report block reply Trump4prez 2 points 3 hours ago \"no kings\" But they want judges who make laws out of thin air and strike down laws out representatives make permalink parent award report block reply\nTrump4prez 2 points 3 hours ago \"no kings\" But they want judges who make laws out of thin air and strike down laws out representatives make permalink parent award report block reply\nmass55th 2 points 2 hours ago They can appeal all the way to the Supreme Court can't they? permalink parent award report block reply surgeriot 2 points 50 minutes ago Yup, just in time to miss midterms permalink parent award report block reply\nsurgeriot 2 points 50 minutes ago Yup, just in time to miss midterms permalink parent award report block reply\nSeatacjoe 1 points 1 hour ago hang tight, so we will be able to do the same in California? permalink parent award report block reply\ny_do_i_need_to_hide 61 points 6 hours ago That is not legal. Who knows if there are laws after elections are stolen? permalink award report block reply RedCalifornia 24 points 6 hours ago Of course there aren’t. However, men traded their birthright and responsibility for light beer and football decades ago. permalink parent award report block reply 45isthebomb 3 points 4 hours ago Nobody's drinking lite beer.... permalink parent award report block reply vongregormench 4 points 3 hours ago Boomers drink it. permalink parent award report block reply Yawnz13 -2 points 3 hours ago Boomers aren't even the problem. permalink parent award report block reply view 1 more comments... y_do_i_need_to_hide 2 points 5 hours ago Maybe. I have no idea how we would find out without trusting some media outlets word for it. permalink parent award report block reply IForgotToAddAnEmail 3 points 5 hours ago Please MSM, tell me what I want to hear! permalink parent award report block reply y_do_i_need_to_hide -1 points 5 hours ago This is the scam in general. Americans believe what we want.\nWhether you thought napkins would save you or that Israel is our greatest ally, they stole your vote. permalink parent award report block reply InfinitesimalOrange 3 points 1 hour ago Breaking the law no longer gives me any pause. I will do whatever I want, exactly when I want, just like all these rapists, traitors, and murderers. Anyone who tries to stop me will lose the game of minesweeper. permalink parent award report block reply drattastic1 3 points 2 hours ago When do outt elected \" leaders\" start ignoring these non elected criminals with black robes? permalink parent award report block reply y_do_i_need_to_hide 3 points 2 hours ago As soon as we do. There are no laws, 2020 proved that. There is only whether we comply. permalink parent award report block reply someguy7738 3 points 3 hours ago Laws only matter if you lose. permalink parent award report block reply Appeal2Heaven98 1 points 5 hours ago Quit bitching and vote harder, tax slave! /s permalink parent award report block reply y_do_i_need_to_hide 2 points 3 hours ago I am still on \"will not comply\" :) permalink parent award report block reply\nRedCalifornia 24 points 6 hours ago Of course there aren’t. However, men traded their birthright and responsibility for light beer and football decades ago. permalink parent award report block reply 45isthebomb 3 points 4 hours ago Nobody's drinking lite beer.... permalink parent award report block reply vongregormench 4 points 3 hours ago Boomers drink it. permalink parent award report block reply Yawnz13 -2 points 3 hours ago Boomers aren't even the problem. permalink parent award report block reply view 1 more comments... y_do_i_need_to_hide 2 points 5 hours ago Maybe. I have no idea how we would find out without trusting some media outlets word for it. permalink parent award report block reply IForgotToAddAnEmail 3 points 5 hours ago Please MSM, tell me what I want to hear! permalink parent award report block reply y_do_i_need_to_hide -1 points 5 hours ago This is the scam in general. Americans believe what we want.\nWhether you thought napkins would save you or that Israel is our greatest ally, they stole your vote. permalink parent award report block reply\n45isthebomb 3 points 4 hours ago Nobody's drinking lite beer.... permalink parent award report block reply vongregormench 4 points 3 hours ago Boomers drink it. permalink parent award report block reply Yawnz13 -2 points 3 hours ago Boomers aren't even the problem. permalink parent award report block reply view 1 more comments...\nvongregormench 4 points 3 hours ago Boomers drink it. permalink parent award report block reply Yawnz13 -2 points 3 hours ago Boomers aren't even the problem. permalink parent award report block reply view 1 more comments...\nYawnz13 -2 points 3 hours ago Boomers aren't even the problem. permalink parent award report block reply view 1 more comments...\ny_do_i_need_to_hide 2 points 5 hours ago Maybe. I have no idea how we would find out without trusting some media outlets word for it. permalink parent award report block reply IForgotToAddAnEmail 3 points 5 hours ago Please MSM, tell me what I want to hear! permalink parent award report block reply y_do_i_need_to_hide -1 points 5 hours ago This is the scam in general. Americans believe what we want.\nWhether you thought napkins would save you or that Israel is our greatest ally, they stole your vote. permalink parent award report block reply\nIForgotToAddAnEmail 3 points 5 hours ago Please MSM, tell me what I want to hear! permalink parent award report block reply y_do_i_need_to_hide -1 points 5 hours ago This is the scam in general. Americans believe what we want.\nWhether you thought napkins would save you or that Israel is our greatest ally, they stole your vote. permalink parent award report block reply\ny_do_i_need_to_hide -1 points 5 hours ago This is the scam in general. Americans believe what we want.\nWhether you thought napkins would save you or that Israel is our greatest ally, they stole your vote. permalink parent award report block reply\nInfinitesimalOrange 3 points 1 hour ago Breaking the law no longer gives me any pause. I will do whatever I want, exactly when I want, just like all these rapists, traitors, and murderers. Anyone who tries to stop me will lose the game of minesweeper. permalink parent award report block reply\ndrattastic1 3 points 2 hours ago When do outt elected \" leaders\" start ignoring these non elected criminals with black robes? permalink parent award report block reply y_do_i_need_to_hide 3 points 2 hours ago As soon as we do. There are no laws, 2020 proved that. There is only whether we comply. permalink parent award report block reply\ny_do_i_need_to_hide 3 points 2 hours ago As soon as we do. There are no laws, 2020 proved that. There is only whether we comply. permalink parent award report block reply\nsomeguy7738 3 points 3 hours ago Laws only matter if you lose. permalink parent award report block reply\nAppeal2Heaven98 1 points 5 hours ago Quit bitching and vote harder, tax slave! /s permalink parent award report block reply y_do_i_need_to_hide 2 points 3 hours ago I am still on \"will not comply\" :) permalink parent award report block reply\ny_do_i_need_to_hide 2 points 3 hours ago I am still on \"will not comply\" :) permalink parent award report block reply\nMr_Rightside OP 35 points 6 hours ago Judge Dianna Gibson ruled just before a midnight deadline that the Legislature’s map “unduly favors Republicans and disfavors Democrats.” The new map, drawn by plaintiffs including the League of Women Voters of Utah and Mormon Women for Ethical Government, consolidates Salt Lake County into a single district, creating a stronger opportunity for Democrats to win a seat. Judge Dianna M. Gibson was appointed to the Third District Court in October 2018 by Governor Gary R. Herbert. She took the bench in January 2019 and serves Salt Lake, Summit, and Tooele counties. Utah House of Representatives Matt MacPherson: I have opened a bill to file articles of impeachment against Judge Gibson for gross abuse of power, violating the separation of powers and failing to uphold her oath of office to the Utah Constitution. Utah House of Representatives Matt MacPherson: It’s being appealed also. Utah Republicans have 61/75 House seats. Utah Republicans have 22/29 Senate seats. All 5 Justices in Utah's Supreme Court are Republican. In redistricting Republicans are up by +7, Democrats are by +5, possibly +6 if Gibson's ruling isn't reversed. Republicans +7 North Carolina +1 ✅ Missouri +1 ✅ Texas +5 ✅ Democrats +5, possibly +6 California +5 ✅ (Prop 50) Utah +1 (Not voted on, hopefully reversed) permalink award report block reply MikeTruk 48 points 6 hours ago Woman judge 🥱 permalink parent award report block reply yeptheguy 9 points 6 hours ago Shocking. permalink parent award report block reply Lady_MaGa -5 points 5 hours ago Oh stop that bullsht.  Men judges do the same thing. permalink parent award report block reply IForgotToAddAnEmail 7 points 5 hours ago Yeah, in all honestly the biggest issue is Soros paid off shit. But sincerely,  you need to stop being so offended that someone says women on this site. You're doing the thing - that caused most to start degrading women. Also, men don't get their fucking wads in a twist when calling out other men. permalink parent award report block reply Lady_MaGa -4 points 4 hours ago I'm doing \"the thing\" that causes men to degrade women? What? By pointing out that men do the same thing?  I guess you are saying when men do bad it is ok and not to be mentioned, but if a woman does a bad thing, it must be pointed out and make men hate women.  Such a slanted view of human beings.  And your comment about men not getting their fucking wads in a twist when calling out other men, eh hem, you know how many times I've seen on this site men calling other men faggots, losers, fucktards, idiots, etc etc?  Please check yourself. permalink parent award report block reply view 1 more comments... Moose_Antlers 2 points 3 hours ago Let's be honest about it, women are more likely to support the Left. Among the Left, it's the affluent, educated white women who are implementing and driving the push to socialism. They do it based on a moral imperative. Socialism frames the world with a new moral imperative: to create 'equal,' equity (everyone has the same amount) not equality (everyone has the same chance to succeed if they do the work). This is a moral imperative. This is critical because it allows justification of the use of power to force this goal to be achieved. You can steal from people who have stuff to give it to those who don't. You can enslave a skilled man and force him to provide \"equal\" services to those who want or need them. And you can ignore laws and corruptly wield power so long as it advances this goal of 'equal.' Women do this with a much higher propensity than men and with more zealotry because they believe in the moral component of this. So yes, male judges are part of the picture, but we're seeing a lot more of the worst activism out of female judges. It's the female judges letting black and brown criminals out of the prisons as fast as they can because they're creating 'equal' representation in the prisons. It doesn't matter if they're criminals, there are too many in the jails, you see? It's the same with these female judges trying to keep Kilmar Abrego Garcia, a known MS-13 gangster and wifebeater, in the US. They take the side of the illegal alien out of sympathy and a drive to remake America with less white people in it. 'Equal,' you see? It's not a both-sides thing. It simply reflects the demographics of the Left in the West. Don't get unnecessarily defensive. permalink parent award report block reply DeltaSierra 1 points 5 hours ago Correct.  However, I would clarify that the loner losers and antifa types that infect this site aren’t real men they are deranged boys.  This site is infected with these losers.  They can’t have a normal relationship with a woman so they hate women.  These anti-female types are very similar to many of the men in the Muslim culture they hate on.  Very strange people. permalink parent award report block reply Iremembermypassword 5 points 5 hours ago Thank god you will help them become functional members of society and allies to our side and not shit on them for no reason. Those are our guys, who are being beaten down by the Dems and we should help them. permalink parent award report block reply view 1 more comments... Aquamine-Amarine -2 points 4 hours ago They're no better than man hating feminists. permalink parent award report block reply Aquamine-Amarine 1 points 4 hours ago Thank you. Leftism is the problem, not sex. permalink parent award report block reply magaspif 3 points 4 hours ago Yeah it's just that more women support leftism than men. permalink parent award report block reply view 1 more comments... glow-operator-2-0 16 points 6 hours ago Incarcerate the judge along with their family, if needed. permalink parent award report block reply BlockWorks 6 points 6 hours ago There is a lawsuit over Prop 50 (but not holding my breath on that) permalink parent award report block reply vongregormench 0 points 3 hours ago The argument is weak. They’re claiming the districts are based on race. I think they’d have to prove that and I bet they can’t. permalink parent award report block reply Ptannerdactyl 2 points 4 hours ago I think this is great precedent actually. If the reasoning is that the districting is “unduly favors one side” and one can redraw from it, Republicans stand to gain a lot of seats. California will have an immediate challenge, as well as places like Massachusetts. permalink parent award report block reply ciaramella_is_gay 2 points 5 hours ago Laughs in California permalink parent award report block reply\nMikeTruk 48 points 6 hours ago Woman judge 🥱 permalink parent award report block reply yeptheguy 9 points 6 hours ago Shocking. permalink parent award report block reply Lady_MaGa -5 points 5 hours ago Oh stop that bullsht.  Men judges do the same thing. permalink parent award report block reply IForgotToAddAnEmail 7 points 5 hours ago Yeah, in all honestly the biggest issue is Soros paid off shit. But sincerely,  you need to stop being so offended that someone says women on this site. You're doing the thing - that caused most to start degrading women. Also, men don't get their fucking wads in a twist when calling out other men. permalink parent award report block reply Lady_MaGa -4 points 4 hours ago I'm doing \"the thing\" that causes men to degrade women? What? By pointing out that men do the same thing?  I guess you are saying when men do bad it is ok and not to be mentioned, but if a woman does a bad thing, it must be pointed out and make men hate women.  Such a slanted view of human beings.  And your comment about men not getting their fucking wads in a twist when calling out other men, eh hem, you know how many times I've seen on this site men calling other men faggots, losers, fucktards, idiots, etc etc?  Please check yourself. permalink parent award report block reply view 1 more comments... Moose_Antlers 2 points 3 hours ago Let's be honest about it, women are more likely to support the Left. Among the Left, it's the affluent, educated white women who are implementing and driving the push to socialism. They do it based on a moral imperative. Socialism frames the world with a new moral imperative: to create 'equal,' equity (everyone has the same amount) not equality (everyone has the same chance to succeed if they do the work). This is a moral imperative. This is critical because it allows justification of the use of power to force this goal to be achieved. You can steal from people who have stuff to give it to those who don't. You can enslave a skilled man and force him to provide \"equal\" services to those who want or need them. And you can ignore laws and corruptly wield power so long as it advances this goal of 'equal.' Women do this with a much higher propensity than men and with more zealotry because they believe in the moral component of this. So yes, male judges are part of the picture, but we're seeing a lot more of the worst activism out of female judges. It's the female judges letting black and brown criminals out of the prisons as fast as they can because they're creating 'equal' representation in the prisons. It doesn't matter if they're criminals, there are too many in the jails, you see? It's the same with these female judges trying to keep Kilmar Abrego Garcia, a known MS-13 gangster and wifebeater, in the US. They take the side of the illegal alien out of sympathy and a drive to remake America with less white people in it. 'Equal,' you see? It's not a both-sides thing. It simply reflects the demographics of the Left in the West. Don't get unnecessarily defensive. permalink parent award report block reply DeltaSierra 1 points 5 hours ago Correct.  However, I would clarify that the loner losers and antifa types that infect this site aren’t real men they are deranged boys.  This site is infected with these losers.  They can’t have a normal relationship with a woman so they hate women.  These anti-female types are very similar to many of the men in the Muslim culture they hate on.  Very strange people. permalink parent award report block reply Iremembermypassword 5 points 5 hours ago Thank god you will help them become functional members of society and allies to our side and not shit on them for no reason. Those are our guys, who are being beaten down by the Dems and we should help them. permalink parent award report block reply view 1 more comments... Aquamine-Amarine -2 points 4 hours ago They're no better than man hating feminists. permalink parent award report block reply Aquamine-Amarine 1 points 4 hours ago Thank you. Leftism is the problem, not sex. permalink parent award report block reply magaspif 3 points 4 hours ago Yeah it's just that more women support leftism than men. permalink parent award report block reply view 1 more comments...\nyeptheguy 9 points 6 hours ago Shocking. permalink parent award report block reply\nLady_MaGa -5 points 5 hours ago Oh stop that bullsht.  Men judges do the same thing. permalink parent award report block reply IForgotToAddAnEmail 7 points 5 hours ago Yeah, in all honestly the biggest issue is Soros paid off shit. But sincerely,  you need to stop being so offended that someone says women on this site. You're doing the thing - that caused most to start degrading women. Also, men don't get their fucking wads in a twist when calling out other men. permalink parent award report block reply Lady_MaGa -4 points 4 hours ago I'm doing \"the thing\" that causes men to degrade women? What? By pointing out that men do the same thing?  I guess you are saying when men do bad it is ok and not to be mentioned, but if a woman does a bad thing, it must be pointed out and make men hate women.  Such a slanted view of human beings.  And your comment about men not getting their fucking wads in a twist when calling out other men, eh hem, you know how many times I've seen on this site men calling other men faggots, losers, fucktards, idiots, etc etc?  Please check yourself. permalink parent award report block reply view 1 more comments... Moose_Antlers 2 points 3 hours ago Let's be honest about it, women are more likely to support the Left. Among the Left, it's the affluent, educated white women who are implementing and driving the push to socialism. They do it based on a moral imperative. Socialism frames the world with a new moral imperative: to create 'equal,' equity (everyone has the same amount) not equality (everyone has the same chance to succeed if they do the work). This is a moral imperative. This is critical because it allows justification of the use of power to force this goal to be achieved. You can steal from people who have stuff to give it to those who don't. You can enslave a skilled man and force him to provide \"equal\" services to those who want or need them. And you can ignore laws and corruptly wield power so long as it advances this goal of 'equal.' Women do this with a much higher propensity than men and with more zealotry because they believe in the moral component of this. So yes, male judges are part of the picture, but we're seeing a lot more of the worst activism out of female judges. It's the female judges letting black and brown criminals out of the prisons as fast as they can because they're creating 'equal' representation in the prisons. It doesn't matter if they're criminals, there are too many in the jails, you see? It's the same with these female judges trying to keep Kilmar Abrego Garcia, a known MS-13 gangster and wifebeater, in the US. They take the side of the illegal alien out of sympathy and a drive to remake America with less white people in it. 'Equal,' you see? It's not a both-sides thing. It simply reflects the demographics of the Left in the West. Don't get unnecessarily defensive. permalink parent award report block reply DeltaSierra 1 points 5 hours ago Correct.  However, I would clarify that the loner losers and antifa types that infect this site aren’t real men they are deranged boys.  This site is infected with these losers.  They can’t have a normal relationship with a woman so they hate women.  These anti-female types are very similar to many of the men in the Muslim culture they hate on.  Very strange people. permalink parent award report block reply Iremembermypassword 5 points 5 hours ago Thank god you will help them become functional members of society and allies to our side and not shit on them for no reason. Those are our guys, who are being beaten down by the Dems and we should help them. permalink parent award report block reply view 1 more comments... Aquamine-Amarine -2 points 4 hours ago They're no better than man hating feminists. permalink parent award report block reply Aquamine-Amarine 1 points 4 hours ago Thank you. Leftism is the problem, not sex. permalink parent award report block reply magaspif 3 points 4 hours ago Yeah it's just that more women support leftism than men. permalink parent award report block reply view 1 more comments...\nIForgotToAddAnEmail 7 points 5 hours ago Yeah, in all honestly the biggest issue is Soros paid off shit. But sincerely,  you need to stop being so offended that someone says women on this site. You're doing the thing - that caused most to start degrading women. Also, men don't get their fucking wads in a twist when calling out other men. permalink parent award report block reply Lady_MaGa -4 points 4 hours ago I'm doing \"the thing\" that causes men to degrade women? What? By pointing out that men do the same thing?  I guess you are saying when men do bad it is ok and not to be mentioned, but if a woman does a bad thing, it must be pointed out and make men hate women.  Such a slanted view of human beings.  And your comment about men not getting their fucking wads in a twist when calling out other men, eh hem, you know how many times I've seen on this site men calling other men faggots, losers, fucktards, idiots, etc etc?  Please check yourself. permalink parent award report block reply view 1 more comments...\nLady_MaGa -4 points 4 hours ago I'm doing \"the thing\" that causes men to degrade women? What? By pointing out that men do the same thing?  I guess you are saying when men do bad it is ok and not to be mentioned, but if a woman does a bad thing, it must be pointed out and make men hate women.  Such a slanted view of human beings.  And your comment about men not getting their fucking wads in a twist when calling out other men, eh hem, you know how many times I've seen on this site men calling other men faggots, losers, fucktards, idiots, etc etc?  Please check yourself. permalink parent award report block reply view 1 more comments...\nMoose_Antlers 2 points 3 hours ago Let's be honest about it, women are more likely to support the Left. Among the Left, it's the affluent, educated white women who are implementing and driving the push to socialism. They do it based on a moral imperative. Socialism frames the world with a new moral imperative: to create 'equal,' equity (everyone has the same amount) not equality (everyone has the same chance to succeed if they do the work). This is a moral imperative. This is critical because it allows justification of the use of power to force this goal to be achieved. You can steal from people who have stuff to give it to those who don't. You can enslave a skilled man and force him to provide \"equal\" services to those who want or need them. And you can ignore laws and corruptly wield power so long as it advances this goal of 'equal.' Women do this with a much higher propensity than men and with more zealotry because they believe in the moral component of this. So yes, male judges are part of the picture, but we're seeing a lot more of the worst activism out of female judges. It's the female judges letting black and brown criminals out of the prisons as fast as they can because they're creating 'equal' representation in the prisons. It doesn't matter if they're criminals, there are too many in the jails, you see? It's the same with these female judges trying to keep Kilmar Abrego Garcia, a known MS-13 gangster and wifebeater, in the US. They take the side of the illegal alien out of sympathy and a drive to remake America with less white people in it. 'Equal,' you see? It's not a both-sides thing. It simply reflects the demographics of the Left in the West. Don't get unnecessarily defensive. permalink parent award report block reply\nDeltaSierra 1 points 5 hours ago Correct.  However, I would clarify that the loner losers and antifa types that infect this site aren’t real men they are deranged boys.  This site is infected with these losers.  They can’t have a normal relationship with a woman so they hate women.  These anti-female types are very similar to many of the men in the Muslim culture they hate on.  Very strange people. permalink parent award report block reply Iremembermypassword 5 points 5 hours ago Thank god you will help them become functional members of society and allies to our side and not shit on them for no reason. Those are our guys, who are being beaten down by the Dems and we should help them. permalink parent award report block reply view 1 more comments... Aquamine-Amarine -2 points 4 hours ago They're no better than man hating feminists. permalink parent award report block reply\nIremembermypassword 5 points 5 hours ago Thank god you will help them become functional members of society and allies to our side and not shit on them for no reason. Those are our guys, who are being beaten down by the Dems and we should help them. permalink parent award report block reply view 1 more comments...\nAquamine-Amarine -2 points 4 hours ago They're no better than man hating feminists. permalink parent award report block reply\nAquamine-Amarine 1 points 4 hours ago Thank you. Leftism is the problem, not sex. permalink parent award report block reply magaspif 3 points 4 hours ago Yeah it's just that more women support leftism than men. permalink parent award report block reply view 1 more comments...\nmagaspif 3 points 4 hours ago Yeah it's just that more women support leftism than men. permalink parent award report block reply view 1 more comments...\nglow-operator-2-0 16 points 6 hours ago Incarcerate the judge along with their family, if needed. permalink parent award report block reply\nBlockWorks 6 points 6 hours ago There is a lawsuit over Prop 50 (but not holding my breath on that) permalink parent award report block reply vongregormench 0 points 3 hours ago The argument is weak. They’re claiming the districts are based on race. I think they’d have to prove that and I bet they can’t. permalink parent award report block reply\nvongregormench 0 points 3 hours ago The argument is weak. They’re claiming the districts are based on race. I think they’d have to prove that and I bet they can’t. permalink parent award report block reply\nPtannerdactyl 2 points 4 hours ago I think this is great precedent actually. If the reasoning is that the districting is “unduly favors one side” and one can redraw from it, Republicans stand to gain a lot of seats. California will have an immediate challenge, as well as places like Massachusetts. permalink parent award report block reply\nciaramella_is_gay 2 points 5 hours ago Laughs in California permalink parent award report block reply\nAVeryNakedMan 28 points 6 hours ago Just ignore the judge's ruling and run elections with the legislature-created districts. Didn't Republicans do that successfully in Ohio? permalink award report block reply\nhansgruber7 26 points 6 hours ago Republicans need to get better about the judges they appoint.  No more women judges. permalink award report block reply gaijin_ronin 18 points 6 hours ago We need less judges, of all kinds, at every level. permalink parent award report block reply Washington_Redskins 7 points 5 hours ago Any future Federal Judges we have should be vetted by Clarence Thomas. permalink parent award report block reply Reefay 4 points 4 hours ago Why haven't we been working on Clarence clones for the last 20 years? Can you imagine USSC with 9 Clarences? permalink parent award report block reply Lady_MaGa -4 points 5 hours ago So, are you then giving Boasberg a pass? permalink parent award report block reply hansgruber7 3 points 4 hours ago No.  You seem to struggle with reading comprehension. permalink parent award report block reply Aquamine-Amarine 0 points 4 hours ago They always forget the stupid male judges that exist. permalink parent award report block reply Lady_MaGa 1 points 1 hour ago Look at all my downvotes.  I wear them with pride because it proves that many men around here are either paid to divide us or they are just plain idiots not realizing their outlandish disrespect for women, and other people, is the very reason women, and other people, gather in groups and become radicalized against these crazy men. permalink parent award report block reply\ngaijin_ronin 18 points 6 hours ago We need less judges, of all kinds, at every level. permalink parent award report block reply Washington_Redskins 7 points 5 hours ago Any future Federal Judges we have should be vetted by Clarence Thomas. permalink parent award report block reply Reefay 4 points 4 hours ago Why haven't we been working on Clarence clones for the last 20 years? Can you imagine USSC with 9 Clarences? permalink parent award report block reply\nWashington_Redskins 7 points 5 hours ago Any future Federal Judges we have should be vetted by Clarence Thomas. permalink parent award report block reply Reefay 4 points 4 hours ago Why haven't we been working on Clarence clones for the last 20 years? Can you imagine USSC with 9 Clarences? permalink parent award report block reply\nReefay 4 points 4 hours ago Why haven't we been working on Clarence clones for the last 20 years? Can you imagine USSC with 9 Clarences? permalink parent award report block reply\nLady_MaGa -4 points 5 hours ago So, are you then giving Boasberg a pass? permalink parent award report block reply hansgruber7 3 points 4 hours ago No.  You seem to struggle with reading comprehension. permalink parent award report block reply Aquamine-Amarine 0 points 4 hours ago They always forget the stupid male judges that exist. permalink parent award report block reply Lady_MaGa 1 points 1 hour ago Look at all my downvotes.  I wear them with pride because it proves that many men around here are either paid to divide us or they are just plain idiots not realizing their outlandish disrespect for women, and other people, is the very reason women, and other people, gather in groups and become radicalized against these crazy men. permalink parent award report block reply\nhansgruber7 3 points 4 hours ago No.  You seem to struggle with reading comprehension. permalink parent award report block reply\nAquamine-Amarine 0 points 4 hours ago They always forget the stupid male judges that exist. permalink parent award report block reply Lady_MaGa 1 points 1 hour ago Look at all my downvotes.  I wear them with pride because it proves that many men around here are either paid to divide us or they are just plain idiots not realizing their outlandish disrespect for women, and other people, is the very reason women, and other people, gather in groups and become radicalized against these crazy men. permalink parent award report block reply\nLady_MaGa 1 points 1 hour ago Look at all my downvotes.  I wear them with pride because it proves that many men around here are either paid to divide us or they are just plain idiots not realizing their outlandish disrespect for women, and other people, is the very reason women, and other people, gather in groups and become radicalized against these crazy men. permalink parent award report block reply\nLol_Garrus 25 points 6 hours ago We are surrounded. EU Globalists Muslims invaders Jeet scammers Illegal aliens Chinese spies Feral blacks Antifa Communists Socialist karens Tyrannical judges Jewish subversives Deep state cronies All of them working, not necessarily together, against Christian Whites. permalink award report block reply mojorisen 7 points 5 hours ago Yep and many in MAGA angrily expect Trump to have defeated all of them in 10 months.  A feat that would take at least a generation to accomplish. permalink parent award report block reply rebuildingMyself 5 points 3 hours ago A generation of work with a govt all on board with it at that permalink parent award report block reply\nmojorisen 7 points 5 hours ago Yep and many in MAGA angrily expect Trump to have defeated all of them in 10 months.  A feat that would take at least a generation to accomplish. permalink parent award report block reply rebuildingMyself 5 points 3 hours ago A generation of work with a govt all on board with it at that permalink parent award report block reply\nrebuildingMyself 5 points 3 hours ago A generation of work with a govt all on board with it at that permalink parent award report block reply\nawsure 17 points 6 hours ago Appeal permalink award report block reply Wtf_socialismreally 30 points 6 hours ago Remove them from office and hang them as a traitor to the ideals that we are meant to uphold. A bit harsh? Perhaps. But judicial activism is getting too common. Well, instead of going that far the local gov should at least vote to impeach and remove. permalink parent award report block reply LineInTheSand -3 points 4 hours ago The judge waited until the last day to make her ruling.  The deadline to change the districting map has passed, so any appeal will not affect the 2026 elections. permalink parent award report block reply Ivleeeg 5 points 4 hours ago This is not correct. Yes, that's her strategy but the appeal, if successful will reinstate the republican map for 2026. permalink parent award report block reply\nWtf_socialismreally 30 points 6 hours ago Remove them from office and hang them as a traitor to the ideals that we are meant to uphold. A bit harsh? Perhaps. But judicial activism is getting too common. Well, instead of going that far the local gov should at least vote to impeach and remove. permalink parent award report block reply\nLineInTheSand -3 points 4 hours ago The judge waited until the last day to make her ruling.  The deadline to change the districting map has passed, so any appeal will not affect the 2026 elections. permalink parent award report block reply Ivleeeg 5 points 4 hours ago This is not correct. Yes, that's her strategy but the appeal, if successful will reinstate the republican map for 2026. permalink parent award report block reply\nIvleeeg 5 points 4 hours ago This is not correct. Yes, that's her strategy but the appeal, if successful will reinstate the republican map for 2026. permalink parent award report block reply\nGadsden 14 points 6 hours ago Not sure they understand what happens if they don't let us do this legally. permalink award report block reply\nBramage 12 points 6 hours ago Yet another degenerate overstepping judge that needs the US Marshals to arrest her. permalink award report block reply victory2024 3 points 3 hours ago What happens after someone is arrested? They are brought before a judge. And judges protect their own. permalink parent award report block reply Yawnz13 1 points 3 hours ago jUdGeS pRoTeCt ThEiR oWn! https://www.cbsnews.com/losangeles/news/orange-county-judge-sentenced-to-life-in-prison-for-killing-his-wife-in-2023/ permalink parent award report block reply victory2024 2 points 1 hour ago Do you really think that relates at all to what we are talking about? A judge being charged for literal murder has nothing in common with arresting judges for their legal rulings. permalink parent award report block reply\nvictory2024 3 points 3 hours ago What happens after someone is arrested? They are brought before a judge. And judges protect their own. permalink parent award report block reply Yawnz13 1 points 3 hours ago jUdGeS pRoTeCt ThEiR oWn! https://www.cbsnews.com/losangeles/news/orange-county-judge-sentenced-to-life-in-prison-for-killing-his-wife-in-2023/ permalink parent award report block reply victory2024 2 points 1 hour ago Do you really think that relates at all to what we are talking about? A judge being charged for literal murder has nothing in common with arresting judges for their legal rulings. permalink parent award report block reply\nYawnz13 1 points 3 hours ago jUdGeS pRoTeCt ThEiR oWn! https://www.cbsnews.com/losangeles/news/orange-county-judge-sentenced-to-life-in-prison-for-killing-his-wife-in-2023/ permalink parent award report block reply victory2024 2 points 1 hour ago Do you really think that relates at all to what we are talking about? A judge being charged for literal murder has nothing in common with arresting judges for their legal rulings. permalink parent award report block reply\nvictory2024 2 points 1 hour ago Do you really think that relates at all to what we are talking about? A judge being charged for literal murder has nothing in common with arresting judges for their legal rulings. permalink parent award report block reply\njohnparker 11 points 6 hours ago Moore v Harper 2023 makes it clear that General Assemblies have power to draw maps as they see fit. permalink award report block reply tt777 2 points 3 hours ago Haha... you think liberal judges give a shit about that? permalink parent award report block reply\ntt777 2 points 3 hours ago Haha... you think liberal judges give a shit about that? permalink parent award report block reply\nKalamander85 11 points 6 hours ago How is that legal? permalink award report block reply lifeisahologram 13 points 6 hours ago Didn’t you take a civics class? The rule of law goes 1. lower court judges control and rule everyone and everything and everyone has to do whatever they say And well there is no 2nd law that is the only rule apparently permalink parent award report block reply Iremembermypassword 8 points 5 hours ago The 2nd law is that this may only ever benefit Democrats. permalink parent award report block reply\nlifeisahologram 13 points 6 hours ago Didn’t you take a civics class? The rule of law goes 1. lower court judges control and rule everyone and everything and everyone has to do whatever they say And well there is no 2nd law that is the only rule apparently permalink parent award report block reply Iremembermypassword 8 points 5 hours ago The 2nd law is that this may only ever benefit Democrats. permalink parent award report block reply\nIremembermypassword 8 points 5 hours ago The 2nd law is that this may only ever benefit Democrats. permalink parent award report block reply\nKernalMustard 8 points 6 hours ago I said this would happen. Everyone was cheering. I said they would countermove. This a rerun and predictable permalink award report block reply\nA_Colostomy_Bag 6 points 5 hours ago It's long past time that our side responds with the same coordinated lawfare.  The Democrats are more than willing to destroy the entire country to rule over the ashes, that's what they want.  We're not going to survive playing by the rules of a civilized society. permalink award report block reply\nPOTUS_DonnieJ 6 points 4 hours ago “A judge” How about we start including their names and portraits with every tweet and article. permalink award report block reply\njoesfbi 5 points 5 hours ago So salt lake county will always be blue no matter who? Glad I dont live there anymore. permalink award report block reply bejeavis 3 points 4 hours ago That battle was lost decades ago permalink parent award report block reply\nbejeavis 3 points 4 hours ago That battle was lost decades ago permalink parent award report block reply\nWexit-Delecto 5 points 5 hours ago Since punishing the corrupt judges is off the table I guess that's that. permalink award report block reply\nMagma_Biscuit 4 points 4 hours ago Why have elected representatives anymore when judges throw rulings around like they are the word of God himself permalink award report block reply\nfarquhar 4 points 4 hours ago Audit the living shit out of that judge UNTIL you find the bribe or leverage used on him. permalink award report block reply\nShitsbrokeyo 4 points 5 hours ago That should be easy to turn on appeal permalink award report block reply\nRoadpower 4 points 6 hours ago The entire argument over district lines can be eliminated overnight. The problem is that few people know about this or have given it any thought. Here is the starter pack. https://www.rangevoting.org/SplitLR.html https://www.youtube.com/watch?v=kUS9uvYyn3A permalink award report block reply\nKendoextendo 3 points 5 hours ago Nothing will happen. Same as always. We'll take it and then complain on the internet about how unfair it is. That's all our side does. That's why the left doesn't take us serious. At least they have retards willing to die for their cause. permalink award report block reply\ntt777 3 points 3 hours ago This will happen in any state where Republicans try to redistrict. I say this as someone living in PA where judges overruled the Republican legislature a few years back. My district went from solid red to blue. I now have a Democrat representing me at all state and federal levels. My township is led by Republicans I guess. permalink award report block reply Michalusmichalus 2 points 2 hours ago It's happening in Maryland because the governor says it's in defense of what other states are doing. You read that correctly, the governor of MD is trying to redistrict the state because of other states. permalink parent award report block reply tt777 3 points 2 hours ago And no judges won't overrule them in liberal Maryland. permalink parent award report block reply Michalusmichalus 2 points 2 hours ago The current map was just in front of judge a few years ago. It was finally fixed, and Moore bullshit is intentionally trying to unfix it even after being told all attempts will be taken back to court. permalink parent award report block reply\nMichalusmichalus 2 points 2 hours ago It's happening in Maryland because the governor says it's in defense of what other states are doing. You read that correctly, the governor of MD is trying to redistrict the state because of other states. permalink parent award report block reply tt777 3 points 2 hours ago And no judges won't overrule them in liberal Maryland. permalink parent award report block reply Michalusmichalus 2 points 2 hours ago The current map was just in front of judge a few years ago. It was finally fixed, and Moore bullshit is intentionally trying to unfix it even after being told all attempts will be taken back to court. permalink parent award report block reply\ntt777 3 points 2 hours ago And no judges won't overrule them in liberal Maryland. permalink parent award report block reply Michalusmichalus 2 points 2 hours ago The current map was just in front of judge a few years ago. It was finally fixed, and Moore bullshit is intentionally trying to unfix it even after being told all attempts will be taken back to court. permalink parent award report block reply\nMichalusmichalus 2 points 2 hours ago The current map was just in front of judge a few years ago. It was finally fixed, and Moore bullshit is intentionally trying to unfix it even after being told all attempts will be taken back to court. permalink parent award report block reply\nSomebody157 3 points 4 hours ago What matters is NOT what ONE judge wants but what THE PEOPLE  want. People are going to have to decide what they want and take care of the problem. permalink award report block reply\nExecutarian2 3 points 6 hours ago Utah went 60-40 Trump-Harris in 2024. Why shouldn't they have at least one seat out of five? permalink award report block reply ReallyGayMods 5 points 5 hours ago They should in a perfect world. But democrats in the north east don't do when reps get 40% in their state. California just voted to undo that, too. Thats why permalink parent award report block reply Executarian2 3 points 4 hours ago Ah, okay. I guess I don’t agree with it on either side, but holy shit, I didn't realize that all NINE Mass reps are Dem. That's fucking nuts. permalink parent award report block reply Iremembermypassword 5 points 5 hours ago Look at New England. They have no Rep representation either. You need to fight fire with fire. permalink parent award report block reply Executarian2 2 points 4 hours ago Didn't realize how bad it was up there until now. Thanks for letting me know! permalink parent award report block reply 1amS3lly 3 points 5 hours ago Maybe when Mass gives the republicans a seat or two. Or California. Or any other blue state that also has 40% Republican voters. permalink parent award report block reply Executarian2 3 points 4 hours ago I had no idea how bad Mass was until now. Thanks for pointing that out! permalink parent award report block reply\nReallyGayMods 5 points 5 hours ago They should in a perfect world. But democrats in the north east don't do when reps get 40% in their state. California just voted to undo that, too. Thats why permalink parent award report block reply Executarian2 3 points 4 hours ago Ah, okay. I guess I don’t agree with it on either side, but holy shit, I didn't realize that all NINE Mass reps are Dem. That's fucking nuts. permalink parent award report block reply\nExecutarian2 3 points 4 hours ago Ah, okay. I guess I don’t agree with it on either side, but holy shit, I didn't realize that all NINE Mass reps are Dem. That's fucking nuts. permalink parent award report block reply\nIremembermypassword 5 points 5 hours ago Look at New England. They have no Rep representation either. You need to fight fire with fire. permalink parent award report block reply Executarian2 2 points 4 hours ago Didn't realize how bad it was up there until now. Thanks for letting me know! permalink parent award report block reply\nExecutarian2 2 points 4 hours ago Didn't realize how bad it was up there until now. Thanks for letting me know! permalink parent award report block reply\n1amS3lly 3 points 5 hours ago Maybe when Mass gives the republicans a seat or two. Or California. Or any other blue state that also has 40% Republican voters. permalink parent award report block reply Executarian2 3 points 4 hours ago I had no idea how bad Mass was until now. Thanks for pointing that out! permalink parent award report block reply\nExecutarian2 3 points 4 hours ago I had no idea how bad Mass was until now. Thanks for pointing that out! permalink parent award report block reply\nMAGALADON9 3 points 4 hours ago Get a rope permalink award report block reply\nAlphahorizon 3 points 5 hours ago STOP playing by the rules! It is fucking obvious to a 3rd grader that has NEEVR stopped our enemies. F your moral high ground. permalink award report block reply\nmegakev 3 points 6 hours ago It's all theater.   Maga/ Republican's are the Washington Generals..... you're never going to win. permalink award report block reply\nMorningFrost 3 points 5 hours ago Judges have to much power.\nIs now the only thing they can do is impeach the judge.?\nSeparation of powers.\nThey should be able to overrule the judge by a super majority. permalink award report block reply\nbarwhack 3 points 4 hours ago Hang the judge right in the middle of that blue square. Then ignore his activism. permalink award report block reply\nmass55th 3 points 2 hours ago RATS always change the rules to get what they want. Then when that new rule comes back and bites them in the ass, they say the rule is unfair, and want to change it again. They do it all the time. permalink award report block reply\nGodan 3 points 4 hours ago Ignore the judge. permalink award report block reply\nThe_Bo0ch 2 points 3 hours ago So sick of these faggot judges. The only way democrats can get anything done is by CHEATING. permalink award report block reply\nChickensaurus 2 points 4 hours ago Rwmove the judge.... Mario Brothers style. permalink award report block reply\nTrumpIsTheVictor 2 points 4 hours ago Republicans are faggots. That is why shit like this happens to them. Do you think commies would allow this to happen in their own shithole backyard? permalink award report block reply\nRicky_CIA 2 points 5 hours ago Commies need helicopter flight lessons. permalink award report block reply\nChihuahuaminpin 2 points 2 hours ago Well, isn't the GOP going to appeal this all the way to the Supremes? Because that's what dems would do! permalink award report block reply\nObambi 2 points 4 hours ago Women permalink award report block reply\nmercynurse 2 points 5 hours ago Romney RINOs in Utah Bush RINOs in Texas McCain RINOs in Arizona Etcetera permalink award report block reply\ntw0scoops 2 points 4 hours ago Where are the similar law suits in blue states? permalink award report block reply victory2024 2 points 3 hours ago We don't have maga judges in blue states. They have leftist judges in red states. permalink parent award report block reply\nvictory2024 2 points 3 hours ago We don't have maga judges in blue states. They have leftist judges in red states. permalink parent award report block reply\nwestrock2000 1 points 4 hours ago My question would be is it the original district map, or it an alternative map to the Republican favored one? Did the judge revert the map, or choose their favorite of the two replacement maps? permalink award report block reply\nOodles 1 points 14 minutes ago Another DEI judge. Women should never be put in charge of anything permalink award report block reply\nALEXNEGO8 1 points 4 hours ago I hope the fight continues. An appeal must be filed!!!!!!! permalink award report block reply\nAlldayeveryday 1 points 1 hour ago It's all a dog and pony show permalink award report block reply\n3stepsahead 1 points 5 hours ago Ignore, and let the dems keep pushing it through the courts.  Thats all they do to us.  By the time they get around tk it 3 election cycles will have passed. permalink award report block reply tt777 1 points 2 hours ago They should just tell the judge that the judiciary doesn't have the authority to decide that and proceed as planned. They should, but Republicans don't. permalink parent award report block reply\ntt777 1 points 2 hours ago They should just tell the judge that the judiciary doesn't have the authority to decide that and proceed as planned. They should, but Republicans don't. permalink parent award report block reply\nNoWorries77 1 points 1 hour ago F the communist judges … Berkle is right! permalink award report block reply\nGoozmania 1 points 24 minutes ago Uh what? A judge can't actually do this... permalink award report block reply\nBahamaDon 1 points 2 hours ago Now do California permalink award report block reply\ntrumpdagoat 1 points 5 hours ago Asshoe. permalink award report block reply\nMJ_43 1 points 3 hours ago If the GOP was at all serious they would use this as precedent to challenge all electoral maps in new england.. if they're not serious they'll sit back and bitch and whine about this one judge.. permalink award report block reply\nDontTreadOnLego 1 points 6 hours ago Then take it up to the state supreme court! permalink award report block reply\nKlaus73 1 points 5 hours ago Aren't the republicans also trying to make new maps? Sounds like a breakdown of order where each state is going to have 10000 seats. permalink award report block reply\nexarch 1 points 2 hours ago You guys aren’t seeing what a gift this is. If the Supreme Court is forced to weigh in on the subject of gerrymandering, and they rule that it’s unconstitutional, then every dem state would need to be redistricted. I suspect that would ultimately be a net win for republicans. permalink award report block reply\nneosin 1 points 1 hour ago Make Guillotines Great Again permalink award report block reply\nBrewSwillis 1 points 35 minutes ago What's the difference? Utah produces some of the RINOest Republicans that money can buy. permalink award report block reply\nAgent_86 1 points 4 hours ago The judge doesn't have that authority. permalink award report block reply tt777 1 points 2 hours ago And? permalink parent award report block reply\ntt777 1 points 2 hours ago And? permalink parent award report block reply\nJuzeza 1 points 5 hours ago That’s what appellate courts are for permalink award report block reply\nBoughtByBloomberg2 1 points 3 hours ago Just ignore him. What is he going to do? Nothing. You have a R governor. Just ignore him. permalink award report block reply\nTheDevilMonkey 1 points 5 hours ago Nothing will be done about it. permalink award report block reply\ndjpat 1 points 4 hours ago This happened days ago.   It is not breaking. permalink award report block reply\nBadfinz_FL 1 points 56 minutes ago Relax.  This gets overturned in appeal permalink award report block reply\nAppeal2Heaven98 1 points 5 hours ago Just vote harder. That'll solve the problem! permalink award report block reply\nFuckReddit4545 1 points 5 hours ago Just ignore it. Draw the maps as we see fit. permalink award report block reply\nIvIA6A 1 points 5 hours ago Race based district huh permalink award report block reply\nhey_spike 1 points 3 hours ago Is there a judge in CA that can rule to favor a Republican map? permalink award report block reply\nSisterCovfefeToo -9 points 6 hours ago Just the other day the board was whining about how California has the largest group of Republicans in the country and wasn’t it unfair that Prop 50 will deny them a single congressional representative? Utah is 52% Republican. Biden won Salt Lake City and the surrounding county. Harris won even more votes than Biden. It's totally diffe(R)ent, tho. permalink award report block reply tjohnson107 7 points 6 hours ago Gerrymandering is legal. This ruling is not. I would expect a Democrat to understand this considering how Illinois looks. Dumbass permalink parent award report block reply SisterCovfefeToo -4 points 6 hours ago Woosh permalink parent award report block reply Iremembermypassword 1 points 5 hours ago Have you every heard of the concept of winning? permalink parent award report block reply Meathe 0 points 3 hours ago They probably think failing upwards is the same thing. permalink parent award report block reply\ntjohnson107 7 points 6 hours ago Gerrymandering is legal. This ruling is not. I would expect a Democrat to understand this considering how Illinois looks. Dumbass permalink parent award report block reply SisterCovfefeToo -4 points 6 hours ago Woosh permalink parent award report block reply\nSisterCovfefeToo -4 points 6 hours ago Woosh permalink parent award report block reply\nIremembermypassword 1 points 5 hours ago Have you every heard of the concept of winning? permalink parent award report block reply Meathe 0 points 3 hours ago They probably think failing upwards is the same thing. permalink parent award report block reply\nMeathe 0 points 3 hours ago They probably think failing upwards is the same thing. permalink parent award report block reply\nEyesSewnShut 1 points 6 hours ago Comment removed by community moderators. permalink award report block reply"}