{"id": "1ARK9mHEXa", "contents": "154 We don't have the talent but the country where the majority don't have toilets or running water does?\n\nGet the hell out of here posted 15 hours ago by PiratePatriotParrot 5 comments award share report block Brotherhood @DiggingInTheDi1 • 20h We don't have the talent but the country where the majority don't have toilets or running water does? Get the hell out of here @jason @Jason • 21h He said we don’t have certain types of talent and we need to important them to train Americans  — which is 100% correct Let’s not spin it.\n5 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Metal4Freedom 7 points 15 hours ago DEPORT ALL H1-BEANERS permalink award report block reply Counterwhat 3 points 13 hours ago Exactly. I don't see shiny metropolises or scientific achievements that power the world, or influences that change regions for the better. It's a falsehood and we have been thrust with a lie and only to their benefit not ours. permalink award report block reply God-is-good 2 points 8 hours ago The poop throwers, that’s where the brains are. hand to face shaking head permalink award report block reply BlackJack1776 2 points 6 hours ago A talent for faking degrees and certifications? permalink award report block reply possibletower -1 points 15 hours ago Fuck Gen Z. They are the most libshit generation in history and they aren't \"turning on Trump\" because they never voted for Trump. Also Gen Z wants Trump to do socialist price controls on housing and food and healthcare. Fuck Gen Z permalink award report block reply\nMetal4Freedom 7 points 15 hours ago DEPORT ALL H1-BEANERS permalink award report block reply\nCounterwhat 3 points 13 hours ago Exactly. I don't see shiny metropolises or scientific achievements that power the world, or influences that change regions for the better. It's a falsehood and we have been thrust with a lie and only to their benefit not ours. permalink award report block reply\nGod-is-good 2 points 8 hours ago The poop throwers, that’s where the brains are. hand to face shaking head permalink award report block reply\nBlackJack1776 2 points 6 hours ago A talent for faking degrees and certifications? permalink award report block reply\npossibletower -1 points 15 hours ago Fuck Gen Z. They are the most libshit generation in history and they aren't \"turning on Trump\" because they never voted for Trump. Also Gen Z wants Trump to do socialist price controls on housing and food and healthcare. Fuck Gen Z permalink award report block reply"}