{"id": "1ARK9pghPv", "contents": "8 These people are actually allowed to vote. Let that sink in. posted 52 minutes ago by O__Q 5 comments award share report block Anti Woke Memes @AntiWokeMemes • 1h What is the first thing that comes to your mind when you see a woman with a nose ring?\n5 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style O__Q OP 3 points 42 minutes ago My vote should not be able to be canceled out by someone like this. And there are millions more of these mentally insane people. And they ALL vote the exact same way with the Leftist Liberal NPC Chip. Which means their votes are ALSO allowed to count for approval of allowing millions and millions more illegal aliens into the US so they too can illegally vote against American citizen tax payer’s best interests. Solution: Make Insane Asylums Great Again, and DEPORT. permalink award report block reply Yz450f 2 points 24 minutes ago You went full retard, man. Never go full retard. permalink award report block reply linthat22 2 points 47 minutes ago Does this kid have tourette syndrome, because that's usually caused by vaccine damage and can create obsessive compulsive behavior, which I think this kid has. permalink award report block reply Jack_NC 3 points 36 minutes ago Too frequent to be tourette's, unless she is under a tremendous amount of stress which she doesn't appear to be. (She looks like she's enjoying herself).\nI say learned behavior, she's a mimic. The fake-tourette's syndrome is a fad, and is fairly widespread among this generation. She was probably a goth for a while. Tried trans and moved on. Then found something she could fake that got her the most sympathy points, which is the real capitol with this new generation of brain-damaged public school retards. permalink parent award report block reply O__Q OP 2 points 40 minutes ago Probably got it after the 37th Covid booster, but it’s worth it because orange man bad. permalink parent award report block reply elgordo 1 points 30 minutes ago Yes absolutely tourettes. So sad, I feel bad for her. Hopefully she will move away from this crazy self mutilation once she gets older. permalink parent award report block reply Salty_Sailor 1 points 17 minutes ago Undermedicated permalink award report block reply\nO__Q OP 3 points 42 minutes ago My vote should not be able to be canceled out by someone like this. And there are millions more of these mentally insane people. And they ALL vote the exact same way with the Leftist Liberal NPC Chip. Which means their votes are ALSO allowed to count for approval of allowing millions and millions more illegal aliens into the US so they too can illegally vote against American citizen tax payer’s best interests. Solution: Make Insane Asylums Great Again, and DEPORT. permalink award report block reply\nYz450f 2 points 24 minutes ago You went full retard, man. Never go full retard. permalink award report block reply\nlinthat22 2 points 47 minutes ago Does this kid have tourette syndrome, because that's usually caused by vaccine damage and can create obsessive compulsive behavior, which I think this kid has. permalink award report block reply Jack_NC 3 points 36 minutes ago Too frequent to be tourette's, unless she is under a tremendous amount of stress which she doesn't appear to be. (She looks like she's enjoying herself).\nI say learned behavior, she's a mimic. The fake-tourette's syndrome is a fad, and is fairly widespread among this generation. She was probably a goth for a while. Tried trans and moved on. Then found something she could fake that got her the most sympathy points, which is the real capitol with this new generation of brain-damaged public school retards. permalink parent award report block reply O__Q OP 2 points 40 minutes ago Probably got it after the 37th Covid booster, but it’s worth it because orange man bad. permalink parent award report block reply elgordo 1 points 30 minutes ago Yes absolutely tourettes. So sad, I feel bad for her. Hopefully she will move away from this crazy self mutilation once she gets older. permalink parent award report block reply\nJack_NC 3 points 36 minutes ago Too frequent to be tourette's, unless she is under a tremendous amount of stress which she doesn't appear to be. (She looks like she's enjoying herself).\nI say learned behavior, she's a mimic. The fake-tourette's syndrome is a fad, and is fairly widespread among this generation. She was probably a goth for a while. Tried trans and moved on. Then found something she could fake that got her the most sympathy points, which is the real capitol with this new generation of brain-damaged public school retards. permalink parent award report block reply\nO__Q OP 2 points 40 minutes ago Probably got it after the 37th Covid booster, but it’s worth it because orange man bad. permalink parent award report block reply\nelgordo 1 points 30 minutes ago Yes absolutely tourettes. So sad, I feel bad for her. Hopefully she will move away from this crazy self mutilation once she gets older. permalink parent award report block reply\nSalty_Sailor 1 points 17 minutes ago Undermedicated permalink award report block reply"}