{"id": "1ARK9mHEjy", "contents": "58 GEOTUS - learn from this man posted 15 hours ago by BKav 8 comments award share download report block\n8 comments Sort by Top Top New Worst Old Save Calumet57 2 points 15 hours ago He seems based. He knows how to troll. He gets shit done. But this dude faces an incredibly less complex landscape than Trump. permalink award report block reply LeRiverDanube 3 points 15 hours ago it'd be less complex too since he focused on destroying the problem first. ie. remove the judges permalink parent award report block reply Calumet57 2 points 15 hours ago Maybe we do have something to learn. permalink parent award report block reply BKav OP 1 points 5 hours ago True, but ignoring or not hitting the problems head on is weak and gay permalink parent award report block reply Calumet57 1 points 1 hour ago I don't think Trump is weak or gay. permalink parent award report block reply UltraFrogMan 1 points 14 hours ago How did he get rid of corrupt judges? Id immagine that it isnt so simple here permalink award report block reply BKav OP 1 points 5 hours ago We’ve historically had presidents that did things that seemed over the top. But they were needed.  And desperate times call for desperate measures.  I’d welcome martial law until we could purge this country of enemy combatants. permalink parent award report block reply RINOssuck 0 points 10 hours ago Move to El Salvador permalink award report block reply BKav OP 1 points 5 hours ago At the rate we are going, I may permalink parent award report block reply\nCalumet57 2 points 15 hours ago He seems based. He knows how to troll. He gets shit done. But this dude faces an incredibly less complex landscape than Trump. permalink award report block reply LeRiverDanube 3 points 15 hours ago it'd be less complex too since he focused on destroying the problem first. ie. remove the judges permalink parent award report block reply Calumet57 2 points 15 hours ago Maybe we do have something to learn. permalink parent award report block reply BKav OP 1 points 5 hours ago True, but ignoring or not hitting the problems head on is weak and gay permalink parent award report block reply Calumet57 1 points 1 hour ago I don't think Trump is weak or gay. permalink parent award report block reply\nLeRiverDanube 3 points 15 hours ago it'd be less complex too since he focused on destroying the problem first. ie. remove the judges permalink parent award report block reply Calumet57 2 points 15 hours ago Maybe we do have something to learn. permalink parent award report block reply\nCalumet57 2 points 15 hours ago Maybe we do have something to learn. permalink parent award report block reply\nBKav OP 1 points 5 hours ago True, but ignoring or not hitting the problems head on is weak and gay permalink parent award report block reply Calumet57 1 points 1 hour ago I don't think Trump is weak or gay. permalink parent award report block reply\nCalumet57 1 points 1 hour ago I don't think Trump is weak or gay. permalink parent award report block reply\nUltraFrogMan 1 points 14 hours ago How did he get rid of corrupt judges? Id immagine that it isnt so simple here permalink award report block reply BKav OP 1 points 5 hours ago We’ve historically had presidents that did things that seemed over the top. But they were needed.  And desperate times call for desperate measures.  I’d welcome martial law until we could purge this country of enemy combatants. permalink parent award report block reply\nBKav OP 1 points 5 hours ago We’ve historically had presidents that did things that seemed over the top. But they were needed.  And desperate times call for desperate measures.  I’d welcome martial law until we could purge this country of enemy combatants. permalink parent award report block reply\nRINOssuck 0 points 10 hours ago Move to El Salvador permalink award report block reply BKav OP 1 points 5 hours ago At the rate we are going, I may permalink parent award report block reply\nBKav OP 1 points 5 hours ago At the rate we are going, I may permalink parent award report block reply"}