{"id": "1ARK9jztGi", "contents": "1244 Trump: Schumer ‘thought he could break the Republicans and the Republicans broke him’ (nypost.com) posted 1 day ago by Royall 139 comments award share report block Trump: Schumer ‘thought he could break the Republicans and the Republicans broke him’ Eight Senate Democrats voted Sunday to advance a proposal to reopen the government. nypost.com\n139 comments Sort by Top Top New Worst Old Save FiDollaMilkshake 83 points 1 day ago Trump needs to get back to MAGA.\nThis is starting to suck... permalink award report block reply EdgyUsernamexX69Xx 27 points 1 day ago This place can’t even cope for him well anymore it’s gotten so off track. permalink parent award report block reply RonPaulWasRight 23 points 1 day ago Release the files. Increase deportations. Audit Fort Knox. Get off Israel's dick. permalink parent award report block reply ianpatrick1966 18 points 1 day ago Best I can do is a 50 year mortgage permalink parent award report block reply BirthHole 7 points 1 day ago Audit Fort Knox. GOD DAMN IT -- YOU WERE SUPPOSED TO FORGET ABOUT THIS!    STOP REMEMBERING THINGS!! permalink parent award report block reply mohel 3 points 1 day ago Greenland? permalink parent award report block reply RonPaulWasRight 1 points 1 day ago I cut fluoride out of my drinking water. permalink parent award report block reply tchouk 5 points 1 day ago We wanted him to break the system. He's not breaking it. permalink parent award report block reply mohel 3 points 1 day ago He's trying to keep it going for a few more years. Pathetic. permalink parent award report block reply view 1 more comments... HumblePepe 2 points 1 day ago Arrest the traitors, too permalink parent award report block reply gottarememberpasswor 2 points 1 day ago Pretty reasonable demands honestly. Be nice if I could afford groceries too but I'm guessing that with the latest round of tweets that we're just going to have to pretend like things are cheaper. permalink parent award report block reply 2scoops2peachmints 2 points 1 day ago How about gas? Fuel costs went back up over .30 cents over the weekend permalink parent award report block reply view 1 more comments... KekistaniMemeLord 0 points 1 day ago they are for me. Wage also up. you live in a shit state/county. permalink parent award report block reply Constitution_1788 3 points 1 day ago Politics, unfortunately, DO get in the way… permalink parent award report block reply MickHigan2 55 points 1 day ago Sure would be nice to get 50-100 million deportations now. permalink award report block reply MySidesGoUp 35 points 1 day ago Best I can do is a 600,000 visa guarantee for Chinese… permalink parent award report block reply DJT4547 20 points 1 day ago \"I know what MAGA wants\" permalink parent award report block reply Bazhosh 15 points 1 day ago All my Hopium is gone... permalink parent award report block reply Hambonemcgee 4 points 1 day ago It's dry around here too... permalink parent award report block reply Trump43v3r 33 points 1 day ago Too much theatre for any of this to be true. I’m sorry, but this is looking very fake at the moment. All of a sudden the ACA subsidies will get passed and the babies on this site will be once again acting like they didn’t see it coming. Complete theater permalink award report block reply tholinz 11 points 1 day ago All they got was a fucking vote on the matter. No promises and Trump can also veto whatever bullshit crosses his desk. What the fuck is going on around here? permalink parent award report block reply BBvarn 11 points 1 day ago Liberal White female bots have invaded this site.  They try to hide and blend in but as soon as their TDS rants start, they can't shut up. permalink parent award report block reply PROCIsAsshoe 2 points 19 hours ago Amen, this is not an organic effort by people manning these accounts I'm convinced these are bot networks parroting script. So many 5 and 6 year old accounts have become the sandiest vaginas all of the sudden these past few months. permalink parent award report block reply Xtwitter 3 points 1 day ago This place is way to fucking negative energy permalink parent award report block reply SavingPrivateGrace 3 points 1 day ago Not always.  We can handle the highs and lows with the best of them, and they are all on here.  There was an imbalance this first year with too much focus on peace outside the home and not enough in our own country.  That came with a sacrifice and happens when workaholics make their jobs more important than time with their family.  I believe President Trump is going through a transition of grounding back to America First, actually in the role for the first time since inauguration.  That said, children of neglect learn to cope without the parent neglecting them.  They say they don't need them, and the more that happens, the more independent they become, the coping is the fact that the neglect makes it harder to ask for what they need in healthy ways.  Example:  Trump needs to XXX, rather than asking healthy...I need your help Mr. President, as Dilbert did recently when asking for his cancer treatment approval. permalink parent award report block reply KekistaniMemeLord 1 points 1 day ago PW has been infested with these low energy faggots and shills for a long time and its starting to bubble over. Nothing makes them happy. ever. Some of the most miserable fucks in existence. permalink parent award report block reply ughicanteven 3 points 1 day ago same people that were saying not to vote in 2024, it was pointless, trump was going to lose and it was all rigged. they always move the goalposts. they are not here in good faith permalink parent award report block reply view 1 more comments... Capitalism_Fuck_Yeah 0 points 1 day ago Welcome to how the left destroys right wing places. Their left wing placed they just ban everyone like that permalink parent award report block reply Appeal2Heaven98 3 points 1 day ago What's going on around here is a thing called, \"We've seen this movie before.\" permalink parent award report block reply 2scoops2peachmints 1 points 1 day ago Because we’re up on a year and everything promised has been either disappeared or slow walked as much as possible. We expected MASS deportations in day one. Not “let’s get the bad ones”, every illegal should be rounded up 24/7. I still can’t go grocery shopping without hordes of illegals taking all of the food and products for free with their ebt cards. Report it to ice, not a fucking peep. The entire country is fucked right now simply because of unchecked illegal immigration. Trump was supposed to be the hard ass we needed to get this done and every passing day he seems weaker and weaker. How can such a small country in the Middle East have so much power over the single most powerful person and country in the world is infuriating too. permalink parent award report block reply PROCIsAsshoe 1 points 19 hours ago dude there have been more people deported in less than year one than were deported in Operation Wetback in the 1950s, which was what everybody was pointing to as an aspiration before Trump won last Fall. People forget so quick or, far more likely, just don't pay attention close enough to have proper contextual information. permalink parent award report block reply Trump43v3r 1 points 1 day ago There is probably more to it than that. But good point permalink parent award report block reply load 1 more comments... MySidesGoUp 7 points 1 day ago Absolute cinema. permalink parent award report block reply RuprechtThaMonkeyBoy 5 points 1 day ago All politics is theatre. Who makes up the majority of politicians? Lawyers. No matter what type of law you practice most lawyers secretly yearn for that trial experience where they make their grandiose appeal to convict or dismiss charges. Most aren’t trial lawyers so they seek power, drama, and affirmation in the venue of politics. permalink parent award report block reply Mamapedia 1 points 1 day ago Plus their professional sophistry doesn't stop at the courtroom door - they bring that mindset into government.  Shady bastards. permalink parent award report block reply HumblePepe 1 points 1 day ago It makes me wonder how the country would look if it wasn't dictated by lawyers permalink parent award report block reply indigo_truther 3 points 1 day ago Well, color me surprised if that happens before January. There have been/will be plenty of losses, but this does not appear to be one of them. permalink parent award report block reply Trump43v3r 1 points 1 day ago I’m just saying, too much theater. It means something is being hidden from us. permalink parent award report block reply Scumbag-reddit 2 points 1 day ago Everything is fake and gay until proven otherwise. permalink parent award report block reply indigo_truther 2 points 1 day ago Sure yeah - maybe Trump is in on it and has been playing a really long con - lulling us into a false sense of security. permalink parent award report block reply view 1 more comments... indigo_truther 2 points 1 day ago Perhaps, but this is reminiscent of the old school media campaigns - where they were indeed able to change people's minds about key issues. People's attention is too scattered now, so they focus on TV for the boomers and podcasts with high female audiences and manufacture the drama for the lib narrative. This naturally creates a counter-drama in other spaces like Twitter, and oh, by the way - they actually did drag a lot of people along for the ride this time to amp it all up by forcing a lot of $ to stop for a month. So, they did get people talking, but still weren't able to move the needle in public opinion. permalink parent award report block reply Trump43v3r 1 points 1 day ago Insightful response, I’ll keep my mind open. There is just a lot of democrats admitting defeat which to me is strange. permalink parent award report block reply lispboy 1 points 1 day ago In the end it's all about making a deal without compromising the objective. Trump stuck to his guns in the end, but he had to give them something, that's why he is calling to end the filibuster. permalink parent award report block reply KekistaniMemeLord 0 points 1 day ago he didn't give them anything. It was complete defeat for demcucks. The vote on ACA is like the tiniest bone. permalink parent award report block reply kyle6969 0 points 1 day ago Absolutely delusional. permalink parent award report block reply Appeal2Heaven98 0 points 1 day ago But...but we owned the libs again! You're just a doomer! REEEE! permalink parent award report block reply Bullet3250 25 points 1 day ago Schumer and the Dems hurt a lot of people with this shut down... and the MEDIA WILL NOT PUBLISH ANY STORIES ABOUT THAT AT ALL... And right there is the reason Democrats are Nut Cases - (Zero Public Accountability) And why Republicans are normally scared to death/ hiding under their desks - (FULL MEDIA ATTACKS REGARDLESS OF THE TRUTH) permalink award report block reply Strzok 21 points 1 day ago That's what we all came to realize through Trump, and only a handful of GOP understand. Media will attack you anyway, so just YOLO and fix America. However GOP doesn't want to fix America. They want to unipartily milk it to death with the dems. permalink parent award report block reply Bullet3250 8 points 1 day ago YES - RUSH spoke to this regularly... UNless someone on THE RIGHTS BUYS THE WAPO AND CNN.... The REPUBLICANS need to just go forward and DO WHAT IS RIGHT - regardless of the media attacks - because what ever the Right does - the Media is just going to attack anyways.... SO JUST DO WHAT IS RIGHT! permalink parent award report block reply RuprechtThaMonkeyBoy 4 points 1 day ago 100% If you’re receiving media applause with an R by your name you’re not really a Republican or aligned with the values of American Exceptionalism. permalink parent award report block reply Capitalism_Fuck_Yeah 2 points 1 day ago Doesn't matter. They are dying media forms. What you need to understand is the power of the default. Most people have a default webpage and just read whatever is presented on it. Windows has default news built into it that excluded all right wing sources. Apple does the same. By default everything is left wing only sources so that's what young people and the politically untuned believe. Those sources are also what they demand in school so the default sources. permalink parent award report block reply Bullet3250 2 points 1 day ago MSM has already seeped online long ago... Just look up the Top Ten Online news sites... it's all CNN and NYTs and NBC news etc... Fox News is the only non-hard Left Online news site. permalink parent award report block reply stjimmy92 1 points 23 hours ago By default everything is left wing only sources It’s honestly essentially impossible to get those news features to show anything other than left wing sources. I use Bing as my search engine and it gives a bunch of trending news when you go to it. So it’s all The Guardian, HuffPost, The Atlantic. I tell it I’m not interested in those. Next time I go on, I get The Guardian UK, HuffPost Women, and Vox. I say I’m not interested. The Guardian Tech, CNN, and The Verge are next. Rinse and repeat until I get tired of it all and just hide the trending news feature altogether. permalink parent award report block reply cupocovfefe 1 points 1 day ago I see this point of view clearly.  Very plausible. However,  I also see the argument there's simply a uniparty now that is more interested in globalism and intervention over seas.  With a pretty fake one being painted \"left\" and one being painted \"right.\" When in fact, it's more like 2 wings on 1 crappy bird flying in 1 \"post constitutional American\" direction. I think the second argument adds just a much head wind of frustration to why there's seemingly \"no interest to do what's right\" anymore anywhere. permalink parent award report block reply Bigdeal 3 points 1 day ago I love it, keep it shut down. I am not hurt at all by it. If you are hurt, you need to look at your life choices. permalink parent award report block reply ThatsGold 10 points 1 day ago Not a fan of this iteration of Trump permalink award report block reply Bazhosh 3 points 1 day ago What happened to Campaign Trump? permalink parent award report block reply RiolindasReturn 7 points 1 day ago He wants to be liked and is now facing The Media vs MAGA rally attendees. permalink parent award report block reply Appeal2Heaven98 1 points 1 day ago He's probably realizing most of his agenda is a losing battle, I guess. He doesn't want to go nuclear. permalink parent award report block reply TrumpDupedMAGA 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply ConsrvspkgNJ 9 points 1 day ago All of this whining makes no sense. Are you guys new around here? Do you understand what just happened to the Dems? You can't out of one side of your mouth say the Dems want to put Trump in jail or flat out assassinate him and then out of the other side of your mouth say they were all in on it. It just doesn't match reality. I remember the days when Tom Daschle would drive up to the Reagan White House in a hearse to pick up the Presidents budget as a symbolic gesture that it will be dead on arrival. No, the Democrats discovered this one time that they lose when Republicans grow a spine. Anyone who has been following politics for more than a week knows the Democrats did not want to learn that lesson. They much prefer it when they smack the Republicans in the head, the Republican cowers in fear and the Dems do whatever they want. Being told no for 39 days was definitely not in their playbook. Yesterday the Democrat armor cracked....we need to remember that. permalink award report block reply DatTrumpDoh 7 points 1 day ago Most of this site has been infiltrated by bots who just signal against whatever wins the right gets in order to demoralize. permalink parent award report block reply PROCIsAsshoe 3 points 19 hours ago and they all post their whiny bitchy takes within a few minutes of the post. not real people to be so 'on top' of things. permalink parent award report block reply Klaus73 4 points 1 day ago I will present something of a case. Firstly Trump isn't perfect; I think part of the problem is generally frustration on both sides. The whiners are frustrated because they see legit issues of the agenda discarded or seemingly ignored. Once Trump took power suddenly he didn't care about Epstien; other issues he has tried to generally gaslight the public on and so; the whiners whine. They are the canaries in the coal mine and its frustrating to tell the kid to stop touching the hot stove and burning himself and yet he insists its fine. On the flip side the cheerleaders are believing that any claim to the counter of Trumps spin is somehow an attempt to undermine the administration - they hate when something a legit win is spun as a loss (deportation numbers for example). They cannot see anyway to get the whiners to see things how they see them. Both sides have legit concerns; but as far as impact - the whiners arguments only work if you follow up on them and can verify the facts. If you see someone whine; in a few cases you can verify that the whine is something that is actually happening - regardless of what the admin is saying. No one things 50 year mortgages to flood the market with more debt and jacking up the price of housing is a good idea - the fact Trump is in real-estate means I have to assume he knows some basic economic facts about how housing prices are. I won't rant about the constant deflection of the job market claims. If the whiners are ignored and the gaslighting is welcomed - then MAGA will be having a party in the big tent while the democrats set fire to it outside - the whiners are warning you of the enemy movements and the gaps in the defenses and positive thinking or not having a solution is not going to improve that situation. Its hard because frankly everyone is moving toward the \"I don't want to hear it\" mindset and its unhealthy for MAGA if its serious about actually fixing the USA. The shutdown is a prime example. I don't think the democrats lost this one; end of the day most public sentiment was that republicans are in charge and thus are responsible. There was no way the shutdown was going to last through thanksgiving - US folks going hungry and folks working for free and generally no air travel would have spelled a political nightmare for the republicans and democrats alike as anger would hit a critical point. The democrats can play this off as folding as a act of compassion; the \"pain\" of the shutdown that was caused had the admin making an active effort to worsen it while the democrats merely sat back and let it burn. \"We care about jobs\"+\"We are going to lay-off public servants\" is a message that is hypocritical and most common folk probably understand that. \"We don't want folk going hungry\"+ making an appeal to avoid having to find a way to pay out stuff like SNAP is of the same vein. Those were actions taken by the admin during the shutdown and for better or worse; the public see's the admin lying when they act like they didn't want it. The democrats won the optics with the common man; some of their more hardcore supporters are pissed because they \"folded\" but that only matters if your not thinking tactics. As it stands the democrats just set up a timebomb. They will be able to get their Epstien vote in time for Christmas when families are going to gather and talk to each other to move issues by word of mouth. If Thune doesn't hold the ACA vote by mid december then the democrats will be able to again point out \"We tried good faith...the republicans broke the trust\" which would be a true statement and generally if they break the trust it will worsen politics. If the vote passes and Trump veto's it \"You all get higher healthcare costs for Christmas\" the ad writes itself. If they vote no then the ad will be similar. Regardless in January they will shutdown the government again and let it ride out longer so that it will be fresh in folks minds for the mid-terms. Thats the tactic; the democrats are setting the republicans up and folks are dancing in the street because they \"pwned\" the dems; but celebrating has been a weakness of MAGA for awhile as its developing a bad habit of denying reality for optics. permalink parent award report block reply ConsrvspkgNJ 2 points 1 day ago So, let me break this down. The 39 day humiliation of the Democrats doesn't matter because at the end of the day, they will pwn the GOP? Tell me how that makes sense considering for the 45 years I have been into politics, the Democrats take great pride in beating GOP ass with great regularity. Why go through the whole Kabuki theater when you can just bitch slap your opponent and get them back in line and why would Democrats allow this humiliation? Sorry Fren, knowing Democrats as I do they would never allow this to happen. They hate us too much to play fuck fuck games like that. permalink parent award report block reply Klaus73 1 points 1 day ago Totally fair. The 39 days pushed the fear into public light; up until that point most economic concerns were fringe and no one was considering it - those that could afford stuff continued to do so; suddenly you had threats of food riots and suddenly the planes were not all running; the common folk couldn't ignore it anymore and since the republicans had already declared victory and being in control; regardless of the fact the dems triggered the shutdown; in Trumps own words its the presidents fault. Reality is that the democrats really do have very little power; they are essentially an air-bubble in the circulatory system of the admin; the shutdown was a very mild stroke. The democrats don't need to \"look good\" as they are largely out of the public limelight - the news is pretty much wall to wall republicans right now. That means the democrats got the advantage of not needing to \"do\" anything; they merely need to high light when those republicans fuck up and make a potential republican failing snowball into something worse. What your seeing now I am convinced is a retreat to draw republicans into a killbox. If the republicans take the bait its going to be even worse; but regardless the republicans have no choice now but to persue. If Trump vetos the ACA..dems get credit; if ACA passes; dems get credit; if the ACA dies on the floor republicans get the blame in time for Christmas and come january your right back in a fresh shutdown that will run a month or two so its in folks minds when the midterm discussions start. I hope your right; but there is no logic to the democrats suddenly permitting the lights going back on to get the stuff they had already been offered; the fillibuster threat was not big enough as even the republicans don't got a stomach for it and the optics about SNAP already being the admins fault was laid out. I would not underestimate the democrats on this..2+2 is equalling up to 5 and so something is missing here. permalink parent award report block reply ConsrvspkgNJ 1 points 1 day ago I am most certainly not underestimating the Democrats which is why I am wondering how you came up with this theory. Since the 1970's, the Democrats haven't had to do a thing to get their way. It was always... Step 1. Decide they want something Step 2. Anticipate GOP resistance and bitch slap them Step 3. Have the Big 3, The NY Times and Washington Post all do \"hard hitting expose's\" on Republican cruelty and inability to be bi-partisan Step 4. Watch GOP surrender so as to look bi-partisan Step 5. Get what they want and give the GOP the finger as they win again. There was no need to do this 39 day Kabuki Theater thing, they have the GOP in a pillbox whenever they want them. They did not have to humiliate themselves to get this. No sir, this is a legitimate loss by the Dems and to give them credit for anything else is a grave disservice. permalink parent award report block reply view 3 more comments... NimblePepeCentipede 3 points 1 day ago .....this^ permalink parent award report block reply KekistaniMemeLord 3 points 1 day ago To answer your question, yes, these people are new. Demoralizing shill faggots have infested this site for a long time and it's getting worse. Some of the absolute lowest IQ dumb fuck comments from these people who constantly whine and commiserate. Their goal is to demoralize MAGA and eat away at Trump's base. permalink parent award report block reply PROCIsAsshoe 2 points 19 hours ago I cannot imagine being such a miserable faggot. these people are pathetic. permalink parent award report block reply JoinTheDiscussion 1 points 15 hours ago What you fail to consider are there are plenty of RINOs who were hoping for and likely part of his assassination attempt.. permalink parent award report block reply ConsrvspkgNJ 1 points 4 hours ago That's a pretty bold statement. One that I am going to have to ask you to prove. permalink parent award report block reply finnigan 7 points 1 day ago Schumer won.  If snap is funded, repubs lost.  This was our chance to end the fillibuster and really pass some good legislation and the repubs caved like little girls playing hopscotch.  I hate the repub party. permalink award report block reply ughicanteven 3 points 1 day ago democrats were losing on this issue. recent polls show dems -16 for reopening but repubs +50 approval. getting rid of the fillibuster would have dug democrats out of their own hole. I agree getting rid of the fillibuster anyway, but in this specific instance it would have helped democrats permalink parent award report block reply JoinTheDiscussion 1 points 15 hours ago So now we think the \"Republicans\" reopening the government to feed 25+million illegals will somehow gain some R votes?! All while pissing off ALL of MAGA! permalink parent award report block reply ughicanteven 1 points 14 hours ago look how seething the dems are with schumer and the party. nuking the filibuster would have let them off the hook. we can nuke the filibuster anytime we want. permalink parent award report block reply KekistaniMemeLord 1 points 1 day ago no he did not lmfao, are you fucks actually retarded? Millions of people saw absolutely fucked SNAP was in addition to NOT getting his 1.5 trillion for illegals. It was total defeat for Dems, they got no concessions. permalink parent award report block reply 2scoops2peachmints 1 points 1 day ago You’re right but you’re forgetting one thing, this will invigorate the dem base and we will be slaughtered come mid terms. We can’t even get outside to do a simple protest. Dem had hundreds of thousands across the country mobilized in the streets, even if it wasn’t organic the optics are not good for the GOP come mid terms. Outside is fucking weak and scared. Cant even get all of our reps to vote together, almost never see dems breaking ranks and when they do it’s planned permalink parent award report block reply KekistaniMemeLord 1 points 1 day ago republicans continue to fail in offyear and local elections. We simply don't show up and it doesn't help when our own side says it doesn't matter because dems will cheat. Of course they will but they don't even have to try if we don't come to the polls. It's incredible that we have republican voters who still think they can just sit elections out for any reason. The more we vote, the more they have to do to overcome it and the more ammo it gives us publicly and for Trump and team to go after them. I'm not super worried about the recent elections cuz NY and VA is mostly demographic replacement, lot of republican voters have already left and NJ was already blue. im optimistic for midterms with mass deportations and redistricting happening. permalink parent award report block reply JoinTheDiscussion 1 points 15 hours ago It won't be enough.. permalink parent award report block reply RizzlieDoodad 7 points 1 day ago The Republicans broke the Democrats by extending the Biden budget. Ok lol. Cope harder permalink award report block reply TrumpDupedMAGA 0 points 1 day ago Comment removed by community moderators. permalink parent award report block reply indigo_truther 5 points 1 day ago Schumer somehow got outsmarted by AOC again who is constantly able to drive the narrative and will definitely take his Senate seat. permalink award report block reply Spellmonger 4 points 1 day ago Yet, our elections have not been secured.   And more than likely will not be, except for a crumb here and there in one or two states that won't affect any real change in the ability of American politicians to steal elections. IMO, the reason the Democrats gave in was because President Trump had engaged the American people and was close to forcing Republicans to nuke the filibuster and do real election reform. permalink award report block reply Steve56775 3 points 1 day ago This was the Republicans opportunity to fix Voter fraud, end Obamacare, balance the budget, and enact  permanent reforms to federal agencies, and they blew it.  That’s one thing we can count on the Rinos to do and that is nothing when the opportunity arises. permalink parent award report block reply JoinTheDiscussion 1 points 15 hours ago 100%! We got the loss here permalink parent award report block reply YodaBannon 4 points 1 day ago Democrat party is so desperate. And I laugh and laugh. permalink award report block reply utfanx2 3 points 1 day ago You don't get what you want as the minority. You negotiate for less of what you don't want. permalink award report block reply RandyMoss 3 points 1 day ago On what planet is this a win for MAGA? It's the same FUCKING bill that Joe Biden passed 5 years ago. The \"win\" is that the additional ACA subsidies didn't get added. People on this site are incredibly retarded. permalink award report block reply Michalusmichalus 1 points 1 day ago Inflation in the last  5 years means it's not equal to that bill. That's how it's a technical win. permalink parent award report block reply RandyMoss 2 points 7 hours ago 🤮🤮🤮 permalink parent award report block reply TrumpDupedMAGA -1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply emorphia 3 points 1 day ago but part of this deal is not firing the fed employees.\ni do not see the win in that.\nTrump needs to return to full MAGA.\nhe is too much playing politics now with the dems.\nand the dems win that game because the republicans just want to lose in grace and not win. permalink award report block reply JoinTheDiscussion 1 points 15 hours ago Compromised... permalink parent award report block reply SqRt7744 3 points 1 day ago Haha yeah right!? And the only people that ended up fucked are the American citizens! permalink award report block reply OG_BACONndEGGs -1 points 1 day ago Excalty don't celebrate to early. The repukes in DC will cave to dems next month and fund Obama care. You heard here first permalink parent award report block reply starjello 0 points 23 hours ago No I did not hear it hear first. Myself and like minded friends discuss it among ourselves quite often. And I gave you an upvote to counteract the fools who down voted you. permalink parent award report block reply ScoobyDum 3 points 1 day ago They got rid of legal weed killing thousands of jobs and an entire industry and removing access to cheap medical help. 2026 is going to be an epic bloodbath for republicans. They fucked up that bad with this shutdown. permalink award report block reply JoinTheDiscussion 1 points 15 hours ago They didn't \"fuck up\", they are obviously in the same boat, just slow rolling us into our demise.. We have one decent year left in this country, enjoy it while you can permalink parent award report block reply ianpatrick1966 0 points 1 day ago Citation? Is this the THCa crap? permalink parent award report block reply Michalusmichalus 0 points 1 day ago The first thing you need to remember is that it all comes from the hemp plant. https://evrimagaci.org/gpt/alcohol-and-pharma-giants-intensify-washington-lobbying-push-512170?srsltid=AfmBOoqMdqYVDhNMX1PPy28uKdXQc3c1rM83bDCXOV1PQcpzCmEhTv0Y permalink parent award report block reply Michalusmichalus 2 points 1 day ago They're going to fuck with Fetterman again. Everytime he thinks for himself they attack him. permalink award report block reply SenorTrumper 2 points 1 day ago Cue Kathy \"He broke me\" Griffen style memes. permalink award report block reply kyle6969 2 points 1 day ago Everyone in government (Trump included) are all part of the same party. They all fucking suck and it’s all theatre. It’s becoming so fucking obvious. None of them truly want to do anything that benefits anyone but themselves. The faster we realize that…. permalink award report block reply BillyBobBrewer 3 points 1 day ago You get down voted here for speaking the truth because this site is a deep state honeypot/containment board. Notice how everything is permitted here except noticing that everyone in government is on the same team and who controls that team. permalink parent award report block reply kyle6969 1 points 1 day ago For sure - who gives a fuck about downvotes. Learned long ago not to care about that. Even if it’s not as deep as “deep state honeypot/containment” - like even if we just accept at face value that this is an open discussion forum - there’s a lot of morons who can’t think for themselves. They can’t analyze what’s happening and change their opinion. Cock gobbling, ball jugglers. Fuck the government. permalink parent award report block reply KekistaniMemeLord 0 points 1 day ago Neither of you spoke the truth lmfao. Trump is not one of them, thats why they tried to kill him you dumb faggots. permalink parent award report block reply Waterlaw -2 points 1 day ago what happened tho, during campaing and hes first term trump was great permalink parent award report block reply TrumpDupedMAGA 0 points 1 day ago Comment removed by community moderators. permalink parent award report block reply HumblePepe 1 points 1 day ago Makes me wonder what the goal of that was? All the chaos with Trump and his persecution by deep state. Show? Theater? If he was truly in on it, why raid his home? It makes me wonder if deep state, with all their ways, has some sort of nuclear scenario that Trump is treading around. permalink parent award report block reply KekistaniMemeLord 0 points 1 day ago The reason Trump is so popular and that MAGA/America First has become a juggernaut is precisely because Trump ISN'T one of them. Did you just wake up recently or something? permalink parent award report block reply kyle6969 3 points 1 day ago Dude I’ve been here the second it opened after the subreddit was banned. He ain’t done any of that shit. permalink parent award report block reply KekistaniMemeLord 0 points 1 day ago lying like shit, shillbot. Your response doesn't even make sense. \"he ain't done any of that shit\" I didn't list any actions he made dipshit bot lmao permalink parent award report block reply kyle6969 1 points 23 hours ago You’re so paranoid. I’m not going to go through a list of things he said he was going to do but didn’t. permalink parent award report block reply view 2 more comments... billybaldwin2 2 points 1 day ago Didn't GOP fall for the same \"promise of a vote\" 3 or 4 years ago? Anyway, this could have been all to get an edge on NJ and VA. They will do the same for the midterms. permalink award report block reply Calumet57 1 points 1 day ago here come the socialists permalink award report block reply JoinTheDiscussion 1 points 15 hours ago Schumer caved just in time so the Republicans couldn't invoke the filibuster.. He's saving that for after the midterm steal next year.. Keep thinking we got a W here at your own perils permalink award report block reply ImpeachThisBitch 1 points 1 day ago It feels like the only explanation that fits is that he’s been compromised. Perhaps a credible deep state threat against the entire Trump family. permalink award report block reply JoinTheDiscussion 1 points 15 hours ago 100% permalink parent award report block reply TrumpDupedMAGA 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply theDialecticalPlaya 1 points 1 day ago Trump mentioned Israel again, so he's really a Mossad agent. But at least we have Rand and Massie, because muh principles, or something. And ignore the fact they're Koch First because they're AIPACfrei, whatever. permalink award report block reply Retard_Strength 1 points 1 day ago all of that nonsense was for Chucky to try to keep AOC from running for and taking his position. now she is practically guaranteed a win permalink award report block reply j2daeww 1 points 1 day ago Chuck didn’t vote yes for this so it proves Trump right. permalink award report block reply conservativefrank 0 points 1 day ago Trump doesn't get that the vast majority of people blame the shut down and all the pain from it on him. It's going to be a bloodbath for MAGA and Republicans in the midterms. permalink award report block reply seeyouinvalhalla -1 points 24 hours ago You had to put conservative in your username so we’d think you’re not a democrat bot lol permalink parent award report block reply conservativefrank 3 points 22 hours ago I hate the left. However, the reality is what it is. The vast majority of Americans blame Trump, MAGA, the Republicans. permalink parent award report block reply starjello 2 points 18 hours ago You hit the nail right on the head. permalink parent award report block reply NecturusMaculosus 0 points 1 day ago Stop dooming permalink award report block reply new_guy2 1 points 1 day ago Comment removed by community moderators. permalink award report block reply\nFiDollaMilkshake 83 points 1 day ago Trump needs to get back to MAGA.\nThis is starting to suck... permalink award report block reply EdgyUsernamexX69Xx 27 points 1 day ago This place can’t even cope for him well anymore it’s gotten so off track. permalink parent award report block reply RonPaulWasRight 23 points 1 day ago Release the files. Increase deportations. Audit Fort Knox. Get off Israel's dick. permalink parent award report block reply ianpatrick1966 18 points 1 day ago Best I can do is a 50 year mortgage permalink parent award report block reply BirthHole 7 points 1 day ago Audit Fort Knox. GOD DAMN IT -- YOU WERE SUPPOSED TO FORGET ABOUT THIS!    STOP REMEMBERING THINGS!! permalink parent award report block reply mohel 3 points 1 day ago Greenland? permalink parent award report block reply RonPaulWasRight 1 points 1 day ago I cut fluoride out of my drinking water. permalink parent award report block reply tchouk 5 points 1 day ago We wanted him to break the system. He's not breaking it. permalink parent award report block reply mohel 3 points 1 day ago He's trying to keep it going for a few more years. Pathetic. permalink parent award report block reply view 1 more comments... HumblePepe 2 points 1 day ago Arrest the traitors, too permalink parent award report block reply gottarememberpasswor 2 points 1 day ago Pretty reasonable demands honestly. Be nice if I could afford groceries too but I'm guessing that with the latest round of tweets that we're just going to have to pretend like things are cheaper. permalink parent award report block reply 2scoops2peachmints 2 points 1 day ago How about gas? Fuel costs went back up over .30 cents over the weekend permalink parent award report block reply view 1 more comments... KekistaniMemeLord 0 points 1 day ago they are for me. Wage also up. you live in a shit state/county. permalink parent award report block reply Constitution_1788 3 points 1 day ago Politics, unfortunately, DO get in the way… permalink parent award report block reply\nEdgyUsernamexX69Xx 27 points 1 day ago This place can’t even cope for him well anymore it’s gotten so off track. permalink parent award report block reply RonPaulWasRight 23 points 1 day ago Release the files. Increase deportations. Audit Fort Knox. Get off Israel's dick. permalink parent award report block reply ianpatrick1966 18 points 1 day ago Best I can do is a 50 year mortgage permalink parent award report block reply BirthHole 7 points 1 day ago Audit Fort Knox. GOD DAMN IT -- YOU WERE SUPPOSED TO FORGET ABOUT THIS!    STOP REMEMBERING THINGS!! permalink parent award report block reply mohel 3 points 1 day ago Greenland? permalink parent award report block reply RonPaulWasRight 1 points 1 day ago I cut fluoride out of my drinking water. permalink parent award report block reply tchouk 5 points 1 day ago We wanted him to break the system. He's not breaking it. permalink parent award report block reply mohel 3 points 1 day ago He's trying to keep it going for a few more years. Pathetic. permalink parent award report block reply view 1 more comments... HumblePepe 2 points 1 day ago Arrest the traitors, too permalink parent award report block reply gottarememberpasswor 2 points 1 day ago Pretty reasonable demands honestly. Be nice if I could afford groceries too but I'm guessing that with the latest round of tweets that we're just going to have to pretend like things are cheaper. permalink parent award report block reply 2scoops2peachmints 2 points 1 day ago How about gas? Fuel costs went back up over .30 cents over the weekend permalink parent award report block reply view 1 more comments... KekistaniMemeLord 0 points 1 day ago they are for me. Wage also up. you live in a shit state/county. permalink parent award report block reply\nRonPaulWasRight 23 points 1 day ago Release the files. Increase deportations. Audit Fort Knox. Get off Israel's dick. permalink parent award report block reply ianpatrick1966 18 points 1 day ago Best I can do is a 50 year mortgage permalink parent award report block reply BirthHole 7 points 1 day ago Audit Fort Knox. GOD DAMN IT -- YOU WERE SUPPOSED TO FORGET ABOUT THIS!    STOP REMEMBERING THINGS!! permalink parent award report block reply mohel 3 points 1 day ago Greenland? permalink parent award report block reply RonPaulWasRight 1 points 1 day ago I cut fluoride out of my drinking water. permalink parent award report block reply tchouk 5 points 1 day ago We wanted him to break the system. He's not breaking it. permalink parent award report block reply mohel 3 points 1 day ago He's trying to keep it going for a few more years. Pathetic. permalink parent award report block reply view 1 more comments... HumblePepe 2 points 1 day ago Arrest the traitors, too permalink parent award report block reply gottarememberpasswor 2 points 1 day ago Pretty reasonable demands honestly. Be nice if I could afford groceries too but I'm guessing that with the latest round of tweets that we're just going to have to pretend like things are cheaper. permalink parent award report block reply 2scoops2peachmints 2 points 1 day ago How about gas? Fuel costs went back up over .30 cents over the weekend permalink parent award report block reply view 1 more comments... KekistaniMemeLord 0 points 1 day ago they are for me. Wage also up. you live in a shit state/county. permalink parent award report block reply\nianpatrick1966 18 points 1 day ago Best I can do is a 50 year mortgage permalink parent award report block reply\nBirthHole 7 points 1 day ago Audit Fort Knox. GOD DAMN IT -- YOU WERE SUPPOSED TO FORGET ABOUT THIS!    STOP REMEMBERING THINGS!! permalink parent award report block reply mohel 3 points 1 day ago Greenland? permalink parent award report block reply RonPaulWasRight 1 points 1 day ago I cut fluoride out of my drinking water. permalink parent award report block reply\nmohel 3 points 1 day ago Greenland? permalink parent award report block reply\nRonPaulWasRight 1 points 1 day ago I cut fluoride out of my drinking water. permalink parent award report block reply\ntchouk 5 points 1 day ago We wanted him to break the system. He's not breaking it. permalink parent award report block reply mohel 3 points 1 day ago He's trying to keep it going for a few more years. Pathetic. permalink parent award report block reply view 1 more comments...\nmohel 3 points 1 day ago He's trying to keep it going for a few more years. Pathetic. permalink parent award report block reply view 1 more comments...\nHumblePepe 2 points 1 day ago Arrest the traitors, too permalink parent award report block reply\ngottarememberpasswor 2 points 1 day ago Pretty reasonable demands honestly. Be nice if I could afford groceries too but I'm guessing that with the latest round of tweets that we're just going to have to pretend like things are cheaper. permalink parent award report block reply 2scoops2peachmints 2 points 1 day ago How about gas? Fuel costs went back up over .30 cents over the weekend permalink parent award report block reply view 1 more comments... KekistaniMemeLord 0 points 1 day ago they are for me. Wage also up. you live in a shit state/county. permalink parent award report block reply\n2scoops2peachmints 2 points 1 day ago How about gas? Fuel costs went back up over .30 cents over the weekend permalink parent award report block reply view 1 more comments...\nKekistaniMemeLord 0 points 1 day ago they are for me. Wage also up. you live in a shit state/county. permalink parent award report block reply\nConstitution_1788 3 points 1 day ago Politics, unfortunately, DO get in the way… permalink parent award report block reply\nMickHigan2 55 points 1 day ago Sure would be nice to get 50-100 million deportations now. permalink award report block reply MySidesGoUp 35 points 1 day ago Best I can do is a 600,000 visa guarantee for Chinese… permalink parent award report block reply DJT4547 20 points 1 day ago \"I know what MAGA wants\" permalink parent award report block reply Bazhosh 15 points 1 day ago All my Hopium is gone... permalink parent award report block reply Hambonemcgee 4 points 1 day ago It's dry around here too... permalink parent award report block reply\nMySidesGoUp 35 points 1 day ago Best I can do is a 600,000 visa guarantee for Chinese… permalink parent award report block reply DJT4547 20 points 1 day ago \"I know what MAGA wants\" permalink parent award report block reply\nDJT4547 20 points 1 day ago \"I know what MAGA wants\" permalink parent award report block reply\nBazhosh 15 points 1 day ago All my Hopium is gone... permalink parent award report block reply Hambonemcgee 4 points 1 day ago It's dry around here too... permalink parent award report block reply\nHambonemcgee 4 points 1 day ago It's dry around here too... permalink parent award report block reply\nTrump43v3r 33 points 1 day ago Too much theatre for any of this to be true. I’m sorry, but this is looking very fake at the moment. All of a sudden the ACA subsidies will get passed and the babies on this site will be once again acting like they didn’t see it coming. Complete theater permalink award report block reply tholinz 11 points 1 day ago All they got was a fucking vote on the matter. No promises and Trump can also veto whatever bullshit crosses his desk. What the fuck is going on around here? permalink parent award report block reply BBvarn 11 points 1 day ago Liberal White female bots have invaded this site.  They try to hide and blend in but as soon as their TDS rants start, they can't shut up. permalink parent award report block reply PROCIsAsshoe 2 points 19 hours ago Amen, this is not an organic effort by people manning these accounts I'm convinced these are bot networks parroting script. So many 5 and 6 year old accounts have become the sandiest vaginas all of the sudden these past few months. permalink parent award report block reply Xtwitter 3 points 1 day ago This place is way to fucking negative energy permalink parent award report block reply SavingPrivateGrace 3 points 1 day ago Not always.  We can handle the highs and lows with the best of them, and they are all on here.  There was an imbalance this first year with too much focus on peace outside the home and not enough in our own country.  That came with a sacrifice and happens when workaholics make their jobs more important than time with their family.  I believe President Trump is going through a transition of grounding back to America First, actually in the role for the first time since inauguration.  That said, children of neglect learn to cope without the parent neglecting them.  They say they don't need them, and the more that happens, the more independent they become, the coping is the fact that the neglect makes it harder to ask for what they need in healthy ways.  Example:  Trump needs to XXX, rather than asking healthy...I need your help Mr. President, as Dilbert did recently when asking for his cancer treatment approval. permalink parent award report block reply KekistaniMemeLord 1 points 1 day ago PW has been infested with these low energy faggots and shills for a long time and its starting to bubble over. Nothing makes them happy. ever. Some of the most miserable fucks in existence. permalink parent award report block reply ughicanteven 3 points 1 day ago same people that were saying not to vote in 2024, it was pointless, trump was going to lose and it was all rigged. they always move the goalposts. they are not here in good faith permalink parent award report block reply view 1 more comments... Capitalism_Fuck_Yeah 0 points 1 day ago Welcome to how the left destroys right wing places. Their left wing placed they just ban everyone like that permalink parent award report block reply Appeal2Heaven98 3 points 1 day ago What's going on around here is a thing called, \"We've seen this movie before.\" permalink parent award report block reply 2scoops2peachmints 1 points 1 day ago Because we’re up on a year and everything promised has been either disappeared or slow walked as much as possible. We expected MASS deportations in day one. Not “let’s get the bad ones”, every illegal should be rounded up 24/7. I still can’t go grocery shopping without hordes of illegals taking all of the food and products for free with their ebt cards. Report it to ice, not a fucking peep. The entire country is fucked right now simply because of unchecked illegal immigration. Trump was supposed to be the hard ass we needed to get this done and every passing day he seems weaker and weaker. How can such a small country in the Middle East have so much power over the single most powerful person and country in the world is infuriating too. permalink parent award report block reply PROCIsAsshoe 1 points 19 hours ago dude there have been more people deported in less than year one than were deported in Operation Wetback in the 1950s, which was what everybody was pointing to as an aspiration before Trump won last Fall. People forget so quick or, far more likely, just don't pay attention close enough to have proper contextual information. permalink parent award report block reply Trump43v3r 1 points 1 day ago There is probably more to it than that. But good point permalink parent award report block reply load 1 more comments... MySidesGoUp 7 points 1 day ago Absolute cinema. permalink parent award report block reply RuprechtThaMonkeyBoy 5 points 1 day ago All politics is theatre. Who makes up the majority of politicians? Lawyers. No matter what type of law you practice most lawyers secretly yearn for that trial experience where they make their grandiose appeal to convict or dismiss charges. Most aren’t trial lawyers so they seek power, drama, and affirmation in the venue of politics. permalink parent award report block reply Mamapedia 1 points 1 day ago Plus their professional sophistry doesn't stop at the courtroom door - they bring that mindset into government.  Shady bastards. permalink parent award report block reply HumblePepe 1 points 1 day ago It makes me wonder how the country would look if it wasn't dictated by lawyers permalink parent award report block reply indigo_truther 3 points 1 day ago Well, color me surprised if that happens before January. There have been/will be plenty of losses, but this does not appear to be one of them. permalink parent award report block reply Trump43v3r 1 points 1 day ago I’m just saying, too much theater. It means something is being hidden from us. permalink parent award report block reply Scumbag-reddit 2 points 1 day ago Everything is fake and gay until proven otherwise. permalink parent award report block reply indigo_truther 2 points 1 day ago Sure yeah - maybe Trump is in on it and has been playing a really long con - lulling us into a false sense of security. permalink parent award report block reply view 1 more comments... indigo_truther 2 points 1 day ago Perhaps, but this is reminiscent of the old school media campaigns - where they were indeed able to change people's minds about key issues. People's attention is too scattered now, so they focus on TV for the boomers and podcasts with high female audiences and manufacture the drama for the lib narrative. This naturally creates a counter-drama in other spaces like Twitter, and oh, by the way - they actually did drag a lot of people along for the ride this time to amp it all up by forcing a lot of $ to stop for a month. So, they did get people talking, but still weren't able to move the needle in public opinion. permalink parent award report block reply Trump43v3r 1 points 1 day ago Insightful response, I’ll keep my mind open. There is just a lot of democrats admitting defeat which to me is strange. permalink parent award report block reply lispboy 1 points 1 day ago In the end it's all about making a deal without compromising the objective. Trump stuck to his guns in the end, but he had to give them something, that's why he is calling to end the filibuster. permalink parent award report block reply KekistaniMemeLord 0 points 1 day ago he didn't give them anything. It was complete defeat for demcucks. The vote on ACA is like the tiniest bone. permalink parent award report block reply kyle6969 0 points 1 day ago Absolutely delusional. permalink parent award report block reply Appeal2Heaven98 0 points 1 day ago But...but we owned the libs again! You're just a doomer! REEEE! permalink parent award report block reply\ntholinz 11 points 1 day ago All they got was a fucking vote on the matter. No promises and Trump can also veto whatever bullshit crosses his desk. What the fuck is going on around here? permalink parent award report block reply BBvarn 11 points 1 day ago Liberal White female bots have invaded this site.  They try to hide and blend in but as soon as their TDS rants start, they can't shut up. permalink parent award report block reply PROCIsAsshoe 2 points 19 hours ago Amen, this is not an organic effort by people manning these accounts I'm convinced these are bot networks parroting script. So many 5 and 6 year old accounts have become the sandiest vaginas all of the sudden these past few months. permalink parent award report block reply Xtwitter 3 points 1 day ago This place is way to fucking negative energy permalink parent award report block reply SavingPrivateGrace 3 points 1 day ago Not always.  We can handle the highs and lows with the best of them, and they are all on here.  There was an imbalance this first year with too much focus on peace outside the home and not enough in our own country.  That came with a sacrifice and happens when workaholics make their jobs more important than time with their family.  I believe President Trump is going through a transition of grounding back to America First, actually in the role for the first time since inauguration.  That said, children of neglect learn to cope without the parent neglecting them.  They say they don't need them, and the more that happens, the more independent they become, the coping is the fact that the neglect makes it harder to ask for what they need in healthy ways.  Example:  Trump needs to XXX, rather than asking healthy...I need your help Mr. President, as Dilbert did recently when asking for his cancer treatment approval. permalink parent award report block reply KekistaniMemeLord 1 points 1 day ago PW has been infested with these low energy faggots and shills for a long time and its starting to bubble over. Nothing makes them happy. ever. Some of the most miserable fucks in existence. permalink parent award report block reply ughicanteven 3 points 1 day ago same people that were saying not to vote in 2024, it was pointless, trump was going to lose and it was all rigged. they always move the goalposts. they are not here in good faith permalink parent award report block reply view 1 more comments... Capitalism_Fuck_Yeah 0 points 1 day ago Welcome to how the left destroys right wing places. Their left wing placed they just ban everyone like that permalink parent award report block reply Appeal2Heaven98 3 points 1 day ago What's going on around here is a thing called, \"We've seen this movie before.\" permalink parent award report block reply 2scoops2peachmints 1 points 1 day ago Because we’re up on a year and everything promised has been either disappeared or slow walked as much as possible. We expected MASS deportations in day one. Not “let’s get the bad ones”, every illegal should be rounded up 24/7. I still can’t go grocery shopping without hordes of illegals taking all of the food and products for free with their ebt cards. Report it to ice, not a fucking peep. The entire country is fucked right now simply because of unchecked illegal immigration. Trump was supposed to be the hard ass we needed to get this done and every passing day he seems weaker and weaker. How can such a small country in the Middle East have so much power over the single most powerful person and country in the world is infuriating too. permalink parent award report block reply PROCIsAsshoe 1 points 19 hours ago dude there have been more people deported in less than year one than were deported in Operation Wetback in the 1950s, which was what everybody was pointing to as an aspiration before Trump won last Fall. People forget so quick or, far more likely, just don't pay attention close enough to have proper contextual information. permalink parent award report block reply Trump43v3r 1 points 1 day ago There is probably more to it than that. But good point permalink parent award report block reply load 1 more comments...\nBBvarn 11 points 1 day ago Liberal White female bots have invaded this site.  They try to hide and blend in but as soon as their TDS rants start, they can't shut up. permalink parent award report block reply PROCIsAsshoe 2 points 19 hours ago Amen, this is not an organic effort by people manning these accounts I'm convinced these are bot networks parroting script. So many 5 and 6 year old accounts have become the sandiest vaginas all of the sudden these past few months. permalink parent award report block reply\nPROCIsAsshoe 2 points 19 hours ago Amen, this is not an organic effort by people manning these accounts I'm convinced these are bot networks parroting script. So many 5 and 6 year old accounts have become the sandiest vaginas all of the sudden these past few months. permalink parent award report block reply\nXtwitter 3 points 1 day ago This place is way to fucking negative energy permalink parent award report block reply SavingPrivateGrace 3 points 1 day ago Not always.  We can handle the highs and lows with the best of them, and they are all on here.  There was an imbalance this first year with too much focus on peace outside the home and not enough in our own country.  That came with a sacrifice and happens when workaholics make their jobs more important than time with their family.  I believe President Trump is going through a transition of grounding back to America First, actually in the role for the first time since inauguration.  That said, children of neglect learn to cope without the parent neglecting them.  They say they don't need them, and the more that happens, the more independent they become, the coping is the fact that the neglect makes it harder to ask for what they need in healthy ways.  Example:  Trump needs to XXX, rather than asking healthy...I need your help Mr. President, as Dilbert did recently when asking for his cancer treatment approval. permalink parent award report block reply KekistaniMemeLord 1 points 1 day ago PW has been infested with these low energy faggots and shills for a long time and its starting to bubble over. Nothing makes them happy. ever. Some of the most miserable fucks in existence. permalink parent award report block reply ughicanteven 3 points 1 day ago same people that were saying not to vote in 2024, it was pointless, trump was going to lose and it was all rigged. they always move the goalposts. they are not here in good faith permalink parent award report block reply view 1 more comments... Capitalism_Fuck_Yeah 0 points 1 day ago Welcome to how the left destroys right wing places. Their left wing placed they just ban everyone like that permalink parent award report block reply\nSavingPrivateGrace 3 points 1 day ago Not always.  We can handle the highs and lows with the best of them, and they are all on here.  There was an imbalance this first year with too much focus on peace outside the home and not enough in our own country.  That came with a sacrifice and happens when workaholics make their jobs more important than time with their family.  I believe President Trump is going through a transition of grounding back to America First, actually in the role for the first time since inauguration.  That said, children of neglect learn to cope without the parent neglecting them.  They say they don't need them, and the more that happens, the more independent they become, the coping is the fact that the neglect makes it harder to ask for what they need in healthy ways.  Example:  Trump needs to XXX, rather than asking healthy...I need your help Mr. President, as Dilbert did recently when asking for his cancer treatment approval. permalink parent award report block reply\nKekistaniMemeLord 1 points 1 day ago PW has been infested with these low energy faggots and shills for a long time and its starting to bubble over. Nothing makes them happy. ever. Some of the most miserable fucks in existence. permalink parent award report block reply ughicanteven 3 points 1 day ago same people that were saying not to vote in 2024, it was pointless, trump was going to lose and it was all rigged. they always move the goalposts. they are not here in good faith permalink parent award report block reply view 1 more comments...\nughicanteven 3 points 1 day ago same people that were saying not to vote in 2024, it was pointless, trump was going to lose and it was all rigged. they always move the goalposts. they are not here in good faith permalink parent award report block reply view 1 more comments...\nCapitalism_Fuck_Yeah 0 points 1 day ago Welcome to how the left destroys right wing places. Their left wing placed they just ban everyone like that permalink parent award report block reply\nAppeal2Heaven98 3 points 1 day ago What's going on around here is a thing called, \"We've seen this movie before.\" permalink parent award report block reply\n2scoops2peachmints 1 points 1 day ago Because we’re up on a year and everything promised has been either disappeared or slow walked as much as possible. We expected MASS deportations in day one. Not “let’s get the bad ones”, every illegal should be rounded up 24/7. I still can’t go grocery shopping without hordes of illegals taking all of the food and products for free with their ebt cards. Report it to ice, not a fucking peep. The entire country is fucked right now simply because of unchecked illegal immigration. Trump was supposed to be the hard ass we needed to get this done and every passing day he seems weaker and weaker. How can such a small country in the Middle East have so much power over the single most powerful person and country in the world is infuriating too. permalink parent award report block reply PROCIsAsshoe 1 points 19 hours ago dude there have been more people deported in less than year one than were deported in Operation Wetback in the 1950s, which was what everybody was pointing to as an aspiration before Trump won last Fall. People forget so quick or, far more likely, just don't pay attention close enough to have proper contextual information. permalink parent award report block reply\nPROCIsAsshoe 1 points 19 hours ago dude there have been more people deported in less than year one than were deported in Operation Wetback in the 1950s, which was what everybody was pointing to as an aspiration before Trump won last Fall. People forget so quick or, far more likely, just don't pay attention close enough to have proper contextual information. permalink parent award report block reply\nTrump43v3r 1 points 1 day ago There is probably more to it than that. But good point permalink parent award report block reply\nMySidesGoUp 7 points 1 day ago Absolute cinema. permalink parent award report block reply RuprechtThaMonkeyBoy 5 points 1 day ago All politics is theatre. Who makes up the majority of politicians? Lawyers. No matter what type of law you practice most lawyers secretly yearn for that trial experience where they make their grandiose appeal to convict or dismiss charges. Most aren’t trial lawyers so they seek power, drama, and affirmation in the venue of politics. permalink parent award report block reply Mamapedia 1 points 1 day ago Plus their professional sophistry doesn't stop at the courtroom door - they bring that mindset into government.  Shady bastards. permalink parent award report block reply HumblePepe 1 points 1 day ago It makes me wonder how the country would look if it wasn't dictated by lawyers permalink parent award report block reply\nRuprechtThaMonkeyBoy 5 points 1 day ago All politics is theatre. Who makes up the majority of politicians? Lawyers. No matter what type of law you practice most lawyers secretly yearn for that trial experience where they make their grandiose appeal to convict or dismiss charges. Most aren’t trial lawyers so they seek power, drama, and affirmation in the venue of politics. permalink parent award report block reply Mamapedia 1 points 1 day ago Plus their professional sophistry doesn't stop at the courtroom door - they bring that mindset into government.  Shady bastards. permalink parent award report block reply HumblePepe 1 points 1 day ago It makes me wonder how the country would look if it wasn't dictated by lawyers permalink parent award report block reply\nMamapedia 1 points 1 day ago Plus their professional sophistry doesn't stop at the courtroom door - they bring that mindset into government.  Shady bastards. permalink parent award report block reply\nHumblePepe 1 points 1 day ago It makes me wonder how the country would look if it wasn't dictated by lawyers permalink parent award report block reply\nindigo_truther 3 points 1 day ago Well, color me surprised if that happens before January. There have been/will be plenty of losses, but this does not appear to be one of them. permalink parent award report block reply Trump43v3r 1 points 1 day ago I’m just saying, too much theater. It means something is being hidden from us. permalink parent award report block reply Scumbag-reddit 2 points 1 day ago Everything is fake and gay until proven otherwise. permalink parent award report block reply indigo_truther 2 points 1 day ago Sure yeah - maybe Trump is in on it and has been playing a really long con - lulling us into a false sense of security. permalink parent award report block reply view 1 more comments... indigo_truther 2 points 1 day ago Perhaps, but this is reminiscent of the old school media campaigns - where they were indeed able to change people's minds about key issues. People's attention is too scattered now, so they focus on TV for the boomers and podcasts with high female audiences and manufacture the drama for the lib narrative. This naturally creates a counter-drama in other spaces like Twitter, and oh, by the way - they actually did drag a lot of people along for the ride this time to amp it all up by forcing a lot of $ to stop for a month. So, they did get people talking, but still weren't able to move the needle in public opinion. permalink parent award report block reply Trump43v3r 1 points 1 day ago Insightful response, I’ll keep my mind open. There is just a lot of democrats admitting defeat which to me is strange. permalink parent award report block reply\nTrump43v3r 1 points 1 day ago I’m just saying, too much theater. It means something is being hidden from us. permalink parent award report block reply Scumbag-reddit 2 points 1 day ago Everything is fake and gay until proven otherwise. permalink parent award report block reply indigo_truther 2 points 1 day ago Sure yeah - maybe Trump is in on it and has been playing a really long con - lulling us into a false sense of security. permalink parent award report block reply view 1 more comments... indigo_truther 2 points 1 day ago Perhaps, but this is reminiscent of the old school media campaigns - where they were indeed able to change people's minds about key issues. People's attention is too scattered now, so they focus on TV for the boomers and podcasts with high female audiences and manufacture the drama for the lib narrative. This naturally creates a counter-drama in other spaces like Twitter, and oh, by the way - they actually did drag a lot of people along for the ride this time to amp it all up by forcing a lot of $ to stop for a month. So, they did get people talking, but still weren't able to move the needle in public opinion. permalink parent award report block reply Trump43v3r 1 points 1 day ago Insightful response, I’ll keep my mind open. There is just a lot of democrats admitting defeat which to me is strange. permalink parent award report block reply\nScumbag-reddit 2 points 1 day ago Everything is fake and gay until proven otherwise. permalink parent award report block reply indigo_truther 2 points 1 day ago Sure yeah - maybe Trump is in on it and has been playing a really long con - lulling us into a false sense of security. permalink parent award report block reply view 1 more comments...\nindigo_truther 2 points 1 day ago Sure yeah - maybe Trump is in on it and has been playing a really long con - lulling us into a false sense of security. permalink parent award report block reply view 1 more comments...\nindigo_truther 2 points 1 day ago Perhaps, but this is reminiscent of the old school media campaigns - where they were indeed able to change people's minds about key issues. People's attention is too scattered now, so they focus on TV for the boomers and podcasts with high female audiences and manufacture the drama for the lib narrative. This naturally creates a counter-drama in other spaces like Twitter, and oh, by the way - they actually did drag a lot of people along for the ride this time to amp it all up by forcing a lot of $ to stop for a month. So, they did get people talking, but still weren't able to move the needle in public opinion. permalink parent award report block reply Trump43v3r 1 points 1 day ago Insightful response, I’ll keep my mind open. There is just a lot of democrats admitting defeat which to me is strange. permalink parent award report block reply\nTrump43v3r 1 points 1 day ago Insightful response, I’ll keep my mind open. There is just a lot of democrats admitting defeat which to me is strange. permalink parent award report block reply\nlispboy 1 points 1 day ago In the end it's all about making a deal without compromising the objective. Trump stuck to his guns in the end, but he had to give them something, that's why he is calling to end the filibuster. permalink parent award report block reply KekistaniMemeLord 0 points 1 day ago he didn't give them anything. It was complete defeat for demcucks. The vote on ACA is like the tiniest bone. permalink parent award report block reply kyle6969 0 points 1 day ago Absolutely delusional. permalink parent award report block reply\nKekistaniMemeLord 0 points 1 day ago he didn't give them anything. It was complete defeat for demcucks. The vote on ACA is like the tiniest bone. permalink parent award report block reply\nkyle6969 0 points 1 day ago Absolutely delusional. permalink parent award report block reply\nAppeal2Heaven98 0 points 1 day ago But...but we owned the libs again! You're just a doomer! REEEE! permalink parent award report block reply\nBullet3250 25 points 1 day ago Schumer and the Dems hurt a lot of people with this shut down... and the MEDIA WILL NOT PUBLISH ANY STORIES ABOUT THAT AT ALL... And right there is the reason Democrats are Nut Cases - (Zero Public Accountability) And why Republicans are normally scared to death/ hiding under their desks - (FULL MEDIA ATTACKS REGARDLESS OF THE TRUTH) permalink award report block reply Strzok 21 points 1 day ago That's what we all came to realize through Trump, and only a handful of GOP understand. Media will attack you anyway, so just YOLO and fix America. However GOP doesn't want to fix America. They want to unipartily milk it to death with the dems. permalink parent award report block reply Bullet3250 8 points 1 day ago YES - RUSH spoke to this regularly... UNless someone on THE RIGHTS BUYS THE WAPO AND CNN.... The REPUBLICANS need to just go forward and DO WHAT IS RIGHT - regardless of the media attacks - because what ever the Right does - the Media is just going to attack anyways.... SO JUST DO WHAT IS RIGHT! permalink parent award report block reply RuprechtThaMonkeyBoy 4 points 1 day ago 100% If you’re receiving media applause with an R by your name you’re not really a Republican or aligned with the values of American Exceptionalism. permalink parent award report block reply Capitalism_Fuck_Yeah 2 points 1 day ago Doesn't matter. They are dying media forms. What you need to understand is the power of the default. Most people have a default webpage and just read whatever is presented on it. Windows has default news built into it that excluded all right wing sources. Apple does the same. By default everything is left wing only sources so that's what young people and the politically untuned believe. Those sources are also what they demand in school so the default sources. permalink parent award report block reply Bullet3250 2 points 1 day ago MSM has already seeped online long ago... Just look up the Top Ten Online news sites... it's all CNN and NYTs and NBC news etc... Fox News is the only non-hard Left Online news site. permalink parent award report block reply stjimmy92 1 points 23 hours ago By default everything is left wing only sources It’s honestly essentially impossible to get those news features to show anything other than left wing sources. I use Bing as my search engine and it gives a bunch of trending news when you go to it. So it’s all The Guardian, HuffPost, The Atlantic. I tell it I’m not interested in those. Next time I go on, I get The Guardian UK, HuffPost Women, and Vox. I say I’m not interested. The Guardian Tech, CNN, and The Verge are next. Rinse and repeat until I get tired of it all and just hide the trending news feature altogether. permalink parent award report block reply cupocovfefe 1 points 1 day ago I see this point of view clearly.  Very plausible. However,  I also see the argument there's simply a uniparty now that is more interested in globalism and intervention over seas.  With a pretty fake one being painted \"left\" and one being painted \"right.\" When in fact, it's more like 2 wings on 1 crappy bird flying in 1 \"post constitutional American\" direction. I think the second argument adds just a much head wind of frustration to why there's seemingly \"no interest to do what's right\" anymore anywhere. permalink parent award report block reply Bigdeal 3 points 1 day ago I love it, keep it shut down. I am not hurt at all by it. If you are hurt, you need to look at your life choices. permalink parent award report block reply\nStrzok 21 points 1 day ago That's what we all came to realize through Trump, and only a handful of GOP understand. Media will attack you anyway, so just YOLO and fix America. However GOP doesn't want to fix America. They want to unipartily milk it to death with the dems. permalink parent award report block reply Bullet3250 8 points 1 day ago YES - RUSH spoke to this regularly... UNless someone on THE RIGHTS BUYS THE WAPO AND CNN.... The REPUBLICANS need to just go forward and DO WHAT IS RIGHT - regardless of the media attacks - because what ever the Right does - the Media is just going to attack anyways.... SO JUST DO WHAT IS RIGHT! permalink parent award report block reply RuprechtThaMonkeyBoy 4 points 1 day ago 100% If you’re receiving media applause with an R by your name you’re not really a Republican or aligned with the values of American Exceptionalism. permalink parent award report block reply Capitalism_Fuck_Yeah 2 points 1 day ago Doesn't matter. They are dying media forms. What you need to understand is the power of the default. Most people have a default webpage and just read whatever is presented on it. Windows has default news built into it that excluded all right wing sources. Apple does the same. By default everything is left wing only sources so that's what young people and the politically untuned believe. Those sources are also what they demand in school so the default sources. permalink parent award report block reply Bullet3250 2 points 1 day ago MSM has already seeped online long ago... Just look up the Top Ten Online news sites... it's all CNN and NYTs and NBC news etc... Fox News is the only non-hard Left Online news site. permalink parent award report block reply stjimmy92 1 points 23 hours ago By default everything is left wing only sources It’s honestly essentially impossible to get those news features to show anything other than left wing sources. I use Bing as my search engine and it gives a bunch of trending news when you go to it. So it’s all The Guardian, HuffPost, The Atlantic. I tell it I’m not interested in those. Next time I go on, I get The Guardian UK, HuffPost Women, and Vox. I say I’m not interested. The Guardian Tech, CNN, and The Verge are next. Rinse and repeat until I get tired of it all and just hide the trending news feature altogether. permalink parent award report block reply cupocovfefe 1 points 1 day ago I see this point of view clearly.  Very plausible. However,  I also see the argument there's simply a uniparty now that is more interested in globalism and intervention over seas.  With a pretty fake one being painted \"left\" and one being painted \"right.\" When in fact, it's more like 2 wings on 1 crappy bird flying in 1 \"post constitutional American\" direction. I think the second argument adds just a much head wind of frustration to why there's seemingly \"no interest to do what's right\" anymore anywhere. permalink parent award report block reply\nBullet3250 8 points 1 day ago YES - RUSH spoke to this regularly... UNless someone on THE RIGHTS BUYS THE WAPO AND CNN.... The REPUBLICANS need to just go forward and DO WHAT IS RIGHT - regardless of the media attacks - because what ever the Right does - the Media is just going to attack anyways.... SO JUST DO WHAT IS RIGHT! permalink parent award report block reply RuprechtThaMonkeyBoy 4 points 1 day ago 100% If you’re receiving media applause with an R by your name you’re not really a Republican or aligned with the values of American Exceptionalism. permalink parent award report block reply Capitalism_Fuck_Yeah 2 points 1 day ago Doesn't matter. They are dying media forms. What you need to understand is the power of the default. Most people have a default webpage and just read whatever is presented on it. Windows has default news built into it that excluded all right wing sources. Apple does the same. By default everything is left wing only sources so that's what young people and the politically untuned believe. Those sources are also what they demand in school so the default sources. permalink parent award report block reply Bullet3250 2 points 1 day ago MSM has already seeped online long ago... Just look up the Top Ten Online news sites... it's all CNN and NYTs and NBC news etc... Fox News is the only non-hard Left Online news site. permalink parent award report block reply stjimmy92 1 points 23 hours ago By default everything is left wing only sources It’s honestly essentially impossible to get those news features to show anything other than left wing sources. I use Bing as my search engine and it gives a bunch of trending news when you go to it. So it’s all The Guardian, HuffPost, The Atlantic. I tell it I’m not interested in those. Next time I go on, I get The Guardian UK, HuffPost Women, and Vox. I say I’m not interested. The Guardian Tech, CNN, and The Verge are next. Rinse and repeat until I get tired of it all and just hide the trending news feature altogether. permalink parent award report block reply cupocovfefe 1 points 1 day ago I see this point of view clearly.  Very plausible. However,  I also see the argument there's simply a uniparty now that is more interested in globalism and intervention over seas.  With a pretty fake one being painted \"left\" and one being painted \"right.\" When in fact, it's more like 2 wings on 1 crappy bird flying in 1 \"post constitutional American\" direction. I think the second argument adds just a much head wind of frustration to why there's seemingly \"no interest to do what's right\" anymore anywhere. permalink parent award report block reply\nRuprechtThaMonkeyBoy 4 points 1 day ago 100% If you’re receiving media applause with an R by your name you’re not really a Republican or aligned with the values of American Exceptionalism. permalink parent award report block reply\nCapitalism_Fuck_Yeah 2 points 1 day ago Doesn't matter. They are dying media forms. What you need to understand is the power of the default. Most people have a default webpage and just read whatever is presented on it. Windows has default news built into it that excluded all right wing sources. Apple does the same. By default everything is left wing only sources so that's what young people and the politically untuned believe. Those sources are also what they demand in school so the default sources. permalink parent award report block reply Bullet3250 2 points 1 day ago MSM has already seeped online long ago... Just look up the Top Ten Online news sites... it's all CNN and NYTs and NBC news etc... Fox News is the only non-hard Left Online news site. permalink parent award report block reply stjimmy92 1 points 23 hours ago By default everything is left wing only sources It’s honestly essentially impossible to get those news features to show anything other than left wing sources. I use Bing as my search engine and it gives a bunch of trending news when you go to it. So it’s all The Guardian, HuffPost, The Atlantic. I tell it I’m not interested in those. Next time I go on, I get The Guardian UK, HuffPost Women, and Vox. I say I’m not interested. The Guardian Tech, CNN, and The Verge are next. Rinse and repeat until I get tired of it all and just hide the trending news feature altogether. permalink parent award report block reply\nBullet3250 2 points 1 day ago MSM has already seeped online long ago... Just look up the Top Ten Online news sites... it's all CNN and NYTs and NBC news etc... Fox News is the only non-hard Left Online news site. permalink parent award report block reply\nstjimmy92 1 points 23 hours ago By default everything is left wing only sources It’s honestly essentially impossible to get those news features to show anything other than left wing sources. I use Bing as my search engine and it gives a bunch of trending news when you go to it. So it’s all The Guardian, HuffPost, The Atlantic. I tell it I’m not interested in those. Next time I go on, I get The Guardian UK, HuffPost Women, and Vox. I say I’m not interested. The Guardian Tech, CNN, and The Verge are next. Rinse and repeat until I get tired of it all and just hide the trending news feature altogether. permalink parent award report block reply\ncupocovfefe 1 points 1 day ago I see this point of view clearly.  Very plausible. However,  I also see the argument there's simply a uniparty now that is more interested in globalism and intervention over seas.  With a pretty fake one being painted \"left\" and one being painted \"right.\" When in fact, it's more like 2 wings on 1 crappy bird flying in 1 \"post constitutional American\" direction. I think the second argument adds just a much head wind of frustration to why there's seemingly \"no interest to do what's right\" anymore anywhere. permalink parent award report block reply\nBigdeal 3 points 1 day ago I love it, keep it shut down. I am not hurt at all by it. If you are hurt, you need to look at your life choices. permalink parent award report block reply\nThatsGold 10 points 1 day ago Not a fan of this iteration of Trump permalink award report block reply Bazhosh 3 points 1 day ago What happened to Campaign Trump? permalink parent award report block reply RiolindasReturn 7 points 1 day ago He wants to be liked and is now facing The Media vs MAGA rally attendees. permalink parent award report block reply Appeal2Heaven98 1 points 1 day ago He's probably realizing most of his agenda is a losing battle, I guess. He doesn't want to go nuclear. permalink parent award report block reply TrumpDupedMAGA 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nBazhosh 3 points 1 day ago What happened to Campaign Trump? permalink parent award report block reply RiolindasReturn 7 points 1 day ago He wants to be liked and is now facing The Media vs MAGA rally attendees. permalink parent award report block reply Appeal2Heaven98 1 points 1 day ago He's probably realizing most of his agenda is a losing battle, I guess. He doesn't want to go nuclear. permalink parent award report block reply TrumpDupedMAGA 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nRiolindasReturn 7 points 1 day ago He wants to be liked and is now facing The Media vs MAGA rally attendees. permalink parent award report block reply\nAppeal2Heaven98 1 points 1 day ago He's probably realizing most of his agenda is a losing battle, I guess. He doesn't want to go nuclear. permalink parent award report block reply\nTrumpDupedMAGA 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nConsrvspkgNJ 9 points 1 day ago All of this whining makes no sense. Are you guys new around here? Do you understand what just happened to the Dems? You can't out of one side of your mouth say the Dems want to put Trump in jail or flat out assassinate him and then out of the other side of your mouth say they were all in on it. It just doesn't match reality. I remember the days when Tom Daschle would drive up to the Reagan White House in a hearse to pick up the Presidents budget as a symbolic gesture that it will be dead on arrival. No, the Democrats discovered this one time that they lose when Republicans grow a spine. Anyone who has been following politics for more than a week knows the Democrats did not want to learn that lesson. They much prefer it when they smack the Republicans in the head, the Republican cowers in fear and the Dems do whatever they want. Being told no for 39 days was definitely not in their playbook. Yesterday the Democrat armor cracked....we need to remember that. permalink award report block reply DatTrumpDoh 7 points 1 day ago Most of this site has been infiltrated by bots who just signal against whatever wins the right gets in order to demoralize. permalink parent award report block reply PROCIsAsshoe 3 points 19 hours ago and they all post their whiny bitchy takes within a few minutes of the post. not real people to be so 'on top' of things. permalink parent award report block reply Klaus73 4 points 1 day ago I will present something of a case. Firstly Trump isn't perfect; I think part of the problem is generally frustration on both sides. The whiners are frustrated because they see legit issues of the agenda discarded or seemingly ignored. Once Trump took power suddenly he didn't care about Epstien; other issues he has tried to generally gaslight the public on and so; the whiners whine. They are the canaries in the coal mine and its frustrating to tell the kid to stop touching the hot stove and burning himself and yet he insists its fine. On the flip side the cheerleaders are believing that any claim to the counter of Trumps spin is somehow an attempt to undermine the administration - they hate when something a legit win is spun as a loss (deportation numbers for example). They cannot see anyway to get the whiners to see things how they see them. Both sides have legit concerns; but as far as impact - the whiners arguments only work if you follow up on them and can verify the facts. If you see someone whine; in a few cases you can verify that the whine is something that is actually happening - regardless of what the admin is saying. No one things 50 year mortgages to flood the market with more debt and jacking up the price of housing is a good idea - the fact Trump is in real-estate means I have to assume he knows some basic economic facts about how housing prices are. I won't rant about the constant deflection of the job market claims. If the whiners are ignored and the gaslighting is welcomed - then MAGA will be having a party in the big tent while the democrats set fire to it outside - the whiners are warning you of the enemy movements and the gaps in the defenses and positive thinking or not having a solution is not going to improve that situation. Its hard because frankly everyone is moving toward the \"I don't want to hear it\" mindset and its unhealthy for MAGA if its serious about actually fixing the USA. The shutdown is a prime example. I don't think the democrats lost this one; end of the day most public sentiment was that republicans are in charge and thus are responsible. There was no way the shutdown was going to last through thanksgiving - US folks going hungry and folks working for free and generally no air travel would have spelled a political nightmare for the republicans and democrats alike as anger would hit a critical point. The democrats can play this off as folding as a act of compassion; the \"pain\" of the shutdown that was caused had the admin making an active effort to worsen it while the democrats merely sat back and let it burn. \"We care about jobs\"+\"We are going to lay-off public servants\" is a message that is hypocritical and most common folk probably understand that. \"We don't want folk going hungry\"+ making an appeal to avoid having to find a way to pay out stuff like SNAP is of the same vein. Those were actions taken by the admin during the shutdown and for better or worse; the public see's the admin lying when they act like they didn't want it. The democrats won the optics with the common man; some of their more hardcore supporters are pissed because they \"folded\" but that only matters if your not thinking tactics. As it stands the democrats just set up a timebomb. They will be able to get their Epstien vote in time for Christmas when families are going to gather and talk to each other to move issues by word of mouth. If Thune doesn't hold the ACA vote by mid december then the democrats will be able to again point out \"We tried good faith...the republicans broke the trust\" which would be a true statement and generally if they break the trust it will worsen politics. If the vote passes and Trump veto's it \"You all get higher healthcare costs for Christmas\" the ad writes itself. If they vote no then the ad will be similar. Regardless in January they will shutdown the government again and let it ride out longer so that it will be fresh in folks minds for the mid-terms. Thats the tactic; the democrats are setting the republicans up and folks are dancing in the street because they \"pwned\" the dems; but celebrating has been a weakness of MAGA for awhile as its developing a bad habit of denying reality for optics. permalink parent award report block reply ConsrvspkgNJ 2 points 1 day ago So, let me break this down. The 39 day humiliation of the Democrats doesn't matter because at the end of the day, they will pwn the GOP? Tell me how that makes sense considering for the 45 years I have been into politics, the Democrats take great pride in beating GOP ass with great regularity. Why go through the whole Kabuki theater when you can just bitch slap your opponent and get them back in line and why would Democrats allow this humiliation? Sorry Fren, knowing Democrats as I do they would never allow this to happen. They hate us too much to play fuck fuck games like that. permalink parent award report block reply Klaus73 1 points 1 day ago Totally fair. The 39 days pushed the fear into public light; up until that point most economic concerns were fringe and no one was considering it - those that could afford stuff continued to do so; suddenly you had threats of food riots and suddenly the planes were not all running; the common folk couldn't ignore it anymore and since the republicans had already declared victory and being in control; regardless of the fact the dems triggered the shutdown; in Trumps own words its the presidents fault. Reality is that the democrats really do have very little power; they are essentially an air-bubble in the circulatory system of the admin; the shutdown was a very mild stroke. The democrats don't need to \"look good\" as they are largely out of the public limelight - the news is pretty much wall to wall republicans right now. That means the democrats got the advantage of not needing to \"do\" anything; they merely need to high light when those republicans fuck up and make a potential republican failing snowball into something worse. What your seeing now I am convinced is a retreat to draw republicans into a killbox. If the republicans take the bait its going to be even worse; but regardless the republicans have no choice now but to persue. If Trump vetos the ACA..dems get credit; if ACA passes; dems get credit; if the ACA dies on the floor republicans get the blame in time for Christmas and come january your right back in a fresh shutdown that will run a month or two so its in folks minds when the midterm discussions start. I hope your right; but there is no logic to the democrats suddenly permitting the lights going back on to get the stuff they had already been offered; the fillibuster threat was not big enough as even the republicans don't got a stomach for it and the optics about SNAP already being the admins fault was laid out. I would not underestimate the democrats on this..2+2 is equalling up to 5 and so something is missing here. permalink parent award report block reply ConsrvspkgNJ 1 points 1 day ago I am most certainly not underestimating the Democrats which is why I am wondering how you came up with this theory. Since the 1970's, the Democrats haven't had to do a thing to get their way. It was always... Step 1. Decide they want something Step 2. Anticipate GOP resistance and bitch slap them Step 3. Have the Big 3, The NY Times and Washington Post all do \"hard hitting expose's\" on Republican cruelty and inability to be bi-partisan Step 4. Watch GOP surrender so as to look bi-partisan Step 5. Get what they want and give the GOP the finger as they win again. There was no need to do this 39 day Kabuki Theater thing, they have the GOP in a pillbox whenever they want them. They did not have to humiliate themselves to get this. No sir, this is a legitimate loss by the Dems and to give them credit for anything else is a grave disservice. permalink parent award report block reply view 3 more comments... NimblePepeCentipede 3 points 1 day ago .....this^ permalink parent award report block reply KekistaniMemeLord 3 points 1 day ago To answer your question, yes, these people are new. Demoralizing shill faggots have infested this site for a long time and it's getting worse. Some of the absolute lowest IQ dumb fuck comments from these people who constantly whine and commiserate. Their goal is to demoralize MAGA and eat away at Trump's base. permalink parent award report block reply PROCIsAsshoe 2 points 19 hours ago I cannot imagine being such a miserable faggot. these people are pathetic. permalink parent award report block reply JoinTheDiscussion 1 points 15 hours ago What you fail to consider are there are plenty of RINOs who were hoping for and likely part of his assassination attempt.. permalink parent award report block reply ConsrvspkgNJ 1 points 4 hours ago That's a pretty bold statement. One that I am going to have to ask you to prove. permalink parent award report block reply\nDatTrumpDoh 7 points 1 day ago Most of this site has been infiltrated by bots who just signal against whatever wins the right gets in order to demoralize. permalink parent award report block reply PROCIsAsshoe 3 points 19 hours ago and they all post their whiny bitchy takes within a few minutes of the post. not real people to be so 'on top' of things. permalink parent award report block reply\nPROCIsAsshoe 3 points 19 hours ago and they all post their whiny bitchy takes within a few minutes of the post. not real people to be so 'on top' of things. permalink parent award report block reply\nKlaus73 4 points 1 day ago I will present something of a case. Firstly Trump isn't perfect; I think part of the problem is generally frustration on both sides. The whiners are frustrated because they see legit issues of the agenda discarded or seemingly ignored. Once Trump took power suddenly he didn't care about Epstien; other issues he has tried to generally gaslight the public on and so; the whiners whine. They are the canaries in the coal mine and its frustrating to tell the kid to stop touching the hot stove and burning himself and yet he insists its fine. On the flip side the cheerleaders are believing that any claim to the counter of Trumps spin is somehow an attempt to undermine the administration - they hate when something a legit win is spun as a loss (deportation numbers for example). They cannot see anyway to get the whiners to see things how they see them. Both sides have legit concerns; but as far as impact - the whiners arguments only work if you follow up on them and can verify the facts. If you see someone whine; in a few cases you can verify that the whine is something that is actually happening - regardless of what the admin is saying. No one things 50 year mortgages to flood the market with more debt and jacking up the price of housing is a good idea - the fact Trump is in real-estate means I have to assume he knows some basic economic facts about how housing prices are. I won't rant about the constant deflection of the job market claims. If the whiners are ignored and the gaslighting is welcomed - then MAGA will be having a party in the big tent while the democrats set fire to it outside - the whiners are warning you of the enemy movements and the gaps in the defenses and positive thinking or not having a solution is not going to improve that situation. Its hard because frankly everyone is moving toward the \"I don't want to hear it\" mindset and its unhealthy for MAGA if its serious about actually fixing the USA. The shutdown is a prime example. I don't think the democrats lost this one; end of the day most public sentiment was that republicans are in charge and thus are responsible. There was no way the shutdown was going to last through thanksgiving - US folks going hungry and folks working for free and generally no air travel would have spelled a political nightmare for the republicans and democrats alike as anger would hit a critical point. The democrats can play this off as folding as a act of compassion; the \"pain\" of the shutdown that was caused had the admin making an active effort to worsen it while the democrats merely sat back and let it burn. \"We care about jobs\"+\"We are going to lay-off public servants\" is a message that is hypocritical and most common folk probably understand that. \"We don't want folk going hungry\"+ making an appeal to avoid having to find a way to pay out stuff like SNAP is of the same vein. Those were actions taken by the admin during the shutdown and for better or worse; the public see's the admin lying when they act like they didn't want it. The democrats won the optics with the common man; some of their more hardcore supporters are pissed because they \"folded\" but that only matters if your not thinking tactics. As it stands the democrats just set up a timebomb. They will be able to get their Epstien vote in time for Christmas when families are going to gather and talk to each other to move issues by word of mouth. If Thune doesn't hold the ACA vote by mid december then the democrats will be able to again point out \"We tried good faith...the republicans broke the trust\" which would be a true statement and generally if they break the trust it will worsen politics. If the vote passes and Trump veto's it \"You all get higher healthcare costs for Christmas\" the ad writes itself. If they vote no then the ad will be similar. Regardless in January they will shutdown the government again and let it ride out longer so that it will be fresh in folks minds for the mid-terms. Thats the tactic; the democrats are setting the republicans up and folks are dancing in the street because they \"pwned\" the dems; but celebrating has been a weakness of MAGA for awhile as its developing a bad habit of denying reality for optics. permalink parent award report block reply ConsrvspkgNJ 2 points 1 day ago So, let me break this down. The 39 day humiliation of the Democrats doesn't matter because at the end of the day, they will pwn the GOP? Tell me how that makes sense considering for the 45 years I have been into politics, the Democrats take great pride in beating GOP ass with great regularity. Why go through the whole Kabuki theater when you can just bitch slap your opponent and get them back in line and why would Democrats allow this humiliation? Sorry Fren, knowing Democrats as I do they would never allow this to happen. They hate us too much to play fuck fuck games like that. permalink parent award report block reply Klaus73 1 points 1 day ago Totally fair. The 39 days pushed the fear into public light; up until that point most economic concerns were fringe and no one was considering it - those that could afford stuff continued to do so; suddenly you had threats of food riots and suddenly the planes were not all running; the common folk couldn't ignore it anymore and since the republicans had already declared victory and being in control; regardless of the fact the dems triggered the shutdown; in Trumps own words its the presidents fault. Reality is that the democrats really do have very little power; they are essentially an air-bubble in the circulatory system of the admin; the shutdown was a very mild stroke. The democrats don't need to \"look good\" as they are largely out of the public limelight - the news is pretty much wall to wall republicans right now. That means the democrats got the advantage of not needing to \"do\" anything; they merely need to high light when those republicans fuck up and make a potential republican failing snowball into something worse. What your seeing now I am convinced is a retreat to draw republicans into a killbox. If the republicans take the bait its going to be even worse; but regardless the republicans have no choice now but to persue. If Trump vetos the ACA..dems get credit; if ACA passes; dems get credit; if the ACA dies on the floor republicans get the blame in time for Christmas and come january your right back in a fresh shutdown that will run a month or two so its in folks minds when the midterm discussions start. I hope your right; but there is no logic to the democrats suddenly permitting the lights going back on to get the stuff they had already been offered; the fillibuster threat was not big enough as even the republicans don't got a stomach for it and the optics about SNAP already being the admins fault was laid out. I would not underestimate the democrats on this..2+2 is equalling up to 5 and so something is missing here. permalink parent award report block reply ConsrvspkgNJ 1 points 1 day ago I am most certainly not underestimating the Democrats which is why I am wondering how you came up with this theory. Since the 1970's, the Democrats haven't had to do a thing to get their way. It was always... Step 1. Decide they want something Step 2. Anticipate GOP resistance and bitch slap them Step 3. Have the Big 3, The NY Times and Washington Post all do \"hard hitting expose's\" on Republican cruelty and inability to be bi-partisan Step 4. Watch GOP surrender so as to look bi-partisan Step 5. Get what they want and give the GOP the finger as they win again. There was no need to do this 39 day Kabuki Theater thing, they have the GOP in a pillbox whenever they want them. They did not have to humiliate themselves to get this. No sir, this is a legitimate loss by the Dems and to give them credit for anything else is a grave disservice. permalink parent award report block reply view 3 more comments...\nConsrvspkgNJ 2 points 1 day ago So, let me break this down. The 39 day humiliation of the Democrats doesn't matter because at the end of the day, they will pwn the GOP? Tell me how that makes sense considering for the 45 years I have been into politics, the Democrats take great pride in beating GOP ass with great regularity. Why go through the whole Kabuki theater when you can just bitch slap your opponent and get them back in line and why would Democrats allow this humiliation? Sorry Fren, knowing Democrats as I do they would never allow this to happen. They hate us too much to play fuck fuck games like that. permalink parent award report block reply Klaus73 1 points 1 day ago Totally fair. The 39 days pushed the fear into public light; up until that point most economic concerns were fringe and no one was considering it - those that could afford stuff continued to do so; suddenly you had threats of food riots and suddenly the planes were not all running; the common folk couldn't ignore it anymore and since the republicans had already declared victory and being in control; regardless of the fact the dems triggered the shutdown; in Trumps own words its the presidents fault. Reality is that the democrats really do have very little power; they are essentially an air-bubble in the circulatory system of the admin; the shutdown was a very mild stroke. The democrats don't need to \"look good\" as they are largely out of the public limelight - the news is pretty much wall to wall republicans right now. That means the democrats got the advantage of not needing to \"do\" anything; they merely need to high light when those republicans fuck up and make a potential republican failing snowball into something worse. What your seeing now I am convinced is a retreat to draw republicans into a killbox. If the republicans take the bait its going to be even worse; but regardless the republicans have no choice now but to persue. If Trump vetos the ACA..dems get credit; if ACA passes; dems get credit; if the ACA dies on the floor republicans get the blame in time for Christmas and come january your right back in a fresh shutdown that will run a month or two so its in folks minds when the midterm discussions start. I hope your right; but there is no logic to the democrats suddenly permitting the lights going back on to get the stuff they had already been offered; the fillibuster threat was not big enough as even the republicans don't got a stomach for it and the optics about SNAP already being the admins fault was laid out. I would not underestimate the democrats on this..2+2 is equalling up to 5 and so something is missing here. permalink parent award report block reply ConsrvspkgNJ 1 points 1 day ago I am most certainly not underestimating the Democrats which is why I am wondering how you came up with this theory. Since the 1970's, the Democrats haven't had to do a thing to get their way. It was always... Step 1. Decide they want something Step 2. Anticipate GOP resistance and bitch slap them Step 3. Have the Big 3, The NY Times and Washington Post all do \"hard hitting expose's\" on Republican cruelty and inability to be bi-partisan Step 4. Watch GOP surrender so as to look bi-partisan Step 5. Get what they want and give the GOP the finger as they win again. There was no need to do this 39 day Kabuki Theater thing, they have the GOP in a pillbox whenever they want them. They did not have to humiliate themselves to get this. No sir, this is a legitimate loss by the Dems and to give them credit for anything else is a grave disservice. permalink parent award report block reply view 3 more comments...\nKlaus73 1 points 1 day ago Totally fair. The 39 days pushed the fear into public light; up until that point most economic concerns were fringe and no one was considering it - those that could afford stuff continued to do so; suddenly you had threats of food riots and suddenly the planes were not all running; the common folk couldn't ignore it anymore and since the republicans had already declared victory and being in control; regardless of the fact the dems triggered the shutdown; in Trumps own words its the presidents fault. Reality is that the democrats really do have very little power; they are essentially an air-bubble in the circulatory system of the admin; the shutdown was a very mild stroke. The democrats don't need to \"look good\" as they are largely out of the public limelight - the news is pretty much wall to wall republicans right now. That means the democrats got the advantage of not needing to \"do\" anything; they merely need to high light when those republicans fuck up and make a potential republican failing snowball into something worse. What your seeing now I am convinced is a retreat to draw republicans into a killbox. If the republicans take the bait its going to be even worse; but regardless the republicans have no choice now but to persue. If Trump vetos the ACA..dems get credit; if ACA passes; dems get credit; if the ACA dies on the floor republicans get the blame in time for Christmas and come january your right back in a fresh shutdown that will run a month or two so its in folks minds when the midterm discussions start. I hope your right; but there is no logic to the democrats suddenly permitting the lights going back on to get the stuff they had already been offered; the fillibuster threat was not big enough as even the republicans don't got a stomach for it and the optics about SNAP already being the admins fault was laid out. I would not underestimate the democrats on this..2+2 is equalling up to 5 and so something is missing here. permalink parent award report block reply ConsrvspkgNJ 1 points 1 day ago I am most certainly not underestimating the Democrats which is why I am wondering how you came up with this theory. Since the 1970's, the Democrats haven't had to do a thing to get their way. It was always... Step 1. Decide they want something Step 2. Anticipate GOP resistance and bitch slap them Step 3. Have the Big 3, The NY Times and Washington Post all do \"hard hitting expose's\" on Republican cruelty and inability to be bi-partisan Step 4. Watch GOP surrender so as to look bi-partisan Step 5. Get what they want and give the GOP the finger as they win again. There was no need to do this 39 day Kabuki Theater thing, they have the GOP in a pillbox whenever they want them. They did not have to humiliate themselves to get this. No sir, this is a legitimate loss by the Dems and to give them credit for anything else is a grave disservice. permalink parent award report block reply view 3 more comments...\nConsrvspkgNJ 1 points 1 day ago I am most certainly not underestimating the Democrats which is why I am wondering how you came up with this theory. Since the 1970's, the Democrats haven't had to do a thing to get their way. It was always... Step 1. Decide they want something Step 2. Anticipate GOP resistance and bitch slap them Step 3. Have the Big 3, The NY Times and Washington Post all do \"hard hitting expose's\" on Republican cruelty and inability to be bi-partisan Step 4. Watch GOP surrender so as to look bi-partisan Step 5. Get what they want and give the GOP the finger as they win again. There was no need to do this 39 day Kabuki Theater thing, they have the GOP in a pillbox whenever they want them. They did not have to humiliate themselves to get this. No sir, this is a legitimate loss by the Dems and to give them credit for anything else is a grave disservice. permalink parent award report block reply view 3 more comments...\nNimblePepeCentipede 3 points 1 day ago .....this^ permalink parent award report block reply\nKekistaniMemeLord 3 points 1 day ago To answer your question, yes, these people are new. Demoralizing shill faggots have infested this site for a long time and it's getting worse. Some of the absolute lowest IQ dumb fuck comments from these people who constantly whine and commiserate. Their goal is to demoralize MAGA and eat away at Trump's base. permalink parent award report block reply PROCIsAsshoe 2 points 19 hours ago I cannot imagine being such a miserable faggot. these people are pathetic. permalink parent award report block reply\nPROCIsAsshoe 2 points 19 hours ago I cannot imagine being such a miserable faggot. these people are pathetic. permalink parent award report block reply\nJoinTheDiscussion 1 points 15 hours ago What you fail to consider are there are plenty of RINOs who were hoping for and likely part of his assassination attempt.. permalink parent award report block reply ConsrvspkgNJ 1 points 4 hours ago That's a pretty bold statement. One that I am going to have to ask you to prove. permalink parent award report block reply\nConsrvspkgNJ 1 points 4 hours ago That's a pretty bold statement. One that I am going to have to ask you to prove. permalink parent award report block reply\nfinnigan 7 points 1 day ago Schumer won.  If snap is funded, repubs lost.  This was our chance to end the fillibuster and really pass some good legislation and the repubs caved like little girls playing hopscotch.  I hate the repub party. permalink award report block reply ughicanteven 3 points 1 day ago democrats were losing on this issue. recent polls show dems -16 for reopening but repubs +50 approval. getting rid of the fillibuster would have dug democrats out of their own hole. I agree getting rid of the fillibuster anyway, but in this specific instance it would have helped democrats permalink parent award report block reply JoinTheDiscussion 1 points 15 hours ago So now we think the \"Republicans\" reopening the government to feed 25+million illegals will somehow gain some R votes?! All while pissing off ALL of MAGA! permalink parent award report block reply ughicanteven 1 points 14 hours ago look how seething the dems are with schumer and the party. nuking the filibuster would have let them off the hook. we can nuke the filibuster anytime we want. permalink parent award report block reply KekistaniMemeLord 1 points 1 day ago no he did not lmfao, are you fucks actually retarded? Millions of people saw absolutely fucked SNAP was in addition to NOT getting his 1.5 trillion for illegals. It was total defeat for Dems, they got no concessions. permalink parent award report block reply 2scoops2peachmints 1 points 1 day ago You’re right but you’re forgetting one thing, this will invigorate the dem base and we will be slaughtered come mid terms. We can’t even get outside to do a simple protest. Dem had hundreds of thousands across the country mobilized in the streets, even if it wasn’t organic the optics are not good for the GOP come mid terms. Outside is fucking weak and scared. Cant even get all of our reps to vote together, almost never see dems breaking ranks and when they do it’s planned permalink parent award report block reply KekistaniMemeLord 1 points 1 day ago republicans continue to fail in offyear and local elections. We simply don't show up and it doesn't help when our own side says it doesn't matter because dems will cheat. Of course they will but they don't even have to try if we don't come to the polls. It's incredible that we have republican voters who still think they can just sit elections out for any reason. The more we vote, the more they have to do to overcome it and the more ammo it gives us publicly and for Trump and team to go after them. I'm not super worried about the recent elections cuz NY and VA is mostly demographic replacement, lot of republican voters have already left and NJ was already blue. im optimistic for midterms with mass deportations and redistricting happening. permalink parent award report block reply JoinTheDiscussion 1 points 15 hours ago It won't be enough.. permalink parent award report block reply\nughicanteven 3 points 1 day ago democrats were losing on this issue. recent polls show dems -16 for reopening but repubs +50 approval. getting rid of the fillibuster would have dug democrats out of their own hole. I agree getting rid of the fillibuster anyway, but in this specific instance it would have helped democrats permalink parent award report block reply JoinTheDiscussion 1 points 15 hours ago So now we think the \"Republicans\" reopening the government to feed 25+million illegals will somehow gain some R votes?! All while pissing off ALL of MAGA! permalink parent award report block reply ughicanteven 1 points 14 hours ago look how seething the dems are with schumer and the party. nuking the filibuster would have let them off the hook. we can nuke the filibuster anytime we want. permalink parent award report block reply\nJoinTheDiscussion 1 points 15 hours ago So now we think the \"Republicans\" reopening the government to feed 25+million illegals will somehow gain some R votes?! All while pissing off ALL of MAGA! permalink parent award report block reply ughicanteven 1 points 14 hours ago look how seething the dems are with schumer and the party. nuking the filibuster would have let them off the hook. we can nuke the filibuster anytime we want. permalink parent award report block reply\nughicanteven 1 points 14 hours ago look how seething the dems are with schumer and the party. nuking the filibuster would have let them off the hook. we can nuke the filibuster anytime we want. permalink parent award report block reply\nKekistaniMemeLord 1 points 1 day ago no he did not lmfao, are you fucks actually retarded? Millions of people saw absolutely fucked SNAP was in addition to NOT getting his 1.5 trillion for illegals. It was total defeat for Dems, they got no concessions. permalink parent award report block reply 2scoops2peachmints 1 points 1 day ago You’re right but you’re forgetting one thing, this will invigorate the dem base and we will be slaughtered come mid terms. We can’t even get outside to do a simple protest. Dem had hundreds of thousands across the country mobilized in the streets, even if it wasn’t organic the optics are not good for the GOP come mid terms. Outside is fucking weak and scared. Cant even get all of our reps to vote together, almost never see dems breaking ranks and when they do it’s planned permalink parent award report block reply KekistaniMemeLord 1 points 1 day ago republicans continue to fail in offyear and local elections. We simply don't show up and it doesn't help when our own side says it doesn't matter because dems will cheat. Of course they will but they don't even have to try if we don't come to the polls. It's incredible that we have republican voters who still think they can just sit elections out for any reason. The more we vote, the more they have to do to overcome it and the more ammo it gives us publicly and for Trump and team to go after them. I'm not super worried about the recent elections cuz NY and VA is mostly demographic replacement, lot of republican voters have already left and NJ was already blue. im optimistic for midterms with mass deportations and redistricting happening. permalink parent award report block reply JoinTheDiscussion 1 points 15 hours ago It won't be enough.. permalink parent award report block reply\n2scoops2peachmints 1 points 1 day ago You’re right but you’re forgetting one thing, this will invigorate the dem base and we will be slaughtered come mid terms. We can’t even get outside to do a simple protest. Dem had hundreds of thousands across the country mobilized in the streets, even if it wasn’t organic the optics are not good for the GOP come mid terms. Outside is fucking weak and scared. Cant even get all of our reps to vote together, almost never see dems breaking ranks and when they do it’s planned permalink parent award report block reply KekistaniMemeLord 1 points 1 day ago republicans continue to fail in offyear and local elections. We simply don't show up and it doesn't help when our own side says it doesn't matter because dems will cheat. Of course they will but they don't even have to try if we don't come to the polls. It's incredible that we have republican voters who still think they can just sit elections out for any reason. The more we vote, the more they have to do to overcome it and the more ammo it gives us publicly and for Trump and team to go after them. I'm not super worried about the recent elections cuz NY and VA is mostly demographic replacement, lot of republican voters have already left and NJ was already blue. im optimistic for midterms with mass deportations and redistricting happening. permalink parent award report block reply JoinTheDiscussion 1 points 15 hours ago It won't be enough.. permalink parent award report block reply\nKekistaniMemeLord 1 points 1 day ago republicans continue to fail in offyear and local elections. We simply don't show up and it doesn't help when our own side says it doesn't matter because dems will cheat. Of course they will but they don't even have to try if we don't come to the polls. It's incredible that we have republican voters who still think they can just sit elections out for any reason. The more we vote, the more they have to do to overcome it and the more ammo it gives us publicly and for Trump and team to go after them. I'm not super worried about the recent elections cuz NY and VA is mostly demographic replacement, lot of republican voters have already left and NJ was already blue. im optimistic for midterms with mass deportations and redistricting happening. permalink parent award report block reply JoinTheDiscussion 1 points 15 hours ago It won't be enough.. permalink parent award report block reply\nJoinTheDiscussion 1 points 15 hours ago It won't be enough.. permalink parent award report block reply\nRizzlieDoodad 7 points 1 day ago The Republicans broke the Democrats by extending the Biden budget. Ok lol. Cope harder permalink award report block reply TrumpDupedMAGA 0 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nTrumpDupedMAGA 0 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nindigo_truther 5 points 1 day ago Schumer somehow got outsmarted by AOC again who is constantly able to drive the narrative and will definitely take his Senate seat. permalink award report block reply\nSpellmonger 4 points 1 day ago Yet, our elections have not been secured.   And more than likely will not be, except for a crumb here and there in one or two states that won't affect any real change in the ability of American politicians to steal elections. IMO, the reason the Democrats gave in was because President Trump had engaged the American people and was close to forcing Republicans to nuke the filibuster and do real election reform. permalink award report block reply Steve56775 3 points 1 day ago This was the Republicans opportunity to fix Voter fraud, end Obamacare, balance the budget, and enact  permanent reforms to federal agencies, and they blew it.  That’s one thing we can count on the Rinos to do and that is nothing when the opportunity arises. permalink parent award report block reply JoinTheDiscussion 1 points 15 hours ago 100%! We got the loss here permalink parent award report block reply\nSteve56775 3 points 1 day ago This was the Republicans opportunity to fix Voter fraud, end Obamacare, balance the budget, and enact  permanent reforms to federal agencies, and they blew it.  That’s one thing we can count on the Rinos to do and that is nothing when the opportunity arises. permalink parent award report block reply JoinTheDiscussion 1 points 15 hours ago 100%! We got the loss here permalink parent award report block reply\nJoinTheDiscussion 1 points 15 hours ago 100%! We got the loss here permalink parent award report block reply\nYodaBannon 4 points 1 day ago Democrat party is so desperate. And I laugh and laugh. permalink award report block reply\nutfanx2 3 points 1 day ago You don't get what you want as the minority. You negotiate for less of what you don't want. permalink award report block reply\nRandyMoss 3 points 1 day ago On what planet is this a win for MAGA? It's the same FUCKING bill that Joe Biden passed 5 years ago. The \"win\" is that the additional ACA subsidies didn't get added. People on this site are incredibly retarded. permalink award report block reply Michalusmichalus 1 points 1 day ago Inflation in the last  5 years means it's not equal to that bill. That's how it's a technical win. permalink parent award report block reply RandyMoss 2 points 7 hours ago 🤮🤮🤮 permalink parent award report block reply TrumpDupedMAGA -1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nMichalusmichalus 1 points 1 day ago Inflation in the last  5 years means it's not equal to that bill. That's how it's a technical win. permalink parent award report block reply RandyMoss 2 points 7 hours ago 🤮🤮🤮 permalink parent award report block reply\nRandyMoss 2 points 7 hours ago 🤮🤮🤮 permalink parent award report block reply\nTrumpDupedMAGA -1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nemorphia 3 points 1 day ago but part of this deal is not firing the fed employees.\ni do not see the win in that.\nTrump needs to return to full MAGA.\nhe is too much playing politics now with the dems.\nand the dems win that game because the republicans just want to lose in grace and not win. permalink award report block reply JoinTheDiscussion 1 points 15 hours ago Compromised... permalink parent award report block reply\nJoinTheDiscussion 1 points 15 hours ago Compromised... permalink parent award report block reply\nSqRt7744 3 points 1 day ago Haha yeah right!? And the only people that ended up fucked are the American citizens! permalink award report block reply OG_BACONndEGGs -1 points 1 day ago Excalty don't celebrate to early. The repukes in DC will cave to dems next month and fund Obama care. You heard here first permalink parent award report block reply starjello 0 points 23 hours ago No I did not hear it hear first. Myself and like minded friends discuss it among ourselves quite often. And I gave you an upvote to counteract the fools who down voted you. permalink parent award report block reply\nOG_BACONndEGGs -1 points 1 day ago Excalty don't celebrate to early. The repukes in DC will cave to dems next month and fund Obama care. You heard here first permalink parent award report block reply starjello 0 points 23 hours ago No I did not hear it hear first. Myself and like minded friends discuss it among ourselves quite often. And I gave you an upvote to counteract the fools who down voted you. permalink parent award report block reply\nstarjello 0 points 23 hours ago No I did not hear it hear first. Myself and like minded friends discuss it among ourselves quite often. And I gave you an upvote to counteract the fools who down voted you. permalink parent award report block reply\nScoobyDum 3 points 1 day ago They got rid of legal weed killing thousands of jobs and an entire industry and removing access to cheap medical help. 2026 is going to be an epic bloodbath for republicans. They fucked up that bad with this shutdown. permalink award report block reply JoinTheDiscussion 1 points 15 hours ago They didn't \"fuck up\", they are obviously in the same boat, just slow rolling us into our demise.. We have one decent year left in this country, enjoy it while you can permalink parent award report block reply ianpatrick1966 0 points 1 day ago Citation? Is this the THCa crap? permalink parent award report block reply Michalusmichalus 0 points 1 day ago The first thing you need to remember is that it all comes from the hemp plant. https://evrimagaci.org/gpt/alcohol-and-pharma-giants-intensify-washington-lobbying-push-512170?srsltid=AfmBOoqMdqYVDhNMX1PPy28uKdXQc3c1rM83bDCXOV1PQcpzCmEhTv0Y permalink parent award report block reply\nJoinTheDiscussion 1 points 15 hours ago They didn't \"fuck up\", they are obviously in the same boat, just slow rolling us into our demise.. We have one decent year left in this country, enjoy it while you can permalink parent award report block reply\nianpatrick1966 0 points 1 day ago Citation? Is this the THCa crap? permalink parent award report block reply Michalusmichalus 0 points 1 day ago The first thing you need to remember is that it all comes from the hemp plant. https://evrimagaci.org/gpt/alcohol-and-pharma-giants-intensify-washington-lobbying-push-512170?srsltid=AfmBOoqMdqYVDhNMX1PPy28uKdXQc3c1rM83bDCXOV1PQcpzCmEhTv0Y permalink parent award report block reply\nMichalusmichalus 0 points 1 day ago The first thing you need to remember is that it all comes from the hemp plant. https://evrimagaci.org/gpt/alcohol-and-pharma-giants-intensify-washington-lobbying-push-512170?srsltid=AfmBOoqMdqYVDhNMX1PPy28uKdXQc3c1rM83bDCXOV1PQcpzCmEhTv0Y permalink parent award report block reply\nMichalusmichalus 2 points 1 day ago They're going to fuck with Fetterman again. Everytime he thinks for himself they attack him. permalink award report block reply\nSenorTrumper 2 points 1 day ago Cue Kathy \"He broke me\" Griffen style memes. permalink award report block reply\nkyle6969 2 points 1 day ago Everyone in government (Trump included) are all part of the same party. They all fucking suck and it’s all theatre. It’s becoming so fucking obvious. None of them truly want to do anything that benefits anyone but themselves. The faster we realize that…. permalink award report block reply BillyBobBrewer 3 points 1 day ago You get down voted here for speaking the truth because this site is a deep state honeypot/containment board. Notice how everything is permitted here except noticing that everyone in government is on the same team and who controls that team. permalink parent award report block reply kyle6969 1 points 1 day ago For sure - who gives a fuck about downvotes. Learned long ago not to care about that. Even if it’s not as deep as “deep state honeypot/containment” - like even if we just accept at face value that this is an open discussion forum - there’s a lot of morons who can’t think for themselves. They can’t analyze what’s happening and change their opinion. Cock gobbling, ball jugglers. Fuck the government. permalink parent award report block reply KekistaniMemeLord 0 points 1 day ago Neither of you spoke the truth lmfao. Trump is not one of them, thats why they tried to kill him you dumb faggots. permalink parent award report block reply Waterlaw -2 points 1 day ago what happened tho, during campaing and hes first term trump was great permalink parent award report block reply TrumpDupedMAGA 0 points 1 day ago Comment removed by community moderators. permalink parent award report block reply HumblePepe 1 points 1 day ago Makes me wonder what the goal of that was? All the chaos with Trump and his persecution by deep state. Show? Theater? If he was truly in on it, why raid his home? It makes me wonder if deep state, with all their ways, has some sort of nuclear scenario that Trump is treading around. permalink parent award report block reply KekistaniMemeLord 0 points 1 day ago The reason Trump is so popular and that MAGA/America First has become a juggernaut is precisely because Trump ISN'T one of them. Did you just wake up recently or something? permalink parent award report block reply kyle6969 3 points 1 day ago Dude I’ve been here the second it opened after the subreddit was banned. He ain’t done any of that shit. permalink parent award report block reply KekistaniMemeLord 0 points 1 day ago lying like shit, shillbot. Your response doesn't even make sense. \"he ain't done any of that shit\" I didn't list any actions he made dipshit bot lmao permalink parent award report block reply kyle6969 1 points 23 hours ago You’re so paranoid. I’m not going to go through a list of things he said he was going to do but didn’t. permalink parent award report block reply view 2 more comments...\nBillyBobBrewer 3 points 1 day ago You get down voted here for speaking the truth because this site is a deep state honeypot/containment board. Notice how everything is permitted here except noticing that everyone in government is on the same team and who controls that team. permalink parent award report block reply kyle6969 1 points 1 day ago For sure - who gives a fuck about downvotes. Learned long ago not to care about that. Even if it’s not as deep as “deep state honeypot/containment” - like even if we just accept at face value that this is an open discussion forum - there’s a lot of morons who can’t think for themselves. They can’t analyze what’s happening and change their opinion. Cock gobbling, ball jugglers. Fuck the government. permalink parent award report block reply KekistaniMemeLord 0 points 1 day ago Neither of you spoke the truth lmfao. Trump is not one of them, thats why they tried to kill him you dumb faggots. permalink parent award report block reply Waterlaw -2 points 1 day ago what happened tho, during campaing and hes first term trump was great permalink parent award report block reply TrumpDupedMAGA 0 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nkyle6969 1 points 1 day ago For sure - who gives a fuck about downvotes. Learned long ago not to care about that. Even if it’s not as deep as “deep state honeypot/containment” - like even if we just accept at face value that this is an open discussion forum - there’s a lot of morons who can’t think for themselves. They can’t analyze what’s happening and change their opinion. Cock gobbling, ball jugglers. Fuck the government. permalink parent award report block reply\nKekistaniMemeLord 0 points 1 day ago Neither of you spoke the truth lmfao. Trump is not one of them, thats why they tried to kill him you dumb faggots. permalink parent award report block reply\nWaterlaw -2 points 1 day ago what happened tho, during campaing and hes first term trump was great permalink parent award report block reply TrumpDupedMAGA 0 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nTrumpDupedMAGA 0 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nHumblePepe 1 points 1 day ago Makes me wonder what the goal of that was? All the chaos with Trump and his persecution by deep state. Show? Theater? If he was truly in on it, why raid his home? It makes me wonder if deep state, with all their ways, has some sort of nuclear scenario that Trump is treading around. permalink parent award report block reply\nKekistaniMemeLord 0 points 1 day ago The reason Trump is so popular and that MAGA/America First has become a juggernaut is precisely because Trump ISN'T one of them. Did you just wake up recently or something? permalink parent award report block reply kyle6969 3 points 1 day ago Dude I’ve been here the second it opened after the subreddit was banned. He ain’t done any of that shit. permalink parent award report block reply KekistaniMemeLord 0 points 1 day ago lying like shit, shillbot. Your response doesn't even make sense. \"he ain't done any of that shit\" I didn't list any actions he made dipshit bot lmao permalink parent award report block reply kyle6969 1 points 23 hours ago You’re so paranoid. I’m not going to go through a list of things he said he was going to do but didn’t. permalink parent award report block reply view 2 more comments...\nkyle6969 3 points 1 day ago Dude I’ve been here the second it opened after the subreddit was banned. He ain’t done any of that shit. permalink parent award report block reply KekistaniMemeLord 0 points 1 day ago lying like shit, shillbot. Your response doesn't even make sense. \"he ain't done any of that shit\" I didn't list any actions he made dipshit bot lmao permalink parent award report block reply kyle6969 1 points 23 hours ago You’re so paranoid. I’m not going to go through a list of things he said he was going to do but didn’t. permalink parent award report block reply view 2 more comments...\nKekistaniMemeLord 0 points 1 day ago lying like shit, shillbot. Your response doesn't even make sense. \"he ain't done any of that shit\" I didn't list any actions he made dipshit bot lmao permalink parent award report block reply kyle6969 1 points 23 hours ago You’re so paranoid. I’m not going to go through a list of things he said he was going to do but didn’t. permalink parent award report block reply view 2 more comments...\nkyle6969 1 points 23 hours ago You’re so paranoid. I’m not going to go through a list of things he said he was going to do but didn’t. permalink parent award report block reply view 2 more comments...\nbillybaldwin2 2 points 1 day ago Didn't GOP fall for the same \"promise of a vote\" 3 or 4 years ago? Anyway, this could have been all to get an edge on NJ and VA. They will do the same for the midterms. permalink award report block reply\nCalumet57 1 points 1 day ago here come the socialists permalink award report block reply\nJoinTheDiscussion 1 points 15 hours ago Schumer caved just in time so the Republicans couldn't invoke the filibuster.. He's saving that for after the midterm steal next year.. Keep thinking we got a W here at your own perils permalink award report block reply\nImpeachThisBitch 1 points 1 day ago It feels like the only explanation that fits is that he’s been compromised. Perhaps a credible deep state threat against the entire Trump family. permalink award report block reply JoinTheDiscussion 1 points 15 hours ago 100% permalink parent award report block reply TrumpDupedMAGA 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\nJoinTheDiscussion 1 points 15 hours ago 100% permalink parent award report block reply\nTrumpDupedMAGA 1 points 1 day ago Comment removed by community moderators. permalink parent award report block reply\ntheDialecticalPlaya 1 points 1 day ago Trump mentioned Israel again, so he's really a Mossad agent. But at least we have Rand and Massie, because muh principles, or something. And ignore the fact they're Koch First because they're AIPACfrei, whatever. permalink award report block reply\nRetard_Strength 1 points 1 day ago all of that nonsense was for Chucky to try to keep AOC from running for and taking his position. now she is practically guaranteed a win permalink award report block reply\nj2daeww 1 points 1 day ago Chuck didn’t vote yes for this so it proves Trump right. permalink award report block reply\nconservativefrank 0 points 1 day ago Trump doesn't get that the vast majority of people blame the shut down and all the pain from it on him. It's going to be a bloodbath for MAGA and Republicans in the midterms. permalink award report block reply seeyouinvalhalla -1 points 24 hours ago You had to put conservative in your username so we’d think you’re not a democrat bot lol permalink parent award report block reply conservativefrank 3 points 22 hours ago I hate the left. However, the reality is what it is. The vast majority of Americans blame Trump, MAGA, the Republicans. permalink parent award report block reply starjello 2 points 18 hours ago You hit the nail right on the head. permalink parent award report block reply\nseeyouinvalhalla -1 points 24 hours ago You had to put conservative in your username so we’d think you’re not a democrat bot lol permalink parent award report block reply conservativefrank 3 points 22 hours ago I hate the left. However, the reality is what it is. The vast majority of Americans blame Trump, MAGA, the Republicans. permalink parent award report block reply starjello 2 points 18 hours ago You hit the nail right on the head. permalink parent award report block reply\nconservativefrank 3 points 22 hours ago I hate the left. However, the reality is what it is. The vast majority of Americans blame Trump, MAGA, the Republicans. permalink parent award report block reply starjello 2 points 18 hours ago You hit the nail right on the head. permalink parent award report block reply\nstarjello 2 points 18 hours ago You hit the nail right on the head. permalink parent award report block reply\nNecturusMaculosus 0 points 1 day ago Stop dooming permalink award report block reply\nnew_guy2 1 points 1 day ago Comment removed by community moderators. permalink award report block reply"}