{"id": "1ARK58zFdB", "contents": "587 Deport 50 million. Don’t promise us a house in 50 years. The problem isn’t the cost to build a house, the cost is everything wrong with the system. Fix the system and the cost will drop. Even the left will be happy with lower housing costs. DEPORT posted 4 days ago by GodIsPerfect 49 comments award share download report block\n49 comments Sort by Top Top New Worst Old Save deleted 16 points 4 days ago StayoutOfit 7 points 4 days ago They want the cost of ownership to outweigh the cost of rent so that you don't own anything and are happy with it. All part of the build back better scam and push for global technocractic communism. permalink parent award report block reply PillarOfWisdom 15 points 4 days ago Who in the hell is giving Trump advice?!? permalink award report block reply Shitsbrokeyo 4 points 3 days ago Maybe this is his way to get everyone talking about illegals taking up the supply creating the issue.  Because I haven't heard one person here or IRL say it's s good idea.  Trump's no idiot. Especially not real estate. Think about the number of people that are anti deportation yet bitching about home affordability. permalink parent award report block reply PillarOfWisdom 2 points 3 days ago Let's hope so.  It damn sure doesn't make any sense at all. permalink parent award report block reply SickOfNeoPolitics 2 points 3 days ago I wouldn't call it giving advice... More who provided a credible threat to his life. Golden pager people. permalink parent award report block reply PillarOfWisdom 1 points 3 days ago You got that right! permalink parent award report block reply Ronaldus 15 points 4 days ago Point on point! permalink award report block reply BlackJack1776 11 points 4 days ago Houses built by illegal aliens don't last 50 years. permalink parent award report block reply Ronaldus 3 points 4 days ago True. permalink parent award report block reply NotYourMan 9 points 4 days ago Restore housing zones around cities.  Single family home housing can't be purchased by corporations and each house should be owned by one family or an individual.  Stop giving loans to illegal aliens to buy houses.  Stop the H1B-visa stealing upper middle class jobs and getting rich then buying multiple homes away from US citizens.  Vote for better politicians that care about the people instead of getting RICH. permalink award report block reply Truthisunpopular 9 points 4 days ago Is this Trump's admission that he will not be deporting a meaningful amount of invaders and their anchor babies? He keeps bragging about numbers in the hundreds per month when those numbers need to be in the hundreds of THOUSANDS per month in order to have any kind of real impact. They are easily outbreeding his deportation rates. permalink award report block reply GodIsPerfect OP 7 points 4 days ago Exactly what I thought. It’s incredibly frustrating. permalink parent award report block reply ACActual 5 points 4 days ago So we lost the country permalink parent award report block reply RedFoxOnFire 9 points 4 days ago They should also figure out a way to prevent corporations like Blackrock and Vanguard from buying homes to rent them out. permalink award report block reply Trump4Infinity 8 points 4 days ago So which Jew gave Trump this absolute bullshit idea. 30 years to own your home is too long. Hey (((bankers))) let's just pump the bubble even larger permalink award report block reply deleted 8 points 4 days ago chickeninoven 3 points 4 days ago What if I told you there's no political will to bring down the cost of housing? permalink parent award report block reply Lamal 8 points 4 days ago super agree. all of these \"affordability\" measures simply jack up prices, especially by people lying about income & assets just to speculate (gamble) on houses. Our side actually understands economics.\nStop out of control govt spending (inflation driving up asset prices), stop lowering borrowing requirements, stop bailing out underwater homeowners locking out younger buyers. permalink award report block reply Alexius_von_Meinong 4 points 4 days ago Who doesn't want to spend a half century paying interest to bankers? permalink award report block reply chickeninoven 2 points 4 days ago Best part is that it's all front loaded, so you can live in the house for 10 years and build up almost no equity! Ain't America grand! permalink parent award report block reply malthael 3 points 3 days ago Trump just needs to make it illegal for giant companies to own homes. Make it to homes can only be owned by families permalink award report block reply Snooptwo 3 points 4 days ago God damn yeah obviously. I’m about to sell my house after owning it for 5 years. I’m going back to renting. As much as I like having my own home, the cost of repairs and not being able to move and take travel contracts and go to CRNA school, and my city becoming more and more dangerous, I’ll take my $180k in equity and go to Florida. But hey, I’ll get to hit that $100k invested benchmark. Seems like a better idea at this point. permalink award report block reply josiborg 3 points 4 days ago You will own nothing and like it. permalink award report block reply justicein2020 2 points 4 days ago If you own nothing. There's no reason NOT to burn everything down... permalink parent award report block reply Keep_on_winning_kag 2 points 4 days ago You vill own nothing, van like et!* There. Fixed it for you mam sir. permalink parent award report block reply Shitsbrokeyo 2 points 3 days ago I'm building a house.  Inflation is absolutely s freaking problem. permalink award report block reply GodIsPerfect OP 0 points 3 days ago From Trump, or Biden? permalink parent award report block reply Shitsbrokeyo 3 points 3 days ago Biden. Trump made some, of course, with the pandemic, but that was nothing like the 40% from Biden. People think their house appreciated 🤡 . permalink parent award report block reply ACActual 2 points 4 days ago 50 year mortgage?  Im beginning to think Trump isn't as smart as we give him credit for or he's getting desperate because he knows Mass Deportations will never happen.   Either way this is telling and extremely disturbing.   May as well say the Invasion was a fatal blow to the Republic and give up. I'd rather declare Insurrection and Invasion and go off the chain on everyone involved permalink award report block reply starjello 1 points 4 days ago The electoral asskicking last Tuesday is making Trump start to look desperate. Down vote away cultist zombies. permalink award report block reply iamstadter 1 points 4 days ago The left will never be happy. permalink award report block reply Megaboom2025 -1 points 4 days ago Housing prices have dropped. A 50 year mortgage is an option for low income, not a mandate. permalink award report block reply lizardo221 2 points 4 days ago Don't feel bad, most people on this website seem to be financially illiterate. They don't seem to know you can pay loans off early or make interest tax deductible. Or that you can improve loan options while working on other issues in the housing market. They read a picture with one sentence and decided that was an economic plan. That is who gets to vote in this country, remember that. permalink parent award report block reply GodIsPerfect OP 2 points 4 days ago Barely. permalink parent award report block reply Irishrocket -3 points 4 days ago People can pay off sooner, just because you have a 50 year mortgage, it does not mean you have to pay it off that slow.  Let’s say your home mortgage is $1000.00, if you paid $1,250 a month, you would pay principal down faster, and if you paid bimonthly even faster than that.  The bigger thing to be cautious of would be in that case would be early payoff fees, but that is rare. permalink award report block reply FromNC 10 points 4 days ago You don’t understand the implication here. By doing this his advisors are saying house prices are going to continue to go up unabated and they do not expect wages to keep up. The fact that people struggle to pay 30 year mortgages is not a good reason to tack another $300k of interest into their plate. People aren’t choosing a 50 year mortgage if they have the capacity to pay it off early, just the option is a sign of an unhealthy economy. Our goal should be that people choose 15 year mortgages more often, not go the opposite direction. permalink parent award report block reply GodIsPerfect OP 4 points 4 days ago The banks wouldn’t offer it if it made them less money. permalink parent award report block reply ronnietherocket 4 points 4 days ago People can pay off sooner No.  You generally pay less interest and have a lower interest rate on a shorter loan than a longer loan. permalink parent award report block reply lizardo221 0 points 4 days ago Yes, but that would require you to pay more of the principle instead. You can pull out a mortgage calc and easily see why young people aren't all jumping at 10 year loans as we speak! permalink parent award report block reply ronnietherocket 1 points 3 days ago You can also pull out a mortgage calc and see how you pay more interest on a longer loan than a shorter loan even if you make the same monthly payments.  I.e., if you take the 15year loan payment and pay off the 30 year loan with that payment, you still pay more in the long run. permalink parent award report block reply lizardo221 1 points 3 days ago I talked to a cpa about this, and he explained that it depends on the type of loan. He believes most loans are structured where interest strictly reflects the remaining principle, i.e., if you pay a 50 year like it is a 30 year, the amount of interest you pay in total will be the same. However, some loans have interest that pretends the principle is as was originally planned. You can pay principle to end the loan sooner, but the interest will behave like nothing special has happened until the principle is payed in full and the loan is done. And even in those situations, you can consider refinancing. permalink parent award report block reply view 2 more comments... Tobin 0 points 4 days ago Sure,  but you could do that now too.  What this post was saying is that A house on the market today for 500k is going to go up to something like 700k, the monthly cost won't change, and the buyer will just have to pay the same price they would for a 30 year mortgage for 50 years instead permalink parent award report block reply RINO_fatigue -7 points 4 days ago sheeeiiiittt muggafuggah, gibes me dat house fo free.  trump is stupid and retarded and i hate him. t. OP why are these faggots consistently permitted to post here? permalink award report block reply lizardo221 0 points 4 days ago I don't get it either. permalink parent award report block reply\ndeleted 16 points 4 days ago StayoutOfit 7 points 4 days ago They want the cost of ownership to outweigh the cost of rent so that you don't own anything and are happy with it. All part of the build back better scam and push for global technocractic communism. permalink parent award report block reply\nStayoutOfit 7 points 4 days ago They want the cost of ownership to outweigh the cost of rent so that you don't own anything and are happy with it. All part of the build back better scam and push for global technocractic communism. permalink parent award report block reply\nPillarOfWisdom 15 points 4 days ago Who in the hell is giving Trump advice?!? permalink award report block reply Shitsbrokeyo 4 points 3 days ago Maybe this is his way to get everyone talking about illegals taking up the supply creating the issue.  Because I haven't heard one person here or IRL say it's s good idea.  Trump's no idiot. Especially not real estate. Think about the number of people that are anti deportation yet bitching about home affordability. permalink parent award report block reply PillarOfWisdom 2 points 3 days ago Let's hope so.  It damn sure doesn't make any sense at all. permalink parent award report block reply SickOfNeoPolitics 2 points 3 days ago I wouldn't call it giving advice... More who provided a credible threat to his life. Golden pager people. permalink parent award report block reply PillarOfWisdom 1 points 3 days ago You got that right! permalink parent award report block reply\nShitsbrokeyo 4 points 3 days ago Maybe this is his way to get everyone talking about illegals taking up the supply creating the issue.  Because I haven't heard one person here or IRL say it's s good idea.  Trump's no idiot. Especially not real estate. Think about the number of people that are anti deportation yet bitching about home affordability. permalink parent award report block reply PillarOfWisdom 2 points 3 days ago Let's hope so.  It damn sure doesn't make any sense at all. permalink parent award report block reply\nPillarOfWisdom 2 points 3 days ago Let's hope so.  It damn sure doesn't make any sense at all. permalink parent award report block reply\nSickOfNeoPolitics 2 points 3 days ago I wouldn't call it giving advice... More who provided a credible threat to his life. Golden pager people. permalink parent award report block reply PillarOfWisdom 1 points 3 days ago You got that right! permalink parent award report block reply\nPillarOfWisdom 1 points 3 days ago You got that right! permalink parent award report block reply\nRonaldus 15 points 4 days ago Point on point! permalink award report block reply BlackJack1776 11 points 4 days ago Houses built by illegal aliens don't last 50 years. permalink parent award report block reply Ronaldus 3 points 4 days ago True. permalink parent award report block reply\nBlackJack1776 11 points 4 days ago Houses built by illegal aliens don't last 50 years. permalink parent award report block reply Ronaldus 3 points 4 days ago True. permalink parent award report block reply\nRonaldus 3 points 4 days ago True. permalink parent award report block reply\nNotYourMan 9 points 4 days ago Restore housing zones around cities.  Single family home housing can't be purchased by corporations and each house should be owned by one family or an individual.  Stop giving loans to illegal aliens to buy houses.  Stop the H1B-visa stealing upper middle class jobs and getting rich then buying multiple homes away from US citizens.  Vote for better politicians that care about the people instead of getting RICH. permalink award report block reply\nTruthisunpopular 9 points 4 days ago Is this Trump's admission that he will not be deporting a meaningful amount of invaders and their anchor babies? He keeps bragging about numbers in the hundreds per month when those numbers need to be in the hundreds of THOUSANDS per month in order to have any kind of real impact. They are easily outbreeding his deportation rates. permalink award report block reply GodIsPerfect OP 7 points 4 days ago Exactly what I thought. It’s incredibly frustrating. permalink parent award report block reply ACActual 5 points 4 days ago So we lost the country permalink parent award report block reply\nGodIsPerfect OP 7 points 4 days ago Exactly what I thought. It’s incredibly frustrating. permalink parent award report block reply\nACActual 5 points 4 days ago So we lost the country permalink parent award report block reply\nRedFoxOnFire 9 points 4 days ago They should also figure out a way to prevent corporations like Blackrock and Vanguard from buying homes to rent them out. permalink award report block reply\nTrump4Infinity 8 points 4 days ago So which Jew gave Trump this absolute bullshit idea. 30 years to own your home is too long. Hey (((bankers))) let's just pump the bubble even larger permalink award report block reply\ndeleted 8 points 4 days ago chickeninoven 3 points 4 days ago What if I told you there's no political will to bring down the cost of housing? permalink parent award report block reply\nchickeninoven 3 points 4 days ago What if I told you there's no political will to bring down the cost of housing? permalink parent award report block reply\nLamal 8 points 4 days ago super agree. all of these \"affordability\" measures simply jack up prices, especially by people lying about income & assets just to speculate (gamble) on houses. Our side actually understands economics.\nStop out of control govt spending (inflation driving up asset prices), stop lowering borrowing requirements, stop bailing out underwater homeowners locking out younger buyers. permalink award report block reply\nAlexius_von_Meinong 4 points 4 days ago Who doesn't want to spend a half century paying interest to bankers? permalink award report block reply chickeninoven 2 points 4 days ago Best part is that it's all front loaded, so you can live in the house for 10 years and build up almost no equity! Ain't America grand! permalink parent award report block reply\nchickeninoven 2 points 4 days ago Best part is that it's all front loaded, so you can live in the house for 10 years and build up almost no equity! Ain't America grand! permalink parent award report block reply\nmalthael 3 points 3 days ago Trump just needs to make it illegal for giant companies to own homes. Make it to homes can only be owned by families permalink award report block reply\nSnooptwo 3 points 4 days ago God damn yeah obviously. I’m about to sell my house after owning it for 5 years. I’m going back to renting. As much as I like having my own home, the cost of repairs and not being able to move and take travel contracts and go to CRNA school, and my city becoming more and more dangerous, I’ll take my $180k in equity and go to Florida. But hey, I’ll get to hit that $100k invested benchmark. Seems like a better idea at this point. permalink award report block reply\njosiborg 3 points 4 days ago You will own nothing and like it. permalink award report block reply justicein2020 2 points 4 days ago If you own nothing. There's no reason NOT to burn everything down... permalink parent award report block reply Keep_on_winning_kag 2 points 4 days ago You vill own nothing, van like et!* There. Fixed it for you mam sir. permalink parent award report block reply\njusticein2020 2 points 4 days ago If you own nothing. There's no reason NOT to burn everything down... permalink parent award report block reply\nKeep_on_winning_kag 2 points 4 days ago You vill own nothing, van like et!* There. Fixed it for you mam sir. permalink parent award report block reply\nShitsbrokeyo 2 points 3 days ago I'm building a house.  Inflation is absolutely s freaking problem. permalink award report block reply GodIsPerfect OP 0 points 3 days ago From Trump, or Biden? permalink parent award report block reply Shitsbrokeyo 3 points 3 days ago Biden. Trump made some, of course, with the pandemic, but that was nothing like the 40% from Biden. People think their house appreciated 🤡 . permalink parent award report block reply\nGodIsPerfect OP 0 points 3 days ago From Trump, or Biden? permalink parent award report block reply Shitsbrokeyo 3 points 3 days ago Biden. Trump made some, of course, with the pandemic, but that was nothing like the 40% from Biden. People think their house appreciated 🤡 . permalink parent award report block reply\nShitsbrokeyo 3 points 3 days ago Biden. Trump made some, of course, with the pandemic, but that was nothing like the 40% from Biden. People think their house appreciated 🤡 . permalink parent award report block reply\nACActual 2 points 4 days ago 50 year mortgage?  Im beginning to think Trump isn't as smart as we give him credit for or he's getting desperate because he knows Mass Deportations will never happen.   Either way this is telling and extremely disturbing.   May as well say the Invasion was a fatal blow to the Republic and give up. I'd rather declare Insurrection and Invasion and go off the chain on everyone involved permalink award report block reply\nstarjello 1 points 4 days ago The electoral asskicking last Tuesday is making Trump start to look desperate. Down vote away cultist zombies. permalink award report block reply\niamstadter 1 points 4 days ago The left will never be happy. permalink award report block reply\nMegaboom2025 -1 points 4 days ago Housing prices have dropped. A 50 year mortgage is an option for low income, not a mandate. permalink award report block reply lizardo221 2 points 4 days ago Don't feel bad, most people on this website seem to be financially illiterate. They don't seem to know you can pay loans off early or make interest tax deductible. Or that you can improve loan options while working on other issues in the housing market. They read a picture with one sentence and decided that was an economic plan. That is who gets to vote in this country, remember that. permalink parent award report block reply GodIsPerfect OP 2 points 4 days ago Barely. permalink parent award report block reply\nlizardo221 2 points 4 days ago Don't feel bad, most people on this website seem to be financially illiterate. They don't seem to know you can pay loans off early or make interest tax deductible. Or that you can improve loan options while working on other issues in the housing market. They read a picture with one sentence and decided that was an economic plan. That is who gets to vote in this country, remember that. permalink parent award report block reply\nGodIsPerfect OP 2 points 4 days ago Barely. permalink parent award report block reply\nIrishrocket -3 points 4 days ago People can pay off sooner, just because you have a 50 year mortgage, it does not mean you have to pay it off that slow.  Let’s say your home mortgage is $1000.00, if you paid $1,250 a month, you would pay principal down faster, and if you paid bimonthly even faster than that.  The bigger thing to be cautious of would be in that case would be early payoff fees, but that is rare. permalink award report block reply FromNC 10 points 4 days ago You don’t understand the implication here. By doing this his advisors are saying house prices are going to continue to go up unabated and they do not expect wages to keep up. The fact that people struggle to pay 30 year mortgages is not a good reason to tack another $300k of interest into their plate. People aren’t choosing a 50 year mortgage if they have the capacity to pay it off early, just the option is a sign of an unhealthy economy. Our goal should be that people choose 15 year mortgages more often, not go the opposite direction. permalink parent award report block reply GodIsPerfect OP 4 points 4 days ago The banks wouldn’t offer it if it made them less money. permalink parent award report block reply ronnietherocket 4 points 4 days ago People can pay off sooner No.  You generally pay less interest and have a lower interest rate on a shorter loan than a longer loan. permalink parent award report block reply lizardo221 0 points 4 days ago Yes, but that would require you to pay more of the principle instead. You can pull out a mortgage calc and easily see why young people aren't all jumping at 10 year loans as we speak! permalink parent award report block reply ronnietherocket 1 points 3 days ago You can also pull out a mortgage calc and see how you pay more interest on a longer loan than a shorter loan even if you make the same monthly payments.  I.e., if you take the 15year loan payment and pay off the 30 year loan with that payment, you still pay more in the long run. permalink parent award report block reply lizardo221 1 points 3 days ago I talked to a cpa about this, and he explained that it depends on the type of loan. He believes most loans are structured where interest strictly reflects the remaining principle, i.e., if you pay a 50 year like it is a 30 year, the amount of interest you pay in total will be the same. However, some loans have interest that pretends the principle is as was originally planned. You can pay principle to end the loan sooner, but the interest will behave like nothing special has happened until the principle is payed in full and the loan is done. And even in those situations, you can consider refinancing. permalink parent award report block reply view 2 more comments... Tobin 0 points 4 days ago Sure,  but you could do that now too.  What this post was saying is that A house on the market today for 500k is going to go up to something like 700k, the monthly cost won't change, and the buyer will just have to pay the same price they would for a 30 year mortgage for 50 years instead permalink parent award report block reply\nFromNC 10 points 4 days ago You don’t understand the implication here. By doing this his advisors are saying house prices are going to continue to go up unabated and they do not expect wages to keep up. The fact that people struggle to pay 30 year mortgages is not a good reason to tack another $300k of interest into their plate. People aren’t choosing a 50 year mortgage if they have the capacity to pay it off early, just the option is a sign of an unhealthy economy. Our goal should be that people choose 15 year mortgages more often, not go the opposite direction. permalink parent award report block reply\nGodIsPerfect OP 4 points 4 days ago The banks wouldn’t offer it if it made them less money. permalink parent award report block reply\nronnietherocket 4 points 4 days ago People can pay off sooner No.  You generally pay less interest and have a lower interest rate on a shorter loan than a longer loan. permalink parent award report block reply lizardo221 0 points 4 days ago Yes, but that would require you to pay more of the principle instead. You can pull out a mortgage calc and easily see why young people aren't all jumping at 10 year loans as we speak! permalink parent award report block reply ronnietherocket 1 points 3 days ago You can also pull out a mortgage calc and see how you pay more interest on a longer loan than a shorter loan even if you make the same monthly payments.  I.e., if you take the 15year loan payment and pay off the 30 year loan with that payment, you still pay more in the long run. permalink parent award report block reply lizardo221 1 points 3 days ago I talked to a cpa about this, and he explained that it depends on the type of loan. He believes most loans are structured where interest strictly reflects the remaining principle, i.e., if you pay a 50 year like it is a 30 year, the amount of interest you pay in total will be the same. However, some loans have interest that pretends the principle is as was originally planned. You can pay principle to end the loan sooner, but the interest will behave like nothing special has happened until the principle is payed in full and the loan is done. And even in those situations, you can consider refinancing. permalink parent award report block reply view 2 more comments...\nlizardo221 0 points 4 days ago Yes, but that would require you to pay more of the principle instead. You can pull out a mortgage calc and easily see why young people aren't all jumping at 10 year loans as we speak! permalink parent award report block reply ronnietherocket 1 points 3 days ago You can also pull out a mortgage calc and see how you pay more interest on a longer loan than a shorter loan even if you make the same monthly payments.  I.e., if you take the 15year loan payment and pay off the 30 year loan with that payment, you still pay more in the long run. permalink parent award report block reply lizardo221 1 points 3 days ago I talked to a cpa about this, and he explained that it depends on the type of loan. He believes most loans are structured where interest strictly reflects the remaining principle, i.e., if you pay a 50 year like it is a 30 year, the amount of interest you pay in total will be the same. However, some loans have interest that pretends the principle is as was originally planned. You can pay principle to end the loan sooner, but the interest will behave like nothing special has happened until the principle is payed in full and the loan is done. And even in those situations, you can consider refinancing. permalink parent award report block reply view 2 more comments...\nronnietherocket 1 points 3 days ago You can also pull out a mortgage calc and see how you pay more interest on a longer loan than a shorter loan even if you make the same monthly payments.  I.e., if you take the 15year loan payment and pay off the 30 year loan with that payment, you still pay more in the long run. permalink parent award report block reply lizardo221 1 points 3 days ago I talked to a cpa about this, and he explained that it depends on the type of loan. He believes most loans are structured where interest strictly reflects the remaining principle, i.e., if you pay a 50 year like it is a 30 year, the amount of interest you pay in total will be the same. However, some loans have interest that pretends the principle is as was originally planned. You can pay principle to end the loan sooner, but the interest will behave like nothing special has happened until the principle is payed in full and the loan is done. And even in those situations, you can consider refinancing. permalink parent award report block reply view 2 more comments...\nlizardo221 1 points 3 days ago I talked to a cpa about this, and he explained that it depends on the type of loan. He believes most loans are structured where interest strictly reflects the remaining principle, i.e., if you pay a 50 year like it is a 30 year, the amount of interest you pay in total will be the same. However, some loans have interest that pretends the principle is as was originally planned. You can pay principle to end the loan sooner, but the interest will behave like nothing special has happened until the principle is payed in full and the loan is done. And even in those situations, you can consider refinancing. permalink parent award report block reply view 2 more comments...\nTobin 0 points 4 days ago Sure,  but you could do that now too.  What this post was saying is that A house on the market today for 500k is going to go up to something like 700k, the monthly cost won't change, and the buyer will just have to pay the same price they would for a 30 year mortgage for 50 years instead permalink parent award report block reply\nRINO_fatigue -7 points 4 days ago sheeeiiiittt muggafuggah, gibes me dat house fo free.  trump is stupid and retarded and i hate him. t. OP why are these faggots consistently permitted to post here? permalink award report block reply lizardo221 0 points 4 days ago I don't get it either. permalink parent award report block reply\nlizardo221 0 points 4 days ago I don't get it either. permalink parent award report block reply"}