{"id": "1ARK9oXCZF", "contents": "4 Trump set the issues for the Midterms: Foreign Influence. Didn't expect it. Trump chose it. It's Pedro, the guy mowing your lawn vs. India, Israel, China. I will go with Pedro. In 30 years his kids will be invested in the US, while India, Israel, China will still be sucking us dry. posted 28 minutes ago by breadbaker 6 comments award share report block .\n6 comments Sort by Top Top New Worst Old Save DangleBarry 5 points 24 minutes ago I mow my own lawn. Don’t need Pedro or his 37 kids. permalink award report block reply Wildwind 5 points 23 minutes ago Deport all of them. permalink award report block reply SpeekFreely 4 points 23 minutes ago The bigger concern should be down ballot. The commies took out numerous Republicans in state/local positions. permalink award report block reply SnowSnake 2 points 20 minutes ago You're still here?? There's the door, why don't you use it and GTFOH. Fucking loser. permalink award report block reply breadbaker OP 0 points 18 minutes ago Don't like the truth. Go have some kool aid. permalink parent award report block reply DangerousAmerican76 1 points 11 minutes ago It’s all poison down the road, Pedro just taste better but you still going to die permalink award report block reply\nDangleBarry 5 points 24 minutes ago I mow my own lawn. Don’t need Pedro or his 37 kids. permalink award report block reply\nWildwind 5 points 23 minutes ago Deport all of them. permalink award report block reply\nSpeekFreely 4 points 23 minutes ago The bigger concern should be down ballot. The commies took out numerous Republicans in state/local positions. permalink award report block reply\nSnowSnake 2 points 20 minutes ago You're still here?? There's the door, why don't you use it and GTFOH. Fucking loser. permalink award report block reply breadbaker OP 0 points 18 minutes ago Don't like the truth. Go have some kool aid. permalink parent award report block reply\nbreadbaker OP 0 points 18 minutes ago Don't like the truth. Go have some kool aid. permalink parent award report block reply\nDangerousAmerican76 1 points 11 minutes ago It’s all poison down the road, Pedro just taste better but you still going to die permalink award report block reply"}