{"id": "1ARK0TUsKe", "contents": "1272 Hey New York! Too bad, so sad. COME AND TAKE IT posted 7 days ago by SenorTrumper 83 comments award share download report block\n83 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style cbonez416 43 points 7 days ago NYC died on 9/11. I was there. It was over that day!!! permalink award report block reply stars 18 points 7 days ago It died when Whites became a minority. permalink parent award report block reply newestofnew 1 points 6 days ago more whites in NYC now than on 9/11 permalink parent award report block reply stars 1 points 6 days ago I doubt that with urban birth rates, even if the raw numbers is higher, the percentage is way done. Non White groups like MENAs are also sometimes counted as \"White\" aswell distorting the picture. permalink parent award report block reply FattyWatt 10 points 7 days ago then, government allowed TSA 2destroy ur 4th amm. rights against ILLEGAL search & seizure.  RIP Anti-Communist-USA permalink parent award report block reply Chickensaurus 8 points 7 days ago The US died in 1913. permalink parent award report block reply dr_gonzo 4 points 7 days ago This is the actual answer. We still managed to have some relatively decent times after that as the various socialist mechanisms were installed over the following several decades and we continued prospering off the previous free society, but it was all over as soon as the Federal Reserve and progressive income tax were imposed. There's a reason both of those are listed in Marx's 10 Core Planks of Communism. They're the foundation for everything else. And that's exactly why those two things should be the first to go. Just rip the foundation out at the roots and the house of cards leftism is built on will crumble. permalink parent award report block reply NoMaskNoMaster 2 points 7 days ago Its strange we dont hear more about the resistance to such a change. Almost as if history has been tampered with... permalink parent award report block reply guns_and_butter 1 points 7 days ago Guiliani cleaning up the city is what brought in all the liberal suburbanites particularly women. permalink parent award report block reply Oldman6541E5 5 points 7 days ago You used to have to be tough. It helped to have a deep Brooklyn accent to survive. permalink parent award report block reply roadrunner0 11 points 7 days ago New York City is London 2.0 in the making.. Soon rape gangs and no-go zone with Sharia law police and courts will be the normal.. Business that sell alcohol and pork products will be harassed and burned, churches will be harassed and burned, museums will be harassed and burned, knife killings will increase and One World Trade Center will become the site of the great Islamic mosque of the conquest.. permalink award report block reply Metal4Freedom 2 points 7 days ago The UK has Londonstan. We have Dumbfuckistan. permalink parent award report block reply NecturusMaculosus 6 points 7 days ago As the white women are raped into oblivion while the communist muslims emasculate the white men (think modern day Great Britain or France). The white population of NYC will weep and nash their teeth. No guns allowed (except the government and the muslims), no knives allowed (except the government and the muslims, no clubs allowed except the government and the muslims. Its gonna get ugly. permalink award report block reply Spartacus1188 3 points 7 days ago Time to flee the country, or stand and fight.\nOption 2 runs the risk of death by shitskin mudslime, or being arrested by the treasonous cops. permalink parent award report block reply NoMaskNoMaster 2 points 7 days ago There are tens of millions that don't say anything or post anything online. permalink parent award report block reply drmrboy 6 points 7 days ago And if the democrats get power again and we end the filibuster now ... this will be on their top agenda for the entire country.  Maybe #1. 🤓 permalink award report block reply Side_o_beef_curtains 4 points 7 days ago Anyone still living in NY or CA who has the means to leave is nuts. If you dont have the means to leave you should make that your main life goal immediately and work towards getting out. permalink award report block reply GhostOfKirk 1 points 7 days ago or VA permalink parent award report block reply PitfallHarry 4 points 7 days ago If you don’t live in NYC why would you give a shit permalink award report block reply SenorTrumper OP 15 points 7 days ago Because what happens in NY affects us all. Doh! permalink parent award report block reply Datamancer 7 points 7 days ago Disagree.  If you look at 1975 to 1995 NYC vs the United States in broad terms, NYC was way more fucked up than the rest of the US. permalink parent award report block reply Spindle-spin -4 points 7 days ago Yup. And when the economy took off after that, we dumped billions into the NYC area for various projects and causes, but Main Street Arkansas or Kansas got nothing directly in return. It was all indirect benefits. If President Trump's taught us anything, it's that everything is a zero sum game. If you're not directly benefiting, no deal. permalink parent award report block reply PitfallHarry 2 points 7 days ago Really? So if NYC raises subway fares how does that affect us all? Spoiler. It doesn’t fucking matter. Unless you live there. permalink parent award report block reply Coover 6 points 7 days ago It matters when millions of dumbasses leave and migrate south with same dumbass ideas and voting style. permalink parent award report block reply Side_o_beef_curtains 5 points 7 days ago That, my friend, is already happening. Im in Georgia and this place is over run with faggots from new york, California, and guata-fucking-mala. permalink parent award report block reply view 2 more comments... roadrunner0 3 points 7 days ago The businesses in the city and State including Wall Street and the banks most certainly do affect most all of us in one way or another.. Prices, product availability, tourism, the US government, crime and more.. permalink parent award report block reply SenorTrumper OP 2 points 7 days ago Lol it would be futile to try to explain how a state with so many members in congress could effect everything by going far left. permalink parent award report block reply PitfallHarry 2 points 7 days ago This is one city in the state. Not the whole state. And it’s a mayor not a member of congress. You seem really lost. Now that Trump has prices down there’s no way any state is moving to the left. permalink parent award report block reply Viewer01 1 points 7 days ago That’s cherry picking and you know it. Now do a 40% tax on millionaires and tell me what happens. permalink parent award report block reply roadrunner0 1 points 7 days ago I guarantee you that there will be a mass exodus of business and wealthy people from the city.. Some have already left years ago but the on the fence and holdouts are most likely starting their plans for a quick exit.. Jewish people for sure know that they will be persecuted just like in London.. permalink parent award report block reply view 2 more comments... Slugbert 7 points 7 days ago Before, it was Dearborn, then Hamtramck, now NYC. See the pattern? Not giving a shit now might eventually lead to a mosque popping up on your street corner later (followed by all islam local “leadership”). Best be vigilant. permalink parent award report block reply TPMJB 4 points 7 days ago Didn't governor Hot Wheels sign a law saying no Sharia Law in Texas? We just have to kick out the rest of the muzzos in Houston and we're set. They will never get power here. NY burning just emboldens governor Hot Wheels to fight the degeneracy harder. permalink parent award report block reply Jimmy33 4 points 7 days ago You’re right. The spread is the problem. permalink parent award report block reply mateus 3 points 7 days ago LOL Because far too many here only think \"New York City\" when it comes to NY state . Like I said: 👇 https://i.postimg.cc/7LvRdvtY/allpartofny.jpg permalink parent award report block reply PitfallHarry -1 points 7 days ago Yeah but still I would say what difference does it make unless you live there. permalink parent award report block reply FattyWatt 2 points 7 days ago Commies SPREAD worse than parasites & STD's, put together! permalink parent award report block reply PitfallHarry 5 points 7 days ago Well we’re letting Qatar have a military air base on American soil so I guess you’re right. permalink parent award report block reply FattyWatt 2 points 7 days ago ^TRUTH^ permalink parent award report block reply Tonz 1 points 7 days ago NYC affects the entire state, sadly. permalink parent award report block reply load 8 more comments... Handshake_Shmanshake 3 points 7 days ago Look, when a city or state is captured, and they start denying the citizens their RIGHTS... that state now becomes a DOMESTIC ENEMY. Anyone who took an oath to this country, WHO FAILS TO UPHOLD THAT OATH, should face the most EXTREME consequences. So our courts, and JUDGES WHO FAIL THEIR OATHS, should be getting locked in prison. This is TREASON. permalink award report block reply Prandogolio 3 points 7 days ago No.  Keep suing. permalink award report block reply Spartacus1188 1 points 7 days ago Lawsuits DON'T work. Bullets DO. permalink parent award report block reply Nomad899 2 points 7 days ago Bullets fly….. permalink parent award report block reply Prandogolio 2 points 7 days ago Lawsuits can work.  And the left understands that the legal process is a punishment on its own.  The right needs to take that same approach. permalink parent award report block reply TPMJB 2 points 7 days ago I'm so goddamned pumped for the destruction lol. This will redpill so many. I cannot wait! permalink award report block reply Chickensaurus 2 points 7 days ago The rest of the US will follow quickly.... permalink award report block reply DlanOdcammron 2 points 7 days ago It won’t be through votes. If they ever want it back they’ll have to take it back. permalink award report block reply I_Love_45-70_Gov 2 points 7 days ago When the stabbings and bombings begin, start shooting. No mercy permalink award report block reply Nomad899 1 points 7 days ago Only gangs and criminals have guns in ny…everyone else is at their mercy permalink parent award report block reply Gtsx 2 points 7 days ago If the Supreme Court got of its ass, maybe the same constitution would apply to the whole country. permalink award report block reply AtomicAmericanX 1 points 7 days ago No mon, no fun, your son... permalink award report block reply guns_and_butter 1 points 7 days ago AI is going to obliterate the tax base so good luck funding any of his socialist bullshit. permalink award report block reply SBOJ_JOBS 1 points 6 days ago The state legislature must approve NYC taxes, but if the city management proceeds to spend itself into a hole, upstate legislators will be under enormous pressure to let NYC residents pay themselves back, not put the burden on other taxpayers. Meanwhile... New York City residents face a multi-layered tax system that includes state, city, and local levies. The city imposes its own income tax on top of New York State taxes, with rates ranging from 3.078% to 3.876% depending on income level and filing status, resulting in combined state and city income tax rates between 7.078% and 14.776% for top earners. New York State itself has nine progressive income tax brackets, from 4% to 10.9%. Sales taxes in New York City are among the highest in the nation, with a total rate of 8.875%, including a 0.375% Metropolitan Commuter Transportation District charge.\nProperty taxes in New York City have an average effective rate of 0.91% of property value, though this is due to the taxable value being set at only 6% of market value for most residential properties. The city’s property tax is a major revenue source, projected to generate $24 billion in fiscal year 2017 and continuing to grow due to rising real estate values. Additionally, residents pay a 25.68 cents per gallon gas tax and a $4.35 per pack cigarette excise tax, with an additional $1.50 per pack in New York City. permalink award report block reply tlorsung 1 points 7 days ago Hay Now!  It is possible that Mamdani will be a mayor that helps NYC citizens so much that the quality of life is increased and cost of living decreases!!  I'm NOT going to bet on it, every Muslim society in history has been a Gov is very corrupt, and its people suffer and needs some other country to help and take them in as asylum seekers.  Welcome to History being repeated!! ha ha! permalink award report block reply Spartacus1188 2 points 7 days ago That goatfucker will only help his fellow mudslimes. permalink parent award report block reply Nomad899 1 points 7 days ago They barely have a 1st permalink award report block reply bluewhiteandred 1 points 7 days ago SHALL permalink award report block reply lefty295 1 points 7 days ago Cuomo would’ve done the same. C’mon guys. permalink award report block reply roadrunner0 1 points 7 days ago It was very sad that no high profile Republican wanted the horrendous job.. The filth and corruption is off the hook bad so I don't blame anyone for holding their nose and running away.. I guess President Trump said he would have run for mayor but he was a bit too busy being President at this time.. permalink parent award report block reply lefty295 1 points 7 days ago A 2015 era Trump without the political baggage of being President would likely have been able to win that three way race imo, with his name recognition and populist policies. Probably not after TDS is all over nyc now. permalink parent award report block reply KungPaoMcChicken 1 points 7 days ago To be honest, I don't think the Mayor can really do much. He can't change taxes, that's a state thing. I doubt he can provide free buses. I think people are worried too much. permalink award report block reply SenorTrumper OP 1 points 7 days ago But-but-but, he promised a ton of free shit! permalink parent award report block reply KungPaoMcChicken 1 points 7 days ago He said he will increase taxes (he can't, that's state) and make buses free (he can't because there is no money to pay for it). The mayor has jack shit power over anything. permalink parent award report block reply SenorTrumper OP 1 points 7 days ago None of that matters! HE PROMISED US! permalink parent award report block reply KungPaoMcChicken 1 points 7 days ago It doesn't matter what he said, he's incapable of delivering. Check it out. The mayor has no control over the state, the state decides taxes. He has no way to generate the revenue. Also, how do the buses operate? Is it privatised? If he's promising to cover the costs, then what's to stop the bus operators deliberately increasing costs because this dude is promising pay. permalink parent award report block reply view 1 more comments... Waco419 1 points 7 days ago Only if you believe you have the moral duty to obey another man. permalink award report block reply Datamancer 0 points 7 days ago Sorry.  But keep your ass there. permalink award report block reply ILoveGoatFucking -1 points 7 days ago Comment removed upon the user being banned. permalink award report block reply FattyWatt 1 points 7 days ago Take ur FREEDOM OF SPEECH and keep talking.  If U take my AMERICAN GUNS, u will FAFO---u piece of shit COMMUNIST.  U fuckers wanna ban everything, but ur own speech. WEAK!! permalink parent award report block reply ILoveGoatFucking 1 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply Prandogolio 1 points 7 days ago The criminals aren't going to be unarmed. permalink parent award report block reply\ncbonez416 43 points 7 days ago NYC died on 9/11. I was there. It was over that day!!! permalink award report block reply stars 18 points 7 days ago It died when Whites became a minority. permalink parent award report block reply newestofnew 1 points 6 days ago more whites in NYC now than on 9/11 permalink parent award report block reply stars 1 points 6 days ago I doubt that with urban birth rates, even if the raw numbers is higher, the percentage is way done. Non White groups like MENAs are also sometimes counted as \"White\" aswell distorting the picture. permalink parent award report block reply FattyWatt 10 points 7 days ago then, government allowed TSA 2destroy ur 4th amm. rights against ILLEGAL search & seizure.  RIP Anti-Communist-USA permalink parent award report block reply Chickensaurus 8 points 7 days ago The US died in 1913. permalink parent award report block reply dr_gonzo 4 points 7 days ago This is the actual answer. We still managed to have some relatively decent times after that as the various socialist mechanisms were installed over the following several decades and we continued prospering off the previous free society, but it was all over as soon as the Federal Reserve and progressive income tax were imposed. There's a reason both of those are listed in Marx's 10 Core Planks of Communism. They're the foundation for everything else. And that's exactly why those two things should be the first to go. Just rip the foundation out at the roots and the house of cards leftism is built on will crumble. permalink parent award report block reply NoMaskNoMaster 2 points 7 days ago Its strange we dont hear more about the resistance to such a change. Almost as if history has been tampered with... permalink parent award report block reply guns_and_butter 1 points 7 days ago Guiliani cleaning up the city is what brought in all the liberal suburbanites particularly women. permalink parent award report block reply Oldman6541E5 5 points 7 days ago You used to have to be tough. It helped to have a deep Brooklyn accent to survive. permalink parent award report block reply\nstars 18 points 7 days ago It died when Whites became a minority. permalink parent award report block reply newestofnew 1 points 6 days ago more whites in NYC now than on 9/11 permalink parent award report block reply stars 1 points 6 days ago I doubt that with urban birth rates, even if the raw numbers is higher, the percentage is way done. Non White groups like MENAs are also sometimes counted as \"White\" aswell distorting the picture. permalink parent award report block reply\nnewestofnew 1 points 6 days ago more whites in NYC now than on 9/11 permalink parent award report block reply stars 1 points 6 days ago I doubt that with urban birth rates, even if the raw numbers is higher, the percentage is way done. Non White groups like MENAs are also sometimes counted as \"White\" aswell distorting the picture. permalink parent award report block reply\nstars 1 points 6 days ago I doubt that with urban birth rates, even if the raw numbers is higher, the percentage is way done. Non White groups like MENAs are also sometimes counted as \"White\" aswell distorting the picture. permalink parent award report block reply\nFattyWatt 10 points 7 days ago then, government allowed TSA 2destroy ur 4th amm. rights against ILLEGAL search & seizure.  RIP Anti-Communist-USA permalink parent award report block reply\nChickensaurus 8 points 7 days ago The US died in 1913. permalink parent award report block reply dr_gonzo 4 points 7 days ago This is the actual answer. We still managed to have some relatively decent times after that as the various socialist mechanisms were installed over the following several decades and we continued prospering off the previous free society, but it was all over as soon as the Federal Reserve and progressive income tax were imposed. There's a reason both of those are listed in Marx's 10 Core Planks of Communism. They're the foundation for everything else. And that's exactly why those two things should be the first to go. Just rip the foundation out at the roots and the house of cards leftism is built on will crumble. permalink parent award report block reply NoMaskNoMaster 2 points 7 days ago Its strange we dont hear more about the resistance to such a change. Almost as if history has been tampered with... permalink parent award report block reply\ndr_gonzo 4 points 7 days ago This is the actual answer. We still managed to have some relatively decent times after that as the various socialist mechanisms were installed over the following several decades and we continued prospering off the previous free society, but it was all over as soon as the Federal Reserve and progressive income tax were imposed. There's a reason both of those are listed in Marx's 10 Core Planks of Communism. They're the foundation for everything else. And that's exactly why those two things should be the first to go. Just rip the foundation out at the roots and the house of cards leftism is built on will crumble. permalink parent award report block reply NoMaskNoMaster 2 points 7 days ago Its strange we dont hear more about the resistance to such a change. Almost as if history has been tampered with... permalink parent award report block reply\nNoMaskNoMaster 2 points 7 days ago Its strange we dont hear more about the resistance to such a change. Almost as if history has been tampered with... permalink parent award report block reply\nguns_and_butter 1 points 7 days ago Guiliani cleaning up the city is what brought in all the liberal suburbanites particularly women. permalink parent award report block reply Oldman6541E5 5 points 7 days ago You used to have to be tough. It helped to have a deep Brooklyn accent to survive. permalink parent award report block reply\nOldman6541E5 5 points 7 days ago You used to have to be tough. It helped to have a deep Brooklyn accent to survive. permalink parent award report block reply\nroadrunner0 11 points 7 days ago New York City is London 2.0 in the making.. Soon rape gangs and no-go zone with Sharia law police and courts will be the normal.. Business that sell alcohol and pork products will be harassed and burned, churches will be harassed and burned, museums will be harassed and burned, knife killings will increase and One World Trade Center will become the site of the great Islamic mosque of the conquest.. permalink award report block reply Metal4Freedom 2 points 7 days ago The UK has Londonstan. We have Dumbfuckistan. permalink parent award report block reply\nMetal4Freedom 2 points 7 days ago The UK has Londonstan. We have Dumbfuckistan. permalink parent award report block reply\nNecturusMaculosus 6 points 7 days ago As the white women are raped into oblivion while the communist muslims emasculate the white men (think modern day Great Britain or France). The white population of NYC will weep and nash their teeth. No guns allowed (except the government and the muslims), no knives allowed (except the government and the muslims, no clubs allowed except the government and the muslims. Its gonna get ugly. permalink award report block reply Spartacus1188 3 points 7 days ago Time to flee the country, or stand and fight.\nOption 2 runs the risk of death by shitskin mudslime, or being arrested by the treasonous cops. permalink parent award report block reply NoMaskNoMaster 2 points 7 days ago There are tens of millions that don't say anything or post anything online. permalink parent award report block reply\nSpartacus1188 3 points 7 days ago Time to flee the country, or stand and fight.\nOption 2 runs the risk of death by shitskin mudslime, or being arrested by the treasonous cops. permalink parent award report block reply NoMaskNoMaster 2 points 7 days ago There are tens of millions that don't say anything or post anything online. permalink parent award report block reply\nNoMaskNoMaster 2 points 7 days ago There are tens of millions that don't say anything or post anything online. permalink parent award report block reply\ndrmrboy 6 points 7 days ago And if the democrats get power again and we end the filibuster now ... this will be on their top agenda for the entire country.  Maybe #1. 🤓 permalink award report block reply\nSide_o_beef_curtains 4 points 7 days ago Anyone still living in NY or CA who has the means to leave is nuts. If you dont have the means to leave you should make that your main life goal immediately and work towards getting out. permalink award report block reply GhostOfKirk 1 points 7 days ago or VA permalink parent award report block reply\nGhostOfKirk 1 points 7 days ago or VA permalink parent award report block reply\nPitfallHarry 4 points 7 days ago If you don’t live in NYC why would you give a shit permalink award report block reply SenorTrumper OP 15 points 7 days ago Because what happens in NY affects us all. Doh! permalink parent award report block reply Datamancer 7 points 7 days ago Disagree.  If you look at 1975 to 1995 NYC vs the United States in broad terms, NYC was way more fucked up than the rest of the US. permalink parent award report block reply Spindle-spin -4 points 7 days ago Yup. And when the economy took off after that, we dumped billions into the NYC area for various projects and causes, but Main Street Arkansas or Kansas got nothing directly in return. It was all indirect benefits. If President Trump's taught us anything, it's that everything is a zero sum game. If you're not directly benefiting, no deal. permalink parent award report block reply PitfallHarry 2 points 7 days ago Really? So if NYC raises subway fares how does that affect us all? Spoiler. It doesn’t fucking matter. Unless you live there. permalink parent award report block reply Coover 6 points 7 days ago It matters when millions of dumbasses leave and migrate south with same dumbass ideas and voting style. permalink parent award report block reply Side_o_beef_curtains 5 points 7 days ago That, my friend, is already happening. Im in Georgia and this place is over run with faggots from new york, California, and guata-fucking-mala. permalink parent award report block reply view 2 more comments... roadrunner0 3 points 7 days ago The businesses in the city and State including Wall Street and the banks most certainly do affect most all of us in one way or another.. Prices, product availability, tourism, the US government, crime and more.. permalink parent award report block reply SenorTrumper OP 2 points 7 days ago Lol it would be futile to try to explain how a state with so many members in congress could effect everything by going far left. permalink parent award report block reply PitfallHarry 2 points 7 days ago This is one city in the state. Not the whole state. And it’s a mayor not a member of congress. You seem really lost. Now that Trump has prices down there’s no way any state is moving to the left. permalink parent award report block reply Viewer01 1 points 7 days ago That’s cherry picking and you know it. Now do a 40% tax on millionaires and tell me what happens. permalink parent award report block reply roadrunner0 1 points 7 days ago I guarantee you that there will be a mass exodus of business and wealthy people from the city.. Some have already left years ago but the on the fence and holdouts are most likely starting their plans for a quick exit.. Jewish people for sure know that they will be persecuted just like in London.. permalink parent award report block reply view 2 more comments... Slugbert 7 points 7 days ago Before, it was Dearborn, then Hamtramck, now NYC. See the pattern? Not giving a shit now might eventually lead to a mosque popping up on your street corner later (followed by all islam local “leadership”). Best be vigilant. permalink parent award report block reply TPMJB 4 points 7 days ago Didn't governor Hot Wheels sign a law saying no Sharia Law in Texas? We just have to kick out the rest of the muzzos in Houston and we're set. They will never get power here. NY burning just emboldens governor Hot Wheels to fight the degeneracy harder. permalink parent award report block reply Jimmy33 4 points 7 days ago You’re right. The spread is the problem. permalink parent award report block reply mateus 3 points 7 days ago LOL Because far too many here only think \"New York City\" when it comes to NY state . Like I said: 👇 https://i.postimg.cc/7LvRdvtY/allpartofny.jpg permalink parent award report block reply PitfallHarry -1 points 7 days ago Yeah but still I would say what difference does it make unless you live there. permalink parent award report block reply FattyWatt 2 points 7 days ago Commies SPREAD worse than parasites & STD's, put together! permalink parent award report block reply PitfallHarry 5 points 7 days ago Well we’re letting Qatar have a military air base on American soil so I guess you’re right. permalink parent award report block reply FattyWatt 2 points 7 days ago ^TRUTH^ permalink parent award report block reply Tonz 1 points 7 days ago NYC affects the entire state, sadly. permalink parent award report block reply load 8 more comments...\nSenorTrumper OP 15 points 7 days ago Because what happens in NY affects us all. Doh! permalink parent award report block reply Datamancer 7 points 7 days ago Disagree.  If you look at 1975 to 1995 NYC vs the United States in broad terms, NYC was way more fucked up than the rest of the US. permalink parent award report block reply Spindle-spin -4 points 7 days ago Yup. And when the economy took off after that, we dumped billions into the NYC area for various projects and causes, but Main Street Arkansas or Kansas got nothing directly in return. It was all indirect benefits. If President Trump's taught us anything, it's that everything is a zero sum game. If you're not directly benefiting, no deal. permalink parent award report block reply PitfallHarry 2 points 7 days ago Really? So if NYC raises subway fares how does that affect us all? Spoiler. It doesn’t fucking matter. Unless you live there. permalink parent award report block reply Coover 6 points 7 days ago It matters when millions of dumbasses leave and migrate south with same dumbass ideas and voting style. permalink parent award report block reply Side_o_beef_curtains 5 points 7 days ago That, my friend, is already happening. Im in Georgia and this place is over run with faggots from new york, California, and guata-fucking-mala. permalink parent award report block reply view 2 more comments... roadrunner0 3 points 7 days ago The businesses in the city and State including Wall Street and the banks most certainly do affect most all of us in one way or another.. Prices, product availability, tourism, the US government, crime and more.. permalink parent award report block reply SenorTrumper OP 2 points 7 days ago Lol it would be futile to try to explain how a state with so many members in congress could effect everything by going far left. permalink parent award report block reply PitfallHarry 2 points 7 days ago This is one city in the state. Not the whole state. And it’s a mayor not a member of congress. You seem really lost. Now that Trump has prices down there’s no way any state is moving to the left. permalink parent award report block reply Viewer01 1 points 7 days ago That’s cherry picking and you know it. Now do a 40% tax on millionaires and tell me what happens. permalink parent award report block reply roadrunner0 1 points 7 days ago I guarantee you that there will be a mass exodus of business and wealthy people from the city.. Some have already left years ago but the on the fence and holdouts are most likely starting their plans for a quick exit.. Jewish people for sure know that they will be persecuted just like in London.. permalink parent award report block reply view 2 more comments...\nDatamancer 7 points 7 days ago Disagree.  If you look at 1975 to 1995 NYC vs the United States in broad terms, NYC was way more fucked up than the rest of the US. permalink parent award report block reply Spindle-spin -4 points 7 days ago Yup. And when the economy took off after that, we dumped billions into the NYC area for various projects and causes, but Main Street Arkansas or Kansas got nothing directly in return. It was all indirect benefits. If President Trump's taught us anything, it's that everything is a zero sum game. If you're not directly benefiting, no deal. permalink parent award report block reply\nSpindle-spin -4 points 7 days ago Yup. And when the economy took off after that, we dumped billions into the NYC area for various projects and causes, but Main Street Arkansas or Kansas got nothing directly in return. It was all indirect benefits. If President Trump's taught us anything, it's that everything is a zero sum game. If you're not directly benefiting, no deal. permalink parent award report block reply\nPitfallHarry 2 points 7 days ago Really? So if NYC raises subway fares how does that affect us all? Spoiler. It doesn’t fucking matter. Unless you live there. permalink parent award report block reply Coover 6 points 7 days ago It matters when millions of dumbasses leave and migrate south with same dumbass ideas and voting style. permalink parent award report block reply Side_o_beef_curtains 5 points 7 days ago That, my friend, is already happening. Im in Georgia and this place is over run with faggots from new york, California, and guata-fucking-mala. permalink parent award report block reply view 2 more comments... roadrunner0 3 points 7 days ago The businesses in the city and State including Wall Street and the banks most certainly do affect most all of us in one way or another.. Prices, product availability, tourism, the US government, crime and more.. permalink parent award report block reply SenorTrumper OP 2 points 7 days ago Lol it would be futile to try to explain how a state with so many members in congress could effect everything by going far left. permalink parent award report block reply PitfallHarry 2 points 7 days ago This is one city in the state. Not the whole state. And it’s a mayor not a member of congress. You seem really lost. Now that Trump has prices down there’s no way any state is moving to the left. permalink parent award report block reply Viewer01 1 points 7 days ago That’s cherry picking and you know it. Now do a 40% tax on millionaires and tell me what happens. permalink parent award report block reply roadrunner0 1 points 7 days ago I guarantee you that there will be a mass exodus of business and wealthy people from the city.. Some have already left years ago but the on the fence and holdouts are most likely starting their plans for a quick exit.. Jewish people for sure know that they will be persecuted just like in London.. permalink parent award report block reply view 2 more comments...\nCoover 6 points 7 days ago It matters when millions of dumbasses leave and migrate south with same dumbass ideas and voting style. permalink parent award report block reply Side_o_beef_curtains 5 points 7 days ago That, my friend, is already happening. Im in Georgia and this place is over run with faggots from new york, California, and guata-fucking-mala. permalink parent award report block reply view 2 more comments...\nSide_o_beef_curtains 5 points 7 days ago That, my friend, is already happening. Im in Georgia and this place is over run with faggots from new york, California, and guata-fucking-mala. permalink parent award report block reply view 2 more comments...\nroadrunner0 3 points 7 days ago The businesses in the city and State including Wall Street and the banks most certainly do affect most all of us in one way or another.. Prices, product availability, tourism, the US government, crime and more.. permalink parent award report block reply\nSenorTrumper OP 2 points 7 days ago Lol it would be futile to try to explain how a state with so many members in congress could effect everything by going far left. permalink parent award report block reply PitfallHarry 2 points 7 days ago This is one city in the state. Not the whole state. And it’s a mayor not a member of congress. You seem really lost. Now that Trump has prices down there’s no way any state is moving to the left. permalink parent award report block reply\nPitfallHarry 2 points 7 days ago This is one city in the state. Not the whole state. And it’s a mayor not a member of congress. You seem really lost. Now that Trump has prices down there’s no way any state is moving to the left. permalink parent award report block reply\nViewer01 1 points 7 days ago That’s cherry picking and you know it. Now do a 40% tax on millionaires and tell me what happens. permalink parent award report block reply roadrunner0 1 points 7 days ago I guarantee you that there will be a mass exodus of business and wealthy people from the city.. Some have already left years ago but the on the fence and holdouts are most likely starting their plans for a quick exit.. Jewish people for sure know that they will be persecuted just like in London.. permalink parent award report block reply view 2 more comments...\nroadrunner0 1 points 7 days ago I guarantee you that there will be a mass exodus of business and wealthy people from the city.. Some have already left years ago but the on the fence and holdouts are most likely starting their plans for a quick exit.. Jewish people for sure know that they will be persecuted just like in London.. permalink parent award report block reply view 2 more comments...\nSlugbert 7 points 7 days ago Before, it was Dearborn, then Hamtramck, now NYC. See the pattern? Not giving a shit now might eventually lead to a mosque popping up on your street corner later (followed by all islam local “leadership”). Best be vigilant. permalink parent award report block reply TPMJB 4 points 7 days ago Didn't governor Hot Wheels sign a law saying no Sharia Law in Texas? We just have to kick out the rest of the muzzos in Houston and we're set. They will never get power here. NY burning just emboldens governor Hot Wheels to fight the degeneracy harder. permalink parent award report block reply Jimmy33 4 points 7 days ago You’re right. The spread is the problem. permalink parent award report block reply\nTPMJB 4 points 7 days ago Didn't governor Hot Wheels sign a law saying no Sharia Law in Texas? We just have to kick out the rest of the muzzos in Houston and we're set. They will never get power here. NY burning just emboldens governor Hot Wheels to fight the degeneracy harder. permalink parent award report block reply\nJimmy33 4 points 7 days ago You’re right. The spread is the problem. permalink parent award report block reply\nmateus 3 points 7 days ago LOL Because far too many here only think \"New York City\" when it comes to NY state . Like I said: 👇 https://i.postimg.cc/7LvRdvtY/allpartofny.jpg permalink parent award report block reply PitfallHarry -1 points 7 days ago Yeah but still I would say what difference does it make unless you live there. permalink parent award report block reply\nPitfallHarry -1 points 7 days ago Yeah but still I would say what difference does it make unless you live there. permalink parent award report block reply\nFattyWatt 2 points 7 days ago Commies SPREAD worse than parasites & STD's, put together! permalink parent award report block reply PitfallHarry 5 points 7 days ago Well we’re letting Qatar have a military air base on American soil so I guess you’re right. permalink parent award report block reply FattyWatt 2 points 7 days ago ^TRUTH^ permalink parent award report block reply\nPitfallHarry 5 points 7 days ago Well we’re letting Qatar have a military air base on American soil so I guess you’re right. permalink parent award report block reply FattyWatt 2 points 7 days ago ^TRUTH^ permalink parent award report block reply\nFattyWatt 2 points 7 days ago ^TRUTH^ permalink parent award report block reply\nTonz 1 points 7 days ago NYC affects the entire state, sadly. permalink parent award report block reply\nHandshake_Shmanshake 3 points 7 days ago Look, when a city or state is captured, and they start denying the citizens their RIGHTS... that state now becomes a DOMESTIC ENEMY. Anyone who took an oath to this country, WHO FAILS TO UPHOLD THAT OATH, should face the most EXTREME consequences. So our courts, and JUDGES WHO FAIL THEIR OATHS, should be getting locked in prison. This is TREASON. permalink award report block reply\nPrandogolio 3 points 7 days ago No.  Keep suing. permalink award report block reply Spartacus1188 1 points 7 days ago Lawsuits DON'T work. Bullets DO. permalink parent award report block reply Nomad899 2 points 7 days ago Bullets fly….. permalink parent award report block reply Prandogolio 2 points 7 days ago Lawsuits can work.  And the left understands that the legal process is a punishment on its own.  The right needs to take that same approach. permalink parent award report block reply\nSpartacus1188 1 points 7 days ago Lawsuits DON'T work. Bullets DO. permalink parent award report block reply Nomad899 2 points 7 days ago Bullets fly….. permalink parent award report block reply Prandogolio 2 points 7 days ago Lawsuits can work.  And the left understands that the legal process is a punishment on its own.  The right needs to take that same approach. permalink parent award report block reply\nNomad899 2 points 7 days ago Bullets fly….. permalink parent award report block reply\nPrandogolio 2 points 7 days ago Lawsuits can work.  And the left understands that the legal process is a punishment on its own.  The right needs to take that same approach. permalink parent award report block reply\nTPMJB 2 points 7 days ago I'm so goddamned pumped for the destruction lol. This will redpill so many. I cannot wait! permalink award report block reply\nChickensaurus 2 points 7 days ago The rest of the US will follow quickly.... permalink award report block reply\nDlanOdcammron 2 points 7 days ago It won’t be through votes. If they ever want it back they’ll have to take it back. permalink award report block reply\nI_Love_45-70_Gov 2 points 7 days ago When the stabbings and bombings begin, start shooting. No mercy permalink award report block reply Nomad899 1 points 7 days ago Only gangs and criminals have guns in ny…everyone else is at their mercy permalink parent award report block reply\nNomad899 1 points 7 days ago Only gangs and criminals have guns in ny…everyone else is at their mercy permalink parent award report block reply\nGtsx 2 points 7 days ago If the Supreme Court got of its ass, maybe the same constitution would apply to the whole country. permalink award report block reply\nAtomicAmericanX 1 points 7 days ago No mon, no fun, your son... permalink award report block reply\nguns_and_butter 1 points 7 days ago AI is going to obliterate the tax base so good luck funding any of his socialist bullshit. permalink award report block reply\nSBOJ_JOBS 1 points 6 days ago The state legislature must approve NYC taxes, but if the city management proceeds to spend itself into a hole, upstate legislators will be under enormous pressure to let NYC residents pay themselves back, not put the burden on other taxpayers. Meanwhile... New York City residents face a multi-layered tax system that includes state, city, and local levies. The city imposes its own income tax on top of New York State taxes, with rates ranging from 3.078% to 3.876% depending on income level and filing status, resulting in combined state and city income tax rates between 7.078% and 14.776% for top earners. New York State itself has nine progressive income tax brackets, from 4% to 10.9%. Sales taxes in New York City are among the highest in the nation, with a total rate of 8.875%, including a 0.375% Metropolitan Commuter Transportation District charge.\nProperty taxes in New York City have an average effective rate of 0.91% of property value, though this is due to the taxable value being set at only 6% of market value for most residential properties. The city’s property tax is a major revenue source, projected to generate $24 billion in fiscal year 2017 and continuing to grow due to rising real estate values. Additionally, residents pay a 25.68 cents per gallon gas tax and a $4.35 per pack cigarette excise tax, with an additional $1.50 per pack in New York City. permalink award report block reply\ntlorsung 1 points 7 days ago Hay Now!  It is possible that Mamdani will be a mayor that helps NYC citizens so much that the quality of life is increased and cost of living decreases!!  I'm NOT going to bet on it, every Muslim society in history has been a Gov is very corrupt, and its people suffer and needs some other country to help and take them in as asylum seekers.  Welcome to History being repeated!! ha ha! permalink award report block reply Spartacus1188 2 points 7 days ago That goatfucker will only help his fellow mudslimes. permalink parent award report block reply\nSpartacus1188 2 points 7 days ago That goatfucker will only help his fellow mudslimes. permalink parent award report block reply\nNomad899 1 points 7 days ago They barely have a 1st permalink award report block reply\nbluewhiteandred 1 points 7 days ago SHALL permalink award report block reply\nlefty295 1 points 7 days ago Cuomo would’ve done the same. C’mon guys. permalink award report block reply roadrunner0 1 points 7 days ago It was very sad that no high profile Republican wanted the horrendous job.. The filth and corruption is off the hook bad so I don't blame anyone for holding their nose and running away.. I guess President Trump said he would have run for mayor but he was a bit too busy being President at this time.. permalink parent award report block reply lefty295 1 points 7 days ago A 2015 era Trump without the political baggage of being President would likely have been able to win that three way race imo, with his name recognition and populist policies. Probably not after TDS is all over nyc now. permalink parent award report block reply\nroadrunner0 1 points 7 days ago It was very sad that no high profile Republican wanted the horrendous job.. The filth and corruption is off the hook bad so I don't blame anyone for holding their nose and running away.. I guess President Trump said he would have run for mayor but he was a bit too busy being President at this time.. permalink parent award report block reply lefty295 1 points 7 days ago A 2015 era Trump without the political baggage of being President would likely have been able to win that three way race imo, with his name recognition and populist policies. Probably not after TDS is all over nyc now. permalink parent award report block reply\nlefty295 1 points 7 days ago A 2015 era Trump without the political baggage of being President would likely have been able to win that three way race imo, with his name recognition and populist policies. Probably not after TDS is all over nyc now. permalink parent award report block reply\nKungPaoMcChicken 1 points 7 days ago To be honest, I don't think the Mayor can really do much. He can't change taxes, that's a state thing. I doubt he can provide free buses. I think people are worried too much. permalink award report block reply SenorTrumper OP 1 points 7 days ago But-but-but, he promised a ton of free shit! permalink parent award report block reply KungPaoMcChicken 1 points 7 days ago He said he will increase taxes (he can't, that's state) and make buses free (he can't because there is no money to pay for it). The mayor has jack shit power over anything. permalink parent award report block reply SenorTrumper OP 1 points 7 days ago None of that matters! HE PROMISED US! permalink parent award report block reply KungPaoMcChicken 1 points 7 days ago It doesn't matter what he said, he's incapable of delivering. Check it out. The mayor has no control over the state, the state decides taxes. He has no way to generate the revenue. Also, how do the buses operate? Is it privatised? If he's promising to cover the costs, then what's to stop the bus operators deliberately increasing costs because this dude is promising pay. permalink parent award report block reply view 1 more comments...\nSenorTrumper OP 1 points 7 days ago But-but-but, he promised a ton of free shit! permalink parent award report block reply KungPaoMcChicken 1 points 7 days ago He said he will increase taxes (he can't, that's state) and make buses free (he can't because there is no money to pay for it). The mayor has jack shit power over anything. permalink parent award report block reply SenorTrumper OP 1 points 7 days ago None of that matters! HE PROMISED US! permalink parent award report block reply KungPaoMcChicken 1 points 7 days ago It doesn't matter what he said, he's incapable of delivering. Check it out. The mayor has no control over the state, the state decides taxes. He has no way to generate the revenue. Also, how do the buses operate? Is it privatised? If he's promising to cover the costs, then what's to stop the bus operators deliberately increasing costs because this dude is promising pay. permalink parent award report block reply view 1 more comments...\nKungPaoMcChicken 1 points 7 days ago He said he will increase taxes (he can't, that's state) and make buses free (he can't because there is no money to pay for it). The mayor has jack shit power over anything. permalink parent award report block reply SenorTrumper OP 1 points 7 days ago None of that matters! HE PROMISED US! permalink parent award report block reply KungPaoMcChicken 1 points 7 days ago It doesn't matter what he said, he's incapable of delivering. Check it out. The mayor has no control over the state, the state decides taxes. He has no way to generate the revenue. Also, how do the buses operate? Is it privatised? If he's promising to cover the costs, then what's to stop the bus operators deliberately increasing costs because this dude is promising pay. permalink parent award report block reply view 1 more comments...\nSenorTrumper OP 1 points 7 days ago None of that matters! HE PROMISED US! permalink parent award report block reply KungPaoMcChicken 1 points 7 days ago It doesn't matter what he said, he's incapable of delivering. Check it out. The mayor has no control over the state, the state decides taxes. He has no way to generate the revenue. Also, how do the buses operate? Is it privatised? If he's promising to cover the costs, then what's to stop the bus operators deliberately increasing costs because this dude is promising pay. permalink parent award report block reply view 1 more comments...\nKungPaoMcChicken 1 points 7 days ago It doesn't matter what he said, he's incapable of delivering. Check it out. The mayor has no control over the state, the state decides taxes. He has no way to generate the revenue. Also, how do the buses operate? Is it privatised? If he's promising to cover the costs, then what's to stop the bus operators deliberately increasing costs because this dude is promising pay. permalink parent award report block reply view 1 more comments...\nWaco419 1 points 7 days ago Only if you believe you have the moral duty to obey another man. permalink award report block reply\nDatamancer 0 points 7 days ago Sorry.  But keep your ass there. permalink award report block reply\nILoveGoatFucking -1 points 7 days ago Comment removed upon the user being banned. permalink award report block reply FattyWatt 1 points 7 days ago Take ur FREEDOM OF SPEECH and keep talking.  If U take my AMERICAN GUNS, u will FAFO---u piece of shit COMMUNIST.  U fuckers wanna ban everything, but ur own speech. WEAK!! permalink parent award report block reply ILoveGoatFucking 1 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply Prandogolio 1 points 7 days ago The criminals aren't going to be unarmed. permalink parent award report block reply\nFattyWatt 1 points 7 days ago Take ur FREEDOM OF SPEECH and keep talking.  If U take my AMERICAN GUNS, u will FAFO---u piece of shit COMMUNIST.  U fuckers wanna ban everything, but ur own speech. WEAK!! permalink parent award report block reply ILoveGoatFucking 1 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply\nILoveGoatFucking 1 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply\nPrandogolio 1 points 7 days ago The criminals aren't going to be unarmed. permalink parent award report block reply"}