{"id": "1ARK54Rfoj", "contents": "902 Tucker Carlson exposes the SCAM Lindsey Graham pulls every year he is up for election. posted 5 days ago by Bidensuckscocks 40 comments award share report block\n40 comments Sort by Top Top New Worst Old Save Around the Web Hair Will Grow Back! No Matter How Severe The Baldness HaloGrow jonnyuno 53 points 5 days ago Tucker = national treasure permalink award report block reply NoticesBugleOWO 1 points 5 days ago He's a scammer himself, so of course he can tell that Graham is also a scammer. permalink parent award report block reply LirukDatan -17 points 5 days ago If someone sells out for foreign money, they are NOT America first. Tucker Qatarlson can fuck right off. permalink parent award report block reply MastaJoda -18 points 5 days ago Republican voters = mouth breathing, RINO reelecting retards permalink parent award report block reply grassshrimp 18 points 5 days ago You mean Republicans that elected President Trump with over 90% supporting him?  Those Republicans? permalink parent award report block reply jonnyuno 10 points 5 days ago Maga voted for Trump which included enough rino GOP and disaffected Dems and Inds. GOP are scum and only fight when Trump seems popular.  And the minute he seems in trouble, they're tuturncoat.,  They love to lose so they can fundraiser, promising to stand up and fight.  Only to cuddle and snuggle with money laundering Dems like themselves.  Trump is remaking the GOP. permalink parent award report block reply sordfysh PRO 7 points 5 days ago That is what Lindsay Graham and Paul Ryan think. permalink parent award report block reply anotherthing 11 points 5 days ago Don't forget that Lindsey Graham floated the Federal Abortion ban thing six weeks before the 2022 midterms. He basically gave the Democrats their October surprise, knowing there was no way in Hell that would pass with a Democrat Senate, and basically scaring every single moderate and independent in to voting for the Democrats. The only reason you'd do that when he did it was to sabotage the races for Republicans during that midterm. The Democrats were scare mongering the the Republicans would do this if they got power, and Lindsey Graham decided to prove it. permalink parent award report block reply 2016TrumpMAGA 1 points 5 days ago At least in South Carolina. permalink parent award report block reply Modernturnkey -21 points 5 days ago He's a Zog and Nog loving fed too. permalink parent award report block reply anotherthing 18 points 5 days ago Tucker Carlson is not your mom. permalink parent award report block reply Bullet3250 26 points 5 days ago The primary option is great... but understand you need to take out 'THE UNIPARTY' and or \"ESTABLISHMENT CANDIDATES\"... and those people have tens of Millions of dollars and they own the Media Machine.  AND they have Re-election committees in DC that will fight against primary chanllenges - and then NOT FUND YOU if you win in the Primary - and basically re-primary YOU ASAP... again with MILLIONS of Dollars. Taking out these players is SUPER HEAVY LIFTING... it is absolutely a Blood Sport - MAGA needs ELON to come in help remove some of the worst... it really is the only way. permalink award report block reply RuprechtThaMonkeyBoy 17 points 5 days ago We learned this in 2020. Many here involved with their local Republican Party found a general unwillingness, apathy to support Trump. Pathetic. Graham is as swamp as they come. Can’t stand the McCain acolyte. permalink parent award report block reply Bullet3250 13 points 5 days ago The Good news is that MAGA has 80% plus of the Republican VOTES now - and it is growing. The Establishment CAN NOT WIN without us... not even close. We only need more leaders to step up and help build the BIG TENT PARTY - so we  continue to beat Democrats .  For as bad as the Establishment is - we can not NOTHING AT ALL - if the Dems are in charge of this Nation.  Infighting is cute - but AMERICA is more important then some youtube shills tossing around insults. permalink parent award report block reply ReleasetheList 13 points 5 days ago The thing about the establishment is they'd rather burn it all down and rule over the ashes than actually do what they are elected to do. permalink parent award report block reply ChinchillaCapitalism 3 points 5 days ago The alternative is we adopt a \"beg for scraps or starve\" mentality. We have to strategically siphon off power brokers with the reasoning \"We're willing to burn it all too. But if you throw your lot in with the winning team, us, then you get to keep some if not all of your prestige.\" Then ambition can be made to check ambition. Some special interests will never support our cause but with some compromising and negotiating, hopefully crafting win-win situations, we can pluck some of their support and they'll go along to get along. permalink parent award report block reply MastaJoda 1 points 5 days ago ☝His source is the last 30 years. permalink parent award report block reply boomerbutnotOKBoomer 3 points 5 days ago McStain butt buddy. there. fixed it for ya permalink parent award report block reply sordfysh PRO 3 points 5 days ago More Republicans need to learn to become scrappy. The biggest problem with Republicans, I think, is that the communists know how to live in poverty. They know that if they get evicted, it's not the end of the world for them. A Republican thinks that if he were to miss a mortgage payment that he is in danger. If a Republican worries that if he hasn't acquired $5M in a retirement fund by 65 that he's fucked. The Republicans are therefore always chasing money. The communists know this and so they find ways to print money to pay off the Republicans. It's not cheap to buy a Republican, but it's a safe purchase. They will rely on your money the rest of their life, and they will treat you like family the entire time you pay them. In this way, they are grateful. A communist, however, wants a grand purpose, and then they will take a small pittance. For communists, they will steal and backstab as soon as the grand purpose sputters, even if you are still paying them. But the solution is just to keep them at a distance. You can rent them a derelict warehouse to organize in, and then you can have a union boss be the liason. Republicans, the motto is \"pull yourselves up by your boot straps\", which means \"every man for themselves\". The communist motto is \"strength in unity\" which means \"all for the collective good\". This is changing in Trump Republicanism, but this is why we can't seem to primary anyone. And the establishment likes it that way. You are alone because the culture wants you that way. It wasn't supposed to be this way. Read Acts 2. permalink parent award report block reply 2016TrumpMAGA 2 points 5 days ago A Republican worries that if he hasn't acquired $5M in a retirement fund by 65 that he's fucked. NO. A Republican worries that if he hasn't acquired $5M in a retirement fund by 65 his family is fucked. I'm over 50.  At this point, I'm not working for me.  I'm accumulating wealth so that my family - including brothers, sisters, nieces and nephews - is taken care of after I die, and so that I can help them out a little while I'm alive. That's the difference.  Leftists only care about themselves and their wants (you notice I did not say needs ). The communist motto is \"strength in unity\" Wrong again. The communist motto is \"by any means necessary.\"  Commies are willing to do whatever it takes to prevail.  See:  Antifa, BLM, election fraud, the filibuster.  Republicans aren't even willing to prosecute these crimes. permalink parent award report block reply sordfysh PRO 1 points 4 days ago Your whole family rides on your back, financially? Are you black? The communist motto is what they motivate each other with. They aren't motivated by their means. They are motivated by their desired ends. I can tell that you are certainly motivated by means, but it's because you think your world critically depends on you. If that was true, Americans wouldn't join the military or become police officers. I'm just going to advise you to seek the Lord Jesus Christ just as the Americans who made this country great. permalink parent award report block reply noPTSDforMePlease 2 points 5 days ago Replace one group of billionaires with another. Great. Why not just get rid of the campaign finance laws that make their strategy effective? permalink parent award report block reply Bullet3250 3 points 5 days ago Dark money will always be in the Networks to get their guy elected. Take a few minutes and read up on Arabella Advisors... they are bringing in $2-3 Billion dollars per cycle now... all DEM MONEY almost all of it Dark. permalink parent award report block reply superwookee 9 points 5 days ago SC GOP has open primaries so all the Dems vote to make sure he's the candidate. permalink award report block reply lostremote- 7 points 5 days ago The boomers keep putting him in.  My parents voted for Trump and they STILL vote for this faggot no matter how much I try to get them to see what a tool he is. permalink parent award report block reply Longiron 1 points 5 days ago Nailed it permalink parent award report block reply MorningFrost 6 points 5 days ago Lindsey Graham is a total piece. permalink award report block reply 1776Widowmaker 5 points 5 days ago Remember that time a bunch of people shamed Lindsey at the airport? Us that was awesome. permalink parent award report block reply PearlyGaits57 4 points 5 days ago Primary the shit out of all these RINO'S. Can't understand Trumps allegence to this turd. I don't give a fuck about his golfing ability. Graham is a huge liability to our republic. He needs to go NOW! permalink award report block reply YOLOSwag_McFartnut 4 points 5 days ago I don't have 10's of millions of dollars to primary these pieces of shit. permalink award report block reply Prussian_Pepe 4 points 5 days ago Even if you somehow DID win the primary. The GOP would pull all funding for you during the real election saying \"not worth the effort\" Or other shit like they did down in Arizona. They will purposely ignore you, and help the democrats take your seat. They are uniparty faggots through and through. permalink parent award report block reply booblitchutz 4 points 5 days ago That’s like 99% of Republican politicians, to be fair to Miss Lindsey. permalink award report block reply ILoveSilk 3 points 5 days ago Abortion, gun right, is used by them to get re elected. permalink award report block reply Repentnow 2 points 5 days ago Babies, Bullets, Bible.\nGOP safe space. permalink parent award report block reply ILoveSilk 3 points 5 days ago so sad. They use these three to cover up their incompetence and betray. permalink parent award report block reply sordfysh PRO 3 points 5 days ago Republicans love their independence and their wealth too much to be able to politically organize. If they can't elect a king to solve all their problems, then they might as well live the rest of their lives as hedonistic retirees because the system is coming to an end. I guess we did have some scrappy Republicans over at TPUSA, but their leader was killed, and now the organization is led by money. permalink award report block reply BidensfullAFdiaper 3 points 5 days ago Troof permalink award report block reply I_Love_45-70_Gov 3 points 5 days ago Susan Collins always votes her \"conscience\" on major legislation that fucks over Americans...always. permalink award report block reply boomerbutnotOKBoomer 3 points 5 days ago Ukraine is the money laundering and child sex trafficking capital of the world. Also a bunch of Nazis. permalink award report block reply The_Bo0ch -3 points 5 days ago Tuck the Qatar Cuck permalink award report block reply\njonnyuno 53 points 5 days ago Tucker = national treasure permalink award report block reply NoticesBugleOWO 1 points 5 days ago He's a scammer himself, so of course he can tell that Graham is also a scammer. permalink parent award report block reply LirukDatan -17 points 5 days ago If someone sells out for foreign money, they are NOT America first. Tucker Qatarlson can fuck right off. permalink parent award report block reply MastaJoda -18 points 5 days ago Republican voters = mouth breathing, RINO reelecting retards permalink parent award report block reply grassshrimp 18 points 5 days ago You mean Republicans that elected President Trump with over 90% supporting him?  Those Republicans? permalink parent award report block reply jonnyuno 10 points 5 days ago Maga voted for Trump which included enough rino GOP and disaffected Dems and Inds. GOP are scum and only fight when Trump seems popular.  And the minute he seems in trouble, they're tuturncoat.,  They love to lose so they can fundraiser, promising to stand up and fight.  Only to cuddle and snuggle with money laundering Dems like themselves.  Trump is remaking the GOP. permalink parent award report block reply sordfysh PRO 7 points 5 days ago That is what Lindsay Graham and Paul Ryan think. permalink parent award report block reply anotherthing 11 points 5 days ago Don't forget that Lindsey Graham floated the Federal Abortion ban thing six weeks before the 2022 midterms. He basically gave the Democrats their October surprise, knowing there was no way in Hell that would pass with a Democrat Senate, and basically scaring every single moderate and independent in to voting for the Democrats. The only reason you'd do that when he did it was to sabotage the races for Republicans during that midterm. The Democrats were scare mongering the the Republicans would do this if they got power, and Lindsey Graham decided to prove it. permalink parent award report block reply 2016TrumpMAGA 1 points 5 days ago At least in South Carolina. permalink parent award report block reply Modernturnkey -21 points 5 days ago He's a Zog and Nog loving fed too. permalink parent award report block reply anotherthing 18 points 5 days ago Tucker Carlson is not your mom. permalink parent award report block reply\nNoticesBugleOWO 1 points 5 days ago He's a scammer himself, so of course he can tell that Graham is also a scammer. permalink parent award report block reply\nLirukDatan -17 points 5 days ago If someone sells out for foreign money, they are NOT America first. Tucker Qatarlson can fuck right off. permalink parent award report block reply\nMastaJoda -18 points 5 days ago Republican voters = mouth breathing, RINO reelecting retards permalink parent award report block reply grassshrimp 18 points 5 days ago You mean Republicans that elected President Trump with over 90% supporting him?  Those Republicans? permalink parent award report block reply jonnyuno 10 points 5 days ago Maga voted for Trump which included enough rino GOP and disaffected Dems and Inds. GOP are scum and only fight when Trump seems popular.  And the minute he seems in trouble, they're tuturncoat.,  They love to lose so they can fundraiser, promising to stand up and fight.  Only to cuddle and snuggle with money laundering Dems like themselves.  Trump is remaking the GOP. permalink parent award report block reply sordfysh PRO 7 points 5 days ago That is what Lindsay Graham and Paul Ryan think. permalink parent award report block reply anotherthing 11 points 5 days ago Don't forget that Lindsey Graham floated the Federal Abortion ban thing six weeks before the 2022 midterms. He basically gave the Democrats their October surprise, knowing there was no way in Hell that would pass with a Democrat Senate, and basically scaring every single moderate and independent in to voting for the Democrats. The only reason you'd do that when he did it was to sabotage the races for Republicans during that midterm. The Democrats were scare mongering the the Republicans would do this if they got power, and Lindsey Graham decided to prove it. permalink parent award report block reply 2016TrumpMAGA 1 points 5 days ago At least in South Carolina. permalink parent award report block reply\ngrassshrimp 18 points 5 days ago You mean Republicans that elected President Trump with over 90% supporting him?  Those Republicans? permalink parent award report block reply jonnyuno 10 points 5 days ago Maga voted for Trump which included enough rino GOP and disaffected Dems and Inds. GOP are scum and only fight when Trump seems popular.  And the minute he seems in trouble, they're tuturncoat.,  They love to lose so they can fundraiser, promising to stand up and fight.  Only to cuddle and snuggle with money laundering Dems like themselves.  Trump is remaking the GOP. permalink parent award report block reply\njonnyuno 10 points 5 days ago Maga voted for Trump which included enough rino GOP and disaffected Dems and Inds. GOP are scum and only fight when Trump seems popular.  And the minute he seems in trouble, they're tuturncoat.,  They love to lose so they can fundraiser, promising to stand up and fight.  Only to cuddle and snuggle with money laundering Dems like themselves.  Trump is remaking the GOP. permalink parent award report block reply\nsordfysh PRO 7 points 5 days ago That is what Lindsay Graham and Paul Ryan think. permalink parent award report block reply anotherthing 11 points 5 days ago Don't forget that Lindsey Graham floated the Federal Abortion ban thing six weeks before the 2022 midterms. He basically gave the Democrats their October surprise, knowing there was no way in Hell that would pass with a Democrat Senate, and basically scaring every single moderate and independent in to voting for the Democrats. The only reason you'd do that when he did it was to sabotage the races for Republicans during that midterm. The Democrats were scare mongering the the Republicans would do this if they got power, and Lindsey Graham decided to prove it. permalink parent award report block reply\nanotherthing 11 points 5 days ago Don't forget that Lindsey Graham floated the Federal Abortion ban thing six weeks before the 2022 midterms. He basically gave the Democrats their October surprise, knowing there was no way in Hell that would pass with a Democrat Senate, and basically scaring every single moderate and independent in to voting for the Democrats. The only reason you'd do that when he did it was to sabotage the races for Republicans during that midterm. The Democrats were scare mongering the the Republicans would do this if they got power, and Lindsey Graham decided to prove it. permalink parent award report block reply\n2016TrumpMAGA 1 points 5 days ago At least in South Carolina. permalink parent award report block reply\nModernturnkey -21 points 5 days ago He's a Zog and Nog loving fed too. permalink parent award report block reply anotherthing 18 points 5 days ago Tucker Carlson is not your mom. permalink parent award report block reply\nanotherthing 18 points 5 days ago Tucker Carlson is not your mom. permalink parent award report block reply\nBullet3250 26 points 5 days ago The primary option is great... but understand you need to take out 'THE UNIPARTY' and or \"ESTABLISHMENT CANDIDATES\"... and those people have tens of Millions of dollars and they own the Media Machine.  AND they have Re-election committees in DC that will fight against primary chanllenges - and then NOT FUND YOU if you win in the Primary - and basically re-primary YOU ASAP... again with MILLIONS of Dollars. Taking out these players is SUPER HEAVY LIFTING... it is absolutely a Blood Sport - MAGA needs ELON to come in help remove some of the worst... it really is the only way. permalink award report block reply RuprechtThaMonkeyBoy 17 points 5 days ago We learned this in 2020. Many here involved with their local Republican Party found a general unwillingness, apathy to support Trump. Pathetic. Graham is as swamp as they come. Can’t stand the McCain acolyte. permalink parent award report block reply Bullet3250 13 points 5 days ago The Good news is that MAGA has 80% plus of the Republican VOTES now - and it is growing. The Establishment CAN NOT WIN without us... not even close. We only need more leaders to step up and help build the BIG TENT PARTY - so we  continue to beat Democrats .  For as bad as the Establishment is - we can not NOTHING AT ALL - if the Dems are in charge of this Nation.  Infighting is cute - but AMERICA is more important then some youtube shills tossing around insults. permalink parent award report block reply ReleasetheList 13 points 5 days ago The thing about the establishment is they'd rather burn it all down and rule over the ashes than actually do what they are elected to do. permalink parent award report block reply ChinchillaCapitalism 3 points 5 days ago The alternative is we adopt a \"beg for scraps or starve\" mentality. We have to strategically siphon off power brokers with the reasoning \"We're willing to burn it all too. But if you throw your lot in with the winning team, us, then you get to keep some if not all of your prestige.\" Then ambition can be made to check ambition. Some special interests will never support our cause but with some compromising and negotiating, hopefully crafting win-win situations, we can pluck some of their support and they'll go along to get along. permalink parent award report block reply MastaJoda 1 points 5 days ago ☝His source is the last 30 years. permalink parent award report block reply boomerbutnotOKBoomer 3 points 5 days ago McStain butt buddy. there. fixed it for ya permalink parent award report block reply sordfysh PRO 3 points 5 days ago More Republicans need to learn to become scrappy. The biggest problem with Republicans, I think, is that the communists know how to live in poverty. They know that if they get evicted, it's not the end of the world for them. A Republican thinks that if he were to miss a mortgage payment that he is in danger. If a Republican worries that if he hasn't acquired $5M in a retirement fund by 65 that he's fucked. The Republicans are therefore always chasing money. The communists know this and so they find ways to print money to pay off the Republicans. It's not cheap to buy a Republican, but it's a safe purchase. They will rely on your money the rest of their life, and they will treat you like family the entire time you pay them. In this way, they are grateful. A communist, however, wants a grand purpose, and then they will take a small pittance. For communists, they will steal and backstab as soon as the grand purpose sputters, even if you are still paying them. But the solution is just to keep them at a distance. You can rent them a derelict warehouse to organize in, and then you can have a union boss be the liason. Republicans, the motto is \"pull yourselves up by your boot straps\", which means \"every man for themselves\". The communist motto is \"strength in unity\" which means \"all for the collective good\". This is changing in Trump Republicanism, but this is why we can't seem to primary anyone. And the establishment likes it that way. You are alone because the culture wants you that way. It wasn't supposed to be this way. Read Acts 2. permalink parent award report block reply 2016TrumpMAGA 2 points 5 days ago A Republican worries that if he hasn't acquired $5M in a retirement fund by 65 that he's fucked. NO. A Republican worries that if he hasn't acquired $5M in a retirement fund by 65 his family is fucked. I'm over 50.  At this point, I'm not working for me.  I'm accumulating wealth so that my family - including brothers, sisters, nieces and nephews - is taken care of after I die, and so that I can help them out a little while I'm alive. That's the difference.  Leftists only care about themselves and their wants (you notice I did not say needs ). The communist motto is \"strength in unity\" Wrong again. The communist motto is \"by any means necessary.\"  Commies are willing to do whatever it takes to prevail.  See:  Antifa, BLM, election fraud, the filibuster.  Republicans aren't even willing to prosecute these crimes. permalink parent award report block reply sordfysh PRO 1 points 4 days ago Your whole family rides on your back, financially? Are you black? The communist motto is what they motivate each other with. They aren't motivated by their means. They are motivated by their desired ends. I can tell that you are certainly motivated by means, but it's because you think your world critically depends on you. If that was true, Americans wouldn't join the military or become police officers. I'm just going to advise you to seek the Lord Jesus Christ just as the Americans who made this country great. permalink parent award report block reply noPTSDforMePlease 2 points 5 days ago Replace one group of billionaires with another. Great. Why not just get rid of the campaign finance laws that make their strategy effective? permalink parent award report block reply Bullet3250 3 points 5 days ago Dark money will always be in the Networks to get their guy elected. Take a few minutes and read up on Arabella Advisors... they are bringing in $2-3 Billion dollars per cycle now... all DEM MONEY almost all of it Dark. permalink parent award report block reply\nRuprechtThaMonkeyBoy 17 points 5 days ago We learned this in 2020. Many here involved with their local Republican Party found a general unwillingness, apathy to support Trump. Pathetic. Graham is as swamp as they come. Can’t stand the McCain acolyte. permalink parent award report block reply Bullet3250 13 points 5 days ago The Good news is that MAGA has 80% plus of the Republican VOTES now - and it is growing. The Establishment CAN NOT WIN without us... not even close. We only need more leaders to step up and help build the BIG TENT PARTY - so we  continue to beat Democrats .  For as bad as the Establishment is - we can not NOTHING AT ALL - if the Dems are in charge of this Nation.  Infighting is cute - but AMERICA is more important then some youtube shills tossing around insults. permalink parent award report block reply ReleasetheList 13 points 5 days ago The thing about the establishment is they'd rather burn it all down and rule over the ashes than actually do what they are elected to do. permalink parent award report block reply ChinchillaCapitalism 3 points 5 days ago The alternative is we adopt a \"beg for scraps or starve\" mentality. We have to strategically siphon off power brokers with the reasoning \"We're willing to burn it all too. But if you throw your lot in with the winning team, us, then you get to keep some if not all of your prestige.\" Then ambition can be made to check ambition. Some special interests will never support our cause but with some compromising and negotiating, hopefully crafting win-win situations, we can pluck some of their support and they'll go along to get along. permalink parent award report block reply MastaJoda 1 points 5 days ago ☝His source is the last 30 years. permalink parent award report block reply boomerbutnotOKBoomer 3 points 5 days ago McStain butt buddy. there. fixed it for ya permalink parent award report block reply\nBullet3250 13 points 5 days ago The Good news is that MAGA has 80% plus of the Republican VOTES now - and it is growing. The Establishment CAN NOT WIN without us... not even close. We only need more leaders to step up and help build the BIG TENT PARTY - so we  continue to beat Democrats .  For as bad as the Establishment is - we can not NOTHING AT ALL - if the Dems are in charge of this Nation.  Infighting is cute - but AMERICA is more important then some youtube shills tossing around insults. permalink parent award report block reply ReleasetheList 13 points 5 days ago The thing about the establishment is they'd rather burn it all down and rule over the ashes than actually do what they are elected to do. permalink parent award report block reply ChinchillaCapitalism 3 points 5 days ago The alternative is we adopt a \"beg for scraps or starve\" mentality. We have to strategically siphon off power brokers with the reasoning \"We're willing to burn it all too. But if you throw your lot in with the winning team, us, then you get to keep some if not all of your prestige.\" Then ambition can be made to check ambition. Some special interests will never support our cause but with some compromising and negotiating, hopefully crafting win-win situations, we can pluck some of their support and they'll go along to get along. permalink parent award report block reply MastaJoda 1 points 5 days ago ☝His source is the last 30 years. permalink parent award report block reply\nReleasetheList 13 points 5 days ago The thing about the establishment is they'd rather burn it all down and rule over the ashes than actually do what they are elected to do. permalink parent award report block reply ChinchillaCapitalism 3 points 5 days ago The alternative is we adopt a \"beg for scraps or starve\" mentality. We have to strategically siphon off power brokers with the reasoning \"We're willing to burn it all too. But if you throw your lot in with the winning team, us, then you get to keep some if not all of your prestige.\" Then ambition can be made to check ambition. Some special interests will never support our cause but with some compromising and negotiating, hopefully crafting win-win situations, we can pluck some of their support and they'll go along to get along. permalink parent award report block reply MastaJoda 1 points 5 days ago ☝His source is the last 30 years. permalink parent award report block reply\nChinchillaCapitalism 3 points 5 days ago The alternative is we adopt a \"beg for scraps or starve\" mentality. We have to strategically siphon off power brokers with the reasoning \"We're willing to burn it all too. But if you throw your lot in with the winning team, us, then you get to keep some if not all of your prestige.\" Then ambition can be made to check ambition. Some special interests will never support our cause but with some compromising and negotiating, hopefully crafting win-win situations, we can pluck some of their support and they'll go along to get along. permalink parent award report block reply\nMastaJoda 1 points 5 days ago ☝His source is the last 30 years. permalink parent award report block reply\nboomerbutnotOKBoomer 3 points 5 days ago McStain butt buddy. there. fixed it for ya permalink parent award report block reply\nsordfysh PRO 3 points 5 days ago More Republicans need to learn to become scrappy. The biggest problem with Republicans, I think, is that the communists know how to live in poverty. They know that if they get evicted, it's not the end of the world for them. A Republican thinks that if he were to miss a mortgage payment that he is in danger. If a Republican worries that if he hasn't acquired $5M in a retirement fund by 65 that he's fucked. The Republicans are therefore always chasing money. The communists know this and so they find ways to print money to pay off the Republicans. It's not cheap to buy a Republican, but it's a safe purchase. They will rely on your money the rest of their life, and they will treat you like family the entire time you pay them. In this way, they are grateful. A communist, however, wants a grand purpose, and then they will take a small pittance. For communists, they will steal and backstab as soon as the grand purpose sputters, even if you are still paying them. But the solution is just to keep them at a distance. You can rent them a derelict warehouse to organize in, and then you can have a union boss be the liason. Republicans, the motto is \"pull yourselves up by your boot straps\", which means \"every man for themselves\". The communist motto is \"strength in unity\" which means \"all for the collective good\". This is changing in Trump Republicanism, but this is why we can't seem to primary anyone. And the establishment likes it that way. You are alone because the culture wants you that way. It wasn't supposed to be this way. Read Acts 2. permalink parent award report block reply 2016TrumpMAGA 2 points 5 days ago A Republican worries that if he hasn't acquired $5M in a retirement fund by 65 that he's fucked. NO. A Republican worries that if he hasn't acquired $5M in a retirement fund by 65 his family is fucked. I'm over 50.  At this point, I'm not working for me.  I'm accumulating wealth so that my family - including brothers, sisters, nieces and nephews - is taken care of after I die, and so that I can help them out a little while I'm alive. That's the difference.  Leftists only care about themselves and their wants (you notice I did not say needs ). The communist motto is \"strength in unity\" Wrong again. The communist motto is \"by any means necessary.\"  Commies are willing to do whatever it takes to prevail.  See:  Antifa, BLM, election fraud, the filibuster.  Republicans aren't even willing to prosecute these crimes. permalink parent award report block reply sordfysh PRO 1 points 4 days ago Your whole family rides on your back, financially? Are you black? The communist motto is what they motivate each other with. They aren't motivated by their means. They are motivated by their desired ends. I can tell that you are certainly motivated by means, but it's because you think your world critically depends on you. If that was true, Americans wouldn't join the military or become police officers. I'm just going to advise you to seek the Lord Jesus Christ just as the Americans who made this country great. permalink parent award report block reply\n2016TrumpMAGA 2 points 5 days ago A Republican worries that if he hasn't acquired $5M in a retirement fund by 65 that he's fucked. NO. A Republican worries that if he hasn't acquired $5M in a retirement fund by 65 his family is fucked. I'm over 50.  At this point, I'm not working for me.  I'm accumulating wealth so that my family - including brothers, sisters, nieces and nephews - is taken care of after I die, and so that I can help them out a little while I'm alive. That's the difference.  Leftists only care about themselves and their wants (you notice I did not say needs ). The communist motto is \"strength in unity\" Wrong again. The communist motto is \"by any means necessary.\"  Commies are willing to do whatever it takes to prevail.  See:  Antifa, BLM, election fraud, the filibuster.  Republicans aren't even willing to prosecute these crimes. permalink parent award report block reply sordfysh PRO 1 points 4 days ago Your whole family rides on your back, financially? Are you black? The communist motto is what they motivate each other with. They aren't motivated by their means. They are motivated by their desired ends. I can tell that you are certainly motivated by means, but it's because you think your world critically depends on you. If that was true, Americans wouldn't join the military or become police officers. I'm just going to advise you to seek the Lord Jesus Christ just as the Americans who made this country great. permalink parent award report block reply\nsordfysh PRO 1 points 4 days ago Your whole family rides on your back, financially? Are you black? The communist motto is what they motivate each other with. They aren't motivated by their means. They are motivated by their desired ends. I can tell that you are certainly motivated by means, but it's because you think your world critically depends on you. If that was true, Americans wouldn't join the military or become police officers. I'm just going to advise you to seek the Lord Jesus Christ just as the Americans who made this country great. permalink parent award report block reply\nnoPTSDforMePlease 2 points 5 days ago Replace one group of billionaires with another. Great. Why not just get rid of the campaign finance laws that make their strategy effective? permalink parent award report block reply Bullet3250 3 points 5 days ago Dark money will always be in the Networks to get their guy elected. Take a few minutes and read up on Arabella Advisors... they are bringing in $2-3 Billion dollars per cycle now... all DEM MONEY almost all of it Dark. permalink parent award report block reply\nBullet3250 3 points 5 days ago Dark money will always be in the Networks to get their guy elected. Take a few minutes and read up on Arabella Advisors... they are bringing in $2-3 Billion dollars per cycle now... all DEM MONEY almost all of it Dark. permalink parent award report block reply\nsuperwookee 9 points 5 days ago SC GOP has open primaries so all the Dems vote to make sure he's the candidate. permalink award report block reply lostremote- 7 points 5 days ago The boomers keep putting him in.  My parents voted for Trump and they STILL vote for this faggot no matter how much I try to get them to see what a tool he is. permalink parent award report block reply Longiron 1 points 5 days ago Nailed it permalink parent award report block reply\nlostremote- 7 points 5 days ago The boomers keep putting him in.  My parents voted for Trump and they STILL vote for this faggot no matter how much I try to get them to see what a tool he is. permalink parent award report block reply\nLongiron 1 points 5 days ago Nailed it permalink parent award report block reply\nMorningFrost 6 points 5 days ago Lindsey Graham is a total piece. permalink award report block reply 1776Widowmaker 5 points 5 days ago Remember that time a bunch of people shamed Lindsey at the airport? Us that was awesome. permalink parent award report block reply\n1776Widowmaker 5 points 5 days ago Remember that time a bunch of people shamed Lindsey at the airport? Us that was awesome. permalink parent award report block reply\nPearlyGaits57 4 points 5 days ago Primary the shit out of all these RINO'S. Can't understand Trumps allegence to this turd. I don't give a fuck about his golfing ability. Graham is a huge liability to our republic. He needs to go NOW! permalink award report block reply\nYOLOSwag_McFartnut 4 points 5 days ago I don't have 10's of millions of dollars to primary these pieces of shit. permalink award report block reply Prussian_Pepe 4 points 5 days ago Even if you somehow DID win the primary. The GOP would pull all funding for you during the real election saying \"not worth the effort\" Or other shit like they did down in Arizona. They will purposely ignore you, and help the democrats take your seat. They are uniparty faggots through and through. permalink parent award report block reply\nPrussian_Pepe 4 points 5 days ago Even if you somehow DID win the primary. The GOP would pull all funding for you during the real election saying \"not worth the effort\" Or other shit like they did down in Arizona. They will purposely ignore you, and help the democrats take your seat. They are uniparty faggots through and through. permalink parent award report block reply\nbooblitchutz 4 points 5 days ago That’s like 99% of Republican politicians, to be fair to Miss Lindsey. permalink award report block reply\nILoveSilk 3 points 5 days ago Abortion, gun right, is used by them to get re elected. permalink award report block reply Repentnow 2 points 5 days ago Babies, Bullets, Bible.\nGOP safe space. permalink parent award report block reply ILoveSilk 3 points 5 days ago so sad. They use these three to cover up their incompetence and betray. permalink parent award report block reply\nRepentnow 2 points 5 days ago Babies, Bullets, Bible.\nGOP safe space. permalink parent award report block reply ILoveSilk 3 points 5 days ago so sad. They use these three to cover up their incompetence and betray. permalink parent award report block reply\nILoveSilk 3 points 5 days ago so sad. They use these three to cover up their incompetence and betray. permalink parent award report block reply\nsordfysh PRO 3 points 5 days ago Republicans love their independence and their wealth too much to be able to politically organize. If they can't elect a king to solve all their problems, then they might as well live the rest of their lives as hedonistic retirees because the system is coming to an end. I guess we did have some scrappy Republicans over at TPUSA, but their leader was killed, and now the organization is led by money. permalink award report block reply\nBidensfullAFdiaper 3 points 5 days ago Troof permalink award report block reply\nI_Love_45-70_Gov 3 points 5 days ago Susan Collins always votes her \"conscience\" on major legislation that fucks over Americans...always. permalink award report block reply\nboomerbutnotOKBoomer 3 points 5 days ago Ukraine is the money laundering and child sex trafficking capital of the world. Also a bunch of Nazis. permalink award report block reply\nThe_Bo0ch -3 points 5 days ago Tuck the Qatar Cuck permalink award report block reply"}