{"id": "1ARK9irEIh", "contents": "1602 📊 posted 2 days ago by HappyFunBall 64 comments award share download report block\n64 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style OGpsywar 55 points 2 days ago What's my dad wearing .. Dunno, but I want one. 😎 permalink award report block reply BeauHD 35 points 2 days ago I wish I had a dad too permalink parent award report block reply Wehavelawsforareason 12 points 2 days ago Real question:\nI got a job offer for a job in Dallas. I looked at the demographics and it’s like 24.4% black there according to google. Anyone that can confirm this? I live in a deep blue state and was excited to escape, but I’d rather live in deep blue hell than 24.4% little Africa. permalink parent award report block reply Viewer01 20 points 2 days ago Jogger dodging is a southern staple sad enough to say. Most cities have a demographics map where you can pick a good neighborhood and avoid them for the most part. However you won’t avoid having to deal with them altogether in various public spaces. As they say never relax. Anyways Dallas ain’t bad. The worst spots are probably New Orleans and Atlanta and Memphis. Those are cities you’ll get murdered for your shoes. permalink parent award report block reply makersmarx 20 points 2 days ago Atlanta checking in. Two friends, both white, murdered by young blacks just in the last 10 years. Seperate murders that both started as a robbery permalink parent award report block reply view 2 more comments... GodIsPerfect 15 points 2 days ago Pick your house by driving distance and lowest crime areas. Speak to realtors. Texas is built on good relationships btw, so yeah, be good and good will find you and grow from there effort you put in. God bless. permalink parent award report block reply Overkillengine 7 points 2 days ago I would also inquire about average neighborhood income, property values, and distance from nearest public transport; as those are harder for proglodyte  ideologues to realize why you are asking about them and then try to lie about. You want somewhere with as little access to public transport as possible as that means even with lower class income levels, it forces the residents to behave well enough to afford personal vehicles. Which translates to lower crime rates. permalink parent award report block reply Johnkimble111 2 points 2 days ago Don’t blacks just lease vehicles then stop paying after a few months though? permalink parent award report block reply view 6 more comments... Hanging_Chad 2 points 2 days ago sounds like a lifehack that can save your life permalink parent award report block reply FancyNancy 4 points 2 days ago Yes that's accurate. But a lot of DFW is really nice and majority white. It depends on the area. Pick a nice suburb permalink parent award report block reply Remember_the_Alamo 3 points 2 days ago https://www.censusdots.com/?map=3.5,37.6750,-75.4048 permalink parent award report block reply load 2 more comments... BlackPiIIedMAGA 3 points 2 days ago It'll be okay, zoomer! permalink parent award report block reply MedicallyReddit 34 points 2 days ago Literally all you have to do is look around Rule #1 Avoid the groid. permalink award report block reply MAGA_mantis 31 points 2 days ago Never relax. permalink parent award report block reply realPhantomFuck 15 points 2 days ago It’ll save your life permalink parent award report block reply MedicallyReddit 11 points 2 days ago It does. Never turn your back to them, never stand near by train tracks either because those crazy fuckers push people onto them. Always be aware. permalink parent award report block reply BeauHD 12 points 2 days ago Always save for winter! permalink parent award report block reply guywholikesDjtof2024 10 points 2 days ago racist? THAT TERM MEANS \"SOMETHING PEOPLE WHO CELEBRATED KIRK'S DEATH\" WILL CALL YOU IF YOU HAVE EVEN 0.000001% DISAGREEMENT TO THEM. OR OPPOSITION TO THEIR ACTIONS, BELIEFS, OR STATUS. permalink parent award report block reply ubit 1 points 1 day ago White flight is not sustainable. They already spread into the suburbs. They were 12.3% in 2000 .. now close to 15% despite immigration. When they are the majority there will be nowhere to escape the ape. permalink parent award report block reply MAGA_mantis 25 points 2 days ago Pattern recognition. permalink award report block reply JackOfAllTirades 19 points 2 days ago I prefer \"pattern recognition\". permalink award report block reply IlhanOmarsFagBrother 5 points 1 day ago When pattern recognition meets self preservation permalink parent award report block reply ColonelKlink 19 points 2 days ago The same people who call people racist, don't understand per capita. permalink award report block reply MedicallyReddit 12 points 2 days ago They don’t even know what a woman is permalink parent award report block reply One-Man_Riot 13 points 2 days ago ULTRABASED. permalink award report block reply learntocode 7 points 2 days ago PER CAPITA ENJOYER permalink award report block reply TooBright 6 points 2 days ago I just seek tribalism equity for my own kind. permalink award report block reply Metal4Freedom 4 points 2 days ago Exactly. Every race is praised for unity and promotion of their own...except one. permalink parent award report block reply tiller 5 points 2 days ago Accusations of \"racism\" lost all meaning in May 2020 when BLM looted and burned every US city and we discovered AlPAC and Epstein were bribing and extorting most of our Congress. permalink award report block reply usernamenottaken 1 points 1 day ago And they're all still walking freely with pockets full of our stolen tax dollars. Criticize Israel and get the electric chair. permalink parent award report block reply ViagraFalls 5 points 2 days ago Racist is another way of saying realistic. Blacks are 13% and responsible for over 50% of murders. “OMG, that’s realistic!” permalink award report block reply Hanging_Chad 1 points 2 days ago what percentage are 17-35yo black males & what percentage of murders are they responsible for? permalink parent award report block reply ViagraFalls 2 points 2 days ago I don’t know, but you can look it up. permalink parent award report block reply Hanging_Chad 1 points 2 days ago Black males aged 17-35 make up approximately 3-4% of the U.S. population and are responsible for an estimated 40-45% of all murders in cases where the offender's race and age are known. related: https://www.facebook.com/story.php?story_fbid=1202770848088121 permalink parent award report block reply Metal4Freedom 2 points 2 days ago They also star in 60% of TV commercials and 90% of COPS episodes! permalink parent award report block reply Bretwith1T 4 points 2 days ago I prefer “Realist”. permalink award report block reply Twitter 3 points 2 days ago Everyone is racist it's in our DNA. permalink award report block reply roflcopt0rz_returns 3 points 2 days ago They’ll call you every ist-o-phobe in existence. But they can’t call you a liar. permalink award report block reply SuperHonkey 2 points 2 days ago Dad is a fkn CHAD 😎 permalink award report block reply redditadminssuckit 2 points 2 days ago Ratio Regurgitator permalink award report block reply TarHeelMAGA 2 points 2 days ago Like, 109 out of 195?  Statistics like that?  Am I doing this right? permalink award report block reply heavyD 2 points 2 days ago Racist? I prefer Realist. permalink award report block reply TerdBergler 2 points 2 days ago If crime is a race issue, democrat policies and the extenseive welfare in the cities is good. permalink award report block reply Sunnywindows 2 points 1 day ago Isn’t it nice that this country is finally having the “conversation about racism,” and white people are starting to wake up to the world’s efforts to eradicate them?  And white people are starting to speak out in defense of their race.  Love the shirt, but so few people will really understand what it means, and that’s the effect of dumbing down education for decades. permalink award report block reply 2Clutch 2 points 2 days ago \"Noticer\" permalink award report block reply DingleBalls 1 points 2 days ago 👌👍 permalink award report block reply WhoMeTwo 1 points 2 days ago HERO permalink award report block reply Dem_slayer 1 points 2 days ago Where do I buy this? permalink award report block reply CheeseAndOnion 1 points 2 days ago Where can i get that permalink award report block reply learntocode 1 points 2 days ago PATTERN RECOGNITION CLUB MEMBER permalink award report block reply Saltyminer11 1 points 1 day ago I prefer \"one who can deduce truth based on observation\" permalink award report block reply lul_cheto 1 points 2 days ago Glad someone finally learned how to use the warp tool permalink award report block reply VanDeKoik -4 points 2 days ago So retarded. People that use language like that would be the last ones to tolerate being said to be more likely to be molesting kids or trading naked pictures of them..... Because statistics and \"pattern recognition\". permalink award report block reply Kingoftheroad -1 points 2 days ago Isnt it that its still not white people who are more commonly the pedos if you equaled out the incidences relative to population mumbers? permalink parent award report block reply VanDeKoik -3 points 2 days ago Translation: when raw numbers fuck you, run screaming to \"per capita\" as an emotional support animal. So you agree that \"per capita\"  red states are more dangerous than blue ones when it comes to gun homicides? Because i have to knock down leftists weasles that pull the same shit. permalink parent award report block reply Kingoftheroad 2 points 2 days ago What??? Thats fucking retarded. Yeah if there is 90 blue eyed people and 10 green eyed people, it isnt fair to say blue eyed people are more dangerous because 11 of them are thieves permalink parent award report block reply Remember_the_Alamo 1 points 2 days ago Do you mean the south?  Who lives there? permalink parent award report block reply TruthyBrat 1 points 2 days ago Bingo. Leftists will not face up to the demographic facts on that one. permalink parent award report block reply VanDeKoik 0 points 1 day ago The point is the OP deliberately trying to play hard and fast with stats that are inconvenient to try to dress up something that makes his preferred demographic look bad, to try to make it like \"well per 1000 people, blah blah blah....those minorities!!!!!\" That isnt how it works, just like when leftists do it. permalink parent award report block reply\nOGpsywar 55 points 2 days ago What's my dad wearing .. Dunno, but I want one. 😎 permalink award report block reply BeauHD 35 points 2 days ago I wish I had a dad too permalink parent award report block reply Wehavelawsforareason 12 points 2 days ago Real question:\nI got a job offer for a job in Dallas. I looked at the demographics and it’s like 24.4% black there according to google. Anyone that can confirm this? I live in a deep blue state and was excited to escape, but I’d rather live in deep blue hell than 24.4% little Africa. permalink parent award report block reply Viewer01 20 points 2 days ago Jogger dodging is a southern staple sad enough to say. Most cities have a demographics map where you can pick a good neighborhood and avoid them for the most part. However you won’t avoid having to deal with them altogether in various public spaces. As they say never relax. Anyways Dallas ain’t bad. The worst spots are probably New Orleans and Atlanta and Memphis. Those are cities you’ll get murdered for your shoes. permalink parent award report block reply makersmarx 20 points 2 days ago Atlanta checking in. Two friends, both white, murdered by young blacks just in the last 10 years. Seperate murders that both started as a robbery permalink parent award report block reply view 2 more comments... GodIsPerfect 15 points 2 days ago Pick your house by driving distance and lowest crime areas. Speak to realtors. Texas is built on good relationships btw, so yeah, be good and good will find you and grow from there effort you put in. God bless. permalink parent award report block reply Overkillengine 7 points 2 days ago I would also inquire about average neighborhood income, property values, and distance from nearest public transport; as those are harder for proglodyte  ideologues to realize why you are asking about them and then try to lie about. You want somewhere with as little access to public transport as possible as that means even with lower class income levels, it forces the residents to behave well enough to afford personal vehicles. Which translates to lower crime rates. permalink parent award report block reply Johnkimble111 2 points 2 days ago Don’t blacks just lease vehicles then stop paying after a few months though? permalink parent award report block reply view 6 more comments... Hanging_Chad 2 points 2 days ago sounds like a lifehack that can save your life permalink parent award report block reply FancyNancy 4 points 2 days ago Yes that's accurate. But a lot of DFW is really nice and majority white. It depends on the area. Pick a nice suburb permalink parent award report block reply Remember_the_Alamo 3 points 2 days ago https://www.censusdots.com/?map=3.5,37.6750,-75.4048 permalink parent award report block reply load 2 more comments... BlackPiIIedMAGA 3 points 2 days ago It'll be okay, zoomer! permalink parent award report block reply\nBeauHD 35 points 2 days ago I wish I had a dad too permalink parent award report block reply Wehavelawsforareason 12 points 2 days ago Real question:\nI got a job offer for a job in Dallas. I looked at the demographics and it’s like 24.4% black there according to google. Anyone that can confirm this? I live in a deep blue state and was excited to escape, but I’d rather live in deep blue hell than 24.4% little Africa. permalink parent award report block reply Viewer01 20 points 2 days ago Jogger dodging is a southern staple sad enough to say. Most cities have a demographics map where you can pick a good neighborhood and avoid them for the most part. However you won’t avoid having to deal with them altogether in various public spaces. As they say never relax. Anyways Dallas ain’t bad. The worst spots are probably New Orleans and Atlanta and Memphis. Those are cities you’ll get murdered for your shoes. permalink parent award report block reply makersmarx 20 points 2 days ago Atlanta checking in. Two friends, both white, murdered by young blacks just in the last 10 years. Seperate murders that both started as a robbery permalink parent award report block reply view 2 more comments... GodIsPerfect 15 points 2 days ago Pick your house by driving distance and lowest crime areas. Speak to realtors. Texas is built on good relationships btw, so yeah, be good and good will find you and grow from there effort you put in. God bless. permalink parent award report block reply Overkillengine 7 points 2 days ago I would also inquire about average neighborhood income, property values, and distance from nearest public transport; as those are harder for proglodyte  ideologues to realize why you are asking about them and then try to lie about. You want somewhere with as little access to public transport as possible as that means even with lower class income levels, it forces the residents to behave well enough to afford personal vehicles. Which translates to lower crime rates. permalink parent award report block reply Johnkimble111 2 points 2 days ago Don’t blacks just lease vehicles then stop paying after a few months though? permalink parent award report block reply view 6 more comments... Hanging_Chad 2 points 2 days ago sounds like a lifehack that can save your life permalink parent award report block reply FancyNancy 4 points 2 days ago Yes that's accurate. But a lot of DFW is really nice and majority white. It depends on the area. Pick a nice suburb permalink parent award report block reply Remember_the_Alamo 3 points 2 days ago https://www.censusdots.com/?map=3.5,37.6750,-75.4048 permalink parent award report block reply load 2 more comments... BlackPiIIedMAGA 3 points 2 days ago It'll be okay, zoomer! permalink parent award report block reply\nWehavelawsforareason 12 points 2 days ago Real question:\nI got a job offer for a job in Dallas. I looked at the demographics and it’s like 24.4% black there according to google. Anyone that can confirm this? I live in a deep blue state and was excited to escape, but I’d rather live in deep blue hell than 24.4% little Africa. permalink parent award report block reply Viewer01 20 points 2 days ago Jogger dodging is a southern staple sad enough to say. Most cities have a demographics map where you can pick a good neighborhood and avoid them for the most part. However you won’t avoid having to deal with them altogether in various public spaces. As they say never relax. Anyways Dallas ain’t bad. The worst spots are probably New Orleans and Atlanta and Memphis. Those are cities you’ll get murdered for your shoes. permalink parent award report block reply makersmarx 20 points 2 days ago Atlanta checking in. Two friends, both white, murdered by young blacks just in the last 10 years. Seperate murders that both started as a robbery permalink parent award report block reply view 2 more comments... GodIsPerfect 15 points 2 days ago Pick your house by driving distance and lowest crime areas. Speak to realtors. Texas is built on good relationships btw, so yeah, be good and good will find you and grow from there effort you put in. God bless. permalink parent award report block reply Overkillengine 7 points 2 days ago I would also inquire about average neighborhood income, property values, and distance from nearest public transport; as those are harder for proglodyte  ideologues to realize why you are asking about them and then try to lie about. You want somewhere with as little access to public transport as possible as that means even with lower class income levels, it forces the residents to behave well enough to afford personal vehicles. Which translates to lower crime rates. permalink parent award report block reply Johnkimble111 2 points 2 days ago Don’t blacks just lease vehicles then stop paying after a few months though? permalink parent award report block reply view 6 more comments... Hanging_Chad 2 points 2 days ago sounds like a lifehack that can save your life permalink parent award report block reply FancyNancy 4 points 2 days ago Yes that's accurate. But a lot of DFW is really nice and majority white. It depends on the area. Pick a nice suburb permalink parent award report block reply Remember_the_Alamo 3 points 2 days ago https://www.censusdots.com/?map=3.5,37.6750,-75.4048 permalink parent award report block reply load 2 more comments...\nViewer01 20 points 2 days ago Jogger dodging is a southern staple sad enough to say. Most cities have a demographics map where you can pick a good neighborhood and avoid them for the most part. However you won’t avoid having to deal with them altogether in various public spaces. As they say never relax. Anyways Dallas ain’t bad. The worst spots are probably New Orleans and Atlanta and Memphis. Those are cities you’ll get murdered for your shoes. permalink parent award report block reply makersmarx 20 points 2 days ago Atlanta checking in. Two friends, both white, murdered by young blacks just in the last 10 years. Seperate murders that both started as a robbery permalink parent award report block reply view 2 more comments...\nmakersmarx 20 points 2 days ago Atlanta checking in. Two friends, both white, murdered by young blacks just in the last 10 years. Seperate murders that both started as a robbery permalink parent award report block reply view 2 more comments...\nGodIsPerfect 15 points 2 days ago Pick your house by driving distance and lowest crime areas. Speak to realtors. Texas is built on good relationships btw, so yeah, be good and good will find you and grow from there effort you put in. God bless. permalink parent award report block reply\nOverkillengine 7 points 2 days ago I would also inquire about average neighborhood income, property values, and distance from nearest public transport; as those are harder for proglodyte  ideologues to realize why you are asking about them and then try to lie about. You want somewhere with as little access to public transport as possible as that means even with lower class income levels, it forces the residents to behave well enough to afford personal vehicles. Which translates to lower crime rates. permalink parent award report block reply Johnkimble111 2 points 2 days ago Don’t blacks just lease vehicles then stop paying after a few months though? permalink parent award report block reply view 6 more comments... Hanging_Chad 2 points 2 days ago sounds like a lifehack that can save your life permalink parent award report block reply\nJohnkimble111 2 points 2 days ago Don’t blacks just lease vehicles then stop paying after a few months though? permalink parent award report block reply view 6 more comments...\nHanging_Chad 2 points 2 days ago sounds like a lifehack that can save your life permalink parent award report block reply\nFancyNancy 4 points 2 days ago Yes that's accurate. But a lot of DFW is really nice and majority white. It depends on the area. Pick a nice suburb permalink parent award report block reply\nRemember_the_Alamo 3 points 2 days ago https://www.censusdots.com/?map=3.5,37.6750,-75.4048 permalink parent award report block reply\nBlackPiIIedMAGA 3 points 2 days ago It'll be okay, zoomer! permalink parent award report block reply\nMedicallyReddit 34 points 2 days ago Literally all you have to do is look around Rule #1 Avoid the groid. permalink award report block reply MAGA_mantis 31 points 2 days ago Never relax. permalink parent award report block reply realPhantomFuck 15 points 2 days ago It’ll save your life permalink parent award report block reply MedicallyReddit 11 points 2 days ago It does. Never turn your back to them, never stand near by train tracks either because those crazy fuckers push people onto them. Always be aware. permalink parent award report block reply BeauHD 12 points 2 days ago Always save for winter! permalink parent award report block reply guywholikesDjtof2024 10 points 2 days ago racist? THAT TERM MEANS \"SOMETHING PEOPLE WHO CELEBRATED KIRK'S DEATH\" WILL CALL YOU IF YOU HAVE EVEN 0.000001% DISAGREEMENT TO THEM. OR OPPOSITION TO THEIR ACTIONS, BELIEFS, OR STATUS. permalink parent award report block reply ubit 1 points 1 day ago White flight is not sustainable. They already spread into the suburbs. They were 12.3% in 2000 .. now close to 15% despite immigration. When they are the majority there will be nowhere to escape the ape. permalink parent award report block reply\nMAGA_mantis 31 points 2 days ago Never relax. permalink parent award report block reply realPhantomFuck 15 points 2 days ago It’ll save your life permalink parent award report block reply MedicallyReddit 11 points 2 days ago It does. Never turn your back to them, never stand near by train tracks either because those crazy fuckers push people onto them. Always be aware. permalink parent award report block reply BeauHD 12 points 2 days ago Always save for winter! permalink parent award report block reply\nrealPhantomFuck 15 points 2 days ago It’ll save your life permalink parent award report block reply MedicallyReddit 11 points 2 days ago It does. Never turn your back to them, never stand near by train tracks either because those crazy fuckers push people onto them. Always be aware. permalink parent award report block reply\nMedicallyReddit 11 points 2 days ago It does. Never turn your back to them, never stand near by train tracks either because those crazy fuckers push people onto them. Always be aware. permalink parent award report block reply\nBeauHD 12 points 2 days ago Always save for winter! permalink parent award report block reply\nguywholikesDjtof2024 10 points 2 days ago racist? THAT TERM MEANS \"SOMETHING PEOPLE WHO CELEBRATED KIRK'S DEATH\" WILL CALL YOU IF YOU HAVE EVEN 0.000001% DISAGREEMENT TO THEM. OR OPPOSITION TO THEIR ACTIONS, BELIEFS, OR STATUS. permalink parent award report block reply\nubit 1 points 1 day ago White flight is not sustainable. They already spread into the suburbs. They were 12.3% in 2000 .. now close to 15% despite immigration. When they are the majority there will be nowhere to escape the ape. permalink parent award report block reply\nMAGA_mantis 25 points 2 days ago Pattern recognition. permalink award report block reply\nJackOfAllTirades 19 points 2 days ago I prefer \"pattern recognition\". permalink award report block reply IlhanOmarsFagBrother 5 points 1 day ago When pattern recognition meets self preservation permalink parent award report block reply\nIlhanOmarsFagBrother 5 points 1 day ago When pattern recognition meets self preservation permalink parent award report block reply\nColonelKlink 19 points 2 days ago The same people who call people racist, don't understand per capita. permalink award report block reply MedicallyReddit 12 points 2 days ago They don’t even know what a woman is permalink parent award report block reply\nMedicallyReddit 12 points 2 days ago They don’t even know what a woman is permalink parent award report block reply\nOne-Man_Riot 13 points 2 days ago ULTRABASED. permalink award report block reply\nlearntocode 7 points 2 days ago PER CAPITA ENJOYER permalink award report block reply\nTooBright 6 points 2 days ago I just seek tribalism equity for my own kind. permalink award report block reply Metal4Freedom 4 points 2 days ago Exactly. Every race is praised for unity and promotion of their own...except one. permalink parent award report block reply\nMetal4Freedom 4 points 2 days ago Exactly. Every race is praised for unity and promotion of their own...except one. permalink parent award report block reply\ntiller 5 points 2 days ago Accusations of \"racism\" lost all meaning in May 2020 when BLM looted and burned every US city and we discovered AlPAC and Epstein were bribing and extorting most of our Congress. permalink award report block reply usernamenottaken 1 points 1 day ago And they're all still walking freely with pockets full of our stolen tax dollars. Criticize Israel and get the electric chair. permalink parent award report block reply\nusernamenottaken 1 points 1 day ago And they're all still walking freely with pockets full of our stolen tax dollars. Criticize Israel and get the electric chair. permalink parent award report block reply\nViagraFalls 5 points 2 days ago Racist is another way of saying realistic. Blacks are 13% and responsible for over 50% of murders. “OMG, that’s realistic!” permalink award report block reply Hanging_Chad 1 points 2 days ago what percentage are 17-35yo black males & what percentage of murders are they responsible for? permalink parent award report block reply ViagraFalls 2 points 2 days ago I don’t know, but you can look it up. permalink parent award report block reply Hanging_Chad 1 points 2 days ago Black males aged 17-35 make up approximately 3-4% of the U.S. population and are responsible for an estimated 40-45% of all murders in cases where the offender's race and age are known. related: https://www.facebook.com/story.php?story_fbid=1202770848088121 permalink parent award report block reply Metal4Freedom 2 points 2 days ago They also star in 60% of TV commercials and 90% of COPS episodes! permalink parent award report block reply\nHanging_Chad 1 points 2 days ago what percentage are 17-35yo black males & what percentage of murders are they responsible for? permalink parent award report block reply ViagraFalls 2 points 2 days ago I don’t know, but you can look it up. permalink parent award report block reply Hanging_Chad 1 points 2 days ago Black males aged 17-35 make up approximately 3-4% of the U.S. population and are responsible for an estimated 40-45% of all murders in cases where the offender's race and age are known. related: https://www.facebook.com/story.php?story_fbid=1202770848088121 permalink parent award report block reply Metal4Freedom 2 points 2 days ago They also star in 60% of TV commercials and 90% of COPS episodes! permalink parent award report block reply\nViagraFalls 2 points 2 days ago I don’t know, but you can look it up. permalink parent award report block reply Hanging_Chad 1 points 2 days ago Black males aged 17-35 make up approximately 3-4% of the U.S. population and are responsible for an estimated 40-45% of all murders in cases where the offender's race and age are known. related: https://www.facebook.com/story.php?story_fbid=1202770848088121 permalink parent award report block reply Metal4Freedom 2 points 2 days ago They also star in 60% of TV commercials and 90% of COPS episodes! permalink parent award report block reply\nHanging_Chad 1 points 2 days ago Black males aged 17-35 make up approximately 3-4% of the U.S. population and are responsible for an estimated 40-45% of all murders in cases where the offender's race and age are known. related: https://www.facebook.com/story.php?story_fbid=1202770848088121 permalink parent award report block reply Metal4Freedom 2 points 2 days ago They also star in 60% of TV commercials and 90% of COPS episodes! permalink parent award report block reply\nMetal4Freedom 2 points 2 days ago They also star in 60% of TV commercials and 90% of COPS episodes! permalink parent award report block reply\nBretwith1T 4 points 2 days ago I prefer “Realist”. permalink award report block reply\nTwitter 3 points 2 days ago Everyone is racist it's in our DNA. permalink award report block reply\nroflcopt0rz_returns 3 points 2 days ago They’ll call you every ist-o-phobe in existence. But they can’t call you a liar. permalink award report block reply\nSuperHonkey 2 points 2 days ago Dad is a fkn CHAD 😎 permalink award report block reply\nredditadminssuckit 2 points 2 days ago Ratio Regurgitator permalink award report block reply\nTarHeelMAGA 2 points 2 days ago Like, 109 out of 195?  Statistics like that?  Am I doing this right? permalink award report block reply\nheavyD 2 points 2 days ago Racist? I prefer Realist. permalink award report block reply\nTerdBergler 2 points 2 days ago If crime is a race issue, democrat policies and the extenseive welfare in the cities is good. permalink award report block reply\nSunnywindows 2 points 1 day ago Isn’t it nice that this country is finally having the “conversation about racism,” and white people are starting to wake up to the world’s efforts to eradicate them?  And white people are starting to speak out in defense of their race.  Love the shirt, but so few people will really understand what it means, and that’s the effect of dumbing down education for decades. permalink award report block reply\n2Clutch 2 points 2 days ago \"Noticer\" permalink award report block reply\nDingleBalls 1 points 2 days ago 👌👍 permalink award report block reply\nWhoMeTwo 1 points 2 days ago HERO permalink award report block reply\nDem_slayer 1 points 2 days ago Where do I buy this? permalink award report block reply\nCheeseAndOnion 1 points 2 days ago Where can i get that permalink award report block reply\nlearntocode 1 points 2 days ago PATTERN RECOGNITION CLUB MEMBER permalink award report block reply\nSaltyminer11 1 points 1 day ago I prefer \"one who can deduce truth based on observation\" permalink award report block reply\nlul_cheto 1 points 2 days ago Glad someone finally learned how to use the warp tool permalink award report block reply\nVanDeKoik -4 points 2 days ago So retarded. People that use language like that would be the last ones to tolerate being said to be more likely to be molesting kids or trading naked pictures of them..... Because statistics and \"pattern recognition\". permalink award report block reply Kingoftheroad -1 points 2 days ago Isnt it that its still not white people who are more commonly the pedos if you equaled out the incidences relative to population mumbers? permalink parent award report block reply VanDeKoik -3 points 2 days ago Translation: when raw numbers fuck you, run screaming to \"per capita\" as an emotional support animal. So you agree that \"per capita\"  red states are more dangerous than blue ones when it comes to gun homicides? Because i have to knock down leftists weasles that pull the same shit. permalink parent award report block reply Kingoftheroad 2 points 2 days ago What??? Thats fucking retarded. Yeah if there is 90 blue eyed people and 10 green eyed people, it isnt fair to say blue eyed people are more dangerous because 11 of them are thieves permalink parent award report block reply Remember_the_Alamo 1 points 2 days ago Do you mean the south?  Who lives there? permalink parent award report block reply TruthyBrat 1 points 2 days ago Bingo. Leftists will not face up to the demographic facts on that one. permalink parent award report block reply VanDeKoik 0 points 1 day ago The point is the OP deliberately trying to play hard and fast with stats that are inconvenient to try to dress up something that makes his preferred demographic look bad, to try to make it like \"well per 1000 people, blah blah blah....those minorities!!!!!\" That isnt how it works, just like when leftists do it. permalink parent award report block reply\nKingoftheroad -1 points 2 days ago Isnt it that its still not white people who are more commonly the pedos if you equaled out the incidences relative to population mumbers? permalink parent award report block reply VanDeKoik -3 points 2 days ago Translation: when raw numbers fuck you, run screaming to \"per capita\" as an emotional support animal. So you agree that \"per capita\"  red states are more dangerous than blue ones when it comes to gun homicides? Because i have to knock down leftists weasles that pull the same shit. permalink parent award report block reply Kingoftheroad 2 points 2 days ago What??? Thats fucking retarded. Yeah if there is 90 blue eyed people and 10 green eyed people, it isnt fair to say blue eyed people are more dangerous because 11 of them are thieves permalink parent award report block reply Remember_the_Alamo 1 points 2 days ago Do you mean the south?  Who lives there? permalink parent award report block reply TruthyBrat 1 points 2 days ago Bingo. Leftists will not face up to the demographic facts on that one. permalink parent award report block reply VanDeKoik 0 points 1 day ago The point is the OP deliberately trying to play hard and fast with stats that are inconvenient to try to dress up something that makes his preferred demographic look bad, to try to make it like \"well per 1000 people, blah blah blah....those minorities!!!!!\" That isnt how it works, just like when leftists do it. permalink parent award report block reply\nVanDeKoik -3 points 2 days ago Translation: when raw numbers fuck you, run screaming to \"per capita\" as an emotional support animal. So you agree that \"per capita\"  red states are more dangerous than blue ones when it comes to gun homicides? Because i have to knock down leftists weasles that pull the same shit. permalink parent award report block reply Kingoftheroad 2 points 2 days ago What??? Thats fucking retarded. Yeah if there is 90 blue eyed people and 10 green eyed people, it isnt fair to say blue eyed people are more dangerous because 11 of them are thieves permalink parent award report block reply Remember_the_Alamo 1 points 2 days ago Do you mean the south?  Who lives there? permalink parent award report block reply TruthyBrat 1 points 2 days ago Bingo. Leftists will not face up to the demographic facts on that one. permalink parent award report block reply VanDeKoik 0 points 1 day ago The point is the OP deliberately trying to play hard and fast with stats that are inconvenient to try to dress up something that makes his preferred demographic look bad, to try to make it like \"well per 1000 people, blah blah blah....those minorities!!!!!\" That isnt how it works, just like when leftists do it. permalink parent award report block reply\nKingoftheroad 2 points 2 days ago What??? Thats fucking retarded. Yeah if there is 90 blue eyed people and 10 green eyed people, it isnt fair to say blue eyed people are more dangerous because 11 of them are thieves permalink parent award report block reply\nRemember_the_Alamo 1 points 2 days ago Do you mean the south?  Who lives there? permalink parent award report block reply TruthyBrat 1 points 2 days ago Bingo. Leftists will not face up to the demographic facts on that one. permalink parent award report block reply VanDeKoik 0 points 1 day ago The point is the OP deliberately trying to play hard and fast with stats that are inconvenient to try to dress up something that makes his preferred demographic look bad, to try to make it like \"well per 1000 people, blah blah blah....those minorities!!!!!\" That isnt how it works, just like when leftists do it. permalink parent award report block reply\nTruthyBrat 1 points 2 days ago Bingo. Leftists will not face up to the demographic facts on that one. permalink parent award report block reply\nVanDeKoik 0 points 1 day ago The point is the OP deliberately trying to play hard and fast with stats that are inconvenient to try to dress up something that makes his preferred demographic look bad, to try to make it like \"well per 1000 people, blah blah blah....those minorities!!!!!\" That isnt how it works, just like when leftists do it. permalink parent award report block reply"}