{"id": "1ARK0Ubd1Z", "contents": "353 We are not obligated to keep any foreigners here regardless of their citizenship status. I want to see conservatives start calling for deporting ANY immigrants who can't assimilate posted 7 days ago by MasterChief08 9 comments award share report block First test should be an English literacy test. We need to radicalize.\n9 comments Sort by Top Top New Worst Old Save Fuck_reddit34 9 points 7 days ago If they defrauded the gvt to get citizenship they just go. permalink award report block reply Elencher 5 points 7 days ago We need revocation of citizenship for all Jews Muslims and Hindus. permalink award report block reply Badfinz_FL 4 points 7 days ago I'll make it simple for you. If you hold any type of legal residence status other than naturalized citizen, and you are from a predominant muslim country you status is revoked and you get to go home. That fixes 90% of the problem right there. permalink award report block reply ACActual 4 points 7 days ago Just wrote here yesterday about this.  We need to move the overton window WAY right and yes it should start with the obvious.  Real Mass Deportations and Mass Denaturalizations.  Muslim?  Deport.  No more H1B's or Visas of any kind.   We need to make America Anti Foreign permalink award report block reply YaharaRiver 4 points 7 days ago This is a time-tested action. It is called EXILE, sometimes BANISHMENT. We should return to it you know, since we’re going back to the 7th century and all. permalink award report block reply magnokor 3 points 7 days ago Make a list of enemy countries. Everyone from there is banned. There are around 150 enemy countries. Might push that up to 170. We cannot go to all these evil countries and do anything, yet they can decide to move here, sue us, steal from us, then bring over millions of their relatives and rule over us. The Alien Enemies Act of 1798 and the Immigration Act of 1907 from President Theodore Roosevelt and the advice and laws suggested by U.S. Chief Justice  John Jay would fix most of the problems today. As surrendering countries like France and Canada have shown, there is a neverending supply of Third Worlders who hate the locals and by weight of numbers they will take everything, if not stopped and banned completely. permalink award report block reply Wizard_Glick 2 points 7 days ago That, or hang them... permalink award report block reply RedPillosopher1776 2 points 7 days ago We need to start pushing out non Whites, it really is just that simple. permalink award report block reply KennyUS 1 points 7 days ago With that litmus test 90% of high school graduates would be deported! permalink award report block reply\nFuck_reddit34 9 points 7 days ago If they defrauded the gvt to get citizenship they just go. permalink award report block reply\nElencher 5 points 7 days ago We need revocation of citizenship for all Jews Muslims and Hindus. permalink award report block reply\nBadfinz_FL 4 points 7 days ago I'll make it simple for you. If you hold any type of legal residence status other than naturalized citizen, and you are from a predominant muslim country you status is revoked and you get to go home. That fixes 90% of the problem right there. permalink award report block reply\nACActual 4 points 7 days ago Just wrote here yesterday about this.  We need to move the overton window WAY right and yes it should start with the obvious.  Real Mass Deportations and Mass Denaturalizations.  Muslim?  Deport.  No more H1B's or Visas of any kind.   We need to make America Anti Foreign permalink award report block reply\nYaharaRiver 4 points 7 days ago This is a time-tested action. It is called EXILE, sometimes BANISHMENT. We should return to it you know, since we’re going back to the 7th century and all. permalink award report block reply\nmagnokor 3 points 7 days ago Make a list of enemy countries. Everyone from there is banned. There are around 150 enemy countries. Might push that up to 170. We cannot go to all these evil countries and do anything, yet they can decide to move here, sue us, steal from us, then bring over millions of their relatives and rule over us. The Alien Enemies Act of 1798 and the Immigration Act of 1907 from President Theodore Roosevelt and the advice and laws suggested by U.S. Chief Justice  John Jay would fix most of the problems today. As surrendering countries like France and Canada have shown, there is a neverending supply of Third Worlders who hate the locals and by weight of numbers they will take everything, if not stopped and banned completely. permalink award report block reply\nWizard_Glick 2 points 7 days ago That, or hang them... permalink award report block reply\nRedPillosopher1776 2 points 7 days ago We need to start pushing out non Whites, it really is just that simple. permalink award report block reply\nKennyUS 1 points 7 days ago With that litmus test 90% of high school graduates would be deported! permalink award report block reply"}