{"id": "1ARK0Ubu4X", "contents": "1059 ⚕️ NEW YORK CITY - At least 5 firefighters injured after car EXPLOSION in The Bronx, reports say... 🌶️ 🌶️ SPICY 🌶️ 🌶️ posted 7 days ago by TheRedPilledArtist 95 comments award share download report block\n95 comments Sort by Top Top New Worst Old Save Around the Web Natural Way to Regrow Hair on a Bald Head HaloGrow GunsWithGooglyEyes 134 points 7 days ago Oh look, it's beginning already! That was fast... permalink award report block reply BeauHD 89 points 7 days ago That's what happens when muzzies take over. Every. Single. Time. permalink parent award report block reply TooTrue-translation 46 points 7 days ago RELIGION OF PEACE permalink parent award report block reply PhantomShield72 19 points 7 days ago *Peace sold separately and not available in all areas.  If you experience a period of peace lasting longer than 4 days, consult your local Imam.  Seeking peace while Christian, Hindu, Seikh, or even Muslim may be hazardous to your health.  Enjoy your peace, results may vary. permalink parent award report block reply Trump454748 7 points 7 days ago Kek 🤣 permalink parent award report block reply Transparency 6 points 7 days ago 👆Golden☝ 🤣🤣🤣 permalink parent award report block reply chahn1138 2 points 6 days ago WINNER permalink parent award report block reply imnotdeadyet 17 points 7 days ago It's Trump's fault! - MSM permalink parent award report block reply TooTrue-translation 10 points 7 days ago He is so...ORANGE. permalink parent award report block reply Shimmy_Shanahan 11 points 7 days ago Pieces* permalink parent award report block reply Oldman6541E5 -13 points 7 days ago Why do you not just go waste those GPU cycles on reddit, son? permalink parent award report block reply YT45 6 points 7 days ago Religion of pieces. permalink parent award report block reply ColonelKlink 28 points 7 days ago They blow up so fast. permalink parent award report block reply Combat_Hamster 3 points 6 days ago StOp MaKiNg ExPlOsIvE cOmMeNtS! permalink parent award report block reply BlackPilledMAGA 8 points 7 days ago Jihadi celebration night permalink parent award report block reply 1_Badcop 7 points 7 days ago Wow! I thought they'd wait at least until Ramadan. permalink parent award report block reply Moebius 5 points 7 days ago The Aljenad Islamic Center is at or near 955 Westchester Ave Bronx permalink parent award report block reply patrioticwinning3 1 points 7 days ago So, false flag? permalink parent award report block reply Moebius 2 points 7 days ago More likely some homeless guy set fire to a vehicle he didn't like...or some incompetent contractor forgot to turn the propane off on his roofing truck... ...but it'll get exploited for political points you bet... permalink parent award report block reply blueeyephoto 50 points 7 days ago Muslim Celebrations of peace permalink award report block reply peterthegreen 20 points 7 days ago Mostly peaceful... permalink parent award report block reply Konsaki 16 points 7 days ago People are in pieces permalink parent award report block reply Hanging_Chad 4 points 7 days ago RIP people pieces permalink parent award report block reply LORDFALCONE 1 points 7 days ago YN activity permalink parent award report block reply magapatriot_pa 38 points 7 days ago The mayor is too busy doing one of his 5 prayers a day to some pedophile, they're on their own permalink award report block reply Moose_Antlers 12 points 7 days ago I'm not sure this guy's ego allows him to submit like that. He wants the power. The religion is an excuse and a vehicle. Nothing about this man is genuine. Nothing. permalink parent award report block reply trumpORbust 3 points 7 days ago He must two the prayer line or his own will take him out -- they can't risk non compliance permalink parent award report block reply Nomad899 4 points 7 days ago He prays between little boys and a stiff drink…MINO permalink parent award report block reply Hanging_Chad 26 points 7 days ago thanks Mamdani permalink award report block reply TrumpsAmericaForMe 11 points 7 days ago If this asshole survives a month it will surprise me.  Nutcases are likely to figure out that this guy is pure poison! permalink parent award report block reply Sythen 3 points 7 days ago He will shut down the police, the nut cases support him permalink parent award report block reply zooty 4 points 7 days ago The buses will run faster. And the residents too. permalink parent award report block reply AssPhixEAtion627 4 points 7 days ago Buses will be more inclined to be blown up, residents too. permalink parent award report block reply Halfstache 25 points 7 days ago Part and parcel. permalink award report block reply OutlawPurpleHairDye 21 points 7 days ago You're not living in a vibrant enough area unless you have at least one car bombing per month.  Extra points for machete attacks. permalink award report block reply Krat 9 points 7 days ago Whats the bus stabbing quota ?? permalink parent award report block reply ColonelKlink 7 points 7 days ago I grew up in a very vibrant area. I will never return. permalink parent award report block reply Hanging_Chad 17 points 7 days ago FDNY chief resigned? permalink award report block reply 556x45mm 26 points 7 days ago Yes, the fire chief resigned I wonder who will be the new Fire Imam? permalink parent award report block reply stjimmy92 2 points 7 days ago Ngl Fire Imam sounds oddly  badass permalink parent award report block reply BrennansMangina 7 points 7 days ago Fights fire with suicide bombers permalink parent award report block reply 556x45mm 4 points 7 days ago Funny thing is, explosions take away oxygen and can quench fires permalink parent award report block reply Moebius 12 points 7 days ago Resigned last night... permalink parent award report block reply thisisatestof2 4 points 7 days ago Honestly, smart move. He knew he was gonna get fired anyway might as well get out on your own terms. permalink parent award report block reply zooty 2 points 7 days ago I would have thought that was worthy of a sticky. permalink parent award report block reply bumpman 8 points 7 days ago Was it because of the election? permalink parent award report block reply Hanging_Chad 6 points 7 days ago yeah permalink parent award report block reply thisisatestof2 2 points 7 days ago Honestly, I don’t really blame him. He was gonna get fired anyway and replaced. permalink parent award report block reply TheRedPilledArtist OP 14 points 7 days ago SOURCE: https://x.com/AZ_Intel_/status/1986247610294779978 permalink award report block reply SavingPrivateGrace 12 points 7 days ago That was a Roofing van which was on fire, then it sent an explosion blast.  There's clearer video in this article: https://bnonews.com/index.php/2025/11/5-firefighters-injured-in-vehicle-explosion-in-the-bronx-nyc/ permalink parent award report block reply ShadowInv 5 points 7 days ago Propane tank used for flat commercial roofs? permalink parent award report block reply MrMcGreenGenes 11 points 7 days ago Pictures with a Play button should not be fucking stickied. permalink award report block reply TrancePhreak 4 points 7 days ago Tag u/-f-b-i- with your thoughts, or perhaps u/RuprechtThaMonkeyBoy I'm not sure who is taking sticky complaints these days. permalink parent award report block reply MrMcGreenGenes 2 points 7 days ago Just venting, lol. Not serious enough to pursue like that. permalink parent award report block reply -f-b-i- 7 points 7 days ago 🤷‍♂️ permalink parent award report block reply Bairt 8 points 7 days ago Part and parcel - Sadiq Khan permalink award report block reply Dev404 7 points 7 days ago The muslims aren't wasting any time. Have fun, NY. You deserve it. permalink award report block reply StrongIsland 5 points 7 days ago We don’t deserve any of this hasbara fake sand war drama! We’re Americans! This Jew/Muslim shit needs to exit. https://patriots.win/p/1ARK0TSwzI/day-one-of-the-jussie-smollettin/c/ permalink parent award report block reply yodayoda 5 points 7 days ago and so it begins... permalink award report block reply fluffykitten 4 points 7 days ago how many social workers does it take to put out a car fire? permalink award report block reply zooty 1 points 7 days ago I support finding out. permalink parent award report block reply Citizen_Bob 4 points 7 days ago so it begins permalink award report block reply hillaryforprison 4 points 7 days ago If the video doesn't play, click HARDER, like REALLY hard. I broke my $2000 computer trying to get it to play. Now I have no SNAP benefits and will be deported, thanks a lot. permalink award report block reply TheChillingEffect 4 points 7 days ago I figured it would take until January to start the American Bolshevik movement.  Boy, was I wrong... permalink award report block reply TrancePhreak 3 points 7 days ago Classic muzzie celebration permalink award report block reply Moebius 3 points 7 days ago It's the Bronx.  One of many multi-cultural 'trailer parks' you'll find there.  Crime is high. If you're one of 'em social justice types, however, you'll love this place. Lotsa opportunities to \"share your wealth\" and otherwise prove your post-racial bona fides! ...if you survive. permalink award report block reply Overtaxed 3 points 7 days ago They're not wasting any time. permalink award report block reply ACActual 3 points 7 days ago Former firefighter here.  Looks like a Propane tank explosion.  Fireman worst nightmare.   Propane expands at a rate of 270 times.   That's a huge area.  I saw a Propane explosion lift an entire building several feet off its foundation permalink award report block reply BasedMillennial 3 points 7 days ago Damn that was quick. Guess they got the signal. permalink award report block reply brassmule 3 points 7 days ago Multiple cars and trash set on fire. Police and firefighters lured in.  Then an explosion. Cars just don't explode like that. permalink award report block reply vsekvsek 3 points 7 days ago Aloha snackbar permalink award report block reply CovfefeVideo 3 points 7 days ago Well, that escalated quickly. permalink award report block reply Marina 3 points 7 days ago That didn’t take long permalink award report block reply LawyersPlayDota 2 points 7 days ago I didn't expect it to become a muslim country this fast, lol. permalink award report block reply SoulSnipper 2 points 7 days ago Enjoy your diversity NY permalink award report block reply PatriotSkorzeny 2 points 7 days ago SVBIED’s. This is what law enforcement wants. They wanted terror. They got it. Stew in it. 🤣🤡 permalink award report block reply PunishedSnek 2 points 7 days ago Maybe they were just blowing up a car in celebration. Come on MSNBC. Say the line. permalink award report block reply jimboonie 2 points 7 days ago That's just how they celebrate! It's all out of love. permalink award report block reply BoltCarrierGroup 2 points 7 days ago Wow terrorist already enabled his comrades permalink award report block reply sir_rockness 1 points 6 days ago DURKA DURKA MOHAMMED JIHAD permalink award report block reply FrankDuncan 1 points 7 days ago ali snackbar!!! permalink award report block reply terri1143 1 points 6 days ago Everyone who voted for him knew this! permalink award report block reply CheeseAndOnion 1 points 7 days ago The jahad of peace begins permalink award report block reply Veritas264 1 points 7 days ago Never thought I'd have to use a mirror stick to check my car in the USA permalink award report block reply LakeAmeritaga 1 points 7 days ago why does election season = explosion season? permalink award report block reply FBIsurveillance 1 points 7 days ago The honor killings have begun permalink award report block reply TeeRoyAL 1 points 7 days ago geeze, after looking at the stats, when folks say they from the bronx or queens, i now first think there is a 75% chance they on the food stamps permalink award report block reply Liberals_R_Idiots 1 points 7 days ago (Shocked face) permalink award report block reply JayKay1776 1 points 6 days ago So let me get this straight New York is next a Muslim communist and then two days later car bombs start going off I'm sure that's just coincidence. permalink award report block reply MedicallyReddit 1 points 7 days ago Aloha snackbar? permalink award report block reply Chickensaurus 1 points 7 days ago So? permalink award report block reply FUCK_TYLER 1 points 7 days ago why is anybody surprised? permalink award report block reply Nomad899 1 points 7 days ago Every day for a year things exploded near me just before or just after prayer time….it was almost clockwork, lesson learned permalink award report block reply SimaYi 1 points 6 days ago Who cares? This is local news from enemy occupied territory. You're all surprised that a foreigner won, not realizing that NYC is a foreign country. You all better wake the fuck up. The country is being conquered right in front of you and boomer Trump isn't going to do shit about it. permalink award report block reply knnbccb 1 points 7 days ago Allahu akbar! permalink award report block reply Peekov3 0 points 7 days ago Lmao get fucked permalink award report block reply SurfandTurf -9 points 7 days ago ITS MUSLIMSSSSS!!!!!!!! you fags are so predictable. permalink award report block reply ILoveGoatFucking 3 points 7 days ago Comment removed upon the user being banned. permalink award report block reply\nGunsWithGooglyEyes 134 points 7 days ago Oh look, it's beginning already! That was fast... permalink award report block reply BeauHD 89 points 7 days ago That's what happens when muzzies take over. Every. Single. Time. permalink parent award report block reply TooTrue-translation 46 points 7 days ago RELIGION OF PEACE permalink parent award report block reply PhantomShield72 19 points 7 days ago *Peace sold separately and not available in all areas.  If you experience a period of peace lasting longer than 4 days, consult your local Imam.  Seeking peace while Christian, Hindu, Seikh, or even Muslim may be hazardous to your health.  Enjoy your peace, results may vary. permalink parent award report block reply Trump454748 7 points 7 days ago Kek 🤣 permalink parent award report block reply Transparency 6 points 7 days ago 👆Golden☝ 🤣🤣🤣 permalink parent award report block reply chahn1138 2 points 6 days ago WINNER permalink parent award report block reply imnotdeadyet 17 points 7 days ago It's Trump's fault! - MSM permalink parent award report block reply TooTrue-translation 10 points 7 days ago He is so...ORANGE. permalink parent award report block reply Shimmy_Shanahan 11 points 7 days ago Pieces* permalink parent award report block reply Oldman6541E5 -13 points 7 days ago Why do you not just go waste those GPU cycles on reddit, son? permalink parent award report block reply YT45 6 points 7 days ago Religion of pieces. permalink parent award report block reply ColonelKlink 28 points 7 days ago They blow up so fast. permalink parent award report block reply Combat_Hamster 3 points 6 days ago StOp MaKiNg ExPlOsIvE cOmMeNtS! permalink parent award report block reply BlackPilledMAGA 8 points 7 days ago Jihadi celebration night permalink parent award report block reply 1_Badcop 7 points 7 days ago Wow! I thought they'd wait at least until Ramadan. permalink parent award report block reply Moebius 5 points 7 days ago The Aljenad Islamic Center is at or near 955 Westchester Ave Bronx permalink parent award report block reply patrioticwinning3 1 points 7 days ago So, false flag? permalink parent award report block reply Moebius 2 points 7 days ago More likely some homeless guy set fire to a vehicle he didn't like...or some incompetent contractor forgot to turn the propane off on his roofing truck... ...but it'll get exploited for political points you bet... permalink parent award report block reply\nBeauHD 89 points 7 days ago That's what happens when muzzies take over. Every. Single. Time. permalink parent award report block reply TooTrue-translation 46 points 7 days ago RELIGION OF PEACE permalink parent award report block reply PhantomShield72 19 points 7 days ago *Peace sold separately and not available in all areas.  If you experience a period of peace lasting longer than 4 days, consult your local Imam.  Seeking peace while Christian, Hindu, Seikh, or even Muslim may be hazardous to your health.  Enjoy your peace, results may vary. permalink parent award report block reply Trump454748 7 points 7 days ago Kek 🤣 permalink parent award report block reply Transparency 6 points 7 days ago 👆Golden☝ 🤣🤣🤣 permalink parent award report block reply chahn1138 2 points 6 days ago WINNER permalink parent award report block reply imnotdeadyet 17 points 7 days ago It's Trump's fault! - MSM permalink parent award report block reply TooTrue-translation 10 points 7 days ago He is so...ORANGE. permalink parent award report block reply Shimmy_Shanahan 11 points 7 days ago Pieces* permalink parent award report block reply Oldman6541E5 -13 points 7 days ago Why do you not just go waste those GPU cycles on reddit, son? permalink parent award report block reply YT45 6 points 7 days ago Religion of pieces. permalink parent award report block reply\nTooTrue-translation 46 points 7 days ago RELIGION OF PEACE permalink parent award report block reply PhantomShield72 19 points 7 days ago *Peace sold separately and not available in all areas.  If you experience a period of peace lasting longer than 4 days, consult your local Imam.  Seeking peace while Christian, Hindu, Seikh, or even Muslim may be hazardous to your health.  Enjoy your peace, results may vary. permalink parent award report block reply Trump454748 7 points 7 days ago Kek 🤣 permalink parent award report block reply Transparency 6 points 7 days ago 👆Golden☝ 🤣🤣🤣 permalink parent award report block reply chahn1138 2 points 6 days ago WINNER permalink parent award report block reply imnotdeadyet 17 points 7 days ago It's Trump's fault! - MSM permalink parent award report block reply TooTrue-translation 10 points 7 days ago He is so...ORANGE. permalink parent award report block reply Shimmy_Shanahan 11 points 7 days ago Pieces* permalink parent award report block reply Oldman6541E5 -13 points 7 days ago Why do you not just go waste those GPU cycles on reddit, son? permalink parent award report block reply YT45 6 points 7 days ago Religion of pieces. permalink parent award report block reply\nPhantomShield72 19 points 7 days ago *Peace sold separately and not available in all areas.  If you experience a period of peace lasting longer than 4 days, consult your local Imam.  Seeking peace while Christian, Hindu, Seikh, or even Muslim may be hazardous to your health.  Enjoy your peace, results may vary. permalink parent award report block reply Trump454748 7 points 7 days ago Kek 🤣 permalink parent award report block reply Transparency 6 points 7 days ago 👆Golden☝ 🤣🤣🤣 permalink parent award report block reply chahn1138 2 points 6 days ago WINNER permalink parent award report block reply\nTrump454748 7 points 7 days ago Kek 🤣 permalink parent award report block reply\nTransparency 6 points 7 days ago 👆Golden☝ 🤣🤣🤣 permalink parent award report block reply\nchahn1138 2 points 6 days ago WINNER permalink parent award report block reply\nimnotdeadyet 17 points 7 days ago It's Trump's fault! - MSM permalink parent award report block reply TooTrue-translation 10 points 7 days ago He is so...ORANGE. permalink parent award report block reply\nTooTrue-translation 10 points 7 days ago He is so...ORANGE. permalink parent award report block reply\nShimmy_Shanahan 11 points 7 days ago Pieces* permalink parent award report block reply Oldman6541E5 -13 points 7 days ago Why do you not just go waste those GPU cycles on reddit, son? permalink parent award report block reply\nOldman6541E5 -13 points 7 days ago Why do you not just go waste those GPU cycles on reddit, son? permalink parent award report block reply\nYT45 6 points 7 days ago Religion of pieces. permalink parent award report block reply\nColonelKlink 28 points 7 days ago They blow up so fast. permalink parent award report block reply Combat_Hamster 3 points 6 days ago StOp MaKiNg ExPlOsIvE cOmMeNtS! permalink parent award report block reply\nCombat_Hamster 3 points 6 days ago StOp MaKiNg ExPlOsIvE cOmMeNtS! permalink parent award report block reply\nBlackPilledMAGA 8 points 7 days ago Jihadi celebration night permalink parent award report block reply\n1_Badcop 7 points 7 days ago Wow! I thought they'd wait at least until Ramadan. permalink parent award report block reply\nMoebius 5 points 7 days ago The Aljenad Islamic Center is at or near 955 Westchester Ave Bronx permalink parent award report block reply patrioticwinning3 1 points 7 days ago So, false flag? permalink parent award report block reply Moebius 2 points 7 days ago More likely some homeless guy set fire to a vehicle he didn't like...or some incompetent contractor forgot to turn the propane off on his roofing truck... ...but it'll get exploited for political points you bet... permalink parent award report block reply\npatrioticwinning3 1 points 7 days ago So, false flag? permalink parent award report block reply Moebius 2 points 7 days ago More likely some homeless guy set fire to a vehicle he didn't like...or some incompetent contractor forgot to turn the propane off on his roofing truck... ...but it'll get exploited for political points you bet... permalink parent award report block reply\nMoebius 2 points 7 days ago More likely some homeless guy set fire to a vehicle he didn't like...or some incompetent contractor forgot to turn the propane off on his roofing truck... ...but it'll get exploited for political points you bet... permalink parent award report block reply\nblueeyephoto 50 points 7 days ago Muslim Celebrations of peace permalink award report block reply peterthegreen 20 points 7 days ago Mostly peaceful... permalink parent award report block reply Konsaki 16 points 7 days ago People are in pieces permalink parent award report block reply Hanging_Chad 4 points 7 days ago RIP people pieces permalink parent award report block reply LORDFALCONE 1 points 7 days ago YN activity permalink parent award report block reply\npeterthegreen 20 points 7 days ago Mostly peaceful... permalink parent award report block reply Konsaki 16 points 7 days ago People are in pieces permalink parent award report block reply Hanging_Chad 4 points 7 days ago RIP people pieces permalink parent award report block reply\nKonsaki 16 points 7 days ago People are in pieces permalink parent award report block reply Hanging_Chad 4 points 7 days ago RIP people pieces permalink parent award report block reply\nHanging_Chad 4 points 7 days ago RIP people pieces permalink parent award report block reply\nLORDFALCONE 1 points 7 days ago YN activity permalink parent award report block reply\nmagapatriot_pa 38 points 7 days ago The mayor is too busy doing one of his 5 prayers a day to some pedophile, they're on their own permalink award report block reply Moose_Antlers 12 points 7 days ago I'm not sure this guy's ego allows him to submit like that. He wants the power. The religion is an excuse and a vehicle. Nothing about this man is genuine. Nothing. permalink parent award report block reply trumpORbust 3 points 7 days ago He must two the prayer line or his own will take him out -- they can't risk non compliance permalink parent award report block reply Nomad899 4 points 7 days ago He prays between little boys and a stiff drink…MINO permalink parent award report block reply\nMoose_Antlers 12 points 7 days ago I'm not sure this guy's ego allows him to submit like that. He wants the power. The religion is an excuse and a vehicle. Nothing about this man is genuine. Nothing. permalink parent award report block reply trumpORbust 3 points 7 days ago He must two the prayer line or his own will take him out -- they can't risk non compliance permalink parent award report block reply\ntrumpORbust 3 points 7 days ago He must two the prayer line or his own will take him out -- they can't risk non compliance permalink parent award report block reply\nNomad899 4 points 7 days ago He prays between little boys and a stiff drink…MINO permalink parent award report block reply\nHanging_Chad 26 points 7 days ago thanks Mamdani permalink award report block reply TrumpsAmericaForMe 11 points 7 days ago If this asshole survives a month it will surprise me.  Nutcases are likely to figure out that this guy is pure poison! permalink parent award report block reply Sythen 3 points 7 days ago He will shut down the police, the nut cases support him permalink parent award report block reply zooty 4 points 7 days ago The buses will run faster. And the residents too. permalink parent award report block reply AssPhixEAtion627 4 points 7 days ago Buses will be more inclined to be blown up, residents too. permalink parent award report block reply\nTrumpsAmericaForMe 11 points 7 days ago If this asshole survives a month it will surprise me.  Nutcases are likely to figure out that this guy is pure poison! permalink parent award report block reply Sythen 3 points 7 days ago He will shut down the police, the nut cases support him permalink parent award report block reply\nSythen 3 points 7 days ago He will shut down the police, the nut cases support him permalink parent award report block reply\nzooty 4 points 7 days ago The buses will run faster. And the residents too. permalink parent award report block reply AssPhixEAtion627 4 points 7 days ago Buses will be more inclined to be blown up, residents too. permalink parent award report block reply\nAssPhixEAtion627 4 points 7 days ago Buses will be more inclined to be blown up, residents too. permalink parent award report block reply\nHalfstache 25 points 7 days ago Part and parcel. permalink award report block reply\nOutlawPurpleHairDye 21 points 7 days ago You're not living in a vibrant enough area unless you have at least one car bombing per month.  Extra points for machete attacks. permalink award report block reply Krat 9 points 7 days ago Whats the bus stabbing quota ?? permalink parent award report block reply ColonelKlink 7 points 7 days ago I grew up in a very vibrant area. I will never return. permalink parent award report block reply\nKrat 9 points 7 days ago Whats the bus stabbing quota ?? permalink parent award report block reply\nColonelKlink 7 points 7 days ago I grew up in a very vibrant area. I will never return. permalink parent award report block reply\nHanging_Chad 17 points 7 days ago FDNY chief resigned? permalink award report block reply 556x45mm 26 points 7 days ago Yes, the fire chief resigned I wonder who will be the new Fire Imam? permalink parent award report block reply stjimmy92 2 points 7 days ago Ngl Fire Imam sounds oddly  badass permalink parent award report block reply BrennansMangina 7 points 7 days ago Fights fire with suicide bombers permalink parent award report block reply 556x45mm 4 points 7 days ago Funny thing is, explosions take away oxygen and can quench fires permalink parent award report block reply Moebius 12 points 7 days ago Resigned last night... permalink parent award report block reply thisisatestof2 4 points 7 days ago Honestly, smart move. He knew he was gonna get fired anyway might as well get out on your own terms. permalink parent award report block reply zooty 2 points 7 days ago I would have thought that was worthy of a sticky. permalink parent award report block reply bumpman 8 points 7 days ago Was it because of the election? permalink parent award report block reply Hanging_Chad 6 points 7 days ago yeah permalink parent award report block reply thisisatestof2 2 points 7 days ago Honestly, I don’t really blame him. He was gonna get fired anyway and replaced. permalink parent award report block reply\n556x45mm 26 points 7 days ago Yes, the fire chief resigned I wonder who will be the new Fire Imam? permalink parent award report block reply stjimmy92 2 points 7 days ago Ngl Fire Imam sounds oddly  badass permalink parent award report block reply BrennansMangina 7 points 7 days ago Fights fire with suicide bombers permalink parent award report block reply 556x45mm 4 points 7 days ago Funny thing is, explosions take away oxygen and can quench fires permalink parent award report block reply\nstjimmy92 2 points 7 days ago Ngl Fire Imam sounds oddly  badass permalink parent award report block reply BrennansMangina 7 points 7 days ago Fights fire with suicide bombers permalink parent award report block reply 556x45mm 4 points 7 days ago Funny thing is, explosions take away oxygen and can quench fires permalink parent award report block reply\nBrennansMangina 7 points 7 days ago Fights fire with suicide bombers permalink parent award report block reply 556x45mm 4 points 7 days ago Funny thing is, explosions take away oxygen and can quench fires permalink parent award report block reply\n556x45mm 4 points 7 days ago Funny thing is, explosions take away oxygen and can quench fires permalink parent award report block reply\nMoebius 12 points 7 days ago Resigned last night... permalink parent award report block reply thisisatestof2 4 points 7 days ago Honestly, smart move. He knew he was gonna get fired anyway might as well get out on your own terms. permalink parent award report block reply zooty 2 points 7 days ago I would have thought that was worthy of a sticky. permalink parent award report block reply\nthisisatestof2 4 points 7 days ago Honestly, smart move. He knew he was gonna get fired anyway might as well get out on your own terms. permalink parent award report block reply\nzooty 2 points 7 days ago I would have thought that was worthy of a sticky. permalink parent award report block reply\nbumpman 8 points 7 days ago Was it because of the election? permalink parent award report block reply Hanging_Chad 6 points 7 days ago yeah permalink parent award report block reply\nHanging_Chad 6 points 7 days ago yeah permalink parent award report block reply\nthisisatestof2 2 points 7 days ago Honestly, I don’t really blame him. He was gonna get fired anyway and replaced. permalink parent award report block reply\nTheRedPilledArtist OP 14 points 7 days ago SOURCE: https://x.com/AZ_Intel_/status/1986247610294779978 permalink award report block reply SavingPrivateGrace 12 points 7 days ago That was a Roofing van which was on fire, then it sent an explosion blast.  There's clearer video in this article: https://bnonews.com/index.php/2025/11/5-firefighters-injured-in-vehicle-explosion-in-the-bronx-nyc/ permalink parent award report block reply ShadowInv 5 points 7 days ago Propane tank used for flat commercial roofs? permalink parent award report block reply\nSavingPrivateGrace 12 points 7 days ago That was a Roofing van which was on fire, then it sent an explosion blast.  There's clearer video in this article: https://bnonews.com/index.php/2025/11/5-firefighters-injured-in-vehicle-explosion-in-the-bronx-nyc/ permalink parent award report block reply ShadowInv 5 points 7 days ago Propane tank used for flat commercial roofs? permalink parent award report block reply\nShadowInv 5 points 7 days ago Propane tank used for flat commercial roofs? permalink parent award report block reply\nMrMcGreenGenes 11 points 7 days ago Pictures with a Play button should not be fucking stickied. permalink award report block reply TrancePhreak 4 points 7 days ago Tag u/-f-b-i- with your thoughts, or perhaps u/RuprechtThaMonkeyBoy I'm not sure who is taking sticky complaints these days. permalink parent award report block reply MrMcGreenGenes 2 points 7 days ago Just venting, lol. Not serious enough to pursue like that. permalink parent award report block reply -f-b-i- 7 points 7 days ago 🤷‍♂️ permalink parent award report block reply\nTrancePhreak 4 points 7 days ago Tag u/-f-b-i- with your thoughts, or perhaps u/RuprechtThaMonkeyBoy I'm not sure who is taking sticky complaints these days. permalink parent award report block reply MrMcGreenGenes 2 points 7 days ago Just venting, lol. Not serious enough to pursue like that. permalink parent award report block reply -f-b-i- 7 points 7 days ago 🤷‍♂️ permalink parent award report block reply\nMrMcGreenGenes 2 points 7 days ago Just venting, lol. Not serious enough to pursue like that. permalink parent award report block reply -f-b-i- 7 points 7 days ago 🤷‍♂️ permalink parent award report block reply\n-f-b-i- 7 points 7 days ago 🤷‍♂️ permalink parent award report block reply\nBairt 8 points 7 days ago Part and parcel - Sadiq Khan permalink award report block reply\nDev404 7 points 7 days ago The muslims aren't wasting any time. Have fun, NY. You deserve it. permalink award report block reply StrongIsland 5 points 7 days ago We don’t deserve any of this hasbara fake sand war drama! We’re Americans! This Jew/Muslim shit needs to exit. https://patriots.win/p/1ARK0TSwzI/day-one-of-the-jussie-smollettin/c/ permalink parent award report block reply\nStrongIsland 5 points 7 days ago We don’t deserve any of this hasbara fake sand war drama! We’re Americans! This Jew/Muslim shit needs to exit. https://patriots.win/p/1ARK0TSwzI/day-one-of-the-jussie-smollettin/c/ permalink parent award report block reply\nyodayoda 5 points 7 days ago and so it begins... permalink award report block reply\nfluffykitten 4 points 7 days ago how many social workers does it take to put out a car fire? permalink award report block reply zooty 1 points 7 days ago I support finding out. permalink parent award report block reply\nzooty 1 points 7 days ago I support finding out. permalink parent award report block reply\nCitizen_Bob 4 points 7 days ago so it begins permalink award report block reply\nhillaryforprison 4 points 7 days ago If the video doesn't play, click HARDER, like REALLY hard. I broke my $2000 computer trying to get it to play. Now I have no SNAP benefits and will be deported, thanks a lot. permalink award report block reply\nTheChillingEffect 4 points 7 days ago I figured it would take until January to start the American Bolshevik movement.  Boy, was I wrong... permalink award report block reply\nTrancePhreak 3 points 7 days ago Classic muzzie celebration permalink award report block reply\nMoebius 3 points 7 days ago It's the Bronx.  One of many multi-cultural 'trailer parks' you'll find there.  Crime is high. If you're one of 'em social justice types, however, you'll love this place. Lotsa opportunities to \"share your wealth\" and otherwise prove your post-racial bona fides! ...if you survive. permalink award report block reply\nOvertaxed 3 points 7 days ago They're not wasting any time. permalink award report block reply\nACActual 3 points 7 days ago Former firefighter here.  Looks like a Propane tank explosion.  Fireman worst nightmare.   Propane expands at a rate of 270 times.   That's a huge area.  I saw a Propane explosion lift an entire building several feet off its foundation permalink award report block reply\nBasedMillennial 3 points 7 days ago Damn that was quick. Guess they got the signal. permalink award report block reply\nbrassmule 3 points 7 days ago Multiple cars and trash set on fire. Police and firefighters lured in.  Then an explosion. Cars just don't explode like that. permalink award report block reply\nvsekvsek 3 points 7 days ago Aloha snackbar permalink award report block reply\nCovfefeVideo 3 points 7 days ago Well, that escalated quickly. permalink award report block reply\nMarina 3 points 7 days ago That didn’t take long permalink award report block reply\nLawyersPlayDota 2 points 7 days ago I didn't expect it to become a muslim country this fast, lol. permalink award report block reply\nSoulSnipper 2 points 7 days ago Enjoy your diversity NY permalink award report block reply\nPatriotSkorzeny 2 points 7 days ago SVBIED’s. This is what law enforcement wants. They wanted terror. They got it. Stew in it. 🤣🤡 permalink award report block reply\nPunishedSnek 2 points 7 days ago Maybe they were just blowing up a car in celebration. Come on MSNBC. Say the line. permalink award report block reply\njimboonie 2 points 7 days ago That's just how they celebrate! It's all out of love. permalink award report block reply\nBoltCarrierGroup 2 points 7 days ago Wow terrorist already enabled his comrades permalink award report block reply\nsir_rockness 1 points 6 days ago DURKA DURKA MOHAMMED JIHAD permalink award report block reply\nFrankDuncan 1 points 7 days ago ali snackbar!!! permalink award report block reply\nterri1143 1 points 6 days ago Everyone who voted for him knew this! permalink award report block reply\nCheeseAndOnion 1 points 7 days ago The jahad of peace begins permalink award report block reply\nVeritas264 1 points 7 days ago Never thought I'd have to use a mirror stick to check my car in the USA permalink award report block reply\nLakeAmeritaga 1 points 7 days ago why does election season = explosion season? permalink award report block reply\nFBIsurveillance 1 points 7 days ago The honor killings have begun permalink award report block reply\nTeeRoyAL 1 points 7 days ago geeze, after looking at the stats, when folks say they from the bronx or queens, i now first think there is a 75% chance they on the food stamps permalink award report block reply\nLiberals_R_Idiots 1 points 7 days ago (Shocked face) permalink award report block reply\nJayKay1776 1 points 6 days ago So let me get this straight New York is next a Muslim communist and then two days later car bombs start going off I'm sure that's just coincidence. permalink award report block reply\nMedicallyReddit 1 points 7 days ago Aloha snackbar? permalink award report block reply\nChickensaurus 1 points 7 days ago So? permalink award report block reply\nFUCK_TYLER 1 points 7 days ago why is anybody surprised? permalink award report block reply\nNomad899 1 points 7 days ago Every day for a year things exploded near me just before or just after prayer time….it was almost clockwork, lesson learned permalink award report block reply\nSimaYi 1 points 6 days ago Who cares? This is local news from enemy occupied territory. You're all surprised that a foreigner won, not realizing that NYC is a foreign country. You all better wake the fuck up. The country is being conquered right in front of you and boomer Trump isn't going to do shit about it. permalink award report block reply\nknnbccb 1 points 7 days ago Allahu akbar! permalink award report block reply\nPeekov3 0 points 7 days ago Lmao get fucked permalink award report block reply\nSurfandTurf -9 points 7 days ago ITS MUSLIMSSSSS!!!!!!!! you fags are so predictable. permalink award report block reply\nILoveGoatFucking 3 points 7 days ago Comment removed upon the user being banned. permalink award report block reply"}