{"id": "1ARK9mGgdz", "contents": "297 LEGENDARY posted 18 hours ago by kek_saved_the_world 11 comments award share download report block\n11 comments Sort by Top Top New Worst Old Save Around the Web One Piece Kills All Parasites in Your Body! Paratoxil DemPanicAtTheDisco 15 points 14 hours ago This isn't reddit. This is completely off topic permalink award report block reply Mitch_WerBell_III 8 points 10 hours ago And degenerate filth. permalink parent award report block reply ChyNahAzzWhole1 15 points 18 hours ago this is how its done. permalink award report block reply QSWO1 9 points 17 hours ago Savage, and legendary. permalink award report block reply booblitchutz 8 points 11 hours ago When I was a kid that would give you a reputation as a “slut”. permalink award report block reply starjello 4 points 18 hours ago The 304 has probably had quite a few rides on the cock carousel herself. Now watch a cucked simp down vote permalink award report block reply discoelmo 4 points 16 hours ago High schoolers are apparently children according to these cucks yet they are calling her a legend. permalink parent award report block reply starjello 2 points 10 hours ago You put a picture of any woman that's not totally ugly on here in the Simps go ape shit it seems that many incels on here have never been with a woman. Or if they show a girl in a bikini or a nice pair of breasts about a third of the forum says they would tap that when all they really tap is their own hand. And I love to give them food for down voting. I'm doing my patriotic duty here for those poor souls permalink parent award report block reply The_Emperor 3 points 9 hours ago Small kek permalink award report block reply RolandDelacroix 1 points 7 hours ago Lotta forum sliding lately permalink award report block reply UncleSlayton 1 points 11 hours ago Reddit is for trannies and tranny lovers. Visiting Reddit gives them revenue. When you visit Reddit you fund propaganda that wants to murder you. If you don't have the self-control to not visit a website, you certainly don't have the self-control to resist conquest.  You're useless.  Already dead. permalink award report block reply\nDemPanicAtTheDisco 15 points 14 hours ago This isn't reddit. This is completely off topic permalink award report block reply Mitch_WerBell_III 8 points 10 hours ago And degenerate filth. permalink parent award report block reply\nMitch_WerBell_III 8 points 10 hours ago And degenerate filth. permalink parent award report block reply\nChyNahAzzWhole1 15 points 18 hours ago this is how its done. permalink award report block reply\nQSWO1 9 points 17 hours ago Savage, and legendary. permalink award report block reply\nbooblitchutz 8 points 11 hours ago When I was a kid that would give you a reputation as a “slut”. permalink award report block reply\nstarjello 4 points 18 hours ago The 304 has probably had quite a few rides on the cock carousel herself. Now watch a cucked simp down vote permalink award report block reply discoelmo 4 points 16 hours ago High schoolers are apparently children according to these cucks yet they are calling her a legend. permalink parent award report block reply starjello 2 points 10 hours ago You put a picture of any woman that's not totally ugly on here in the Simps go ape shit it seems that many incels on here have never been with a woman. Or if they show a girl in a bikini or a nice pair of breasts about a third of the forum says they would tap that when all they really tap is their own hand. And I love to give them food for down voting. I'm doing my patriotic duty here for those poor souls permalink parent award report block reply\ndiscoelmo 4 points 16 hours ago High schoolers are apparently children according to these cucks yet they are calling her a legend. permalink parent award report block reply starjello 2 points 10 hours ago You put a picture of any woman that's not totally ugly on here in the Simps go ape shit it seems that many incels on here have never been with a woman. Or if they show a girl in a bikini or a nice pair of breasts about a third of the forum says they would tap that when all they really tap is their own hand. And I love to give them food for down voting. I'm doing my patriotic duty here for those poor souls permalink parent award report block reply\nstarjello 2 points 10 hours ago You put a picture of any woman that's not totally ugly on here in the Simps go ape shit it seems that many incels on here have never been with a woman. Or if they show a girl in a bikini or a nice pair of breasts about a third of the forum says they would tap that when all they really tap is their own hand. And I love to give them food for down voting. I'm doing my patriotic duty here for those poor souls permalink parent award report block reply\nThe_Emperor 3 points 9 hours ago Small kek permalink award report block reply\nRolandDelacroix 1 points 7 hours ago Lotta forum sliding lately permalink award report block reply\nUncleSlayton 1 points 11 hours ago Reddit is for trannies and tranny lovers. Visiting Reddit gives them revenue. When you visit Reddit you fund propaganda that wants to murder you. If you don't have the self-control to not visit a website, you certainly don't have the self-control to resist conquest.  You're useless.  Already dead. permalink award report block reply"}