{"id": "1ARK9oYIZ6", "contents": "410 \"They're failing to read the room. People don't care about cracking down on abuses. They want the program removed entirely.  \n\nWe already have the O-1 visa for extremely gifted people in their fields.\" posted 14 hours ago by bleeje 3 comments award share report block 9mmSMG @9mm_smg • 15h They're failing to read the room. People don't care about cracking down on abuses. They want the program removed entirely. We already have the O-1 visa for extremely gifted people in their fields. Karoline Leavitt @PressSec • 17h Trump Admin Promises To Continue Crackdown On H-1B Visa Abuses\n3 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget BruddahIz 11 points 12 hours ago The H1B fees and crackdowns are meaningless and have lots of backdoors - the \"100,000\" dollar thing in its final issue from Immigration had a backdoor for all scenarios s and grandfathered everyone that is already here and thier family forever from ever having to pay the fee.  SHE IS LYING permalink award report block reply suckmycorona 5 points 12 hours ago Can we be honest for a change.  Any program and I mean any program is written for one intent.  But for every good intent there’s hundreds of bad intention was to exploit it.  End them all and let local communities support the needy.  Believe me the leaches will learn real fast nobody will care for them. permalink award report block reply itsallascam6 1 points 13 hours ago Comment removed by community moderators. permalink award report block reply\nBruddahIz 11 points 12 hours ago The H1B fees and crackdowns are meaningless and have lots of backdoors - the \"100,000\" dollar thing in its final issue from Immigration had a backdoor for all scenarios s and grandfathered everyone that is already here and thier family forever from ever having to pay the fee.  SHE IS LYING permalink award report block reply\nsuckmycorona 5 points 12 hours ago Can we be honest for a change.  Any program and I mean any program is written for one intent.  But for every good intent there’s hundreds of bad intention was to exploit it.  End them all and let local communities support the needy.  Believe me the leaches will learn real fast nobody will care for them. permalink award report block reply\nitsallascam6 1 points 13 hours ago Comment removed by community moderators. permalink award report block reply"}