{"id": "1ARK9k0zrc", "contents": "556 💯🤣 Always hot and ready 💀🍕😂 I'm literally ROFL 🤣💯 posted 1 day ago by Prandogolio 15 comments award share download report block\n15 comments Sort by Top Top New Worst Old Save Jack_NC 31 points 1 day ago Someone please hire that Little Caesars employee and put him in charge of the Republican party, or let him run ICE/immigration. THAT is the energy we need! Note to self: eat more pizza. permalink award report block reply Cacciali_Via 1 points 11 hours ago This is fiction retard. permalink parent award report block reply HaSumBro 9 points 1 day ago More fake LARPing redditor bullshit.... They forgot the dying family member, please pray for me, my dog is sick plot lines tho permalink award report block reply bluebahloo 7 points 24 hours ago It's a joke. You're not supposed to think it's real. permalink parent award report block reply HaSumBro 1 points 24 hours ago K permalink parent award report block reply Mungo 4 points 1 day ago Kek permalink award report block reply blitzstrasse 4 points 1 day ago You never look a great No Shit story in the mouth. permalink award report block reply WeaponizedSmirk 3 points 17 hours ago What's with the gay posting? This isn't your Facebook. permalink award report block reply Prandogolio OP 1 points 8 hours ago It is now.  Look at all the upvotes I get for reposting dumb shit from c/funny .  It's clearly what everyone wants to see here now.  I'm just giving the community what they want. permalink parent award report block reply redinmn 1 points 23 hours ago Real or not, I think that guy absolutely was waiting his whole life to deliver that line or at the least its a great story that put a smile on my face. permalink award report block reply medicpatriot 1 points 1 day ago Happened permalink award report block reply Gletkin 0 points 18 hours ago I was there filling up my Diet Dr. Pepper with no ice and saw the whole thing go down. As the perp lit out and the cashier tended to the victim I ran out of the store and threw my bag of Fritos at the perp's car as he sped away. The bag connected and shattered the rear window but the guy got away. permalink parent award report block reply patrioticwinning3 1 points 1 day ago LMFAO XD permalink award report block reply barwhack 1 points 19 hours ago 💪🏿😀 permalink award report block reply semsem 0 points 11 hours ago Should have been a [ tsk! ] before the employee delivered his line. permalink award report block reply Agent_86 -1 points 22 hours ago Yep same thing happened to last week, I was standing right next to Chuck Norris and Evil Knievel. Charles Brownson and Stallone were waiting to order behind me. permalink award report block reply\nJack_NC 31 points 1 day ago Someone please hire that Little Caesars employee and put him in charge of the Republican party, or let him run ICE/immigration. THAT is the energy we need! Note to self: eat more pizza. permalink award report block reply Cacciali_Via 1 points 11 hours ago This is fiction retard. permalink parent award report block reply\nCacciali_Via 1 points 11 hours ago This is fiction retard. permalink parent award report block reply\nHaSumBro 9 points 1 day ago More fake LARPing redditor bullshit.... They forgot the dying family member, please pray for me, my dog is sick plot lines tho permalink award report block reply bluebahloo 7 points 24 hours ago It's a joke. You're not supposed to think it's real. permalink parent award report block reply HaSumBro 1 points 24 hours ago K permalink parent award report block reply\nbluebahloo 7 points 24 hours ago It's a joke. You're not supposed to think it's real. permalink parent award report block reply HaSumBro 1 points 24 hours ago K permalink parent award report block reply\nHaSumBro 1 points 24 hours ago K permalink parent award report block reply\nMungo 4 points 1 day ago Kek permalink award report block reply\nblitzstrasse 4 points 1 day ago You never look a great No Shit story in the mouth. permalink award report block reply\nWeaponizedSmirk 3 points 17 hours ago What's with the gay posting? This isn't your Facebook. permalink award report block reply Prandogolio OP 1 points 8 hours ago It is now.  Look at all the upvotes I get for reposting dumb shit from c/funny .  It's clearly what everyone wants to see here now.  I'm just giving the community what they want. permalink parent award report block reply\nPrandogolio OP 1 points 8 hours ago It is now.  Look at all the upvotes I get for reposting dumb shit from c/funny .  It's clearly what everyone wants to see here now.  I'm just giving the community what they want. permalink parent award report block reply\nredinmn 1 points 23 hours ago Real or not, I think that guy absolutely was waiting his whole life to deliver that line or at the least its a great story that put a smile on my face. permalink award report block reply\nmedicpatriot 1 points 1 day ago Happened permalink award report block reply Gletkin 0 points 18 hours ago I was there filling up my Diet Dr. Pepper with no ice and saw the whole thing go down. As the perp lit out and the cashier tended to the victim I ran out of the store and threw my bag of Fritos at the perp's car as he sped away. The bag connected and shattered the rear window but the guy got away. permalink parent award report block reply\nGletkin 0 points 18 hours ago I was there filling up my Diet Dr. Pepper with no ice and saw the whole thing go down. As the perp lit out and the cashier tended to the victim I ran out of the store and threw my bag of Fritos at the perp's car as he sped away. The bag connected and shattered the rear window but the guy got away. permalink parent award report block reply\npatrioticwinning3 1 points 1 day ago LMFAO XD permalink award report block reply\nbarwhack 1 points 19 hours ago 💪🏿😀 permalink award report block reply\nsemsem 0 points 11 hours ago Should have been a [ tsk! ] before the employee delivered his line. permalink award report block reply\nAgent_86 -1 points 22 hours ago Yep same thing happened to last week, I was standing right next to Chuck Norris and Evil Knievel. Charles Brownson and Stallone were waiting to order behind me. permalink award report block reply"}