{"id": "1ARK9oWvic", "contents": "44 🔴 More than 700 J6ers had been arrested by the end of 2021 under Joe Biden's regime. \nSo far in 2025, Pam Bondi hasn't arrested anyone for the J6 Fedsurrection, as the statute of limitations expires in just eight short weeks. posted 46 minutes ago by MEME-SUPREME 10 comments award share report block Mike Engleman🇺🇲 @RealHickory • 13h More than 700 J6ers had been arrested by the end of 2021 under Joe Biden's regime. So far in 2025, Pam Bondi hasn't arrested anyone for the J6 Fedsurrection, as the statute of limitations expires in just eight short weeks.\n10 comments Sort by Top Top New Worst Old Save CaptainWinston 3 points 44 minutes ago Plastic boobs and fake blonde hair, can't stand her. permalink award report block reply duckduck 3 points 43 minutes ago She sucks. permalink award report block reply SpeekFreely 3 points 43 minutes ago The reward for the pipe bomber is still on the FBI home page https://www.fbi.gov/video-repository/wfo-pipebomb-oct-2025-update-v2.mp4/view permalink award report block reply Wildwind 3 points 40 minutes ago Dont expect one damn arrest from her. permalink award report block reply Awakened 1 points 33 minutes ago As planned. How sad for our country to have these horrible people tear our country apart. The most gut wrenching part is Trump saying she's doing a great job. permalink award report block reply Region 1 points 3 minutes ago That is and has been the sole function for every AG in Trump’s administrations. She is deep state no less than Barr and Sessions. How it is this obvious and Trump does not fire her? permalink award report block reply YearninNation 1 points 30 minutes ago She fucking sucks; therefore Trump sucks cuz that's where the buck stops. permalink award report block reply Rosebud4Jesus 1 points 29 minutes ago She is Bill \"Bondi\" Barr 2.0.  Yep just like she almost let the Comey statue of limitations pass before Trump called her out and told her she better select that fierce female AG in Virginia.  Bondi was going to appoint an AG that the democrats supported.  This AG is the only reason Comey case is happening no thanks to Bondi.  Sadly Trump went back to praising Bondi because his COS Wiles.   Sadly Trump will never fire Bondi because she was brought in by her longtime buddy Trump's non-MAGA chief of staff Suzie Wiles.  Wiles whom the Bush family loves, was highly responsible for Gaetz backing out for AG. Can't believe this is happening again. permalink award report block reply knappz 1 points 27 minutes ago Why invoke Biden's name and then turn right around and refer back to Trumps underling Bondi? Isn't this Trumps administration? Doesn't Bondi work for Trump? According to Trump Bondi's doing a fantastic job....call a spade a spade. permalink award report block reply Patriot4TN -3 points 27 minutes ago HEY NOW! Being a full time Fox News star is time consuming. permalink award report block reply clearasabell 1 points 37 minutes ago Comment removed by community filter, pending further review. permalink award report block reply\nCaptainWinston 3 points 44 minutes ago Plastic boobs and fake blonde hair, can't stand her. permalink award report block reply\nduckduck 3 points 43 minutes ago She sucks. permalink award report block reply\nSpeekFreely 3 points 43 minutes ago The reward for the pipe bomber is still on the FBI home page https://www.fbi.gov/video-repository/wfo-pipebomb-oct-2025-update-v2.mp4/view permalink award report block reply\nWildwind 3 points 40 minutes ago Dont expect one damn arrest from her. permalink award report block reply\nAwakened 1 points 33 minutes ago As planned. How sad for our country to have these horrible people tear our country apart. The most gut wrenching part is Trump saying she's doing a great job. permalink award report block reply\nRegion 1 points 3 minutes ago That is and has been the sole function for every AG in Trump’s administrations. She is deep state no less than Barr and Sessions. How it is this obvious and Trump does not fire her? permalink award report block reply\nYearninNation 1 points 30 minutes ago She fucking sucks; therefore Trump sucks cuz that's where the buck stops. permalink award report block reply\nRosebud4Jesus 1 points 29 minutes ago She is Bill \"Bondi\" Barr 2.0.  Yep just like she almost let the Comey statue of limitations pass before Trump called her out and told her she better select that fierce female AG in Virginia.  Bondi was going to appoint an AG that the democrats supported.  This AG is the only reason Comey case is happening no thanks to Bondi.  Sadly Trump went back to praising Bondi because his COS Wiles.   Sadly Trump will never fire Bondi because she was brought in by her longtime buddy Trump's non-MAGA chief of staff Suzie Wiles.  Wiles whom the Bush family loves, was highly responsible for Gaetz backing out for AG. Can't believe this is happening again. permalink award report block reply\nknappz 1 points 27 minutes ago Why invoke Biden's name and then turn right around and refer back to Trumps underling Bondi? Isn't this Trumps administration? Doesn't Bondi work for Trump? According to Trump Bondi's doing a fantastic job....call a spade a spade. permalink award report block reply\nPatriot4TN -3 points 27 minutes ago HEY NOW! Being a full time Fox News star is time consuming. permalink award report block reply\nclearasabell 1 points 37 minutes ago Comment removed by community filter, pending further review. permalink award report block reply"}