{"id": "1ARK9oYJ67", "contents": "73 PAM, WHAT ARE YOU AFRAID OF?  WHY NO ARRESTS/PERP WALKS?  PLEASE SWITCH JOBS WITH JEANNINE PIRRO AND LET HER DO WHAT MUST BE DONE. 🚨  LOCK THEM UP  🚨 posted 13 hours ago by 3Always3Victorious3 7 comments award share download report block\n7 comments Sort by Top Top New Worst Old Save FBIAREFAGGOTS 3 points 13 hours ago We need mass firings energy like we had in first term. permalink award report block reply Aggrieved03 2 points 12 hours ago Kash must go too permalink award report block reply OrwellsGhost 2 points 12 hours ago Two more weeks! permalink award report block reply TheMaji 1 points 6 hours ago All of you experts with your visionary intel always add so much value to this site…\n🤮 permalink award report block reply patrioticwinning3 1 points 11 hours ago She's not \"affraid\" of anything.  She is a globhomo, and Trump is refusing to fire her.  Anyone else starting to think Trump isn't the man we thought he was? permalink award report block reply Wexit-Delecto -1 points 13 hours ago Have to wait til after the midterms now. It’s “muh midterm optics” season. permalink award report block reply SCHULTZ 1 points 13 hours ago Comment removed by community moderators. permalink award report block reply\nFBIAREFAGGOTS 3 points 13 hours ago We need mass firings energy like we had in first term. permalink award report block reply\nAggrieved03 2 points 12 hours ago Kash must go too permalink award report block reply\nOrwellsGhost 2 points 12 hours ago Two more weeks! permalink award report block reply\nTheMaji 1 points 6 hours ago All of you experts with your visionary intel always add so much value to this site…\n🤮 permalink award report block reply\npatrioticwinning3 1 points 11 hours ago She's not \"affraid\" of anything.  She is a globhomo, and Trump is refusing to fire her.  Anyone else starting to think Trump isn't the man we thought he was? permalink award report block reply\nWexit-Delecto -1 points 13 hours ago Have to wait til after the midterms now. It’s “muh midterm optics” season. permalink award report block reply\nSCHULTZ 1 points 13 hours ago Comment removed by community moderators. permalink award report block reply"}