{"id": "1ARK9pghQ0", "contents": "11 Actually, we're the biggest threat to \"migrant\" invaders. Beyond that, you can always spot the product of today's government schools: we're the enemy, and didn't invent a damn thing. 🤔 🐂💩   BULLSHIT   🐂💩 posted 43 minutes ago by mateus 3 comments award share report block Adrianne Curry @AdrianneCurry • 16h Get a load of this c^nt The Cake Lady @got_cake • 22h White people.\n3 comments Sort by Top Top New Worst Old Save Wizard_Glick 2 points 27 minutes ago She may be right; Throughout history, the most terrifying force of death, comes from the hands of \"White men who wanted to be left alone\". They try, so very hard, to mind their own business and provide for themselves, their families and those they love. They resist every impulse to fight back, knowing the forced and permanent change of life that will come from it. They know, that the moment they fight back, their lives as they have lived them, are over. The moment the \"White men who wanted to be left alone\" are forced to fight back, it is a small form of suicide. They are literally killing off who they used to be. . . . Which is why, when forced to take up violence, these \"White men who wanted to be left alone\", fight with unholy vengeance against those who murdered their former lives. They fight with raw hate, and a drive that cannot be fathomed by those who are merely play-acting at politics and terror. TRUE TERROR will arrive at the Left's door, and they will cry, scream, and beg for mercy . . . . but it will fall upon the deaf ears of the \"White men who wanted to be left alone\". permalink award report block reply Iremembermypassword 1 points 25 minutes ago They hate you. Return to them what they gave to you. permalink award report block reply T471 1 points 26 minutes ago one day all of this will disappear and.......the savagery that follows will shock everyone. There is a reason the term barbarian horde has lasted ages. permalink award report block reply\nWizard_Glick 2 points 27 minutes ago She may be right; Throughout history, the most terrifying force of death, comes from the hands of \"White men who wanted to be left alone\". They try, so very hard, to mind their own business and provide for themselves, their families and those they love. They resist every impulse to fight back, knowing the forced and permanent change of life that will come from it. They know, that the moment they fight back, their lives as they have lived them, are over. The moment the \"White men who wanted to be left alone\" are forced to fight back, it is a small form of suicide. They are literally killing off who they used to be. . . . Which is why, when forced to take up violence, these \"White men who wanted to be left alone\", fight with unholy vengeance against those who murdered their former lives. They fight with raw hate, and a drive that cannot be fathomed by those who are merely play-acting at politics and terror. TRUE TERROR will arrive at the Left's door, and they will cry, scream, and beg for mercy . . . . but it will fall upon the deaf ears of the \"White men who wanted to be left alone\". permalink award report block reply\nIremembermypassword 1 points 25 minutes ago They hate you. Return to them what they gave to you. permalink award report block reply\nT471 1 points 26 minutes ago one day all of this will disappear and.......the savagery that follows will shock everyone. There is a reason the term barbarian horde has lasted ages. permalink award report block reply"}