{"id": "1ARK5BGJmq", "contents": "307 Javier Milei: \"I would like to dedicate these words to New Yorkers, who have taken the opposite path to that of Argentina, and will now be living under a communist government. They should know that if the going gets tough, they will always be warmly welcomed in our land if they seek to prosper.\" posted 3 days ago by Mr_Rightside 8 comments award share report block Libs of TikTok @libsoftiktok • 3d BREAKING: President of Argentina Javier Milei invites New Yorker’s who will now live under Mamdani’s communist rule to move to Argentina\n8 comments Sort by Top Top New Worst Old Save NadlersNads 12 points 3 days ago I spent a month in Argentina and saw the city, the countryside. Went all over the country and i have to say i would move there under Milei in a heartbeat permalink award report block reply HeavyMetalPatriot 5 points 3 days ago But what happens post-Milei? Will it go total retard instantly? permalink parent award report block reply AR_MAGA 6 points 3 days ago I don't think so. Even poor people are starting to understand that Capitalism is the only way. Let's see. There is a cold war now between Trump and China about Argentina. If Trump keeps winning, Argentina will win. permalink parent award report block reply Crucible 5 points 3 days ago Would have to brush up on my German. permalink award report block reply AR_MAGA 6 points 3 days ago Argentina is not as White as it used to be. Immigrants during the last 30 years from surrounding countries \"brownished\" the demographics. Similar like here. permalink parent award report block reply KEK_1776_KEK 4 points 3 days ago This is America - you don't flee, you fight. permalink award report block reply cyberrigger 3 points 3 days ago Fucking Genius permalink award report block reply patrioticwinning3 2 points 3 days ago Afrera! permalink award report block reply\nNadlersNads 12 points 3 days ago I spent a month in Argentina and saw the city, the countryside. Went all over the country and i have to say i would move there under Milei in a heartbeat permalink award report block reply HeavyMetalPatriot 5 points 3 days ago But what happens post-Milei? Will it go total retard instantly? permalink parent award report block reply AR_MAGA 6 points 3 days ago I don't think so. Even poor people are starting to understand that Capitalism is the only way. Let's see. There is a cold war now between Trump and China about Argentina. If Trump keeps winning, Argentina will win. permalink parent award report block reply\nHeavyMetalPatriot 5 points 3 days ago But what happens post-Milei? Will it go total retard instantly? permalink parent award report block reply AR_MAGA 6 points 3 days ago I don't think so. Even poor people are starting to understand that Capitalism is the only way. Let's see. There is a cold war now between Trump and China about Argentina. If Trump keeps winning, Argentina will win. permalink parent award report block reply\nAR_MAGA 6 points 3 days ago I don't think so. Even poor people are starting to understand that Capitalism is the only way. Let's see. There is a cold war now between Trump and China about Argentina. If Trump keeps winning, Argentina will win. permalink parent award report block reply\nCrucible 5 points 3 days ago Would have to brush up on my German. permalink award report block reply AR_MAGA 6 points 3 days ago Argentina is not as White as it used to be. Immigrants during the last 30 years from surrounding countries \"brownished\" the demographics. Similar like here. permalink parent award report block reply\nAR_MAGA 6 points 3 days ago Argentina is not as White as it used to be. Immigrants during the last 30 years from surrounding countries \"brownished\" the demographics. Similar like here. permalink parent award report block reply\nKEK_1776_KEK 4 points 3 days ago This is America - you don't flee, you fight. permalink award report block reply\ncyberrigger 3 points 3 days ago Fucking Genius permalink award report block reply\npatrioticwinning3 2 points 3 days ago Afrera! permalink award report block reply"}