{"id": "1ARK9hi0V5", "contents": "1130 Trump Targets Foreign-Owned Meatpacking Cartel To Arrest Beef Prices, Defend Small Ranchers. The \"Big Four\" meat packers — JBS (Brazil), Cargill, Tyson Foods, and National Beef — currently dominate 85% of the market. (www.zerohedge.com) posted 2 days ago by rdvs34283 117 comments award share report block Trump Targets Foreign-Owned Meatpacking Cartel To Arrest Beef Prices, Defend Small Ranchers ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero www.zerohedge.com\n117 comments Sort by Top Top New Worst Old Save Spunas1 58 points 2 days ago All of it condoned by USDA. They hammerdown on the Mom & Pops with redtape that would promote local grown and sold. Same with Milk etc...It's all geared not for Our safety, but maximizing \"Benjamins\" for those in control, to include the Govt. Now what, after I've eluded to the obvious? NOTHING! permalink award report block reply Bullet3250 23 points 2 days ago Selling raw milk is ILLEGAL in most Dairy states... Think about that! permalink parent award report block reply WhiteGhost 16 points 2 days ago Yep. Remember all those videos of farmers being forced to dump their milk so they can get subsidies? I member. We need to get government out of farming. permalink parent award report block reply KernalMustard 2 points 2 days ago If you need subsides you aint running your farm right and need to go out of business. In 25y never did I take a nickel. I was in business to make money through my hard work. Same for all the people in our group. permalink parent award report block reply STONKATRUCK 8 points 2 days ago There's a loophole you can sell it so long as you put a not for human consumption sticker on it permalink parent award report block reply ModernKnight 5 points 2 days ago It depends on the state.  Some allow you to do that.  Here in Ohio even that's not allowed.  The only loophole for us to get raw milk is to purchase shares in a dairy where the contract states you get a certain amount of the milk produced, then you have to go to the producer to pick it up (it can't be delivered to you).  It's a massive inconvenience. permalink parent award report block reply possibletower -10 points 2 days ago Good because raw milk is disgusting if not drunk immediately after milking a cow. Pasteurized only for me. permalink parent award report block reply Mitch_WerBell_III 9 points 2 days ago You can let the shit sit (in the fridge, obviously) for a week and it’s fine.  Past that, you can turn it into yogurt. Pasteurized milk is garbage; Feel free to drink it though. permalink parent award report block reply STONKATRUCK 3 points 2 days ago I've had it before the spoil date is more like 5 days or so from what I've seen. It's actually not too bad pretty good. Mostly have used it for butter that doesn't spoil. Have had fresh farm eggs too that haven't gone through processing they taste so much better. permalink parent award report block reply view 1 more comments... True_Curmudgeon 2 points 2 days ago What a dumb fucking numbskull this guy is permalink parent award report block reply fazaman 4 points 2 days ago The most the government should do in this case is mandate a sign that says something like \"Drinking raw milk can be dangerous. Drink at your own risk.\" Or words to that effect. Just inform the customer that this is raw milk, and that carries some risk, compared to pasteurized milk. That's it. You can drink drain cleaner, if you're dumb enough, but raw milk is somehow illegal? permalink parent award report block reply Bullet3250 4 points 2 days ago When I was just a young sprout - we still had milkman delivery's to the house - every 2 days or so. Fresh milk in glass bottles - empties went back -  pretty cheap too.  I do think it was pasteurized... that was still kind of a big thing.. But raw milk is even better for you.  It's my guess that it was pasteurization that altered milk - altered 'gut bacteria' in 80% of the population - and caused mass Depression and other ills the Nation seemed to suffer - out of no where. permalink parent award report block reply fazaman 4 points 2 days ago Sure. My point is that it's different from what most people are used to, and can be more dangerous, but really it's in the farmer's best interest that things are kept as safe as possible for his customers. I remember I had a raw milk milkshake once when I was a kid. I don't remember much about it, but I remember that it was good! I doubt pasteurization causes depression or whatever. It's fine to drink. But there's probably benefits that are lost by doing it. A tradeoff for the benefits of pasteurization, really. Pasteurization is good, but to effectively mandate it is ridiculous government overreach. If I have a dairy farm nearby and I want to go and stick my house with exclusively raw milk instead of pasteurized, I should definitely be allowed to do so. permalink parent award report block reply squash1324 2 points 2 days ago Altered gut bacteria is from glyphosate. Used in processing wheat, and all wheat that isn't organic is tainted with it. Raw milk is better, but gut health isn't why. permalink parent award report block reply view 5 more comments... possibletower -1 points 2 days ago Raw milk is nasty permalink parent award report block reply Please_Clap 3 points 2 days ago You might be a weakling? 🤷‍♂️ permalink parent award report block reply RedStoneDeepState -6 points 2 days ago Cows are covered in cow shit. It gets in the milk, and milk is effectively sugar water - an ideal environment for bacteria. It needs pasteurized. permalink parent award report block reply Mitch_WerBell_III 6 points 2 days ago It needs pasteurized. No it doesn’t. If you want pasteurized milk because you don’t trust raw, by all means, drink the shit. permalink parent award report block reply RedStoneDeepState -5 points 2 days ago Said by the person who has never been near a cow permalink parent award report block reply view 5 more comments... Repentnow 4 points 2 days ago Cows are covered in cow shit. It gets in the milk Maybe where you're from in India, but not here in the US. It needs pasteurized. Humans have consumed raw milk for the history of man without pasteurizing. permalink parent award report block reply RedStoneDeepState -4 points 2 days ago Cows are covered in cow shit regardless of the location of the cow. Humans have consumed raw milk for the history of man without pasteurizing Within a few hours of it coming out of the cow. We are talking about commercial sale, which results in it taking more than a few hours after it comes from the cow. permalink parent award report block reply view 4 more comments... friedchicken 5 points 2 days ago It's always like this;  the federal bureaucracy loves to fight the individual - literally burning them alive, but cowers before the big scary companies with their big scary lobbyists and lawyers; coming after small businesses instead who have been doing the same thing for decades but suddenly what they're doing is wrong b/c some idiot bureaucrat ordained it to be so. What I don't understand, to this day, is the fear people have criticizing our shit-for-brains government decisions.  On the contrary, we have a citizenry that seems to suck the government dick in all things they do, and will happily snitch on the local businesses doing their thing. I hate the government so fucking much,.  This post is getting long, and I know that robs attention away, but I've firsthand encountered these shit-for-brains fedocrats, given these extremely cushy government jobs.  They think they are the smartest people to ever walk the face of the earth - a view promoted by their own culture.  I tore this yankee bitch apart when he came here.  He thought he was smart with his cornell education.  He thought he was an academic of the highest order.  He was an ant, looking at a shrub, contemplating the universe.  Also a psychopath - which is how he defends his ego.  Discussions are not in good faith - they are \"stroke my ego I come after you with the full force of the government\". These people are a parasite on our society and need to be purged. permalink parent award report block reply Spunas1 3 points 2 days ago I think Thomas Jefferson stated that this system of Govt. is solely based on Christian values and will not work without them. Also it is dependent on a well educated and truthfully informed public, as setup! We now have neither and unless drastic Draconian (Perhaps even Fascist) measures are taken \"SOON\" you and I shall live through the repercussion and experience the demise of a once exceptional and great country. The Irony of saving this country may be Fascism! Go figure! permalink parent award report block reply friedchicken 1 points 2 days ago stroke my ego or* permalink parent award report block reply PatriotDescendant 2 points 2 days ago Eluded? (Try alluded.) permalink parent award report block reply Standingoak 2 points 2 days ago Next you will realize who paid for the \"Food Pyramid\" permalink parent award report block reply Bullet3250 36 points 2 days ago When 4 firms OWN 85% of a Market... That is monopoly power - and you can bet they are not even competing anymore - they are COLLUDING... a little digging and it will all come out. and they hire illegals like crazy. permalink award report block reply InterloperKO 6 points 2 days ago When a prime rib is still 300 bucks at costco, I think it's pretty evident permalink parent award report block reply Bullet3250 5 points 2 days ago $5.59/lb 'for ground beef' that is retarded. permalink parent award report block reply Mikespenis123 2 points 2 days ago $8.49 if it's 90% lean... permalink parent award report block reply lispboy 4 points 2 days ago Antitrust. permalink parent award report block reply BerettaStroker 25 points 2 days ago THANK YOU, TRUMP! THIS IS THE PROBLEM!! permalink award report block reply possibletower 0 points 2 days ago Strangely China owned Smithfield is not part of this. Hmmmm permalink parent award report block reply BerettaStroker 1 points 2 days ago That is interesting, I wonder why? permalink parent award report block reply Mikespenis123 3 points 2 days ago Pigs, not beef.... permalink parent award report block reply Hambonemcgee 17 points 2 days ago I go to a local farm, the butcher shop is right there on the property.  Prices are similar to grocery stores, but the meat is fresh and high quality!  We don't buy meat at grocery store for years now. permalink award report block reply ingrowntoenail 15 points 2 days ago We recently went to a new local butcher.  Prices were double or triple and frozen.  We won't be going back. permalink parent award report block reply Here_we_go 10 points 2 days ago Same thing at farmers market. Meanwhile 90% of the stuff is bought in bulk. Just displayed folksy and people dont question it. When you live in Pennsylvania and they are selling cantaloupe, watermelons and oranges in may, its kind of clear. But people think its better and pay twice as much. permalink parent award report block reply NADSAQ 5 points 2 days ago As a chef, I get roped into going to farmers markets with people and it’s this same story every time in every city. permalink parent award report block reply KernalMustard 2 points 2 days ago We ran it a bit different. It was what seasonal for our area. Citrus was from my friends family in south florida. Everything else was local. We had schedules and order books passed out to customers. Beef was on a preorder basis too. I spent alot of my free time making those order books. I only asked for cost on those. $3. They got passed around anyway. Lol permalink parent award report block reply Katarina_Reset 6 points 2 days ago I've been wiring up some coolers and freezers for a new local, small meat processing plant. The prices are very reasonable. It comes out to About 4.50/lb if you buy a half/whole cow. They're very clean and I've never heard one animal struggle. It has definitely given me a new found respect for a steak permalink parent award report block reply KernalMustard 1 points 2 days ago They dont. I never did it myself though. We had a small slaughter house do it for us. They were reasonable. It was well run. When it was time I would bring 5 at a time. Steers got sent. Heifers were sold to anyone who needed one. Anything left went to the livestock market. I had it all covered. permalink parent award report block reply Hambonemcgee 4 points 2 days ago Some of them will definitely gouge you.  The one we shop at is reasonable. permalink parent award report block reply drattastic1 4 points 2 days ago My dad is a farmer and beef cows are his source of income, trust me when I say it's not the farmers/ranchers making a fortune on the cattle. No matter the price per pound they're paid up or down the price consumers pay is always high. permalink parent award report block reply KernalMustard 2 points 2 days ago When I sold on the local livestock market I got $2 a pound for angus. There wernt trash either. Its true its a cabal. The problem is if the price goes up the pr8ce on the grocery market goes up. We get screwed on both ends. permalink parent award report block reply KernalMustard 3 points 2 days ago 🌟🌟🌟🌟🌟🌟\nGood man/woman. I'm so proud of you. Start looking for local produce too. permalink parent award report block reply Helly 15 points 2 days ago So , massies bill permalink award report block reply hilboggins 5 points 2 days ago Yea the one never AIPAC guy Trump wants to get rid of. permalink parent award report block reply RedStoneDeepState -4 points 2 days ago Massie is a fucking retard. permalink parent award report block reply KernalMustard 3 points 2 days ago Takes one to know one. permalink parent award report block reply MondayCoupleIsDead -5 points 2 days ago Maybe Trump wouldn't want him gone if he wasn't such a cock block and thorn in his side. He's made his bed. permalink parent award report block reply hilboggins 8 points 2 days ago Maybe Trump should be more America First than Israel First. permalink parent award report block reply RedStoneDeepState -4 points 2 days ago You want to cripple US missile defense infrastructure out of blind hatred of Israel. You are against the USA and it's interests, you are just hiding that behind hatred of Israel. permalink parent award report block reply view 6 more comments... CruzControl 2 points 2 days ago Massie would be president in 2028 if we had 60 based Senators and his single item bills would get voted on and passed. permalink parent award report block reply ChicagoforTrump 15 points 2 days ago Federal regulations make it difficult for local farmers to sell to grocery stores. Lower regulations and let them compete. Imagine if all the small rural properties could raise a few cattle and sell them. We could increase the number of cattle in this country rapidly. I want to see beef prices cut in half at least. permalink award report block reply schiff_for_brains 3 points 2 days ago Out here a few small scale cattle farms bought a sausage factory and converted it to processing their own herds.  The $/lb sucks, but it's grass fed and organic.  I buy a li'l bit to try and help them scale up. permalink parent award report block reply RedStoneDeepState -4 points 2 days ago Organic beef should be outlawed, it's just wasteful permalink parent award report block reply RedStoneDeepState -1 points 2 days ago Imagine if all the small rural properties could raise a few cattle and sell them. They already can, they just sell them still mooing. You half beef prices and they then need to absorb the cost of slaughter while already not getting paid shit. Beef prices need to increase to increase the number of cattle. permalink parent award report block reply ChicagoforTrump 2 points 2 days ago We need to cut out the middle man and let the farmers sell directly to grocery stores locally. The bottle neck is the processing.  Everything needs to be inspected by the FDA multiple times which keeps prices high and farmers broke. The meat packers make all the money. permalink parent award report block reply RedStoneDeepState 1 points 2 days ago Prices still need to rise for ranchers to make any real money permalink parent award report block reply ChicagoforTrump 1 points 2 days ago Prices are at an all time high. Please tell me how they aren't making any money if they made money selling at lower prices years ago? The problem is not prices, the problem is costs associated with regulation and meat packing. permalink parent award report block reply view 1 more comments... localhost 8 points 2 days ago Please please please also go after Sysco. They're taking over basically the entire restaurant market food supply and their quality is just barely above school lunches which is just barely above prison food. permalink award report block reply ianpatrick1966 1 points 2 days ago What’s your beef with them?  Sysco sells fresh and great products if you are willing to pay.  They also sell frozen slop if that’s what tickles your fancy. I’ve never had any issues with them as opposed to other supplies that always forgot items or showed up late. permalink parent award report block reply LordKuroTheGreat 7 points 2 days ago All we really need to solve this problem is to break the back of the meat inspection racket. The way things are now have been designed to give megacorps and foreigners an advantage that small farms and local butchers will never overcome. permalink award report block reply TrumpAndSimpsNotMAGA 1 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply TexasBrowncoat 7 points 2 days ago For the past several months we have been buying our meats from local ranchers. Not as easy as picking up a plastic wrapped meat substance from the store, but the quality and taste are soooo worth it. You get to meet the ranchers that actually raised the animals that the meat comes from. Family will be going in on half-cow pretty soon. permalink award report block reply blue5707 3 points 2 days ago Unless you're Tennessee...then you take $2 million in American Rescue Plan funds FROM BIDEN and build your own. https://www.wjhl.com/news/local/washington-county-meat-packing-plant-location-set-as-commissioners-vote-on-2-million-in-support/ permalink award report block reply Bohemyth_2 3 points 2 days ago Great. Now do gas stations. And everything else that made America great So much work. So few terms. He should have been president for life back in 2000 permalink award report block reply RedStoneDeepState -1 points 2 days ago Ah yes just have the government run all businesses. That is what the US was fighting the Soviet Union for. permalink parent award report block reply Trooph-Hurts 3 points 2 days ago But I thought foreigners were going to save us! permalink award report block reply Greenhills 3 points 2 days ago Let’s just say they’re fucked. They already have evidence of price fixing or he wouldn’t have announced this. permalink award report block reply sumnayin2 2 points 2 days ago 2 weeks permalink parent award report block reply deleted 3 points 2 days ago ingrowntoenail 6 points 2 days ago So is his husband. permalink parent award report block reply OTher55 6 points 2 days ago Nope. Big Mike packs the meat, while Obummer has his fudge packed. permalink parent award report block reply TPMJB 3 points 2 days ago Three years ago I was paying $1.99 a pound for Chuck roast, one of the most nutritious meats you could buy. I recently saw it for $7.99 a pound. Throughout Biden they always cite things like bread remaining at 99 cents a loaf as proof inflation isn't happening with food prices. RETURN TO CHEAP MEAT! permalink award report block reply Wildwind 2 points 2 days ago The big four meat producers are poison to the health of Americans.  Whenever goverment is involved they always fuck up. permalink award report block reply Saxonlady 2 points 2 days ago If there isn't enough home grown beef for the population, wouldn't beef prices skyrocket? permalink award report block reply Female 2 points 2 days ago hindus worship beef so until further notice we will hold christian service and vbs in a slaughterhouse permalink award report block reply CruzControl 2 points 2 days ago Glad they are arresting Beef Prices. Put that SOB in shackles and never let him out. permalink award report block reply Smashley 2 points 2 days ago Cargil and Tyson are right here. Cargil is the largest private company in the USA and is ripe with scandal from the 70's. They are responsible for all the shit oils and HFCS in your food too. They (The McMillan's)  should be arrested. I live by many of the family members and used to sell them stuff. permalink award report block reply mailinvoter 2 points 2 days ago When Trump offered to buy Argentinian beef to open up competition in our beef market, a bunch of cry baby faggots, that think we live in a perfect world of rainbows and fairies (well, ok, we do live with those but definitely not perfect) and expect every thing to be as simple as making a wish and it comes true, threw a temper tantrum at Trump for working in the system we have. Wake up, retards. The world doesn't work the way you wish it did. We have to make compromises to push the goal post closer to perfection. permalink award report block reply OldZilla 2 points 2 days ago Ribeye 23.00 a pound at Walmart. Now that's inflation. permalink award report block reply tt777 2 points 2 days ago Interestingly I had a liberal person trying to smear Trump last week about preferential treatment for foreign meat manufacturers. Yes, they will not concede they are idiots. permalink award report block reply JoePlumber 2 points 2 days ago The amish butchers nearby are slaughtering and packing their own stuff and are even more expensive. Not sure this is a real solution. permalink award report block reply ReleasetheList 2 points 2 days ago This is good permalink award report block reply True_Curmudgeon 2 points 2 days ago Very few things heat me up and make me want to kill more than making it difficult for small local producers to sell me healthy natural beef and raw milk. Those nasty demonic fuckers making these regulations are trying to corner me into buying the garbage from the large companies at the supermarket. permalink award report block reply KennyKetchem 2 points 2 days ago Tell them to stop injecting water into the ground beef also. It is pretty fucking obvious when the shit burns to a fucking crisp within 5 minutes on the grill. permalink award report block reply boomerbutnotOKBoomer 1 points 2 days ago support your local ranchers and butchers. permalink award report block reply Logan051361 1 points 2 days ago Nobody is buying beef anymore. so what happens when the shit is sitting there? then they mark it down and its still high. so, what? toss it all out? then take a loss? permalink award report block reply fponick 1 points 2 days ago Now get Smithfield: Smithfield Foods, Inc., is a Chinese-owned pork producer and food-processing company based in Smithfield, Virginia.[4][a] Founded in 1936 as the Smithfield Packing Company by Joseph W. Luter and his son, the company is the largest pig and pork producer in the world.[5] In addition to owning over 500 farms in the US, Smithfield contracts with another 2,000 independent farms around the country to raise Smithfield's pigs.[6] Outside the US, the company has facilities in Mexico, Poland, Romania, Germany, Slovakia and the United Kingdom.[7] Globally the company employed 50,200 in 2016 and reported an annual revenue of $14 billion .[2] Its 973,000-square-foot meat-processing plant in Tar Heel, North Carolina, was said in 2000 to be the world's largest, slaughtering 32,000 pigs a day.[8] Then known as Shuanghui Group, WH Group purchased Smithfield Foods in 2013 for $4.72 billion.[9][10] It was the largest Chinese acquisition of an American company to date.[11] The acquisition of Smithfield's 146,000 acres of land made WH Group, headquartered in Luohe, Henan province, one of the largest overseas owners of American farmland.[b] (from Wikipedia) But you’ll never get that information here: https://www.smithfieldfoods.com/ permalink award report block reply Jrtomasejn 1 points 2 days ago Unvaxed American Beef Please. permalink award report block reply friedchicken 1 points 2 days ago Next do tech permalink award report block reply tooanalytical 1 points 2 days ago Heads of cattle are down while packing is sky high? Guarantee the meat packers are discussing how to fleece the US consumer. Also, investigate the USDA. permalink award report block reply Uffda 1 points 2 days ago FOOD FREEDOM! It’s what’s for supper! permalink award report block reply possibletower 0 points 2 days ago Why not include Smithfield which is owned by China? Is this reporter a CCP cocksucker? permalink award report block reply\nSpunas1 58 points 2 days ago All of it condoned by USDA. They hammerdown on the Mom & Pops with redtape that would promote local grown and sold. Same with Milk etc...It's all geared not for Our safety, but maximizing \"Benjamins\" for those in control, to include the Govt. Now what, after I've eluded to the obvious? NOTHING! permalink award report block reply Bullet3250 23 points 2 days ago Selling raw milk is ILLEGAL in most Dairy states... Think about that! permalink parent award report block reply WhiteGhost 16 points 2 days ago Yep. Remember all those videos of farmers being forced to dump their milk so they can get subsidies? I member. We need to get government out of farming. permalink parent award report block reply KernalMustard 2 points 2 days ago If you need subsides you aint running your farm right and need to go out of business. In 25y never did I take a nickel. I was in business to make money through my hard work. Same for all the people in our group. permalink parent award report block reply STONKATRUCK 8 points 2 days ago There's a loophole you can sell it so long as you put a not for human consumption sticker on it permalink parent award report block reply ModernKnight 5 points 2 days ago It depends on the state.  Some allow you to do that.  Here in Ohio even that's not allowed.  The only loophole for us to get raw milk is to purchase shares in a dairy where the contract states you get a certain amount of the milk produced, then you have to go to the producer to pick it up (it can't be delivered to you).  It's a massive inconvenience. permalink parent award report block reply possibletower -10 points 2 days ago Good because raw milk is disgusting if not drunk immediately after milking a cow. Pasteurized only for me. permalink parent award report block reply Mitch_WerBell_III 9 points 2 days ago You can let the shit sit (in the fridge, obviously) for a week and it’s fine.  Past that, you can turn it into yogurt. Pasteurized milk is garbage; Feel free to drink it though. permalink parent award report block reply STONKATRUCK 3 points 2 days ago I've had it before the spoil date is more like 5 days or so from what I've seen. It's actually not too bad pretty good. Mostly have used it for butter that doesn't spoil. Have had fresh farm eggs too that haven't gone through processing they taste so much better. permalink parent award report block reply view 1 more comments... True_Curmudgeon 2 points 2 days ago What a dumb fucking numbskull this guy is permalink parent award report block reply fazaman 4 points 2 days ago The most the government should do in this case is mandate a sign that says something like \"Drinking raw milk can be dangerous. Drink at your own risk.\" Or words to that effect. Just inform the customer that this is raw milk, and that carries some risk, compared to pasteurized milk. That's it. You can drink drain cleaner, if you're dumb enough, but raw milk is somehow illegal? permalink parent award report block reply Bullet3250 4 points 2 days ago When I was just a young sprout - we still had milkman delivery's to the house - every 2 days or so. Fresh milk in glass bottles - empties went back -  pretty cheap too.  I do think it was pasteurized... that was still kind of a big thing.. But raw milk is even better for you.  It's my guess that it was pasteurization that altered milk - altered 'gut bacteria' in 80% of the population - and caused mass Depression and other ills the Nation seemed to suffer - out of no where. permalink parent award report block reply fazaman 4 points 2 days ago Sure. My point is that it's different from what most people are used to, and can be more dangerous, but really it's in the farmer's best interest that things are kept as safe as possible for his customers. I remember I had a raw milk milkshake once when I was a kid. I don't remember much about it, but I remember that it was good! I doubt pasteurization causes depression or whatever. It's fine to drink. But there's probably benefits that are lost by doing it. A tradeoff for the benefits of pasteurization, really. Pasteurization is good, but to effectively mandate it is ridiculous government overreach. If I have a dairy farm nearby and I want to go and stick my house with exclusively raw milk instead of pasteurized, I should definitely be allowed to do so. permalink parent award report block reply squash1324 2 points 2 days ago Altered gut bacteria is from glyphosate. Used in processing wheat, and all wheat that isn't organic is tainted with it. Raw milk is better, but gut health isn't why. permalink parent award report block reply view 5 more comments... possibletower -1 points 2 days ago Raw milk is nasty permalink parent award report block reply Please_Clap 3 points 2 days ago You might be a weakling? 🤷‍♂️ permalink parent award report block reply RedStoneDeepState -6 points 2 days ago Cows are covered in cow shit. It gets in the milk, and milk is effectively sugar water - an ideal environment for bacteria. It needs pasteurized. permalink parent award report block reply Mitch_WerBell_III 6 points 2 days ago It needs pasteurized. No it doesn’t. If you want pasteurized milk because you don’t trust raw, by all means, drink the shit. permalink parent award report block reply RedStoneDeepState -5 points 2 days ago Said by the person who has never been near a cow permalink parent award report block reply view 5 more comments... Repentnow 4 points 2 days ago Cows are covered in cow shit. It gets in the milk Maybe where you're from in India, but not here in the US. It needs pasteurized. Humans have consumed raw milk for the history of man without pasteurizing. permalink parent award report block reply RedStoneDeepState -4 points 2 days ago Cows are covered in cow shit regardless of the location of the cow. Humans have consumed raw milk for the history of man without pasteurizing Within a few hours of it coming out of the cow. We are talking about commercial sale, which results in it taking more than a few hours after it comes from the cow. permalink parent award report block reply view 4 more comments... friedchicken 5 points 2 days ago It's always like this;  the federal bureaucracy loves to fight the individual - literally burning them alive, but cowers before the big scary companies with their big scary lobbyists and lawyers; coming after small businesses instead who have been doing the same thing for decades but suddenly what they're doing is wrong b/c some idiot bureaucrat ordained it to be so. What I don't understand, to this day, is the fear people have criticizing our shit-for-brains government decisions.  On the contrary, we have a citizenry that seems to suck the government dick in all things they do, and will happily snitch on the local businesses doing their thing. I hate the government so fucking much,.  This post is getting long, and I know that robs attention away, but I've firsthand encountered these shit-for-brains fedocrats, given these extremely cushy government jobs.  They think they are the smartest people to ever walk the face of the earth - a view promoted by their own culture.  I tore this yankee bitch apart when he came here.  He thought he was smart with his cornell education.  He thought he was an academic of the highest order.  He was an ant, looking at a shrub, contemplating the universe.  Also a psychopath - which is how he defends his ego.  Discussions are not in good faith - they are \"stroke my ego I come after you with the full force of the government\". These people are a parasite on our society and need to be purged. permalink parent award report block reply Spunas1 3 points 2 days ago I think Thomas Jefferson stated that this system of Govt. is solely based on Christian values and will not work without them. Also it is dependent on a well educated and truthfully informed public, as setup! We now have neither and unless drastic Draconian (Perhaps even Fascist) measures are taken \"SOON\" you and I shall live through the repercussion and experience the demise of a once exceptional and great country. The Irony of saving this country may be Fascism! Go figure! permalink parent award report block reply friedchicken 1 points 2 days ago stroke my ego or* permalink parent award report block reply PatriotDescendant 2 points 2 days ago Eluded? (Try alluded.) permalink parent award report block reply Standingoak 2 points 2 days ago Next you will realize who paid for the \"Food Pyramid\" permalink parent award report block reply\nBullet3250 23 points 2 days ago Selling raw milk is ILLEGAL in most Dairy states... Think about that! permalink parent award report block reply WhiteGhost 16 points 2 days ago Yep. Remember all those videos of farmers being forced to dump their milk so they can get subsidies? I member. We need to get government out of farming. permalink parent award report block reply KernalMustard 2 points 2 days ago If you need subsides you aint running your farm right and need to go out of business. In 25y never did I take a nickel. I was in business to make money through my hard work. Same for all the people in our group. permalink parent award report block reply STONKATRUCK 8 points 2 days ago There's a loophole you can sell it so long as you put a not for human consumption sticker on it permalink parent award report block reply ModernKnight 5 points 2 days ago It depends on the state.  Some allow you to do that.  Here in Ohio even that's not allowed.  The only loophole for us to get raw milk is to purchase shares in a dairy where the contract states you get a certain amount of the milk produced, then you have to go to the producer to pick it up (it can't be delivered to you).  It's a massive inconvenience. permalink parent award report block reply possibletower -10 points 2 days ago Good because raw milk is disgusting if not drunk immediately after milking a cow. Pasteurized only for me. permalink parent award report block reply Mitch_WerBell_III 9 points 2 days ago You can let the shit sit (in the fridge, obviously) for a week and it’s fine.  Past that, you can turn it into yogurt. Pasteurized milk is garbage; Feel free to drink it though. permalink parent award report block reply STONKATRUCK 3 points 2 days ago I've had it before the spoil date is more like 5 days or so from what I've seen. It's actually not too bad pretty good. Mostly have used it for butter that doesn't spoil. Have had fresh farm eggs too that haven't gone through processing they taste so much better. permalink parent award report block reply view 1 more comments... True_Curmudgeon 2 points 2 days ago What a dumb fucking numbskull this guy is permalink parent award report block reply fazaman 4 points 2 days ago The most the government should do in this case is mandate a sign that says something like \"Drinking raw milk can be dangerous. Drink at your own risk.\" Or words to that effect. Just inform the customer that this is raw milk, and that carries some risk, compared to pasteurized milk. That's it. You can drink drain cleaner, if you're dumb enough, but raw milk is somehow illegal? permalink parent award report block reply Bullet3250 4 points 2 days ago When I was just a young sprout - we still had milkman delivery's to the house - every 2 days or so. Fresh milk in glass bottles - empties went back -  pretty cheap too.  I do think it was pasteurized... that was still kind of a big thing.. But raw milk is even better for you.  It's my guess that it was pasteurization that altered milk - altered 'gut bacteria' in 80% of the population - and caused mass Depression and other ills the Nation seemed to suffer - out of no where. permalink parent award report block reply fazaman 4 points 2 days ago Sure. My point is that it's different from what most people are used to, and can be more dangerous, but really it's in the farmer's best interest that things are kept as safe as possible for his customers. I remember I had a raw milk milkshake once when I was a kid. I don't remember much about it, but I remember that it was good! I doubt pasteurization causes depression or whatever. It's fine to drink. But there's probably benefits that are lost by doing it. A tradeoff for the benefits of pasteurization, really. Pasteurization is good, but to effectively mandate it is ridiculous government overreach. If I have a dairy farm nearby and I want to go and stick my house with exclusively raw milk instead of pasteurized, I should definitely be allowed to do so. permalink parent award report block reply squash1324 2 points 2 days ago Altered gut bacteria is from glyphosate. Used in processing wheat, and all wheat that isn't organic is tainted with it. Raw milk is better, but gut health isn't why. permalink parent award report block reply view 5 more comments... possibletower -1 points 2 days ago Raw milk is nasty permalink parent award report block reply Please_Clap 3 points 2 days ago You might be a weakling? 🤷‍♂️ permalink parent award report block reply RedStoneDeepState -6 points 2 days ago Cows are covered in cow shit. It gets in the milk, and milk is effectively sugar water - an ideal environment for bacteria. It needs pasteurized. permalink parent award report block reply Mitch_WerBell_III 6 points 2 days ago It needs pasteurized. No it doesn’t. If you want pasteurized milk because you don’t trust raw, by all means, drink the shit. permalink parent award report block reply RedStoneDeepState -5 points 2 days ago Said by the person who has never been near a cow permalink parent award report block reply view 5 more comments... Repentnow 4 points 2 days ago Cows are covered in cow shit. It gets in the milk Maybe where you're from in India, but not here in the US. It needs pasteurized. Humans have consumed raw milk for the history of man without pasteurizing. permalink parent award report block reply RedStoneDeepState -4 points 2 days ago Cows are covered in cow shit regardless of the location of the cow. Humans have consumed raw milk for the history of man without pasteurizing Within a few hours of it coming out of the cow. We are talking about commercial sale, which results in it taking more than a few hours after it comes from the cow. permalink parent award report block reply view 4 more comments...\nWhiteGhost 16 points 2 days ago Yep. Remember all those videos of farmers being forced to dump their milk so they can get subsidies? I member. We need to get government out of farming. permalink parent award report block reply KernalMustard 2 points 2 days ago If you need subsides you aint running your farm right and need to go out of business. In 25y never did I take a nickel. I was in business to make money through my hard work. Same for all the people in our group. permalink parent award report block reply\nKernalMustard 2 points 2 days ago If you need subsides you aint running your farm right and need to go out of business. In 25y never did I take a nickel. I was in business to make money through my hard work. Same for all the people in our group. permalink parent award report block reply\nSTONKATRUCK 8 points 2 days ago There's a loophole you can sell it so long as you put a not for human consumption sticker on it permalink parent award report block reply ModernKnight 5 points 2 days ago It depends on the state.  Some allow you to do that.  Here in Ohio even that's not allowed.  The only loophole for us to get raw milk is to purchase shares in a dairy where the contract states you get a certain amount of the milk produced, then you have to go to the producer to pick it up (it can't be delivered to you).  It's a massive inconvenience. permalink parent award report block reply possibletower -10 points 2 days ago Good because raw milk is disgusting if not drunk immediately after milking a cow. Pasteurized only for me. permalink parent award report block reply Mitch_WerBell_III 9 points 2 days ago You can let the shit sit (in the fridge, obviously) for a week and it’s fine.  Past that, you can turn it into yogurt. Pasteurized milk is garbage; Feel free to drink it though. permalink parent award report block reply STONKATRUCK 3 points 2 days ago I've had it before the spoil date is more like 5 days or so from what I've seen. It's actually not too bad pretty good. Mostly have used it for butter that doesn't spoil. Have had fresh farm eggs too that haven't gone through processing they taste so much better. permalink parent award report block reply view 1 more comments... True_Curmudgeon 2 points 2 days ago What a dumb fucking numbskull this guy is permalink parent award report block reply\nModernKnight 5 points 2 days ago It depends on the state.  Some allow you to do that.  Here in Ohio even that's not allowed.  The only loophole for us to get raw milk is to purchase shares in a dairy where the contract states you get a certain amount of the milk produced, then you have to go to the producer to pick it up (it can't be delivered to you).  It's a massive inconvenience. permalink parent award report block reply\npossibletower -10 points 2 days ago Good because raw milk is disgusting if not drunk immediately after milking a cow. Pasteurized only for me. permalink parent award report block reply Mitch_WerBell_III 9 points 2 days ago You can let the shit sit (in the fridge, obviously) for a week and it’s fine.  Past that, you can turn it into yogurt. Pasteurized milk is garbage; Feel free to drink it though. permalink parent award report block reply STONKATRUCK 3 points 2 days ago I've had it before the spoil date is more like 5 days or so from what I've seen. It's actually not too bad pretty good. Mostly have used it for butter that doesn't spoil. Have had fresh farm eggs too that haven't gone through processing they taste so much better. permalink parent award report block reply view 1 more comments... True_Curmudgeon 2 points 2 days ago What a dumb fucking numbskull this guy is permalink parent award report block reply\nMitch_WerBell_III 9 points 2 days ago You can let the shit sit (in the fridge, obviously) for a week and it’s fine.  Past that, you can turn it into yogurt. Pasteurized milk is garbage; Feel free to drink it though. permalink parent award report block reply\nSTONKATRUCK 3 points 2 days ago I've had it before the spoil date is more like 5 days or so from what I've seen. It's actually not too bad pretty good. Mostly have used it for butter that doesn't spoil. Have had fresh farm eggs too that haven't gone through processing they taste so much better. permalink parent award report block reply view 1 more comments...\nTrue_Curmudgeon 2 points 2 days ago What a dumb fucking numbskull this guy is permalink parent award report block reply\nfazaman 4 points 2 days ago The most the government should do in this case is mandate a sign that says something like \"Drinking raw milk can be dangerous. Drink at your own risk.\" Or words to that effect. Just inform the customer that this is raw milk, and that carries some risk, compared to pasteurized milk. That's it. You can drink drain cleaner, if you're dumb enough, but raw milk is somehow illegal? permalink parent award report block reply Bullet3250 4 points 2 days ago When I was just a young sprout - we still had milkman delivery's to the house - every 2 days or so. Fresh milk in glass bottles - empties went back -  pretty cheap too.  I do think it was pasteurized... that was still kind of a big thing.. But raw milk is even better for you.  It's my guess that it was pasteurization that altered milk - altered 'gut bacteria' in 80% of the population - and caused mass Depression and other ills the Nation seemed to suffer - out of no where. permalink parent award report block reply fazaman 4 points 2 days ago Sure. My point is that it's different from what most people are used to, and can be more dangerous, but really it's in the farmer's best interest that things are kept as safe as possible for his customers. I remember I had a raw milk milkshake once when I was a kid. I don't remember much about it, but I remember that it was good! I doubt pasteurization causes depression or whatever. It's fine to drink. But there's probably benefits that are lost by doing it. A tradeoff for the benefits of pasteurization, really. Pasteurization is good, but to effectively mandate it is ridiculous government overreach. If I have a dairy farm nearby and I want to go and stick my house with exclusively raw milk instead of pasteurized, I should definitely be allowed to do so. permalink parent award report block reply squash1324 2 points 2 days ago Altered gut bacteria is from glyphosate. Used in processing wheat, and all wheat that isn't organic is tainted with it. Raw milk is better, but gut health isn't why. permalink parent award report block reply view 5 more comments...\nBullet3250 4 points 2 days ago When I was just a young sprout - we still had milkman delivery's to the house - every 2 days or so. Fresh milk in glass bottles - empties went back -  pretty cheap too.  I do think it was pasteurized... that was still kind of a big thing.. But raw milk is even better for you.  It's my guess that it was pasteurization that altered milk - altered 'gut bacteria' in 80% of the population - and caused mass Depression and other ills the Nation seemed to suffer - out of no where. permalink parent award report block reply fazaman 4 points 2 days ago Sure. My point is that it's different from what most people are used to, and can be more dangerous, but really it's in the farmer's best interest that things are kept as safe as possible for his customers. I remember I had a raw milk milkshake once when I was a kid. I don't remember much about it, but I remember that it was good! I doubt pasteurization causes depression or whatever. It's fine to drink. But there's probably benefits that are lost by doing it. A tradeoff for the benefits of pasteurization, really. Pasteurization is good, but to effectively mandate it is ridiculous government overreach. If I have a dairy farm nearby and I want to go and stick my house with exclusively raw milk instead of pasteurized, I should definitely be allowed to do so. permalink parent award report block reply squash1324 2 points 2 days ago Altered gut bacteria is from glyphosate. Used in processing wheat, and all wheat that isn't organic is tainted with it. Raw milk is better, but gut health isn't why. permalink parent award report block reply view 5 more comments...\nfazaman 4 points 2 days ago Sure. My point is that it's different from what most people are used to, and can be more dangerous, but really it's in the farmer's best interest that things are kept as safe as possible for his customers. I remember I had a raw milk milkshake once when I was a kid. I don't remember much about it, but I remember that it was good! I doubt pasteurization causes depression or whatever. It's fine to drink. But there's probably benefits that are lost by doing it. A tradeoff for the benefits of pasteurization, really. Pasteurization is good, but to effectively mandate it is ridiculous government overreach. If I have a dairy farm nearby and I want to go and stick my house with exclusively raw milk instead of pasteurized, I should definitely be allowed to do so. permalink parent award report block reply\nsquash1324 2 points 2 days ago Altered gut bacteria is from glyphosate. Used in processing wheat, and all wheat that isn't organic is tainted with it. Raw milk is better, but gut health isn't why. permalink parent award report block reply view 5 more comments...\npossibletower -1 points 2 days ago Raw milk is nasty permalink parent award report block reply Please_Clap 3 points 2 days ago You might be a weakling? 🤷‍♂️ permalink parent award report block reply\nPlease_Clap 3 points 2 days ago You might be a weakling? 🤷‍♂️ permalink parent award report block reply\nRedStoneDeepState -6 points 2 days ago Cows are covered in cow shit. It gets in the milk, and milk is effectively sugar water - an ideal environment for bacteria. It needs pasteurized. permalink parent award report block reply Mitch_WerBell_III 6 points 2 days ago It needs pasteurized. No it doesn’t. If you want pasteurized milk because you don’t trust raw, by all means, drink the shit. permalink parent award report block reply RedStoneDeepState -5 points 2 days ago Said by the person who has never been near a cow permalink parent award report block reply view 5 more comments... Repentnow 4 points 2 days ago Cows are covered in cow shit. It gets in the milk Maybe where you're from in India, but not here in the US. It needs pasteurized. Humans have consumed raw milk for the history of man without pasteurizing. permalink parent award report block reply RedStoneDeepState -4 points 2 days ago Cows are covered in cow shit regardless of the location of the cow. Humans have consumed raw milk for the history of man without pasteurizing Within a few hours of it coming out of the cow. We are talking about commercial sale, which results in it taking more than a few hours after it comes from the cow. permalink parent award report block reply view 4 more comments...\nMitch_WerBell_III 6 points 2 days ago It needs pasteurized. No it doesn’t. If you want pasteurized milk because you don’t trust raw, by all means, drink the shit. permalink parent award report block reply RedStoneDeepState -5 points 2 days ago Said by the person who has never been near a cow permalink parent award report block reply view 5 more comments...\nRedStoneDeepState -5 points 2 days ago Said by the person who has never been near a cow permalink parent award report block reply view 5 more comments...\nRepentnow 4 points 2 days ago Cows are covered in cow shit. It gets in the milk Maybe where you're from in India, but not here in the US. It needs pasteurized. Humans have consumed raw milk for the history of man without pasteurizing. permalink parent award report block reply RedStoneDeepState -4 points 2 days ago Cows are covered in cow shit regardless of the location of the cow. Humans have consumed raw milk for the history of man without pasteurizing Within a few hours of it coming out of the cow. We are talking about commercial sale, which results in it taking more than a few hours after it comes from the cow. permalink parent award report block reply view 4 more comments...\nRedStoneDeepState -4 points 2 days ago Cows are covered in cow shit regardless of the location of the cow. Humans have consumed raw milk for the history of man without pasteurizing Within a few hours of it coming out of the cow. We are talking about commercial sale, which results in it taking more than a few hours after it comes from the cow. permalink parent award report block reply view 4 more comments...\nfriedchicken 5 points 2 days ago It's always like this;  the federal bureaucracy loves to fight the individual - literally burning them alive, but cowers before the big scary companies with their big scary lobbyists and lawyers; coming after small businesses instead who have been doing the same thing for decades but suddenly what they're doing is wrong b/c some idiot bureaucrat ordained it to be so. What I don't understand, to this day, is the fear people have criticizing our shit-for-brains government decisions.  On the contrary, we have a citizenry that seems to suck the government dick in all things they do, and will happily snitch on the local businesses doing their thing. I hate the government so fucking much,.  This post is getting long, and I know that robs attention away, but I've firsthand encountered these shit-for-brains fedocrats, given these extremely cushy government jobs.  They think they are the smartest people to ever walk the face of the earth - a view promoted by their own culture.  I tore this yankee bitch apart when he came here.  He thought he was smart with his cornell education.  He thought he was an academic of the highest order.  He was an ant, looking at a shrub, contemplating the universe.  Also a psychopath - which is how he defends his ego.  Discussions are not in good faith - they are \"stroke my ego I come after you with the full force of the government\". These people are a parasite on our society and need to be purged. permalink parent award report block reply Spunas1 3 points 2 days ago I think Thomas Jefferson stated that this system of Govt. is solely based on Christian values and will not work without them. Also it is dependent on a well educated and truthfully informed public, as setup! We now have neither and unless drastic Draconian (Perhaps even Fascist) measures are taken \"SOON\" you and I shall live through the repercussion and experience the demise of a once exceptional and great country. The Irony of saving this country may be Fascism! Go figure! permalink parent award report block reply friedchicken 1 points 2 days ago stroke my ego or* permalink parent award report block reply\nSpunas1 3 points 2 days ago I think Thomas Jefferson stated that this system of Govt. is solely based on Christian values and will not work without them. Also it is dependent on a well educated and truthfully informed public, as setup! We now have neither and unless drastic Draconian (Perhaps even Fascist) measures are taken \"SOON\" you and I shall live through the repercussion and experience the demise of a once exceptional and great country. The Irony of saving this country may be Fascism! Go figure! permalink parent award report block reply\nfriedchicken 1 points 2 days ago stroke my ego or* permalink parent award report block reply\nPatriotDescendant 2 points 2 days ago Eluded? (Try alluded.) permalink parent award report block reply\nStandingoak 2 points 2 days ago Next you will realize who paid for the \"Food Pyramid\" permalink parent award report block reply\nBullet3250 36 points 2 days ago When 4 firms OWN 85% of a Market... That is monopoly power - and you can bet they are not even competing anymore - they are COLLUDING... a little digging and it will all come out. and they hire illegals like crazy. permalink award report block reply InterloperKO 6 points 2 days ago When a prime rib is still 300 bucks at costco, I think it's pretty evident permalink parent award report block reply Bullet3250 5 points 2 days ago $5.59/lb 'for ground beef' that is retarded. permalink parent award report block reply Mikespenis123 2 points 2 days ago $8.49 if it's 90% lean... permalink parent award report block reply lispboy 4 points 2 days ago Antitrust. permalink parent award report block reply\nInterloperKO 6 points 2 days ago When a prime rib is still 300 bucks at costco, I think it's pretty evident permalink parent award report block reply Bullet3250 5 points 2 days ago $5.59/lb 'for ground beef' that is retarded. permalink parent award report block reply Mikespenis123 2 points 2 days ago $8.49 if it's 90% lean... permalink parent award report block reply\nBullet3250 5 points 2 days ago $5.59/lb 'for ground beef' that is retarded. permalink parent award report block reply Mikespenis123 2 points 2 days ago $8.49 if it's 90% lean... permalink parent award report block reply\nMikespenis123 2 points 2 days ago $8.49 if it's 90% lean... permalink parent award report block reply\nlispboy 4 points 2 days ago Antitrust. permalink parent award report block reply\nBerettaStroker 25 points 2 days ago THANK YOU, TRUMP! THIS IS THE PROBLEM!! permalink award report block reply possibletower 0 points 2 days ago Strangely China owned Smithfield is not part of this. Hmmmm permalink parent award report block reply BerettaStroker 1 points 2 days ago That is interesting, I wonder why? permalink parent award report block reply Mikespenis123 3 points 2 days ago Pigs, not beef.... permalink parent award report block reply\npossibletower 0 points 2 days ago Strangely China owned Smithfield is not part of this. Hmmmm permalink parent award report block reply BerettaStroker 1 points 2 days ago That is interesting, I wonder why? permalink parent award report block reply Mikespenis123 3 points 2 days ago Pigs, not beef.... permalink parent award report block reply\nBerettaStroker 1 points 2 days ago That is interesting, I wonder why? permalink parent award report block reply Mikespenis123 3 points 2 days ago Pigs, not beef.... permalink parent award report block reply\nMikespenis123 3 points 2 days ago Pigs, not beef.... permalink parent award report block reply\nHambonemcgee 17 points 2 days ago I go to a local farm, the butcher shop is right there on the property.  Prices are similar to grocery stores, but the meat is fresh and high quality!  We don't buy meat at grocery store for years now. permalink award report block reply ingrowntoenail 15 points 2 days ago We recently went to a new local butcher.  Prices were double or triple and frozen.  We won't be going back. permalink parent award report block reply Here_we_go 10 points 2 days ago Same thing at farmers market. Meanwhile 90% of the stuff is bought in bulk. Just displayed folksy and people dont question it. When you live in Pennsylvania and they are selling cantaloupe, watermelons and oranges in may, its kind of clear. But people think its better and pay twice as much. permalink parent award report block reply NADSAQ 5 points 2 days ago As a chef, I get roped into going to farmers markets with people and it’s this same story every time in every city. permalink parent award report block reply KernalMustard 2 points 2 days ago We ran it a bit different. It was what seasonal for our area. Citrus was from my friends family in south florida. Everything else was local. We had schedules and order books passed out to customers. Beef was on a preorder basis too. I spent alot of my free time making those order books. I only asked for cost on those. $3. They got passed around anyway. Lol permalink parent award report block reply Katarina_Reset 6 points 2 days ago I've been wiring up some coolers and freezers for a new local, small meat processing plant. The prices are very reasonable. It comes out to About 4.50/lb if you buy a half/whole cow. They're very clean and I've never heard one animal struggle. It has definitely given me a new found respect for a steak permalink parent award report block reply KernalMustard 1 points 2 days ago They dont. I never did it myself though. We had a small slaughter house do it for us. They were reasonable. It was well run. When it was time I would bring 5 at a time. Steers got sent. Heifers were sold to anyone who needed one. Anything left went to the livestock market. I had it all covered. permalink parent award report block reply Hambonemcgee 4 points 2 days ago Some of them will definitely gouge you.  The one we shop at is reasonable. permalink parent award report block reply drattastic1 4 points 2 days ago My dad is a farmer and beef cows are his source of income, trust me when I say it's not the farmers/ranchers making a fortune on the cattle. No matter the price per pound they're paid up or down the price consumers pay is always high. permalink parent award report block reply KernalMustard 2 points 2 days ago When I sold on the local livestock market I got $2 a pound for angus. There wernt trash either. Its true its a cabal. The problem is if the price goes up the pr8ce on the grocery market goes up. We get screwed on both ends. permalink parent award report block reply KernalMustard 3 points 2 days ago 🌟🌟🌟🌟🌟🌟\nGood man/woman. I'm so proud of you. Start looking for local produce too. permalink parent award report block reply\ningrowntoenail 15 points 2 days ago We recently went to a new local butcher.  Prices were double or triple and frozen.  We won't be going back. permalink parent award report block reply Here_we_go 10 points 2 days ago Same thing at farmers market. Meanwhile 90% of the stuff is bought in bulk. Just displayed folksy and people dont question it. When you live in Pennsylvania and they are selling cantaloupe, watermelons and oranges in may, its kind of clear. But people think its better and pay twice as much. permalink parent award report block reply NADSAQ 5 points 2 days ago As a chef, I get roped into going to farmers markets with people and it’s this same story every time in every city. permalink parent award report block reply KernalMustard 2 points 2 days ago We ran it a bit different. It was what seasonal for our area. Citrus was from my friends family in south florida. Everything else was local. We had schedules and order books passed out to customers. Beef was on a preorder basis too. I spent alot of my free time making those order books. I only asked for cost on those. $3. They got passed around anyway. Lol permalink parent award report block reply Katarina_Reset 6 points 2 days ago I've been wiring up some coolers and freezers for a new local, small meat processing plant. The prices are very reasonable. It comes out to About 4.50/lb if you buy a half/whole cow. They're very clean and I've never heard one animal struggle. It has definitely given me a new found respect for a steak permalink parent award report block reply KernalMustard 1 points 2 days ago They dont. I never did it myself though. We had a small slaughter house do it for us. They were reasonable. It was well run. When it was time I would bring 5 at a time. Steers got sent. Heifers were sold to anyone who needed one. Anything left went to the livestock market. I had it all covered. permalink parent award report block reply Hambonemcgee 4 points 2 days ago Some of them will definitely gouge you.  The one we shop at is reasonable. permalink parent award report block reply\nHere_we_go 10 points 2 days ago Same thing at farmers market. Meanwhile 90% of the stuff is bought in bulk. Just displayed folksy and people dont question it. When you live in Pennsylvania and they are selling cantaloupe, watermelons and oranges in may, its kind of clear. But people think its better and pay twice as much. permalink parent award report block reply NADSAQ 5 points 2 days ago As a chef, I get roped into going to farmers markets with people and it’s this same story every time in every city. permalink parent award report block reply KernalMustard 2 points 2 days ago We ran it a bit different. It was what seasonal for our area. Citrus was from my friends family in south florida. Everything else was local. We had schedules and order books passed out to customers. Beef was on a preorder basis too. I spent alot of my free time making those order books. I only asked for cost on those. $3. They got passed around anyway. Lol permalink parent award report block reply\nNADSAQ 5 points 2 days ago As a chef, I get roped into going to farmers markets with people and it’s this same story every time in every city. permalink parent award report block reply\nKernalMustard 2 points 2 days ago We ran it a bit different. It was what seasonal for our area. Citrus was from my friends family in south florida. Everything else was local. We had schedules and order books passed out to customers. Beef was on a preorder basis too. I spent alot of my free time making those order books. I only asked for cost on those. $3. They got passed around anyway. Lol permalink parent award report block reply\nKatarina_Reset 6 points 2 days ago I've been wiring up some coolers and freezers for a new local, small meat processing plant. The prices are very reasonable. It comes out to About 4.50/lb if you buy a half/whole cow. They're very clean and I've never heard one animal struggle. It has definitely given me a new found respect for a steak permalink parent award report block reply KernalMustard 1 points 2 days ago They dont. I never did it myself though. We had a small slaughter house do it for us. They were reasonable. It was well run. When it was time I would bring 5 at a time. Steers got sent. Heifers were sold to anyone who needed one. Anything left went to the livestock market. I had it all covered. permalink parent award report block reply\nKernalMustard 1 points 2 days ago They dont. I never did it myself though. We had a small slaughter house do it for us. They were reasonable. It was well run. When it was time I would bring 5 at a time. Steers got sent. Heifers were sold to anyone who needed one. Anything left went to the livestock market. I had it all covered. permalink parent award report block reply\nHambonemcgee 4 points 2 days ago Some of them will definitely gouge you.  The one we shop at is reasonable. permalink parent award report block reply\ndrattastic1 4 points 2 days ago My dad is a farmer and beef cows are his source of income, trust me when I say it's not the farmers/ranchers making a fortune on the cattle. No matter the price per pound they're paid up or down the price consumers pay is always high. permalink parent award report block reply KernalMustard 2 points 2 days ago When I sold on the local livestock market I got $2 a pound for angus. There wernt trash either. Its true its a cabal. The problem is if the price goes up the pr8ce on the grocery market goes up. We get screwed on both ends. permalink parent award report block reply\nKernalMustard 2 points 2 days ago When I sold on the local livestock market I got $2 a pound for angus. There wernt trash either. Its true its a cabal. The problem is if the price goes up the pr8ce on the grocery market goes up. We get screwed on both ends. permalink parent award report block reply\nKernalMustard 3 points 2 days ago 🌟🌟🌟🌟🌟🌟\nGood man/woman. I'm so proud of you. Start looking for local produce too. permalink parent award report block reply\nHelly 15 points 2 days ago So , massies bill permalink award report block reply hilboggins 5 points 2 days ago Yea the one never AIPAC guy Trump wants to get rid of. permalink parent award report block reply RedStoneDeepState -4 points 2 days ago Massie is a fucking retard. permalink parent award report block reply KernalMustard 3 points 2 days ago Takes one to know one. permalink parent award report block reply MondayCoupleIsDead -5 points 2 days ago Maybe Trump wouldn't want him gone if he wasn't such a cock block and thorn in his side. He's made his bed. permalink parent award report block reply hilboggins 8 points 2 days ago Maybe Trump should be more America First than Israel First. permalink parent award report block reply RedStoneDeepState -4 points 2 days ago You want to cripple US missile defense infrastructure out of blind hatred of Israel. You are against the USA and it's interests, you are just hiding that behind hatred of Israel. permalink parent award report block reply view 6 more comments... CruzControl 2 points 2 days ago Massie would be president in 2028 if we had 60 based Senators and his single item bills would get voted on and passed. permalink parent award report block reply\nhilboggins 5 points 2 days ago Yea the one never AIPAC guy Trump wants to get rid of. permalink parent award report block reply RedStoneDeepState -4 points 2 days ago Massie is a fucking retard. permalink parent award report block reply KernalMustard 3 points 2 days ago Takes one to know one. permalink parent award report block reply MondayCoupleIsDead -5 points 2 days ago Maybe Trump wouldn't want him gone if he wasn't such a cock block and thorn in his side. He's made his bed. permalink parent award report block reply hilboggins 8 points 2 days ago Maybe Trump should be more America First than Israel First. permalink parent award report block reply RedStoneDeepState -4 points 2 days ago You want to cripple US missile defense infrastructure out of blind hatred of Israel. You are against the USA and it's interests, you are just hiding that behind hatred of Israel. permalink parent award report block reply view 6 more comments...\nRedStoneDeepState -4 points 2 days ago Massie is a fucking retard. permalink parent award report block reply KernalMustard 3 points 2 days ago Takes one to know one. permalink parent award report block reply\nKernalMustard 3 points 2 days ago Takes one to know one. permalink parent award report block reply\nMondayCoupleIsDead -5 points 2 days ago Maybe Trump wouldn't want him gone if he wasn't such a cock block and thorn in his side. He's made his bed. permalink parent award report block reply hilboggins 8 points 2 days ago Maybe Trump should be more America First than Israel First. permalink parent award report block reply RedStoneDeepState -4 points 2 days ago You want to cripple US missile defense infrastructure out of blind hatred of Israel. You are against the USA and it's interests, you are just hiding that behind hatred of Israel. permalink parent award report block reply view 6 more comments...\nhilboggins 8 points 2 days ago Maybe Trump should be more America First than Israel First. permalink parent award report block reply RedStoneDeepState -4 points 2 days ago You want to cripple US missile defense infrastructure out of blind hatred of Israel. You are against the USA and it's interests, you are just hiding that behind hatred of Israel. permalink parent award report block reply view 6 more comments...\nRedStoneDeepState -4 points 2 days ago You want to cripple US missile defense infrastructure out of blind hatred of Israel. You are against the USA and it's interests, you are just hiding that behind hatred of Israel. permalink parent award report block reply view 6 more comments...\nCruzControl 2 points 2 days ago Massie would be president in 2028 if we had 60 based Senators and his single item bills would get voted on and passed. permalink parent award report block reply\nChicagoforTrump 15 points 2 days ago Federal regulations make it difficult for local farmers to sell to grocery stores. Lower regulations and let them compete. Imagine if all the small rural properties could raise a few cattle and sell them. We could increase the number of cattle in this country rapidly. I want to see beef prices cut in half at least. permalink award report block reply schiff_for_brains 3 points 2 days ago Out here a few small scale cattle farms bought a sausage factory and converted it to processing their own herds.  The $/lb sucks, but it's grass fed and organic.  I buy a li'l bit to try and help them scale up. permalink parent award report block reply RedStoneDeepState -4 points 2 days ago Organic beef should be outlawed, it's just wasteful permalink parent award report block reply RedStoneDeepState -1 points 2 days ago Imagine if all the small rural properties could raise a few cattle and sell them. They already can, they just sell them still mooing. You half beef prices and they then need to absorb the cost of slaughter while already not getting paid shit. Beef prices need to increase to increase the number of cattle. permalink parent award report block reply ChicagoforTrump 2 points 2 days ago We need to cut out the middle man and let the farmers sell directly to grocery stores locally. The bottle neck is the processing.  Everything needs to be inspected by the FDA multiple times which keeps prices high and farmers broke. The meat packers make all the money. permalink parent award report block reply RedStoneDeepState 1 points 2 days ago Prices still need to rise for ranchers to make any real money permalink parent award report block reply ChicagoforTrump 1 points 2 days ago Prices are at an all time high. Please tell me how they aren't making any money if they made money selling at lower prices years ago? The problem is not prices, the problem is costs associated with regulation and meat packing. permalink parent award report block reply view 1 more comments...\nschiff_for_brains 3 points 2 days ago Out here a few small scale cattle farms bought a sausage factory and converted it to processing their own herds.  The $/lb sucks, but it's grass fed and organic.  I buy a li'l bit to try and help them scale up. permalink parent award report block reply RedStoneDeepState -4 points 2 days ago Organic beef should be outlawed, it's just wasteful permalink parent award report block reply\nRedStoneDeepState -4 points 2 days ago Organic beef should be outlawed, it's just wasteful permalink parent award report block reply\nRedStoneDeepState -1 points 2 days ago Imagine if all the small rural properties could raise a few cattle and sell them. They already can, they just sell them still mooing. You half beef prices and they then need to absorb the cost of slaughter while already not getting paid shit. Beef prices need to increase to increase the number of cattle. permalink parent award report block reply ChicagoforTrump 2 points 2 days ago We need to cut out the middle man and let the farmers sell directly to grocery stores locally. The bottle neck is the processing.  Everything needs to be inspected by the FDA multiple times which keeps prices high and farmers broke. The meat packers make all the money. permalink parent award report block reply RedStoneDeepState 1 points 2 days ago Prices still need to rise for ranchers to make any real money permalink parent award report block reply ChicagoforTrump 1 points 2 days ago Prices are at an all time high. Please tell me how they aren't making any money if they made money selling at lower prices years ago? The problem is not prices, the problem is costs associated with regulation and meat packing. permalink parent award report block reply view 1 more comments...\nChicagoforTrump 2 points 2 days ago We need to cut out the middle man and let the farmers sell directly to grocery stores locally. The bottle neck is the processing.  Everything needs to be inspected by the FDA multiple times which keeps prices high and farmers broke. The meat packers make all the money. permalink parent award report block reply RedStoneDeepState 1 points 2 days ago Prices still need to rise for ranchers to make any real money permalink parent award report block reply ChicagoforTrump 1 points 2 days ago Prices are at an all time high. Please tell me how they aren't making any money if they made money selling at lower prices years ago? The problem is not prices, the problem is costs associated with regulation and meat packing. permalink parent award report block reply view 1 more comments...\nRedStoneDeepState 1 points 2 days ago Prices still need to rise for ranchers to make any real money permalink parent award report block reply ChicagoforTrump 1 points 2 days ago Prices are at an all time high. Please tell me how they aren't making any money if they made money selling at lower prices years ago? The problem is not prices, the problem is costs associated with regulation and meat packing. permalink parent award report block reply view 1 more comments...\nChicagoforTrump 1 points 2 days ago Prices are at an all time high. Please tell me how they aren't making any money if they made money selling at lower prices years ago? The problem is not prices, the problem is costs associated with regulation and meat packing. permalink parent award report block reply view 1 more comments...\nlocalhost 8 points 2 days ago Please please please also go after Sysco. They're taking over basically the entire restaurant market food supply and their quality is just barely above school lunches which is just barely above prison food. permalink award report block reply ianpatrick1966 1 points 2 days ago What’s your beef with them?  Sysco sells fresh and great products if you are willing to pay.  They also sell frozen slop if that’s what tickles your fancy. I’ve never had any issues with them as opposed to other supplies that always forgot items or showed up late. permalink parent award report block reply\nianpatrick1966 1 points 2 days ago What’s your beef with them?  Sysco sells fresh and great products if you are willing to pay.  They also sell frozen slop if that’s what tickles your fancy. I’ve never had any issues with them as opposed to other supplies that always forgot items or showed up late. permalink parent award report block reply\nLordKuroTheGreat 7 points 2 days ago All we really need to solve this problem is to break the back of the meat inspection racket. The way things are now have been designed to give megacorps and foreigners an advantage that small farms and local butchers will never overcome. permalink award report block reply TrumpAndSimpsNotMAGA 1 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply\nTrumpAndSimpsNotMAGA 1 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply\nTexasBrowncoat 7 points 2 days ago For the past several months we have been buying our meats from local ranchers. Not as easy as picking up a plastic wrapped meat substance from the store, but the quality and taste are soooo worth it. You get to meet the ranchers that actually raised the animals that the meat comes from. Family will be going in on half-cow pretty soon. permalink award report block reply\nblue5707 3 points 2 days ago Unless you're Tennessee...then you take $2 million in American Rescue Plan funds FROM BIDEN and build your own. https://www.wjhl.com/news/local/washington-county-meat-packing-plant-location-set-as-commissioners-vote-on-2-million-in-support/ permalink award report block reply\nBohemyth_2 3 points 2 days ago Great. Now do gas stations. And everything else that made America great So much work. So few terms. He should have been president for life back in 2000 permalink award report block reply RedStoneDeepState -1 points 2 days ago Ah yes just have the government run all businesses. That is what the US was fighting the Soviet Union for. permalink parent award report block reply\nRedStoneDeepState -1 points 2 days ago Ah yes just have the government run all businesses. That is what the US was fighting the Soviet Union for. permalink parent award report block reply\nTrooph-Hurts 3 points 2 days ago But I thought foreigners were going to save us! permalink award report block reply\nGreenhills 3 points 2 days ago Let’s just say they’re fucked. They already have evidence of price fixing or he wouldn’t have announced this. permalink award report block reply sumnayin2 2 points 2 days ago 2 weeks permalink parent award report block reply\nsumnayin2 2 points 2 days ago 2 weeks permalink parent award report block reply\ndeleted 3 points 2 days ago ingrowntoenail 6 points 2 days ago So is his husband. permalink parent award report block reply OTher55 6 points 2 days ago Nope. Big Mike packs the meat, while Obummer has his fudge packed. permalink parent award report block reply\ningrowntoenail 6 points 2 days ago So is his husband. permalink parent award report block reply\nOTher55 6 points 2 days ago Nope. Big Mike packs the meat, while Obummer has his fudge packed. permalink parent award report block reply\nTPMJB 3 points 2 days ago Three years ago I was paying $1.99 a pound for Chuck roast, one of the most nutritious meats you could buy. I recently saw it for $7.99 a pound. Throughout Biden they always cite things like bread remaining at 99 cents a loaf as proof inflation isn't happening with food prices. RETURN TO CHEAP MEAT! permalink award report block reply\nWildwind 2 points 2 days ago The big four meat producers are poison to the health of Americans.  Whenever goverment is involved they always fuck up. permalink award report block reply\nSaxonlady 2 points 2 days ago If there isn't enough home grown beef for the population, wouldn't beef prices skyrocket? permalink award report block reply\nFemale 2 points 2 days ago hindus worship beef so until further notice we will hold christian service and vbs in a slaughterhouse permalink award report block reply\nCruzControl 2 points 2 days ago Glad they are arresting Beef Prices. Put that SOB in shackles and never let him out. permalink award report block reply\nSmashley 2 points 2 days ago Cargil and Tyson are right here. Cargil is the largest private company in the USA and is ripe with scandal from the 70's. They are responsible for all the shit oils and HFCS in your food too. They (The McMillan's)  should be arrested. I live by many of the family members and used to sell them stuff. permalink award report block reply\nmailinvoter 2 points 2 days ago When Trump offered to buy Argentinian beef to open up competition in our beef market, a bunch of cry baby faggots, that think we live in a perfect world of rainbows and fairies (well, ok, we do live with those but definitely not perfect) and expect every thing to be as simple as making a wish and it comes true, threw a temper tantrum at Trump for working in the system we have. Wake up, retards. The world doesn't work the way you wish it did. We have to make compromises to push the goal post closer to perfection. permalink award report block reply\nOldZilla 2 points 2 days ago Ribeye 23.00 a pound at Walmart. Now that's inflation. permalink award report block reply\ntt777 2 points 2 days ago Interestingly I had a liberal person trying to smear Trump last week about preferential treatment for foreign meat manufacturers. Yes, they will not concede they are idiots. permalink award report block reply\nJoePlumber 2 points 2 days ago The amish butchers nearby are slaughtering and packing their own stuff and are even more expensive. Not sure this is a real solution. permalink award report block reply\nReleasetheList 2 points 2 days ago This is good permalink award report block reply\nTrue_Curmudgeon 2 points 2 days ago Very few things heat me up and make me want to kill more than making it difficult for small local producers to sell me healthy natural beef and raw milk. Those nasty demonic fuckers making these regulations are trying to corner me into buying the garbage from the large companies at the supermarket. permalink award report block reply\nKennyKetchem 2 points 2 days ago Tell them to stop injecting water into the ground beef also. It is pretty fucking obvious when the shit burns to a fucking crisp within 5 minutes on the grill. permalink award report block reply\nboomerbutnotOKBoomer 1 points 2 days ago support your local ranchers and butchers. permalink award report block reply\nLogan051361 1 points 2 days ago Nobody is buying beef anymore. so what happens when the shit is sitting there? then they mark it down and its still high. so, what? toss it all out? then take a loss? permalink award report block reply\nfponick 1 points 2 days ago Now get Smithfield: Smithfield Foods, Inc., is a Chinese-owned pork producer and food-processing company based in Smithfield, Virginia.[4][a] Founded in 1936 as the Smithfield Packing Company by Joseph W. Luter and his son, the company is the largest pig and pork producer in the world.[5] In addition to owning over 500 farms in the US, Smithfield contracts with another 2,000 independent farms around the country to raise Smithfield's pigs.[6] Outside the US, the company has facilities in Mexico, Poland, Romania, Germany, Slovakia and the United Kingdom.[7] Globally the company employed 50,200 in 2016 and reported an annual revenue of $14 billion .[2] Its 973,000-square-foot meat-processing plant in Tar Heel, North Carolina, was said in 2000 to be the world's largest, slaughtering 32,000 pigs a day.[8] Then known as Shuanghui Group, WH Group purchased Smithfield Foods in 2013 for $4.72 billion.[9][10] It was the largest Chinese acquisition of an American company to date.[11] The acquisition of Smithfield's 146,000 acres of land made WH Group, headquartered in Luohe, Henan province, one of the largest overseas owners of American farmland.[b] (from Wikipedia) But you’ll never get that information here: https://www.smithfieldfoods.com/ permalink award report block reply\nJrtomasejn 1 points 2 days ago Unvaxed American Beef Please. permalink award report block reply\nfriedchicken 1 points 2 days ago Next do tech permalink award report block reply\ntooanalytical 1 points 2 days ago Heads of cattle are down while packing is sky high? Guarantee the meat packers are discussing how to fleece the US consumer. Also, investigate the USDA. permalink award report block reply\nUffda 1 points 2 days ago FOOD FREEDOM! It’s what’s for supper! permalink award report block reply\npossibletower 0 points 2 days ago Why not include Smithfield which is owned by China? Is this reporter a CCP cocksucker? permalink award report block reply"}