{"id": "1ARK56kvxq", "contents": "1044 Somalian restaurant in Minneapolis took $12 million in federal child meal payments\n\nThey said they were feeding 4,000-6,000 kids a day. They only averaged 40 people during 6 weeks\n\nThey created fake names and invoices, Minneapolis Department of Education was aware and did nothing posted 4 days ago by YodaBannon 50 comments award share report block Wall Street Apes @WallStreetApes • 4d Somalian restaurant in Minneapolis took $12 million in federal child meal payments They said they were feeding 4,000-6,000 kids a day. They only averaged 40 people during 6 weeks They created fake names and invoices, Minneapolis Department of Education was aware and did nothing\n50 comments Sort by Top Top New Worst Old Save Bullet3250 61 points 4 days ago And the AG of Minnesota is????? Keith Ellison A hard core Socialist and Criminal. Keith Ellison is a member of the Democratic–Farmer–Labor Party (DFL) - a communist front group that has separated itself from the Democrat Party. He is widely recognized for leading the successful prosecution of former Minneapolis police officer Derek Chauvin in the \"murder\" of George Floyd... Hid the facts of the Case that showed Chauvin was innocent. Blocked Police Chest Rig Video from court evidence. permalink award report block reply QSWO1 24 points 4 days ago He was the head of the DNC under Obama. I think noodles replaced him after they killed Seth Rich in 2016. permalink parent award report block reply GainesvilleFlorida 13 points 4 days ago This whole thing makes me so upset permalink parent award report block reply QSWO1 6 points 4 days ago Me too. The propaganda cost me my youngest son days before the presidential election last year. The first one he could vote in. Upset is a understatement, and the parties responsible have been known for over 10 years. permalink parent award report block reply MidwestNotMideast 16 points 4 days ago you forgot worst of all, a muzzie permalink parent award report block reply MakingArrowsOrange 11 points 4 days ago Famously held the Antifa handbook in a photo. permalink parent award report block reply MisprisionIsEvil 41 points 4 days ago Somalis have a criminal culture. The absolute opposite of a trust culture. permalink award report block reply JoinTheDiscussion 8 points 4 days ago In their DNA.. Its caused or at least proportional to melanin content permalink parent award report block reply shialecuck007 32 points 4 days ago Guaranteed they sent most if not all of that 12 million back to Somalia permalink award report block reply HockeyMom4Trump 17 points 4 days ago A good chunk of it, yes. But they were living the high life around here, too. permalink parent award report block reply NC_patriot 3 points 4 days ago Does anybody there like the Somalians, or do they just keep quiet about it? permalink parent award report block reply Bullet3250 8 points 4 days ago 💯 permalink parent award report block reply LLP2 2 points 4 days ago I just got a high reading \"12 million back to Somalia\" for the wrong reason. permalink parent award report block reply YodaBannon OP 23 points 4 days ago 'Somalian restaurant in Minneapolis took $12 million in federal child meal payments They said they were feeding 4,000-6,000 kids a day. They only averaged 40 people during 6 weeks They created fake names and invoices, Minneapolis Department of Education was aware and did nothing “The FBI installed a surveillance camera overlooking this building just off Lake Street in Minneapolis. At the time, it was Safari Restaurant, which overall took in $12 million in federal child meal payments — Safari claimed to feed 4,000 to 6,000 kids a day. Its invoices and meal counts shown to the jury alongside the video. An FBI agent testifying that an average of 40 people came and went during the six weeks it was surveilled. The FBI set up a total of 12 cameras at sites claiming to serve extraordinary numbers of meals. Another was at a deli in Saint Paul, also registered by defendant Salim Sayyed, which claimed 1,800 meals per day. The video shown to the jury showed an average of 23 people a day coming and going. The jury was shown dozens of invoices, meal counts, and emails seized from Feeding Our Future's headquarters in Saint Anthony. Some showed links to websites that randomly generated names and ages to create rosters of children who were served meals. — And the kicker? Minnesota's own Department of Education had red flags. Massive spikes in reimbursement requests, impossible, impossible meal counts, and they still rubber-stamped the paperwork. Now, this new audit proves what everyone with a brain has been saying for years, incompetence starts at the top. When the governor's own office is sloppy with receipts, how can he possibly keep his agencies in line?  — It's the same pattern. Inflated invoices, nonexistent oversight, and zero accountability.” So Tim Walz personally knew and did nothing…. Where is the accountability?' permalink award report block reply Rudy_DankMemer 12 points 4 days ago So Tim Walz personally knew and did nothing…. Where is the accountability?' DoJ is a joke. permalink parent award report block reply SWRAD 16 points 4 days ago Rico charges? Nah, not with a commie AG permalink award report block reply Trump454748 15 points 4 days ago Thank God l pay taxes. permalink award report block reply HockeyMom4Trump 12 points 4 days ago Can you imagine if they let us keep our own money? permalink parent award report block reply HockeyMom4Trump 8 points 4 days ago Yes, this is old news. Most of these people are now in prison, some are still awaiting trial. Under Tampon Tim, Minnesota has had a severe fraud problem. Hopefully we get a new governor who cracks down on spending and has some oversight. permalink award report block reply booblitchutz 8 points 4 days ago A restaurant feeding 4-6 THOUSAND per day? Nobody thought that was weird? permalink award report block reply YodaBannon OP 4 points 4 days ago i like that Kash Me Outside set cameras up all over the place permalink parent award report block reply NC_patriot 1 points 4 days ago Lol that's what I was wondering, too. permalink parent award report block reply JanOctSept 7 points 4 days ago Who is the most psychotic hard-right person out there right now? Is it Stephen Miller? I would be ok with voting for him over Vance at this point. permalink award report block reply canada_is_communist 4 points 4 days ago Thats 90%+ of charities permalink award report block reply 2025WhatIsTrue 4 points 4 days ago So much corruption and corrupt sociopaths in government...so little time. permalink award report block reply TrumpAndSimpsNotMAGA 0 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply Lower 3 points 4 days ago It wasn't just the somalians. I know Sudanese and other african country immigrants that took advantage too! permalink award report block reply Michalusmichalus 3 points 4 days ago This is what happens when people that don't believe lying to you is a sin because you're not one of them. Fraud happens to be lying. permalink award report block reply Induceddrag 3 points 4 days ago This is only part of the story.  The charity involved in setting up the contracts was found guilty of funneling $250 million in fraudulent payments. permalink award report block reply CANATIVE 2 points 4 days ago Fuckin busted. Deport the scumbags but get the money back first. permalink award report block reply Oodles 2 points 4 days ago Stop feeding criminal Somalis with our tax dollars permalink award report block reply ScamBlondie 2 points 4 days ago This happens all the time and most don’t get caught. permalink award report block reply Oodles 2 points 4 days ago Somalis are incompatible with civilized society permalink award report block reply SpellingContable 2 points 4 days ago \"Haha, but you werent watching the back door silly\" Lack of produce deliveries and produce invoices no doubt permalink award report block reply raptormissle 2 points 4 days ago If you're a Somali in the USA and you're not a criminal then you're not a real Somali. permalink award report block reply ThouShallNotSteal 2 points 4 days ago Kill them all. permalink award report block reply Nomad899 1 points 4 days ago The fed should offer ZERO welfare of any kind permalink award report block reply GontMawr 1 points 4 days ago The scale of the fraud is unbelievable. permalink award report block reply TheBeardsman 1 points 4 days ago What the fuck would a Somali restaraunt even cook? Nothing? Brick and mortar version of Famine Simulator 1992? permalink award report block reply Easzq8 1 points 4 days ago Flay permalink award report block reply 2016TrumpMAGA 1 points 4 days ago Every bureaucrat that knew about this must be tried and imprisoned. permalink award report block reply MiltonThomasX 1 points 4 days ago Follow the money. permalink award report block reply Krat 1 points 4 days ago So still no arrests over this I presume permalink award report block reply Harvestsmiles 1 points 4 days ago Any names being created for the charges or do the crooks get a pass on this one too? permalink award report block reply KarenLukasik 1 points 4 days ago Yes,it’s stuff like this that makes me want an even harder conservative,a far right hardass MAGA candidate to replace our wonderful president. permalink award report block reply Dev404 1 points 4 days ago Of course Minnesomalia did nothing, they're conquered and any money going there is a 100% waste. permalink award report block reply onesummerdream 1 points 4 days ago So everyone responsible at the Minneapolis Department of Education was fired right? Right? Probably don’t need to look any further than the Somalis that work there. permalink award report block reply mohel 1 points 4 days ago Why is our government so dumb? permalink award report block reply Jappletime 1 points 2 days ago I Want My F**king Tax Dollars Back. permalink award report block reply HoodooOperator 1 points 4 days ago Comment removed by community moderators. permalink award report block reply EyesSewnShut 1 points 4 days ago Comment removed by community moderators. permalink award report block reply\nBullet3250 61 points 4 days ago And the AG of Minnesota is????? Keith Ellison A hard core Socialist and Criminal. Keith Ellison is a member of the Democratic–Farmer–Labor Party (DFL) - a communist front group that has separated itself from the Democrat Party. He is widely recognized for leading the successful prosecution of former Minneapolis police officer Derek Chauvin in the \"murder\" of George Floyd... Hid the facts of the Case that showed Chauvin was innocent. Blocked Police Chest Rig Video from court evidence. permalink award report block reply QSWO1 24 points 4 days ago He was the head of the DNC under Obama. I think noodles replaced him after they killed Seth Rich in 2016. permalink parent award report block reply GainesvilleFlorida 13 points 4 days ago This whole thing makes me so upset permalink parent award report block reply QSWO1 6 points 4 days ago Me too. The propaganda cost me my youngest son days before the presidential election last year. The first one he could vote in. Upset is a understatement, and the parties responsible have been known for over 10 years. permalink parent award report block reply MidwestNotMideast 16 points 4 days ago you forgot worst of all, a muzzie permalink parent award report block reply MakingArrowsOrange 11 points 4 days ago Famously held the Antifa handbook in a photo. permalink parent award report block reply\nQSWO1 24 points 4 days ago He was the head of the DNC under Obama. I think noodles replaced him after they killed Seth Rich in 2016. permalink parent award report block reply GainesvilleFlorida 13 points 4 days ago This whole thing makes me so upset permalink parent award report block reply QSWO1 6 points 4 days ago Me too. The propaganda cost me my youngest son days before the presidential election last year. The first one he could vote in. Upset is a understatement, and the parties responsible have been known for over 10 years. permalink parent award report block reply\nGainesvilleFlorida 13 points 4 days ago This whole thing makes me so upset permalink parent award report block reply QSWO1 6 points 4 days ago Me too. The propaganda cost me my youngest son days before the presidential election last year. The first one he could vote in. Upset is a understatement, and the parties responsible have been known for over 10 years. permalink parent award report block reply\nQSWO1 6 points 4 days ago Me too. The propaganda cost me my youngest son days before the presidential election last year. The first one he could vote in. Upset is a understatement, and the parties responsible have been known for over 10 years. permalink parent award report block reply\nMidwestNotMideast 16 points 4 days ago you forgot worst of all, a muzzie permalink parent award report block reply\nMakingArrowsOrange 11 points 4 days ago Famously held the Antifa handbook in a photo. permalink parent award report block reply\nMisprisionIsEvil 41 points 4 days ago Somalis have a criminal culture. The absolute opposite of a trust culture. permalink award report block reply JoinTheDiscussion 8 points 4 days ago In their DNA.. Its caused or at least proportional to melanin content permalink parent award report block reply\nJoinTheDiscussion 8 points 4 days ago In their DNA.. Its caused or at least proportional to melanin content permalink parent award report block reply\nshialecuck007 32 points 4 days ago Guaranteed they sent most if not all of that 12 million back to Somalia permalink award report block reply HockeyMom4Trump 17 points 4 days ago A good chunk of it, yes. But they were living the high life around here, too. permalink parent award report block reply NC_patriot 3 points 4 days ago Does anybody there like the Somalians, or do they just keep quiet about it? permalink parent award report block reply Bullet3250 8 points 4 days ago 💯 permalink parent award report block reply LLP2 2 points 4 days ago I just got a high reading \"12 million back to Somalia\" for the wrong reason. permalink parent award report block reply\nHockeyMom4Trump 17 points 4 days ago A good chunk of it, yes. But they were living the high life around here, too. permalink parent award report block reply NC_patriot 3 points 4 days ago Does anybody there like the Somalians, or do they just keep quiet about it? permalink parent award report block reply\nNC_patriot 3 points 4 days ago Does anybody there like the Somalians, or do they just keep quiet about it? permalink parent award report block reply\nBullet3250 8 points 4 days ago 💯 permalink parent award report block reply\nLLP2 2 points 4 days ago I just got a high reading \"12 million back to Somalia\" for the wrong reason. permalink parent award report block reply\nYodaBannon OP 23 points 4 days ago 'Somalian restaurant in Minneapolis took $12 million in federal child meal payments They said they were feeding 4,000-6,000 kids a day. They only averaged 40 people during 6 weeks They created fake names and invoices, Minneapolis Department of Education was aware and did nothing “The FBI installed a surveillance camera overlooking this building just off Lake Street in Minneapolis. At the time, it was Safari Restaurant, which overall took in $12 million in federal child meal payments — Safari claimed to feed 4,000 to 6,000 kids a day. Its invoices and meal counts shown to the jury alongside the video. An FBI agent testifying that an average of 40 people came and went during the six weeks it was surveilled. The FBI set up a total of 12 cameras at sites claiming to serve extraordinary numbers of meals. Another was at a deli in Saint Paul, also registered by defendant Salim Sayyed, which claimed 1,800 meals per day. The video shown to the jury showed an average of 23 people a day coming and going. The jury was shown dozens of invoices, meal counts, and emails seized from Feeding Our Future's headquarters in Saint Anthony. Some showed links to websites that randomly generated names and ages to create rosters of children who were served meals. — And the kicker? Minnesota's own Department of Education had red flags. Massive spikes in reimbursement requests, impossible, impossible meal counts, and they still rubber-stamped the paperwork. Now, this new audit proves what everyone with a brain has been saying for years, incompetence starts at the top. When the governor's own office is sloppy with receipts, how can he possibly keep his agencies in line?  — It's the same pattern. Inflated invoices, nonexistent oversight, and zero accountability.” So Tim Walz personally knew and did nothing…. Where is the accountability?' permalink award report block reply Rudy_DankMemer 12 points 4 days ago So Tim Walz personally knew and did nothing…. Where is the accountability?' DoJ is a joke. permalink parent award report block reply\nRudy_DankMemer 12 points 4 days ago So Tim Walz personally knew and did nothing…. Where is the accountability?' DoJ is a joke. permalink parent award report block reply\nSWRAD 16 points 4 days ago Rico charges? Nah, not with a commie AG permalink award report block reply\nTrump454748 15 points 4 days ago Thank God l pay taxes. permalink award report block reply HockeyMom4Trump 12 points 4 days ago Can you imagine if they let us keep our own money? permalink parent award report block reply\nHockeyMom4Trump 12 points 4 days ago Can you imagine if they let us keep our own money? permalink parent award report block reply\nHockeyMom4Trump 8 points 4 days ago Yes, this is old news. Most of these people are now in prison, some are still awaiting trial. Under Tampon Tim, Minnesota has had a severe fraud problem. Hopefully we get a new governor who cracks down on spending and has some oversight. permalink award report block reply\nbooblitchutz 8 points 4 days ago A restaurant feeding 4-6 THOUSAND per day? Nobody thought that was weird? permalink award report block reply YodaBannon OP 4 points 4 days ago i like that Kash Me Outside set cameras up all over the place permalink parent award report block reply NC_patriot 1 points 4 days ago Lol that's what I was wondering, too. permalink parent award report block reply\nYodaBannon OP 4 points 4 days ago i like that Kash Me Outside set cameras up all over the place permalink parent award report block reply\nNC_patriot 1 points 4 days ago Lol that's what I was wondering, too. permalink parent award report block reply\nJanOctSept 7 points 4 days ago Who is the most psychotic hard-right person out there right now? Is it Stephen Miller? I would be ok with voting for him over Vance at this point. permalink award report block reply\ncanada_is_communist 4 points 4 days ago Thats 90%+ of charities permalink award report block reply\n2025WhatIsTrue 4 points 4 days ago So much corruption and corrupt sociopaths in government...so little time. permalink award report block reply TrumpAndSimpsNotMAGA 0 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nTrumpAndSimpsNotMAGA 0 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nLower 3 points 4 days ago It wasn't just the somalians. I know Sudanese and other african country immigrants that took advantage too! permalink award report block reply\nMichalusmichalus 3 points 4 days ago This is what happens when people that don't believe lying to you is a sin because you're not one of them. Fraud happens to be lying. permalink award report block reply\nInduceddrag 3 points 4 days ago This is only part of the story.  The charity involved in setting up the contracts was found guilty of funneling $250 million in fraudulent payments. permalink award report block reply\nCANATIVE 2 points 4 days ago Fuckin busted. Deport the scumbags but get the money back first. permalink award report block reply\nOodles 2 points 4 days ago Stop feeding criminal Somalis with our tax dollars permalink award report block reply\nScamBlondie 2 points 4 days ago This happens all the time and most don’t get caught. permalink award report block reply\nOodles 2 points 4 days ago Somalis are incompatible with civilized society permalink award report block reply\nSpellingContable 2 points 4 days ago \"Haha, but you werent watching the back door silly\" Lack of produce deliveries and produce invoices no doubt permalink award report block reply\nraptormissle 2 points 4 days ago If you're a Somali in the USA and you're not a criminal then you're not a real Somali. permalink award report block reply\nThouShallNotSteal 2 points 4 days ago Kill them all. permalink award report block reply\nNomad899 1 points 4 days ago The fed should offer ZERO welfare of any kind permalink award report block reply\nGontMawr 1 points 4 days ago The scale of the fraud is unbelievable. permalink award report block reply\nTheBeardsman 1 points 4 days ago What the fuck would a Somali restaraunt even cook? Nothing? Brick and mortar version of Famine Simulator 1992? permalink award report block reply\nEaszq8 1 points 4 days ago Flay permalink award report block reply\n2016TrumpMAGA 1 points 4 days ago Every bureaucrat that knew about this must be tried and imprisoned. permalink award report block reply\nMiltonThomasX 1 points 4 days ago Follow the money. permalink award report block reply\nKrat 1 points 4 days ago So still no arrests over this I presume permalink award report block reply\nHarvestsmiles 1 points 4 days ago Any names being created for the charges or do the crooks get a pass on this one too? permalink award report block reply\nKarenLukasik 1 points 4 days ago Yes,it’s stuff like this that makes me want an even harder conservative,a far right hardass MAGA candidate to replace our wonderful president. permalink award report block reply\nDev404 1 points 4 days ago Of course Minnesomalia did nothing, they're conquered and any money going there is a 100% waste. permalink award report block reply\nonesummerdream 1 points 4 days ago So everyone responsible at the Minneapolis Department of Education was fired right? Right? Probably don’t need to look any further than the Somalis that work there. permalink award report block reply\nmohel 1 points 4 days ago Why is our government so dumb? permalink award report block reply\nJappletime 1 points 2 days ago I Want My F**king Tax Dollars Back. permalink award report block reply\nHoodooOperator 1 points 4 days ago Comment removed by community moderators. permalink award report block reply\nEyesSewnShut 1 points 4 days ago Comment removed by community moderators. permalink award report block reply"}