{"id": "1ARK9pgh1E", "contents": "67 If You Didn't Hate Him Already posted 1 hour ago by diogenesofthearch 23 comments award share download report block\n23 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style hellohellohellohell 17 points 1 hour ago Those are the two worst examples he could have come up with - neither founded anything, and were pushed up through the ranks (like Twitter's former CEO) by the type of ethnic nepotism we've been talking about on here. Both are systematically purging their workforce and replacing them with their fellow Indians at warp speed. permalink award report block reply throwaway777b 6 points 42 minutes ago The real underlying reason why they are replacing Americans with Indians is because the next wave of tech will 100% revolve around control and preventing people from being free.  American's at their core wouldn't work on that, but Indians who are born of a Caste system who grow up knowing they are low class nothings with a chance to implement something that makes them feel strong while harming everyone else is right up their alley. Every minority, in a position of power, first job is to maintain that status.  They will do anything to do it to preserve it.  Doing well at the job is secondary to keeping the job. permalink parent award report block reply rivetjoint2 1 points 4 minutes ago 100% permalink parent award report block reply newestofnew 1 points 1 hour ago every argument is disingenuous because he can't say the reality permalink parent award report block reply phlons 6 points 1 hour ago If anything is shows H1Bs are as evil as everyone says, those CEOs came in and took a job away from an American. permalink award report block reply newestofnew 3 points 1 hour ago the ownership class are protecting their imported slaves permalink parent award report block reply Throwingway22 1 points 18 minutes ago They took American companies away from America. permalink parent award report block reply Frociaggine 6 points 1 hour ago All tech companies and businesses with an Indian ceo are all on decline. permalink award report block reply airborne3502 5 points 1 hour ago Yeah, because there weren't any search engines before Google. He's an evil scumbag, but Bill Gates didn't grow up in Bangalore. permalink award report block reply hellohellohellohell 6 points 1 hour ago He didn't found Google, Page and Brin did decades before he showed up. It was basically an ethnically nepotistic ascent, just like Twitter, Microsoft and many others. permalink parent award report block reply throwaway777b 5 points 45 minutes ago Neither of those 2 Indians named founded anything permalink award report block reply UntakenUsername 4 points 1 hour ago So, now Ben is the epitome and the face of America First and MAGA. He is in 100% agreement with the President who started MAGA. Ben might now be the most America First MAGA guy in the USA. We were all wrong this whole time apparently. permalink award report block reply Lordfred1993 3 points 49 minutes ago At least you now know who is running the show permalink award report block reply snakeoil 3 points 1 hour ago The f***** jumped the shark as soon as he started using hair dye on his face. permalink award report block reply iamherefortheluls 3 points 38 minutes ago So the people that ushered in Win 11 and destroyed Google as a usable search engine? I think Hitler was a more moral and genuinely better person than Ben Shapiro. And I say that as someone who hates Nazis quite a bit permalink award report block reply jamesm56 2 points 34 minutes ago I can think someone is wrong without hating him. permalink award report block reply diogenesofthearch OP 3 points 28 minutes ago He's not just wrong, he's subversively evil. permalink parent award report block reply Darkpoisonousshaddow 2 points 46 minutes ago Of course he did, it's the Kalergi plan. permalink award report block reply Trajano 2 points 26 minutes ago Of course, Ben Shapiro will support H-1B visas. permalink award report block reply sleepinggiant 1 points 24 minutes ago So trump and tbe rinos are aligned? permalink award report block reply DenturesNancy 1 points 1 hour ago Can we petition Israel to officially add the US to their country?  I wouldn't mind free land settlements, free education and free universal healthcare.  I am tired of paying them taxes without representation permalink award report block reply Throwingway22 1 points 15 minutes ago Groomed to be the new generations William F Buckley, doomed to live in a time where there is no gate to keep. Desperately clinging to the money billionaire backers pour on him, unable to impact a thing. permalink award report block reply cwayfish 1 points 52 minutes ago Comment removed by community filter, pending further review. permalink award report block reply\nhellohellohellohell 17 points 1 hour ago Those are the two worst examples he could have come up with - neither founded anything, and were pushed up through the ranks (like Twitter's former CEO) by the type of ethnic nepotism we've been talking about on here. Both are systematically purging their workforce and replacing them with their fellow Indians at warp speed. permalink award report block reply throwaway777b 6 points 42 minutes ago The real underlying reason why they are replacing Americans with Indians is because the next wave of tech will 100% revolve around control and preventing people from being free.  American's at their core wouldn't work on that, but Indians who are born of a Caste system who grow up knowing they are low class nothings with a chance to implement something that makes them feel strong while harming everyone else is right up their alley. Every minority, in a position of power, first job is to maintain that status.  They will do anything to do it to preserve it.  Doing well at the job is secondary to keeping the job. permalink parent award report block reply rivetjoint2 1 points 4 minutes ago 100% permalink parent award report block reply newestofnew 1 points 1 hour ago every argument is disingenuous because he can't say the reality permalink parent award report block reply\nthrowaway777b 6 points 42 minutes ago The real underlying reason why they are replacing Americans with Indians is because the next wave of tech will 100% revolve around control and preventing people from being free.  American's at their core wouldn't work on that, but Indians who are born of a Caste system who grow up knowing they are low class nothings with a chance to implement something that makes them feel strong while harming everyone else is right up their alley. Every minority, in a position of power, first job is to maintain that status.  They will do anything to do it to preserve it.  Doing well at the job is secondary to keeping the job. permalink parent award report block reply rivetjoint2 1 points 4 minutes ago 100% permalink parent award report block reply\nrivetjoint2 1 points 4 minutes ago 100% permalink parent award report block reply\nnewestofnew 1 points 1 hour ago every argument is disingenuous because he can't say the reality permalink parent award report block reply\nphlons 6 points 1 hour ago If anything is shows H1Bs are as evil as everyone says, those CEOs came in and took a job away from an American. permalink award report block reply newestofnew 3 points 1 hour ago the ownership class are protecting their imported slaves permalink parent award report block reply Throwingway22 1 points 18 minutes ago They took American companies away from America. permalink parent award report block reply\nnewestofnew 3 points 1 hour ago the ownership class are protecting their imported slaves permalink parent award report block reply\nThrowingway22 1 points 18 minutes ago They took American companies away from America. permalink parent award report block reply\nFrociaggine 6 points 1 hour ago All tech companies and businesses with an Indian ceo are all on decline. permalink award report block reply\nairborne3502 5 points 1 hour ago Yeah, because there weren't any search engines before Google. He's an evil scumbag, but Bill Gates didn't grow up in Bangalore. permalink award report block reply hellohellohellohell 6 points 1 hour ago He didn't found Google, Page and Brin did decades before he showed up. It was basically an ethnically nepotistic ascent, just like Twitter, Microsoft and many others. permalink parent award report block reply\nhellohellohellohell 6 points 1 hour ago He didn't found Google, Page and Brin did decades before he showed up. It was basically an ethnically nepotistic ascent, just like Twitter, Microsoft and many others. permalink parent award report block reply\nthrowaway777b 5 points 45 minutes ago Neither of those 2 Indians named founded anything permalink award report block reply\nUntakenUsername 4 points 1 hour ago So, now Ben is the epitome and the face of America First and MAGA. He is in 100% agreement with the President who started MAGA. Ben might now be the most America First MAGA guy in the USA. We were all wrong this whole time apparently. permalink award report block reply\nLordfred1993 3 points 49 minutes ago At least you now know who is running the show permalink award report block reply\nsnakeoil 3 points 1 hour ago The f***** jumped the shark as soon as he started using hair dye on his face. permalink award report block reply\niamherefortheluls 3 points 38 minutes ago So the people that ushered in Win 11 and destroyed Google as a usable search engine? I think Hitler was a more moral and genuinely better person than Ben Shapiro. And I say that as someone who hates Nazis quite a bit permalink award report block reply\njamesm56 2 points 34 minutes ago I can think someone is wrong without hating him. permalink award report block reply diogenesofthearch OP 3 points 28 minutes ago He's not just wrong, he's subversively evil. permalink parent award report block reply\ndiogenesofthearch OP 3 points 28 minutes ago He's not just wrong, he's subversively evil. permalink parent award report block reply\nDarkpoisonousshaddow 2 points 46 minutes ago Of course he did, it's the Kalergi plan. permalink award report block reply\nTrajano 2 points 26 minutes ago Of course, Ben Shapiro will support H-1B visas. permalink award report block reply\nsleepinggiant 1 points 24 minutes ago So trump and tbe rinos are aligned? permalink award report block reply\nDenturesNancy 1 points 1 hour ago Can we petition Israel to officially add the US to their country?  I wouldn't mind free land settlements, free education and free universal healthcare.  I am tired of paying them taxes without representation permalink award report block reply\nThrowingway22 1 points 15 minutes ago Groomed to be the new generations William F Buckley, doomed to live in a time where there is no gate to keep. Desperately clinging to the money billionaire backers pour on him, unable to impact a thing. permalink award report block reply\ncwayfish 1 points 52 minutes ago Comment removed by community filter, pending further review. permalink award report block reply"}