{"id": "1ARK56iSOM", "contents": "693 Whites built the US from the ground up without handouts. SAVE AMERICA posted 5 days ago by journalist 74 comments award share report block Dr. Ricardo Duchesne @dr_duchesne • 6d Whites built the US from the ground up without handouts. This is Bertha, 6 years old, working at a canning company, South Carolina, 1912. She worked four hours before school and three after, and on Saturdays her job began at 4 AM. This history has been hidden from all schools.\n74 comments Sort by Top Top New Worst Old Save HappyFunBall 40 points 5 days ago Is this the famous \"white privilege\" I keep hearing about? permalink award report block reply corporateshizer 25 points 5 days ago The only \"white privilege\" that ever existed was the privilege of not having to live around non-whites. And the non-whites ruined that too. permalink parent award report block reply StayoutOfit 15 points 5 days ago The only \"white privilege\" that ever existed was the privilege of not having to live around non-whites. The greatest of all privileges and one that is severely taken for granted when had. permalink parent award report block reply TrumpAndGodWin 3 points 5 days ago Magical blame shifting to avoid responsibility. Slippery slopes etc are just excuses for inaction and not working together to solve the problem or prevent it in the first place. permalink parent award report block reply snoopy3210 -1 points 4 days ago All poor kids were working, including black kids you racist scum permalink parent award report block reply corporateshizer 5 points 4 days ago Doubtful, and irrelevant. Non-whites can choose to work or not work in their own societies, separate from white societies. Whites shouldn't have to live with any other groups if we don't want to. permalink parent award report block reply Bandanna1 9 points 5 days ago She had her slave take that picture. permalink parent award report block reply HeavenlyTrumpets 10 points 5 days ago lol permalink parent award report block reply LiteraIIyHitIer 5 points 4 days ago I swear there are people who actually believe that there was a point at which each white person in the US was issued a slave on birth. permalink parent award report block reply snoopy3210 1 points 4 days ago Little black guy next to her. You’re such bad racists, total losers! permalink parent award report block reply XxxRDTPRNxxX 1 points 4 days ago Yes. It's being bought and paid for in this photograph. permalink parent award report block reply possibletower -20 points 5 days ago If that is the case then why were the fat fuck white Founding Fathers using black slaves instead of simply hiring \"hardworking\" white people? What a retarded post and comment permalink parent award report block reply HeavenlyTrumpets 11 points 5 days ago the fact that some people did menial chores for less than 3% of white people does not mean they \"built\" the country... permalink parent award report block reply groomofthestool 4 points 5 days ago This. Plus, the only thing that the 'black slaves built' was the Cotton South. Which was destroyed by the Sherman in the War of Northern Aggression. IOW, nothing that is here today was built by blacks. permalink parent award report block reply littlemandancing 1 points 4 days ago It was the indians of course. permalink parent award report block reply Shih_Tabed 6 points 5 days ago To do the menial tasks while focusing on bigger things. permalink parent award report block reply SimaYi 4 points 5 days ago Slavery was the worst thing to ever happen to White people in America. Curse the jews who brought them here. White men didn't start slavery, we ended it. permalink parent award report block reply groomofthestool 2 points 5 days ago Which black slaves were these?? The black slaves that did the work were of the lowest level of intelligence/skill. PICKING COTTON!!! permalink parent award report block reply TenchuStealthAss 1 points 5 days ago Retarded take. Congrats, you're gay. permalink parent award report block reply load 1 more comments... HeavenlyTrumpets 22 points 5 days ago Whites built modern civilization from the ground up, not just the US. permalink award report block reply Ch3f4554551n 5 points 5 days ago Cro-Magnon, also known as Homo Sapiens Sapiens or EEMH, built everything that has ever lasted more than 100 years from the ground up. Everywhere on earth. Various other homonins interspeciated with them, like Denisovans, and that is where the orcs come from. permalink parent award report block reply Michalusmichalus 0 points 5 days ago You are Homo Sapien Sapiein. Cro Magnon was just Homo Sapien. As in early Homo Sapiens. permalink parent award report block reply possibletower -16 points 5 days ago If that is the case then why were the fat fuck white Founding Fathers using black slaves instead of simply hiring \"hardworking\" white people? What a retarded post and comment permalink parent award report block reply HeavenlyTrumpets 7 points 5 days ago This is too devoid of truth or historical knowledge to even entertain... permalink parent award report block reply bobbacringo 13 points 5 days ago The other races can fuck off. They didn't contribute shit. permalink award report block reply snoopy3210 2 points 4 days ago Stop lying, two wrongs doesn’t make it right. You exploit slaves in China for your electronics right now permalink parent award report block reply bobbacringo 0 points 4 days ago What the fuck are you even going on about? permalink parent award report block reply snoopy3210 0 points 4 days ago All poor people were exploited at the time (1912) regardless of race, and contributed to build it.\nAnd now we transferred that to slaves in foreign countries, that’s all. Nothing you said is true. permalink parent award report block reply bobbacringo 1 points 4 days ago I only speak the truth. You are the enemy. You are the communist that seeks to erase race. permalink parent award report block reply stars 0 points 5 days ago Black slaves? Chinese Laborers? permalink parent award report block reply bobbacringo 0 points 4 days ago Black slaves didn't build shit. Chinese laborers were for the railroads, and even then, it was mostly white men that built the rail roads. So fuck off liberal. permalink parent award report block reply BadBrainsBuzzcocks 10 points 5 days ago My white grandmother picked cotton. Her family eventually had her go live with a wealthier family and she cooked and cared for their children. No handouts. She retired a very wealthy woman due to hard work, a fantastic attitude, faith and perseverance. God bless her. permalink award report block reply LostElf 9 points 5 days ago Bertha wears workboots unironically. permalink award report block reply FlgPole 8 points 5 days ago We never got the freedom, from day 1. Ive been an employee of the UNITED STATES since the day I was born. I have never been paid. Everyone born in America is a slave (with a pension) permalink award report block reply Mortal_Wombat 2 points 4 days ago You got a pension?! permalink parent award report block reply FlgPole 1 points 4 days ago Paying into a pension is prima facie evidence of employment. Social Security is a pension permalink parent award report block reply sordfysh PRO 7 points 5 days ago Fuck that shit. When kids work in factories away from their family, you get what Leo Frank did to poor little Mary Fagan, and probably other little girls, too. permalink award report block reply possibletower -14 points 5 days ago If that is the case then why were the fat fuck white Founding Fathers using black slaves instead of simply hiring \"hardworking\" white people? What a retarded post by the stormfag OP permalink parent award report block reply SimaYi 3 points 5 days ago Jews gotta go. permalink parent award report block reply Handshake_Shmanshake 6 points 5 days ago Hopefully we never have to go through hardships like this again where kids have to be put to work at a factory for money. A head of household should be enough to put a roof over a family, but sadly, through $ and dependency, we're now being forced into conditions, where you could work yourself to death and not even be able to pay your \"rent\". permalink award report block reply PatriotDescendant 4 points 4 days ago In the early 60's, my mom and dad paid for extensive research into our family tree. We have several copies of the resulting genealogy. My father's side of the family arrived with the early Dutch settlers in the 1600s--I know the name of the boat, when and where it left, when and where it landed, and who was aboard. We are descended of Huguenots and have FIVE family members who fought with GW in the French and Indian wars and three in the revolution, two in the War of 1812, 12 in the civil war--some on both sides--1 in the SpanAm war, 3 in WWI, 5 in WWII (including dad), 2 in Gulf War 2. I am particularly fond of my grandfather, whose mom and dad passed away when he was 13. He lived with another relative who took great advantage of him, forcing him to dig coal instead of attending school. Nonetheless, he was successful, and when he met little me, fell in love and was so much fun, so kind, and he taught a wide array of man skills like carpentry. In particular, he was funny, always cracking jokes with friends and always happy. I learned these habits, incorporating them into daily life. My mom and dad remarked often: you're his spitting image. I do not hate anyone. I take everyone as an individual. But collectively? Today's immigrants are a pestilence. was eventually passed away from emphysema permalink award report block reply SimaYi 4 points 5 days ago When he was a child, my grandfather gathered spilt coal from railroad cars for 10 cents a burlap bag. permalink award report block reply irescreams 3 points 4 days ago My white German family came to NY as indentured servants to the UK monarchy in the 17th century. We only broke free by sending their son at 13 to live with the Mohawk Indians. My relatives fought in all the wars from french indian, fought with George Washington at Valley forge, survived louis and clark expedition, Japs in the pacific and battle of the bulge. Still broke and struggling.  Where is my white privilege? permalink award report block reply Michalusmichalus 3 points 5 days ago That's not hidden history. That is from the chapter on Unions stopping child abuse. permalink award report block reply MissileToad 2 points 4 days ago And after all that suffering they would beat you for being gay retards that allow non-american gay retards to come and bring back hard times. permalink award report block reply donshairynuts 2 points 4 days ago These are my people. permalink award report block reply BBvarn 2 points 4 days ago I grew up with relatives that thought a prized slab of pork fatback from the county food storage building, was bacon. permalink award report block reply Deplora 1 points 5 days ago In the South, there was a lot of free labor taken forcibly from slaves.  Intellectual honesty requires acknowledging that fact.  There were also a lot of white indentured servants, many of whom were children and early teenagers.  They didn't have much more freedom than slaves, but at least could look forward to an end date for their servitude (assuming they didn't die of disease first, which many did). permalink award report block reply HeavenlyTrumpets 14 points 5 days ago less than 3% of white people owned slaves.  there were also black people who owned slaves.  that is the problem with viewing slavery as some kind of historical lens through which to view white history.  the vast majority of white people did not have slaves, and the only people who benefitted were the very very few. permalink parent award report block reply SimaYi 7 points 5 days ago Who gives a fuck about slavery. It had been going on since the dawn of time. White people ended it wherever they ruled. Do we get thanks for that? Nope. We just have to endure our country polluted with nogs now. permalink parent award report block reply Deplora -5 points 5 days ago There was a whole lot of wealth produced by agricultural slave labor in the South.  As I pointed out, many whites also suffered as indentured servants.  And many completely free whites lived miserable lives, working themselves nearly or actually to death just trying to survive and keep a few of their healthiest children alive. Just because only a small minority of whites owned slaves doesn't mean that the wealth created by that slave labor was so minimal that it didn't make a significant contribution to \"building the US\".  The white plantation owners who accumulated significant wealth through the use of slave labor didn't keep that wealth under their mattresses.  They used it to buy goods and services, and thus directly and indirectly employed working class and middle class whites, and those whites certainly benefitted from the wealth created via slave labor. permalink parent award report block reply deleted 10 points 5 days ago SimaYi 4 points 5 days ago Any wealth created by slavery has been given back 1,000,000x from taking care of these useless creatures for centuries. permalink parent award report block reply Deplora -5 points 5 days ago Not really.  Especially since the wealth hadn't all remained in the South.  Nor was everything destroyed.  Some of my ancestors were there both before and after the Civil War.  Not aware of any who were actually slave owners, but they were pretty comfortable and weren't starting from scratch after the war. permalink parent award report block reply view 2 more comments... SimaYi 2 points 5 days ago Nobody cares. Fuck black slaves. I don't give a shit. Keep whipping them or send them back to where they belong: Africa, with the rest of their cursed race. permalink parent award report block reply groomofthestool 1 points 5 days ago and those whites certainly benefitted from the wealth created via slave labor. Until Sherman came. The South was utterly desolate after the War of Northern Aggression. What we see in America was NOT built by blacks. permalink parent award report block reply Shih_Tabed 6 points 5 days ago Try being Irish in New York City. permalink parent award report block reply Deplora -2 points 5 days ago They had it rough back in the day, but are doing pretty well now. permalink parent award report block reply Shih_Tabed 3 points 5 days ago Yeah, with Islam leadership.  They are doing great. permalink parent award report block reply MathletesFoot 2 points 5 days ago In the South, there was a lot of free labor taken forcibly from slaves. Lol, no one is going to acknowledge this because it has too many  implications about their situation here in the modern day. To contemplate the idea of one possibly being a slave directly conflicts with the 'commie socialists wanting free stuff' programming. permalink parent award report block reply _Sully_ 2 points 5 days ago What are you talking about? They fought hard to feed them, house them, and keep them safe. Honestly, the Democrats should be thanked for how much empathy they had for their community. They gave them jobs and helped keep prices down for the products the country needed. They wanted them to be counted as whole people but the racist northerners wouldn't allow it. permalink parent award report block reply possibletower -8 points 5 days ago \"Keep them safe\". LMAO. You stormfags with your fake history are fucking hilarious. Fuck the Confederacy. Bobby Lee and Jefferson Davis and all CSA governors and generals should have been hanged en masse on the National Mall for treason and their heads chopped off and placed on spikes on top of the White House to show what happens to traitors. permalink parent award report block reply _Sully_ 2 points 5 days ago Bro, I don't know how you didn't know I was being facetious to insult democrats. I mean I didn't include the loud clapper so you'd know but dang you should feel pretty embarrassed. permalink parent award report block reply SimaYi 1 points 5 days ago Fuck blacks and the jews like you who brought them here. It's a picture of a poor white girl and you jews immediately turn it to blacks. The time when you will be punished is coming. You have no idea how pissed we are. One spark and it's 110. permalink parent award report block reply load 5 more comments... possibletower -13 points 5 days ago If that is the case then why were the fat fuck white Founding Fathers using black slaves instead of simply hiring \"hardworking\" white people? What a retarded post permalink award report block reply I_Love_45-70_Gov 5 points 5 days ago Cope and seethe. 🤣🤣🤣🤣 permalink parent award report block reply DJT4547 3 points 5 days ago They were cheaper. Next question. permalink parent award report block reply\nHappyFunBall 40 points 5 days ago Is this the famous \"white privilege\" I keep hearing about? permalink award report block reply corporateshizer 25 points 5 days ago The only \"white privilege\" that ever existed was the privilege of not having to live around non-whites. And the non-whites ruined that too. permalink parent award report block reply StayoutOfit 15 points 5 days ago The only \"white privilege\" that ever existed was the privilege of not having to live around non-whites. The greatest of all privileges and one that is severely taken for granted when had. permalink parent award report block reply TrumpAndGodWin 3 points 5 days ago Magical blame shifting to avoid responsibility. Slippery slopes etc are just excuses for inaction and not working together to solve the problem or prevent it in the first place. permalink parent award report block reply snoopy3210 -1 points 4 days ago All poor kids were working, including black kids you racist scum permalink parent award report block reply corporateshizer 5 points 4 days ago Doubtful, and irrelevant. Non-whites can choose to work or not work in their own societies, separate from white societies. Whites shouldn't have to live with any other groups if we don't want to. permalink parent award report block reply Bandanna1 9 points 5 days ago She had her slave take that picture. permalink parent award report block reply HeavenlyTrumpets 10 points 5 days ago lol permalink parent award report block reply LiteraIIyHitIer 5 points 4 days ago I swear there are people who actually believe that there was a point at which each white person in the US was issued a slave on birth. permalink parent award report block reply snoopy3210 1 points 4 days ago Little black guy next to her. You’re such bad racists, total losers! permalink parent award report block reply XxxRDTPRNxxX 1 points 4 days ago Yes. It's being bought and paid for in this photograph. permalink parent award report block reply possibletower -20 points 5 days ago If that is the case then why were the fat fuck white Founding Fathers using black slaves instead of simply hiring \"hardworking\" white people? What a retarded post and comment permalink parent award report block reply HeavenlyTrumpets 11 points 5 days ago the fact that some people did menial chores for less than 3% of white people does not mean they \"built\" the country... permalink parent award report block reply groomofthestool 4 points 5 days ago This. Plus, the only thing that the 'black slaves built' was the Cotton South. Which was destroyed by the Sherman in the War of Northern Aggression. IOW, nothing that is here today was built by blacks. permalink parent award report block reply littlemandancing 1 points 4 days ago It was the indians of course. permalink parent award report block reply Shih_Tabed 6 points 5 days ago To do the menial tasks while focusing on bigger things. permalink parent award report block reply SimaYi 4 points 5 days ago Slavery was the worst thing to ever happen to White people in America. Curse the jews who brought them here. White men didn't start slavery, we ended it. permalink parent award report block reply groomofthestool 2 points 5 days ago Which black slaves were these?? The black slaves that did the work were of the lowest level of intelligence/skill. PICKING COTTON!!! permalink parent award report block reply TenchuStealthAss 1 points 5 days ago Retarded take. Congrats, you're gay. permalink parent award report block reply load 1 more comments...\ncorporateshizer 25 points 5 days ago The only \"white privilege\" that ever existed was the privilege of not having to live around non-whites. And the non-whites ruined that too. permalink parent award report block reply StayoutOfit 15 points 5 days ago The only \"white privilege\" that ever existed was the privilege of not having to live around non-whites. The greatest of all privileges and one that is severely taken for granted when had. permalink parent award report block reply TrumpAndGodWin 3 points 5 days ago Magical blame shifting to avoid responsibility. Slippery slopes etc are just excuses for inaction and not working together to solve the problem or prevent it in the first place. permalink parent award report block reply snoopy3210 -1 points 4 days ago All poor kids were working, including black kids you racist scum permalink parent award report block reply corporateshizer 5 points 4 days ago Doubtful, and irrelevant. Non-whites can choose to work or not work in their own societies, separate from white societies. Whites shouldn't have to live with any other groups if we don't want to. permalink parent award report block reply\nStayoutOfit 15 points 5 days ago The only \"white privilege\" that ever existed was the privilege of not having to live around non-whites. The greatest of all privileges and one that is severely taken for granted when had. permalink parent award report block reply\nTrumpAndGodWin 3 points 5 days ago Magical blame shifting to avoid responsibility. Slippery slopes etc are just excuses for inaction and not working together to solve the problem or prevent it in the first place. permalink parent award report block reply\nsnoopy3210 -1 points 4 days ago All poor kids were working, including black kids you racist scum permalink parent award report block reply corporateshizer 5 points 4 days ago Doubtful, and irrelevant. Non-whites can choose to work or not work in their own societies, separate from white societies. Whites shouldn't have to live with any other groups if we don't want to. permalink parent award report block reply\ncorporateshizer 5 points 4 days ago Doubtful, and irrelevant. Non-whites can choose to work or not work in their own societies, separate from white societies. Whites shouldn't have to live with any other groups if we don't want to. permalink parent award report block reply\nBandanna1 9 points 5 days ago She had her slave take that picture. permalink parent award report block reply HeavenlyTrumpets 10 points 5 days ago lol permalink parent award report block reply LiteraIIyHitIer 5 points 4 days ago I swear there are people who actually believe that there was a point at which each white person in the US was issued a slave on birth. permalink parent award report block reply\nHeavenlyTrumpets 10 points 5 days ago lol permalink parent award report block reply\nLiteraIIyHitIer 5 points 4 days ago I swear there are people who actually believe that there was a point at which each white person in the US was issued a slave on birth. permalink parent award report block reply\nsnoopy3210 1 points 4 days ago Little black guy next to her. You’re such bad racists, total losers! permalink parent award report block reply\nXxxRDTPRNxxX 1 points 4 days ago Yes. It's being bought and paid for in this photograph. permalink parent award report block reply\npossibletower -20 points 5 days ago If that is the case then why were the fat fuck white Founding Fathers using black slaves instead of simply hiring \"hardworking\" white people? What a retarded post and comment permalink parent award report block reply HeavenlyTrumpets 11 points 5 days ago the fact that some people did menial chores for less than 3% of white people does not mean they \"built\" the country... permalink parent award report block reply groomofthestool 4 points 5 days ago This. Plus, the only thing that the 'black slaves built' was the Cotton South. Which was destroyed by the Sherman in the War of Northern Aggression. IOW, nothing that is here today was built by blacks. permalink parent award report block reply littlemandancing 1 points 4 days ago It was the indians of course. permalink parent award report block reply Shih_Tabed 6 points 5 days ago To do the menial tasks while focusing on bigger things. permalink parent award report block reply SimaYi 4 points 5 days ago Slavery was the worst thing to ever happen to White people in America. Curse the jews who brought them here. White men didn't start slavery, we ended it. permalink parent award report block reply groomofthestool 2 points 5 days ago Which black slaves were these?? The black slaves that did the work were of the lowest level of intelligence/skill. PICKING COTTON!!! permalink parent award report block reply TenchuStealthAss 1 points 5 days ago Retarded take. Congrats, you're gay. permalink parent award report block reply load 1 more comments...\nHeavenlyTrumpets 11 points 5 days ago the fact that some people did menial chores for less than 3% of white people does not mean they \"built\" the country... permalink parent award report block reply groomofthestool 4 points 5 days ago This. Plus, the only thing that the 'black slaves built' was the Cotton South. Which was destroyed by the Sherman in the War of Northern Aggression. IOW, nothing that is here today was built by blacks. permalink parent award report block reply littlemandancing 1 points 4 days ago It was the indians of course. permalink parent award report block reply\ngroomofthestool 4 points 5 days ago This. Plus, the only thing that the 'black slaves built' was the Cotton South. Which was destroyed by the Sherman in the War of Northern Aggression. IOW, nothing that is here today was built by blacks. permalink parent award report block reply\nlittlemandancing 1 points 4 days ago It was the indians of course. permalink parent award report block reply\nShih_Tabed 6 points 5 days ago To do the menial tasks while focusing on bigger things. permalink parent award report block reply\nSimaYi 4 points 5 days ago Slavery was the worst thing to ever happen to White people in America. Curse the jews who brought them here. White men didn't start slavery, we ended it. permalink parent award report block reply\ngroomofthestool 2 points 5 days ago Which black slaves were these?? The black slaves that did the work were of the lowest level of intelligence/skill. PICKING COTTON!!! permalink parent award report block reply\nTenchuStealthAss 1 points 5 days ago Retarded take. Congrats, you're gay. permalink parent award report block reply\nHeavenlyTrumpets 22 points 5 days ago Whites built modern civilization from the ground up, not just the US. permalink award report block reply Ch3f4554551n 5 points 5 days ago Cro-Magnon, also known as Homo Sapiens Sapiens or EEMH, built everything that has ever lasted more than 100 years from the ground up. Everywhere on earth. Various other homonins interspeciated with them, like Denisovans, and that is where the orcs come from. permalink parent award report block reply Michalusmichalus 0 points 5 days ago You are Homo Sapien Sapiein. Cro Magnon was just Homo Sapien. As in early Homo Sapiens. permalink parent award report block reply possibletower -16 points 5 days ago If that is the case then why were the fat fuck white Founding Fathers using black slaves instead of simply hiring \"hardworking\" white people? What a retarded post and comment permalink parent award report block reply HeavenlyTrumpets 7 points 5 days ago This is too devoid of truth or historical knowledge to even entertain... permalink parent award report block reply\nCh3f4554551n 5 points 5 days ago Cro-Magnon, also known as Homo Sapiens Sapiens or EEMH, built everything that has ever lasted more than 100 years from the ground up. Everywhere on earth. Various other homonins interspeciated with them, like Denisovans, and that is where the orcs come from. permalink parent award report block reply Michalusmichalus 0 points 5 days ago You are Homo Sapien Sapiein. Cro Magnon was just Homo Sapien. As in early Homo Sapiens. permalink parent award report block reply\nMichalusmichalus 0 points 5 days ago You are Homo Sapien Sapiein. Cro Magnon was just Homo Sapien. As in early Homo Sapiens. permalink parent award report block reply\npossibletower -16 points 5 days ago If that is the case then why were the fat fuck white Founding Fathers using black slaves instead of simply hiring \"hardworking\" white people? What a retarded post and comment permalink parent award report block reply HeavenlyTrumpets 7 points 5 days ago This is too devoid of truth or historical knowledge to even entertain... permalink parent award report block reply\nHeavenlyTrumpets 7 points 5 days ago This is too devoid of truth or historical knowledge to even entertain... permalink parent award report block reply\nbobbacringo 13 points 5 days ago The other races can fuck off. They didn't contribute shit. permalink award report block reply snoopy3210 2 points 4 days ago Stop lying, two wrongs doesn’t make it right. You exploit slaves in China for your electronics right now permalink parent award report block reply bobbacringo 0 points 4 days ago What the fuck are you even going on about? permalink parent award report block reply snoopy3210 0 points 4 days ago All poor people were exploited at the time (1912) regardless of race, and contributed to build it.\nAnd now we transferred that to slaves in foreign countries, that’s all. Nothing you said is true. permalink parent award report block reply bobbacringo 1 points 4 days ago I only speak the truth. You are the enemy. You are the communist that seeks to erase race. permalink parent award report block reply stars 0 points 5 days ago Black slaves? Chinese Laborers? permalink parent award report block reply bobbacringo 0 points 4 days ago Black slaves didn't build shit. Chinese laborers were for the railroads, and even then, it was mostly white men that built the rail roads. So fuck off liberal. permalink parent award report block reply\nsnoopy3210 2 points 4 days ago Stop lying, two wrongs doesn’t make it right. You exploit slaves in China for your electronics right now permalink parent award report block reply bobbacringo 0 points 4 days ago What the fuck are you even going on about? permalink parent award report block reply snoopy3210 0 points 4 days ago All poor people were exploited at the time (1912) regardless of race, and contributed to build it.\nAnd now we transferred that to slaves in foreign countries, that’s all. Nothing you said is true. permalink parent award report block reply bobbacringo 1 points 4 days ago I only speak the truth. You are the enemy. You are the communist that seeks to erase race. permalink parent award report block reply\nbobbacringo 0 points 4 days ago What the fuck are you even going on about? permalink parent award report block reply snoopy3210 0 points 4 days ago All poor people were exploited at the time (1912) regardless of race, and contributed to build it.\nAnd now we transferred that to slaves in foreign countries, that’s all. Nothing you said is true. permalink parent award report block reply bobbacringo 1 points 4 days ago I only speak the truth. You are the enemy. You are the communist that seeks to erase race. permalink parent award report block reply\nsnoopy3210 0 points 4 days ago All poor people were exploited at the time (1912) regardless of race, and contributed to build it.\nAnd now we transferred that to slaves in foreign countries, that’s all. Nothing you said is true. permalink parent award report block reply bobbacringo 1 points 4 days ago I only speak the truth. You are the enemy. You are the communist that seeks to erase race. permalink parent award report block reply\nbobbacringo 1 points 4 days ago I only speak the truth. You are the enemy. You are the communist that seeks to erase race. permalink parent award report block reply\nstars 0 points 5 days ago Black slaves? Chinese Laborers? permalink parent award report block reply bobbacringo 0 points 4 days ago Black slaves didn't build shit. Chinese laborers were for the railroads, and even then, it was mostly white men that built the rail roads. So fuck off liberal. permalink parent award report block reply\nbobbacringo 0 points 4 days ago Black slaves didn't build shit. Chinese laborers were for the railroads, and even then, it was mostly white men that built the rail roads. So fuck off liberal. permalink parent award report block reply\nBadBrainsBuzzcocks 10 points 5 days ago My white grandmother picked cotton. Her family eventually had her go live with a wealthier family and she cooked and cared for their children. No handouts. She retired a very wealthy woman due to hard work, a fantastic attitude, faith and perseverance. God bless her. permalink award report block reply\nLostElf 9 points 5 days ago Bertha wears workboots unironically. permalink award report block reply\nFlgPole 8 points 5 days ago We never got the freedom, from day 1. Ive been an employee of the UNITED STATES since the day I was born. I have never been paid. Everyone born in America is a slave (with a pension) permalink award report block reply Mortal_Wombat 2 points 4 days ago You got a pension?! permalink parent award report block reply FlgPole 1 points 4 days ago Paying into a pension is prima facie evidence of employment. Social Security is a pension permalink parent award report block reply\nMortal_Wombat 2 points 4 days ago You got a pension?! permalink parent award report block reply FlgPole 1 points 4 days ago Paying into a pension is prima facie evidence of employment. Social Security is a pension permalink parent award report block reply\nFlgPole 1 points 4 days ago Paying into a pension is prima facie evidence of employment. Social Security is a pension permalink parent award report block reply\nsordfysh PRO 7 points 5 days ago Fuck that shit. When kids work in factories away from their family, you get what Leo Frank did to poor little Mary Fagan, and probably other little girls, too. permalink award report block reply possibletower -14 points 5 days ago If that is the case then why were the fat fuck white Founding Fathers using black slaves instead of simply hiring \"hardworking\" white people? What a retarded post by the stormfag OP permalink parent award report block reply SimaYi 3 points 5 days ago Jews gotta go. permalink parent award report block reply\npossibletower -14 points 5 days ago If that is the case then why were the fat fuck white Founding Fathers using black slaves instead of simply hiring \"hardworking\" white people? What a retarded post by the stormfag OP permalink parent award report block reply SimaYi 3 points 5 days ago Jews gotta go. permalink parent award report block reply\nSimaYi 3 points 5 days ago Jews gotta go. permalink parent award report block reply\nHandshake_Shmanshake 6 points 5 days ago Hopefully we never have to go through hardships like this again where kids have to be put to work at a factory for money. A head of household should be enough to put a roof over a family, but sadly, through $ and dependency, we're now being forced into conditions, where you could work yourself to death and not even be able to pay your \"rent\". permalink award report block reply\nPatriotDescendant 4 points 4 days ago In the early 60's, my mom and dad paid for extensive research into our family tree. We have several copies of the resulting genealogy. My father's side of the family arrived with the early Dutch settlers in the 1600s--I know the name of the boat, when and where it left, when and where it landed, and who was aboard. We are descended of Huguenots and have FIVE family members who fought with GW in the French and Indian wars and three in the revolution, two in the War of 1812, 12 in the civil war--some on both sides--1 in the SpanAm war, 3 in WWI, 5 in WWII (including dad), 2 in Gulf War 2. I am particularly fond of my grandfather, whose mom and dad passed away when he was 13. He lived with another relative who took great advantage of him, forcing him to dig coal instead of attending school. Nonetheless, he was successful, and when he met little me, fell in love and was so much fun, so kind, and he taught a wide array of man skills like carpentry. In particular, he was funny, always cracking jokes with friends and always happy. I learned these habits, incorporating them into daily life. My mom and dad remarked often: you're his spitting image. I do not hate anyone. I take everyone as an individual. But collectively? Today's immigrants are a pestilence. was eventually passed away from emphysema permalink award report block reply\nSimaYi 4 points 5 days ago When he was a child, my grandfather gathered spilt coal from railroad cars for 10 cents a burlap bag. permalink award report block reply\nirescreams 3 points 4 days ago My white German family came to NY as indentured servants to the UK monarchy in the 17th century. We only broke free by sending their son at 13 to live with the Mohawk Indians. My relatives fought in all the wars from french indian, fought with George Washington at Valley forge, survived louis and clark expedition, Japs in the pacific and battle of the bulge. Still broke and struggling.  Where is my white privilege? permalink award report block reply\nMichalusmichalus 3 points 5 days ago That's not hidden history. That is from the chapter on Unions stopping child abuse. permalink award report block reply\nMissileToad 2 points 4 days ago And after all that suffering they would beat you for being gay retards that allow non-american gay retards to come and bring back hard times. permalink award report block reply\ndonshairynuts 2 points 4 days ago These are my people. permalink award report block reply\nBBvarn 2 points 4 days ago I grew up with relatives that thought a prized slab of pork fatback from the county food storage building, was bacon. permalink award report block reply\nDeplora 1 points 5 days ago In the South, there was a lot of free labor taken forcibly from slaves.  Intellectual honesty requires acknowledging that fact.  There were also a lot of white indentured servants, many of whom were children and early teenagers.  They didn't have much more freedom than slaves, but at least could look forward to an end date for their servitude (assuming they didn't die of disease first, which many did). permalink award report block reply HeavenlyTrumpets 14 points 5 days ago less than 3% of white people owned slaves.  there were also black people who owned slaves.  that is the problem with viewing slavery as some kind of historical lens through which to view white history.  the vast majority of white people did not have slaves, and the only people who benefitted were the very very few. permalink parent award report block reply SimaYi 7 points 5 days ago Who gives a fuck about slavery. It had been going on since the dawn of time. White people ended it wherever they ruled. Do we get thanks for that? Nope. We just have to endure our country polluted with nogs now. permalink parent award report block reply Deplora -5 points 5 days ago There was a whole lot of wealth produced by agricultural slave labor in the South.  As I pointed out, many whites also suffered as indentured servants.  And many completely free whites lived miserable lives, working themselves nearly or actually to death just trying to survive and keep a few of their healthiest children alive. Just because only a small minority of whites owned slaves doesn't mean that the wealth created by that slave labor was so minimal that it didn't make a significant contribution to \"building the US\".  The white plantation owners who accumulated significant wealth through the use of slave labor didn't keep that wealth under their mattresses.  They used it to buy goods and services, and thus directly and indirectly employed working class and middle class whites, and those whites certainly benefitted from the wealth created via slave labor. permalink parent award report block reply deleted 10 points 5 days ago SimaYi 4 points 5 days ago Any wealth created by slavery has been given back 1,000,000x from taking care of these useless creatures for centuries. permalink parent award report block reply Deplora -5 points 5 days ago Not really.  Especially since the wealth hadn't all remained in the South.  Nor was everything destroyed.  Some of my ancestors were there both before and after the Civil War.  Not aware of any who were actually slave owners, but they were pretty comfortable and weren't starting from scratch after the war. permalink parent award report block reply view 2 more comments... SimaYi 2 points 5 days ago Nobody cares. Fuck black slaves. I don't give a shit. Keep whipping them or send them back to where they belong: Africa, with the rest of their cursed race. permalink parent award report block reply groomofthestool 1 points 5 days ago and those whites certainly benefitted from the wealth created via slave labor. Until Sherman came. The South was utterly desolate after the War of Northern Aggression. What we see in America was NOT built by blacks. permalink parent award report block reply Shih_Tabed 6 points 5 days ago Try being Irish in New York City. permalink parent award report block reply Deplora -2 points 5 days ago They had it rough back in the day, but are doing pretty well now. permalink parent award report block reply Shih_Tabed 3 points 5 days ago Yeah, with Islam leadership.  They are doing great. permalink parent award report block reply MathletesFoot 2 points 5 days ago In the South, there was a lot of free labor taken forcibly from slaves. Lol, no one is going to acknowledge this because it has too many  implications about their situation here in the modern day. To contemplate the idea of one possibly being a slave directly conflicts with the 'commie socialists wanting free stuff' programming. permalink parent award report block reply _Sully_ 2 points 5 days ago What are you talking about? They fought hard to feed them, house them, and keep them safe. Honestly, the Democrats should be thanked for how much empathy they had for their community. They gave them jobs and helped keep prices down for the products the country needed. They wanted them to be counted as whole people but the racist northerners wouldn't allow it. permalink parent award report block reply possibletower -8 points 5 days ago \"Keep them safe\". LMAO. You stormfags with your fake history are fucking hilarious. Fuck the Confederacy. Bobby Lee and Jefferson Davis and all CSA governors and generals should have been hanged en masse on the National Mall for treason and their heads chopped off and placed on spikes on top of the White House to show what happens to traitors. permalink parent award report block reply _Sully_ 2 points 5 days ago Bro, I don't know how you didn't know I was being facetious to insult democrats. I mean I didn't include the loud clapper so you'd know but dang you should feel pretty embarrassed. permalink parent award report block reply SimaYi 1 points 5 days ago Fuck blacks and the jews like you who brought them here. It's a picture of a poor white girl and you jews immediately turn it to blacks. The time when you will be punished is coming. You have no idea how pissed we are. One spark and it's 110. permalink parent award report block reply load 5 more comments...\nHeavenlyTrumpets 14 points 5 days ago less than 3% of white people owned slaves.  there were also black people who owned slaves.  that is the problem with viewing slavery as some kind of historical lens through which to view white history.  the vast majority of white people did not have slaves, and the only people who benefitted were the very very few. permalink parent award report block reply SimaYi 7 points 5 days ago Who gives a fuck about slavery. It had been going on since the dawn of time. White people ended it wherever they ruled. Do we get thanks for that? Nope. We just have to endure our country polluted with nogs now. permalink parent award report block reply Deplora -5 points 5 days ago There was a whole lot of wealth produced by agricultural slave labor in the South.  As I pointed out, many whites also suffered as indentured servants.  And many completely free whites lived miserable lives, working themselves nearly or actually to death just trying to survive and keep a few of their healthiest children alive. Just because only a small minority of whites owned slaves doesn't mean that the wealth created by that slave labor was so minimal that it didn't make a significant contribution to \"building the US\".  The white plantation owners who accumulated significant wealth through the use of slave labor didn't keep that wealth under their mattresses.  They used it to buy goods and services, and thus directly and indirectly employed working class and middle class whites, and those whites certainly benefitted from the wealth created via slave labor. permalink parent award report block reply deleted 10 points 5 days ago SimaYi 4 points 5 days ago Any wealth created by slavery has been given back 1,000,000x from taking care of these useless creatures for centuries. permalink parent award report block reply Deplora -5 points 5 days ago Not really.  Especially since the wealth hadn't all remained in the South.  Nor was everything destroyed.  Some of my ancestors were there both before and after the Civil War.  Not aware of any who were actually slave owners, but they were pretty comfortable and weren't starting from scratch after the war. permalink parent award report block reply view 2 more comments... SimaYi 2 points 5 days ago Nobody cares. Fuck black slaves. I don't give a shit. Keep whipping them or send them back to where they belong: Africa, with the rest of their cursed race. permalink parent award report block reply groomofthestool 1 points 5 days ago and those whites certainly benefitted from the wealth created via slave labor. Until Sherman came. The South was utterly desolate after the War of Northern Aggression. What we see in America was NOT built by blacks. permalink parent award report block reply\nSimaYi 7 points 5 days ago Who gives a fuck about slavery. It had been going on since the dawn of time. White people ended it wherever they ruled. Do we get thanks for that? Nope. We just have to endure our country polluted with nogs now. permalink parent award report block reply\nDeplora -5 points 5 days ago There was a whole lot of wealth produced by agricultural slave labor in the South.  As I pointed out, many whites also suffered as indentured servants.  And many completely free whites lived miserable lives, working themselves nearly or actually to death just trying to survive and keep a few of their healthiest children alive. Just because only a small minority of whites owned slaves doesn't mean that the wealth created by that slave labor was so minimal that it didn't make a significant contribution to \"building the US\".  The white plantation owners who accumulated significant wealth through the use of slave labor didn't keep that wealth under their mattresses.  They used it to buy goods and services, and thus directly and indirectly employed working class and middle class whites, and those whites certainly benefitted from the wealth created via slave labor. permalink parent award report block reply deleted 10 points 5 days ago SimaYi 4 points 5 days ago Any wealth created by slavery has been given back 1,000,000x from taking care of these useless creatures for centuries. permalink parent award report block reply Deplora -5 points 5 days ago Not really.  Especially since the wealth hadn't all remained in the South.  Nor was everything destroyed.  Some of my ancestors were there both before and after the Civil War.  Not aware of any who were actually slave owners, but they were pretty comfortable and weren't starting from scratch after the war. permalink parent award report block reply view 2 more comments... SimaYi 2 points 5 days ago Nobody cares. Fuck black slaves. I don't give a shit. Keep whipping them or send them back to where they belong: Africa, with the rest of their cursed race. permalink parent award report block reply groomofthestool 1 points 5 days ago and those whites certainly benefitted from the wealth created via slave labor. Until Sherman came. The South was utterly desolate after the War of Northern Aggression. What we see in America was NOT built by blacks. permalink parent award report block reply\ndeleted 10 points 5 days ago SimaYi 4 points 5 days ago Any wealth created by slavery has been given back 1,000,000x from taking care of these useless creatures for centuries. permalink parent award report block reply Deplora -5 points 5 days ago Not really.  Especially since the wealth hadn't all remained in the South.  Nor was everything destroyed.  Some of my ancestors were there both before and after the Civil War.  Not aware of any who were actually slave owners, but they were pretty comfortable and weren't starting from scratch after the war. permalink parent award report block reply view 2 more comments...\nSimaYi 4 points 5 days ago Any wealth created by slavery has been given back 1,000,000x from taking care of these useless creatures for centuries. permalink parent award report block reply\nDeplora -5 points 5 days ago Not really.  Especially since the wealth hadn't all remained in the South.  Nor was everything destroyed.  Some of my ancestors were there both before and after the Civil War.  Not aware of any who were actually slave owners, but they were pretty comfortable and weren't starting from scratch after the war. permalink parent award report block reply view 2 more comments...\nSimaYi 2 points 5 days ago Nobody cares. Fuck black slaves. I don't give a shit. Keep whipping them or send them back to where they belong: Africa, with the rest of their cursed race. permalink parent award report block reply\ngroomofthestool 1 points 5 days ago and those whites certainly benefitted from the wealth created via slave labor. Until Sherman came. The South was utterly desolate after the War of Northern Aggression. What we see in America was NOT built by blacks. permalink parent award report block reply\nShih_Tabed 6 points 5 days ago Try being Irish in New York City. permalink parent award report block reply Deplora -2 points 5 days ago They had it rough back in the day, but are doing pretty well now. permalink parent award report block reply Shih_Tabed 3 points 5 days ago Yeah, with Islam leadership.  They are doing great. permalink parent award report block reply\nDeplora -2 points 5 days ago They had it rough back in the day, but are doing pretty well now. permalink parent award report block reply Shih_Tabed 3 points 5 days ago Yeah, with Islam leadership.  They are doing great. permalink parent award report block reply\nShih_Tabed 3 points 5 days ago Yeah, with Islam leadership.  They are doing great. permalink parent award report block reply\nMathletesFoot 2 points 5 days ago In the South, there was a lot of free labor taken forcibly from slaves. Lol, no one is going to acknowledge this because it has too many  implications about their situation here in the modern day. To contemplate the idea of one possibly being a slave directly conflicts with the 'commie socialists wanting free stuff' programming. permalink parent award report block reply\n_Sully_ 2 points 5 days ago What are you talking about? They fought hard to feed them, house them, and keep them safe. Honestly, the Democrats should be thanked for how much empathy they had for their community. They gave them jobs and helped keep prices down for the products the country needed. They wanted them to be counted as whole people but the racist northerners wouldn't allow it. permalink parent award report block reply possibletower -8 points 5 days ago \"Keep them safe\". LMAO. You stormfags with your fake history are fucking hilarious. Fuck the Confederacy. Bobby Lee and Jefferson Davis and all CSA governors and generals should have been hanged en masse on the National Mall for treason and their heads chopped off and placed on spikes on top of the White House to show what happens to traitors. permalink parent award report block reply _Sully_ 2 points 5 days ago Bro, I don't know how you didn't know I was being facetious to insult democrats. I mean I didn't include the loud clapper so you'd know but dang you should feel pretty embarrassed. permalink parent award report block reply SimaYi 1 points 5 days ago Fuck blacks and the jews like you who brought them here. It's a picture of a poor white girl and you jews immediately turn it to blacks. The time when you will be punished is coming. You have no idea how pissed we are. One spark and it's 110. permalink parent award report block reply\npossibletower -8 points 5 days ago \"Keep them safe\". LMAO. You stormfags with your fake history are fucking hilarious. Fuck the Confederacy. Bobby Lee and Jefferson Davis and all CSA governors and generals should have been hanged en masse on the National Mall for treason and their heads chopped off and placed on spikes on top of the White House to show what happens to traitors. permalink parent award report block reply _Sully_ 2 points 5 days ago Bro, I don't know how you didn't know I was being facetious to insult democrats. I mean I didn't include the loud clapper so you'd know but dang you should feel pretty embarrassed. permalink parent award report block reply SimaYi 1 points 5 days ago Fuck blacks and the jews like you who brought them here. It's a picture of a poor white girl and you jews immediately turn it to blacks. The time when you will be punished is coming. You have no idea how pissed we are. One spark and it's 110. permalink parent award report block reply\n_Sully_ 2 points 5 days ago Bro, I don't know how you didn't know I was being facetious to insult democrats. I mean I didn't include the loud clapper so you'd know but dang you should feel pretty embarrassed. permalink parent award report block reply\nSimaYi 1 points 5 days ago Fuck blacks and the jews like you who brought them here. It's a picture of a poor white girl and you jews immediately turn it to blacks. The time when you will be punished is coming. You have no idea how pissed we are. One spark and it's 110. permalink parent award report block reply\npossibletower -13 points 5 days ago If that is the case then why were the fat fuck white Founding Fathers using black slaves instead of simply hiring \"hardworking\" white people? What a retarded post permalink award report block reply I_Love_45-70_Gov 5 points 5 days ago Cope and seethe. 🤣🤣🤣🤣 permalink parent award report block reply DJT4547 3 points 5 days ago They were cheaper. Next question. permalink parent award report block reply\nI_Love_45-70_Gov 5 points 5 days ago Cope and seethe. 🤣🤣🤣🤣 permalink parent award report block reply\nDJT4547 3 points 5 days ago They were cheaper. Next question. permalink parent award report block reply"}