{"id": "1ARK9pgy8N", "contents": "170 A Nickle posted 30 minutes ago by Trick 29 comments award share download report block\n29 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Imthebest 13 points 25 minutes ago Nickel OP 😔 permalink award report block reply rebuildingMyself 11 points 20 minutes ago One step closer to a cashless society where every transaction is 100% tracked somewhere. permalink award report block reply LizardKingx002 3 points 12 minutes ago Use cash for the Majority of your purchases and limit your credit card usage permalink parent award report block reply AndanteAndante 2 points 3 minutes ago Our supermarket is buying pennies for 2 cents on Sunday. Giving out their gift cards. Maximum $100. I wonder if it's related to this or just a promotional gimmick. permalink parent award report block reply RedStoneDeepState 2 points 5 minutes ago If you want a society that uses cash you need the cash to be large enough to do meaningful transactions with. We need a 200, 500, 1000, 2000, 5000, and 10000 bill. permalink parent award report block reply FrozenEagle 6 points 27 minutes ago Literally thinkflation. permalink award report block reply redditadminssuckit 5 points 25 minutes ago BUSINESS IDEA:   Market the shit out of my own privately minted penny right now with Penny's image on the front,  a NY Subway car on the reverse, and the words: \"You can't cancel this Penny\" above it permalink award report block reply Luvs_2_Bop 3 points 21 minutes ago I’d chip in some of my remaining pennies to crowd-fund that penny! permalink parent award report block reply 2020Gop 3 points 18 minutes ago THIS MAKES CENTS! permalink parent award report block reply redditadminssuckit 3 points 16 minutes ago No dad jokes on my Dime permalink parent award report block reply 2020Gop 2 points 7 minutes ago What r u gonna do? Sue-san B Anthony me? permalink parent award report block reply redditadminssuckit 1 points 3 minutes ago I'll give you no Quarter in that battle permalink parent award report block reply 24601 3 points 22 minutes ago It costs more than $0.01 to mint $0.01 .... I'm all for saving taxpayer funds.  Perhaps we should decentralize legal currency to the public... and include weights of gold in mix. permalink award report block reply booblitchutz 4 points 14 minutes ago I have so many pennies just sitting in a bowl in my house. Who knew I was sitttin on a GOLDMINE?!! permalink parent award report block reply ohwell316 1 points 12 minutes ago I wonder what they will be worth someday permalink parent award report block reply RedStoneDeepState 1 points 4 minutes ago Perhaps we should decentralize legal currency to the public... So hand over centralization to China. permalink parent award report block reply Josemarti 1 points 2 minutes ago Well we should but two issues here. Minting coins is actually in the constitution unlike other bullshit and it is already supposed to be gold and silver coins. permalink parent award report block reply JohnMiller2020 3 points 20 minutes ago We did this in Canada more thana decade ago. It wasn't disruptive. It didn't really change anything except saving the mint some taxpayer dollars. Hope your rounding skills are developed! permalink award report block reply 1amS3lly 2 points 6 minutes ago The act itself is an exercise in rational thinking: why make something that costs more to manufacture than its literal printed value? However, the truth behind the “rational” executive decision to stop minting penny’s is that the money we make and save is constantly worth less, and less, and less. Fiat currency has to go. Constant forever inflation has to go. permalink parent award report block reply DeepFrozenOcean 1 points 7 minutes ago Also, there's this one guy that sticks all the pennies up his ass. Ass-pennies. permalink parent award report block reply Kpak76 3 points 19 minutes ago I don't think trump is valuing the penny correctly.  The value is in the use of it, not how much it's worth. permalink award report block reply booblitchutz 1 points 13 minutes ago That’s the basic concept of fiat currency. permalink parent award report block reply MakinBacon 2 points 17 minutes ago nah.....Rudransh said he would give me 10 \"non-liberal thoughts\" for a nickle permalink award report block reply Taqiyya_Mockingbird 2 points 17 minutes ago That’s a liberal woman, you have to round down permalink award report block reply booblitchutz 2 points 16 minutes ago From Casablanca: Ilsa - “A franc for your thoughts…” Rick - “In America they'd bring only a penny, and, huh, I guess that's about all they're worth.” permalink award report block reply Appeal2Heaven98 2 points 15 minutes ago Nickel* It was right there, buddy. permalink award report block reply LearnAboutRoaches 2 points 15 minutes ago Fun fact: the last 1000000 pennies minted are not even going to the public, but to random personal collectors and archivists.. Because you can profit a shit load from suckers starting with this fucking guy and then the ebay faggots and all the rest of them https://www.youtube.com/watch?v=H4EwXd_olYI permalink award report block reply MrMcGreenGenes 1 points 20 minutes ago Pennies from Heaven The phrase \"Pennies from Heaven\" originates as a metaphorical update of \"manna from heaven,\" referencing divine provision in the Bible, but evolved to symbolize unexpected good fortune, particularly small amounts of money  The phrase gained widespread recognition through a 1936 American popular song titled \"Pennies from Heaven,\" composed by Arthur Johnston with lyrics by Johnny Burke  The song was introduced by Bing Crosby in the 1936 film of the same name, directed by Norman Z. McLeod, and became a major hit, topping the charts for ten weeks and later inducted into the Grammy Hall of Fame The 1936 film, starring Bing Crosby, Madge Evans, and Edith Fellows, follows Larry Poole, a man released from prison on a false charge, who fulfills a dying inmate's request to help a family named Smith, only to discover they are a young girl and her elderly grandfather in need  The story centers on themes of hope and redemption, underscored by the film's memorable musical numbers, including the title song The phrase was later adapted into a groundbreaking British television drama series titled Pennies from Heaven , which debuted on 7 March 1978, written by Dennis Potter  The series, set in 1930s Britain, followed the struggles of sheet-music salesman Arthur Parker, using contemporary songs to contrast the bleak reality of the Great Depression with the characters' fantasies  The series was critically acclaimed, winning a BAFTA for Most Original Series and launching the career of Bob Hoskins This BBC series inspired a 1981 American film adaptation titled Pennies from Heaven , directed by Herbert Ross and written by Dennis Potter, which relocated the story to Depression-era Chicago  The film stars Steve Martin as Arthur Parker, Bernadette Peters as schoolteacher Eileen, and Christopher Walken as a pimp  The film features surreal musical sequences where characters lip-sync and dance to 1920s–30s hits like \"Let's Misbehave\" and \"Life Is Just a Bowl of Cherries,\" juxtaposing the characters' grim realities with their dreamlike fantasies  While the film received positive critical reception, it was a box office failure, grossing only a fraction of its budget, and earned three Academy Award nominations without winning The 1981 film has since gained a cult following for its unique blend of drama, musical fantasy, and social commentary, with its themes of escapism and the destructive nature of illusion resonating with audiences  The phrase has also inspired fictional abilities in fan-created content, such as the power to summon and hurl coins with superhuman speed, often tied to the idea of \"pennies from heaven\" as a metaphor for unexpected fortune permalink award report block reply lostmyoldpassword 1 points 7 minutes ago Jesus Christ, I'm gonna see this cartoon until the end of time - with various bubbles over her head vaguely blaming \"boomers\" for all of the worlds ills.  Thanks for giving them the perfect template. permalink award report block reply MemoryHoleyeO 1 points 6 minutes ago Inflation and printing money non stop did this. permalink award report block reply\nImthebest 13 points 25 minutes ago Nickel OP 😔 permalink award report block reply\nrebuildingMyself 11 points 20 minutes ago One step closer to a cashless society where every transaction is 100% tracked somewhere. permalink award report block reply LizardKingx002 3 points 12 minutes ago Use cash for the Majority of your purchases and limit your credit card usage permalink parent award report block reply AndanteAndante 2 points 3 minutes ago Our supermarket is buying pennies for 2 cents on Sunday. Giving out their gift cards. Maximum $100. I wonder if it's related to this or just a promotional gimmick. permalink parent award report block reply RedStoneDeepState 2 points 5 minutes ago If you want a society that uses cash you need the cash to be large enough to do meaningful transactions with. We need a 200, 500, 1000, 2000, 5000, and 10000 bill. permalink parent award report block reply\nLizardKingx002 3 points 12 minutes ago Use cash for the Majority of your purchases and limit your credit card usage permalink parent award report block reply AndanteAndante 2 points 3 minutes ago Our supermarket is buying pennies for 2 cents on Sunday. Giving out their gift cards. Maximum $100. I wonder if it's related to this or just a promotional gimmick. permalink parent award report block reply\nAndanteAndante 2 points 3 minutes ago Our supermarket is buying pennies for 2 cents on Sunday. Giving out their gift cards. Maximum $100. I wonder if it's related to this or just a promotional gimmick. permalink parent award report block reply\nRedStoneDeepState 2 points 5 minutes ago If you want a society that uses cash you need the cash to be large enough to do meaningful transactions with. We need a 200, 500, 1000, 2000, 5000, and 10000 bill. permalink parent award report block reply\nFrozenEagle 6 points 27 minutes ago Literally thinkflation. permalink award report block reply\nredditadminssuckit 5 points 25 minutes ago BUSINESS IDEA:   Market the shit out of my own privately minted penny right now with Penny's image on the front,  a NY Subway car on the reverse, and the words: \"You can't cancel this Penny\" above it permalink award report block reply Luvs_2_Bop 3 points 21 minutes ago I’d chip in some of my remaining pennies to crowd-fund that penny! permalink parent award report block reply 2020Gop 3 points 18 minutes ago THIS MAKES CENTS! permalink parent award report block reply redditadminssuckit 3 points 16 minutes ago No dad jokes on my Dime permalink parent award report block reply 2020Gop 2 points 7 minutes ago What r u gonna do? Sue-san B Anthony me? permalink parent award report block reply redditadminssuckit 1 points 3 minutes ago I'll give you no Quarter in that battle permalink parent award report block reply\nLuvs_2_Bop 3 points 21 minutes ago I’d chip in some of my remaining pennies to crowd-fund that penny! permalink parent award report block reply\n2020Gop 3 points 18 minutes ago THIS MAKES CENTS! permalink parent award report block reply redditadminssuckit 3 points 16 minutes ago No dad jokes on my Dime permalink parent award report block reply 2020Gop 2 points 7 minutes ago What r u gonna do? Sue-san B Anthony me? permalink parent award report block reply redditadminssuckit 1 points 3 minutes ago I'll give you no Quarter in that battle permalink parent award report block reply\nredditadminssuckit 3 points 16 minutes ago No dad jokes on my Dime permalink parent award report block reply 2020Gop 2 points 7 minutes ago What r u gonna do? Sue-san B Anthony me? permalink parent award report block reply redditadminssuckit 1 points 3 minutes ago I'll give you no Quarter in that battle permalink parent award report block reply\n2020Gop 2 points 7 minutes ago What r u gonna do? Sue-san B Anthony me? permalink parent award report block reply redditadminssuckit 1 points 3 minutes ago I'll give you no Quarter in that battle permalink parent award report block reply\nredditadminssuckit 1 points 3 minutes ago I'll give you no Quarter in that battle permalink parent award report block reply\n24601 3 points 22 minutes ago It costs more than $0.01 to mint $0.01 .... I'm all for saving taxpayer funds.  Perhaps we should decentralize legal currency to the public... and include weights of gold in mix. permalink award report block reply booblitchutz 4 points 14 minutes ago I have so many pennies just sitting in a bowl in my house. Who knew I was sitttin on a GOLDMINE?!! permalink parent award report block reply ohwell316 1 points 12 minutes ago I wonder what they will be worth someday permalink parent award report block reply RedStoneDeepState 1 points 4 minutes ago Perhaps we should decentralize legal currency to the public... So hand over centralization to China. permalink parent award report block reply Josemarti 1 points 2 minutes ago Well we should but two issues here. Minting coins is actually in the constitution unlike other bullshit and it is already supposed to be gold and silver coins. permalink parent award report block reply\nbooblitchutz 4 points 14 minutes ago I have so many pennies just sitting in a bowl in my house. Who knew I was sitttin on a GOLDMINE?!! permalink parent award report block reply ohwell316 1 points 12 minutes ago I wonder what they will be worth someday permalink parent award report block reply\nohwell316 1 points 12 minutes ago I wonder what they will be worth someday permalink parent award report block reply\nRedStoneDeepState 1 points 4 minutes ago Perhaps we should decentralize legal currency to the public... So hand over centralization to China. permalink parent award report block reply\nJosemarti 1 points 2 minutes ago Well we should but two issues here. Minting coins is actually in the constitution unlike other bullshit and it is already supposed to be gold and silver coins. permalink parent award report block reply\nJohnMiller2020 3 points 20 minutes ago We did this in Canada more thana decade ago. It wasn't disruptive. It didn't really change anything except saving the mint some taxpayer dollars. Hope your rounding skills are developed! permalink award report block reply 1amS3lly 2 points 6 minutes ago The act itself is an exercise in rational thinking: why make something that costs more to manufacture than its literal printed value? However, the truth behind the “rational” executive decision to stop minting penny’s is that the money we make and save is constantly worth less, and less, and less. Fiat currency has to go. Constant forever inflation has to go. permalink parent award report block reply DeepFrozenOcean 1 points 7 minutes ago Also, there's this one guy that sticks all the pennies up his ass. Ass-pennies. permalink parent award report block reply\n1amS3lly 2 points 6 minutes ago The act itself is an exercise in rational thinking: why make something that costs more to manufacture than its literal printed value? However, the truth behind the “rational” executive decision to stop minting penny’s is that the money we make and save is constantly worth less, and less, and less. Fiat currency has to go. Constant forever inflation has to go. permalink parent award report block reply\nDeepFrozenOcean 1 points 7 minutes ago Also, there's this one guy that sticks all the pennies up his ass. Ass-pennies. permalink parent award report block reply\nKpak76 3 points 19 minutes ago I don't think trump is valuing the penny correctly.  The value is in the use of it, not how much it's worth. permalink award report block reply booblitchutz 1 points 13 minutes ago That’s the basic concept of fiat currency. permalink parent award report block reply\nbooblitchutz 1 points 13 minutes ago That’s the basic concept of fiat currency. permalink parent award report block reply\nMakinBacon 2 points 17 minutes ago nah.....Rudransh said he would give me 10 \"non-liberal thoughts\" for a nickle permalink award report block reply\nTaqiyya_Mockingbird 2 points 17 minutes ago That’s a liberal woman, you have to round down permalink award report block reply\nbooblitchutz 2 points 16 minutes ago From Casablanca: Ilsa - “A franc for your thoughts…” Rick - “In America they'd bring only a penny, and, huh, I guess that's about all they're worth.” permalink award report block reply\nAppeal2Heaven98 2 points 15 minutes ago Nickel* It was right there, buddy. permalink award report block reply\nLearnAboutRoaches 2 points 15 minutes ago Fun fact: the last 1000000 pennies minted are not even going to the public, but to random personal collectors and archivists.. Because you can profit a shit load from suckers starting with this fucking guy and then the ebay faggots and all the rest of them https://www.youtube.com/watch?v=H4EwXd_olYI permalink award report block reply\nMrMcGreenGenes 1 points 20 minutes ago Pennies from Heaven The phrase \"Pennies from Heaven\" originates as a metaphorical update of \"manna from heaven,\" referencing divine provision in the Bible, but evolved to symbolize unexpected good fortune, particularly small amounts of money  The phrase gained widespread recognition through a 1936 American popular song titled \"Pennies from Heaven,\" composed by Arthur Johnston with lyrics by Johnny Burke  The song was introduced by Bing Crosby in the 1936 film of the same name, directed by Norman Z. McLeod, and became a major hit, topping the charts for ten weeks and later inducted into the Grammy Hall of Fame The 1936 film, starring Bing Crosby, Madge Evans, and Edith Fellows, follows Larry Poole, a man released from prison on a false charge, who fulfills a dying inmate's request to help a family named Smith, only to discover they are a young girl and her elderly grandfather in need  The story centers on themes of hope and redemption, underscored by the film's memorable musical numbers, including the title song The phrase was later adapted into a groundbreaking British television drama series titled Pennies from Heaven , which debuted on 7 March 1978, written by Dennis Potter  The series, set in 1930s Britain, followed the struggles of sheet-music salesman Arthur Parker, using contemporary songs to contrast the bleak reality of the Great Depression with the characters' fantasies  The series was critically acclaimed, winning a BAFTA for Most Original Series and launching the career of Bob Hoskins This BBC series inspired a 1981 American film adaptation titled Pennies from Heaven , directed by Herbert Ross and written by Dennis Potter, which relocated the story to Depression-era Chicago  The film stars Steve Martin as Arthur Parker, Bernadette Peters as schoolteacher Eileen, and Christopher Walken as a pimp  The film features surreal musical sequences where characters lip-sync and dance to 1920s–30s hits like \"Let's Misbehave\" and \"Life Is Just a Bowl of Cherries,\" juxtaposing the characters' grim realities with their dreamlike fantasies  While the film received positive critical reception, it was a box office failure, grossing only a fraction of its budget, and earned three Academy Award nominations without winning The 1981 film has since gained a cult following for its unique blend of drama, musical fantasy, and social commentary, with its themes of escapism and the destructive nature of illusion resonating with audiences  The phrase has also inspired fictional abilities in fan-created content, such as the power to summon and hurl coins with superhuman speed, often tied to the idea of \"pennies from heaven\" as a metaphor for unexpected fortune permalink award report block reply\nlostmyoldpassword 1 points 7 minutes ago Jesus Christ, I'm gonna see this cartoon until the end of time - with various bubbles over her head vaguely blaming \"boomers\" for all of the worlds ills.  Thanks for giving them the perfect template. permalink award report block reply\nMemoryHoleyeO 1 points 6 minutes ago Inflation and printing money non stop did this. permalink award report block reply"}