{"id": "1ARK5A8kkS", "contents": "881 CNN's Fake Yapper: \"Do you have any sort of numerical idea of how many Americans will not be able to be with their families for the holidays?\" Transportation Sec. Sean Duffy: \"I think the number is going to be substantial.\" DEMOCRATS — END THE SHUTDOWN! posted 3 days ago by Tellman125 50 comments award share report block Rapid Response 47 @RapidResponse47 • 3d CNN: \"Do you have any sort of numerical idea of how many Americans will not be able to be with their families for the holidays?\" @SecDuffy: \"I think the number is going to be substantial.\" DEMOCRATS — END THE SHUTDOWN!\n50 comments Sort by Top Top New Worst Old Save Fourtyandfourtyfive 40 points 3 days ago Haven’t noticed a thing with the gov shutdown. permalink award report block reply Choppermagic 10 points 3 days ago your public debt load went down permalink parent award report block reply Viewer01 9 points 3 days ago Nah it’s all on credit cards. permalink parent award report block reply f_bastiat 5 points 3 days ago Same here, it's been business as usual. Still paying a shitload in taxes though that's for sure. permalink parent award report block reply Faintlight 2 points 3 days ago I think everyone's getting their flights canceled. That's my only notice. permalink parent award report block reply braindeadgroup 28 points 3 days ago They didnt give a fuck about families together for thanksgiving in 2020 permalink award report block reply Tellman125 OP 5 points 3 days ago Fauci was like \"Don't worry, you'll have many more in the future.\" Yeah? Really? Even if we do, every one counts!!!!! permalink parent award report block reply terribletwos 28 points 3 days ago This issue shouldn't even exist. Government should be oversight for commercial business, not running a core piece. Also I love how people are trying to frame this as if Trump caused this. Starting to see them try and frame it as a Trump recession, which is a wild angle. permalink award report block reply invalid_data 12 points 3 days ago They are able to do this because the left still controls the media. Until Trump takes actions to outlaw propaganda again then bullshit like this will happen. permalink parent award report block reply noPTSDforMePlease 4 points 3 days ago The left controls the newspapers and TV news, the right controls social media. But the problem with the right is they are always reacting to the newspapers and TV news, never breaking their own stories. permalink parent award report block reply ToxicAvengerOhio -2 points 3 days ago He seems to be incompetent in how to stop it or Netanyahu ordered him not too. Is there another option? permalink parent award report block reply BillyBobBrewer 1 points 3 days ago Netanyahu didn't have to tell him not to. He already knew which side his bread is buttered on. permalink parent award report block reply IncredibleMrE1 16 points 3 days ago END THE SHUTDOWN Not yet. permalink award report block reply MegoThor 7 points 3 days ago Don’t dew it. permalink parent award report block reply BidensfullAFdiaper 12 points 3 days ago I’m old enough to remember when this stupid fuck didn’t care about you and your family Thanksgiving dinners and Christmas get-together because of muh Covid mandates. Now suddenly Americans inability to travel for the holidays is of utmost importance. permalink award report block reply ToxicAvengerOhio 1 points 3 days ago Trumps media until he finds his spine and ends the propaganda permalink parent award report block reply MoreGuns 10 points 3 days ago The shutdown is the best thing to happen in a long time. Now it's time to end it and for democrats heads to roll permalink award report block reply RockyBalboa 3 points 3 days ago You are correct, sir. permalink parent award report block reply CorvettePatriot 2 points 3 days ago After 90 days we can have permanent government layoffs and we are almost half way there! permalink parent award report block reply MeMargie 5 points 3 days ago How many family members were murdered with the Bio Weapon ? permalink award report block reply Tellman125 OP 3 points 3 days ago Upwards of 8.5 Trillion, and that's just in the northeast. permalink parent award report block reply Squentin 5 points 3 days ago 41 members Congress should not have the power to shutdown the government.  Period. permalink award report block reply BlackPiIIedMAGA 5 points 3 days ago END THE FUCKING SHUTDOWN, DEMONRATS permalink award report block reply USMC1234O10 1 points 3 days ago It's about time to ARM UP! Lock and fucking load, boys. permalink parent award report block reply Hikedelics 4 points 3 days ago I’m finally at the point that I’m ready for them to end the filibuster now. At least force them to actually talk on the floor to keep it going, like it was supposed to be. I’m driving home for Christmas. 1,300 miles and ~24h behind the wheel. I’m already going to be doing most of those from 9pm-9am, but I’m not trying to share the road with any more idiots than I already have to. You wouldn’t believe the shit I saw when I made that drive last year for Thanksgiving. permalink award report block reply Mortal_Wombat 2 points 3 days ago This last year I was driving 2+ hour round trip to/from work. There are so many fucking idiots out there it's unconscionable. People don't pay attention to anything except their phone. It's nuts. 15-20mph under the speed limit...at least 2 people every day. Then you pass them and they speed up and try to ride your ass. I almost beat a dudes ass a few months back. He thought he was funny. He almost shit himself when I got out. permalink parent award report block reply Tellman125 OP 2 points 3 days ago He almost got an all-American MAGA bat upside his fuckin head. permalink parent award report block reply Tellman125 OP 1 points 3 days ago What did you see? Multiple road rage incidents? permalink parent award report block reply Gofuys 4 points 3 days ago Since when do Democrats give a shit about American families? permalink award report block reply Tellman125 OP 2 points 3 days ago Absolutely fucking never in history. permalink parent award report block reply HappyFunBall 3 points 3 days ago Updoot for \"Fake Yapper\" permalink award report block reply monkadelic 3 points 3 days ago So making 100k a year is barely getting by now?  wtf permalink award report block reply Eddie_Vanjovi 3 points 3 days ago Holidays? That Christian holiday that non-Christians celebrate and leach on? permalink award report block reply Prof_Smith 3 points 3 days ago Boohoo.   Get in a fucking car and drive.   Fuck airlines and the constant demands for my tax dollars for the entire fucking industry. permalink award report block reply Tellman125 OP 1 points 3 days ago And there's the lovely experience of having to sit next to some 400-pound slob woman for 5 hours. I'm drivin' too. permalink parent award report block reply DickJohnson 2 points 3 days ago Sell air traffic controllers to private companies permalink award report block reply Tellman125 OP 0 points 3 days ago Sell them into slavery? permalink parent award report block reply DickJohnson 2 points 3 days ago The government is not paying them.  Private companies is better than government at everything. permalink parent award report block reply MAGA1773 2 points 3 days ago Be with? How can anyone pay for anything? Millions of workers are not being paid. permalink award report block reply Tellman125 OP 1 points 3 days ago They're doing it as an homage to Pelosi. permalink parent award report block reply GuerillaYourDreams 1 points 3 days ago Most Americans cannot miss two, or at most three, paychecks in a row. permalink award report block reply onesummerdream 1 points 2 days ago 😂 Fake Yapper, gonna file this one, thx! permalink award report block reply Logan051361 1 points 3 days ago Fox news and Lindsey said they think they have the votes permalink award report block reply DoMagnum 1 points 3 days ago They can still be together, they just won't be stuffing themselves. permalink award report block reply highenergywinning 1 points 3 days ago Heres a tip. Drive permalink award report block reply COLDWARPATRIOT55 1 points 3 days ago Why won’t they be with their families?  Is there a pandemic that is forcing them to stay home, not be able to visit their family in nursing homes, and preventing them from working without a jab? permalink award report block reply snuggs316 1 points 3 days ago not as many as during covid.  i bet more people are at the death beds and funerals of their loved ones, tho'. permalink award report block reply AcAirman 1 points 3 days ago Less than the COVID shut down. No flight controllers or airport personnel is worse. permalink award report block reply Hunter_loves_2_feet 1 points 3 days ago Democrats can stop acting like they care. I still remember the real shutdown and that was during the SCAMDEMIC! They fucking LOVED it! permalink award report block reply AppalachianTactical 1 points 3 days ago Numerical?\nWhat a retarded question. Youd have to survey everyone on where they are flying to every holiday. permalink award report block reply\nFourtyandfourtyfive 40 points 3 days ago Haven’t noticed a thing with the gov shutdown. permalink award report block reply Choppermagic 10 points 3 days ago your public debt load went down permalink parent award report block reply Viewer01 9 points 3 days ago Nah it’s all on credit cards. permalink parent award report block reply f_bastiat 5 points 3 days ago Same here, it's been business as usual. Still paying a shitload in taxes though that's for sure. permalink parent award report block reply Faintlight 2 points 3 days ago I think everyone's getting their flights canceled. That's my only notice. permalink parent award report block reply\nChoppermagic 10 points 3 days ago your public debt load went down permalink parent award report block reply Viewer01 9 points 3 days ago Nah it’s all on credit cards. permalink parent award report block reply\nViewer01 9 points 3 days ago Nah it’s all on credit cards. permalink parent award report block reply\nf_bastiat 5 points 3 days ago Same here, it's been business as usual. Still paying a shitload in taxes though that's for sure. permalink parent award report block reply\nFaintlight 2 points 3 days ago I think everyone's getting their flights canceled. That's my only notice. permalink parent award report block reply\nbraindeadgroup 28 points 3 days ago They didnt give a fuck about families together for thanksgiving in 2020 permalink award report block reply Tellman125 OP 5 points 3 days ago Fauci was like \"Don't worry, you'll have many more in the future.\" Yeah? Really? Even if we do, every one counts!!!!! permalink parent award report block reply\nTellman125 OP 5 points 3 days ago Fauci was like \"Don't worry, you'll have many more in the future.\" Yeah? Really? Even if we do, every one counts!!!!! permalink parent award report block reply\nterribletwos 28 points 3 days ago This issue shouldn't even exist. Government should be oversight for commercial business, not running a core piece. Also I love how people are trying to frame this as if Trump caused this. Starting to see them try and frame it as a Trump recession, which is a wild angle. permalink award report block reply invalid_data 12 points 3 days ago They are able to do this because the left still controls the media. Until Trump takes actions to outlaw propaganda again then bullshit like this will happen. permalink parent award report block reply noPTSDforMePlease 4 points 3 days ago The left controls the newspapers and TV news, the right controls social media. But the problem with the right is they are always reacting to the newspapers and TV news, never breaking their own stories. permalink parent award report block reply ToxicAvengerOhio -2 points 3 days ago He seems to be incompetent in how to stop it or Netanyahu ordered him not too. Is there another option? permalink parent award report block reply BillyBobBrewer 1 points 3 days ago Netanyahu didn't have to tell him not to. He already knew which side his bread is buttered on. permalink parent award report block reply\ninvalid_data 12 points 3 days ago They are able to do this because the left still controls the media. Until Trump takes actions to outlaw propaganda again then bullshit like this will happen. permalink parent award report block reply noPTSDforMePlease 4 points 3 days ago The left controls the newspapers and TV news, the right controls social media. But the problem with the right is they are always reacting to the newspapers and TV news, never breaking their own stories. permalink parent award report block reply ToxicAvengerOhio -2 points 3 days ago He seems to be incompetent in how to stop it or Netanyahu ordered him not too. Is there another option? permalink parent award report block reply BillyBobBrewer 1 points 3 days ago Netanyahu didn't have to tell him not to. He already knew which side his bread is buttered on. permalink parent award report block reply\nnoPTSDforMePlease 4 points 3 days ago The left controls the newspapers and TV news, the right controls social media. But the problem with the right is they are always reacting to the newspapers and TV news, never breaking their own stories. permalink parent award report block reply\nToxicAvengerOhio -2 points 3 days ago He seems to be incompetent in how to stop it or Netanyahu ordered him not too. Is there another option? permalink parent award report block reply BillyBobBrewer 1 points 3 days ago Netanyahu didn't have to tell him not to. He already knew which side his bread is buttered on. permalink parent award report block reply\nBillyBobBrewer 1 points 3 days ago Netanyahu didn't have to tell him not to. He already knew which side his bread is buttered on. permalink parent award report block reply\nIncredibleMrE1 16 points 3 days ago END THE SHUTDOWN Not yet. permalink award report block reply MegoThor 7 points 3 days ago Don’t dew it. permalink parent award report block reply\nMegoThor 7 points 3 days ago Don’t dew it. permalink parent award report block reply\nBidensfullAFdiaper 12 points 3 days ago I’m old enough to remember when this stupid fuck didn’t care about you and your family Thanksgiving dinners and Christmas get-together because of muh Covid mandates. Now suddenly Americans inability to travel for the holidays is of utmost importance. permalink award report block reply ToxicAvengerOhio 1 points 3 days ago Trumps media until he finds his spine and ends the propaganda permalink parent award report block reply\nToxicAvengerOhio 1 points 3 days ago Trumps media until he finds his spine and ends the propaganda permalink parent award report block reply\nMoreGuns 10 points 3 days ago The shutdown is the best thing to happen in a long time. Now it's time to end it and for democrats heads to roll permalink award report block reply RockyBalboa 3 points 3 days ago You are correct, sir. permalink parent award report block reply CorvettePatriot 2 points 3 days ago After 90 days we can have permanent government layoffs and we are almost half way there! permalink parent award report block reply\nRockyBalboa 3 points 3 days ago You are correct, sir. permalink parent award report block reply\nCorvettePatriot 2 points 3 days ago After 90 days we can have permanent government layoffs and we are almost half way there! permalink parent award report block reply\nMeMargie 5 points 3 days ago How many family members were murdered with the Bio Weapon ? permalink award report block reply Tellman125 OP 3 points 3 days ago Upwards of 8.5 Trillion, and that's just in the northeast. permalink parent award report block reply\nTellman125 OP 3 points 3 days ago Upwards of 8.5 Trillion, and that's just in the northeast. permalink parent award report block reply\nSquentin 5 points 3 days ago 41 members Congress should not have the power to shutdown the government.  Period. permalink award report block reply\nBlackPiIIedMAGA 5 points 3 days ago END THE FUCKING SHUTDOWN, DEMONRATS permalink award report block reply USMC1234O10 1 points 3 days ago It's about time to ARM UP! Lock and fucking load, boys. permalink parent award report block reply\nUSMC1234O10 1 points 3 days ago It's about time to ARM UP! Lock and fucking load, boys. permalink parent award report block reply\nHikedelics 4 points 3 days ago I’m finally at the point that I’m ready for them to end the filibuster now. At least force them to actually talk on the floor to keep it going, like it was supposed to be. I’m driving home for Christmas. 1,300 miles and ~24h behind the wheel. I’m already going to be doing most of those from 9pm-9am, but I’m not trying to share the road with any more idiots than I already have to. You wouldn’t believe the shit I saw when I made that drive last year for Thanksgiving. permalink award report block reply Mortal_Wombat 2 points 3 days ago This last year I was driving 2+ hour round trip to/from work. There are so many fucking idiots out there it's unconscionable. People don't pay attention to anything except their phone. It's nuts. 15-20mph under the speed limit...at least 2 people every day. Then you pass them and they speed up and try to ride your ass. I almost beat a dudes ass a few months back. He thought he was funny. He almost shit himself when I got out. permalink parent award report block reply Tellman125 OP 2 points 3 days ago He almost got an all-American MAGA bat upside his fuckin head. permalink parent award report block reply Tellman125 OP 1 points 3 days ago What did you see? Multiple road rage incidents? permalink parent award report block reply\nMortal_Wombat 2 points 3 days ago This last year I was driving 2+ hour round trip to/from work. There are so many fucking idiots out there it's unconscionable. People don't pay attention to anything except their phone. It's nuts. 15-20mph under the speed limit...at least 2 people every day. Then you pass them and they speed up and try to ride your ass. I almost beat a dudes ass a few months back. He thought he was funny. He almost shit himself when I got out. permalink parent award report block reply Tellman125 OP 2 points 3 days ago He almost got an all-American MAGA bat upside his fuckin head. permalink parent award report block reply\nTellman125 OP 2 points 3 days ago He almost got an all-American MAGA bat upside his fuckin head. permalink parent award report block reply\nTellman125 OP 1 points 3 days ago What did you see? Multiple road rage incidents? permalink parent award report block reply\nGofuys 4 points 3 days ago Since when do Democrats give a shit about American families? permalink award report block reply Tellman125 OP 2 points 3 days ago Absolutely fucking never in history. permalink parent award report block reply\nTellman125 OP 2 points 3 days ago Absolutely fucking never in history. permalink parent award report block reply\nHappyFunBall 3 points 3 days ago Updoot for \"Fake Yapper\" permalink award report block reply\nmonkadelic 3 points 3 days ago So making 100k a year is barely getting by now?  wtf permalink award report block reply\nEddie_Vanjovi 3 points 3 days ago Holidays? That Christian holiday that non-Christians celebrate and leach on? permalink award report block reply\nProf_Smith 3 points 3 days ago Boohoo.   Get in a fucking car and drive.   Fuck airlines and the constant demands for my tax dollars for the entire fucking industry. permalink award report block reply Tellman125 OP 1 points 3 days ago And there's the lovely experience of having to sit next to some 400-pound slob woman for 5 hours. I'm drivin' too. permalink parent award report block reply\nTellman125 OP 1 points 3 days ago And there's the lovely experience of having to sit next to some 400-pound slob woman for 5 hours. I'm drivin' too. permalink parent award report block reply\nDickJohnson 2 points 3 days ago Sell air traffic controllers to private companies permalink award report block reply Tellman125 OP 0 points 3 days ago Sell them into slavery? permalink parent award report block reply DickJohnson 2 points 3 days ago The government is not paying them.  Private companies is better than government at everything. permalink parent award report block reply\nTellman125 OP 0 points 3 days ago Sell them into slavery? permalink parent award report block reply DickJohnson 2 points 3 days ago The government is not paying them.  Private companies is better than government at everything. permalink parent award report block reply\nDickJohnson 2 points 3 days ago The government is not paying them.  Private companies is better than government at everything. permalink parent award report block reply\nMAGA1773 2 points 3 days ago Be with? How can anyone pay for anything? Millions of workers are not being paid. permalink award report block reply Tellman125 OP 1 points 3 days ago They're doing it as an homage to Pelosi. permalink parent award report block reply\nTellman125 OP 1 points 3 days ago They're doing it as an homage to Pelosi. permalink parent award report block reply\nGuerillaYourDreams 1 points 3 days ago Most Americans cannot miss two, or at most three, paychecks in a row. permalink award report block reply\nonesummerdream 1 points 2 days ago 😂 Fake Yapper, gonna file this one, thx! permalink award report block reply\nLogan051361 1 points 3 days ago Fox news and Lindsey said they think they have the votes permalink award report block reply\nDoMagnum 1 points 3 days ago They can still be together, they just won't be stuffing themselves. permalink award report block reply\nhighenergywinning 1 points 3 days ago Heres a tip. Drive permalink award report block reply\nCOLDWARPATRIOT55 1 points 3 days ago Why won’t they be with their families?  Is there a pandemic that is forcing them to stay home, not be able to visit their family in nursing homes, and preventing them from working without a jab? permalink award report block reply\nsnuggs316 1 points 3 days ago not as many as during covid.  i bet more people are at the death beds and funerals of their loved ones, tho'. permalink award report block reply\nAcAirman 1 points 3 days ago Less than the COVID shut down. No flight controllers or airport personnel is worse. permalink award report block reply\nHunter_loves_2_feet 1 points 3 days ago Democrats can stop acting like they care. I still remember the real shutdown and that was during the SCAMDEMIC! They fucking LOVED it! permalink award report block reply\nAppalachianTactical 1 points 3 days ago Numerical?\nWhat a retarded question. Youd have to survey everyone on where they are flying to every holiday. permalink award report block reply"}