{"id": "1ARK0Ubtbg", "contents": "350 Ben Shapiro when you say \"CHRIST IS KING\"!!!!!!! posted 7 days ago by China4Biden 41 comments award share download report block\n41 comments Sort by Top Top New Worst Old Save Wizard_Glick 11 points 7 days ago Ben should go suck on his sisters enormous tatas... permalink award report block reply Obambi 7 points 7 days ago Lots of Js are faggots when it comes to Christ permalink award report block reply UCantStumpTheTrump 7 points 7 days ago Growing up I of course was indoctrinated into believing the Holocaust was the worse thing ever and Israel is our ally. Now I fucking detest Jews and the destruction they’ve brought on our country. There are few exceptions like Stephen Miller permalink parent award report block reply Obambi 2 points 7 days ago Yea the problem is that most are fucking conceited pricks that have no idea or tact when talking to people. They act like fucking assholes, the ones with money for the most part. Just pricks. Js are Muslims cousins. They both have that anger bloodline. They get so angry and crazy. permalink parent award report block reply Zippitydoodah 0 points 7 days ago https://youtu.be/IT9GnMn2VFA?si=x4SpRX9-k7izIMxN \"That's right, Jesus is king.\" permalink award report block reply Kmdub2 -1 points 6 days ago Ask any jew what their holy book says about christians permalink award report block reply dburt2 -29 points 7 days ago christ is not king nor is he a jew, he never existed in the first place. permalink award report block reply maga_espada 17 points 7 days ago Oh boy are you in for a surprise when you pass. Lol. permalink parent award report block reply dburt2 -11 points 7 days ago Oh I will? How do you know. The bible in its current form is filled with lies. permalink parent award report block reply staroframphansbhole 9 points 7 days ago even gaythiest retards believe he existed, that makes you extra extra retarded permalink parent award report block reply dburt2 -9 points 7 days ago I am not a gaytheist, I am a Deist, I believe in only one God, the Creator and Father. That should be enough for everyone. permalink parent award report block reply deleted 5 points 7 days ago dburt2 -3 points 7 days ago I don't like the jewish religion either, I don't like any primitive blood sacrificial religions. permalink parent award report block reply view 14 more comments... HaSumBro 5 points 7 days ago Regardless of your beliefs of Jesus, he 100% existed. Don't be foolish. Even atheist scholars agree he existed. permalink parent award report block reply BruddahIz 3 points 7 days ago Jesus literally created the Western World. permalink parent award report block reply view 1 more comments... dburt2 -1 points 7 days ago That is a nonsensical statement, atheists don't believe in god. They say there is no evidence that he never existed and that is the only thing I agree with being a Deist. permalink parent award report block reply staroframphansbhole 0 points 6 days ago You're a retard for the reason I mentioned and a double retard for not addressing it. permalink parent award report block reply dburt2 0 points 6 days ago I'm a retard for asking questions? YOU are a retard for accepting things without asking questions. Isn't it more REASONable to have questions with no answers than answers that cannot be questioned? This is the epitome of all religions, don't ask questions because if you do you will go to hell. Asking WHY is the foundation of all skepticism. permalink parent award report block reply view 5 more comments... Liberals_R_Idiots 2 points 7 days ago I’ve found the retard. permalink parent award report block reply dburt2 -1 points 7 days ago Retard? I found a gullible. Do you believe pigs fly and democrats are good people? permalink parent award report block reply\nWizard_Glick 11 points 7 days ago Ben should go suck on his sisters enormous tatas... permalink award report block reply\nObambi 7 points 7 days ago Lots of Js are faggots when it comes to Christ permalink award report block reply UCantStumpTheTrump 7 points 7 days ago Growing up I of course was indoctrinated into believing the Holocaust was the worse thing ever and Israel is our ally. Now I fucking detest Jews and the destruction they’ve brought on our country. There are few exceptions like Stephen Miller permalink parent award report block reply Obambi 2 points 7 days ago Yea the problem is that most are fucking conceited pricks that have no idea or tact when talking to people. They act like fucking assholes, the ones with money for the most part. Just pricks. Js are Muslims cousins. They both have that anger bloodline. They get so angry and crazy. permalink parent award report block reply\nUCantStumpTheTrump 7 points 7 days ago Growing up I of course was indoctrinated into believing the Holocaust was the worse thing ever and Israel is our ally. Now I fucking detest Jews and the destruction they’ve brought on our country. There are few exceptions like Stephen Miller permalink parent award report block reply Obambi 2 points 7 days ago Yea the problem is that most are fucking conceited pricks that have no idea or tact when talking to people. They act like fucking assholes, the ones with money for the most part. Just pricks. Js are Muslims cousins. They both have that anger bloodline. They get so angry and crazy. permalink parent award report block reply\nObambi 2 points 7 days ago Yea the problem is that most are fucking conceited pricks that have no idea or tact when talking to people. They act like fucking assholes, the ones with money for the most part. Just pricks. Js are Muslims cousins. They both have that anger bloodline. They get so angry and crazy. permalink parent award report block reply\nZippitydoodah 0 points 7 days ago https://youtu.be/IT9GnMn2VFA?si=x4SpRX9-k7izIMxN \"That's right, Jesus is king.\" permalink award report block reply\nKmdub2 -1 points 6 days ago Ask any jew what their holy book says about christians permalink award report block reply\ndburt2 -29 points 7 days ago christ is not king nor is he a jew, he never existed in the first place. permalink award report block reply maga_espada 17 points 7 days ago Oh boy are you in for a surprise when you pass. Lol. permalink parent award report block reply dburt2 -11 points 7 days ago Oh I will? How do you know. The bible in its current form is filled with lies. permalink parent award report block reply staroframphansbhole 9 points 7 days ago even gaythiest retards believe he existed, that makes you extra extra retarded permalink parent award report block reply dburt2 -9 points 7 days ago I am not a gaytheist, I am a Deist, I believe in only one God, the Creator and Father. That should be enough for everyone. permalink parent award report block reply deleted 5 points 7 days ago dburt2 -3 points 7 days ago I don't like the jewish religion either, I don't like any primitive blood sacrificial religions. permalink parent award report block reply view 14 more comments... HaSumBro 5 points 7 days ago Regardless of your beliefs of Jesus, he 100% existed. Don't be foolish. Even atheist scholars agree he existed. permalink parent award report block reply BruddahIz 3 points 7 days ago Jesus literally created the Western World. permalink parent award report block reply view 1 more comments... dburt2 -1 points 7 days ago That is a nonsensical statement, atheists don't believe in god. They say there is no evidence that he never existed and that is the only thing I agree with being a Deist. permalink parent award report block reply staroframphansbhole 0 points 6 days ago You're a retard for the reason I mentioned and a double retard for not addressing it. permalink parent award report block reply dburt2 0 points 6 days ago I'm a retard for asking questions? YOU are a retard for accepting things without asking questions. Isn't it more REASONable to have questions with no answers than answers that cannot be questioned? This is the epitome of all religions, don't ask questions because if you do you will go to hell. Asking WHY is the foundation of all skepticism. permalink parent award report block reply view 5 more comments... Liberals_R_Idiots 2 points 7 days ago I’ve found the retard. permalink parent award report block reply dburt2 -1 points 7 days ago Retard? I found a gullible. Do you believe pigs fly and democrats are good people? permalink parent award report block reply\nmaga_espada 17 points 7 days ago Oh boy are you in for a surprise when you pass. Lol. permalink parent award report block reply dburt2 -11 points 7 days ago Oh I will? How do you know. The bible in its current form is filled with lies. permalink parent award report block reply\ndburt2 -11 points 7 days ago Oh I will? How do you know. The bible in its current form is filled with lies. permalink parent award report block reply\nstaroframphansbhole 9 points 7 days ago even gaythiest retards believe he existed, that makes you extra extra retarded permalink parent award report block reply dburt2 -9 points 7 days ago I am not a gaytheist, I am a Deist, I believe in only one God, the Creator and Father. That should be enough for everyone. permalink parent award report block reply deleted 5 points 7 days ago dburt2 -3 points 7 days ago I don't like the jewish religion either, I don't like any primitive blood sacrificial religions. permalink parent award report block reply view 14 more comments... HaSumBro 5 points 7 days ago Regardless of your beliefs of Jesus, he 100% existed. Don't be foolish. Even atheist scholars agree he existed. permalink parent award report block reply BruddahIz 3 points 7 days ago Jesus literally created the Western World. permalink parent award report block reply view 1 more comments... dburt2 -1 points 7 days ago That is a nonsensical statement, atheists don't believe in god. They say there is no evidence that he never existed and that is the only thing I agree with being a Deist. permalink parent award report block reply staroframphansbhole 0 points 6 days ago You're a retard for the reason I mentioned and a double retard for not addressing it. permalink parent award report block reply dburt2 0 points 6 days ago I'm a retard for asking questions? YOU are a retard for accepting things without asking questions. Isn't it more REASONable to have questions with no answers than answers that cannot be questioned? This is the epitome of all religions, don't ask questions because if you do you will go to hell. Asking WHY is the foundation of all skepticism. permalink parent award report block reply view 5 more comments...\ndburt2 -9 points 7 days ago I am not a gaytheist, I am a Deist, I believe in only one God, the Creator and Father. That should be enough for everyone. permalink parent award report block reply deleted 5 points 7 days ago dburt2 -3 points 7 days ago I don't like the jewish religion either, I don't like any primitive blood sacrificial religions. permalink parent award report block reply view 14 more comments... HaSumBro 5 points 7 days ago Regardless of your beliefs of Jesus, he 100% existed. Don't be foolish. Even atheist scholars agree he existed. permalink parent award report block reply BruddahIz 3 points 7 days ago Jesus literally created the Western World. permalink parent award report block reply view 1 more comments... dburt2 -1 points 7 days ago That is a nonsensical statement, atheists don't believe in god. They say there is no evidence that he never existed and that is the only thing I agree with being a Deist. permalink parent award report block reply staroframphansbhole 0 points 6 days ago You're a retard for the reason I mentioned and a double retard for not addressing it. permalink parent award report block reply dburt2 0 points 6 days ago I'm a retard for asking questions? YOU are a retard for accepting things without asking questions. Isn't it more REASONable to have questions with no answers than answers that cannot be questioned? This is the epitome of all religions, don't ask questions because if you do you will go to hell. Asking WHY is the foundation of all skepticism. permalink parent award report block reply view 5 more comments...\ndeleted 5 points 7 days ago dburt2 -3 points 7 days ago I don't like the jewish religion either, I don't like any primitive blood sacrificial religions. permalink parent award report block reply view 14 more comments...\ndburt2 -3 points 7 days ago I don't like the jewish religion either, I don't like any primitive blood sacrificial religions. permalink parent award report block reply view 14 more comments...\nHaSumBro 5 points 7 days ago Regardless of your beliefs of Jesus, he 100% existed. Don't be foolish. Even atheist scholars agree he existed. permalink parent award report block reply BruddahIz 3 points 7 days ago Jesus literally created the Western World. permalink parent award report block reply view 1 more comments... dburt2 -1 points 7 days ago That is a nonsensical statement, atheists don't believe in god. They say there is no evidence that he never existed and that is the only thing I agree with being a Deist. permalink parent award report block reply\nBruddahIz 3 points 7 days ago Jesus literally created the Western World. permalink parent award report block reply view 1 more comments...\ndburt2 -1 points 7 days ago That is a nonsensical statement, atheists don't believe in god. They say there is no evidence that he never existed and that is the only thing I agree with being a Deist. permalink parent award report block reply\nstaroframphansbhole 0 points 6 days ago You're a retard for the reason I mentioned and a double retard for not addressing it. permalink parent award report block reply dburt2 0 points 6 days ago I'm a retard for asking questions? YOU are a retard for accepting things without asking questions. Isn't it more REASONable to have questions with no answers than answers that cannot be questioned? This is the epitome of all religions, don't ask questions because if you do you will go to hell. Asking WHY is the foundation of all skepticism. permalink parent award report block reply view 5 more comments...\ndburt2 0 points 6 days ago I'm a retard for asking questions? YOU are a retard for accepting things without asking questions. Isn't it more REASONable to have questions with no answers than answers that cannot be questioned? This is the epitome of all religions, don't ask questions because if you do you will go to hell. Asking WHY is the foundation of all skepticism. permalink parent award report block reply view 5 more comments...\nLiberals_R_Idiots 2 points 7 days ago I’ve found the retard. permalink parent award report block reply dburt2 -1 points 7 days ago Retard? I found a gullible. Do you believe pigs fly and democrats are good people? permalink parent award report block reply\ndburt2 -1 points 7 days ago Retard? I found a gullible. Do you believe pigs fly and democrats are good people? permalink parent award report block reply"}