{"id": "1ARK55biQm", "contents": "907 Islam is incompatible with civilization ☪️                            ☪️ posted 5 days ago by DingleBalls 42 comments award share report block Robert J. O'Neill @mchooyah • 5d Yeah, and them pesky Jehovah’s Witnesses always choppin’ off peoples’ heads… Ariana Jasmine @arianajasmine__ • 6d To everyone who thinks Zohran Mamdani will force New York to be Muslim: A Muslim has never knocked on my door trying to convince me to convert. Just saying.\n42 comments Sort by Top Top New Worst Old Save PatriotSkorzeny 33 points 5 days ago Yeah the Christian asked to speak to you and spread Good News and went on their way, or spoke to you. He didn’t fucking explode. permalink award report block reply Rakkasan91b 13 points 5 days ago Or chop her head off for refusing or not covering her head. permalink parent award report block reply ConfusedAngryArmed 6 points 5 days ago Or rape her permalink parent award report block reply MEGAMAGAULTRA 3 points 4 days ago Or pour acid on her permalink parent award report block reply llirrem 6 points 5 days ago I had a JW come to my door, I made it clear from the beginning I wasn't interested in converting, he accepted that and was going to leave immediately but noticed a poster on my wall and the 2 of us geeked out for about 20 minutes. If muslims acted more like him I wouldn't have a problem with them. permalink parent award report block reply Im_RickSteves_bitch 20 points 5 days ago They don’t convince. They just chop. permalink award report block reply RuleoVicus 9 points 5 days ago Stabby! Stabby! permalink parent award report block reply hdcochran 17 points 5 days ago Incompatible with Western Civilization permalink award report block reply Build_Back_Bankrupt 15 points 5 days ago Who wants to tell her there will be no convincing? permalink award report block reply MickHigan2 11 points 5 days ago All religions that don't involve Christ as the head figure are incompatible with America. Period. permalink award report block reply RuleoVicus 2 points 5 days ago Absolutely ✝️ permalink parent award report block reply Run_over_Antifa 11 points 5 days ago Honey, that's not how they convert you. permalink award report block reply Grindelwald 10 points 5 days ago Yes, I agree.  They are a swarm. But I am starting to wonder about the other religions too.  The conflicts in the world, especially the deadly ones, seem to all revolve around religion.  Maybe it is just the power hungry that exploit the religious. Look at the cancelation and major attack on some influencers today questioning the behavior of many leaders and their religious zeal for the actions they take.   It’s crazy. permalink award report block reply TrumpAndGodWin 7 points 5 days ago E.g. the synagogue of satan / zionists threatening Tucker Carlson's life and trying to get him assassinated for daring to question Netanyahu and the war with a nuclear armed Iran. Bibi actually called and yelled at him... permalink parent award report block reply asiandood -1 points 5 days ago Right on que... Always have to divert right back to \"MUH JOOs\" when people starting talking about the REAL problem: ISLAM permalink parent award report block reply TrumpAndGodWin 5 points 5 days ago Islam is another cult that serves Satan, communists, socialists, etc do too. \"You shall know them by their fruits.\" I talk about all the biggest threats to normal people. permalink parent award report block reply MaoHadOnly1Testicle 0 points 5 days ago \"The enemy of my enemy is my friend\" is a lie permalink parent award report block reply RuleoVicus 6 points 5 days ago \"Islam is our broom against Xtians\", paraphrased. permalink parent award report block reply Grimarr 5 points 5 days ago Yep, and now they have a stronghold of free stuff in NY and will launch from there into the rest of the country.  It is an acceleration of the invasion. permalink parent award report block reply mikethemarine 7 points 5 days ago and neither has a Christian, ask yourself if Jehovah's Witnesses are Christian, in the Bible it says to spread Gods word to those that want it, NOT to force it down peoples throat, this is what the Quran does permalink award report block reply RuleoVicus 10 points 5 days ago The Crusades were defensive campaigns against Islamic subjugation. How the 'educational' establishment perverted history is fascinating. permalink parent award report block reply TrumpAndGodWin 4 points 5 days ago It was a reaction to hundreds of years of muslims invading, enslaving, raping, etc conquering a lot of Europe and threatening Rome and the pope having to increase Wall heights from fifty feet to one hundred or so. permalink parent award report block reply GoldwaterVoter 3 points 5 days ago 1400 years and counting, with dynamic moving maps: https://www.youtube.com/watch?v=t_Qpy0mXg8Y permalink parent award report block reply Apersonofinterest 6 points 5 days ago That’s because you live in America. Which you hate. But times they are a changing so careful what you say. permalink award report block reply deleted 4 points 5 days ago RagnarD 3 points 5 days ago Words are violence, after all. permalink parent award report block reply Monzie 3 points 5 days ago Instead, they take over streets, stick butts in the air and waste everyone's time until they get sick of it. permalink award report block reply LiteraIIyHitIer 3 points 4 days ago \"A Muslim has never knocked on my door trying to convince me to convert.\" Not yet, they haven't, and when it gets there, they'll kick it in, dipshit. permalink award report block reply Shih_Tabed 3 points 5 days ago Won't go away until people are willing to kill. permalink award report block reply boomerbutnotOKBoomer 3 points 5 days ago They don't knock, you moron permalink award report block reply AmericanJawa 3 points 5 days ago Islam was founded on conquest and their so-called sacred stone is nothing more than the worlds most successful tourist trap. permalink award report block reply utfanx2 3 points 5 days ago Pulse nightclub wasn't shot up by a Jehovah's witness, but for some reason retarded gay leftists hate them more. permalink award report block reply NoticesBugleOWO 3 points 5 days ago Christianity was the God-given antidote to tribalism. Literally. Islam is the Satan-given weapon meant to entrench tribalism. Literally. permalink award report block reply MadRussian 2 points 5 days ago The difference is, I'm going to laugh at a JW and tell him or her to fuck off, but a mudslime is getting thrown off my property ass first after a 3 second warning. So I\"d say, even for retard goatfuckers they understand a thing or two. permalink award report block reply FrankDuncan 2 points 5 days ago Knocked on your door?  Proselytizing at whore houses again? permalink award report block reply redditadminssuckit 2 points 5 days ago They won't ask. permalink award report block reply Duster_340 0 points 4 days ago Juices too permalink award report block reply Settin -1 points 5 days ago Another exhibit for repealing the 19th. permalink award report block reply MurphyPDicsak -2 points 5 days ago It's always the women with the retarded \"hot take\" permalink award report block reply TheGoyimWhisperer 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply Stanwyk74 0 points 5 days ago Comment removed by community moderators. permalink award report block reply\nPatriotSkorzeny 33 points 5 days ago Yeah the Christian asked to speak to you and spread Good News and went on their way, or spoke to you. He didn’t fucking explode. permalink award report block reply Rakkasan91b 13 points 5 days ago Or chop her head off for refusing or not covering her head. permalink parent award report block reply ConfusedAngryArmed 6 points 5 days ago Or rape her permalink parent award report block reply MEGAMAGAULTRA 3 points 4 days ago Or pour acid on her permalink parent award report block reply llirrem 6 points 5 days ago I had a JW come to my door, I made it clear from the beginning I wasn't interested in converting, he accepted that and was going to leave immediately but noticed a poster on my wall and the 2 of us geeked out for about 20 minutes. If muslims acted more like him I wouldn't have a problem with them. permalink parent award report block reply\nRakkasan91b 13 points 5 days ago Or chop her head off for refusing or not covering her head. permalink parent award report block reply ConfusedAngryArmed 6 points 5 days ago Or rape her permalink parent award report block reply MEGAMAGAULTRA 3 points 4 days ago Or pour acid on her permalink parent award report block reply\nConfusedAngryArmed 6 points 5 days ago Or rape her permalink parent award report block reply MEGAMAGAULTRA 3 points 4 days ago Or pour acid on her permalink parent award report block reply\nMEGAMAGAULTRA 3 points 4 days ago Or pour acid on her permalink parent award report block reply\nllirrem 6 points 5 days ago I had a JW come to my door, I made it clear from the beginning I wasn't interested in converting, he accepted that and was going to leave immediately but noticed a poster on my wall and the 2 of us geeked out for about 20 minutes. If muslims acted more like him I wouldn't have a problem with them. permalink parent award report block reply\nIm_RickSteves_bitch 20 points 5 days ago They don’t convince. They just chop. permalink award report block reply RuleoVicus 9 points 5 days ago Stabby! Stabby! permalink parent award report block reply\nRuleoVicus 9 points 5 days ago Stabby! Stabby! permalink parent award report block reply\nhdcochran 17 points 5 days ago Incompatible with Western Civilization permalink award report block reply\nBuild_Back_Bankrupt 15 points 5 days ago Who wants to tell her there will be no convincing? permalink award report block reply\nMickHigan2 11 points 5 days ago All religions that don't involve Christ as the head figure are incompatible with America. Period. permalink award report block reply RuleoVicus 2 points 5 days ago Absolutely ✝️ permalink parent award report block reply\nRuleoVicus 2 points 5 days ago Absolutely ✝️ permalink parent award report block reply\nRun_over_Antifa 11 points 5 days ago Honey, that's not how they convert you. permalink award report block reply\nGrindelwald 10 points 5 days ago Yes, I agree.  They are a swarm. But I am starting to wonder about the other religions too.  The conflicts in the world, especially the deadly ones, seem to all revolve around religion.  Maybe it is just the power hungry that exploit the religious. Look at the cancelation and major attack on some influencers today questioning the behavior of many leaders and their religious zeal for the actions they take.   It’s crazy. permalink award report block reply TrumpAndGodWin 7 points 5 days ago E.g. the synagogue of satan / zionists threatening Tucker Carlson's life and trying to get him assassinated for daring to question Netanyahu and the war with a nuclear armed Iran. Bibi actually called and yelled at him... permalink parent award report block reply asiandood -1 points 5 days ago Right on que... Always have to divert right back to \"MUH JOOs\" when people starting talking about the REAL problem: ISLAM permalink parent award report block reply TrumpAndGodWin 5 points 5 days ago Islam is another cult that serves Satan, communists, socialists, etc do too. \"You shall know them by their fruits.\" I talk about all the biggest threats to normal people. permalink parent award report block reply MaoHadOnly1Testicle 0 points 5 days ago \"The enemy of my enemy is my friend\" is a lie permalink parent award report block reply RuleoVicus 6 points 5 days ago \"Islam is our broom against Xtians\", paraphrased. permalink parent award report block reply Grimarr 5 points 5 days ago Yep, and now they have a stronghold of free stuff in NY and will launch from there into the rest of the country.  It is an acceleration of the invasion. permalink parent award report block reply\nTrumpAndGodWin 7 points 5 days ago E.g. the synagogue of satan / zionists threatening Tucker Carlson's life and trying to get him assassinated for daring to question Netanyahu and the war with a nuclear armed Iran. Bibi actually called and yelled at him... permalink parent award report block reply asiandood -1 points 5 days ago Right on que... Always have to divert right back to \"MUH JOOs\" when people starting talking about the REAL problem: ISLAM permalink parent award report block reply TrumpAndGodWin 5 points 5 days ago Islam is another cult that serves Satan, communists, socialists, etc do too. \"You shall know them by their fruits.\" I talk about all the biggest threats to normal people. permalink parent award report block reply MaoHadOnly1Testicle 0 points 5 days ago \"The enemy of my enemy is my friend\" is a lie permalink parent award report block reply\nasiandood -1 points 5 days ago Right on que... Always have to divert right back to \"MUH JOOs\" when people starting talking about the REAL problem: ISLAM permalink parent award report block reply TrumpAndGodWin 5 points 5 days ago Islam is another cult that serves Satan, communists, socialists, etc do too. \"You shall know them by their fruits.\" I talk about all the biggest threats to normal people. permalink parent award report block reply MaoHadOnly1Testicle 0 points 5 days ago \"The enemy of my enemy is my friend\" is a lie permalink parent award report block reply\nTrumpAndGodWin 5 points 5 days ago Islam is another cult that serves Satan, communists, socialists, etc do too. \"You shall know them by their fruits.\" I talk about all the biggest threats to normal people. permalink parent award report block reply\nMaoHadOnly1Testicle 0 points 5 days ago \"The enemy of my enemy is my friend\" is a lie permalink parent award report block reply\nRuleoVicus 6 points 5 days ago \"Islam is our broom against Xtians\", paraphrased. permalink parent award report block reply\nGrimarr 5 points 5 days ago Yep, and now they have a stronghold of free stuff in NY and will launch from there into the rest of the country.  It is an acceleration of the invasion. permalink parent award report block reply\nmikethemarine 7 points 5 days ago and neither has a Christian, ask yourself if Jehovah's Witnesses are Christian, in the Bible it says to spread Gods word to those that want it, NOT to force it down peoples throat, this is what the Quran does permalink award report block reply RuleoVicus 10 points 5 days ago The Crusades were defensive campaigns against Islamic subjugation. How the 'educational' establishment perverted history is fascinating. permalink parent award report block reply TrumpAndGodWin 4 points 5 days ago It was a reaction to hundreds of years of muslims invading, enslaving, raping, etc conquering a lot of Europe and threatening Rome and the pope having to increase Wall heights from fifty feet to one hundred or so. permalink parent award report block reply GoldwaterVoter 3 points 5 days ago 1400 years and counting, with dynamic moving maps: https://www.youtube.com/watch?v=t_Qpy0mXg8Y permalink parent award report block reply\nRuleoVicus 10 points 5 days ago The Crusades were defensive campaigns against Islamic subjugation. How the 'educational' establishment perverted history is fascinating. permalink parent award report block reply TrumpAndGodWin 4 points 5 days ago It was a reaction to hundreds of years of muslims invading, enslaving, raping, etc conquering a lot of Europe and threatening Rome and the pope having to increase Wall heights from fifty feet to one hundred or so. permalink parent award report block reply GoldwaterVoter 3 points 5 days ago 1400 years and counting, with dynamic moving maps: https://www.youtube.com/watch?v=t_Qpy0mXg8Y permalink parent award report block reply\nTrumpAndGodWin 4 points 5 days ago It was a reaction to hundreds of years of muslims invading, enslaving, raping, etc conquering a lot of Europe and threatening Rome and the pope having to increase Wall heights from fifty feet to one hundred or so. permalink parent award report block reply GoldwaterVoter 3 points 5 days ago 1400 years and counting, with dynamic moving maps: https://www.youtube.com/watch?v=t_Qpy0mXg8Y permalink parent award report block reply\nGoldwaterVoter 3 points 5 days ago 1400 years and counting, with dynamic moving maps: https://www.youtube.com/watch?v=t_Qpy0mXg8Y permalink parent award report block reply\nApersonofinterest 6 points 5 days ago That’s because you live in America. Which you hate. But times they are a changing so careful what you say. permalink award report block reply\ndeleted 4 points 5 days ago RagnarD 3 points 5 days ago Words are violence, after all. permalink parent award report block reply\nRagnarD 3 points 5 days ago Words are violence, after all. permalink parent award report block reply\nMonzie 3 points 5 days ago Instead, they take over streets, stick butts in the air and waste everyone's time until they get sick of it. permalink award report block reply\nLiteraIIyHitIer 3 points 4 days ago \"A Muslim has never knocked on my door trying to convince me to convert.\" Not yet, they haven't, and when it gets there, they'll kick it in, dipshit. permalink award report block reply\nShih_Tabed 3 points 5 days ago Won't go away until people are willing to kill. permalink award report block reply\nboomerbutnotOKBoomer 3 points 5 days ago They don't knock, you moron permalink award report block reply\nAmericanJawa 3 points 5 days ago Islam was founded on conquest and their so-called sacred stone is nothing more than the worlds most successful tourist trap. permalink award report block reply\nutfanx2 3 points 5 days ago Pulse nightclub wasn't shot up by a Jehovah's witness, but for some reason retarded gay leftists hate them more. permalink award report block reply\nNoticesBugleOWO 3 points 5 days ago Christianity was the God-given antidote to tribalism. Literally. Islam is the Satan-given weapon meant to entrench tribalism. Literally. permalink award report block reply\nMadRussian 2 points 5 days ago The difference is, I'm going to laugh at a JW and tell him or her to fuck off, but a mudslime is getting thrown off my property ass first after a 3 second warning. So I\"d say, even for retard goatfuckers they understand a thing or two. permalink award report block reply\nFrankDuncan 2 points 5 days ago Knocked on your door?  Proselytizing at whore houses again? permalink award report block reply\nredditadminssuckit 2 points 5 days ago They won't ask. permalink award report block reply\nDuster_340 0 points 4 days ago Juices too permalink award report block reply\nSettin -1 points 5 days ago Another exhibit for repealing the 19th. permalink award report block reply\nMurphyPDicsak -2 points 5 days ago It's always the women with the retarded \"hot take\" permalink award report block reply\nTheGoyimWhisperer 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply\nStanwyk74 0 points 5 days ago Comment removed by community moderators. permalink award report block reply"}