{"id": "1ARK9jzcQ9", "contents": "764 Guys, double check your cookies before buying. Royal Dansk are from Denmark but \"Danish Style\" are not. They are from... posted 1 day ago by Herpawinski 102 comments award share report block Rare, Exquisite, Alabaster @whois_John_Galt • 3d Guys. I have some bad news about the tins of Christmas butter cookies.\n102 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style AstroLonghorn 50 points 1 day ago “What seasoning is this? Nutmeg?” “No, it’s cow shit” permalink award report block reply Moebius 63 points 1 day ago I want Danish Cookies NOT 'Danesh Cookies'... permalink parent award report block reply booblitchutz 9 points 1 day ago HA permalink parent award report block reply LLP2 4 points 1 day ago Thomas Kinkade: \"Painter of Blight\" permalink parent award report block reply HOSEQ 2 points 1 day ago I got like 6 Tins, and all are Product of Brazil.... I think I'm ok.... permalink parent award report block reply Keiichi81 6 points 1 day ago Cow shit?! HOW DARE YOU! THOSE COWS ARE SACRED! I'll have you know that slight sewage flavoring is actually from the unwashed hand of the Indian baker who was using it to scrape the shit out of his asshole prior to kneading the dough. permalink parent award report block reply mikethemarine 4 points 1 day ago I'm sorry, I think it's mice shit and piss, I just saw it in the video permalink parent award report block reply minttea2 4 points 1 day ago Yum?  Do they eat this shit? Avneel Panchagavya gobar Diya/Vilakku/Deepak | Made of 5 Natural Elements - Cow Dung, Cow Urine, Milk, Curd and Ghee for Daily Puja, Festivals, Navaratri, Diwali https://www.amazon.in/Avneel-Panchagavya-Vilakku-Natural-Elements/dp/B0CC9NYYNQ?th=1 https://www.amazon.in/s?k=cow+dung&i=kitchen Yes, under \"Amazon Fresh\" (like Whole Foods), you can FIND STUFF under a search for https://www.amazon.in/s?k=cow+urine or see https://www.amazon.in/s?k=dow+dung+soap US - https://www.amazon.com/Panchagavya-Go-bar-Vilakku-Dee-pa-Festivals/dp/B0FL24HCX7 permalink parent award report block reply Herpawinski OP 3 points 1 day ago WHAT THE FUUUUUUUUCK!!!!!!!!! permalink parent award report block reply Klaus73 2 points 1 day ago Sar sar show bobs vagene! permalink parent award report block reply load 1 more comments... Herpawinski OP 35 points 1 day ago Places like Walmart mix and match with some sizes of tins being made in one country, and other sizes of tins are made in another. It will say on the bottom where it was made. permalink award report block reply ActNow 10 points 1 day ago Solution: Don't buy from Wally. permalink parent award report block reply Melodicgrog 27 points 1 day ago OK guys, Diwali is over get back to work. Yes, you have to wash your hands Rajesh, we’ve been over this. Just rinse them off in the Ganges’ sacred waters before making the sacred cookies for America. permalink award report block reply grenades_and_ham 12 points 1 day ago Durka durka. permalink parent award report block reply PMSocks 8 points 1 day ago Mohammed jihad permalink parent award report block reply AmarilloArmadillo 3 points 1 day ago Salami-i-like'm permalink parent award report block reply Mike_Hoxbigg 2 points 1 day ago I am doing the needful, saar. permalink parent award report block reply deleted 19 points 1 day ago lifeisahologram 21 points 1 day ago Note: “The facilities are nothing like in the video…” Unless they import a bunch of danish PEOPLE to make it, I don’t care what the facilities look like. As someone who works with Indians, the ONLY people I’ve ever seen walk out of the restroom without washing their hands have been Indians. permalink parent award report block reply DonnieRamesJio 6 points 1 day ago Ever shake hands with a conga player? permalink parent award report block reply Salt_n_Pepe 6 points 1 day ago I've seen an illegal Mexican shit and not wash hands then hop back in the kitchen at a Mexican restaurant. permalink parent award report block reply NY2KCMO1776 1 points 1 day ago As a woman I have called out plenty of white women that not only not flush, they don't wash their hands. Not just in America,  I've had to call them out in Europe as well 🤷🏾‍♀️ permalink parent award report block reply TGNX 4 points 1 day ago Explain the concept of \"per capita.\" permalink parent award report block reply booblitchutz 8 points 1 day ago We ALL know what saars wrote that note. permalink parent award report block reply GTHAYS 2 points 1 day ago But can he help me with my Microsoft account? permalink parent award report block reply booblitchutz 2 points 1 day ago Veddy soddy saar, I am not having able to help you today. permalink parent award report block reply ThisTrainHasNoBrakes 4 points 1 day ago Yeah the connection is that everything in India is shit and this is what you might be getting. permalink parent award report block reply THELEADERSOFMEN 18 points 1 day ago Oh snap I don’t want any rat poop mixed into my sewing notions!! permalink award report block reply walls4america 3 points 1 day ago My mom used one empty tin just for her 30+ year button collection.  Any clothing discards, she’d save the buttons.  As a little girl, I liked looking at all those decorative buttons. (Back then, though, no cookies—just mini-fruit cake had been in those tins). permalink parent award report block reply Saxonlady 14 points 1 day ago Make your own. permalink award report block reply booblitchutz 4 points 1 day ago Seriously. It’s the simplest recipe in the world. permalink parent award report block reply ActNow 2 points 1 day ago And so much better. permalink parent award report block reply grassshrimp 10 points 1 day ago Yep, they are from here: https://alliedint.com/Assets/Cookies/97498%20Christmas%20assorted%20tins%20-%20butter%20cookies%204oz.pdf permalink award report block reply nmipede 10 points 1 day ago Great find! Vegetable Fat, Glucose Syrup, Emulsifier, Artificial Flavors. All four of these are unspecified. Do Not Redeem Saar! permalink parent award report block reply DogFart_ 9 points 1 day ago thank you come again permalink award report block reply Nezock_theKnight 7 points 1 day ago I just popped in to say that the music was the best part of the video, KEK permalink award report block reply Crapachino 1 points 1 day ago Must be ai permalink parent award report block reply ArtLife 6 points 1 day ago lol anyone who thinks that even those knock-off cookies are made by hand is dreaming. permalink award report block reply NoMaskNoMaster 13 points 1 day ago It literally says made in India on the container. Did you not watch the video of them being made by pajeets? Jeets can't build factories. Automation is the domain of Whites and East Asians. permalink parent award report block reply JanxyJet 3 points 1 day ago But, they can work in factories, cheaply. That's how most of that outsoycing works. American, European, Korean, and/or Japanese design it all, bring in competent foreigners to build it  and occasionally maintain it, while the locals do the daily grunt work. Many companies went so far as to tear down their US and Canada factories, and move that tooling over to India, China, or SEA countries. permalink parent award report block reply DaayTerkErJerbs 2 points 1 day ago Bro india makes a lot of shit by hand cuz they'll work for 1.00 an hour. I dont think automation has hit india like it did china. China started by hand then automated. India is mostly at the by hand stage. 20 years from now they'll probably be automating but they arent there yet permalink parent award report block reply lostremote- 3 points 1 day ago Cant wait to see those accident videos permalink parent award report block reply Moebius 5 points 1 day ago This is but ONE location of hundreds making cookies and other stuff.. In a country of 1.4 Billion people you can manufacture anything en-masse using low wage labor. I've seen these fuckers work.  One guy can crank out a dozen or more Kukris in a week using a homemade forge and some chunks of old leaf springs.  I've also seen them make functional copies of AK-47s using simple tools... permalink parent award report block reply monkadelic 3 points 1 day ago The question is what CAN\"T they make out of leaf springs.  I could watch those videos all day.  Everyone barefoot. permalink parent award report block reply Whatyougotson 6 points 1 day ago Lmao the rat slap permalink award report block reply NonbinaryPotatohead 6 points 1 day ago You all can shit on Tiktok all you want but it's the first place I get warned about shit like this. permalink award report block reply Prandogolio -4 points 1 day ago You mean the first place you got clickbaited by fake and gay shit like this. permalink parent award report block reply NonbinaryPotatohead 5 points 1 day ago I think you're missing the point which is a common occurrence on this site. It has been confirmed that Danish STYLE cookies made in India are in big box American stores. I don't want to eat anything coming out of India, period SARRRRRRRR When you all were pissing and moaning about being banned everywhere for sharing covid truth, Biden bullshit, etc etc. tiktok was the fastest way to share truth with the best algorithm for chances at exposure to new audiences, PERIOD. It still is.  But after the pro Israel buy out, we will see how long that lasts. permalink parent award report block reply ActNow 5 points 1 day ago That rat was a jump scare. Lol. permalink award report block reply MightyBright 4 points 1 day ago Are there any nice parts of India? permalink award report block reply current_horror 4 points 1 day ago Literally no. You can drop a pin anywhere in India on Google street view and there will always be garbage everywhere, in both human and regular forms. permalink parent award report block reply cciv 2 points 1 day ago I had friends who honeymooned in India.  They said everywhere you went it was beautiful, but everywhere you went it also smelled of rot.  They said the constant contrast between the senses will never be forgotten. permalink parent award report block reply npc_1234 1 points 15 hours ago The US Embassy? permalink parent award report block reply GTHAYS 1 points 1 day ago The departure gate at the airport? permalink parent award report block reply Tired-Trucker 3 points 1 day ago Looks like a nice gift to our dem frens permalink award report block reply rebuildingMyself 3 points 1 day ago Do not redeem the cookies, saar permalink award report block reply Sunnywindows 3 points 1 day ago Hundreds of recipies for Danish Butter Cookies to be found online.  Get a baking sheet, a bowl, a few ingredients, and make your own.  You’ll never go back . permalink award report block reply someguy7738 3 points 1 day ago Or just, you know, bake your own cookies? It's incredibly easy, it's just flour, butter, and sugar (for shortbread, close enough) and takes minimal effort. permalink award report block reply Saltyminer11 3 points 1 day ago Gross permalink award report block reply Apersonofinterest 3 points 1 day ago Crap. I like those cookies. permalink award report block reply Herpawinski OP 16 points 1 day ago Like I said, look on the bottom of the tin. \"Royal Dansk\" are made in Denmark, but if they're called something else, look on the bottom of the tin to see where they're made to be sure. permalink parent award report block reply orange_popcicle 6 points 1 day ago Check the label. But them from anywhere where India is not the country of origin. permalink parent award report block reply tralbolh 4 points 1 day ago Not sure the PRC would be much better. Chinese tea says you should pour boiling water on it and then immediately pour it off into the drain to wash off the poison. I guess I should be glad they are honest about it and warn you though. permalink parent award report block reply HiddenDekuScrub 3 points 1 day ago You folks are probably going to be fine with Royal Dansk, Pepperidge Farm, Kelsen, Walkers, etc... Hunting around on Amazon there's a few brands that hail from Portugal. It's the overly generic brands you have to watch for. \"Heaveny Bites\" is made in India. There's also a \"Royal Delight\" brand that appears to be copycatting Royal Dansk that I couldn't find a label for. (Sounds suspicious.) Wal Mart's store brand could either be Portugal or India, so read the tin, but I don't know why you'd want to gift people Wal Mart store brands anyway. \"Oriental Trading Company\" is most likely made in China. To be fair, I imagine any facility that produces food for American use is most likely fine and that mass-produced cookies are coming out of a machine, but I also get people aren't thrilled with India right now. permalink parent award report block reply Rey_ 3 points 1 day ago This is no joke, I visited Indian on tour and loved it (on tour). Wife and I took day tour into Dharavi slum and saw open door basement bakery where men kneaded dough with their special socked feet for the famous cookies sold; two feet from the entrance I stood over sewage trickling down the center of our path with rats darting about. I'll never eat those cookies nor the ones in the video above. permalink award report block reply Keep_on_Trumpin 3 points 1 day ago Haha nice AI! ...wait, where's the Sora watermark? ...where's the Sora watermark?! permalink award report block reply fazaman 3 points 1 day ago Anything that's \"Somewhere- style \" is not from that place. permalink award report block reply mikethemarine 3 points 1 day ago thanks for ruining my day, these have always been my favorite cookies, I will be checking for sure where they are coming from permalink award report block reply ActNow 3 points 1 day ago If you bake them yourself, you'll never go back. permalink parent award report block reply mikethemarine 1 points 1 day ago I went out and found some of the cans I use for storage they were royal Dansk, but I did find one of the shit cans to, FUCK, I DO GET A LOT OF HOME BAKED, But people know I love them and so do they, and get a lot at Christmas, I will be showing EVERYONE THIS VIDEO and asking not to get the shit ones permalink parent award report block reply Underpants 2 points 1 day ago Make your own damn cookies. It's not difficult, as you can see. permalink award report block reply awsure 2 points 1 day ago I’m berry berry shoor my frrrrends dat deeze cuwkeeze are berry berry gewd! permalink award report block reply MAGALADON9 2 points 1 day ago Add THIS context There are knock of Indian brands that look very similar. Look for product of Denmark permalink award report block reply cciv 2 points 1 day ago I'm dying. permalink award report block reply Liberats 2 points 1 day ago The clue is in the name. permalink award report block reply Psalm-118_24 2 points 1 day ago Made before or after their poop festival? permalink award report block reply Truthisunpopular 8 points 1 day ago It's a 24x7x365 poop festival in india, coming soon to your neighborhood. permalink parent award report block reply Just_dumping_fuel 2 points 1 day ago before... during.. and after permalink parent award report block reply TGNX 2 points 1 day ago While the community notes is correct (no connection between bakery in video and cookies in tin from India), I do not trust india to not wallow in feces. permalink award report block reply Antenna 2 points 1 day ago Make your own damn cookies. Grow your own food (only way to be sure it is organic) permalink award report block reply ActNow 2 points 1 day ago My greenhouse and outside garden are filling up right now. Today is transplant spinach and onions day. Feels good, man. permalink parent award report block reply Seldom_Seen_Kid 2 points 1 day ago Dry tasteless conveyor cookies that I wouldn’t feed to a dog. permalink award report block reply Beelzy 1 points 1 day ago How about those Chinese variants? Barf permalink award report block reply togtfo 1 points 1 day ago I just want to know where I can find this full song and others like it. permalink award report block reply Herpawinski OP 3 points 1 day ago Gochoo bro https://www.youtube.com/watch?v=qrm8w-pV120 permalink parent award report block reply togtfo 1 points 1 day ago You are an angel. permalink parent award report block reply corntortilla 1 points 1 day ago I just came for the Pepperidge farm memes. They remember how to make cookies in the US. permalink award report block reply KuzoKevin 1 points 1 day ago They are from Denmark.  I checked the can. permalink award report block reply grassshrimp 12 points 1 day ago Royal Dansk is from Denmark, that wasn't the issue. Like the post says, \"Danish Style\" cookies come from India. https://alliedint.com/Assets/Cookies/97498%20Christmas%20assorted%20tins%20-%20butter%20cookies%204oz.pdf permalink parent award report block reply NonbinaryPotatohead 13 points 1 day ago Dinesh Style permalink parent award report block reply MehNahMehNah 6 points 1 day ago I expect the Danes don't prepare the food on unswept floors in coveralls with the crotch ripped out... permalink parent award report block reply Getelectedordietryin 1 points 1 day ago WTF permalink award report block reply FUCK_TYLER 1 points 24 hours ago i saw this last night 😂😂😂 permalink award report block reply walls4america 1 points 1 day ago My DNA results show I have a large percentage of Denmark ancestry. So that means any of my homemade cookies are authentic Danish cookies. permalink award report block reply Herpawinski OP 1 points 1 day ago Song is from this guy: https://www.youtube.com/@vindaloosingh permalink award report block reply Crappydatum 1 points 23 hours ago Which hand did they wipe with? permalink award report block reply Scottx 1 points 20 hours ago Oreos are made in Mexico. No thanks. permalink award report block reply Blackmore 1 points 15 hours ago That does it no more for me. permalink parent award report block reply\nAstroLonghorn 50 points 1 day ago “What seasoning is this? Nutmeg?” “No, it’s cow shit” permalink award report block reply Moebius 63 points 1 day ago I want Danish Cookies NOT 'Danesh Cookies'... permalink parent award report block reply booblitchutz 9 points 1 day ago HA permalink parent award report block reply LLP2 4 points 1 day ago Thomas Kinkade: \"Painter of Blight\" permalink parent award report block reply HOSEQ 2 points 1 day ago I got like 6 Tins, and all are Product of Brazil.... I think I'm ok.... permalink parent award report block reply Keiichi81 6 points 1 day ago Cow shit?! HOW DARE YOU! THOSE COWS ARE SACRED! I'll have you know that slight sewage flavoring is actually from the unwashed hand of the Indian baker who was using it to scrape the shit out of his asshole prior to kneading the dough. permalink parent award report block reply mikethemarine 4 points 1 day ago I'm sorry, I think it's mice shit and piss, I just saw it in the video permalink parent award report block reply minttea2 4 points 1 day ago Yum?  Do they eat this shit? Avneel Panchagavya gobar Diya/Vilakku/Deepak | Made of 5 Natural Elements - Cow Dung, Cow Urine, Milk, Curd and Ghee for Daily Puja, Festivals, Navaratri, Diwali https://www.amazon.in/Avneel-Panchagavya-Vilakku-Natural-Elements/dp/B0CC9NYYNQ?th=1 https://www.amazon.in/s?k=cow+dung&i=kitchen Yes, under \"Amazon Fresh\" (like Whole Foods), you can FIND STUFF under a search for https://www.amazon.in/s?k=cow+urine or see https://www.amazon.in/s?k=dow+dung+soap US - https://www.amazon.com/Panchagavya-Go-bar-Vilakku-Dee-pa-Festivals/dp/B0FL24HCX7 permalink parent award report block reply Herpawinski OP 3 points 1 day ago WHAT THE FUUUUUUUUCK!!!!!!!!! permalink parent award report block reply Klaus73 2 points 1 day ago Sar sar show bobs vagene! permalink parent award report block reply load 1 more comments...\nMoebius 63 points 1 day ago I want Danish Cookies NOT 'Danesh Cookies'... permalink parent award report block reply booblitchutz 9 points 1 day ago HA permalink parent award report block reply LLP2 4 points 1 day ago Thomas Kinkade: \"Painter of Blight\" permalink parent award report block reply HOSEQ 2 points 1 day ago I got like 6 Tins, and all are Product of Brazil.... I think I'm ok.... permalink parent award report block reply\nbooblitchutz 9 points 1 day ago HA permalink parent award report block reply\nLLP2 4 points 1 day ago Thomas Kinkade: \"Painter of Blight\" permalink parent award report block reply\nHOSEQ 2 points 1 day ago I got like 6 Tins, and all are Product of Brazil.... I think I'm ok.... permalink parent award report block reply\nKeiichi81 6 points 1 day ago Cow shit?! HOW DARE YOU! THOSE COWS ARE SACRED! I'll have you know that slight sewage flavoring is actually from the unwashed hand of the Indian baker who was using it to scrape the shit out of his asshole prior to kneading the dough. permalink parent award report block reply\nmikethemarine 4 points 1 day ago I'm sorry, I think it's mice shit and piss, I just saw it in the video permalink parent award report block reply\nminttea2 4 points 1 day ago Yum?  Do they eat this shit? Avneel Panchagavya gobar Diya/Vilakku/Deepak | Made of 5 Natural Elements - Cow Dung, Cow Urine, Milk, Curd and Ghee for Daily Puja, Festivals, Navaratri, Diwali https://www.amazon.in/Avneel-Panchagavya-Vilakku-Natural-Elements/dp/B0CC9NYYNQ?th=1 https://www.amazon.in/s?k=cow+dung&i=kitchen Yes, under \"Amazon Fresh\" (like Whole Foods), you can FIND STUFF under a search for https://www.amazon.in/s?k=cow+urine or see https://www.amazon.in/s?k=dow+dung+soap US - https://www.amazon.com/Panchagavya-Go-bar-Vilakku-Dee-pa-Festivals/dp/B0FL24HCX7 permalink parent award report block reply Herpawinski OP 3 points 1 day ago WHAT THE FUUUUUUUUCK!!!!!!!!! permalink parent award report block reply\nHerpawinski OP 3 points 1 day ago WHAT THE FUUUUUUUUCK!!!!!!!!! permalink parent award report block reply\nKlaus73 2 points 1 day ago Sar sar show bobs vagene! permalink parent award report block reply\nHerpawinski OP 35 points 1 day ago Places like Walmart mix and match with some sizes of tins being made in one country, and other sizes of tins are made in another. It will say on the bottom where it was made. permalink award report block reply ActNow 10 points 1 day ago Solution: Don't buy from Wally. permalink parent award report block reply\nActNow 10 points 1 day ago Solution: Don't buy from Wally. permalink parent award report block reply\nMelodicgrog 27 points 1 day ago OK guys, Diwali is over get back to work. Yes, you have to wash your hands Rajesh, we’ve been over this. Just rinse them off in the Ganges’ sacred waters before making the sacred cookies for America. permalink award report block reply grenades_and_ham 12 points 1 day ago Durka durka. permalink parent award report block reply PMSocks 8 points 1 day ago Mohammed jihad permalink parent award report block reply AmarilloArmadillo 3 points 1 day ago Salami-i-like'm permalink parent award report block reply Mike_Hoxbigg 2 points 1 day ago I am doing the needful, saar. permalink parent award report block reply\ngrenades_and_ham 12 points 1 day ago Durka durka. permalink parent award report block reply PMSocks 8 points 1 day ago Mohammed jihad permalink parent award report block reply AmarilloArmadillo 3 points 1 day ago Salami-i-like'm permalink parent award report block reply Mike_Hoxbigg 2 points 1 day ago I am doing the needful, saar. permalink parent award report block reply\nPMSocks 8 points 1 day ago Mohammed jihad permalink parent award report block reply AmarilloArmadillo 3 points 1 day ago Salami-i-like'm permalink parent award report block reply Mike_Hoxbigg 2 points 1 day ago I am doing the needful, saar. permalink parent award report block reply\nAmarilloArmadillo 3 points 1 day ago Salami-i-like'm permalink parent award report block reply Mike_Hoxbigg 2 points 1 day ago I am doing the needful, saar. permalink parent award report block reply\nMike_Hoxbigg 2 points 1 day ago I am doing the needful, saar. permalink parent award report block reply\ndeleted 19 points 1 day ago lifeisahologram 21 points 1 day ago Note: “The facilities are nothing like in the video…” Unless they import a bunch of danish PEOPLE to make it, I don’t care what the facilities look like. As someone who works with Indians, the ONLY people I’ve ever seen walk out of the restroom without washing their hands have been Indians. permalink parent award report block reply DonnieRamesJio 6 points 1 day ago Ever shake hands with a conga player? permalink parent award report block reply Salt_n_Pepe 6 points 1 day ago I've seen an illegal Mexican shit and not wash hands then hop back in the kitchen at a Mexican restaurant. permalink parent award report block reply NY2KCMO1776 1 points 1 day ago As a woman I have called out plenty of white women that not only not flush, they don't wash their hands. Not just in America,  I've had to call them out in Europe as well 🤷🏾‍♀️ permalink parent award report block reply TGNX 4 points 1 day ago Explain the concept of \"per capita.\" permalink parent award report block reply booblitchutz 8 points 1 day ago We ALL know what saars wrote that note. permalink parent award report block reply GTHAYS 2 points 1 day ago But can he help me with my Microsoft account? permalink parent award report block reply booblitchutz 2 points 1 day ago Veddy soddy saar, I am not having able to help you today. permalink parent award report block reply ThisTrainHasNoBrakes 4 points 1 day ago Yeah the connection is that everything in India is shit and this is what you might be getting. permalink parent award report block reply\nlifeisahologram 21 points 1 day ago Note: “The facilities are nothing like in the video…” Unless they import a bunch of danish PEOPLE to make it, I don’t care what the facilities look like. As someone who works with Indians, the ONLY people I’ve ever seen walk out of the restroom without washing their hands have been Indians. permalink parent award report block reply DonnieRamesJio 6 points 1 day ago Ever shake hands with a conga player? permalink parent award report block reply Salt_n_Pepe 6 points 1 day ago I've seen an illegal Mexican shit and not wash hands then hop back in the kitchen at a Mexican restaurant. permalink parent award report block reply NY2KCMO1776 1 points 1 day ago As a woman I have called out plenty of white women that not only not flush, they don't wash their hands. Not just in America,  I've had to call them out in Europe as well 🤷🏾‍♀️ permalink parent award report block reply TGNX 4 points 1 day ago Explain the concept of \"per capita.\" permalink parent award report block reply\nDonnieRamesJio 6 points 1 day ago Ever shake hands with a conga player? permalink parent award report block reply\nSalt_n_Pepe 6 points 1 day ago I've seen an illegal Mexican shit and not wash hands then hop back in the kitchen at a Mexican restaurant. permalink parent award report block reply\nNY2KCMO1776 1 points 1 day ago As a woman I have called out plenty of white women that not only not flush, they don't wash their hands. Not just in America,  I've had to call them out in Europe as well 🤷🏾‍♀️ permalink parent award report block reply TGNX 4 points 1 day ago Explain the concept of \"per capita.\" permalink parent award report block reply\nTGNX 4 points 1 day ago Explain the concept of \"per capita.\" permalink parent award report block reply\nbooblitchutz 8 points 1 day ago We ALL know what saars wrote that note. permalink parent award report block reply GTHAYS 2 points 1 day ago But can he help me with my Microsoft account? permalink parent award report block reply booblitchutz 2 points 1 day ago Veddy soddy saar, I am not having able to help you today. permalink parent award report block reply\nGTHAYS 2 points 1 day ago But can he help me with my Microsoft account? permalink parent award report block reply booblitchutz 2 points 1 day ago Veddy soddy saar, I am not having able to help you today. permalink parent award report block reply\nbooblitchutz 2 points 1 day ago Veddy soddy saar, I am not having able to help you today. permalink parent award report block reply\nThisTrainHasNoBrakes 4 points 1 day ago Yeah the connection is that everything in India is shit and this is what you might be getting. permalink parent award report block reply\nTHELEADERSOFMEN 18 points 1 day ago Oh snap I don’t want any rat poop mixed into my sewing notions!! permalink award report block reply walls4america 3 points 1 day ago My mom used one empty tin just for her 30+ year button collection.  Any clothing discards, she’d save the buttons.  As a little girl, I liked looking at all those decorative buttons. (Back then, though, no cookies—just mini-fruit cake had been in those tins). permalink parent award report block reply\nwalls4america 3 points 1 day ago My mom used one empty tin just for her 30+ year button collection.  Any clothing discards, she’d save the buttons.  As a little girl, I liked looking at all those decorative buttons. (Back then, though, no cookies—just mini-fruit cake had been in those tins). permalink parent award report block reply\nSaxonlady 14 points 1 day ago Make your own. permalink award report block reply booblitchutz 4 points 1 day ago Seriously. It’s the simplest recipe in the world. permalink parent award report block reply ActNow 2 points 1 day ago And so much better. permalink parent award report block reply\nbooblitchutz 4 points 1 day ago Seriously. It’s the simplest recipe in the world. permalink parent award report block reply ActNow 2 points 1 day ago And so much better. permalink parent award report block reply\nActNow 2 points 1 day ago And so much better. permalink parent award report block reply\ngrassshrimp 10 points 1 day ago Yep, they are from here: https://alliedint.com/Assets/Cookies/97498%20Christmas%20assorted%20tins%20-%20butter%20cookies%204oz.pdf permalink award report block reply nmipede 10 points 1 day ago Great find! Vegetable Fat, Glucose Syrup, Emulsifier, Artificial Flavors. All four of these are unspecified. Do Not Redeem Saar! permalink parent award report block reply\nnmipede 10 points 1 day ago Great find! Vegetable Fat, Glucose Syrup, Emulsifier, Artificial Flavors. All four of these are unspecified. Do Not Redeem Saar! permalink parent award report block reply\nDogFart_ 9 points 1 day ago thank you come again permalink award report block reply\nNezock_theKnight 7 points 1 day ago I just popped in to say that the music was the best part of the video, KEK permalink award report block reply Crapachino 1 points 1 day ago Must be ai permalink parent award report block reply\nCrapachino 1 points 1 day ago Must be ai permalink parent award report block reply\nArtLife 6 points 1 day ago lol anyone who thinks that even those knock-off cookies are made by hand is dreaming. permalink award report block reply NoMaskNoMaster 13 points 1 day ago It literally says made in India on the container. Did you not watch the video of them being made by pajeets? Jeets can't build factories. Automation is the domain of Whites and East Asians. permalink parent award report block reply JanxyJet 3 points 1 day ago But, they can work in factories, cheaply. That's how most of that outsoycing works. American, European, Korean, and/or Japanese design it all, bring in competent foreigners to build it  and occasionally maintain it, while the locals do the daily grunt work. Many companies went so far as to tear down their US and Canada factories, and move that tooling over to India, China, or SEA countries. permalink parent award report block reply DaayTerkErJerbs 2 points 1 day ago Bro india makes a lot of shit by hand cuz they'll work for 1.00 an hour. I dont think automation has hit india like it did china. China started by hand then automated. India is mostly at the by hand stage. 20 years from now they'll probably be automating but they arent there yet permalink parent award report block reply lostremote- 3 points 1 day ago Cant wait to see those accident videos permalink parent award report block reply Moebius 5 points 1 day ago This is but ONE location of hundreds making cookies and other stuff.. In a country of 1.4 Billion people you can manufacture anything en-masse using low wage labor. I've seen these fuckers work.  One guy can crank out a dozen or more Kukris in a week using a homemade forge and some chunks of old leaf springs.  I've also seen them make functional copies of AK-47s using simple tools... permalink parent award report block reply monkadelic 3 points 1 day ago The question is what CAN\"T they make out of leaf springs.  I could watch those videos all day.  Everyone barefoot. permalink parent award report block reply\nNoMaskNoMaster 13 points 1 day ago It literally says made in India on the container. Did you not watch the video of them being made by pajeets? Jeets can't build factories. Automation is the domain of Whites and East Asians. permalink parent award report block reply JanxyJet 3 points 1 day ago But, they can work in factories, cheaply. That's how most of that outsoycing works. American, European, Korean, and/or Japanese design it all, bring in competent foreigners to build it  and occasionally maintain it, while the locals do the daily grunt work. Many companies went so far as to tear down their US and Canada factories, and move that tooling over to India, China, or SEA countries. permalink parent award report block reply DaayTerkErJerbs 2 points 1 day ago Bro india makes a lot of shit by hand cuz they'll work for 1.00 an hour. I dont think automation has hit india like it did china. China started by hand then automated. India is mostly at the by hand stage. 20 years from now they'll probably be automating but they arent there yet permalink parent award report block reply lostremote- 3 points 1 day ago Cant wait to see those accident videos permalink parent award report block reply\nJanxyJet 3 points 1 day ago But, they can work in factories, cheaply. That's how most of that outsoycing works. American, European, Korean, and/or Japanese design it all, bring in competent foreigners to build it  and occasionally maintain it, while the locals do the daily grunt work. Many companies went so far as to tear down their US and Canada factories, and move that tooling over to India, China, or SEA countries. permalink parent award report block reply DaayTerkErJerbs 2 points 1 day ago Bro india makes a lot of shit by hand cuz they'll work for 1.00 an hour. I dont think automation has hit india like it did china. China started by hand then automated. India is mostly at the by hand stage. 20 years from now they'll probably be automating but they arent there yet permalink parent award report block reply lostremote- 3 points 1 day ago Cant wait to see those accident videos permalink parent award report block reply\nDaayTerkErJerbs 2 points 1 day ago Bro india makes a lot of shit by hand cuz they'll work for 1.00 an hour. I dont think automation has hit india like it did china. China started by hand then automated. India is mostly at the by hand stage. 20 years from now they'll probably be automating but they arent there yet permalink parent award report block reply lostremote- 3 points 1 day ago Cant wait to see those accident videos permalink parent award report block reply\nlostremote- 3 points 1 day ago Cant wait to see those accident videos permalink parent award report block reply\nMoebius 5 points 1 day ago This is but ONE location of hundreds making cookies and other stuff.. In a country of 1.4 Billion people you can manufacture anything en-masse using low wage labor. I've seen these fuckers work.  One guy can crank out a dozen or more Kukris in a week using a homemade forge and some chunks of old leaf springs.  I've also seen them make functional copies of AK-47s using simple tools... permalink parent award report block reply monkadelic 3 points 1 day ago The question is what CAN\"T they make out of leaf springs.  I could watch those videos all day.  Everyone barefoot. permalink parent award report block reply\nmonkadelic 3 points 1 day ago The question is what CAN\"T they make out of leaf springs.  I could watch those videos all day.  Everyone barefoot. permalink parent award report block reply\nWhatyougotson 6 points 1 day ago Lmao the rat slap permalink award report block reply\nNonbinaryPotatohead 6 points 1 day ago You all can shit on Tiktok all you want but it's the first place I get warned about shit like this. permalink award report block reply Prandogolio -4 points 1 day ago You mean the first place you got clickbaited by fake and gay shit like this. permalink parent award report block reply NonbinaryPotatohead 5 points 1 day ago I think you're missing the point which is a common occurrence on this site. It has been confirmed that Danish STYLE cookies made in India are in big box American stores. I don't want to eat anything coming out of India, period SARRRRRRRR When you all were pissing and moaning about being banned everywhere for sharing covid truth, Biden bullshit, etc etc. tiktok was the fastest way to share truth with the best algorithm for chances at exposure to new audiences, PERIOD. It still is.  But after the pro Israel buy out, we will see how long that lasts. permalink parent award report block reply\nPrandogolio -4 points 1 day ago You mean the first place you got clickbaited by fake and gay shit like this. permalink parent award report block reply NonbinaryPotatohead 5 points 1 day ago I think you're missing the point which is a common occurrence on this site. It has been confirmed that Danish STYLE cookies made in India are in big box American stores. I don't want to eat anything coming out of India, period SARRRRRRRR When you all were pissing and moaning about being banned everywhere for sharing covid truth, Biden bullshit, etc etc. tiktok was the fastest way to share truth with the best algorithm for chances at exposure to new audiences, PERIOD. It still is.  But after the pro Israel buy out, we will see how long that lasts. permalink parent award report block reply\nNonbinaryPotatohead 5 points 1 day ago I think you're missing the point which is a common occurrence on this site. It has been confirmed that Danish STYLE cookies made in India are in big box American stores. I don't want to eat anything coming out of India, period SARRRRRRRR When you all were pissing and moaning about being banned everywhere for sharing covid truth, Biden bullshit, etc etc. tiktok was the fastest way to share truth with the best algorithm for chances at exposure to new audiences, PERIOD. It still is.  But after the pro Israel buy out, we will see how long that lasts. permalink parent award report block reply\nActNow 5 points 1 day ago That rat was a jump scare. Lol. permalink award report block reply\nMightyBright 4 points 1 day ago Are there any nice parts of India? permalink award report block reply current_horror 4 points 1 day ago Literally no. You can drop a pin anywhere in India on Google street view and there will always be garbage everywhere, in both human and regular forms. permalink parent award report block reply cciv 2 points 1 day ago I had friends who honeymooned in India.  They said everywhere you went it was beautiful, but everywhere you went it also smelled of rot.  They said the constant contrast between the senses will never be forgotten. permalink parent award report block reply npc_1234 1 points 15 hours ago The US Embassy? permalink parent award report block reply GTHAYS 1 points 1 day ago The departure gate at the airport? permalink parent award report block reply\ncurrent_horror 4 points 1 day ago Literally no. You can drop a pin anywhere in India on Google street view and there will always be garbage everywhere, in both human and regular forms. permalink parent award report block reply\ncciv 2 points 1 day ago I had friends who honeymooned in India.  They said everywhere you went it was beautiful, but everywhere you went it also smelled of rot.  They said the constant contrast between the senses will never be forgotten. permalink parent award report block reply\nnpc_1234 1 points 15 hours ago The US Embassy? permalink parent award report block reply\nGTHAYS 1 points 1 day ago The departure gate at the airport? permalink parent award report block reply\nTired-Trucker 3 points 1 day ago Looks like a nice gift to our dem frens permalink award report block reply\nrebuildingMyself 3 points 1 day ago Do not redeem the cookies, saar permalink award report block reply\nSunnywindows 3 points 1 day ago Hundreds of recipies for Danish Butter Cookies to be found online.  Get a baking sheet, a bowl, a few ingredients, and make your own.  You’ll never go back . permalink award report block reply\nsomeguy7738 3 points 1 day ago Or just, you know, bake your own cookies? It's incredibly easy, it's just flour, butter, and sugar (for shortbread, close enough) and takes minimal effort. permalink award report block reply\nSaltyminer11 3 points 1 day ago Gross permalink award report block reply\nApersonofinterest 3 points 1 day ago Crap. I like those cookies. permalink award report block reply Herpawinski OP 16 points 1 day ago Like I said, look on the bottom of the tin. \"Royal Dansk\" are made in Denmark, but if they're called something else, look on the bottom of the tin to see where they're made to be sure. permalink parent award report block reply orange_popcicle 6 points 1 day ago Check the label. But them from anywhere where India is not the country of origin. permalink parent award report block reply tralbolh 4 points 1 day ago Not sure the PRC would be much better. Chinese tea says you should pour boiling water on it and then immediately pour it off into the drain to wash off the poison. I guess I should be glad they are honest about it and warn you though. permalink parent award report block reply HiddenDekuScrub 3 points 1 day ago You folks are probably going to be fine with Royal Dansk, Pepperidge Farm, Kelsen, Walkers, etc... Hunting around on Amazon there's a few brands that hail from Portugal. It's the overly generic brands you have to watch for. \"Heaveny Bites\" is made in India. There's also a \"Royal Delight\" brand that appears to be copycatting Royal Dansk that I couldn't find a label for. (Sounds suspicious.) Wal Mart's store brand could either be Portugal or India, so read the tin, but I don't know why you'd want to gift people Wal Mart store brands anyway. \"Oriental Trading Company\" is most likely made in China. To be fair, I imagine any facility that produces food for American use is most likely fine and that mass-produced cookies are coming out of a machine, but I also get people aren't thrilled with India right now. permalink parent award report block reply\nHerpawinski OP 16 points 1 day ago Like I said, look on the bottom of the tin. \"Royal Dansk\" are made in Denmark, but if they're called something else, look on the bottom of the tin to see where they're made to be sure. permalink parent award report block reply\norange_popcicle 6 points 1 day ago Check the label. But them from anywhere where India is not the country of origin. permalink parent award report block reply tralbolh 4 points 1 day ago Not sure the PRC would be much better. Chinese tea says you should pour boiling water on it and then immediately pour it off into the drain to wash off the poison. I guess I should be glad they are honest about it and warn you though. permalink parent award report block reply\ntralbolh 4 points 1 day ago Not sure the PRC would be much better. Chinese tea says you should pour boiling water on it and then immediately pour it off into the drain to wash off the poison. I guess I should be glad they are honest about it and warn you though. permalink parent award report block reply\nHiddenDekuScrub 3 points 1 day ago You folks are probably going to be fine with Royal Dansk, Pepperidge Farm, Kelsen, Walkers, etc... Hunting around on Amazon there's a few brands that hail from Portugal. It's the overly generic brands you have to watch for. \"Heaveny Bites\" is made in India. There's also a \"Royal Delight\" brand that appears to be copycatting Royal Dansk that I couldn't find a label for. (Sounds suspicious.) Wal Mart's store brand could either be Portugal or India, so read the tin, but I don't know why you'd want to gift people Wal Mart store brands anyway. \"Oriental Trading Company\" is most likely made in China. To be fair, I imagine any facility that produces food for American use is most likely fine and that mass-produced cookies are coming out of a machine, but I also get people aren't thrilled with India right now. permalink parent award report block reply\nRey_ 3 points 1 day ago This is no joke, I visited Indian on tour and loved it (on tour). Wife and I took day tour into Dharavi slum and saw open door basement bakery where men kneaded dough with their special socked feet for the famous cookies sold; two feet from the entrance I stood over sewage trickling down the center of our path with rats darting about. I'll never eat those cookies nor the ones in the video above. permalink award report block reply\nKeep_on_Trumpin 3 points 1 day ago Haha nice AI! ...wait, where's the Sora watermark? ...where's the Sora watermark?! permalink award report block reply\nfazaman 3 points 1 day ago Anything that's \"Somewhere- style \" is not from that place. permalink award report block reply\nmikethemarine 3 points 1 day ago thanks for ruining my day, these have always been my favorite cookies, I will be checking for sure where they are coming from permalink award report block reply ActNow 3 points 1 day ago If you bake them yourself, you'll never go back. permalink parent award report block reply mikethemarine 1 points 1 day ago I went out and found some of the cans I use for storage they were royal Dansk, but I did find one of the shit cans to, FUCK, I DO GET A LOT OF HOME BAKED, But people know I love them and so do they, and get a lot at Christmas, I will be showing EVERYONE THIS VIDEO and asking not to get the shit ones permalink parent award report block reply\nActNow 3 points 1 day ago If you bake them yourself, you'll never go back. permalink parent award report block reply mikethemarine 1 points 1 day ago I went out and found some of the cans I use for storage they were royal Dansk, but I did find one of the shit cans to, FUCK, I DO GET A LOT OF HOME BAKED, But people know I love them and so do they, and get a lot at Christmas, I will be showing EVERYONE THIS VIDEO and asking not to get the shit ones permalink parent award report block reply\nmikethemarine 1 points 1 day ago I went out and found some of the cans I use for storage they were royal Dansk, but I did find one of the shit cans to, FUCK, I DO GET A LOT OF HOME BAKED, But people know I love them and so do they, and get a lot at Christmas, I will be showing EVERYONE THIS VIDEO and asking not to get the shit ones permalink parent award report block reply\nUnderpants 2 points 1 day ago Make your own damn cookies. It's not difficult, as you can see. permalink award report block reply\nawsure 2 points 1 day ago I’m berry berry shoor my frrrrends dat deeze cuwkeeze are berry berry gewd! permalink award report block reply\nMAGALADON9 2 points 1 day ago Add THIS context There are knock of Indian brands that look very similar. Look for product of Denmark permalink award report block reply\ncciv 2 points 1 day ago I'm dying. permalink award report block reply\nLiberats 2 points 1 day ago The clue is in the name. permalink award report block reply\nPsalm-118_24 2 points 1 day ago Made before or after their poop festival? permalink award report block reply Truthisunpopular 8 points 1 day ago It's a 24x7x365 poop festival in india, coming soon to your neighborhood. permalink parent award report block reply Just_dumping_fuel 2 points 1 day ago before... during.. and after permalink parent award report block reply\nTruthisunpopular 8 points 1 day ago It's a 24x7x365 poop festival in india, coming soon to your neighborhood. permalink parent award report block reply\nJust_dumping_fuel 2 points 1 day ago before... during.. and after permalink parent award report block reply\nTGNX 2 points 1 day ago While the community notes is correct (no connection between bakery in video and cookies in tin from India), I do not trust india to not wallow in feces. permalink award report block reply\nAntenna 2 points 1 day ago Make your own damn cookies. Grow your own food (only way to be sure it is organic) permalink award report block reply ActNow 2 points 1 day ago My greenhouse and outside garden are filling up right now. Today is transplant spinach and onions day. Feels good, man. permalink parent award report block reply\nActNow 2 points 1 day ago My greenhouse and outside garden are filling up right now. Today is transplant spinach and onions day. Feels good, man. permalink parent award report block reply\nSeldom_Seen_Kid 2 points 1 day ago Dry tasteless conveyor cookies that I wouldn’t feed to a dog. permalink award report block reply\nBeelzy 1 points 1 day ago How about those Chinese variants? Barf permalink award report block reply\ntogtfo 1 points 1 day ago I just want to know where I can find this full song and others like it. permalink award report block reply Herpawinski OP 3 points 1 day ago Gochoo bro https://www.youtube.com/watch?v=qrm8w-pV120 permalink parent award report block reply togtfo 1 points 1 day ago You are an angel. permalink parent award report block reply\nHerpawinski OP 3 points 1 day ago Gochoo bro https://www.youtube.com/watch?v=qrm8w-pV120 permalink parent award report block reply togtfo 1 points 1 day ago You are an angel. permalink parent award report block reply\ntogtfo 1 points 1 day ago You are an angel. permalink parent award report block reply\ncorntortilla 1 points 1 day ago I just came for the Pepperidge farm memes. They remember how to make cookies in the US. permalink award report block reply\nKuzoKevin 1 points 1 day ago They are from Denmark.  I checked the can. permalink award report block reply grassshrimp 12 points 1 day ago Royal Dansk is from Denmark, that wasn't the issue. Like the post says, \"Danish Style\" cookies come from India. https://alliedint.com/Assets/Cookies/97498%20Christmas%20assorted%20tins%20-%20butter%20cookies%204oz.pdf permalink parent award report block reply NonbinaryPotatohead 13 points 1 day ago Dinesh Style permalink parent award report block reply MehNahMehNah 6 points 1 day ago I expect the Danes don't prepare the food on unswept floors in coveralls with the crotch ripped out... permalink parent award report block reply\ngrassshrimp 12 points 1 day ago Royal Dansk is from Denmark, that wasn't the issue. Like the post says, \"Danish Style\" cookies come from India. https://alliedint.com/Assets/Cookies/97498%20Christmas%20assorted%20tins%20-%20butter%20cookies%204oz.pdf permalink parent award report block reply NonbinaryPotatohead 13 points 1 day ago Dinesh Style permalink parent award report block reply MehNahMehNah 6 points 1 day ago I expect the Danes don't prepare the food on unswept floors in coveralls with the crotch ripped out... permalink parent award report block reply\nNonbinaryPotatohead 13 points 1 day ago Dinesh Style permalink parent award report block reply\nMehNahMehNah 6 points 1 day ago I expect the Danes don't prepare the food on unswept floors in coveralls with the crotch ripped out... permalink parent award report block reply\nGetelectedordietryin 1 points 1 day ago WTF permalink award report block reply\nFUCK_TYLER 1 points 24 hours ago i saw this last night 😂😂😂 permalink award report block reply\nwalls4america 1 points 1 day ago My DNA results show I have a large percentage of Denmark ancestry. So that means any of my homemade cookies are authentic Danish cookies. permalink award report block reply\nHerpawinski OP 1 points 1 day ago Song is from this guy: https://www.youtube.com/@vindaloosingh permalink award report block reply\nCrappydatum 1 points 23 hours ago Which hand did they wipe with? permalink award report block reply\nScottx 1 points 20 hours ago Oreos are made in Mexico. No thanks. permalink award report block reply Blackmore 1 points 15 hours ago That does it no more for me. permalink parent award report block reply\nBlackmore 1 points 15 hours ago That does it no more for me. permalink parent award report block reply"}