{"id": "1ARK9l8Yq4", "contents": "780 \"They bullied, stole a crucifix from him, beat him, mocked him for being white and he was arrested. Investigate that 👇\" posted 24 hours ago by bleeje 48 comments award share report block Sweet Momster @sweet_momster • 1d @AAGDhillon @UCBerkeley @CivilRights They bullied, stole a crucifix from him, beat him, mocked him for being white and he was arrested. Investigate that 👇\n48 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Magma_Biscuit 56 points 23 hours ago This guy has my respect 👍🏼 permalink award report block reply Tradstew 38 points 23 hours ago But SPam said they will spare no expense 'unmasking' those who commit 'acts' of violence. So I'm sure they'll stop now. permalink award report block reply Stanwyk74 18 points 23 hours ago Nail day permalink parent award report block reply snoopy3210 -1 points 16 hours ago That’s a lot of ketchup for this actor permalink parent award report block reply MastaJoda 9 points 22 hours ago She was talking about anyone on the right that stands up for themselves or ''instigates'' their own violent beating by trying to talk to DC's domestic terrorist organization. Change my mind.... permalink parent award report block reply Orlando_Doom 5 points 22 hours ago Unmasking, lol. Did Trump unmask any of the cartel terrorists on the boats we bombed? (An action I fully support) permalink parent award report block reply Glory-Unto-God 5 points 20 hours ago Unmasked in the sense that their face is no longer on their body permalink parent award report block reply westrock2000 4 points 18 hours ago It’s a Venezuelan Face Off permalink parent award report block reply Mortal_Wombat 1 points 12 hours ago Talk about \"going out with a bang\" 💀 permalink parent award report block reply StCharlie 5 points 21 hours ago Fire PAM already.  She is doing nothing. permalink parent award report block reply BruddahIz 3 points 17 hours ago SPam Bondi ?  - I like that. permalink parent award report block reply Mortal_Wombat 1 points 12 hours ago Bill Barrbie is a classic now too. permalink parent award report block reply load 1 more comments... NotYourMan 25 points 23 hours ago The insurrection against the US, the constitution and the people continues unabated by the republicans.  Its time to arrest Antifa members and put them away (not just the ones attacking federal law enforcement but all of them) and lets destroy the universities too. permalink award report block reply Orlando_Doom 12 points 22 hours ago Trump needs to issue a blanket pardon for any American that kills antifa terrorists in any state. permalink parent award report block reply Floppybutthole 3 points 19 hours ago And illegals.   Non illegals are welcome..... to leave permalink parent award report block reply MastaJoda 7 points 22 hours ago lol Arrest... Your govt hates you and isnt even arresting domestic terrorists ffs. If we dont rise up like Ireland we are fucked. Zion Don is compromised, and shit will get A LOT worse for us the more we just take it. All we have is each other. NO ONE is going to save us but us. permalink parent award report block reply rockaustin 18 points 23 hours ago And republicans won’t do anything about it permalink award report block reply MastaJoda 10 points 22 hours ago WTF ARE WE GOING TO DO ABOUT IT?? The RINO Party hasnt given af about us since the CIAs failed assassination attempt on Reagan, ffs. No one will save us but us. permalink parent award report block reply rockaustin 1 points 10 hours ago We’re not going to do anything permalink parent award report block reply Bruno 17 points 23 hours ago So is ANTIFA a terrorist group or not? permalink award report block reply Orlando_Doom 20 points 22 hours ago Trump forgot. He's too busy being the world's president. permalink parent award report block reply slangin_paint 3 points 22 hours ago I heard it is just an idea permalink parent award report block reply MastaJoda 3 points 22 hours ago Bro, FUCK TRUMP permalink parent award report block reply Mhmm2MoreWeeks 0 points 17 hours ago Uniparty is just putting on a big fucking show to fool the legion of morons that is America. Just like Deep State Globalists did to all USA Allies already. permalink parent award report block reply Aggrieved03 15 points 22 hours ago It gets so tiring, White Christians are under constant attack in their own country and we're busy defending foreigners around the world. I know, I know, I'm a black pilled doomer. permalink award report block reply 27Sandino 5 points 21 hours ago The original black pilled guy is Devon stack, he streams on odysee, he was right from the beginning He's extremely underrated, send him some love permalink parent award report block reply HeatherSwanson 9 points 22 hours ago Jesus, is that you? Please forgive them…. Fuck it. Shoot Antifa in the neck. permalink award report block reply PatriotSkorzeny 8 points 23 hours ago Look at the mongrol cop. permalink award report block reply Captain_Updoot 7 points 22 hours ago I’m 45mn from Portland, and have avoided it like the plague since’20, but it feels like it’s time to re- engage… permalink award report block reply MastaJoda -1 points 22 hours ago Oregon's Mutual Combat Laws would've kept me engaged... permalink parent award report block reply FrensInLowPlaces 1 points 18 hours ago Its adorable you think they'd judge you equally permalink parent award report block reply shockpurseyell 5 points 20 hours ago Who’s the police chief there. Sheboon Pittman, formerly with Capitol Police? permalink award report block reply lul_cheto 4 points 19 hours ago Best we can do is lock up the kid that said mean things to Dave portnoy permalink award report block reply Ligersrule1 4 points 20 hours ago A picture says a thousand words permalink award report block reply Orlando_Doom 4 points 22 hours ago The cops are antifa terrorists. permalink award report block reply Luvs_2_Bop 3 points 20 hours ago 🤡🌎 HONK HONK permalink award report block reply Oodles 3 points 20 hours ago Cops are not your friends. They would have no problem throwing you and your family in jail if given the word. permalink award report block reply CrossTheRubixCube 3 points 22 hours ago Was he out there alone? permalink award report block reply EatChit -7 points 22 hours ago This dude is a massive retard thinking they weren't going to do exactly what they did. \"We're pilgrims in an unholy land.\" permalink parent award report block reply IBentMyWookie 10 points 21 hours ago At least he went out there. What did we do this week? permalink parent award report block reply EatChit 1 points 4 hours ago Not get our asses kicked and arrested/charged in a liberal fuckhole city permalink parent award report block reply IBentMyWookie 1 points 3 hours ago As New York falls and Cali taxes to death, those liberal fuckholes will be everywhere someday. Look at Texas: at first it was just Austin and Houston, then Dallas and border towns, now there’s a sharia city being built smack dab in the middle of God’s country. permalink parent award report block reply view 1 more comments... RuleoVicus 1 points 19 hours ago Perform your username. permalink parent award report block reply CharlesWilliams 2 points 17 hours ago “Remember, they hated me first.”   Although being burned at the stake in the colliseum is currently out of style, (so far) there are opportunities to take a whipping, and even be thrown into a dungeon in chains for Christ.  May it be blessed. I’m something of a religious fanatic, of course but it can’t be denied, suffering for the sake of Jesus Christ is a blessing. permalink award report block reply lizardo221 2 points 18 hours ago Didn't they only detain him in the moment and then released him later with no charges? permalink award report block reply Spellmonger 2 points 17 hours ago So, Obama is still President ? permalink award report block reply\nMagma_Biscuit 56 points 23 hours ago This guy has my respect 👍🏼 permalink award report block reply\nTradstew 38 points 23 hours ago But SPam said they will spare no expense 'unmasking' those who commit 'acts' of violence. So I'm sure they'll stop now. permalink award report block reply Stanwyk74 18 points 23 hours ago Nail day permalink parent award report block reply snoopy3210 -1 points 16 hours ago That’s a lot of ketchup for this actor permalink parent award report block reply MastaJoda 9 points 22 hours ago She was talking about anyone on the right that stands up for themselves or ''instigates'' their own violent beating by trying to talk to DC's domestic terrorist organization. Change my mind.... permalink parent award report block reply Orlando_Doom 5 points 22 hours ago Unmasking, lol. Did Trump unmask any of the cartel terrorists on the boats we bombed? (An action I fully support) permalink parent award report block reply Glory-Unto-God 5 points 20 hours ago Unmasked in the sense that their face is no longer on their body permalink parent award report block reply westrock2000 4 points 18 hours ago It’s a Venezuelan Face Off permalink parent award report block reply Mortal_Wombat 1 points 12 hours ago Talk about \"going out with a bang\" 💀 permalink parent award report block reply StCharlie 5 points 21 hours ago Fire PAM already.  She is doing nothing. permalink parent award report block reply BruddahIz 3 points 17 hours ago SPam Bondi ?  - I like that. permalink parent award report block reply Mortal_Wombat 1 points 12 hours ago Bill Barrbie is a classic now too. permalink parent award report block reply load 1 more comments...\nStanwyk74 18 points 23 hours ago Nail day permalink parent award report block reply snoopy3210 -1 points 16 hours ago That’s a lot of ketchup for this actor permalink parent award report block reply\nsnoopy3210 -1 points 16 hours ago That’s a lot of ketchup for this actor permalink parent award report block reply\nMastaJoda 9 points 22 hours ago She was talking about anyone on the right that stands up for themselves or ''instigates'' their own violent beating by trying to talk to DC's domestic terrorist organization. Change my mind.... permalink parent award report block reply\nOrlando_Doom 5 points 22 hours ago Unmasking, lol. Did Trump unmask any of the cartel terrorists on the boats we bombed? (An action I fully support) permalink parent award report block reply Glory-Unto-God 5 points 20 hours ago Unmasked in the sense that their face is no longer on their body permalink parent award report block reply westrock2000 4 points 18 hours ago It’s a Venezuelan Face Off permalink parent award report block reply Mortal_Wombat 1 points 12 hours ago Talk about \"going out with a bang\" 💀 permalink parent award report block reply\nGlory-Unto-God 5 points 20 hours ago Unmasked in the sense that their face is no longer on their body permalink parent award report block reply westrock2000 4 points 18 hours ago It’s a Venezuelan Face Off permalink parent award report block reply Mortal_Wombat 1 points 12 hours ago Talk about \"going out with a bang\" 💀 permalink parent award report block reply\nwestrock2000 4 points 18 hours ago It’s a Venezuelan Face Off permalink parent award report block reply Mortal_Wombat 1 points 12 hours ago Talk about \"going out with a bang\" 💀 permalink parent award report block reply\nMortal_Wombat 1 points 12 hours ago Talk about \"going out with a bang\" 💀 permalink parent award report block reply\nStCharlie 5 points 21 hours ago Fire PAM already.  She is doing nothing. permalink parent award report block reply\nBruddahIz 3 points 17 hours ago SPam Bondi ?  - I like that. permalink parent award report block reply Mortal_Wombat 1 points 12 hours ago Bill Barrbie is a classic now too. permalink parent award report block reply\nMortal_Wombat 1 points 12 hours ago Bill Barrbie is a classic now too. permalink parent award report block reply\nNotYourMan 25 points 23 hours ago The insurrection against the US, the constitution and the people continues unabated by the republicans.  Its time to arrest Antifa members and put them away (not just the ones attacking federal law enforcement but all of them) and lets destroy the universities too. permalink award report block reply Orlando_Doom 12 points 22 hours ago Trump needs to issue a blanket pardon for any American that kills antifa terrorists in any state. permalink parent award report block reply Floppybutthole 3 points 19 hours ago And illegals.   Non illegals are welcome..... to leave permalink parent award report block reply MastaJoda 7 points 22 hours ago lol Arrest... Your govt hates you and isnt even arresting domestic terrorists ffs. If we dont rise up like Ireland we are fucked. Zion Don is compromised, and shit will get A LOT worse for us the more we just take it. All we have is each other. NO ONE is going to save us but us. permalink parent award report block reply\nOrlando_Doom 12 points 22 hours ago Trump needs to issue a blanket pardon for any American that kills antifa terrorists in any state. permalink parent award report block reply Floppybutthole 3 points 19 hours ago And illegals.   Non illegals are welcome..... to leave permalink parent award report block reply\nFloppybutthole 3 points 19 hours ago And illegals.   Non illegals are welcome..... to leave permalink parent award report block reply\nMastaJoda 7 points 22 hours ago lol Arrest... Your govt hates you and isnt even arresting domestic terrorists ffs. If we dont rise up like Ireland we are fucked. Zion Don is compromised, and shit will get A LOT worse for us the more we just take it. All we have is each other. NO ONE is going to save us but us. permalink parent award report block reply\nrockaustin 18 points 23 hours ago And republicans won’t do anything about it permalink award report block reply MastaJoda 10 points 22 hours ago WTF ARE WE GOING TO DO ABOUT IT?? The RINO Party hasnt given af about us since the CIAs failed assassination attempt on Reagan, ffs. No one will save us but us. permalink parent award report block reply rockaustin 1 points 10 hours ago We’re not going to do anything permalink parent award report block reply\nMastaJoda 10 points 22 hours ago WTF ARE WE GOING TO DO ABOUT IT?? The RINO Party hasnt given af about us since the CIAs failed assassination attempt on Reagan, ffs. No one will save us but us. permalink parent award report block reply rockaustin 1 points 10 hours ago We’re not going to do anything permalink parent award report block reply\nrockaustin 1 points 10 hours ago We’re not going to do anything permalink parent award report block reply\nBruno 17 points 23 hours ago So is ANTIFA a terrorist group or not? permalink award report block reply Orlando_Doom 20 points 22 hours ago Trump forgot. He's too busy being the world's president. permalink parent award report block reply slangin_paint 3 points 22 hours ago I heard it is just an idea permalink parent award report block reply MastaJoda 3 points 22 hours ago Bro, FUCK TRUMP permalink parent award report block reply Mhmm2MoreWeeks 0 points 17 hours ago Uniparty is just putting on a big fucking show to fool the legion of morons that is America. Just like Deep State Globalists did to all USA Allies already. permalink parent award report block reply\nOrlando_Doom 20 points 22 hours ago Trump forgot. He's too busy being the world's president. permalink parent award report block reply\nslangin_paint 3 points 22 hours ago I heard it is just an idea permalink parent award report block reply\nMastaJoda 3 points 22 hours ago Bro, FUCK TRUMP permalink parent award report block reply\nMhmm2MoreWeeks 0 points 17 hours ago Uniparty is just putting on a big fucking show to fool the legion of morons that is America. Just like Deep State Globalists did to all USA Allies already. permalink parent award report block reply\nAggrieved03 15 points 22 hours ago It gets so tiring, White Christians are under constant attack in their own country and we're busy defending foreigners around the world. I know, I know, I'm a black pilled doomer. permalink award report block reply 27Sandino 5 points 21 hours ago The original black pilled guy is Devon stack, he streams on odysee, he was right from the beginning He's extremely underrated, send him some love permalink parent award report block reply\n27Sandino 5 points 21 hours ago The original black pilled guy is Devon stack, he streams on odysee, he was right from the beginning He's extremely underrated, send him some love permalink parent award report block reply\nHeatherSwanson 9 points 22 hours ago Jesus, is that you? Please forgive them…. Fuck it. Shoot Antifa in the neck. permalink award report block reply\nPatriotSkorzeny 8 points 23 hours ago Look at the mongrol cop. permalink award report block reply\nCaptain_Updoot 7 points 22 hours ago I’m 45mn from Portland, and have avoided it like the plague since’20, but it feels like it’s time to re- engage… permalink award report block reply MastaJoda -1 points 22 hours ago Oregon's Mutual Combat Laws would've kept me engaged... permalink parent award report block reply FrensInLowPlaces 1 points 18 hours ago Its adorable you think they'd judge you equally permalink parent award report block reply\nMastaJoda -1 points 22 hours ago Oregon's Mutual Combat Laws would've kept me engaged... permalink parent award report block reply FrensInLowPlaces 1 points 18 hours ago Its adorable you think they'd judge you equally permalink parent award report block reply\nFrensInLowPlaces 1 points 18 hours ago Its adorable you think they'd judge you equally permalink parent award report block reply\nshockpurseyell 5 points 20 hours ago Who’s the police chief there. Sheboon Pittman, formerly with Capitol Police? permalink award report block reply\nlul_cheto 4 points 19 hours ago Best we can do is lock up the kid that said mean things to Dave portnoy permalink award report block reply\nLigersrule1 4 points 20 hours ago A picture says a thousand words permalink award report block reply\nOrlando_Doom 4 points 22 hours ago The cops are antifa terrorists. permalink award report block reply\nLuvs_2_Bop 3 points 20 hours ago 🤡🌎 HONK HONK permalink award report block reply\nOodles 3 points 20 hours ago Cops are not your friends. They would have no problem throwing you and your family in jail if given the word. permalink award report block reply\nCrossTheRubixCube 3 points 22 hours ago Was he out there alone? permalink award report block reply EatChit -7 points 22 hours ago This dude is a massive retard thinking they weren't going to do exactly what they did. \"We're pilgrims in an unholy land.\" permalink parent award report block reply IBentMyWookie 10 points 21 hours ago At least he went out there. What did we do this week? permalink parent award report block reply EatChit 1 points 4 hours ago Not get our asses kicked and arrested/charged in a liberal fuckhole city permalink parent award report block reply IBentMyWookie 1 points 3 hours ago As New York falls and Cali taxes to death, those liberal fuckholes will be everywhere someday. Look at Texas: at first it was just Austin and Houston, then Dallas and border towns, now there’s a sharia city being built smack dab in the middle of God’s country. permalink parent award report block reply view 1 more comments... RuleoVicus 1 points 19 hours ago Perform your username. permalink parent award report block reply\nEatChit -7 points 22 hours ago This dude is a massive retard thinking they weren't going to do exactly what they did. \"We're pilgrims in an unholy land.\" permalink parent award report block reply IBentMyWookie 10 points 21 hours ago At least he went out there. What did we do this week? permalink parent award report block reply EatChit 1 points 4 hours ago Not get our asses kicked and arrested/charged in a liberal fuckhole city permalink parent award report block reply IBentMyWookie 1 points 3 hours ago As New York falls and Cali taxes to death, those liberal fuckholes will be everywhere someday. Look at Texas: at first it was just Austin and Houston, then Dallas and border towns, now there’s a sharia city being built smack dab in the middle of God’s country. permalink parent award report block reply view 1 more comments... RuleoVicus 1 points 19 hours ago Perform your username. permalink parent award report block reply\nIBentMyWookie 10 points 21 hours ago At least he went out there. What did we do this week? permalink parent award report block reply EatChit 1 points 4 hours ago Not get our asses kicked and arrested/charged in a liberal fuckhole city permalink parent award report block reply IBentMyWookie 1 points 3 hours ago As New York falls and Cali taxes to death, those liberal fuckholes will be everywhere someday. Look at Texas: at first it was just Austin and Houston, then Dallas and border towns, now there’s a sharia city being built smack dab in the middle of God’s country. permalink parent award report block reply view 1 more comments...\nEatChit 1 points 4 hours ago Not get our asses kicked and arrested/charged in a liberal fuckhole city permalink parent award report block reply IBentMyWookie 1 points 3 hours ago As New York falls and Cali taxes to death, those liberal fuckholes will be everywhere someday. Look at Texas: at first it was just Austin and Houston, then Dallas and border towns, now there’s a sharia city being built smack dab in the middle of God’s country. permalink parent award report block reply view 1 more comments...\nIBentMyWookie 1 points 3 hours ago As New York falls and Cali taxes to death, those liberal fuckholes will be everywhere someday. Look at Texas: at first it was just Austin and Houston, then Dallas and border towns, now there’s a sharia city being built smack dab in the middle of God’s country. permalink parent award report block reply view 1 more comments...\nRuleoVicus 1 points 19 hours ago Perform your username. permalink parent award report block reply\nCharlesWilliams 2 points 17 hours ago “Remember, they hated me first.”   Although being burned at the stake in the colliseum is currently out of style, (so far) there are opportunities to take a whipping, and even be thrown into a dungeon in chains for Christ.  May it be blessed. I’m something of a religious fanatic, of course but it can’t be denied, suffering for the sake of Jesus Christ is a blessing. permalink award report block reply\nlizardo221 2 points 18 hours ago Didn't they only detain him in the moment and then released him later with no charges? permalink award report block reply\nSpellmonger 2 points 17 hours ago So, Obama is still President ? permalink award report block reply"}