{"id": "1ARK53JHEM", "contents": "249 Getting rid of Home Ec classes was clearly a HUGE mistake posted 6 days ago by Antenna 68 comments award share report block Joe Rogan Podcast News @joeroganhq • 6d I'll let you be the judge on this one.\n68 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style CleanUpPhillyTrump24 41 points 6 days ago 96% of that should not be allowed to be purchased with EBT. Cook or die. This low nutrition diet is why kids are growing up too stupid to live. Their welfare queen moms are feeding them nothing but trash. Anyone sensible would throw all but the potatoes and avocados right in the garbage rather than feed children with that. permalink award report block reply StCharlie 17 points 6 days ago Seriously, the packaged turkey costs just as much as a bag of one of those huge bags of chips.  Why can't she buy off brand?  Get cheap spaghetti and meat sauce.  It would be dinner for multiple nights if need be.  All of her food is not filling.  It's air food.  You'll be hungry after eating a whole bag. permalink parent award report block reply walls4america 5 points 6 days ago Why buy pasta and meat sauce when it’s easy to make homemade pasta and homemade marinara sauce?? permalink parent award report block reply Shitsbrokeyo 5 points 5 days ago Because hours. That's unrealistic for working people. permalink parent award report block reply AngeredKabar 11 points 6 days ago If we're gonna do welfare, it should give you only flour and yeast and potatoes and cabbage. permalink parent award report block reply FerkenBlerkin 11 points 6 days ago Someone tell this fat bitch that people are making it because they don't eat snacks.  Ice cream, donuts, chips?   I bet she wonders why she's bigger than the refrigerator permalink parent award report block reply anotherthing 4 points 5 days ago I've mentioned this since the SNAP thing began, but I feed a family of three on $300 to $350 per month. You know how? I don't buy hardly any of the shit she just bought. Cereal and ice cream are the only two things I get that I saw there, and two gallons of ice cream should last WAY more than a week. Those doughnut holes she bought are $3.34 here in Kentucky. That $6.68 would buy the jump pack of chicken drumsticks, which can make a minimum of two meals. That 120 Pizza Rolls is $11.87. That's a 3 pound ground beef log. Ritz Crackers are $3.97. That Krave cereal is $6.96 for the 32oz bag, and it's garbage. Those chips are $5.94 each. That Jimmy Dean's breakfast sandwiches box is $11.46 for 8 sandwiches. Those sealed packages of tuna are $1.24 a piece for 2.6oz of tuna. You can get a 1lb4oz can pack of tuna for $3.84. She's paying over double the cost of the tuna in a can for those packages. Her choices aren't just nutritionally retarded, they're budget retarded too. permalink parent award report block reply Midsouth 5 points 6 days ago I got the impression that she actually paid for this; not EBT.  But I do agree with the op, home-ec needs to be reinstated permalink parent award report block reply anotherthing 2 points 5 days ago I'm wondering if she paid for this because her SNAP got cut off. That looks like SNAP shopping to me. I mentioned this in another post, just above this one, but she's paying over twice as much for those tuna packages as the canned price. She could get a 1lb4oz pack of canned tuna for less than $4, and those 8 packages are nearly $10. The difference is .08oz of tuna, which you'll probably lose more than that in the corners of those foil packs. If you're used to actually budgeting your purchases, these aren't the choices you make. permalink parent award report block reply cyberrigger 4 points 6 days ago I drink tap water. permalink parent award report block reply load 1 more comments... 0illuminated1 20 points 6 days ago Awfully nice house for a poor person.  Maybe if ahe downsized on her living quarters and purchased raw vegetables she could afford to feed her family. permalink award report block reply AndanteAndante 10 points 6 days ago Maybe if she also gave some of her portions to her kids she would be so FAT. permalink parent award report block reply BaldyGull 2 points 5 days ago The ex-husband may have paid for that. permalink parent award report block reply TheChillingEffect 14 points 6 days ago And we wonder why we have health issues in the United States.  Seems pretty simple to me. A generation or two ago, the diet may have been poor people food (rice, beans, lower quality cuts of meat, home grown vegetables, homemade bread...), but people were much healthier.  Sweets, etc, were luxury items enjoyed sparingly and irregularly.  Now they're staples. No wonder we have problems. Learn to choose food wisely.  Learn to cook.  It's time consuming, but it's not that hard. permalink award report block reply DingleberryMutt 4 points 6 days ago Kroger has Chuck roast on sale for 599 a pound which I’m irritated about because the sale price used to be $4.99 a pound. Anyway i’m also getting a 5 pound bag of potatoes $1.99. I have parboiled carrots in the freezer from earlier this year when the carrots were on sale.  A bag of peas is like $1 and the large size of canned tomatoes is like $1.50 I’m going to make beef stew that will last me numerous days for dinner. This woman is fat and lazy. permalink parent award report block reply Wrexxis780 14 points 6 days ago SOME snacks and deserts It’s like 90% unhealthy foods permalink award report block reply user2827 5 points 6 days ago I counted 2 items that qualify as food (4 if you count ice cream) permalink parent award report block reply LIbertyRises 5 points 6 days ago Haha, yeh thought the same thing, mostly shit permalink parent award report block reply anotherthing 4 points 5 days ago I didn't see much on there that WASN'T a snack. It was pretty much all snack food. High carb garbage. I bet her kids are fat as Hell just like she is. permalink parent award report block reply AndanteAndante 4 points 6 days ago A FEW avocados. She had a huge bag! permalink parent award report block reply PatGarrett 5 points 6 days ago Two gallons of ice cream. That’s dedication to the diabetic lifestyle. permalink parent award report block reply walls4america 3 points 6 days ago She could make her own ice cream or sorbet that’d be much healthier. permalink parent award report block reply Steve56775 11 points 6 days ago Home economics was required. It not only talked about health, but how to make a budget, how to balance a check book, and reconcile a statement, and how to prepare and shop for basic food. Drivers education was also required and you can see the difference everyday. permalink award report block reply imnotdeadyet 5 points 6 days ago I took a \"boys cooking\" class in middle school.  It was the hardest class to get into because once you cooked you got to eat what you cooked.  It was mostly baking, bit the final was making a pumpkin pie and you invited your favorite teacher to serve it to them and they decided how well you did.  You had to do any the cleanup and dishes after you cooked. permalink parent award report block reply walls4america 4 points 6 days ago My Home Ec also taught sewing with a sewing machine, knitting, crocheting, and macrame. In my second year of Home Ec we actually had two boys in our class. The first year, it was all girls. permalink parent award report block reply Stossels_stach 10 points 6 days ago This is your reminder that you can live off potatoes alone for months permalink award report block reply Antenna OP 8 points 6 days ago Just what I was thinking. Imagine how much rice, dry beans, canned food, potatoes, onions, and dry pasta you could get for $115! permalink parent award report block reply Stossels_stach 6 points 6 days ago That's good eatin', in my opinion. Not to mention the massive salt bomb all those packaged foods contain, along with chemical preservatives and gmo's. permalink parent award report block reply Givesgunstogrannies 5 points 6 days ago Ramen is awful.  You are right.  She is feeding her family garbage.   This doesn't include dinners i.e. fast food permalink parent award report block reply Tikk 10 points 6 days ago Notice it's almost exclusively named brand items. permalink award report block reply punkalicious 9 points 6 days ago A 10 lbs bag of chicken leg quarters is $8.90 at my local Food Lion. Rice, beans, potatoes, bananas, etc are cheap as fuck. Stop eating processed, packaged junk. Dr Pepper? Yeah, soda has gotten surprisingly expensive. I like a little caffeine in the morning but hate coffee. Used to drink soda but now I use water enhancers with caffeine in a little squeeze bottle. Way more economical. permalink award report block reply learntocode 6 points 6 days ago Soda is himan rat poison. Not worth it. permalink parent award report block reply SquatchNDenver 4 points 6 days ago 100 tea bags two buck $3 for sugar\nwe only add to take out the bitter nothing beats Ice tea!!! oh and i hae to have a dollar lime squirt bottle too!! $6.00 for drinks for two for two weeks. NO SODA at home. permalink parent award report block reply anotherthing 4 points 5 days ago And tea isn't hard to make either. Just a giant jar, fill with water, toss in 6-8 tea bags depending on the size of the jar, add sugar if you want, and set it out in the sun for a few hours. permalink parent award report block reply BaldyGull 3 points 5 days ago I get the gallon tea bags now. I pay a markup, but it is worth it to me. You can skip the sun tea too. My hot water is hot enough I can get a pot of hot water straight from the faucet and set it on the counter for an hour to brew. When I pour my last glass of tea I get fresh tea brewing and a gallon of water (and my sugar) chilling in the fridge. Next time I need a drink just mixed the tea and water and pour. permalink parent award report block reply BaldyGull 2 points 5 days ago I suspect soda prices are propped up by SNAP. It is like college loans. When you have access to funds you aren't looking at the cost. Of course college debt has to be paid back but short sighted 18 year olds don't often account for that. SNAP's only limitation is allotment and they are allotted more than they need so they buy this junk and drive up the prices because they are not price sensitive. permalink parent award report block reply Formerlurker92 7 points 6 days ago You are unemployed. Fucking cook! permalink award report block reply crashdaddy 7 points 6 days ago Spends $115 -- the only food she buys is avocados and potatoes. permalink award report block reply OpusX 6 points 6 days ago Just made myself a \"poor man's\" dinner the other night of spanish red rice and onions served with pinto beans, fresh salsa and avocado. Didn't spend more than $20 and made at least 8-10+ helpings. Don't get me wrong, the cost of groceries is absurd right now, but that doesn't mean you can't be frugal either. permalink award report block reply Moebius 5 points 6 days ago DIY Food Kit:  Lasts 30+ days 20 lbs of Rice:  $11.14 20 lbs of Pinto Beans:  $14.94 1 lb Salt Pork:  $7.92 20 lbs Flour:  $17.98 4 Oz Active Dry Yeast:  $5.48 22 Oz Baking Powder:  $4.97 64 Oz Peanut Butter:  $6.47 32 Oz Raw Honey:  $10.97 permalink award report block reply Reefay 3 points 6 days ago I don't really see a pound of pork lasting for 30 days. Maybe 5 pounds so they can cut it up and make meals out of it permalink parent award report block reply Moebius 6 points 6 days ago Salt Pork.  It's for flavoring the Beans.  You only need a small piece about half an ounce. While i agree more is better, if  you want more Pork then get a Job... permalink parent award report block reply Reefay 3 points 6 days ago But muh free gibs! permalink parent award report block reply Rerun1Central 5 points 6 days ago No food permalink award report block reply Maxdady01 5 points 6 days ago I'm old but lunch consisted of bologna sandwiches, water, and if we were lucky some potato chips. All generic Stater Bros brand. permalink award report block reply Reefay 4 points 6 days ago Stater Bros. Old school. permalink parent award report block reply cusp-of-carabelli 4 points 6 days ago Y’all must reside in the IE.  The Corona one was ok; Perris was a little sketchy I must say, but better than the Perris Food 4 Less. permalink parent award report block reply Coprolite 4 points 6 days ago I would have gotten more potatoes an none of the other crap some bacon, butter, Bisquick, cheese, macaroni noodles, an whatever marked down meat they have. permalink award report block reply FearGodTheAlmighty 4 points 6 days ago And she actually says out loud \"this is for my kids\" and \"there are no dinners here.\" permalink award report block reply henri_derelicte 4 points 6 days ago Yeah, it’s a lot of food. But it’s not the healthiest food… permalink award report block reply goatnuts 4 points 6 days ago It's only food if your definition of food is \"something you chew then swallow\". That shit is drugs disguised as food. permalink parent award report block reply reversethefraud 4 points 6 days ago yeah but they did get a thing of Dr Pepper, and a thing of cereal which aint that bad, and when you throw in the ice creams, well I think you'd agree it aint all that bad. permalink parent award report block reply sir_swaggage 4 points 6 days ago Underrated kek permalink parent award report block reply CleanUpPhillyTrump24 4 points 6 days ago Big Ag needs to be banned from lobbying Congress. permalink parent award report block reply FearGodTheAlmighty 3 points 6 days ago zero meat except bagged tuna packets permalink parent award report block reply SquatchNDenver 4 points 6 days ago I noticed she didn't mention the ranch dressing bottle.\nno eggs ... no milk ...huh? permalink award report block reply FearGodTheAlmighty 4 points 6 days ago no meat (tuna packets don't count) permalink parent award report block reply Hangmhigh 4 points 6 days ago I bet thats 8 pounds of sugar there. permalink award report block reply FerkenBlerkin 4 points 6 days ago NGL I took home economics 1 year because that's where the actual females were.  Puberty told me to make muffins to meet girls. permalink award report block reply Pnw4gotpwd 3 points 6 days ago Nicer house than mine. Also did she say she was on EBT? permalink award report block reply South_Florida_Guy 3 points 6 days ago Does not know how to shop at all permalink award report block reply Trunalimunumaprzur 3 points 6 days ago Tuna,Taters and avocado. permalink award report block reply RedPillosopher1776 3 points 6 days ago You see the garbage people eat and those same people will insist their weight isn't a result of their diet and laziness. permalink award report block reply learntocode 3 points 6 days ago W.T.F. If it was $20 you would not be makin it, you fat dumb bitch. OMG, veggies and rice and beans you stupid fucking dipshit moron motherfucker. permalink award report block reply FrozenEagle 3 points 6 days ago Getting rid of Home Ec. was not a mistake. It was meticulously planned. A sensible state teaches its young how to survive on their own. A nanny state teaches its young to be dependant upon the state. Forever. permalink award report block reply MastaJoda 3 points 6 days ago Yeah but she gets diabetes at no extra charge! permalink award report block reply Carmen1956 3 points 5 days ago She is so stupid that it makes my head hurt! permalink award report block reply WanderingStar 2 points 5 days ago What happened to not eating processed foods?  Lady, you're killing your family.  And dinners?  I'm sure you're going to Jack-in-the-box. permalink award report block reply Tartakovsky 2 points 5 days ago No milk, eggs, bread, orange juice, vegetables, salad dressing, rice, pasta, protein, etc. She could have bought those items for under $100 and fed her family for two weeks. Just a bunch of garbage. No wonder she’s fat trash. permalink award report block reply FearGodTheAlmighty 2 points 6 days ago Women go out of their way to buy ALL the most ridiculous shit permalink award report block reply\nCleanUpPhillyTrump24 41 points 6 days ago 96% of that should not be allowed to be purchased with EBT. Cook or die. This low nutrition diet is why kids are growing up too stupid to live. Their welfare queen moms are feeding them nothing but trash. Anyone sensible would throw all but the potatoes and avocados right in the garbage rather than feed children with that. permalink award report block reply StCharlie 17 points 6 days ago Seriously, the packaged turkey costs just as much as a bag of one of those huge bags of chips.  Why can't she buy off brand?  Get cheap spaghetti and meat sauce.  It would be dinner for multiple nights if need be.  All of her food is not filling.  It's air food.  You'll be hungry after eating a whole bag. permalink parent award report block reply walls4america 5 points 6 days ago Why buy pasta and meat sauce when it’s easy to make homemade pasta and homemade marinara sauce?? permalink parent award report block reply Shitsbrokeyo 5 points 5 days ago Because hours. That's unrealistic for working people. permalink parent award report block reply AngeredKabar 11 points 6 days ago If we're gonna do welfare, it should give you only flour and yeast and potatoes and cabbage. permalink parent award report block reply FerkenBlerkin 11 points 6 days ago Someone tell this fat bitch that people are making it because they don't eat snacks.  Ice cream, donuts, chips?   I bet she wonders why she's bigger than the refrigerator permalink parent award report block reply anotherthing 4 points 5 days ago I've mentioned this since the SNAP thing began, but I feed a family of three on $300 to $350 per month. You know how? I don't buy hardly any of the shit she just bought. Cereal and ice cream are the only two things I get that I saw there, and two gallons of ice cream should last WAY more than a week. Those doughnut holes she bought are $3.34 here in Kentucky. That $6.68 would buy the jump pack of chicken drumsticks, which can make a minimum of two meals. That 120 Pizza Rolls is $11.87. That's a 3 pound ground beef log. Ritz Crackers are $3.97. That Krave cereal is $6.96 for the 32oz bag, and it's garbage. Those chips are $5.94 each. That Jimmy Dean's breakfast sandwiches box is $11.46 for 8 sandwiches. Those sealed packages of tuna are $1.24 a piece for 2.6oz of tuna. You can get a 1lb4oz can pack of tuna for $3.84. She's paying over double the cost of the tuna in a can for those packages. Her choices aren't just nutritionally retarded, they're budget retarded too. permalink parent award report block reply Midsouth 5 points 6 days ago I got the impression that she actually paid for this; not EBT.  But I do agree with the op, home-ec needs to be reinstated permalink parent award report block reply anotherthing 2 points 5 days ago I'm wondering if she paid for this because her SNAP got cut off. That looks like SNAP shopping to me. I mentioned this in another post, just above this one, but she's paying over twice as much for those tuna packages as the canned price. She could get a 1lb4oz pack of canned tuna for less than $4, and those 8 packages are nearly $10. The difference is .08oz of tuna, which you'll probably lose more than that in the corners of those foil packs. If you're used to actually budgeting your purchases, these aren't the choices you make. permalink parent award report block reply cyberrigger 4 points 6 days ago I drink tap water. permalink parent award report block reply load 1 more comments...\nStCharlie 17 points 6 days ago Seriously, the packaged turkey costs just as much as a bag of one of those huge bags of chips.  Why can't she buy off brand?  Get cheap spaghetti and meat sauce.  It would be dinner for multiple nights if need be.  All of her food is not filling.  It's air food.  You'll be hungry after eating a whole bag. permalink parent award report block reply walls4america 5 points 6 days ago Why buy pasta and meat sauce when it’s easy to make homemade pasta and homemade marinara sauce?? permalink parent award report block reply Shitsbrokeyo 5 points 5 days ago Because hours. That's unrealistic for working people. permalink parent award report block reply\nwalls4america 5 points 6 days ago Why buy pasta and meat sauce when it’s easy to make homemade pasta and homemade marinara sauce?? permalink parent award report block reply Shitsbrokeyo 5 points 5 days ago Because hours. That's unrealistic for working people. permalink parent award report block reply\nShitsbrokeyo 5 points 5 days ago Because hours. That's unrealistic for working people. permalink parent award report block reply\nAngeredKabar 11 points 6 days ago If we're gonna do welfare, it should give you only flour and yeast and potatoes and cabbage. permalink parent award report block reply\nFerkenBlerkin 11 points 6 days ago Someone tell this fat bitch that people are making it because they don't eat snacks.  Ice cream, donuts, chips?   I bet she wonders why she's bigger than the refrigerator permalink parent award report block reply anotherthing 4 points 5 days ago I've mentioned this since the SNAP thing began, but I feed a family of three on $300 to $350 per month. You know how? I don't buy hardly any of the shit she just bought. Cereal and ice cream are the only two things I get that I saw there, and two gallons of ice cream should last WAY more than a week. Those doughnut holes she bought are $3.34 here in Kentucky. That $6.68 would buy the jump pack of chicken drumsticks, which can make a minimum of two meals. That 120 Pizza Rolls is $11.87. That's a 3 pound ground beef log. Ritz Crackers are $3.97. That Krave cereal is $6.96 for the 32oz bag, and it's garbage. Those chips are $5.94 each. That Jimmy Dean's breakfast sandwiches box is $11.46 for 8 sandwiches. Those sealed packages of tuna are $1.24 a piece for 2.6oz of tuna. You can get a 1lb4oz can pack of tuna for $3.84. She's paying over double the cost of the tuna in a can for those packages. Her choices aren't just nutritionally retarded, they're budget retarded too. permalink parent award report block reply\nanotherthing 4 points 5 days ago I've mentioned this since the SNAP thing began, but I feed a family of three on $300 to $350 per month. You know how? I don't buy hardly any of the shit she just bought. Cereal and ice cream are the only two things I get that I saw there, and two gallons of ice cream should last WAY more than a week. Those doughnut holes she bought are $3.34 here in Kentucky. That $6.68 would buy the jump pack of chicken drumsticks, which can make a minimum of two meals. That 120 Pizza Rolls is $11.87. That's a 3 pound ground beef log. Ritz Crackers are $3.97. That Krave cereal is $6.96 for the 32oz bag, and it's garbage. Those chips are $5.94 each. That Jimmy Dean's breakfast sandwiches box is $11.46 for 8 sandwiches. Those sealed packages of tuna are $1.24 a piece for 2.6oz of tuna. You can get a 1lb4oz can pack of tuna for $3.84. She's paying over double the cost of the tuna in a can for those packages. Her choices aren't just nutritionally retarded, they're budget retarded too. permalink parent award report block reply\nMidsouth 5 points 6 days ago I got the impression that she actually paid for this; not EBT.  But I do agree with the op, home-ec needs to be reinstated permalink parent award report block reply anotherthing 2 points 5 days ago I'm wondering if she paid for this because her SNAP got cut off. That looks like SNAP shopping to me. I mentioned this in another post, just above this one, but she's paying over twice as much for those tuna packages as the canned price. She could get a 1lb4oz pack of canned tuna for less than $4, and those 8 packages are nearly $10. The difference is .08oz of tuna, which you'll probably lose more than that in the corners of those foil packs. If you're used to actually budgeting your purchases, these aren't the choices you make. permalink parent award report block reply\nanotherthing 2 points 5 days ago I'm wondering if she paid for this because her SNAP got cut off. That looks like SNAP shopping to me. I mentioned this in another post, just above this one, but she's paying over twice as much for those tuna packages as the canned price. She could get a 1lb4oz pack of canned tuna for less than $4, and those 8 packages are nearly $10. The difference is .08oz of tuna, which you'll probably lose more than that in the corners of those foil packs. If you're used to actually budgeting your purchases, these aren't the choices you make. permalink parent award report block reply\ncyberrigger 4 points 6 days ago I drink tap water. permalink parent award report block reply\n0illuminated1 20 points 6 days ago Awfully nice house for a poor person.  Maybe if ahe downsized on her living quarters and purchased raw vegetables she could afford to feed her family. permalink award report block reply AndanteAndante 10 points 6 days ago Maybe if she also gave some of her portions to her kids she would be so FAT. permalink parent award report block reply BaldyGull 2 points 5 days ago The ex-husband may have paid for that. permalink parent award report block reply\nAndanteAndante 10 points 6 days ago Maybe if she also gave some of her portions to her kids she would be so FAT. permalink parent award report block reply\nBaldyGull 2 points 5 days ago The ex-husband may have paid for that. permalink parent award report block reply\nTheChillingEffect 14 points 6 days ago And we wonder why we have health issues in the United States.  Seems pretty simple to me. A generation or two ago, the diet may have been poor people food (rice, beans, lower quality cuts of meat, home grown vegetables, homemade bread...), but people were much healthier.  Sweets, etc, were luxury items enjoyed sparingly and irregularly.  Now they're staples. No wonder we have problems. Learn to choose food wisely.  Learn to cook.  It's time consuming, but it's not that hard. permalink award report block reply DingleberryMutt 4 points 6 days ago Kroger has Chuck roast on sale for 599 a pound which I’m irritated about because the sale price used to be $4.99 a pound. Anyway i’m also getting a 5 pound bag of potatoes $1.99. I have parboiled carrots in the freezer from earlier this year when the carrots were on sale.  A bag of peas is like $1 and the large size of canned tomatoes is like $1.50 I’m going to make beef stew that will last me numerous days for dinner. This woman is fat and lazy. permalink parent award report block reply\nDingleberryMutt 4 points 6 days ago Kroger has Chuck roast on sale for 599 a pound which I’m irritated about because the sale price used to be $4.99 a pound. Anyway i’m also getting a 5 pound bag of potatoes $1.99. I have parboiled carrots in the freezer from earlier this year when the carrots were on sale.  A bag of peas is like $1 and the large size of canned tomatoes is like $1.50 I’m going to make beef stew that will last me numerous days for dinner. This woman is fat and lazy. permalink parent award report block reply\nWrexxis780 14 points 6 days ago SOME snacks and deserts It’s like 90% unhealthy foods permalink award report block reply user2827 5 points 6 days ago I counted 2 items that qualify as food (4 if you count ice cream) permalink parent award report block reply LIbertyRises 5 points 6 days ago Haha, yeh thought the same thing, mostly shit permalink parent award report block reply anotherthing 4 points 5 days ago I didn't see much on there that WASN'T a snack. It was pretty much all snack food. High carb garbage. I bet her kids are fat as Hell just like she is. permalink parent award report block reply AndanteAndante 4 points 6 days ago A FEW avocados. She had a huge bag! permalink parent award report block reply PatGarrett 5 points 6 days ago Two gallons of ice cream. That’s dedication to the diabetic lifestyle. permalink parent award report block reply walls4america 3 points 6 days ago She could make her own ice cream or sorbet that’d be much healthier. permalink parent award report block reply\nuser2827 5 points 6 days ago I counted 2 items that qualify as food (4 if you count ice cream) permalink parent award report block reply\nLIbertyRises 5 points 6 days ago Haha, yeh thought the same thing, mostly shit permalink parent award report block reply\nanotherthing 4 points 5 days ago I didn't see much on there that WASN'T a snack. It was pretty much all snack food. High carb garbage. I bet her kids are fat as Hell just like she is. permalink parent award report block reply\nAndanteAndante 4 points 6 days ago A FEW avocados. She had a huge bag! permalink parent award report block reply PatGarrett 5 points 6 days ago Two gallons of ice cream. That’s dedication to the diabetic lifestyle. permalink parent award report block reply walls4america 3 points 6 days ago She could make her own ice cream or sorbet that’d be much healthier. permalink parent award report block reply\nPatGarrett 5 points 6 days ago Two gallons of ice cream. That’s dedication to the diabetic lifestyle. permalink parent award report block reply walls4america 3 points 6 days ago She could make her own ice cream or sorbet that’d be much healthier. permalink parent award report block reply\nwalls4america 3 points 6 days ago She could make her own ice cream or sorbet that’d be much healthier. permalink parent award report block reply\nSteve56775 11 points 6 days ago Home economics was required. It not only talked about health, but how to make a budget, how to balance a check book, and reconcile a statement, and how to prepare and shop for basic food. Drivers education was also required and you can see the difference everyday. permalink award report block reply imnotdeadyet 5 points 6 days ago I took a \"boys cooking\" class in middle school.  It was the hardest class to get into because once you cooked you got to eat what you cooked.  It was mostly baking, bit the final was making a pumpkin pie and you invited your favorite teacher to serve it to them and they decided how well you did.  You had to do any the cleanup and dishes after you cooked. permalink parent award report block reply walls4america 4 points 6 days ago My Home Ec also taught sewing with a sewing machine, knitting, crocheting, and macrame. In my second year of Home Ec we actually had two boys in our class. The first year, it was all girls. permalink parent award report block reply\nimnotdeadyet 5 points 6 days ago I took a \"boys cooking\" class in middle school.  It was the hardest class to get into because once you cooked you got to eat what you cooked.  It was mostly baking, bit the final was making a pumpkin pie and you invited your favorite teacher to serve it to them and they decided how well you did.  You had to do any the cleanup and dishes after you cooked. permalink parent award report block reply\nwalls4america 4 points 6 days ago My Home Ec also taught sewing with a sewing machine, knitting, crocheting, and macrame. In my second year of Home Ec we actually had two boys in our class. The first year, it was all girls. permalink parent award report block reply\nStossels_stach 10 points 6 days ago This is your reminder that you can live off potatoes alone for months permalink award report block reply Antenna OP 8 points 6 days ago Just what I was thinking. Imagine how much rice, dry beans, canned food, potatoes, onions, and dry pasta you could get for $115! permalink parent award report block reply Stossels_stach 6 points 6 days ago That's good eatin', in my opinion. Not to mention the massive salt bomb all those packaged foods contain, along with chemical preservatives and gmo's. permalink parent award report block reply Givesgunstogrannies 5 points 6 days ago Ramen is awful.  You are right.  She is feeding her family garbage.   This doesn't include dinners i.e. fast food permalink parent award report block reply\nAntenna OP 8 points 6 days ago Just what I was thinking. Imagine how much rice, dry beans, canned food, potatoes, onions, and dry pasta you could get for $115! permalink parent award report block reply Stossels_stach 6 points 6 days ago That's good eatin', in my opinion. Not to mention the massive salt bomb all those packaged foods contain, along with chemical preservatives and gmo's. permalink parent award report block reply Givesgunstogrannies 5 points 6 days ago Ramen is awful.  You are right.  She is feeding her family garbage.   This doesn't include dinners i.e. fast food permalink parent award report block reply\nStossels_stach 6 points 6 days ago That's good eatin', in my opinion. Not to mention the massive salt bomb all those packaged foods contain, along with chemical preservatives and gmo's. permalink parent award report block reply Givesgunstogrannies 5 points 6 days ago Ramen is awful.  You are right.  She is feeding her family garbage.   This doesn't include dinners i.e. fast food permalink parent award report block reply\nGivesgunstogrannies 5 points 6 days ago Ramen is awful.  You are right.  She is feeding her family garbage.   This doesn't include dinners i.e. fast food permalink parent award report block reply\nTikk 10 points 6 days ago Notice it's almost exclusively named brand items. permalink award report block reply\npunkalicious 9 points 6 days ago A 10 lbs bag of chicken leg quarters is $8.90 at my local Food Lion. Rice, beans, potatoes, bananas, etc are cheap as fuck. Stop eating processed, packaged junk. Dr Pepper? Yeah, soda has gotten surprisingly expensive. I like a little caffeine in the morning but hate coffee. Used to drink soda but now I use water enhancers with caffeine in a little squeeze bottle. Way more economical. permalink award report block reply learntocode 6 points 6 days ago Soda is himan rat poison. Not worth it. permalink parent award report block reply SquatchNDenver 4 points 6 days ago 100 tea bags two buck $3 for sugar\nwe only add to take out the bitter nothing beats Ice tea!!! oh and i hae to have a dollar lime squirt bottle too!! $6.00 for drinks for two for two weeks. NO SODA at home. permalink parent award report block reply anotherthing 4 points 5 days ago And tea isn't hard to make either. Just a giant jar, fill with water, toss in 6-8 tea bags depending on the size of the jar, add sugar if you want, and set it out in the sun for a few hours. permalink parent award report block reply BaldyGull 3 points 5 days ago I get the gallon tea bags now. I pay a markup, but it is worth it to me. You can skip the sun tea too. My hot water is hot enough I can get a pot of hot water straight from the faucet and set it on the counter for an hour to brew. When I pour my last glass of tea I get fresh tea brewing and a gallon of water (and my sugar) chilling in the fridge. Next time I need a drink just mixed the tea and water and pour. permalink parent award report block reply BaldyGull 2 points 5 days ago I suspect soda prices are propped up by SNAP. It is like college loans. When you have access to funds you aren't looking at the cost. Of course college debt has to be paid back but short sighted 18 year olds don't often account for that. SNAP's only limitation is allotment and they are allotted more than they need so they buy this junk and drive up the prices because they are not price sensitive. permalink parent award report block reply\nlearntocode 6 points 6 days ago Soda is himan rat poison. Not worth it. permalink parent award report block reply\nSquatchNDenver 4 points 6 days ago 100 tea bags two buck $3 for sugar\nwe only add to take out the bitter nothing beats Ice tea!!! oh and i hae to have a dollar lime squirt bottle too!! $6.00 for drinks for two for two weeks. NO SODA at home. permalink parent award report block reply anotherthing 4 points 5 days ago And tea isn't hard to make either. Just a giant jar, fill with water, toss in 6-8 tea bags depending on the size of the jar, add sugar if you want, and set it out in the sun for a few hours. permalink parent award report block reply BaldyGull 3 points 5 days ago I get the gallon tea bags now. I pay a markup, but it is worth it to me. You can skip the sun tea too. My hot water is hot enough I can get a pot of hot water straight from the faucet and set it on the counter for an hour to brew. When I pour my last glass of tea I get fresh tea brewing and a gallon of water (and my sugar) chilling in the fridge. Next time I need a drink just mixed the tea and water and pour. permalink parent award report block reply\nanotherthing 4 points 5 days ago And tea isn't hard to make either. Just a giant jar, fill with water, toss in 6-8 tea bags depending on the size of the jar, add sugar if you want, and set it out in the sun for a few hours. permalink parent award report block reply BaldyGull 3 points 5 days ago I get the gallon tea bags now. I pay a markup, but it is worth it to me. You can skip the sun tea too. My hot water is hot enough I can get a pot of hot water straight from the faucet and set it on the counter for an hour to brew. When I pour my last glass of tea I get fresh tea brewing and a gallon of water (and my sugar) chilling in the fridge. Next time I need a drink just mixed the tea and water and pour. permalink parent award report block reply\nBaldyGull 3 points 5 days ago I get the gallon tea bags now. I pay a markup, but it is worth it to me. You can skip the sun tea too. My hot water is hot enough I can get a pot of hot water straight from the faucet and set it on the counter for an hour to brew. When I pour my last glass of tea I get fresh tea brewing and a gallon of water (and my sugar) chilling in the fridge. Next time I need a drink just mixed the tea and water and pour. permalink parent award report block reply\nBaldyGull 2 points 5 days ago I suspect soda prices are propped up by SNAP. It is like college loans. When you have access to funds you aren't looking at the cost. Of course college debt has to be paid back but short sighted 18 year olds don't often account for that. SNAP's only limitation is allotment and they are allotted more than they need so they buy this junk and drive up the prices because they are not price sensitive. permalink parent award report block reply\nFormerlurker92 7 points 6 days ago You are unemployed. Fucking cook! permalink award report block reply\ncrashdaddy 7 points 6 days ago Spends $115 -- the only food she buys is avocados and potatoes. permalink award report block reply\nOpusX 6 points 6 days ago Just made myself a \"poor man's\" dinner the other night of spanish red rice and onions served with pinto beans, fresh salsa and avocado. Didn't spend more than $20 and made at least 8-10+ helpings. Don't get me wrong, the cost of groceries is absurd right now, but that doesn't mean you can't be frugal either. permalink award report block reply\nMoebius 5 points 6 days ago DIY Food Kit:  Lasts 30+ days 20 lbs of Rice:  $11.14 20 lbs of Pinto Beans:  $14.94 1 lb Salt Pork:  $7.92 20 lbs Flour:  $17.98 4 Oz Active Dry Yeast:  $5.48 22 Oz Baking Powder:  $4.97 64 Oz Peanut Butter:  $6.47 32 Oz Raw Honey:  $10.97 permalink award report block reply Reefay 3 points 6 days ago I don't really see a pound of pork lasting for 30 days. Maybe 5 pounds so they can cut it up and make meals out of it permalink parent award report block reply Moebius 6 points 6 days ago Salt Pork.  It's for flavoring the Beans.  You only need a small piece about half an ounce. While i agree more is better, if  you want more Pork then get a Job... permalink parent award report block reply Reefay 3 points 6 days ago But muh free gibs! permalink parent award report block reply\nReefay 3 points 6 days ago I don't really see a pound of pork lasting for 30 days. Maybe 5 pounds so they can cut it up and make meals out of it permalink parent award report block reply Moebius 6 points 6 days ago Salt Pork.  It's for flavoring the Beans.  You only need a small piece about half an ounce. While i agree more is better, if  you want more Pork then get a Job... permalink parent award report block reply Reefay 3 points 6 days ago But muh free gibs! permalink parent award report block reply\nMoebius 6 points 6 days ago Salt Pork.  It's for flavoring the Beans.  You only need a small piece about half an ounce. While i agree more is better, if  you want more Pork then get a Job... permalink parent award report block reply Reefay 3 points 6 days ago But muh free gibs! permalink parent award report block reply\nReefay 3 points 6 days ago But muh free gibs! permalink parent award report block reply\nRerun1Central 5 points 6 days ago No food permalink award report block reply\nMaxdady01 5 points 6 days ago I'm old but lunch consisted of bologna sandwiches, water, and if we were lucky some potato chips. All generic Stater Bros brand. permalink award report block reply Reefay 4 points 6 days ago Stater Bros. Old school. permalink parent award report block reply cusp-of-carabelli 4 points 6 days ago Y’all must reside in the IE.  The Corona one was ok; Perris was a little sketchy I must say, but better than the Perris Food 4 Less. permalink parent award report block reply\nReefay 4 points 6 days ago Stater Bros. Old school. permalink parent award report block reply cusp-of-carabelli 4 points 6 days ago Y’all must reside in the IE.  The Corona one was ok; Perris was a little sketchy I must say, but better than the Perris Food 4 Less. permalink parent award report block reply\ncusp-of-carabelli 4 points 6 days ago Y’all must reside in the IE.  The Corona one was ok; Perris was a little sketchy I must say, but better than the Perris Food 4 Less. permalink parent award report block reply\nCoprolite 4 points 6 days ago I would have gotten more potatoes an none of the other crap some bacon, butter, Bisquick, cheese, macaroni noodles, an whatever marked down meat they have. permalink award report block reply\nFearGodTheAlmighty 4 points 6 days ago And she actually says out loud \"this is for my kids\" and \"there are no dinners here.\" permalink award report block reply\nhenri_derelicte 4 points 6 days ago Yeah, it’s a lot of food. But it’s not the healthiest food… permalink award report block reply goatnuts 4 points 6 days ago It's only food if your definition of food is \"something you chew then swallow\". That shit is drugs disguised as food. permalink parent award report block reply reversethefraud 4 points 6 days ago yeah but they did get a thing of Dr Pepper, and a thing of cereal which aint that bad, and when you throw in the ice creams, well I think you'd agree it aint all that bad. permalink parent award report block reply sir_swaggage 4 points 6 days ago Underrated kek permalink parent award report block reply CleanUpPhillyTrump24 4 points 6 days ago Big Ag needs to be banned from lobbying Congress. permalink parent award report block reply FearGodTheAlmighty 3 points 6 days ago zero meat except bagged tuna packets permalink parent award report block reply\ngoatnuts 4 points 6 days ago It's only food if your definition of food is \"something you chew then swallow\". That shit is drugs disguised as food. permalink parent award report block reply\nreversethefraud 4 points 6 days ago yeah but they did get a thing of Dr Pepper, and a thing of cereal which aint that bad, and when you throw in the ice creams, well I think you'd agree it aint all that bad. permalink parent award report block reply sir_swaggage 4 points 6 days ago Underrated kek permalink parent award report block reply\nsir_swaggage 4 points 6 days ago Underrated kek permalink parent award report block reply\nCleanUpPhillyTrump24 4 points 6 days ago Big Ag needs to be banned from lobbying Congress. permalink parent award report block reply\nFearGodTheAlmighty 3 points 6 days ago zero meat except bagged tuna packets permalink parent award report block reply\nSquatchNDenver 4 points 6 days ago I noticed she didn't mention the ranch dressing bottle.\nno eggs ... no milk ...huh? permalink award report block reply FearGodTheAlmighty 4 points 6 days ago no meat (tuna packets don't count) permalink parent award report block reply\nFearGodTheAlmighty 4 points 6 days ago no meat (tuna packets don't count) permalink parent award report block reply\nHangmhigh 4 points 6 days ago I bet thats 8 pounds of sugar there. permalink award report block reply\nFerkenBlerkin 4 points 6 days ago NGL I took home economics 1 year because that's where the actual females were.  Puberty told me to make muffins to meet girls. permalink award report block reply\nPnw4gotpwd 3 points 6 days ago Nicer house than mine. Also did she say she was on EBT? permalink award report block reply\nSouth_Florida_Guy 3 points 6 days ago Does not know how to shop at all permalink award report block reply\nTrunalimunumaprzur 3 points 6 days ago Tuna,Taters and avocado. permalink award report block reply\nRedPillosopher1776 3 points 6 days ago You see the garbage people eat and those same people will insist their weight isn't a result of their diet and laziness. permalink award report block reply\nlearntocode 3 points 6 days ago W.T.F. If it was $20 you would not be makin it, you fat dumb bitch. OMG, veggies and rice and beans you stupid fucking dipshit moron motherfucker. permalink award report block reply\nFrozenEagle 3 points 6 days ago Getting rid of Home Ec. was not a mistake. It was meticulously planned. A sensible state teaches its young how to survive on their own. A nanny state teaches its young to be dependant upon the state. Forever. permalink award report block reply\nMastaJoda 3 points 6 days ago Yeah but she gets diabetes at no extra charge! permalink award report block reply\nCarmen1956 3 points 5 days ago She is so stupid that it makes my head hurt! permalink award report block reply\nWanderingStar 2 points 5 days ago What happened to not eating processed foods?  Lady, you're killing your family.  And dinners?  I'm sure you're going to Jack-in-the-box. permalink award report block reply\nTartakovsky 2 points 5 days ago No milk, eggs, bread, orange juice, vegetables, salad dressing, rice, pasta, protein, etc. She could have bought those items for under $100 and fed her family for two weeks. Just a bunch of garbage. No wonder she’s fat trash. permalink award report block reply\nFearGodTheAlmighty 2 points 6 days ago Women go out of their way to buy ALL the most ridiculous shit permalink award report block reply"}