{"id": "1ARK53LkbQ", "contents": "317 $1.29 posted 5 days ago by Monsieur_Novembre 14 comments award share download report block\n14 comments Sort by Top Top New Worst Old Save Redeemable 7 points 5 days ago I remember viditing California eons ago and seeing gas at 1.79 and thinking how that was highway robbery when it was 1.29 back home. permalink award report block reply Preludachris 6 points 5 days ago She drinks premium my friend. permalink award report block reply Nibba2 3 points 5 days ago Dude, you’re so cool man. permalink parent award report block reply DCPower 4 points 5 days ago Where/when was this?! permalink award report block reply DJT4547 6 points 5 days ago Florida. Probably in the mid 90's. permalink parent award report block reply apathy_meh 1 points 5 days ago I remember 1998 had sub $1 gas & thinking who would pay $1.23 for premium. permalink parent award report block reply Trooph-Hurts 4 points 5 days ago I dig the License plate “LUV- 1”…. Looks like Jupiter permalink award report block reply pedespeed 2 points 5 days ago I was looking at that too... Luv Or Lus (loose, lose)? permalink parent award report block reply Trooph-Hurts 2 points 5 days ago There is an old section of town in Jupiter , that kind of reminds me of that!…. Cool picture :) I would have said hello even before he was the prez permalink parent award report block reply BillPigg 3 points 5 days ago $0.24 / gal ................  1972. The reality is, it's not 1972 anymore. permalink award report block reply MAGALADON9 3 points 5 days ago It's returning 2.39 in places now permalink award report block reply A10_BRAAP 1 points 5 days ago I see $1.49.  That's a supercar, anything less than 91% it's gonna run like poo. permalink award report block reply DingleberryMutt 1 points 5 days ago Back in the mid-90s gas was 99-cents/gallon. None of us had any money to really do much, but I had an old VW convertible and my friends and I would just drive, drive, drive around the downtown area singing along to the radio, smoking cigarettes and enjoying the summer nights. Good times. permalink award report block reply\nRedeemable 7 points 5 days ago I remember viditing California eons ago and seeing gas at 1.79 and thinking how that was highway robbery when it was 1.29 back home. permalink award report block reply\nPreludachris 6 points 5 days ago She drinks premium my friend. permalink award report block reply Nibba2 3 points 5 days ago Dude, you’re so cool man. permalink parent award report block reply\nNibba2 3 points 5 days ago Dude, you’re so cool man. permalink parent award report block reply\nDCPower 4 points 5 days ago Where/when was this?! permalink award report block reply DJT4547 6 points 5 days ago Florida. Probably in the mid 90's. permalink parent award report block reply apathy_meh 1 points 5 days ago I remember 1998 had sub $1 gas & thinking who would pay $1.23 for premium. permalink parent award report block reply\nDJT4547 6 points 5 days ago Florida. Probably in the mid 90's. permalink parent award report block reply apathy_meh 1 points 5 days ago I remember 1998 had sub $1 gas & thinking who would pay $1.23 for premium. permalink parent award report block reply\napathy_meh 1 points 5 days ago I remember 1998 had sub $1 gas & thinking who would pay $1.23 for premium. permalink parent award report block reply\nTrooph-Hurts 4 points 5 days ago I dig the License plate “LUV- 1”…. Looks like Jupiter permalink award report block reply pedespeed 2 points 5 days ago I was looking at that too... Luv Or Lus (loose, lose)? permalink parent award report block reply Trooph-Hurts 2 points 5 days ago There is an old section of town in Jupiter , that kind of reminds me of that!…. Cool picture :) I would have said hello even before he was the prez permalink parent award report block reply\npedespeed 2 points 5 days ago I was looking at that too... Luv Or Lus (loose, lose)? permalink parent award report block reply Trooph-Hurts 2 points 5 days ago There is an old section of town in Jupiter , that kind of reminds me of that!…. Cool picture :) I would have said hello even before he was the prez permalink parent award report block reply\nTrooph-Hurts 2 points 5 days ago There is an old section of town in Jupiter , that kind of reminds me of that!…. Cool picture :) I would have said hello even before he was the prez permalink parent award report block reply\nBillPigg 3 points 5 days ago $0.24 / gal ................  1972. The reality is, it's not 1972 anymore. permalink award report block reply\nMAGALADON9 3 points 5 days ago It's returning 2.39 in places now permalink award report block reply\nA10_BRAAP 1 points 5 days ago I see $1.49.  That's a supercar, anything less than 91% it's gonna run like poo. permalink award report block reply\nDingleberryMutt 1 points 5 days ago Back in the mid-90s gas was 99-cents/gallon. None of us had any money to really do much, but I had an old VW convertible and my friends and I would just drive, drive, drive around the downtown area singing along to the radio, smoking cigarettes and enjoying the summer nights. Good times. permalink award report block reply"}