{"id": "1ARK55aKv2", "contents": "1731 President Trump just told ALL GOP senators what can be accomplished if the filibuster is nuked — voter ID, no mass mail-in voting and fraud, ending no cash bail, and ZERO welfare for illegals. posted 5 days ago by CatalystForChange 224 comments award share report block Eric Daugherty @EricLDaugh • 5d 🚨 BREAKING: President Trump just told ALL GOP senators what can be accomplished if the filibuster is nuked — voter ID, no mass mail-in voting and fraud, ending no cash bail, and ZERO welfare for illegals.  https://t.co/EXfTu3SWsn \"It doesn't make ANY sense that a Republican\n224 comments Sort by Top Top New Worst Old Save NadlersNads 235 points 5 days ago Jokes on you Mr President... they're into all that shit permalink award report block reply Mulletgunning 87 points 5 days ago Came to say the same. The uniparty strikes again. MAGA AF permalink parent award report block reply MickHigan2 60 points 5 days ago Republicans are just slow moving communists from the 30k foot perspective. permalink parent award report block reply Mulletgunning 35 points 5 days ago Correct! They are all on the same team. People need to realize this fake WWE scripted bullshit political theater is there to distract and give one the impression that they have a side in the game. The only side we need to focus on is MAGA AF versus commies and traitors to all Americans. All of those faggots were in on the open border invasion and now are behind the replacing Americans with Visa abusing Jeets and other foreigners. They are enemies and we should treat every last one of those 535 pricks that way. MAGA AF agendas are not being codified into law and these maggots are looking for new ways to fuck us daily. permalink parent award report block reply Dangerous 14 points 5 days ago And people also need to realize that AIPAC backs this Uniparty faction of the GOP against any attempt at reform, and that jews formed and lead the vast majority of communist uprisings over the last 100 years. permalink parent award report block reply view 1 more comments... Govtizbad 12 points 5 days ago Every member of the GOP is a lefty Harvard grad living in a big city penthouse apartment What do they have in common with u? permalink parent award report block reply view 1 more comments... keeman 6 points 5 days ago They are on the same team AND AT THE SAME TIME opponents.  They both exist to shift taxpayer money to themselves and their friends and so are allied in wanting the government to only ever get larger.  But at the same time, for any individual seat each party would prefer one of their own to hold that seat all other things being equal.  The RINOs have an additional constraint that it is preferable for the entire R party to have a minority position so that they can more easily explain to their small government desiring voters why the government size increased during their term. permalink parent award report block reply HoganT 4 points 5 days ago Therein lies the problem. Were not even a majority in the republican party. There aren't enough of us. permalink parent award report block reply SuperHonkey 4 points 5 days ago Failure theater permalink parent award report block reply load 1 more comments... Please_Clap 11 points 5 days ago And their lack of response and action will be the proof. permalink parent award report block reply SpikeNST 6 points 5 days ago That and the fact that I have been hearing about the Filibuster for weeks if not months yet Democrats are not even doing it... permalink parent award report block reply TheMostUselessFeeder 7 points 5 days ago They'll just kvetch about \"buT THE opTicS OF ReMoviNG A ChEcK And BALance wONt BE Good\" and continue doing nothing permalink parent award report block reply IncredibleMrE1 7 points 5 days ago They say after sitting by and doing nothing (and cheering in private) while the Biden Regime openly took a steaming dump on all of the checks and balances. Hell, some of the geriatrics voted for the PATRIOT Act, they're that old. permalink parent award report block reply view 1 more comments... popcycle 0 points 4 days ago no, the actual result won't be good.  don't be shortsighted. permalink parent award report block reply keeman 5 points 5 days ago RINOs are just pillaging the country like most of the Dems are.  Lie to voters and then once installed start stealing everything not nailed down and transferring the loot to your campaign funders, friends and family.  The communism is helpful to both sides as increasing the size of the gov provides an increased pile of loot to grab from. permalink parent award report block reply BoatingAccident 13 points 5 days ago it doesn’t matter we have to go for it now and hopefully a miracle happens because if not, we’re gonna be fucked in a few years anyways Trump is smart. He knows this. permalink parent award report block reply DeportThemAllForever 12 points 5 days ago Problem is republicans want to act helpless and pretend that they can’t do as to not upset donor class that loves those things. permalink parent award report block reply MastaJoda 5 points 5 days ago lol Trump endorses every backstabbing AIPAC RINO in Congress. You know that, right? permalink parent award report block reply Awakened 8 points 5 days ago I hate and love when someone beats me to it. permalink parent award report block reply Papabravo12 5 points 5 days ago Yep came here for this permalink parent award report block reply MemeWarsVet 4 points 5 days ago Well done. permalink parent award report block reply load 9 more comments... Sea_Still 108 points 5 days ago Too bad \"our side\" has never been on our side permalink award report block reply EgregiousPhilbin 21 points 5 days ago Yeah. So why does everyone in here insist that I vote for them anyway? How bout no? permalink parent award report block reply Dizzy77 20 points 5 days ago Vote in the primary. permalink parent award report block reply keeman 11 points 5 days ago I do.  But I would note that I live in a red state and can safely say that George Washington would be leading an armed revolution against the positions of the most \"conservative\" candidates in nearly every race.  The person you want in your government is the person who doesn't really want to be there.  For any competent and high ability person, the only way to get any value out of choosing to be a politician is through corruption.  Those people would make more money in other ways.  So you get mostly corrupt clever people and honest low talent people.  And the honest low talent people tend not to survive very long, leading to the corrupt taking over.  We would do a lot better by picking people randomly from the voter rolls to be the representatives. permalink parent award report block reply MastaJoda 2 points 5 days ago ☝Im here. Pissed off random tax slaves who hate the establishment in DC is the only answer to getting representation from Congress again. As it sits, we have NONE. permalink parent award report block reply TrumpsBigBalls 2 points 5 days ago well said... Trump is the example of someone doing worse off for having gone into politics though did so out of seeing the need. If only our congress were all like him but yeah I don't see that ever happening because of well..what you just said. permalink parent award report block reply God-is-good 1 points 4 days ago Your comment reminded me of a metaphor used in the Bible, a tale of sorts. Something true that’s been happening for near ever. How those doing well aren’t the ones who end up in power.\nFor one with President Trump e are ruled by the Olive Tree. Will the brambles choke out our blessings again? Judges 9:8-15 (KJV) 8 The trees went forth [on a time] to anoint a king over them; and they said unto the olive tree, Reign thou over us. 9 But the olive tree said unto them, Should I leave my fatness, wherewith by me they honour God and man, and go to be promoted over the trees? 10 And the trees said to the fig tree, Come thou, [and] reign over us. 11 But the fig tree said unto them, Should I forsake my sweetness, and my good fruit, and go to be promoted over the trees? 12 Then said the trees unto the vine, Come thou, [and] reign over us. 13 And the vine said unto them, Should I leave my wine, which cheereth God and man, and go to be promoted over the trees? 14 Then said all the trees unto the bramble, Come thou, [and] reign over us. 15 And the bramble said unto the trees, If in truth ye anoint me king over you, [then] come [and] put your trust in my shadow: and if not, let fire come out of the bramble, and devour the cedars of Lebanon. permalink parent award report block reply EgregiousPhilbin 7 points 5 days ago Right. And then do what if it doesn't work out? Exactly. permalink parent award report block reply Dizzy77 4 points 5 days ago There is historical precedent for what happens. It isn't pretty, and I hope we can avoid that. permalink parent award report block reply view 1 more comments... jaeger 3 points 5 days ago I'd rather be stabbed in the face then the back repeatedly. permalink parent award report block reply LineInTheSand -4 points 5 days ago Vote for the lesser of two evils. permalink parent award report block reply MastaJoda 2 points 5 days ago ☝We must be agents of chaos. We have to play dirty, get mean, and challenge them all in primaries so we can drag these globalist POS RINOs through the mud in front of idiotic normie voters who vote for whoever Trump endorses. We need them to watch these RINOs squirm like Cruz being grilled by Tucker. permalink parent award report block reply parttimefed 6 points 5 days ago Vote harder for the people that won't do anything cause at least they are not Democrats! permalink parent award report block reply Shitsbrokeyo 1 points 5 days ago Create our own party and if they dont kiss the ring, abandon them all over the next 3 elections. (2y/6y office) permalink parent award report block reply parttimefed 2 points 5 days ago President Trump should have totally done that when they stole 2020 from him, and forced him as a new party or Harris and the end of the nation permalink parent award report block reply MastaJoda 0 points 5 days ago lol please be sarcasm, ffs. I cant handle anymore retard takes today. This philosophy is why we are here with zero representation in Congress. permalink parent award report block reply parttimefed 2 points 5 days ago No one in Congress represents you are I. permalink parent award report block reply TPMJB 3 points 5 days ago You're being antisemitic! permalink parent award report block reply True_Curmudgeon 1 points 5 days ago Yeah I'm done fucking voting unless there's a really good reason permalink parent award report block reply booblitchutz 13 points 5 days ago \"our side\" is really just kabuki to keep us passive, I'm starting to realize. permalink parent award report block reply deleted 5 points 5 days ago TrumpAndGodWin -2 points 5 days ago A Democrat calling for someone else to do violence then playing the victim. Imagine my shock. permalink parent award report block reply Shitsbrokeyo 6 points 5 days ago Mr. PRESIDENT, move 100 analysts into the IRS and chase the money of Congress. Find all your criminals, and prosecute for criminal and ethics violations. permalink parent award report block reply _fidelio 51 points 5 days ago The filibuster is a made up rule that corporate-controlled politicians on both sides of the aisle rely on as an excuse for not getting anything done when they’re in power. It’s inherently anti-democratic and needs to go. permalink award report block reply sovereign 16 points 5 days ago Right now with how the democrats are acting in bad faith over this, I'm now becoming convinced that nuking the filibuster may indeed be the correct move. permalink parent award report block reply MAGA_MyPillow 20 points 5 days ago I believe that will be the Play. The dems feel emboldened after Tuesdays results and are going to increase their demands. The GOP cannot give in or its the end of Trump and the GOP. The only play left is to end the filibuster and get the checks in everyones hand before thanksgiving. If the media says its the GOP's fault for the shutdown. well lets end the filibuster and let the GOP open everything back up. permalink parent award report block reply lixa 1 points 5 days ago And they must pass election integrity. Please don't nuke it just for a CR. Nuke it so the left has a very hard time getting back in power. permalink parent award report block reply NeverInterruptEnemy 8 points 5 days ago IDK… I’ve seen a lot of leftists suggest it. Looks like bait to me. permalink parent award report block reply sovereign 3 points 5 days ago That’s why I can’t speak in the affirmative. permalink parent award report block reply ThisTrainHasNoBrakes 3 points 5 days ago But how would that help Israel? permalink parent award report block reply MastaJoda 1 points 5 days ago Nuke it, pass election integrity bills, move the few essentials workers/soldiers pay from the nonessential CR bs to where Congressional salaries are, nuke the CR after that, and then bring back the filibuster. Anyone want to send me to DC? I'll even call the entire chamber FAGGOTS the first chance I get! permalink parent award report block reply HyperCarbs 1 points 5 days ago They'd pass a paycut and extended working days before that. permalink parent award report block reply anotherthing 1 points 4 days ago The filibuster has been around since the early 1800s. It's not something new. permalink parent award report block reply HKFan 29 points 5 days ago Did he forget that national GOP are spineless faggots and will get cold feet as soon as consequential legislation is put before them? permalink award report block reply BoatingAccident 12 points 5 days ago no but he’s just rolling the dice because he figures what’s the alternative? The demons are gonna do this anyways eventually and they’ll have the presidency when they do. permalink parent award report block reply HKFan 12 points 5 days ago I'm all for nuking the filibuster if . . . it's followed up by a slew of legislation which renders the democrat party null and void as a national party.  And you know the GOP doesn't have the stomach for that unfortunately, although it needs to be done. Until then tbh we need the protections it offers, when they took power in 2020 they IMMEDIATELY started floating forever power moves like DC statehood and getting rid of the electoral college. Keep the government shutdown if it comes to it.  Fuck it permalink parent award report block reply Im_RickSteves_bitch 21 points 5 days ago Thune is playing for the other team, and it should have been obvious to anyone paying attention well before now. permalink award report block reply AmannamedRJ 9 points 5 days ago Dude it was obvious in December during the leadership election. The GOP doesn't like that Trump and MAGA took it over. They're throwing the fight as hard as they can. They are that corrupt. Pay serious attention now. Whoever fucks this up needs to get primaried out of office. It has to be our grassroots money doing it too. Patriots.win needs to chronicle and score every right-wing representative. Make it really easy to find your state and representatives - including who's running against them or not. Remember r/thecongress? We need that to return but make it super user friendly. Can any programmers make this happen? permalink parent award report block reply PensivePatriot 1 points 5 days ago It’s 2025, you don’t need a programmer. Tell the computer, and it will program itself. If you want this, do it and show us just how badly you wanted it (and how retarded we are for not doing it ourselves first.) permalink parent award report block reply PurgeTheWoke 2 points 5 days ago Do you want Tea app? Because that’s how you get Tea app. permalink parent award report block reply PensivePatriot 1 points 5 days ago What in the utter fuck does this even mean? permalink parent award report block reply view 6 more comments... Fren20 1 points 5 days ago 💯❤️ permalink parent award report block reply YodaBannon 3 points 5 days ago Listen, and understand! That Thune-inator is out there! It can't be bargained with. It can't be reasoned with. It doesn't feel pity, or remorse, or fear! And it absolutely will not stop... ever, until you are dead!\" permalink parent award report block reply Trump-16-20-24-28-32 20 points 5 days ago If we get rid of the filibuster (and we have years and years of quotes of democrats supporting that), and those things actually get instituted (voter id, no mail-in voting, etc.) and voter integrity laws are passed, then the democrats will lose. This could kick off more states to buy in to the Article V convention of the states because I could see the states wanting the filibuster to be an amendment. If we could have a temporary stop on the filibuster, then we win.  Plain and simple.  If we don't, we know the Democrats will do it and we will lose. This is the play... this is it. permalink award report block reply PM_ME_UR_MAGIC_CARDS 1 points 5 days ago well shit when you put it like that permalink parent award report block reply Freeth3usa 1 points 5 days ago How exactly will congress get voter id or stop mail in voting? You need a constitutional amendment for that. permalink parent award report block reply Trump-16-20-24-28-32 1 points 4 days ago I specifically mention kicking off article V convention of the states which is used to amend the constitution. There is some ability for the federal government to provide guidelines for federal elections.  For example, a state can't say \"the first person to get 500 votes wins\" even though it's up to the legislators to control the election. permalink parent award report block reply infeststation 1 points 5 days ago Why? permalink parent award report block reply Fren20 1 points 5 days ago Please explain the amendment permalink parent award report block reply Trump-16-20-24-28-32 1 points 4 days ago I didn't bring up any amendment.  I brought up article V, convention of states.  Article V is the part of the Constitution that explains now to amend the constitution.  If 2/3 (34) of the states call for a convention, then there will be a gathering of the states to propose new amendments, all without going through congress. It requires 75% (38) of the states approval to ratify the state proposed amendment. It's never been done, but there are currently 19 states that have approved it, many that have legislation passed in one chamber, and many that have active legislation.  It looks like the only states that want to avoid it are the very blue states. https://conventionofstates.com/states-that-have-passed-the-convention-of-states-article-v-application permalink parent award report block reply CanadianMeathead 19 points 5 days ago Watch those who vote against this. permalink award report block reply Simple_Doot 7 points 5 days ago I really dont think its crazy to have some apprehension about abolishing the filibuster.  But I also believe there is some unbelievable event just over the horizon that will lead to a complete reordering of society globally.  Trump will be the last president so if there is some inevitable insane event coming then it makes sense that we would nuke the filibuster and not give a shit about spending because it simply will not matter in a few years. permalink parent award report block reply goldkeyboardwarrior 4 points 5 days ago I can't say I'm a fan of nuking the filibuster, but we almost saw it happen while Biden was president. Sinema and Manchin were the only two who kept it from happening, and Sinema was harassed on more than one occasion over it. I'm interested in seeing what the GOP does if Dems continue to refuse to open the government, since they probably believe the country blames Trump for it after seeing how the elections went on Tuesday. At the same time, I know there are several in the GOP that will be a hard no on nuking the filibuster, and if I remember correctly, Cruz said they don't have the votes to do it. permalink parent award report block reply zooty 1 points 5 days ago Would it help if I told you that dems implemented the filibuster rule in its current form and that the current implementation is younger than me? permalink parent award report block reply Fren20 1 points 5 days ago Hell yeah spread the word,I truly think trump will be our last president at all need to make plans. permalink parent award report block reply _fidelio 1 points 5 days ago Interesting.. Why do you think Trump will be the last president? permalink parent award report block reply Simple_Doot 1 points 4 days ago Not much in way if hard evidence.  But there are so many things coming to a head, so many lies about our past, Revelations' seeming fulfillment, the unsustainable trajectory of geopolitics and our own government hustle not caring about anything almost as if someone knows we are about to drive off a cliff so just let go of the wheel.  If we are holding Trump to MAGA standards of 2016-2024 he has absolutely failed, gone completely off course.  He is pursuing some other agenda that is completely hidden from us.  I think its because he is an agent of something that has been here for thousands of years and not the American people.  Its a bat shit crazy idea but Im certain of it. permalink parent award report block reply trumpORbust 2 points 5 days ago All of them permalink parent award report block reply Deplorable_in_PA 14 points 5 days ago I really, truly dislike the idea of nuking the filibuster.  It basically means whoever has a slim majority in congress can pass whatever they want and all the other side can do is sit down, STFU, and tweet about it.  It's basically majority rule and that flies in the face of us being a republic vs a democracy. That said, you know the second the dems get a majority that will be the first thing they do.  If we don't nuke the filibuster we lose perhaps our only window to pass the MAGA agenda. permalink award report block reply TrumpAndGodWin 5 points 5 days ago Don't forget the dems wanting to pack the supreme court. permalink parent award report block reply Freeth3usa 1 points 5 days ago Meh they’ll never pack the court. It just means the next administration would likely pack it too. Then continue until we have 1000’s of judges. permalink parent award report block reply zooty 1 points 5 days ago All next administrations will be Dem if they can pack the SC. Which they're likely to get to do anyway at some point. The only reason Dems don't take a step that increases their power is because they think there's already an easier or less controversial way to do it. That has been election fraud but it's failed them twice so get ready for worse. Currently, it seems to be 'rogue' judges. permalink parent award report block reply LUXURY_USERNAME 2 points 5 days ago Yeah but how will they get the majority again if we have voter ID and same day voting, one day elections, no mail-in, citizens only, etc permalink parent award report block reply Fren20 1 points 5 days ago Well what do you suggest permalink parent award report block reply infeststation 1 points 5 days ago After some turbulence, the people will force politicians to come back to the center. permalink parent award report block reply Albo22 8 points 5 days ago Democrats will nuke  it as soon as they come to power permalink award report block reply Tmntnyc 4 points 5 days ago They didn't nuke it last time they were in power, why would they? permalink parent award report block reply BasedLaugh 4 points 5 days ago Yeah they did. Joe Manchin and Krysten Sinema were the two Senators that voted no and stalled their attempt to nuke the filibuster to pass the Voting Rights Act in 2022. They will definitely try to do it again. permalink parent award report block reply HoganT -1 points 5 days ago Attempting to bypass it for one single vote is not nuking the filibuster. In fact, we're the last ones to actually permanently kill the filibuster for something. Supreme Court confirmations. After having spent the entire year leading up to it using the filibuster to block obama from getting a final judge in, no less. permalink parent award report block reply Doritalos 3 points 5 days ago You again. \"They were only going to nuke it for one vote\". Give it a rest permalink parent award report block reply view 1 more comments... TheMostUselessFeeder 2 points 5 days ago Yeah it's kind of weird to me how all of a sudden this concept has become a thing.. It was never really in the public discourse like this before 🤔 permalink parent award report block reply AmannamedRJ 3 points 5 days ago Democrats  ripped every semblance of the mask off when they arrested Trump on trumped up charges, shot trump and cried when they didn't kill him, and assassinated Charlie Kirk. Put simply, there's no more need to pretend to be fair or moderate. permalink parent award report block reply HoganT 0 points 5 days ago It's because... shhh... We. Want. To. Nuke. The. Filibuster. And need fear and coercion to get it done. We're the last ones to actually kill it for something, Supreme Court confirmations. permalink parent award report block reply zooty 1 points 5 days ago Yeah but the dems had done it not too long before for presidential nominations. Turtle Mitch famously warned them they'd come to regret it. The filibuster for most nominations was last removed by Senate Democrats in 2013, when then-Majority Leader Harry Reid led the effort to eliminate the filibuster for executive and judicial nominees (except Supreme Court nominees) through the \"nuclear option\".\nThis change allowed a simple majority to confirm these nominees instead of requiring 60 votes. *Note: I also asked it about supreme court nominations and it did mention the Rs in 2017 (as you have said) so I'll stipulate that it has made an error in its assessment there but that the event still occurred when it did. At this point, it's only there until anyone has the will to remove it and it would be foolish to concede that to people who want us all dead. permalink parent award report block reply Mooksayshigh 1 points 5 days ago They tried to kill him, they are killing us. You shouldn't need fear and coercion anymore. Clean house, get this shit started. There's no other way permalink parent award report block reply JuniorMints 7 points 5 days ago He's showing them how to win and they have no backbone. permalink award report block reply agremlinintheworks 7 points 5 days ago I'm not worried about the democrats using this against us in the future. The couple dems who would vote against removing it are gone. They'll remove it immediately when they get control of the senate regardless of what republicans do today. However I do worry about the rino's in our midst. I don't believe that's enough that we shouldn't do this. But I do worry that similar to the senate vote to cancel trump's tariffs that passed with universal democrat support and a few rinos+libertarians, we may see some ugly things make it through the senate that have to be vetoed. permalink award report block reply Alldayeveryday 5 points 5 days ago The government is the biggest criminal organization in the world permalink award report block reply TrumpLandslide20201 4 points 5 days ago Mr. President you are speaking to Deep State Traitors. There is NO way in HELL they want any of this. No Way! permalink award report block reply KernalMustard 2 points 5 days ago Back to usual in 3 years. Always the plan. GOP will win in GOP areas but MAGA will die. Dont say vance. I know a faker when I see one. His history shows hes a chameleon. permalink parent award report block reply JimmyRussler 4 points 5 days ago All of those things are exactly why they won't do it. permalink award report block reply booblitchutz 4 points 5 days ago And the part Trump is missing is the establishment GOP has NO appetite for fixing ANY of those things. All \"nuking the filibuster\" will do is unmask more RINOs in the Senate who will never let anything get to 50 votes. permalink award report block reply KernalMustard 2 points 5 days ago Fix things and they cant grift.  See them winning means less donation dollars filling the coffers. On the losing side means you will give them more money to win. They make the promises and by the time election comes around they hope you forgot. You donate again. Its battered wife syndrome. You keep going back hoping they change. They couldn't care less about you. permalink parent award report block reply booblitchutz 1 points 5 days ago Yeah, they're all on the same side - their own. The dems are playing one side of the fence and the republicans are playing the other but in reality, they're just helping themselves. permalink parent award report block reply Build_Back_Bankrupt 1 points 5 days ago It will unmask more RINOs, but they won't be able to hide behind it and blame the other side, they'll be forced to vote against any bills or EO's that Trump and the people they're supposed to be representing want codified.  Great way to get themselves primaried, and of course they'll try to explain it away because of their \"principles\". permalink parent award report block reply booblitchutz 1 points 5 days ago That’s why they won’t nuke the filibuster. It gives them cover. permalink parent award report block reply Build_Back_Bankrupt 1 points 5 days ago They're not supposed to have cover, they're supposed to lobby for their constituents, ie., represent them. This is tea in the harbor level shit to me. permalink parent award report block reply TheSwampThang 4 points 5 days ago The problem is that we're not trying to do those things even when we can without the filibuster.   Also those priorities are all wrong, arresting deep the deep state is still top priority. permalink award report block reply birddogz 3 points 5 days ago The congresscritters will never help Trump do any of that.  They feast on the griff as much as the commies. permalink award report block reply MAGAnic316 3 points 5 days ago Prepare for more bullshit excuses than Hasan Piker permalink award report block reply MajJamesMcFarlane 3 points 5 days ago Absolutely wild that Trump is blaming all his failings in both the first and this term on a Senate rule that's existed for over 200 years. Gosh, how did any one ever achieve anything in the last 200 years, Mr. President? permalink award report block reply zooty 0 points 5 days ago What did anyone achieve in the last 200 years? A bloated, intrusive government? An ever-expensive military industrial complex? A debased currency and theft of wealth from the citizens? permalink parent award report block reply American-Patriot 3 points 5 days ago Lord God please let it be so. Change the minds and hearts of the Republicans who are holding back. permalink award report block reply DegenNerd 3 points 5 days ago Voter ID is the most important. permalink award report block reply CatalystForChange OP 1 points 5 days ago 👆 Most underrated comment! permalink parent award report block reply Appeal2Heaven98 3 points 5 days ago All the more reason for the GOP not to do it. At least the Democrats are honest when they say they want us dead. The Republicans act like our friend who will stab us in the back in the end when we need them most. permalink award report block reply Twitter 3 points 5 days ago Rinos are worse then Demoncrats which aren't afraid to show they are degenerates permalink award report block reply Tacitus1963 3 points 5 days ago Does he not get it yet that the GOP is almost completely RINO and working against him?\nEven if they got rid of the filibuster, the RINOs would do NOTHING.\nThey, like their Demtard pals, are actively engaged in also destroying our country. permalink award report block reply Flounder66 3 points 5 days ago The GOP will squander Trump's presidency and then the opportunity will be gone along with the Don. A plague on both their houses. permalink award report block reply Fromseatoshinningsea 2 points 5 days ago He doesn't have enough proof of their corruption and esp. pedophilia to coerce them. This is prob one of the last opportunities Pres Donald has to save what's left of the republic.  I'd speculate that the money being offered to these senators and to the SC justices by WEF, ME Oil billionaires, EU, CCP, etc. is staggering. Prob comes with deniability. Pres Donald is appealing to their honor and righteous principles, but they have none. permalink award report block reply Spleenrippa 2 points 5 days ago Wake the fuck up Mr. President, most Republicans hate you. They are not on your side and do not want to pass your (our) agenda. permalink award report block reply Polander 2 points 5 days ago If they ended the filibuster senators like Murkowski and Collins and Graham would still vote against this stuff. Ending the filibuster is an awful idea. permalink award report block reply Im_RickSteves_bitch 2 points 5 days ago Make the no EBT thing permanent. But I have no real hope of this actually happening. permalink award report block reply Bullet3250 2 points 5 days ago a side story... State of Michigan had a Republican FULL Trifecta in the State Capitol in 2014.  With that power they did actually very little except for making Michigan a Right to Work State - which was a big deal. Then - the Democrats somehow won their own FULL Trifecta to control the State in 2022 - they INSTANTLY PASSED ALL KINDS OF TOTAL SHIT - removed Right to  Work instantly - increased taxes - increased spending - removed Parental Rights - Made Abortion a basic religion - forced a ton of 'clean energy' requirements on utilities that 'drive up energy costs' - and virtually destroyed voting security. And people have been moving out of state ever since. Be careful what you wish for.  I would recommend just WINNING 60 REPUBLICAN SENATE SEATS.... so the Filibuster would not be important. permalink award report block reply fazaman 2 points 5 days ago But they don't want to do those things. They just want excuses as to why they can't so they can fund raise on the idea of actually doing them. permalink award report block reply 480le 2 points 5 days ago They are all traitors permalink award report block reply Chickensaurus 2 points 5 days ago Senators: \"Best we can do is stall until we lose 2026, then side with Dems to convict you and JD on your impeachments.\" permalink award report block reply KernalMustard 2 points 5 days ago He might as well cut his losses and resign. permalink parent award report block reply Chickensaurus 3 points 5 days ago Cross the Rubicon.... permalink parent award report block reply Beardholder 2 points 5 days ago All we want Mr president is hanging of traitors, the forceful removal of all Muslims and Hindus and to ban and outlaw socialism and communism, and ban rap music from public spaces , and then finally all voting must be done on paper ballots with i.d Do that and we will have a hundred years of prosperity permalink award report block reply Scot 2 points 4 days ago All things the traitorous GOP doesn't want. permalink award report block reply swift_water 2 points 5 days ago Honestly, voter fraud doesn't even matter if everyone whos getting into office is full of fucking shit. We're fucked, aren't we? permalink award report block reply JerryNadlerBeltFund 2 points 5 days ago And they yawned and waited for their midterm shellacking! Bunch of wothless, self-dealing traitors. permalink award report block reply Deplorable_Yankee 2 points 5 days ago My friend at work tells me all the time to just put my trust and faith in Jesus, get my spiritual house in order, purify my soul and not worry about all of this. Everything that happens is gonna happen. A lot of you probably feel like me and think to yourself “how the heck did everything go sideways?” or you feel like you live in the twilight zone. I’m starting to think my friend is correct. permalink award report block reply zooty 1 points 5 days ago Is your friend a father? Cause sure as hell I don't want my kids to be deadbeats and dependent on me for the rest of their lives. I can't imagine God would feel that way either. permalink parent award report block reply ACActual 2 points 5 days ago Trump should identify all Rinos fighting this then salt the ground around them permalink award report block reply Idontevenknow 2 points 5 days ago Uniparty nervousness intensifies. He knows they don't stand for the things they say they do, right? permalink award report block reply dogeshit 2 points 5 days ago Dems have been trying to do this for years. permalink award report block reply BBvarn 2 points 4 days ago Everyone in DC think they are smarter than DJT, but he is a billionaire president, and they are deep state simps. permalink award report block reply Roadpower 2 points 5 days ago I am not clairvoyant so I have no idea of how it is going to turn out but I feel like it is time to make a hard choice and to roll the dice. Getting bled out slowly is worse than a big collapse in my view. I'm tired of being a target of parasites, scammers, thieves and otherwise really awful people. All I ever wanted in my life time is for interests of the American people to actually be put first and our country secured against invasion by deeply hostile and contrary foreign cultures. I don't think that is a big ask. Can you do that president Trump? permalink award report block reply shadily0524 2 points 5 days ago The democrats have just given the republicans a lay up to nuke the filibuster, open the govt, fund SNAP, and pass single page 80/20 issue focused bills and fuck the democrats in the ass with. Come on you Massie faggots, NUKE IT permalink award report block reply Chango3 1 points 5 days ago This........ permalink parent award report block reply Light_HIV_Effect 2 points 5 days ago Not a fan of this, or the argument that democrats will do it anyway. They could have done it already multiple times under Obama and Biden. Let's say you did get rid of it. What are the chances you get Susan Collins, Murkowski, and another 2 rinos vote all that stuff down anyway? There's no chance any of these ideas passes unless it's rolled into reconciliation. Keep the government shut down and don't give an inch to democrats. Don't even promise to extend ACA subsidies. Tell them no. permalink award report block reply dataonly 2 points 5 days ago Better alternative-> https://patriots.win/p/1ARK55cGjJ/keep-the-senate-filibuster-in-pl/c permalink parent award report block reply Light_HIV_Effect 1 points 4 days ago If they had to actually keep speaking to avoid end of debate, I'd at least respect that. As it is, they just declare it and the media is all too happy to report republicans are to blame. permalink parent award report block reply AmericanJawa 2 points 5 days ago OK but can we get those mass firings first? permalink award report block reply jsphere256 2 points 5 days ago At the end of the day, either they support this agenda or they don't permalink award report block reply dtrap 2 points 5 days ago I just want proof of citizenship for state ID and presentation of (certified proof of citizenship) state ID at polls and paper ballots. Voter ID is way to close to eID for my tastes. permalink award report block reply Pats5x 2 points 5 days ago GOP is in on it bro permalink award report block reply terribletwos 2 points 5 days ago Teach them how to win. Gather them together and come up with a strategy, because they're stuck inside their own box. They're just going to look at things the way it's been done or they ways they think they can win. Make it a team sport. permalink award report block reply Elric44357 1 points 4 days ago No brain, no pain GOP RINOs. Abolish, accomplish your agenda, reinstate it. permalink award report block reply Iliterallylovejv 1 points 5 days ago Don’t forget - end H1Bs and Student Visas. Let’s make Americans strong again. permalink award report block reply RealTXPatriot 1 points 5 days ago And then when you pass all that.... Then pass law creating the filibuster at 60 vote threshold not just a senate rule. Make it a law then. permalink award report block reply Doubleu1992 1 points 5 days ago wet dream permalink award report block reply PatriotGames 1 points 5 days ago Which is why it will not end. permalink award report block reply Califunya 1 points 5 days ago RINOS “it’s too good for the American tax payer and doesn’t benefit deep state enough” permalink award report block reply Amway 1 points 5 days ago Most importantly, they can past laws that give the President the power to levy tariffs! permalink award report block reply SaxonRealm 1 points 4 days ago Abolish the filibuster. If Republicans won’t do that then abolish the Republican party. Time for a new American Party. Trump & Elon could fund. permalink award report block reply gezadreamsheets2 1 points 5 days ago GOP SUCKS! permalink award report block reply Bramage 1 points 5 days ago Except they're all rinos....nothing would change. permalink award report block reply DenturesNancy 1 points 5 days ago I don't think the republicunts have it in them to go all in.  if you must rob a place, make it worth the price, take everything.  Pack scrotus, voter ID, Citizenship requirements, Mass deportations, Revoke all H1B visas and refugee status, Immediate new census, revoke all sanctuary places.  Make it worth the price so the dems cannot hold any majority rule for at least 1000 years permalink award report block reply Michalusmichalus 1 points 5 days ago We need line item veto back. permalink award report block reply Badstate 1 points 5 days ago \"but if we do that the Democrats will do what they were going to do anyway!\" permalink award report block reply MinneMAGA 1 points 5 days ago Yeah but the cuckservatives don’t want those things permalink award report block reply Lib_Women_Have_HSV 1 points 5 days ago Then the democrats take over during midterms and pass unive re sal Healthcare, sanctuary country, social credit scores, pedophilia...and on and on permalink award report block reply Prandogolio 1 points 5 days ago They're gonna do that anyway faggot permalink parent award report block reply ShotgunParade69x 1 points 5 days ago We gotta do this and not worry what the dema may do in the future - we already know the answer to that!! If we do this tho, we have to go completely scorched earth. We will have the power to also impeach all the rogue liberal judges , right? permalink award report block reply Awakened 1 points 5 days ago He just gave them a bunch of reasons to not nuke it. They don't want these changes. We are boned if he is at thempoint of begging them to represent the people who pay their salary. permalink award report block reply America_No_1 1 points 5 days ago If Obama ordered the dems to do something it would be done within the hour permalink award report block reply orange_kek_great 1 points 5 days ago Lol. Ok buddy. permalink award report block reply RolandDelacroix 1 points 5 days ago If they nuke the filibuster it destroys their scam of always losing. permalink award report block reply MythArcana 1 points 5 days ago Even with the army of RINOs working for democrats? permalink award report block reply Nanteen 1 points 5 days ago Like the senators actually want that. No senator wants anything to pass. They just want to talk about it until the day they decide to not run free election. permalink award report block reply NewGoldenAge 1 points 5 days ago Why not remove it and then reinstate it after 30 days? permalink award report block reply covok48 1 points 5 days ago No way some of our elected cucks are going to vote in that agenda. THEN you gave the Democrats a means to nuke US when they steal 2028. permalink award report block reply 3-10 1 points 5 days ago What about stopping immigration, ending H1B and requiring all non-citizens to return home within 3 years. Also, make Blackstone stop buying houses to rent. permalink award report block reply KungPaoMcChicken 1 points 5 days ago Filibuster prevents change. It causes nothing to result. A pointless state for a government to be in. And no other country would allow such faggotry. permalink award report block reply keeman 1 points 5 days ago Ending the filibuster is one of Trump's stupidest ideas ever.  When Ds are in majority, the only thing stopping them from implementing complete communism in 2 years is the filibuster.  When Rs are in the minority they dither around and wait until the Ds are again in the majority.  Even talking about ending the filibuster is gonna result in more future communism, because the Ds will use this as an argument for ending it when THEY are back in charge. permalink award report block reply bluewhiteandred 1 points 5 days ago Another comment and question Can they nuke filibuster, do what they want, and pass some ban of filibuster? To prevent future retaliation and abuse? u/dataonly permalink award report block reply Araket 1 points 5 days ago Like they give a flying shit. I voted for Trump to, in the words of Obama, kick ass and take names. We were supposed to have a  DOJ that was elbows deep in investigating and prosecuting election fraud. We watched as the Dems stole seat after seat in 2024 with mail-in ballots and scam overseas ballots they \"counted\" for weeks and months after the election. The house isn't gonna do shit. If the people involved in the prior cases were arrested and prosecuted, we wouldn't need Congress in the first place, all the perps would be locked up, and any remaining would think twice about breaking the law. I voted for Trump to restore accountability, not beg and plead for help that will never come. permalink award report block reply Chango3 1 points 5 days ago Remember, these people campaigned for career goals. They are not loyal to the majority of Americans that voted for Trump to do all this. Its about that time to have our meetings, in private, like our corrupt government does at every level to burn you. permalink award report block reply Yheymos 1 points 5 days ago Do it! Fix the country! The Dems will hunt MAGA down if big changes aren't made. Stop those fuckers from rigging elections ever again. I was previously against the idea years ago, the whole 'when they are in power time time thing'... But when they are in power they are just going to do it anyway. So might as well do it first and get the advantage. permalink award report block reply bluewhiteandred 1 points 5 days ago whats the downside permalink award report block reply dataonly 2 points 5 days ago Huge downside.   There is a better way. I laid it all out here-> https://patriots.win/p/1ARK55cGjJ/keep-the-senate-filibuster-in-pl/c permalink parent award report block reply bluewhiteandred 1 points 5 days ago Thanks pede, but I guess we know the other side doesn't play by the rules so it seems like we shouldn't either? Legal way to get ahead on things? permalink parent award report block reply dataonly 3 points 5 days ago Legal way to get ahead on things? Don't think so.  It's a quick fix w/ catastrophic future consequences. I had posted this as a reply in another thread: Dems could have ended filibuster under Biden, but there were 2 of 51 that would not do so. Added:  So, it only 2 reasonable Senators, Manchin and Sinema, to keep the entire process from going off the rails.  That's a good thing. Filibuster is a valid and necessary Senate tool, that serves both parties and the American people well. It is a guard rail against extreme. W/o the filibuster Dems could have added PR and DC as a state and stacked SCOTUS. Filibuster is necssary. However, what they have now is virtual filibuster. All they have to do is declare it. Forcing them to follow the traditional filibuster rule (and hold the floor) is the answer. permalink parent award report block reply bluewhiteandred 1 points 5 days ago Yeah but isn't this like executive orders which are an abuse of the system as it was designed, yet Trump has been churning them out (following precendet of past presidents doing likewise?) permalink parent award report block reply FlyCatcher94 1 points 5 days ago That will guarantee they won’t do shit. permalink award report block reply ShotgunParade69x 1 points 5 days ago Call your senate leaders and raise hell . permalink award report block reply gaijin_ronin 1 points 5 days ago Secure our gun rights plainly for retards to understand. permalink award report block reply Awakened 1 points 5 days ago When the democrats get power again, and they will, one of the first thing they will do is nuke the filibuster whether Trump does it now or not. permalink award report block reply Tmntnyc 2 points 5 days ago Why didn't they nuke it in 2021 when they had control over both hours and senate and Biden was in charge? Why would they nuke it now but not before? permalink parent award report block reply Build_Back_Bankrupt 1 points 5 days ago They didn't need to because the Biden maladministration was above the law.  Look at all the dereliction of duty he and his cronies participated in. They were too busy and empowered to break the laws rather than pass them. Nuking it back then would just expend political capital and would put cracks in their BS facade and I don't think people would stand for them nuking it and then passing obviously unconstitutional laws in order to benefit their criminality and corruption. permalink parent award report block reply Awakened 1 points 5 days ago Because they also like complaining about the other side while doing nothing about the status quo. But the new generation is coming up and there is enough of them now to strike. permalink parent award report block reply parttimefed 1 points 5 days ago He just laid out all the reasons they are not going to do it. permalink award report block reply 2016TrumpMAGA 1 points 5 days ago We need primary challengers in 2026 and beyond for all senators who do not support ending the filibuster. permalink award report block reply zooty 1 points 5 days ago Sorry, didn't see \"pad our coffers\" in there. permalink award report block reply JoeBidensDementia1 1 points 5 days ago They don't want to win. permalink award report block reply PhantomShield72 1 points 5 days ago They are even more exposed as complicit now... What will they do? And what is Trump willing to do if they refuse to act in the interest of The Republic? Will we be left out to dry? Somehow, I don't think so. Of course, I could just be hoping against the evidence... permalink award report block reply NonbinaryPotatohead 1 points 5 days ago Where's get rid of the NFA, IRS and Fed Reserve in that? permalink award report block reply Wupta PRO 1 points 5 days ago They won’t do it. permalink award report block reply the_new_one 1 points 5 days ago Comment removed upon the user being banned. permalink award report block reply TheDarkEmperor 1 points 5 days ago Comment removed by community moderators. permalink award report block reply new_guy2 1 points 5 days ago Comment removed by community moderators. permalink award report block reply\nNadlersNads 235 points 5 days ago Jokes on you Mr President... they're into all that shit permalink award report block reply Mulletgunning 87 points 5 days ago Came to say the same. The uniparty strikes again. MAGA AF permalink parent award report block reply MickHigan2 60 points 5 days ago Republicans are just slow moving communists from the 30k foot perspective. permalink parent award report block reply Mulletgunning 35 points 5 days ago Correct! They are all on the same team. People need to realize this fake WWE scripted bullshit political theater is there to distract and give one the impression that they have a side in the game. The only side we need to focus on is MAGA AF versus commies and traitors to all Americans. All of those faggots were in on the open border invasion and now are behind the replacing Americans with Visa abusing Jeets and other foreigners. They are enemies and we should treat every last one of those 535 pricks that way. MAGA AF agendas are not being codified into law and these maggots are looking for new ways to fuck us daily. permalink parent award report block reply Dangerous 14 points 5 days ago And people also need to realize that AIPAC backs this Uniparty faction of the GOP against any attempt at reform, and that jews formed and lead the vast majority of communist uprisings over the last 100 years. permalink parent award report block reply view 1 more comments... Govtizbad 12 points 5 days ago Every member of the GOP is a lefty Harvard grad living in a big city penthouse apartment What do they have in common with u? permalink parent award report block reply view 1 more comments... keeman 6 points 5 days ago They are on the same team AND AT THE SAME TIME opponents.  They both exist to shift taxpayer money to themselves and their friends and so are allied in wanting the government to only ever get larger.  But at the same time, for any individual seat each party would prefer one of their own to hold that seat all other things being equal.  The RINOs have an additional constraint that it is preferable for the entire R party to have a minority position so that they can more easily explain to their small government desiring voters why the government size increased during their term. permalink parent award report block reply HoganT 4 points 5 days ago Therein lies the problem. Were not even a majority in the republican party. There aren't enough of us. permalink parent award report block reply SuperHonkey 4 points 5 days ago Failure theater permalink parent award report block reply load 1 more comments... Please_Clap 11 points 5 days ago And their lack of response and action will be the proof. permalink parent award report block reply SpikeNST 6 points 5 days ago That and the fact that I have been hearing about the Filibuster for weeks if not months yet Democrats are not even doing it... permalink parent award report block reply TheMostUselessFeeder 7 points 5 days ago They'll just kvetch about \"buT THE opTicS OF ReMoviNG A ChEcK And BALance wONt BE Good\" and continue doing nothing permalink parent award report block reply IncredibleMrE1 7 points 5 days ago They say after sitting by and doing nothing (and cheering in private) while the Biden Regime openly took a steaming dump on all of the checks and balances. Hell, some of the geriatrics voted for the PATRIOT Act, they're that old. permalink parent award report block reply view 1 more comments... popcycle 0 points 4 days ago no, the actual result won't be good.  don't be shortsighted. permalink parent award report block reply keeman 5 points 5 days ago RINOs are just pillaging the country like most of the Dems are.  Lie to voters and then once installed start stealing everything not nailed down and transferring the loot to your campaign funders, friends and family.  The communism is helpful to both sides as increasing the size of the gov provides an increased pile of loot to grab from. permalink parent award report block reply BoatingAccident 13 points 5 days ago it doesn’t matter we have to go for it now and hopefully a miracle happens because if not, we’re gonna be fucked in a few years anyways Trump is smart. He knows this. permalink parent award report block reply DeportThemAllForever 12 points 5 days ago Problem is republicans want to act helpless and pretend that they can’t do as to not upset donor class that loves those things. permalink parent award report block reply MastaJoda 5 points 5 days ago lol Trump endorses every backstabbing AIPAC RINO in Congress. You know that, right? permalink parent award report block reply Awakened 8 points 5 days ago I hate and love when someone beats me to it. permalink parent award report block reply Papabravo12 5 points 5 days ago Yep came here for this permalink parent award report block reply MemeWarsVet 4 points 5 days ago Well done. permalink parent award report block reply load 9 more comments...\nMulletgunning 87 points 5 days ago Came to say the same. The uniparty strikes again. MAGA AF permalink parent award report block reply MickHigan2 60 points 5 days ago Republicans are just slow moving communists from the 30k foot perspective. permalink parent award report block reply Mulletgunning 35 points 5 days ago Correct! They are all on the same team. People need to realize this fake WWE scripted bullshit political theater is there to distract and give one the impression that they have a side in the game. The only side we need to focus on is MAGA AF versus commies and traitors to all Americans. All of those faggots were in on the open border invasion and now are behind the replacing Americans with Visa abusing Jeets and other foreigners. They are enemies and we should treat every last one of those 535 pricks that way. MAGA AF agendas are not being codified into law and these maggots are looking for new ways to fuck us daily. permalink parent award report block reply Dangerous 14 points 5 days ago And people also need to realize that AIPAC backs this Uniparty faction of the GOP against any attempt at reform, and that jews formed and lead the vast majority of communist uprisings over the last 100 years. permalink parent award report block reply view 1 more comments... Govtizbad 12 points 5 days ago Every member of the GOP is a lefty Harvard grad living in a big city penthouse apartment What do they have in common with u? permalink parent award report block reply view 1 more comments... keeman 6 points 5 days ago They are on the same team AND AT THE SAME TIME opponents.  They both exist to shift taxpayer money to themselves and their friends and so are allied in wanting the government to only ever get larger.  But at the same time, for any individual seat each party would prefer one of their own to hold that seat all other things being equal.  The RINOs have an additional constraint that it is preferable for the entire R party to have a minority position so that they can more easily explain to their small government desiring voters why the government size increased during their term. permalink parent award report block reply HoganT 4 points 5 days ago Therein lies the problem. Were not even a majority in the republican party. There aren't enough of us. permalink parent award report block reply SuperHonkey 4 points 5 days ago Failure theater permalink parent award report block reply load 1 more comments... Please_Clap 11 points 5 days ago And their lack of response and action will be the proof. permalink parent award report block reply SpikeNST 6 points 5 days ago That and the fact that I have been hearing about the Filibuster for weeks if not months yet Democrats are not even doing it... permalink parent award report block reply TheMostUselessFeeder 7 points 5 days ago They'll just kvetch about \"buT THE opTicS OF ReMoviNG A ChEcK And BALance wONt BE Good\" and continue doing nothing permalink parent award report block reply IncredibleMrE1 7 points 5 days ago They say after sitting by and doing nothing (and cheering in private) while the Biden Regime openly took a steaming dump on all of the checks and balances. Hell, some of the geriatrics voted for the PATRIOT Act, they're that old. permalink parent award report block reply view 1 more comments... popcycle 0 points 4 days ago no, the actual result won't be good.  don't be shortsighted. permalink parent award report block reply keeman 5 points 5 days ago RINOs are just pillaging the country like most of the Dems are.  Lie to voters and then once installed start stealing everything not nailed down and transferring the loot to your campaign funders, friends and family.  The communism is helpful to both sides as increasing the size of the gov provides an increased pile of loot to grab from. permalink parent award report block reply\nMickHigan2 60 points 5 days ago Republicans are just slow moving communists from the 30k foot perspective. permalink parent award report block reply Mulletgunning 35 points 5 days ago Correct! They are all on the same team. People need to realize this fake WWE scripted bullshit political theater is there to distract and give one the impression that they have a side in the game. The only side we need to focus on is MAGA AF versus commies and traitors to all Americans. All of those faggots were in on the open border invasion and now are behind the replacing Americans with Visa abusing Jeets and other foreigners. They are enemies and we should treat every last one of those 535 pricks that way. MAGA AF agendas are not being codified into law and these maggots are looking for new ways to fuck us daily. permalink parent award report block reply Dangerous 14 points 5 days ago And people also need to realize that AIPAC backs this Uniparty faction of the GOP against any attempt at reform, and that jews formed and lead the vast majority of communist uprisings over the last 100 years. permalink parent award report block reply view 1 more comments... Govtizbad 12 points 5 days ago Every member of the GOP is a lefty Harvard grad living in a big city penthouse apartment What do they have in common with u? permalink parent award report block reply view 1 more comments... keeman 6 points 5 days ago They are on the same team AND AT THE SAME TIME opponents.  They both exist to shift taxpayer money to themselves and their friends and so are allied in wanting the government to only ever get larger.  But at the same time, for any individual seat each party would prefer one of their own to hold that seat all other things being equal.  The RINOs have an additional constraint that it is preferable for the entire R party to have a minority position so that they can more easily explain to their small government desiring voters why the government size increased during their term. permalink parent award report block reply HoganT 4 points 5 days ago Therein lies the problem. Were not even a majority in the republican party. There aren't enough of us. permalink parent award report block reply SuperHonkey 4 points 5 days ago Failure theater permalink parent award report block reply load 1 more comments... Please_Clap 11 points 5 days ago And their lack of response and action will be the proof. permalink parent award report block reply SpikeNST 6 points 5 days ago That and the fact that I have been hearing about the Filibuster for weeks if not months yet Democrats are not even doing it... permalink parent award report block reply TheMostUselessFeeder 7 points 5 days ago They'll just kvetch about \"buT THE opTicS OF ReMoviNG A ChEcK And BALance wONt BE Good\" and continue doing nothing permalink parent award report block reply IncredibleMrE1 7 points 5 days ago They say after sitting by and doing nothing (and cheering in private) while the Biden Regime openly took a steaming dump on all of the checks and balances. Hell, some of the geriatrics voted for the PATRIOT Act, they're that old. permalink parent award report block reply view 1 more comments... popcycle 0 points 4 days ago no, the actual result won't be good.  don't be shortsighted. permalink parent award report block reply keeman 5 points 5 days ago RINOs are just pillaging the country like most of the Dems are.  Lie to voters and then once installed start stealing everything not nailed down and transferring the loot to your campaign funders, friends and family.  The communism is helpful to both sides as increasing the size of the gov provides an increased pile of loot to grab from. permalink parent award report block reply\nMulletgunning 35 points 5 days ago Correct! They are all on the same team. People need to realize this fake WWE scripted bullshit political theater is there to distract and give one the impression that they have a side in the game. The only side we need to focus on is MAGA AF versus commies and traitors to all Americans. All of those faggots were in on the open border invasion and now are behind the replacing Americans with Visa abusing Jeets and other foreigners. They are enemies and we should treat every last one of those 535 pricks that way. MAGA AF agendas are not being codified into law and these maggots are looking for new ways to fuck us daily. permalink parent award report block reply Dangerous 14 points 5 days ago And people also need to realize that AIPAC backs this Uniparty faction of the GOP against any attempt at reform, and that jews formed and lead the vast majority of communist uprisings over the last 100 years. permalink parent award report block reply view 1 more comments... Govtizbad 12 points 5 days ago Every member of the GOP is a lefty Harvard grad living in a big city penthouse apartment What do they have in common with u? permalink parent award report block reply view 1 more comments... keeman 6 points 5 days ago They are on the same team AND AT THE SAME TIME opponents.  They both exist to shift taxpayer money to themselves and their friends and so are allied in wanting the government to only ever get larger.  But at the same time, for any individual seat each party would prefer one of their own to hold that seat all other things being equal.  The RINOs have an additional constraint that it is preferable for the entire R party to have a minority position so that they can more easily explain to their small government desiring voters why the government size increased during their term. permalink parent award report block reply HoganT 4 points 5 days ago Therein lies the problem. Were not even a majority in the republican party. There aren't enough of us. permalink parent award report block reply SuperHonkey 4 points 5 days ago Failure theater permalink parent award report block reply load 1 more comments...\nDangerous 14 points 5 days ago And people also need to realize that AIPAC backs this Uniparty faction of the GOP against any attempt at reform, and that jews formed and lead the vast majority of communist uprisings over the last 100 years. permalink parent award report block reply view 1 more comments...\nGovtizbad 12 points 5 days ago Every member of the GOP is a lefty Harvard grad living in a big city penthouse apartment What do they have in common with u? permalink parent award report block reply view 1 more comments...\nkeeman 6 points 5 days ago They are on the same team AND AT THE SAME TIME opponents.  They both exist to shift taxpayer money to themselves and their friends and so are allied in wanting the government to only ever get larger.  But at the same time, for any individual seat each party would prefer one of their own to hold that seat all other things being equal.  The RINOs have an additional constraint that it is preferable for the entire R party to have a minority position so that they can more easily explain to their small government desiring voters why the government size increased during their term. permalink parent award report block reply\nHoganT 4 points 5 days ago Therein lies the problem. Were not even a majority in the republican party. There aren't enough of us. permalink parent award report block reply\nSuperHonkey 4 points 5 days ago Failure theater permalink parent award report block reply\nPlease_Clap 11 points 5 days ago And their lack of response and action will be the proof. permalink parent award report block reply SpikeNST 6 points 5 days ago That and the fact that I have been hearing about the Filibuster for weeks if not months yet Democrats are not even doing it... permalink parent award report block reply\nSpikeNST 6 points 5 days ago That and the fact that I have been hearing about the Filibuster for weeks if not months yet Democrats are not even doing it... permalink parent award report block reply\nTheMostUselessFeeder 7 points 5 days ago They'll just kvetch about \"buT THE opTicS OF ReMoviNG A ChEcK And BALance wONt BE Good\" and continue doing nothing permalink parent award report block reply IncredibleMrE1 7 points 5 days ago They say after sitting by and doing nothing (and cheering in private) while the Biden Regime openly took a steaming dump on all of the checks and balances. Hell, some of the geriatrics voted for the PATRIOT Act, they're that old. permalink parent award report block reply view 1 more comments... popcycle 0 points 4 days ago no, the actual result won't be good.  don't be shortsighted. permalink parent award report block reply\nIncredibleMrE1 7 points 5 days ago They say after sitting by and doing nothing (and cheering in private) while the Biden Regime openly took a steaming dump on all of the checks and balances. Hell, some of the geriatrics voted for the PATRIOT Act, they're that old. permalink parent award report block reply view 1 more comments...\npopcycle 0 points 4 days ago no, the actual result won't be good.  don't be shortsighted. permalink parent award report block reply\nkeeman 5 points 5 days ago RINOs are just pillaging the country like most of the Dems are.  Lie to voters and then once installed start stealing everything not nailed down and transferring the loot to your campaign funders, friends and family.  The communism is helpful to both sides as increasing the size of the gov provides an increased pile of loot to grab from. permalink parent award report block reply\nBoatingAccident 13 points 5 days ago it doesn’t matter we have to go for it now and hopefully a miracle happens because if not, we’re gonna be fucked in a few years anyways Trump is smart. He knows this. permalink parent award report block reply DeportThemAllForever 12 points 5 days ago Problem is republicans want to act helpless and pretend that they can’t do as to not upset donor class that loves those things. permalink parent award report block reply MastaJoda 5 points 5 days ago lol Trump endorses every backstabbing AIPAC RINO in Congress. You know that, right? permalink parent award report block reply\nDeportThemAllForever 12 points 5 days ago Problem is republicans want to act helpless and pretend that they can’t do as to not upset donor class that loves those things. permalink parent award report block reply\nMastaJoda 5 points 5 days ago lol Trump endorses every backstabbing AIPAC RINO in Congress. You know that, right? permalink parent award report block reply\nAwakened 8 points 5 days ago I hate and love when someone beats me to it. permalink parent award report block reply\nPapabravo12 5 points 5 days ago Yep came here for this permalink parent award report block reply\nMemeWarsVet 4 points 5 days ago Well done. permalink parent award report block reply\nSea_Still 108 points 5 days ago Too bad \"our side\" has never been on our side permalink award report block reply EgregiousPhilbin 21 points 5 days ago Yeah. So why does everyone in here insist that I vote for them anyway? How bout no? permalink parent award report block reply Dizzy77 20 points 5 days ago Vote in the primary. permalink parent award report block reply keeman 11 points 5 days ago I do.  But I would note that I live in a red state and can safely say that George Washington would be leading an armed revolution against the positions of the most \"conservative\" candidates in nearly every race.  The person you want in your government is the person who doesn't really want to be there.  For any competent and high ability person, the only way to get any value out of choosing to be a politician is through corruption.  Those people would make more money in other ways.  So you get mostly corrupt clever people and honest low talent people.  And the honest low talent people tend not to survive very long, leading to the corrupt taking over.  We would do a lot better by picking people randomly from the voter rolls to be the representatives. permalink parent award report block reply MastaJoda 2 points 5 days ago ☝Im here. Pissed off random tax slaves who hate the establishment in DC is the only answer to getting representation from Congress again. As it sits, we have NONE. permalink parent award report block reply TrumpsBigBalls 2 points 5 days ago well said... Trump is the example of someone doing worse off for having gone into politics though did so out of seeing the need. If only our congress were all like him but yeah I don't see that ever happening because of well..what you just said. permalink parent award report block reply God-is-good 1 points 4 days ago Your comment reminded me of a metaphor used in the Bible, a tale of sorts. Something true that’s been happening for near ever. How those doing well aren’t the ones who end up in power.\nFor one with President Trump e are ruled by the Olive Tree. Will the brambles choke out our blessings again? Judges 9:8-15 (KJV) 8 The trees went forth [on a time] to anoint a king over them; and they said unto the olive tree, Reign thou over us. 9 But the olive tree said unto them, Should I leave my fatness, wherewith by me they honour God and man, and go to be promoted over the trees? 10 And the trees said to the fig tree, Come thou, [and] reign over us. 11 But the fig tree said unto them, Should I forsake my sweetness, and my good fruit, and go to be promoted over the trees? 12 Then said the trees unto the vine, Come thou, [and] reign over us. 13 And the vine said unto them, Should I leave my wine, which cheereth God and man, and go to be promoted over the trees? 14 Then said all the trees unto the bramble, Come thou, [and] reign over us. 15 And the bramble said unto the trees, If in truth ye anoint me king over you, [then] come [and] put your trust in my shadow: and if not, let fire come out of the bramble, and devour the cedars of Lebanon. permalink parent award report block reply EgregiousPhilbin 7 points 5 days ago Right. And then do what if it doesn't work out? Exactly. permalink parent award report block reply Dizzy77 4 points 5 days ago There is historical precedent for what happens. It isn't pretty, and I hope we can avoid that. permalink parent award report block reply view 1 more comments... jaeger 3 points 5 days ago I'd rather be stabbed in the face then the back repeatedly. permalink parent award report block reply LineInTheSand -4 points 5 days ago Vote for the lesser of two evils. permalink parent award report block reply MastaJoda 2 points 5 days ago ☝We must be agents of chaos. We have to play dirty, get mean, and challenge them all in primaries so we can drag these globalist POS RINOs through the mud in front of idiotic normie voters who vote for whoever Trump endorses. We need them to watch these RINOs squirm like Cruz being grilled by Tucker. permalink parent award report block reply parttimefed 6 points 5 days ago Vote harder for the people that won't do anything cause at least they are not Democrats! permalink parent award report block reply Shitsbrokeyo 1 points 5 days ago Create our own party and if they dont kiss the ring, abandon them all over the next 3 elections. (2y/6y office) permalink parent award report block reply parttimefed 2 points 5 days ago President Trump should have totally done that when they stole 2020 from him, and forced him as a new party or Harris and the end of the nation permalink parent award report block reply MastaJoda 0 points 5 days ago lol please be sarcasm, ffs. I cant handle anymore retard takes today. This philosophy is why we are here with zero representation in Congress. permalink parent award report block reply parttimefed 2 points 5 days ago No one in Congress represents you are I. permalink parent award report block reply TPMJB 3 points 5 days ago You're being antisemitic! permalink parent award report block reply True_Curmudgeon 1 points 5 days ago Yeah I'm done fucking voting unless there's a really good reason permalink parent award report block reply booblitchutz 13 points 5 days ago \"our side\" is really just kabuki to keep us passive, I'm starting to realize. permalink parent award report block reply deleted 5 points 5 days ago TrumpAndGodWin -2 points 5 days ago A Democrat calling for someone else to do violence then playing the victim. Imagine my shock. permalink parent award report block reply Shitsbrokeyo 6 points 5 days ago Mr. PRESIDENT, move 100 analysts into the IRS and chase the money of Congress. Find all your criminals, and prosecute for criminal and ethics violations. permalink parent award report block reply\nEgregiousPhilbin 21 points 5 days ago Yeah. So why does everyone in here insist that I vote for them anyway? How bout no? permalink parent award report block reply Dizzy77 20 points 5 days ago Vote in the primary. permalink parent award report block reply keeman 11 points 5 days ago I do.  But I would note that I live in a red state and can safely say that George Washington would be leading an armed revolution against the positions of the most \"conservative\" candidates in nearly every race.  The person you want in your government is the person who doesn't really want to be there.  For any competent and high ability person, the only way to get any value out of choosing to be a politician is through corruption.  Those people would make more money in other ways.  So you get mostly corrupt clever people and honest low talent people.  And the honest low talent people tend not to survive very long, leading to the corrupt taking over.  We would do a lot better by picking people randomly from the voter rolls to be the representatives. permalink parent award report block reply MastaJoda 2 points 5 days ago ☝Im here. Pissed off random tax slaves who hate the establishment in DC is the only answer to getting representation from Congress again. As it sits, we have NONE. permalink parent award report block reply TrumpsBigBalls 2 points 5 days ago well said... Trump is the example of someone doing worse off for having gone into politics though did so out of seeing the need. If only our congress were all like him but yeah I don't see that ever happening because of well..what you just said. permalink parent award report block reply God-is-good 1 points 4 days ago Your comment reminded me of a metaphor used in the Bible, a tale of sorts. Something true that’s been happening for near ever. How those doing well aren’t the ones who end up in power.\nFor one with President Trump e are ruled by the Olive Tree. Will the brambles choke out our blessings again? Judges 9:8-15 (KJV) 8 The trees went forth [on a time] to anoint a king over them; and they said unto the olive tree, Reign thou over us. 9 But the olive tree said unto them, Should I leave my fatness, wherewith by me they honour God and man, and go to be promoted over the trees? 10 And the trees said to the fig tree, Come thou, [and] reign over us. 11 But the fig tree said unto them, Should I forsake my sweetness, and my good fruit, and go to be promoted over the trees? 12 Then said the trees unto the vine, Come thou, [and] reign over us. 13 And the vine said unto them, Should I leave my wine, which cheereth God and man, and go to be promoted over the trees? 14 Then said all the trees unto the bramble, Come thou, [and] reign over us. 15 And the bramble said unto the trees, If in truth ye anoint me king over you, [then] come [and] put your trust in my shadow: and if not, let fire come out of the bramble, and devour the cedars of Lebanon. permalink parent award report block reply EgregiousPhilbin 7 points 5 days ago Right. And then do what if it doesn't work out? Exactly. permalink parent award report block reply Dizzy77 4 points 5 days ago There is historical precedent for what happens. It isn't pretty, and I hope we can avoid that. permalink parent award report block reply view 1 more comments... jaeger 3 points 5 days ago I'd rather be stabbed in the face then the back repeatedly. permalink parent award report block reply LineInTheSand -4 points 5 days ago Vote for the lesser of two evils. permalink parent award report block reply MastaJoda 2 points 5 days ago ☝We must be agents of chaos. We have to play dirty, get mean, and challenge them all in primaries so we can drag these globalist POS RINOs through the mud in front of idiotic normie voters who vote for whoever Trump endorses. We need them to watch these RINOs squirm like Cruz being grilled by Tucker. permalink parent award report block reply parttimefed 6 points 5 days ago Vote harder for the people that won't do anything cause at least they are not Democrats! permalink parent award report block reply Shitsbrokeyo 1 points 5 days ago Create our own party and if they dont kiss the ring, abandon them all over the next 3 elections. (2y/6y office) permalink parent award report block reply parttimefed 2 points 5 days ago President Trump should have totally done that when they stole 2020 from him, and forced him as a new party or Harris and the end of the nation permalink parent award report block reply MastaJoda 0 points 5 days ago lol please be sarcasm, ffs. I cant handle anymore retard takes today. This philosophy is why we are here with zero representation in Congress. permalink parent award report block reply parttimefed 2 points 5 days ago No one in Congress represents you are I. permalink parent award report block reply TPMJB 3 points 5 days ago You're being antisemitic! permalink parent award report block reply True_Curmudgeon 1 points 5 days ago Yeah I'm done fucking voting unless there's a really good reason permalink parent award report block reply\nDizzy77 20 points 5 days ago Vote in the primary. permalink parent award report block reply keeman 11 points 5 days ago I do.  But I would note that I live in a red state and can safely say that George Washington would be leading an armed revolution against the positions of the most \"conservative\" candidates in nearly every race.  The person you want in your government is the person who doesn't really want to be there.  For any competent and high ability person, the only way to get any value out of choosing to be a politician is through corruption.  Those people would make more money in other ways.  So you get mostly corrupt clever people and honest low talent people.  And the honest low talent people tend not to survive very long, leading to the corrupt taking over.  We would do a lot better by picking people randomly from the voter rolls to be the representatives. permalink parent award report block reply MastaJoda 2 points 5 days ago ☝Im here. Pissed off random tax slaves who hate the establishment in DC is the only answer to getting representation from Congress again. As it sits, we have NONE. permalink parent award report block reply TrumpsBigBalls 2 points 5 days ago well said... Trump is the example of someone doing worse off for having gone into politics though did so out of seeing the need. If only our congress were all like him but yeah I don't see that ever happening because of well..what you just said. permalink parent award report block reply God-is-good 1 points 4 days ago Your comment reminded me of a metaphor used in the Bible, a tale of sorts. Something true that’s been happening for near ever. How those doing well aren’t the ones who end up in power.\nFor one with President Trump e are ruled by the Olive Tree. Will the brambles choke out our blessings again? Judges 9:8-15 (KJV) 8 The trees went forth [on a time] to anoint a king over them; and they said unto the olive tree, Reign thou over us. 9 But the olive tree said unto them, Should I leave my fatness, wherewith by me they honour God and man, and go to be promoted over the trees? 10 And the trees said to the fig tree, Come thou, [and] reign over us. 11 But the fig tree said unto them, Should I forsake my sweetness, and my good fruit, and go to be promoted over the trees? 12 Then said the trees unto the vine, Come thou, [and] reign over us. 13 And the vine said unto them, Should I leave my wine, which cheereth God and man, and go to be promoted over the trees? 14 Then said all the trees unto the bramble, Come thou, [and] reign over us. 15 And the bramble said unto the trees, If in truth ye anoint me king over you, [then] come [and] put your trust in my shadow: and if not, let fire come out of the bramble, and devour the cedars of Lebanon. permalink parent award report block reply EgregiousPhilbin 7 points 5 days ago Right. And then do what if it doesn't work out? Exactly. permalink parent award report block reply Dizzy77 4 points 5 days ago There is historical precedent for what happens. It isn't pretty, and I hope we can avoid that. permalink parent award report block reply view 1 more comments... jaeger 3 points 5 days ago I'd rather be stabbed in the face then the back repeatedly. permalink parent award report block reply LineInTheSand -4 points 5 days ago Vote for the lesser of two evils. permalink parent award report block reply MastaJoda 2 points 5 days ago ☝We must be agents of chaos. We have to play dirty, get mean, and challenge them all in primaries so we can drag these globalist POS RINOs through the mud in front of idiotic normie voters who vote for whoever Trump endorses. We need them to watch these RINOs squirm like Cruz being grilled by Tucker. permalink parent award report block reply\nkeeman 11 points 5 days ago I do.  But I would note that I live in a red state and can safely say that George Washington would be leading an armed revolution against the positions of the most \"conservative\" candidates in nearly every race.  The person you want in your government is the person who doesn't really want to be there.  For any competent and high ability person, the only way to get any value out of choosing to be a politician is through corruption.  Those people would make more money in other ways.  So you get mostly corrupt clever people and honest low talent people.  And the honest low talent people tend not to survive very long, leading to the corrupt taking over.  We would do a lot better by picking people randomly from the voter rolls to be the representatives. permalink parent award report block reply MastaJoda 2 points 5 days ago ☝Im here. Pissed off random tax slaves who hate the establishment in DC is the only answer to getting representation from Congress again. As it sits, we have NONE. permalink parent award report block reply TrumpsBigBalls 2 points 5 days ago well said... Trump is the example of someone doing worse off for having gone into politics though did so out of seeing the need. If only our congress were all like him but yeah I don't see that ever happening because of well..what you just said. permalink parent award report block reply God-is-good 1 points 4 days ago Your comment reminded me of a metaphor used in the Bible, a tale of sorts. Something true that’s been happening for near ever. How those doing well aren’t the ones who end up in power.\nFor one with President Trump e are ruled by the Olive Tree. Will the brambles choke out our blessings again? Judges 9:8-15 (KJV) 8 The trees went forth [on a time] to anoint a king over them; and they said unto the olive tree, Reign thou over us. 9 But the olive tree said unto them, Should I leave my fatness, wherewith by me they honour God and man, and go to be promoted over the trees? 10 And the trees said to the fig tree, Come thou, [and] reign over us. 11 But the fig tree said unto them, Should I forsake my sweetness, and my good fruit, and go to be promoted over the trees? 12 Then said the trees unto the vine, Come thou, [and] reign over us. 13 And the vine said unto them, Should I leave my wine, which cheereth God and man, and go to be promoted over the trees? 14 Then said all the trees unto the bramble, Come thou, [and] reign over us. 15 And the bramble said unto the trees, If in truth ye anoint me king over you, [then] come [and] put your trust in my shadow: and if not, let fire come out of the bramble, and devour the cedars of Lebanon. permalink parent award report block reply\nMastaJoda 2 points 5 days ago ☝Im here. Pissed off random tax slaves who hate the establishment in DC is the only answer to getting representation from Congress again. As it sits, we have NONE. permalink parent award report block reply\nTrumpsBigBalls 2 points 5 days ago well said... Trump is the example of someone doing worse off for having gone into politics though did so out of seeing the need. If only our congress were all like him but yeah I don't see that ever happening because of well..what you just said. permalink parent award report block reply\nGod-is-good 1 points 4 days ago Your comment reminded me of a metaphor used in the Bible, a tale of sorts. Something true that’s been happening for near ever. How those doing well aren’t the ones who end up in power.\nFor one with President Trump e are ruled by the Olive Tree. Will the brambles choke out our blessings again? Judges 9:8-15 (KJV) 8 The trees went forth [on a time] to anoint a king over them; and they said unto the olive tree, Reign thou over us. 9 But the olive tree said unto them, Should I leave my fatness, wherewith by me they honour God and man, and go to be promoted over the trees? 10 And the trees said to the fig tree, Come thou, [and] reign over us. 11 But the fig tree said unto them, Should I forsake my sweetness, and my good fruit, and go to be promoted over the trees? 12 Then said the trees unto the vine, Come thou, [and] reign over us. 13 And the vine said unto them, Should I leave my wine, which cheereth God and man, and go to be promoted over the trees? 14 Then said all the trees unto the bramble, Come thou, [and] reign over us. 15 And the bramble said unto the trees, If in truth ye anoint me king over you, [then] come [and] put your trust in my shadow: and if not, let fire come out of the bramble, and devour the cedars of Lebanon. permalink parent award report block reply\nEgregiousPhilbin 7 points 5 days ago Right. And then do what if it doesn't work out? Exactly. permalink parent award report block reply Dizzy77 4 points 5 days ago There is historical precedent for what happens. It isn't pretty, and I hope we can avoid that. permalink parent award report block reply view 1 more comments... jaeger 3 points 5 days ago I'd rather be stabbed in the face then the back repeatedly. permalink parent award report block reply LineInTheSand -4 points 5 days ago Vote for the lesser of two evils. permalink parent award report block reply\nDizzy77 4 points 5 days ago There is historical precedent for what happens. It isn't pretty, and I hope we can avoid that. permalink parent award report block reply view 1 more comments...\njaeger 3 points 5 days ago I'd rather be stabbed in the face then the back repeatedly. permalink parent award report block reply\nLineInTheSand -4 points 5 days ago Vote for the lesser of two evils. permalink parent award report block reply\nMastaJoda 2 points 5 days ago ☝We must be agents of chaos. We have to play dirty, get mean, and challenge them all in primaries so we can drag these globalist POS RINOs through the mud in front of idiotic normie voters who vote for whoever Trump endorses. We need them to watch these RINOs squirm like Cruz being grilled by Tucker. permalink parent award report block reply\nparttimefed 6 points 5 days ago Vote harder for the people that won't do anything cause at least they are not Democrats! permalink parent award report block reply Shitsbrokeyo 1 points 5 days ago Create our own party and if they dont kiss the ring, abandon them all over the next 3 elections. (2y/6y office) permalink parent award report block reply parttimefed 2 points 5 days ago President Trump should have totally done that when they stole 2020 from him, and forced him as a new party or Harris and the end of the nation permalink parent award report block reply MastaJoda 0 points 5 days ago lol please be sarcasm, ffs. I cant handle anymore retard takes today. This philosophy is why we are here with zero representation in Congress. permalink parent award report block reply parttimefed 2 points 5 days ago No one in Congress represents you are I. permalink parent award report block reply\nShitsbrokeyo 1 points 5 days ago Create our own party and if they dont kiss the ring, abandon them all over the next 3 elections. (2y/6y office) permalink parent award report block reply parttimefed 2 points 5 days ago President Trump should have totally done that when they stole 2020 from him, and forced him as a new party or Harris and the end of the nation permalink parent award report block reply\nparttimefed 2 points 5 days ago President Trump should have totally done that when they stole 2020 from him, and forced him as a new party or Harris and the end of the nation permalink parent award report block reply\nMastaJoda 0 points 5 days ago lol please be sarcasm, ffs. I cant handle anymore retard takes today. This philosophy is why we are here with zero representation in Congress. permalink parent award report block reply parttimefed 2 points 5 days ago No one in Congress represents you are I. permalink parent award report block reply\nparttimefed 2 points 5 days ago No one in Congress represents you are I. permalink parent award report block reply\nTPMJB 3 points 5 days ago You're being antisemitic! permalink parent award report block reply\nTrue_Curmudgeon 1 points 5 days ago Yeah I'm done fucking voting unless there's a really good reason permalink parent award report block reply\nbooblitchutz 13 points 5 days ago \"our side\" is really just kabuki to keep us passive, I'm starting to realize. permalink parent award report block reply deleted 5 points 5 days ago TrumpAndGodWin -2 points 5 days ago A Democrat calling for someone else to do violence then playing the victim. Imagine my shock. permalink parent award report block reply\ndeleted 5 points 5 days ago TrumpAndGodWin -2 points 5 days ago A Democrat calling for someone else to do violence then playing the victim. Imagine my shock. permalink parent award report block reply\nTrumpAndGodWin -2 points 5 days ago A Democrat calling for someone else to do violence then playing the victim. Imagine my shock. permalink parent award report block reply\nShitsbrokeyo 6 points 5 days ago Mr. PRESIDENT, move 100 analysts into the IRS and chase the money of Congress. Find all your criminals, and prosecute for criminal and ethics violations. permalink parent award report block reply\n_fidelio 51 points 5 days ago The filibuster is a made up rule that corporate-controlled politicians on both sides of the aisle rely on as an excuse for not getting anything done when they’re in power. It’s inherently anti-democratic and needs to go. permalink award report block reply sovereign 16 points 5 days ago Right now with how the democrats are acting in bad faith over this, I'm now becoming convinced that nuking the filibuster may indeed be the correct move. permalink parent award report block reply MAGA_MyPillow 20 points 5 days ago I believe that will be the Play. The dems feel emboldened after Tuesdays results and are going to increase their demands. The GOP cannot give in or its the end of Trump and the GOP. The only play left is to end the filibuster and get the checks in everyones hand before thanksgiving. If the media says its the GOP's fault for the shutdown. well lets end the filibuster and let the GOP open everything back up. permalink parent award report block reply lixa 1 points 5 days ago And they must pass election integrity. Please don't nuke it just for a CR. Nuke it so the left has a very hard time getting back in power. permalink parent award report block reply NeverInterruptEnemy 8 points 5 days ago IDK… I’ve seen a lot of leftists suggest it. Looks like bait to me. permalink parent award report block reply sovereign 3 points 5 days ago That’s why I can’t speak in the affirmative. permalink parent award report block reply ThisTrainHasNoBrakes 3 points 5 days ago But how would that help Israel? permalink parent award report block reply MastaJoda 1 points 5 days ago Nuke it, pass election integrity bills, move the few essentials workers/soldiers pay from the nonessential CR bs to where Congressional salaries are, nuke the CR after that, and then bring back the filibuster. Anyone want to send me to DC? I'll even call the entire chamber FAGGOTS the first chance I get! permalink parent award report block reply HyperCarbs 1 points 5 days ago They'd pass a paycut and extended working days before that. permalink parent award report block reply anotherthing 1 points 4 days ago The filibuster has been around since the early 1800s. It's not something new. permalink parent award report block reply\nsovereign 16 points 5 days ago Right now with how the democrats are acting in bad faith over this, I'm now becoming convinced that nuking the filibuster may indeed be the correct move. permalink parent award report block reply MAGA_MyPillow 20 points 5 days ago I believe that will be the Play. The dems feel emboldened after Tuesdays results and are going to increase their demands. The GOP cannot give in or its the end of Trump and the GOP. The only play left is to end the filibuster and get the checks in everyones hand before thanksgiving. If the media says its the GOP's fault for the shutdown. well lets end the filibuster and let the GOP open everything back up. permalink parent award report block reply lixa 1 points 5 days ago And they must pass election integrity. Please don't nuke it just for a CR. Nuke it so the left has a very hard time getting back in power. permalink parent award report block reply NeverInterruptEnemy 8 points 5 days ago IDK… I’ve seen a lot of leftists suggest it. Looks like bait to me. permalink parent award report block reply sovereign 3 points 5 days ago That’s why I can’t speak in the affirmative. permalink parent award report block reply ThisTrainHasNoBrakes 3 points 5 days ago But how would that help Israel? permalink parent award report block reply MastaJoda 1 points 5 days ago Nuke it, pass election integrity bills, move the few essentials workers/soldiers pay from the nonessential CR bs to where Congressional salaries are, nuke the CR after that, and then bring back the filibuster. Anyone want to send me to DC? I'll even call the entire chamber FAGGOTS the first chance I get! permalink parent award report block reply\nMAGA_MyPillow 20 points 5 days ago I believe that will be the Play. The dems feel emboldened after Tuesdays results and are going to increase their demands. The GOP cannot give in or its the end of Trump and the GOP. The only play left is to end the filibuster and get the checks in everyones hand before thanksgiving. If the media says its the GOP's fault for the shutdown. well lets end the filibuster and let the GOP open everything back up. permalink parent award report block reply lixa 1 points 5 days ago And they must pass election integrity. Please don't nuke it just for a CR. Nuke it so the left has a very hard time getting back in power. permalink parent award report block reply\nlixa 1 points 5 days ago And they must pass election integrity. Please don't nuke it just for a CR. Nuke it so the left has a very hard time getting back in power. permalink parent award report block reply\nNeverInterruptEnemy 8 points 5 days ago IDK… I’ve seen a lot of leftists suggest it. Looks like bait to me. permalink parent award report block reply sovereign 3 points 5 days ago That’s why I can’t speak in the affirmative. permalink parent award report block reply\nsovereign 3 points 5 days ago That’s why I can’t speak in the affirmative. permalink parent award report block reply\nThisTrainHasNoBrakes 3 points 5 days ago But how would that help Israel? permalink parent award report block reply\nMastaJoda 1 points 5 days ago Nuke it, pass election integrity bills, move the few essentials workers/soldiers pay from the nonessential CR bs to where Congressional salaries are, nuke the CR after that, and then bring back the filibuster. Anyone want to send me to DC? I'll even call the entire chamber FAGGOTS the first chance I get! permalink parent award report block reply\nHyperCarbs 1 points 5 days ago They'd pass a paycut and extended working days before that. permalink parent award report block reply\nanotherthing 1 points 4 days ago The filibuster has been around since the early 1800s. It's not something new. permalink parent award report block reply\nHKFan 29 points 5 days ago Did he forget that national GOP are spineless faggots and will get cold feet as soon as consequential legislation is put before them? permalink award report block reply BoatingAccident 12 points 5 days ago no but he’s just rolling the dice because he figures what’s the alternative? The demons are gonna do this anyways eventually and they’ll have the presidency when they do. permalink parent award report block reply HKFan 12 points 5 days ago I'm all for nuking the filibuster if . . . it's followed up by a slew of legislation which renders the democrat party null and void as a national party.  And you know the GOP doesn't have the stomach for that unfortunately, although it needs to be done. Until then tbh we need the protections it offers, when they took power in 2020 they IMMEDIATELY started floating forever power moves like DC statehood and getting rid of the electoral college. Keep the government shutdown if it comes to it.  Fuck it permalink parent award report block reply\nBoatingAccident 12 points 5 days ago no but he’s just rolling the dice because he figures what’s the alternative? The demons are gonna do this anyways eventually and they’ll have the presidency when they do. permalink parent award report block reply HKFan 12 points 5 days ago I'm all for nuking the filibuster if . . . it's followed up by a slew of legislation which renders the democrat party null and void as a national party.  And you know the GOP doesn't have the stomach for that unfortunately, although it needs to be done. Until then tbh we need the protections it offers, when they took power in 2020 they IMMEDIATELY started floating forever power moves like DC statehood and getting rid of the electoral college. Keep the government shutdown if it comes to it.  Fuck it permalink parent award report block reply\nHKFan 12 points 5 days ago I'm all for nuking the filibuster if . . . it's followed up by a slew of legislation which renders the democrat party null and void as a national party.  And you know the GOP doesn't have the stomach for that unfortunately, although it needs to be done. Until then tbh we need the protections it offers, when they took power in 2020 they IMMEDIATELY started floating forever power moves like DC statehood and getting rid of the electoral college. Keep the government shutdown if it comes to it.  Fuck it permalink parent award report block reply\nIm_RickSteves_bitch 21 points 5 days ago Thune is playing for the other team, and it should have been obvious to anyone paying attention well before now. permalink award report block reply AmannamedRJ 9 points 5 days ago Dude it was obvious in December during the leadership election. The GOP doesn't like that Trump and MAGA took it over. They're throwing the fight as hard as they can. They are that corrupt. Pay serious attention now. Whoever fucks this up needs to get primaried out of office. It has to be our grassroots money doing it too. Patriots.win needs to chronicle and score every right-wing representative. Make it really easy to find your state and representatives - including who's running against them or not. Remember r/thecongress? We need that to return but make it super user friendly. Can any programmers make this happen? permalink parent award report block reply PensivePatriot 1 points 5 days ago It’s 2025, you don’t need a programmer. Tell the computer, and it will program itself. If you want this, do it and show us just how badly you wanted it (and how retarded we are for not doing it ourselves first.) permalink parent award report block reply PurgeTheWoke 2 points 5 days ago Do you want Tea app? Because that’s how you get Tea app. permalink parent award report block reply PensivePatriot 1 points 5 days ago What in the utter fuck does this even mean? permalink parent award report block reply view 6 more comments... Fren20 1 points 5 days ago 💯❤️ permalink parent award report block reply YodaBannon 3 points 5 days ago Listen, and understand! That Thune-inator is out there! It can't be bargained with. It can't be reasoned with. It doesn't feel pity, or remorse, or fear! And it absolutely will not stop... ever, until you are dead!\" permalink parent award report block reply\nAmannamedRJ 9 points 5 days ago Dude it was obvious in December during the leadership election. The GOP doesn't like that Trump and MAGA took it over. They're throwing the fight as hard as they can. They are that corrupt. Pay serious attention now. Whoever fucks this up needs to get primaried out of office. It has to be our grassroots money doing it too. Patriots.win needs to chronicle and score every right-wing representative. Make it really easy to find your state and representatives - including who's running against them or not. Remember r/thecongress? We need that to return but make it super user friendly. Can any programmers make this happen? permalink parent award report block reply PensivePatriot 1 points 5 days ago It’s 2025, you don’t need a programmer. Tell the computer, and it will program itself. If you want this, do it and show us just how badly you wanted it (and how retarded we are for not doing it ourselves first.) permalink parent award report block reply PurgeTheWoke 2 points 5 days ago Do you want Tea app? Because that’s how you get Tea app. permalink parent award report block reply PensivePatriot 1 points 5 days ago What in the utter fuck does this even mean? permalink parent award report block reply view 6 more comments... Fren20 1 points 5 days ago 💯❤️ permalink parent award report block reply\nPensivePatriot 1 points 5 days ago It’s 2025, you don’t need a programmer. Tell the computer, and it will program itself. If you want this, do it and show us just how badly you wanted it (and how retarded we are for not doing it ourselves first.) permalink parent award report block reply PurgeTheWoke 2 points 5 days ago Do you want Tea app? Because that’s how you get Tea app. permalink parent award report block reply PensivePatriot 1 points 5 days ago What in the utter fuck does this even mean? permalink parent award report block reply view 6 more comments...\nPurgeTheWoke 2 points 5 days ago Do you want Tea app? Because that’s how you get Tea app. permalink parent award report block reply PensivePatriot 1 points 5 days ago What in the utter fuck does this even mean? permalink parent award report block reply view 6 more comments...\nPensivePatriot 1 points 5 days ago What in the utter fuck does this even mean? permalink parent award report block reply view 6 more comments...\nFren20 1 points 5 days ago 💯❤️ permalink parent award report block reply\nYodaBannon 3 points 5 days ago Listen, and understand! That Thune-inator is out there! It can't be bargained with. It can't be reasoned with. It doesn't feel pity, or remorse, or fear! And it absolutely will not stop... ever, until you are dead!\" permalink parent award report block reply\nTrump-16-20-24-28-32 20 points 5 days ago If we get rid of the filibuster (and we have years and years of quotes of democrats supporting that), and those things actually get instituted (voter id, no mail-in voting, etc.) and voter integrity laws are passed, then the democrats will lose. This could kick off more states to buy in to the Article V convention of the states because I could see the states wanting the filibuster to be an amendment. If we could have a temporary stop on the filibuster, then we win.  Plain and simple.  If we don't, we know the Democrats will do it and we will lose. This is the play... this is it. permalink award report block reply PM_ME_UR_MAGIC_CARDS 1 points 5 days ago well shit when you put it like that permalink parent award report block reply Freeth3usa 1 points 5 days ago How exactly will congress get voter id or stop mail in voting? You need a constitutional amendment for that. permalink parent award report block reply Trump-16-20-24-28-32 1 points 4 days ago I specifically mention kicking off article V convention of the states which is used to amend the constitution. There is some ability for the federal government to provide guidelines for federal elections.  For example, a state can't say \"the first person to get 500 votes wins\" even though it's up to the legislators to control the election. permalink parent award report block reply infeststation 1 points 5 days ago Why? permalink parent award report block reply Fren20 1 points 5 days ago Please explain the amendment permalink parent award report block reply Trump-16-20-24-28-32 1 points 4 days ago I didn't bring up any amendment.  I brought up article V, convention of states.  Article V is the part of the Constitution that explains now to amend the constitution.  If 2/3 (34) of the states call for a convention, then there will be a gathering of the states to propose new amendments, all without going through congress. It requires 75% (38) of the states approval to ratify the state proposed amendment. It's never been done, but there are currently 19 states that have approved it, many that have legislation passed in one chamber, and many that have active legislation.  It looks like the only states that want to avoid it are the very blue states. https://conventionofstates.com/states-that-have-passed-the-convention-of-states-article-v-application permalink parent award report block reply\nPM_ME_UR_MAGIC_CARDS 1 points 5 days ago well shit when you put it like that permalink parent award report block reply\nFreeth3usa 1 points 5 days ago How exactly will congress get voter id or stop mail in voting? You need a constitutional amendment for that. permalink parent award report block reply Trump-16-20-24-28-32 1 points 4 days ago I specifically mention kicking off article V convention of the states which is used to amend the constitution. There is some ability for the federal government to provide guidelines for federal elections.  For example, a state can't say \"the first person to get 500 votes wins\" even though it's up to the legislators to control the election. permalink parent award report block reply infeststation 1 points 5 days ago Why? permalink parent award report block reply\nTrump-16-20-24-28-32 1 points 4 days ago I specifically mention kicking off article V convention of the states which is used to amend the constitution. There is some ability for the federal government to provide guidelines for federal elections.  For example, a state can't say \"the first person to get 500 votes wins\" even though it's up to the legislators to control the election. permalink parent award report block reply\ninfeststation 1 points 5 days ago Why? permalink parent award report block reply\nFren20 1 points 5 days ago Please explain the amendment permalink parent award report block reply Trump-16-20-24-28-32 1 points 4 days ago I didn't bring up any amendment.  I brought up article V, convention of states.  Article V is the part of the Constitution that explains now to amend the constitution.  If 2/3 (34) of the states call for a convention, then there will be a gathering of the states to propose new amendments, all without going through congress. It requires 75% (38) of the states approval to ratify the state proposed amendment. It's never been done, but there are currently 19 states that have approved it, many that have legislation passed in one chamber, and many that have active legislation.  It looks like the only states that want to avoid it are the very blue states. https://conventionofstates.com/states-that-have-passed-the-convention-of-states-article-v-application permalink parent award report block reply\nTrump-16-20-24-28-32 1 points 4 days ago I didn't bring up any amendment.  I brought up article V, convention of states.  Article V is the part of the Constitution that explains now to amend the constitution.  If 2/3 (34) of the states call for a convention, then there will be a gathering of the states to propose new amendments, all without going through congress. It requires 75% (38) of the states approval to ratify the state proposed amendment. It's never been done, but there are currently 19 states that have approved it, many that have legislation passed in one chamber, and many that have active legislation.  It looks like the only states that want to avoid it are the very blue states. https://conventionofstates.com/states-that-have-passed-the-convention-of-states-article-v-application permalink parent award report block reply\nCanadianMeathead 19 points 5 days ago Watch those who vote against this. permalink award report block reply Simple_Doot 7 points 5 days ago I really dont think its crazy to have some apprehension about abolishing the filibuster.  But I also believe there is some unbelievable event just over the horizon that will lead to a complete reordering of society globally.  Trump will be the last president so if there is some inevitable insane event coming then it makes sense that we would nuke the filibuster and not give a shit about spending because it simply will not matter in a few years. permalink parent award report block reply goldkeyboardwarrior 4 points 5 days ago I can't say I'm a fan of nuking the filibuster, but we almost saw it happen while Biden was president. Sinema and Manchin were the only two who kept it from happening, and Sinema was harassed on more than one occasion over it. I'm interested in seeing what the GOP does if Dems continue to refuse to open the government, since they probably believe the country blames Trump for it after seeing how the elections went on Tuesday. At the same time, I know there are several in the GOP that will be a hard no on nuking the filibuster, and if I remember correctly, Cruz said they don't have the votes to do it. permalink parent award report block reply zooty 1 points 5 days ago Would it help if I told you that dems implemented the filibuster rule in its current form and that the current implementation is younger than me? permalink parent award report block reply Fren20 1 points 5 days ago Hell yeah spread the word,I truly think trump will be our last president at all need to make plans. permalink parent award report block reply _fidelio 1 points 5 days ago Interesting.. Why do you think Trump will be the last president? permalink parent award report block reply Simple_Doot 1 points 4 days ago Not much in way if hard evidence.  But there are so many things coming to a head, so many lies about our past, Revelations' seeming fulfillment, the unsustainable trajectory of geopolitics and our own government hustle not caring about anything almost as if someone knows we are about to drive off a cliff so just let go of the wheel.  If we are holding Trump to MAGA standards of 2016-2024 he has absolutely failed, gone completely off course.  He is pursuing some other agenda that is completely hidden from us.  I think its because he is an agent of something that has been here for thousands of years and not the American people.  Its a bat shit crazy idea but Im certain of it. permalink parent award report block reply trumpORbust 2 points 5 days ago All of them permalink parent award report block reply\nSimple_Doot 7 points 5 days ago I really dont think its crazy to have some apprehension about abolishing the filibuster.  But I also believe there is some unbelievable event just over the horizon that will lead to a complete reordering of society globally.  Trump will be the last president so if there is some inevitable insane event coming then it makes sense that we would nuke the filibuster and not give a shit about spending because it simply will not matter in a few years. permalink parent award report block reply goldkeyboardwarrior 4 points 5 days ago I can't say I'm a fan of nuking the filibuster, but we almost saw it happen while Biden was president. Sinema and Manchin were the only two who kept it from happening, and Sinema was harassed on more than one occasion over it. I'm interested in seeing what the GOP does if Dems continue to refuse to open the government, since they probably believe the country blames Trump for it after seeing how the elections went on Tuesday. At the same time, I know there are several in the GOP that will be a hard no on nuking the filibuster, and if I remember correctly, Cruz said they don't have the votes to do it. permalink parent award report block reply zooty 1 points 5 days ago Would it help if I told you that dems implemented the filibuster rule in its current form and that the current implementation is younger than me? permalink parent award report block reply Fren20 1 points 5 days ago Hell yeah spread the word,I truly think trump will be our last president at all need to make plans. permalink parent award report block reply _fidelio 1 points 5 days ago Interesting.. Why do you think Trump will be the last president? permalink parent award report block reply Simple_Doot 1 points 4 days ago Not much in way if hard evidence.  But there are so many things coming to a head, so many lies about our past, Revelations' seeming fulfillment, the unsustainable trajectory of geopolitics and our own government hustle not caring about anything almost as if someone knows we are about to drive off a cliff so just let go of the wheel.  If we are holding Trump to MAGA standards of 2016-2024 he has absolutely failed, gone completely off course.  He is pursuing some other agenda that is completely hidden from us.  I think its because he is an agent of something that has been here for thousands of years and not the American people.  Its a bat shit crazy idea but Im certain of it. permalink parent award report block reply\ngoldkeyboardwarrior 4 points 5 days ago I can't say I'm a fan of nuking the filibuster, but we almost saw it happen while Biden was president. Sinema and Manchin were the only two who kept it from happening, and Sinema was harassed on more than one occasion over it. I'm interested in seeing what the GOP does if Dems continue to refuse to open the government, since they probably believe the country blames Trump for it after seeing how the elections went on Tuesday. At the same time, I know there are several in the GOP that will be a hard no on nuking the filibuster, and if I remember correctly, Cruz said they don't have the votes to do it. permalink parent award report block reply zooty 1 points 5 days ago Would it help if I told you that dems implemented the filibuster rule in its current form and that the current implementation is younger than me? permalink parent award report block reply\nzooty 1 points 5 days ago Would it help if I told you that dems implemented the filibuster rule in its current form and that the current implementation is younger than me? permalink parent award report block reply\nFren20 1 points 5 days ago Hell yeah spread the word,I truly think trump will be our last president at all need to make plans. permalink parent award report block reply\n_fidelio 1 points 5 days ago Interesting.. Why do you think Trump will be the last president? permalink parent award report block reply Simple_Doot 1 points 4 days ago Not much in way if hard evidence.  But there are so many things coming to a head, so many lies about our past, Revelations' seeming fulfillment, the unsustainable trajectory of geopolitics and our own government hustle not caring about anything almost as if someone knows we are about to drive off a cliff so just let go of the wheel.  If we are holding Trump to MAGA standards of 2016-2024 he has absolutely failed, gone completely off course.  He is pursuing some other agenda that is completely hidden from us.  I think its because he is an agent of something that has been here for thousands of years and not the American people.  Its a bat shit crazy idea but Im certain of it. permalink parent award report block reply\nSimple_Doot 1 points 4 days ago Not much in way if hard evidence.  But there are so many things coming to a head, so many lies about our past, Revelations' seeming fulfillment, the unsustainable trajectory of geopolitics and our own government hustle not caring about anything almost as if someone knows we are about to drive off a cliff so just let go of the wheel.  If we are holding Trump to MAGA standards of 2016-2024 he has absolutely failed, gone completely off course.  He is pursuing some other agenda that is completely hidden from us.  I think its because he is an agent of something that has been here for thousands of years and not the American people.  Its a bat shit crazy idea but Im certain of it. permalink parent award report block reply\ntrumpORbust 2 points 5 days ago All of them permalink parent award report block reply\nDeplorable_in_PA 14 points 5 days ago I really, truly dislike the idea of nuking the filibuster.  It basically means whoever has a slim majority in congress can pass whatever they want and all the other side can do is sit down, STFU, and tweet about it.  It's basically majority rule and that flies in the face of us being a republic vs a democracy. That said, you know the second the dems get a majority that will be the first thing they do.  If we don't nuke the filibuster we lose perhaps our only window to pass the MAGA agenda. permalink award report block reply TrumpAndGodWin 5 points 5 days ago Don't forget the dems wanting to pack the supreme court. permalink parent award report block reply Freeth3usa 1 points 5 days ago Meh they’ll never pack the court. It just means the next administration would likely pack it too. Then continue until we have 1000’s of judges. permalink parent award report block reply zooty 1 points 5 days ago All next administrations will be Dem if they can pack the SC. Which they're likely to get to do anyway at some point. The only reason Dems don't take a step that increases their power is because they think there's already an easier or less controversial way to do it. That has been election fraud but it's failed them twice so get ready for worse. Currently, it seems to be 'rogue' judges. permalink parent award report block reply LUXURY_USERNAME 2 points 5 days ago Yeah but how will they get the majority again if we have voter ID and same day voting, one day elections, no mail-in, citizens only, etc permalink parent award report block reply Fren20 1 points 5 days ago Well what do you suggest permalink parent award report block reply infeststation 1 points 5 days ago After some turbulence, the people will force politicians to come back to the center. permalink parent award report block reply\nTrumpAndGodWin 5 points 5 days ago Don't forget the dems wanting to pack the supreme court. permalink parent award report block reply Freeth3usa 1 points 5 days ago Meh they’ll never pack the court. It just means the next administration would likely pack it too. Then continue until we have 1000’s of judges. permalink parent award report block reply zooty 1 points 5 days ago All next administrations will be Dem if they can pack the SC. Which they're likely to get to do anyway at some point. The only reason Dems don't take a step that increases their power is because they think there's already an easier or less controversial way to do it. That has been election fraud but it's failed them twice so get ready for worse. Currently, it seems to be 'rogue' judges. permalink parent award report block reply\nFreeth3usa 1 points 5 days ago Meh they’ll never pack the court. It just means the next administration would likely pack it too. Then continue until we have 1000’s of judges. permalink parent award report block reply zooty 1 points 5 days ago All next administrations will be Dem if they can pack the SC. Which they're likely to get to do anyway at some point. The only reason Dems don't take a step that increases their power is because they think there's already an easier or less controversial way to do it. That has been election fraud but it's failed them twice so get ready for worse. Currently, it seems to be 'rogue' judges. permalink parent award report block reply\nzooty 1 points 5 days ago All next administrations will be Dem if they can pack the SC. Which they're likely to get to do anyway at some point. The only reason Dems don't take a step that increases their power is because they think there's already an easier or less controversial way to do it. That has been election fraud but it's failed them twice so get ready for worse. Currently, it seems to be 'rogue' judges. permalink parent award report block reply\nLUXURY_USERNAME 2 points 5 days ago Yeah but how will they get the majority again if we have voter ID and same day voting, one day elections, no mail-in, citizens only, etc permalink parent award report block reply\nFren20 1 points 5 days ago Well what do you suggest permalink parent award report block reply\ninfeststation 1 points 5 days ago After some turbulence, the people will force politicians to come back to the center. permalink parent award report block reply\nAlbo22 8 points 5 days ago Democrats will nuke  it as soon as they come to power permalink award report block reply Tmntnyc 4 points 5 days ago They didn't nuke it last time they were in power, why would they? permalink parent award report block reply BasedLaugh 4 points 5 days ago Yeah they did. Joe Manchin and Krysten Sinema were the two Senators that voted no and stalled their attempt to nuke the filibuster to pass the Voting Rights Act in 2022. They will definitely try to do it again. permalink parent award report block reply HoganT -1 points 5 days ago Attempting to bypass it for one single vote is not nuking the filibuster. In fact, we're the last ones to actually permanently kill the filibuster for something. Supreme Court confirmations. After having spent the entire year leading up to it using the filibuster to block obama from getting a final judge in, no less. permalink parent award report block reply Doritalos 3 points 5 days ago You again. \"They were only going to nuke it for one vote\". Give it a rest permalink parent award report block reply view 1 more comments... TheMostUselessFeeder 2 points 5 days ago Yeah it's kind of weird to me how all of a sudden this concept has become a thing.. It was never really in the public discourse like this before 🤔 permalink parent award report block reply AmannamedRJ 3 points 5 days ago Democrats  ripped every semblance of the mask off when they arrested Trump on trumped up charges, shot trump and cried when they didn't kill him, and assassinated Charlie Kirk. Put simply, there's no more need to pretend to be fair or moderate. permalink parent award report block reply HoganT 0 points 5 days ago It's because... shhh... We. Want. To. Nuke. The. Filibuster. And need fear and coercion to get it done. We're the last ones to actually kill it for something, Supreme Court confirmations. permalink parent award report block reply zooty 1 points 5 days ago Yeah but the dems had done it not too long before for presidential nominations. Turtle Mitch famously warned them they'd come to regret it. The filibuster for most nominations was last removed by Senate Democrats in 2013, when then-Majority Leader Harry Reid led the effort to eliminate the filibuster for executive and judicial nominees (except Supreme Court nominees) through the \"nuclear option\".\nThis change allowed a simple majority to confirm these nominees instead of requiring 60 votes. *Note: I also asked it about supreme court nominations and it did mention the Rs in 2017 (as you have said) so I'll stipulate that it has made an error in its assessment there but that the event still occurred when it did. At this point, it's only there until anyone has the will to remove it and it would be foolish to concede that to people who want us all dead. permalink parent award report block reply Mooksayshigh 1 points 5 days ago They tried to kill him, they are killing us. You shouldn't need fear and coercion anymore. Clean house, get this shit started. There's no other way permalink parent award report block reply\nTmntnyc 4 points 5 days ago They didn't nuke it last time they were in power, why would they? permalink parent award report block reply BasedLaugh 4 points 5 days ago Yeah they did. Joe Manchin and Krysten Sinema were the two Senators that voted no and stalled their attempt to nuke the filibuster to pass the Voting Rights Act in 2022. They will definitely try to do it again. permalink parent award report block reply HoganT -1 points 5 days ago Attempting to bypass it for one single vote is not nuking the filibuster. In fact, we're the last ones to actually permanently kill the filibuster for something. Supreme Court confirmations. After having spent the entire year leading up to it using the filibuster to block obama from getting a final judge in, no less. permalink parent award report block reply Doritalos 3 points 5 days ago You again. \"They were only going to nuke it for one vote\". Give it a rest permalink parent award report block reply view 1 more comments... TheMostUselessFeeder 2 points 5 days ago Yeah it's kind of weird to me how all of a sudden this concept has become a thing.. It was never really in the public discourse like this before 🤔 permalink parent award report block reply AmannamedRJ 3 points 5 days ago Democrats  ripped every semblance of the mask off when they arrested Trump on trumped up charges, shot trump and cried when they didn't kill him, and assassinated Charlie Kirk. Put simply, there's no more need to pretend to be fair or moderate. permalink parent award report block reply HoganT 0 points 5 days ago It's because... shhh... We. Want. To. Nuke. The. Filibuster. And need fear and coercion to get it done. We're the last ones to actually kill it for something, Supreme Court confirmations. permalink parent award report block reply zooty 1 points 5 days ago Yeah but the dems had done it not too long before for presidential nominations. Turtle Mitch famously warned them they'd come to regret it. The filibuster for most nominations was last removed by Senate Democrats in 2013, when then-Majority Leader Harry Reid led the effort to eliminate the filibuster for executive and judicial nominees (except Supreme Court nominees) through the \"nuclear option\".\nThis change allowed a simple majority to confirm these nominees instead of requiring 60 votes. *Note: I also asked it about supreme court nominations and it did mention the Rs in 2017 (as you have said) so I'll stipulate that it has made an error in its assessment there but that the event still occurred when it did. At this point, it's only there until anyone has the will to remove it and it would be foolish to concede that to people who want us all dead. permalink parent award report block reply Mooksayshigh 1 points 5 days ago They tried to kill him, they are killing us. You shouldn't need fear and coercion anymore. Clean house, get this shit started. There's no other way permalink parent award report block reply\nBasedLaugh 4 points 5 days ago Yeah they did. Joe Manchin and Krysten Sinema were the two Senators that voted no and stalled their attempt to nuke the filibuster to pass the Voting Rights Act in 2022. They will definitely try to do it again. permalink parent award report block reply HoganT -1 points 5 days ago Attempting to bypass it for one single vote is not nuking the filibuster. In fact, we're the last ones to actually permanently kill the filibuster for something. Supreme Court confirmations. After having spent the entire year leading up to it using the filibuster to block obama from getting a final judge in, no less. permalink parent award report block reply Doritalos 3 points 5 days ago You again. \"They were only going to nuke it for one vote\". Give it a rest permalink parent award report block reply view 1 more comments...\nHoganT -1 points 5 days ago Attempting to bypass it for one single vote is not nuking the filibuster. In fact, we're the last ones to actually permanently kill the filibuster for something. Supreme Court confirmations. After having spent the entire year leading up to it using the filibuster to block obama from getting a final judge in, no less. permalink parent award report block reply Doritalos 3 points 5 days ago You again. \"They were only going to nuke it for one vote\". Give it a rest permalink parent award report block reply view 1 more comments...\nDoritalos 3 points 5 days ago You again. \"They were only going to nuke it for one vote\". Give it a rest permalink parent award report block reply view 1 more comments...\nTheMostUselessFeeder 2 points 5 days ago Yeah it's kind of weird to me how all of a sudden this concept has become a thing.. It was never really in the public discourse like this before 🤔 permalink parent award report block reply AmannamedRJ 3 points 5 days ago Democrats  ripped every semblance of the mask off when they arrested Trump on trumped up charges, shot trump and cried when they didn't kill him, and assassinated Charlie Kirk. Put simply, there's no more need to pretend to be fair or moderate. permalink parent award report block reply HoganT 0 points 5 days ago It's because... shhh... We. Want. To. Nuke. The. Filibuster. And need fear and coercion to get it done. We're the last ones to actually kill it for something, Supreme Court confirmations. permalink parent award report block reply zooty 1 points 5 days ago Yeah but the dems had done it not too long before for presidential nominations. Turtle Mitch famously warned them they'd come to regret it. The filibuster for most nominations was last removed by Senate Democrats in 2013, when then-Majority Leader Harry Reid led the effort to eliminate the filibuster for executive and judicial nominees (except Supreme Court nominees) through the \"nuclear option\".\nThis change allowed a simple majority to confirm these nominees instead of requiring 60 votes. *Note: I also asked it about supreme court nominations and it did mention the Rs in 2017 (as you have said) so I'll stipulate that it has made an error in its assessment there but that the event still occurred when it did. At this point, it's only there until anyone has the will to remove it and it would be foolish to concede that to people who want us all dead. permalink parent award report block reply Mooksayshigh 1 points 5 days ago They tried to kill him, they are killing us. You shouldn't need fear and coercion anymore. Clean house, get this shit started. There's no other way permalink parent award report block reply\nAmannamedRJ 3 points 5 days ago Democrats  ripped every semblance of the mask off when they arrested Trump on trumped up charges, shot trump and cried when they didn't kill him, and assassinated Charlie Kirk. Put simply, there's no more need to pretend to be fair or moderate. permalink parent award report block reply\nHoganT 0 points 5 days ago It's because... shhh... We. Want. To. Nuke. The. Filibuster. And need fear and coercion to get it done. We're the last ones to actually kill it for something, Supreme Court confirmations. permalink parent award report block reply zooty 1 points 5 days ago Yeah but the dems had done it not too long before for presidential nominations. Turtle Mitch famously warned them they'd come to regret it. The filibuster for most nominations was last removed by Senate Democrats in 2013, when then-Majority Leader Harry Reid led the effort to eliminate the filibuster for executive and judicial nominees (except Supreme Court nominees) through the \"nuclear option\".\nThis change allowed a simple majority to confirm these nominees instead of requiring 60 votes. *Note: I also asked it about supreme court nominations and it did mention the Rs in 2017 (as you have said) so I'll stipulate that it has made an error in its assessment there but that the event still occurred when it did. At this point, it's only there until anyone has the will to remove it and it would be foolish to concede that to people who want us all dead. permalink parent award report block reply Mooksayshigh 1 points 5 days ago They tried to kill him, they are killing us. You shouldn't need fear and coercion anymore. Clean house, get this shit started. There's no other way permalink parent award report block reply\nzooty 1 points 5 days ago Yeah but the dems had done it not too long before for presidential nominations. Turtle Mitch famously warned them they'd come to regret it. The filibuster for most nominations was last removed by Senate Democrats in 2013, when then-Majority Leader Harry Reid led the effort to eliminate the filibuster for executive and judicial nominees (except Supreme Court nominees) through the \"nuclear option\".\nThis change allowed a simple majority to confirm these nominees instead of requiring 60 votes. *Note: I also asked it about supreme court nominations and it did mention the Rs in 2017 (as you have said) so I'll stipulate that it has made an error in its assessment there but that the event still occurred when it did. At this point, it's only there until anyone has the will to remove it and it would be foolish to concede that to people who want us all dead. permalink parent award report block reply\nMooksayshigh 1 points 5 days ago They tried to kill him, they are killing us. You shouldn't need fear and coercion anymore. Clean house, get this shit started. There's no other way permalink parent award report block reply\nJuniorMints 7 points 5 days ago He's showing them how to win and they have no backbone. permalink award report block reply\nagremlinintheworks 7 points 5 days ago I'm not worried about the democrats using this against us in the future. The couple dems who would vote against removing it are gone. They'll remove it immediately when they get control of the senate regardless of what republicans do today. However I do worry about the rino's in our midst. I don't believe that's enough that we shouldn't do this. But I do worry that similar to the senate vote to cancel trump's tariffs that passed with universal democrat support and a few rinos+libertarians, we may see some ugly things make it through the senate that have to be vetoed. permalink award report block reply\nAlldayeveryday 5 points 5 days ago The government is the biggest criminal organization in the world permalink award report block reply\nTrumpLandslide20201 4 points 5 days ago Mr. President you are speaking to Deep State Traitors. There is NO way in HELL they want any of this. No Way! permalink award report block reply KernalMustard 2 points 5 days ago Back to usual in 3 years. Always the plan. GOP will win in GOP areas but MAGA will die. Dont say vance. I know a faker when I see one. His history shows hes a chameleon. permalink parent award report block reply\nKernalMustard 2 points 5 days ago Back to usual in 3 years. Always the plan. GOP will win in GOP areas but MAGA will die. Dont say vance. I know a faker when I see one. His history shows hes a chameleon. permalink parent award report block reply\nJimmyRussler 4 points 5 days ago All of those things are exactly why they won't do it. permalink award report block reply\nbooblitchutz 4 points 5 days ago And the part Trump is missing is the establishment GOP has NO appetite for fixing ANY of those things. All \"nuking the filibuster\" will do is unmask more RINOs in the Senate who will never let anything get to 50 votes. permalink award report block reply KernalMustard 2 points 5 days ago Fix things and they cant grift.  See them winning means less donation dollars filling the coffers. On the losing side means you will give them more money to win. They make the promises and by the time election comes around they hope you forgot. You donate again. Its battered wife syndrome. You keep going back hoping they change. They couldn't care less about you. permalink parent award report block reply booblitchutz 1 points 5 days ago Yeah, they're all on the same side - their own. The dems are playing one side of the fence and the republicans are playing the other but in reality, they're just helping themselves. permalink parent award report block reply Build_Back_Bankrupt 1 points 5 days ago It will unmask more RINOs, but they won't be able to hide behind it and blame the other side, they'll be forced to vote against any bills or EO's that Trump and the people they're supposed to be representing want codified.  Great way to get themselves primaried, and of course they'll try to explain it away because of their \"principles\". permalink parent award report block reply booblitchutz 1 points 5 days ago That’s why they won’t nuke the filibuster. It gives them cover. permalink parent award report block reply Build_Back_Bankrupt 1 points 5 days ago They're not supposed to have cover, they're supposed to lobby for their constituents, ie., represent them. This is tea in the harbor level shit to me. permalink parent award report block reply\nKernalMustard 2 points 5 days ago Fix things and they cant grift.  See them winning means less donation dollars filling the coffers. On the losing side means you will give them more money to win. They make the promises and by the time election comes around they hope you forgot. You donate again. Its battered wife syndrome. You keep going back hoping they change. They couldn't care less about you. permalink parent award report block reply booblitchutz 1 points 5 days ago Yeah, they're all on the same side - their own. The dems are playing one side of the fence and the republicans are playing the other but in reality, they're just helping themselves. permalink parent award report block reply\nbooblitchutz 1 points 5 days ago Yeah, they're all on the same side - their own. The dems are playing one side of the fence and the republicans are playing the other but in reality, they're just helping themselves. permalink parent award report block reply\nBuild_Back_Bankrupt 1 points 5 days ago It will unmask more RINOs, but they won't be able to hide behind it and blame the other side, they'll be forced to vote against any bills or EO's that Trump and the people they're supposed to be representing want codified.  Great way to get themselves primaried, and of course they'll try to explain it away because of their \"principles\". permalink parent award report block reply booblitchutz 1 points 5 days ago That’s why they won’t nuke the filibuster. It gives them cover. permalink parent award report block reply Build_Back_Bankrupt 1 points 5 days ago They're not supposed to have cover, they're supposed to lobby for their constituents, ie., represent them. This is tea in the harbor level shit to me. permalink parent award report block reply\nbooblitchutz 1 points 5 days ago That’s why they won’t nuke the filibuster. It gives them cover. permalink parent award report block reply Build_Back_Bankrupt 1 points 5 days ago They're not supposed to have cover, they're supposed to lobby for their constituents, ie., represent them. This is tea in the harbor level shit to me. permalink parent award report block reply\nBuild_Back_Bankrupt 1 points 5 days ago They're not supposed to have cover, they're supposed to lobby for their constituents, ie., represent them. This is tea in the harbor level shit to me. permalink parent award report block reply\nTheSwampThang 4 points 5 days ago The problem is that we're not trying to do those things even when we can without the filibuster.   Also those priorities are all wrong, arresting deep the deep state is still top priority. permalink award report block reply\nbirddogz 3 points 5 days ago The congresscritters will never help Trump do any of that.  They feast on the griff as much as the commies. permalink award report block reply\nMAGAnic316 3 points 5 days ago Prepare for more bullshit excuses than Hasan Piker permalink award report block reply\nMajJamesMcFarlane 3 points 5 days ago Absolutely wild that Trump is blaming all his failings in both the first and this term on a Senate rule that's existed for over 200 years. Gosh, how did any one ever achieve anything in the last 200 years, Mr. President? permalink award report block reply zooty 0 points 5 days ago What did anyone achieve in the last 200 years? A bloated, intrusive government? An ever-expensive military industrial complex? A debased currency and theft of wealth from the citizens? permalink parent award report block reply\nzooty 0 points 5 days ago What did anyone achieve in the last 200 years? A bloated, intrusive government? An ever-expensive military industrial complex? A debased currency and theft of wealth from the citizens? permalink parent award report block reply\nAmerican-Patriot 3 points 5 days ago Lord God please let it be so. Change the minds and hearts of the Republicans who are holding back. permalink award report block reply\nDegenNerd 3 points 5 days ago Voter ID is the most important. permalink award report block reply CatalystForChange OP 1 points 5 days ago 👆 Most underrated comment! permalink parent award report block reply\nCatalystForChange OP 1 points 5 days ago 👆 Most underrated comment! permalink parent award report block reply\nAppeal2Heaven98 3 points 5 days ago All the more reason for the GOP not to do it. At least the Democrats are honest when they say they want us dead. The Republicans act like our friend who will stab us in the back in the end when we need them most. permalink award report block reply\nTwitter 3 points 5 days ago Rinos are worse then Demoncrats which aren't afraid to show they are degenerates permalink award report block reply\nTacitus1963 3 points 5 days ago Does he not get it yet that the GOP is almost completely RINO and working against him?\nEven if they got rid of the filibuster, the RINOs would do NOTHING.\nThey, like their Demtard pals, are actively engaged in also destroying our country. permalink award report block reply\nFlounder66 3 points 5 days ago The GOP will squander Trump's presidency and then the opportunity will be gone along with the Don. A plague on both their houses. permalink award report block reply\nFromseatoshinningsea 2 points 5 days ago He doesn't have enough proof of their corruption and esp. pedophilia to coerce them. This is prob one of the last opportunities Pres Donald has to save what's left of the republic.  I'd speculate that the money being offered to these senators and to the SC justices by WEF, ME Oil billionaires, EU, CCP, etc. is staggering. Prob comes with deniability. Pres Donald is appealing to their honor and righteous principles, but they have none. permalink award report block reply\nSpleenrippa 2 points 5 days ago Wake the fuck up Mr. President, most Republicans hate you. They are not on your side and do not want to pass your (our) agenda. permalink award report block reply\nPolander 2 points 5 days ago If they ended the filibuster senators like Murkowski and Collins and Graham would still vote against this stuff. Ending the filibuster is an awful idea. permalink award report block reply\nIm_RickSteves_bitch 2 points 5 days ago Make the no EBT thing permanent. But I have no real hope of this actually happening. permalink award report block reply\nBullet3250 2 points 5 days ago a side story... State of Michigan had a Republican FULL Trifecta in the State Capitol in 2014.  With that power they did actually very little except for making Michigan a Right to Work State - which was a big deal. Then - the Democrats somehow won their own FULL Trifecta to control the State in 2022 - they INSTANTLY PASSED ALL KINDS OF TOTAL SHIT - removed Right to  Work instantly - increased taxes - increased spending - removed Parental Rights - Made Abortion a basic religion - forced a ton of 'clean energy' requirements on utilities that 'drive up energy costs' - and virtually destroyed voting security. And people have been moving out of state ever since. Be careful what you wish for.  I would recommend just WINNING 60 REPUBLICAN SENATE SEATS.... so the Filibuster would not be important. permalink award report block reply\nfazaman 2 points 5 days ago But they don't want to do those things. They just want excuses as to why they can't so they can fund raise on the idea of actually doing them. permalink award report block reply\n480le 2 points 5 days ago They are all traitors permalink award report block reply\nChickensaurus 2 points 5 days ago Senators: \"Best we can do is stall until we lose 2026, then side with Dems to convict you and JD on your impeachments.\" permalink award report block reply KernalMustard 2 points 5 days ago He might as well cut his losses and resign. permalink parent award report block reply Chickensaurus 3 points 5 days ago Cross the Rubicon.... permalink parent award report block reply\nKernalMustard 2 points 5 days ago He might as well cut his losses and resign. permalink parent award report block reply Chickensaurus 3 points 5 days ago Cross the Rubicon.... permalink parent award report block reply\nChickensaurus 3 points 5 days ago Cross the Rubicon.... permalink parent award report block reply\nBeardholder 2 points 5 days ago All we want Mr president is hanging of traitors, the forceful removal of all Muslims and Hindus and to ban and outlaw socialism and communism, and ban rap music from public spaces , and then finally all voting must be done on paper ballots with i.d Do that and we will have a hundred years of prosperity permalink award report block reply\nScot 2 points 4 days ago All things the traitorous GOP doesn't want. permalink award report block reply\nswift_water 2 points 5 days ago Honestly, voter fraud doesn't even matter if everyone whos getting into office is full of fucking shit. We're fucked, aren't we? permalink award report block reply\nJerryNadlerBeltFund 2 points 5 days ago And they yawned and waited for their midterm shellacking! Bunch of wothless, self-dealing traitors. permalink award report block reply\nDeplorable_Yankee 2 points 5 days ago My friend at work tells me all the time to just put my trust and faith in Jesus, get my spiritual house in order, purify my soul and not worry about all of this. Everything that happens is gonna happen. A lot of you probably feel like me and think to yourself “how the heck did everything go sideways?” or you feel like you live in the twilight zone. I’m starting to think my friend is correct. permalink award report block reply zooty 1 points 5 days ago Is your friend a father? Cause sure as hell I don't want my kids to be deadbeats and dependent on me for the rest of their lives. I can't imagine God would feel that way either. permalink parent award report block reply\nzooty 1 points 5 days ago Is your friend a father? Cause sure as hell I don't want my kids to be deadbeats and dependent on me for the rest of their lives. I can't imagine God would feel that way either. permalink parent award report block reply\nACActual 2 points 5 days ago Trump should identify all Rinos fighting this then salt the ground around them permalink award report block reply\nIdontevenknow 2 points 5 days ago Uniparty nervousness intensifies. He knows they don't stand for the things they say they do, right? permalink award report block reply\ndogeshit 2 points 5 days ago Dems have been trying to do this for years. permalink award report block reply\nBBvarn 2 points 4 days ago Everyone in DC think they are smarter than DJT, but he is a billionaire president, and they are deep state simps. permalink award report block reply\nRoadpower 2 points 5 days ago I am not clairvoyant so I have no idea of how it is going to turn out but I feel like it is time to make a hard choice and to roll the dice. Getting bled out slowly is worse than a big collapse in my view. I'm tired of being a target of parasites, scammers, thieves and otherwise really awful people. All I ever wanted in my life time is for interests of the American people to actually be put first and our country secured against invasion by deeply hostile and contrary foreign cultures. I don't think that is a big ask. Can you do that president Trump? permalink award report block reply\nshadily0524 2 points 5 days ago The democrats have just given the republicans a lay up to nuke the filibuster, open the govt, fund SNAP, and pass single page 80/20 issue focused bills and fuck the democrats in the ass with. Come on you Massie faggots, NUKE IT permalink award report block reply Chango3 1 points 5 days ago This........ permalink parent award report block reply\nChango3 1 points 5 days ago This........ permalink parent award report block reply\nLight_HIV_Effect 2 points 5 days ago Not a fan of this, or the argument that democrats will do it anyway. They could have done it already multiple times under Obama and Biden. Let's say you did get rid of it. What are the chances you get Susan Collins, Murkowski, and another 2 rinos vote all that stuff down anyway? There's no chance any of these ideas passes unless it's rolled into reconciliation. Keep the government shut down and don't give an inch to democrats. Don't even promise to extend ACA subsidies. Tell them no. permalink award report block reply dataonly 2 points 5 days ago Better alternative-> https://patriots.win/p/1ARK55cGjJ/keep-the-senate-filibuster-in-pl/c permalink parent award report block reply Light_HIV_Effect 1 points 4 days ago If they had to actually keep speaking to avoid end of debate, I'd at least respect that. As it is, they just declare it and the media is all too happy to report republicans are to blame. permalink parent award report block reply\ndataonly 2 points 5 days ago Better alternative-> https://patriots.win/p/1ARK55cGjJ/keep-the-senate-filibuster-in-pl/c permalink parent award report block reply Light_HIV_Effect 1 points 4 days ago If they had to actually keep speaking to avoid end of debate, I'd at least respect that. As it is, they just declare it and the media is all too happy to report republicans are to blame. permalink parent award report block reply\nLight_HIV_Effect 1 points 4 days ago If they had to actually keep speaking to avoid end of debate, I'd at least respect that. As it is, they just declare it and the media is all too happy to report republicans are to blame. permalink parent award report block reply\nAmericanJawa 2 points 5 days ago OK but can we get those mass firings first? permalink award report block reply\njsphere256 2 points 5 days ago At the end of the day, either they support this agenda or they don't permalink award report block reply\ndtrap 2 points 5 days ago I just want proof of citizenship for state ID and presentation of (certified proof of citizenship) state ID at polls and paper ballots. Voter ID is way to close to eID for my tastes. permalink award report block reply\nPats5x 2 points 5 days ago GOP is in on it bro permalink award report block reply\nterribletwos 2 points 5 days ago Teach them how to win. Gather them together and come up with a strategy, because they're stuck inside their own box. They're just going to look at things the way it's been done or they ways they think they can win. Make it a team sport. permalink award report block reply\nElric44357 1 points 4 days ago No brain, no pain GOP RINOs. Abolish, accomplish your agenda, reinstate it. permalink award report block reply\nIliterallylovejv 1 points 5 days ago Don’t forget - end H1Bs and Student Visas. Let’s make Americans strong again. permalink award report block reply\nRealTXPatriot 1 points 5 days ago And then when you pass all that.... Then pass law creating the filibuster at 60 vote threshold not just a senate rule. Make it a law then. permalink award report block reply\nDoubleu1992 1 points 5 days ago wet dream permalink award report block reply\nPatriotGames 1 points 5 days ago Which is why it will not end. permalink award report block reply\nCalifunya 1 points 5 days ago RINOS “it’s too good for the American tax payer and doesn’t benefit deep state enough” permalink award report block reply\nAmway 1 points 5 days ago Most importantly, they can past laws that give the President the power to levy tariffs! permalink award report block reply\nSaxonRealm 1 points 4 days ago Abolish the filibuster. If Republicans won’t do that then abolish the Republican party. Time for a new American Party. Trump & Elon could fund. permalink award report block reply\ngezadreamsheets2 1 points 5 days ago GOP SUCKS! permalink award report block reply\nBramage 1 points 5 days ago Except they're all rinos....nothing would change. permalink award report block reply\nDenturesNancy 1 points 5 days ago I don't think the republicunts have it in them to go all in.  if you must rob a place, make it worth the price, take everything.  Pack scrotus, voter ID, Citizenship requirements, Mass deportations, Revoke all H1B visas and refugee status, Immediate new census, revoke all sanctuary places.  Make it worth the price so the dems cannot hold any majority rule for at least 1000 years permalink award report block reply\nMichalusmichalus 1 points 5 days ago We need line item veto back. permalink award report block reply\nBadstate 1 points 5 days ago \"but if we do that the Democrats will do what they were going to do anyway!\" permalink award report block reply\nMinneMAGA 1 points 5 days ago Yeah but the cuckservatives don’t want those things permalink award report block reply\nLib_Women_Have_HSV 1 points 5 days ago Then the democrats take over during midterms and pass unive re sal Healthcare, sanctuary country, social credit scores, pedophilia...and on and on permalink award report block reply Prandogolio 1 points 5 days ago They're gonna do that anyway faggot permalink parent award report block reply\nPrandogolio 1 points 5 days ago They're gonna do that anyway faggot permalink parent award report block reply\nShotgunParade69x 1 points 5 days ago We gotta do this and not worry what the dema may do in the future - we already know the answer to that!! If we do this tho, we have to go completely scorched earth. We will have the power to also impeach all the rogue liberal judges , right? permalink award report block reply\nAwakened 1 points 5 days ago He just gave them a bunch of reasons to not nuke it. They don't want these changes. We are boned if he is at thempoint of begging them to represent the people who pay their salary. permalink award report block reply\nAmerica_No_1 1 points 5 days ago If Obama ordered the dems to do something it would be done within the hour permalink award report block reply\norange_kek_great 1 points 5 days ago Lol. Ok buddy. permalink award report block reply\nRolandDelacroix 1 points 5 days ago If they nuke the filibuster it destroys their scam of always losing. permalink award report block reply\nMythArcana 1 points 5 days ago Even with the army of RINOs working for democrats? permalink award report block reply\nNanteen 1 points 5 days ago Like the senators actually want that. No senator wants anything to pass. They just want to talk about it until the day they decide to not run free election. permalink award report block reply\nNewGoldenAge 1 points 5 days ago Why not remove it and then reinstate it after 30 days? permalink award report block reply\ncovok48 1 points 5 days ago No way some of our elected cucks are going to vote in that agenda. THEN you gave the Democrats a means to nuke US when they steal 2028. permalink award report block reply\n3-10 1 points 5 days ago What about stopping immigration, ending H1B and requiring all non-citizens to return home within 3 years. Also, make Blackstone stop buying houses to rent. permalink award report block reply\nKungPaoMcChicken 1 points 5 days ago Filibuster prevents change. It causes nothing to result. A pointless state for a government to be in. And no other country would allow such faggotry. permalink award report block reply\nkeeman 1 points 5 days ago Ending the filibuster is one of Trump's stupidest ideas ever.  When Ds are in majority, the only thing stopping them from implementing complete communism in 2 years is the filibuster.  When Rs are in the minority they dither around and wait until the Ds are again in the majority.  Even talking about ending the filibuster is gonna result in more future communism, because the Ds will use this as an argument for ending it when THEY are back in charge. permalink award report block reply\nbluewhiteandred 1 points 5 days ago Another comment and question Can they nuke filibuster, do what they want, and pass some ban of filibuster? To prevent future retaliation and abuse? u/dataonly permalink award report block reply\nAraket 1 points 5 days ago Like they give a flying shit. I voted for Trump to, in the words of Obama, kick ass and take names. We were supposed to have a  DOJ that was elbows deep in investigating and prosecuting election fraud. We watched as the Dems stole seat after seat in 2024 with mail-in ballots and scam overseas ballots they \"counted\" for weeks and months after the election. The house isn't gonna do shit. If the people involved in the prior cases were arrested and prosecuted, we wouldn't need Congress in the first place, all the perps would be locked up, and any remaining would think twice about breaking the law. I voted for Trump to restore accountability, not beg and plead for help that will never come. permalink award report block reply\nChango3 1 points 5 days ago Remember, these people campaigned for career goals. They are not loyal to the majority of Americans that voted for Trump to do all this. Its about that time to have our meetings, in private, like our corrupt government does at every level to burn you. permalink award report block reply\nYheymos 1 points 5 days ago Do it! Fix the country! The Dems will hunt MAGA down if big changes aren't made. Stop those fuckers from rigging elections ever again. I was previously against the idea years ago, the whole 'when they are in power time time thing'... But when they are in power they are just going to do it anyway. So might as well do it first and get the advantage. permalink award report block reply\nbluewhiteandred 1 points 5 days ago whats the downside permalink award report block reply dataonly 2 points 5 days ago Huge downside.   There is a better way. I laid it all out here-> https://patriots.win/p/1ARK55cGjJ/keep-the-senate-filibuster-in-pl/c permalink parent award report block reply bluewhiteandred 1 points 5 days ago Thanks pede, but I guess we know the other side doesn't play by the rules so it seems like we shouldn't either? Legal way to get ahead on things? permalink parent award report block reply dataonly 3 points 5 days ago Legal way to get ahead on things? Don't think so.  It's a quick fix w/ catastrophic future consequences. I had posted this as a reply in another thread: Dems could have ended filibuster under Biden, but there were 2 of 51 that would not do so. Added:  So, it only 2 reasonable Senators, Manchin and Sinema, to keep the entire process from going off the rails.  That's a good thing. Filibuster is a valid and necessary Senate tool, that serves both parties and the American people well. It is a guard rail against extreme. W/o the filibuster Dems could have added PR and DC as a state and stacked SCOTUS. Filibuster is necssary. However, what they have now is virtual filibuster. All they have to do is declare it. Forcing them to follow the traditional filibuster rule (and hold the floor) is the answer. permalink parent award report block reply bluewhiteandred 1 points 5 days ago Yeah but isn't this like executive orders which are an abuse of the system as it was designed, yet Trump has been churning them out (following precendet of past presidents doing likewise?) permalink parent award report block reply\ndataonly 2 points 5 days ago Huge downside.   There is a better way. I laid it all out here-> https://patriots.win/p/1ARK55cGjJ/keep-the-senate-filibuster-in-pl/c permalink parent award report block reply bluewhiteandred 1 points 5 days ago Thanks pede, but I guess we know the other side doesn't play by the rules so it seems like we shouldn't either? Legal way to get ahead on things? permalink parent award report block reply dataonly 3 points 5 days ago Legal way to get ahead on things? Don't think so.  It's a quick fix w/ catastrophic future consequences. I had posted this as a reply in another thread: Dems could have ended filibuster under Biden, but there were 2 of 51 that would not do so. Added:  So, it only 2 reasonable Senators, Manchin and Sinema, to keep the entire process from going off the rails.  That's a good thing. Filibuster is a valid and necessary Senate tool, that serves both parties and the American people well. It is a guard rail against extreme. W/o the filibuster Dems could have added PR and DC as a state and stacked SCOTUS. Filibuster is necssary. However, what they have now is virtual filibuster. All they have to do is declare it. Forcing them to follow the traditional filibuster rule (and hold the floor) is the answer. permalink parent award report block reply bluewhiteandred 1 points 5 days ago Yeah but isn't this like executive orders which are an abuse of the system as it was designed, yet Trump has been churning them out (following precendet of past presidents doing likewise?) permalink parent award report block reply\nbluewhiteandred 1 points 5 days ago Thanks pede, but I guess we know the other side doesn't play by the rules so it seems like we shouldn't either? Legal way to get ahead on things? permalink parent award report block reply dataonly 3 points 5 days ago Legal way to get ahead on things? Don't think so.  It's a quick fix w/ catastrophic future consequences. I had posted this as a reply in another thread: Dems could have ended filibuster under Biden, but there were 2 of 51 that would not do so. Added:  So, it only 2 reasonable Senators, Manchin and Sinema, to keep the entire process from going off the rails.  That's a good thing. Filibuster is a valid and necessary Senate tool, that serves both parties and the American people well. It is a guard rail against extreme. W/o the filibuster Dems could have added PR and DC as a state and stacked SCOTUS. Filibuster is necssary. However, what they have now is virtual filibuster. All they have to do is declare it. Forcing them to follow the traditional filibuster rule (and hold the floor) is the answer. permalink parent award report block reply bluewhiteandred 1 points 5 days ago Yeah but isn't this like executive orders which are an abuse of the system as it was designed, yet Trump has been churning them out (following precendet of past presidents doing likewise?) permalink parent award report block reply\ndataonly 3 points 5 days ago Legal way to get ahead on things? Don't think so.  It's a quick fix w/ catastrophic future consequences. I had posted this as a reply in another thread: Dems could have ended filibuster under Biden, but there were 2 of 51 that would not do so. Added:  So, it only 2 reasonable Senators, Manchin and Sinema, to keep the entire process from going off the rails.  That's a good thing. Filibuster is a valid and necessary Senate tool, that serves both parties and the American people well. It is a guard rail against extreme. W/o the filibuster Dems could have added PR and DC as a state and stacked SCOTUS. Filibuster is necssary. However, what they have now is virtual filibuster. All they have to do is declare it. Forcing them to follow the traditional filibuster rule (and hold the floor) is the answer. permalink parent award report block reply bluewhiteandred 1 points 5 days ago Yeah but isn't this like executive orders which are an abuse of the system as it was designed, yet Trump has been churning them out (following precendet of past presidents doing likewise?) permalink parent award report block reply\nbluewhiteandred 1 points 5 days ago Yeah but isn't this like executive orders which are an abuse of the system as it was designed, yet Trump has been churning them out (following precendet of past presidents doing likewise?) permalink parent award report block reply\nFlyCatcher94 1 points 5 days ago That will guarantee they won’t do shit. permalink award report block reply\nShotgunParade69x 1 points 5 days ago Call your senate leaders and raise hell . permalink award report block reply\ngaijin_ronin 1 points 5 days ago Secure our gun rights plainly for retards to understand. permalink award report block reply\nAwakened 1 points 5 days ago When the democrats get power again, and they will, one of the first thing they will do is nuke the filibuster whether Trump does it now or not. permalink award report block reply Tmntnyc 2 points 5 days ago Why didn't they nuke it in 2021 when they had control over both hours and senate and Biden was in charge? Why would they nuke it now but not before? permalink parent award report block reply Build_Back_Bankrupt 1 points 5 days ago They didn't need to because the Biden maladministration was above the law.  Look at all the dereliction of duty he and his cronies participated in. They were too busy and empowered to break the laws rather than pass them. Nuking it back then would just expend political capital and would put cracks in their BS facade and I don't think people would stand for them nuking it and then passing obviously unconstitutional laws in order to benefit their criminality and corruption. permalink parent award report block reply Awakened 1 points 5 days ago Because they also like complaining about the other side while doing nothing about the status quo. But the new generation is coming up and there is enough of them now to strike. permalink parent award report block reply\nTmntnyc 2 points 5 days ago Why didn't they nuke it in 2021 when they had control over both hours and senate and Biden was in charge? Why would they nuke it now but not before? permalink parent award report block reply Build_Back_Bankrupt 1 points 5 days ago They didn't need to because the Biden maladministration was above the law.  Look at all the dereliction of duty he and his cronies participated in. They were too busy and empowered to break the laws rather than pass them. Nuking it back then would just expend political capital and would put cracks in their BS facade and I don't think people would stand for them nuking it and then passing obviously unconstitutional laws in order to benefit their criminality and corruption. permalink parent award report block reply Awakened 1 points 5 days ago Because they also like complaining about the other side while doing nothing about the status quo. But the new generation is coming up and there is enough of them now to strike. permalink parent award report block reply\nBuild_Back_Bankrupt 1 points 5 days ago They didn't need to because the Biden maladministration was above the law.  Look at all the dereliction of duty he and his cronies participated in. They were too busy and empowered to break the laws rather than pass them. Nuking it back then would just expend political capital and would put cracks in their BS facade and I don't think people would stand for them nuking it and then passing obviously unconstitutional laws in order to benefit their criminality and corruption. permalink parent award report block reply\nAwakened 1 points 5 days ago Because they also like complaining about the other side while doing nothing about the status quo. But the new generation is coming up and there is enough of them now to strike. permalink parent award report block reply\nparttimefed 1 points 5 days ago He just laid out all the reasons they are not going to do it. permalink award report block reply\n2016TrumpMAGA 1 points 5 days ago We need primary challengers in 2026 and beyond for all senators who do not support ending the filibuster. permalink award report block reply\nzooty 1 points 5 days ago Sorry, didn't see \"pad our coffers\" in there. permalink award report block reply\nJoeBidensDementia1 1 points 5 days ago They don't want to win. permalink award report block reply\nPhantomShield72 1 points 5 days ago They are even more exposed as complicit now... What will they do? And what is Trump willing to do if they refuse to act in the interest of The Republic? Will we be left out to dry? Somehow, I don't think so. Of course, I could just be hoping against the evidence... permalink award report block reply\nNonbinaryPotatohead 1 points 5 days ago Where's get rid of the NFA, IRS and Fed Reserve in that? permalink award report block reply\nWupta PRO 1 points 5 days ago They won’t do it. permalink award report block reply\nthe_new_one 1 points 5 days ago Comment removed upon the user being banned. permalink award report block reply\nTheDarkEmperor 1 points 5 days ago Comment removed by community moderators. permalink award report block reply\nnew_guy2 1 points 5 days ago Comment removed by community moderators. permalink award report block reply"}