{"id": "1ARK9nPdSa", "contents": "7 Turkey military plane crash. They are planning to take over Gaza from Israel (www.yahoo.com) posted 5 hours ago by Thereisnogodbutgoat 4 comments award share report block 20 Confirmed Dead as Military Cargo Plane Crashes to the Ground After Going into a Tailspin Turkey's defence ministry has said the crash happened near the Azerbaijan-Georgia border www.yahoo.com\n4 comments Sort by Top Top New Worst Old Save FrenFinder 1 points 4 hours ago Israel are very buddy buddy with Turk-roaches, Syria's terrorist in chief, and rely on Azerbaijan for gas. The propaganda that Israel is protecting the west (and the world) from Muslims is a load of shit. permalink award report block reply VanDeKoik 1 points 5 hours ago You know we also have plabes crash too....right? permalink award report block reply Thereisnogodbutgoat OP 1 points 5 hours ago Usually when hijacked by camel piss drinking terrorists permalink parent award report block reply VanDeKoik 0 points 5 hours ago 9-11 was 25 years ago, dude. permalink parent award report block reply\nFrenFinder 1 points 4 hours ago Israel are very buddy buddy with Turk-roaches, Syria's terrorist in chief, and rely on Azerbaijan for gas. The propaganda that Israel is protecting the west (and the world) from Muslims is a load of shit. permalink award report block reply\nVanDeKoik 1 points 5 hours ago You know we also have plabes crash too....right? permalink award report block reply Thereisnogodbutgoat OP 1 points 5 hours ago Usually when hijacked by camel piss drinking terrorists permalink parent award report block reply VanDeKoik 0 points 5 hours ago 9-11 was 25 years ago, dude. permalink parent award report block reply\nThereisnogodbutgoat OP 1 points 5 hours ago Usually when hijacked by camel piss drinking terrorists permalink parent award report block reply VanDeKoik 0 points 5 hours ago 9-11 was 25 years ago, dude. permalink parent award report block reply\nVanDeKoik 0 points 5 hours ago 9-11 was 25 years ago, dude. permalink parent award report block reply"}