{"id": "1ARK56kO4A", "contents": "896 🗡️ Horror in the UK: Woman stabbed in the NECK in random attack in Birmingham... 🛁🩸   BLOODBATH   🩸🛁 posted 5 days ago by TheRedPilledArtist 119 comments award share download report block\n119 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Saxonlady 78 points 5 days ago \"Birmingham\". That'll teach her to go out at night without a burka and a chaperone. /s permalink award report block reply TrumpForPresident 18 points 5 days ago It's sad that you have to add /s at the end, but that's the time we live in. permalink parent award report block reply deleted 8 points 4 days ago NomadicKrow2 3 points 4 days ago While that might not be the case, I'd love to spread that around. Do some peaceful looking background, throw up some vague religious sounding text, cite some random part of the Quran, boom. permalink parent award report block reply QSWO1 4 points 4 days ago It's sad that it happened. permalink parent award report block reply vote_for_MAGA_2020 12 points 4 days ago Something something \"British man\" permalink parent award report block reply bigdickhangsright 9 points 4 days ago Name: Muhammad Muhammad permalink parent award report block reply TrueTemper2 5 points 4 days ago I hope ultimately she is grateful for having been culturally enriched.  Maybe now she has a better appreciation for diversity.\nPerhaps she has even surrendered her flat to those more deserving of it. permalink parent award report block reply NZbacon 5 points 4 days ago Chain mail burka. permalink parent award report block reply Fingerbang 3 points 4 days ago Yes but the curry options are limitless permalink parent award report block reply load 4 more comments... corporateshizer 55 points 5 days ago It's not a \"random\" attack when all theseattacks come from blacks and browns, and all the victims are white. And the blacks and browns were specifically brought to the white countries for this purpose. And the people who brought these monsters into white lands are not random either. They have literally been doing these subversion and invasion campaigns for thousands of years. permalink award report block reply 10MeV 8 points 4 days ago I noticed you didn’t identify who “those people” are. permalink parent award report block reply CheeseAndOnion 7 points 4 days ago Oy vey its the Swedish. Right Hershel the Swedish it is. permalink parent award report block reply corporateshizer 1 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply friarfox 40 points 5 days ago Seems to be a trend in the West. Stab the white girl. You know the one dumb enough to vote in diversity. permalink award report block reply XxxRDTPRNxxX 26 points 5 days ago \"But it wasn't cause she was white!\" \"It's because he was crazy!\" \"Race has nothing to do with anything....\" (unless blacks can benefit) permalink parent award report block reply NotTheCIADonotWorry 5 points 5 days ago That's alot of words to say reeeeeee stop noticing patterns you racist permalink parent award report block reply stars -17 points 4 days ago We have literally no information on the race of either side of this stabbing. permalink parent award report block reply ModernKnight 20 points 4 days ago Did they call out the stabber as a white man?  Are they talking about the horrid rise of racism against minorities?  Then we know the stabber wasn't white, and the victim was. permalink parent award report block reply Filo76 3 points 4 days ago Variant of Coulters Law, applied to Europe. Could be black. Could be brown. Almost always muslim. permalink parent award report block reply LiteraIIyHitIer 11 points 4 days ago Too right! I'm certain that this was a white British dude in a suit stabbing a black chick. permalink parent award report block reply stars -17 points 4 days ago There have been 2 recent cases of White men raping non White women - https://www.dailymail.co.uk/news/article-15229101/manhunt-woman-20s-raped-stranger-racially-aggravated-attack.html The Liverpool car ramming incident which users here smugly asserted was an Islamic terror attack turned out to have been done by a middle class White man. Stop being a fucking retard by pretending our race doesn't have degenerate elements. I'm not a shitlib and love my race but the smug ignorance on this site is intolerable. permalink parent award report block reply LiteraIIyHitIer 11 points 4 days ago Oh, just fucking stop. You know full well this was most likely a Muzzie invader on a British woman and those ads they're running that show white guys attacking black chicks as being the problem are gaslighting in the extreme. Just like your stupid post up there. permalink parent award report block reply view 4 more comments... MastaJoda 6 points 4 days ago ☝Lefty dumb cunt who voted for all of this $100 permalink parent award report block reply view 1 more comments... Prandogolio 5 points 4 days ago Congratulations faggot, you found a couple exceptions to the rule.  You're pretending like you don't know how generalizations work.  Nobody needs your lectures. permalink parent award report block reply view 6 more comments... 4886Battery 2 points 4 days ago Oh, TWO cases (though you show one and we're assuming he's not a light skin somethingorother), so there you go, you've convinced me that White (European) male rape against non-Whites is an actual problem and not just an anomaly, literally statistically 0%, a unicorn. 2 : 76,668 Quite the ratio.  Oh, and the majority of minority on White rape goes unreported and is repeated many times, so even when reported it counts as \"1\" even though the child was as raped five times a day for years. permalink parent award report block reply Liberate_Acquire 2 points 4 days ago UsA = smug ignorance. So why you expecting different bub permalink parent award report block reply view 2 more comments... load 3 more comments... vote_for_MAGA_2020 4 points 4 days ago We don't know, but we know permalink parent award report block reply MastaJoda 3 points 4 days ago Colture Rule... permalink parent award report block reply justinkayz 3 points 4 days ago Coulter permalink parent award report block reply stars -1 points 4 days ago Proven wrong many times. permalink parent award report block reply phro 1 points 4 days ago Would you like to place a wager? permalink parent award report block reply load 1 more comments... brainphreeze 23 points 5 days ago Birmingham is a Muslim stronghold permalink award report block reply airborne3502 11 points 5 days ago NYC will be one soon. permalink parent award report block reply Prandogolio 1 points 4 days ago Is there anywhere over there that's not? permalink parent award report block reply Combat_Hamster 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply Albo22 19 points 5 days ago When you invite 3rd world trash these are the results permalink award report block reply Combat_Hamster 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply RememberCharlieKirk 13 points 5 days ago \"The stabbings will continue until morale improves.\" - UK government permalink award report block reply lifeisahologram 9 points 4 days ago “Random” sure, Jan A muslim attacking a non muslim is as random as Nancy pelosi stock picks doing well permalink award report block reply TrumpAndGodWin 2 points 4 days ago Dan Crenshaw's picks too but he's rarely mentioned. permalink parent award report block reply lifeisahologram 1 points 4 days ago That’s because he is hated for being even gayer and worse than Nancy Pelosi. permalink parent award report block reply Gildoom 7 points 4 days ago Queue the news media silhouette of a white boy band haircut from the 90s and his name withheld till trial. Then at trial we find out it is Mohammad Bin Stabbin permalink award report block reply CommanderOfCheese 9 points 4 days ago Cue. Cue means to signal the next thing. Queue is a line. permalink parent award report block reply Gildoom 1 points 4 days ago Sorry my bad permalink parent award report block reply MickHigan2 7 points 5 days ago It's too dangerous to be White and going out on the town at night. Your chances of survival are far greater if you avoid the bar scene. permalink award report block reply Spicy_cat 3 points 4 days ago Avoid the groid permalink parent award report block reply YaharaRiver 2 points 4 days ago why?  Is that where all the muslims are, at the bar?? 🙄 permalink parent award report block reply slimcoat 6 points 4 days ago Authorities have urged witnesses to come forward So that they can be arrested for hate speech. permalink award report block reply DeepStateParasite 3 points 4 days ago Got to make an example of witnesses - it helps stop the noticing! permalink parent award report block reply kornesque 6 points 5 days ago Horror? This is normalcy now. permalink award report block reply YaharaRiver 1 points 4 days ago It will never NOT be horror. permalink parent award report block reply iirc_life 6 points 5 days ago \"a man\" permalink award report block reply hecubus 4 points 4 days ago \"Random\" permalink award report block reply cosmos411 4 points 4 days ago The person may have been randomly chosen, but the crime was planned. This was also not \"unprovoked\". The provocation was that she's not a muzslime. permalink award report block reply HenkZeilstra 4 points 4 days ago And yet the muslim mayor gers away unscathed permalink award report block reply progressives4Trump 3 points 4 days ago Getting real tired of watching murders. permalink award report block reply hnoble444 3 points 4 days ago \"man in his twenties\" \"Manchester man\" \"Maryland Man\" \"Teens\".....we all know what's up. permalink award report block reply Counterwhat 3 points 4 days ago \"Unprovoked attack\".......you mean that's different from just minding your own business and trying to go about your day. permalink award report block reply IlhansBrother 3 points 5 days ago UK police probably too busy attending a pride event or investigated the suspect and let him go for fear of being racist? permalink award report block reply vote_for_MAGA_2020 4 points 4 days ago Nooooooo more likely someone posted something offensive on social media and they need to get that addressed. permalink parent award report block reply tt777 3 points 4 days ago I'm just amazed the UK police arrested the person. permalink parent award report block reply DontTreadOnSnek 3 points 4 days ago They \"arrested\" him to protect him from pissed off White UK citizens. permalink parent award report block reply CheeseAndOnion 3 points 4 days ago There are social media posts that have causes distress to attend to. Arrests have to be made. permalink parent award report block reply DeepStateParasite 2 points 4 days ago \"We couldn't respond at that time - the genderqueer pride stripe paint on our cars hadn't dried yet!\" permalink parent award report block reply emorphia 2 points 4 days ago nothing to see here and it was for sure not an islamist....  same story everytime.\nit was a UK resident (same tactic as the dems, calling them residents and not citizens) permalink award report block reply Nanteen 2 points 4 days ago He had a stabbing emergency and had to do it, he doesn't understand in his home country. This was perfectly fine permalink award report block reply TrumpAndGodWin 1 points 4 days ago \"His IQ is too low to stand trial and he'll be released immediately.\" permalink parent award report block reply Calumet57 2 points 4 days ago UK police busy elsewhere. permalink award report block reply MastaJoda 3 points 4 days ago Running down terrorists who complain about their daughters being gang raped and murdered online, no doubt. permalink parent award report block reply Secondrun007 2 points 4 days ago White guy?   Oh… permalink award report block reply JimRaynor 2 points 4 days ago Genocide is always an option if murderorus terrorist rapist parasite barbarians don't want to return to their shitholes. permalink award report block reply SBOJ_JOBS 2 points 4 days ago Why would a knife do this? We may never know. --- BBC, probably permalink award report block reply TrumpYouMagaFrenner 2 points 5 days ago Did she blow her whistle? permalink award report block reply CheeseAndOnion 4 points 4 days ago She forgot to say “STOP” in a loud but stern voice as recommended by the metropolitan cucks err cops permalink parent award report block reply DudeNoOne 2 points 4 days ago Please describe this… Man permalink award report block reply panic_scam 2 points 4 days ago Lemme guess… brown permalink award report block reply Prandogolio 2 points 4 days ago \"Authorities are asking witnesses to come forward, but they won't be releasing images of the attacker because it might give fuel to the far right white supremacists\" permalink award report block reply f_bastiat 1 points 4 days ago Part and parcel permalink award report block reply thisisatestof2 1 points 4 days ago One of those Amish, right? /s permalink award report block reply canada_is_communist 1 points 4 days ago She vited for it permalink award report block reply spezisacuckold 1 points 4 days ago \"Part and parcel.\" On its way to NYC. permalink award report block reply Litecola2 1 points 4 days ago Chyron underneath bookends the report nicely: \"...confirms Algerian sex offender Brain Kaddour-something has been arrested...\" permalink award report block reply Tellmeboutit2 1 points 4 days ago \" a man in his 20s\" = imported Briton. permalink award report block reply mailinvoter 1 points 4 days ago We need to stand up and fix things before this comes to the States ...... Oh, wait. permalink award report block reply CheeseAndOnion 1 points 4 days ago England is not a safe place for the english and whites in general. Perhaps they should look into moving to somewhere with less moslems and darkies. permalink award report block reply Combat_Hamster 4 points 4 days ago Perhaps they should unite and take their country back instead. permalink parent award report block reply Iremembermypassword 4 points 4 days ago Or arm themselves, organize and fight back. permalink parent award report block reply 2016TrumpMAGA 1 points 4 days ago Yeah, totally random. permalink award report block reply DJT4MoreYears 1 points 4 days ago None of this is \"random.\" The UK asshole \"leaders\" that let these low IQ in-bred 2nd century goat-fuckers in the country planned all of this. They're the ones that need to be forcefully removed if the UK has any chance of saving itself. permalink award report block reply MAGALADON9 1 points 4 days ago Part n Parcel innit. Keep votin labour ya socialist twats. You lot care more bout ya black n brown footballers than ya do your bloody country being invaded. Shame on all of you. permalink award report block reply bantar 1 points 4 days ago Ricky Gervais needs to start marketing a Turtle Neck Stab Vest in addition to the base model. permalink award report block reply Harvestsmiles 1 points 4 days ago If the random attacks happen weekly and are perpetrated by people of color and always against white women, are they really random? 🤔 permalink award report block reply AcAirman 1 points 4 days ago Irina? permalink award report block reply knnbccb 0 points 4 days ago Stay away from the Midlands in the UK. permalink award report block reply AlmostFullyDilated 1 points 4 days ago Comment removed by community moderators. permalink award report block reply HoodooOperator 1 points 4 days ago Comment removed by community moderators. permalink award report block reply Muttsbitetoo 0 points 4 days ago Comment removed by community moderators. permalink award report block reply\nSaxonlady 78 points 5 days ago \"Birmingham\". That'll teach her to go out at night without a burka and a chaperone. /s permalink award report block reply TrumpForPresident 18 points 5 days ago It's sad that you have to add /s at the end, but that's the time we live in. permalink parent award report block reply deleted 8 points 4 days ago NomadicKrow2 3 points 4 days ago While that might not be the case, I'd love to spread that around. Do some peaceful looking background, throw up some vague religious sounding text, cite some random part of the Quran, boom. permalink parent award report block reply QSWO1 4 points 4 days ago It's sad that it happened. permalink parent award report block reply vote_for_MAGA_2020 12 points 4 days ago Something something \"British man\" permalink parent award report block reply bigdickhangsright 9 points 4 days ago Name: Muhammad Muhammad permalink parent award report block reply TrueTemper2 5 points 4 days ago I hope ultimately she is grateful for having been culturally enriched.  Maybe now she has a better appreciation for diversity.\nPerhaps she has even surrendered her flat to those more deserving of it. permalink parent award report block reply NZbacon 5 points 4 days ago Chain mail burka. permalink parent award report block reply Fingerbang 3 points 4 days ago Yes but the curry options are limitless permalink parent award report block reply load 4 more comments...\nTrumpForPresident 18 points 5 days ago It's sad that you have to add /s at the end, but that's the time we live in. permalink parent award report block reply deleted 8 points 4 days ago NomadicKrow2 3 points 4 days ago While that might not be the case, I'd love to spread that around. Do some peaceful looking background, throw up some vague religious sounding text, cite some random part of the Quran, boom. permalink parent award report block reply QSWO1 4 points 4 days ago It's sad that it happened. permalink parent award report block reply\ndeleted 8 points 4 days ago NomadicKrow2 3 points 4 days ago While that might not be the case, I'd love to spread that around. Do some peaceful looking background, throw up some vague religious sounding text, cite some random part of the Quran, boom. permalink parent award report block reply\nNomadicKrow2 3 points 4 days ago While that might not be the case, I'd love to spread that around. Do some peaceful looking background, throw up some vague religious sounding text, cite some random part of the Quran, boom. permalink parent award report block reply\nQSWO1 4 points 4 days ago It's sad that it happened. permalink parent award report block reply\nvote_for_MAGA_2020 12 points 4 days ago Something something \"British man\" permalink parent award report block reply bigdickhangsright 9 points 4 days ago Name: Muhammad Muhammad permalink parent award report block reply\nbigdickhangsright 9 points 4 days ago Name: Muhammad Muhammad permalink parent award report block reply\nTrueTemper2 5 points 4 days ago I hope ultimately she is grateful for having been culturally enriched.  Maybe now she has a better appreciation for diversity.\nPerhaps she has even surrendered her flat to those more deserving of it. permalink parent award report block reply\nNZbacon 5 points 4 days ago Chain mail burka. permalink parent award report block reply\nFingerbang 3 points 4 days ago Yes but the curry options are limitless permalink parent award report block reply\ncorporateshizer 55 points 5 days ago It's not a \"random\" attack when all theseattacks come from blacks and browns, and all the victims are white. And the blacks and browns were specifically brought to the white countries for this purpose. And the people who brought these monsters into white lands are not random either. They have literally been doing these subversion and invasion campaigns for thousands of years. permalink award report block reply 10MeV 8 points 4 days ago I noticed you didn’t identify who “those people” are. permalink parent award report block reply CheeseAndOnion 7 points 4 days ago Oy vey its the Swedish. Right Hershel the Swedish it is. permalink parent award report block reply corporateshizer 1 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\n10MeV 8 points 4 days ago I noticed you didn’t identify who “those people” are. permalink parent award report block reply CheeseAndOnion 7 points 4 days ago Oy vey its the Swedish. Right Hershel the Swedish it is. permalink parent award report block reply corporateshizer 1 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nCheeseAndOnion 7 points 4 days ago Oy vey its the Swedish. Right Hershel the Swedish it is. permalink parent award report block reply\ncorporateshizer 1 points 4 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nfriarfox 40 points 5 days ago Seems to be a trend in the West. Stab the white girl. You know the one dumb enough to vote in diversity. permalink award report block reply XxxRDTPRNxxX 26 points 5 days ago \"But it wasn't cause she was white!\" \"It's because he was crazy!\" \"Race has nothing to do with anything....\" (unless blacks can benefit) permalink parent award report block reply NotTheCIADonotWorry 5 points 5 days ago That's alot of words to say reeeeeee stop noticing patterns you racist permalink parent award report block reply stars -17 points 4 days ago We have literally no information on the race of either side of this stabbing. permalink parent award report block reply ModernKnight 20 points 4 days ago Did they call out the stabber as a white man?  Are they talking about the horrid rise of racism against minorities?  Then we know the stabber wasn't white, and the victim was. permalink parent award report block reply Filo76 3 points 4 days ago Variant of Coulters Law, applied to Europe. Could be black. Could be brown. Almost always muslim. permalink parent award report block reply LiteraIIyHitIer 11 points 4 days ago Too right! I'm certain that this was a white British dude in a suit stabbing a black chick. permalink parent award report block reply stars -17 points 4 days ago There have been 2 recent cases of White men raping non White women - https://www.dailymail.co.uk/news/article-15229101/manhunt-woman-20s-raped-stranger-racially-aggravated-attack.html The Liverpool car ramming incident which users here smugly asserted was an Islamic terror attack turned out to have been done by a middle class White man. Stop being a fucking retard by pretending our race doesn't have degenerate elements. I'm not a shitlib and love my race but the smug ignorance on this site is intolerable. permalink parent award report block reply LiteraIIyHitIer 11 points 4 days ago Oh, just fucking stop. You know full well this was most likely a Muzzie invader on a British woman and those ads they're running that show white guys attacking black chicks as being the problem are gaslighting in the extreme. Just like your stupid post up there. permalink parent award report block reply view 4 more comments... MastaJoda 6 points 4 days ago ☝Lefty dumb cunt who voted for all of this $100 permalink parent award report block reply view 1 more comments... Prandogolio 5 points 4 days ago Congratulations faggot, you found a couple exceptions to the rule.  You're pretending like you don't know how generalizations work.  Nobody needs your lectures. permalink parent award report block reply view 6 more comments... 4886Battery 2 points 4 days ago Oh, TWO cases (though you show one and we're assuming he's not a light skin somethingorother), so there you go, you've convinced me that White (European) male rape against non-Whites is an actual problem and not just an anomaly, literally statistically 0%, a unicorn. 2 : 76,668 Quite the ratio.  Oh, and the majority of minority on White rape goes unreported and is repeated many times, so even when reported it counts as \"1\" even though the child was as raped five times a day for years. permalink parent award report block reply Liberate_Acquire 2 points 4 days ago UsA = smug ignorance. So why you expecting different bub permalink parent award report block reply view 2 more comments... load 3 more comments... vote_for_MAGA_2020 4 points 4 days ago We don't know, but we know permalink parent award report block reply MastaJoda 3 points 4 days ago Colture Rule... permalink parent award report block reply justinkayz 3 points 4 days ago Coulter permalink parent award report block reply stars -1 points 4 days ago Proven wrong many times. permalink parent award report block reply phro 1 points 4 days ago Would you like to place a wager? permalink parent award report block reply load 1 more comments...\nXxxRDTPRNxxX 26 points 5 days ago \"But it wasn't cause she was white!\" \"It's because he was crazy!\" \"Race has nothing to do with anything....\" (unless blacks can benefit) permalink parent award report block reply NotTheCIADonotWorry 5 points 5 days ago That's alot of words to say reeeeeee stop noticing patterns you racist permalink parent award report block reply\nNotTheCIADonotWorry 5 points 5 days ago That's alot of words to say reeeeeee stop noticing patterns you racist permalink parent award report block reply\nstars -17 points 4 days ago We have literally no information on the race of either side of this stabbing. permalink parent award report block reply ModernKnight 20 points 4 days ago Did they call out the stabber as a white man?  Are they talking about the horrid rise of racism against minorities?  Then we know the stabber wasn't white, and the victim was. permalink parent award report block reply Filo76 3 points 4 days ago Variant of Coulters Law, applied to Europe. Could be black. Could be brown. Almost always muslim. permalink parent award report block reply LiteraIIyHitIer 11 points 4 days ago Too right! I'm certain that this was a white British dude in a suit stabbing a black chick. permalink parent award report block reply stars -17 points 4 days ago There have been 2 recent cases of White men raping non White women - https://www.dailymail.co.uk/news/article-15229101/manhunt-woman-20s-raped-stranger-racially-aggravated-attack.html The Liverpool car ramming incident which users here smugly asserted was an Islamic terror attack turned out to have been done by a middle class White man. Stop being a fucking retard by pretending our race doesn't have degenerate elements. I'm not a shitlib and love my race but the smug ignorance on this site is intolerable. permalink parent award report block reply LiteraIIyHitIer 11 points 4 days ago Oh, just fucking stop. You know full well this was most likely a Muzzie invader on a British woman and those ads they're running that show white guys attacking black chicks as being the problem are gaslighting in the extreme. Just like your stupid post up there. permalink parent award report block reply view 4 more comments... MastaJoda 6 points 4 days ago ☝Lefty dumb cunt who voted for all of this $100 permalink parent award report block reply view 1 more comments... Prandogolio 5 points 4 days ago Congratulations faggot, you found a couple exceptions to the rule.  You're pretending like you don't know how generalizations work.  Nobody needs your lectures. permalink parent award report block reply view 6 more comments... 4886Battery 2 points 4 days ago Oh, TWO cases (though you show one and we're assuming he's not a light skin somethingorother), so there you go, you've convinced me that White (European) male rape against non-Whites is an actual problem and not just an anomaly, literally statistically 0%, a unicorn. 2 : 76,668 Quite the ratio.  Oh, and the majority of minority on White rape goes unreported and is repeated many times, so even when reported it counts as \"1\" even though the child was as raped five times a day for years. permalink parent award report block reply Liberate_Acquire 2 points 4 days ago UsA = smug ignorance. So why you expecting different bub permalink parent award report block reply view 2 more comments... load 3 more comments... vote_for_MAGA_2020 4 points 4 days ago We don't know, but we know permalink parent award report block reply MastaJoda 3 points 4 days ago Colture Rule... permalink parent award report block reply justinkayz 3 points 4 days ago Coulter permalink parent award report block reply stars -1 points 4 days ago Proven wrong many times. permalink parent award report block reply phro 1 points 4 days ago Would you like to place a wager? permalink parent award report block reply load 1 more comments...\nModernKnight 20 points 4 days ago Did they call out the stabber as a white man?  Are they talking about the horrid rise of racism against minorities?  Then we know the stabber wasn't white, and the victim was. permalink parent award report block reply Filo76 3 points 4 days ago Variant of Coulters Law, applied to Europe. Could be black. Could be brown. Almost always muslim. permalink parent award report block reply\nFilo76 3 points 4 days ago Variant of Coulters Law, applied to Europe. Could be black. Could be brown. Almost always muslim. permalink parent award report block reply\nLiteraIIyHitIer 11 points 4 days ago Too right! I'm certain that this was a white British dude in a suit stabbing a black chick. permalink parent award report block reply stars -17 points 4 days ago There have been 2 recent cases of White men raping non White women - https://www.dailymail.co.uk/news/article-15229101/manhunt-woman-20s-raped-stranger-racially-aggravated-attack.html The Liverpool car ramming incident which users here smugly asserted was an Islamic terror attack turned out to have been done by a middle class White man. Stop being a fucking retard by pretending our race doesn't have degenerate elements. I'm not a shitlib and love my race but the smug ignorance on this site is intolerable. permalink parent award report block reply LiteraIIyHitIer 11 points 4 days ago Oh, just fucking stop. You know full well this was most likely a Muzzie invader on a British woman and those ads they're running that show white guys attacking black chicks as being the problem are gaslighting in the extreme. Just like your stupid post up there. permalink parent award report block reply view 4 more comments... MastaJoda 6 points 4 days ago ☝Lefty dumb cunt who voted for all of this $100 permalink parent award report block reply view 1 more comments... Prandogolio 5 points 4 days ago Congratulations faggot, you found a couple exceptions to the rule.  You're pretending like you don't know how generalizations work.  Nobody needs your lectures. permalink parent award report block reply view 6 more comments... 4886Battery 2 points 4 days ago Oh, TWO cases (though you show one and we're assuming he's not a light skin somethingorother), so there you go, you've convinced me that White (European) male rape against non-Whites is an actual problem and not just an anomaly, literally statistically 0%, a unicorn. 2 : 76,668 Quite the ratio.  Oh, and the majority of minority on White rape goes unreported and is repeated many times, so even when reported it counts as \"1\" even though the child was as raped five times a day for years. permalink parent award report block reply Liberate_Acquire 2 points 4 days ago UsA = smug ignorance. So why you expecting different bub permalink parent award report block reply view 2 more comments... load 3 more comments...\nstars -17 points 4 days ago There have been 2 recent cases of White men raping non White women - https://www.dailymail.co.uk/news/article-15229101/manhunt-woman-20s-raped-stranger-racially-aggravated-attack.html The Liverpool car ramming incident which users here smugly asserted was an Islamic terror attack turned out to have been done by a middle class White man. Stop being a fucking retard by pretending our race doesn't have degenerate elements. I'm not a shitlib and love my race but the smug ignorance on this site is intolerable. permalink parent award report block reply LiteraIIyHitIer 11 points 4 days ago Oh, just fucking stop. You know full well this was most likely a Muzzie invader on a British woman and those ads they're running that show white guys attacking black chicks as being the problem are gaslighting in the extreme. Just like your stupid post up there. permalink parent award report block reply view 4 more comments... MastaJoda 6 points 4 days ago ☝Lefty dumb cunt who voted for all of this $100 permalink parent award report block reply view 1 more comments... Prandogolio 5 points 4 days ago Congratulations faggot, you found a couple exceptions to the rule.  You're pretending like you don't know how generalizations work.  Nobody needs your lectures. permalink parent award report block reply view 6 more comments... 4886Battery 2 points 4 days ago Oh, TWO cases (though you show one and we're assuming he's not a light skin somethingorother), so there you go, you've convinced me that White (European) male rape against non-Whites is an actual problem and not just an anomaly, literally statistically 0%, a unicorn. 2 : 76,668 Quite the ratio.  Oh, and the majority of minority on White rape goes unreported and is repeated many times, so even when reported it counts as \"1\" even though the child was as raped five times a day for years. permalink parent award report block reply Liberate_Acquire 2 points 4 days ago UsA = smug ignorance. So why you expecting different bub permalink parent award report block reply view 2 more comments... load 3 more comments...\nLiteraIIyHitIer 11 points 4 days ago Oh, just fucking stop. You know full well this was most likely a Muzzie invader on a British woman and those ads they're running that show white guys attacking black chicks as being the problem are gaslighting in the extreme. Just like your stupid post up there. permalink parent award report block reply view 4 more comments...\nMastaJoda 6 points 4 days ago ☝Lefty dumb cunt who voted for all of this $100 permalink parent award report block reply view 1 more comments...\nPrandogolio 5 points 4 days ago Congratulations faggot, you found a couple exceptions to the rule.  You're pretending like you don't know how generalizations work.  Nobody needs your lectures. permalink parent award report block reply view 6 more comments...\n4886Battery 2 points 4 days ago Oh, TWO cases (though you show one and we're assuming he's not a light skin somethingorother), so there you go, you've convinced me that White (European) male rape against non-Whites is an actual problem and not just an anomaly, literally statistically 0%, a unicorn. 2 : 76,668 Quite the ratio.  Oh, and the majority of minority on White rape goes unreported and is repeated many times, so even when reported it counts as \"1\" even though the child was as raped five times a day for years. permalink parent award report block reply\nLiberate_Acquire 2 points 4 days ago UsA = smug ignorance. So why you expecting different bub permalink parent award report block reply view 2 more comments...\nvote_for_MAGA_2020 4 points 4 days ago We don't know, but we know permalink parent award report block reply\nMastaJoda 3 points 4 days ago Colture Rule... permalink parent award report block reply justinkayz 3 points 4 days ago Coulter permalink parent award report block reply stars -1 points 4 days ago Proven wrong many times. permalink parent award report block reply\njustinkayz 3 points 4 days ago Coulter permalink parent award report block reply\nstars -1 points 4 days ago Proven wrong many times. permalink parent award report block reply\nphro 1 points 4 days ago Would you like to place a wager? permalink parent award report block reply\nbrainphreeze 23 points 5 days ago Birmingham is a Muslim stronghold permalink award report block reply airborne3502 11 points 5 days ago NYC will be one soon. permalink parent award report block reply Prandogolio 1 points 4 days ago Is there anywhere over there that's not? permalink parent award report block reply Combat_Hamster 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply\nairborne3502 11 points 5 days ago NYC will be one soon. permalink parent award report block reply\nPrandogolio 1 points 4 days ago Is there anywhere over there that's not? permalink parent award report block reply\nCombat_Hamster 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply\nAlbo22 19 points 5 days ago When you invite 3rd world trash these are the results permalink award report block reply Combat_Hamster 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply\nCombat_Hamster 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply\nRememberCharlieKirk 13 points 5 days ago \"The stabbings will continue until morale improves.\" - UK government permalink award report block reply\nlifeisahologram 9 points 4 days ago “Random” sure, Jan A muslim attacking a non muslim is as random as Nancy pelosi stock picks doing well permalink award report block reply TrumpAndGodWin 2 points 4 days ago Dan Crenshaw's picks too but he's rarely mentioned. permalink parent award report block reply lifeisahologram 1 points 4 days ago That’s because he is hated for being even gayer and worse than Nancy Pelosi. permalink parent award report block reply\nTrumpAndGodWin 2 points 4 days ago Dan Crenshaw's picks too but he's rarely mentioned. permalink parent award report block reply lifeisahologram 1 points 4 days ago That’s because he is hated for being even gayer and worse than Nancy Pelosi. permalink parent award report block reply\nlifeisahologram 1 points 4 days ago That’s because he is hated for being even gayer and worse than Nancy Pelosi. permalink parent award report block reply\nGildoom 7 points 4 days ago Queue the news media silhouette of a white boy band haircut from the 90s and his name withheld till trial. Then at trial we find out it is Mohammad Bin Stabbin permalink award report block reply CommanderOfCheese 9 points 4 days ago Cue. Cue means to signal the next thing. Queue is a line. permalink parent award report block reply Gildoom 1 points 4 days ago Sorry my bad permalink parent award report block reply\nCommanderOfCheese 9 points 4 days ago Cue. Cue means to signal the next thing. Queue is a line. permalink parent award report block reply Gildoom 1 points 4 days ago Sorry my bad permalink parent award report block reply\nGildoom 1 points 4 days ago Sorry my bad permalink parent award report block reply\nMickHigan2 7 points 5 days ago It's too dangerous to be White and going out on the town at night. Your chances of survival are far greater if you avoid the bar scene. permalink award report block reply Spicy_cat 3 points 4 days ago Avoid the groid permalink parent award report block reply YaharaRiver 2 points 4 days ago why?  Is that where all the muslims are, at the bar?? 🙄 permalink parent award report block reply\nSpicy_cat 3 points 4 days ago Avoid the groid permalink parent award report block reply\nYaharaRiver 2 points 4 days ago why?  Is that where all the muslims are, at the bar?? 🙄 permalink parent award report block reply\nslimcoat 6 points 4 days ago Authorities have urged witnesses to come forward So that they can be arrested for hate speech. permalink award report block reply DeepStateParasite 3 points 4 days ago Got to make an example of witnesses - it helps stop the noticing! permalink parent award report block reply\nDeepStateParasite 3 points 4 days ago Got to make an example of witnesses - it helps stop the noticing! permalink parent award report block reply\nkornesque 6 points 5 days ago Horror? This is normalcy now. permalink award report block reply YaharaRiver 1 points 4 days ago It will never NOT be horror. permalink parent award report block reply\nYaharaRiver 1 points 4 days ago It will never NOT be horror. permalink parent award report block reply\niirc_life 6 points 5 days ago \"a man\" permalink award report block reply\nhecubus 4 points 4 days ago \"Random\" permalink award report block reply\ncosmos411 4 points 4 days ago The person may have been randomly chosen, but the crime was planned. This was also not \"unprovoked\". The provocation was that she's not a muzslime. permalink award report block reply\nHenkZeilstra 4 points 4 days ago And yet the muslim mayor gers away unscathed permalink award report block reply\nprogressives4Trump 3 points 4 days ago Getting real tired of watching murders. permalink award report block reply\nhnoble444 3 points 4 days ago \"man in his twenties\" \"Manchester man\" \"Maryland Man\" \"Teens\".....we all know what's up. permalink award report block reply\nCounterwhat 3 points 4 days ago \"Unprovoked attack\".......you mean that's different from just minding your own business and trying to go about your day. permalink award report block reply\nIlhansBrother 3 points 5 days ago UK police probably too busy attending a pride event or investigated the suspect and let him go for fear of being racist? permalink award report block reply vote_for_MAGA_2020 4 points 4 days ago Nooooooo more likely someone posted something offensive on social media and they need to get that addressed. permalink parent award report block reply tt777 3 points 4 days ago I'm just amazed the UK police arrested the person. permalink parent award report block reply DontTreadOnSnek 3 points 4 days ago They \"arrested\" him to protect him from pissed off White UK citizens. permalink parent award report block reply CheeseAndOnion 3 points 4 days ago There are social media posts that have causes distress to attend to. Arrests have to be made. permalink parent award report block reply DeepStateParasite 2 points 4 days ago \"We couldn't respond at that time - the genderqueer pride stripe paint on our cars hadn't dried yet!\" permalink parent award report block reply\nvote_for_MAGA_2020 4 points 4 days ago Nooooooo more likely someone posted something offensive on social media and they need to get that addressed. permalink parent award report block reply\ntt777 3 points 4 days ago I'm just amazed the UK police arrested the person. permalink parent award report block reply DontTreadOnSnek 3 points 4 days ago They \"arrested\" him to protect him from pissed off White UK citizens. permalink parent award report block reply\nDontTreadOnSnek 3 points 4 days ago They \"arrested\" him to protect him from pissed off White UK citizens. permalink parent award report block reply\nCheeseAndOnion 3 points 4 days ago There are social media posts that have causes distress to attend to. Arrests have to be made. permalink parent award report block reply\nDeepStateParasite 2 points 4 days ago \"We couldn't respond at that time - the genderqueer pride stripe paint on our cars hadn't dried yet!\" permalink parent award report block reply\nemorphia 2 points 4 days ago nothing to see here and it was for sure not an islamist....  same story everytime.\nit was a UK resident (same tactic as the dems, calling them residents and not citizens) permalink award report block reply\nNanteen 2 points 4 days ago He had a stabbing emergency and had to do it, he doesn't understand in his home country. This was perfectly fine permalink award report block reply TrumpAndGodWin 1 points 4 days ago \"His IQ is too low to stand trial and he'll be released immediately.\" permalink parent award report block reply\nTrumpAndGodWin 1 points 4 days ago \"His IQ is too low to stand trial and he'll be released immediately.\" permalink parent award report block reply\nCalumet57 2 points 4 days ago UK police busy elsewhere. permalink award report block reply MastaJoda 3 points 4 days ago Running down terrorists who complain about their daughters being gang raped and murdered online, no doubt. permalink parent award report block reply\nMastaJoda 3 points 4 days ago Running down terrorists who complain about their daughters being gang raped and murdered online, no doubt. permalink parent award report block reply\nSecondrun007 2 points 4 days ago White guy?   Oh… permalink award report block reply\nJimRaynor 2 points 4 days ago Genocide is always an option if murderorus terrorist rapist parasite barbarians don't want to return to their shitholes. permalink award report block reply\nSBOJ_JOBS 2 points 4 days ago Why would a knife do this? We may never know. --- BBC, probably permalink award report block reply\nTrumpYouMagaFrenner 2 points 5 days ago Did she blow her whistle? permalink award report block reply CheeseAndOnion 4 points 4 days ago She forgot to say “STOP” in a loud but stern voice as recommended by the metropolitan cucks err cops permalink parent award report block reply\nCheeseAndOnion 4 points 4 days ago She forgot to say “STOP” in a loud but stern voice as recommended by the metropolitan cucks err cops permalink parent award report block reply\nDudeNoOne 2 points 4 days ago Please describe this… Man permalink award report block reply\npanic_scam 2 points 4 days ago Lemme guess… brown permalink award report block reply\nPrandogolio 2 points 4 days ago \"Authorities are asking witnesses to come forward, but they won't be releasing images of the attacker because it might give fuel to the far right white supremacists\" permalink award report block reply\nf_bastiat 1 points 4 days ago Part and parcel permalink award report block reply\nthisisatestof2 1 points 4 days ago One of those Amish, right? /s permalink award report block reply\ncanada_is_communist 1 points 4 days ago She vited for it permalink award report block reply\nspezisacuckold 1 points 4 days ago \"Part and parcel.\" On its way to NYC. permalink award report block reply\nLitecola2 1 points 4 days ago Chyron underneath bookends the report nicely: \"...confirms Algerian sex offender Brain Kaddour-something has been arrested...\" permalink award report block reply\nTellmeboutit2 1 points 4 days ago \" a man in his 20s\" = imported Briton. permalink award report block reply\nmailinvoter 1 points 4 days ago We need to stand up and fix things before this comes to the States ...... Oh, wait. permalink award report block reply\nCheeseAndOnion 1 points 4 days ago England is not a safe place for the english and whites in general. Perhaps they should look into moving to somewhere with less moslems and darkies. permalink award report block reply Combat_Hamster 4 points 4 days ago Perhaps they should unite and take their country back instead. permalink parent award report block reply Iremembermypassword 4 points 4 days ago Or arm themselves, organize and fight back. permalink parent award report block reply\nCombat_Hamster 4 points 4 days ago Perhaps they should unite and take their country back instead. permalink parent award report block reply\nIremembermypassword 4 points 4 days ago Or arm themselves, organize and fight back. permalink parent award report block reply\n2016TrumpMAGA 1 points 4 days ago Yeah, totally random. permalink award report block reply\nDJT4MoreYears 1 points 4 days ago None of this is \"random.\" The UK asshole \"leaders\" that let these low IQ in-bred 2nd century goat-fuckers in the country planned all of this. They're the ones that need to be forcefully removed if the UK has any chance of saving itself. permalink award report block reply\nMAGALADON9 1 points 4 days ago Part n Parcel innit. Keep votin labour ya socialist twats. You lot care more bout ya black n brown footballers than ya do your bloody country being invaded. Shame on all of you. permalink award report block reply\nbantar 1 points 4 days ago Ricky Gervais needs to start marketing a Turtle Neck Stab Vest in addition to the base model. permalink award report block reply\nHarvestsmiles 1 points 4 days ago If the random attacks happen weekly and are perpetrated by people of color and always against white women, are they really random? 🤔 permalink award report block reply\nAcAirman 1 points 4 days ago Irina? permalink award report block reply\nknnbccb 0 points 4 days ago Stay away from the Midlands in the UK. permalink award report block reply\nAlmostFullyDilated 1 points 4 days ago Comment removed by community moderators. permalink award report block reply\nHoodooOperator 1 points 4 days ago Comment removed by community moderators. permalink award report block reply\nMuttsbitetoo 0 points 4 days ago Comment removed by community moderators. permalink award report block reply"}