{"id": "1ARK9hiHgL", "contents": "1391 MAJOR BREAKING: International actors are involved in the State Department led color revolution 🛑  Corrupt Commies  🛑 posted 2 days ago by ALT26 93 comments award share report block DataRepublican (small r) @DataRepublican • 3d 🧵🚨 MAJOR BREAKING: International actors are involved in the State Department led color revolution 🚨🚨 This is not speculation; it’s straight from a recorded call. Ex-USAID employees describe how, before January 20, they moved internal groups off government systems and into\n93 comments Sort by Top Top New Worst Old Save Around the Web Hair Will Grow Back! No Matter How Severe The Baldness HaloGrow Bullet3250 91 points 2 days ago Would be nice to file charges.  Start arresting people.  Putting them on Trial.... Reading about WHAT PRISON THEY ARE GOING TO GO TO AND For HOW LONG. permalink award report block reply hellohellohellohell 38 points 2 days ago Comey's been indicted, with more charges to come. Same with Bolton. Brennan, Strzok and Page are all under grand jury investigation, with indictments looming for them and up to 30 others. And in the state of Florida, where they can't just jury nullify it. Things finally seem to be happening. permalink parent award report block reply Bullet3250 32 points 2 days ago I will only add - that the MEDIA should be having a FEEDING FRENZY over all this.  And ALL AMERICA needs to see the crimes and the MAFIA exposed. Should be Piranhas eating a cow - instead - there will be silence.... and that is something we need to correct. permalink parent award report block reply Aquamine-Amarine 17 points 2 days ago Until the corruption in the media and schools are dealt with, things will not change. They're the source of the rot. permalink parent award report block reply WiseCracker155 9 points 2 days ago Yes, I've been saying all along that the media is problem number one. We have got to fix that as soon as possible.\nThat and our election security needs to be addressed or we can't make any headway.\nThose 2 issues are right up there with the border if we want to have our country 5, 10, 15, 20 years from now. permalink parent award report block reply SteveRogers42 4 points 2 days ago Last time that a couple of European guys tried that,the rest of the world got around them in a circle and started kicking them. permalink parent award report block reply view 2 more comments... I_Love_45-70_Gov 3 points 2 days ago ^This permalink parent award report block reply Friar_Pede 2 points 2 days ago I say the Fed is the source of the rot. permalink parent award report block reply view 1 more comments... Smurfection 6 points 2 days ago TheNews™.   Their job isn't to give information to the public or even explain what is going on.  They are an agitprop organization designed to deceive and propagandize the masses.    They deceive by giving half truths or a hard left spin on all information they report and studiously omitting or dismissing any information that doesn't support or bolster the narrative they want to put out.  They propagandize by highlighting issues and concerns whether real or false, that fall into the demographics groups they have deemed oppressed while curtailing any and all concerns from demographics they have deemed are oppressors. This is how we get stories about poor laid off Federal Employees without putting it into context regarding how much the Federal bureaucracy has expanded and how much money that bureaucracy is handing out to various causes voters never knew about or wouldn't have voted for.    It's also why we get a stories about illegal alien gang members cast as \"Maryland Dad\" but we don't ever hear from the white and asian guys who lost their jobs to unqualified H1B hires. permalink parent award report block reply Bullet3250 4 points 2 days ago The Federal Government will spend $7 Trillion dollars.  All State Governments will combined spend nearly $4 Trillion. That is $11 Trillion in an economy that is approaching $30 Trillion total.  Call it 35% of ALL TRANSACTIONS in the US are now GOV. That, is not a healthy economy - and we are all going to pay a dear price. permalink parent award report block reply view 2 more comments... gaijin_ronin 4 points 2 days ago I'm not holding my breath.  Until executions start happening it's just strongly worded letters and means nothing. permalink parent award report block reply chickeninoven 0 points 2 days ago Indictments schmindictments. Until there are convictions and real sentences (PRISON), it's all a bunch of bullshit. permalink parent award report block reply 202_ 16 points 2 days ago Don't you worry, it's on Pams desk! permalink parent award report block reply Here_we_go 10 points 2 days ago The one she's always at, at Fox News or her botox appointment? permalink parent award report block reply DeportThemAllForever -1 points 2 days ago “Are you still talking about that guy?” permalink parent award report block reply Callsign_Fox1 1 points 2 days ago Comment removed by community filter, pending further review. permalink parent award report block reply Iremembermypassword 11 points 2 days ago This is literal sedition. Go after them!! permalink parent award report block reply DeportThemAllForever 5 points 2 days ago I’m from the future (two weeks): nothing will be done. The end. Those people are above the law, they ran same revolutions here that they ran prior all over the world.  What goes around comes around. We hurt ourselves worse than our “enemies”. permalink parent award report block reply Viewer01 4 points 2 days ago Our govt and courts aren’t suited to dealing with these type of bad actors. Trump missed his chance for a night of the long knives when Kirk died. permalink parent award report block reply chickeninoven 1 points 2 days ago Didn't he go to a Yankees game that evening? 🤣 permalink parent award report block reply drattastic1 3 points 2 days ago The criminal and anti-American enterprises have been accumulating power since way before we were born. It won't be dismantled in a year or 10 years but it has to start somewhere and it has begun. We have to do our part, hold our elected officials feet to the fire and get out to elect the best people possible in EVERY SINGLE ELECTION. permalink parent award report block reply Bullet3250 1 points 2 days ago yes! permalink parent award report block reply load 10 more comments... StolenElectionsKill 30 points 2 days ago Doomers always gonna doom, but Data Republican is not some trifling click-whore on X. She is a SERIOUS investigator, dead serious with no apparent sense of humor. If she titles her thread this way, it's no fucking joke. She's got the goods on them. permalink award report block reply PhoneBandit 18 points 2 days ago Yes but it's on bondi to take action permalink parent award report block reply PowerOfBlues 0 points 2 days ago No.... It's on the American people to be awake and stop believing the Deep State hype that we're the good guys of the world... Therefore.. we don't have to worry as much about our government as people in other countries have to worry about their governments..... Not nearly enough Americans want to face the truth.... And until more people wake up and are as angry as some of us have been for quite awhile.. It's absolutely foolish and naive to think that all of the sudden government officials are all going to do the right thing because we managed to miraculously elect one decent person as POTUS And it's childish for people to pout and invent  names like Scam Bondi.... and dumb phrases like... two more weeks..... Because they think there's some kind of shortcut to fixing a government that's supposed to be by for and of the people...when the vast majority of the country are asleep and don't want to be bothered thinking about unpleasant things permalink parent award report block reply RINOssuck 5 points 2 days ago None of this is new.  Mike Benz talked about all of this on Tucker a year ago. permalink parent award report block reply chickeninoven 2 points 2 days ago No one who use \"🚨🚨MAJOR BREAKING🚨🚨\" should be taken seriously. permalink parent award report block reply Zskills 22 points 2 days ago We need a ranking system so I know the difference between: BREAKING \"MAJOR\" BREAKING BOMBSHELL ALERT HAPPENING GET IN HERE!!!!! Y'all are like the guy at the office who marks every single email as \"urgent\".  It's obnoxious.   And before you come at me saying all you did is copy/paste the tweet or news headline, nobody made you do that. Edit:  6 butthurt clickbaiters so far 😃 permalink award report block reply lostremote- 15 points 2 days ago My pet peeve is “Upvote if you agree” or “This many people support (insert topic here)” permalink parent award report block reply ragnarokrobo 9 points 2 days ago Aka engagement farming and upvote begging. permalink parent award report block reply joggin_noggin 3 points 2 days ago The one good rule on the old subreddit that seems to have been completely abandoned here. permalink parent award report block reply Nibba2 5 points 2 days ago 💥💥💥 NOOOOOOOOOOOOOOOOOOOOOOKED FROM ORBIT!!!!! 💥💥💥 That’s the one you know when something is finally happening. permalink parent award report block reply MyBallsAreRough 3 points 2 days ago Where does EXCLUSIVE rank in here permalink parent award report block reply Zskills 2 points 2 days ago Very near the top, especially if it is not exclusive and has already been shared by 10 other people and stickied twice in the last day or two.  These are the most exclusive of all!  SCOOP: 🍨 permalink parent award report block reply they-see-me-trollin 2 points 2 days ago I read all of these as \"EVEN IF IT'S TRUE, NO ONE WILL EVER BE CHARGED: <insert shit we already knew years ago>\" permalink parent award report block reply DingleBalls 12 points 2 days ago SMASHING BREAKING! FOX NEWS ALERT 🚨 ⚠️ permalink award report block reply Alphahorizon 10 points 2 days ago I'm just tired of the huge amount of evidence from various crimes going absolutely unpunished. This has led to complete lack of confidence in our institutions and we thought these perpetrators would be apprehended. permalink award report block reply grassshrimp 10 points 2 days ago USAID was/is the key to destroying the West and implementing \"globalism\".  It funded everything from worldwide propaganda to stolen elections to color revolutions. It's still active, hiding in plain site funded by Soros types. permalink award report block reply Hanging_Chad 9 points 2 days ago what color are the bad actors? permalink award report block reply TheRedPike 5 points 2 days ago Pearly pink and deep black.  The color of the objects they shove in their asses and neovaginas. permalink parent award report block reply Taliesin 3 points 2 days ago J6 2020 was apparently the Purple Revolution. permalink parent award report block reply Im_RickSteves_bitch 7 points 2 days ago It's still treason, even if you didn't conspire with foreign agents. If there was no reason to go after these people before, there's still no reason to now. permalink award report block reply itspancakees 6 points 2 days ago This is espionage. The normal rules don't apply. These people can be disappeared. Trump needs to do it! permalink award report block reply OrangeCatBad 5 points 2 days ago That explains the same Palestine women in photo crying over her 200th child being hit by Israel shells for the 7th time that week. permalink award report block reply Chickensaurus 5 points 2 days ago Pam, Kash, and Dan will do.....fuck all. permalink award report block reply Chickapede 5 points 2 days ago That takes it from sedition to treason.  And treason is punishable by death. permalink award report block reply RedStoneDeepState 4 points 2 days ago USAID was not a part of the state department until Trump restructured it in June. permalink award report block reply frothy 3 points 2 days ago So they exfiltrated government information / documents off of government servers to put in private systems?  Pretty sure that's a big no no... permalink award report block reply Taliesin 2 points 2 days ago Ask Hillary. permalink parent award report block reply MehNahMehNah 3 points 2 days ago 50,000 people coordinating to bilk the American taxpayer and defy the executive branch is a formidable number... and this idiot isn't even an upper echelon director obviously. More like a mid-level manager. The problem would be isolating what CIA elements are involved and how this is all tied to leftist/commie 'elected' officials and judiciary. And how to perform the excisions. Alex Jones will be feasting on this. As will Steve Bannon. Tying it all back to pot-bellied interdimensional goblins (code) and the CCP might hide how our greatest ally (code) has at least one of it's corrupted tentacles in the wrong cookie jar. data republican may be in danger if she keeps outing these points, I hope others (we) can connect some dots outside of her feed to shield her. permalink award report block reply KernalMustard 1 points 2 days ago No shit really? Tell us something we dont know. permalink award report block reply borisborscht 1 points 2 days ago I can't get my hopes up again though it's hard to bet against the don but he's not working for us is he permalink award report block reply brimshae 1 points 2 days ago Nice to see someone else calling out the State Department. permalink award report block reply gaijin_ronin 1 points 2 days ago No shit, because they are a tentacle of the CIA. permalink award report block reply Ricky_CIA 1 points 2 days ago It's literal high crimes against the state. permalink award report block reply Peekov3 1 points 2 days ago 💣 permalink award report block reply SpiderTaxi 1 points 2 days ago I am still waiting for one person to be charged with anything. permalink award report block reply HaviTheOneEyed 1 points 2 days ago CRUSH THEM! permalink award report block reply chahn1138 1 points 2 days ago We had already moved into Signals Chats CONSPIRACY CONFIRMED PAST Time that we took ACTION! permalink award report block reply BrionK 1 points 2 days ago Republicans are worthless. It's all just a sick joke.\nFuck everyone in government. They are working against Americans. permalink award report block reply CharlesWilliams 1 points 2 days ago Not for nothing, I’m in a church that lots of “resist” types attend, and my “apolitical” public facing stance is well established.  At “coffee hour” after services they’re starting to recognize and talk among themselves to the effect that the current Democrat party is a massive criminal enterprise. Not the “good guys” protecting “decent people” from the “greedy” Orange Man. The framing of Democrats as compassionate protectors of the downtrodden is in shreds among these people. Not saying they’re becoming pro-Trump,  nor that I’d risk exposing myself as such, as I can be more persuasive when perceived as merely a disinterested observer.  I’m well received there, and regarded with kindness and respect as a staunch upholder of timeless traditions.  That’s a pretty effective foot in the door for persuasive engagement.   I’ve sewn seeds of doubt by discussing “realism”’ vs “nominalism” in terms of moral and ethical philosophy.  Getting people to evaluate their unexamined assumptions seems to be influencing their political biases.  It works because it’s the truth.  They’ve never before questioned their multigenerational support of Democrats.  I studiously avoid labeling Democrats as radicals or socialists, or anything else.  I also avoid positively portraying Republicans as “the good guys”.   I just say all politicians are grifters. They’re like athletes, only loyal to whatever team signs their paycheck. permalink award report block reply MythArcana 1 points 2 days ago She would make a fine AG, that's all I know. permalink award report block reply Twitter 1 points 2 days ago NO ONE IS BEING ARRESTED permalink award report block reply SanityGumby -2 points 2 days ago People are literally getting arrested. Who the fuck do you think all these indictments have been for? The tooth fairy? permalink parent award report block reply Wexit-Delecto 2 points 2 days ago Which deep stater has been arrested on charges likely to result in jail time? They got Comey for a speeding ticket and Brennan for jaywalking, but how about fucking treason and sedition? permalink parent award report block reply TooBright 2 points 2 days ago Oh I wish the rock would get his too. permalink parent award report block reply MemeLawd 1 points 2 days ago If Trump doesn't do something he is complicit in all of this permalink award report block reply Siteless_Vagrant 1 points 2 days ago How is this breaking? permalink award report block reply Wexit-Delecto 1 points 2 days ago So it IS treason. And yet, zero arrests. permalink award report block reply TrumpAndSimpsNotMAGA 1 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply ThugLyfeTrump PRO 1 points 2 days ago Crazy shit... permalink award report block reply HoganP 1 points 2 days ago She's like a freaking wizard and it's so impressive to watch. permalink award report block reply MocksFordComma 1 points 2 days ago You’ll find billions of USAID dollars flowing back into the USA for this color revolution. We’re trillions in debt because we paid for our own Marxist subversion. permalink award report block reply EBernays 1 points 2 days ago \"International actors\" 😂🤣😂🤣 permalink award report block reply CuzzinRicky 1 points 2 days ago (((International actors))) permalink parent award report block reply Riehlpissed 0 points 2 days ago In a couple of weeks……. then nothing permalink award report block reply knnbccb 1 points 2 days ago Comment removed by community moderators. permalink award report block reply\nBullet3250 91 points 2 days ago Would be nice to file charges.  Start arresting people.  Putting them on Trial.... Reading about WHAT PRISON THEY ARE GOING TO GO TO AND For HOW LONG. permalink award report block reply hellohellohellohell 38 points 2 days ago Comey's been indicted, with more charges to come. Same with Bolton. Brennan, Strzok and Page are all under grand jury investigation, with indictments looming for them and up to 30 others. And in the state of Florida, where they can't just jury nullify it. Things finally seem to be happening. permalink parent award report block reply Bullet3250 32 points 2 days ago I will only add - that the MEDIA should be having a FEEDING FRENZY over all this.  And ALL AMERICA needs to see the crimes and the MAFIA exposed. Should be Piranhas eating a cow - instead - there will be silence.... and that is something we need to correct. permalink parent award report block reply Aquamine-Amarine 17 points 2 days ago Until the corruption in the media and schools are dealt with, things will not change. They're the source of the rot. permalink parent award report block reply WiseCracker155 9 points 2 days ago Yes, I've been saying all along that the media is problem number one. We have got to fix that as soon as possible.\nThat and our election security needs to be addressed or we can't make any headway.\nThose 2 issues are right up there with the border if we want to have our country 5, 10, 15, 20 years from now. permalink parent award report block reply SteveRogers42 4 points 2 days ago Last time that a couple of European guys tried that,the rest of the world got around them in a circle and started kicking them. permalink parent award report block reply view 2 more comments... I_Love_45-70_Gov 3 points 2 days ago ^This permalink parent award report block reply Friar_Pede 2 points 2 days ago I say the Fed is the source of the rot. permalink parent award report block reply view 1 more comments... Smurfection 6 points 2 days ago TheNews™.   Their job isn't to give information to the public or even explain what is going on.  They are an agitprop organization designed to deceive and propagandize the masses.    They deceive by giving half truths or a hard left spin on all information they report and studiously omitting or dismissing any information that doesn't support or bolster the narrative they want to put out.  They propagandize by highlighting issues and concerns whether real or false, that fall into the demographics groups they have deemed oppressed while curtailing any and all concerns from demographics they have deemed are oppressors. This is how we get stories about poor laid off Federal Employees without putting it into context regarding how much the Federal bureaucracy has expanded and how much money that bureaucracy is handing out to various causes voters never knew about or wouldn't have voted for.    It's also why we get a stories about illegal alien gang members cast as \"Maryland Dad\" but we don't ever hear from the white and asian guys who lost their jobs to unqualified H1B hires. permalink parent award report block reply Bullet3250 4 points 2 days ago The Federal Government will spend $7 Trillion dollars.  All State Governments will combined spend nearly $4 Trillion. That is $11 Trillion in an economy that is approaching $30 Trillion total.  Call it 35% of ALL TRANSACTIONS in the US are now GOV. That, is not a healthy economy - and we are all going to pay a dear price. permalink parent award report block reply view 2 more comments... gaijin_ronin 4 points 2 days ago I'm not holding my breath.  Until executions start happening it's just strongly worded letters and means nothing. permalink parent award report block reply chickeninoven 0 points 2 days ago Indictments schmindictments. Until there are convictions and real sentences (PRISON), it's all a bunch of bullshit. permalink parent award report block reply 202_ 16 points 2 days ago Don't you worry, it's on Pams desk! permalink parent award report block reply Here_we_go 10 points 2 days ago The one she's always at, at Fox News or her botox appointment? permalink parent award report block reply DeportThemAllForever -1 points 2 days ago “Are you still talking about that guy?” permalink parent award report block reply Callsign_Fox1 1 points 2 days ago Comment removed by community filter, pending further review. permalink parent award report block reply Iremembermypassword 11 points 2 days ago This is literal sedition. Go after them!! permalink parent award report block reply DeportThemAllForever 5 points 2 days ago I’m from the future (two weeks): nothing will be done. The end. Those people are above the law, they ran same revolutions here that they ran prior all over the world.  What goes around comes around. We hurt ourselves worse than our “enemies”. permalink parent award report block reply Viewer01 4 points 2 days ago Our govt and courts aren’t suited to dealing with these type of bad actors. Trump missed his chance for a night of the long knives when Kirk died. permalink parent award report block reply chickeninoven 1 points 2 days ago Didn't he go to a Yankees game that evening? 🤣 permalink parent award report block reply drattastic1 3 points 2 days ago The criminal and anti-American enterprises have been accumulating power since way before we were born. It won't be dismantled in a year or 10 years but it has to start somewhere and it has begun. We have to do our part, hold our elected officials feet to the fire and get out to elect the best people possible in EVERY SINGLE ELECTION. permalink parent award report block reply Bullet3250 1 points 2 days ago yes! permalink parent award report block reply load 10 more comments...\nhellohellohellohell 38 points 2 days ago Comey's been indicted, with more charges to come. Same with Bolton. Brennan, Strzok and Page are all under grand jury investigation, with indictments looming for them and up to 30 others. And in the state of Florida, where they can't just jury nullify it. Things finally seem to be happening. permalink parent award report block reply Bullet3250 32 points 2 days ago I will only add - that the MEDIA should be having a FEEDING FRENZY over all this.  And ALL AMERICA needs to see the crimes and the MAFIA exposed. Should be Piranhas eating a cow - instead - there will be silence.... and that is something we need to correct. permalink parent award report block reply Aquamine-Amarine 17 points 2 days ago Until the corruption in the media and schools are dealt with, things will not change. They're the source of the rot. permalink parent award report block reply WiseCracker155 9 points 2 days ago Yes, I've been saying all along that the media is problem number one. We have got to fix that as soon as possible.\nThat and our election security needs to be addressed or we can't make any headway.\nThose 2 issues are right up there with the border if we want to have our country 5, 10, 15, 20 years from now. permalink parent award report block reply SteveRogers42 4 points 2 days ago Last time that a couple of European guys tried that,the rest of the world got around them in a circle and started kicking them. permalink parent award report block reply view 2 more comments... I_Love_45-70_Gov 3 points 2 days ago ^This permalink parent award report block reply Friar_Pede 2 points 2 days ago I say the Fed is the source of the rot. permalink parent award report block reply view 1 more comments... Smurfection 6 points 2 days ago TheNews™.   Their job isn't to give information to the public or even explain what is going on.  They are an agitprop organization designed to deceive and propagandize the masses.    They deceive by giving half truths or a hard left spin on all information they report and studiously omitting or dismissing any information that doesn't support or bolster the narrative they want to put out.  They propagandize by highlighting issues and concerns whether real or false, that fall into the demographics groups they have deemed oppressed while curtailing any and all concerns from demographics they have deemed are oppressors. This is how we get stories about poor laid off Federal Employees without putting it into context regarding how much the Federal bureaucracy has expanded and how much money that bureaucracy is handing out to various causes voters never knew about or wouldn't have voted for.    It's also why we get a stories about illegal alien gang members cast as \"Maryland Dad\" but we don't ever hear from the white and asian guys who lost their jobs to unqualified H1B hires. permalink parent award report block reply Bullet3250 4 points 2 days ago The Federal Government will spend $7 Trillion dollars.  All State Governments will combined spend nearly $4 Trillion. That is $11 Trillion in an economy that is approaching $30 Trillion total.  Call it 35% of ALL TRANSACTIONS in the US are now GOV. That, is not a healthy economy - and we are all going to pay a dear price. permalink parent award report block reply view 2 more comments... gaijin_ronin 4 points 2 days ago I'm not holding my breath.  Until executions start happening it's just strongly worded letters and means nothing. permalink parent award report block reply chickeninoven 0 points 2 days ago Indictments schmindictments. Until there are convictions and real sentences (PRISON), it's all a bunch of bullshit. permalink parent award report block reply\nBullet3250 32 points 2 days ago I will only add - that the MEDIA should be having a FEEDING FRENZY over all this.  And ALL AMERICA needs to see the crimes and the MAFIA exposed. Should be Piranhas eating a cow - instead - there will be silence.... and that is something we need to correct. permalink parent award report block reply Aquamine-Amarine 17 points 2 days ago Until the corruption in the media and schools are dealt with, things will not change. They're the source of the rot. permalink parent award report block reply WiseCracker155 9 points 2 days ago Yes, I've been saying all along that the media is problem number one. We have got to fix that as soon as possible.\nThat and our election security needs to be addressed or we can't make any headway.\nThose 2 issues are right up there with the border if we want to have our country 5, 10, 15, 20 years from now. permalink parent award report block reply SteveRogers42 4 points 2 days ago Last time that a couple of European guys tried that,the rest of the world got around them in a circle and started kicking them. permalink parent award report block reply view 2 more comments... I_Love_45-70_Gov 3 points 2 days ago ^This permalink parent award report block reply Friar_Pede 2 points 2 days ago I say the Fed is the source of the rot. permalink parent award report block reply view 1 more comments... Smurfection 6 points 2 days ago TheNews™.   Their job isn't to give information to the public or even explain what is going on.  They are an agitprop organization designed to deceive and propagandize the masses.    They deceive by giving half truths or a hard left spin on all information they report and studiously omitting or dismissing any information that doesn't support or bolster the narrative they want to put out.  They propagandize by highlighting issues and concerns whether real or false, that fall into the demographics groups they have deemed oppressed while curtailing any and all concerns from demographics they have deemed are oppressors. This is how we get stories about poor laid off Federal Employees without putting it into context regarding how much the Federal bureaucracy has expanded and how much money that bureaucracy is handing out to various causes voters never knew about or wouldn't have voted for.    It's also why we get a stories about illegal alien gang members cast as \"Maryland Dad\" but we don't ever hear from the white and asian guys who lost their jobs to unqualified H1B hires. permalink parent award report block reply Bullet3250 4 points 2 days ago The Federal Government will spend $7 Trillion dollars.  All State Governments will combined spend nearly $4 Trillion. That is $11 Trillion in an economy that is approaching $30 Trillion total.  Call it 35% of ALL TRANSACTIONS in the US are now GOV. That, is not a healthy economy - and we are all going to pay a dear price. permalink parent award report block reply view 2 more comments...\nAquamine-Amarine 17 points 2 days ago Until the corruption in the media and schools are dealt with, things will not change. They're the source of the rot. permalink parent award report block reply WiseCracker155 9 points 2 days ago Yes, I've been saying all along that the media is problem number one. We have got to fix that as soon as possible.\nThat and our election security needs to be addressed or we can't make any headway.\nThose 2 issues are right up there with the border if we want to have our country 5, 10, 15, 20 years from now. permalink parent award report block reply SteveRogers42 4 points 2 days ago Last time that a couple of European guys tried that,the rest of the world got around them in a circle and started kicking them. permalink parent award report block reply view 2 more comments... I_Love_45-70_Gov 3 points 2 days ago ^This permalink parent award report block reply Friar_Pede 2 points 2 days ago I say the Fed is the source of the rot. permalink parent award report block reply view 1 more comments...\nWiseCracker155 9 points 2 days ago Yes, I've been saying all along that the media is problem number one. We have got to fix that as soon as possible.\nThat and our election security needs to be addressed or we can't make any headway.\nThose 2 issues are right up there with the border if we want to have our country 5, 10, 15, 20 years from now. permalink parent award report block reply\nSteveRogers42 4 points 2 days ago Last time that a couple of European guys tried that,the rest of the world got around them in a circle and started kicking them. permalink parent award report block reply view 2 more comments...\nI_Love_45-70_Gov 3 points 2 days ago ^This permalink parent award report block reply\nFriar_Pede 2 points 2 days ago I say the Fed is the source of the rot. permalink parent award report block reply view 1 more comments...\nSmurfection 6 points 2 days ago TheNews™.   Their job isn't to give information to the public or even explain what is going on.  They are an agitprop organization designed to deceive and propagandize the masses.    They deceive by giving half truths or a hard left spin on all information they report and studiously omitting or dismissing any information that doesn't support or bolster the narrative they want to put out.  They propagandize by highlighting issues and concerns whether real or false, that fall into the demographics groups they have deemed oppressed while curtailing any and all concerns from demographics they have deemed are oppressors. This is how we get stories about poor laid off Federal Employees without putting it into context regarding how much the Federal bureaucracy has expanded and how much money that bureaucracy is handing out to various causes voters never knew about or wouldn't have voted for.    It's also why we get a stories about illegal alien gang members cast as \"Maryland Dad\" but we don't ever hear from the white and asian guys who lost their jobs to unqualified H1B hires. permalink parent award report block reply Bullet3250 4 points 2 days ago The Federal Government will spend $7 Trillion dollars.  All State Governments will combined spend nearly $4 Trillion. That is $11 Trillion in an economy that is approaching $30 Trillion total.  Call it 35% of ALL TRANSACTIONS in the US are now GOV. That, is not a healthy economy - and we are all going to pay a dear price. permalink parent award report block reply view 2 more comments...\nBullet3250 4 points 2 days ago The Federal Government will spend $7 Trillion dollars.  All State Governments will combined spend nearly $4 Trillion. That is $11 Trillion in an economy that is approaching $30 Trillion total.  Call it 35% of ALL TRANSACTIONS in the US are now GOV. That, is not a healthy economy - and we are all going to pay a dear price. permalink parent award report block reply view 2 more comments...\ngaijin_ronin 4 points 2 days ago I'm not holding my breath.  Until executions start happening it's just strongly worded letters and means nothing. permalink parent award report block reply\nchickeninoven 0 points 2 days ago Indictments schmindictments. Until there are convictions and real sentences (PRISON), it's all a bunch of bullshit. permalink parent award report block reply\n202_ 16 points 2 days ago Don't you worry, it's on Pams desk! permalink parent award report block reply Here_we_go 10 points 2 days ago The one she's always at, at Fox News or her botox appointment? permalink parent award report block reply DeportThemAllForever -1 points 2 days ago “Are you still talking about that guy?” permalink parent award report block reply Callsign_Fox1 1 points 2 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nHere_we_go 10 points 2 days ago The one she's always at, at Fox News or her botox appointment? permalink parent award report block reply\nDeportThemAllForever -1 points 2 days ago “Are you still talking about that guy?” permalink parent award report block reply\nCallsign_Fox1 1 points 2 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nIremembermypassword 11 points 2 days ago This is literal sedition. Go after them!! permalink parent award report block reply DeportThemAllForever 5 points 2 days ago I’m from the future (two weeks): nothing will be done. The end. Those people are above the law, they ran same revolutions here that they ran prior all over the world.  What goes around comes around. We hurt ourselves worse than our “enemies”. permalink parent award report block reply\nDeportThemAllForever 5 points 2 days ago I’m from the future (two weeks): nothing will be done. The end. Those people are above the law, they ran same revolutions here that they ran prior all over the world.  What goes around comes around. We hurt ourselves worse than our “enemies”. permalink parent award report block reply\nViewer01 4 points 2 days ago Our govt and courts aren’t suited to dealing with these type of bad actors. Trump missed his chance for a night of the long knives when Kirk died. permalink parent award report block reply chickeninoven 1 points 2 days ago Didn't he go to a Yankees game that evening? 🤣 permalink parent award report block reply\nchickeninoven 1 points 2 days ago Didn't he go to a Yankees game that evening? 🤣 permalink parent award report block reply\ndrattastic1 3 points 2 days ago The criminal and anti-American enterprises have been accumulating power since way before we were born. It won't be dismantled in a year or 10 years but it has to start somewhere and it has begun. We have to do our part, hold our elected officials feet to the fire and get out to elect the best people possible in EVERY SINGLE ELECTION. permalink parent award report block reply Bullet3250 1 points 2 days ago yes! permalink parent award report block reply\nBullet3250 1 points 2 days ago yes! permalink parent award report block reply\nStolenElectionsKill 30 points 2 days ago Doomers always gonna doom, but Data Republican is not some trifling click-whore on X. She is a SERIOUS investigator, dead serious with no apparent sense of humor. If she titles her thread this way, it's no fucking joke. She's got the goods on them. permalink award report block reply PhoneBandit 18 points 2 days ago Yes but it's on bondi to take action permalink parent award report block reply PowerOfBlues 0 points 2 days ago No.... It's on the American people to be awake and stop believing the Deep State hype that we're the good guys of the world... Therefore.. we don't have to worry as much about our government as people in other countries have to worry about their governments..... Not nearly enough Americans want to face the truth.... And until more people wake up and are as angry as some of us have been for quite awhile.. It's absolutely foolish and naive to think that all of the sudden government officials are all going to do the right thing because we managed to miraculously elect one decent person as POTUS And it's childish for people to pout and invent  names like Scam Bondi.... and dumb phrases like... two more weeks..... Because they think there's some kind of shortcut to fixing a government that's supposed to be by for and of the people...when the vast majority of the country are asleep and don't want to be bothered thinking about unpleasant things permalink parent award report block reply RINOssuck 5 points 2 days ago None of this is new.  Mike Benz talked about all of this on Tucker a year ago. permalink parent award report block reply chickeninoven 2 points 2 days ago No one who use \"🚨🚨MAJOR BREAKING🚨🚨\" should be taken seriously. permalink parent award report block reply\nPhoneBandit 18 points 2 days ago Yes but it's on bondi to take action permalink parent award report block reply PowerOfBlues 0 points 2 days ago No.... It's on the American people to be awake and stop believing the Deep State hype that we're the good guys of the world... Therefore.. we don't have to worry as much about our government as people in other countries have to worry about their governments..... Not nearly enough Americans want to face the truth.... And until more people wake up and are as angry as some of us have been for quite awhile.. It's absolutely foolish and naive to think that all of the sudden government officials are all going to do the right thing because we managed to miraculously elect one decent person as POTUS And it's childish for people to pout and invent  names like Scam Bondi.... and dumb phrases like... two more weeks..... Because they think there's some kind of shortcut to fixing a government that's supposed to be by for and of the people...when the vast majority of the country are asleep and don't want to be bothered thinking about unpleasant things permalink parent award report block reply\nPowerOfBlues 0 points 2 days ago No.... It's on the American people to be awake and stop believing the Deep State hype that we're the good guys of the world... Therefore.. we don't have to worry as much about our government as people in other countries have to worry about their governments..... Not nearly enough Americans want to face the truth.... And until more people wake up and are as angry as some of us have been for quite awhile.. It's absolutely foolish and naive to think that all of the sudden government officials are all going to do the right thing because we managed to miraculously elect one decent person as POTUS And it's childish for people to pout and invent  names like Scam Bondi.... and dumb phrases like... two more weeks..... Because they think there's some kind of shortcut to fixing a government that's supposed to be by for and of the people...when the vast majority of the country are asleep and don't want to be bothered thinking about unpleasant things permalink parent award report block reply\nRINOssuck 5 points 2 days ago None of this is new.  Mike Benz talked about all of this on Tucker a year ago. permalink parent award report block reply\nchickeninoven 2 points 2 days ago No one who use \"🚨🚨MAJOR BREAKING🚨🚨\" should be taken seriously. permalink parent award report block reply\nZskills 22 points 2 days ago We need a ranking system so I know the difference between: BREAKING \"MAJOR\" BREAKING BOMBSHELL ALERT HAPPENING GET IN HERE!!!!! Y'all are like the guy at the office who marks every single email as \"urgent\".  It's obnoxious.   And before you come at me saying all you did is copy/paste the tweet or news headline, nobody made you do that. Edit:  6 butthurt clickbaiters so far 😃 permalink award report block reply lostremote- 15 points 2 days ago My pet peeve is “Upvote if you agree” or “This many people support (insert topic here)” permalink parent award report block reply ragnarokrobo 9 points 2 days ago Aka engagement farming and upvote begging. permalink parent award report block reply joggin_noggin 3 points 2 days ago The one good rule on the old subreddit that seems to have been completely abandoned here. permalink parent award report block reply Nibba2 5 points 2 days ago 💥💥💥 NOOOOOOOOOOOOOOOOOOOOOOKED FROM ORBIT!!!!! 💥💥💥 That’s the one you know when something is finally happening. permalink parent award report block reply MyBallsAreRough 3 points 2 days ago Where does EXCLUSIVE rank in here permalink parent award report block reply Zskills 2 points 2 days ago Very near the top, especially if it is not exclusive and has already been shared by 10 other people and stickied twice in the last day or two.  These are the most exclusive of all!  SCOOP: 🍨 permalink parent award report block reply they-see-me-trollin 2 points 2 days ago I read all of these as \"EVEN IF IT'S TRUE, NO ONE WILL EVER BE CHARGED: <insert shit we already knew years ago>\" permalink parent award report block reply\nlostremote- 15 points 2 days ago My pet peeve is “Upvote if you agree” or “This many people support (insert topic here)” permalink parent award report block reply ragnarokrobo 9 points 2 days ago Aka engagement farming and upvote begging. permalink parent award report block reply joggin_noggin 3 points 2 days ago The one good rule on the old subreddit that seems to have been completely abandoned here. permalink parent award report block reply\nragnarokrobo 9 points 2 days ago Aka engagement farming and upvote begging. permalink parent award report block reply joggin_noggin 3 points 2 days ago The one good rule on the old subreddit that seems to have been completely abandoned here. permalink parent award report block reply\njoggin_noggin 3 points 2 days ago The one good rule on the old subreddit that seems to have been completely abandoned here. permalink parent award report block reply\nNibba2 5 points 2 days ago 💥💥💥 NOOOOOOOOOOOOOOOOOOOOOOKED FROM ORBIT!!!!! 💥💥💥 That’s the one you know when something is finally happening. permalink parent award report block reply\nMyBallsAreRough 3 points 2 days ago Where does EXCLUSIVE rank in here permalink parent award report block reply Zskills 2 points 2 days ago Very near the top, especially if it is not exclusive and has already been shared by 10 other people and stickied twice in the last day or two.  These are the most exclusive of all!  SCOOP: 🍨 permalink parent award report block reply\nZskills 2 points 2 days ago Very near the top, especially if it is not exclusive and has already been shared by 10 other people and stickied twice in the last day or two.  These are the most exclusive of all!  SCOOP: 🍨 permalink parent award report block reply\nthey-see-me-trollin 2 points 2 days ago I read all of these as \"EVEN IF IT'S TRUE, NO ONE WILL EVER BE CHARGED: <insert shit we already knew years ago>\" permalink parent award report block reply\nDingleBalls 12 points 2 days ago SMASHING BREAKING! FOX NEWS ALERT 🚨 ⚠️ permalink award report block reply\nAlphahorizon 10 points 2 days ago I'm just tired of the huge amount of evidence from various crimes going absolutely unpunished. This has led to complete lack of confidence in our institutions and we thought these perpetrators would be apprehended. permalink award report block reply\ngrassshrimp 10 points 2 days ago USAID was/is the key to destroying the West and implementing \"globalism\".  It funded everything from worldwide propaganda to stolen elections to color revolutions. It's still active, hiding in plain site funded by Soros types. permalink award report block reply\nHanging_Chad 9 points 2 days ago what color are the bad actors? permalink award report block reply TheRedPike 5 points 2 days ago Pearly pink and deep black.  The color of the objects they shove in their asses and neovaginas. permalink parent award report block reply Taliesin 3 points 2 days ago J6 2020 was apparently the Purple Revolution. permalink parent award report block reply\nTheRedPike 5 points 2 days ago Pearly pink and deep black.  The color of the objects they shove in their asses and neovaginas. permalink parent award report block reply\nTaliesin 3 points 2 days ago J6 2020 was apparently the Purple Revolution. permalink parent award report block reply\nIm_RickSteves_bitch 7 points 2 days ago It's still treason, even if you didn't conspire with foreign agents. If there was no reason to go after these people before, there's still no reason to now. permalink award report block reply\nitspancakees 6 points 2 days ago This is espionage. The normal rules don't apply. These people can be disappeared. Trump needs to do it! permalink award report block reply\nOrangeCatBad 5 points 2 days ago That explains the same Palestine women in photo crying over her 200th child being hit by Israel shells for the 7th time that week. permalink award report block reply\nChickensaurus 5 points 2 days ago Pam, Kash, and Dan will do.....fuck all. permalink award report block reply\nChickapede 5 points 2 days ago That takes it from sedition to treason.  And treason is punishable by death. permalink award report block reply\nRedStoneDeepState 4 points 2 days ago USAID was not a part of the state department until Trump restructured it in June. permalink award report block reply\nfrothy 3 points 2 days ago So they exfiltrated government information / documents off of government servers to put in private systems?  Pretty sure that's a big no no... permalink award report block reply Taliesin 2 points 2 days ago Ask Hillary. permalink parent award report block reply\nTaliesin 2 points 2 days ago Ask Hillary. permalink parent award report block reply\nMehNahMehNah 3 points 2 days ago 50,000 people coordinating to bilk the American taxpayer and defy the executive branch is a formidable number... and this idiot isn't even an upper echelon director obviously. More like a mid-level manager. The problem would be isolating what CIA elements are involved and how this is all tied to leftist/commie 'elected' officials and judiciary. And how to perform the excisions. Alex Jones will be feasting on this. As will Steve Bannon. Tying it all back to pot-bellied interdimensional goblins (code) and the CCP might hide how our greatest ally (code) has at least one of it's corrupted tentacles in the wrong cookie jar. data republican may be in danger if she keeps outing these points, I hope others (we) can connect some dots outside of her feed to shield her. permalink award report block reply\nKernalMustard 1 points 2 days ago No shit really? Tell us something we dont know. permalink award report block reply\nborisborscht 1 points 2 days ago I can't get my hopes up again though it's hard to bet against the don but he's not working for us is he permalink award report block reply\nbrimshae 1 points 2 days ago Nice to see someone else calling out the State Department. permalink award report block reply\ngaijin_ronin 1 points 2 days ago No shit, because they are a tentacle of the CIA. permalink award report block reply\nRicky_CIA 1 points 2 days ago It's literal high crimes against the state. permalink award report block reply\nPeekov3 1 points 2 days ago 💣 permalink award report block reply\nSpiderTaxi 1 points 2 days ago I am still waiting for one person to be charged with anything. permalink award report block reply\nHaviTheOneEyed 1 points 2 days ago CRUSH THEM! permalink award report block reply\nchahn1138 1 points 2 days ago We had already moved into Signals Chats CONSPIRACY CONFIRMED PAST Time that we took ACTION! permalink award report block reply\nBrionK 1 points 2 days ago Republicans are worthless. It's all just a sick joke.\nFuck everyone in government. They are working against Americans. permalink award report block reply\nCharlesWilliams 1 points 2 days ago Not for nothing, I’m in a church that lots of “resist” types attend, and my “apolitical” public facing stance is well established.  At “coffee hour” after services they’re starting to recognize and talk among themselves to the effect that the current Democrat party is a massive criminal enterprise. Not the “good guys” protecting “decent people” from the “greedy” Orange Man. The framing of Democrats as compassionate protectors of the downtrodden is in shreds among these people. Not saying they’re becoming pro-Trump,  nor that I’d risk exposing myself as such, as I can be more persuasive when perceived as merely a disinterested observer.  I’m well received there, and regarded with kindness and respect as a staunch upholder of timeless traditions.  That’s a pretty effective foot in the door for persuasive engagement.   I’ve sewn seeds of doubt by discussing “realism”’ vs “nominalism” in terms of moral and ethical philosophy.  Getting people to evaluate their unexamined assumptions seems to be influencing their political biases.  It works because it’s the truth.  They’ve never before questioned their multigenerational support of Democrats.  I studiously avoid labeling Democrats as radicals or socialists, or anything else.  I also avoid positively portraying Republicans as “the good guys”.   I just say all politicians are grifters. They’re like athletes, only loyal to whatever team signs their paycheck. permalink award report block reply\nMythArcana 1 points 2 days ago She would make a fine AG, that's all I know. permalink award report block reply\nTwitter 1 points 2 days ago NO ONE IS BEING ARRESTED permalink award report block reply SanityGumby -2 points 2 days ago People are literally getting arrested. Who the fuck do you think all these indictments have been for? The tooth fairy? permalink parent award report block reply Wexit-Delecto 2 points 2 days ago Which deep stater has been arrested on charges likely to result in jail time? They got Comey for a speeding ticket and Brennan for jaywalking, but how about fucking treason and sedition? permalink parent award report block reply TooBright 2 points 2 days ago Oh I wish the rock would get his too. permalink parent award report block reply\nSanityGumby -2 points 2 days ago People are literally getting arrested. Who the fuck do you think all these indictments have been for? The tooth fairy? permalink parent award report block reply Wexit-Delecto 2 points 2 days ago Which deep stater has been arrested on charges likely to result in jail time? They got Comey for a speeding ticket and Brennan for jaywalking, but how about fucking treason and sedition? permalink parent award report block reply TooBright 2 points 2 days ago Oh I wish the rock would get his too. permalink parent award report block reply\nWexit-Delecto 2 points 2 days ago Which deep stater has been arrested on charges likely to result in jail time? They got Comey for a speeding ticket and Brennan for jaywalking, but how about fucking treason and sedition? permalink parent award report block reply\nTooBright 2 points 2 days ago Oh I wish the rock would get his too. permalink parent award report block reply\nMemeLawd 1 points 2 days ago If Trump doesn't do something he is complicit in all of this permalink award report block reply\nSiteless_Vagrant 1 points 2 days ago How is this breaking? permalink award report block reply\nWexit-Delecto 1 points 2 days ago So it IS treason. And yet, zero arrests. permalink award report block reply TrumpAndSimpsNotMAGA 1 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply\nTrumpAndSimpsNotMAGA 1 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply\nThugLyfeTrump PRO 1 points 2 days ago Crazy shit... permalink award report block reply\nHoganP 1 points 2 days ago She's like a freaking wizard and it's so impressive to watch. permalink award report block reply\nMocksFordComma 1 points 2 days ago You’ll find billions of USAID dollars flowing back into the USA for this color revolution. We’re trillions in debt because we paid for our own Marxist subversion. permalink award report block reply\nEBernays 1 points 2 days ago \"International actors\" 😂🤣😂🤣 permalink award report block reply CuzzinRicky 1 points 2 days ago (((International actors))) permalink parent award report block reply\nCuzzinRicky 1 points 2 days ago (((International actors))) permalink parent award report block reply\nRiehlpissed 0 points 2 days ago In a couple of weeks……. then nothing permalink award report block reply\nknnbccb 1 points 2 days ago Comment removed by community moderators. permalink award report block reply"}