{"id": "1ARK9pfs4Q", "contents": "130 This is exactly what Cheryl Hines told Bill Maher recently: \"The Republicans have been very kind to me, from the beginning. Even when Bobby was running as a Democrat, they weren't mean, and they never have been, and I can’t say that for the Democrats.” \nMaher replied: “I agree. It’s sad, because it’ posted 6 hours ago by kinbergfan 2 comments award share report block Miranda Devine @mirandadevine • 10h This is exactly what Cheryl Hines told Bill Maher recently: \"The Republicans have been very kind to me, from the beginning. Even when Bobby was running as a Democrat, they weren't mean, and they never have been, and I can’t say that for the Democrats.” Maher replied: “I agree. Jason Cohen 🇺🇸 @JasonJournoDC • 21h 🚨NEW: John Fetterman *STUNS* CNN's Dana Bash by telling her how Left crueler than Right🚨 FETTERMAN: \"The Right would say really rough things and names ... but on the Left, it was like they want me to die or that 'We're cheering for your next stroke' ... they even have a gif\n2 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget MediaBro 2 points 6 hours ago Your average Dem sees Republicans as the embodiment of evil itself and you must be killed or silenced. Your average Republican sees Dems as enthusiastic but wrong on most things and in need of correction, not death. But the further we push, the worse it will get, until both sides think the other is evil and must be murdered. permalink award report block reply harryparatestes 1 points 5 hours ago If it comes to that, I like our chances. permalink parent award report block reply Counterwhat 1 points 4 hours ago Feins,\"Oh my God!\" permalink award report block reply\nMediaBro 2 points 6 hours ago Your average Dem sees Republicans as the embodiment of evil itself and you must be killed or silenced. Your average Republican sees Dems as enthusiastic but wrong on most things and in need of correction, not death. But the further we push, the worse it will get, until both sides think the other is evil and must be murdered. permalink award report block reply harryparatestes 1 points 5 hours ago If it comes to that, I like our chances. permalink parent award report block reply\nharryparatestes 1 points 5 hours ago If it comes to that, I like our chances. permalink parent award report block reply\nCounterwhat 1 points 4 hours ago Feins,\"Oh my God!\" permalink award report block reply"}