{"id": "1ARK55bzPi", "contents": "450 🚨 BREAKING: Panic is ensuing after a grand jury subpoenas JOHN BRENNAN and dirty FBI officials Peter Strzok and Lisa Page, following their conspiracy against President Trump\n\nThey are in HUGE trouble! Up to 30 SUBPOENAS being issued in the coming days 🔥 posted 5 days ago by DeusVult1096 26 comments award share report block Eric Daugherty @EricLDaugh • 5d 🚨 BREAKING: Panic is ensuing after a grand jury subpoenas JOHN BRENNAN and dirty FBI officials Peter Strzok and Lisa Page, following their conspiracy against President Trump They are in HUGE trouble! Up to 30 SUBPOENAS being issued in the coming days 🔥\n26 comments Sort by Top Top New Worst Old Save BlackPilledMAGA 12 points 5 days ago Who is panicking? Not them. permalink award report block reply NomadicKrow2 2 points 5 days ago Yeah, tell me how Peter used to suck the Judge's dick and Lisa would fondle his balls. Tell me how the Judge is connected to them in a friendly way and won't recuse himself. In a totally random draw, they somehow always get the one Judge they need. permalink parent award report block reply MickHigan2 -4 points 5 days ago WAOOOOWWW!!! THIS IS IT!!! WHAT WE'VE ALL BEEN WAITING FQR!!!!!! IT'S REAL THIS TIME!!! WHY ARE YOU BEING A D000000MER BRQQQQ??? (Sarcasm font) permalink parent award report block reply UCantStumpTheTrump 3 points 5 days ago Letitia James, Comey, and Bolton have been indicted. What makes you think it’s going to end there? permalink parent award report block reply greatpumpkin 7 points 5 days ago pffffft. Boasberg will somehow be 'randomly' assigned the case, sit on them until after the mid-terms, and afterwards quietly dismiss with prejudice. permalink award report block reply snoopy3210 1 points 4 days ago Why are they saying a probe? It was a freakin investigation of the leading candidate for President based on CIA and MI6 fabricated propaganda and entrapment (they called Don Jr so he would meet with the Russian lawyer they were sending.. the MI6 used a long time contact of the Trump family to create that meeting while they were spreading lies about something nefarious between the campaign and Russia). The CIA also sent Carter Page to Russia in the middle of the campaign to create that fake collusion. Arrest them all. permalink parent award report block reply MickHigan2 1 points 5 days ago Like clockwork. permalink parent award report block reply BenDoverAssho 5 points 5 days ago We must have accountability and consequences for criminals. AT ALL LEVELS OF SOCIETY. Even heads of federal agencies and politicians. Let the evidence speak for itself before a grand jury. Justice is long overdue. permalink award report block reply TrumpAndGodWin 4 points 5 days ago *Especially those in positions of power. permalink parent award report block reply DogFart_ 4 points 5 days ago 2 more weeks? permalink award report block reply UCantStumpTheTrump 3 points 5 days ago Indictments for Comey, Bolton and Letitia James have already been handed down and they’ve been charged with crimes. The real question is, who’s next? permalink parent award report block reply MickHigan2 -3 points 5 days ago 14 days BRQQQQ! permalink parent award report block reply NHMS_observer 1 points 5 days ago Should have happened months ago.  DOJ, get moving with alacrity lest the republic be otherwise lost.  This foot dragging is getting old.   Justice NOW! permalink award report block reply bluebahloo 2 points 4 days ago They want to win in court. Filing an indictment is not like posting a comment. permalink parent award report block reply iamimaginos 1 points 4 days ago Hopefully, those subpeonas are worded sternly permalink award report block reply wookiebush 1 points 4 days ago Huh, I guess the Statute of Limitations has expired for those idiots as that is the ONLY way the GOPe/RINOs would try this, if there was no actual way they would be convicted. W. permalink award report block reply IAmRetard 0 points 5 days ago Hi hum…yawn permalink award report block reply Krat 0 points 5 days ago 0 arrests permalink award report block reply UCantStumpTheTrump 4 points 5 days ago Letitia James, John Bolton, and James Comey would like a word. I see you posting this same comment in every thread, retard faggot shill permalink parent award report block reply aaafirefly123 4 points 5 days ago He won’t be happy unless Trump violates the constitution to have these people extra-judicially killed. No trial, no process, just pure mob “justice” permalink parent award report block reply corporateshizer 0 points 4 days ago Panicking over a subpoena? Doubtful. They'll just say \"I cannot recall,\" and \"I invoke my fifth amendment rights,\" over and over. permalink award report block reply RusherOfDin 0 points 5 days ago Is something actually going to happen? Is somebody actually going to be arrested? permalink award report block reply Aggrieved03 -1 points 5 days ago For the walls are surely closing in and in just a couple more weeks we all shall see. permalink award report block reply UCantStumpTheTrump 4 points 5 days ago James Comey, John Bolton and Letitia James have been charged with crimes. What makes you think that’s the end of it? permalink parent award report block reply TrumpAndGodWin 5 points 5 days ago Sometimes I wonder if this is a demoralization psyop containment site or maybe it's just being attacked by the deep state's shills and bots. Sad. permalink parent award report block reply HoodooOperator 1 points 5 days ago Comment removed by community moderators. permalink award report block reply\nBlackPilledMAGA 12 points 5 days ago Who is panicking? Not them. permalink award report block reply NomadicKrow2 2 points 5 days ago Yeah, tell me how Peter used to suck the Judge's dick and Lisa would fondle his balls. Tell me how the Judge is connected to them in a friendly way and won't recuse himself. In a totally random draw, they somehow always get the one Judge they need. permalink parent award report block reply MickHigan2 -4 points 5 days ago WAOOOOWWW!!! THIS IS IT!!! WHAT WE'VE ALL BEEN WAITING FQR!!!!!! IT'S REAL THIS TIME!!! WHY ARE YOU BEING A D000000MER BRQQQQ??? (Sarcasm font) permalink parent award report block reply UCantStumpTheTrump 3 points 5 days ago Letitia James, Comey, and Bolton have been indicted. What makes you think it’s going to end there? permalink parent award report block reply\nNomadicKrow2 2 points 5 days ago Yeah, tell me how Peter used to suck the Judge's dick and Lisa would fondle his balls. Tell me how the Judge is connected to them in a friendly way and won't recuse himself. In a totally random draw, they somehow always get the one Judge they need. permalink parent award report block reply\nMickHigan2 -4 points 5 days ago WAOOOOWWW!!! THIS IS IT!!! WHAT WE'VE ALL BEEN WAITING FQR!!!!!! IT'S REAL THIS TIME!!! WHY ARE YOU BEING A D000000MER BRQQQQ??? (Sarcasm font) permalink parent award report block reply UCantStumpTheTrump 3 points 5 days ago Letitia James, Comey, and Bolton have been indicted. What makes you think it’s going to end there? permalink parent award report block reply\nUCantStumpTheTrump 3 points 5 days ago Letitia James, Comey, and Bolton have been indicted. What makes you think it’s going to end there? permalink parent award report block reply\ngreatpumpkin 7 points 5 days ago pffffft. Boasberg will somehow be 'randomly' assigned the case, sit on them until after the mid-terms, and afterwards quietly dismiss with prejudice. permalink award report block reply snoopy3210 1 points 4 days ago Why are they saying a probe? It was a freakin investigation of the leading candidate for President based on CIA and MI6 fabricated propaganda and entrapment (they called Don Jr so he would meet with the Russian lawyer they were sending.. the MI6 used a long time contact of the Trump family to create that meeting while they were spreading lies about something nefarious between the campaign and Russia). The CIA also sent Carter Page to Russia in the middle of the campaign to create that fake collusion. Arrest them all. permalink parent award report block reply MickHigan2 1 points 5 days ago Like clockwork. permalink parent award report block reply\nsnoopy3210 1 points 4 days ago Why are they saying a probe? It was a freakin investigation of the leading candidate for President based on CIA and MI6 fabricated propaganda and entrapment (they called Don Jr so he would meet with the Russian lawyer they were sending.. the MI6 used a long time contact of the Trump family to create that meeting while they were spreading lies about something nefarious between the campaign and Russia). The CIA also sent Carter Page to Russia in the middle of the campaign to create that fake collusion. Arrest them all. permalink parent award report block reply\nMickHigan2 1 points 5 days ago Like clockwork. permalink parent award report block reply\nBenDoverAssho 5 points 5 days ago We must have accountability and consequences for criminals. AT ALL LEVELS OF SOCIETY. Even heads of federal agencies and politicians. Let the evidence speak for itself before a grand jury. Justice is long overdue. permalink award report block reply TrumpAndGodWin 4 points 5 days ago *Especially those in positions of power. permalink parent award report block reply\nTrumpAndGodWin 4 points 5 days ago *Especially those in positions of power. permalink parent award report block reply\nDogFart_ 4 points 5 days ago 2 more weeks? permalink award report block reply UCantStumpTheTrump 3 points 5 days ago Indictments for Comey, Bolton and Letitia James have already been handed down and they’ve been charged with crimes. The real question is, who’s next? permalink parent award report block reply MickHigan2 -3 points 5 days ago 14 days BRQQQQ! permalink parent award report block reply\nUCantStumpTheTrump 3 points 5 days ago Indictments for Comey, Bolton and Letitia James have already been handed down and they’ve been charged with crimes. The real question is, who’s next? permalink parent award report block reply\nMickHigan2 -3 points 5 days ago 14 days BRQQQQ! permalink parent award report block reply\nNHMS_observer 1 points 5 days ago Should have happened months ago.  DOJ, get moving with alacrity lest the republic be otherwise lost.  This foot dragging is getting old.   Justice NOW! permalink award report block reply bluebahloo 2 points 4 days ago They want to win in court. Filing an indictment is not like posting a comment. permalink parent award report block reply\nbluebahloo 2 points 4 days ago They want to win in court. Filing an indictment is not like posting a comment. permalink parent award report block reply\niamimaginos 1 points 4 days ago Hopefully, those subpeonas are worded sternly permalink award report block reply\nwookiebush 1 points 4 days ago Huh, I guess the Statute of Limitations has expired for those idiots as that is the ONLY way the GOPe/RINOs would try this, if there was no actual way they would be convicted. W. permalink award report block reply\nIAmRetard 0 points 5 days ago Hi hum…yawn permalink award report block reply\nKrat 0 points 5 days ago 0 arrests permalink award report block reply UCantStumpTheTrump 4 points 5 days ago Letitia James, John Bolton, and James Comey would like a word. I see you posting this same comment in every thread, retard faggot shill permalink parent award report block reply aaafirefly123 4 points 5 days ago He won’t be happy unless Trump violates the constitution to have these people extra-judicially killed. No trial, no process, just pure mob “justice” permalink parent award report block reply\nUCantStumpTheTrump 4 points 5 days ago Letitia James, John Bolton, and James Comey would like a word. I see you posting this same comment in every thread, retard faggot shill permalink parent award report block reply aaafirefly123 4 points 5 days ago He won’t be happy unless Trump violates the constitution to have these people extra-judicially killed. No trial, no process, just pure mob “justice” permalink parent award report block reply\naaafirefly123 4 points 5 days ago He won’t be happy unless Trump violates the constitution to have these people extra-judicially killed. No trial, no process, just pure mob “justice” permalink parent award report block reply\ncorporateshizer 0 points 4 days ago Panicking over a subpoena? Doubtful. They'll just say \"I cannot recall,\" and \"I invoke my fifth amendment rights,\" over and over. permalink award report block reply\nRusherOfDin 0 points 5 days ago Is something actually going to happen? Is somebody actually going to be arrested? permalink award report block reply\nAggrieved03 -1 points 5 days ago For the walls are surely closing in and in just a couple more weeks we all shall see. permalink award report block reply UCantStumpTheTrump 4 points 5 days ago James Comey, John Bolton and Letitia James have been charged with crimes. What makes you think that’s the end of it? permalink parent award report block reply TrumpAndGodWin 5 points 5 days ago Sometimes I wonder if this is a demoralization psyop containment site or maybe it's just being attacked by the deep state's shills and bots. Sad. permalink parent award report block reply\nUCantStumpTheTrump 4 points 5 days ago James Comey, John Bolton and Letitia James have been charged with crimes. What makes you think that’s the end of it? permalink parent award report block reply TrumpAndGodWin 5 points 5 days ago Sometimes I wonder if this is a demoralization psyop containment site or maybe it's just being attacked by the deep state's shills and bots. Sad. permalink parent award report block reply\nTrumpAndGodWin 5 points 5 days ago Sometimes I wonder if this is a demoralization psyop containment site or maybe it's just being attacked by the deep state's shills and bots. Sad. permalink parent award report block reply\nHoodooOperator 1 points 5 days ago Comment removed by community moderators. permalink award report block reply"}