{"id": "1ARK514xEM", "contents": "676 Trump should back off of trying to be world peace keeper and focus on America and its rise of communism. posted 6 days ago by MickHigan2 75 comments award share report block 9mmSMG @9mm_smg • 6d Trump should back out of 100% of foreign issues outside of trade. The entire Middle East? Doesn't matter. Ukraine and Russia? They'll figure it out. Random civil wars and warlords in Africa? That's eternal. He needs to close his eyes to it all and only focus on fixing America. I\n75 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget henri_derelicte 37 points 6 days ago This “president of peace” bullshit is getting tiring. I didn’t vote for a diplomat, I voted for a fighter and a winner permalink award report block reply Porkbut 6 points 6 days ago This is a bs post anyway, mickhigan was all for our intervention when he accused Israel of killing Christians. Now Christians are being killed in sudan and he reposts shit saying we should disengage entirely? He sounds like a propagandist who hates Christians and wants to use them for his political ambitions, which are currently undermining the Trump admin any chance he gets. permalink parent award report block reply keeman 4 points 6 days ago A stopped clock is right twice a day.  This is one of those times. permalink parent award report block reply Porkbut 1 points 6 days ago No he isnt though. Hes saying nothing, like cold reading a room to tell people what their dead relatives think, its a grift of manipulation. You say it yourself, hes telling you what you want to hear. permalink parent award report block reply spinometer2 1 points 6 days ago his peace deals also bring foreign investment which is what we need to keep the dollar on top and add jobs permalink parent award report block reply MoldyLocksNesMonste 21 points 6 days ago Definitely too much time being spent globetrotting when the house is on fire and the arsons are being left to keep starting more fires. permalink award report block reply billhound 11 points 6 days ago I think this misses the point that a lot of what he is doing is detangling the US from a global system. The peace deals in Asia and the one last attempted in Ukraine were about shoring up American supply chains. I think, just like renovations to the white house, there is more than meets the eye. Does it change the fact that eating out fornmy family of 3 is hard to spend less than 100 bucks? Not yet. But i think we are setting the US up for a boom. permalink award report block reply FromNC 4 points 6 days ago I don’t doubt that he is doing positive in his overseas work that will benefit us. BUT, he continues to gaslight us about how well the country is doing and how much better the average person is doing today. That doesn’t resonate with the average middle class individual  that sees the average car price now over $50k, see ground beef at $7/lb, see the average home price in the US nearly $500k yet have an average salary of $66k. The average couple, both making the average salary, cannot afford the average house. permalink parent award report block reply keeman 6 points 6 days ago You have only so much energy and political capital.  Spending it on ending wars in outer bumfuckistan necessitates not spending it here.  And the swamp continues to grow.  He needs to come home and fire nearly everyone in the federal government and replace them with nothing, get all the illegals out, and push id requirements for federal elections. permalink parent award report block reply vongregormench 5 points 6 days ago Trump’s early actions involved reducing the government footprint. This will have a temporary negative effect on the economy. Some of what he has done will take time. Also mass deportations and the slowing of H1 b again momentary negative effects that in the long run help the economy. permalink parent award report block reply Spiritof2015 3 points 6 days ago Eggs are $2, they were $10 under Biden. permalink parent award report block reply FromNC 7 points 6 days ago What’s your point, milk is also $0.99/gallon here where it was $3. I buy eggs once every other month and milk twice a month - those expenses make such a tiny difference in the grand scheme of things. I don’t think the average guy in his 20s that can’t afford a house or a new vehicle is going to resonate with the messaging “Yea eggs cost what they historically have always cost” Cool story, you lost his vote. permalink parent award report block reply billhound 2 points 6 days ago Those items take a long time to fix...but trust me, when landlords have to compete because there arent enough renters, prices drop. When your house sits on the market because of surplus housing, you lower your asking price. When you negotiate trade deals that have foreign governments buying our products,  all that changes Those things. Im not saying it doesnt suck, but what are you actually asking for? A fix or an executive order? permalink parent award report block reply view 1 more comments... Spiritof2015 0 points 6 days ago My point is some food prices have fallen a lot. I'll let you get back to your dooming and pointless stories. permalink parent award report block reply view 5 more comments... Appeal2Heaven98 1 points 6 days ago Where are they $2 for you now when they were $10 under Biden? Where I live, they were $4 a dozen under Biden and have maybe dipped to $3.50 depending on the brand. You're either buying cheaper brands now, which refutes your point, have moved to another state, or are being straight-up dishonest. permalink parent award report block reply Spiritof2015 1 points 6 days ago At the grocery store next door to my house.  Same eggs, different prices. permalink parent award report block reply RuleoVicus 1 points 6 days ago So? And a 5lb box of nails is still $10 (was $4), and every tool is still 50-70% than it was before 2021. A roll of 14/2 wire is $150, used to be $45l Nothing involving the trades, materials or tools, have dropped in prices. permalink parent award report block reply Spiritof2015 2 points 6 days ago So? 5lb box of nails was $4 when? Was $1 once upon a time. So the price of eggs is down. Literally all I said, apparently enough to trigger bitches like they were libtards. permalink parent award report block reply booga 2 points 6 days ago Yeah, it reminds me of Biden's administration constantly saying the economy was good, when the average person experiences differently. I hope Trump starts focusing more on our people in America and stops trying to play world peace maker. permalink parent award report block reply FromNC 5 points 6 days ago I don’t know why kind of anti-Trump people are downvoting you or I, but the most dangerous thing our movement can do is deny reality. What young person that can’t afford a living cares if the stock market hit all time highs. Here’s a simple fact, as a millennial, making 2-3x the national average pay, who bought his first house at 29, that does have a good start on his 401k. I’m not going to sit here and pretend that I’m the average person my age. I am above average, I worked hard for the opportunities I have but my father, my grandfather had it significantly better than I. permalink parent award report block reply Maganifice7 10 points 6 days ago Trump has wasted most of his first year. Then he argues with people who tell him food us still unaffordable. permalink award report block reply I_Am_John_Galt 14 points 6 days ago Wasted?   He has set in motion more systemic changes in 9 months than any president in my lifetime.  It's congress not codifying his EOs into law and judicial warfare that have held back the pace he's moving at. permalink parent award report block reply Magma_Biscuit 9 points 6 days ago This is true permalink parent award report block reply Neonentity 5 points 6 days ago Not just congress.  The entire stinking derpstate is working to subvert MAGA. permalink parent award report block reply Rakkasan91b 3 points 6 days ago I hate to say it, but until Congress actual does something and codify any of those changes into law he has been wasting his time.  I'm also good with presidents brokering peace deals and all, but he really does need to stop focusing so much on external issues and focus on internal issues. permalink parent award report block reply RuleoVicus 0 points 6 days ago I think Trump checked out domestically about 6 months ago. permalink parent award report block reply parttimefed 1 points 6 days ago I think he was chasing that Nobel peace prize permalink parent award report block reply Maganifice7 2 points 6 days ago So you are saying he hasn't accomplished anything. He should be calling out congress nonstop, not endorsing the worst members. permalink parent award report block reply I_Am_John_Galt 1 points 6 days ago I'm not saying that at all.  USAID has been decimated, the border is militarized, deportations are working and ramping up, inflation and unemployment are down, etc permalink parent award report block reply Appeal2Heaven98 2 points 6 days ago True, but how much of that \"systemic change\" will be reversed if a Democrat gets the presidency? How long did it take Biden to reverse nearly everything Trump did? A week? 24 hours? I sometimes think we weren't being realistic about what Trump could do at all. We'd like him to lowkey go full authoritarian, but he won't. And he can't do anything on his agenda with the system in place. permalink parent award report block reply load 1 more comments... Spiritof2015 0 points 6 days ago Trump has wasted most of his first year.? That's ridiculous. I'd love to know what you think you've accomplished this year. permalink parent award report block reply BigGunky 10 points 6 days ago Magnafice7 didn’t bail out the parasites in Israel and Argentina on my dollar, so that’s a start permalink parent award report block reply Spiritof2015 0 points 6 days ago Did he not do that? He is doing the important work of bitching online, so there's that. permalink parent award report block reply Spiritof2015 0 points 6 days ago ..and the important work of downdooting...being a miserable cunt... permalink parent award report block reply hondo1 9 points 6 days ago I'm always for protecting Christians but obviously we need to do more about communism, Islam and the others who want to see us fail at home too. Both are important. permalink award report block reply Appeal2Heaven98 3 points 6 days ago The best way Americans can protect Christians is to stop the spread of Islam on our home turf. permalink parent award report block reply Pede 6 points 6 days ago His term started out stellar. 26 executive orders on day 1 on all kinds of things to take back our country. Then he slowly transitioned to nonstop bullshit about the Israel and Ukraine wars and little else. If he did this shit during his campaign I wouldn't have voted at all. permalink award report block reply Magma_Biscuit 4 points 6 days ago Put yourself in Trumps shoes and think about the absolute brick wall the judicial branch is throwing up at everything he is trying to do domestically. That and the worthless Congress we have had for 30 years or better. permalink parent award report block reply Appeal2Heaven98 2 points 6 days ago I get it. But if anything, that makes it even more demoralizing. permalink parent award report block reply keeptherepublic1776 1 points 6 days ago Not saying not voting is the answer but that's what will happen at we the mod terms because Republican voters are retarded permalink parent award report block reply Mobmando 0 points 6 days ago He could have ended the Ukraine war very quickly. He might not be giving arms directly but the war continues because of his support, especially satellite and other surveillance. At this point, it's mostly Trump's fault the war continues as it would not continue without him. Juice, Epstein and Kirk are also destroying everything that was prayed for. permalink parent award report block reply JoeMcCarthyWasRight 5 points 6 days ago The fact that we need to even say this just goes to show how fucking far Trump has moved from America First. Come on, man. We fucking need you, DJT! permalink award report block reply weltallic 5 points 6 days ago Obama got a Nobel peace prize. Trump wants one, too.  It's his final victory over Obama. No matter the cost. permalink award report block reply ParadigmShift2070 2 points 6 days ago And watch them still deny him one regardless of how peace deals he made permalink parent award report block reply becomelions 4 points 6 days ago this is a really short sighted, ignorant view of things. choosing between foreign and domestic action is a false dichotomy. we can have both. besides, the peace deals lead to trade deals which lead to massive domestic benefits. not to mention securing rare earth minerals, which removed a huge threat by china - something most experts thought was impossible. seems someone is mad trump has been amazingly effective and wants him to back-off. permalink award report block reply Dev404 4 points 6 days ago That's what MAGA was supposed to be, but he seems to be focused on foreign diplomacy and economic issues. That might be his strength, and not so much the law enforcement and justice issues. I think he's relying on Kash and Bondi for that, and they're failing spectacularly with goose egg after goose egg on high profile criminals while arresting a few henchmen here and there as evidence of progress. permalink award report block reply Smurfection 3 points 6 days ago I'm of two minds about that.  In all sincerity and honesty, Presidents are almost monarchs when it comes to foreign policy which is why most presidents almost exclusively act on Foreign policy and rarely do anything for their domestic base aside from the first six months in office. Congress, the House and Senate, should be focusing on domestic laws and policies , regulations and programs but they are often just running around pretending they are the drivers of foreign policy.    The difficulty is Congress is so deeply divided on the issues, so hopeless partisan which is mostly the fault of Democrats (no, it's not a both sides issue.  It is a 90% Democrats don't work with the other side issue) and rarely do congressional  representatives and Senators bother to educate themselves on the issues and make a solution.  Instead they leave statecraft up to lobbyists and then try to put a whole bunch of pork into every bill. I've heard it said and I agree, Congress is a glorified High School with two rival teams.  One team mostly plays by the rules and tries for agreement and the other team will stop at nothing to demonize, undermine, hurt and scuttle the other team.  The problem is neither team really has American citizens interests at heart. permalink award report block reply yummy_yumm_yumms 3 points 6 days ago Hopefully someone in his admin see this shit, this is the most important thing out of ANYTHING. permalink award report block reply vongregormench 3 points 6 days ago Why can’t he do both? Who’s to say he would be doing better domestically if he didn’t engage in diplomacy? permalink award report block reply keeptherepublic1776 6 points 6 days ago Well he's not doing America. permalink parent award report block reply truthjusticetruth 3 points 6 days ago Exactly. He’s eating his time abroad. America first and only America first. permalink award report block reply Barbarella64 3 points 6 days ago I agree permalink award report block reply MisprisionIsEvil 2 points 6 days ago Don't just do something. Stand there. permalink award report block reply Reddit2016 2 points 6 days ago Agreed. Do the tariffs and focus on MAGA in the USA. permalink award report block reply Bidensucksmike 2 points 6 days ago I agree permalink award report block reply UntakenUsername 2 points 6 days ago Amen permalink award report block reply Counterwhat 2 points 6 days ago Unfortunately, he is trying to shove the Nobel prize up their asses. He trying so hard to embarrass them but I agree, it's time to focus on home. permalink award report block reply Mhmm2MoreWeeks 1 points 6 days ago You should probably stay in your own wheel house. You do not understand the world well enough to be giving such advice. Not at all. permalink award report block reply ArnoldF 1 points 6 days ago Don't be stupid. PDJT is more than capable of walking and chewing gum at the same time. permalink award report block reply birddogz 1 points 6 days ago He's been led astray by peoples who nose better.\nLet's hope he comes back to MAGA permalink award report block reply HockeyMom4Trump 1 points 6 days ago Agree. Domestic policy, please. permalink award report block reply becomelions 1 points 6 days ago retard detected. \"Random civil wars and warlords in Africa? That's eternal\" -- no it's china backed islamists removing christians from Africa you dumbfuck permalink award report block reply keeptherepublic1776 1 points 6 days ago WTF do you mean it's not like that's his slogan or anything. Starting to think he's just a grifter at this point permalink award report block reply anomaly47 1 points 6 days ago Exactly- when I hear of a new peace agreement, which may or may not last anyway, I’m yelling “focus on the US!” permalink award report block reply Ice_Joker 0 points 6 days ago What an uninformed statement. Trump requires world peace to protect America. If you run from a fire, it will just spread until it gets to you. Stomp it out where it exists before it kills your children because you think closing your eyes and tending to your own garden was the answer. permalink award report block reply rapskull 1 points 6 days ago Comment removed by community moderators. permalink award report block reply TheDarkEmperor 1 points 6 days ago Comment removed by community moderators. permalink award report block reply\nhenri_derelicte 37 points 6 days ago This “president of peace” bullshit is getting tiring. I didn’t vote for a diplomat, I voted for a fighter and a winner permalink award report block reply Porkbut 6 points 6 days ago This is a bs post anyway, mickhigan was all for our intervention when he accused Israel of killing Christians. Now Christians are being killed in sudan and he reposts shit saying we should disengage entirely? He sounds like a propagandist who hates Christians and wants to use them for his political ambitions, which are currently undermining the Trump admin any chance he gets. permalink parent award report block reply keeman 4 points 6 days ago A stopped clock is right twice a day.  This is one of those times. permalink parent award report block reply Porkbut 1 points 6 days ago No he isnt though. Hes saying nothing, like cold reading a room to tell people what their dead relatives think, its a grift of manipulation. You say it yourself, hes telling you what you want to hear. permalink parent award report block reply spinometer2 1 points 6 days ago his peace deals also bring foreign investment which is what we need to keep the dollar on top and add jobs permalink parent award report block reply\nPorkbut 6 points 6 days ago This is a bs post anyway, mickhigan was all for our intervention when he accused Israel of killing Christians. Now Christians are being killed in sudan and he reposts shit saying we should disengage entirely? He sounds like a propagandist who hates Christians and wants to use them for his political ambitions, which are currently undermining the Trump admin any chance he gets. permalink parent award report block reply keeman 4 points 6 days ago A stopped clock is right twice a day.  This is one of those times. permalink parent award report block reply Porkbut 1 points 6 days ago No he isnt though. Hes saying nothing, like cold reading a room to tell people what their dead relatives think, its a grift of manipulation. You say it yourself, hes telling you what you want to hear. permalink parent award report block reply\nkeeman 4 points 6 days ago A stopped clock is right twice a day.  This is one of those times. permalink parent award report block reply Porkbut 1 points 6 days ago No he isnt though. Hes saying nothing, like cold reading a room to tell people what their dead relatives think, its a grift of manipulation. You say it yourself, hes telling you what you want to hear. permalink parent award report block reply\nPorkbut 1 points 6 days ago No he isnt though. Hes saying nothing, like cold reading a room to tell people what their dead relatives think, its a grift of manipulation. You say it yourself, hes telling you what you want to hear. permalink parent award report block reply\nspinometer2 1 points 6 days ago his peace deals also bring foreign investment which is what we need to keep the dollar on top and add jobs permalink parent award report block reply\nMoldyLocksNesMonste 21 points 6 days ago Definitely too much time being spent globetrotting when the house is on fire and the arsons are being left to keep starting more fires. permalink award report block reply\nbillhound 11 points 6 days ago I think this misses the point that a lot of what he is doing is detangling the US from a global system. The peace deals in Asia and the one last attempted in Ukraine were about shoring up American supply chains. I think, just like renovations to the white house, there is more than meets the eye. Does it change the fact that eating out fornmy family of 3 is hard to spend less than 100 bucks? Not yet. But i think we are setting the US up for a boom. permalink award report block reply FromNC 4 points 6 days ago I don’t doubt that he is doing positive in his overseas work that will benefit us. BUT, he continues to gaslight us about how well the country is doing and how much better the average person is doing today. That doesn’t resonate with the average middle class individual  that sees the average car price now over $50k, see ground beef at $7/lb, see the average home price in the US nearly $500k yet have an average salary of $66k. The average couple, both making the average salary, cannot afford the average house. permalink parent award report block reply keeman 6 points 6 days ago You have only so much energy and political capital.  Spending it on ending wars in outer bumfuckistan necessitates not spending it here.  And the swamp continues to grow.  He needs to come home and fire nearly everyone in the federal government and replace them with nothing, get all the illegals out, and push id requirements for federal elections. permalink parent award report block reply vongregormench 5 points 6 days ago Trump’s early actions involved reducing the government footprint. This will have a temporary negative effect on the economy. Some of what he has done will take time. Also mass deportations and the slowing of H1 b again momentary negative effects that in the long run help the economy. permalink parent award report block reply Spiritof2015 3 points 6 days ago Eggs are $2, they were $10 under Biden. permalink parent award report block reply FromNC 7 points 6 days ago What’s your point, milk is also $0.99/gallon here where it was $3. I buy eggs once every other month and milk twice a month - those expenses make such a tiny difference in the grand scheme of things. I don’t think the average guy in his 20s that can’t afford a house or a new vehicle is going to resonate with the messaging “Yea eggs cost what they historically have always cost” Cool story, you lost his vote. permalink parent award report block reply billhound 2 points 6 days ago Those items take a long time to fix...but trust me, when landlords have to compete because there arent enough renters, prices drop. When your house sits on the market because of surplus housing, you lower your asking price. When you negotiate trade deals that have foreign governments buying our products,  all that changes Those things. Im not saying it doesnt suck, but what are you actually asking for? A fix or an executive order? permalink parent award report block reply view 1 more comments... Spiritof2015 0 points 6 days ago My point is some food prices have fallen a lot. I'll let you get back to your dooming and pointless stories. permalink parent award report block reply view 5 more comments... Appeal2Heaven98 1 points 6 days ago Where are they $2 for you now when they were $10 under Biden? Where I live, they were $4 a dozen under Biden and have maybe dipped to $3.50 depending on the brand. You're either buying cheaper brands now, which refutes your point, have moved to another state, or are being straight-up dishonest. permalink parent award report block reply Spiritof2015 1 points 6 days ago At the grocery store next door to my house.  Same eggs, different prices. permalink parent award report block reply RuleoVicus 1 points 6 days ago So? And a 5lb box of nails is still $10 (was $4), and every tool is still 50-70% than it was before 2021. A roll of 14/2 wire is $150, used to be $45l Nothing involving the trades, materials or tools, have dropped in prices. permalink parent award report block reply Spiritof2015 2 points 6 days ago So? 5lb box of nails was $4 when? Was $1 once upon a time. So the price of eggs is down. Literally all I said, apparently enough to trigger bitches like they were libtards. permalink parent award report block reply booga 2 points 6 days ago Yeah, it reminds me of Biden's administration constantly saying the economy was good, when the average person experiences differently. I hope Trump starts focusing more on our people in America and stops trying to play world peace maker. permalink parent award report block reply FromNC 5 points 6 days ago I don’t know why kind of anti-Trump people are downvoting you or I, but the most dangerous thing our movement can do is deny reality. What young person that can’t afford a living cares if the stock market hit all time highs. Here’s a simple fact, as a millennial, making 2-3x the national average pay, who bought his first house at 29, that does have a good start on his 401k. I’m not going to sit here and pretend that I’m the average person my age. I am above average, I worked hard for the opportunities I have but my father, my grandfather had it significantly better than I. permalink parent award report block reply\nFromNC 4 points 6 days ago I don’t doubt that he is doing positive in his overseas work that will benefit us. BUT, he continues to gaslight us about how well the country is doing and how much better the average person is doing today. That doesn’t resonate with the average middle class individual  that sees the average car price now over $50k, see ground beef at $7/lb, see the average home price in the US nearly $500k yet have an average salary of $66k. The average couple, both making the average salary, cannot afford the average house. permalink parent award report block reply keeman 6 points 6 days ago You have only so much energy and political capital.  Spending it on ending wars in outer bumfuckistan necessitates not spending it here.  And the swamp continues to grow.  He needs to come home and fire nearly everyone in the federal government and replace them with nothing, get all the illegals out, and push id requirements for federal elections. permalink parent award report block reply vongregormench 5 points 6 days ago Trump’s early actions involved reducing the government footprint. This will have a temporary negative effect on the economy. Some of what he has done will take time. Also mass deportations and the slowing of H1 b again momentary negative effects that in the long run help the economy. permalink parent award report block reply Spiritof2015 3 points 6 days ago Eggs are $2, they were $10 under Biden. permalink parent award report block reply FromNC 7 points 6 days ago What’s your point, milk is also $0.99/gallon here where it was $3. I buy eggs once every other month and milk twice a month - those expenses make such a tiny difference in the grand scheme of things. I don’t think the average guy in his 20s that can’t afford a house or a new vehicle is going to resonate with the messaging “Yea eggs cost what they historically have always cost” Cool story, you lost his vote. permalink parent award report block reply billhound 2 points 6 days ago Those items take a long time to fix...but trust me, when landlords have to compete because there arent enough renters, prices drop. When your house sits on the market because of surplus housing, you lower your asking price. When you negotiate trade deals that have foreign governments buying our products,  all that changes Those things. Im not saying it doesnt suck, but what are you actually asking for? A fix or an executive order? permalink parent award report block reply view 1 more comments... Spiritof2015 0 points 6 days ago My point is some food prices have fallen a lot. I'll let you get back to your dooming and pointless stories. permalink parent award report block reply view 5 more comments... Appeal2Heaven98 1 points 6 days ago Where are they $2 for you now when they were $10 under Biden? Where I live, they were $4 a dozen under Biden and have maybe dipped to $3.50 depending on the brand. You're either buying cheaper brands now, which refutes your point, have moved to another state, or are being straight-up dishonest. permalink parent award report block reply Spiritof2015 1 points 6 days ago At the grocery store next door to my house.  Same eggs, different prices. permalink parent award report block reply RuleoVicus 1 points 6 days ago So? And a 5lb box of nails is still $10 (was $4), and every tool is still 50-70% than it was before 2021. A roll of 14/2 wire is $150, used to be $45l Nothing involving the trades, materials or tools, have dropped in prices. permalink parent award report block reply Spiritof2015 2 points 6 days ago So? 5lb box of nails was $4 when? Was $1 once upon a time. So the price of eggs is down. Literally all I said, apparently enough to trigger bitches like they were libtards. permalink parent award report block reply booga 2 points 6 days ago Yeah, it reminds me of Biden's administration constantly saying the economy was good, when the average person experiences differently. I hope Trump starts focusing more on our people in America and stops trying to play world peace maker. permalink parent award report block reply FromNC 5 points 6 days ago I don’t know why kind of anti-Trump people are downvoting you or I, but the most dangerous thing our movement can do is deny reality. What young person that can’t afford a living cares if the stock market hit all time highs. Here’s a simple fact, as a millennial, making 2-3x the national average pay, who bought his first house at 29, that does have a good start on his 401k. I’m not going to sit here and pretend that I’m the average person my age. I am above average, I worked hard for the opportunities I have but my father, my grandfather had it significantly better than I. permalink parent award report block reply\nkeeman 6 points 6 days ago You have only so much energy and political capital.  Spending it on ending wars in outer bumfuckistan necessitates not spending it here.  And the swamp continues to grow.  He needs to come home and fire nearly everyone in the federal government and replace them with nothing, get all the illegals out, and push id requirements for federal elections. permalink parent award report block reply\nvongregormench 5 points 6 days ago Trump’s early actions involved reducing the government footprint. This will have a temporary negative effect on the economy. Some of what he has done will take time. Also mass deportations and the slowing of H1 b again momentary negative effects that in the long run help the economy. permalink parent award report block reply\nSpiritof2015 3 points 6 days ago Eggs are $2, they were $10 under Biden. permalink parent award report block reply FromNC 7 points 6 days ago What’s your point, milk is also $0.99/gallon here where it was $3. I buy eggs once every other month and milk twice a month - those expenses make such a tiny difference in the grand scheme of things. I don’t think the average guy in his 20s that can’t afford a house or a new vehicle is going to resonate with the messaging “Yea eggs cost what they historically have always cost” Cool story, you lost his vote. permalink parent award report block reply billhound 2 points 6 days ago Those items take a long time to fix...but trust me, when landlords have to compete because there arent enough renters, prices drop. When your house sits on the market because of surplus housing, you lower your asking price. When you negotiate trade deals that have foreign governments buying our products,  all that changes Those things. Im not saying it doesnt suck, but what are you actually asking for? A fix or an executive order? permalink parent award report block reply view 1 more comments... Spiritof2015 0 points 6 days ago My point is some food prices have fallen a lot. I'll let you get back to your dooming and pointless stories. permalink parent award report block reply view 5 more comments... Appeal2Heaven98 1 points 6 days ago Where are they $2 for you now when they were $10 under Biden? Where I live, they were $4 a dozen under Biden and have maybe dipped to $3.50 depending on the brand. You're either buying cheaper brands now, which refutes your point, have moved to another state, or are being straight-up dishonest. permalink parent award report block reply Spiritof2015 1 points 6 days ago At the grocery store next door to my house.  Same eggs, different prices. permalink parent award report block reply RuleoVicus 1 points 6 days ago So? And a 5lb box of nails is still $10 (was $4), and every tool is still 50-70% than it was before 2021. A roll of 14/2 wire is $150, used to be $45l Nothing involving the trades, materials or tools, have dropped in prices. permalink parent award report block reply Spiritof2015 2 points 6 days ago So? 5lb box of nails was $4 when? Was $1 once upon a time. So the price of eggs is down. Literally all I said, apparently enough to trigger bitches like they were libtards. permalink parent award report block reply\nFromNC 7 points 6 days ago What’s your point, milk is also $0.99/gallon here where it was $3. I buy eggs once every other month and milk twice a month - those expenses make such a tiny difference in the grand scheme of things. I don’t think the average guy in his 20s that can’t afford a house or a new vehicle is going to resonate with the messaging “Yea eggs cost what they historically have always cost” Cool story, you lost his vote. permalink parent award report block reply billhound 2 points 6 days ago Those items take a long time to fix...but trust me, when landlords have to compete because there arent enough renters, prices drop. When your house sits on the market because of surplus housing, you lower your asking price. When you negotiate trade deals that have foreign governments buying our products,  all that changes Those things. Im not saying it doesnt suck, but what are you actually asking for? A fix or an executive order? permalink parent award report block reply view 1 more comments... Spiritof2015 0 points 6 days ago My point is some food prices have fallen a lot. I'll let you get back to your dooming and pointless stories. permalink parent award report block reply view 5 more comments...\nbillhound 2 points 6 days ago Those items take a long time to fix...but trust me, when landlords have to compete because there arent enough renters, prices drop. When your house sits on the market because of surplus housing, you lower your asking price. When you negotiate trade deals that have foreign governments buying our products,  all that changes Those things. Im not saying it doesnt suck, but what are you actually asking for? A fix or an executive order? permalink parent award report block reply view 1 more comments...\nSpiritof2015 0 points 6 days ago My point is some food prices have fallen a lot. I'll let you get back to your dooming and pointless stories. permalink parent award report block reply view 5 more comments...\nAppeal2Heaven98 1 points 6 days ago Where are they $2 for you now when they were $10 under Biden? Where I live, they were $4 a dozen under Biden and have maybe dipped to $3.50 depending on the brand. You're either buying cheaper brands now, which refutes your point, have moved to another state, or are being straight-up dishonest. permalink parent award report block reply Spiritof2015 1 points 6 days ago At the grocery store next door to my house.  Same eggs, different prices. permalink parent award report block reply\nSpiritof2015 1 points 6 days ago At the grocery store next door to my house.  Same eggs, different prices. permalink parent award report block reply\nRuleoVicus 1 points 6 days ago So? And a 5lb box of nails is still $10 (was $4), and every tool is still 50-70% than it was before 2021. A roll of 14/2 wire is $150, used to be $45l Nothing involving the trades, materials or tools, have dropped in prices. permalink parent award report block reply Spiritof2015 2 points 6 days ago So? 5lb box of nails was $4 when? Was $1 once upon a time. So the price of eggs is down. Literally all I said, apparently enough to trigger bitches like they were libtards. permalink parent award report block reply\nSpiritof2015 2 points 6 days ago So? 5lb box of nails was $4 when? Was $1 once upon a time. So the price of eggs is down. Literally all I said, apparently enough to trigger bitches like they were libtards. permalink parent award report block reply\nbooga 2 points 6 days ago Yeah, it reminds me of Biden's administration constantly saying the economy was good, when the average person experiences differently. I hope Trump starts focusing more on our people in America and stops trying to play world peace maker. permalink parent award report block reply FromNC 5 points 6 days ago I don’t know why kind of anti-Trump people are downvoting you or I, but the most dangerous thing our movement can do is deny reality. What young person that can’t afford a living cares if the stock market hit all time highs. Here’s a simple fact, as a millennial, making 2-3x the national average pay, who bought his first house at 29, that does have a good start on his 401k. I’m not going to sit here and pretend that I’m the average person my age. I am above average, I worked hard for the opportunities I have but my father, my grandfather had it significantly better than I. permalink parent award report block reply\nFromNC 5 points 6 days ago I don’t know why kind of anti-Trump people are downvoting you or I, but the most dangerous thing our movement can do is deny reality. What young person that can’t afford a living cares if the stock market hit all time highs. Here’s a simple fact, as a millennial, making 2-3x the national average pay, who bought his first house at 29, that does have a good start on his 401k. I’m not going to sit here and pretend that I’m the average person my age. I am above average, I worked hard for the opportunities I have but my father, my grandfather had it significantly better than I. permalink parent award report block reply\nMaganifice7 10 points 6 days ago Trump has wasted most of his first year. Then he argues with people who tell him food us still unaffordable. permalink award report block reply I_Am_John_Galt 14 points 6 days ago Wasted?   He has set in motion more systemic changes in 9 months than any president in my lifetime.  It's congress not codifying his EOs into law and judicial warfare that have held back the pace he's moving at. permalink parent award report block reply Magma_Biscuit 9 points 6 days ago This is true permalink parent award report block reply Neonentity 5 points 6 days ago Not just congress.  The entire stinking derpstate is working to subvert MAGA. permalink parent award report block reply Rakkasan91b 3 points 6 days ago I hate to say it, but until Congress actual does something and codify any of those changes into law he has been wasting his time.  I'm also good with presidents brokering peace deals and all, but he really does need to stop focusing so much on external issues and focus on internal issues. permalink parent award report block reply RuleoVicus 0 points 6 days ago I think Trump checked out domestically about 6 months ago. permalink parent award report block reply parttimefed 1 points 6 days ago I think he was chasing that Nobel peace prize permalink parent award report block reply Maganifice7 2 points 6 days ago So you are saying he hasn't accomplished anything. He should be calling out congress nonstop, not endorsing the worst members. permalink parent award report block reply I_Am_John_Galt 1 points 6 days ago I'm not saying that at all.  USAID has been decimated, the border is militarized, deportations are working and ramping up, inflation and unemployment are down, etc permalink parent award report block reply Appeal2Heaven98 2 points 6 days ago True, but how much of that \"systemic change\" will be reversed if a Democrat gets the presidency? How long did it take Biden to reverse nearly everything Trump did? A week? 24 hours? I sometimes think we weren't being realistic about what Trump could do at all. We'd like him to lowkey go full authoritarian, but he won't. And he can't do anything on his agenda with the system in place. permalink parent award report block reply load 1 more comments... Spiritof2015 0 points 6 days ago Trump has wasted most of his first year.? That's ridiculous. I'd love to know what you think you've accomplished this year. permalink parent award report block reply BigGunky 10 points 6 days ago Magnafice7 didn’t bail out the parasites in Israel and Argentina on my dollar, so that’s a start permalink parent award report block reply Spiritof2015 0 points 6 days ago Did he not do that? He is doing the important work of bitching online, so there's that. permalink parent award report block reply Spiritof2015 0 points 6 days ago ..and the important work of downdooting...being a miserable cunt... permalink parent award report block reply\nI_Am_John_Galt 14 points 6 days ago Wasted?   He has set in motion more systemic changes in 9 months than any president in my lifetime.  It's congress not codifying his EOs into law and judicial warfare that have held back the pace he's moving at. permalink parent award report block reply Magma_Biscuit 9 points 6 days ago This is true permalink parent award report block reply Neonentity 5 points 6 days ago Not just congress.  The entire stinking derpstate is working to subvert MAGA. permalink parent award report block reply Rakkasan91b 3 points 6 days ago I hate to say it, but until Congress actual does something and codify any of those changes into law he has been wasting his time.  I'm also good with presidents brokering peace deals and all, but he really does need to stop focusing so much on external issues and focus on internal issues. permalink parent award report block reply RuleoVicus 0 points 6 days ago I think Trump checked out domestically about 6 months ago. permalink parent award report block reply parttimefed 1 points 6 days ago I think he was chasing that Nobel peace prize permalink parent award report block reply Maganifice7 2 points 6 days ago So you are saying he hasn't accomplished anything. He should be calling out congress nonstop, not endorsing the worst members. permalink parent award report block reply I_Am_John_Galt 1 points 6 days ago I'm not saying that at all.  USAID has been decimated, the border is militarized, deportations are working and ramping up, inflation and unemployment are down, etc permalink parent award report block reply Appeal2Heaven98 2 points 6 days ago True, but how much of that \"systemic change\" will be reversed if a Democrat gets the presidency? How long did it take Biden to reverse nearly everything Trump did? A week? 24 hours? I sometimes think we weren't being realistic about what Trump could do at all. We'd like him to lowkey go full authoritarian, but he won't. And he can't do anything on his agenda with the system in place. permalink parent award report block reply load 1 more comments...\nMagma_Biscuit 9 points 6 days ago This is true permalink parent award report block reply\nNeonentity 5 points 6 days ago Not just congress.  The entire stinking derpstate is working to subvert MAGA. permalink parent award report block reply\nRakkasan91b 3 points 6 days ago I hate to say it, but until Congress actual does something and codify any of those changes into law he has been wasting his time.  I'm also good with presidents brokering peace deals and all, but he really does need to stop focusing so much on external issues and focus on internal issues. permalink parent award report block reply RuleoVicus 0 points 6 days ago I think Trump checked out domestically about 6 months ago. permalink parent award report block reply parttimefed 1 points 6 days ago I think he was chasing that Nobel peace prize permalink parent award report block reply\nRuleoVicus 0 points 6 days ago I think Trump checked out domestically about 6 months ago. permalink parent award report block reply parttimefed 1 points 6 days ago I think he was chasing that Nobel peace prize permalink parent award report block reply\nparttimefed 1 points 6 days ago I think he was chasing that Nobel peace prize permalink parent award report block reply\nMaganifice7 2 points 6 days ago So you are saying he hasn't accomplished anything. He should be calling out congress nonstop, not endorsing the worst members. permalink parent award report block reply I_Am_John_Galt 1 points 6 days ago I'm not saying that at all.  USAID has been decimated, the border is militarized, deportations are working and ramping up, inflation and unemployment are down, etc permalink parent award report block reply\nI_Am_John_Galt 1 points 6 days ago I'm not saying that at all.  USAID has been decimated, the border is militarized, deportations are working and ramping up, inflation and unemployment are down, etc permalink parent award report block reply\nAppeal2Heaven98 2 points 6 days ago True, but how much of that \"systemic change\" will be reversed if a Democrat gets the presidency? How long did it take Biden to reverse nearly everything Trump did? A week? 24 hours? I sometimes think we weren't being realistic about what Trump could do at all. We'd like him to lowkey go full authoritarian, but he won't. And he can't do anything on his agenda with the system in place. permalink parent award report block reply\nSpiritof2015 0 points 6 days ago Trump has wasted most of his first year.? That's ridiculous. I'd love to know what you think you've accomplished this year. permalink parent award report block reply BigGunky 10 points 6 days ago Magnafice7 didn’t bail out the parasites in Israel and Argentina on my dollar, so that’s a start permalink parent award report block reply Spiritof2015 0 points 6 days ago Did he not do that? He is doing the important work of bitching online, so there's that. permalink parent award report block reply Spiritof2015 0 points 6 days ago ..and the important work of downdooting...being a miserable cunt... permalink parent award report block reply\nBigGunky 10 points 6 days ago Magnafice7 didn’t bail out the parasites in Israel and Argentina on my dollar, so that’s a start permalink parent award report block reply Spiritof2015 0 points 6 days ago Did he not do that? He is doing the important work of bitching online, so there's that. permalink parent award report block reply Spiritof2015 0 points 6 days ago ..and the important work of downdooting...being a miserable cunt... permalink parent award report block reply\nSpiritof2015 0 points 6 days ago Did he not do that? He is doing the important work of bitching online, so there's that. permalink parent award report block reply\nSpiritof2015 0 points 6 days ago ..and the important work of downdooting...being a miserable cunt... permalink parent award report block reply\nhondo1 9 points 6 days ago I'm always for protecting Christians but obviously we need to do more about communism, Islam and the others who want to see us fail at home too. Both are important. permalink award report block reply Appeal2Heaven98 3 points 6 days ago The best way Americans can protect Christians is to stop the spread of Islam on our home turf. permalink parent award report block reply\nAppeal2Heaven98 3 points 6 days ago The best way Americans can protect Christians is to stop the spread of Islam on our home turf. permalink parent award report block reply\nPede 6 points 6 days ago His term started out stellar. 26 executive orders on day 1 on all kinds of things to take back our country. Then he slowly transitioned to nonstop bullshit about the Israel and Ukraine wars and little else. If he did this shit during his campaign I wouldn't have voted at all. permalink award report block reply Magma_Biscuit 4 points 6 days ago Put yourself in Trumps shoes and think about the absolute brick wall the judicial branch is throwing up at everything he is trying to do domestically. That and the worthless Congress we have had for 30 years or better. permalink parent award report block reply Appeal2Heaven98 2 points 6 days ago I get it. But if anything, that makes it even more demoralizing. permalink parent award report block reply keeptherepublic1776 1 points 6 days ago Not saying not voting is the answer but that's what will happen at we the mod terms because Republican voters are retarded permalink parent award report block reply Mobmando 0 points 6 days ago He could have ended the Ukraine war very quickly. He might not be giving arms directly but the war continues because of his support, especially satellite and other surveillance. At this point, it's mostly Trump's fault the war continues as it would not continue without him. Juice, Epstein and Kirk are also destroying everything that was prayed for. permalink parent award report block reply\nMagma_Biscuit 4 points 6 days ago Put yourself in Trumps shoes and think about the absolute brick wall the judicial branch is throwing up at everything he is trying to do domestically. That and the worthless Congress we have had for 30 years or better. permalink parent award report block reply Appeal2Heaven98 2 points 6 days ago I get it. But if anything, that makes it even more demoralizing. permalink parent award report block reply\nAppeal2Heaven98 2 points 6 days ago I get it. But if anything, that makes it even more demoralizing. permalink parent award report block reply\nkeeptherepublic1776 1 points 6 days ago Not saying not voting is the answer but that's what will happen at we the mod terms because Republican voters are retarded permalink parent award report block reply\nMobmando 0 points 6 days ago He could have ended the Ukraine war very quickly. He might not be giving arms directly but the war continues because of his support, especially satellite and other surveillance. At this point, it's mostly Trump's fault the war continues as it would not continue without him. Juice, Epstein and Kirk are also destroying everything that was prayed for. permalink parent award report block reply\nJoeMcCarthyWasRight 5 points 6 days ago The fact that we need to even say this just goes to show how fucking far Trump has moved from America First. Come on, man. We fucking need you, DJT! permalink award report block reply\nweltallic 5 points 6 days ago Obama got a Nobel peace prize. Trump wants one, too.  It's his final victory over Obama. No matter the cost. permalink award report block reply ParadigmShift2070 2 points 6 days ago And watch them still deny him one regardless of how peace deals he made permalink parent award report block reply\nParadigmShift2070 2 points 6 days ago And watch them still deny him one regardless of how peace deals he made permalink parent award report block reply\nbecomelions 4 points 6 days ago this is a really short sighted, ignorant view of things. choosing between foreign and domestic action is a false dichotomy. we can have both. besides, the peace deals lead to trade deals which lead to massive domestic benefits. not to mention securing rare earth minerals, which removed a huge threat by china - something most experts thought was impossible. seems someone is mad trump has been amazingly effective and wants him to back-off. permalink award report block reply\nDev404 4 points 6 days ago That's what MAGA was supposed to be, but he seems to be focused on foreign diplomacy and economic issues. That might be his strength, and not so much the law enforcement and justice issues. I think he's relying on Kash and Bondi for that, and they're failing spectacularly with goose egg after goose egg on high profile criminals while arresting a few henchmen here and there as evidence of progress. permalink award report block reply\nSmurfection 3 points 6 days ago I'm of two minds about that.  In all sincerity and honesty, Presidents are almost monarchs when it comes to foreign policy which is why most presidents almost exclusively act on Foreign policy and rarely do anything for their domestic base aside from the first six months in office. Congress, the House and Senate, should be focusing on domestic laws and policies , regulations and programs but they are often just running around pretending they are the drivers of foreign policy.    The difficulty is Congress is so deeply divided on the issues, so hopeless partisan which is mostly the fault of Democrats (no, it's not a both sides issue.  It is a 90% Democrats don't work with the other side issue) and rarely do congressional  representatives and Senators bother to educate themselves on the issues and make a solution.  Instead they leave statecraft up to lobbyists and then try to put a whole bunch of pork into every bill. I've heard it said and I agree, Congress is a glorified High School with two rival teams.  One team mostly plays by the rules and tries for agreement and the other team will stop at nothing to demonize, undermine, hurt and scuttle the other team.  The problem is neither team really has American citizens interests at heart. permalink award report block reply\nyummy_yumm_yumms 3 points 6 days ago Hopefully someone in his admin see this shit, this is the most important thing out of ANYTHING. permalink award report block reply\nvongregormench 3 points 6 days ago Why can’t he do both? Who’s to say he would be doing better domestically if he didn’t engage in diplomacy? permalink award report block reply keeptherepublic1776 6 points 6 days ago Well he's not doing America. permalink parent award report block reply\nkeeptherepublic1776 6 points 6 days ago Well he's not doing America. permalink parent award report block reply\ntruthjusticetruth 3 points 6 days ago Exactly. He’s eating his time abroad. America first and only America first. permalink award report block reply\nBarbarella64 3 points 6 days ago I agree permalink award report block reply\nMisprisionIsEvil 2 points 6 days ago Don't just do something. Stand there. permalink award report block reply\nReddit2016 2 points 6 days ago Agreed. Do the tariffs and focus on MAGA in the USA. permalink award report block reply\nBidensucksmike 2 points 6 days ago I agree permalink award report block reply\nUntakenUsername 2 points 6 days ago Amen permalink award report block reply\nCounterwhat 2 points 6 days ago Unfortunately, he is trying to shove the Nobel prize up their asses. He trying so hard to embarrass them but I agree, it's time to focus on home. permalink award report block reply\nMhmm2MoreWeeks 1 points 6 days ago You should probably stay in your own wheel house. You do not understand the world well enough to be giving such advice. Not at all. permalink award report block reply\nArnoldF 1 points 6 days ago Don't be stupid. PDJT is more than capable of walking and chewing gum at the same time. permalink award report block reply\nbirddogz 1 points 6 days ago He's been led astray by peoples who nose better.\nLet's hope he comes back to MAGA permalink award report block reply\nHockeyMom4Trump 1 points 6 days ago Agree. Domestic policy, please. permalink award report block reply\nbecomelions 1 points 6 days ago retard detected. \"Random civil wars and warlords in Africa? That's eternal\" -- no it's china backed islamists removing christians from Africa you dumbfuck permalink award report block reply\nkeeptherepublic1776 1 points 6 days ago WTF do you mean it's not like that's his slogan or anything. Starting to think he's just a grifter at this point permalink award report block reply\nanomaly47 1 points 6 days ago Exactly- when I hear of a new peace agreement, which may or may not last anyway, I’m yelling “focus on the US!” permalink award report block reply\nIce_Joker 0 points 6 days ago What an uninformed statement. Trump requires world peace to protect America. If you run from a fire, it will just spread until it gets to you. Stomp it out where it exists before it kills your children because you think closing your eyes and tending to your own garden was the answer. permalink award report block reply\nrapskull 1 points 6 days ago Comment removed by community moderators. permalink award report block reply\nTheDarkEmperor 1 points 6 days ago Comment removed by community moderators. permalink award report block reply"}