{"id": "1ARK9nP5IT", "contents": "56 The Trump admin has been streamlining H-1Bs and naturalizing record numbers of \"new citizens\" according to Kristi Noem. posted 3 hours ago by Hugs 8 comments award share report block Disclose.tv @disclosetv • 8h NOW - DHS Secretary Noem on H-1Bs: \"Under the Trump admin, we've sped up our process and added integrity to the visa programs, to green cards, to all of that, but also more people are becoming naturalized under this admin than ever before. More people are becoming citizens.\"\n8 comments Sort by Top Top New Worst Old Save Senaleb 7 points 3 hours ago Trust me, when Trump brought that cunt from Oregon with 2 last names who was literally an anti-Trumper to run the dept. of labor my fear is what is happening. We got bait and switched. permalink award report block reply spezisacuckold 3 points 2 hours ago I voted explicitly against this! permalink award report block reply fightfightfightx 1 points 2 hours ago Trumps way better than Kamala but man he's been a huge disappointment. permalink award report block reply TOPDAWG23 -4 points 3 hours ago What? Maybe they’re trying to cut back on H-1Bs? As for green cards — what’s the issue with that? Legal immigrants are fine. Seems like you guys are just complaining to complain. permalink award report block reply Hugs OP 3 points 3 hours ago No, legal immigrants are not fine. Legal immigrants replace whites, suppress wages, and accept lower standards that lead to lower standards for all. Western countries don't just need to stop immigration, they need to denaturalize and deport millions. And yes, I'm past caring about racism. Whites are a fast-shrinking, tiny minority, and the great countries that past generations of whites built are being lost. permalink parent award report block reply _Sully_ 0 points 2 hours ago You were never gonna get that. So you're mad that you wanted something impossible to happen. Do you want to lose? Cuz that's what you'll get. A big fat nothing. So instead of getting something that edges you closer to the better you'll get the exact opposite of what you want because it isn't this perfect thing. You have to first get the reins of power then you can wield it. You will lose everything the other way. At least recognize when you have a path to victory and I can tell you thinking you're gonna have some ethnostate just gives those with way more power than you license to crush you before you wake up in the morning. You have to make them think you're working with them but you are actually slowly chipping away. 20 years ago I thought you'd be crazy if you said we'd have literal trannie snipers supported by the mainstream. Well that's because they chipped away at you until they had power over you. I want actual power and not this bigoted groveling where I have to beg to exist. permalink parent award report block reply Hugs OP 1 points 1 hour ago Your comment reads like some methed-out fever dream. No thanks. permalink parent award report block reply _Sully_ 1 points 1 hour ago I'm the one with the fever-dream? Keep wishing for your la-la land, bro. I'm sure if you keep doing the same thing over and over again it'll eventually work. permalink parent award report block reply\nSenaleb 7 points 3 hours ago Trust me, when Trump brought that cunt from Oregon with 2 last names who was literally an anti-Trumper to run the dept. of labor my fear is what is happening. We got bait and switched. permalink award report block reply\nspezisacuckold 3 points 2 hours ago I voted explicitly against this! permalink award report block reply\nfightfightfightx 1 points 2 hours ago Trumps way better than Kamala but man he's been a huge disappointment. permalink award report block reply\nTOPDAWG23 -4 points 3 hours ago What? Maybe they’re trying to cut back on H-1Bs? As for green cards — what’s the issue with that? Legal immigrants are fine. Seems like you guys are just complaining to complain. permalink award report block reply Hugs OP 3 points 3 hours ago No, legal immigrants are not fine. Legal immigrants replace whites, suppress wages, and accept lower standards that lead to lower standards for all. Western countries don't just need to stop immigration, they need to denaturalize and deport millions. And yes, I'm past caring about racism. Whites are a fast-shrinking, tiny minority, and the great countries that past generations of whites built are being lost. permalink parent award report block reply _Sully_ 0 points 2 hours ago You were never gonna get that. So you're mad that you wanted something impossible to happen. Do you want to lose? Cuz that's what you'll get. A big fat nothing. So instead of getting something that edges you closer to the better you'll get the exact opposite of what you want because it isn't this perfect thing. You have to first get the reins of power then you can wield it. You will lose everything the other way. At least recognize when you have a path to victory and I can tell you thinking you're gonna have some ethnostate just gives those with way more power than you license to crush you before you wake up in the morning. You have to make them think you're working with them but you are actually slowly chipping away. 20 years ago I thought you'd be crazy if you said we'd have literal trannie snipers supported by the mainstream. Well that's because they chipped away at you until they had power over you. I want actual power and not this bigoted groveling where I have to beg to exist. permalink parent award report block reply Hugs OP 1 points 1 hour ago Your comment reads like some methed-out fever dream. No thanks. permalink parent award report block reply _Sully_ 1 points 1 hour ago I'm the one with the fever-dream? Keep wishing for your la-la land, bro. I'm sure if you keep doing the same thing over and over again it'll eventually work. permalink parent award report block reply\nHugs OP 3 points 3 hours ago No, legal immigrants are not fine. Legal immigrants replace whites, suppress wages, and accept lower standards that lead to lower standards for all. Western countries don't just need to stop immigration, they need to denaturalize and deport millions. And yes, I'm past caring about racism. Whites are a fast-shrinking, tiny minority, and the great countries that past generations of whites built are being lost. permalink parent award report block reply _Sully_ 0 points 2 hours ago You were never gonna get that. So you're mad that you wanted something impossible to happen. Do you want to lose? Cuz that's what you'll get. A big fat nothing. So instead of getting something that edges you closer to the better you'll get the exact opposite of what you want because it isn't this perfect thing. You have to first get the reins of power then you can wield it. You will lose everything the other way. At least recognize when you have a path to victory and I can tell you thinking you're gonna have some ethnostate just gives those with way more power than you license to crush you before you wake up in the morning. You have to make them think you're working with them but you are actually slowly chipping away. 20 years ago I thought you'd be crazy if you said we'd have literal trannie snipers supported by the mainstream. Well that's because they chipped away at you until they had power over you. I want actual power and not this bigoted groveling where I have to beg to exist. permalink parent award report block reply Hugs OP 1 points 1 hour ago Your comment reads like some methed-out fever dream. No thanks. permalink parent award report block reply _Sully_ 1 points 1 hour ago I'm the one with the fever-dream? Keep wishing for your la-la land, bro. I'm sure if you keep doing the same thing over and over again it'll eventually work. permalink parent award report block reply\n_Sully_ 0 points 2 hours ago You were never gonna get that. So you're mad that you wanted something impossible to happen. Do you want to lose? Cuz that's what you'll get. A big fat nothing. So instead of getting something that edges you closer to the better you'll get the exact opposite of what you want because it isn't this perfect thing. You have to first get the reins of power then you can wield it. You will lose everything the other way. At least recognize when you have a path to victory and I can tell you thinking you're gonna have some ethnostate just gives those with way more power than you license to crush you before you wake up in the morning. You have to make them think you're working with them but you are actually slowly chipping away. 20 years ago I thought you'd be crazy if you said we'd have literal trannie snipers supported by the mainstream. Well that's because they chipped away at you until they had power over you. I want actual power and not this bigoted groveling where I have to beg to exist. permalink parent award report block reply Hugs OP 1 points 1 hour ago Your comment reads like some methed-out fever dream. No thanks. permalink parent award report block reply _Sully_ 1 points 1 hour ago I'm the one with the fever-dream? Keep wishing for your la-la land, bro. I'm sure if you keep doing the same thing over and over again it'll eventually work. permalink parent award report block reply\nHugs OP 1 points 1 hour ago Your comment reads like some methed-out fever dream. No thanks. permalink parent award report block reply _Sully_ 1 points 1 hour ago I'm the one with the fever-dream? Keep wishing for your la-la land, bro. I'm sure if you keep doing the same thing over and over again it'll eventually work. permalink parent award report block reply\n_Sully_ 1 points 1 hour ago I'm the one with the fever-dream? Keep wishing for your la-la land, bro. I'm sure if you keep doing the same thing over and over again it'll eventually work. permalink parent award report block reply"}