{"id": "1ARK57qrRg", "contents": "524 She locked her X account right after.. posted 4 days ago by kek_saved_the_world 33 comments award share download report block\n33 comments Sort by Top Top New Worst Old Save Around the Web Hair Will Grow Back! No Matter How Severe The Baldness HaloGrow Tongs_Ya_Bass 34 points 4 days ago I hate they way they frame \"questions\", reminds me of the BBC bitch who tried it on Jordan Peterson and she got humiliated. Manipulative little fuckers. permalink award report block reply bigdickhangsright 10 points 4 days ago When you think about it they both got offended over genetics. permalink parent award report block reply clint_bronson 4 points 4 days ago It wasn't BBC but channel4, im not british, but im guessing one Is cucked and the other is state owned cuck permalink parent award report block reply Tongs_Ya_Bass 1 points 3 days ago You're right, also the GQ interview with the other feminist was a good one. All propaganda lying anti-British, anti-Christian parasites. It's really only the old NPC'S that watch them, just like boomers and Fox news in the US I suppose. permalink parent award report block reply Ifeargovtmorethan 23 points 4 days ago She will be a meme forever....LOL permalink award report block reply just2groovy 13 points 4 days ago Doesn't GQ stand for Gentleman's Quarterly? permalink award report block reply Nate_Higgersalot 9 points 4 days ago Gay Queers. permalink parent award report block reply Meister_Bockmist 6 points 4 days ago IT'S GENTLEMA'AMs!!!! permalink parent award report block reply just2groovy 2 points 4 days ago hahaha permalink parent award report block reply QSWO1 13 points 4 days ago But you should be ashamed of your manface. Good jeans. permalink award report block reply PosterIsDead 8 points 4 days ago Looks like the Leonardo DiCaprio meme. permalink parent award report block reply HillarysBeaverMunch 7 points 4 days ago I said this exact sentence in another thread yesterday! permalink parent award report block reply PosterIsDead 5 points 4 days ago Great minds…. (I didn’t see it!) permalink parent award report block reply _M_A_G_A_ 3 points 4 days ago YES! I knew I recognized that look but couldn't place it! permalink parent award report block reply LolOkFBI 8 points 4 days ago Can anyone provide me the context of this please? permalink award report block reply suckmycorona 13 points 4 days ago Some ugly cunt trying to shame someone for not self deprecating permalink parent award report block reply LolOkFBI 11 points 4 days ago Thank you, can anyone provide me the context of this please? permalink parent award report block reply imnotdeadyet 14 points 4 days ago Sydney Sweeny did a jeans ad for American Eagle.  They basically said Sydney had \"Good Genes!\"  The left is trying to make a racist thing out of it (White's having better genes).  The interviewer was trying to get her to apologise for the ad, but Sydney was not having any of it.  She basically said she was working to hard to worry about some made up bull shit. permalink parent award report block reply LolOkFBI 7 points 4 days ago Thank you, man that was a really old ad. permalink parent award report block reply view 5 more comments... Gletkin 1 points 4 days ago Perfect response! permalink parent award report block reply DrVSGGEOTUSPhD 2 points 4 days ago https://youtu.be/3TwhvC_iPCc?si=uKIoOU5jmNwSIoLL Around 14 minutes in. permalink parent award report block reply Lib_Women_Have_HSV 4 points 4 days ago How are these women and where can I watch the interview permalink award report block reply LLP2 3 points 4 days ago Haha Sidney looks like the white cat! (Smudge) permalink award report block reply JoeMcCarthyWasRight 2 points 4 days ago What did I miss? permalink award report block reply AllTheWayTrump 3 points 4 days ago nothing tbh permalink parent award report block reply Tulkas71 2 points 4 days ago New meme face! Someone Wojak it! permalink award report block reply SimaYi 1 points 4 days ago It's far more than \"skin color\". That was always a way of brainwashing you into ignoring race. permalink award report block reply mercynurse 1 points 4 days ago Spisiffiklee? permalink award report block reply\nTongs_Ya_Bass 34 points 4 days ago I hate they way they frame \"questions\", reminds me of the BBC bitch who tried it on Jordan Peterson and she got humiliated. Manipulative little fuckers. permalink award report block reply bigdickhangsright 10 points 4 days ago When you think about it they both got offended over genetics. permalink parent award report block reply clint_bronson 4 points 4 days ago It wasn't BBC but channel4, im not british, but im guessing one Is cucked and the other is state owned cuck permalink parent award report block reply Tongs_Ya_Bass 1 points 3 days ago You're right, also the GQ interview with the other feminist was a good one. All propaganda lying anti-British, anti-Christian parasites. It's really only the old NPC'S that watch them, just like boomers and Fox news in the US I suppose. permalink parent award report block reply\nbigdickhangsright 10 points 4 days ago When you think about it they both got offended over genetics. permalink parent award report block reply\nclint_bronson 4 points 4 days ago It wasn't BBC but channel4, im not british, but im guessing one Is cucked and the other is state owned cuck permalink parent award report block reply Tongs_Ya_Bass 1 points 3 days ago You're right, also the GQ interview with the other feminist was a good one. All propaganda lying anti-British, anti-Christian parasites. It's really only the old NPC'S that watch them, just like boomers and Fox news in the US I suppose. permalink parent award report block reply\nTongs_Ya_Bass 1 points 3 days ago You're right, also the GQ interview with the other feminist was a good one. All propaganda lying anti-British, anti-Christian parasites. It's really only the old NPC'S that watch them, just like boomers and Fox news in the US I suppose. permalink parent award report block reply\nIfeargovtmorethan 23 points 4 days ago She will be a meme forever....LOL permalink award report block reply\njust2groovy 13 points 4 days ago Doesn't GQ stand for Gentleman's Quarterly? permalink award report block reply Nate_Higgersalot 9 points 4 days ago Gay Queers. permalink parent award report block reply Meister_Bockmist 6 points 4 days ago IT'S GENTLEMA'AMs!!!! permalink parent award report block reply just2groovy 2 points 4 days ago hahaha permalink parent award report block reply\nNate_Higgersalot 9 points 4 days ago Gay Queers. permalink parent award report block reply\nMeister_Bockmist 6 points 4 days ago IT'S GENTLEMA'AMs!!!! permalink parent award report block reply just2groovy 2 points 4 days ago hahaha permalink parent award report block reply\njust2groovy 2 points 4 days ago hahaha permalink parent award report block reply\nQSWO1 13 points 4 days ago But you should be ashamed of your manface. Good jeans. permalink award report block reply PosterIsDead 8 points 4 days ago Looks like the Leonardo DiCaprio meme. permalink parent award report block reply HillarysBeaverMunch 7 points 4 days ago I said this exact sentence in another thread yesterday! permalink parent award report block reply PosterIsDead 5 points 4 days ago Great minds…. (I didn’t see it!) permalink parent award report block reply _M_A_G_A_ 3 points 4 days ago YES! I knew I recognized that look but couldn't place it! permalink parent award report block reply\nPosterIsDead 8 points 4 days ago Looks like the Leonardo DiCaprio meme. permalink parent award report block reply HillarysBeaverMunch 7 points 4 days ago I said this exact sentence in another thread yesterday! permalink parent award report block reply PosterIsDead 5 points 4 days ago Great minds…. (I didn’t see it!) permalink parent award report block reply _M_A_G_A_ 3 points 4 days ago YES! I knew I recognized that look but couldn't place it! permalink parent award report block reply\nHillarysBeaverMunch 7 points 4 days ago I said this exact sentence in another thread yesterday! permalink parent award report block reply PosterIsDead 5 points 4 days ago Great minds…. (I didn’t see it!) permalink parent award report block reply\nPosterIsDead 5 points 4 days ago Great minds…. (I didn’t see it!) permalink parent award report block reply\n_M_A_G_A_ 3 points 4 days ago YES! I knew I recognized that look but couldn't place it! permalink parent award report block reply\nLolOkFBI 8 points 4 days ago Can anyone provide me the context of this please? permalink award report block reply suckmycorona 13 points 4 days ago Some ugly cunt trying to shame someone for not self deprecating permalink parent award report block reply LolOkFBI 11 points 4 days ago Thank you, can anyone provide me the context of this please? permalink parent award report block reply imnotdeadyet 14 points 4 days ago Sydney Sweeny did a jeans ad for American Eagle.  They basically said Sydney had \"Good Genes!\"  The left is trying to make a racist thing out of it (White's having better genes).  The interviewer was trying to get her to apologise for the ad, but Sydney was not having any of it.  She basically said she was working to hard to worry about some made up bull shit. permalink parent award report block reply LolOkFBI 7 points 4 days ago Thank you, man that was a really old ad. permalink parent award report block reply view 5 more comments... Gletkin 1 points 4 days ago Perfect response! permalink parent award report block reply DrVSGGEOTUSPhD 2 points 4 days ago https://youtu.be/3TwhvC_iPCc?si=uKIoOU5jmNwSIoLL Around 14 minutes in. permalink parent award report block reply\nsuckmycorona 13 points 4 days ago Some ugly cunt trying to shame someone for not self deprecating permalink parent award report block reply LolOkFBI 11 points 4 days ago Thank you, can anyone provide me the context of this please? permalink parent award report block reply imnotdeadyet 14 points 4 days ago Sydney Sweeny did a jeans ad for American Eagle.  They basically said Sydney had \"Good Genes!\"  The left is trying to make a racist thing out of it (White's having better genes).  The interviewer was trying to get her to apologise for the ad, but Sydney was not having any of it.  She basically said she was working to hard to worry about some made up bull shit. permalink parent award report block reply LolOkFBI 7 points 4 days ago Thank you, man that was a really old ad. permalink parent award report block reply view 5 more comments... Gletkin 1 points 4 days ago Perfect response! permalink parent award report block reply\nLolOkFBI 11 points 4 days ago Thank you, can anyone provide me the context of this please? permalink parent award report block reply imnotdeadyet 14 points 4 days ago Sydney Sweeny did a jeans ad for American Eagle.  They basically said Sydney had \"Good Genes!\"  The left is trying to make a racist thing out of it (White's having better genes).  The interviewer was trying to get her to apologise for the ad, but Sydney was not having any of it.  She basically said she was working to hard to worry about some made up bull shit. permalink parent award report block reply LolOkFBI 7 points 4 days ago Thank you, man that was a really old ad. permalink parent award report block reply view 5 more comments... Gletkin 1 points 4 days ago Perfect response! permalink parent award report block reply\nimnotdeadyet 14 points 4 days ago Sydney Sweeny did a jeans ad for American Eagle.  They basically said Sydney had \"Good Genes!\"  The left is trying to make a racist thing out of it (White's having better genes).  The interviewer was trying to get her to apologise for the ad, but Sydney was not having any of it.  She basically said she was working to hard to worry about some made up bull shit. permalink parent award report block reply LolOkFBI 7 points 4 days ago Thank you, man that was a really old ad. permalink parent award report block reply view 5 more comments...\nLolOkFBI 7 points 4 days ago Thank you, man that was a really old ad. permalink parent award report block reply view 5 more comments...\nGletkin 1 points 4 days ago Perfect response! permalink parent award report block reply\nDrVSGGEOTUSPhD 2 points 4 days ago https://youtu.be/3TwhvC_iPCc?si=uKIoOU5jmNwSIoLL Around 14 minutes in. permalink parent award report block reply\nLib_Women_Have_HSV 4 points 4 days ago How are these women and where can I watch the interview permalink award report block reply\nLLP2 3 points 4 days ago Haha Sidney looks like the white cat! (Smudge) permalink award report block reply\nJoeMcCarthyWasRight 2 points 4 days ago What did I miss? permalink award report block reply AllTheWayTrump 3 points 4 days ago nothing tbh permalink parent award report block reply\nAllTheWayTrump 3 points 4 days ago nothing tbh permalink parent award report block reply\nTulkas71 2 points 4 days ago New meme face! Someone Wojak it! permalink award report block reply\nSimaYi 1 points 4 days ago It's far more than \"skin color\". That was always a way of brainwashing you into ignoring race. permalink award report block reply\nmercynurse 1 points 4 days ago Spisiffiklee? permalink award report block reply"}