{"id": "1ARK9oXkjR", "contents": "205 Based Alberta woman talking about Indians taking over \"They all need to go home, NOW. I don't want to see another fucking one of them. These people are lazy, corrupt, disgusting, and I want nothing to do with them in our goddamn country anymore. I've said what I've said.\" (rumble.com) posted 15 hours ago by 38WendysHamSquare79 12 comments award share report block\n12 comments Sort by Top Top New Worst Old Save ZhouqiWu 5 points 14 hours ago I heard they wash their dicks in public bathroom sinks and wash their feet in the toilets. permalink award report block reply SERP-SERP 5 points 13 hours ago Lies, I don't think they wash at all. permalink parent award report block reply LibertarianXian 4 points 10 hours ago I did a contract at VISA in a brand new campus and they had these reallly nice bathrooms with private toilet booths with walls in between and wooden saloon doors. I was raving about it and was told that they used to have problems where Indian dudes would shit in the urinals even though they could've used the cushy toilet. Like they were totally confused or something, wtf permalink parent award report block reply diverscale 2 points 10 hours ago Kek!! Are you serious? Never seen shit in a urinal and I've seen a lot permalink parent award report block reply TrumpsBigBalls 2 points 13 hours ago She said foreigners not Indians permalink award report block reply chickeninoven 4 points 10 hours ago She said disgusting smells, permalink parent award report block reply LibertarianXian 3 points 10 hours ago Yeah but it's mostly Indians permalink parent award report block reply pedespeed 1 points 10 hours ago Are they military aged men, lining the northern border of the USA? permalink parent award report block reply AwShitHereWeGoAgain 1 points 13 hours ago Nuke Cananada. permalink award report block reply BecauseYoudBeInJail 1 points 9 hours ago Earplugs, nosering  and Sharpie eyebrows. This is a libshit finally finding out. permalink award report block reply SERP-SERP -1 points 13 hours ago She hates Trump and hates guns and loves Canadian Healthcare (probably)....fuck this cunt. permalink award report block reply MissileToad 1 points 38 minutes ago She's an Albertan dude, don't be so sure. permalink parent award report block reply\nZhouqiWu 5 points 14 hours ago I heard they wash their dicks in public bathroom sinks and wash their feet in the toilets. permalink award report block reply SERP-SERP 5 points 13 hours ago Lies, I don't think they wash at all. permalink parent award report block reply LibertarianXian 4 points 10 hours ago I did a contract at VISA in a brand new campus and they had these reallly nice bathrooms with private toilet booths with walls in between and wooden saloon doors. I was raving about it and was told that they used to have problems where Indian dudes would shit in the urinals even though they could've used the cushy toilet. Like they were totally confused or something, wtf permalink parent award report block reply diverscale 2 points 10 hours ago Kek!! Are you serious? Never seen shit in a urinal and I've seen a lot permalink parent award report block reply\nSERP-SERP 5 points 13 hours ago Lies, I don't think they wash at all. permalink parent award report block reply\nLibertarianXian 4 points 10 hours ago I did a contract at VISA in a brand new campus and they had these reallly nice bathrooms with private toilet booths with walls in between and wooden saloon doors. I was raving about it and was told that they used to have problems where Indian dudes would shit in the urinals even though they could've used the cushy toilet. Like they were totally confused or something, wtf permalink parent award report block reply diverscale 2 points 10 hours ago Kek!! Are you serious? Never seen shit in a urinal and I've seen a lot permalink parent award report block reply\ndiverscale 2 points 10 hours ago Kek!! Are you serious? Never seen shit in a urinal and I've seen a lot permalink parent award report block reply\nTrumpsBigBalls 2 points 13 hours ago She said foreigners not Indians permalink award report block reply chickeninoven 4 points 10 hours ago She said disgusting smells, permalink parent award report block reply LibertarianXian 3 points 10 hours ago Yeah but it's mostly Indians permalink parent award report block reply pedespeed 1 points 10 hours ago Are they military aged men, lining the northern border of the USA? permalink parent award report block reply\nchickeninoven 4 points 10 hours ago She said disgusting smells, permalink parent award report block reply\nLibertarianXian 3 points 10 hours ago Yeah but it's mostly Indians permalink parent award report block reply\npedespeed 1 points 10 hours ago Are they military aged men, lining the northern border of the USA? permalink parent award report block reply\nAwShitHereWeGoAgain 1 points 13 hours ago Nuke Cananada. permalink award report block reply\nBecauseYoudBeInJail 1 points 9 hours ago Earplugs, nosering  and Sharpie eyebrows. This is a libshit finally finding out. permalink award report block reply\nSERP-SERP -1 points 13 hours ago She hates Trump and hates guns and loves Canadian Healthcare (probably)....fuck this cunt. permalink award report block reply MissileToad 1 points 38 minutes ago She's an Albertan dude, don't be so sure. permalink parent award report block reply\nMissileToad 1 points 38 minutes ago She's an Albertan dude, don't be so sure. permalink parent award report block reply"}