{"id": "1ARK9oWeTC", "contents": "34 Kristi Noem basically saying, “we’re making sure AOC or Gavin Newsom have more voters in 2028.” posted 1 hour ago by 2Scoops2Terms2Walls 5 comments award share report block Ryan James Girdusky @RyanGirdusky • 9h Kristi Noem basically saying, “we’re making sure AOC or Gavin Newsom have more voters in 2028.” Disclose.tv @disclosetv • 11h NOW - DHS Secretary Noem on H-1Bs: \"Under the Trump admin, we've sped up our process and added integrity to the visa programs, to green cards, to all of that, but also more people are becoming naturalized under this admin than ever before. More people are becoming citizens.\"\n5 comments Sort by Top Top New Worst Old Save Awakened 4 points 1 hour ago He ain't wrong. permalink award report block reply Cville123 2 points 1 hour ago Their solution to H1B crowding out Americans is to make them citizens? permalink award report block reply knappz 2 points 1 hour ago Deport the illegal gang bangers for MAGA good looks and reach right around and naturalize H1B and green cards....Fuck me. permalink parent award report block reply happyfave 1 points 13 minutes ago Jesus Christ this place has become insufferable permalink award report block reply Surfsup 1 points 10 minutes ago WTF? permalink award report block reply\nAwakened 4 points 1 hour ago He ain't wrong. permalink award report block reply\nCville123 2 points 1 hour ago Their solution to H1B crowding out Americans is to make them citizens? permalink award report block reply knappz 2 points 1 hour ago Deport the illegal gang bangers for MAGA good looks and reach right around and naturalize H1B and green cards....Fuck me. permalink parent award report block reply\nknappz 2 points 1 hour ago Deport the illegal gang bangers for MAGA good looks and reach right around and naturalize H1B and green cards....Fuck me. permalink parent award report block reply\nhappyfave 1 points 13 minutes ago Jesus Christ this place has become insufferable permalink award report block reply\nSurfsup 1 points 10 minutes ago WTF? permalink award report block reply"}