{"id": "1ARK9pfatB", "contents": "32 Hey Thomas Massie, please read this into the Congressional Record: H-1B is Squid Game: Indian techie accuses US employer of forced labour, caste bias (www.indiatoday.in) posted 9 hours ago by breadbaker 2 comments award share report block H-1B is Squid Game: Indian techie accuses US employer of forced labour, caste bias An Indian techie has sued a US-based company and its Indian-origin CEO, alleging forced labour and wage theft under the H-1B visa programme. He also alleged caste discrimination. The firm, which had earlier promised him a Green Card, threatened it would ge... www.indiatoday.in\n2 comments Sort by Top Top New Worst Old Save FudgyFudgeBots 1 points 9 hours ago i learned a while back that there several of these companies that brought them over here and took a percentage of their wages as payment for getting them the job.   The company acted as a sort of temp agency farming them out to corporations who didnt pay benefits. it is my understanding that Trumps proposal, or maybe its a bill, mandates that corporations must hire and be responsible for H1Bs rather than the staffing companies. That will cut out the indian own slave labor companies. permalink award report block reply breadbaker OP 2 points 8 hours ago corporations must hire and be responsible for H1Bs rather than the staffing companies hey FudgyFudge, can we go 50/50 on a media company and some cheapish cams and lights? The bit where the upper caste guys insult the lower caste guys and Karen from HR has to handle it in Mayallam and Hindi simultaneously while the overpowering stench of fish curry wafts in the air. Occasional pan to the papers on the desk to show them stained yellow as no one uses utensils will be comedy gold. Live stream and then by 3 pm Eastern we chop it to TikTok bytes. Think new BMW lease payment money from the rubes in Ohio that are convinced Papa Trump brought in the most talented Indians ever. permalink parent award report block reply\nFudgyFudgeBots 1 points 9 hours ago i learned a while back that there several of these companies that brought them over here and took a percentage of their wages as payment for getting them the job.   The company acted as a sort of temp agency farming them out to corporations who didnt pay benefits. it is my understanding that Trumps proposal, or maybe its a bill, mandates that corporations must hire and be responsible for H1Bs rather than the staffing companies. That will cut out the indian own slave labor companies. permalink award report block reply breadbaker OP 2 points 8 hours ago corporations must hire and be responsible for H1Bs rather than the staffing companies hey FudgyFudge, can we go 50/50 on a media company and some cheapish cams and lights? The bit where the upper caste guys insult the lower caste guys and Karen from HR has to handle it in Mayallam and Hindi simultaneously while the overpowering stench of fish curry wafts in the air. Occasional pan to the papers on the desk to show them stained yellow as no one uses utensils will be comedy gold. Live stream and then by 3 pm Eastern we chop it to TikTok bytes. Think new BMW lease payment money from the rubes in Ohio that are convinced Papa Trump brought in the most talented Indians ever. permalink parent award report block reply\nbreadbaker OP 2 points 8 hours ago corporations must hire and be responsible for H1Bs rather than the staffing companies hey FudgyFudge, can we go 50/50 on a media company and some cheapish cams and lights? The bit where the upper caste guys insult the lower caste guys and Karen from HR has to handle it in Mayallam and Hindi simultaneously while the overpowering stench of fish curry wafts in the air. Occasional pan to the papers on the desk to show them stained yellow as no one uses utensils will be comedy gold. Live stream and then by 3 pm Eastern we chop it to TikTok bytes. Think new BMW lease payment money from the rubes in Ohio that are convinced Papa Trump brought in the most talented Indians ever. permalink parent award report block reply"}