{"id": "1ARK9pfsGt", "contents": "701 The first state bill to nullify the UK Online Safety Act and other foreign censorship laws, and allow Americans to sue foreign governments for censoring us, is just about ready to roll.\n\nAmerica is about to start a big fight with foreign censors.\n\nAnd we're going to fucking win. posted 5 hours ago by IlhansBrother 31 comments award share report block Preston Byrne @prestonjbyrne • 9h The first state bill to nullify the UK Online Safety Act and other foreign censorship laws, and allow Americans to sue foreign governments for censoring us, is just about ready to roll. America is about to start a big fight with foreign censors. And we're going to fucking win.\n31 comments Sort by Top Top New Worst Old Save duehuckleberry 34 points 5 hours ago I love the fucking attitude here. It's time to push back against those foreign censors. Plus, it helps our European Patriots at the same time. permalink award report block reply Taqiyya_Mockingbird 6 points 4 hours ago Yeah, but I also feel like we forgot this fight a while ago, glad to see it still happening. I’d also like to see the full list of who abroad is censoring us, and who we are pursuing for doing so. permalink parent award report block reply NotYourMan 3 points 4 hours ago If Gavin becomes president in 2028, we can expect lots of censorship laws, international censorship, and possibly jail time for posts to be applied in the US (like the UK).  This is the goal of the world wide liberal fascist government. permalink parent award report block reply JDVance4President28 20 points 5 hours ago Why isn't this something our federal government is working on? Oh wait. It's too based for RINOs permalink award report block reply BigMikesChef 6 points 4 hours ago Surely it's on Pam's desk? permalink parent award report block reply Wizard_Glick 4 points 3 hours ago Been there for two weeks... permalink parent award report block reply someguy7738 1 points 1 hour ago Because they're just biding their time until they can throw the election, put the left back in power, and start extraditing American citizens to foreign shitholes for thought crimes. permalink parent award report block reply guywholikesDjtof2024 9 points 5 hours ago Pray to God that this will succeed against censorship. Pray over all aspects of this, for the anti censorship side, and against the pro censorship. permalink award report block reply Mulletgunning 8 points 4 hours ago This is the positive energy and asskicking attitude we need in MAGA AF . We are the way to a restored and fortified Republic . We stand against all globalist trash and foreign influence plus invasions brought on us by a worthless Uniparty and the billionaires that bought them. We must keep our eyes on the prize and realize that Trump will be gone in 3 and we must continue this fight with this type of energy and attitude . We have to unite all who are MAGA AF as a force that can't be fucked with . Our vision is simple,America( ns) First and only . Shut down all immigration for at least 6 or 8 decades until the newbies assimilate or kick them the fuck out. Make our country Christian Only. Keep the best and yeet the rest. All visa abusers must be stopped and uno reverse their asses out of here. Rebuild our entire infrastructure,ignite manufacturing,drill to the core,yeet all uniparty fags out in the next few cycles by replacing with extremely vetted patriots that will vote in term limits ,cancel Obama care,continue deporting illegals by any means necessary,transparecy and accountability on tap,create great paying jobs for Americans ,reign in or abolish the Intel cartel,abolish The Fed,IRS,DOE,etc,Abolish The Patriot Act,Abolish all red flag and any other laws against the 2nd,definitely abolish any laws punishing for saying hurty words about the chosen ones,abolish AIPAC,ADL,Islamic everything,dualies,get lobbyists money out of elections,abolish all NGOs and start anew with real oversight,fortify our elections ,make it paper ballots,same day voting,and possibly a holiday for national elections,Bring God back into everything. Put Americas way of life,liberty and the pursuit of happiness up front and center. Incentivise American married couples to raise huge families to get our numbers up. Reverse the replacement bullshit. Penalize any caught still pushing commie gobblygook like DEI or ESG bullshit. Break up Blackrock and their ilk and sue them fuckers into the abyss for illegal discrimination and crimes against humanity,get Big Pharma prosecuted for the knowingly and willingly destroying,maiming,murdering many innocents for money . Money they stole from all. That's just the beginning. We have a long road ahead and this is just a part of what we need to get America on top of the World as we should be. We have been getting fucked for decades and longer. Its time to reverse course yesterday. God Bless America and God Bless You all. MAGA AF permalink award report block reply Hanging_Chad 4 points 4 hours ago can we sue Reddit? permalink award report block reply WhereEaglesDare 3 points 4 hours ago Bibi Netanyahu would be a good one. permalink award report block reply MastaJoda 1 points 2 hours ago aaaand the lawsuit committed suicide permalink parent award report block reply ingrowntoenail 2 points 4 hours ago Meanwhile, we're doing it to ourselves. permalink award report block reply Seeker_17 2 points 4 hours ago Granite Act sounds like it's from NH. permalink award report block reply AlmostFullyDilated 1 points 4 hours ago what? permalink award report block reply buckeyeminuteman 1 points 4 hours ago UK Big Brother can get fucked! permalink award report block reply Bramage 1 points 2 hours ago Ukbb likes it in the ass...from children. permalink parent award report block reply learntocode 1 points 2 hours ago You stack your money up in court, paid to a lawyer and in fees, and sue a foreign government with infinity money relative to you. And that is how you win! State v state competition on the most economically lopsided basis possible, hiring a class of people known to lie just to keep you in court burning your wealth, in front of corrupt foreign born judges - this is a FUCKING RETARDED IDEA. permalink award report block reply Redeemable 1 points 4 hours ago And which state rolled it out? permalink award report block reply nmipede 2 points 4 hours ago The GRANITE bill in the title implies New Hampshire. https://prestonbyrne.com/2025/10/18/the-granite-act-how-congress-can-strike-back-against-foreign-censors/ It is, but it looks like it is just this guy's idea, no legislator appears to have sponsored it yet. permalink parent award report block reply booblitchutz 1 points 57 minutes ago I don’t think a foreign government threw me off X. permalink award report block reply rebuildingMyself 1 points 3 hours ago If we can keep the foreign menace in this country in check, I can see us completely divorcing from UK over the next 20 years as they fall further and further into Islam and govt tyranny. permalink award report block reply Prof_Smith 1 points 2 hours ago Is this that big of a problem?  Are Americans being legally impacted by European governments? If so, we don’t need laws. We need to just let Russia take over the place. permalink award report block reply IlhansBrother OP 2 points 2 hours ago Are Americans being legally impacted by European governments? Powerful EU governments regularly blackmail big tech until they get their way (normally silencing conservatives) permalink parent award report block reply Prof_Smith 1 points 2 hours ago Ok.   Question still stands.  You cannot trust big companies either way.  People should know that by now. permalink parent award report block reply Meathe 1 points 24 minutes ago Gab has been threatened multiple times with huge fines by the UK. The response has typically been \"Go fuck yourself\" permalink parent award report block reply E-dantes 1 points 2 hours ago Backdoor sovereignty give away. It's retarded. permalink award report block reply CocaineNewsome 1 points 3 hours ago Yes and don't put your own bill like some states have been trying to. Domestic censorshit isn't American either. permalink award report block reply 1amS3lly 1 points 2 hours ago God speed and god bless!! permalink award report block reply AstroLonghorn 1 points 2 hours ago Get absolutely fucked you limey Labour Brits permalink award report block reply Klaus73 0 points 4 hours ago Net Neutrality....anyone remember how that went? I am not a fan of foreign censorship but to think folks can say whatever they want wherever they want regardless of other countries laws. Its not like your going to go on a EU platform and just disregard their laws. To think otherwise is like trying to open carry in Britan because of 2a. permalink award report block reply AlmostFullyDilated 0 points 4 hours ago Comment removed by community filter. permalink award report block reply AlmostFullyDilated 0 points 5 hours ago Comment removed by community moderators. permalink award report block reply\nduehuckleberry 34 points 5 hours ago I love the fucking attitude here. It's time to push back against those foreign censors. Plus, it helps our European Patriots at the same time. permalink award report block reply Taqiyya_Mockingbird 6 points 4 hours ago Yeah, but I also feel like we forgot this fight a while ago, glad to see it still happening. I’d also like to see the full list of who abroad is censoring us, and who we are pursuing for doing so. permalink parent award report block reply NotYourMan 3 points 4 hours ago If Gavin becomes president in 2028, we can expect lots of censorship laws, international censorship, and possibly jail time for posts to be applied in the US (like the UK).  This is the goal of the world wide liberal fascist government. permalink parent award report block reply\nTaqiyya_Mockingbird 6 points 4 hours ago Yeah, but I also feel like we forgot this fight a while ago, glad to see it still happening. I’d also like to see the full list of who abroad is censoring us, and who we are pursuing for doing so. permalink parent award report block reply\nNotYourMan 3 points 4 hours ago If Gavin becomes president in 2028, we can expect lots of censorship laws, international censorship, and possibly jail time for posts to be applied in the US (like the UK).  This is the goal of the world wide liberal fascist government. permalink parent award report block reply\nJDVance4President28 20 points 5 hours ago Why isn't this something our federal government is working on? Oh wait. It's too based for RINOs permalink award report block reply BigMikesChef 6 points 4 hours ago Surely it's on Pam's desk? permalink parent award report block reply Wizard_Glick 4 points 3 hours ago Been there for two weeks... permalink parent award report block reply someguy7738 1 points 1 hour ago Because they're just biding their time until they can throw the election, put the left back in power, and start extraditing American citizens to foreign shitholes for thought crimes. permalink parent award report block reply\nBigMikesChef 6 points 4 hours ago Surely it's on Pam's desk? permalink parent award report block reply Wizard_Glick 4 points 3 hours ago Been there for two weeks... permalink parent award report block reply\nWizard_Glick 4 points 3 hours ago Been there for two weeks... permalink parent award report block reply\nsomeguy7738 1 points 1 hour ago Because they're just biding their time until they can throw the election, put the left back in power, and start extraditing American citizens to foreign shitholes for thought crimes. permalink parent award report block reply\nguywholikesDjtof2024 9 points 5 hours ago Pray to God that this will succeed against censorship. Pray over all aspects of this, for the anti censorship side, and against the pro censorship. permalink award report block reply\nMulletgunning 8 points 4 hours ago This is the positive energy and asskicking attitude we need in MAGA AF . We are the way to a restored and fortified Republic . We stand against all globalist trash and foreign influence plus invasions brought on us by a worthless Uniparty and the billionaires that bought them. We must keep our eyes on the prize and realize that Trump will be gone in 3 and we must continue this fight with this type of energy and attitude . We have to unite all who are MAGA AF as a force that can't be fucked with . Our vision is simple,America( ns) First and only . Shut down all immigration for at least 6 or 8 decades until the newbies assimilate or kick them the fuck out. Make our country Christian Only. Keep the best and yeet the rest. All visa abusers must be stopped and uno reverse their asses out of here. Rebuild our entire infrastructure,ignite manufacturing,drill to the core,yeet all uniparty fags out in the next few cycles by replacing with extremely vetted patriots that will vote in term limits ,cancel Obama care,continue deporting illegals by any means necessary,transparecy and accountability on tap,create great paying jobs for Americans ,reign in or abolish the Intel cartel,abolish The Fed,IRS,DOE,etc,Abolish The Patriot Act,Abolish all red flag and any other laws against the 2nd,definitely abolish any laws punishing for saying hurty words about the chosen ones,abolish AIPAC,ADL,Islamic everything,dualies,get lobbyists money out of elections,abolish all NGOs and start anew with real oversight,fortify our elections ,make it paper ballots,same day voting,and possibly a holiday for national elections,Bring God back into everything. Put Americas way of life,liberty and the pursuit of happiness up front and center. Incentivise American married couples to raise huge families to get our numbers up. Reverse the replacement bullshit. Penalize any caught still pushing commie gobblygook like DEI or ESG bullshit. Break up Blackrock and their ilk and sue them fuckers into the abyss for illegal discrimination and crimes against humanity,get Big Pharma prosecuted for the knowingly and willingly destroying,maiming,murdering many innocents for money . Money they stole from all. That's just the beginning. We have a long road ahead and this is just a part of what we need to get America on top of the World as we should be. We have been getting fucked for decades and longer. Its time to reverse course yesterday. God Bless America and God Bless You all. MAGA AF permalink award report block reply\nHanging_Chad 4 points 4 hours ago can we sue Reddit? permalink award report block reply\nWhereEaglesDare 3 points 4 hours ago Bibi Netanyahu would be a good one. permalink award report block reply MastaJoda 1 points 2 hours ago aaaand the lawsuit committed suicide permalink parent award report block reply\nMastaJoda 1 points 2 hours ago aaaand the lawsuit committed suicide permalink parent award report block reply\ningrowntoenail 2 points 4 hours ago Meanwhile, we're doing it to ourselves. permalink award report block reply\nSeeker_17 2 points 4 hours ago Granite Act sounds like it's from NH. permalink award report block reply\nAlmostFullyDilated 1 points 4 hours ago what? permalink award report block reply\nbuckeyeminuteman 1 points 4 hours ago UK Big Brother can get fucked! permalink award report block reply Bramage 1 points 2 hours ago Ukbb likes it in the ass...from children. permalink parent award report block reply\nBramage 1 points 2 hours ago Ukbb likes it in the ass...from children. permalink parent award report block reply\nlearntocode 1 points 2 hours ago You stack your money up in court, paid to a lawyer and in fees, and sue a foreign government with infinity money relative to you. And that is how you win! State v state competition on the most economically lopsided basis possible, hiring a class of people known to lie just to keep you in court burning your wealth, in front of corrupt foreign born judges - this is a FUCKING RETARDED IDEA. permalink award report block reply\nRedeemable 1 points 4 hours ago And which state rolled it out? permalink award report block reply nmipede 2 points 4 hours ago The GRANITE bill in the title implies New Hampshire. https://prestonbyrne.com/2025/10/18/the-granite-act-how-congress-can-strike-back-against-foreign-censors/ It is, but it looks like it is just this guy's idea, no legislator appears to have sponsored it yet. permalink parent award report block reply\nnmipede 2 points 4 hours ago The GRANITE bill in the title implies New Hampshire. https://prestonbyrne.com/2025/10/18/the-granite-act-how-congress-can-strike-back-against-foreign-censors/ It is, but it looks like it is just this guy's idea, no legislator appears to have sponsored it yet. permalink parent award report block reply\nbooblitchutz 1 points 57 minutes ago I don’t think a foreign government threw me off X. permalink award report block reply\nrebuildingMyself 1 points 3 hours ago If we can keep the foreign menace in this country in check, I can see us completely divorcing from UK over the next 20 years as they fall further and further into Islam and govt tyranny. permalink award report block reply\nProf_Smith 1 points 2 hours ago Is this that big of a problem?  Are Americans being legally impacted by European governments? If so, we don’t need laws. We need to just let Russia take over the place. permalink award report block reply IlhansBrother OP 2 points 2 hours ago Are Americans being legally impacted by European governments? Powerful EU governments regularly blackmail big tech until they get their way (normally silencing conservatives) permalink parent award report block reply Prof_Smith 1 points 2 hours ago Ok.   Question still stands.  You cannot trust big companies either way.  People should know that by now. permalink parent award report block reply Meathe 1 points 24 minutes ago Gab has been threatened multiple times with huge fines by the UK. The response has typically been \"Go fuck yourself\" permalink parent award report block reply\nIlhansBrother OP 2 points 2 hours ago Are Americans being legally impacted by European governments? Powerful EU governments regularly blackmail big tech until they get their way (normally silencing conservatives) permalink parent award report block reply Prof_Smith 1 points 2 hours ago Ok.   Question still stands.  You cannot trust big companies either way.  People should know that by now. permalink parent award report block reply\nProf_Smith 1 points 2 hours ago Ok.   Question still stands.  You cannot trust big companies either way.  People should know that by now. permalink parent award report block reply\nMeathe 1 points 24 minutes ago Gab has been threatened multiple times with huge fines by the UK. The response has typically been \"Go fuck yourself\" permalink parent award report block reply\nE-dantes 1 points 2 hours ago Backdoor sovereignty give away. It's retarded. permalink award report block reply\nCocaineNewsome 1 points 3 hours ago Yes and don't put your own bill like some states have been trying to. Domestic censorshit isn't American either. permalink award report block reply\n1amS3lly 1 points 2 hours ago God speed and god bless!! permalink award report block reply\nAstroLonghorn 1 points 2 hours ago Get absolutely fucked you limey Labour Brits permalink award report block reply\nKlaus73 0 points 4 hours ago Net Neutrality....anyone remember how that went? I am not a fan of foreign censorship but to think folks can say whatever they want wherever they want regardless of other countries laws. Its not like your going to go on a EU platform and just disregard their laws. To think otherwise is like trying to open carry in Britan because of 2a. permalink award report block reply\nAlmostFullyDilated 0 points 4 hours ago Comment removed by community filter. permalink award report block reply\nAlmostFullyDilated 0 points 5 hours ago Comment removed by community moderators. permalink award report block reply"}