{"id": "1ARK57rxhv", "contents": "426 He calls the health insurance companies Money Suckers and he’s got a plan to radically remake the (completely failed) U.S. healthcare system. Now the Man is crossing over into the Next Level. This is what I voted for!!! posted 4 days ago by flp999 20 comments award share download report block\n20 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style couranto 14 points 4 days ago He got the tone deaf memo last night: he’s been on a populist tear since the afternoon. First the meat packers and now insurance companies. permalink award report block reply flp999 OP 7 points 4 days ago Hey, whatever the case may be, this is exactly what I want. Of course we need to see the follow through. But at least the focus is right (and that’s huge in and of itself, the nature of the whole deal is an information war, and narratives are a big component, just putting the topics out there as part of the public agenda has a big effect), and if it turns out to be a half assed effort we’ll see that pretty clearly soon enough. permalink parent award report block reply DingleBalls 9 points 4 days ago Any insurance company is a black hole first. Its SUPPOSED to be more like a fund to pay for unexpected expenses or property loss but often you pay ridiculous premiums only to be told \"you're not covered\" when you need it. Then they pay expensive lawyers to battle in court which alone will drive their premiums further up and if they lose and have to pay they jack everyone else's rates to cover it. Never cut profits or have management take a cut. Always fuck the policyholders permalink award report block reply breadbaker 6 points 4 days ago Always fuck the policyholders Exactly. An individual negotiating a contract is laughable to them. It's an industry run by crunching the large data sets and placing the bet as far on their profit side as they can get away with.  It's a legal casino that sets the bet to be on their winning side. permalink parent award report block reply breadbaker 7 points 4 days ago How is that, let the individual handle it, going for you when you get a cell phone contract, buy automobile insurance (where you at least have strict state insurance requirements), when you buy a laptop with Windows OS (enjoy Microsoft hoovering up your data). This is such a bad proposal that it could potentially reverse the trend of people moving from the blue states to red states. Someone in the Trump Administration, anyone, wake up and actually float a real plan for health insurance. Maybe ask Elon who things big, ask Mark Cuban. Just get some outline of a real proposal by Christmas. permalink award report block reply TerdBergler 2 points 4 days ago The issue is that the bottom half of intelligence will fuck themselves, then demand the government help them. permalink parent award report block reply NotABot68 1 points 4 days ago Exactly. Give us money to buy our own \"good health plan\"? We'd be doing that already if there were any to be had, FFS! permalink parent award report block reply DanIsSwell 7 points 4 days ago Off topic, but did you hear what he just said about meat prices too? He said “cattle prices have gone down, yet meat prices are still going up. Something is not right, and we’re looking into this”. That elevates my mood! Trump has good intentions, and hears what the public is asking for. permalink award report block reply flp999 OP 4 points 4 days ago Right you are! I just saw that a DOJ investigation has been launched into that. The focus is clearly shifting to the Corporatists, as is appropriate and necessary, because they’re actually the ones behind everything (Leftism as a culture is the low hanging fruit, and a tool to destroy our country being deployed by the Globalists, who are of course the Corporatists, they are the same people). https://www.nbcnews.com/news/amp/rcna242671 permalink parent award report block reply Niqlndym 5 points 4 days ago Anyone who believes that the shutdown is continuing because Dems are afraid of their radical wing is mistaken.  The real reason is pressure from the insurance companies and Big Pharma, who are threatening to shut off their sponsorship if Obamacare isn’t continued. permalink award report block reply flp999 OP 2 points 4 days ago That’s my understanding too. permalink parent award report block reply phro 3 points 4 days ago This is how the 2008 crash should have been solved. Instead of bailing out the banks bail out the people and let the banks work with them to get paid what they were owed. permalink award report block reply MasterChief 2 points 4 days ago My father runs the Medicare project for his state, they've been working on revamping it for years now. What is being proposed here will take just as long if not longer to pull off. Call me pessimistic, but this will take warp-speed level funding to accomplish in Trump's term. permalink award report block reply DeadOverRed 1 points 4 days ago The money is already there. Just take it from the ones who stole it and use it. permalink parent award report block reply corntortilla 1 points 4 days ago Plan? What’s the plan? I don’t see a plan for killing Obamacare and lowering my insurance. permalink award report block reply JustInTime2_ 1 points 4 days ago This is what happens when you choose Jealth Savings account. The unused  portion returns to the Treasury. permalink award report block reply GdotLee 1 points 4 days ago You got all that from this one post? permalink award report block reply flp999 OP 1 points 4 days ago I just restated what the post says. And applied that to the state of reality. So yes, “all that,” from the post. You can read an article about it if you want. I believe the Daily Mail has posted a piece about it. But there’s nothing in it that adds to the substance of my post, because again, my post is just: what the Trump post says + the state of reality. Take your “citations please” shit over to the Left Hand Path. permalink parent award report block reply GdotLee 1 points 4 days ago Daily Mail??  LOL permalink parent award report block reply weltallic 0 points 4 days ago ICE are being rammed and shot at, and he's still focused on \"getting back\" at Obama. permalink award report block reply\ncouranto 14 points 4 days ago He got the tone deaf memo last night: he’s been on a populist tear since the afternoon. First the meat packers and now insurance companies. permalink award report block reply flp999 OP 7 points 4 days ago Hey, whatever the case may be, this is exactly what I want. Of course we need to see the follow through. But at least the focus is right (and that’s huge in and of itself, the nature of the whole deal is an information war, and narratives are a big component, just putting the topics out there as part of the public agenda has a big effect), and if it turns out to be a half assed effort we’ll see that pretty clearly soon enough. permalink parent award report block reply\nflp999 OP 7 points 4 days ago Hey, whatever the case may be, this is exactly what I want. Of course we need to see the follow through. But at least the focus is right (and that’s huge in and of itself, the nature of the whole deal is an information war, and narratives are a big component, just putting the topics out there as part of the public agenda has a big effect), and if it turns out to be a half assed effort we’ll see that pretty clearly soon enough. permalink parent award report block reply\nDingleBalls 9 points 4 days ago Any insurance company is a black hole first. Its SUPPOSED to be more like a fund to pay for unexpected expenses or property loss but often you pay ridiculous premiums only to be told \"you're not covered\" when you need it. Then they pay expensive lawyers to battle in court which alone will drive their premiums further up and if they lose and have to pay they jack everyone else's rates to cover it. Never cut profits or have management take a cut. Always fuck the policyholders permalink award report block reply breadbaker 6 points 4 days ago Always fuck the policyholders Exactly. An individual negotiating a contract is laughable to them. It's an industry run by crunching the large data sets and placing the bet as far on their profit side as they can get away with.  It's a legal casino that sets the bet to be on their winning side. permalink parent award report block reply\nbreadbaker 6 points 4 days ago Always fuck the policyholders Exactly. An individual negotiating a contract is laughable to them. It's an industry run by crunching the large data sets and placing the bet as far on their profit side as they can get away with.  It's a legal casino that sets the bet to be on their winning side. permalink parent award report block reply\nbreadbaker 7 points 4 days ago How is that, let the individual handle it, going for you when you get a cell phone contract, buy automobile insurance (where you at least have strict state insurance requirements), when you buy a laptop with Windows OS (enjoy Microsoft hoovering up your data). This is such a bad proposal that it could potentially reverse the trend of people moving from the blue states to red states. Someone in the Trump Administration, anyone, wake up and actually float a real plan for health insurance. Maybe ask Elon who things big, ask Mark Cuban. Just get some outline of a real proposal by Christmas. permalink award report block reply TerdBergler 2 points 4 days ago The issue is that the bottom half of intelligence will fuck themselves, then demand the government help them. permalink parent award report block reply NotABot68 1 points 4 days ago Exactly. Give us money to buy our own \"good health plan\"? We'd be doing that already if there were any to be had, FFS! permalink parent award report block reply\nTerdBergler 2 points 4 days ago The issue is that the bottom half of intelligence will fuck themselves, then demand the government help them. permalink parent award report block reply\nNotABot68 1 points 4 days ago Exactly. Give us money to buy our own \"good health plan\"? We'd be doing that already if there were any to be had, FFS! permalink parent award report block reply\nDanIsSwell 7 points 4 days ago Off topic, but did you hear what he just said about meat prices too? He said “cattle prices have gone down, yet meat prices are still going up. Something is not right, and we’re looking into this”. That elevates my mood! Trump has good intentions, and hears what the public is asking for. permalink award report block reply flp999 OP 4 points 4 days ago Right you are! I just saw that a DOJ investigation has been launched into that. The focus is clearly shifting to the Corporatists, as is appropriate and necessary, because they’re actually the ones behind everything (Leftism as a culture is the low hanging fruit, and a tool to destroy our country being deployed by the Globalists, who are of course the Corporatists, they are the same people). https://www.nbcnews.com/news/amp/rcna242671 permalink parent award report block reply\nflp999 OP 4 points 4 days ago Right you are! I just saw that a DOJ investigation has been launched into that. The focus is clearly shifting to the Corporatists, as is appropriate and necessary, because they’re actually the ones behind everything (Leftism as a culture is the low hanging fruit, and a tool to destroy our country being deployed by the Globalists, who are of course the Corporatists, they are the same people). https://www.nbcnews.com/news/amp/rcna242671 permalink parent award report block reply\nNiqlndym 5 points 4 days ago Anyone who believes that the shutdown is continuing because Dems are afraid of their radical wing is mistaken.  The real reason is pressure from the insurance companies and Big Pharma, who are threatening to shut off their sponsorship if Obamacare isn’t continued. permalink award report block reply flp999 OP 2 points 4 days ago That’s my understanding too. permalink parent award report block reply\nflp999 OP 2 points 4 days ago That’s my understanding too. permalink parent award report block reply\nphro 3 points 4 days ago This is how the 2008 crash should have been solved. Instead of bailing out the banks bail out the people and let the banks work with them to get paid what they were owed. permalink award report block reply\nMasterChief 2 points 4 days ago My father runs the Medicare project for his state, they've been working on revamping it for years now. What is being proposed here will take just as long if not longer to pull off. Call me pessimistic, but this will take warp-speed level funding to accomplish in Trump's term. permalink award report block reply DeadOverRed 1 points 4 days ago The money is already there. Just take it from the ones who stole it and use it. permalink parent award report block reply\nDeadOverRed 1 points 4 days ago The money is already there. Just take it from the ones who stole it and use it. permalink parent award report block reply\ncorntortilla 1 points 4 days ago Plan? What’s the plan? I don’t see a plan for killing Obamacare and lowering my insurance. permalink award report block reply\nJustInTime2_ 1 points 4 days ago This is what happens when you choose Jealth Savings account. The unused  portion returns to the Treasury. permalink award report block reply\nGdotLee 1 points 4 days ago You got all that from this one post? permalink award report block reply flp999 OP 1 points 4 days ago I just restated what the post says. And applied that to the state of reality. So yes, “all that,” from the post. You can read an article about it if you want. I believe the Daily Mail has posted a piece about it. But there’s nothing in it that adds to the substance of my post, because again, my post is just: what the Trump post says + the state of reality. Take your “citations please” shit over to the Left Hand Path. permalink parent award report block reply GdotLee 1 points 4 days ago Daily Mail??  LOL permalink parent award report block reply\nflp999 OP 1 points 4 days ago I just restated what the post says. And applied that to the state of reality. So yes, “all that,” from the post. You can read an article about it if you want. I believe the Daily Mail has posted a piece about it. But there’s nothing in it that adds to the substance of my post, because again, my post is just: what the Trump post says + the state of reality. Take your “citations please” shit over to the Left Hand Path. permalink parent award report block reply GdotLee 1 points 4 days ago Daily Mail??  LOL permalink parent award report block reply\nGdotLee 1 points 4 days ago Daily Mail??  LOL permalink parent award report block reply\nweltallic 0 points 4 days ago ICE are being rammed and shot at, and he's still focused on \"getting back\" at Obama. permalink award report block reply"}