{"id": "1ARK58zFhI", "contents": "352 To Conquer posted 4 days ago by _Liberty_Prime_ 11 comments award share report block Sara T e m p e s t @tempestimony • 4d @EYakoby WAR against the West.\n11 comments Sort by Top Top New Worst Old Save FusionBlack 12 points 4 days ago Surprised Katie hasn't been ''approached''. She is a fighter. permalink award report block reply Mungo 5 points 4 days ago I love her! permalink parent award report block reply RINO_fatigue 9 points 4 days ago muslim shills will be in this thread shortly to try and deflect criticism of their culture and religion and turn it against israel permalink award report block reply FusionBlack 4 points 4 days ago Screw Islam . One step ahead of them. permalink parent award report block reply TrumpAndGodWin 2 points 4 days ago You can be against multiple things at the same time. permalink parent award report block reply donteatthat 4 points 4 days ago Subjugation permalink award report block reply NotYourMan 3 points 4 days ago To conquer but they have to get there before the democrats finish conquering the entire country. permalink award report block reply 5DchessWatch 2 points 4 days ago He replied, Because Durka durka babbaganoush, hope that clarifies permalink award report block reply grenades_and_ham 1 points 3 days ago Leech and breed. permalink award report block reply Gildoom 1 points 4 days ago Freeeeeeee shit. That is why the lessers are here permalink award report block reply NoSteppyonmyPepe 1 points 3 days ago Excellent question permalink award report block reply\nFusionBlack 12 points 4 days ago Surprised Katie hasn't been ''approached''. She is a fighter. permalink award report block reply Mungo 5 points 4 days ago I love her! permalink parent award report block reply\nMungo 5 points 4 days ago I love her! permalink parent award report block reply\nRINO_fatigue 9 points 4 days ago muslim shills will be in this thread shortly to try and deflect criticism of their culture and religion and turn it against israel permalink award report block reply FusionBlack 4 points 4 days ago Screw Islam . One step ahead of them. permalink parent award report block reply TrumpAndGodWin 2 points 4 days ago You can be against multiple things at the same time. permalink parent award report block reply\nFusionBlack 4 points 4 days ago Screw Islam . One step ahead of them. permalink parent award report block reply\nTrumpAndGodWin 2 points 4 days ago You can be against multiple things at the same time. permalink parent award report block reply\ndonteatthat 4 points 4 days ago Subjugation permalink award report block reply\nNotYourMan 3 points 4 days ago To conquer but they have to get there before the democrats finish conquering the entire country. permalink award report block reply\n5DchessWatch 2 points 4 days ago He replied, Because Durka durka babbaganoush, hope that clarifies permalink award report block reply\ngrenades_and_ham 1 points 3 days ago Leech and breed. permalink award report block reply\nGildoom 1 points 4 days ago Freeeeeeee shit. That is why the lessers are here permalink award report block reply\nNoSteppyonmyPepe 1 points 3 days ago Excellent question permalink award report block reply"}