{"id": "1ARK9irmKa", "contents": "863 Happy Union posted 2 days ago by rdvs34283 46 comments award share download report block\n46 comments Sort by Top Top New Worst Old Save King_Dorgan 25 points 2 days ago I’m not sure if I can run this city but at least I’ll take a STAB at it. permalink award report block reply King_Dorgan 20 points 2 days ago I know we’ll BEHEADED in the right direction permalink parent award report block reply GunsWithGooglyEyes 13 points 2 days ago If the goat hole don't fit, you must acquit. permalink award report block reply barwhack 3 points 2 days ago You beat me to it. permalink parent award report block reply LORDFALCONE 13 points 2 days ago Megan Kelly is a clone? permalink award report block reply HelluvaEngineer 12 points 2 days ago Who told you to put the balm on? permalink award report block reply MediaBro 4 points 2 days ago The Maestro permalink parent award report block reply RuprechtThaMonkeyBoy 11 points 2 days ago It’s gonna Hertz permalink award report block reply TheOneWhoKnocks 10 points 2 days ago If ever there was a picture that epitomizes this type of interracial relationship, it's this one. If a rich and famous couple can't get by without the white female getting a few holes added to her body, then what chance do the rest of them have? permalink award report block reply MediaBro 6 points 2 days ago It's often forgotten today just how much OJ was loved by White America, prior to him murdering that woman. He was a great football player, he married a pretty blonde, he was starring as the comic fodder in the Naked Gun movies and was even being chosen to star as the lead in a movie called The Terminator but was not chosen cos he seemed too nice a guy to be able to pull off that role. This man had it all. But a cheating wife is still a cheating wife. Had he just divorced her, told everyone she cheated on him and walked away and married another White woman or even stayed single and decided to bang women of all colours for the rest of his life, no one would even be mad at the guy for making those choices. But he couldn't even do that. It had to end in murder, sadly. What a waste. permalink parent award report block reply GTHAYS 2 points 1 day ago Tiger WOODS is just standing there smiling..... permalink parent award report block reply MediaBro 2 points 23 hours ago Pretty much. Dude had the hottest wife ever and he still couldn't keep his dick in his pants. Oh well. Atleast no one got murdered. permalink parent award report block reply MAGABOND 1 points 1 day ago A guy that would murder his wife has other scandals that would eventually come out and destroy his legacy anyway. Which sorta did happen to OJ later. permalink parent award report block reply lovemylibs 10 points 2 days ago She even looks scared in that picture. permalink award report block reply CrackerSmurf2 9 points 2 days ago What's Megyn Kelly got to do with anything? /sarc permalink award report block reply TDAF 8 points 2 days ago \"You can eat my pussy, but The Juice will kill you.\" permalink award report block reply RedPillosopher1776 8 points 2 days ago If you burn the coal you must pay the toll. permalink award report block reply SnowSnake 7 points 2 days ago She definitely paid the toll. permalink award report block reply Nameless_Mofo 6 points 2 days ago Did he ever find the killer? permalink award report block reply -f-b-i- 8 points 2 days ago If I did it permalink parent award report block reply makersmarx 5 points 2 days ago If the glove dont fit you must acquit! permalink parent award report block reply asdrubael_was_right 0 points 2 days ago Hey OJ take a look at user DeltaSierra plz. Possible ban evasion. Or just a board sliding shitlord. permalink parent award report block reply lynxxyarly 3 points 2 days ago lowkey i believe OJ was innocent of the murder. I think his son did it and OJ covered for him. There is a FUCK ton of evidence that the police basically ignored because they never considered anyone else was the perp. but there is a lot of evidence pointing to his son. It's a good rabbit hole to dive into, if you're sitting on the shitter. permalink parent award report block reply COLDWARPATRIOT55 2 points 2 days ago Then you didn’t watch the trial and listen to the evidence.  He did it.  They just introduced enough reasonable doubt not to convict him. permalink parent award report block reply YT45 4 points 2 days ago Hey, I’ve seen this one!  It’s a classic! permalink award report block reply knnbccb 4 points 2 days ago Getting spitroasted by OJ and Bill Cosby, while Diddy is video recording and licking his lips. permalink award report block reply Chainsaw 3 points 2 days ago 🤣🤣🤣🤣 FACTS! permalink award report block reply Now_On_to_Mars 3 points 2 days ago Norm would love that one! permalink award report block reply Ritchie_Blackadder 2 points 2 days ago Hey, be careful with that, it's my lucky stabbin' kufi! permalink parent award report block reply SavingPrivateGrace 3 points 2 days ago Honor killing New York City permalink award report block reply hillaryforprison 2 points 2 days ago You can take comfort in the fact of him not being in heaven permalink award report block reply COLDWARPATRIOT55 4 points 2 days ago We don’t know that.  We don’t know his spiritual condition when he died.  Jesus forgave us of our sins, no matter how bad they are, and if OJ asked Him for forgiveness, then he will be in heaven.\nI know, somehow it doesn’t seem fair.  I felt that way about my starter husband due to his violence against me too.\nHe is now a repentant man, and is close to God. Jesus redeems, even the most vile when they repent.  Let’s hope OJ did.  The price paid by Jesus would be worthless if we didn’t want it for everyone. permalink parent award report block reply raptormissle 2 points 2 days ago I'm okay with this. They deserve it. permalink award report block reply CatalystForChange 2 points 2 days ago Love is blind... and PRETTY stupid! permalink award report block reply DieHeretic 2 points 2 days ago Toll paid in full, with interest. She knew that he was a nagger to begin with,  fame and money doesn't change violent genes. permalink award report block reply MediaBro 1 points 2 days ago Tbh, she was a cheating whore. He didn't have to kill her but you kinda understand. Had she not been cheating and this dude just went ape one day and killed her, sure, you can blame violent genes. But the bitch was cheating on him. Fk that. permalink parent award report block reply LadyGrahamsminge 2 points 1 day ago Of course she was a whore. Fucking a spook left no room for doubt. permalink parent award report block reply MaoHadOnly1Testicle 2 points 2 days ago I heard that back when OJ played for the Bills, Buffalo PD would get domestic violence calls to his house all the time. He was famous, so it was kept out of the public eye. Also, cheating doesn't excuse murder. permalink parent award report block reply DieHeretic 2 points 1 day ago They were divorced at the time she and Goldman were murdered. OJ beat the shit out of her like he did to every other woman he had relations with. The Bills covered for him all the time, keeping it out of the papers. permalink parent award report block reply BarfSimpson 2 points 2 days ago He's gonna cut new york city's head off permalink award report block reply LadyGrahamsminge 1 points 1 day ago If he can’t run the city, he can always ax Nicole. permalink award report block reply Rumpleshitskin 1 points 2 days ago Zo-Jay! permalink award report block reply ReturnOfSmarm 1 points 2 days ago Wouldn't ya know it.  The one guy that is willing to put his life on the line for you ..... kills you. permalink award report block reply\nKing_Dorgan 25 points 2 days ago I’m not sure if I can run this city but at least I’ll take a STAB at it. permalink award report block reply King_Dorgan 20 points 2 days ago I know we’ll BEHEADED in the right direction permalink parent award report block reply\nKing_Dorgan 20 points 2 days ago I know we’ll BEHEADED in the right direction permalink parent award report block reply\nGunsWithGooglyEyes 13 points 2 days ago If the goat hole don't fit, you must acquit. permalink award report block reply barwhack 3 points 2 days ago You beat me to it. permalink parent award report block reply\nbarwhack 3 points 2 days ago You beat me to it. permalink parent award report block reply\nLORDFALCONE 13 points 2 days ago Megan Kelly is a clone? permalink award report block reply\nHelluvaEngineer 12 points 2 days ago Who told you to put the balm on? permalink award report block reply MediaBro 4 points 2 days ago The Maestro permalink parent award report block reply\nMediaBro 4 points 2 days ago The Maestro permalink parent award report block reply\nRuprechtThaMonkeyBoy 11 points 2 days ago It’s gonna Hertz permalink award report block reply\nTheOneWhoKnocks 10 points 2 days ago If ever there was a picture that epitomizes this type of interracial relationship, it's this one. If a rich and famous couple can't get by without the white female getting a few holes added to her body, then what chance do the rest of them have? permalink award report block reply MediaBro 6 points 2 days ago It's often forgotten today just how much OJ was loved by White America, prior to him murdering that woman. He was a great football player, he married a pretty blonde, he was starring as the comic fodder in the Naked Gun movies and was even being chosen to star as the lead in a movie called The Terminator but was not chosen cos he seemed too nice a guy to be able to pull off that role. This man had it all. But a cheating wife is still a cheating wife. Had he just divorced her, told everyone she cheated on him and walked away and married another White woman or even stayed single and decided to bang women of all colours for the rest of his life, no one would even be mad at the guy for making those choices. But he couldn't even do that. It had to end in murder, sadly. What a waste. permalink parent award report block reply GTHAYS 2 points 1 day ago Tiger WOODS is just standing there smiling..... permalink parent award report block reply MediaBro 2 points 23 hours ago Pretty much. Dude had the hottest wife ever and he still couldn't keep his dick in his pants. Oh well. Atleast no one got murdered. permalink parent award report block reply MAGABOND 1 points 1 day ago A guy that would murder his wife has other scandals that would eventually come out and destroy his legacy anyway. Which sorta did happen to OJ later. permalink parent award report block reply\nMediaBro 6 points 2 days ago It's often forgotten today just how much OJ was loved by White America, prior to him murdering that woman. He was a great football player, he married a pretty blonde, he was starring as the comic fodder in the Naked Gun movies and was even being chosen to star as the lead in a movie called The Terminator but was not chosen cos he seemed too nice a guy to be able to pull off that role. This man had it all. But a cheating wife is still a cheating wife. Had he just divorced her, told everyone she cheated on him and walked away and married another White woman or even stayed single and decided to bang women of all colours for the rest of his life, no one would even be mad at the guy for making those choices. But he couldn't even do that. It had to end in murder, sadly. What a waste. permalink parent award report block reply GTHAYS 2 points 1 day ago Tiger WOODS is just standing there smiling..... permalink parent award report block reply MediaBro 2 points 23 hours ago Pretty much. Dude had the hottest wife ever and he still couldn't keep his dick in his pants. Oh well. Atleast no one got murdered. permalink parent award report block reply MAGABOND 1 points 1 day ago A guy that would murder his wife has other scandals that would eventually come out and destroy his legacy anyway. Which sorta did happen to OJ later. permalink parent award report block reply\nGTHAYS 2 points 1 day ago Tiger WOODS is just standing there smiling..... permalink parent award report block reply MediaBro 2 points 23 hours ago Pretty much. Dude had the hottest wife ever and he still couldn't keep his dick in his pants. Oh well. Atleast no one got murdered. permalink parent award report block reply\nMediaBro 2 points 23 hours ago Pretty much. Dude had the hottest wife ever and he still couldn't keep his dick in his pants. Oh well. Atleast no one got murdered. permalink parent award report block reply\nMAGABOND 1 points 1 day ago A guy that would murder his wife has other scandals that would eventually come out and destroy his legacy anyway. Which sorta did happen to OJ later. permalink parent award report block reply\nlovemylibs 10 points 2 days ago She even looks scared in that picture. permalink award report block reply\nCrackerSmurf2 9 points 2 days ago What's Megyn Kelly got to do with anything? /sarc permalink award report block reply\nTDAF 8 points 2 days ago \"You can eat my pussy, but The Juice will kill you.\" permalink award report block reply\nRedPillosopher1776 8 points 2 days ago If you burn the coal you must pay the toll. permalink award report block reply\nSnowSnake 7 points 2 days ago She definitely paid the toll. permalink award report block reply\nNameless_Mofo 6 points 2 days ago Did he ever find the killer? permalink award report block reply -f-b-i- 8 points 2 days ago If I did it permalink parent award report block reply makersmarx 5 points 2 days ago If the glove dont fit you must acquit! permalink parent award report block reply asdrubael_was_right 0 points 2 days ago Hey OJ take a look at user DeltaSierra plz. Possible ban evasion. Or just a board sliding shitlord. permalink parent award report block reply lynxxyarly 3 points 2 days ago lowkey i believe OJ was innocent of the murder. I think his son did it and OJ covered for him. There is a FUCK ton of evidence that the police basically ignored because they never considered anyone else was the perp. but there is a lot of evidence pointing to his son. It's a good rabbit hole to dive into, if you're sitting on the shitter. permalink parent award report block reply COLDWARPATRIOT55 2 points 2 days ago Then you didn’t watch the trial and listen to the evidence.  He did it.  They just introduced enough reasonable doubt not to convict him. permalink parent award report block reply\n-f-b-i- 8 points 2 days ago If I did it permalink parent award report block reply makersmarx 5 points 2 days ago If the glove dont fit you must acquit! permalink parent award report block reply asdrubael_was_right 0 points 2 days ago Hey OJ take a look at user DeltaSierra plz. Possible ban evasion. Or just a board sliding shitlord. permalink parent award report block reply\nmakersmarx 5 points 2 days ago If the glove dont fit you must acquit! permalink parent award report block reply\nasdrubael_was_right 0 points 2 days ago Hey OJ take a look at user DeltaSierra plz. Possible ban evasion. Or just a board sliding shitlord. permalink parent award report block reply\nlynxxyarly 3 points 2 days ago lowkey i believe OJ was innocent of the murder. I think his son did it and OJ covered for him. There is a FUCK ton of evidence that the police basically ignored because they never considered anyone else was the perp. but there is a lot of evidence pointing to his son. It's a good rabbit hole to dive into, if you're sitting on the shitter. permalink parent award report block reply COLDWARPATRIOT55 2 points 2 days ago Then you didn’t watch the trial and listen to the evidence.  He did it.  They just introduced enough reasonable doubt not to convict him. permalink parent award report block reply\nCOLDWARPATRIOT55 2 points 2 days ago Then you didn’t watch the trial and listen to the evidence.  He did it.  They just introduced enough reasonable doubt not to convict him. permalink parent award report block reply\nYT45 4 points 2 days ago Hey, I’ve seen this one!  It’s a classic! permalink award report block reply\nknnbccb 4 points 2 days ago Getting spitroasted by OJ and Bill Cosby, while Diddy is video recording and licking his lips. permalink award report block reply\nChainsaw 3 points 2 days ago 🤣🤣🤣🤣 FACTS! permalink award report block reply\nNow_On_to_Mars 3 points 2 days ago Norm would love that one! permalink award report block reply Ritchie_Blackadder 2 points 2 days ago Hey, be careful with that, it's my lucky stabbin' kufi! permalink parent award report block reply\nRitchie_Blackadder 2 points 2 days ago Hey, be careful with that, it's my lucky stabbin' kufi! permalink parent award report block reply\nSavingPrivateGrace 3 points 2 days ago Honor killing New York City permalink award report block reply\nhillaryforprison 2 points 2 days ago You can take comfort in the fact of him not being in heaven permalink award report block reply COLDWARPATRIOT55 4 points 2 days ago We don’t know that.  We don’t know his spiritual condition when he died.  Jesus forgave us of our sins, no matter how bad they are, and if OJ asked Him for forgiveness, then he will be in heaven.\nI know, somehow it doesn’t seem fair.  I felt that way about my starter husband due to his violence against me too.\nHe is now a repentant man, and is close to God. Jesus redeems, even the most vile when they repent.  Let’s hope OJ did.  The price paid by Jesus would be worthless if we didn’t want it for everyone. permalink parent award report block reply\nCOLDWARPATRIOT55 4 points 2 days ago We don’t know that.  We don’t know his spiritual condition when he died.  Jesus forgave us of our sins, no matter how bad they are, and if OJ asked Him for forgiveness, then he will be in heaven.\nI know, somehow it doesn’t seem fair.  I felt that way about my starter husband due to his violence against me too.\nHe is now a repentant man, and is close to God. Jesus redeems, even the most vile when they repent.  Let’s hope OJ did.  The price paid by Jesus would be worthless if we didn’t want it for everyone. permalink parent award report block reply\nraptormissle 2 points 2 days ago I'm okay with this. They deserve it. permalink award report block reply\nCatalystForChange 2 points 2 days ago Love is blind... and PRETTY stupid! permalink award report block reply\nDieHeretic 2 points 2 days ago Toll paid in full, with interest. She knew that he was a nagger to begin with,  fame and money doesn't change violent genes. permalink award report block reply MediaBro 1 points 2 days ago Tbh, she was a cheating whore. He didn't have to kill her but you kinda understand. Had she not been cheating and this dude just went ape one day and killed her, sure, you can blame violent genes. But the bitch was cheating on him. Fk that. permalink parent award report block reply LadyGrahamsminge 2 points 1 day ago Of course she was a whore. Fucking a spook left no room for doubt. permalink parent award report block reply MaoHadOnly1Testicle 2 points 2 days ago I heard that back when OJ played for the Bills, Buffalo PD would get domestic violence calls to his house all the time. He was famous, so it was kept out of the public eye. Also, cheating doesn't excuse murder. permalink parent award report block reply DieHeretic 2 points 1 day ago They were divorced at the time she and Goldman were murdered. OJ beat the shit out of her like he did to every other woman he had relations with. The Bills covered for him all the time, keeping it out of the papers. permalink parent award report block reply\nMediaBro 1 points 2 days ago Tbh, she was a cheating whore. He didn't have to kill her but you kinda understand. Had she not been cheating and this dude just went ape one day and killed her, sure, you can blame violent genes. But the bitch was cheating on him. Fk that. permalink parent award report block reply LadyGrahamsminge 2 points 1 day ago Of course she was a whore. Fucking a spook left no room for doubt. permalink parent award report block reply MaoHadOnly1Testicle 2 points 2 days ago I heard that back when OJ played for the Bills, Buffalo PD would get domestic violence calls to his house all the time. He was famous, so it was kept out of the public eye. Also, cheating doesn't excuse murder. permalink parent award report block reply DieHeretic 2 points 1 day ago They were divorced at the time she and Goldman were murdered. OJ beat the shit out of her like he did to every other woman he had relations with. The Bills covered for him all the time, keeping it out of the papers. permalink parent award report block reply\nLadyGrahamsminge 2 points 1 day ago Of course she was a whore. Fucking a spook left no room for doubt. permalink parent award report block reply\nMaoHadOnly1Testicle 2 points 2 days ago I heard that back when OJ played for the Bills, Buffalo PD would get domestic violence calls to his house all the time. He was famous, so it was kept out of the public eye. Also, cheating doesn't excuse murder. permalink parent award report block reply\nDieHeretic 2 points 1 day ago They were divorced at the time she and Goldman were murdered. OJ beat the shit out of her like he did to every other woman he had relations with. The Bills covered for him all the time, keeping it out of the papers. permalink parent award report block reply\nBarfSimpson 2 points 2 days ago He's gonna cut new york city's head off permalink award report block reply\nLadyGrahamsminge 1 points 1 day ago If he can’t run the city, he can always ax Nicole. permalink award report block reply\nRumpleshitskin 1 points 2 days ago Zo-Jay! permalink award report block reply\nReturnOfSmarm 1 points 2 days ago Wouldn't ya know it.  The one guy that is willing to put his life on the line for you ..... kills you. permalink award report block reply"}