{"id": "1ARK9pghLr", "contents": "22 Three failed asylum seekers who arrived in the UK on small boats have appeared in court charged with gang raping a woman on Brighton beach.\n\nTwo Egyptians and an Iranian Kurdish man are accused of dragging the 33-year-old woman onto the stone beach before subjecting her to a horrific ordeal. posted 50 minutes ago by Clabber 5 comments award share download report block\n5 comments Sort by Top Top New Worst Old Save PatriotDawg 3 points 49 minutes ago Drop them twenty miles off shore and tell them to swim toward their freedom permalink award report block reply Iremembermypassword 2 points 21 minutes ago Just shoot them like the animals they are. Providing any greater effort gives them a dignity they do not deserve. permalink parent award report block reply CatboxfullofBidens 2 points 38 minutes ago There should be a shark or 2, so there's panicking......and then it's slow inevitability. permalink parent award report block reply RudeFrog 2 points 37 minutes ago Not going to lie, in the case of these muslim rape gangs I fully support abortion permalink award report block reply Clabber OP 1 points 50 minutes ago https://archive.ph/5oSNQ permalink award report block reply\nPatriotDawg 3 points 49 minutes ago Drop them twenty miles off shore and tell them to swim toward their freedom permalink award report block reply Iremembermypassword 2 points 21 minutes ago Just shoot them like the animals they are. Providing any greater effort gives them a dignity they do not deserve. permalink parent award report block reply CatboxfullofBidens 2 points 38 minutes ago There should be a shark or 2, so there's panicking......and then it's slow inevitability. permalink parent award report block reply\nIremembermypassword 2 points 21 minutes ago Just shoot them like the animals they are. Providing any greater effort gives them a dignity they do not deserve. permalink parent award report block reply\nCatboxfullofBidens 2 points 38 minutes ago There should be a shark or 2, so there's panicking......and then it's slow inevitability. permalink parent award report block reply\nRudeFrog 2 points 37 minutes ago Not going to lie, in the case of these muslim rape gangs I fully support abortion permalink award report block reply\nClabber OP 1 points 50 minutes ago https://archive.ph/5oSNQ permalink award report block reply"}