{"id": "1ARK514xEJ", "contents": "304 They killed Charlie Kirk and paid no price, politically. In fact they were rewarded. This where we are in 2025. posted 6 days ago by couranto 17 comments award share download report block\n17 comments Sort by Top Top New Worst Old Save Around the Web Stop Eating These 3 Foods That Are Known to Cause Parasites Paratoxil Bullet3250 17 points 6 days ago Entirety of the MSM is publishing NON-STOP about how bad the Right is... they love that Charlie was killed... they were the same when Trump was shot... No remorse - DID NOT lower the Tone... DID NOT lower the violence.... 'Fascist' talk continues... Here is the powerpoint that the  NOKINGS group is passing around right now to   the entire Nation -to thousands of weak minded smoothbrains... https://docs.google.com/document/d/1WakAnDHO66gkrmkgJd06zibG0yfMVpPRJtvnFEk-iA4/edit?tab=t.0 all \"Life and Death\" kind of stuff... We are still ALL AUTHORTARIANS... ALL NAZIS... TRUMP IS ABOUT TO TAKE FULL POWER.... They won't stop - https://www.nokings.org/ and the Dems believe it. permalink award report block reply henri_derelicte 13 points 6 days ago That’s what I find disturbing. No ill effect at the polls. No violent reprisals by our side. No meaningful attempts to organize. Charlie must not die in vain. The Democratic Party must cease to exist. I don’t care if it means disenfranchising millions, because our mandate comes from God himself permalink award report block reply Iremembermypassword 13 points 6 days ago Exactly. Trump had his chance and blew it to protect Epstein associates of all people. permalink award report block reply grassshrimp -10 points 6 days ago Go fuck yourself, you assholes should have been banned long ago. permalink parent award report block reply Nat4Pat 9 points 6 days ago Controlling media, fixing education, building communities, which one could interest the almighty republicans? Not a doomer, but the governmental solution has failed, MAGA must turn into a civil movement to perservere without Trump. Expecting political wins is ridiculous if the base is not being developed. permalink award report block reply turdinthepunch 7 points 6 days ago I would have thought Republicans getting hunted would have energized Republicans.  Turns out it energizes Democrats.  Wild. permalink award report block reply 24601 5 points 6 days ago This should be stickied. This is why the Communists came out in force.  They want us all to be shot in the neck for not being Communists.  They want us all dead so bad that they got off their fat asses and voted in record numbers in many areas that mattered. permalink award report block reply y_do_i_need_to_hide 4 points 6 days ago Good, this is destroying the propaganda machine. permalink award report block reply TrumpYouMagaFrenner 4 points 6 days ago Why hasn't the shooter been fried yet? permalink award report block reply daveyistheman 3 points 6 days ago I was just wondering today. Where the fuck are we cracking down on the networks his killer was involved in. Where the fuck is the boyfriend?? This story seems to have died overnight permalink award report block reply RuleoVicus 1 points 6 days ago It got dropped when Israel's connections got exposed. permalink parent award report block reply SomeGuyOnTheInternet 3 points 6 days ago Using this pic from Mikey McCoy adds levels to this. permalink award report block reply Albertepstein32 2 points 6 days ago The mainstream narrative of the assassination is such a joke. This is why we need to get rid of the FBI permalink award report block reply michealr24 2 points 6 days ago its why nothing changes until both sides are shooting permalink award report block reply GreyKnight 1 points 6 days ago We aren’t dealing with people who want reasonable responses, non-extremism and non-violence. They think we are in the way of their perfect future so they want us dead, our kids raped, and they think it’s funny. permalink award report block reply Counterwhat 1 points 6 days ago That is the sad reality. They vote Jay Jones in. That means they are OK with political violence as a means to an end. permalink award report block reply Mhmm2MoreWeeks -5 points 6 days ago 'They'? The Shooter was White. Therefore you are responsible for Charlie Kirk based on your race. Obviously. I mean. The same rules apply to Whites as other Races? A White Man killed Charlie Kirk. Therefore White people killed Charlie Kirk. Hey im just using the same logic users on this website apply to Jews. permalink award report block reply\nBullet3250 17 points 6 days ago Entirety of the MSM is publishing NON-STOP about how bad the Right is... they love that Charlie was killed... they were the same when Trump was shot... No remorse - DID NOT lower the Tone... DID NOT lower the violence.... 'Fascist' talk continues... Here is the powerpoint that the  NOKINGS group is passing around right now to   the entire Nation -to thousands of weak minded smoothbrains... https://docs.google.com/document/d/1WakAnDHO66gkrmkgJd06zibG0yfMVpPRJtvnFEk-iA4/edit?tab=t.0 all \"Life and Death\" kind of stuff... We are still ALL AUTHORTARIANS... ALL NAZIS... TRUMP IS ABOUT TO TAKE FULL POWER.... They won't stop - https://www.nokings.org/ and the Dems believe it. permalink award report block reply\nhenri_derelicte 13 points 6 days ago That’s what I find disturbing. No ill effect at the polls. No violent reprisals by our side. No meaningful attempts to organize. Charlie must not die in vain. The Democratic Party must cease to exist. I don’t care if it means disenfranchising millions, because our mandate comes from God himself permalink award report block reply\nIremembermypassword 13 points 6 days ago Exactly. Trump had his chance and blew it to protect Epstein associates of all people. permalink award report block reply grassshrimp -10 points 6 days ago Go fuck yourself, you assholes should have been banned long ago. permalink parent award report block reply\ngrassshrimp -10 points 6 days ago Go fuck yourself, you assholes should have been banned long ago. permalink parent award report block reply\nNat4Pat 9 points 6 days ago Controlling media, fixing education, building communities, which one could interest the almighty republicans? Not a doomer, but the governmental solution has failed, MAGA must turn into a civil movement to perservere without Trump. Expecting political wins is ridiculous if the base is not being developed. permalink award report block reply\nturdinthepunch 7 points 6 days ago I would have thought Republicans getting hunted would have energized Republicans.  Turns out it energizes Democrats.  Wild. permalink award report block reply\n24601 5 points 6 days ago This should be stickied. This is why the Communists came out in force.  They want us all to be shot in the neck for not being Communists.  They want us all dead so bad that they got off their fat asses and voted in record numbers in many areas that mattered. permalink award report block reply\ny_do_i_need_to_hide 4 points 6 days ago Good, this is destroying the propaganda machine. permalink award report block reply\nTrumpYouMagaFrenner 4 points 6 days ago Why hasn't the shooter been fried yet? permalink award report block reply\ndaveyistheman 3 points 6 days ago I was just wondering today. Where the fuck are we cracking down on the networks his killer was involved in. Where the fuck is the boyfriend?? This story seems to have died overnight permalink award report block reply RuleoVicus 1 points 6 days ago It got dropped when Israel's connections got exposed. permalink parent award report block reply\nRuleoVicus 1 points 6 days ago It got dropped when Israel's connections got exposed. permalink parent award report block reply\nSomeGuyOnTheInternet 3 points 6 days ago Using this pic from Mikey McCoy adds levels to this. permalink award report block reply\nAlbertepstein32 2 points 6 days ago The mainstream narrative of the assassination is such a joke. This is why we need to get rid of the FBI permalink award report block reply\nmichealr24 2 points 6 days ago its why nothing changes until both sides are shooting permalink award report block reply\nGreyKnight 1 points 6 days ago We aren’t dealing with people who want reasonable responses, non-extremism and non-violence. They think we are in the way of their perfect future so they want us dead, our kids raped, and they think it’s funny. permalink award report block reply\nCounterwhat 1 points 6 days ago That is the sad reality. They vote Jay Jones in. That means they are OK with political violence as a means to an end. permalink award report block reply\nMhmm2MoreWeeks -5 points 6 days ago 'They'? The Shooter was White. Therefore you are responsible for Charlie Kirk based on your race. Obviously. I mean. The same rules apply to Whites as other Races? A White Man killed Charlie Kirk. Therefore White people killed Charlie Kirk. Hey im just using the same logic users on this website apply to Jews. permalink award report block reply"}