{"id": "1ARK9pf37i", "contents": "38 Kevin Spacey, the actor, once a passenger on Jeffrey Epstein’s plane broke down in tears sharing his story of visiting Israel, deeply moved by citizens who have been the real victims for the past few years. posted 11 hours ago by CatalystForChange 6 comments award share report block Shadow of Ezra @ShadowofEzra • 11h Kevin Spacey broke down in tears while sharing his story about visiting Israel, saying he was deeply moved by citizens who he says have been the real victims for the past few years. The actor, once a passenger on Jeffrey Epstein’s plane, said he didn’t need to understand Hebrew\n6 comments Sort by Top Top New Worst Old Save Roadpower 7 points 11 hours ago If there is one absolute position Israel and its big backers have it is that homosexual deviancy is a major priority for them. permalink award report block reply militantnationalist6 7 points 10 hours ago This what the end looks like for a man who’s sold his soul many times over. Pimped out like a tan through prostitute to service the crowd one more time. Pretty sad actually. permalink award report block reply BidenShowerDrool 2 points 9 hours ago There is bending the knee and kissing the ring and then there is this, Sucking the Dick. permalink award report block reply BlokeyMcBlokeFace 2 points 9 hours ago If he wants back into holiweird, then this is the way to do it. permalink parent award report block reply Wizard_Glick 2 points 4 hours ago Isn't Kevin a pedophile? permalink award report block reply AfterGlow 2 points 9 hours ago It's the primary destination for accused pedo's. permalink award report block reply\nRoadpower 7 points 11 hours ago If there is one absolute position Israel and its big backers have it is that homosexual deviancy is a major priority for them. permalink award report block reply\nmilitantnationalist6 7 points 10 hours ago This what the end looks like for a man who’s sold his soul many times over. Pimped out like a tan through prostitute to service the crowd one more time. Pretty sad actually. permalink award report block reply\nBidenShowerDrool 2 points 9 hours ago There is bending the knee and kissing the ring and then there is this, Sucking the Dick. permalink award report block reply BlokeyMcBlokeFace 2 points 9 hours ago If he wants back into holiweird, then this is the way to do it. permalink parent award report block reply\nBlokeyMcBlokeFace 2 points 9 hours ago If he wants back into holiweird, then this is the way to do it. permalink parent award report block reply\nWizard_Glick 2 points 4 hours ago Isn't Kevin a pedophile? permalink award report block reply\nAfterGlow 2 points 9 hours ago It's the primary destination for accused pedo's. permalink award report block reply"}