{"id": "1ARK5A8kHQ", "contents": "255 50 year loans won't work as we don't live in a multi-generational society anymore. 🌶️ 🌶️ SPICY 🌶️ 🌶️ posted 3 days ago by based_trekkie 23 comments award share download report block\n23 comments Sort by Top Top New Worst Old Save MEME-SUPREME 10 points 3 days ago Why not 100 years. The first 75 years is just interest payments. permalink award report block reply Zhongda 10 points 3 days ago Do NOT give the yids ideas!  My God, man! permalink parent award report block reply bigdickhangsright 3 points 3 days ago Oh man wait till they have their goyim slaves post a reply and downvote for them. permalink parent award report block reply Greenblatts_4skin 1 points 3 days ago those exist in one of the nordic countries, Sweden probably. permalink parent award report block reply cyberrigger 1 points 3 days ago at some point ---- you are just renting money permalink parent award report block reply America_No_1 8 points 3 days ago Not to mention modern homes will barely laat 50 years with the way they are built permalink award report block reply Franklymydear 5 points 3 days ago Pajeet labor has entered the chat permalink parent award report block reply bigdickhangsright 3 points 3 days ago Street Shitter Construction, Inc. permalink parent award report block reply Datamancer 3 points 3 days ago Can you tell me how many families remain in the same home for the entirety of the mortgage? Can you tell me what the penalty for paying off a 50-year mortgage in 15 years in? Can you tell me in general what the penalty for pre-payment of mortgage is? permalink award report block reply Hantif 1 points 3 days ago My parents lived in their home well after it was paid off, I've paid off two mortgages. We're not all moving every 4 years. Edit: autocorrupt error permalink parent award report block reply panic86 1 points 3 days ago Most homeowners move every 8-12 years, depending on who you ask. Damn close to zero primary residence mortgages have a pre-payment penalty anymore. Those contract terms ended after the 2008 housing crash. Nowadays, basically only investment properties or subprime loans ever have a pre-payment penalty. permalink parent award report block reply feelips 1 points 3 days ago Living in a city with very high property tax, it would be advantageous for me to have a 50 year mortgage. The caveat would be that I am moving to another state in 7 years. It isn’t unusual here to see a mortgage payment of $2,000 a month where $800, or even $1,000, of that monthly payment is property taxes. My plan is to retire in 7 years and move to another state that has low housing costs and low cost of living while living off two pensions and VA disability. If I can lower my current mortgage payment by 25% or more by refinancing to  50 year mortgage, that’s more cash in my pocket later when I sell this house to buy in another state. Having said that, I would not want to be young and sign a 50 year mortgage! permalink award report block reply 2016TrumpMAGA 1 points 3 days ago If I can lower my current mortgage payment by 25% or more by refinancing to 50 year mortgage Assuming the same interest rate of 6.5% (which it won't be, longer term mortgages are always higher rates) you would lower it by about 11%. permalink parent award report block reply NamendaBiden 1 points 3 days ago \"Having said that, I would not want to be young and sign a 50 year mortgage!\" Meh.  Thats what refinancing is for.  I didnt want to be in a 30 year.  So, when rates came down, I refinanced into a 20.  Still gonna pay that off about 5 years early by throwing extra $ at the principal every month. permalink parent award report block reply Trajano 1 points 3 days ago Are you proposing to transfer the parents' debt to the children? permalink award report block reply Hantif 1 points 3 days ago No, they're proposing transferring a paid off property to the children, like we have for 250+ years. Inheritance is not the transfer of debt. Multi-generational ownership of land used to be the norm, around here they're designated \"century farms\" because they've been owned by the same family for over 100 years. permalink parent award report block reply 2016TrumpMAGA 1 points 3 days ago A $500,000 fifty year mortgage would only save $150 a month over a 30 year mortgage.  It's a stupid idea. Interest rates need to be lower. Illegals need to be deported. permalink award report block reply TheTelltaleFly 1 points 3 days ago Illegals need to be deported. Mostly this permalink parent award report block reply UltraFrogMan 1 points 3 days ago Arent they getting rid of inheritance tax? permalink award report block reply FlgPole 0 points 3 days ago In 50 years we will be billions of years more advanced in technology. 87 human races have been colonizing the universe and the technology embargo keeping us below caveman is about to be lifted. Before Trump is done, we will have portals and unlimited resources of space. permalink award report block reply Datamancer 1 points 3 days ago still whacked in the head I see. permalink parent award report block reply Formerlurker92 1 points 3 days ago Take your medicine dear, the voices are whispering to you again permalink parent award report block reply FlgPole 2 points 3 days ago https://i.imgur.com/akcyt6n.mp4 2016 Venus being moved to a habitable zone permalink parent award report block reply Franklymydear 0 points 3 days ago Depends on the state and there’s ways around that permalink award report block reply Hantif 1 points 3 days ago We used a life estate. Parents keep control of the land until they die but title is transferred to the kid. Protects the land from seizure and sale if parents are placed in a retirement home after 7 years, too. permalink parent award report block reply\nMEME-SUPREME 10 points 3 days ago Why not 100 years. The first 75 years is just interest payments. permalink award report block reply Zhongda 10 points 3 days ago Do NOT give the yids ideas!  My God, man! permalink parent award report block reply bigdickhangsright 3 points 3 days ago Oh man wait till they have their goyim slaves post a reply and downvote for them. permalink parent award report block reply Greenblatts_4skin 1 points 3 days ago those exist in one of the nordic countries, Sweden probably. permalink parent award report block reply cyberrigger 1 points 3 days ago at some point ---- you are just renting money permalink parent award report block reply\nZhongda 10 points 3 days ago Do NOT give the yids ideas!  My God, man! permalink parent award report block reply bigdickhangsright 3 points 3 days ago Oh man wait till they have their goyim slaves post a reply and downvote for them. permalink parent award report block reply\nbigdickhangsright 3 points 3 days ago Oh man wait till they have their goyim slaves post a reply and downvote for them. permalink parent award report block reply\nGreenblatts_4skin 1 points 3 days ago those exist in one of the nordic countries, Sweden probably. permalink parent award report block reply\ncyberrigger 1 points 3 days ago at some point ---- you are just renting money permalink parent award report block reply\nAmerica_No_1 8 points 3 days ago Not to mention modern homes will barely laat 50 years with the way they are built permalink award report block reply Franklymydear 5 points 3 days ago Pajeet labor has entered the chat permalink parent award report block reply bigdickhangsright 3 points 3 days ago Street Shitter Construction, Inc. permalink parent award report block reply\nFranklymydear 5 points 3 days ago Pajeet labor has entered the chat permalink parent award report block reply bigdickhangsright 3 points 3 days ago Street Shitter Construction, Inc. permalink parent award report block reply\nbigdickhangsright 3 points 3 days ago Street Shitter Construction, Inc. permalink parent award report block reply\nDatamancer 3 points 3 days ago Can you tell me how many families remain in the same home for the entirety of the mortgage? Can you tell me what the penalty for paying off a 50-year mortgage in 15 years in? Can you tell me in general what the penalty for pre-payment of mortgage is? permalink award report block reply Hantif 1 points 3 days ago My parents lived in their home well after it was paid off, I've paid off two mortgages. We're not all moving every 4 years. Edit: autocorrupt error permalink parent award report block reply panic86 1 points 3 days ago Most homeowners move every 8-12 years, depending on who you ask. Damn close to zero primary residence mortgages have a pre-payment penalty anymore. Those contract terms ended after the 2008 housing crash. Nowadays, basically only investment properties or subprime loans ever have a pre-payment penalty. permalink parent award report block reply\nHantif 1 points 3 days ago My parents lived in their home well after it was paid off, I've paid off two mortgages. We're not all moving every 4 years. Edit: autocorrupt error permalink parent award report block reply\npanic86 1 points 3 days ago Most homeowners move every 8-12 years, depending on who you ask. Damn close to zero primary residence mortgages have a pre-payment penalty anymore. Those contract terms ended after the 2008 housing crash. Nowadays, basically only investment properties or subprime loans ever have a pre-payment penalty. permalink parent award report block reply\nfeelips 1 points 3 days ago Living in a city with very high property tax, it would be advantageous for me to have a 50 year mortgage. The caveat would be that I am moving to another state in 7 years. It isn’t unusual here to see a mortgage payment of $2,000 a month where $800, or even $1,000, of that monthly payment is property taxes. My plan is to retire in 7 years and move to another state that has low housing costs and low cost of living while living off two pensions and VA disability. If I can lower my current mortgage payment by 25% or more by refinancing to  50 year mortgage, that’s more cash in my pocket later when I sell this house to buy in another state. Having said that, I would not want to be young and sign a 50 year mortgage! permalink award report block reply 2016TrumpMAGA 1 points 3 days ago If I can lower my current mortgage payment by 25% or more by refinancing to 50 year mortgage Assuming the same interest rate of 6.5% (which it won't be, longer term mortgages are always higher rates) you would lower it by about 11%. permalink parent award report block reply NamendaBiden 1 points 3 days ago \"Having said that, I would not want to be young and sign a 50 year mortgage!\" Meh.  Thats what refinancing is for.  I didnt want to be in a 30 year.  So, when rates came down, I refinanced into a 20.  Still gonna pay that off about 5 years early by throwing extra $ at the principal every month. permalink parent award report block reply\n2016TrumpMAGA 1 points 3 days ago If I can lower my current mortgage payment by 25% or more by refinancing to 50 year mortgage Assuming the same interest rate of 6.5% (which it won't be, longer term mortgages are always higher rates) you would lower it by about 11%. permalink parent award report block reply\nNamendaBiden 1 points 3 days ago \"Having said that, I would not want to be young and sign a 50 year mortgage!\" Meh.  Thats what refinancing is for.  I didnt want to be in a 30 year.  So, when rates came down, I refinanced into a 20.  Still gonna pay that off about 5 years early by throwing extra $ at the principal every month. permalink parent award report block reply\nTrajano 1 points 3 days ago Are you proposing to transfer the parents' debt to the children? permalink award report block reply Hantif 1 points 3 days ago No, they're proposing transferring a paid off property to the children, like we have for 250+ years. Inheritance is not the transfer of debt. Multi-generational ownership of land used to be the norm, around here they're designated \"century farms\" because they've been owned by the same family for over 100 years. permalink parent award report block reply\nHantif 1 points 3 days ago No, they're proposing transferring a paid off property to the children, like we have for 250+ years. Inheritance is not the transfer of debt. Multi-generational ownership of land used to be the norm, around here they're designated \"century farms\" because they've been owned by the same family for over 100 years. permalink parent award report block reply\n2016TrumpMAGA 1 points 3 days ago A $500,000 fifty year mortgage would only save $150 a month over a 30 year mortgage.  It's a stupid idea. Interest rates need to be lower. Illegals need to be deported. permalink award report block reply TheTelltaleFly 1 points 3 days ago Illegals need to be deported. Mostly this permalink parent award report block reply\nTheTelltaleFly 1 points 3 days ago Illegals need to be deported. Mostly this permalink parent award report block reply\nUltraFrogMan 1 points 3 days ago Arent they getting rid of inheritance tax? permalink award report block reply\nFlgPole 0 points 3 days ago In 50 years we will be billions of years more advanced in technology. 87 human races have been colonizing the universe and the technology embargo keeping us below caveman is about to be lifted. Before Trump is done, we will have portals and unlimited resources of space. permalink award report block reply Datamancer 1 points 3 days ago still whacked in the head I see. permalink parent award report block reply Formerlurker92 1 points 3 days ago Take your medicine dear, the voices are whispering to you again permalink parent award report block reply FlgPole 2 points 3 days ago https://i.imgur.com/akcyt6n.mp4 2016 Venus being moved to a habitable zone permalink parent award report block reply\nDatamancer 1 points 3 days ago still whacked in the head I see. permalink parent award report block reply\nFormerlurker92 1 points 3 days ago Take your medicine dear, the voices are whispering to you again permalink parent award report block reply FlgPole 2 points 3 days ago https://i.imgur.com/akcyt6n.mp4 2016 Venus being moved to a habitable zone permalink parent award report block reply\nFlgPole 2 points 3 days ago https://i.imgur.com/akcyt6n.mp4 2016 Venus being moved to a habitable zone permalink parent award report block reply\nFranklymydear 0 points 3 days ago Depends on the state and there’s ways around that permalink award report block reply Hantif 1 points 3 days ago We used a life estate. Parents keep control of the land until they die but title is transferred to the kid. Protects the land from seizure and sale if parents are placed in a retirement home after 7 years, too. permalink parent award report block reply\nHantif 1 points 3 days ago We used a life estate. Parents keep control of the land until they die but title is transferred to the kid. Protects the land from seizure and sale if parents are placed in a retirement home after 7 years, too. permalink parent award report block reply"}