{"id": "1ARK9mGxtP", "contents": "45 Trump: We’ll ‘Lower Some Tariffs’ to Lower Coffee Prices. Thank goodness since I'm paying three times what I was a month ago. (www.breitbart.com) posted 16 hours ago by friarfox 7 comments award share report block Trump: We'll 'Lower Some Tariffs' to Lower Coffee Prices During a portion of an interview with the Fox News Channel aired on Tuesday's broadcast of \"The Ingraham Angle,\" President Donald Trump responded to | Clips www.breitbart.com\n7 comments Sort by Top Top New Worst Old Save cyberrigger 2 points 16 hours ago I drink made in USA coffee. permalink award report block reply friarfox OP 1 points 15 hours ago Coffee is not grown on the continental USA, only packaged. permalink parent award report block reply cyberrigger 2 points 15 hours ago Hawaii ---- expensive but very good permalink parent award report block reply jcd_007 4 points 15 hours ago Hawaii isn’t the continental US, but yes that is the best coffee. permalink parent award report block reply cyberrigger 1 points 15 hours ago I didn't say continental US permalink parent award report block reply RINOssuck 1 points 10 hours ago Bitch bitch bitch permalink award report block reply Logan051361 0 points 10 hours ago Or....Stop Drinking Coffee. It tastes like shit anyway permalink award report block reply\ncyberrigger 2 points 16 hours ago I drink made in USA coffee. permalink award report block reply friarfox OP 1 points 15 hours ago Coffee is not grown on the continental USA, only packaged. permalink parent award report block reply cyberrigger 2 points 15 hours ago Hawaii ---- expensive but very good permalink parent award report block reply jcd_007 4 points 15 hours ago Hawaii isn’t the continental US, but yes that is the best coffee. permalink parent award report block reply cyberrigger 1 points 15 hours ago I didn't say continental US permalink parent award report block reply\nfriarfox OP 1 points 15 hours ago Coffee is not grown on the continental USA, only packaged. permalink parent award report block reply cyberrigger 2 points 15 hours ago Hawaii ---- expensive but very good permalink parent award report block reply jcd_007 4 points 15 hours ago Hawaii isn’t the continental US, but yes that is the best coffee. permalink parent award report block reply cyberrigger 1 points 15 hours ago I didn't say continental US permalink parent award report block reply\ncyberrigger 2 points 15 hours ago Hawaii ---- expensive but very good permalink parent award report block reply jcd_007 4 points 15 hours ago Hawaii isn’t the continental US, but yes that is the best coffee. permalink parent award report block reply cyberrigger 1 points 15 hours ago I didn't say continental US permalink parent award report block reply\njcd_007 4 points 15 hours ago Hawaii isn’t the continental US, but yes that is the best coffee. permalink parent award report block reply cyberrigger 1 points 15 hours ago I didn't say continental US permalink parent award report block reply\ncyberrigger 1 points 15 hours ago I didn't say continental US permalink parent award report block reply\nRINOssuck 1 points 10 hours ago Bitch bitch bitch permalink award report block reply\nLogan051361 0 points 10 hours ago Or....Stop Drinking Coffee. It tastes like shit anyway permalink award report block reply"}