{"id": "1ARK53JpGH", "contents": "766 Rape Averted posted 6 days ago by _Liberty_Prime_ 65 comments award share report block Breanna Morello @BreannaMorello • 6d When a Middle Eastern man followed me into my apartment complex and tried coming up to my apartment, you know what saved me? My Glock. If you haven't gone to the range this week, GO!\n65 comments Sort by Top Top New Worst Old Save gillonba 45 points 6 days ago It's a shame he lived.  Hopefully she will make better use of her range time in the future.  Or get a Sig permalink award report block reply JoeBidensDementia1 19 points 6 days ago I love my 226. permalink parent award report block reply OpusX 14 points 6 days ago One of the best handgun models ever made. Have a whole collection of Sigs, but oddly have never owned a 226. Really been eyeballing the new single action models though. Not sure whether I'd want the Legion or X-Five. permalink parent award report block reply swift_water 8 points 6 days ago Didn't they recently get into some problems with them discharging? permalink parent award report block reply RedStoneDeepState 10 points 6 days ago That would be the P320 not the P226 permalink parent award report block reply view 5 more comments... OpusX 6 points 6 days ago Ya, they're in deep shit right now over unintended discharges with the P320, but the rest of their models are still solid. P226 has decades of proven performance in combat. permalink parent award report block reply view 3 more comments... NomadicKrow2 1 points 5 days ago \"Problems\" is an understatement. It's killed an Airman already. He put his piece on the dresser and it discharged, striking him in the chest and killing him. He died right there in the barracks. permalink parent award report block reply view 4 more comments... JoeBidensDementia1 3 points 6 days ago Yes permalink parent award report block reply HIGH_ENERGY_MEMES 2 points 6 days ago You know it doesn't have to be 'or' permalink parent award report block reply dukeofdoorcounty 2 points 5 days ago I have an '80s P226.  Best shooting pistol ever. permalink parent award report block reply sixfingerdildo 3 points 6 days ago cz. for the working man. permalink parent award report block reply ganachain 2 points 5 days ago Shadow 2 for the upper middle class permalink parent award report block reply Hantif 2 points 6 days ago I have a 229, the compact version of the 226. It's one of my EDC favorites (I cycle through a few depending on weather). permalink parent award report block reply JoeBidensDementia1 2 points 6 days ago What's EDC? Source: am retard permalink parent award report block reply bratt 4 points 6 days ago every day carry permalink parent award report block reply view 4 more comments... Hantif 3 points 6 days ago Every. Day . Carry permalink parent award report block reply CharlieMike 1 points 6 days ago P229 for me. And a S&W Shield for backup. permalink parent award report block reply h3xAd3c1m4L 5 points 5 days ago It is a shame because that guy is at it again. Stalking more women in the north Dallas area. Following this story on X. It’s pretty nuts. permalink parent award report block reply GA_Logic 3 points 5 days ago That is wild. permalink parent award report block reply NomadicKrow2 3 points 5 days ago A SIG will do the job, even if you can't. permalink parent award report block reply sixfingerdildo 1 points 6 days ago i don't know what happened, ossifer, the gun just went off! you know, i heard that guns can do that, is this that brand of gun? gosh, i should get rid of it now! permalink parent award report block reply Scumbag-reddit 1 points 6 days ago In terms of full size handguns I'd choose glock any day because I l9ve how they shoot. In terms of a carry firearm like a compact or subcompact I would never...too bulky in my opinion. permalink parent award report block reply 38WendysHamSquare79 28 points 6 days ago muslim men :/ permalink award report block reply freedom-thinker 23 points 6 days ago Every time, they all have NO PROBLEM with it whatsoever.  By raping women they are just trying to be like Mohamed which is the ideal man for muslim men, who they seek to emulate, raping an un-accompanied or non-muslim woman is gods work for them. They think they will be rewarded. Sick. permalink parent award report block reply justinkayz 5 points 6 days ago This is what musloids don't want you to know about their \"prophet\" https://www.brighteon.com/2a028dda-2850-4ffd-9c87-2bd94bf2bd58 permalink parent award report block reply Nezock_theKnight 4 points 5 days ago You are 100% right.  Truest statement I've see in a while.  Most muslim men (with the exception of mostly Americanized muslims, i.e. been here for decades or come from a civilized country such as Morocco, Algeria or UAE) think it's their right to rape you and take what they believe is theirs.  Its ingrained in them from birth by their religion.  They consider European and American women easy prey.  They would rape them in a second, with any opportunity, then walk away thinking nothing is wrong.  The same attitude is held by most of the illegal immigrants from the South.  Some of them are muslim, but the rest are told from a very young age: \"get what is yours. They (Americans) have your land and your happiness.  They don't deserve it.  Go to America, steal their goods, rape their women, shit over everything.\" permalink parent award report block reply johnqpublic864 3 points 6 days ago If only the Genophage were real. permalink parent award report block reply MAGALADON9 20 points 6 days ago I've used but not fired a gun three times to stop crimes.  Never reported any.  Happens millions of times permalink award report block reply magamagashii 16 points 6 days ago Almost got attempted carjacked, and not in a place you'd expect. I'd drawn and had the two dead to rights. They'd be at the firey gates before they knew what happened. But, back window was down and my dog stuck his head out the window and scared them off. Doggo got THREE big steaks for that. I'm not going through all that nonsense and risk if I don't need to. Called it in about an hour later when I felt guilty they'd probably find a victim and I highly suspected they were armed. permalink parent award report block reply MAGALADON9 8 points 6 days ago I keep a snubby revolver in a coat pocket specifically to shoot through the coat if I need the surprise.  But have a regular semi auto in a vertical roto holster. But I can't draw if they have their drawn already.  Good dog permalink parent award report block reply GA_Logic 2 points 5 days ago Good doogy is good. Your are blessed to have such a dog. permalink parent award report block reply VoteThing 16 points 6 days ago When I was a kid going into gun stores with my dad in the 80s, there were lots of posters on the wall explaining that men had to fear women if they had a gun and knew how to use it. I guess feminists managed to bury all that. permalink award report block reply _Liberty_Prime_ OP 6 points 6 days ago I think the word \"feminist\" has more than one meaning. permalink parent award report block reply RedStoneDeepState 5 points 6 days ago It has multiple meanings. It started in Germany and moved west/east with different meanings. Soviet style feminism is basically... dont let your husband be a stereotypical Russian alcoholic who beats you. permalink parent award report block reply invalid_data 15 points 6 days ago This Plano, TX. Guess who have flooded to Dallas literally taking over the whole north of the city. Indians and Muslims. Guess who invited them in, Gov. Abbott. permalink award report block reply TheJakeFroggy 10 points 6 days ago Guys like him deserve to be kicked in the nuts. I wonder how he'd feel if that happened to him. permalink award report block reply freedom-thinker 15 points 6 days ago They need to be 100% executed, but that's just me. permalink parent award report block reply TheJakeFroggy 6 points 6 days ago I don't disagree at all, but sometimes alternative means of karma can be amusing. Hardcore humiliation can be had every now and then. permalink parent award report block reply Aambrick 3 points 6 days ago Hardcore Humiliation is not getting kicked in the sack. Hardcore Humiliation is knocking the guy down, his head hitting the rail making him daze, and a dog walking buy sniffing him then marking its territory, and finally police show up dragging a marked territory from the premise by the feet so as not to touch the marked area. permalink parent award report block reply freedom-thinker 2 points 6 days ago True. Would like to see something happen to him, at least. permalink parent award report block reply Choppermagic 9 points 6 days ago This will be New York everyday now permalink award report block reply Lelleck 8 points 5 days ago How? Guns are verboten in NYC. This video will end very differently in NYC. permalink parent award report block reply VikingHalo45 4 points 6 days ago That's my gurl. permalink award report block reply Buff_cousin_Elroy 4 points 6 days ago Ragheads are putrid subhuman trash permalink award report block reply Shih_Tabed 1 points 6 days ago Just 1 per day if you are in a large metro saturated with them and you would be doing your part.  Get in and get out.  You won't get caught. permalink parent award report block reply justinkayz 2 points 6 days ago Check out this middle eastern man... https://www.brighteon.com/2a028dda-2850-4ffd-9c87-2bd94bf2bd58 permalink award report block reply Weneverleft 1 points 5 days ago Europe,  ARE YOU TAKING NOTES. GET YOUR FUCKING GUNS BACK!!!! permalink award report block reply suckmycorona 1 points 6 days ago Comment removed by community moderators. permalink award report block reply\ngillonba 45 points 6 days ago It's a shame he lived.  Hopefully she will make better use of her range time in the future.  Or get a Sig permalink award report block reply JoeBidensDementia1 19 points 6 days ago I love my 226. permalink parent award report block reply OpusX 14 points 6 days ago One of the best handgun models ever made. Have a whole collection of Sigs, but oddly have never owned a 226. Really been eyeballing the new single action models though. Not sure whether I'd want the Legion or X-Five. permalink parent award report block reply swift_water 8 points 6 days ago Didn't they recently get into some problems with them discharging? permalink parent award report block reply RedStoneDeepState 10 points 6 days ago That would be the P320 not the P226 permalink parent award report block reply view 5 more comments... OpusX 6 points 6 days ago Ya, they're in deep shit right now over unintended discharges with the P320, but the rest of their models are still solid. P226 has decades of proven performance in combat. permalink parent award report block reply view 3 more comments... NomadicKrow2 1 points 5 days ago \"Problems\" is an understatement. It's killed an Airman already. He put his piece on the dresser and it discharged, striking him in the chest and killing him. He died right there in the barracks. permalink parent award report block reply view 4 more comments... JoeBidensDementia1 3 points 6 days ago Yes permalink parent award report block reply HIGH_ENERGY_MEMES 2 points 6 days ago You know it doesn't have to be 'or' permalink parent award report block reply dukeofdoorcounty 2 points 5 days ago I have an '80s P226.  Best shooting pistol ever. permalink parent award report block reply sixfingerdildo 3 points 6 days ago cz. for the working man. permalink parent award report block reply ganachain 2 points 5 days ago Shadow 2 for the upper middle class permalink parent award report block reply Hantif 2 points 6 days ago I have a 229, the compact version of the 226. It's one of my EDC favorites (I cycle through a few depending on weather). permalink parent award report block reply JoeBidensDementia1 2 points 6 days ago What's EDC? Source: am retard permalink parent award report block reply bratt 4 points 6 days ago every day carry permalink parent award report block reply view 4 more comments... Hantif 3 points 6 days ago Every. Day . Carry permalink parent award report block reply CharlieMike 1 points 6 days ago P229 for me. And a S&W Shield for backup. permalink parent award report block reply h3xAd3c1m4L 5 points 5 days ago It is a shame because that guy is at it again. Stalking more women in the north Dallas area. Following this story on X. It’s pretty nuts. permalink parent award report block reply GA_Logic 3 points 5 days ago That is wild. permalink parent award report block reply NomadicKrow2 3 points 5 days ago A SIG will do the job, even if you can't. permalink parent award report block reply sixfingerdildo 1 points 6 days ago i don't know what happened, ossifer, the gun just went off! you know, i heard that guns can do that, is this that brand of gun? gosh, i should get rid of it now! permalink parent award report block reply Scumbag-reddit 1 points 6 days ago In terms of full size handguns I'd choose glock any day because I l9ve how they shoot. In terms of a carry firearm like a compact or subcompact I would never...too bulky in my opinion. permalink parent award report block reply\nJoeBidensDementia1 19 points 6 days ago I love my 226. permalink parent award report block reply OpusX 14 points 6 days ago One of the best handgun models ever made. Have a whole collection of Sigs, but oddly have never owned a 226. Really been eyeballing the new single action models though. Not sure whether I'd want the Legion or X-Five. permalink parent award report block reply swift_water 8 points 6 days ago Didn't they recently get into some problems with them discharging? permalink parent award report block reply RedStoneDeepState 10 points 6 days ago That would be the P320 not the P226 permalink parent award report block reply view 5 more comments... OpusX 6 points 6 days ago Ya, they're in deep shit right now over unintended discharges with the P320, but the rest of their models are still solid. P226 has decades of proven performance in combat. permalink parent award report block reply view 3 more comments... NomadicKrow2 1 points 5 days ago \"Problems\" is an understatement. It's killed an Airman already. He put his piece on the dresser and it discharged, striking him in the chest and killing him. He died right there in the barracks. permalink parent award report block reply view 4 more comments... JoeBidensDementia1 3 points 6 days ago Yes permalink parent award report block reply HIGH_ENERGY_MEMES 2 points 6 days ago You know it doesn't have to be 'or' permalink parent award report block reply dukeofdoorcounty 2 points 5 days ago I have an '80s P226.  Best shooting pistol ever. permalink parent award report block reply sixfingerdildo 3 points 6 days ago cz. for the working man. permalink parent award report block reply ganachain 2 points 5 days ago Shadow 2 for the upper middle class permalink parent award report block reply Hantif 2 points 6 days ago I have a 229, the compact version of the 226. It's one of my EDC favorites (I cycle through a few depending on weather). permalink parent award report block reply JoeBidensDementia1 2 points 6 days ago What's EDC? Source: am retard permalink parent award report block reply bratt 4 points 6 days ago every day carry permalink parent award report block reply view 4 more comments... Hantif 3 points 6 days ago Every. Day . Carry permalink parent award report block reply CharlieMike 1 points 6 days ago P229 for me. And a S&W Shield for backup. permalink parent award report block reply\nOpusX 14 points 6 days ago One of the best handgun models ever made. Have a whole collection of Sigs, but oddly have never owned a 226. Really been eyeballing the new single action models though. Not sure whether I'd want the Legion or X-Five. permalink parent award report block reply swift_water 8 points 6 days ago Didn't they recently get into some problems with them discharging? permalink parent award report block reply RedStoneDeepState 10 points 6 days ago That would be the P320 not the P226 permalink parent award report block reply view 5 more comments... OpusX 6 points 6 days ago Ya, they're in deep shit right now over unintended discharges with the P320, but the rest of their models are still solid. P226 has decades of proven performance in combat. permalink parent award report block reply view 3 more comments... NomadicKrow2 1 points 5 days ago \"Problems\" is an understatement. It's killed an Airman already. He put his piece on the dresser and it discharged, striking him in the chest and killing him. He died right there in the barracks. permalink parent award report block reply view 4 more comments... JoeBidensDementia1 3 points 6 days ago Yes permalink parent award report block reply HIGH_ENERGY_MEMES 2 points 6 days ago You know it doesn't have to be 'or' permalink parent award report block reply dukeofdoorcounty 2 points 5 days ago I have an '80s P226.  Best shooting pistol ever. permalink parent award report block reply\nswift_water 8 points 6 days ago Didn't they recently get into some problems with them discharging? permalink parent award report block reply RedStoneDeepState 10 points 6 days ago That would be the P320 not the P226 permalink parent award report block reply view 5 more comments... OpusX 6 points 6 days ago Ya, they're in deep shit right now over unintended discharges with the P320, but the rest of their models are still solid. P226 has decades of proven performance in combat. permalink parent award report block reply view 3 more comments... NomadicKrow2 1 points 5 days ago \"Problems\" is an understatement. It's killed an Airman already. He put his piece on the dresser and it discharged, striking him in the chest and killing him. He died right there in the barracks. permalink parent award report block reply view 4 more comments...\nRedStoneDeepState 10 points 6 days ago That would be the P320 not the P226 permalink parent award report block reply view 5 more comments...\nOpusX 6 points 6 days ago Ya, they're in deep shit right now over unintended discharges with the P320, but the rest of their models are still solid. P226 has decades of proven performance in combat. permalink parent award report block reply view 3 more comments...\nNomadicKrow2 1 points 5 days ago \"Problems\" is an understatement. It's killed an Airman already. He put his piece on the dresser and it discharged, striking him in the chest and killing him. He died right there in the barracks. permalink parent award report block reply view 4 more comments...\nJoeBidensDementia1 3 points 6 days ago Yes permalink parent award report block reply\nHIGH_ENERGY_MEMES 2 points 6 days ago You know it doesn't have to be 'or' permalink parent award report block reply\ndukeofdoorcounty 2 points 5 days ago I have an '80s P226.  Best shooting pistol ever. permalink parent award report block reply\nsixfingerdildo 3 points 6 days ago cz. for the working man. permalink parent award report block reply ganachain 2 points 5 days ago Shadow 2 for the upper middle class permalink parent award report block reply\nganachain 2 points 5 days ago Shadow 2 for the upper middle class permalink parent award report block reply\nHantif 2 points 6 days ago I have a 229, the compact version of the 226. It's one of my EDC favorites (I cycle through a few depending on weather). permalink parent award report block reply JoeBidensDementia1 2 points 6 days ago What's EDC? Source: am retard permalink parent award report block reply bratt 4 points 6 days ago every day carry permalink parent award report block reply view 4 more comments... Hantif 3 points 6 days ago Every. Day . Carry permalink parent award report block reply\nJoeBidensDementia1 2 points 6 days ago What's EDC? Source: am retard permalink parent award report block reply bratt 4 points 6 days ago every day carry permalink parent award report block reply view 4 more comments... Hantif 3 points 6 days ago Every. Day . Carry permalink parent award report block reply\nbratt 4 points 6 days ago every day carry permalink parent award report block reply view 4 more comments...\nHantif 3 points 6 days ago Every. Day . Carry permalink parent award report block reply\nCharlieMike 1 points 6 days ago P229 for me. And a S&W Shield for backup. permalink parent award report block reply\nh3xAd3c1m4L 5 points 5 days ago It is a shame because that guy is at it again. Stalking more women in the north Dallas area. Following this story on X. It’s pretty nuts. permalink parent award report block reply GA_Logic 3 points 5 days ago That is wild. permalink parent award report block reply\nGA_Logic 3 points 5 days ago That is wild. permalink parent award report block reply\nNomadicKrow2 3 points 5 days ago A SIG will do the job, even if you can't. permalink parent award report block reply\nsixfingerdildo 1 points 6 days ago i don't know what happened, ossifer, the gun just went off! you know, i heard that guns can do that, is this that brand of gun? gosh, i should get rid of it now! permalink parent award report block reply\nScumbag-reddit 1 points 6 days ago In terms of full size handguns I'd choose glock any day because I l9ve how they shoot. In terms of a carry firearm like a compact or subcompact I would never...too bulky in my opinion. permalink parent award report block reply\n38WendysHamSquare79 28 points 6 days ago muslim men :/ permalink award report block reply freedom-thinker 23 points 6 days ago Every time, they all have NO PROBLEM with it whatsoever.  By raping women they are just trying to be like Mohamed which is the ideal man for muslim men, who they seek to emulate, raping an un-accompanied or non-muslim woman is gods work for them. They think they will be rewarded. Sick. permalink parent award report block reply justinkayz 5 points 6 days ago This is what musloids don't want you to know about their \"prophet\" https://www.brighteon.com/2a028dda-2850-4ffd-9c87-2bd94bf2bd58 permalink parent award report block reply Nezock_theKnight 4 points 5 days ago You are 100% right.  Truest statement I've see in a while.  Most muslim men (with the exception of mostly Americanized muslims, i.e. been here for decades or come from a civilized country such as Morocco, Algeria or UAE) think it's their right to rape you and take what they believe is theirs.  Its ingrained in them from birth by their religion.  They consider European and American women easy prey.  They would rape them in a second, with any opportunity, then walk away thinking nothing is wrong.  The same attitude is held by most of the illegal immigrants from the South.  Some of them are muslim, but the rest are told from a very young age: \"get what is yours. They (Americans) have your land and your happiness.  They don't deserve it.  Go to America, steal their goods, rape their women, shit over everything.\" permalink parent award report block reply johnqpublic864 3 points 6 days ago If only the Genophage were real. permalink parent award report block reply\nfreedom-thinker 23 points 6 days ago Every time, they all have NO PROBLEM with it whatsoever.  By raping women they are just trying to be like Mohamed which is the ideal man for muslim men, who they seek to emulate, raping an un-accompanied or non-muslim woman is gods work for them. They think they will be rewarded. Sick. permalink parent award report block reply justinkayz 5 points 6 days ago This is what musloids don't want you to know about their \"prophet\" https://www.brighteon.com/2a028dda-2850-4ffd-9c87-2bd94bf2bd58 permalink parent award report block reply Nezock_theKnight 4 points 5 days ago You are 100% right.  Truest statement I've see in a while.  Most muslim men (with the exception of mostly Americanized muslims, i.e. been here for decades or come from a civilized country such as Morocco, Algeria or UAE) think it's their right to rape you and take what they believe is theirs.  Its ingrained in them from birth by their religion.  They consider European and American women easy prey.  They would rape them in a second, with any opportunity, then walk away thinking nothing is wrong.  The same attitude is held by most of the illegal immigrants from the South.  Some of them are muslim, but the rest are told from a very young age: \"get what is yours. They (Americans) have your land and your happiness.  They don't deserve it.  Go to America, steal their goods, rape their women, shit over everything.\" permalink parent award report block reply johnqpublic864 3 points 6 days ago If only the Genophage were real. permalink parent award report block reply\njustinkayz 5 points 6 days ago This is what musloids don't want you to know about their \"prophet\" https://www.brighteon.com/2a028dda-2850-4ffd-9c87-2bd94bf2bd58 permalink parent award report block reply\nNezock_theKnight 4 points 5 days ago You are 100% right.  Truest statement I've see in a while.  Most muslim men (with the exception of mostly Americanized muslims, i.e. been here for decades or come from a civilized country such as Morocco, Algeria or UAE) think it's their right to rape you and take what they believe is theirs.  Its ingrained in them from birth by their religion.  They consider European and American women easy prey.  They would rape them in a second, with any opportunity, then walk away thinking nothing is wrong.  The same attitude is held by most of the illegal immigrants from the South.  Some of them are muslim, but the rest are told from a very young age: \"get what is yours. They (Americans) have your land and your happiness.  They don't deserve it.  Go to America, steal their goods, rape their women, shit over everything.\" permalink parent award report block reply\njohnqpublic864 3 points 6 days ago If only the Genophage were real. permalink parent award report block reply\nMAGALADON9 20 points 6 days ago I've used but not fired a gun three times to stop crimes.  Never reported any.  Happens millions of times permalink award report block reply magamagashii 16 points 6 days ago Almost got attempted carjacked, and not in a place you'd expect. I'd drawn and had the two dead to rights. They'd be at the firey gates before they knew what happened. But, back window was down and my dog stuck his head out the window and scared them off. Doggo got THREE big steaks for that. I'm not going through all that nonsense and risk if I don't need to. Called it in about an hour later when I felt guilty they'd probably find a victim and I highly suspected they were armed. permalink parent award report block reply MAGALADON9 8 points 6 days ago I keep a snubby revolver in a coat pocket specifically to shoot through the coat if I need the surprise.  But have a regular semi auto in a vertical roto holster. But I can't draw if they have their drawn already.  Good dog permalink parent award report block reply GA_Logic 2 points 5 days ago Good doogy is good. Your are blessed to have such a dog. permalink parent award report block reply\nmagamagashii 16 points 6 days ago Almost got attempted carjacked, and not in a place you'd expect. I'd drawn and had the two dead to rights. They'd be at the firey gates before they knew what happened. But, back window was down and my dog stuck his head out the window and scared them off. Doggo got THREE big steaks for that. I'm not going through all that nonsense and risk if I don't need to. Called it in about an hour later when I felt guilty they'd probably find a victim and I highly suspected they were armed. permalink parent award report block reply MAGALADON9 8 points 6 days ago I keep a snubby revolver in a coat pocket specifically to shoot through the coat if I need the surprise.  But have a regular semi auto in a vertical roto holster. But I can't draw if they have their drawn already.  Good dog permalink parent award report block reply GA_Logic 2 points 5 days ago Good doogy is good. Your are blessed to have such a dog. permalink parent award report block reply\nMAGALADON9 8 points 6 days ago I keep a snubby revolver in a coat pocket specifically to shoot through the coat if I need the surprise.  But have a regular semi auto in a vertical roto holster. But I can't draw if they have their drawn already.  Good dog permalink parent award report block reply\nGA_Logic 2 points 5 days ago Good doogy is good. Your are blessed to have such a dog. permalink parent award report block reply\nVoteThing 16 points 6 days ago When I was a kid going into gun stores with my dad in the 80s, there were lots of posters on the wall explaining that men had to fear women if they had a gun and knew how to use it. I guess feminists managed to bury all that. permalink award report block reply _Liberty_Prime_ OP 6 points 6 days ago I think the word \"feminist\" has more than one meaning. permalink parent award report block reply RedStoneDeepState 5 points 6 days ago It has multiple meanings. It started in Germany and moved west/east with different meanings. Soviet style feminism is basically... dont let your husband be a stereotypical Russian alcoholic who beats you. permalink parent award report block reply\n_Liberty_Prime_ OP 6 points 6 days ago I think the word \"feminist\" has more than one meaning. permalink parent award report block reply RedStoneDeepState 5 points 6 days ago It has multiple meanings. It started in Germany and moved west/east with different meanings. Soviet style feminism is basically... dont let your husband be a stereotypical Russian alcoholic who beats you. permalink parent award report block reply\nRedStoneDeepState 5 points 6 days ago It has multiple meanings. It started in Germany and moved west/east with different meanings. Soviet style feminism is basically... dont let your husband be a stereotypical Russian alcoholic who beats you. permalink parent award report block reply\ninvalid_data 15 points 6 days ago This Plano, TX. Guess who have flooded to Dallas literally taking over the whole north of the city. Indians and Muslims. Guess who invited them in, Gov. Abbott. permalink award report block reply\nTheJakeFroggy 10 points 6 days ago Guys like him deserve to be kicked in the nuts. I wonder how he'd feel if that happened to him. permalink award report block reply freedom-thinker 15 points 6 days ago They need to be 100% executed, but that's just me. permalink parent award report block reply TheJakeFroggy 6 points 6 days ago I don't disagree at all, but sometimes alternative means of karma can be amusing. Hardcore humiliation can be had every now and then. permalink parent award report block reply Aambrick 3 points 6 days ago Hardcore Humiliation is not getting kicked in the sack. Hardcore Humiliation is knocking the guy down, his head hitting the rail making him daze, and a dog walking buy sniffing him then marking its territory, and finally police show up dragging a marked territory from the premise by the feet so as not to touch the marked area. permalink parent award report block reply freedom-thinker 2 points 6 days ago True. Would like to see something happen to him, at least. permalink parent award report block reply\nfreedom-thinker 15 points 6 days ago They need to be 100% executed, but that's just me. permalink parent award report block reply TheJakeFroggy 6 points 6 days ago I don't disagree at all, but sometimes alternative means of karma can be amusing. Hardcore humiliation can be had every now and then. permalink parent award report block reply Aambrick 3 points 6 days ago Hardcore Humiliation is not getting kicked in the sack. Hardcore Humiliation is knocking the guy down, his head hitting the rail making him daze, and a dog walking buy sniffing him then marking its territory, and finally police show up dragging a marked territory from the premise by the feet so as not to touch the marked area. permalink parent award report block reply freedom-thinker 2 points 6 days ago True. Would like to see something happen to him, at least. permalink parent award report block reply\nTheJakeFroggy 6 points 6 days ago I don't disagree at all, but sometimes alternative means of karma can be amusing. Hardcore humiliation can be had every now and then. permalink parent award report block reply Aambrick 3 points 6 days ago Hardcore Humiliation is not getting kicked in the sack. Hardcore Humiliation is knocking the guy down, his head hitting the rail making him daze, and a dog walking buy sniffing him then marking its territory, and finally police show up dragging a marked territory from the premise by the feet so as not to touch the marked area. permalink parent award report block reply freedom-thinker 2 points 6 days ago True. Would like to see something happen to him, at least. permalink parent award report block reply\nAambrick 3 points 6 days ago Hardcore Humiliation is not getting kicked in the sack. Hardcore Humiliation is knocking the guy down, his head hitting the rail making him daze, and a dog walking buy sniffing him then marking its territory, and finally police show up dragging a marked territory from the premise by the feet so as not to touch the marked area. permalink parent award report block reply\nfreedom-thinker 2 points 6 days ago True. Would like to see something happen to him, at least. permalink parent award report block reply\nChoppermagic 9 points 6 days ago This will be New York everyday now permalink award report block reply Lelleck 8 points 5 days ago How? Guns are verboten in NYC. This video will end very differently in NYC. permalink parent award report block reply\nLelleck 8 points 5 days ago How? Guns are verboten in NYC. This video will end very differently in NYC. permalink parent award report block reply\nVikingHalo45 4 points 6 days ago That's my gurl. permalink award report block reply\nBuff_cousin_Elroy 4 points 6 days ago Ragheads are putrid subhuman trash permalink award report block reply Shih_Tabed 1 points 6 days ago Just 1 per day if you are in a large metro saturated with them and you would be doing your part.  Get in and get out.  You won't get caught. permalink parent award report block reply\nShih_Tabed 1 points 6 days ago Just 1 per day if you are in a large metro saturated with them and you would be doing your part.  Get in and get out.  You won't get caught. permalink parent award report block reply\njustinkayz 2 points 6 days ago Check out this middle eastern man... https://www.brighteon.com/2a028dda-2850-4ffd-9c87-2bd94bf2bd58 permalink award report block reply\nWeneverleft 1 points 5 days ago Europe,  ARE YOU TAKING NOTES. GET YOUR FUCKING GUNS BACK!!!! permalink award report block reply\nsuckmycorona 1 points 6 days ago Comment removed by community moderators. permalink award report block reply"}