{"id": "1ARK9oWeXL", "contents": "120 In my experience in tech, H1B immigrants were brought over to replace American workers. And, no, they did not train American workers and go back home. American workers were forced to train the H1B workers. If you refused to train the Indian who was taking your job, you would not get your severance p posted 2 hours ago by 2Scoops2Terms2Walls 14 comments award share report block RAMZPAUL @ramzpaul • 5h In my experience in tech, H1B immigrants were brought over to replace American workers. And, no, they did not train American workers and go back home. American workers were forced to train the H1B workers. If you refused to train the Indian who was taking your job, you would not\n14 comments Sort by Top Top New Worst Old Save SpeekFreely 5 points 2 hours ago This is part of the tarriff deals, the same thing is happening with shipbuilding. permalink award report block reply Moebius 5 points 1 hour ago When Disney did it years ago they specifically told their American employees they would not receive severance pay if the didn't train their replacements... permalink award report block reply comply863 3 points 1 hour ago Beat me to it...https://www.breitbart.com/politics/2015/09/07/exclusive-displaced-cast-member-how-disney-replaced-me-other-americans-with-cheap-foreigners-on-h1b-visas/ permalink parent award report block reply tomb1975 4 points 1 hour ago You are absolutely right.   In the IT industry a gigantic number of excellent American employees were laid off, with the requirement that they TRAIN their replacement H1B hires, or they did not get the layoff package.   The (mostly Indian) people were not capable of doing the job, much less training an American to do the job.   34 years with IBM, I saw this over and over. permalink award report block reply Wizard_Glick 3 points 1 hour ago Facts are such a messy thing... permalink award report block reply OpusX 3 points 43 minutes ago I've heard so many horror stories exactly like this from friends, family and acquaintances over the years. In every circumstance it was simply a cost-cutting measure by the company to get the same labor at a cheaper wage, nothing more. It's always been a scam. permalink award report block reply General_Specific 2 points 34 minutes ago Disney employees were the first of a major corp to come forward about this heart wrenching reality. Then Disney went full retard shortly after. permalink award report block reply TwoArizonaPedes 2 points 34 minutes ago Humiliating. permalink award report block reply SupFrens 2 points 22 minutes ago I live in an upper middle class neighborhood with million dollar homes, in the last 10 years we've been inundated with jeets to the point where they're like 80-90% of new home owners. Jeets are stealing the American Dream from right underneath us. permalink award report block reply bejeavis -1 points 19 minutes ago They aren't the ones stealing it if we're being fully honest. They are just the indentured servants / scab labor. They may profit somewhat from it but someone else holds the keys to this operation. permalink parent award report block reply SupFrens 1 points 15 minutes ago Yes, they are. They gleefully take our jobs and homes knowing full well they're displacing Americans. Do you even know any jeets? They fucking hate anybody who isn't jeet, especially whites. Wake the fuck up. permalink parent award report block reply bejeavis 0 points 14 minutes ago They aren't doing this on their own is my point. Wake up? Lol, trust me you want takes I got takes. permalink parent award report block reply Elencher 1 points 30 minutes ago I heard them say that jeets were training Americans and I laughed my balls off. Training is at what, how to scam 5 employers at the same time while doing no work? permalink award report block reply togtfo 1 points 25 minutes ago This does not include having to train your offshore replacement which happens as well.  My entire department participated in training their Southeast Asian replacements but was assured they were only training a sister company and wouldn't be replaced. (I thought it was hilarious that everyone was surprised when they were laid off.  I already had a better job lined up.) permalink award report block reply\nSpeekFreely 5 points 2 hours ago This is part of the tarriff deals, the same thing is happening with shipbuilding. permalink award report block reply\nMoebius 5 points 1 hour ago When Disney did it years ago they specifically told their American employees they would not receive severance pay if the didn't train their replacements... permalink award report block reply comply863 3 points 1 hour ago Beat me to it...https://www.breitbart.com/politics/2015/09/07/exclusive-displaced-cast-member-how-disney-replaced-me-other-americans-with-cheap-foreigners-on-h1b-visas/ permalink parent award report block reply\ncomply863 3 points 1 hour ago Beat me to it...https://www.breitbart.com/politics/2015/09/07/exclusive-displaced-cast-member-how-disney-replaced-me-other-americans-with-cheap-foreigners-on-h1b-visas/ permalink parent award report block reply\ntomb1975 4 points 1 hour ago You are absolutely right.   In the IT industry a gigantic number of excellent American employees were laid off, with the requirement that they TRAIN their replacement H1B hires, or they did not get the layoff package.   The (mostly Indian) people were not capable of doing the job, much less training an American to do the job.   34 years with IBM, I saw this over and over. permalink award report block reply\nWizard_Glick 3 points 1 hour ago Facts are such a messy thing... permalink award report block reply\nOpusX 3 points 43 minutes ago I've heard so many horror stories exactly like this from friends, family and acquaintances over the years. In every circumstance it was simply a cost-cutting measure by the company to get the same labor at a cheaper wage, nothing more. It's always been a scam. permalink award report block reply\nGeneral_Specific 2 points 34 minutes ago Disney employees were the first of a major corp to come forward about this heart wrenching reality. Then Disney went full retard shortly after. permalink award report block reply\nTwoArizonaPedes 2 points 34 minutes ago Humiliating. permalink award report block reply\nSupFrens 2 points 22 minutes ago I live in an upper middle class neighborhood with million dollar homes, in the last 10 years we've been inundated with jeets to the point where they're like 80-90% of new home owners. Jeets are stealing the American Dream from right underneath us. permalink award report block reply bejeavis -1 points 19 minutes ago They aren't the ones stealing it if we're being fully honest. They are just the indentured servants / scab labor. They may profit somewhat from it but someone else holds the keys to this operation. permalink parent award report block reply SupFrens 1 points 15 minutes ago Yes, they are. They gleefully take our jobs and homes knowing full well they're displacing Americans. Do you even know any jeets? They fucking hate anybody who isn't jeet, especially whites. Wake the fuck up. permalink parent award report block reply bejeavis 0 points 14 minutes ago They aren't doing this on their own is my point. Wake up? Lol, trust me you want takes I got takes. permalink parent award report block reply\nbejeavis -1 points 19 minutes ago They aren't the ones stealing it if we're being fully honest. They are just the indentured servants / scab labor. They may profit somewhat from it but someone else holds the keys to this operation. permalink parent award report block reply SupFrens 1 points 15 minutes ago Yes, they are. They gleefully take our jobs and homes knowing full well they're displacing Americans. Do you even know any jeets? They fucking hate anybody who isn't jeet, especially whites. Wake the fuck up. permalink parent award report block reply bejeavis 0 points 14 minutes ago They aren't doing this on their own is my point. Wake up? Lol, trust me you want takes I got takes. permalink parent award report block reply\nSupFrens 1 points 15 minutes ago Yes, they are. They gleefully take our jobs and homes knowing full well they're displacing Americans. Do you even know any jeets? They fucking hate anybody who isn't jeet, especially whites. Wake the fuck up. permalink parent award report block reply bejeavis 0 points 14 minutes ago They aren't doing this on their own is my point. Wake up? Lol, trust me you want takes I got takes. permalink parent award report block reply\nbejeavis 0 points 14 minutes ago They aren't doing this on their own is my point. Wake up? Lol, trust me you want takes I got takes. permalink parent award report block reply\nElencher 1 points 30 minutes ago I heard them say that jeets were training Americans and I laughed my balls off. Training is at what, how to scam 5 employers at the same time while doing no work? permalink award report block reply\ntogtfo 1 points 25 minutes ago This does not include having to train your offshore replacement which happens as well.  My entire department participated in training their Southeast Asian replacements but was assured they were only training a sister company and wouldn't be replaced. (I thought it was hilarious that everyone was surprised when they were laid off.  I already had a better job lined up.) permalink award report block reply"}