{"id": "1ARK9oWeKw", "contents": "61 Did CIA intentionally create Covid19?  Rand Paul releases emails showing CIA pitched a project “Coronavirus evolution and possible natural human adaptation” to virology Professor in September 2015. (www.zerohedge.com) posted 2 hours ago by Liberty49220 5 comments award share report block CIA Met With Ralph Baric In 2015 To Discuss \"Coronavirus Evolution And Possible Human Adaptation\": Emails ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero www.zerohedge.com\n5 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Skogin 3 points 2 hours ago Ralph Baric https://patriots.win/p/GIgpSAAG/people-need-to-know-about-this-g/c/ I posted that 5 years ago. permalink award report block reply Liberty49220 OP 1 points 2 hours ago Good work. There are plenty of smart, resourceful people on this site that get drowned out by retards/trash/bots, etc.  Wonder whether the mods could create a way for individuals to construct a \"white list\" of their preferred commentators. permalink parent award report block reply Skogin 1 points 51 minutes ago It’s up to us to filter. I’m used to surfing raw. permalink parent award report block reply overblod 1 points 2 hours ago Yes, however CIA is just one head of the snake who did it, you have to look at the entire snake, all its heads. permalink award report block reply TRUMPWON2020BYALOT 1 points 45 minutes ago Where's the emails it says he released? Edit: found it. Not a smoking gun permalink award report block reply\nSkogin 3 points 2 hours ago Ralph Baric https://patriots.win/p/GIgpSAAG/people-need-to-know-about-this-g/c/ I posted that 5 years ago. permalink award report block reply Liberty49220 OP 1 points 2 hours ago Good work. There are plenty of smart, resourceful people on this site that get drowned out by retards/trash/bots, etc.  Wonder whether the mods could create a way for individuals to construct a \"white list\" of their preferred commentators. permalink parent award report block reply Skogin 1 points 51 minutes ago It’s up to us to filter. I’m used to surfing raw. permalink parent award report block reply\nLiberty49220 OP 1 points 2 hours ago Good work. There are plenty of smart, resourceful people on this site that get drowned out by retards/trash/bots, etc.  Wonder whether the mods could create a way for individuals to construct a \"white list\" of their preferred commentators. permalink parent award report block reply Skogin 1 points 51 minutes ago It’s up to us to filter. I’m used to surfing raw. permalink parent award report block reply\nSkogin 1 points 51 minutes ago It’s up to us to filter. I’m used to surfing raw. permalink parent award report block reply\noverblod 1 points 2 hours ago Yes, however CIA is just one head of the snake who did it, you have to look at the entire snake, all its heads. permalink award report block reply\nTRUMPWON2020BYALOT 1 points 45 minutes ago Where's the emails it says he released? Edit: found it. Not a smoking gun permalink award report block reply"}