{"id": "1ARK9oW66g", "contents": "35 R U L E S - F O R - R A D I C A L S - - - - MAGA don't let yourself get beat up by this trick. \n\nRemember no machine will run if too tight, likewise no movement can survive if they are too strict with themselves. posted 3 hours ago by frenacrossthepond 4 comments award share download report block\n4 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style current_horror 1 points 1 hour ago Nope. Fuck the kosher right and their jeet invaders. permalink award report block reply Mhmm2MoreWeeks 1 points 1 hour ago Nope. The Jews are not going anywhere. They will continue to exist in the upper echelons no matter whom is in charge. Not because they are Jews. Because they are smarter. Much smarter. Consistently. permalink parent award report block reply frenacrossthepond OP 1 points 37 minutes ago let's just say the are very good at networking...just like the lebanese, the indians, the chinese etc... The issue is that the majority population doesn't network...unless you want to join some freaky freemasons or other cult. In the west we tend to be independent thinkers and selling your free will to \"network\" better seems like a bad deal. Other minority pop cultures are just born into it...so they just keep business within the clan no problem. permalink parent award report block reply Mhmm2MoreWeeks 1 points 1 hour ago MAGA will not survive Jew Haters. That is the obvious way to bring MAGA down. If I wanted to harm MAGA I would hire people to go on social media posting Jew Hate as MAGA Patriots. That would be the obvious method. So many of you are far dumber then you realize. Rarely do people of lower IQ recognize great intellects because most low IQ people are also intellectually lazy as a survival imperative. permalink award report block reply\ncurrent_horror 1 points 1 hour ago Nope. Fuck the kosher right and their jeet invaders. permalink award report block reply Mhmm2MoreWeeks 1 points 1 hour ago Nope. The Jews are not going anywhere. They will continue to exist in the upper echelons no matter whom is in charge. Not because they are Jews. Because they are smarter. Much smarter. Consistently. permalink parent award report block reply frenacrossthepond OP 1 points 37 minutes ago let's just say the are very good at networking...just like the lebanese, the indians, the chinese etc... The issue is that the majority population doesn't network...unless you want to join some freaky freemasons or other cult. In the west we tend to be independent thinkers and selling your free will to \"network\" better seems like a bad deal. Other minority pop cultures are just born into it...so they just keep business within the clan no problem. permalink parent award report block reply\nMhmm2MoreWeeks 1 points 1 hour ago Nope. The Jews are not going anywhere. They will continue to exist in the upper echelons no matter whom is in charge. Not because they are Jews. Because they are smarter. Much smarter. Consistently. permalink parent award report block reply frenacrossthepond OP 1 points 37 minutes ago let's just say the are very good at networking...just like the lebanese, the indians, the chinese etc... The issue is that the majority population doesn't network...unless you want to join some freaky freemasons or other cult. In the west we tend to be independent thinkers and selling your free will to \"network\" better seems like a bad deal. Other minority pop cultures are just born into it...so they just keep business within the clan no problem. permalink parent award report block reply\nfrenacrossthepond OP 1 points 37 minutes ago let's just say the are very good at networking...just like the lebanese, the indians, the chinese etc... The issue is that the majority population doesn't network...unless you want to join some freaky freemasons or other cult. In the west we tend to be independent thinkers and selling your free will to \"network\" better seems like a bad deal. Other minority pop cultures are just born into it...so they just keep business within the clan no problem. permalink parent award report block reply\nMhmm2MoreWeeks 1 points 1 hour ago MAGA will not survive Jew Haters. That is the obvious way to bring MAGA down. If I wanted to harm MAGA I would hire people to go on social media posting Jew Hate as MAGA Patriots. That would be the obvious method. So many of you are far dumber then you realize. Rarely do people of lower IQ recognize great intellects because most low IQ people are also intellectually lazy as a survival imperative. permalink award report block reply"}