{"id": "1ARK9pgyOr", "contents": "14 H1-B When Trump said \"certain talents\" he was referring to Levels 3 and 4. posted 18 minutes ago by CyanScales 2 comments award share report block Andrew Branca Show @TheBrancaShow • 22m All this table tells me is that 85% of H1B visas should be incinerated. That would be a good start--let's do that IMMEDIATELY. Bill Mitchell @mitchellvii • 2h 🚨🚨 BREAKING NEWS - There are FOUR LEVELS for H1-B tech hires.  When Trump said \"certain talents\" he was referring to Levels 3 and 4. These jobs have ZERO wage disparity with Americans.  As a matter off fact, Level 4's make MORE than Americans! The wage disparity (and abuse)\n2 comments Sort by Top Top New Worst Old Save wharfthrowaway 6 points 15 minutes ago Americans would make more if the H1Bs weren't displacing the higher end as well. Bill Bitchell is a retard. permalink award report block reply crashdaddy 5 points 14 minutes ago Me: \"Wow, how did you qualify for Level 4!\" Pajeet Patel: \"idk, man, I was just minding my own business eating poo from a cow's butt one day and some guy came by and handed me a visa. Now I don't have to wait for tourists to visit when I want to rape a foreigner, because they're everywhere here!\" permalink award report block reply sleepinggiant 1 points 12 minutes ago Sounds like damage control. Trump could try shutting the fuck up on the subject, if doesnt intend to do anything about it. permalink award report block reply\nwharfthrowaway 6 points 15 minutes ago Americans would make more if the H1Bs weren't displacing the higher end as well. Bill Bitchell is a retard. permalink award report block reply\ncrashdaddy 5 points 14 minutes ago Me: \"Wow, how did you qualify for Level 4!\" Pajeet Patel: \"idk, man, I was just minding my own business eating poo from a cow's butt one day and some guy came by and handed me a visa. Now I don't have to wait for tourists to visit when I want to rape a foreigner, because they're everywhere here!\" permalink award report block reply\nsleepinggiant 1 points 12 minutes ago Sounds like damage control. Trump could try shutting the fuck up on the subject, if doesnt intend to do anything about it. permalink award report block reply"}