{"id": "1ARK9pg93K", "contents": "96 Who and where do H1B scammers come from posted 4 hours ago by FuckAllDemocrats 3 comments award share report block Andrew Kolvet @AndrewKolvet • 17h Did you know: 70% of H-1B visa holders come from INDIA 10-15% come from China 80% of H-1B approvals are for entry level and junior-level jobs Combine ALL of that with AI and robotics, which will wipe out even more entry level jobs, and H-1Bs become even harder to defend.\n3 comments Sort by Top Top New Worst Old Save Realassman 2 points 1 hour ago They don’t need H1bs. They have 600 k students to do the job. permalink award report block reply rapskull 1 points 4 hours ago Asked Grok if DHS continued working during shutdown. Grok: Yes, the Department of Homeland Security (DHS), through U.S. Citizenship and Immigration Services (USCIS), continued processing H-1B1 petitions during the 2025 U.S. government shutdown. The shutdown lasted from October 1 to November 12, 2025, permalink award report block reply ThisTrainHasNoBrakes 1 points 2 hours ago I am THOROUGHLY against H1Bs.  It’s anti-American shit. One “Devil’s advocate” thing I’ll say though:  I’m also in AI automation and the post is accurate:  so many entry level jobs will be gone. So the thought I have is…it’s going to be these H1Bs that are gone then.  I don’t agree with the policies, but I also have to ask if it serves someone to get into a truck driving career now.  I tell young people repeatedly not to be in these professions.  These jobs literally will not exist soon. So I’m just saying it’s a silver lining that people are being steered away from these jobs now.  Not a cope, tired of hearing SAAAAR as much as the next guy. But we have a massive job loss that is coming. permalink award report block reply\nRealassman 2 points 1 hour ago They don’t need H1bs. They have 600 k students to do the job. permalink award report block reply\nrapskull 1 points 4 hours ago Asked Grok if DHS continued working during shutdown. Grok: Yes, the Department of Homeland Security (DHS), through U.S. Citizenship and Immigration Services (USCIS), continued processing H-1B1 petitions during the 2025 U.S. government shutdown. The shutdown lasted from October 1 to November 12, 2025, permalink award report block reply\nThisTrainHasNoBrakes 1 points 2 hours ago I am THOROUGHLY against H1Bs.  It’s anti-American shit. One “Devil’s advocate” thing I’ll say though:  I’m also in AI automation and the post is accurate:  so many entry level jobs will be gone. So the thought I have is…it’s going to be these H1Bs that are gone then.  I don’t agree with the policies, but I also have to ask if it serves someone to get into a truck driving career now.  I tell young people repeatedly not to be in these professions.  These jobs literally will not exist soon. So I’m just saying it’s a silver lining that people are being steered away from these jobs now.  Not a cope, tired of hearing SAAAAR as much as the next guy. But we have a massive job loss that is coming. permalink award report block reply"}