{"id": "1ARK5BGJr2", "contents": "527 The reason we are a free country is because we are a Christian nation! posted 3 days ago by Capoditutticapi1 22 comments award share report block Insurrection Barbie @DefiyantlyFree • 3d This is probably one of the best clips from Charlie Kirk, and I say that knowing that it’s very hard to choose when almost every one of his clips was so important. We don’t have anybody right now that is capable of reaching young people like he did and that’s because he was never\n22 comments Sort by Top Top New Worst Old Save Crappydatum 17 points 3 days ago Love rewatching this permalink award report block reply Capoditutticapi1 OP 11 points 3 days ago Always learning! Charlie is still teaching us... permalink parent award report block reply patrioticwinning3 0 points 3 days ago Ironic she posted this because Mossad Barbie is a mossad cunt... permalink parent award report block reply LaptopDied 9 points 3 days ago He is right. Have babies. Go forth and multiply. Your sense of purposeful, orderly time is from Sabbath observance, the Fourth Commandent. The week is not naturally occurring, unlike the month and year. Yes to the Ten Commandments on every institutional wall. You are people of the Bible. You don't know your own names without it. Half your names are from it. permalink award report block reply HeavyMetalPatriot 7 points 3 days ago Make America Christian Again! permalink award report block reply concealedaces 6 points 3 days ago Except he had the structure of hierarchy all wrong.\nHe said God, children, wife, husband.\nBut the bible explicitly states that it is God, husband, wife, children. He always talked about how men need to be in a biblical sense, which is good, but he never talked about how women should be. Men and women are not equal and a woman should never be over a man. God did not design us that way and the bible tells us that it is an errant structure permalink award report block reply Capoditutticapi1 OP 4 points 3 days ago You Sir, are correct! permalink parent award report block reply God-is-good 2 points 2 days ago What you claim Charlie says isn’t in this video at all. Do you have a source? I wonder how Charlie would respond to this comment. Scripture tells the man to sacrifice for his family and wife as if they were own body. The mans priorities are to God, his children, his wife and then himself. Hierarchy is a separate concept and would order things differently. What Charlie meant would depend on what context Charlie made such a statement. If he even did. permalink parent award report block reply Magagal24 3 points 3 days ago Did anyone catch erika kirk in the jesse waters interview say that Charlie practiced the Sabbath and would shut off his electronics on Saturday? What was that? permalink award report block reply Capoditutticapi1 OP 14 points 3 days ago In a June 2025 video clip shared widely on X, Charlie and Erika jointly explained their routine: turning off phones Friday night, focusing on rest, Bible reading, prayer, walks, and family time. Charlie said it \"quieted our minds, cut out the noise of life, and aligned us with God's spirit,\" calling it transformative for his well-being amid his high-pressure career. permalink parent award report block reply HeavyMetalPatriot 10 points 3 days ago That's VERY smart and great for the family. permalink parent award report block reply MedicallyReddit 4 points 3 days ago Based af permalink parent award report block reply Crappydatum 4 points 3 days ago Because of schedules, he was often on airplanes on Sundays, so Saturdays were guaranteed family days and Sundays if he could make it work permalink parent award report block reply TheTelltaleFly 1 points 3 days ago He talked about it all the time. You sh it of listen to more of his old shows and clips. permalink parent award report block reply AgnesDomini 3 points 3 days ago Our Founding Fathers drew up our laws mostly from a small number of sources---John Locke’s works, and the Holy Bible. permalink award report block reply RizzlieDoodad 1 points 2 days ago Freedom of religion was the freedom to choose which denomination of Christianity. Each state had its own denomination of Christianity. Most were Protestant, Maryland was Catholic. In America we are Christ first and America first. permalink award report block reply Mhmm2MoreWeeks -12 points 3 days ago This is not explicitly accurate. This is some revisionist BS. WOKE RIGHT is becoming more real and like the WOKE LEFT every day. Do Muslims run this place? permalink award report block reply Dangerous 6 points 3 days ago Retard permalink parent award report block reply Crappydatum 5 points 3 days ago Ok Saul permalink parent award report block reply wmmiv2016v2 1 points 3 days ago You smell like a NAtional ZIonist permalink parent award report block reply Redpilled2Depression 2 points 3 days ago That’s even more retarded than the original guy’s comment permalink parent award report block reply God-is-good 1 points 2 days ago Present the counter reality you claim exists then. permalink parent award report block reply\nCrappydatum 17 points 3 days ago Love rewatching this permalink award report block reply Capoditutticapi1 OP 11 points 3 days ago Always learning! Charlie is still teaching us... permalink parent award report block reply patrioticwinning3 0 points 3 days ago Ironic she posted this because Mossad Barbie is a mossad cunt... permalink parent award report block reply\nCapoditutticapi1 OP 11 points 3 days ago Always learning! Charlie is still teaching us... permalink parent award report block reply\npatrioticwinning3 0 points 3 days ago Ironic she posted this because Mossad Barbie is a mossad cunt... permalink parent award report block reply\nLaptopDied 9 points 3 days ago He is right. Have babies. Go forth and multiply. Your sense of purposeful, orderly time is from Sabbath observance, the Fourth Commandent. The week is not naturally occurring, unlike the month and year. Yes to the Ten Commandments on every institutional wall. You are people of the Bible. You don't know your own names without it. Half your names are from it. permalink award report block reply\nHeavyMetalPatriot 7 points 3 days ago Make America Christian Again! permalink award report block reply\nconcealedaces 6 points 3 days ago Except he had the structure of hierarchy all wrong.\nHe said God, children, wife, husband.\nBut the bible explicitly states that it is God, husband, wife, children. He always talked about how men need to be in a biblical sense, which is good, but he never talked about how women should be. Men and women are not equal and a woman should never be over a man. God did not design us that way and the bible tells us that it is an errant structure permalink award report block reply Capoditutticapi1 OP 4 points 3 days ago You Sir, are correct! permalink parent award report block reply God-is-good 2 points 2 days ago What you claim Charlie says isn’t in this video at all. Do you have a source? I wonder how Charlie would respond to this comment. Scripture tells the man to sacrifice for his family and wife as if they were own body. The mans priorities are to God, his children, his wife and then himself. Hierarchy is a separate concept and would order things differently. What Charlie meant would depend on what context Charlie made such a statement. If he even did. permalink parent award report block reply\nCapoditutticapi1 OP 4 points 3 days ago You Sir, are correct! permalink parent award report block reply\nGod-is-good 2 points 2 days ago What you claim Charlie says isn’t in this video at all. Do you have a source? I wonder how Charlie would respond to this comment. Scripture tells the man to sacrifice for his family and wife as if they were own body. The mans priorities are to God, his children, his wife and then himself. Hierarchy is a separate concept and would order things differently. What Charlie meant would depend on what context Charlie made such a statement. If he even did. permalink parent award report block reply\nMagagal24 3 points 3 days ago Did anyone catch erika kirk in the jesse waters interview say that Charlie practiced the Sabbath and would shut off his electronics on Saturday? What was that? permalink award report block reply Capoditutticapi1 OP 14 points 3 days ago In a June 2025 video clip shared widely on X, Charlie and Erika jointly explained their routine: turning off phones Friday night, focusing on rest, Bible reading, prayer, walks, and family time. Charlie said it \"quieted our minds, cut out the noise of life, and aligned us with God's spirit,\" calling it transformative for his well-being amid his high-pressure career. permalink parent award report block reply HeavyMetalPatriot 10 points 3 days ago That's VERY smart and great for the family. permalink parent award report block reply MedicallyReddit 4 points 3 days ago Based af permalink parent award report block reply Crappydatum 4 points 3 days ago Because of schedules, he was often on airplanes on Sundays, so Saturdays were guaranteed family days and Sundays if he could make it work permalink parent award report block reply TheTelltaleFly 1 points 3 days ago He talked about it all the time. You sh it of listen to more of his old shows and clips. permalink parent award report block reply\nCapoditutticapi1 OP 14 points 3 days ago In a June 2025 video clip shared widely on X, Charlie and Erika jointly explained their routine: turning off phones Friday night, focusing on rest, Bible reading, prayer, walks, and family time. Charlie said it \"quieted our minds, cut out the noise of life, and aligned us with God's spirit,\" calling it transformative for his well-being amid his high-pressure career. permalink parent award report block reply HeavyMetalPatriot 10 points 3 days ago That's VERY smart and great for the family. permalink parent award report block reply MedicallyReddit 4 points 3 days ago Based af permalink parent award report block reply\nHeavyMetalPatriot 10 points 3 days ago That's VERY smart and great for the family. permalink parent award report block reply\nMedicallyReddit 4 points 3 days ago Based af permalink parent award report block reply\nCrappydatum 4 points 3 days ago Because of schedules, he was often on airplanes on Sundays, so Saturdays were guaranteed family days and Sundays if he could make it work permalink parent award report block reply\nTheTelltaleFly 1 points 3 days ago He talked about it all the time. You sh it of listen to more of his old shows and clips. permalink parent award report block reply\nAgnesDomini 3 points 3 days ago Our Founding Fathers drew up our laws mostly from a small number of sources---John Locke’s works, and the Holy Bible. permalink award report block reply\nRizzlieDoodad 1 points 2 days ago Freedom of religion was the freedom to choose which denomination of Christianity. Each state had its own denomination of Christianity. Most were Protestant, Maryland was Catholic. In America we are Christ first and America first. permalink award report block reply\nMhmm2MoreWeeks -12 points 3 days ago This is not explicitly accurate. This is some revisionist BS. WOKE RIGHT is becoming more real and like the WOKE LEFT every day. Do Muslims run this place? permalink award report block reply Dangerous 6 points 3 days ago Retard permalink parent award report block reply Crappydatum 5 points 3 days ago Ok Saul permalink parent award report block reply wmmiv2016v2 1 points 3 days ago You smell like a NAtional ZIonist permalink parent award report block reply Redpilled2Depression 2 points 3 days ago That’s even more retarded than the original guy’s comment permalink parent award report block reply God-is-good 1 points 2 days ago Present the counter reality you claim exists then. permalink parent award report block reply\nDangerous 6 points 3 days ago Retard permalink parent award report block reply\nCrappydatum 5 points 3 days ago Ok Saul permalink parent award report block reply\nwmmiv2016v2 1 points 3 days ago You smell like a NAtional ZIonist permalink parent award report block reply Redpilled2Depression 2 points 3 days ago That’s even more retarded than the original guy’s comment permalink parent award report block reply\nRedpilled2Depression 2 points 3 days ago That’s even more retarded than the original guy’s comment permalink parent award report block reply\nGod-is-good 1 points 2 days ago Present the counter reality you claim exists then. permalink parent award report block reply"}