{"id": "1ARK5BHPqm", "contents": "315 BREAKING: Senate Dems are reportedly “raging” at each other after news of a deal which could open the government:\n\n“There’s a lot of division there. There are some Democrats who are going to support this test vote. The others are going to rage at them.” posted 3 days ago by basedboston 7 comments award share report block Andrew Kolvet @AndrewKolvet • 3d 🚨BREAKING: Senate Dems are reportedly “raging” at each other after news of a deal which could open the government: “There’s a lot of division there. There are some Democrats who are going to support this test vote. The others are going to rage at them.”\n7 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style MuslimsWorshipSatan 10 points 3 days ago A question more people need to ask themselves is why we continue to tolerate the existence of a political party and group of people whose entire worldview is to be an enemy of the these United States. \"Because we just don't get rid of people like that here, we talk things out\" is becoming less and less of a convincing answer every day. permalink award report block reply One-Man_Riot 7 points 3 days ago Peaceful solutions are becoming less and less viable. permalink parent award report block reply MuslimsWorshipSatan 5 points 3 days ago I'm at the point where I consider them completely unviable and have zero interest in even trying. I'm just waiting for enough other people to get on the same page so something happens. I don't care about tweets, I don't care about voting, I don't care about the news cycle, I don't care about rallies or parades. I don't really care about anything beyond let me know when it's time for rifles. permalink parent award report block reply josiborg 1 points 3 days ago There comes a time when reasonable men must do unreasonable things permalink parent award report block reply TrumpIsMyyPresident 2 points 3 days ago The vote is currently 56 Yea to 40 Nay, which is the highest vote I'm aware of. Therefore, the votes are there to reopen. permalink award report block reply Counterwhat 2 points 3 days ago We lost all those races for nothing. Those judgeships, state seats, control of state houses and for what? We should have done what President Trump asked. Kill the filibuster, open the government ourselves and pass the whole MAGA agenda. Not this compromise that you know will lead to worst things for America. We should have given all these MSM talking chouderheads what they really wanted. We should given them their holy cow talking point we should given them their \"Democracy\". 51 votes of utter screeching\n, reeeeeing, head exploding Democracy shoved down their throats with all the MAGA parts as a wet chaser. permalink parent award report block reply clownworld30330 1 points 2 days ago raging theater 🙄 permalink award report block reply\nMuslimsWorshipSatan 10 points 3 days ago A question more people need to ask themselves is why we continue to tolerate the existence of a political party and group of people whose entire worldview is to be an enemy of the these United States. \"Because we just don't get rid of people like that here, we talk things out\" is becoming less and less of a convincing answer every day. permalink award report block reply One-Man_Riot 7 points 3 days ago Peaceful solutions are becoming less and less viable. permalink parent award report block reply MuslimsWorshipSatan 5 points 3 days ago I'm at the point where I consider them completely unviable and have zero interest in even trying. I'm just waiting for enough other people to get on the same page so something happens. I don't care about tweets, I don't care about voting, I don't care about the news cycle, I don't care about rallies or parades. I don't really care about anything beyond let me know when it's time for rifles. permalink parent award report block reply josiborg 1 points 3 days ago There comes a time when reasonable men must do unreasonable things permalink parent award report block reply\nOne-Man_Riot 7 points 3 days ago Peaceful solutions are becoming less and less viable. permalink parent award report block reply MuslimsWorshipSatan 5 points 3 days ago I'm at the point where I consider them completely unviable and have zero interest in even trying. I'm just waiting for enough other people to get on the same page so something happens. I don't care about tweets, I don't care about voting, I don't care about the news cycle, I don't care about rallies or parades. I don't really care about anything beyond let me know when it's time for rifles. permalink parent award report block reply\nMuslimsWorshipSatan 5 points 3 days ago I'm at the point where I consider them completely unviable and have zero interest in even trying. I'm just waiting for enough other people to get on the same page so something happens. I don't care about tweets, I don't care about voting, I don't care about the news cycle, I don't care about rallies or parades. I don't really care about anything beyond let me know when it's time for rifles. permalink parent award report block reply\njosiborg 1 points 3 days ago There comes a time when reasonable men must do unreasonable things permalink parent award report block reply\nTrumpIsMyyPresident 2 points 3 days ago The vote is currently 56 Yea to 40 Nay, which is the highest vote I'm aware of. Therefore, the votes are there to reopen. permalink award report block reply Counterwhat 2 points 3 days ago We lost all those races for nothing. Those judgeships, state seats, control of state houses and for what? We should have done what President Trump asked. Kill the filibuster, open the government ourselves and pass the whole MAGA agenda. Not this compromise that you know will lead to worst things for America. We should have given all these MSM talking chouderheads what they really wanted. We should given them their holy cow talking point we should given them their \"Democracy\". 51 votes of utter screeching\n, reeeeeing, head exploding Democracy shoved down their throats with all the MAGA parts as a wet chaser. permalink parent award report block reply\nCounterwhat 2 points 3 days ago We lost all those races for nothing. Those judgeships, state seats, control of state houses and for what? We should have done what President Trump asked. Kill the filibuster, open the government ourselves and pass the whole MAGA agenda. Not this compromise that you know will lead to worst things for America. We should have given all these MSM talking chouderheads what they really wanted. We should given them their holy cow talking point we should given them their \"Democracy\". 51 votes of utter screeching\n, reeeeeing, head exploding Democracy shoved down their throats with all the MAGA parts as a wet chaser. permalink parent award report block reply\nclownworld30330 1 points 2 days ago raging theater 🙄 permalink award report block reply"}