{"id": "1ARK0Ub4j5", "contents": "831 My parents were married for 71 years before my mom died.  But this couple has them beat by 12 years.  Yup.  They have been married for 83 years.  She's 107.  And he's 108.  Congratulations 🎊 👏 💐 🥳 Mr. & Mrs. Gittens. posted 7 days ago by Landslide_2020 34 comments award share download report block\n34 comments Sort by Top Top New Worst Old Save YaharaRiver 40 points 7 days ago She was 24, he was 25. Very respectable and Godly. permalink award report block reply PaintmanFromChicago 20 points 7 days ago Thank you for doing the math. permalink parent award report block reply MAGASquatch 8 points 7 days ago 83 years ago was smack dab in the height of WWII.  He probably enlisted or was drafted at 18. They probably married after he returned from the war. permalink parent award report block reply ADAM_SCHITT 7 points 7 days ago 83 years ago was 1942. He probably got married before going off to war. permalink parent award report block reply MAGASquatch 2 points 7 days ago Makes sense. permalink parent award report block reply Kilroy 4 points 7 days ago I look at their eyes and I like them. permalink parent award report block reply Trumpican -2 points 7 days ago Back then it should have been younger permalink parent award report block reply YaharaRiver 2 points 7 days ago Mid-20’s has been the age of seeking and finding your mate for CENTURIES in civilized countries. Only carnal, materialistic, backward countries think that marriage should be hasty and hurried. permalink parent award report block reply spinometer2 3 points 7 days ago my mom was 18 when she married my dad, 24 permalink parent award report block reply Trumpican 1 points 7 days ago I wouldn’t call getting married at 19 and 17 back in the 30s and 40s anything like that. permalink parent award report block reply DeploraBen 32 points 7 days ago Good lord.  When your daughter is old enough to be a great great grandmother without it being weird, you've put in a good run. permalink award report block reply TwoArizonaPedes 21 points 7 days ago Wow! That's impressive. permalink award report block reply starbound1332 13 points 7 days ago Real relationship goals! permalink award report block reply ReleasetheList 12 points 7 days ago Congrats for a very rare feat. permalink award report block reply NotYourMan 11 points 7 days ago They lived a good life by just living this long together.  Modern feminists hate this and want to destroy it because they \"don't need a man\" or they are \"empowered\" to do it themselves.  The feminist cult is loyal to the democrat party first and foremost. permalink award report block reply Landslide_2020 OP 11 points 7 days ago https://nypost.com/2025/11/05/world-news/lovebirds-crowned-worlds-oldest-married-couple-share-longevity-tips/ permalink award report block reply ManBadOrange 9 points 7 days ago Wow , I knew a couple who hit 76 years before the wife passed , but this has them beat by 6 or 7 years. Impressive. permalink award report block reply FusionBlack 8 points 7 days ago The things they saw in life. Congratulations. permalink award report block reply MAGADeluxe 6 points 7 days ago Poor guy, hasn't had peace and quiet for over 80 years! permalink award report block reply Right0hio 5 points 7 days ago I want to be so old that you can no longer tell which is which! permalink award report block reply QSWO1 4 points 7 days ago Very cool. Dead hearing aid batteries contributed. I kid. What? permalink award report block reply uxername27 -1 points 7 days ago Chirp! permalink parent award report block reply Nomad899 5 points 7 days ago They get a pass, probably cannot hear it and unsafe to climb the ladder permalink parent award report block reply Kilroy 4 points 7 days ago I've never been to a 70 year anniversary, let alone an 80th. Well done. permalink award report block reply spinometer2 3 points 7 days ago what an inspiration permalink award report block reply KarenLukasik 2 points 7 days ago Lovely story if most of those years were good and happy… permalink award report block reply Cacciali_Via 2 points 7 days ago Imagine how much government resources they have used compared to how much they have contributed. It must be a staggering difference. permalink award report block reply Pelosi_Halitosis 2 points 6 days ago That's a long time. It's funny, we're working on 32 years of marriage. I'd have to figure out exactly when it occurred, but I realized some time ago that I've been married more than half my life. permalink award report block reply Nomad899 2 points 7 days ago That is AWESOME 👏 👏 👏 permalink award report block reply MSG1000 2 points 7 days ago Beautiful. permalink award report block reply SurveilThis 2 points 6 days ago The guy’s in a hospital bed recovering from knee replacement surgery. permalink award report block reply Landslide_2020 OP 1 points 6 days ago Amazing 👏 🤩. permalink parent award report block reply Liberats 1 points 7 days ago How have they lived so long in a country where they are hunted and descriminated so effectively........ 108? I will be happy if I make 85. permalink award report block reply JustInTime2_ 1 points 7 days ago Beautiful permalink award report block reply NeverInterruptEnemy -8 points 7 days ago tf is this shit All I see here are retards that don’t know that they’re lying about their ages. permalink award report block reply\nYaharaRiver 40 points 7 days ago She was 24, he was 25. Very respectable and Godly. permalink award report block reply PaintmanFromChicago 20 points 7 days ago Thank you for doing the math. permalink parent award report block reply MAGASquatch 8 points 7 days ago 83 years ago was smack dab in the height of WWII.  He probably enlisted or was drafted at 18. They probably married after he returned from the war. permalink parent award report block reply ADAM_SCHITT 7 points 7 days ago 83 years ago was 1942. He probably got married before going off to war. permalink parent award report block reply MAGASquatch 2 points 7 days ago Makes sense. permalink parent award report block reply Kilroy 4 points 7 days ago I look at their eyes and I like them. permalink parent award report block reply Trumpican -2 points 7 days ago Back then it should have been younger permalink parent award report block reply YaharaRiver 2 points 7 days ago Mid-20’s has been the age of seeking and finding your mate for CENTURIES in civilized countries. Only carnal, materialistic, backward countries think that marriage should be hasty and hurried. permalink parent award report block reply spinometer2 3 points 7 days ago my mom was 18 when she married my dad, 24 permalink parent award report block reply Trumpican 1 points 7 days ago I wouldn’t call getting married at 19 and 17 back in the 30s and 40s anything like that. permalink parent award report block reply\nPaintmanFromChicago 20 points 7 days ago Thank you for doing the math. permalink parent award report block reply\nMAGASquatch 8 points 7 days ago 83 years ago was smack dab in the height of WWII.  He probably enlisted or was drafted at 18. They probably married after he returned from the war. permalink parent award report block reply ADAM_SCHITT 7 points 7 days ago 83 years ago was 1942. He probably got married before going off to war. permalink parent award report block reply MAGASquatch 2 points 7 days ago Makes sense. permalink parent award report block reply\nADAM_SCHITT 7 points 7 days ago 83 years ago was 1942. He probably got married before going off to war. permalink parent award report block reply MAGASquatch 2 points 7 days ago Makes sense. permalink parent award report block reply\nMAGASquatch 2 points 7 days ago Makes sense. permalink parent award report block reply\nKilroy 4 points 7 days ago I look at their eyes and I like them. permalink parent award report block reply\nTrumpican -2 points 7 days ago Back then it should have been younger permalink parent award report block reply YaharaRiver 2 points 7 days ago Mid-20’s has been the age of seeking and finding your mate for CENTURIES in civilized countries. Only carnal, materialistic, backward countries think that marriage should be hasty and hurried. permalink parent award report block reply spinometer2 3 points 7 days ago my mom was 18 when she married my dad, 24 permalink parent award report block reply Trumpican 1 points 7 days ago I wouldn’t call getting married at 19 and 17 back in the 30s and 40s anything like that. permalink parent award report block reply\nYaharaRiver 2 points 7 days ago Mid-20’s has been the age of seeking and finding your mate for CENTURIES in civilized countries. Only carnal, materialistic, backward countries think that marriage should be hasty and hurried. permalink parent award report block reply spinometer2 3 points 7 days ago my mom was 18 when she married my dad, 24 permalink parent award report block reply Trumpican 1 points 7 days ago I wouldn’t call getting married at 19 and 17 back in the 30s and 40s anything like that. permalink parent award report block reply\nspinometer2 3 points 7 days ago my mom was 18 when she married my dad, 24 permalink parent award report block reply\nTrumpican 1 points 7 days ago I wouldn’t call getting married at 19 and 17 back in the 30s and 40s anything like that. permalink parent award report block reply\nDeploraBen 32 points 7 days ago Good lord.  When your daughter is old enough to be a great great grandmother without it being weird, you've put in a good run. permalink award report block reply\nTwoArizonaPedes 21 points 7 days ago Wow! That's impressive. permalink award report block reply\nstarbound1332 13 points 7 days ago Real relationship goals! permalink award report block reply\nReleasetheList 12 points 7 days ago Congrats for a very rare feat. permalink award report block reply\nNotYourMan 11 points 7 days ago They lived a good life by just living this long together.  Modern feminists hate this and want to destroy it because they \"don't need a man\" or they are \"empowered\" to do it themselves.  The feminist cult is loyal to the democrat party first and foremost. permalink award report block reply\nLandslide_2020 OP 11 points 7 days ago https://nypost.com/2025/11/05/world-news/lovebirds-crowned-worlds-oldest-married-couple-share-longevity-tips/ permalink award report block reply\nManBadOrange 9 points 7 days ago Wow , I knew a couple who hit 76 years before the wife passed , but this has them beat by 6 or 7 years. Impressive. permalink award report block reply\nFusionBlack 8 points 7 days ago The things they saw in life. Congratulations. permalink award report block reply\nMAGADeluxe 6 points 7 days ago Poor guy, hasn't had peace and quiet for over 80 years! permalink award report block reply\nRight0hio 5 points 7 days ago I want to be so old that you can no longer tell which is which! permalink award report block reply\nQSWO1 4 points 7 days ago Very cool. Dead hearing aid batteries contributed. I kid. What? permalink award report block reply uxername27 -1 points 7 days ago Chirp! permalink parent award report block reply Nomad899 5 points 7 days ago They get a pass, probably cannot hear it and unsafe to climb the ladder permalink parent award report block reply\nuxername27 -1 points 7 days ago Chirp! permalink parent award report block reply Nomad899 5 points 7 days ago They get a pass, probably cannot hear it and unsafe to climb the ladder permalink parent award report block reply\nNomad899 5 points 7 days ago They get a pass, probably cannot hear it and unsafe to climb the ladder permalink parent award report block reply\nKilroy 4 points 7 days ago I've never been to a 70 year anniversary, let alone an 80th. Well done. permalink award report block reply\nspinometer2 3 points 7 days ago what an inspiration permalink award report block reply\nKarenLukasik 2 points 7 days ago Lovely story if most of those years were good and happy… permalink award report block reply\nCacciali_Via 2 points 7 days ago Imagine how much government resources they have used compared to how much they have contributed. It must be a staggering difference. permalink award report block reply\nPelosi_Halitosis 2 points 6 days ago That's a long time. It's funny, we're working on 32 years of marriage. I'd have to figure out exactly when it occurred, but I realized some time ago that I've been married more than half my life. permalink award report block reply\nNomad899 2 points 7 days ago That is AWESOME 👏 👏 👏 permalink award report block reply\nMSG1000 2 points 7 days ago Beautiful. permalink award report block reply\nSurveilThis 2 points 6 days ago The guy’s in a hospital bed recovering from knee replacement surgery. permalink award report block reply Landslide_2020 OP 1 points 6 days ago Amazing 👏 🤩. permalink parent award report block reply\nLandslide_2020 OP 1 points 6 days ago Amazing 👏 🤩. permalink parent award report block reply\nLiberats 1 points 7 days ago How have they lived so long in a country where they are hunted and descriminated so effectively........ 108? I will be happy if I make 85. permalink award report block reply\nJustInTime2_ 1 points 7 days ago Beautiful permalink award report block reply\nNeverInterruptEnemy -8 points 7 days ago tf is this shit All I see here are retards that don’t know that they’re lying about their ages. permalink award report block reply"}