{"id": "1ARK9pghHh", "contents": "19 \"Russia is destroying air defense systems supplied to Ukraine just a week after delivery\" — US Secretary of State Marco Rubio posted 1 hour ago by OrangeManNotBad 6 comments award share report block Lord Bebo @MyLordBebo • 6h 🇺🇸🇺🇦 \"Russia is destroying air defense systems supplied to Ukraine just a week after delivery\" — US Secretary of State Marco Rubio He adds that this problem has been going on for the last two or three years\n6 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Save on Your Electric Bill (Try Tonight) GadgetCyno Ronaldus 4 points 1 hour ago Good. permalink award report block reply Lordfred1993 2 points 1 hour ago Sounds good for business eh Marco?! permalink award report block reply FlyinHeadlock 2 points 48 minutes ago It was always going to end this way. As the saying goes, Russia is always losing. Until they win. permalink award report block reply Trump4Infinity 1 points 41 minutes ago HAHAHA fuck Ukraine and the jewish neocons that started this war. permalink award report block reply Flataxandmaga 1 points 39 minutes ago We're just not sending them enough. For the next few years try to double the supplies then get back to us, If they keep blowing the shit up after that we'll have to make the systems with better parts or paint them more camouflagy. permalink award report block reply zippy2 1 points 36 minutes ago What kind of defense system gets blown up.  Sounds like H1Bs made them. permalink award report block reply\nRonaldus 4 points 1 hour ago Good. permalink award report block reply\nLordfred1993 2 points 1 hour ago Sounds good for business eh Marco?! permalink award report block reply\nFlyinHeadlock 2 points 48 minutes ago It was always going to end this way. As the saying goes, Russia is always losing. Until they win. permalink award report block reply\nTrump4Infinity 1 points 41 minutes ago HAHAHA fuck Ukraine and the jewish neocons that started this war. permalink award report block reply\nFlataxandmaga 1 points 39 minutes ago We're just not sending them enough. For the next few years try to double the supplies then get back to us, If they keep blowing the shit up after that we'll have to make the systems with better parts or paint them more camouflagy. permalink award report block reply\nzippy2 1 points 36 minutes ago What kind of defense system gets blown up.  Sounds like H1Bs made them. permalink award report block reply"}