{"id": "1ARK9nP569", "contents": "13 NEW - U.S. plans to build a $500 million military base near the Gaza border, according to Israeli officials. The base will accommodate several thousand U.S. and international troops tasked with \"maintaining the cease-fire between Israel and Hamas.\" (t.me) posted 7 hours ago by TrumpCare 13 comments award share report block Disclose.tv NEW - U.S. plans to build a $500 million military base near the Gaza border, according to Israeli officials. The base will accommodate several thousand U.S. and international troops tasked with \"maintaining the cease-fire between Israel and Hamas.\"Read mor... t.me\n13 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno PapaPepe 6 points 7 hours ago Oh boy. I can't wait for them to USS Liberty the base and blame palestine permalink award report block reply Seldom_Seen_Kid 5 points 7 hours ago Another Viet Nam “ peacekeeping” mission permalink award report block reply breadbaker 5 points 7 hours ago Papa Trump has lost his MAGA. America Second! permalink award report block reply MoldyLocksNesMonste 7 points 7 hours ago Are we even second? permalink parent award report block reply breadbaker 4 points 7 hours ago Good point. Israel India China USA permalink parent award report block reply bbq1 1 points 7 hours ago Ukraine comes before US sily permalink parent award report block reply breadbaker 2 points 6 hours ago Depressingly true. permalink parent award report block reply Marat1792 4 points 7 hours ago Guys, I hate to say it, but Im so pissed about this past week that I am about ready to start a recall petition. This is horseshit. permalink award report block reply Senaleb 2 points 6 hours ago AMERICA FLAST permalink award report block reply T471 2 points 7 hours ago This is bad. Israel need to understand that if you start a fight with someone bigger you that they fucked up own the consequences. Dumping a US base in Israel makes them defacto NATO members. An attack on them will be an attack on the US. This is not America First. permalink award report block reply Callsign_Fox1 0 points 7 hours ago Hehehe. Those Palestinians are real brave until the sky starts missing pixels. Go Trump! permalink award report block reply Bullet3250 -1 points 7 hours ago We should just go to war against islam.  Neo Crusades. permalink award report block reply Callsign_Fox1 -1 points 7 hours ago I voted for this! permalink award report block reply\nPapaPepe 6 points 7 hours ago Oh boy. I can't wait for them to USS Liberty the base and blame palestine permalink award report block reply\nSeldom_Seen_Kid 5 points 7 hours ago Another Viet Nam “ peacekeeping” mission permalink award report block reply\nbreadbaker 5 points 7 hours ago Papa Trump has lost his MAGA. America Second! permalink award report block reply MoldyLocksNesMonste 7 points 7 hours ago Are we even second? permalink parent award report block reply breadbaker 4 points 7 hours ago Good point. Israel India China USA permalink parent award report block reply bbq1 1 points 7 hours ago Ukraine comes before US sily permalink parent award report block reply breadbaker 2 points 6 hours ago Depressingly true. permalink parent award report block reply\nMoldyLocksNesMonste 7 points 7 hours ago Are we even second? permalink parent award report block reply breadbaker 4 points 7 hours ago Good point. Israel India China USA permalink parent award report block reply bbq1 1 points 7 hours ago Ukraine comes before US sily permalink parent award report block reply breadbaker 2 points 6 hours ago Depressingly true. permalink parent award report block reply\nbreadbaker 4 points 7 hours ago Good point. Israel India China USA permalink parent award report block reply bbq1 1 points 7 hours ago Ukraine comes before US sily permalink parent award report block reply breadbaker 2 points 6 hours ago Depressingly true. permalink parent award report block reply\nbbq1 1 points 7 hours ago Ukraine comes before US sily permalink parent award report block reply breadbaker 2 points 6 hours ago Depressingly true. permalink parent award report block reply\nbreadbaker 2 points 6 hours ago Depressingly true. permalink parent award report block reply\nMarat1792 4 points 7 hours ago Guys, I hate to say it, but Im so pissed about this past week that I am about ready to start a recall petition. This is horseshit. permalink award report block reply\nSenaleb 2 points 6 hours ago AMERICA FLAST permalink award report block reply\nT471 2 points 7 hours ago This is bad. Israel need to understand that if you start a fight with someone bigger you that they fucked up own the consequences. Dumping a US base in Israel makes them defacto NATO members. An attack on them will be an attack on the US. This is not America First. permalink award report block reply\nCallsign_Fox1 0 points 7 hours ago Hehehe. Those Palestinians are real brave until the sky starts missing pixels. Go Trump! permalink award report block reply\nBullet3250 -1 points 7 hours ago We should just go to war against islam.  Neo Crusades. permalink award report block reply\nCallsign_Fox1 -1 points 7 hours ago I voted for this! permalink award report block reply"}