{"id": "1ARK9jztGq", "contents": "609 Horrible garbage people posted 1 day ago by wst4 55 comments award share download report block\n55 comments Sort by Top Top New Worst Old Save MusicToMyEars 68 points 1 day ago I believe this is a false story. Originated on a satire site. This should not appear here. permalink award report block reply KuzoKevin 33 points 1 day ago 100% fake. permalink parent award report block reply Aggrieved03 8 points 1 day ago Sort of like most Gateway Pundit stories. permalink parent award report block reply NeverInterruptEnemy 1 points 1 day ago Who do you think runs this site really? This is not and never was the_donald permalink parent award report block reply awsure 3 points 1 day ago And ghey permalink parent award report block reply MR__K 0 points 1 day ago I have heard both sides but i dont believe either side. permalink parent award report block reply vsekvsek -1 points 1 day ago Actually yes and no. Trump knows something we dont and drops data in drips. permalink parent award report block reply Lady_MaGa 3 points 1 day ago Or one of his \"trusted\" advisors is setting him up for a liable lawsuit to discredit him. permalink parent award report block reply Pepe_longcockings 43 points 1 day ago Seems to not have any factual basis permalink award report block reply billybaldwin2 11 points 1 day ago Not even citing who made the original tweet. I had assumed the entire plan was to force everyone to pay for insurance via the gubberment's insurance portal. Then the feds get that referral income. permalink parent award report block reply IAmTheScience 9 points 1 day ago Of course not. Half the posts on this site are complete garbage. Such a shame what it's become. permalink parent award report block reply BarrysOFace 22 points 1 day ago Fake and gay. From satire site to make your look  dumb permalink award report block reply Creepy_Joe 10 points 1 day ago I knew it was fake because it said DOGE did something. permalink award report block reply catvation 9 points 1 day ago Fake permalink award report block reply Wakenbake 6 points 1 day ago Yall missing that trump actually truthed this permalink award report block reply HairSniffer 11 points 1 day ago Did he?  There's no link or even a date.  Just a photoshopped image. permalink parent award report block reply Wakenbake 10 points 1 day ago https://truthsocial.com/@realDonaldTrump/posts/115520378078620283 permalink parent award report block reply atrex 0 points 1 day ago 9/11/25 9:11am permalink parent award report block reply deleted 0 points 1 day ago EDDIT_IS_CUCKED 2 points 1 day ago Bruh, your clock is 2 months slow. permalink parent award report block reply view 2 more comments... Pepe_longcockings 4 points 1 day ago If he did, then he made a mistake.   Or forgot to bring the receipts permalink parent award report block reply Wakenbake 5 points 1 day ago https://truthsocial.com/@realDonaldTrump/posts/115520378078620283 permalink parent award report block reply HairSniffer 3 points 1 day ago He's often the smartest guy in the room, but Trump still gets fooled like the rest of us. permalink parent award report block reply KernalMustard 1 points 1 day ago Wont get fooled again-the who. permalink parent award report block reply Justjayce 5 points 1 day ago This was wrong when it hit the front page yesterday and is just as wrong TODAY. OP IS A FAGGOT. permalink award report block reply BahamaDon 4 points 1 day ago Though I wish it was true and we caught him, I believe this is fake ass shit. permalink award report block reply Double_D 4 points 1 day ago Bullshit permalink award report block reply redinmn 3 points 1 day ago Please stop with this sort of stuff.  DOGE would have made it very public if this was real.  We look like fools falling for stuff like this. permalink award report block reply howardlong75 2 points 1 day ago It’s these type of fake news stories that make us look like jackasses when we spread them permalink award report block reply Zippythekid 2 points 1 day ago I heard this is false. It fits what I would expect of any Democrat but I don believe this is true. permalink award report block reply YourBirdQuit 2 points 1 day ago This was spread last February permalink award report block reply PlantTrees 0 points 1 day ago It was also a big part of the discussion of fraud and rejection when the demonrats were ramming illegal Obamacare down the throats of Americans. permalink parent award report block reply Bullet3250 2 points 1 day ago Satire, at it's best - allows the reader TO KNOW it is satire and to know it is making fun of Obama... permalink award report block reply PlantTrees -1 points 1 day ago It isn't satire, not fiction, not exaggeration - he really did get a kickback/royalty from Obozocare. permalink parent award report block reply Bullet3250 3 points 1 day ago need the receipts... permalink parent award report block reply PlantTrees 1 points 1 day ago I remember when it was exposed early in the Obozo/demonrat push to 'install' it .... I am looking for the info. permalink parent award report block reply TearsAficionado 2 points 1 day ago Asset forfeiture. permalink award report block reply ManWhoMakesTheMusic 1 points 1 day ago This is not true. Stop being stupid, OP. permalink award report block reply 19American62Woman 1 points 1 day ago Strange, Not one word from the die hard Obama is king people. permalink award report block reply RBFace 1 points 1 day ago So do something about it Trump. Seize their assets and return it to the Tax paying Americans. Problem solved. If you do t do anything about it then shut up about it. permalink award report block reply KennyUS 1 points 1 day ago Why post BS that never happened? permalink award report block reply Oodles 1 points 21 hours ago Old and false OP is a faggot permalink award report block reply superwookee 0 points 1 day ago Just his commission check. Best big med salesperson. permalink award report block reply DCYR66 0 points 1 day ago We need a broken arrow scenario to take place over that house. Have one of our bombers fly over, doo doo doo whoops lost one. Oh Well it’s just the Obama residence. permalink award report block reply booblitchutz 0 points 1 day ago Fry narrows eyes meme permalink award report block reply NowTheyAllLose 0 points 1 day ago Loooooots of accounts I very rarely see coming out of the woodworks to call this fake and gay. And none of them mention that Trump himself retruthed it. Odd, that…… 🤔 permalink award report block reply NeverInterruptEnemy 1 points 1 day ago It is fake and gay. And Trump did post it. That makes it worse you fucking moron. permalink parent award report block reply aoneleggedduck 0 points 1 day ago did he, though? permalink parent award report block reply NowTheyAllLose 2 points 1 day ago https://truthsocial.com/@realDonaldTrump/posts/115520378078620283 Yes. Yes he did. EDIT: You do realize that his account is open to the public, for free, and you can verify things before making a fool of yourself, right? permalink parent award report block reply aoneleggedduck 4 points 1 day ago I don't have a Truth account and without direct links, it's impossible to find an account and a post without having an account of your own. Why is the picture different between the linked post and OP's 'capture'? permalink parent award report block reply NowTheyAllLose 1 points 1 day ago I've never signed up for Truth either.  It's amazing what one can find when they type \"trumps truth social page\" into Google though... It's almost as if looking for something makes finding it much easier. As for your question, someone probably edited it to tee up stupid bullshit like what you're doing here. permalink parent award report block reply SemperFidelis231 1 points 1 day ago That requires the smallest modicum of work, and that's too much. permalink parent award report block reply Psalm-118_24 0 points 1 day ago Every taxpayer dollar obozo got should be confiscated and put back into the treasury.  US born citizens are the only people who can be president.  This foreign born demon should be jailed. permalink award report block reply TrumpMagaNoBama -2 points 1 day ago What fucking pieces of Shit they are!  Thank God for our President!! permalink award report block reply\nMusicToMyEars 68 points 1 day ago I believe this is a false story. Originated on a satire site. This should not appear here. permalink award report block reply KuzoKevin 33 points 1 day ago 100% fake. permalink parent award report block reply Aggrieved03 8 points 1 day ago Sort of like most Gateway Pundit stories. permalink parent award report block reply NeverInterruptEnemy 1 points 1 day ago Who do you think runs this site really? This is not and never was the_donald permalink parent award report block reply awsure 3 points 1 day ago And ghey permalink parent award report block reply MR__K 0 points 1 day ago I have heard both sides but i dont believe either side. permalink parent award report block reply vsekvsek -1 points 1 day ago Actually yes and no. Trump knows something we dont and drops data in drips. permalink parent award report block reply Lady_MaGa 3 points 1 day ago Or one of his \"trusted\" advisors is setting him up for a liable lawsuit to discredit him. permalink parent award report block reply\nKuzoKevin 33 points 1 day ago 100% fake. permalink parent award report block reply Aggrieved03 8 points 1 day ago Sort of like most Gateway Pundit stories. permalink parent award report block reply NeverInterruptEnemy 1 points 1 day ago Who do you think runs this site really? This is not and never was the_donald permalink parent award report block reply awsure 3 points 1 day ago And ghey permalink parent award report block reply\nAggrieved03 8 points 1 day ago Sort of like most Gateway Pundit stories. permalink parent award report block reply NeverInterruptEnemy 1 points 1 day ago Who do you think runs this site really? This is not and never was the_donald permalink parent award report block reply\nNeverInterruptEnemy 1 points 1 day ago Who do you think runs this site really? This is not and never was the_donald permalink parent award report block reply\nawsure 3 points 1 day ago And ghey permalink parent award report block reply\nMR__K 0 points 1 day ago I have heard both sides but i dont believe either side. permalink parent award report block reply\nvsekvsek -1 points 1 day ago Actually yes and no. Trump knows something we dont and drops data in drips. permalink parent award report block reply Lady_MaGa 3 points 1 day ago Or one of his \"trusted\" advisors is setting him up for a liable lawsuit to discredit him. permalink parent award report block reply\nLady_MaGa 3 points 1 day ago Or one of his \"trusted\" advisors is setting him up for a liable lawsuit to discredit him. permalink parent award report block reply\nPepe_longcockings 43 points 1 day ago Seems to not have any factual basis permalink award report block reply billybaldwin2 11 points 1 day ago Not even citing who made the original tweet. I had assumed the entire plan was to force everyone to pay for insurance via the gubberment's insurance portal. Then the feds get that referral income. permalink parent award report block reply IAmTheScience 9 points 1 day ago Of course not. Half the posts on this site are complete garbage. Such a shame what it's become. permalink parent award report block reply\nbillybaldwin2 11 points 1 day ago Not even citing who made the original tweet. I had assumed the entire plan was to force everyone to pay for insurance via the gubberment's insurance portal. Then the feds get that referral income. permalink parent award report block reply\nIAmTheScience 9 points 1 day ago Of course not. Half the posts on this site are complete garbage. Such a shame what it's become. permalink parent award report block reply\nBarrysOFace 22 points 1 day ago Fake and gay. From satire site to make your look  dumb permalink award report block reply\nCreepy_Joe 10 points 1 day ago I knew it was fake because it said DOGE did something. permalink award report block reply\ncatvation 9 points 1 day ago Fake permalink award report block reply\nWakenbake 6 points 1 day ago Yall missing that trump actually truthed this permalink award report block reply HairSniffer 11 points 1 day ago Did he?  There's no link or even a date.  Just a photoshopped image. permalink parent award report block reply Wakenbake 10 points 1 day ago https://truthsocial.com/@realDonaldTrump/posts/115520378078620283 permalink parent award report block reply atrex 0 points 1 day ago 9/11/25 9:11am permalink parent award report block reply deleted 0 points 1 day ago EDDIT_IS_CUCKED 2 points 1 day ago Bruh, your clock is 2 months slow. permalink parent award report block reply view 2 more comments... Pepe_longcockings 4 points 1 day ago If he did, then he made a mistake.   Or forgot to bring the receipts permalink parent award report block reply Wakenbake 5 points 1 day ago https://truthsocial.com/@realDonaldTrump/posts/115520378078620283 permalink parent award report block reply HairSniffer 3 points 1 day ago He's often the smartest guy in the room, but Trump still gets fooled like the rest of us. permalink parent award report block reply KernalMustard 1 points 1 day ago Wont get fooled again-the who. permalink parent award report block reply\nHairSniffer 11 points 1 day ago Did he?  There's no link or even a date.  Just a photoshopped image. permalink parent award report block reply Wakenbake 10 points 1 day ago https://truthsocial.com/@realDonaldTrump/posts/115520378078620283 permalink parent award report block reply atrex 0 points 1 day ago 9/11/25 9:11am permalink parent award report block reply deleted 0 points 1 day ago EDDIT_IS_CUCKED 2 points 1 day ago Bruh, your clock is 2 months slow. permalink parent award report block reply view 2 more comments...\nWakenbake 10 points 1 day ago https://truthsocial.com/@realDonaldTrump/posts/115520378078620283 permalink parent award report block reply\natrex 0 points 1 day ago 9/11/25 9:11am permalink parent award report block reply deleted 0 points 1 day ago EDDIT_IS_CUCKED 2 points 1 day ago Bruh, your clock is 2 months slow. permalink parent award report block reply view 2 more comments...\ndeleted 0 points 1 day ago EDDIT_IS_CUCKED 2 points 1 day ago Bruh, your clock is 2 months slow. permalink parent award report block reply view 2 more comments...\nEDDIT_IS_CUCKED 2 points 1 day ago Bruh, your clock is 2 months slow. permalink parent award report block reply view 2 more comments...\nPepe_longcockings 4 points 1 day ago If he did, then he made a mistake.   Or forgot to bring the receipts permalink parent award report block reply Wakenbake 5 points 1 day ago https://truthsocial.com/@realDonaldTrump/posts/115520378078620283 permalink parent award report block reply HairSniffer 3 points 1 day ago He's often the smartest guy in the room, but Trump still gets fooled like the rest of us. permalink parent award report block reply KernalMustard 1 points 1 day ago Wont get fooled again-the who. permalink parent award report block reply\nWakenbake 5 points 1 day ago https://truthsocial.com/@realDonaldTrump/posts/115520378078620283 permalink parent award report block reply\nHairSniffer 3 points 1 day ago He's often the smartest guy in the room, but Trump still gets fooled like the rest of us. permalink parent award report block reply KernalMustard 1 points 1 day ago Wont get fooled again-the who. permalink parent award report block reply\nKernalMustard 1 points 1 day ago Wont get fooled again-the who. permalink parent award report block reply\nJustjayce 5 points 1 day ago This was wrong when it hit the front page yesterday and is just as wrong TODAY. OP IS A FAGGOT. permalink award report block reply\nBahamaDon 4 points 1 day ago Though I wish it was true and we caught him, I believe this is fake ass shit. permalink award report block reply\nDouble_D 4 points 1 day ago Bullshit permalink award report block reply\nredinmn 3 points 1 day ago Please stop with this sort of stuff.  DOGE would have made it very public if this was real.  We look like fools falling for stuff like this. permalink award report block reply\nhowardlong75 2 points 1 day ago It’s these type of fake news stories that make us look like jackasses when we spread them permalink award report block reply\nZippythekid 2 points 1 day ago I heard this is false. It fits what I would expect of any Democrat but I don believe this is true. permalink award report block reply\nYourBirdQuit 2 points 1 day ago This was spread last February permalink award report block reply PlantTrees 0 points 1 day ago It was also a big part of the discussion of fraud and rejection when the demonrats were ramming illegal Obamacare down the throats of Americans. permalink parent award report block reply\nPlantTrees 0 points 1 day ago It was also a big part of the discussion of fraud and rejection when the demonrats were ramming illegal Obamacare down the throats of Americans. permalink parent award report block reply\nBullet3250 2 points 1 day ago Satire, at it's best - allows the reader TO KNOW it is satire and to know it is making fun of Obama... permalink award report block reply PlantTrees -1 points 1 day ago It isn't satire, not fiction, not exaggeration - he really did get a kickback/royalty from Obozocare. permalink parent award report block reply Bullet3250 3 points 1 day ago need the receipts... permalink parent award report block reply PlantTrees 1 points 1 day ago I remember when it was exposed early in the Obozo/demonrat push to 'install' it .... I am looking for the info. permalink parent award report block reply\nPlantTrees -1 points 1 day ago It isn't satire, not fiction, not exaggeration - he really did get a kickback/royalty from Obozocare. permalink parent award report block reply Bullet3250 3 points 1 day ago need the receipts... permalink parent award report block reply PlantTrees 1 points 1 day ago I remember when it was exposed early in the Obozo/demonrat push to 'install' it .... I am looking for the info. permalink parent award report block reply\nBullet3250 3 points 1 day ago need the receipts... permalink parent award report block reply PlantTrees 1 points 1 day ago I remember when it was exposed early in the Obozo/demonrat push to 'install' it .... I am looking for the info. permalink parent award report block reply\nPlantTrees 1 points 1 day ago I remember when it was exposed early in the Obozo/demonrat push to 'install' it .... I am looking for the info. permalink parent award report block reply\nTearsAficionado 2 points 1 day ago Asset forfeiture. permalink award report block reply\nManWhoMakesTheMusic 1 points 1 day ago This is not true. Stop being stupid, OP. permalink award report block reply\n19American62Woman 1 points 1 day ago Strange, Not one word from the die hard Obama is king people. permalink award report block reply\nRBFace 1 points 1 day ago So do something about it Trump. Seize their assets and return it to the Tax paying Americans. Problem solved. If you do t do anything about it then shut up about it. permalink award report block reply\nKennyUS 1 points 1 day ago Why post BS that never happened? permalink award report block reply\nOodles 1 points 21 hours ago Old and false OP is a faggot permalink award report block reply\nsuperwookee 0 points 1 day ago Just his commission check. Best big med salesperson. permalink award report block reply\nDCYR66 0 points 1 day ago We need a broken arrow scenario to take place over that house. Have one of our bombers fly over, doo doo doo whoops lost one. Oh Well it’s just the Obama residence. permalink award report block reply\nbooblitchutz 0 points 1 day ago Fry narrows eyes meme permalink award report block reply\nNowTheyAllLose 0 points 1 day ago Loooooots of accounts I very rarely see coming out of the woodworks to call this fake and gay. And none of them mention that Trump himself retruthed it. Odd, that…… 🤔 permalink award report block reply NeverInterruptEnemy 1 points 1 day ago It is fake and gay. And Trump did post it. That makes it worse you fucking moron. permalink parent award report block reply aoneleggedduck 0 points 1 day ago did he, though? permalink parent award report block reply NowTheyAllLose 2 points 1 day ago https://truthsocial.com/@realDonaldTrump/posts/115520378078620283 Yes. Yes he did. EDIT: You do realize that his account is open to the public, for free, and you can verify things before making a fool of yourself, right? permalink parent award report block reply aoneleggedduck 4 points 1 day ago I don't have a Truth account and without direct links, it's impossible to find an account and a post without having an account of your own. Why is the picture different between the linked post and OP's 'capture'? permalink parent award report block reply NowTheyAllLose 1 points 1 day ago I've never signed up for Truth either.  It's amazing what one can find when they type \"trumps truth social page\" into Google though... It's almost as if looking for something makes finding it much easier. As for your question, someone probably edited it to tee up stupid bullshit like what you're doing here. permalink parent award report block reply SemperFidelis231 1 points 1 day ago That requires the smallest modicum of work, and that's too much. permalink parent award report block reply\nNeverInterruptEnemy 1 points 1 day ago It is fake and gay. And Trump did post it. That makes it worse you fucking moron. permalink parent award report block reply\naoneleggedduck 0 points 1 day ago did he, though? permalink parent award report block reply NowTheyAllLose 2 points 1 day ago https://truthsocial.com/@realDonaldTrump/posts/115520378078620283 Yes. Yes he did. EDIT: You do realize that his account is open to the public, for free, and you can verify things before making a fool of yourself, right? permalink parent award report block reply aoneleggedduck 4 points 1 day ago I don't have a Truth account and without direct links, it's impossible to find an account and a post without having an account of your own. Why is the picture different between the linked post and OP's 'capture'? permalink parent award report block reply NowTheyAllLose 1 points 1 day ago I've never signed up for Truth either.  It's amazing what one can find when they type \"trumps truth social page\" into Google though... It's almost as if looking for something makes finding it much easier. As for your question, someone probably edited it to tee up stupid bullshit like what you're doing here. permalink parent award report block reply SemperFidelis231 1 points 1 day ago That requires the smallest modicum of work, and that's too much. permalink parent award report block reply\nNowTheyAllLose 2 points 1 day ago https://truthsocial.com/@realDonaldTrump/posts/115520378078620283 Yes. Yes he did. EDIT: You do realize that his account is open to the public, for free, and you can verify things before making a fool of yourself, right? permalink parent award report block reply aoneleggedduck 4 points 1 day ago I don't have a Truth account and without direct links, it's impossible to find an account and a post without having an account of your own. Why is the picture different between the linked post and OP's 'capture'? permalink parent award report block reply NowTheyAllLose 1 points 1 day ago I've never signed up for Truth either.  It's amazing what one can find when they type \"trumps truth social page\" into Google though... It's almost as if looking for something makes finding it much easier. As for your question, someone probably edited it to tee up stupid bullshit like what you're doing here. permalink parent award report block reply SemperFidelis231 1 points 1 day ago That requires the smallest modicum of work, and that's too much. permalink parent award report block reply\naoneleggedduck 4 points 1 day ago I don't have a Truth account and without direct links, it's impossible to find an account and a post without having an account of your own. Why is the picture different between the linked post and OP's 'capture'? permalink parent award report block reply NowTheyAllLose 1 points 1 day ago I've never signed up for Truth either.  It's amazing what one can find when they type \"trumps truth social page\" into Google though... It's almost as if looking for something makes finding it much easier. As for your question, someone probably edited it to tee up stupid bullshit like what you're doing here. permalink parent award report block reply\nNowTheyAllLose 1 points 1 day ago I've never signed up for Truth either.  It's amazing what one can find when they type \"trumps truth social page\" into Google though... It's almost as if looking for something makes finding it much easier. As for your question, someone probably edited it to tee up stupid bullshit like what you're doing here. permalink parent award report block reply\nSemperFidelis231 1 points 1 day ago That requires the smallest modicum of work, and that's too much. permalink parent award report block reply\nPsalm-118_24 0 points 1 day ago Every taxpayer dollar obozo got should be confiscated and put back into the treasury.  US born citizens are the only people who can be president.  This foreign born demon should be jailed. permalink award report block reply\nTrumpMagaNoBama -2 points 1 day ago What fucking pieces of Shit they are!  Thank God for our President!! permalink award report block reply"}