{"id": "1ARK9mHEk0", "contents": "58 I'm tired chief posted 15 hours ago by LeRiverDanube 16 comments award share report block how many more backstabs must we endure?\n16 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget ElevenMile 9 points 15 hours ago We probably need to import people with the talent for enduring this kind of backstabbing permalink award report block reply MakeAmericaGreat9 5 points 14 hours ago Well... Vance can put two sencteces together and be on point for an entire conversation. Problem is\nPeter fucking Thiel. permalink parent award report block reply Brock_Shithouse 3 points 13 hours ago Yeah, the guy married to an indian will surely be a bulwark against h1bs. permalink parent award report block reply MakeAmericaGreat9 3 points 12 hours ago Also true. permalink parent award report block reply ReleasetheList 4 points 14 hours ago That's always been the goal. A bunch of 3rd world browns won't complain about being debt slaves. Being a debt slave in America is still better than living in their shithole country, until one day, it isn't. permalink parent award report block reply Brock_Shithouse 3 points 13 hours ago That day could be less than 5 years out at this rate. permalink parent award report block reply bidensmissingbrain 1 points 11 hours ago Debt slaves? Son, they’re being brought here to be actual slaves. permalink parent award report block reply NadlersNads 2 points 10 hours ago I'm tired too. Drinking myself to death permalink award report block reply CrowRezNeck 2 points 14 hours ago Keep going Fren. https://youtu.be/0IFm-R2AKTw?si=tKTlXdtsKJjRJf_A permalink award report block reply SuperDuperBasedMD -2 points 13 hours ago \"This effort to split the MAGA base, using Israel or (insert_next_thing_here) as a wedge issue within the America First movement – only benefits one larger apparatus, the Sea Island billionaire control system.\" https://theconservativetreehouse.com/blog/2025/11/11/the-2025-maga-fracture-and-the-benefactors-behind-it/ permalink award report block reply BerettaStroker 1 points 12 hours ago Stop copy/pasting this into every comment thread. Buy an ad. permalink parent award report block reply SuperDuperBasedMD 2 points 12 hours ago not every comment thread, just the ones where it seems like we're being brigaded by people trying to divide us. Or can't you recognize a psyop when you're in one? permalink parent award report block reply BerettaStroker 1 points 12 hours ago Dude, shut up. I've been here 5 years and voted for Trump 3 times. I'm over the 47D chess bullshit. He is so out of touch right now he may as well be on the fucking moon. He's being handled, likely by multiple people, and has zero clue what his base wants and needs from him. permalink parent award report block reply SuperDuperBasedMD 1 points 12 hours ago Are you saying we aren't routinely targeted by psyop campaigns? Did you ever cross paths with the GreatGoolyGoo? permalink parent award report block reply view 2 more comments...\nElevenMile 9 points 15 hours ago We probably need to import people with the talent for enduring this kind of backstabbing permalink award report block reply MakeAmericaGreat9 5 points 14 hours ago Well... Vance can put two sencteces together and be on point for an entire conversation. Problem is\nPeter fucking Thiel. permalink parent award report block reply Brock_Shithouse 3 points 13 hours ago Yeah, the guy married to an indian will surely be a bulwark against h1bs. permalink parent award report block reply MakeAmericaGreat9 3 points 12 hours ago Also true. permalink parent award report block reply ReleasetheList 4 points 14 hours ago That's always been the goal. A bunch of 3rd world browns won't complain about being debt slaves. Being a debt slave in America is still better than living in their shithole country, until one day, it isn't. permalink parent award report block reply Brock_Shithouse 3 points 13 hours ago That day could be less than 5 years out at this rate. permalink parent award report block reply bidensmissingbrain 1 points 11 hours ago Debt slaves? Son, they’re being brought here to be actual slaves. permalink parent award report block reply\nMakeAmericaGreat9 5 points 14 hours ago Well... Vance can put two sencteces together and be on point for an entire conversation. Problem is\nPeter fucking Thiel. permalink parent award report block reply Brock_Shithouse 3 points 13 hours ago Yeah, the guy married to an indian will surely be a bulwark against h1bs. permalink parent award report block reply MakeAmericaGreat9 3 points 12 hours ago Also true. permalink parent award report block reply\nBrock_Shithouse 3 points 13 hours ago Yeah, the guy married to an indian will surely be a bulwark against h1bs. permalink parent award report block reply MakeAmericaGreat9 3 points 12 hours ago Also true. permalink parent award report block reply\nMakeAmericaGreat9 3 points 12 hours ago Also true. permalink parent award report block reply\nReleasetheList 4 points 14 hours ago That's always been the goal. A bunch of 3rd world browns won't complain about being debt slaves. Being a debt slave in America is still better than living in their shithole country, until one day, it isn't. permalink parent award report block reply Brock_Shithouse 3 points 13 hours ago That day could be less than 5 years out at this rate. permalink parent award report block reply bidensmissingbrain 1 points 11 hours ago Debt slaves? Son, they’re being brought here to be actual slaves. permalink parent award report block reply\nBrock_Shithouse 3 points 13 hours ago That day could be less than 5 years out at this rate. permalink parent award report block reply\nbidensmissingbrain 1 points 11 hours ago Debt slaves? Son, they’re being brought here to be actual slaves. permalink parent award report block reply\nNadlersNads 2 points 10 hours ago I'm tired too. Drinking myself to death permalink award report block reply\nCrowRezNeck 2 points 14 hours ago Keep going Fren. https://youtu.be/0IFm-R2AKTw?si=tKTlXdtsKJjRJf_A permalink award report block reply\nSuperDuperBasedMD -2 points 13 hours ago \"This effort to split the MAGA base, using Israel or (insert_next_thing_here) as a wedge issue within the America First movement – only benefits one larger apparatus, the Sea Island billionaire control system.\" https://theconservativetreehouse.com/blog/2025/11/11/the-2025-maga-fracture-and-the-benefactors-behind-it/ permalink award report block reply BerettaStroker 1 points 12 hours ago Stop copy/pasting this into every comment thread. Buy an ad. permalink parent award report block reply SuperDuperBasedMD 2 points 12 hours ago not every comment thread, just the ones where it seems like we're being brigaded by people trying to divide us. Or can't you recognize a psyop when you're in one? permalink parent award report block reply BerettaStroker 1 points 12 hours ago Dude, shut up. I've been here 5 years and voted for Trump 3 times. I'm over the 47D chess bullshit. He is so out of touch right now he may as well be on the fucking moon. He's being handled, likely by multiple people, and has zero clue what his base wants and needs from him. permalink parent award report block reply SuperDuperBasedMD 1 points 12 hours ago Are you saying we aren't routinely targeted by psyop campaigns? Did you ever cross paths with the GreatGoolyGoo? permalink parent award report block reply view 2 more comments...\nBerettaStroker 1 points 12 hours ago Stop copy/pasting this into every comment thread. Buy an ad. permalink parent award report block reply SuperDuperBasedMD 2 points 12 hours ago not every comment thread, just the ones where it seems like we're being brigaded by people trying to divide us. Or can't you recognize a psyop when you're in one? permalink parent award report block reply BerettaStroker 1 points 12 hours ago Dude, shut up. I've been here 5 years and voted for Trump 3 times. I'm over the 47D chess bullshit. He is so out of touch right now he may as well be on the fucking moon. He's being handled, likely by multiple people, and has zero clue what his base wants and needs from him. permalink parent award report block reply SuperDuperBasedMD 1 points 12 hours ago Are you saying we aren't routinely targeted by psyop campaigns? Did you ever cross paths with the GreatGoolyGoo? permalink parent award report block reply view 2 more comments...\nSuperDuperBasedMD 2 points 12 hours ago not every comment thread, just the ones where it seems like we're being brigaded by people trying to divide us. Or can't you recognize a psyop when you're in one? permalink parent award report block reply BerettaStroker 1 points 12 hours ago Dude, shut up. I've been here 5 years and voted for Trump 3 times. I'm over the 47D chess bullshit. He is so out of touch right now he may as well be on the fucking moon. He's being handled, likely by multiple people, and has zero clue what his base wants and needs from him. permalink parent award report block reply SuperDuperBasedMD 1 points 12 hours ago Are you saying we aren't routinely targeted by psyop campaigns? Did you ever cross paths with the GreatGoolyGoo? permalink parent award report block reply view 2 more comments...\nBerettaStroker 1 points 12 hours ago Dude, shut up. I've been here 5 years and voted for Trump 3 times. I'm over the 47D chess bullshit. He is so out of touch right now he may as well be on the fucking moon. He's being handled, likely by multiple people, and has zero clue what his base wants and needs from him. permalink parent award report block reply SuperDuperBasedMD 1 points 12 hours ago Are you saying we aren't routinely targeted by psyop campaigns? Did you ever cross paths with the GreatGoolyGoo? permalink parent award report block reply view 2 more comments...\nSuperDuperBasedMD 1 points 12 hours ago Are you saying we aren't routinely targeted by psyop campaigns? Did you ever cross paths with the GreatGoolyGoo? permalink parent award report block reply view 2 more comments..."}