{"id": "1ARK9pgQEj", "contents": "18 My favorite memory from Jan 6 posted 2 hours ago by 2021is1776-2 3 comments award share report block During this violent and totally 10x worse than 9/11 insurrection my wife and I had time to stop at a food truck parked right across from the ultra violent event and order a nice pretzel and soda (who knew by today’s standards they would be reasonably priced) then go sit on the water fountain and eat them.\n3 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Save on Your Electric Bill (Try Tonight) GadgetCyno NadlersNads 1 points 43 minutes ago When the text from bowser hit i realized i hadnt eaten in 2 days and nothing was going to be open all night so i walk jogged the few miles back to my hotel, cancelled that night and drove across the bridge to stay at a nicer hotel in VA. Checked in and had to charge the phone a bit so i turned on the news to watch cbs lie about everything.. made a call to a bar 3 blocks down to make sure they were open and bartender said yep, open till 11 or 12 depending on traffic. By time i got down to the lobby a text rang out to warn everyone now VA was locked down ... the only thing open was a corner store where i had to settle for luncheables, jerky and coors light permalink award report block reply OhinIdaho 1 points 1 hour ago And purchase Trump swag from vendors. Best day ever. permalink award report block reply HowDoYouTurnThisOn 1 points 2 hours ago Comment removed by community filter. permalink award report block reply\nNadlersNads 1 points 43 minutes ago When the text from bowser hit i realized i hadnt eaten in 2 days and nothing was going to be open all night so i walk jogged the few miles back to my hotel, cancelled that night and drove across the bridge to stay at a nicer hotel in VA. Checked in and had to charge the phone a bit so i turned on the news to watch cbs lie about everything.. made a call to a bar 3 blocks down to make sure they were open and bartender said yep, open till 11 or 12 depending on traffic. By time i got down to the lobby a text rang out to warn everyone now VA was locked down ... the only thing open was a corner store where i had to settle for luncheables, jerky and coors light permalink award report block reply\nOhinIdaho 1 points 1 hour ago And purchase Trump swag from vendors. Best day ever. permalink award report block reply\nHowDoYouTurnThisOn 1 points 2 hours ago Comment removed by community filter. permalink award report block reply"}