{"id": "1ARK9peVE4", "contents": "233 \"You can't just take random unemployed people and have them make missiles!\"\n\nWe took unskilled, uneducated housewives and put them in factories to make tanks, bombs, planes etc\n\nThere is NO job we *need* any migrants for. None. posted 12 hours ago by PiratePatriotParrot 15 comments award share report block Manlet King ☩ @TheManlet_King • 1d \"You can't just take random unemployed people and have them make missiles!\" We took unskilled, uneducated housewives and put them in factories to make tanks, bombs, planes etc There is NO job we *need* any migrants for. None. Eric Daugherty @EricLDaugh • 2d 🚨 JUST IN: Laura Ingraham PRESSES President Trump on restricting H-1B visas \"H-1B visa thing won't be a big priority for you? If you wanna raise wages for Americans, you can't flood the country with THOUSANDS of foreign workers.\" TRUMP: You have to bring in talent. \"We have\n15 comments Sort by Top Top New Worst Old Save Around the Web salbro 7 points 11 hours ago I hate that Trump trusts some corrupt people for information. Whomever is gaslighting him about H1B hates America and it sucks that he can't listen to others permalink award report block reply DingleberryMutt 6 points 11 hours ago That’s the first thing I thought of after hearing him say this nonsense - that housewives and mothers showed up to factories and learned how to weld and assemble things for the war.  Trump has obviously forgotten about Rosie the riveter. permalink award report block reply Standingoak 2 points 10 hours ago But he hasn't forgotten about Elon's robot workers.  They all need to go home , we got this. permalink parent award report block reply Hikedelics 6 points 11 hours ago There were ladies unknowingly running the uranium enrichment reactors. Everything was so siloed they had no idea what they were doing, just told to turn the knob to keep the needle between two numbers on a gauge. That was my point in an earlier comment. Yeah, technical development does require some incredibly talented people doing R&D type work, but 90% of a project, even the manhattan project, does not require some super genius. It takes a lot of support to keep factories running and many of those roles literally could be filled by people right off the unemployment line. permalink award report block reply Standingoak 3 points 10 hours ago many of those roles literally could be filled by... RELIABLE ... people right off the unemployment line. Sanjay and Shaniquua may need a long trial period. permalink parent award report block reply Datamancer 5 points 12 hours ago Why not, we take uneducated Muslims and make them police officers. We take uneducated Hindus and make them truck drivers. permalink award report block reply Greenhills 5 points 12 hours ago Word permalink award report block reply Moebius 3 points 10 hours ago They were building all sorts of weapons systems from Aircraft to PT Boats... permalink award report block reply Standingoak 3 points 10 hours ago Do you know how manufactures poached skilled employees after  FDR put wage and price controls an everyone ? permalink parent award report block reply Moebius 4 points 9 hours ago Yup.  Employers offered non-wage benefits like pensions and health insurance to attract and retain workers—and other fringe benefits that did not violate the wage ceiling.  A few even offered free housing and transportation. permalink parent award report block reply Standingoak 3 points 9 hours ago Exactly , And look how fucked up the Kaiser Foundation and all the medical industry has become as a result.  Government touches it and eventually evil becomes obvious.  That doesn't even cover the whole Why WW 1 Then WW 2 EVIL. Clott Adams is/was a Kaiser patient , which works great as long as you're healthy. edit : took me a bit to find this : https://www.youtube.com/watch?v=Ofg-609wlxg permalink parent award report block reply Wildwind 3 points 8 hours ago Like hell you cant. I was inbetween jobs when I was hired at a plant that makes big bombs and small bombs. Without any training other from my employer. That included missiles. permalink award report block reply MissPatriot713 2 points 9 hours ago Companies have gotten cheap and don't want to train employees!! People can learn to do a job! TRAIN THEM!!!! permalink award report block reply SaxonRealm 1 points 8 hours ago The people Trump are talking about cannot do those jobs. A bunch of homeless drug addicts or EBT queens aren’t going to build rockets. permalink award report block reply BeerPatroit 1 points 10 hours ago You do when women get the power to vote, and then they vote to destroy the country. These bitches should be housewives raising the next generation. Instead they are shaking their ass on onlyfans and getting abortions. permalink award report block reply True-Grit 1 points 2 hours ago And in NC there bringing in \"Drs.\" from who knows where, due to a shortage of Dr.s. in rural areas. Sounds like the same idea. https://www.billtrack50.com/billdetail/1872984 permalink award report block reply\nsalbro 7 points 11 hours ago I hate that Trump trusts some corrupt people for information. Whomever is gaslighting him about H1B hates America and it sucks that he can't listen to others permalink award report block reply\nDingleberryMutt 6 points 11 hours ago That’s the first thing I thought of after hearing him say this nonsense - that housewives and mothers showed up to factories and learned how to weld and assemble things for the war.  Trump has obviously forgotten about Rosie the riveter. permalink award report block reply Standingoak 2 points 10 hours ago But he hasn't forgotten about Elon's robot workers.  They all need to go home , we got this. permalink parent award report block reply\nStandingoak 2 points 10 hours ago But he hasn't forgotten about Elon's robot workers.  They all need to go home , we got this. permalink parent award report block reply\nHikedelics 6 points 11 hours ago There were ladies unknowingly running the uranium enrichment reactors. Everything was so siloed they had no idea what they were doing, just told to turn the knob to keep the needle between two numbers on a gauge. That was my point in an earlier comment. Yeah, technical development does require some incredibly talented people doing R&D type work, but 90% of a project, even the manhattan project, does not require some super genius. It takes a lot of support to keep factories running and many of those roles literally could be filled by people right off the unemployment line. permalink award report block reply Standingoak 3 points 10 hours ago many of those roles literally could be filled by... RELIABLE ... people right off the unemployment line. Sanjay and Shaniquua may need a long trial period. permalink parent award report block reply\nStandingoak 3 points 10 hours ago many of those roles literally could be filled by... RELIABLE ... people right off the unemployment line. Sanjay and Shaniquua may need a long trial period. permalink parent award report block reply\nDatamancer 5 points 12 hours ago Why not, we take uneducated Muslims and make them police officers. We take uneducated Hindus and make them truck drivers. permalink award report block reply\nGreenhills 5 points 12 hours ago Word permalink award report block reply\nMoebius 3 points 10 hours ago They were building all sorts of weapons systems from Aircraft to PT Boats... permalink award report block reply Standingoak 3 points 10 hours ago Do you know how manufactures poached skilled employees after  FDR put wage and price controls an everyone ? permalink parent award report block reply Moebius 4 points 9 hours ago Yup.  Employers offered non-wage benefits like pensions and health insurance to attract and retain workers—and other fringe benefits that did not violate the wage ceiling.  A few even offered free housing and transportation. permalink parent award report block reply Standingoak 3 points 9 hours ago Exactly , And look how fucked up the Kaiser Foundation and all the medical industry has become as a result.  Government touches it and eventually evil becomes obvious.  That doesn't even cover the whole Why WW 1 Then WW 2 EVIL. Clott Adams is/was a Kaiser patient , which works great as long as you're healthy. edit : took me a bit to find this : https://www.youtube.com/watch?v=Ofg-609wlxg permalink parent award report block reply\nStandingoak 3 points 10 hours ago Do you know how manufactures poached skilled employees after  FDR put wage and price controls an everyone ? permalink parent award report block reply Moebius 4 points 9 hours ago Yup.  Employers offered non-wage benefits like pensions and health insurance to attract and retain workers—and other fringe benefits that did not violate the wage ceiling.  A few even offered free housing and transportation. permalink parent award report block reply Standingoak 3 points 9 hours ago Exactly , And look how fucked up the Kaiser Foundation and all the medical industry has become as a result.  Government touches it and eventually evil becomes obvious.  That doesn't even cover the whole Why WW 1 Then WW 2 EVIL. Clott Adams is/was a Kaiser patient , which works great as long as you're healthy. edit : took me a bit to find this : https://www.youtube.com/watch?v=Ofg-609wlxg permalink parent award report block reply\nMoebius 4 points 9 hours ago Yup.  Employers offered non-wage benefits like pensions and health insurance to attract and retain workers—and other fringe benefits that did not violate the wage ceiling.  A few even offered free housing and transportation. permalink parent award report block reply Standingoak 3 points 9 hours ago Exactly , And look how fucked up the Kaiser Foundation and all the medical industry has become as a result.  Government touches it and eventually evil becomes obvious.  That doesn't even cover the whole Why WW 1 Then WW 2 EVIL. Clott Adams is/was a Kaiser patient , which works great as long as you're healthy. edit : took me a bit to find this : https://www.youtube.com/watch?v=Ofg-609wlxg permalink parent award report block reply\nStandingoak 3 points 9 hours ago Exactly , And look how fucked up the Kaiser Foundation and all the medical industry has become as a result.  Government touches it and eventually evil becomes obvious.  That doesn't even cover the whole Why WW 1 Then WW 2 EVIL. Clott Adams is/was a Kaiser patient , which works great as long as you're healthy. edit : took me a bit to find this : https://www.youtube.com/watch?v=Ofg-609wlxg permalink parent award report block reply\nWildwind 3 points 8 hours ago Like hell you cant. I was inbetween jobs when I was hired at a plant that makes big bombs and small bombs. Without any training other from my employer. That included missiles. permalink award report block reply\nMissPatriot713 2 points 9 hours ago Companies have gotten cheap and don't want to train employees!! People can learn to do a job! TRAIN THEM!!!! permalink award report block reply\nSaxonRealm 1 points 8 hours ago The people Trump are talking about cannot do those jobs. A bunch of homeless drug addicts or EBT queens aren’t going to build rockets. permalink award report block reply\nBeerPatroit 1 points 10 hours ago You do when women get the power to vote, and then they vote to destroy the country. These bitches should be housewives raising the next generation. Instead they are shaking their ass on onlyfans and getting abortions. permalink award report block reply\nTrue-Grit 1 points 2 hours ago And in NC there bringing in \"Drs.\" from who knows where, due to a shortage of Dr.s. in rural areas. Sounds like the same idea. https://www.billtrack50.com/billdetail/1872984 permalink award report block reply"}