{"id": "1ARK9pgh5G", "contents": "51 India can send 1,001 Dr.Guptas our way, but not one person licensed in plumbing or HVAC? posted 1 hour ago by Redpillrambo 7 comments award share report block One clown named Rajeet Gupta gets a doctorate, and every asshole name Rajeet Gupta can ise that degree to invade without knowing about germ theory or that hand washing changed the longevity of the planet... Not one can figure out crude plumbing? All that money they scam from us, they cant start a trash service? Motherfucker, import a garbage truck instead of a racecar.\n7 comments Sort by Top Top New Worst Old Save Throwingway22 2 points 18 minutes ago India has an average IQ in the \"mentally retarded\" range. If only the higher IQ ones, who understandably don't want to live in a country dominated by their co-ethnics, could've set aside their ethnic-nepotism, they probably could've done fine. But they pushed too hard. Scammed too many times. No one wants to be around any pajeets anymore. permalink award report block reply Trooph-Hurts 2 points 1 hour ago That’s because they have open sewage drainage and extension cord electricity in India! permalink award report block reply CloudNine 2 points 1 hour ago Just string those power wires around the tree,, up over the roof, down the chimney, then connect to 40 apartments. We do this is India all the time! permalink award report block reply RudeFrog 2 points 34 minutes ago It's actually chat gpt who has the medical degree permalink award report block reply DoMagnum 2 points 1 hour ago Caste System permalink award report block reply FlyinHeadlock 1 points 1 hour ago Most of them are doing rudimentary dev work from what I've seen. It's going to be a problem because automation and AI are gutting these jobs. What likely happens is they run up credit card debt and head back home. Russia is also using them but it looks like for crappy construction projects like Stalin style apartments with one furnace to heat the whole building where if you are close to the furnace you leave all the windows open because it's too hot. The questions not being asked are; 1.define talent. 2 If talent is medical doctors and engineers how is that going to impact their countries? I think everyone knows those answers and that's why everyone is furious. permalink award report block reply Elencher 2 points 10 minutes ago My theory is that the push for AI in software is because of the jeets. They've imported too many dispshits and think AI is the way they can get something out of it because they can't code for shit on their own. permalink parent award report block reply\nThrowingway22 2 points 18 minutes ago India has an average IQ in the \"mentally retarded\" range. If only the higher IQ ones, who understandably don't want to live in a country dominated by their co-ethnics, could've set aside their ethnic-nepotism, they probably could've done fine. But they pushed too hard. Scammed too many times. No one wants to be around any pajeets anymore. permalink award report block reply\nTrooph-Hurts 2 points 1 hour ago That’s because they have open sewage drainage and extension cord electricity in India! permalink award report block reply\nCloudNine 2 points 1 hour ago Just string those power wires around the tree,, up over the roof, down the chimney, then connect to 40 apartments. We do this is India all the time! permalink award report block reply\nRudeFrog 2 points 34 minutes ago It's actually chat gpt who has the medical degree permalink award report block reply\nDoMagnum 2 points 1 hour ago Caste System permalink award report block reply\nFlyinHeadlock 1 points 1 hour ago Most of them are doing rudimentary dev work from what I've seen. It's going to be a problem because automation and AI are gutting these jobs. What likely happens is they run up credit card debt and head back home. Russia is also using them but it looks like for crappy construction projects like Stalin style apartments with one furnace to heat the whole building where if you are close to the furnace you leave all the windows open because it's too hot. The questions not being asked are; 1.define talent. 2 If talent is medical doctors and engineers how is that going to impact their countries? I think everyone knows those answers and that's why everyone is furious. permalink award report block reply Elencher 2 points 10 minutes ago My theory is that the push for AI in software is because of the jeets. They've imported too many dispshits and think AI is the way they can get something out of it because they can't code for shit on their own. permalink parent award report block reply\nElencher 2 points 10 minutes ago My theory is that the push for AI in software is because of the jeets. They've imported too many dispshits and think AI is the way they can get something out of it because they can't code for shit on their own. permalink parent award report block reply"}