{"id": "1ARK9oXCR0", "contents": "12 Trump already told you! posted 54 minutes ago by New2me 6 comments award share report block Trump once said that he was a stable genius.  Not everything he says is going to sound reasonable because he is dealing with unreasonable people.  There is a a method to his madness, trust the plan.  Fraud vitiates everything!  God wins!\n6 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget SHILL_DETECTOR 6 points 52 minutes ago hold the line!  stay tuned!  two more weeks! permalink award report block reply eclectic22 1 points 31 minutes ago alternatively, be retarded permalink parent award report block reply Rosebud4Jesus 2 points 39 minutes ago Agreed.  The attacking Trump especially publicly like MTG has been doing lately is going to be the downfall of this admin and is going to hand the dems the midterms.  Will be repeat of 2020. Did you all forget 2020 election and persecution of Trump and J6 MAGA and the last 4 years of the miserable dangerous evil Biden and dem control? Dems win the midterms they will win 2028 and it will be RIP America and persecution of conservatives especially Christians more than ever. If Charlie Kirk was still here would feel a lot better as he was connected to MAGA and in Trump's ear when MAGA was upset about something.  But this public attacking Trump by GOP like MTG on all the leftist shows even attacking Trump's deporting is giving the evil demoncrat party exactly what they want. Also Pam Bondi needs to go ASAP.  She is Bill Barr 2.0.  Just like Barr she is do nothing and will never go against the deep state or dems. permalink award report block reply StrongIsland 2 points 49 minutes ago Holy shit you people are annoying! Catch Phrases will save us, trust the plan, hold the line, What line? Ughhhhhhh! permalink award report block reply eclectic22 1 points 30 minutes ago Lefty shills will never understand permalink parent award report block reply MrMcGreenGenes 0 points 47 minutes ago Trump should go drink cow piss with his fellow geniuses in India and run for President there. permalink award report block reply\nSHILL_DETECTOR 6 points 52 minutes ago hold the line!  stay tuned!  two more weeks! permalink award report block reply eclectic22 1 points 31 minutes ago alternatively, be retarded permalink parent award report block reply\neclectic22 1 points 31 minutes ago alternatively, be retarded permalink parent award report block reply\nRosebud4Jesus 2 points 39 minutes ago Agreed.  The attacking Trump especially publicly like MTG has been doing lately is going to be the downfall of this admin and is going to hand the dems the midterms.  Will be repeat of 2020. Did you all forget 2020 election and persecution of Trump and J6 MAGA and the last 4 years of the miserable dangerous evil Biden and dem control? Dems win the midterms they will win 2028 and it will be RIP America and persecution of conservatives especially Christians more than ever. If Charlie Kirk was still here would feel a lot better as he was connected to MAGA and in Trump's ear when MAGA was upset about something.  But this public attacking Trump by GOP like MTG on all the leftist shows even attacking Trump's deporting is giving the evil demoncrat party exactly what they want. Also Pam Bondi needs to go ASAP.  She is Bill Barr 2.0.  Just like Barr she is do nothing and will never go against the deep state or dems. permalink award report block reply\nStrongIsland 2 points 49 minutes ago Holy shit you people are annoying! Catch Phrases will save us, trust the plan, hold the line, What line? Ughhhhhhh! permalink award report block reply eclectic22 1 points 30 minutes ago Lefty shills will never understand permalink parent award report block reply\neclectic22 1 points 30 minutes ago Lefty shills will never understand permalink parent award report block reply\nMrMcGreenGenes 0 points 47 minutes ago Trump should go drink cow piss with his fellow geniuses in India and run for President there. permalink award report block reply"}