{"id": "1ARK9oYa0m", "contents": "69 🔫 A 𝙇𝙊𝘼𝘿𝙀𝘿 𝙂𝙐𝙉 magazine with hollow point rounds and a mysterious inscription was found on a Frontier plane in Atlanta — remind me, 𝙬𝙝𝙮 do we get groped by TSA before our flights again? posted 13 hours ago by TheRedPilledArtist 5 comments award share download report block\n5 comments Sort by Top Top New Worst Old Save AllisterTwo 2 points 12 hours ago TSA is 99% for show, if you actually desire to get something past them, there are ways... They might not be fool proof ways, but there are ways that will work most of the time... permalink award report block reply MasterChief 2 points 13 hours ago I went to the range on a Saturday and had my backpack with me. Went on a trip to Canada that Sunday. Got flagged by security...forgot a few rounds were still in the backpack. Whoopsie. permalink award report block reply Nomad899 3 points 12 hours ago Friend flying through germany coming home from iraq found a handful of 7.62 and some detcord in his daypack…. Oopsie daises permalink parent award report block reply FurtherRight 1 points 12 hours ago what was the fallout of  that occasion? permalink parent award report block reply Blackmore 2 points 12 hours ago Check the AIR MARSHALL’s gun magazine if he lost it. You might know if it’s him or not. permalink award report block reply TheRedPilledArtist OP 1 points 13 hours ago Source: https://x.com/FoxNews/status/1988791342768812214 permalink award report block reply RYTHMICRIOT 1 points 12 hours ago Isn't Frontier basically Spirit Lite? permalink award report block reply\nAllisterTwo 2 points 12 hours ago TSA is 99% for show, if you actually desire to get something past them, there are ways... They might not be fool proof ways, but there are ways that will work most of the time... permalink award report block reply\nMasterChief 2 points 13 hours ago I went to the range on a Saturday and had my backpack with me. Went on a trip to Canada that Sunday. Got flagged by security...forgot a few rounds were still in the backpack. Whoopsie. permalink award report block reply Nomad899 3 points 12 hours ago Friend flying through germany coming home from iraq found a handful of 7.62 and some detcord in his daypack…. Oopsie daises permalink parent award report block reply FurtherRight 1 points 12 hours ago what was the fallout of  that occasion? permalink parent award report block reply\nNomad899 3 points 12 hours ago Friend flying through germany coming home from iraq found a handful of 7.62 and some detcord in his daypack…. Oopsie daises permalink parent award report block reply\nFurtherRight 1 points 12 hours ago what was the fallout of  that occasion? permalink parent award report block reply\nBlackmore 2 points 12 hours ago Check the AIR MARSHALL’s gun magazine if he lost it. You might know if it’s him or not. permalink award report block reply\nTheRedPilledArtist OP 1 points 13 hours ago Source: https://x.com/FoxNews/status/1988791342768812214 permalink award report block reply\nRYTHMICRIOT 1 points 12 hours ago Isn't Frontier basically Spirit Lite? permalink award report block reply"}