{"id": "1ARK9irmKW", "contents": "931 BBC: \"Help!\" posted 2 days ago by _Liberty_Prime_ 13 comments award share download report block\n13 comments Sort by Top Top New Worst Old Save Johnkimble111 20 points 2 days ago They can’t even report on their own scandal honestly. The headline today read that the two executives had resigned “over Trump documentary edits”. They can’t even admit the speech was edited, no it was merely resignation due to changing their own documentary somehow. They literally can never admit when Trump is right or when Trump is the victim., even after the two most senior staff have to resign. permalink award report block reply SavingPrivateGrace 4 points 2 days ago It's up to President Trump's discretion if he's satisfied with the handling of or not.  \"A letter from Trump lawyer Alejandro Brito demanded the BBC \"retract the false, defamatory, disparaging, and inflammatory statements\", apologise and \"appropriately compensate President Trump for the harm caused\" or face legal action for $1bn in damages.\" https://www.independent.co.uk/news/uk/home-news/trump-bbc-legal-action-panorama-edit-latest-news-b2862216.html permalink parent award report block reply HelluvaEngineer 8 points 2 days ago Be careful with the context \"BBC\" permalink award report block reply Than0sIII 8 points 2 days ago Big Mike has entered the chat. permalink parent award report block reply JustTheNews 1 points 2 days ago Yeah day white boy crashed his bike in the wrong neighborhood.... now he's in the basement as a pet being fed cheezits and bologna ...... riding the baloney pony... permalink parent award report block reply snoopy3210 1 points 2 days ago Be careful about foreign interference while directly interfering in the foreign 2024 American election to help Kamala Harris and damage Trump BBC (plus of course their 2016 foreign interference with the British Piss dossier) permalink parent award report block reply knnbccb 6 points 2 days ago If you want to know what kind of an organization BBC is, recall its response when Brexit happened and how it treated Nigel Farage. permalink award report block reply Scumbag-reddit 5 points 2 days ago They are such fucking scum permalink award report block reply AwShitHereWeGoAgain 2 points 2 days ago Fuck you, limey faggots.  FUCK YOU. permalink award report block reply OutlawPurpleHairDye 2 points 2 days ago Have the ones that resigned been hired by the CBS fake news program 60 Minutes yet?  I hear they also love deceptively editing clips. permalink award report block reply SpellingContable 2 points 2 days ago \"Why would Trump do this?\" permalink award report block reply jermzdeejd 1 points 1 day ago There are 3 routes: It is not happening, but it is good that it is and let me tell you why. We push fake, get called out, play victim. We do shitty things, get a responde from republican, ignore our actions, fully focus on Republican response. permalink award report block reply YearninNation 0 points 2 days ago well they announced WTC7 collapsed 26 minutes before it happed but you don't need to suspect anyone had foreknowledge as it was fact-checked. permalink award report block reply\nJohnkimble111 20 points 2 days ago They can’t even report on their own scandal honestly. The headline today read that the two executives had resigned “over Trump documentary edits”. They can’t even admit the speech was edited, no it was merely resignation due to changing their own documentary somehow. They literally can never admit when Trump is right or when Trump is the victim., even after the two most senior staff have to resign. permalink award report block reply SavingPrivateGrace 4 points 2 days ago It's up to President Trump's discretion if he's satisfied with the handling of or not.  \"A letter from Trump lawyer Alejandro Brito demanded the BBC \"retract the false, defamatory, disparaging, and inflammatory statements\", apologise and \"appropriately compensate President Trump for the harm caused\" or face legal action for $1bn in damages.\" https://www.independent.co.uk/news/uk/home-news/trump-bbc-legal-action-panorama-edit-latest-news-b2862216.html permalink parent award report block reply\nSavingPrivateGrace 4 points 2 days ago It's up to President Trump's discretion if he's satisfied with the handling of or not.  \"A letter from Trump lawyer Alejandro Brito demanded the BBC \"retract the false, defamatory, disparaging, and inflammatory statements\", apologise and \"appropriately compensate President Trump for the harm caused\" or face legal action for $1bn in damages.\" https://www.independent.co.uk/news/uk/home-news/trump-bbc-legal-action-panorama-edit-latest-news-b2862216.html permalink parent award report block reply\nHelluvaEngineer 8 points 2 days ago Be careful with the context \"BBC\" permalink award report block reply Than0sIII 8 points 2 days ago Big Mike has entered the chat. permalink parent award report block reply JustTheNews 1 points 2 days ago Yeah day white boy crashed his bike in the wrong neighborhood.... now he's in the basement as a pet being fed cheezits and bologna ...... riding the baloney pony... permalink parent award report block reply snoopy3210 1 points 2 days ago Be careful about foreign interference while directly interfering in the foreign 2024 American election to help Kamala Harris and damage Trump BBC (plus of course their 2016 foreign interference with the British Piss dossier) permalink parent award report block reply\nThan0sIII 8 points 2 days ago Big Mike has entered the chat. permalink parent award report block reply JustTheNews 1 points 2 days ago Yeah day white boy crashed his bike in the wrong neighborhood.... now he's in the basement as a pet being fed cheezits and bologna ...... riding the baloney pony... permalink parent award report block reply\nJustTheNews 1 points 2 days ago Yeah day white boy crashed his bike in the wrong neighborhood.... now he's in the basement as a pet being fed cheezits and bologna ...... riding the baloney pony... permalink parent award report block reply\nsnoopy3210 1 points 2 days ago Be careful about foreign interference while directly interfering in the foreign 2024 American election to help Kamala Harris and damage Trump BBC (plus of course their 2016 foreign interference with the British Piss dossier) permalink parent award report block reply\nknnbccb 6 points 2 days ago If you want to know what kind of an organization BBC is, recall its response when Brexit happened and how it treated Nigel Farage. permalink award report block reply\nScumbag-reddit 5 points 2 days ago They are such fucking scum permalink award report block reply\nAwShitHereWeGoAgain 2 points 2 days ago Fuck you, limey faggots.  FUCK YOU. permalink award report block reply\nOutlawPurpleHairDye 2 points 2 days ago Have the ones that resigned been hired by the CBS fake news program 60 Minutes yet?  I hear they also love deceptively editing clips. permalink award report block reply\nSpellingContable 2 points 2 days ago \"Why would Trump do this?\" permalink award report block reply\njermzdeejd 1 points 1 day ago There are 3 routes: It is not happening, but it is good that it is and let me tell you why. We push fake, get called out, play victim. We do shitty things, get a responde from republican, ignore our actions, fully focus on Republican response. permalink award report block reply\nYearninNation 0 points 2 days ago well they announced WTC7 collapsed 26 minutes before it happed but you don't need to suspect anyone had foreknowledge as it was fact-checked. permalink award report block reply"}