{"id": "1ARK9irmCN", "contents": "1019 On the brink of starvation. posted 2 days ago by rdvs34283 27 comments award share download report block\n27 comments Sort by Top Top New Worst Old Save Around the Web Nezock_theKnight 18 points 2 days ago You weak-minded fool! He's using a old Trump mind trick! permalink award report block reply YT45 5 points 2 days ago Oh-shudaa! permalink parent award report block reply shadypollster 6 points 2 days ago HO HO HO HO! Bantha Poodu! permalink parent award report block reply mohel 4 points 2 days ago These are not the mind tricks you are looking for permalink parent award report block reply OnlyTrump20 13 points 2 days ago I saw a video by some guy who delivers for Walmart saying the first thing people were ordering once the EBT started up again was soda and chips.   He also said he delivers a lot of expensive shit like Playstation games to the same places that use the EBT.  Like they have no priorities and make no efforts when the government feeds them for free. permalink award report block reply lovemylibs 8 points 2 days ago We feed them for free. permalink parent award report block reply ModernKnight 7 points 2 days ago I do charity work building beds for kids who don't have them in the city nearest to me.  I'm getting really fatigued by it.  It's NEVER a white family, it's always either blacks, a middle-eastern \"refugee,\" or a coal-burner with half-caste kids.  And something I've noticed- the kids never have beds, but they ALWAYS HAVE MULTIPLE LARGE-SCREEN TVS.  Every.  Fucking.  Time.  Bigger TVs than the single TV my wife and I have.  And I'm building beds for these fuckers.  I try to live a life in line with a Christian charitable mindset, but it's really, REALLY hard when those I'm giving to have more than I do. This is part of the reason I'm so fucking angry about everyone who gets any kind of gibs.  I work my ass off to afford the few luxuries I allow myself, and I see how high-on-the-hog those my taxes go to live.  I am so fatigued. permalink parent award report block reply desertflower 3 points 1 day ago Back in the 70s, our church youth group raised boxes of food for a local family at Christmas. We delivered the boxes to the house, and were mesmerized by the new foreign car in the driveway. permalink parent award report block reply anotherthing 2 points 1 day ago I delivered pizza in college back in the 1990s. One of the places we delivered was a Section 8 apartment complex. The first time I saw a big screen plasma TV outside of the Sears' showroom was in that apartment complex, and more than one of those apartments had them. They had leather wrap around couches and other crazy things. The cars in the parking lot were also fairly new and there were absolutely no compact cars. Also, you could smell weed in the parking lot before you even got to the buildings. permalink parent award report block reply mohel 5 points 2 days ago Finally 7-11 stores will be able to restock their inventory. permalink parent award report block reply snoopy3210 4 points 2 days ago So much sugar it cannot be called food permalink parent award report block reply knnbccb 6 points 2 days ago They need the food stamps to get a new hairdo, and to paint their  nails at a salon. permalink award report block reply OutlawPurpleHairDye 3 points 2 days ago Standard EBT exchange rate is 40 cents on the dollar to get your nails did. permalink parent award report block reply anotherthing 1 points 1 day ago Fifty cents on the dollar was what I always heard. It makes the math easier. permalink parent award report block reply Please_Clap 5 points 2 days ago America's defenders of processed food, fast food, and high fructose corn syrup. 😍 permalink award report block reply DelendaEstMarxismo 3 points 2 days ago Obesity is always in the top 5 health care issues for poor people in America. permalink award report block reply MAGA_mantis 2 points 2 days ago Snap and ebt is helping. permalink parent award report block reply carpetxparmesan 1 points 2 days ago Elect meesa to senate and make gunga healthy again meesa promise. Meesa takea alla tylenol off gunga. Many great ships from the sky take alla autismo to coruscant. JarJar2026 permalink parent award report block reply entERmyMAtrix 3 points 2 days ago Top kek permalink award report block reply ColonelKlink 3 points 2 days ago Nothing that fat is starving. permalink award report block reply magnokor 3 points 2 days ago Maybe don't ridicule this guy. Sure, he may have eaten a bit much, but he was also choked and killed by an angry woman. She then went after a stable genius.  She said: Trump speaking his mind isn't refreshing, it's appalling. Carrie Fisher retracts comment on Donald Trump’s ‘sniffles’ and cocaine permalink award report block reply barwhack 2 points 1 day ago Jobless the Hutt. permalink award report block reply SavingPrivateGrace 2 points 2 days ago The politician's biggest fear is EBT Jabba's and not us. permalink award report block reply hillaryforprison 2 points 2 days ago chubba da fatt musta git Cheetoz permalink award report block reply DoMagnum 1 points 1 day ago Illegal Alien from Tatooine!!! permalink award report block reply uxername27 -1 points 2 days ago Serial reposter u/rdvs34283 being stickied again... permalink award report block reply RuprechtThaMonkeyBoy 2 points 2 days ago And? You’re more than welcome to get up early and post at 6am Trump Time which is when they contribute a large amount of posts. permalink parent award report block reply\nNezock_theKnight 18 points 2 days ago You weak-minded fool! He's using a old Trump mind trick! permalink award report block reply YT45 5 points 2 days ago Oh-shudaa! permalink parent award report block reply shadypollster 6 points 2 days ago HO HO HO HO! Bantha Poodu! permalink parent award report block reply mohel 4 points 2 days ago These are not the mind tricks you are looking for permalink parent award report block reply\nYT45 5 points 2 days ago Oh-shudaa! permalink parent award report block reply shadypollster 6 points 2 days ago HO HO HO HO! Bantha Poodu! permalink parent award report block reply\nshadypollster 6 points 2 days ago HO HO HO HO! Bantha Poodu! permalink parent award report block reply\nmohel 4 points 2 days ago These are not the mind tricks you are looking for permalink parent award report block reply\nOnlyTrump20 13 points 2 days ago I saw a video by some guy who delivers for Walmart saying the first thing people were ordering once the EBT started up again was soda and chips.   He also said he delivers a lot of expensive shit like Playstation games to the same places that use the EBT.  Like they have no priorities and make no efforts when the government feeds them for free. permalink award report block reply lovemylibs 8 points 2 days ago We feed them for free. permalink parent award report block reply ModernKnight 7 points 2 days ago I do charity work building beds for kids who don't have them in the city nearest to me.  I'm getting really fatigued by it.  It's NEVER a white family, it's always either blacks, a middle-eastern \"refugee,\" or a coal-burner with half-caste kids.  And something I've noticed- the kids never have beds, but they ALWAYS HAVE MULTIPLE LARGE-SCREEN TVS.  Every.  Fucking.  Time.  Bigger TVs than the single TV my wife and I have.  And I'm building beds for these fuckers.  I try to live a life in line with a Christian charitable mindset, but it's really, REALLY hard when those I'm giving to have more than I do. This is part of the reason I'm so fucking angry about everyone who gets any kind of gibs.  I work my ass off to afford the few luxuries I allow myself, and I see how high-on-the-hog those my taxes go to live.  I am so fatigued. permalink parent award report block reply desertflower 3 points 1 day ago Back in the 70s, our church youth group raised boxes of food for a local family at Christmas. We delivered the boxes to the house, and were mesmerized by the new foreign car in the driveway. permalink parent award report block reply anotherthing 2 points 1 day ago I delivered pizza in college back in the 1990s. One of the places we delivered was a Section 8 apartment complex. The first time I saw a big screen plasma TV outside of the Sears' showroom was in that apartment complex, and more than one of those apartments had them. They had leather wrap around couches and other crazy things. The cars in the parking lot were also fairly new and there were absolutely no compact cars. Also, you could smell weed in the parking lot before you even got to the buildings. permalink parent award report block reply mohel 5 points 2 days ago Finally 7-11 stores will be able to restock their inventory. permalink parent award report block reply snoopy3210 4 points 2 days ago So much sugar it cannot be called food permalink parent award report block reply\nlovemylibs 8 points 2 days ago We feed them for free. permalink parent award report block reply\nModernKnight 7 points 2 days ago I do charity work building beds for kids who don't have them in the city nearest to me.  I'm getting really fatigued by it.  It's NEVER a white family, it's always either blacks, a middle-eastern \"refugee,\" or a coal-burner with half-caste kids.  And something I've noticed- the kids never have beds, but they ALWAYS HAVE MULTIPLE LARGE-SCREEN TVS.  Every.  Fucking.  Time.  Bigger TVs than the single TV my wife and I have.  And I'm building beds for these fuckers.  I try to live a life in line with a Christian charitable mindset, but it's really, REALLY hard when those I'm giving to have more than I do. This is part of the reason I'm so fucking angry about everyone who gets any kind of gibs.  I work my ass off to afford the few luxuries I allow myself, and I see how high-on-the-hog those my taxes go to live.  I am so fatigued. permalink parent award report block reply desertflower 3 points 1 day ago Back in the 70s, our church youth group raised boxes of food for a local family at Christmas. We delivered the boxes to the house, and were mesmerized by the new foreign car in the driveway. permalink parent award report block reply anotherthing 2 points 1 day ago I delivered pizza in college back in the 1990s. One of the places we delivered was a Section 8 apartment complex. The first time I saw a big screen plasma TV outside of the Sears' showroom was in that apartment complex, and more than one of those apartments had them. They had leather wrap around couches and other crazy things. The cars in the parking lot were also fairly new and there were absolutely no compact cars. Also, you could smell weed in the parking lot before you even got to the buildings. permalink parent award report block reply\ndesertflower 3 points 1 day ago Back in the 70s, our church youth group raised boxes of food for a local family at Christmas. We delivered the boxes to the house, and were mesmerized by the new foreign car in the driveway. permalink parent award report block reply anotherthing 2 points 1 day ago I delivered pizza in college back in the 1990s. One of the places we delivered was a Section 8 apartment complex. The first time I saw a big screen plasma TV outside of the Sears' showroom was in that apartment complex, and more than one of those apartments had them. They had leather wrap around couches and other crazy things. The cars in the parking lot were also fairly new and there were absolutely no compact cars. Also, you could smell weed in the parking lot before you even got to the buildings. permalink parent award report block reply\nanotherthing 2 points 1 day ago I delivered pizza in college back in the 1990s. One of the places we delivered was a Section 8 apartment complex. The first time I saw a big screen plasma TV outside of the Sears' showroom was in that apartment complex, and more than one of those apartments had them. They had leather wrap around couches and other crazy things. The cars in the parking lot were also fairly new and there were absolutely no compact cars. Also, you could smell weed in the parking lot before you even got to the buildings. permalink parent award report block reply\nmohel 5 points 2 days ago Finally 7-11 stores will be able to restock their inventory. permalink parent award report block reply\nsnoopy3210 4 points 2 days ago So much sugar it cannot be called food permalink parent award report block reply\nknnbccb 6 points 2 days ago They need the food stamps to get a new hairdo, and to paint their  nails at a salon. permalink award report block reply OutlawPurpleHairDye 3 points 2 days ago Standard EBT exchange rate is 40 cents on the dollar to get your nails did. permalink parent award report block reply anotherthing 1 points 1 day ago Fifty cents on the dollar was what I always heard. It makes the math easier. permalink parent award report block reply\nOutlawPurpleHairDye 3 points 2 days ago Standard EBT exchange rate is 40 cents on the dollar to get your nails did. permalink parent award report block reply anotherthing 1 points 1 day ago Fifty cents on the dollar was what I always heard. It makes the math easier. permalink parent award report block reply\nanotherthing 1 points 1 day ago Fifty cents on the dollar was what I always heard. It makes the math easier. permalink parent award report block reply\nPlease_Clap 5 points 2 days ago America's defenders of processed food, fast food, and high fructose corn syrup. 😍 permalink award report block reply\nDelendaEstMarxismo 3 points 2 days ago Obesity is always in the top 5 health care issues for poor people in America. permalink award report block reply MAGA_mantis 2 points 2 days ago Snap and ebt is helping. permalink parent award report block reply carpetxparmesan 1 points 2 days ago Elect meesa to senate and make gunga healthy again meesa promise. Meesa takea alla tylenol off gunga. Many great ships from the sky take alla autismo to coruscant. JarJar2026 permalink parent award report block reply\nMAGA_mantis 2 points 2 days ago Snap and ebt is helping. permalink parent award report block reply\ncarpetxparmesan 1 points 2 days ago Elect meesa to senate and make gunga healthy again meesa promise. Meesa takea alla tylenol off gunga. Many great ships from the sky take alla autismo to coruscant. JarJar2026 permalink parent award report block reply\nentERmyMAtrix 3 points 2 days ago Top kek permalink award report block reply\nColonelKlink 3 points 2 days ago Nothing that fat is starving. permalink award report block reply\nmagnokor 3 points 2 days ago Maybe don't ridicule this guy. Sure, he may have eaten a bit much, but he was also choked and killed by an angry woman. She then went after a stable genius.  She said: Trump speaking his mind isn't refreshing, it's appalling. Carrie Fisher retracts comment on Donald Trump’s ‘sniffles’ and cocaine permalink award report block reply\nbarwhack 2 points 1 day ago Jobless the Hutt. permalink award report block reply\nSavingPrivateGrace 2 points 2 days ago The politician's biggest fear is EBT Jabba's and not us. permalink award report block reply\nhillaryforprison 2 points 2 days ago chubba da fatt musta git Cheetoz permalink award report block reply\nDoMagnum 1 points 1 day ago Illegal Alien from Tatooine!!! permalink award report block reply\nuxername27 -1 points 2 days ago Serial reposter u/rdvs34283 being stickied again... permalink award report block reply RuprechtThaMonkeyBoy 2 points 2 days ago And? You’re more than welcome to get up early and post at 6am Trump Time which is when they contribute a large amount of posts. permalink parent award report block reply\nRuprechtThaMonkeyBoy 2 points 2 days ago And? You’re more than welcome to get up early and post at 6am Trump Time which is when they contribute a large amount of posts. permalink parent award report block reply"}