{"id": "1ARK9oXkOt", "contents": "391 Republicans are totally clueless to the anger over the H1B issue posted 15 hours ago by CounterStrike 38 comments award share download report block\n38 comments Sort by Top Top New Worst Old Save 480le 42 points 14 hours ago These motherfuckers have never had to build skills and work for a living. In tech, ive been stuck for 15 damn years at the same rate of pay because of this shit. I should be in my peak earning years but thanks to fucking H1B's,my pay has been diluted and ive lost opportunity and jobs because of this shit. I am sick and fucking tired of it. It stops now! permalink award report block reply Repentnow -24 points 10 hours ago Here's a tissue. Whine harder. Sorry ass victim.  You've had 15 years to better your life, but instead you sat around and bitched about it. Pathetic. permalink parent award report block reply 480le 18 points 10 hours ago Suck my cock shit skin permalink parent award report block reply Repentnow -17 points 10 hours ago Victims will always be losers. permalink parent award report block reply axiy 6 points 10 hours ago https://rumble.com/v4nzece-india-the-worst-country-on-earth-narrated-by-ai-david-attenborough.html?e9s=src_v1_cw&playlist_id=watch-history permalink parent award report block reply 480le 1 points 10 hours ago See post #3 Tell your mom her favorite looser says hi permalink parent award report block reply SpeekFreely 33 points 15 hours ago Vance sure has been quiet these last couple days permalink award report block reply FromNC 17 points 14 hours ago Thinking the same thing permalink parent award report block reply SaxonRealm 5 points 8 hours ago Vance isn’t the guy. permalink parent award report block reply markolbb 1 points 8 minutes ago I don't think we have a guy. None of them are on our side. permalink parent award report block reply shadypollster 24 points 15 hours ago I wish we would learn the truth about Charlie's murder. This was a calculated take down of OUR GUY. Some real palace intrigue stuff. permalink award report block reply SneakyPete 21 points 14 hours ago Demoralizing. Alot less supporters will rush out to defend Trump in the public square. permalink award report block reply Build_Back_Bankrupt 21 points 14 hours ago Constant defense is what got us here, we need to see some offense from this administration or shit is going to go sideways after the midterms. I'm not kidding, they better get off their asses and hit the gas on what we voted for, which is a much better scenario than the alternative, which at this point seems almost inevitable. permalink parent award report block reply markolbb 1 points 7 minutes ago which at this point seems almost inevitable It's not only inevitable, it's intentional. permalink parent award report block reply texas4ever -10 points 13 hours ago People expect miracles from Trump but are rarely willing to defend him in public. permalink parent award report block reply Wrexxis780 16 points 13 hours ago It doesnt matter how great America is if Americans are the 2nd class citizens in it. permalink award report block reply Aisle-is-closed 15 points 13 hours ago There was some boomer con complaining about noticing in a blog posted by citizenfreepress about this exact thing. Zoomers are not having it anymore. His political contacts in Washington are basically saying “I want to burn this to the ground” and they are right. Like absolutely fuck Trump so hard right now. permalink award report block reply patrioticwinning3 15 points 13 hours ago \"The fuck are Americans left with?\"  The bill :p permalink award report block reply MAGABOND 5 points 10 hours ago 🔫 permalink parent award report block reply GreyKnight 13 points 12 hours ago Reminds me of the old saying “Republicans are just democrats doing the speed limit” permalink award report block reply RandoBudster 11 points 14 hours ago MTG is the only one with enough balls to talk about it so people say she must be canceled for being unloyal to Trump and now everyones pissed at Trump about it. permalink award report block reply SaltyLandscaper 5 points 12 hours ago She is no better. But she is right on this. permalink parent award report block reply HumanSomewhere 10 points 13 hours ago Don't make the mistake of making the US like the UK.  When WW3 hits, they are going to have to send vans to yank people off the streets in the UK like they do in Ukraine.  Foreigners say \"I'm so oppressed, this isn't MY country, let the white people fight!\"  White Englishers will say \"you've taken my country away from me and given it to foreigners, let them fight!\"  Nobody is going to feel like they have skin in the game. permalink award report block reply utfanx2 9 points 14 hours ago Reservations... We're left in reservations. permalink award report block reply mikethemarine 9 points 13 hours ago no they aren't clueless, THEY JUST DON'T FUCKING CARE, they are all for one world order, and the UNITED STATES ARE STANDING IN THEIR WAY permalink award report block reply HumblePig 6 points 12 hours ago They're not clueless, they just know there's no alternative; who else we gonna vote for, Democrats? There is no party for us. Trump ran on curbing immigration as his main issue BOTH times. permalink award report block reply GentleSlayer 6 points 13 hours ago This is a perfect opportunity for the left to reverse course back to Bernie and Caesar Chavez. I would hands down vote for any leftist I was 100% convinced would reverse the invasion, end H1B, end spousal work visas, end student visas, and deport, deport, deport. I am almost a one-issue voter. I don't even care about creepy perverts in women's locker rooms anymore. Just fix this fucking immigration nightmare. permalink award report block reply MAGABOND 4 points 10 hours ago If Trump can’t be trusted, no one can. This is the end. permalink parent award report block reply Trajano 1 points 32 minutes ago So your position is that somebody from Biden's party will reverse the invasion, end H1B, end spousal work visas, end student visas, and deport, deport, deport? Where have you been in the last 15 years? permalink parent award report block reply neveser 6 points 10 hours ago No, they're not clueless. It's called the Kalergi plan. permalink award report block reply CounterStrike OP 7 points 10 hours ago \"AI\" using  the sources Wikipedia and politifact told me: The Kalergi Plan is a debunked conspiracy theory that falsely claims Richard von Coudenhove-Kalergi, an early 20th-century politician, devised a plot to replace white Europeans with other races through immigration. This theory is rooted in anti-Semitic beliefs and has been widely discredited as a hoax. Clearly this is factual. permalink parent award report block reply axiy 9 points 10 hours ago \"this theory is rooted in anti-Semetism\" they randomly said for no reason. permalink parent award report block reply CounterStrike OP 7 points 9 hours ago I thought that was a nice touch,  kek permalink parent award report block reply RandyMoss 4 points 13 hours ago No they aren't. They know how easy it is to lead the stupid football watching masses down the wrong road. Look how many idiots on this site don't like Thomas Massie. Literally the embodiment of MAGA and they get mad at him for voting against Trump's RINO, War Mongering dog shit Biden era bills. permalink award report block reply ThunderGatti 8 points 9 hours ago Massie is a fucking moron. He's good on Israel, that's it. He sucks ass on everything else. He votes open borders every chance he gets, but he is MAGA?? 🤣 He's also an economic retard. He understands absolutely nothing about business and economics permalink parent award report block reply Repentnow 2 points 10 hours ago The demoralize and divide plan in full swing. permalink award report block reply GontMawr 1 points 16 minutes ago Ok...but why did your relationship with your parents not suffer? This is no MAGA supporter. permalink award report block reply CounterStrike OP 1 points 15 hours ago https://x.com/upstatefederlst/status/1988634068641046607 permalink award report block reply DEUSVEULT232 1 points 15 hours ago Comment removed by community filter, pending further review. permalink award report block reply\n480le 42 points 14 hours ago These motherfuckers have never had to build skills and work for a living. In tech, ive been stuck for 15 damn years at the same rate of pay because of this shit. I should be in my peak earning years but thanks to fucking H1B's,my pay has been diluted and ive lost opportunity and jobs because of this shit. I am sick and fucking tired of it. It stops now! permalink award report block reply Repentnow -24 points 10 hours ago Here's a tissue. Whine harder. Sorry ass victim.  You've had 15 years to better your life, but instead you sat around and bitched about it. Pathetic. permalink parent award report block reply 480le 18 points 10 hours ago Suck my cock shit skin permalink parent award report block reply Repentnow -17 points 10 hours ago Victims will always be losers. permalink parent award report block reply axiy 6 points 10 hours ago https://rumble.com/v4nzece-india-the-worst-country-on-earth-narrated-by-ai-david-attenborough.html?e9s=src_v1_cw&playlist_id=watch-history permalink parent award report block reply 480le 1 points 10 hours ago See post #3 Tell your mom her favorite looser says hi permalink parent award report block reply\nRepentnow -24 points 10 hours ago Here's a tissue. Whine harder. Sorry ass victim.  You've had 15 years to better your life, but instead you sat around and bitched about it. Pathetic. permalink parent award report block reply 480le 18 points 10 hours ago Suck my cock shit skin permalink parent award report block reply Repentnow -17 points 10 hours ago Victims will always be losers. permalink parent award report block reply axiy 6 points 10 hours ago https://rumble.com/v4nzece-india-the-worst-country-on-earth-narrated-by-ai-david-attenborough.html?e9s=src_v1_cw&playlist_id=watch-history permalink parent award report block reply 480le 1 points 10 hours ago See post #3 Tell your mom her favorite looser says hi permalink parent award report block reply\n480le 18 points 10 hours ago Suck my cock shit skin permalink parent award report block reply Repentnow -17 points 10 hours ago Victims will always be losers. permalink parent award report block reply axiy 6 points 10 hours ago https://rumble.com/v4nzece-india-the-worst-country-on-earth-narrated-by-ai-david-attenborough.html?e9s=src_v1_cw&playlist_id=watch-history permalink parent award report block reply 480le 1 points 10 hours ago See post #3 Tell your mom her favorite looser says hi permalink parent award report block reply\nRepentnow -17 points 10 hours ago Victims will always be losers. permalink parent award report block reply axiy 6 points 10 hours ago https://rumble.com/v4nzece-india-the-worst-country-on-earth-narrated-by-ai-david-attenborough.html?e9s=src_v1_cw&playlist_id=watch-history permalink parent award report block reply 480le 1 points 10 hours ago See post #3 Tell your mom her favorite looser says hi permalink parent award report block reply\naxiy 6 points 10 hours ago https://rumble.com/v4nzece-india-the-worst-country-on-earth-narrated-by-ai-david-attenborough.html?e9s=src_v1_cw&playlist_id=watch-history permalink parent award report block reply\n480le 1 points 10 hours ago See post #3 Tell your mom her favorite looser says hi permalink parent award report block reply\nSpeekFreely 33 points 15 hours ago Vance sure has been quiet these last couple days permalink award report block reply FromNC 17 points 14 hours ago Thinking the same thing permalink parent award report block reply SaxonRealm 5 points 8 hours ago Vance isn’t the guy. permalink parent award report block reply markolbb 1 points 8 minutes ago I don't think we have a guy. None of them are on our side. permalink parent award report block reply\nFromNC 17 points 14 hours ago Thinking the same thing permalink parent award report block reply\nSaxonRealm 5 points 8 hours ago Vance isn’t the guy. permalink parent award report block reply markolbb 1 points 8 minutes ago I don't think we have a guy. None of them are on our side. permalink parent award report block reply\nmarkolbb 1 points 8 minutes ago I don't think we have a guy. None of them are on our side. permalink parent award report block reply\nshadypollster 24 points 15 hours ago I wish we would learn the truth about Charlie's murder. This was a calculated take down of OUR GUY. Some real palace intrigue stuff. permalink award report block reply\nSneakyPete 21 points 14 hours ago Demoralizing. Alot less supporters will rush out to defend Trump in the public square. permalink award report block reply Build_Back_Bankrupt 21 points 14 hours ago Constant defense is what got us here, we need to see some offense from this administration or shit is going to go sideways after the midterms. I'm not kidding, they better get off their asses and hit the gas on what we voted for, which is a much better scenario than the alternative, which at this point seems almost inevitable. permalink parent award report block reply markolbb 1 points 7 minutes ago which at this point seems almost inevitable It's not only inevitable, it's intentional. permalink parent award report block reply texas4ever -10 points 13 hours ago People expect miracles from Trump but are rarely willing to defend him in public. permalink parent award report block reply\nBuild_Back_Bankrupt 21 points 14 hours ago Constant defense is what got us here, we need to see some offense from this administration or shit is going to go sideways after the midterms. I'm not kidding, they better get off their asses and hit the gas on what we voted for, which is a much better scenario than the alternative, which at this point seems almost inevitable. permalink parent award report block reply markolbb 1 points 7 minutes ago which at this point seems almost inevitable It's not only inevitable, it's intentional. permalink parent award report block reply\nmarkolbb 1 points 7 minutes ago which at this point seems almost inevitable It's not only inevitable, it's intentional. permalink parent award report block reply\ntexas4ever -10 points 13 hours ago People expect miracles from Trump but are rarely willing to defend him in public. permalink parent award report block reply\nWrexxis780 16 points 13 hours ago It doesnt matter how great America is if Americans are the 2nd class citizens in it. permalink award report block reply\nAisle-is-closed 15 points 13 hours ago There was some boomer con complaining about noticing in a blog posted by citizenfreepress about this exact thing. Zoomers are not having it anymore. His political contacts in Washington are basically saying “I want to burn this to the ground” and they are right. Like absolutely fuck Trump so hard right now. permalink award report block reply\npatrioticwinning3 15 points 13 hours ago \"The fuck are Americans left with?\"  The bill :p permalink award report block reply MAGABOND 5 points 10 hours ago 🔫 permalink parent award report block reply\nMAGABOND 5 points 10 hours ago 🔫 permalink parent award report block reply\nGreyKnight 13 points 12 hours ago Reminds me of the old saying “Republicans are just democrats doing the speed limit” permalink award report block reply\nRandoBudster 11 points 14 hours ago MTG is the only one with enough balls to talk about it so people say she must be canceled for being unloyal to Trump and now everyones pissed at Trump about it. permalink award report block reply SaltyLandscaper 5 points 12 hours ago She is no better. But she is right on this. permalink parent award report block reply\nSaltyLandscaper 5 points 12 hours ago She is no better. But she is right on this. permalink parent award report block reply\nHumanSomewhere 10 points 13 hours ago Don't make the mistake of making the US like the UK.  When WW3 hits, they are going to have to send vans to yank people off the streets in the UK like they do in Ukraine.  Foreigners say \"I'm so oppressed, this isn't MY country, let the white people fight!\"  White Englishers will say \"you've taken my country away from me and given it to foreigners, let them fight!\"  Nobody is going to feel like they have skin in the game. permalink award report block reply\nutfanx2 9 points 14 hours ago Reservations... We're left in reservations. permalink award report block reply\nmikethemarine 9 points 13 hours ago no they aren't clueless, THEY JUST DON'T FUCKING CARE, they are all for one world order, and the UNITED STATES ARE STANDING IN THEIR WAY permalink award report block reply\nHumblePig 6 points 12 hours ago They're not clueless, they just know there's no alternative; who else we gonna vote for, Democrats? There is no party for us. Trump ran on curbing immigration as his main issue BOTH times. permalink award report block reply\nGentleSlayer 6 points 13 hours ago This is a perfect opportunity for the left to reverse course back to Bernie and Caesar Chavez. I would hands down vote for any leftist I was 100% convinced would reverse the invasion, end H1B, end spousal work visas, end student visas, and deport, deport, deport. I am almost a one-issue voter. I don't even care about creepy perverts in women's locker rooms anymore. Just fix this fucking immigration nightmare. permalink award report block reply MAGABOND 4 points 10 hours ago If Trump can’t be trusted, no one can. This is the end. permalink parent award report block reply Trajano 1 points 32 minutes ago So your position is that somebody from Biden's party will reverse the invasion, end H1B, end spousal work visas, end student visas, and deport, deport, deport? Where have you been in the last 15 years? permalink parent award report block reply\nMAGABOND 4 points 10 hours ago If Trump can’t be trusted, no one can. This is the end. permalink parent award report block reply\nTrajano 1 points 32 minutes ago So your position is that somebody from Biden's party will reverse the invasion, end H1B, end spousal work visas, end student visas, and deport, deport, deport? Where have you been in the last 15 years? permalink parent award report block reply\nneveser 6 points 10 hours ago No, they're not clueless. It's called the Kalergi plan. permalink award report block reply CounterStrike OP 7 points 10 hours ago \"AI\" using  the sources Wikipedia and politifact told me: The Kalergi Plan is a debunked conspiracy theory that falsely claims Richard von Coudenhove-Kalergi, an early 20th-century politician, devised a plot to replace white Europeans with other races through immigration. This theory is rooted in anti-Semitic beliefs and has been widely discredited as a hoax. Clearly this is factual. permalink parent award report block reply axiy 9 points 10 hours ago \"this theory is rooted in anti-Semetism\" they randomly said for no reason. permalink parent award report block reply CounterStrike OP 7 points 9 hours ago I thought that was a nice touch,  kek permalink parent award report block reply\nCounterStrike OP 7 points 10 hours ago \"AI\" using  the sources Wikipedia and politifact told me: The Kalergi Plan is a debunked conspiracy theory that falsely claims Richard von Coudenhove-Kalergi, an early 20th-century politician, devised a plot to replace white Europeans with other races through immigration. This theory is rooted in anti-Semitic beliefs and has been widely discredited as a hoax. Clearly this is factual. permalink parent award report block reply axiy 9 points 10 hours ago \"this theory is rooted in anti-Semetism\" they randomly said for no reason. permalink parent award report block reply CounterStrike OP 7 points 9 hours ago I thought that was a nice touch,  kek permalink parent award report block reply\naxiy 9 points 10 hours ago \"this theory is rooted in anti-Semetism\" they randomly said for no reason. permalink parent award report block reply CounterStrike OP 7 points 9 hours ago I thought that was a nice touch,  kek permalink parent award report block reply\nCounterStrike OP 7 points 9 hours ago I thought that was a nice touch,  kek permalink parent award report block reply\nRandyMoss 4 points 13 hours ago No they aren't. They know how easy it is to lead the stupid football watching masses down the wrong road. Look how many idiots on this site don't like Thomas Massie. Literally the embodiment of MAGA and they get mad at him for voting against Trump's RINO, War Mongering dog shit Biden era bills. permalink award report block reply ThunderGatti 8 points 9 hours ago Massie is a fucking moron. He's good on Israel, that's it. He sucks ass on everything else. He votes open borders every chance he gets, but he is MAGA?? 🤣 He's also an economic retard. He understands absolutely nothing about business and economics permalink parent award report block reply\nThunderGatti 8 points 9 hours ago Massie is a fucking moron. He's good on Israel, that's it. He sucks ass on everything else. He votes open borders every chance he gets, but he is MAGA?? 🤣 He's also an economic retard. He understands absolutely nothing about business and economics permalink parent award report block reply\nRepentnow 2 points 10 hours ago The demoralize and divide plan in full swing. permalink award report block reply\nGontMawr 1 points 16 minutes ago Ok...but why did your relationship with your parents not suffer? This is no MAGA supporter. permalink award report block reply\nCounterStrike OP 1 points 15 hours ago https://x.com/upstatefederlst/status/1988634068641046607 permalink award report block reply\nDEUSVEULT232 1 points 15 hours ago Comment removed by community filter, pending further review. permalink award report block reply"}