{"id": "1ARK9oYZsc", "contents": "102 The latest totally organic script has gone out. posted 13 hours ago by GunToast 39 comments award share download report block\n39 comments Sort by Top Top New Worst Old Save projectarcturus1 14 points 13 hours ago Commies are their talking points. Imagine being this gay. permalink award report block reply possibletower 3 points 11 hours ago This whole psy-ops is part of the Ron DeFaggot 2028 push. It's always an astroturfed campaign like how they bitched and bitched about Amy Coney Barrett more than they ever did against RBG or Sotomayor until Barrett curbstomped Jumanji's ass over the summer so they can no longer attack Trump via Barrett the proxy. These faggots didn't get their precious EBT riots nationwide so they can blame everything on Trump and call him a lame duck so literally one day after Schumer and the Democrats' shutdown crashes and burns like the Hindenberg these so-called \"right wingers\" shift and try to make everybody hate Trump instead of Schumer. permalink parent award report block reply patrioticwinning3 2 points 11 hours ago Speaking of spamming posts this is the 4th time I have seen this post in the last hour!  All by Pro-H1B accounts!   Speaking of \"paying influencers\" did you know they are paying influencers like the pro-H1B OP $3-5k per Pro-H1B post! https://x.com/Will_Panic/status/1988676599303270490 permalink parent award report block reply GayPatriotMAGAUncle 3 points 11 hours ago Not commies, groypers or as I like to call them, gaypers. All of these are woke right accounts, see Fed Fuentes in one of them. The ones posting \"MAGA is silent all of a sudden.\" are the libtard accounts like Jo. permalink parent award report block reply StCharlie 1 points 11 hours ago \"You can not kill an idea\" permalink parent award report block reply DingleBalls 12 points 13 hours ago Fake and gay wedge issue permalink award report block reply BruddahIz 2 points 12 hours ago Disagree - It should be number 1.  The NeoCons will use this to drive the wedge and discourage the hard core based to give up and not show up in 2026.  The fact that the NeoCons love H1B's shows how evil they are - they only want the MAGA movement dead so they can collude with the Deep State and keep thier power/ permalink parent award report block reply texas4ever 1 points 10 hours ago Exactly. Plus people forget quickly just how bad things were and could be again, if we sit it out. permalink parent award report block reply freedom-thinker 0 points 12 hours ago FACT!! permalink parent award report block reply possibletower -2 points 11 hours ago Problem is many \"MAGA\" types are using this so they can push Ron DeFaggot for 2028. / u/DingleBalls is right. Fake and gay wedge issue. Also, Trump isn't wrong. Most of these factories and tech jobs have been shipped overseas since the 1980s and now they are returning to America thanks to Trump making good trade deals with other countries and other foreign companies and U.S. companies. Retards here and on X, however, think that Bob the Antifa BLM fag who lives in his mom's basement (who is an American) can train 100 young early 20-something Americans by himself on how to build TVs and microchips even though we haven't built TVs and chips and many other manufacturing and tech industries for 30-40 years now🤣 permalink parent award report block reply texas4ever 2 points 10 hours ago DeSantis is an excellent governor, would be fine with him as a Senator or something too. I just don't think he can win a Presidential election, Vance is much better suited. He's taller and an excellent speaker/debater. permalink parent award report block reply stagolee -1 points 12 hours ago A wedge is actually a very useful tool.  Disparaging it does not change that fact. permalink parent award report block reply Porkbut 2 points 11 hours ago Says a tool permalink parent award report block reply 556x45mm 8 points 13 hours ago MAGA is the largest political movement since the 70s peace and love folks. permalink award report block reply Aquamine-Amarine 7 points 13 hours ago MAGA is America first though? Who are these fucking morons? permalink award report block reply ReallyGayMods 5 points 12 hours ago People upset that trump is saying america doesn't have the talent and we need to have mass hiring of foreigners. Reasonable opinion for anyone above room temp IQ permalink parent award report block reply GayPatriotMAGAUncle 2 points 11 hours ago So stormfags, libtards, millennial fags, and woke right are big mad Trump isn't giving free jobs to unemployed virgins in their mother's basements because they got an underwater basket weaving degree in college? permalink parent award report block reply ReallyGayMods 1 points 10 hours ago I don't know what half of those are so idk but its just regular trump supporters that are mad, although I'm sure other groups that voted for him are pissed too Its funny though that this website has so many retarded fags on it that they will sit here and tell you that mass H1B imports from India, because \"America doesn't have the talent\", is a actually maga, despite that always being the opposite of maga. I realized years ago that our side also has its fair share of bootlicking retards but its still always shocking seeing how far people on this website will go. Trump could open the border like biden and a lot of this website would pretend like open borders has always been maga and call you a fag for thinking otherwise lmao Trump has bad people in his ear. Its important for us to correct him on big issues. permalink parent award report block reply Cacciali_Via 1 points 4 hours ago It's Indian h1b shills that are swaying the boomers on this site. America has the talent. Trump has never worked for a corporation, he doesn't understand the reality of h1b scams. permalink parent award report block reply possibletower -2 points 11 hours ago Trump isn't wrong. Most of these factories and tech jobs have been shipped overseas since the 1980s and now they are returning to America thanks to Trump making good trade deals with other countries and other foreign companies and U.S. companies. Retards here and on X, however, think that Bob the Antifa BLM fag who lives in his mom's basement (who is an American) can train 100 young early 20-something Americans by himself on how to build TVs and microchips even though we haven't built TVs and chips and many other manufacturing and tech industries for 30-40 years now🤣 permalink parent award report block reply no_antifa 4 points 11 hours ago Lazy copy paste from a retard permalink parent award report block reply ReallyGayMods 1 points 11 hours ago 🤣 youre right my bad, that was stupid of me, we definitely need room temperature IQ foreigners from India to do all of that for us. I actually kind of hope trump opens the border again we need more cheap labor, I think it would be maga if we did that🤣 permalink parent award report block reply texas4ever 1 points 10 hours ago We have a lot of smart people in this country, but what you said is not wrong. So expect the downvotes for speaking the truth. You can't just jump into an industry we've outsourced since 1980 or so and automatically be #1 in the world on day 1. permalink parent award report block reply berserkerbarrage -2 points 11 hours ago What he said was that America is currently slacking in certain industries, that people need to learn and that we can't just take people off the unemployment line and have them start building missiles and batteries, which is true. Not sure why you're worried about H-1B when you're barely qualified to work at McDonald's. permalink parent award report block reply Cacciali_Via 0 points 4 hours ago White kids with engineering degrees are having a hard time finding jobs. Fuck off. permalink parent award report block reply ReallyGayMods 0 points 11 hours ago \"can't just take people off the unemployment line and have them start building missiles and batteries\" Somehow thats an issue, but we can take people from India to do that instead? Explain how that works. Surely it will be easy for someone who is over qualified for McDonalds like yourself permalink parent award report block reply hazelknut 5 points 13 hours ago yeah, but it's definitely not happening here, right guys? permalink award report block reply possibletower -1 points 11 hours ago Trump isn't wrong. Most of these factories and tech jobs have been shipped overseas since the 1980s and now they are returning to America thanks to Trump making good trade deals with other countries and other foreign companies and U.S. companies. Retards here and on X, however, think that Bob the Antifa BLM fag who lives in his mom's basement (who is an American) can train 100 young early 20-something Americans by himself on how to build TVs and microchips even though we haven't built TVs and chips and many other manufacturing and tech industries for 30-40 years now🤣 permalink parent award report block reply no_antifa 1 points 11 hours ago Just keep copying and pasting, retard! permalink parent award report block reply Trumpalorian 4 points 12 hours ago And they're trying to shill and sow discord here. They dont seem to understand that we speak up and make changes within our movement for good. We course correct and argue from time to time. They dont understand anything not dictated to them like a script. The NPC chip swap meme in action. permalink award report block reply possibletower -1 points 11 hours ago Trump isn't wrong. Most of these factories and tech jobs have been shipped overseas since the 1980s and now they are returning to America thanks to Trump making good trade deals with other countries and other foreign companies and U.S. companies. Retards here and on X, however, think that Bob the Antifa BLM fag who lives in his mom's basement (who is an American) can train 100 young early 20-something Americans by himself on how to build TVs and microchips even though we haven't built TVs and chips and many other manufacturing and tech industries for 30-40 years now🤣 permalink parent award report block reply no_antifa 2 points 11 hours ago Copy paste retard permalink parent award report block reply freedom-thinker 2 points 12 hours ago Oh look! there's our friend Nick! permalink award report block reply possibletower 0 points 11 hours ago You mean the pedo fagboi Nick who is Hitler/Stalin First? permalink parent award report block reply GayPatriotMAGAUncle 2 points 11 hours ago Fed Fuentes and a bunch of other Nazi groypers are in this post. Also dumb sluts who are following popular trends. permalink award report block reply Zippythekid 1 points 11 hours ago Tee Hee MAGA will never die, losers. permalink award report block reply texas4ever 1 points 11 hours ago There's a big psyop going on right now. Trump actually said the truth, we like every single country on the planet can benefit and needs SOME foreign talent. TALENT, not cheap H1B workers. We are way ahead of the world in some areas, in other areas we're not, it's ok to put down the false pride and not assume we are automatically better in everything just because. permalink award report block reply julianReyes 0 points 11 hours ago PDW users reporting in in the image. permalink award report block reply\nprojectarcturus1 14 points 13 hours ago Commies are their talking points. Imagine being this gay. permalink award report block reply possibletower 3 points 11 hours ago This whole psy-ops is part of the Ron DeFaggot 2028 push. It's always an astroturfed campaign like how they bitched and bitched about Amy Coney Barrett more than they ever did against RBG or Sotomayor until Barrett curbstomped Jumanji's ass over the summer so they can no longer attack Trump via Barrett the proxy. These faggots didn't get their precious EBT riots nationwide so they can blame everything on Trump and call him a lame duck so literally one day after Schumer and the Democrats' shutdown crashes and burns like the Hindenberg these so-called \"right wingers\" shift and try to make everybody hate Trump instead of Schumer. permalink parent award report block reply patrioticwinning3 2 points 11 hours ago Speaking of spamming posts this is the 4th time I have seen this post in the last hour!  All by Pro-H1B accounts!   Speaking of \"paying influencers\" did you know they are paying influencers like the pro-H1B OP $3-5k per Pro-H1B post! https://x.com/Will_Panic/status/1988676599303270490 permalink parent award report block reply GayPatriotMAGAUncle 3 points 11 hours ago Not commies, groypers or as I like to call them, gaypers. All of these are woke right accounts, see Fed Fuentes in one of them. The ones posting \"MAGA is silent all of a sudden.\" are the libtard accounts like Jo. permalink parent award report block reply StCharlie 1 points 11 hours ago \"You can not kill an idea\" permalink parent award report block reply\npossibletower 3 points 11 hours ago This whole psy-ops is part of the Ron DeFaggot 2028 push. It's always an astroturfed campaign like how they bitched and bitched about Amy Coney Barrett more than they ever did against RBG or Sotomayor until Barrett curbstomped Jumanji's ass over the summer so they can no longer attack Trump via Barrett the proxy. These faggots didn't get their precious EBT riots nationwide so they can blame everything on Trump and call him a lame duck so literally one day after Schumer and the Democrats' shutdown crashes and burns like the Hindenberg these so-called \"right wingers\" shift and try to make everybody hate Trump instead of Schumer. permalink parent award report block reply patrioticwinning3 2 points 11 hours ago Speaking of spamming posts this is the 4th time I have seen this post in the last hour!  All by Pro-H1B accounts!   Speaking of \"paying influencers\" did you know they are paying influencers like the pro-H1B OP $3-5k per Pro-H1B post! https://x.com/Will_Panic/status/1988676599303270490 permalink parent award report block reply\npatrioticwinning3 2 points 11 hours ago Speaking of spamming posts this is the 4th time I have seen this post in the last hour!  All by Pro-H1B accounts!   Speaking of \"paying influencers\" did you know they are paying influencers like the pro-H1B OP $3-5k per Pro-H1B post! https://x.com/Will_Panic/status/1988676599303270490 permalink parent award report block reply\nGayPatriotMAGAUncle 3 points 11 hours ago Not commies, groypers or as I like to call them, gaypers. All of these are woke right accounts, see Fed Fuentes in one of them. The ones posting \"MAGA is silent all of a sudden.\" are the libtard accounts like Jo. permalink parent award report block reply\nStCharlie 1 points 11 hours ago \"You can not kill an idea\" permalink parent award report block reply\nDingleBalls 12 points 13 hours ago Fake and gay wedge issue permalink award report block reply BruddahIz 2 points 12 hours ago Disagree - It should be number 1.  The NeoCons will use this to drive the wedge and discourage the hard core based to give up and not show up in 2026.  The fact that the NeoCons love H1B's shows how evil they are - they only want the MAGA movement dead so they can collude with the Deep State and keep thier power/ permalink parent award report block reply texas4ever 1 points 10 hours ago Exactly. Plus people forget quickly just how bad things were and could be again, if we sit it out. permalink parent award report block reply freedom-thinker 0 points 12 hours ago FACT!! permalink parent award report block reply possibletower -2 points 11 hours ago Problem is many \"MAGA\" types are using this so they can push Ron DeFaggot for 2028. / u/DingleBalls is right. Fake and gay wedge issue. Also, Trump isn't wrong. Most of these factories and tech jobs have been shipped overseas since the 1980s and now they are returning to America thanks to Trump making good trade deals with other countries and other foreign companies and U.S. companies. Retards here and on X, however, think that Bob the Antifa BLM fag who lives in his mom's basement (who is an American) can train 100 young early 20-something Americans by himself on how to build TVs and microchips even though we haven't built TVs and chips and many other manufacturing and tech industries for 30-40 years now🤣 permalink parent award report block reply texas4ever 2 points 10 hours ago DeSantis is an excellent governor, would be fine with him as a Senator or something too. I just don't think he can win a Presidential election, Vance is much better suited. He's taller and an excellent speaker/debater. permalink parent award report block reply stagolee -1 points 12 hours ago A wedge is actually a very useful tool.  Disparaging it does not change that fact. permalink parent award report block reply Porkbut 2 points 11 hours ago Says a tool permalink parent award report block reply\nBruddahIz 2 points 12 hours ago Disagree - It should be number 1.  The NeoCons will use this to drive the wedge and discourage the hard core based to give up and not show up in 2026.  The fact that the NeoCons love H1B's shows how evil they are - they only want the MAGA movement dead so they can collude with the Deep State and keep thier power/ permalink parent award report block reply texas4ever 1 points 10 hours ago Exactly. Plus people forget quickly just how bad things were and could be again, if we sit it out. permalink parent award report block reply freedom-thinker 0 points 12 hours ago FACT!! permalink parent award report block reply possibletower -2 points 11 hours ago Problem is many \"MAGA\" types are using this so they can push Ron DeFaggot for 2028. / u/DingleBalls is right. Fake and gay wedge issue. Also, Trump isn't wrong. Most of these factories and tech jobs have been shipped overseas since the 1980s and now they are returning to America thanks to Trump making good trade deals with other countries and other foreign companies and U.S. companies. Retards here and on X, however, think that Bob the Antifa BLM fag who lives in his mom's basement (who is an American) can train 100 young early 20-something Americans by himself on how to build TVs and microchips even though we haven't built TVs and chips and many other manufacturing and tech industries for 30-40 years now🤣 permalink parent award report block reply texas4ever 2 points 10 hours ago DeSantis is an excellent governor, would be fine with him as a Senator or something too. I just don't think he can win a Presidential election, Vance is much better suited. He's taller and an excellent speaker/debater. permalink parent award report block reply\ntexas4ever 1 points 10 hours ago Exactly. Plus people forget quickly just how bad things were and could be again, if we sit it out. permalink parent award report block reply\nfreedom-thinker 0 points 12 hours ago FACT!! permalink parent award report block reply\npossibletower -2 points 11 hours ago Problem is many \"MAGA\" types are using this so they can push Ron DeFaggot for 2028. / u/DingleBalls is right. Fake and gay wedge issue. Also, Trump isn't wrong. Most of these factories and tech jobs have been shipped overseas since the 1980s and now they are returning to America thanks to Trump making good trade deals with other countries and other foreign companies and U.S. companies. Retards here and on X, however, think that Bob the Antifa BLM fag who lives in his mom's basement (who is an American) can train 100 young early 20-something Americans by himself on how to build TVs and microchips even though we haven't built TVs and chips and many other manufacturing and tech industries for 30-40 years now🤣 permalink parent award report block reply texas4ever 2 points 10 hours ago DeSantis is an excellent governor, would be fine with him as a Senator or something too. I just don't think he can win a Presidential election, Vance is much better suited. He's taller and an excellent speaker/debater. permalink parent award report block reply\ntexas4ever 2 points 10 hours ago DeSantis is an excellent governor, would be fine with him as a Senator or something too. I just don't think he can win a Presidential election, Vance is much better suited. He's taller and an excellent speaker/debater. permalink parent award report block reply\nstagolee -1 points 12 hours ago A wedge is actually a very useful tool.  Disparaging it does not change that fact. permalink parent award report block reply Porkbut 2 points 11 hours ago Says a tool permalink parent award report block reply\nPorkbut 2 points 11 hours ago Says a tool permalink parent award report block reply\n556x45mm 8 points 13 hours ago MAGA is the largest political movement since the 70s peace and love folks. permalink award report block reply\nAquamine-Amarine 7 points 13 hours ago MAGA is America first though? Who are these fucking morons? permalink award report block reply ReallyGayMods 5 points 12 hours ago People upset that trump is saying america doesn't have the talent and we need to have mass hiring of foreigners. Reasonable opinion for anyone above room temp IQ permalink parent award report block reply GayPatriotMAGAUncle 2 points 11 hours ago So stormfags, libtards, millennial fags, and woke right are big mad Trump isn't giving free jobs to unemployed virgins in their mother's basements because they got an underwater basket weaving degree in college? permalink parent award report block reply ReallyGayMods 1 points 10 hours ago I don't know what half of those are so idk but its just regular trump supporters that are mad, although I'm sure other groups that voted for him are pissed too Its funny though that this website has so many retarded fags on it that they will sit here and tell you that mass H1B imports from India, because \"America doesn't have the talent\", is a actually maga, despite that always being the opposite of maga. I realized years ago that our side also has its fair share of bootlicking retards but its still always shocking seeing how far people on this website will go. Trump could open the border like biden and a lot of this website would pretend like open borders has always been maga and call you a fag for thinking otherwise lmao Trump has bad people in his ear. Its important for us to correct him on big issues. permalink parent award report block reply Cacciali_Via 1 points 4 hours ago It's Indian h1b shills that are swaying the boomers on this site. America has the talent. Trump has never worked for a corporation, he doesn't understand the reality of h1b scams. permalink parent award report block reply possibletower -2 points 11 hours ago Trump isn't wrong. Most of these factories and tech jobs have been shipped overseas since the 1980s and now they are returning to America thanks to Trump making good trade deals with other countries and other foreign companies and U.S. companies. Retards here and on X, however, think that Bob the Antifa BLM fag who lives in his mom's basement (who is an American) can train 100 young early 20-something Americans by himself on how to build TVs and microchips even though we haven't built TVs and chips and many other manufacturing and tech industries for 30-40 years now🤣 permalink parent award report block reply no_antifa 4 points 11 hours ago Lazy copy paste from a retard permalink parent award report block reply ReallyGayMods 1 points 11 hours ago 🤣 youre right my bad, that was stupid of me, we definitely need room temperature IQ foreigners from India to do all of that for us. I actually kind of hope trump opens the border again we need more cheap labor, I think it would be maga if we did that🤣 permalink parent award report block reply texas4ever 1 points 10 hours ago We have a lot of smart people in this country, but what you said is not wrong. So expect the downvotes for speaking the truth. You can't just jump into an industry we've outsourced since 1980 or so and automatically be #1 in the world on day 1. permalink parent award report block reply berserkerbarrage -2 points 11 hours ago What he said was that America is currently slacking in certain industries, that people need to learn and that we can't just take people off the unemployment line and have them start building missiles and batteries, which is true. Not sure why you're worried about H-1B when you're barely qualified to work at McDonald's. permalink parent award report block reply Cacciali_Via 0 points 4 hours ago White kids with engineering degrees are having a hard time finding jobs. Fuck off. permalink parent award report block reply ReallyGayMods 0 points 11 hours ago \"can't just take people off the unemployment line and have them start building missiles and batteries\" Somehow thats an issue, but we can take people from India to do that instead? Explain how that works. Surely it will be easy for someone who is over qualified for McDonalds like yourself permalink parent award report block reply\nReallyGayMods 5 points 12 hours ago People upset that trump is saying america doesn't have the talent and we need to have mass hiring of foreigners. Reasonable opinion for anyone above room temp IQ permalink parent award report block reply GayPatriotMAGAUncle 2 points 11 hours ago So stormfags, libtards, millennial fags, and woke right are big mad Trump isn't giving free jobs to unemployed virgins in their mother's basements because they got an underwater basket weaving degree in college? permalink parent award report block reply ReallyGayMods 1 points 10 hours ago I don't know what half of those are so idk but its just regular trump supporters that are mad, although I'm sure other groups that voted for him are pissed too Its funny though that this website has so many retarded fags on it that they will sit here and tell you that mass H1B imports from India, because \"America doesn't have the talent\", is a actually maga, despite that always being the opposite of maga. I realized years ago that our side also has its fair share of bootlicking retards but its still always shocking seeing how far people on this website will go. Trump could open the border like biden and a lot of this website would pretend like open borders has always been maga and call you a fag for thinking otherwise lmao Trump has bad people in his ear. Its important for us to correct him on big issues. permalink parent award report block reply Cacciali_Via 1 points 4 hours ago It's Indian h1b shills that are swaying the boomers on this site. America has the talent. Trump has never worked for a corporation, he doesn't understand the reality of h1b scams. permalink parent award report block reply possibletower -2 points 11 hours ago Trump isn't wrong. Most of these factories and tech jobs have been shipped overseas since the 1980s and now they are returning to America thanks to Trump making good trade deals with other countries and other foreign companies and U.S. companies. Retards here and on X, however, think that Bob the Antifa BLM fag who lives in his mom's basement (who is an American) can train 100 young early 20-something Americans by himself on how to build TVs and microchips even though we haven't built TVs and chips and many other manufacturing and tech industries for 30-40 years now🤣 permalink parent award report block reply no_antifa 4 points 11 hours ago Lazy copy paste from a retard permalink parent award report block reply ReallyGayMods 1 points 11 hours ago 🤣 youre right my bad, that was stupid of me, we definitely need room temperature IQ foreigners from India to do all of that for us. I actually kind of hope trump opens the border again we need more cheap labor, I think it would be maga if we did that🤣 permalink parent award report block reply texas4ever 1 points 10 hours ago We have a lot of smart people in this country, but what you said is not wrong. So expect the downvotes for speaking the truth. You can't just jump into an industry we've outsourced since 1980 or so and automatically be #1 in the world on day 1. permalink parent award report block reply berserkerbarrage -2 points 11 hours ago What he said was that America is currently slacking in certain industries, that people need to learn and that we can't just take people off the unemployment line and have them start building missiles and batteries, which is true. Not sure why you're worried about H-1B when you're barely qualified to work at McDonald's. permalink parent award report block reply Cacciali_Via 0 points 4 hours ago White kids with engineering degrees are having a hard time finding jobs. Fuck off. permalink parent award report block reply ReallyGayMods 0 points 11 hours ago \"can't just take people off the unemployment line and have them start building missiles and batteries\" Somehow thats an issue, but we can take people from India to do that instead? Explain how that works. Surely it will be easy for someone who is over qualified for McDonalds like yourself permalink parent award report block reply\nGayPatriotMAGAUncle 2 points 11 hours ago So stormfags, libtards, millennial fags, and woke right are big mad Trump isn't giving free jobs to unemployed virgins in their mother's basements because they got an underwater basket weaving degree in college? permalink parent award report block reply ReallyGayMods 1 points 10 hours ago I don't know what half of those are so idk but its just regular trump supporters that are mad, although I'm sure other groups that voted for him are pissed too Its funny though that this website has so many retarded fags on it that they will sit here and tell you that mass H1B imports from India, because \"America doesn't have the talent\", is a actually maga, despite that always being the opposite of maga. I realized years ago that our side also has its fair share of bootlicking retards but its still always shocking seeing how far people on this website will go. Trump could open the border like biden and a lot of this website would pretend like open borders has always been maga and call you a fag for thinking otherwise lmao Trump has bad people in his ear. Its important for us to correct him on big issues. permalink parent award report block reply Cacciali_Via 1 points 4 hours ago It's Indian h1b shills that are swaying the boomers on this site. America has the talent. Trump has never worked for a corporation, he doesn't understand the reality of h1b scams. permalink parent award report block reply\nReallyGayMods 1 points 10 hours ago I don't know what half of those are so idk but its just regular trump supporters that are mad, although I'm sure other groups that voted for him are pissed too Its funny though that this website has so many retarded fags on it that they will sit here and tell you that mass H1B imports from India, because \"America doesn't have the talent\", is a actually maga, despite that always being the opposite of maga. I realized years ago that our side also has its fair share of bootlicking retards but its still always shocking seeing how far people on this website will go. Trump could open the border like biden and a lot of this website would pretend like open borders has always been maga and call you a fag for thinking otherwise lmao Trump has bad people in his ear. Its important for us to correct him on big issues. permalink parent award report block reply Cacciali_Via 1 points 4 hours ago It's Indian h1b shills that are swaying the boomers on this site. America has the talent. Trump has never worked for a corporation, he doesn't understand the reality of h1b scams. permalink parent award report block reply\nCacciali_Via 1 points 4 hours ago It's Indian h1b shills that are swaying the boomers on this site. America has the talent. Trump has never worked for a corporation, he doesn't understand the reality of h1b scams. permalink parent award report block reply\npossibletower -2 points 11 hours ago Trump isn't wrong. Most of these factories and tech jobs have been shipped overseas since the 1980s and now they are returning to America thanks to Trump making good trade deals with other countries and other foreign companies and U.S. companies. Retards here and on X, however, think that Bob the Antifa BLM fag who lives in his mom's basement (who is an American) can train 100 young early 20-something Americans by himself on how to build TVs and microchips even though we haven't built TVs and chips and many other manufacturing and tech industries for 30-40 years now🤣 permalink parent award report block reply no_antifa 4 points 11 hours ago Lazy copy paste from a retard permalink parent award report block reply ReallyGayMods 1 points 11 hours ago 🤣 youre right my bad, that was stupid of me, we definitely need room temperature IQ foreigners from India to do all of that for us. I actually kind of hope trump opens the border again we need more cheap labor, I think it would be maga if we did that🤣 permalink parent award report block reply texas4ever 1 points 10 hours ago We have a lot of smart people in this country, but what you said is not wrong. So expect the downvotes for speaking the truth. You can't just jump into an industry we've outsourced since 1980 or so and automatically be #1 in the world on day 1. permalink parent award report block reply\nno_antifa 4 points 11 hours ago Lazy copy paste from a retard permalink parent award report block reply\nReallyGayMods 1 points 11 hours ago 🤣 youre right my bad, that was stupid of me, we definitely need room temperature IQ foreigners from India to do all of that for us. I actually kind of hope trump opens the border again we need more cheap labor, I think it would be maga if we did that🤣 permalink parent award report block reply\ntexas4ever 1 points 10 hours ago We have a lot of smart people in this country, but what you said is not wrong. So expect the downvotes for speaking the truth. You can't just jump into an industry we've outsourced since 1980 or so and automatically be #1 in the world on day 1. permalink parent award report block reply\nberserkerbarrage -2 points 11 hours ago What he said was that America is currently slacking in certain industries, that people need to learn and that we can't just take people off the unemployment line and have them start building missiles and batteries, which is true. Not sure why you're worried about H-1B when you're barely qualified to work at McDonald's. permalink parent award report block reply Cacciali_Via 0 points 4 hours ago White kids with engineering degrees are having a hard time finding jobs. Fuck off. permalink parent award report block reply ReallyGayMods 0 points 11 hours ago \"can't just take people off the unemployment line and have them start building missiles and batteries\" Somehow thats an issue, but we can take people from India to do that instead? Explain how that works. Surely it will be easy for someone who is over qualified for McDonalds like yourself permalink parent award report block reply\nCacciali_Via 0 points 4 hours ago White kids with engineering degrees are having a hard time finding jobs. Fuck off. permalink parent award report block reply\nReallyGayMods 0 points 11 hours ago \"can't just take people off the unemployment line and have them start building missiles and batteries\" Somehow thats an issue, but we can take people from India to do that instead? Explain how that works. Surely it will be easy for someone who is over qualified for McDonalds like yourself permalink parent award report block reply\nhazelknut 5 points 13 hours ago yeah, but it's definitely not happening here, right guys? permalink award report block reply possibletower -1 points 11 hours ago Trump isn't wrong. Most of these factories and tech jobs have been shipped overseas since the 1980s and now they are returning to America thanks to Trump making good trade deals with other countries and other foreign companies and U.S. companies. Retards here and on X, however, think that Bob the Antifa BLM fag who lives in his mom's basement (who is an American) can train 100 young early 20-something Americans by himself on how to build TVs and microchips even though we haven't built TVs and chips and many other manufacturing and tech industries for 30-40 years now🤣 permalink parent award report block reply no_antifa 1 points 11 hours ago Just keep copying and pasting, retard! permalink parent award report block reply\npossibletower -1 points 11 hours ago Trump isn't wrong. Most of these factories and tech jobs have been shipped overseas since the 1980s and now they are returning to America thanks to Trump making good trade deals with other countries and other foreign companies and U.S. companies. Retards here and on X, however, think that Bob the Antifa BLM fag who lives in his mom's basement (who is an American) can train 100 young early 20-something Americans by himself on how to build TVs and microchips even though we haven't built TVs and chips and many other manufacturing and tech industries for 30-40 years now🤣 permalink parent award report block reply no_antifa 1 points 11 hours ago Just keep copying and pasting, retard! permalink parent award report block reply\nno_antifa 1 points 11 hours ago Just keep copying and pasting, retard! permalink parent award report block reply\nTrumpalorian 4 points 12 hours ago And they're trying to shill and sow discord here. They dont seem to understand that we speak up and make changes within our movement for good. We course correct and argue from time to time. They dont understand anything not dictated to them like a script. The NPC chip swap meme in action. permalink award report block reply possibletower -1 points 11 hours ago Trump isn't wrong. Most of these factories and tech jobs have been shipped overseas since the 1980s and now they are returning to America thanks to Trump making good trade deals with other countries and other foreign companies and U.S. companies. Retards here and on X, however, think that Bob the Antifa BLM fag who lives in his mom's basement (who is an American) can train 100 young early 20-something Americans by himself on how to build TVs and microchips even though we haven't built TVs and chips and many other manufacturing and tech industries for 30-40 years now🤣 permalink parent award report block reply no_antifa 2 points 11 hours ago Copy paste retard permalink parent award report block reply\npossibletower -1 points 11 hours ago Trump isn't wrong. Most of these factories and tech jobs have been shipped overseas since the 1980s and now they are returning to America thanks to Trump making good trade deals with other countries and other foreign companies and U.S. companies. Retards here and on X, however, think that Bob the Antifa BLM fag who lives in his mom's basement (who is an American) can train 100 young early 20-something Americans by himself on how to build TVs and microchips even though we haven't built TVs and chips and many other manufacturing and tech industries for 30-40 years now🤣 permalink parent award report block reply no_antifa 2 points 11 hours ago Copy paste retard permalink parent award report block reply\nno_antifa 2 points 11 hours ago Copy paste retard permalink parent award report block reply\nfreedom-thinker 2 points 12 hours ago Oh look! there's our friend Nick! permalink award report block reply possibletower 0 points 11 hours ago You mean the pedo fagboi Nick who is Hitler/Stalin First? permalink parent award report block reply\npossibletower 0 points 11 hours ago You mean the pedo fagboi Nick who is Hitler/Stalin First? permalink parent award report block reply\nGayPatriotMAGAUncle 2 points 11 hours ago Fed Fuentes and a bunch of other Nazi groypers are in this post. Also dumb sluts who are following popular trends. permalink award report block reply\nZippythekid 1 points 11 hours ago Tee Hee MAGA will never die, losers. permalink award report block reply\ntexas4ever 1 points 11 hours ago There's a big psyop going on right now. Trump actually said the truth, we like every single country on the planet can benefit and needs SOME foreign talent. TALENT, not cheap H1B workers. We are way ahead of the world in some areas, in other areas we're not, it's ok to put down the false pride and not assume we are automatically better in everything just because. permalink award report block reply\njulianReyes 0 points 11 hours ago PDW users reporting in in the image. permalink award report block reply"}