{"id": "1ARK9mHmlz", "contents": "16 NEW - Trump sends a letter to President Herzog formally asking him to pardon Netanyahu. (t.me) posted 11 hours ago by TrumpCare 6 comments award share report block Disclose.tv NEW - Trump sends a letter to President Herzog formally asking him to pardon Netanyahu.Read more: https://www.disclose.tv/id/nrbnph1ft6/@disclosetv t.me\n6 comments Sort by Top Top New Worst Old Save T471 8 points 10 hours ago Susan L. Wiles is AIPAC handler for Trump and worked for Netanyahu prior. permalink award report block reply JoeBidensDementia1 8 points 11 hours ago Trump is losing it. permalink award report block reply BerettaStroker 7 points 11 hours ago Is Tina Peters still in jail? permalink award report block reply Bazhosh 5 points 10 hours ago Trump is getting more ridiculous by the day. Netanyahu has a warrant by the ICJ for War crimes and Crimes against humanity and he begs for his pardon?! What on earth has Netanyahu on Trump? permalink award report block reply Lurker404 3 points 10 hours ago I guess Trump was in the Epstein files after all. All he cares about now is Israel and India. permalink award report block reply Secondrun007 1 points 11 hours ago It's the same as the democrats' US witch-hunt. permalink award report block reply\nT471 8 points 10 hours ago Susan L. Wiles is AIPAC handler for Trump and worked for Netanyahu prior. permalink award report block reply\nJoeBidensDementia1 8 points 11 hours ago Trump is losing it. permalink award report block reply\nBerettaStroker 7 points 11 hours ago Is Tina Peters still in jail? permalink award report block reply\nBazhosh 5 points 10 hours ago Trump is getting more ridiculous by the day. Netanyahu has a warrant by the ICJ for War crimes and Crimes against humanity and he begs for his pardon?! What on earth has Netanyahu on Trump? permalink award report block reply\nLurker404 3 points 10 hours ago I guess Trump was in the Epstein files after all. All he cares about now is Israel and India. permalink award report block reply\nSecondrun007 1 points 11 hours ago It's the same as the democrats' US witch-hunt. permalink award report block reply"}