{"id": "1ARK9mG8Tl", "contents": "91 I've thought the exact same thing actually. AI is already killing only fans. You love to see it. posted 20 hours ago by PatriotSam 47 comments award share report block Fuentes Updates @FuentesUpdates • 1d Nick Fuentes says AI sex robots are going to be the greatest thing mankind has ever created 😂 “Women are gonna be fucked… Everyone will prefer the robots over them, and they'll have to start acting nice again.”\n47 comments Sort by Top Top New Worst Old Save Around the Web Hair Grows Back in A Few Days! At Any Stage of Baldness HaloGrow Prandogolio 10 points 20 hours ago Gross. Men need Jesus, not AI sex robots. permalink award report block reply BenDoverAssho 4 points 20 hours ago True, but a robot can't take you to court and get most of your money and other assets, and can't take your children away from you.\nDivorce court totally fucks the man over. Marriage is a huge gamble for men. 50% lose their ass. permalink parent award report block reply I_Love_45-70_Gov 5 points 20 hours ago but a robot can't take you to court and get most of your money and other assets... ...not right at this moment. permalink parent award report block reply Prandogolio 2 points 20 hours ago Yes I know that all too well.  We need to fix the laws that make divorce so easy for women to initiate and make it so financially devastating for men. permalink parent award report block reply PatriotSam OP 3 points 20 hours ago Agree, but only fans will not die unless there's an alternative. And in this case we have an alternative that will completely put the whores out of business. And then they'll have to get real jobs again. This will in turn, increase their value somewhat. It's not really sexy for women to have jobs, but it's better for a woman to have a job than to be a prostitute. permalink parent award report block reply MAGA9428 -1 points 19 hours ago I disagree, I'd rather them be prostitutes. Actual prostitutes though. Not scam artists fleecing men out of their money while providing no real intimacy. I believe in what Martin Luther said... \"Women were made to either be wives or prostitutes.\" permalink parent award report block reply PatriotSam OP 0 points 6 hours ago He really said that? Lmao permalink parent award report block reply medicpatriot 1 points 19 hours ago It’s called a joke, boomer. permalink parent award report block reply Prandogolio 2 points 11 hours ago Jokes can be gross, faggot. permalink parent award report block reply MAGA9428 9 points 20 hours ago I’ve thought this many times myself. We need these AI robots to come out badly because women are in desperate need of a fucking ego check. permalink award report block reply PatriotSam OP 5 points 20 hours ago 100% agreed. Social media gases women way too much. Once Instagram and Facebook came into the picture it was over. These dudes like the shittiest selfies and these girls start thinking they're models because of it. permalink parent award report block reply BarrysOFace 1 points 19 hours ago The traditional solution is don't be a gooner faggot and control yourself. It actually works.... permalink parent award report block reply Cacciali_Via 0 points 13 hours ago Really? It put o.f. out of business already? I don't think I know a single person that has ever paid a penny to these women, but it seems there are tens of millions of them. permalink parent award report block reply Hambonemcgee 0 points 12 hours ago Men are ashamed to admit it, most likely.  I know I wouldn't. permalink parent award report block reply AlexJonesIsRight 6 points 20 hours ago It will be awesome in the fact that it defeats third wave and probably second and maybe even first wave feminism. It will be terrible in the generation of men that it costs us. Do not be short sighted put your faith upon the LORD. You don't need a robot to jack you off. You have a wife. Together you'll make great things. I was a red piller, that site was amazing on reddit taught me how to be a man. So be a man and get a real relationship with 0 lies. You'll thank me later as your children catapult through everything that is fake and gay. Before you ask I'm a Christian. Read EVERY VERSE and apply it to you. It's easy for me because I was in a \"repressive\" household that made me learn it. It's my greatest treasure today. I wouldn't trade 100 million dollars for it. permalink award report block reply chickeninoven 3 points 20 hours ago So be a man and get a real relationship with 0 lies. So.. a relationship with a sex robot? permalink parent award report block reply AlexJonesIsRight 3 points 20 hours ago No the the acovenant of marriage as Christ tells us. You are clearly not a Christian, so you will never understand. Read the Bible or else you're Nothing but a mud slinger Muslim who demands a slave. You are called to a much higher purpose... to raise  new generation of Americans. You claim to be America first, but instead you glorify your maturation fantasy. Either become or man or Jack off like a pubescent child for your whole life. The globalist want you to be like that. Instead be a real man. permalink parent award report block reply AlexJonesIsRight 3 points 20 hours ago I'll reply again, what are the men that literature praise? What is the difference between you and the greats. They sacrificed for something greater. Do you think William Wallace fought the English to jack himself off? Lol sheep, become a lion. permalink parent award report block reply AlexJonesIsRight -2 points 19 hours ago Here I know you're not a Christian so let me put this plain for you. If you aren't altruistic, and being man enough to lead. By all means jack yourself off forever and  you will own nothing and YOU WILL LOVE IT. you're already begging for it. Go ahead I'll call it a waifu tax. You selfish non leader. No one will remember you. What I built will remember me. I'm going to edit this for you which you won't read. You listen to Nick Fuentes and long for maturation bots.... I'll ask you do you know who owns all the port sites?? You're falling into the very trap you claim to not fall into. You. Are. Weak. Educate yourself. permalink parent award report block reply canadianhere 5 points 20 hours ago Futurama predicted this. permalink award report block reply PatriotSam OP 4 points 20 hours ago \"no thanks Mom I'm going to make out with my monroebot!\" permalink parent award report block reply SubmarineGuy 5 points 20 hours ago Death by Snusnu! permalink award report block reply PatriotSam OP 1 points 20 hours ago Lmao permalink parent award report block reply Apersonofinterest 3 points 20 hours ago The America First guy says we are going to elect Andrew Tate for president. Last time I checked, Tate is not a US citizen. permalink award report block reply medicpatriot 3 points 19 hours ago It’s called a joke, boomer. permalink parent award report block reply Apersonofinterest -1 points 19 hours ago Jokes are supposed to be funny. I'm too young to be a boomer. permalink parent award report block reply PatriotSam OP 2 points 20 hours ago I wish we could though permalink parent award report block reply Big_dick_cheney 2 points 8 hours ago Bro is a virgin I’m so sick of hearing from this little fag permalink award report block reply PatriotSam OP 0 points 7 hours ago I haven't heard him talk about being a virgin for a while actually. Think he finally got famous enough to fix that problem. permalink parent award report block reply medicpatriot 2 points 19 hours ago In before the boomers can’t take a joke. permalink award report block reply onesummerdream 2 points 11 hours ago Oh look, another end around assault on traditional values. Don’t get married, don’t have children, isolate yourself from human interaction, but be sure to post your relationship on social media … it’s all good … and what makes Nickyboy think that there won’t be robots, AI, VR for women? 2 Timothy 3:1-5 permalink award report block reply SpeekFreely 1 points 20 hours ago Why do ya’ll think prostitution hasn’t been legalized ? permalink award report block reply PatriotSam OP 7 points 20 hours ago Because it's disgusting and against God. permalink parent award report block reply chickeninoven 2 points 20 hours ago Weird. The line of Judah sprung forth when his daughter-in-law disguised herself as a prostitute and seduced him. permalink parent award report block reply sordfysh PRO 0 points 19 hours ago Weird fact, but it checks out. For what it's worth, it was his widowed daughter-in-law, and IIRC, Judah's other son had refused his duty, and Judah was trying to ignore her plight. She did a pretty clever thing, and she was righteous for doing the thing. permalink parent award report block reply SpeekFreely 0 points 20 hours ago We’re all born as sinners aren’t we ? permalink parent award report block reply PatriotSam OP 4 points 20 hours ago Yes, but there are those that live in sin and those that try to rise above it. permalink parent award report block reply AlexJonesIsRight 2 points 19 hours ago You're on the right path read my comments brother. Never cease to be a real man. permalink parent award report block reply dburt2 1 points 18 hours ago This guy is full of shit. permalink award report block reply Stlpoolguy 1 points 19 hours ago Omg!  This is the funniest thing I've heard in a long time permalink award report block reply tingo999 1 points 19 hours ago You gotta stop posting this retards opinions. permalink award report block reply deepbake 1 points 19 hours ago OnlyGANS permalink award report block reply delnaga 0 points 19 hours ago I’m ok with it. permalink award report block reply RINO_fatigue -4 points 20 hours ago Nick Fuentes shilling porno and masturbation degeneracy how low can this site sink permalink award report block reply Prandogolio 0 points 20 hours ago how low can this site sink Well, for example, I've literally just been taking the dumbest fucking posts I could find that have nothing to do with MAGA from c/funny today and reposting them here all day, and every post is getting tons of upvotes. permalink parent award report block reply PatriotSam OP 2 points 20 hours ago People seem to be burnt out on politics. We are reverting back to cat video internet days. permalink parent award report block reply Wilfuu 0 points 17 hours ago Comment removed by community moderators. permalink award report block reply\nPrandogolio 10 points 20 hours ago Gross. Men need Jesus, not AI sex robots. permalink award report block reply BenDoverAssho 4 points 20 hours ago True, but a robot can't take you to court and get most of your money and other assets, and can't take your children away from you.\nDivorce court totally fucks the man over. Marriage is a huge gamble for men. 50% lose their ass. permalink parent award report block reply I_Love_45-70_Gov 5 points 20 hours ago but a robot can't take you to court and get most of your money and other assets... ...not right at this moment. permalink parent award report block reply Prandogolio 2 points 20 hours ago Yes I know that all too well.  We need to fix the laws that make divorce so easy for women to initiate and make it so financially devastating for men. permalink parent award report block reply PatriotSam OP 3 points 20 hours ago Agree, but only fans will not die unless there's an alternative. And in this case we have an alternative that will completely put the whores out of business. And then they'll have to get real jobs again. This will in turn, increase their value somewhat. It's not really sexy for women to have jobs, but it's better for a woman to have a job than to be a prostitute. permalink parent award report block reply MAGA9428 -1 points 19 hours ago I disagree, I'd rather them be prostitutes. Actual prostitutes though. Not scam artists fleecing men out of their money while providing no real intimacy. I believe in what Martin Luther said... \"Women were made to either be wives or prostitutes.\" permalink parent award report block reply PatriotSam OP 0 points 6 hours ago He really said that? Lmao permalink parent award report block reply medicpatriot 1 points 19 hours ago It’s called a joke, boomer. permalink parent award report block reply Prandogolio 2 points 11 hours ago Jokes can be gross, faggot. permalink parent award report block reply\nBenDoverAssho 4 points 20 hours ago True, but a robot can't take you to court and get most of your money and other assets, and can't take your children away from you.\nDivorce court totally fucks the man over. Marriage is a huge gamble for men. 50% lose their ass. permalink parent award report block reply I_Love_45-70_Gov 5 points 20 hours ago but a robot can't take you to court and get most of your money and other assets... ...not right at this moment. permalink parent award report block reply Prandogolio 2 points 20 hours ago Yes I know that all too well.  We need to fix the laws that make divorce so easy for women to initiate and make it so financially devastating for men. permalink parent award report block reply\nI_Love_45-70_Gov 5 points 20 hours ago but a robot can't take you to court and get most of your money and other assets... ...not right at this moment. permalink parent award report block reply\nPrandogolio 2 points 20 hours ago Yes I know that all too well.  We need to fix the laws that make divorce so easy for women to initiate and make it so financially devastating for men. permalink parent award report block reply\nPatriotSam OP 3 points 20 hours ago Agree, but only fans will not die unless there's an alternative. And in this case we have an alternative that will completely put the whores out of business. And then they'll have to get real jobs again. This will in turn, increase their value somewhat. It's not really sexy for women to have jobs, but it's better for a woman to have a job than to be a prostitute. permalink parent award report block reply MAGA9428 -1 points 19 hours ago I disagree, I'd rather them be prostitutes. Actual prostitutes though. Not scam artists fleecing men out of their money while providing no real intimacy. I believe in what Martin Luther said... \"Women were made to either be wives or prostitutes.\" permalink parent award report block reply PatriotSam OP 0 points 6 hours ago He really said that? Lmao permalink parent award report block reply\nMAGA9428 -1 points 19 hours ago I disagree, I'd rather them be prostitutes. Actual prostitutes though. Not scam artists fleecing men out of their money while providing no real intimacy. I believe in what Martin Luther said... \"Women were made to either be wives or prostitutes.\" permalink parent award report block reply PatriotSam OP 0 points 6 hours ago He really said that? Lmao permalink parent award report block reply\nPatriotSam OP 0 points 6 hours ago He really said that? Lmao permalink parent award report block reply\nmedicpatriot 1 points 19 hours ago It’s called a joke, boomer. permalink parent award report block reply Prandogolio 2 points 11 hours ago Jokes can be gross, faggot. permalink parent award report block reply\nPrandogolio 2 points 11 hours ago Jokes can be gross, faggot. permalink parent award report block reply\nMAGA9428 9 points 20 hours ago I’ve thought this many times myself. We need these AI robots to come out badly because women are in desperate need of a fucking ego check. permalink award report block reply PatriotSam OP 5 points 20 hours ago 100% agreed. Social media gases women way too much. Once Instagram and Facebook came into the picture it was over. These dudes like the shittiest selfies and these girls start thinking they're models because of it. permalink parent award report block reply BarrysOFace 1 points 19 hours ago The traditional solution is don't be a gooner faggot and control yourself. It actually works.... permalink parent award report block reply Cacciali_Via 0 points 13 hours ago Really? It put o.f. out of business already? I don't think I know a single person that has ever paid a penny to these women, but it seems there are tens of millions of them. permalink parent award report block reply Hambonemcgee 0 points 12 hours ago Men are ashamed to admit it, most likely.  I know I wouldn't. permalink parent award report block reply\nPatriotSam OP 5 points 20 hours ago 100% agreed. Social media gases women way too much. Once Instagram and Facebook came into the picture it was over. These dudes like the shittiest selfies and these girls start thinking they're models because of it. permalink parent award report block reply\nBarrysOFace 1 points 19 hours ago The traditional solution is don't be a gooner faggot and control yourself. It actually works.... permalink parent award report block reply Cacciali_Via 0 points 13 hours ago Really? It put o.f. out of business already? I don't think I know a single person that has ever paid a penny to these women, but it seems there are tens of millions of them. permalink parent award report block reply Hambonemcgee 0 points 12 hours ago Men are ashamed to admit it, most likely.  I know I wouldn't. permalink parent award report block reply\nCacciali_Via 0 points 13 hours ago Really? It put o.f. out of business already? I don't think I know a single person that has ever paid a penny to these women, but it seems there are tens of millions of them. permalink parent award report block reply Hambonemcgee 0 points 12 hours ago Men are ashamed to admit it, most likely.  I know I wouldn't. permalink parent award report block reply\nHambonemcgee 0 points 12 hours ago Men are ashamed to admit it, most likely.  I know I wouldn't. permalink parent award report block reply\nAlexJonesIsRight 6 points 20 hours ago It will be awesome in the fact that it defeats third wave and probably second and maybe even first wave feminism. It will be terrible in the generation of men that it costs us. Do not be short sighted put your faith upon the LORD. You don't need a robot to jack you off. You have a wife. Together you'll make great things. I was a red piller, that site was amazing on reddit taught me how to be a man. So be a man and get a real relationship with 0 lies. You'll thank me later as your children catapult through everything that is fake and gay. Before you ask I'm a Christian. Read EVERY VERSE and apply it to you. It's easy for me because I was in a \"repressive\" household that made me learn it. It's my greatest treasure today. I wouldn't trade 100 million dollars for it. permalink award report block reply chickeninoven 3 points 20 hours ago So be a man and get a real relationship with 0 lies. So.. a relationship with a sex robot? permalink parent award report block reply AlexJonesIsRight 3 points 20 hours ago No the the acovenant of marriage as Christ tells us. You are clearly not a Christian, so you will never understand. Read the Bible or else you're Nothing but a mud slinger Muslim who demands a slave. You are called to a much higher purpose... to raise  new generation of Americans. You claim to be America first, but instead you glorify your maturation fantasy. Either become or man or Jack off like a pubescent child for your whole life. The globalist want you to be like that. Instead be a real man. permalink parent award report block reply AlexJonesIsRight 3 points 20 hours ago I'll reply again, what are the men that literature praise? What is the difference between you and the greats. They sacrificed for something greater. Do you think William Wallace fought the English to jack himself off? Lol sheep, become a lion. permalink parent award report block reply AlexJonesIsRight -2 points 19 hours ago Here I know you're not a Christian so let me put this plain for you. If you aren't altruistic, and being man enough to lead. By all means jack yourself off forever and  you will own nothing and YOU WILL LOVE IT. you're already begging for it. Go ahead I'll call it a waifu tax. You selfish non leader. No one will remember you. What I built will remember me. I'm going to edit this for you which you won't read. You listen to Nick Fuentes and long for maturation bots.... I'll ask you do you know who owns all the port sites?? You're falling into the very trap you claim to not fall into. You. Are. Weak. Educate yourself. permalink parent award report block reply\nchickeninoven 3 points 20 hours ago So be a man and get a real relationship with 0 lies. So.. a relationship with a sex robot? permalink parent award report block reply AlexJonesIsRight 3 points 20 hours ago No the the acovenant of marriage as Christ tells us. You are clearly not a Christian, so you will never understand. Read the Bible or else you're Nothing but a mud slinger Muslim who demands a slave. You are called to a much higher purpose... to raise  new generation of Americans. You claim to be America first, but instead you glorify your maturation fantasy. Either become or man or Jack off like a pubescent child for your whole life. The globalist want you to be like that. Instead be a real man. permalink parent award report block reply AlexJonesIsRight 3 points 20 hours ago I'll reply again, what are the men that literature praise? What is the difference between you and the greats. They sacrificed for something greater. Do you think William Wallace fought the English to jack himself off? Lol sheep, become a lion. permalink parent award report block reply AlexJonesIsRight -2 points 19 hours ago Here I know you're not a Christian so let me put this plain for you. If you aren't altruistic, and being man enough to lead. By all means jack yourself off forever and  you will own nothing and YOU WILL LOVE IT. you're already begging for it. Go ahead I'll call it a waifu tax. You selfish non leader. No one will remember you. What I built will remember me. I'm going to edit this for you which you won't read. You listen to Nick Fuentes and long for maturation bots.... I'll ask you do you know who owns all the port sites?? You're falling into the very trap you claim to not fall into. You. Are. Weak. Educate yourself. permalink parent award report block reply\nAlexJonesIsRight 3 points 20 hours ago No the the acovenant of marriage as Christ tells us. You are clearly not a Christian, so you will never understand. Read the Bible or else you're Nothing but a mud slinger Muslim who demands a slave. You are called to a much higher purpose... to raise  new generation of Americans. You claim to be America first, but instead you glorify your maturation fantasy. Either become or man or Jack off like a pubescent child for your whole life. The globalist want you to be like that. Instead be a real man. permalink parent award report block reply AlexJonesIsRight 3 points 20 hours ago I'll reply again, what are the men that literature praise? What is the difference between you and the greats. They sacrificed for something greater. Do you think William Wallace fought the English to jack himself off? Lol sheep, become a lion. permalink parent award report block reply\nAlexJonesIsRight 3 points 20 hours ago I'll reply again, what are the men that literature praise? What is the difference between you and the greats. They sacrificed for something greater. Do you think William Wallace fought the English to jack himself off? Lol sheep, become a lion. permalink parent award report block reply\nAlexJonesIsRight -2 points 19 hours ago Here I know you're not a Christian so let me put this plain for you. If you aren't altruistic, and being man enough to lead. By all means jack yourself off forever and  you will own nothing and YOU WILL LOVE IT. you're already begging for it. Go ahead I'll call it a waifu tax. You selfish non leader. No one will remember you. What I built will remember me. I'm going to edit this for you which you won't read. You listen to Nick Fuentes and long for maturation bots.... I'll ask you do you know who owns all the port sites?? You're falling into the very trap you claim to not fall into. You. Are. Weak. Educate yourself. permalink parent award report block reply\ncanadianhere 5 points 20 hours ago Futurama predicted this. permalink award report block reply PatriotSam OP 4 points 20 hours ago \"no thanks Mom I'm going to make out with my monroebot!\" permalink parent award report block reply\nPatriotSam OP 4 points 20 hours ago \"no thanks Mom I'm going to make out with my monroebot!\" permalink parent award report block reply\nSubmarineGuy 5 points 20 hours ago Death by Snusnu! permalink award report block reply PatriotSam OP 1 points 20 hours ago Lmao permalink parent award report block reply\nPatriotSam OP 1 points 20 hours ago Lmao permalink parent award report block reply\nApersonofinterest 3 points 20 hours ago The America First guy says we are going to elect Andrew Tate for president. Last time I checked, Tate is not a US citizen. permalink award report block reply medicpatriot 3 points 19 hours ago It’s called a joke, boomer. permalink parent award report block reply Apersonofinterest -1 points 19 hours ago Jokes are supposed to be funny. I'm too young to be a boomer. permalink parent award report block reply PatriotSam OP 2 points 20 hours ago I wish we could though permalink parent award report block reply\nmedicpatriot 3 points 19 hours ago It’s called a joke, boomer. permalink parent award report block reply Apersonofinterest -1 points 19 hours ago Jokes are supposed to be funny. I'm too young to be a boomer. permalink parent award report block reply\nApersonofinterest -1 points 19 hours ago Jokes are supposed to be funny. I'm too young to be a boomer. permalink parent award report block reply\nPatriotSam OP 2 points 20 hours ago I wish we could though permalink parent award report block reply\nBig_dick_cheney 2 points 8 hours ago Bro is a virgin I’m so sick of hearing from this little fag permalink award report block reply PatriotSam OP 0 points 7 hours ago I haven't heard him talk about being a virgin for a while actually. Think he finally got famous enough to fix that problem. permalink parent award report block reply\nPatriotSam OP 0 points 7 hours ago I haven't heard him talk about being a virgin for a while actually. Think he finally got famous enough to fix that problem. permalink parent award report block reply\nmedicpatriot 2 points 19 hours ago In before the boomers can’t take a joke. permalink award report block reply\nonesummerdream 2 points 11 hours ago Oh look, another end around assault on traditional values. Don’t get married, don’t have children, isolate yourself from human interaction, but be sure to post your relationship on social media … it’s all good … and what makes Nickyboy think that there won’t be robots, AI, VR for women? 2 Timothy 3:1-5 permalink award report block reply\nSpeekFreely 1 points 20 hours ago Why do ya’ll think prostitution hasn’t been legalized ? permalink award report block reply PatriotSam OP 7 points 20 hours ago Because it's disgusting and against God. permalink parent award report block reply chickeninoven 2 points 20 hours ago Weird. The line of Judah sprung forth when his daughter-in-law disguised herself as a prostitute and seduced him. permalink parent award report block reply sordfysh PRO 0 points 19 hours ago Weird fact, but it checks out. For what it's worth, it was his widowed daughter-in-law, and IIRC, Judah's other son had refused his duty, and Judah was trying to ignore her plight. She did a pretty clever thing, and she was righteous for doing the thing. permalink parent award report block reply SpeekFreely 0 points 20 hours ago We’re all born as sinners aren’t we ? permalink parent award report block reply PatriotSam OP 4 points 20 hours ago Yes, but there are those that live in sin and those that try to rise above it. permalink parent award report block reply AlexJonesIsRight 2 points 19 hours ago You're on the right path read my comments brother. Never cease to be a real man. permalink parent award report block reply\nPatriotSam OP 7 points 20 hours ago Because it's disgusting and against God. permalink parent award report block reply chickeninoven 2 points 20 hours ago Weird. The line of Judah sprung forth when his daughter-in-law disguised herself as a prostitute and seduced him. permalink parent award report block reply sordfysh PRO 0 points 19 hours ago Weird fact, but it checks out. For what it's worth, it was his widowed daughter-in-law, and IIRC, Judah's other son had refused his duty, and Judah was trying to ignore her plight. She did a pretty clever thing, and she was righteous for doing the thing. permalink parent award report block reply SpeekFreely 0 points 20 hours ago We’re all born as sinners aren’t we ? permalink parent award report block reply PatriotSam OP 4 points 20 hours ago Yes, but there are those that live in sin and those that try to rise above it. permalink parent award report block reply AlexJonesIsRight 2 points 19 hours ago You're on the right path read my comments brother. Never cease to be a real man. permalink parent award report block reply\nchickeninoven 2 points 20 hours ago Weird. The line of Judah sprung forth when his daughter-in-law disguised herself as a prostitute and seduced him. permalink parent award report block reply sordfysh PRO 0 points 19 hours ago Weird fact, but it checks out. For what it's worth, it was his widowed daughter-in-law, and IIRC, Judah's other son had refused his duty, and Judah was trying to ignore her plight. She did a pretty clever thing, and she was righteous for doing the thing. permalink parent award report block reply\nsordfysh PRO 0 points 19 hours ago Weird fact, but it checks out. For what it's worth, it was his widowed daughter-in-law, and IIRC, Judah's other son had refused his duty, and Judah was trying to ignore her plight. She did a pretty clever thing, and she was righteous for doing the thing. permalink parent award report block reply\nSpeekFreely 0 points 20 hours ago We’re all born as sinners aren’t we ? permalink parent award report block reply PatriotSam OP 4 points 20 hours ago Yes, but there are those that live in sin and those that try to rise above it. permalink parent award report block reply AlexJonesIsRight 2 points 19 hours ago You're on the right path read my comments brother. Never cease to be a real man. permalink parent award report block reply\nPatriotSam OP 4 points 20 hours ago Yes, but there are those that live in sin and those that try to rise above it. permalink parent award report block reply AlexJonesIsRight 2 points 19 hours ago You're on the right path read my comments brother. Never cease to be a real man. permalink parent award report block reply\nAlexJonesIsRight 2 points 19 hours ago You're on the right path read my comments brother. Never cease to be a real man. permalink parent award report block reply\ndburt2 1 points 18 hours ago This guy is full of shit. permalink award report block reply\nStlpoolguy 1 points 19 hours ago Omg!  This is the funniest thing I've heard in a long time permalink award report block reply\ntingo999 1 points 19 hours ago You gotta stop posting this retards opinions. permalink award report block reply\ndeepbake 1 points 19 hours ago OnlyGANS permalink award report block reply\ndelnaga 0 points 19 hours ago I’m ok with it. permalink award report block reply\nRINO_fatigue -4 points 20 hours ago Nick Fuentes shilling porno and masturbation degeneracy how low can this site sink permalink award report block reply Prandogolio 0 points 20 hours ago how low can this site sink Well, for example, I've literally just been taking the dumbest fucking posts I could find that have nothing to do with MAGA from c/funny today and reposting them here all day, and every post is getting tons of upvotes. permalink parent award report block reply PatriotSam OP 2 points 20 hours ago People seem to be burnt out on politics. We are reverting back to cat video internet days. permalink parent award report block reply\nPrandogolio 0 points 20 hours ago how low can this site sink Well, for example, I've literally just been taking the dumbest fucking posts I could find that have nothing to do with MAGA from c/funny today and reposting them here all day, and every post is getting tons of upvotes. permalink parent award report block reply PatriotSam OP 2 points 20 hours ago People seem to be burnt out on politics. We are reverting back to cat video internet days. permalink parent award report block reply\nPatriotSam OP 2 points 20 hours ago People seem to be burnt out on politics. We are reverting back to cat video internet days. permalink parent award report block reply\nWilfuu 0 points 17 hours ago Comment removed by community moderators. permalink award report block reply"}