{"id": "1ARK9peUl6", "contents": "79 Sen. Fetterman fires off a blunt message to AOC, Bernie Sanders, and every “Democratic socialist” in his party. “I promise you America’s future and my party’s future is not socialism or kinds of outlandish, far-left kinds of ideas.” posted 12 hours ago by I-am-Orlando PRO 3 comments award share report block Vigilant Fox 🦊 @VigilantFox • 13h Sen. Fetterman fires off a blunt message to AOC, Bernie Sanders, and every “Democratic socialist” in his party. As they try to take over the party, Fetterman gave them this reality check: “I promise you America’s future and my party’s future is not socialism or kinds of\n3 comments Sort by Top Top New Worst Old Save duckduck 4 points 12 hours ago Well, he's wrong, because all the Democrat party has is socialism now. It's either \"move to the center and be Republicans lite\" or go full-left extremist communist. permalink award report block reply blitzkrieg1 4 points 12 hours ago How many hoodies do you think he has? permalink award report block reply Bruno 3 points 11 hours ago Fetterman doesn’t realize the party will just kick him out like they did RFK and Tulsi. There’s no room for moderates in the DNC. That ship sailed a while back. permalink award report block reply drmrboy 3 points 12 hours ago Boy, is he in for a surprise, lol.  Guess he hasn't been paying attention to what the \"repupulican\" party is up to these days.  🤓 permalink award report block reply\nduckduck 4 points 12 hours ago Well, he's wrong, because all the Democrat party has is socialism now. It's either \"move to the center and be Republicans lite\" or go full-left extremist communist. permalink award report block reply\nblitzkrieg1 4 points 12 hours ago How many hoodies do you think he has? permalink award report block reply\nBruno 3 points 11 hours ago Fetterman doesn’t realize the party will just kick him out like they did RFK and Tulsi. There’s no room for moderates in the DNC. That ship sailed a while back. permalink award report block reply\ndrmrboy 3 points 12 hours ago Boy, is he in for a surprise, lol.  Guess he hasn't been paying attention to what the \"repupulican\" party is up to these days.  🤓 permalink award report block reply"}