{"id": "1ARK9irDxx", "contents": "535 Prayers for Dave Ramsey posted 2 days ago by geckogreen 62 comments award share download report block\n62 comments Sort by Top Top New Worst Old Save HappyFunBall 32 points 2 days ago All of Dave Ramsey's \"advice\" could fit on a single index card. permalink award report block reply South_Florida_Guy 38 points 2 days ago \"Pay off all of your debt\" \"Don't get into debt\" permalink parent award report block reply Awakened 16 points 2 days ago Well, I mean, that's about it. You could add, save ten percent of your money for retirement. Though good luck doing any of that in the economy of the last five years. permalink parent award report block reply Please_Clap 22 points 2 days ago A 50 year mortgage would only slightly lower your monthly payment ($250 on a $360k mortgage) while DOUBLING the interest paid. WTF is Trump thinking? permalink parent award report block reply Awakened 10 points 2 days ago Yeah, not a good look, but a sign of how bad things really are. Not really his fault though. I remember when the 30 year mortgage came out and everyone screamed bloody murder, but it was the only way some people could afford a house. Now it's what nearly everyone does and they don't think much of it because it's the only way to afford a home. A home should take ten years to pay off, but here we are. Gonna get ugly if things don't turn around. He's expected to lose tariffs on Wednesday. That will really hurt the MAGA agenda. permalink parent award report block reply Shmioighan 7 points 2 days ago One thing I learned about people who do not understand interest or debt is that they literally only care about the monthly payment. Everything is peaches and cream until all those payments start to hurt , even if every alarm bell should be ringing well before it gets to that point. permalink parent award report block reply view 1 more comments... MakeAmericaRichAgain 4 points 2 days ago if it gets you ownership faster, it's better. permalink parent award report block reply view 4 more comments... PosterIsDead 5 points 2 days ago “Beans and rice, rice and beans.” permalink parent award report block reply HaSumBro 1 points 2 days ago \"get a job for income\" \"Get high deductible insurance\" \"Make sure your parents have insurance so they don't fuck you over\" \"Mutual funds\" \"Cash savings\" \"Buy your house with cash\" permalink parent award report block reply PvtSnowball 1 points 2 days ago What are you, some type of anti semite ?!!? permalink parent award report block reply South_Florida_Guy 2 points 2 days ago Yes, yes I am actually permalink parent award report block reply PvtSnowball 1 points 2 days ago Comment removed by community filter. permalink parent award report block reply Standingoak 1 points 2 days ago The best ideas are always the simplest.  This worked for me. permalink parent award report block reply geckogreen OP 7 points 2 days ago He would agree. He calls it the 7 baby steps. Yet people call in anyway permalink parent award report block reply zooty 1 points 2 days ago What is it? \"Advice your grandmother would give you but we keep our teeth in\" or something? permalink parent award report block reply HoganP 1 points 2 days ago Yes.  Which Ramsey, himself, says all the time. permalink parent award report block reply HockeyMom4Trump 3 points 2 days ago Truth! Live below your means! It isn’t hard. permalink parent award report block reply Please_Clap 1 points 2 days ago Bbbbut I need the latest $1200 iPhone! 🥴 permalink parent award report block reply zooty 2 points 2 days ago \"Annual income twenty pounds, annual expenditure nineteen nineteen and six, result happiness. Annual income twenty pounds, annual expenditure twenty pounds ought and six, result misery\". permalink parent award report block reply HoganP 1 points 2 days ago Which he will tell you. permalink parent award report block reply load 2 more comments... The_Highlander 6 points 2 days ago Kek permalink award report block reply DeportThemAllForever 5 points 2 days ago You guys laugh, but he’s the voice of reason in this insane world where you’ll own nothing and be “happy”. permalink award report block reply HoganP 5 points 2 days ago 99% of the times people disagree with Dave Ramsey it's because they can't handle being told what they don't want to hear.  Finance is at the top of the list of things that people should never be emotional about, yet everyone is emotional about it, directly or indirectly.  Half of them just think they know something better when it's really just ego, emotion, and confirmation bias. permalink parent award report block reply MakeAmericaRichAgain 5 points 2 days ago I watched a clip of his show one time where a guy was underwater on the value of his car. Ramsey told him to sell it. 30 seconds later, he told the guy to pick up a second job driving for doordash. Dave Ramsey and his anti debt bullshit kept a ton of people from buying their first house at a reasonable price. He should not be listened to. permalink award report block reply geckogreen OP 11 points 2 days ago His mortgage advice is pretty bad. He says you don't need a credit score just make a bigger down payment on your house. Unfortunately banks just don't work that way. permalink parent award report block reply DeportThemAllForever 4 points 2 days ago Society would be better if it wasn’t all built on debt and fiat. If federal government wasn’t backing 30 year mortgages, housing would be much cheaper and more available.  Debt is slavery ran by banking cartel. permalink parent award report block reply HoganP 4 points 2 days ago That's not what he says, at all. permalink parent award report block reply indigo_truther 5 points 2 days ago Some people have overpriced cars.  Selling it, buying a cheaper one, and driving for Doordash aren't necessary exclusive. permalink parent award report block reply HoganP 5 points 2 days ago Most people have overpriced cars and financing them, serially, is one of the most common things that drag them down financially throughout their working lives. permalink parent award report block reply Awakened 4 points 2 days ago You are correct, that is stupid. A house is not like credit card debt. It saves you money over renting when calculated over a couple of decades. It is 'good' debt. permalink parent award report block reply zooty 11 points 2 days ago Ramsey supported mortgages as the only reasonable form of debt last time I listened. Of course, he probably wasn't talking about these 50 year monstrosities. People tell a lot of lies about Ramsey. Not that I think he's without issues. permalink parent award report block reply HoganP 2 points 2 days ago A lot of them are right here in this thread. And I've heard him discuss 50 year mortgages, long before this recent thing, and he thinks they are insane.  He advocates 15 year mortgages because it reels you in to staying within your means in your purchase and you will actually pay it off in a reasonable timeframe even if you don't make extra payments. permalink parent award report block reply Awakened 1 points 2 days ago I've never listened to him, but none of what you said surprised me. permalink parent award report block reply zooty 1 points 2 days ago I used to listen to him on my commute every day for years. You twig onto the basics pretty quickly but the call-ins are often amusing like the guy who wanted to borrow $30k to start an exotic bird breeding business. Which I laughed at but then had to keep a straight face when one of my wife's family did basically the same thing. permalink parent award report block reply view 1 more comments... Shmioighan 3 points 2 days ago The problem with 'good' debt is that it's like treading water with an anchor made of gold. Well worth it if you make it, will kill you if you can't, and not enough people have the foresight or decisiveness to drop it in time (if anyone can tell when that is at all.) permalink parent award report block reply HoganP 1 points 2 days ago You're an idiot. permalink parent award report block reply MakeAmericaRichAgain 1 points 1 day ago Cool permalink parent award report block reply Droford 1 points 2 days ago I was going to say the guy should buy a beater but I bet doordash has car requirements like Uber permalink parent award report block reply FuckU/Spez 4 points 2 days ago Does anyone stay in their house for the life of the loan? These are supposed to be aimed at younger couples.  In a few years, they have some equity built up, credit should have gone up. Sell, buy bigger on shorter loan. permalink award report block reply Hantif 8 points 2 days ago I've paid off two mortgages, still live in the latest one. Parents and in laws paid off theirs, sister and sister in law have as well. Some people know how to be content, not always seeking bigger houses. permalink parent award report block reply f_bastiat 2 points 1 day ago Agreed, we added onto our home when we had more kids and needed more space, I paid off my house in my early 30s, no desire to move, did plenty of that in my early 20s. Home is where you make it. permalink parent award report block reply FreeFire 3 points 2 days ago The whole---the entirety---of mortgages, home loans is a BANK SCAM , with the credit scores and other crap.  Wait  until you find out how we were all screwed by the Deep State Banks. . .info coming soon to a EBS near you. ~ 10 Nov 2025 permalink parent award report block reply Bandanna1 1 points 2 days ago In a few years, they have some equity built up, credit should have gone up. Sell, buy bigger on shorter loan. I cant imagine what shit tier the amortization schedule looks like on a 50 year. permalink parent award report block reply AmarilloArmadillo 3 points 2 days ago 20 years in, you might own part of the garage and half of the mailbox permalink parent award report block reply Dogebastian 1 points 2 days ago No worries, inflation erodes their debt and magnifies their equity anyway... permalink parent award report block reply WisestGuru93 2 points 2 days ago https://x.com/Plane_Trotter/status/1988095582565810411?s=20 permalink award report block reply Harvestsmiles 2 points 24 hours ago But still, \"Better than I deserve\" permalink award report block reply keeman 2 points 2 days ago If the gov was not backing the 50 year mortgage, I'd say fine.  Some lender and some borrower both want to enter into this ridiculous contract then fair enough.  You buy a house at 20 and at 70 (if you are still alive) you own it.  And you are effectively renting.  Almost all of the money you pay goes to interest.  But the gov IS backing this.  Which is unconstitutional and also distorts the markets.  And as such the gov is encouraging serfdom.  You never really own anything (because you die before you get it) and the gov owns your debt and holds it over you. permalink award report block reply Mungo 2 points 2 days ago Kek permalink award report block reply PleaseHonk 1 points 2 days ago Lolzz permalink award report block reply Droford 1 points 2 days ago Or the 10 year car loan permalink award report block reply f_bastiat 1 points 1 day ago Kek permalink award report block reply Givesgunstogrannies 1 points 2 days ago 🤣 permalink award report block reply MemoryHoleyeO 1 points 1 day ago Give me .5 interest rate and I'll pay it off in a few years permalink award report block reply\nHappyFunBall 32 points 2 days ago All of Dave Ramsey's \"advice\" could fit on a single index card. permalink award report block reply South_Florida_Guy 38 points 2 days ago \"Pay off all of your debt\" \"Don't get into debt\" permalink parent award report block reply Awakened 16 points 2 days ago Well, I mean, that's about it. You could add, save ten percent of your money for retirement. Though good luck doing any of that in the economy of the last five years. permalink parent award report block reply Please_Clap 22 points 2 days ago A 50 year mortgage would only slightly lower your monthly payment ($250 on a $360k mortgage) while DOUBLING the interest paid. WTF is Trump thinking? permalink parent award report block reply Awakened 10 points 2 days ago Yeah, not a good look, but a sign of how bad things really are. Not really his fault though. I remember when the 30 year mortgage came out and everyone screamed bloody murder, but it was the only way some people could afford a house. Now it's what nearly everyone does and they don't think much of it because it's the only way to afford a home. A home should take ten years to pay off, but here we are. Gonna get ugly if things don't turn around. He's expected to lose tariffs on Wednesday. That will really hurt the MAGA agenda. permalink parent award report block reply Shmioighan 7 points 2 days ago One thing I learned about people who do not understand interest or debt is that they literally only care about the monthly payment. Everything is peaches and cream until all those payments start to hurt , even if every alarm bell should be ringing well before it gets to that point. permalink parent award report block reply view 1 more comments... MakeAmericaRichAgain 4 points 2 days ago if it gets you ownership faster, it's better. permalink parent award report block reply view 4 more comments... PosterIsDead 5 points 2 days ago “Beans and rice, rice and beans.” permalink parent award report block reply HaSumBro 1 points 2 days ago \"get a job for income\" \"Get high deductible insurance\" \"Make sure your parents have insurance so they don't fuck you over\" \"Mutual funds\" \"Cash savings\" \"Buy your house with cash\" permalink parent award report block reply PvtSnowball 1 points 2 days ago What are you, some type of anti semite ?!!? permalink parent award report block reply South_Florida_Guy 2 points 2 days ago Yes, yes I am actually permalink parent award report block reply PvtSnowball 1 points 2 days ago Comment removed by community filter. permalink parent award report block reply Standingoak 1 points 2 days ago The best ideas are always the simplest.  This worked for me. permalink parent award report block reply geckogreen OP 7 points 2 days ago He would agree. He calls it the 7 baby steps. Yet people call in anyway permalink parent award report block reply zooty 1 points 2 days ago What is it? \"Advice your grandmother would give you but we keep our teeth in\" or something? permalink parent award report block reply HoganP 1 points 2 days ago Yes.  Which Ramsey, himself, says all the time. permalink parent award report block reply HockeyMom4Trump 3 points 2 days ago Truth! Live below your means! It isn’t hard. permalink parent award report block reply Please_Clap 1 points 2 days ago Bbbbut I need the latest $1200 iPhone! 🥴 permalink parent award report block reply zooty 2 points 2 days ago \"Annual income twenty pounds, annual expenditure nineteen nineteen and six, result happiness. Annual income twenty pounds, annual expenditure twenty pounds ought and six, result misery\". permalink parent award report block reply HoganP 1 points 2 days ago Which he will tell you. permalink parent award report block reply load 2 more comments...\nSouth_Florida_Guy 38 points 2 days ago \"Pay off all of your debt\" \"Don't get into debt\" permalink parent award report block reply Awakened 16 points 2 days ago Well, I mean, that's about it. You could add, save ten percent of your money for retirement. Though good luck doing any of that in the economy of the last five years. permalink parent award report block reply Please_Clap 22 points 2 days ago A 50 year mortgage would only slightly lower your monthly payment ($250 on a $360k mortgage) while DOUBLING the interest paid. WTF is Trump thinking? permalink parent award report block reply Awakened 10 points 2 days ago Yeah, not a good look, but a sign of how bad things really are. Not really his fault though. I remember when the 30 year mortgage came out and everyone screamed bloody murder, but it was the only way some people could afford a house. Now it's what nearly everyone does and they don't think much of it because it's the only way to afford a home. A home should take ten years to pay off, but here we are. Gonna get ugly if things don't turn around. He's expected to lose tariffs on Wednesday. That will really hurt the MAGA agenda. permalink parent award report block reply Shmioighan 7 points 2 days ago One thing I learned about people who do not understand interest or debt is that they literally only care about the monthly payment. Everything is peaches and cream until all those payments start to hurt , even if every alarm bell should be ringing well before it gets to that point. permalink parent award report block reply view 1 more comments... MakeAmericaRichAgain 4 points 2 days ago if it gets you ownership faster, it's better. permalink parent award report block reply view 4 more comments... PosterIsDead 5 points 2 days ago “Beans and rice, rice and beans.” permalink parent award report block reply HaSumBro 1 points 2 days ago \"get a job for income\" \"Get high deductible insurance\" \"Make sure your parents have insurance so they don't fuck you over\" \"Mutual funds\" \"Cash savings\" \"Buy your house with cash\" permalink parent award report block reply PvtSnowball 1 points 2 days ago What are you, some type of anti semite ?!!? permalink parent award report block reply South_Florida_Guy 2 points 2 days ago Yes, yes I am actually permalink parent award report block reply PvtSnowball 1 points 2 days ago Comment removed by community filter. permalink parent award report block reply Standingoak 1 points 2 days ago The best ideas are always the simplest.  This worked for me. permalink parent award report block reply\nAwakened 16 points 2 days ago Well, I mean, that's about it. You could add, save ten percent of your money for retirement. Though good luck doing any of that in the economy of the last five years. permalink parent award report block reply Please_Clap 22 points 2 days ago A 50 year mortgage would only slightly lower your monthly payment ($250 on a $360k mortgage) while DOUBLING the interest paid. WTF is Trump thinking? permalink parent award report block reply Awakened 10 points 2 days ago Yeah, not a good look, but a sign of how bad things really are. Not really his fault though. I remember when the 30 year mortgage came out and everyone screamed bloody murder, but it was the only way some people could afford a house. Now it's what nearly everyone does and they don't think much of it because it's the only way to afford a home. A home should take ten years to pay off, but here we are. Gonna get ugly if things don't turn around. He's expected to lose tariffs on Wednesday. That will really hurt the MAGA agenda. permalink parent award report block reply Shmioighan 7 points 2 days ago One thing I learned about people who do not understand interest or debt is that they literally only care about the monthly payment. Everything is peaches and cream until all those payments start to hurt , even if every alarm bell should be ringing well before it gets to that point. permalink parent award report block reply view 1 more comments... MakeAmericaRichAgain 4 points 2 days ago if it gets you ownership faster, it's better. permalink parent award report block reply view 4 more comments...\nPlease_Clap 22 points 2 days ago A 50 year mortgage would only slightly lower your monthly payment ($250 on a $360k mortgage) while DOUBLING the interest paid. WTF is Trump thinking? permalink parent award report block reply Awakened 10 points 2 days ago Yeah, not a good look, but a sign of how bad things really are. Not really his fault though. I remember when the 30 year mortgage came out and everyone screamed bloody murder, but it was the only way some people could afford a house. Now it's what nearly everyone does and they don't think much of it because it's the only way to afford a home. A home should take ten years to pay off, but here we are. Gonna get ugly if things don't turn around. He's expected to lose tariffs on Wednesday. That will really hurt the MAGA agenda. permalink parent award report block reply Shmioighan 7 points 2 days ago One thing I learned about people who do not understand interest or debt is that they literally only care about the monthly payment. Everything is peaches and cream until all those payments start to hurt , even if every alarm bell should be ringing well before it gets to that point. permalink parent award report block reply view 1 more comments... MakeAmericaRichAgain 4 points 2 days ago if it gets you ownership faster, it's better. permalink parent award report block reply view 4 more comments...\nAwakened 10 points 2 days ago Yeah, not a good look, but a sign of how bad things really are. Not really his fault though. I remember when the 30 year mortgage came out and everyone screamed bloody murder, but it was the only way some people could afford a house. Now it's what nearly everyone does and they don't think much of it because it's the only way to afford a home. A home should take ten years to pay off, but here we are. Gonna get ugly if things don't turn around. He's expected to lose tariffs on Wednesday. That will really hurt the MAGA agenda. permalink parent award report block reply\nShmioighan 7 points 2 days ago One thing I learned about people who do not understand interest or debt is that they literally only care about the monthly payment. Everything is peaches and cream until all those payments start to hurt , even if every alarm bell should be ringing well before it gets to that point. permalink parent award report block reply view 1 more comments...\nMakeAmericaRichAgain 4 points 2 days ago if it gets you ownership faster, it's better. permalink parent award report block reply view 4 more comments...\nPosterIsDead 5 points 2 days ago “Beans and rice, rice and beans.” permalink parent award report block reply\nHaSumBro 1 points 2 days ago \"get a job for income\" \"Get high deductible insurance\" \"Make sure your parents have insurance so they don't fuck you over\" \"Mutual funds\" \"Cash savings\" \"Buy your house with cash\" permalink parent award report block reply\nPvtSnowball 1 points 2 days ago What are you, some type of anti semite ?!!? permalink parent award report block reply South_Florida_Guy 2 points 2 days ago Yes, yes I am actually permalink parent award report block reply PvtSnowball 1 points 2 days ago Comment removed by community filter. permalink parent award report block reply\nSouth_Florida_Guy 2 points 2 days ago Yes, yes I am actually permalink parent award report block reply PvtSnowball 1 points 2 days ago Comment removed by community filter. permalink parent award report block reply\nPvtSnowball 1 points 2 days ago Comment removed by community filter. permalink parent award report block reply\nStandingoak 1 points 2 days ago The best ideas are always the simplest.  This worked for me. permalink parent award report block reply\ngeckogreen OP 7 points 2 days ago He would agree. He calls it the 7 baby steps. Yet people call in anyway permalink parent award report block reply zooty 1 points 2 days ago What is it? \"Advice your grandmother would give you but we keep our teeth in\" or something? permalink parent award report block reply HoganP 1 points 2 days ago Yes.  Which Ramsey, himself, says all the time. permalink parent award report block reply\nzooty 1 points 2 days ago What is it? \"Advice your grandmother would give you but we keep our teeth in\" or something? permalink parent award report block reply HoganP 1 points 2 days ago Yes.  Which Ramsey, himself, says all the time. permalink parent award report block reply\nHoganP 1 points 2 days ago Yes.  Which Ramsey, himself, says all the time. permalink parent award report block reply\nHockeyMom4Trump 3 points 2 days ago Truth! Live below your means! It isn’t hard. permalink parent award report block reply Please_Clap 1 points 2 days ago Bbbbut I need the latest $1200 iPhone! 🥴 permalink parent award report block reply\nPlease_Clap 1 points 2 days ago Bbbbut I need the latest $1200 iPhone! 🥴 permalink parent award report block reply\nzooty 2 points 2 days ago \"Annual income twenty pounds, annual expenditure nineteen nineteen and six, result happiness. Annual income twenty pounds, annual expenditure twenty pounds ought and six, result misery\". permalink parent award report block reply\nHoganP 1 points 2 days ago Which he will tell you. permalink parent award report block reply\nThe_Highlander 6 points 2 days ago Kek permalink award report block reply\nDeportThemAllForever 5 points 2 days ago You guys laugh, but he’s the voice of reason in this insane world where you’ll own nothing and be “happy”. permalink award report block reply HoganP 5 points 2 days ago 99% of the times people disagree with Dave Ramsey it's because they can't handle being told what they don't want to hear.  Finance is at the top of the list of things that people should never be emotional about, yet everyone is emotional about it, directly or indirectly.  Half of them just think they know something better when it's really just ego, emotion, and confirmation bias. permalink parent award report block reply\nHoganP 5 points 2 days ago 99% of the times people disagree with Dave Ramsey it's because they can't handle being told what they don't want to hear.  Finance is at the top of the list of things that people should never be emotional about, yet everyone is emotional about it, directly or indirectly.  Half of them just think they know something better when it's really just ego, emotion, and confirmation bias. permalink parent award report block reply\nMakeAmericaRichAgain 5 points 2 days ago I watched a clip of his show one time where a guy was underwater on the value of his car. Ramsey told him to sell it. 30 seconds later, he told the guy to pick up a second job driving for doordash. Dave Ramsey and his anti debt bullshit kept a ton of people from buying their first house at a reasonable price. He should not be listened to. permalink award report block reply geckogreen OP 11 points 2 days ago His mortgage advice is pretty bad. He says you don't need a credit score just make a bigger down payment on your house. Unfortunately banks just don't work that way. permalink parent award report block reply DeportThemAllForever 4 points 2 days ago Society would be better if it wasn’t all built on debt and fiat. If federal government wasn’t backing 30 year mortgages, housing would be much cheaper and more available.  Debt is slavery ran by banking cartel. permalink parent award report block reply HoganP 4 points 2 days ago That's not what he says, at all. permalink parent award report block reply indigo_truther 5 points 2 days ago Some people have overpriced cars.  Selling it, buying a cheaper one, and driving for Doordash aren't necessary exclusive. permalink parent award report block reply HoganP 5 points 2 days ago Most people have overpriced cars and financing them, serially, is one of the most common things that drag them down financially throughout their working lives. permalink parent award report block reply Awakened 4 points 2 days ago You are correct, that is stupid. A house is not like credit card debt. It saves you money over renting when calculated over a couple of decades. It is 'good' debt. permalink parent award report block reply zooty 11 points 2 days ago Ramsey supported mortgages as the only reasonable form of debt last time I listened. Of course, he probably wasn't talking about these 50 year monstrosities. People tell a lot of lies about Ramsey. Not that I think he's without issues. permalink parent award report block reply HoganP 2 points 2 days ago A lot of them are right here in this thread. And I've heard him discuss 50 year mortgages, long before this recent thing, and he thinks they are insane.  He advocates 15 year mortgages because it reels you in to staying within your means in your purchase and you will actually pay it off in a reasonable timeframe even if you don't make extra payments. permalink parent award report block reply Awakened 1 points 2 days ago I've never listened to him, but none of what you said surprised me. permalink parent award report block reply zooty 1 points 2 days ago I used to listen to him on my commute every day for years. You twig onto the basics pretty quickly but the call-ins are often amusing like the guy who wanted to borrow $30k to start an exotic bird breeding business. Which I laughed at but then had to keep a straight face when one of my wife's family did basically the same thing. permalink parent award report block reply view 1 more comments... Shmioighan 3 points 2 days ago The problem with 'good' debt is that it's like treading water with an anchor made of gold. Well worth it if you make it, will kill you if you can't, and not enough people have the foresight or decisiveness to drop it in time (if anyone can tell when that is at all.) permalink parent award report block reply HoganP 1 points 2 days ago You're an idiot. permalink parent award report block reply MakeAmericaRichAgain 1 points 1 day ago Cool permalink parent award report block reply Droford 1 points 2 days ago I was going to say the guy should buy a beater but I bet doordash has car requirements like Uber permalink parent award report block reply\ngeckogreen OP 11 points 2 days ago His mortgage advice is pretty bad. He says you don't need a credit score just make a bigger down payment on your house. Unfortunately banks just don't work that way. permalink parent award report block reply DeportThemAllForever 4 points 2 days ago Society would be better if it wasn’t all built on debt and fiat. If federal government wasn’t backing 30 year mortgages, housing would be much cheaper and more available.  Debt is slavery ran by banking cartel. permalink parent award report block reply HoganP 4 points 2 days ago That's not what he says, at all. permalink parent award report block reply\nDeportThemAllForever 4 points 2 days ago Society would be better if it wasn’t all built on debt and fiat. If federal government wasn’t backing 30 year mortgages, housing would be much cheaper and more available.  Debt is slavery ran by banking cartel. permalink parent award report block reply\nHoganP 4 points 2 days ago That's not what he says, at all. permalink parent award report block reply\nindigo_truther 5 points 2 days ago Some people have overpriced cars.  Selling it, buying a cheaper one, and driving for Doordash aren't necessary exclusive. permalink parent award report block reply HoganP 5 points 2 days ago Most people have overpriced cars and financing them, serially, is one of the most common things that drag them down financially throughout their working lives. permalink parent award report block reply\nHoganP 5 points 2 days ago Most people have overpriced cars and financing them, serially, is one of the most common things that drag them down financially throughout their working lives. permalink parent award report block reply\nAwakened 4 points 2 days ago You are correct, that is stupid. A house is not like credit card debt. It saves you money over renting when calculated over a couple of decades. It is 'good' debt. permalink parent award report block reply zooty 11 points 2 days ago Ramsey supported mortgages as the only reasonable form of debt last time I listened. Of course, he probably wasn't talking about these 50 year monstrosities. People tell a lot of lies about Ramsey. Not that I think he's without issues. permalink parent award report block reply HoganP 2 points 2 days ago A lot of them are right here in this thread. And I've heard him discuss 50 year mortgages, long before this recent thing, and he thinks they are insane.  He advocates 15 year mortgages because it reels you in to staying within your means in your purchase and you will actually pay it off in a reasonable timeframe even if you don't make extra payments. permalink parent award report block reply Awakened 1 points 2 days ago I've never listened to him, but none of what you said surprised me. permalink parent award report block reply zooty 1 points 2 days ago I used to listen to him on my commute every day for years. You twig onto the basics pretty quickly but the call-ins are often amusing like the guy who wanted to borrow $30k to start an exotic bird breeding business. Which I laughed at but then had to keep a straight face when one of my wife's family did basically the same thing. permalink parent award report block reply view 1 more comments... Shmioighan 3 points 2 days ago The problem with 'good' debt is that it's like treading water with an anchor made of gold. Well worth it if you make it, will kill you if you can't, and not enough people have the foresight or decisiveness to drop it in time (if anyone can tell when that is at all.) permalink parent award report block reply\nzooty 11 points 2 days ago Ramsey supported mortgages as the only reasonable form of debt last time I listened. Of course, he probably wasn't talking about these 50 year monstrosities. People tell a lot of lies about Ramsey. Not that I think he's without issues. permalink parent award report block reply HoganP 2 points 2 days ago A lot of them are right here in this thread. And I've heard him discuss 50 year mortgages, long before this recent thing, and he thinks they are insane.  He advocates 15 year mortgages because it reels you in to staying within your means in your purchase and you will actually pay it off in a reasonable timeframe even if you don't make extra payments. permalink parent award report block reply Awakened 1 points 2 days ago I've never listened to him, but none of what you said surprised me. permalink parent award report block reply zooty 1 points 2 days ago I used to listen to him on my commute every day for years. You twig onto the basics pretty quickly but the call-ins are often amusing like the guy who wanted to borrow $30k to start an exotic bird breeding business. Which I laughed at but then had to keep a straight face when one of my wife's family did basically the same thing. permalink parent award report block reply view 1 more comments...\nHoganP 2 points 2 days ago A lot of them are right here in this thread. And I've heard him discuss 50 year mortgages, long before this recent thing, and he thinks they are insane.  He advocates 15 year mortgages because it reels you in to staying within your means in your purchase and you will actually pay it off in a reasonable timeframe even if you don't make extra payments. permalink parent award report block reply\nAwakened 1 points 2 days ago I've never listened to him, but none of what you said surprised me. permalink parent award report block reply zooty 1 points 2 days ago I used to listen to him on my commute every day for years. You twig onto the basics pretty quickly but the call-ins are often amusing like the guy who wanted to borrow $30k to start an exotic bird breeding business. Which I laughed at but then had to keep a straight face when one of my wife's family did basically the same thing. permalink parent award report block reply view 1 more comments...\nzooty 1 points 2 days ago I used to listen to him on my commute every day for years. You twig onto the basics pretty quickly but the call-ins are often amusing like the guy who wanted to borrow $30k to start an exotic bird breeding business. Which I laughed at but then had to keep a straight face when one of my wife's family did basically the same thing. permalink parent award report block reply view 1 more comments...\nShmioighan 3 points 2 days ago The problem with 'good' debt is that it's like treading water with an anchor made of gold. Well worth it if you make it, will kill you if you can't, and not enough people have the foresight or decisiveness to drop it in time (if anyone can tell when that is at all.) permalink parent award report block reply\nHoganP 1 points 2 days ago You're an idiot. permalink parent award report block reply MakeAmericaRichAgain 1 points 1 day ago Cool permalink parent award report block reply\nMakeAmericaRichAgain 1 points 1 day ago Cool permalink parent award report block reply\nDroford 1 points 2 days ago I was going to say the guy should buy a beater but I bet doordash has car requirements like Uber permalink parent award report block reply\nFuckU/Spez 4 points 2 days ago Does anyone stay in their house for the life of the loan? These are supposed to be aimed at younger couples.  In a few years, they have some equity built up, credit should have gone up. Sell, buy bigger on shorter loan. permalink award report block reply Hantif 8 points 2 days ago I've paid off two mortgages, still live in the latest one. Parents and in laws paid off theirs, sister and sister in law have as well. Some people know how to be content, not always seeking bigger houses. permalink parent award report block reply f_bastiat 2 points 1 day ago Agreed, we added onto our home when we had more kids and needed more space, I paid off my house in my early 30s, no desire to move, did plenty of that in my early 20s. Home is where you make it. permalink parent award report block reply FreeFire 3 points 2 days ago The whole---the entirety---of mortgages, home loans is a BANK SCAM , with the credit scores and other crap.  Wait  until you find out how we were all screwed by the Deep State Banks. . .info coming soon to a EBS near you. ~ 10 Nov 2025 permalink parent award report block reply Bandanna1 1 points 2 days ago In a few years, they have some equity built up, credit should have gone up. Sell, buy bigger on shorter loan. I cant imagine what shit tier the amortization schedule looks like on a 50 year. permalink parent award report block reply AmarilloArmadillo 3 points 2 days ago 20 years in, you might own part of the garage and half of the mailbox permalink parent award report block reply Dogebastian 1 points 2 days ago No worries, inflation erodes their debt and magnifies their equity anyway... permalink parent award report block reply\nHantif 8 points 2 days ago I've paid off two mortgages, still live in the latest one. Parents and in laws paid off theirs, sister and sister in law have as well. Some people know how to be content, not always seeking bigger houses. permalink parent award report block reply f_bastiat 2 points 1 day ago Agreed, we added onto our home when we had more kids and needed more space, I paid off my house in my early 30s, no desire to move, did plenty of that in my early 20s. Home is where you make it. permalink parent award report block reply\nf_bastiat 2 points 1 day ago Agreed, we added onto our home when we had more kids and needed more space, I paid off my house in my early 30s, no desire to move, did plenty of that in my early 20s. Home is where you make it. permalink parent award report block reply\nFreeFire 3 points 2 days ago The whole---the entirety---of mortgages, home loans is a BANK SCAM , with the credit scores and other crap.  Wait  until you find out how we were all screwed by the Deep State Banks. . .info coming soon to a EBS near you. ~ 10 Nov 2025 permalink parent award report block reply\nBandanna1 1 points 2 days ago In a few years, they have some equity built up, credit should have gone up. Sell, buy bigger on shorter loan. I cant imagine what shit tier the amortization schedule looks like on a 50 year. permalink parent award report block reply AmarilloArmadillo 3 points 2 days ago 20 years in, you might own part of the garage and half of the mailbox permalink parent award report block reply Dogebastian 1 points 2 days ago No worries, inflation erodes their debt and magnifies their equity anyway... permalink parent award report block reply\nAmarilloArmadillo 3 points 2 days ago 20 years in, you might own part of the garage and half of the mailbox permalink parent award report block reply\nDogebastian 1 points 2 days ago No worries, inflation erodes their debt and magnifies their equity anyway... permalink parent award report block reply\nWisestGuru93 2 points 2 days ago https://x.com/Plane_Trotter/status/1988095582565810411?s=20 permalink award report block reply\nHarvestsmiles 2 points 24 hours ago But still, \"Better than I deserve\" permalink award report block reply\nkeeman 2 points 2 days ago If the gov was not backing the 50 year mortgage, I'd say fine.  Some lender and some borrower both want to enter into this ridiculous contract then fair enough.  You buy a house at 20 and at 70 (if you are still alive) you own it.  And you are effectively renting.  Almost all of the money you pay goes to interest.  But the gov IS backing this.  Which is unconstitutional and also distorts the markets.  And as such the gov is encouraging serfdom.  You never really own anything (because you die before you get it) and the gov owns your debt and holds it over you. permalink award report block reply\nMungo 2 points 2 days ago Kek permalink award report block reply\nPleaseHonk 1 points 2 days ago Lolzz permalink award report block reply\nDroford 1 points 2 days ago Or the 10 year car loan permalink award report block reply\nf_bastiat 1 points 1 day ago Kek permalink award report block reply\nGivesgunstogrannies 1 points 2 days ago 🤣 permalink award report block reply\nMemoryHoleyeO 1 points 1 day ago Give me .5 interest rate and I'll pay it off in a few years permalink award report block reply"}