{"id": "1ARK54Slsf", "contents": "262 The J6 pipe bomb planter is being outed: Grok claims she’s a former Capitol Hill police officer named Shauni Rae Kerkhoff posted 5 days ago by couranto 27 comments award share report block Marco Polo @MarcoPolo501c3 • 6d The only thing we can say for certain right now is that the model of the vehicle definitely checks out, given her lifestyle. Ha! Steve Baker @SteveBakerUSA • 8d This is a story you might want to bookmark. Part two is going to change everything.\n27 comments Sort by Top Top New Worst Old Save couranto OP 21 points 5 days ago It was a giant psyop!! permalink award report block reply SpeekFreely 13 points 5 days ago There’s a lot more here, the size and scope of the DC Capital police @ 1:00:00 https://www.youtube.com/live/XCgMji9O-QU Also https://en.wikipedia.org/wiki/United_States_Capitol_Police I believe this is an agency we’ve overlooked thinking they were simply just a police force. permalink parent award report block reply CleanUpPhillyTrump24 11 points 5 days ago Pelosi was in charge of the Capitol Police as the named head of Congress. The House Speaker runs the building, the security, all aspects of safety and maintenance of Capitol Hill. That was the lost part of the official narrative - there was only one person who could be responsible for the debacle and false flag that was J6 - the House Speaker, Pelosi. No wonder she just announced her retirement. permalink parent award report block reply SpeekFreely 9 points 5 days ago A force of over 2000 officers to provide security for 535 members, and they have their very own intel and investigative agencies. permalink parent award report block reply Meatsuit 4 points 5 days ago There is also a force of 500 - 600 officers in the Mall arena -- the US Park Police.  Oldest federal police force.  Found Vince Foster in Marcy Park back in '93 and ran the investigation that determined his death was a suicide.  The Federal government goes deep. https://grokipedia.com/page/United_States_Park_Police permalink parent award report block reply NotYourMan 6 points 5 days ago Don't forget the 71 minutes.  Chief Steven Sund stated that he requested National Guard support at approximately 1 p.m. on January 6 but did not receive a response for 71 minutes, during which time the Capitol was breached.  And the capitol magnetically sealed doors were opened from inside and this allowed non-violent protesters to walk around inside the building furthering the \"insurrection\" narrative (which was an absolute lie to get Trump). permalink parent award report block reply Liberats 2 points 5 days ago She's retired.\nMaybe that was a deal.\nFO or be prosecuted. Personally I'd like to see her marched off to some foreign gulag, seeing as they like foreigners so much. permalink parent award report block reply couranto OP 8 points 5 days ago @Grok who is this? @Grok: “The images appear to show Shauni Rae Kerkhoff, a former U.S. Capitol Police officer. She testified in Jan. 6 riot trials about confronting protesters and using pepper balls. The vehicle record matches her name and location.” permalink parent award report block reply NotYourMan 4 points 5 days ago Entrapment!  Nancy is retiring for the same reason that rats leave the sinking ship, the DOJ is figuring out just how illegal the Jan 6th entrapment was. permalink parent award report block reply ReleasetheList 10 points 5 days ago A lesbian communist that is now probably working for the CIA, or was working for the CIA all along and the Capitol Police job was a cover. permalink award report block reply brassmule 2 points 5 days ago The lady who \"found\" one of them while \"doing laundry\" was/is clearly a CIA asset. permalink parent award report block reply schiff_for_brains 1 points 5 days ago Just because she has a butch haircut and owns a Subaru doesn't make her a lesbian communist.  Lesbian, yes.  But a commie would prefer public transportation and maybe ride sharing over exclusive ownership of a vehicle. permalink parent award report block reply Stlpoolguy 8 points 5 days ago That's one ugly dyke! permalink award report block reply ChyNahAzzWhole1 6 points 5 days ago Still No One that perpetrated, lied or falsely imprisoned innocent people are arrested, fired or even suspended. permalink award report block reply ReleasetheList 6 points 5 days ago The majority of the GOP still calls the J6 people traitors and terrorists. permalink parent award report block reply CleanUpPhillyTrump24 4 points 5 days ago The Uniparty muppets are going to be implicated in this also. permalink parent award report block reply CleanUpPhillyTrump24 5 points 5 days ago Pelosi just retired. This is why. No way that animated carcass would let go her bony fingered death grip on power except that she is certain that what comes next will damage the DNC. The DNC likely told her: hey it's been real Nan, now GTFO. permalink parent award report block reply Skogin 3 points 5 days ago Head shot matches the masked gait - funny that. permalink award report block reply mykillk 2 points 5 days ago We’re spreading bullshit guys. Did you even read the article? ShaunI Kerkoff was doing crowd control on the rotunda. The story doesn’t have anything to do with the pipe bomb. permalink award report block reply pixiepepe 1 points 5 days ago The \"bombs\" were planted the night before. permalink parent award report block reply mykillk 2 points 5 days ago I know but the point I'm making is OP linked to a The Blaze article, implying it connects this woman to the pipe bomb and it 100% does not. permalink parent award report block reply pixiepepe 2 points 5 days ago Yes, I haven't seen anything, beyond accusations, regarding this person being the same one planting the devices. I misunderstood your post. I remember,  a while back, there were accusations against some other person, a black guy employed in the government (military, Pentagon, maybe?), claiming he was the planter. Said something about him being followed by security cams to a parking lot at a DC subway station. permalink parent award report block reply couranto OP 0 points 5 days ago It certainly does. Read beyond.\nDig deeper. permalink parent award report block reply mykillk 1 points 5 days ago No it doesn't you're straight bullshitting now. permalink parent award report block reply CrowRezNeck 1 points 5 days ago That's a MAN...Babbbbby!!!! permalink award report block reply Plaquenil 1 points 5 days ago Here's the question everyone should be asking: does she know the woman who \"found\" the pipe bomb outside the RNC? permalink award report block reply Datamancer 1 points 5 days ago Patroit violence is like racism, they don't have enough so they make shit up. permalink award report block reply\ncouranto OP 21 points 5 days ago It was a giant psyop!! permalink award report block reply SpeekFreely 13 points 5 days ago There’s a lot more here, the size and scope of the DC Capital police @ 1:00:00 https://www.youtube.com/live/XCgMji9O-QU Also https://en.wikipedia.org/wiki/United_States_Capitol_Police I believe this is an agency we’ve overlooked thinking they were simply just a police force. permalink parent award report block reply CleanUpPhillyTrump24 11 points 5 days ago Pelosi was in charge of the Capitol Police as the named head of Congress. The House Speaker runs the building, the security, all aspects of safety and maintenance of Capitol Hill. That was the lost part of the official narrative - there was only one person who could be responsible for the debacle and false flag that was J6 - the House Speaker, Pelosi. No wonder she just announced her retirement. permalink parent award report block reply SpeekFreely 9 points 5 days ago A force of over 2000 officers to provide security for 535 members, and they have their very own intel and investigative agencies. permalink parent award report block reply Meatsuit 4 points 5 days ago There is also a force of 500 - 600 officers in the Mall arena -- the US Park Police.  Oldest federal police force.  Found Vince Foster in Marcy Park back in '93 and ran the investigation that determined his death was a suicide.  The Federal government goes deep. https://grokipedia.com/page/United_States_Park_Police permalink parent award report block reply NotYourMan 6 points 5 days ago Don't forget the 71 minutes.  Chief Steven Sund stated that he requested National Guard support at approximately 1 p.m. on January 6 but did not receive a response for 71 minutes, during which time the Capitol was breached.  And the capitol magnetically sealed doors were opened from inside and this allowed non-violent protesters to walk around inside the building furthering the \"insurrection\" narrative (which was an absolute lie to get Trump). permalink parent award report block reply Liberats 2 points 5 days ago She's retired.\nMaybe that was a deal.\nFO or be prosecuted. Personally I'd like to see her marched off to some foreign gulag, seeing as they like foreigners so much. permalink parent award report block reply couranto OP 8 points 5 days ago @Grok who is this? @Grok: “The images appear to show Shauni Rae Kerkhoff, a former U.S. Capitol Police officer. She testified in Jan. 6 riot trials about confronting protesters and using pepper balls. The vehicle record matches her name and location.” permalink parent award report block reply NotYourMan 4 points 5 days ago Entrapment!  Nancy is retiring for the same reason that rats leave the sinking ship, the DOJ is figuring out just how illegal the Jan 6th entrapment was. permalink parent award report block reply\nSpeekFreely 13 points 5 days ago There’s a lot more here, the size and scope of the DC Capital police @ 1:00:00 https://www.youtube.com/live/XCgMji9O-QU Also https://en.wikipedia.org/wiki/United_States_Capitol_Police I believe this is an agency we’ve overlooked thinking they were simply just a police force. permalink parent award report block reply CleanUpPhillyTrump24 11 points 5 days ago Pelosi was in charge of the Capitol Police as the named head of Congress. The House Speaker runs the building, the security, all aspects of safety and maintenance of Capitol Hill. That was the lost part of the official narrative - there was only one person who could be responsible for the debacle and false flag that was J6 - the House Speaker, Pelosi. No wonder she just announced her retirement. permalink parent award report block reply SpeekFreely 9 points 5 days ago A force of over 2000 officers to provide security for 535 members, and they have their very own intel and investigative agencies. permalink parent award report block reply Meatsuit 4 points 5 days ago There is also a force of 500 - 600 officers in the Mall arena -- the US Park Police.  Oldest federal police force.  Found Vince Foster in Marcy Park back in '93 and ran the investigation that determined his death was a suicide.  The Federal government goes deep. https://grokipedia.com/page/United_States_Park_Police permalink parent award report block reply NotYourMan 6 points 5 days ago Don't forget the 71 minutes.  Chief Steven Sund stated that he requested National Guard support at approximately 1 p.m. on January 6 but did not receive a response for 71 minutes, during which time the Capitol was breached.  And the capitol magnetically sealed doors were opened from inside and this allowed non-violent protesters to walk around inside the building furthering the \"insurrection\" narrative (which was an absolute lie to get Trump). permalink parent award report block reply Liberats 2 points 5 days ago She's retired.\nMaybe that was a deal.\nFO or be prosecuted. Personally I'd like to see her marched off to some foreign gulag, seeing as they like foreigners so much. permalink parent award report block reply\nCleanUpPhillyTrump24 11 points 5 days ago Pelosi was in charge of the Capitol Police as the named head of Congress. The House Speaker runs the building, the security, all aspects of safety and maintenance of Capitol Hill. That was the lost part of the official narrative - there was only one person who could be responsible for the debacle and false flag that was J6 - the House Speaker, Pelosi. No wonder she just announced her retirement. permalink parent award report block reply SpeekFreely 9 points 5 days ago A force of over 2000 officers to provide security for 535 members, and they have their very own intel and investigative agencies. permalink parent award report block reply Meatsuit 4 points 5 days ago There is also a force of 500 - 600 officers in the Mall arena -- the US Park Police.  Oldest federal police force.  Found Vince Foster in Marcy Park back in '93 and ran the investigation that determined his death was a suicide.  The Federal government goes deep. https://grokipedia.com/page/United_States_Park_Police permalink parent award report block reply NotYourMan 6 points 5 days ago Don't forget the 71 minutes.  Chief Steven Sund stated that he requested National Guard support at approximately 1 p.m. on January 6 but did not receive a response for 71 minutes, during which time the Capitol was breached.  And the capitol magnetically sealed doors were opened from inside and this allowed non-violent protesters to walk around inside the building furthering the \"insurrection\" narrative (which was an absolute lie to get Trump). permalink parent award report block reply Liberats 2 points 5 days ago She's retired.\nMaybe that was a deal.\nFO or be prosecuted. Personally I'd like to see her marched off to some foreign gulag, seeing as they like foreigners so much. permalink parent award report block reply\nSpeekFreely 9 points 5 days ago A force of over 2000 officers to provide security for 535 members, and they have their very own intel and investigative agencies. permalink parent award report block reply Meatsuit 4 points 5 days ago There is also a force of 500 - 600 officers in the Mall arena -- the US Park Police.  Oldest federal police force.  Found Vince Foster in Marcy Park back in '93 and ran the investigation that determined his death was a suicide.  The Federal government goes deep. https://grokipedia.com/page/United_States_Park_Police permalink parent award report block reply\nMeatsuit 4 points 5 days ago There is also a force of 500 - 600 officers in the Mall arena -- the US Park Police.  Oldest federal police force.  Found Vince Foster in Marcy Park back in '93 and ran the investigation that determined his death was a suicide.  The Federal government goes deep. https://grokipedia.com/page/United_States_Park_Police permalink parent award report block reply\nNotYourMan 6 points 5 days ago Don't forget the 71 minutes.  Chief Steven Sund stated that he requested National Guard support at approximately 1 p.m. on January 6 but did not receive a response for 71 minutes, during which time the Capitol was breached.  And the capitol magnetically sealed doors were opened from inside and this allowed non-violent protesters to walk around inside the building furthering the \"insurrection\" narrative (which was an absolute lie to get Trump). permalink parent award report block reply\nLiberats 2 points 5 days ago She's retired.\nMaybe that was a deal.\nFO or be prosecuted. Personally I'd like to see her marched off to some foreign gulag, seeing as they like foreigners so much. permalink parent award report block reply\ncouranto OP 8 points 5 days ago @Grok who is this? @Grok: “The images appear to show Shauni Rae Kerkhoff, a former U.S. Capitol Police officer. She testified in Jan. 6 riot trials about confronting protesters and using pepper balls. The vehicle record matches her name and location.” permalink parent award report block reply\nNotYourMan 4 points 5 days ago Entrapment!  Nancy is retiring for the same reason that rats leave the sinking ship, the DOJ is figuring out just how illegal the Jan 6th entrapment was. permalink parent award report block reply\nReleasetheList 10 points 5 days ago A lesbian communist that is now probably working for the CIA, or was working for the CIA all along and the Capitol Police job was a cover. permalink award report block reply brassmule 2 points 5 days ago The lady who \"found\" one of them while \"doing laundry\" was/is clearly a CIA asset. permalink parent award report block reply schiff_for_brains 1 points 5 days ago Just because she has a butch haircut and owns a Subaru doesn't make her a lesbian communist.  Lesbian, yes.  But a commie would prefer public transportation and maybe ride sharing over exclusive ownership of a vehicle. permalink parent award report block reply\nbrassmule 2 points 5 days ago The lady who \"found\" one of them while \"doing laundry\" was/is clearly a CIA asset. permalink parent award report block reply\nschiff_for_brains 1 points 5 days ago Just because she has a butch haircut and owns a Subaru doesn't make her a lesbian communist.  Lesbian, yes.  But a commie would prefer public transportation and maybe ride sharing over exclusive ownership of a vehicle. permalink parent award report block reply\nStlpoolguy 8 points 5 days ago That's one ugly dyke! permalink award report block reply\nChyNahAzzWhole1 6 points 5 days ago Still No One that perpetrated, lied or falsely imprisoned innocent people are arrested, fired or even suspended. permalink award report block reply ReleasetheList 6 points 5 days ago The majority of the GOP still calls the J6 people traitors and terrorists. permalink parent award report block reply CleanUpPhillyTrump24 4 points 5 days ago The Uniparty muppets are going to be implicated in this also. permalink parent award report block reply CleanUpPhillyTrump24 5 points 5 days ago Pelosi just retired. This is why. No way that animated carcass would let go her bony fingered death grip on power except that she is certain that what comes next will damage the DNC. The DNC likely told her: hey it's been real Nan, now GTFO. permalink parent award report block reply\nReleasetheList 6 points 5 days ago The majority of the GOP still calls the J6 people traitors and terrorists. permalink parent award report block reply CleanUpPhillyTrump24 4 points 5 days ago The Uniparty muppets are going to be implicated in this also. permalink parent award report block reply\nCleanUpPhillyTrump24 4 points 5 days ago The Uniparty muppets are going to be implicated in this also. permalink parent award report block reply\nCleanUpPhillyTrump24 5 points 5 days ago Pelosi just retired. This is why. No way that animated carcass would let go her bony fingered death grip on power except that she is certain that what comes next will damage the DNC. The DNC likely told her: hey it's been real Nan, now GTFO. permalink parent award report block reply\nSkogin 3 points 5 days ago Head shot matches the masked gait - funny that. permalink award report block reply\nmykillk 2 points 5 days ago We’re spreading bullshit guys. Did you even read the article? ShaunI Kerkoff was doing crowd control on the rotunda. The story doesn’t have anything to do with the pipe bomb. permalink award report block reply pixiepepe 1 points 5 days ago The \"bombs\" were planted the night before. permalink parent award report block reply mykillk 2 points 5 days ago I know but the point I'm making is OP linked to a The Blaze article, implying it connects this woman to the pipe bomb and it 100% does not. permalink parent award report block reply pixiepepe 2 points 5 days ago Yes, I haven't seen anything, beyond accusations, regarding this person being the same one planting the devices. I misunderstood your post. I remember,  a while back, there were accusations against some other person, a black guy employed in the government (military, Pentagon, maybe?), claiming he was the planter. Said something about him being followed by security cams to a parking lot at a DC subway station. permalink parent award report block reply couranto OP 0 points 5 days ago It certainly does. Read beyond.\nDig deeper. permalink parent award report block reply mykillk 1 points 5 days ago No it doesn't you're straight bullshitting now. permalink parent award report block reply\npixiepepe 1 points 5 days ago The \"bombs\" were planted the night before. permalink parent award report block reply mykillk 2 points 5 days ago I know but the point I'm making is OP linked to a The Blaze article, implying it connects this woman to the pipe bomb and it 100% does not. permalink parent award report block reply pixiepepe 2 points 5 days ago Yes, I haven't seen anything, beyond accusations, regarding this person being the same one planting the devices. I misunderstood your post. I remember,  a while back, there were accusations against some other person, a black guy employed in the government (military, Pentagon, maybe?), claiming he was the planter. Said something about him being followed by security cams to a parking lot at a DC subway station. permalink parent award report block reply\nmykillk 2 points 5 days ago I know but the point I'm making is OP linked to a The Blaze article, implying it connects this woman to the pipe bomb and it 100% does not. permalink parent award report block reply pixiepepe 2 points 5 days ago Yes, I haven't seen anything, beyond accusations, regarding this person being the same one planting the devices. I misunderstood your post. I remember,  a while back, there were accusations against some other person, a black guy employed in the government (military, Pentagon, maybe?), claiming he was the planter. Said something about him being followed by security cams to a parking lot at a DC subway station. permalink parent award report block reply\npixiepepe 2 points 5 days ago Yes, I haven't seen anything, beyond accusations, regarding this person being the same one planting the devices. I misunderstood your post. I remember,  a while back, there were accusations against some other person, a black guy employed in the government (military, Pentagon, maybe?), claiming he was the planter. Said something about him being followed by security cams to a parking lot at a DC subway station. permalink parent award report block reply\ncouranto OP 0 points 5 days ago It certainly does. Read beyond.\nDig deeper. permalink parent award report block reply mykillk 1 points 5 days ago No it doesn't you're straight bullshitting now. permalink parent award report block reply\nmykillk 1 points 5 days ago No it doesn't you're straight bullshitting now. permalink parent award report block reply\nCrowRezNeck 1 points 5 days ago That's a MAN...Babbbbby!!!! permalink award report block reply\nPlaquenil 1 points 5 days ago Here's the question everyone should be asking: does she know the woman who \"found\" the pipe bomb outside the RNC? permalink award report block reply\nDatamancer 1 points 5 days ago Patroit violence is like racism, they don't have enough so they make shit up. permalink award report block reply"}