{"id": "1ARK53K5ye", "contents": "555 22 States do not want to send their SNAP data to the Trump Administration to verify immigration status.\n\n21 of the 22 have Democrat Governors. posted 6 days ago by ALT26 24 comments award share report block C3 @C_3C_3 • 6d 22 States do not want to send their SNAP data to the Trump Administration to verify immigration status. 21 of the 22 have Democrat Governors. Now why do you think they are resisting? Because the fraud in the SNAP data is staggering. Illegals are getting it. Millions of them.\n24 comments Sort by Top Top New Worst Old Save Tim_Berframer 15 points 6 days ago .....and those Democratic governors were elected by illegals... permalink award report block reply 24601 8 points 6 days ago Some of them might even BE illegals. permalink parent award report block reply ColonelKlink 8 points 6 days ago Why bother funding those states then? permalink award report block reply 16BeatsAOne 10 points 6 days ago Exactly.  No data = No funding.  Then these Governors can sue the Trump Administration.  Go ahead.  Discovery should be delicious. permalink parent award report block reply MidnightGhost 8 points 6 days ago Nevada is the one with the republican governor!\nThe S.O.S is a piece of shit demonrat, so if this falls onto him to get out this data...then that is why.  SoS Aguilar was installed!!!\nI mean Lombardo is pretty limp dick soft and is up for reelection next year..so could by why! permalink award report block reply STIDGIT64 5 points 6 days ago So 21 Democrats control 21 states losing snap benefits so no Federal benefits. permalink award report block reply Scatter-Shot 5 points 6 days ago You meant to tell me the NSA who basically wiretaps the world can't get hold of SNAP data? permalink award report block reply Krat 2 points 6 days ago Not when it comes to democrats permalink parent award report block reply Shibbs70 3 points 5 days ago Simple solution - only fund the states that provided the data. Problem solved. permalink award report block reply mastermeatlock 3 points 6 days ago I know who the \"republican\" was, Glen Youngkin.  A worthless faggot. permalink award report block reply DingleBalls 3 points 6 days ago Its not just the illegals, its at least 2/3 of the citizens who are on it and don't need to be. permalink award report block reply Liberats 2 points 5 days ago So can he cut it off until they do? permalink award report block reply Krat 2 points 6 days ago Zero consequences permalink award report block reply perma-maga 2 points 6 days ago Go take it from them permalink award report block reply surgeriot 2 points 6 days ago Then cut off SNAP to those states permalink award report block reply onesummerdream 2 points 6 days ago Simple solution: no more funding until we review the data. permalink award report block reply AerialRush 2 points 6 days ago Then 21 states need to be fully investigated, have all funding cutoff and increased ICE presence. permalink award report block reply PhantomShield72 2 points 6 days ago Who is the \"Republican\"? permalink award report block reply NotYourMan 2 points 5 days ago Anything the federal government pays for should require audits.  The states should have been sending the SNAP data to the federal government all along. permalink award report block reply tired-of-crap 1 points 5 days ago This gives Trump a way to send a full payment to the compliance States while totally ignoring the states that have failed to provide the required data. permalink award report block reply tired-of-crap 1 points 5 days ago Courts have allowed withholding funds when the conditions of the funds have not been met. Pay ONLY states that have provided the data. Do this even AFTER reopen. permalink award report block reply HenkZeilstra 1 points 5 days ago So no money for them then simple permalink award report block reply Txiribiton 1 points 5 days ago The problem is they fucked DOGE. permalink award report block reply ltbadpuppy 1 points 6 days ago And when the data comes out proving it, dems will say its good that were feeding people and shouldn't stop it permalink award report block reply\nTim_Berframer 15 points 6 days ago .....and those Democratic governors were elected by illegals... permalink award report block reply 24601 8 points 6 days ago Some of them might even BE illegals. permalink parent award report block reply\n24601 8 points 6 days ago Some of them might even BE illegals. permalink parent award report block reply\nColonelKlink 8 points 6 days ago Why bother funding those states then? permalink award report block reply 16BeatsAOne 10 points 6 days ago Exactly.  No data = No funding.  Then these Governors can sue the Trump Administration.  Go ahead.  Discovery should be delicious. permalink parent award report block reply\n16BeatsAOne 10 points 6 days ago Exactly.  No data = No funding.  Then these Governors can sue the Trump Administration.  Go ahead.  Discovery should be delicious. permalink parent award report block reply\nMidnightGhost 8 points 6 days ago Nevada is the one with the republican governor!\nThe S.O.S is a piece of shit demonrat, so if this falls onto him to get out this data...then that is why.  SoS Aguilar was installed!!!\nI mean Lombardo is pretty limp dick soft and is up for reelection next year..so could by why! permalink award report block reply\nSTIDGIT64 5 points 6 days ago So 21 Democrats control 21 states losing snap benefits so no Federal benefits. permalink award report block reply\nScatter-Shot 5 points 6 days ago You meant to tell me the NSA who basically wiretaps the world can't get hold of SNAP data? permalink award report block reply Krat 2 points 6 days ago Not when it comes to democrats permalink parent award report block reply\nKrat 2 points 6 days ago Not when it comes to democrats permalink parent award report block reply\nShibbs70 3 points 5 days ago Simple solution - only fund the states that provided the data. Problem solved. permalink award report block reply\nmastermeatlock 3 points 6 days ago I know who the \"republican\" was, Glen Youngkin.  A worthless faggot. permalink award report block reply\nDingleBalls 3 points 6 days ago Its not just the illegals, its at least 2/3 of the citizens who are on it and don't need to be. permalink award report block reply\nLiberats 2 points 5 days ago So can he cut it off until they do? permalink award report block reply\nKrat 2 points 6 days ago Zero consequences permalink award report block reply\nperma-maga 2 points 6 days ago Go take it from them permalink award report block reply\nsurgeriot 2 points 6 days ago Then cut off SNAP to those states permalink award report block reply\nonesummerdream 2 points 6 days ago Simple solution: no more funding until we review the data. permalink award report block reply\nAerialRush 2 points 6 days ago Then 21 states need to be fully investigated, have all funding cutoff and increased ICE presence. permalink award report block reply\nPhantomShield72 2 points 6 days ago Who is the \"Republican\"? permalink award report block reply\nNotYourMan 2 points 5 days ago Anything the federal government pays for should require audits.  The states should have been sending the SNAP data to the federal government all along. permalink award report block reply\ntired-of-crap 1 points 5 days ago This gives Trump a way to send a full payment to the compliance States while totally ignoring the states that have failed to provide the required data. permalink award report block reply\ntired-of-crap 1 points 5 days ago Courts have allowed withholding funds when the conditions of the funds have not been met. Pay ONLY states that have provided the data. Do this even AFTER reopen. permalink award report block reply\nHenkZeilstra 1 points 5 days ago So no money for them then simple permalink award report block reply\nTxiribiton 1 points 5 days ago The problem is they fucked DOGE. permalink award report block reply\nltbadpuppy 1 points 6 days ago And when the data comes out proving it, dems will say its good that were feeding people and shouldn't stop it permalink award report block reply"}