{"id": "1ARK9hj6h9", "contents": "250 Gavin Newsome in Brazil.\n\nMy state is one of the most cursed states when it relates to climate change — You saw it with the Palisades fire.\n\nWait… I thought someone started that fire? Now it’s climate change again? posted 2 days ago by Eruditio 7 comments award share report block MJTruthUltra @MJTruthUltra • 2d Gavin Newsome in Brazil My state is one of the most cursed states when it relates to climate change — You saw it with the Palisades fire Wait… I thought someone started that fire? Now it’s climate change again? https://t.co/xCAAmuSdmc\n7 comments Sort by Top Top New Worst Old Save God-is-good 6 points 2 days ago All arsons are climate change. Climate change is currently defined as ‘Man made environmental changes’ so arson counts since a man made the environment change from livable to fire. Satanic semantics socialists permalink award report block reply MeMargie 3 points 2 days ago Do not let this Arsonist back on American soil. permalink award report block reply KeepingAmericaGreat 2 points 2 days ago Does Miken Institute stand for Milkin' the tax payers? permalink award report block reply Crappydatum 2 points 2 days ago Worse Milken was indicted for racketeering and securities fraud in 1989 in an insider trading investigation. In a plea bargain, he pleaded guilty to securities and reporting violations but not to racketeering or insider trading. Milken was sentenced to ten years in prison, fined $600 million (although his personal website claims $200 million)[7] and permanently barred from the securities industry by the U.S. Securities and Exchange Commission. His sentence was later reduced to two years for cooperating with testimony against his former colleagues and for good behavior.[8] Milken was pardoned by President Donald Trump on February 18, 2020. permalink parent award report block reply Crappydatum 1 points 2 days ago Working on their lawsuit defense permalink award report block reply CleanUpPhillyTrump24 1 points 2 days ago The whole world thinks Newscum is a moron of global proportions. permalink award report block reply redditadminssuckit 1 points 2 days ago Southern California Edison must've come through with his bribe permalink award report block reply\nGod-is-good 6 points 2 days ago All arsons are climate change. Climate change is currently defined as ‘Man made environmental changes’ so arson counts since a man made the environment change from livable to fire. Satanic semantics socialists permalink award report block reply\nMeMargie 3 points 2 days ago Do not let this Arsonist back on American soil. permalink award report block reply\nKeepingAmericaGreat 2 points 2 days ago Does Miken Institute stand for Milkin' the tax payers? permalink award report block reply Crappydatum 2 points 2 days ago Worse Milken was indicted for racketeering and securities fraud in 1989 in an insider trading investigation. In a plea bargain, he pleaded guilty to securities and reporting violations but not to racketeering or insider trading. Milken was sentenced to ten years in prison, fined $600 million (although his personal website claims $200 million)[7] and permanently barred from the securities industry by the U.S. Securities and Exchange Commission. His sentence was later reduced to two years for cooperating with testimony against his former colleagues and for good behavior.[8] Milken was pardoned by President Donald Trump on February 18, 2020. permalink parent award report block reply\nCrappydatum 2 points 2 days ago Worse Milken was indicted for racketeering and securities fraud in 1989 in an insider trading investigation. In a plea bargain, he pleaded guilty to securities and reporting violations but not to racketeering or insider trading. Milken was sentenced to ten years in prison, fined $600 million (although his personal website claims $200 million)[7] and permanently barred from the securities industry by the U.S. Securities and Exchange Commission. His sentence was later reduced to two years for cooperating with testimony against his former colleagues and for good behavior.[8] Milken was pardoned by President Donald Trump on February 18, 2020. permalink parent award report block reply\nCrappydatum 1 points 2 days ago Working on their lawsuit defense permalink award report block reply\nCleanUpPhillyTrump24 1 points 2 days ago The whole world thinks Newscum is a moron of global proportions. permalink award report block reply\nredditadminssuckit 1 points 2 days ago Southern California Edison must've come through with his bribe permalink award report block reply"}