{"id": "1ARK9nOXGU", "contents": "20 Don't let the decepticons split us up.  If we divide, they win!  Important article from Sundance. (theconservativetreehouse.com) posted 8 hours ago by Centipedealicious 6 comments award share report block The 2025 MAGA Fracture and the Benefactors Behind It - The Last Refuge On March 3rd through March 6th 2016, the Republican presidential primary was at the precipice of a key inflection point (Super Tuesday) when a large group of political leadership, tech titans, bankers and political influence agents assembled at the AEI sum... theconservativetreehouse.com\n6 comments Sort by Top Top New Worst Old Save Around the Web ChyNahAzzWhole1 3 points 8 hours ago stand firm do not let the can kickers win... DEPORT THEM ALL, Accountability, LOWER Taxes, Cheap Fuel, STOP the Cheating in Elections. RESCUE Tina Peters. permalink award report block reply MocksFordComma 3 points 8 hours ago There are definitely multiple obvious operations underway that are attempting to divide MAGA. permalink award report block reply Girthquakes 2 points 8 hours ago u/-f-b-i- could we maybe get something positive stickied? permalink award report block reply Girthquakes 2 points 8 hours ago 👍 permalink parent award report block reply Datamancer 1 points 8 hours ago I am going to vote in 2026 and unless there is a down-ticket state candidate that is more MAGA than the republican,  I am voting a straight Republican ticket.   Same in 2028. But outside of the locals in this community,  how many independents will?  We all know full fuck well that the libs will suck in every single vote - living or dead, legal or illegal - that they can.  They are motivated by anger and hate and those are powerful motivators. We are demotivated by disappointment. Every single solitary election from now until the day Christ establishes His kingdom on earth, is the most important election. permalink award report block reply Be_The_Change 3 points 8 hours ago Comment removed by community moderators. permalink award report block reply\nChyNahAzzWhole1 3 points 8 hours ago stand firm do not let the can kickers win... DEPORT THEM ALL, Accountability, LOWER Taxes, Cheap Fuel, STOP the Cheating in Elections. RESCUE Tina Peters. permalink award report block reply\nMocksFordComma 3 points 8 hours ago There are definitely multiple obvious operations underway that are attempting to divide MAGA. permalink award report block reply\nGirthquakes 2 points 8 hours ago u/-f-b-i- could we maybe get something positive stickied? permalink award report block reply Girthquakes 2 points 8 hours ago 👍 permalink parent award report block reply\nGirthquakes 2 points 8 hours ago 👍 permalink parent award report block reply\nDatamancer 1 points 8 hours ago I am going to vote in 2026 and unless there is a down-ticket state candidate that is more MAGA than the republican,  I am voting a straight Republican ticket.   Same in 2028. But outside of the locals in this community,  how many independents will?  We all know full fuck well that the libs will suck in every single vote - living or dead, legal or illegal - that they can.  They are motivated by anger and hate and those are powerful motivators. We are demotivated by disappointment. Every single solitary election from now until the day Christ establishes His kingdom on earth, is the most important election. permalink award report block reply\nBe_The_Change 3 points 8 hours ago Comment removed by community moderators. permalink award report block reply"}