{"id": "1ARK5132Q8", "contents": "963 Please pray for Scott this morning.  He is a good man with a great attitude. posted 6 days ago by KuzoKevin 93 comments award share report block jay plemons @jayplemons • 7d Scott Adams medical update Yesterday he completed the first of six rounds of Pluvicto, which will take several months and has a one in three chance of working. In addition to this, he will be doing BioShield. Please continue to pray for Scott!\n93 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style KuzoKevin OP 38 points 6 days ago The man obviously has no fear of death.  He'd just rather not right now. permalink award report block reply dontsteponsnek 11 points 6 days ago I think everyone would prefer death to be later than today permalink parent award report block reply Deplora 2 points 6 days ago Depends on their quality of life, and their realistic prospects for future quality of life.  Scott Adams clearly wants to try to stick around longer. permalink parent award report block reply 10MeV 2 points 6 days ago Having faced the same cancer in a life-threatening version myself, I have some empathy for Scott.  My brother-in-law helped me through it;  as a Christian, I know where I'm going to end up, and that's fine.  It's better than fine, it's great!   However, the \"getting there\" I'm not so crazy about.  And maybe not real soon? permalink parent award report block reply SubmarineGuy 31 points 6 days ago If this works his example is going to save a lot more lives than just Scott. permalink award report block reply KuzoKevin OP 16 points 6 days ago This.  And it will have Trump's attention as well. permalink parent award report block reply Pepe_longcockings 12 points 6 days ago Did he try ivermectin yet?   Might as well throw it in the mix.  No downside permalink award report block reply IHateUntruth 19 points 6 days ago He used Makis' protocol for a month, then stopped and starting talking shit about it. permalink parent award report block reply Reefay 4 points 6 days ago Clott's ego and pride...smh permalink parent award report block reply sixfingerdildo 8 points 6 days ago Just saw a thing on prostate cancer, went over details on why it's such a bad one. One of the aspects is the cancer has a very strong protective shell. It doesn't look like it's penetrable by free floating agents. Maybe if they could inject the medicine directly into the tumors. permalink parent award report block reply memechallenger33 3 points 6 days ago All cells have a blood supply. permalink parent award report block reply Leucophylla12 1 points 6 days ago That’s why we have antibody drug conjugates to interface with the precise signaling agents on the cancer cells.  There’s always a way in. permalink parent award report block reply sixfingerdildo 1 points 6 days ago do we? is that why prostate cancer is cured? permalink parent award report block reply Sgt_Hulka 12 points 6 days ago Why doesn’t he call Biden? Joe has supposedly had stage 4 cancer now for over a year.  Same kind of cancer that Adams has too, if memory serves. permalink award report block reply Decepticons-superior 6 points 6 days ago That’s a good question homie. That’s a good question. https://www.instagram.com/reel/C9u4VxDxeV_/ permalink parent award report block reply seeyouinvalhalla 2 points 6 days ago And Biden is out there giving speeches permalink parent award report block reply LostElf 9 points 6 days ago Man, he is so tough. He is in pain and still fighting for every day God provides. Total admiration. Any battle of health I'd get into would be as brief and cowardly on my part as I could manage without actually committing suicide. permalink award report block reply Smurfection 9 points 6 days ago Oh God, Almighty and Eternal Father, Please turn your compassionate and loving eyes toward Scott Adams.  See the good he has done and the suffering he's enduring and in the name of your beloved Son, Our Lord Jesus Christ, have mercy on him.   See Oh Lord, your people who worship you, plead with you for Scott Adams' life.   Hear us, Oh Lord, who in your great infinite being that encompasses all, can look upon he whom you made, and have mercy on him and on us. Oh, Jesus Christ, the lamb without spot or blemish who sits upon the throne, in your name, we plead with you for the life of Scott Adams. We will forever praise you and thank you for your Glory! permalink award report block reply TwoArizonaPedes 8 points 6 days ago Amen. permalink parent award report block reply lizardo221 6 points 6 days ago Bioshield is a very interesting treatment. permalink award report block reply PepePinochet 6 points 6 days ago He should try cutting glucose intake and get on the   Zelenko protocol. permalink award report block reply IHateUntruth 8 points 6 days ago Prostate cancers are generally much more reliant on fat than glucose. permalink parent award report block reply Emodius 4 points 6 days ago Really? Didn't know that permalink parent award report block reply IHateUntruth 10 points 6 days ago Most cancers are more glucose addicted but some heavily rely on fats instead and prostate is a textbook example. The prostate is unlike many other tissues in that instead of using citrate for energy in the Krebs cycle it gets diverted because seminal fluid needs high amounts of citrate to be stable. Prostate cancer subverts that and starts using citrate for energy and to make fats for lipid membranes, lipid rafts and cell signaling lipids. Fatty acid synthase (FASN) is usually one of the most upregulated genes in prostate cancer. So is AMACR. permalink parent award report block reply Smurfection 5 points 6 days ago That's extremely interesting.   Most cancers use glucose though so a low sugar or no sugar diet combined with Keto can help prevent cancers and aid in the treatment of existing cancers. I guess why prostrate cancer is such a tough one to beat is because it can simply use fat from the body to power it's growth. permalink parent award report block reply view 1 more comments... memechallenger33 2 points 6 days ago Very interesting.  How can prostate cancer use fat for energy?  All cancers have dysfunctional mitochondria.  I’m going to have to look into that more. permalink parent award report block reply view 2 more comments... Smurfection 2 points 6 days ago The Zelenko protocol is a preventive measure.  I don't think it cures anything.  I put my family on the Zelenko protocol in May 2020.   Since then, only two of us have gotten the common cold or flu in the last five years.   However, I don't think the Zelenko protocol cures or prevents everything.  It's a really good start, but it's a start. Dr. Zelenko and Dr. Sherri Tenpenny started me on the road to wellness and I have achieved health in a way I thought was never possible by continuing the wellness journey. permalink parent award report block reply TwoArizonaPedes 3 points 6 days ago Praying. permalink award report block reply knnbccb 3 points 6 days ago He took the Covid death shots, he lives with the consequences. Many, many out there, ordinary folks, who experienced something similar or worse. My fav movie quote from one of my fav characters: You should admit your situation. There would be more dignity in it. permalink award report block reply Smurfection 2 points 6 days ago Scott Adams had admitted this several times now.  What do you want him to do walk around in excruciating pain wearing a hair shirt whipping himself? Look, I'm a pureblood.  I convinced my husband and kids to not get the jab, mostly because my husband was very supportive of me when I brought it to his attention how bad mRNA jabs could be. I tried to warn 86 of my relatives in March 2021.  They laughed at me for being a Trump supporter and also because I had a recent conversion to Catholicism (2019).    I made handouts for all of them and spent money on steak dinners for them.  They threw away the handouts and called me a nut for two years.  I have 63 relatives today. How long do you want to make the ones who came to understand they were on the wrong side pay for being on the wrong side?  How much more do you want to put them through?   Instead of going after the ones who are truly hurting and have come to understand the problem in truth, how about directing the energy to those who are still acting like wimps, cowards and refuse to believe anything that isn't on TheNews™. permalink parent award report block reply KernalMustard 2 points 6 days ago Sorry to hear about your Conversion. permalink parent award report block reply Smurfection 3 points 6 days ago You shouldn't be.  I'm much happier, more fulfilled, more at peace, most loving, better as a wife and better as a mother.  One day, I hope you understand.  If someone told me while I was an atheist/agnostic, I'd be happier as a believer, I would probably say some snarky thing back too, like I had a point or something. IN fact, I said a lot of snarky things.  I mean a whole lot of them, all the time because I thought it was wit. I hope and pray one day you will understand. permalink parent award report block reply Chickapede 2 points 6 days ago Congratulations on your conversion.  You say you have 63 relatives today.  Did 23 die?  Did anyone who laughed at you ever apologize and say you were right? permalink parent award report block reply view 5 more comments... gezadreamsheets2 2 points 6 days ago I love you Scott Adam’s.  I would love it if start searching, is Jesus real? Read the Case for Christ, written by Lee Strobel! permalink award report block reply MAGAnic316 1 points 6 days ago There’s nothing that removes MRNA from the blood unfortunately. I don’t think it’s going to work, although I do hope I’m wrong. permalink award report block reply Maganifice7 1 points 6 days ago Must be nice to be able to make a social media post and have half the government offer to help you. permalink award report block reply seeyouinvalhalla 1 points 6 days ago He earned that right permalink parent award report block reply mechaet 1 points 6 days ago I \"guess\" I refuse. permalink award report block reply Seatacjoe 1 points 6 days ago We have flipped Scott some shit on here over the years for his stance on the clot shot.   He is of a lil older demographic than a bunch of us and he trusted.   I feel bad for Scott and I pray for him.   Please Lord, look over our brother Scott and help him beat this commie man made disease.   He is a good man.   Thank you Jesus. permalink award report block reply ShekelJa 1 points 6 days ago he should also dive into ivermectin and fenbendazole, can be done in conjunction with anything else. Apparently he id it for a short while and proceeded to complain that it did not work. Never heard of stories where people try it for such a short duration to get anything meaningful outt of it permalink award report block reply DeplorableWolverine 1 points 6 days ago He supposedly quit because PSA went up during treatment.  I’m not saying that’s a bad sign, but you can bet his doctors did. permalink parent award report block reply dtrap 1 points 6 days ago Stop eating sugar(carbohydrates) and take the anti-parasite drugs. permalink award report block reply tootthebighorn 1 points 6 days ago Always liked Dilbert's creator permalink award report block reply FrensInLowPlaces 1 points 6 days ago Isn't he a pretty open atheist?  He also designed a vegan burrito in the 90s that was awful.  Ill pray for him because he a suffering human but it doesnt mean hes a good person.  He needs to turn toward God himself also permalink award report block reply Wexit-Delecto -1 points 6 days ago Cancer cells cannot use ketone bodies as energy. Only glucose. Ketosis is a cure for cancer. permalink award report block reply Smurfection 0 points 6 days ago actually, as per IHateUntruth as above, prostrate cancer is one of the few cancers that can use fat.  Human bodies don't need sugar at all....the sugar we do need can be made via a process called gluconeogensis.   However, humans do need fat to live.  Prostrate cancer is one of the cancers that can use body fat. permalink parent award report block reply Wexit-Delecto 3 points 6 days ago u/IHateUntruth I would invite him to expand on that further. There is ample research suggesting a keto diet affects prostate cancer roughly the same as all other cancer cells. It is unclear from this user's post whether a high fat diet aggravates the condition he describes, since fats consumed orally don't enter the blood as fat, but as triglycerides. He said: some heavily rely on fats instead and prostate is a textbook example ... did he mean to say they rely on triglycerides? Because if not, dietary fat would not be feeding fats to prostate, or any other cells. Typically, one finds high triglycerides and high body fat content in people who are not in ketosis, since their bodies don't consume fat as fuel. Once one enters ketosis, one's body fat typically melts away since all fat, everywhere, is fuel. I consider it far more likely that \"being fat\" aggravates the condition that user describes, rather than \"being in ketosis.\" However, I'm just an autistic retard who outsmarted trillions of dollars in propaganda and the entire health care system and all the \"experts\" on covid and the poison vaxxes, it's very possible I'm just wrong. permalink parent award report block reply Smurfection 3 points 6 days ago Ya know, I want to see IHateUntruth expand on this as well.   I hope he provides a link or something to back it up.   I do not have a medical degree and I dabble in the subject so by no means can I accurately evaluate this. I just googled it and was surprised to see some indication that he may be right.   As per other doctors I watch on YouTube etc, they say all cancers thrive on glucose and in all cases getting the body as close to zero sugar as possible is a good thing and aids in prevention, treatment and recovery. I've been Keto now for almost three years now, off and on.  I have had enormous improvement in my physical health, mental health, energy levels and my cooking skills even dramatically improved.  The keto recipes I've come up with are great! I can't judge though, between what you're saying and what he's saying.  I just noticed that there was some evidence he's right and again, I can't really fully evaluate it.  I'd love to see you and u/IHateUntruth discuss this. permalink parent award report block reply Wexit-Delecto 2 points 6 days ago I have had a similar experience with going on a high fat diet and existing in ketosis. If not doing this causes cancer, and doing this also causes cancer, we're fucked either way which doesn't seem quite right. permalink parent award report block reply view 7 more comments... IHateUntruth 1 points 6 days ago I can't see the parent comment for some reason, but I explained more here: https://patriots.win/p/1ARK5132Q8/please-pray-for-scott-this-morni/c/4eXu1OpVzW7 I don't have papers for you on hand, this is just stuff I know, but you can confirm by looking at the research literature on google scholar or something permalink parent award report block reply IHateUntruth 2 points 6 days ago For some reason this post was not visible to me and I had to use a private tab to find it... First, you're right (and I did mention this in another post), a full on keto diet where the body is running more on ketone oxidation than fatty acid oxidation would still be a good idea for this cancer. But not just merely reducing glucose intake some. And preferably high MCT. For most keto diets it's still >60% FAO to <40% KO. It is unclear from this user's post whether a high fat diet aggravates the condition he describes, since fats consumed orally don't enter the blood as fat, but as triglycerides... did he mean to say they rely on triglycerides? Because if not, dietary fat would not be feeding fats to prostate, or any other cells. It's the same thing, effectively. If we want to be super technical, cells can't actually absorb triglycerides because they're too big and hydrophobic to diffuse or use FATPs the way free fatty acids do. TGs are packaged as chylomicrons. And the chylomicron is broken down outside the cell by LPL to deliver FFAs across the cell membrane. What we're dealing with is FFAs from lipolysis as well as from chylomicrons from meals and an endocytosed contribution from VLDL too. That's all just a description of the systemic transport mechanisms, not the tissue/cell level metabolic mechanisms. It's all fatty acid metabolism at the cell level. Regardless of how the fats get to the cell - as FFAs, TG-bearing chylomicrons, or VLDL - they become FFAs and then 'fatty acyl-CoA' in the cytoplasm and undergo beta oxidation or are otherwise used in exactly the same way. Fatty acid metabolism is distinct from ketone metabolism, especially in terms of cancer. Fatty acids produce FADH2 when oxidized. FADH2 is responsible for delivering electrons to Complex II of the Electron Transport Chain (ETC). This is a low reactive oxygen species (ROS) route. Remember, cancer is vulnerable to oxidative stress from those ROS. High FADH2 = low stress = low vulnerability. Ketones don't produce any FADH2 when oxidized which increases cancer's ROS burden. Further to that effect, ketones are metabolized thru Complex I, which generally yields more ROS. Also, FAO produces over 6x the amount of NADH than the equivalent in KO. NADH is a reducing agent and protects the cancer from oxidative stress, and can also promote glycolysis by modulating the Krebs cycle. It also helps export citrate which if converted to itaconate will further activate HIF. And the exported citrate also promotes cytoplasmic biosynthesis of fats and their uses. The high NADH also reduces the NAD+/NADH ratio, inhibiting sirtuins which are usually a brake on cell proliferation. Another important aspect is that unlike FAO ketone oxidation depletes succinyl-CoA from the Krebs cycle. Succinyl-CoA is important for biosyntheses that cancers rely on to grow and protect themselves. It also helps stabilize and activate the hypoxia sensor HIF which is important to cancer metabolism and signaling (driving glycolysis, etc.) It also helps make heme which cancer uses to drive further cataplerosis. Further, aside from oxidative metabolism, fatty acids are also important building blocks for cell membranes, lipid rafts, lipid droplets (energy stores helping cells survive stress) and a variety of signaling molecules (eicosanoids, glycolipids, sphingolipids, etc.) and post-translational modifications (for example, palmitoylation of Wnt from palmitic acid). Ketones can't do any of that, they can only be burned. And many cancers are deficient in ketone metabolizing enzymes like OXCT1 so they can't even get much energy from them - the body is fed but the cancer is starved. There are a few cancers that thrive on ketones, but those are rare and this is not one of them. I will repeat though that most keto diets are still >60% FAO. permalink parent award report block reply Wexit-Delecto 1 points 6 days ago Thank you, very informative, and good to confirm that a good keto diet in which you're turning lots of fat into ketone bodies is hostile to most cancers. Honestly, the only problem most people have getting into such a diet is lack of willpower. permalink parent award report block reply Reefay -2 points 6 days ago Nope. permalink award report block reply R3tro -3 points 6 days ago Maybe he should take fenbendazole and horse paste (that he made fun of during covid times) permalink award report block reply IHateUntruth -3 points 6 days ago He should use herbs. Unfortunately that information is blocked from getting to him. permalink award report block reply Smurfection 2 points 6 days ago What herbs? I am not doubting you but do you have a link or something to herbs that can help treat prostrate cancer? permalink parent award report block reply BBWasHere -11 points 6 days ago Fuck clot Adams. permalink award report block reply mechaet 3 points 6 days ago Pretty much this. I \"guess\" that makes me a bad person, but one can \"guess\" I don't give a flying fuck. Clott Adams took the vax, and got turbo ass-cancer. Cue the surprised pikachu face. permalink parent award report block reply Wexit-Delecto 2 points 6 days ago I'm not sure if \"fuck him\" is the correct response. He's been fairly consistently on our side and simply lacked the mental acuity to recognize the vaxx was a cancer-inducing poison. He got into this situation out of confusion, not out of malice. permalink parent award report block reply Reefay 5 points 6 days ago He was an arrogant asshole and still didn't even mea culpa when he figured out he was wrong. Fuck him. permalink parent award report block reply KuzoKevin OP 1 points 6 days ago He didn't force anyone to do anything.  Fuck off. permalink parent award report block reply Reefay 0 points 6 days ago Sorry didn't mean to disparage your boyfriend permalink parent award report block reply view 4 more comments... Smurfection 0 points 6 days ago yes he did.  He did so on three different occasions I can name.   Granted the first two weren't all that complete but the third one was.   You just don't want to accept that he came full circle.  I can understand that.  I was fighting a daily battle to keep my husband and my kids purebloods.   I got ostracized from my family along with my husband and kids.  We got disinvited from Thanksgiving and Easter on both sides.  I had to tell my daughter she couldn't take a class trip to Ireland.   You just try to tell an 18 year old girl she can't go to Ireland with her friends. Scott Adams eventually joined us.  He got on board late but he did get on board. permalink parent award report block reply Reefay 0 points 6 days ago Too little too late for me. When the whole covid shot came out he should have said hey I'm a cartoon peddler and I'm not a scientist. I'm going to get this shot but make your own decision. But what he did was ridicule and use his authority of being wealthy and smarter than thou. It just doesn't sit well with me and it never will. No matter how many apologies he gives now. He should have just come out right at the beginning and said I'm really sorry I really hope that the cancer takes him so that maybe he'll realize how much of an asshole he was permalink parent award report block reply view 5 more comments... Smurfection 3 points 6 days ago yep.  Scott Adams has also said a few times now, he was wrong about the jab.   There were a lot of good people who were duped.   At the time, I was more upset with them because each person who went along with the psyop was another person adding to the psyop and adding to the pressure on purebloods like me.  Each time an employee let an employer dictate what medical injections had to be administered was another convention that kept employers out of employee's healthcare and medical treatments that eroded.  Bulwark after Bulwark was crumbling by every smiling goon who stuck out their arms and received the poison jab.  Many of them paid with their lives for that and more paid with their health.  It's more than five years now.   I forgive the ones who admit the error, wholeheartedly and completely, but the ones who still hang to this authoritarian delusion, are my enemies.  Scott Adams isn't one of those. permalink parent award report block reply Wexit-Delecto 1 points 6 days ago My sentiments exactly. permalink parent award report block reply BBWasHere 2 points 4 days ago he attepmted to belittle those who refused because he was \"superior\". fuck him permalink parent award report block reply God-is-good -1 points 6 days ago As we slowly watch Scott deservedly die the sugar coating from sycophants gains layers of thickness capable of choking the simplest minds. How quickly they forget. Perhaps for the confectioners Scott was right and they simply guessed correctly on covid. permalink parent award report block reply Smurfection 4 points 6 days ago Wow!  Just wow!  I can't believe you have a username like God-is-good and then go on to say Scott Adams deserves to die.   We all deserve to die and we all will because the wages of sin is death.  That wasn't what God wanted for us though and God doesn't want us to feel pain, die in agony and constantly fear death.  That's not what our loving creator wanted for us.  We did that to ourselves.  All of our deaths, we do to ourselves.   You think God wants Scott Adams to be sick, in agony, despairing and fighting for his life every hour of every day?   God made eternal life for us because we screwed up the prospect of our natural eternal life.   He didn't want us to die.  He wanted to walk with us in the Garden of Eden in the cool of the evening every night and talk to us about our mundane days and nights.  Scott Adams needs prayers not sermons and the same for all of us. permalink parent award report block reply\nKuzoKevin OP 38 points 6 days ago The man obviously has no fear of death.  He'd just rather not right now. permalink award report block reply dontsteponsnek 11 points 6 days ago I think everyone would prefer death to be later than today permalink parent award report block reply Deplora 2 points 6 days ago Depends on their quality of life, and their realistic prospects for future quality of life.  Scott Adams clearly wants to try to stick around longer. permalink parent award report block reply 10MeV 2 points 6 days ago Having faced the same cancer in a life-threatening version myself, I have some empathy for Scott.  My brother-in-law helped me through it;  as a Christian, I know where I'm going to end up, and that's fine.  It's better than fine, it's great!   However, the \"getting there\" I'm not so crazy about.  And maybe not real soon? permalink parent award report block reply\ndontsteponsnek 11 points 6 days ago I think everyone would prefer death to be later than today permalink parent award report block reply Deplora 2 points 6 days ago Depends on their quality of life, and their realistic prospects for future quality of life.  Scott Adams clearly wants to try to stick around longer. permalink parent award report block reply\nDeplora 2 points 6 days ago Depends on their quality of life, and their realistic prospects for future quality of life.  Scott Adams clearly wants to try to stick around longer. permalink parent award report block reply\n10MeV 2 points 6 days ago Having faced the same cancer in a life-threatening version myself, I have some empathy for Scott.  My brother-in-law helped me through it;  as a Christian, I know where I'm going to end up, and that's fine.  It's better than fine, it's great!   However, the \"getting there\" I'm not so crazy about.  And maybe not real soon? permalink parent award report block reply\nSubmarineGuy 31 points 6 days ago If this works his example is going to save a lot more lives than just Scott. permalink award report block reply KuzoKevin OP 16 points 6 days ago This.  And it will have Trump's attention as well. permalink parent award report block reply\nKuzoKevin OP 16 points 6 days ago This.  And it will have Trump's attention as well. permalink parent award report block reply\nPepe_longcockings 12 points 6 days ago Did he try ivermectin yet?   Might as well throw it in the mix.  No downside permalink award report block reply IHateUntruth 19 points 6 days ago He used Makis' protocol for a month, then stopped and starting talking shit about it. permalink parent award report block reply Reefay 4 points 6 days ago Clott's ego and pride...smh permalink parent award report block reply sixfingerdildo 8 points 6 days ago Just saw a thing on prostate cancer, went over details on why it's such a bad one. One of the aspects is the cancer has a very strong protective shell. It doesn't look like it's penetrable by free floating agents. Maybe if they could inject the medicine directly into the tumors. permalink parent award report block reply memechallenger33 3 points 6 days ago All cells have a blood supply. permalink parent award report block reply Leucophylla12 1 points 6 days ago That’s why we have antibody drug conjugates to interface with the precise signaling agents on the cancer cells.  There’s always a way in. permalink parent award report block reply sixfingerdildo 1 points 6 days ago do we? is that why prostate cancer is cured? permalink parent award report block reply\nIHateUntruth 19 points 6 days ago He used Makis' protocol for a month, then stopped and starting talking shit about it. permalink parent award report block reply Reefay 4 points 6 days ago Clott's ego and pride...smh permalink parent award report block reply\nReefay 4 points 6 days ago Clott's ego and pride...smh permalink parent award report block reply\nsixfingerdildo 8 points 6 days ago Just saw a thing on prostate cancer, went over details on why it's such a bad one. One of the aspects is the cancer has a very strong protective shell. It doesn't look like it's penetrable by free floating agents. Maybe if they could inject the medicine directly into the tumors. permalink parent award report block reply memechallenger33 3 points 6 days ago All cells have a blood supply. permalink parent award report block reply Leucophylla12 1 points 6 days ago That’s why we have antibody drug conjugates to interface with the precise signaling agents on the cancer cells.  There’s always a way in. permalink parent award report block reply sixfingerdildo 1 points 6 days ago do we? is that why prostate cancer is cured? permalink parent award report block reply\nmemechallenger33 3 points 6 days ago All cells have a blood supply. permalink parent award report block reply\nLeucophylla12 1 points 6 days ago That’s why we have antibody drug conjugates to interface with the precise signaling agents on the cancer cells.  There’s always a way in. permalink parent award report block reply sixfingerdildo 1 points 6 days ago do we? is that why prostate cancer is cured? permalink parent award report block reply\nsixfingerdildo 1 points 6 days ago do we? is that why prostate cancer is cured? permalink parent award report block reply\nSgt_Hulka 12 points 6 days ago Why doesn’t he call Biden? Joe has supposedly had stage 4 cancer now for over a year.  Same kind of cancer that Adams has too, if memory serves. permalink award report block reply Decepticons-superior 6 points 6 days ago That’s a good question homie. That’s a good question. https://www.instagram.com/reel/C9u4VxDxeV_/ permalink parent award report block reply seeyouinvalhalla 2 points 6 days ago And Biden is out there giving speeches permalink parent award report block reply\nDecepticons-superior 6 points 6 days ago That’s a good question homie. That’s a good question. https://www.instagram.com/reel/C9u4VxDxeV_/ permalink parent award report block reply\nseeyouinvalhalla 2 points 6 days ago And Biden is out there giving speeches permalink parent award report block reply\nLostElf 9 points 6 days ago Man, he is so tough. He is in pain and still fighting for every day God provides. Total admiration. Any battle of health I'd get into would be as brief and cowardly on my part as I could manage without actually committing suicide. permalink award report block reply\nSmurfection 9 points 6 days ago Oh God, Almighty and Eternal Father, Please turn your compassionate and loving eyes toward Scott Adams.  See the good he has done and the suffering he's enduring and in the name of your beloved Son, Our Lord Jesus Christ, have mercy on him.   See Oh Lord, your people who worship you, plead with you for Scott Adams' life.   Hear us, Oh Lord, who in your great infinite being that encompasses all, can look upon he whom you made, and have mercy on him and on us. Oh, Jesus Christ, the lamb without spot or blemish who sits upon the throne, in your name, we plead with you for the life of Scott Adams. We will forever praise you and thank you for your Glory! permalink award report block reply TwoArizonaPedes 8 points 6 days ago Amen. permalink parent award report block reply\nTwoArizonaPedes 8 points 6 days ago Amen. permalink parent award report block reply\nlizardo221 6 points 6 days ago Bioshield is a very interesting treatment. permalink award report block reply\nPepePinochet 6 points 6 days ago He should try cutting glucose intake and get on the   Zelenko protocol. permalink award report block reply IHateUntruth 8 points 6 days ago Prostate cancers are generally much more reliant on fat than glucose. permalink parent award report block reply Emodius 4 points 6 days ago Really? Didn't know that permalink parent award report block reply IHateUntruth 10 points 6 days ago Most cancers are more glucose addicted but some heavily rely on fats instead and prostate is a textbook example. The prostate is unlike many other tissues in that instead of using citrate for energy in the Krebs cycle it gets diverted because seminal fluid needs high amounts of citrate to be stable. Prostate cancer subverts that and starts using citrate for energy and to make fats for lipid membranes, lipid rafts and cell signaling lipids. Fatty acid synthase (FASN) is usually one of the most upregulated genes in prostate cancer. So is AMACR. permalink parent award report block reply Smurfection 5 points 6 days ago That's extremely interesting.   Most cancers use glucose though so a low sugar or no sugar diet combined with Keto can help prevent cancers and aid in the treatment of existing cancers. I guess why prostrate cancer is such a tough one to beat is because it can simply use fat from the body to power it's growth. permalink parent award report block reply view 1 more comments... memechallenger33 2 points 6 days ago Very interesting.  How can prostate cancer use fat for energy?  All cancers have dysfunctional mitochondria.  I’m going to have to look into that more. permalink parent award report block reply view 2 more comments... Smurfection 2 points 6 days ago The Zelenko protocol is a preventive measure.  I don't think it cures anything.  I put my family on the Zelenko protocol in May 2020.   Since then, only two of us have gotten the common cold or flu in the last five years.   However, I don't think the Zelenko protocol cures or prevents everything.  It's a really good start, but it's a start. Dr. Zelenko and Dr. Sherri Tenpenny started me on the road to wellness and I have achieved health in a way I thought was never possible by continuing the wellness journey. permalink parent award report block reply\nIHateUntruth 8 points 6 days ago Prostate cancers are generally much more reliant on fat than glucose. permalink parent award report block reply Emodius 4 points 6 days ago Really? Didn't know that permalink parent award report block reply IHateUntruth 10 points 6 days ago Most cancers are more glucose addicted but some heavily rely on fats instead and prostate is a textbook example. The prostate is unlike many other tissues in that instead of using citrate for energy in the Krebs cycle it gets diverted because seminal fluid needs high amounts of citrate to be stable. Prostate cancer subverts that and starts using citrate for energy and to make fats for lipid membranes, lipid rafts and cell signaling lipids. Fatty acid synthase (FASN) is usually one of the most upregulated genes in prostate cancer. So is AMACR. permalink parent award report block reply Smurfection 5 points 6 days ago That's extremely interesting.   Most cancers use glucose though so a low sugar or no sugar diet combined with Keto can help prevent cancers and aid in the treatment of existing cancers. I guess why prostrate cancer is such a tough one to beat is because it can simply use fat from the body to power it's growth. permalink parent award report block reply view 1 more comments... memechallenger33 2 points 6 days ago Very interesting.  How can prostate cancer use fat for energy?  All cancers have dysfunctional mitochondria.  I’m going to have to look into that more. permalink parent award report block reply view 2 more comments...\nEmodius 4 points 6 days ago Really? Didn't know that permalink parent award report block reply IHateUntruth 10 points 6 days ago Most cancers are more glucose addicted but some heavily rely on fats instead and prostate is a textbook example. The prostate is unlike many other tissues in that instead of using citrate for energy in the Krebs cycle it gets diverted because seminal fluid needs high amounts of citrate to be stable. Prostate cancer subverts that and starts using citrate for energy and to make fats for lipid membranes, lipid rafts and cell signaling lipids. Fatty acid synthase (FASN) is usually one of the most upregulated genes in prostate cancer. So is AMACR. permalink parent award report block reply Smurfection 5 points 6 days ago That's extremely interesting.   Most cancers use glucose though so a low sugar or no sugar diet combined with Keto can help prevent cancers and aid in the treatment of existing cancers. I guess why prostrate cancer is such a tough one to beat is because it can simply use fat from the body to power it's growth. permalink parent award report block reply view 1 more comments... memechallenger33 2 points 6 days ago Very interesting.  How can prostate cancer use fat for energy?  All cancers have dysfunctional mitochondria.  I’m going to have to look into that more. permalink parent award report block reply view 2 more comments...\nIHateUntruth 10 points 6 days ago Most cancers are more glucose addicted but some heavily rely on fats instead and prostate is a textbook example. The prostate is unlike many other tissues in that instead of using citrate for energy in the Krebs cycle it gets diverted because seminal fluid needs high amounts of citrate to be stable. Prostate cancer subverts that and starts using citrate for energy and to make fats for lipid membranes, lipid rafts and cell signaling lipids. Fatty acid synthase (FASN) is usually one of the most upregulated genes in prostate cancer. So is AMACR. permalink parent award report block reply Smurfection 5 points 6 days ago That's extremely interesting.   Most cancers use glucose though so a low sugar or no sugar diet combined with Keto can help prevent cancers and aid in the treatment of existing cancers. I guess why prostrate cancer is such a tough one to beat is because it can simply use fat from the body to power it's growth. permalink parent award report block reply view 1 more comments... memechallenger33 2 points 6 days ago Very interesting.  How can prostate cancer use fat for energy?  All cancers have dysfunctional mitochondria.  I’m going to have to look into that more. permalink parent award report block reply view 2 more comments...\nSmurfection 5 points 6 days ago That's extremely interesting.   Most cancers use glucose though so a low sugar or no sugar diet combined with Keto can help prevent cancers and aid in the treatment of existing cancers. I guess why prostrate cancer is such a tough one to beat is because it can simply use fat from the body to power it's growth. permalink parent award report block reply view 1 more comments...\nmemechallenger33 2 points 6 days ago Very interesting.  How can prostate cancer use fat for energy?  All cancers have dysfunctional mitochondria.  I’m going to have to look into that more. permalink parent award report block reply view 2 more comments...\nSmurfection 2 points 6 days ago The Zelenko protocol is a preventive measure.  I don't think it cures anything.  I put my family on the Zelenko protocol in May 2020.   Since then, only two of us have gotten the common cold or flu in the last five years.   However, I don't think the Zelenko protocol cures or prevents everything.  It's a really good start, but it's a start. Dr. Zelenko and Dr. Sherri Tenpenny started me on the road to wellness and I have achieved health in a way I thought was never possible by continuing the wellness journey. permalink parent award report block reply\nTwoArizonaPedes 3 points 6 days ago Praying. permalink award report block reply\nknnbccb 3 points 6 days ago He took the Covid death shots, he lives with the consequences. Many, many out there, ordinary folks, who experienced something similar or worse. My fav movie quote from one of my fav characters: You should admit your situation. There would be more dignity in it. permalink award report block reply Smurfection 2 points 6 days ago Scott Adams had admitted this several times now.  What do you want him to do walk around in excruciating pain wearing a hair shirt whipping himself? Look, I'm a pureblood.  I convinced my husband and kids to not get the jab, mostly because my husband was very supportive of me when I brought it to his attention how bad mRNA jabs could be. I tried to warn 86 of my relatives in March 2021.  They laughed at me for being a Trump supporter and also because I had a recent conversion to Catholicism (2019).    I made handouts for all of them and spent money on steak dinners for them.  They threw away the handouts and called me a nut for two years.  I have 63 relatives today. How long do you want to make the ones who came to understand they were on the wrong side pay for being on the wrong side?  How much more do you want to put them through?   Instead of going after the ones who are truly hurting and have come to understand the problem in truth, how about directing the energy to those who are still acting like wimps, cowards and refuse to believe anything that isn't on TheNews™. permalink parent award report block reply KernalMustard 2 points 6 days ago Sorry to hear about your Conversion. permalink parent award report block reply Smurfection 3 points 6 days ago You shouldn't be.  I'm much happier, more fulfilled, more at peace, most loving, better as a wife and better as a mother.  One day, I hope you understand.  If someone told me while I was an atheist/agnostic, I'd be happier as a believer, I would probably say some snarky thing back too, like I had a point or something. IN fact, I said a lot of snarky things.  I mean a whole lot of them, all the time because I thought it was wit. I hope and pray one day you will understand. permalink parent award report block reply Chickapede 2 points 6 days ago Congratulations on your conversion.  You say you have 63 relatives today.  Did 23 die?  Did anyone who laughed at you ever apologize and say you were right? permalink parent award report block reply view 5 more comments...\nSmurfection 2 points 6 days ago Scott Adams had admitted this several times now.  What do you want him to do walk around in excruciating pain wearing a hair shirt whipping himself? Look, I'm a pureblood.  I convinced my husband and kids to not get the jab, mostly because my husband was very supportive of me when I brought it to his attention how bad mRNA jabs could be. I tried to warn 86 of my relatives in March 2021.  They laughed at me for being a Trump supporter and also because I had a recent conversion to Catholicism (2019).    I made handouts for all of them and spent money on steak dinners for them.  They threw away the handouts and called me a nut for two years.  I have 63 relatives today. How long do you want to make the ones who came to understand they were on the wrong side pay for being on the wrong side?  How much more do you want to put them through?   Instead of going after the ones who are truly hurting and have come to understand the problem in truth, how about directing the energy to those who are still acting like wimps, cowards and refuse to believe anything that isn't on TheNews™. permalink parent award report block reply KernalMustard 2 points 6 days ago Sorry to hear about your Conversion. permalink parent award report block reply Smurfection 3 points 6 days ago You shouldn't be.  I'm much happier, more fulfilled, more at peace, most loving, better as a wife and better as a mother.  One day, I hope you understand.  If someone told me while I was an atheist/agnostic, I'd be happier as a believer, I would probably say some snarky thing back too, like I had a point or something. IN fact, I said a lot of snarky things.  I mean a whole lot of them, all the time because I thought it was wit. I hope and pray one day you will understand. permalink parent award report block reply Chickapede 2 points 6 days ago Congratulations on your conversion.  You say you have 63 relatives today.  Did 23 die?  Did anyone who laughed at you ever apologize and say you were right? permalink parent award report block reply view 5 more comments...\nKernalMustard 2 points 6 days ago Sorry to hear about your Conversion. permalink parent award report block reply Smurfection 3 points 6 days ago You shouldn't be.  I'm much happier, more fulfilled, more at peace, most loving, better as a wife and better as a mother.  One day, I hope you understand.  If someone told me while I was an atheist/agnostic, I'd be happier as a believer, I would probably say some snarky thing back too, like I had a point or something. IN fact, I said a lot of snarky things.  I mean a whole lot of them, all the time because I thought it was wit. I hope and pray one day you will understand. permalink parent award report block reply Chickapede 2 points 6 days ago Congratulations on your conversion.  You say you have 63 relatives today.  Did 23 die?  Did anyone who laughed at you ever apologize and say you were right? permalink parent award report block reply view 5 more comments...\nSmurfection 3 points 6 days ago You shouldn't be.  I'm much happier, more fulfilled, more at peace, most loving, better as a wife and better as a mother.  One day, I hope you understand.  If someone told me while I was an atheist/agnostic, I'd be happier as a believer, I would probably say some snarky thing back too, like I had a point or something. IN fact, I said a lot of snarky things.  I mean a whole lot of them, all the time because I thought it was wit. I hope and pray one day you will understand. permalink parent award report block reply Chickapede 2 points 6 days ago Congratulations on your conversion.  You say you have 63 relatives today.  Did 23 die?  Did anyone who laughed at you ever apologize and say you were right? permalink parent award report block reply view 5 more comments...\nChickapede 2 points 6 days ago Congratulations on your conversion.  You say you have 63 relatives today.  Did 23 die?  Did anyone who laughed at you ever apologize and say you were right? permalink parent award report block reply view 5 more comments...\ngezadreamsheets2 2 points 6 days ago I love you Scott Adam’s.  I would love it if start searching, is Jesus real? Read the Case for Christ, written by Lee Strobel! permalink award report block reply\nMAGAnic316 1 points 6 days ago There’s nothing that removes MRNA from the blood unfortunately. I don’t think it’s going to work, although I do hope I’m wrong. permalink award report block reply\nMaganifice7 1 points 6 days ago Must be nice to be able to make a social media post and have half the government offer to help you. permalink award report block reply seeyouinvalhalla 1 points 6 days ago He earned that right permalink parent award report block reply\nseeyouinvalhalla 1 points 6 days ago He earned that right permalink parent award report block reply\nmechaet 1 points 6 days ago I \"guess\" I refuse. permalink award report block reply\nSeatacjoe 1 points 6 days ago We have flipped Scott some shit on here over the years for his stance on the clot shot.   He is of a lil older demographic than a bunch of us and he trusted.   I feel bad for Scott and I pray for him.   Please Lord, look over our brother Scott and help him beat this commie man made disease.   He is a good man.   Thank you Jesus. permalink award report block reply\nShekelJa 1 points 6 days ago he should also dive into ivermectin and fenbendazole, can be done in conjunction with anything else. Apparently he id it for a short while and proceeded to complain that it did not work. Never heard of stories where people try it for such a short duration to get anything meaningful outt of it permalink award report block reply DeplorableWolverine 1 points 6 days ago He supposedly quit because PSA went up during treatment.  I’m not saying that’s a bad sign, but you can bet his doctors did. permalink parent award report block reply\nDeplorableWolverine 1 points 6 days ago He supposedly quit because PSA went up during treatment.  I’m not saying that’s a bad sign, but you can bet his doctors did. permalink parent award report block reply\ndtrap 1 points 6 days ago Stop eating sugar(carbohydrates) and take the anti-parasite drugs. permalink award report block reply\ntootthebighorn 1 points 6 days ago Always liked Dilbert's creator permalink award report block reply\nFrensInLowPlaces 1 points 6 days ago Isn't he a pretty open atheist?  He also designed a vegan burrito in the 90s that was awful.  Ill pray for him because he a suffering human but it doesnt mean hes a good person.  He needs to turn toward God himself also permalink award report block reply\nWexit-Delecto -1 points 6 days ago Cancer cells cannot use ketone bodies as energy. Only glucose. Ketosis is a cure for cancer. permalink award report block reply Smurfection 0 points 6 days ago actually, as per IHateUntruth as above, prostrate cancer is one of the few cancers that can use fat.  Human bodies don't need sugar at all....the sugar we do need can be made via a process called gluconeogensis.   However, humans do need fat to live.  Prostrate cancer is one of the cancers that can use body fat. permalink parent award report block reply Wexit-Delecto 3 points 6 days ago u/IHateUntruth I would invite him to expand on that further. There is ample research suggesting a keto diet affects prostate cancer roughly the same as all other cancer cells. It is unclear from this user's post whether a high fat diet aggravates the condition he describes, since fats consumed orally don't enter the blood as fat, but as triglycerides. He said: some heavily rely on fats instead and prostate is a textbook example ... did he mean to say they rely on triglycerides? Because if not, dietary fat would not be feeding fats to prostate, or any other cells. Typically, one finds high triglycerides and high body fat content in people who are not in ketosis, since their bodies don't consume fat as fuel. Once one enters ketosis, one's body fat typically melts away since all fat, everywhere, is fuel. I consider it far more likely that \"being fat\" aggravates the condition that user describes, rather than \"being in ketosis.\" However, I'm just an autistic retard who outsmarted trillions of dollars in propaganda and the entire health care system and all the \"experts\" on covid and the poison vaxxes, it's very possible I'm just wrong. permalink parent award report block reply Smurfection 3 points 6 days ago Ya know, I want to see IHateUntruth expand on this as well.   I hope he provides a link or something to back it up.   I do not have a medical degree and I dabble in the subject so by no means can I accurately evaluate this. I just googled it and was surprised to see some indication that he may be right.   As per other doctors I watch on YouTube etc, they say all cancers thrive on glucose and in all cases getting the body as close to zero sugar as possible is a good thing and aids in prevention, treatment and recovery. I've been Keto now for almost three years now, off and on.  I have had enormous improvement in my physical health, mental health, energy levels and my cooking skills even dramatically improved.  The keto recipes I've come up with are great! I can't judge though, between what you're saying and what he's saying.  I just noticed that there was some evidence he's right and again, I can't really fully evaluate it.  I'd love to see you and u/IHateUntruth discuss this. permalink parent award report block reply Wexit-Delecto 2 points 6 days ago I have had a similar experience with going on a high fat diet and existing in ketosis. If not doing this causes cancer, and doing this also causes cancer, we're fucked either way which doesn't seem quite right. permalink parent award report block reply view 7 more comments... IHateUntruth 1 points 6 days ago I can't see the parent comment for some reason, but I explained more here: https://patriots.win/p/1ARK5132Q8/please-pray-for-scott-this-morni/c/4eXu1OpVzW7 I don't have papers for you on hand, this is just stuff I know, but you can confirm by looking at the research literature on google scholar or something permalink parent award report block reply IHateUntruth 2 points 6 days ago For some reason this post was not visible to me and I had to use a private tab to find it... First, you're right (and I did mention this in another post), a full on keto diet where the body is running more on ketone oxidation than fatty acid oxidation would still be a good idea for this cancer. But not just merely reducing glucose intake some. And preferably high MCT. For most keto diets it's still >60% FAO to <40% KO. It is unclear from this user's post whether a high fat diet aggravates the condition he describes, since fats consumed orally don't enter the blood as fat, but as triglycerides... did he mean to say they rely on triglycerides? Because if not, dietary fat would not be feeding fats to prostate, or any other cells. It's the same thing, effectively. If we want to be super technical, cells can't actually absorb triglycerides because they're too big and hydrophobic to diffuse or use FATPs the way free fatty acids do. TGs are packaged as chylomicrons. And the chylomicron is broken down outside the cell by LPL to deliver FFAs across the cell membrane. What we're dealing with is FFAs from lipolysis as well as from chylomicrons from meals and an endocytosed contribution from VLDL too. That's all just a description of the systemic transport mechanisms, not the tissue/cell level metabolic mechanisms. It's all fatty acid metabolism at the cell level. Regardless of how the fats get to the cell - as FFAs, TG-bearing chylomicrons, or VLDL - they become FFAs and then 'fatty acyl-CoA' in the cytoplasm and undergo beta oxidation or are otherwise used in exactly the same way. Fatty acid metabolism is distinct from ketone metabolism, especially in terms of cancer. Fatty acids produce FADH2 when oxidized. FADH2 is responsible for delivering electrons to Complex II of the Electron Transport Chain (ETC). This is a low reactive oxygen species (ROS) route. Remember, cancer is vulnerable to oxidative stress from those ROS. High FADH2 = low stress = low vulnerability. Ketones don't produce any FADH2 when oxidized which increases cancer's ROS burden. Further to that effect, ketones are metabolized thru Complex I, which generally yields more ROS. Also, FAO produces over 6x the amount of NADH than the equivalent in KO. NADH is a reducing agent and protects the cancer from oxidative stress, and can also promote glycolysis by modulating the Krebs cycle. It also helps export citrate which if converted to itaconate will further activate HIF. And the exported citrate also promotes cytoplasmic biosynthesis of fats and their uses. The high NADH also reduces the NAD+/NADH ratio, inhibiting sirtuins which are usually a brake on cell proliferation. Another important aspect is that unlike FAO ketone oxidation depletes succinyl-CoA from the Krebs cycle. Succinyl-CoA is important for biosyntheses that cancers rely on to grow and protect themselves. It also helps stabilize and activate the hypoxia sensor HIF which is important to cancer metabolism and signaling (driving glycolysis, etc.) It also helps make heme which cancer uses to drive further cataplerosis. Further, aside from oxidative metabolism, fatty acids are also important building blocks for cell membranes, lipid rafts, lipid droplets (energy stores helping cells survive stress) and a variety of signaling molecules (eicosanoids, glycolipids, sphingolipids, etc.) and post-translational modifications (for example, palmitoylation of Wnt from palmitic acid). Ketones can't do any of that, they can only be burned. And many cancers are deficient in ketone metabolizing enzymes like OXCT1 so they can't even get much energy from them - the body is fed but the cancer is starved. There are a few cancers that thrive on ketones, but those are rare and this is not one of them. I will repeat though that most keto diets are still >60% FAO. permalink parent award report block reply Wexit-Delecto 1 points 6 days ago Thank you, very informative, and good to confirm that a good keto diet in which you're turning lots of fat into ketone bodies is hostile to most cancers. Honestly, the only problem most people have getting into such a diet is lack of willpower. permalink parent award report block reply\nSmurfection 0 points 6 days ago actually, as per IHateUntruth as above, prostrate cancer is one of the few cancers that can use fat.  Human bodies don't need sugar at all....the sugar we do need can be made via a process called gluconeogensis.   However, humans do need fat to live.  Prostrate cancer is one of the cancers that can use body fat. permalink parent award report block reply Wexit-Delecto 3 points 6 days ago u/IHateUntruth I would invite him to expand on that further. There is ample research suggesting a keto diet affects prostate cancer roughly the same as all other cancer cells. It is unclear from this user's post whether a high fat diet aggravates the condition he describes, since fats consumed orally don't enter the blood as fat, but as triglycerides. He said: some heavily rely on fats instead and prostate is a textbook example ... did he mean to say they rely on triglycerides? Because if not, dietary fat would not be feeding fats to prostate, or any other cells. Typically, one finds high triglycerides and high body fat content in people who are not in ketosis, since their bodies don't consume fat as fuel. Once one enters ketosis, one's body fat typically melts away since all fat, everywhere, is fuel. I consider it far more likely that \"being fat\" aggravates the condition that user describes, rather than \"being in ketosis.\" However, I'm just an autistic retard who outsmarted trillions of dollars in propaganda and the entire health care system and all the \"experts\" on covid and the poison vaxxes, it's very possible I'm just wrong. permalink parent award report block reply Smurfection 3 points 6 days ago Ya know, I want to see IHateUntruth expand on this as well.   I hope he provides a link or something to back it up.   I do not have a medical degree and I dabble in the subject so by no means can I accurately evaluate this. I just googled it and was surprised to see some indication that he may be right.   As per other doctors I watch on YouTube etc, they say all cancers thrive on glucose and in all cases getting the body as close to zero sugar as possible is a good thing and aids in prevention, treatment and recovery. I've been Keto now for almost three years now, off and on.  I have had enormous improvement in my physical health, mental health, energy levels and my cooking skills even dramatically improved.  The keto recipes I've come up with are great! I can't judge though, between what you're saying and what he's saying.  I just noticed that there was some evidence he's right and again, I can't really fully evaluate it.  I'd love to see you and u/IHateUntruth discuss this. permalink parent award report block reply Wexit-Delecto 2 points 6 days ago I have had a similar experience with going on a high fat diet and existing in ketosis. If not doing this causes cancer, and doing this also causes cancer, we're fucked either way which doesn't seem quite right. permalink parent award report block reply view 7 more comments... IHateUntruth 1 points 6 days ago I can't see the parent comment for some reason, but I explained more here: https://patriots.win/p/1ARK5132Q8/please-pray-for-scott-this-morni/c/4eXu1OpVzW7 I don't have papers for you on hand, this is just stuff I know, but you can confirm by looking at the research literature on google scholar or something permalink parent award report block reply IHateUntruth 2 points 6 days ago For some reason this post was not visible to me and I had to use a private tab to find it... First, you're right (and I did mention this in another post), a full on keto diet where the body is running more on ketone oxidation than fatty acid oxidation would still be a good idea for this cancer. But not just merely reducing glucose intake some. And preferably high MCT. For most keto diets it's still >60% FAO to <40% KO. It is unclear from this user's post whether a high fat diet aggravates the condition he describes, since fats consumed orally don't enter the blood as fat, but as triglycerides... did he mean to say they rely on triglycerides? Because if not, dietary fat would not be feeding fats to prostate, or any other cells. It's the same thing, effectively. If we want to be super technical, cells can't actually absorb triglycerides because they're too big and hydrophobic to diffuse or use FATPs the way free fatty acids do. TGs are packaged as chylomicrons. And the chylomicron is broken down outside the cell by LPL to deliver FFAs across the cell membrane. What we're dealing with is FFAs from lipolysis as well as from chylomicrons from meals and an endocytosed contribution from VLDL too. That's all just a description of the systemic transport mechanisms, not the tissue/cell level metabolic mechanisms. It's all fatty acid metabolism at the cell level. Regardless of how the fats get to the cell - as FFAs, TG-bearing chylomicrons, or VLDL - they become FFAs and then 'fatty acyl-CoA' in the cytoplasm and undergo beta oxidation or are otherwise used in exactly the same way. Fatty acid metabolism is distinct from ketone metabolism, especially in terms of cancer. Fatty acids produce FADH2 when oxidized. FADH2 is responsible for delivering electrons to Complex II of the Electron Transport Chain (ETC). This is a low reactive oxygen species (ROS) route. Remember, cancer is vulnerable to oxidative stress from those ROS. High FADH2 = low stress = low vulnerability. Ketones don't produce any FADH2 when oxidized which increases cancer's ROS burden. Further to that effect, ketones are metabolized thru Complex I, which generally yields more ROS. Also, FAO produces over 6x the amount of NADH than the equivalent in KO. NADH is a reducing agent and protects the cancer from oxidative stress, and can also promote glycolysis by modulating the Krebs cycle. It also helps export citrate which if converted to itaconate will further activate HIF. And the exported citrate also promotes cytoplasmic biosynthesis of fats and their uses. The high NADH also reduces the NAD+/NADH ratio, inhibiting sirtuins which are usually a brake on cell proliferation. Another important aspect is that unlike FAO ketone oxidation depletes succinyl-CoA from the Krebs cycle. Succinyl-CoA is important for biosyntheses that cancers rely on to grow and protect themselves. It also helps stabilize and activate the hypoxia sensor HIF which is important to cancer metabolism and signaling (driving glycolysis, etc.) It also helps make heme which cancer uses to drive further cataplerosis. Further, aside from oxidative metabolism, fatty acids are also important building blocks for cell membranes, lipid rafts, lipid droplets (energy stores helping cells survive stress) and a variety of signaling molecules (eicosanoids, glycolipids, sphingolipids, etc.) and post-translational modifications (for example, palmitoylation of Wnt from palmitic acid). Ketones can't do any of that, they can only be burned. And many cancers are deficient in ketone metabolizing enzymes like OXCT1 so they can't even get much energy from them - the body is fed but the cancer is starved. There are a few cancers that thrive on ketones, but those are rare and this is not one of them. I will repeat though that most keto diets are still >60% FAO. permalink parent award report block reply Wexit-Delecto 1 points 6 days ago Thank you, very informative, and good to confirm that a good keto diet in which you're turning lots of fat into ketone bodies is hostile to most cancers. Honestly, the only problem most people have getting into such a diet is lack of willpower. permalink parent award report block reply\nWexit-Delecto 3 points 6 days ago u/IHateUntruth I would invite him to expand on that further. There is ample research suggesting a keto diet affects prostate cancer roughly the same as all other cancer cells. It is unclear from this user's post whether a high fat diet aggravates the condition he describes, since fats consumed orally don't enter the blood as fat, but as triglycerides. He said: some heavily rely on fats instead and prostate is a textbook example ... did he mean to say they rely on triglycerides? Because if not, dietary fat would not be feeding fats to prostate, or any other cells. Typically, one finds high triglycerides and high body fat content in people who are not in ketosis, since their bodies don't consume fat as fuel. Once one enters ketosis, one's body fat typically melts away since all fat, everywhere, is fuel. I consider it far more likely that \"being fat\" aggravates the condition that user describes, rather than \"being in ketosis.\" However, I'm just an autistic retard who outsmarted trillions of dollars in propaganda and the entire health care system and all the \"experts\" on covid and the poison vaxxes, it's very possible I'm just wrong. permalink parent award report block reply Smurfection 3 points 6 days ago Ya know, I want to see IHateUntruth expand on this as well.   I hope he provides a link or something to back it up.   I do not have a medical degree and I dabble in the subject so by no means can I accurately evaluate this. I just googled it and was surprised to see some indication that he may be right.   As per other doctors I watch on YouTube etc, they say all cancers thrive on glucose and in all cases getting the body as close to zero sugar as possible is a good thing and aids in prevention, treatment and recovery. I've been Keto now for almost three years now, off and on.  I have had enormous improvement in my physical health, mental health, energy levels and my cooking skills even dramatically improved.  The keto recipes I've come up with are great! I can't judge though, between what you're saying and what he's saying.  I just noticed that there was some evidence he's right and again, I can't really fully evaluate it.  I'd love to see you and u/IHateUntruth discuss this. permalink parent award report block reply Wexit-Delecto 2 points 6 days ago I have had a similar experience with going on a high fat diet and existing in ketosis. If not doing this causes cancer, and doing this also causes cancer, we're fucked either way which doesn't seem quite right. permalink parent award report block reply view 7 more comments... IHateUntruth 1 points 6 days ago I can't see the parent comment for some reason, but I explained more here: https://patriots.win/p/1ARK5132Q8/please-pray-for-scott-this-morni/c/4eXu1OpVzW7 I don't have papers for you on hand, this is just stuff I know, but you can confirm by looking at the research literature on google scholar or something permalink parent award report block reply IHateUntruth 2 points 6 days ago For some reason this post was not visible to me and I had to use a private tab to find it... First, you're right (and I did mention this in another post), a full on keto diet where the body is running more on ketone oxidation than fatty acid oxidation would still be a good idea for this cancer. But not just merely reducing glucose intake some. And preferably high MCT. For most keto diets it's still >60% FAO to <40% KO. It is unclear from this user's post whether a high fat diet aggravates the condition he describes, since fats consumed orally don't enter the blood as fat, but as triglycerides... did he mean to say they rely on triglycerides? Because if not, dietary fat would not be feeding fats to prostate, or any other cells. It's the same thing, effectively. If we want to be super technical, cells can't actually absorb triglycerides because they're too big and hydrophobic to diffuse or use FATPs the way free fatty acids do. TGs are packaged as chylomicrons. And the chylomicron is broken down outside the cell by LPL to deliver FFAs across the cell membrane. What we're dealing with is FFAs from lipolysis as well as from chylomicrons from meals and an endocytosed contribution from VLDL too. That's all just a description of the systemic transport mechanisms, not the tissue/cell level metabolic mechanisms. It's all fatty acid metabolism at the cell level. Regardless of how the fats get to the cell - as FFAs, TG-bearing chylomicrons, or VLDL - they become FFAs and then 'fatty acyl-CoA' in the cytoplasm and undergo beta oxidation or are otherwise used in exactly the same way. Fatty acid metabolism is distinct from ketone metabolism, especially in terms of cancer. Fatty acids produce FADH2 when oxidized. FADH2 is responsible for delivering electrons to Complex II of the Electron Transport Chain (ETC). This is a low reactive oxygen species (ROS) route. Remember, cancer is vulnerable to oxidative stress from those ROS. High FADH2 = low stress = low vulnerability. Ketones don't produce any FADH2 when oxidized which increases cancer's ROS burden. Further to that effect, ketones are metabolized thru Complex I, which generally yields more ROS. Also, FAO produces over 6x the amount of NADH than the equivalent in KO. NADH is a reducing agent and protects the cancer from oxidative stress, and can also promote glycolysis by modulating the Krebs cycle. It also helps export citrate which if converted to itaconate will further activate HIF. And the exported citrate also promotes cytoplasmic biosynthesis of fats and their uses. The high NADH also reduces the NAD+/NADH ratio, inhibiting sirtuins which are usually a brake on cell proliferation. Another important aspect is that unlike FAO ketone oxidation depletes succinyl-CoA from the Krebs cycle. Succinyl-CoA is important for biosyntheses that cancers rely on to grow and protect themselves. It also helps stabilize and activate the hypoxia sensor HIF which is important to cancer metabolism and signaling (driving glycolysis, etc.) It also helps make heme which cancer uses to drive further cataplerosis. Further, aside from oxidative metabolism, fatty acids are also important building blocks for cell membranes, lipid rafts, lipid droplets (energy stores helping cells survive stress) and a variety of signaling molecules (eicosanoids, glycolipids, sphingolipids, etc.) and post-translational modifications (for example, palmitoylation of Wnt from palmitic acid). Ketones can't do any of that, they can only be burned. And many cancers are deficient in ketone metabolizing enzymes like OXCT1 so they can't even get much energy from them - the body is fed but the cancer is starved. There are a few cancers that thrive on ketones, but those are rare and this is not one of them. I will repeat though that most keto diets are still >60% FAO. permalink parent award report block reply Wexit-Delecto 1 points 6 days ago Thank you, very informative, and good to confirm that a good keto diet in which you're turning lots of fat into ketone bodies is hostile to most cancers. Honestly, the only problem most people have getting into such a diet is lack of willpower. permalink parent award report block reply\nSmurfection 3 points 6 days ago Ya know, I want to see IHateUntruth expand on this as well.   I hope he provides a link or something to back it up.   I do not have a medical degree and I dabble in the subject so by no means can I accurately evaluate this. I just googled it and was surprised to see some indication that he may be right.   As per other doctors I watch on YouTube etc, they say all cancers thrive on glucose and in all cases getting the body as close to zero sugar as possible is a good thing and aids in prevention, treatment and recovery. I've been Keto now for almost three years now, off and on.  I have had enormous improvement in my physical health, mental health, energy levels and my cooking skills even dramatically improved.  The keto recipes I've come up with are great! I can't judge though, between what you're saying and what he's saying.  I just noticed that there was some evidence he's right and again, I can't really fully evaluate it.  I'd love to see you and u/IHateUntruth discuss this. permalink parent award report block reply Wexit-Delecto 2 points 6 days ago I have had a similar experience with going on a high fat diet and existing in ketosis. If not doing this causes cancer, and doing this also causes cancer, we're fucked either way which doesn't seem quite right. permalink parent award report block reply view 7 more comments... IHateUntruth 1 points 6 days ago I can't see the parent comment for some reason, but I explained more here: https://patriots.win/p/1ARK5132Q8/please-pray-for-scott-this-morni/c/4eXu1OpVzW7 I don't have papers for you on hand, this is just stuff I know, but you can confirm by looking at the research literature on google scholar or something permalink parent award report block reply\nWexit-Delecto 2 points 6 days ago I have had a similar experience with going on a high fat diet and existing in ketosis. If not doing this causes cancer, and doing this also causes cancer, we're fucked either way which doesn't seem quite right. permalink parent award report block reply view 7 more comments...\nIHateUntruth 1 points 6 days ago I can't see the parent comment for some reason, but I explained more here: https://patriots.win/p/1ARK5132Q8/please-pray-for-scott-this-morni/c/4eXu1OpVzW7 I don't have papers for you on hand, this is just stuff I know, but you can confirm by looking at the research literature on google scholar or something permalink parent award report block reply\nIHateUntruth 2 points 6 days ago For some reason this post was not visible to me and I had to use a private tab to find it... First, you're right (and I did mention this in another post), a full on keto diet where the body is running more on ketone oxidation than fatty acid oxidation would still be a good idea for this cancer. But not just merely reducing glucose intake some. And preferably high MCT. For most keto diets it's still >60% FAO to <40% KO. It is unclear from this user's post whether a high fat diet aggravates the condition he describes, since fats consumed orally don't enter the blood as fat, but as triglycerides... did he mean to say they rely on triglycerides? Because if not, dietary fat would not be feeding fats to prostate, or any other cells. It's the same thing, effectively. If we want to be super technical, cells can't actually absorb triglycerides because they're too big and hydrophobic to diffuse or use FATPs the way free fatty acids do. TGs are packaged as chylomicrons. And the chylomicron is broken down outside the cell by LPL to deliver FFAs across the cell membrane. What we're dealing with is FFAs from lipolysis as well as from chylomicrons from meals and an endocytosed contribution from VLDL too. That's all just a description of the systemic transport mechanisms, not the tissue/cell level metabolic mechanisms. It's all fatty acid metabolism at the cell level. Regardless of how the fats get to the cell - as FFAs, TG-bearing chylomicrons, or VLDL - they become FFAs and then 'fatty acyl-CoA' in the cytoplasm and undergo beta oxidation or are otherwise used in exactly the same way. Fatty acid metabolism is distinct from ketone metabolism, especially in terms of cancer. Fatty acids produce FADH2 when oxidized. FADH2 is responsible for delivering electrons to Complex II of the Electron Transport Chain (ETC). This is a low reactive oxygen species (ROS) route. Remember, cancer is vulnerable to oxidative stress from those ROS. High FADH2 = low stress = low vulnerability. Ketones don't produce any FADH2 when oxidized which increases cancer's ROS burden. Further to that effect, ketones are metabolized thru Complex I, which generally yields more ROS. Also, FAO produces over 6x the amount of NADH than the equivalent in KO. NADH is a reducing agent and protects the cancer from oxidative stress, and can also promote glycolysis by modulating the Krebs cycle. It also helps export citrate which if converted to itaconate will further activate HIF. And the exported citrate also promotes cytoplasmic biosynthesis of fats and their uses. The high NADH also reduces the NAD+/NADH ratio, inhibiting sirtuins which are usually a brake on cell proliferation. Another important aspect is that unlike FAO ketone oxidation depletes succinyl-CoA from the Krebs cycle. Succinyl-CoA is important for biosyntheses that cancers rely on to grow and protect themselves. It also helps stabilize and activate the hypoxia sensor HIF which is important to cancer metabolism and signaling (driving glycolysis, etc.) It also helps make heme which cancer uses to drive further cataplerosis. Further, aside from oxidative metabolism, fatty acids are also important building blocks for cell membranes, lipid rafts, lipid droplets (energy stores helping cells survive stress) and a variety of signaling molecules (eicosanoids, glycolipids, sphingolipids, etc.) and post-translational modifications (for example, palmitoylation of Wnt from palmitic acid). Ketones can't do any of that, they can only be burned. And many cancers are deficient in ketone metabolizing enzymes like OXCT1 so they can't even get much energy from them - the body is fed but the cancer is starved. There are a few cancers that thrive on ketones, but those are rare and this is not one of them. I will repeat though that most keto diets are still >60% FAO. permalink parent award report block reply Wexit-Delecto 1 points 6 days ago Thank you, very informative, and good to confirm that a good keto diet in which you're turning lots of fat into ketone bodies is hostile to most cancers. Honestly, the only problem most people have getting into such a diet is lack of willpower. permalink parent award report block reply\nWexit-Delecto 1 points 6 days ago Thank you, very informative, and good to confirm that a good keto diet in which you're turning lots of fat into ketone bodies is hostile to most cancers. Honestly, the only problem most people have getting into such a diet is lack of willpower. permalink parent award report block reply\nReefay -2 points 6 days ago Nope. permalink award report block reply\nR3tro -3 points 6 days ago Maybe he should take fenbendazole and horse paste (that he made fun of during covid times) permalink award report block reply\nIHateUntruth -3 points 6 days ago He should use herbs. Unfortunately that information is blocked from getting to him. permalink award report block reply Smurfection 2 points 6 days ago What herbs? I am not doubting you but do you have a link or something to herbs that can help treat prostrate cancer? permalink parent award report block reply\nSmurfection 2 points 6 days ago What herbs? I am not doubting you but do you have a link or something to herbs that can help treat prostrate cancer? permalink parent award report block reply\nBBWasHere -11 points 6 days ago Fuck clot Adams. permalink award report block reply mechaet 3 points 6 days ago Pretty much this. I \"guess\" that makes me a bad person, but one can \"guess\" I don't give a flying fuck. Clott Adams took the vax, and got turbo ass-cancer. Cue the surprised pikachu face. permalink parent award report block reply Wexit-Delecto 2 points 6 days ago I'm not sure if \"fuck him\" is the correct response. He's been fairly consistently on our side and simply lacked the mental acuity to recognize the vaxx was a cancer-inducing poison. He got into this situation out of confusion, not out of malice. permalink parent award report block reply Reefay 5 points 6 days ago He was an arrogant asshole and still didn't even mea culpa when he figured out he was wrong. Fuck him. permalink parent award report block reply KuzoKevin OP 1 points 6 days ago He didn't force anyone to do anything.  Fuck off. permalink parent award report block reply Reefay 0 points 6 days ago Sorry didn't mean to disparage your boyfriend permalink parent award report block reply view 4 more comments... Smurfection 0 points 6 days ago yes he did.  He did so on three different occasions I can name.   Granted the first two weren't all that complete but the third one was.   You just don't want to accept that he came full circle.  I can understand that.  I was fighting a daily battle to keep my husband and my kids purebloods.   I got ostracized from my family along with my husband and kids.  We got disinvited from Thanksgiving and Easter on both sides.  I had to tell my daughter she couldn't take a class trip to Ireland.   You just try to tell an 18 year old girl she can't go to Ireland with her friends. Scott Adams eventually joined us.  He got on board late but he did get on board. permalink parent award report block reply Reefay 0 points 6 days ago Too little too late for me. When the whole covid shot came out he should have said hey I'm a cartoon peddler and I'm not a scientist. I'm going to get this shot but make your own decision. But what he did was ridicule and use his authority of being wealthy and smarter than thou. It just doesn't sit well with me and it never will. No matter how many apologies he gives now. He should have just come out right at the beginning and said I'm really sorry I really hope that the cancer takes him so that maybe he'll realize how much of an asshole he was permalink parent award report block reply view 5 more comments... Smurfection 3 points 6 days ago yep.  Scott Adams has also said a few times now, he was wrong about the jab.   There were a lot of good people who were duped.   At the time, I was more upset with them because each person who went along with the psyop was another person adding to the psyop and adding to the pressure on purebloods like me.  Each time an employee let an employer dictate what medical injections had to be administered was another convention that kept employers out of employee's healthcare and medical treatments that eroded.  Bulwark after Bulwark was crumbling by every smiling goon who stuck out their arms and received the poison jab.  Many of them paid with their lives for that and more paid with their health.  It's more than five years now.   I forgive the ones who admit the error, wholeheartedly and completely, but the ones who still hang to this authoritarian delusion, are my enemies.  Scott Adams isn't one of those. permalink parent award report block reply Wexit-Delecto 1 points 6 days ago My sentiments exactly. permalink parent award report block reply BBWasHere 2 points 4 days ago he attepmted to belittle those who refused because he was \"superior\". fuck him permalink parent award report block reply God-is-good -1 points 6 days ago As we slowly watch Scott deservedly die the sugar coating from sycophants gains layers of thickness capable of choking the simplest minds. How quickly they forget. Perhaps for the confectioners Scott was right and they simply guessed correctly on covid. permalink parent award report block reply Smurfection 4 points 6 days ago Wow!  Just wow!  I can't believe you have a username like God-is-good and then go on to say Scott Adams deserves to die.   We all deserve to die and we all will because the wages of sin is death.  That wasn't what God wanted for us though and God doesn't want us to feel pain, die in agony and constantly fear death.  That's not what our loving creator wanted for us.  We did that to ourselves.  All of our deaths, we do to ourselves.   You think God wants Scott Adams to be sick, in agony, despairing and fighting for his life every hour of every day?   God made eternal life for us because we screwed up the prospect of our natural eternal life.   He didn't want us to die.  He wanted to walk with us in the Garden of Eden in the cool of the evening every night and talk to us about our mundane days and nights.  Scott Adams needs prayers not sermons and the same for all of us. permalink parent award report block reply\nmechaet 3 points 6 days ago Pretty much this. I \"guess\" that makes me a bad person, but one can \"guess\" I don't give a flying fuck. Clott Adams took the vax, and got turbo ass-cancer. Cue the surprised pikachu face. permalink parent award report block reply\nWexit-Delecto 2 points 6 days ago I'm not sure if \"fuck him\" is the correct response. He's been fairly consistently on our side and simply lacked the mental acuity to recognize the vaxx was a cancer-inducing poison. He got into this situation out of confusion, not out of malice. permalink parent award report block reply Reefay 5 points 6 days ago He was an arrogant asshole and still didn't even mea culpa when he figured out he was wrong. Fuck him. permalink parent award report block reply KuzoKevin OP 1 points 6 days ago He didn't force anyone to do anything.  Fuck off. permalink parent award report block reply Reefay 0 points 6 days ago Sorry didn't mean to disparage your boyfriend permalink parent award report block reply view 4 more comments... Smurfection 0 points 6 days ago yes he did.  He did so on three different occasions I can name.   Granted the first two weren't all that complete but the third one was.   You just don't want to accept that he came full circle.  I can understand that.  I was fighting a daily battle to keep my husband and my kids purebloods.   I got ostracized from my family along with my husband and kids.  We got disinvited from Thanksgiving and Easter on both sides.  I had to tell my daughter she couldn't take a class trip to Ireland.   You just try to tell an 18 year old girl she can't go to Ireland with her friends. Scott Adams eventually joined us.  He got on board late but he did get on board. permalink parent award report block reply Reefay 0 points 6 days ago Too little too late for me. When the whole covid shot came out he should have said hey I'm a cartoon peddler and I'm not a scientist. I'm going to get this shot but make your own decision. But what he did was ridicule and use his authority of being wealthy and smarter than thou. It just doesn't sit well with me and it never will. No matter how many apologies he gives now. He should have just come out right at the beginning and said I'm really sorry I really hope that the cancer takes him so that maybe he'll realize how much of an asshole he was permalink parent award report block reply view 5 more comments... Smurfection 3 points 6 days ago yep.  Scott Adams has also said a few times now, he was wrong about the jab.   There were a lot of good people who were duped.   At the time, I was more upset with them because each person who went along with the psyop was another person adding to the psyop and adding to the pressure on purebloods like me.  Each time an employee let an employer dictate what medical injections had to be administered was another convention that kept employers out of employee's healthcare and medical treatments that eroded.  Bulwark after Bulwark was crumbling by every smiling goon who stuck out their arms and received the poison jab.  Many of them paid with their lives for that and more paid with their health.  It's more than five years now.   I forgive the ones who admit the error, wholeheartedly and completely, but the ones who still hang to this authoritarian delusion, are my enemies.  Scott Adams isn't one of those. permalink parent award report block reply Wexit-Delecto 1 points 6 days ago My sentiments exactly. permalink parent award report block reply BBWasHere 2 points 4 days ago he attepmted to belittle those who refused because he was \"superior\". fuck him permalink parent award report block reply\nReefay 5 points 6 days ago He was an arrogant asshole and still didn't even mea culpa when he figured out he was wrong. Fuck him. permalink parent award report block reply KuzoKevin OP 1 points 6 days ago He didn't force anyone to do anything.  Fuck off. permalink parent award report block reply Reefay 0 points 6 days ago Sorry didn't mean to disparage your boyfriend permalink parent award report block reply view 4 more comments... Smurfection 0 points 6 days ago yes he did.  He did so on three different occasions I can name.   Granted the first two weren't all that complete but the third one was.   You just don't want to accept that he came full circle.  I can understand that.  I was fighting a daily battle to keep my husband and my kids purebloods.   I got ostracized from my family along with my husband and kids.  We got disinvited from Thanksgiving and Easter on both sides.  I had to tell my daughter she couldn't take a class trip to Ireland.   You just try to tell an 18 year old girl she can't go to Ireland with her friends. Scott Adams eventually joined us.  He got on board late but he did get on board. permalink parent award report block reply Reefay 0 points 6 days ago Too little too late for me. When the whole covid shot came out he should have said hey I'm a cartoon peddler and I'm not a scientist. I'm going to get this shot but make your own decision. But what he did was ridicule and use his authority of being wealthy and smarter than thou. It just doesn't sit well with me and it never will. No matter how many apologies he gives now. He should have just come out right at the beginning and said I'm really sorry I really hope that the cancer takes him so that maybe he'll realize how much of an asshole he was permalink parent award report block reply view 5 more comments...\nKuzoKevin OP 1 points 6 days ago He didn't force anyone to do anything.  Fuck off. permalink parent award report block reply Reefay 0 points 6 days ago Sorry didn't mean to disparage your boyfriend permalink parent award report block reply view 4 more comments...\nReefay 0 points 6 days ago Sorry didn't mean to disparage your boyfriend permalink parent award report block reply view 4 more comments...\nSmurfection 0 points 6 days ago yes he did.  He did so on three different occasions I can name.   Granted the first two weren't all that complete but the third one was.   You just don't want to accept that he came full circle.  I can understand that.  I was fighting a daily battle to keep my husband and my kids purebloods.   I got ostracized from my family along with my husband and kids.  We got disinvited from Thanksgiving and Easter on both sides.  I had to tell my daughter she couldn't take a class trip to Ireland.   You just try to tell an 18 year old girl she can't go to Ireland with her friends. Scott Adams eventually joined us.  He got on board late but he did get on board. permalink parent award report block reply Reefay 0 points 6 days ago Too little too late for me. When the whole covid shot came out he should have said hey I'm a cartoon peddler and I'm not a scientist. I'm going to get this shot but make your own decision. But what he did was ridicule and use his authority of being wealthy and smarter than thou. It just doesn't sit well with me and it never will. No matter how many apologies he gives now. He should have just come out right at the beginning and said I'm really sorry I really hope that the cancer takes him so that maybe he'll realize how much of an asshole he was permalink parent award report block reply view 5 more comments...\nReefay 0 points 6 days ago Too little too late for me. When the whole covid shot came out he should have said hey I'm a cartoon peddler and I'm not a scientist. I'm going to get this shot but make your own decision. But what he did was ridicule and use his authority of being wealthy and smarter than thou. It just doesn't sit well with me and it never will. No matter how many apologies he gives now. He should have just come out right at the beginning and said I'm really sorry I really hope that the cancer takes him so that maybe he'll realize how much of an asshole he was permalink parent award report block reply view 5 more comments...\nSmurfection 3 points 6 days ago yep.  Scott Adams has also said a few times now, he was wrong about the jab.   There were a lot of good people who were duped.   At the time, I was more upset with them because each person who went along with the psyop was another person adding to the psyop and adding to the pressure on purebloods like me.  Each time an employee let an employer dictate what medical injections had to be administered was another convention that kept employers out of employee's healthcare and medical treatments that eroded.  Bulwark after Bulwark was crumbling by every smiling goon who stuck out their arms and received the poison jab.  Many of them paid with their lives for that and more paid with their health.  It's more than five years now.   I forgive the ones who admit the error, wholeheartedly and completely, but the ones who still hang to this authoritarian delusion, are my enemies.  Scott Adams isn't one of those. permalink parent award report block reply Wexit-Delecto 1 points 6 days ago My sentiments exactly. permalink parent award report block reply\nWexit-Delecto 1 points 6 days ago My sentiments exactly. permalink parent award report block reply\nBBWasHere 2 points 4 days ago he attepmted to belittle those who refused because he was \"superior\". fuck him permalink parent award report block reply\nGod-is-good -1 points 6 days ago As we slowly watch Scott deservedly die the sugar coating from sycophants gains layers of thickness capable of choking the simplest minds. How quickly they forget. Perhaps for the confectioners Scott was right and they simply guessed correctly on covid. permalink parent award report block reply Smurfection 4 points 6 days ago Wow!  Just wow!  I can't believe you have a username like God-is-good and then go on to say Scott Adams deserves to die.   We all deserve to die and we all will because the wages of sin is death.  That wasn't what God wanted for us though and God doesn't want us to feel pain, die in agony and constantly fear death.  That's not what our loving creator wanted for us.  We did that to ourselves.  All of our deaths, we do to ourselves.   You think God wants Scott Adams to be sick, in agony, despairing and fighting for his life every hour of every day?   God made eternal life for us because we screwed up the prospect of our natural eternal life.   He didn't want us to die.  He wanted to walk with us in the Garden of Eden in the cool of the evening every night and talk to us about our mundane days and nights.  Scott Adams needs prayers not sermons and the same for all of us. permalink parent award report block reply\nSmurfection 4 points 6 days ago Wow!  Just wow!  I can't believe you have a username like God-is-good and then go on to say Scott Adams deserves to die.   We all deserve to die and we all will because the wages of sin is death.  That wasn't what God wanted for us though and God doesn't want us to feel pain, die in agony and constantly fear death.  That's not what our loving creator wanted for us.  We did that to ourselves.  All of our deaths, we do to ourselves.   You think God wants Scott Adams to be sick, in agony, despairing and fighting for his life every hour of every day?   God made eternal life for us because we screwed up the prospect of our natural eternal life.   He didn't want us to die.  He wanted to walk with us in the Garden of Eden in the cool of the evening every night and talk to us about our mundane days and nights.  Scott Adams needs prayers not sermons and the same for all of us. permalink parent award report block reply"}