{"id": "1ARK9pghPz", "contents": "7 I ran the numbers for a 50yr mortgage using my 1st house, bought in 2004 for $77k @ 4.5%. 1964 construction 3b2ba1ca 1125sqft suburban neighborhood <1acre. The numbers are staggering. posted 45 minutes ago by Elephant_Trump 31 comments award share download report block\n31 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style JoePlumber 5 points 43 minutes ago If you don't want a 50 year mortgage don't take one. If you want to take one then pay extra every month from the beginning and pay it off early. Even an extra $120 a month on a $500k mortgage would pay the entire loan off like 25 years early. This shit is basic personal finance. There's nothing wrong with banks offering this, what's wrong is people not understanding how to finance. permalink award report block reply zippy2 1 points 37 minutes ago If you can afford an extra $120/mo, then you'd qualify for the 30 year mortgage. permalink parent award report block reply JoePlumber -1 points 30 minutes ago if you CAN'T afford an extra $120 month you shouldn't be getting a mortgage at all. Again, basic personal finance. holy shit public schools failed you all. permalink parent award report block reply hellohellohellohell 1 points 28 minutes ago Plus, you can refinance as your financial situation improves, or sell it and upgrade your house. At least you're building equity instead of burning the money on rent. If this was all Trump was offering, I'd understand the upset, but this is just one arrow in the quiver, not his entire economic platform. And I'm sure it would be a welcome tool for many buyers, at least as a stop-gap to get them in the home they want right now. Seriously, how many people live in the same home, with the same mortgage, for 50 years these days? permalink parent award report block reply JoinTheDiscussion 1 points 39 minutes ago How about buy within your means for a 30yr or even 15 year permalink parent award report block reply JoePlumber 1 points 27 minutes ago That's exactly what I'm advocating. For example, I took a 30 year mortgage on my first home, I pay on average about $150 extra each month. So my mortgage originally was like $1200/mo I paid $1350 a month, which happened to be our rent before we bought. Worked out great. Because taxes and insurance fluctuate some of that extra is eaten up sometimes and I simply increase my payment. I am on track to pay off my mortgage about 9.5 years early and save over $60k on interest. This is basic personal finance. Buy what you can comfortably afford only and then pay extra! permalink parent award report block reply Patriot4TN 1 points 24 minutes ago You assume everyone is in the same boat as you... They are not. Some see they can afford said house at 50 years and take it. They don't realize the cost of home ownership. More than likely they will foreclose. People need to stop saying \"just pay extra\". permalink parent award report block reply JoePlumber 1 points 18 minutes ago lol no The expectation is that if you are embarking on getting a mortgage you have some sense of personal finance. You've managed to save a 10-20%+ down payment and you've done your research on how to best utilize your buying power. If any of that isn't true I have zero sympathy for you. Even with 30 year mortgages you are fucking retarded if you are just paying the minimum amount each month. You're pissing money away on interest unnecessarily and deserve foreclosure or whatever ends up happening at that point. I don't sympathize with the stupid, and the stupid really shouldn't be buying houses honestly. permalink parent award report block reply view 1 more comments... FlyinHeadlock 4 points 35 minutes ago It doesn't even lower the monthly payment that much. About $50 for an average home and as you stated, long term it's a joke. I've been listening to people in real estate on Breitbart call in about it. It's a mixed bag. If you own real estate there is an argument where it works in your favor but that was not the intent. It was aimed at home buyers. The only good thing would be if the rates go down drastically, a buyer could re-finance lower. We are one of the only countries with that option but the rates likely aren't ever getting back to 2-3% again. permalink award report block reply starjello 4 points 32 minutes ago Yeah big whoop. 50 bucks on the average mortgage payment nowadays isn't going to be a piss in a piddle permalink parent award report block reply couranto 1 points 18 minutes ago It's way more than 50 bucks lol. You people are dumb af -- just a bunch of crybaby shills. Yall complain about everything. permalink parent award report block reply FlyinHeadlock 1 points 8 minutes ago They did the math on it on Breitbart radio. For an average home it lowered it $50 a month. It depends on the costs of the home though but big picture it's horrible. All mortgages are horrible unless you pay it off earlier or, find somewhere else to earn more than the interests on the mortgage. I paid mine off early. It ended up saving me like $150K or something stupid. It wasn't easy. I made lots of sacrifices. No vacations, new cars, buying lots of used stuff and rarely eating out. Most people would say screw that. permalink parent award report block reply Jack_NC 2 points 26 minutes ago It's hard to understand the pain of paying 3x more just to save $100/month on payments. But it doesn't surprise me. I used to sell cars. Day one of training the sales manager told us \"People buy on total price, on payments, or on trade-in-value. Find out what they want and we'll give them that and screw them on the other. Need a great final price? Fine. We'll give you a stupid high interest rate and make our money on financing. Want a low payment? No problem - 8 year loan. They want way too much that ragged trade-in? We can do that, and then give no discounts AND a high interest rate.\" The worst worst worst (for us) deal was when someone came in and said \"Cash deal (or I brought financing from my own bank). I'll give you $xxx for that car. Take it or leave it.\" We didn't make any money there. A 50 year mortgage is a banker's way of saying \"you can't afford it, but we will gladly make a fortune off of your inability to do math.\" permalink award report block reply Elephant_Trump OP 2 points 45 minutes ago TLDR: GRAND TOTAL PAID $1,578,000 (excellent credit) GROK adjusted my $77k purchase price up to $125k to accommodate modern market pricing. pardon the formatting. I have done my best to repair it. my title is misleading due to a typo. my lot was less than 1/8acre we paid the example house off in 2019, 15 years early. we now live in the country on 10 acres in a 2023 construction house. it is financed at 5.12% over 30 years with a $75k balance and 28 years remaining on the loan. we applied 100% of the sale proceeds from the example house to our new $188k mortgage 12 months after moving in. my first house purchased was $77k in 2004. it was ~1125sqft built in 1964. I bought it on a 30 year loan.\nthis scenario uses that house in modern times but applies the 50 year mortgage terms proposed by president Trump and modern interest rates. below is Grok's analysis: Total Lifetime Cost to Fully Pay Off the House (50 Years)\nThis includes every dollar paid over 600 months: • Principal & Interest (P&I) • FHA Mortgage Insurance Premium (MIP) — never drops off due to <10% down and >20-year term • Escrow (property taxes + homeowners insurance) — using conservative 2.5% average annual inflation (historical Amarillo average ~2.2% taxes + ~3% insurance)\nHouse Value (2025): $175,000 • Down payment: 3.5% = $6,125 • Base loan: $168,875 • Upfront MIP financed: $2,953 → Effective loan = $171,734 Total Cost Breakdown (Over 50 Years)\nItem Excellent Credit (6.50%) Average Credit (6.75%) Monthly P&I $1,138 $1,165 Total P&I Paid (600 months)$682,800 $699,000 Total Interest Paid $511,066\n$527,266 Principal Repaid $168,875 $168,875 Upfront MIP (fin. financed) $2,953 $2,953 Monthly MIP $787 $787 Total MIP Paid (600 months) $472,200 $472,200 Monthly Escrow (Year 1) $466$466 Escrow with 2.5% annual inflation $466 → $1,040 by Year 50 SameTotal Escrow Paid (50 yrs, inflated) $423,000 $423,000  → Taxes (~68%)~$287,000~$287,000  → Insurance (~32%)~$136,000~$136,000 FINAL TOTAL COST TO OWN (50 YEARS)\nCredit ScenarioTotal Paid Over 50 YearsCost Multiple of Home PriceExcellent (835) $1,578,000 9.0× the $175,000 home Average (~700) $1,594,200 9.1× the $175,000 home Summary: What You Actually Pay\nCategory Amount Home purchase price $175,000 Down payment–$6,125Total mortgage payments (P&I + MIP) $1,155,000 Total escrow (taxes + insurance, inflated) $423,000→ GRAND TOTAL PAID$1,578,000 (excellent credit) You pay $1.4 million in interest, insurance, and taxes — 8× the home’s value — just to own it free and clear in 2075. Key Takeaways\n• MIP is brutal: $472k — more than 2.7× the original loan.\n• Escrow inflation hurts: Starts at $466/mo → ends at $1,040/mo → averages ~$705/mo.\n• Equity builds slowly: After 10 years, you’ve paid ~$287k total but only own ~$50k in equity.\n• Trump’s 50-year plan cuts monthly payment (~$1,000 less than 30-year) but doubles lifetime cost.\nBottom Line: You’d pay over $1.5 million to own a $175,000 house — 90% of payments go to interest, insurance, and taxes, not equity.\nPro Tip: Put 20% down → eliminate MIP → save ~$500k+ over 50 years. permalink award report block reply Bullet3250 0 points 25 minutes ago A 50 year Mort is not a good option - I agree - but don't overlook a few other numbers. On the plus side: What was the home value after 50 years?    Maybe ten times or even more. All the equity falls to the owner. And Dollar inflation lowers the value of those mortgage payment dollars too - $1000 dollars in 1975 is now $6000.   But you are still paying $1000. You are paying the bank with cheaper and cheaper dollars. On the Negative side, additionally,  - a 50 year of house will likely fully need to replace half the house over 50 years. 3 roof replacements, 1-2 FULL HVAC systems, possibly 1 new set of windows.  it is possible the plumbing and electric will be need major work or replacement.  Those costs can be high - that is all a loss/maintenance. permalink parent award report block reply SHILL_DETECTOR 0 points 44 minutes ago why did you use grok for this? no one is going to read it permalink parent award report block reply Patriot4TN 5 points 39 minutes ago I read it and cannot fathom the total cost after 50 years. This is crazy. Who in their right mind would think this is a good ideal? Granted the house will more than likely be sold 3 times over during that 50 year life span, but still.... permalink parent award report block reply SHILL_DETECTOR 0 points 39 minutes ago https://www.mortgagecalculator.org/calculators/what-if-i-pay-more-calculator.php permalink parent award report block reply Patriot4TN 3 points 36 minutes ago People getting 50 year mortgages probably cannot afford to pay extra. If they did, they could just get a 30 year loan. Maybe in 10-15 years of owning the home as their pay check increases... But not right away. permalink parent award report block reply view 4 more comments... JoePlumber -2 points 43 minutes ago this is impossible to read. learn to format. also why would anyone just pay the minimum on their mortgage every month? terrible financial strategy that ignores the reality of extra principle payments. permalink parent award report block reply Tikk 3 points 31 minutes ago I've lowered the amount I pay in additional principle simply because my mortgage interest rate is relatively low (3.875%). The money I had been adding to my monthly payment would be better invested in a stock or mutual fund, which has a dividend of 4% - 17%.  Additionally those stock prices would be indexed with inflation. So there is the argument, based upon terms of the loan, that not paying additional principle is a good idea. permalink parent award report block reply JoePlumber 1 points 25 minutes ago This would be next-level personal finance. If people can't understand buying a house they can comfortably afford and then paying extra each month to reduce interest paid and pay it off early they certainly can't understand the rate of return vs the mortgage APR. I agree with what you're saying but one step at a time haha and also you and I have great mortgage rates but these days people are paying 6.5% or 7% so it's not like that anymore and they're probably better off paying extra even if they have the investment skills/knowlege. permalink parent award report block reply sleepinggiant 1 points 28 minutes ago Yeah i dont know who trump is listening to but he certainly is fucking up his base. permalink award report block reply PatriotDescendant 1 points 15 minutes ago When we bought our first house in 1984, interest rates were pretty steep and we barely qualified for the 30 year. But four years later, following promotions and steps we took to curb wasteful spending (less partying and more adulting), plus two refinancings as rates fell, we were soon doubling our required payments with room to spare. I don't see much of an issue with 50-year loans. Smart people will get in, and when possible, accelerate paydown. Dumb people won't. Caveat motherfucking emptor. permalink award report block reply couranto 0 points 19 minutes ago Gues what dumb fuck. It's not mandated. Get a 15 year, big shot. Plus almost no one even completes a 30 year loan, nvm a 50. permalink award report block reply Elephant_Trump OP -2 points 15 minutes ago ummm... I am not doing this shithow. I just wanted real numbers for educational purposes for myself and thought I might share with some folks who I assume also have brains and would take interest. I live a rural dream: 10 acres, 30 year loan with 27.5 remaining @ 5.12% interest. 3b2ba2ca 1900sqft (400 is basement) custom designed new construction 2023. calm down jeez... you're like a hysterical woman. permalink parent award report block reply\nJoePlumber 5 points 43 minutes ago If you don't want a 50 year mortgage don't take one. If you want to take one then pay extra every month from the beginning and pay it off early. Even an extra $120 a month on a $500k mortgage would pay the entire loan off like 25 years early. This shit is basic personal finance. There's nothing wrong with banks offering this, what's wrong is people not understanding how to finance. permalink award report block reply zippy2 1 points 37 minutes ago If you can afford an extra $120/mo, then you'd qualify for the 30 year mortgage. permalink parent award report block reply JoePlumber -1 points 30 minutes ago if you CAN'T afford an extra $120 month you shouldn't be getting a mortgage at all. Again, basic personal finance. holy shit public schools failed you all. permalink parent award report block reply hellohellohellohell 1 points 28 minutes ago Plus, you can refinance as your financial situation improves, or sell it and upgrade your house. At least you're building equity instead of burning the money on rent. If this was all Trump was offering, I'd understand the upset, but this is just one arrow in the quiver, not his entire economic platform. And I'm sure it would be a welcome tool for many buyers, at least as a stop-gap to get them in the home they want right now. Seriously, how many people live in the same home, with the same mortgage, for 50 years these days? permalink parent award report block reply JoinTheDiscussion 1 points 39 minutes ago How about buy within your means for a 30yr or even 15 year permalink parent award report block reply JoePlumber 1 points 27 minutes ago That's exactly what I'm advocating. For example, I took a 30 year mortgage on my first home, I pay on average about $150 extra each month. So my mortgage originally was like $1200/mo I paid $1350 a month, which happened to be our rent before we bought. Worked out great. Because taxes and insurance fluctuate some of that extra is eaten up sometimes and I simply increase my payment. I am on track to pay off my mortgage about 9.5 years early and save over $60k on interest. This is basic personal finance. Buy what you can comfortably afford only and then pay extra! permalink parent award report block reply Patriot4TN 1 points 24 minutes ago You assume everyone is in the same boat as you... They are not. Some see they can afford said house at 50 years and take it. They don't realize the cost of home ownership. More than likely they will foreclose. People need to stop saying \"just pay extra\". permalink parent award report block reply JoePlumber 1 points 18 minutes ago lol no The expectation is that if you are embarking on getting a mortgage you have some sense of personal finance. You've managed to save a 10-20%+ down payment and you've done your research on how to best utilize your buying power. If any of that isn't true I have zero sympathy for you. Even with 30 year mortgages you are fucking retarded if you are just paying the minimum amount each month. You're pissing money away on interest unnecessarily and deserve foreclosure or whatever ends up happening at that point. I don't sympathize with the stupid, and the stupid really shouldn't be buying houses honestly. permalink parent award report block reply view 1 more comments...\nzippy2 1 points 37 minutes ago If you can afford an extra $120/mo, then you'd qualify for the 30 year mortgage. permalink parent award report block reply JoePlumber -1 points 30 minutes ago if you CAN'T afford an extra $120 month you shouldn't be getting a mortgage at all. Again, basic personal finance. holy shit public schools failed you all. permalink parent award report block reply\nJoePlumber -1 points 30 minutes ago if you CAN'T afford an extra $120 month you shouldn't be getting a mortgage at all. Again, basic personal finance. holy shit public schools failed you all. permalink parent award report block reply\nhellohellohellohell 1 points 28 minutes ago Plus, you can refinance as your financial situation improves, or sell it and upgrade your house. At least you're building equity instead of burning the money on rent. If this was all Trump was offering, I'd understand the upset, but this is just one arrow in the quiver, not his entire economic platform. And I'm sure it would be a welcome tool for many buyers, at least as a stop-gap to get them in the home they want right now. Seriously, how many people live in the same home, with the same mortgage, for 50 years these days? permalink parent award report block reply\nJoinTheDiscussion 1 points 39 minutes ago How about buy within your means for a 30yr or even 15 year permalink parent award report block reply JoePlumber 1 points 27 minutes ago That's exactly what I'm advocating. For example, I took a 30 year mortgage on my first home, I pay on average about $150 extra each month. So my mortgage originally was like $1200/mo I paid $1350 a month, which happened to be our rent before we bought. Worked out great. Because taxes and insurance fluctuate some of that extra is eaten up sometimes and I simply increase my payment. I am on track to pay off my mortgage about 9.5 years early and save over $60k on interest. This is basic personal finance. Buy what you can comfortably afford only and then pay extra! permalink parent award report block reply Patriot4TN 1 points 24 minutes ago You assume everyone is in the same boat as you... They are not. Some see they can afford said house at 50 years and take it. They don't realize the cost of home ownership. More than likely they will foreclose. People need to stop saying \"just pay extra\". permalink parent award report block reply JoePlumber 1 points 18 minutes ago lol no The expectation is that if you are embarking on getting a mortgage you have some sense of personal finance. You've managed to save a 10-20%+ down payment and you've done your research on how to best utilize your buying power. If any of that isn't true I have zero sympathy for you. Even with 30 year mortgages you are fucking retarded if you are just paying the minimum amount each month. You're pissing money away on interest unnecessarily and deserve foreclosure or whatever ends up happening at that point. I don't sympathize with the stupid, and the stupid really shouldn't be buying houses honestly. permalink parent award report block reply view 1 more comments...\nJoePlumber 1 points 27 minutes ago That's exactly what I'm advocating. For example, I took a 30 year mortgage on my first home, I pay on average about $150 extra each month. So my mortgage originally was like $1200/mo I paid $1350 a month, which happened to be our rent before we bought. Worked out great. Because taxes and insurance fluctuate some of that extra is eaten up sometimes and I simply increase my payment. I am on track to pay off my mortgage about 9.5 years early and save over $60k on interest. This is basic personal finance. Buy what you can comfortably afford only and then pay extra! permalink parent award report block reply Patriot4TN 1 points 24 minutes ago You assume everyone is in the same boat as you... They are not. Some see they can afford said house at 50 years and take it. They don't realize the cost of home ownership. More than likely they will foreclose. People need to stop saying \"just pay extra\". permalink parent award report block reply JoePlumber 1 points 18 minutes ago lol no The expectation is that if you are embarking on getting a mortgage you have some sense of personal finance. You've managed to save a 10-20%+ down payment and you've done your research on how to best utilize your buying power. If any of that isn't true I have zero sympathy for you. Even with 30 year mortgages you are fucking retarded if you are just paying the minimum amount each month. You're pissing money away on interest unnecessarily and deserve foreclosure or whatever ends up happening at that point. I don't sympathize with the stupid, and the stupid really shouldn't be buying houses honestly. permalink parent award report block reply view 1 more comments...\nPatriot4TN 1 points 24 minutes ago You assume everyone is in the same boat as you... They are not. Some see they can afford said house at 50 years and take it. They don't realize the cost of home ownership. More than likely they will foreclose. People need to stop saying \"just pay extra\". permalink parent award report block reply JoePlumber 1 points 18 minutes ago lol no The expectation is that if you are embarking on getting a mortgage you have some sense of personal finance. You've managed to save a 10-20%+ down payment and you've done your research on how to best utilize your buying power. If any of that isn't true I have zero sympathy for you. Even with 30 year mortgages you are fucking retarded if you are just paying the minimum amount each month. You're pissing money away on interest unnecessarily and deserve foreclosure or whatever ends up happening at that point. I don't sympathize with the stupid, and the stupid really shouldn't be buying houses honestly. permalink parent award report block reply view 1 more comments...\nJoePlumber 1 points 18 minutes ago lol no The expectation is that if you are embarking on getting a mortgage you have some sense of personal finance. You've managed to save a 10-20%+ down payment and you've done your research on how to best utilize your buying power. If any of that isn't true I have zero sympathy for you. Even with 30 year mortgages you are fucking retarded if you are just paying the minimum amount each month. You're pissing money away on interest unnecessarily and deserve foreclosure or whatever ends up happening at that point. I don't sympathize with the stupid, and the stupid really shouldn't be buying houses honestly. permalink parent award report block reply view 1 more comments...\nFlyinHeadlock 4 points 35 minutes ago It doesn't even lower the monthly payment that much. About $50 for an average home and as you stated, long term it's a joke. I've been listening to people in real estate on Breitbart call in about it. It's a mixed bag. If you own real estate there is an argument where it works in your favor but that was not the intent. It was aimed at home buyers. The only good thing would be if the rates go down drastically, a buyer could re-finance lower. We are one of the only countries with that option but the rates likely aren't ever getting back to 2-3% again. permalink award report block reply starjello 4 points 32 minutes ago Yeah big whoop. 50 bucks on the average mortgage payment nowadays isn't going to be a piss in a piddle permalink parent award report block reply couranto 1 points 18 minutes ago It's way more than 50 bucks lol. You people are dumb af -- just a bunch of crybaby shills. Yall complain about everything. permalink parent award report block reply FlyinHeadlock 1 points 8 minutes ago They did the math on it on Breitbart radio. For an average home it lowered it $50 a month. It depends on the costs of the home though but big picture it's horrible. All mortgages are horrible unless you pay it off earlier or, find somewhere else to earn more than the interests on the mortgage. I paid mine off early. It ended up saving me like $150K or something stupid. It wasn't easy. I made lots of sacrifices. No vacations, new cars, buying lots of used stuff and rarely eating out. Most people would say screw that. permalink parent award report block reply\nstarjello 4 points 32 minutes ago Yeah big whoop. 50 bucks on the average mortgage payment nowadays isn't going to be a piss in a piddle permalink parent award report block reply\ncouranto 1 points 18 minutes ago It's way more than 50 bucks lol. You people are dumb af -- just a bunch of crybaby shills. Yall complain about everything. permalink parent award report block reply FlyinHeadlock 1 points 8 minutes ago They did the math on it on Breitbart radio. For an average home it lowered it $50 a month. It depends on the costs of the home though but big picture it's horrible. All mortgages are horrible unless you pay it off earlier or, find somewhere else to earn more than the interests on the mortgage. I paid mine off early. It ended up saving me like $150K or something stupid. It wasn't easy. I made lots of sacrifices. No vacations, new cars, buying lots of used stuff and rarely eating out. Most people would say screw that. permalink parent award report block reply\nFlyinHeadlock 1 points 8 minutes ago They did the math on it on Breitbart radio. For an average home it lowered it $50 a month. It depends on the costs of the home though but big picture it's horrible. All mortgages are horrible unless you pay it off earlier or, find somewhere else to earn more than the interests on the mortgage. I paid mine off early. It ended up saving me like $150K or something stupid. It wasn't easy. I made lots of sacrifices. No vacations, new cars, buying lots of used stuff and rarely eating out. Most people would say screw that. permalink parent award report block reply\nJack_NC 2 points 26 minutes ago It's hard to understand the pain of paying 3x more just to save $100/month on payments. But it doesn't surprise me. I used to sell cars. Day one of training the sales manager told us \"People buy on total price, on payments, or on trade-in-value. Find out what they want and we'll give them that and screw them on the other. Need a great final price? Fine. We'll give you a stupid high interest rate and make our money on financing. Want a low payment? No problem - 8 year loan. They want way too much that ragged trade-in? We can do that, and then give no discounts AND a high interest rate.\" The worst worst worst (for us) deal was when someone came in and said \"Cash deal (or I brought financing from my own bank). I'll give you $xxx for that car. Take it or leave it.\" We didn't make any money there. A 50 year mortgage is a banker's way of saying \"you can't afford it, but we will gladly make a fortune off of your inability to do math.\" permalink award report block reply\nElephant_Trump OP 2 points 45 minutes ago TLDR: GRAND TOTAL PAID $1,578,000 (excellent credit) GROK adjusted my $77k purchase price up to $125k to accommodate modern market pricing. pardon the formatting. I have done my best to repair it. my title is misleading due to a typo. my lot was less than 1/8acre we paid the example house off in 2019, 15 years early. we now live in the country on 10 acres in a 2023 construction house. it is financed at 5.12% over 30 years with a $75k balance and 28 years remaining on the loan. we applied 100% of the sale proceeds from the example house to our new $188k mortgage 12 months after moving in. my first house purchased was $77k in 2004. it was ~1125sqft built in 1964. I bought it on a 30 year loan.\nthis scenario uses that house in modern times but applies the 50 year mortgage terms proposed by president Trump and modern interest rates. below is Grok's analysis: Total Lifetime Cost to Fully Pay Off the House (50 Years)\nThis includes every dollar paid over 600 months: • Principal & Interest (P&I) • FHA Mortgage Insurance Premium (MIP) — never drops off due to <10% down and >20-year term • Escrow (property taxes + homeowners insurance) — using conservative 2.5% average annual inflation (historical Amarillo average ~2.2% taxes + ~3% insurance)\nHouse Value (2025): $175,000 • Down payment: 3.5% = $6,125 • Base loan: $168,875 • Upfront MIP financed: $2,953 → Effective loan = $171,734 Total Cost Breakdown (Over 50 Years)\nItem Excellent Credit (6.50%) Average Credit (6.75%) Monthly P&I $1,138 $1,165 Total P&I Paid (600 months)$682,800 $699,000 Total Interest Paid $511,066\n$527,266 Principal Repaid $168,875 $168,875 Upfront MIP (fin. financed) $2,953 $2,953 Monthly MIP $787 $787 Total MIP Paid (600 months) $472,200 $472,200 Monthly Escrow (Year 1) $466$466 Escrow with 2.5% annual inflation $466 → $1,040 by Year 50 SameTotal Escrow Paid (50 yrs, inflated) $423,000 $423,000  → Taxes (~68%)~$287,000~$287,000  → Insurance (~32%)~$136,000~$136,000 FINAL TOTAL COST TO OWN (50 YEARS)\nCredit ScenarioTotal Paid Over 50 YearsCost Multiple of Home PriceExcellent (835) $1,578,000 9.0× the $175,000 home Average (~700) $1,594,200 9.1× the $175,000 home Summary: What You Actually Pay\nCategory Amount Home purchase price $175,000 Down payment–$6,125Total mortgage payments (P&I + MIP) $1,155,000 Total escrow (taxes + insurance, inflated) $423,000→ GRAND TOTAL PAID$1,578,000 (excellent credit) You pay $1.4 million in interest, insurance, and taxes — 8× the home’s value — just to own it free and clear in 2075. Key Takeaways\n• MIP is brutal: $472k — more than 2.7× the original loan.\n• Escrow inflation hurts: Starts at $466/mo → ends at $1,040/mo → averages ~$705/mo.\n• Equity builds slowly: After 10 years, you’ve paid ~$287k total but only own ~$50k in equity.\n• Trump’s 50-year plan cuts monthly payment (~$1,000 less than 30-year) but doubles lifetime cost.\nBottom Line: You’d pay over $1.5 million to own a $175,000 house — 90% of payments go to interest, insurance, and taxes, not equity.\nPro Tip: Put 20% down → eliminate MIP → save ~$500k+ over 50 years. permalink award report block reply Bullet3250 0 points 25 minutes ago A 50 year Mort is not a good option - I agree - but don't overlook a few other numbers. On the plus side: What was the home value after 50 years?    Maybe ten times or even more. All the equity falls to the owner. And Dollar inflation lowers the value of those mortgage payment dollars too - $1000 dollars in 1975 is now $6000.   But you are still paying $1000. You are paying the bank with cheaper and cheaper dollars. On the Negative side, additionally,  - a 50 year of house will likely fully need to replace half the house over 50 years. 3 roof replacements, 1-2 FULL HVAC systems, possibly 1 new set of windows.  it is possible the plumbing and electric will be need major work or replacement.  Those costs can be high - that is all a loss/maintenance. permalink parent award report block reply SHILL_DETECTOR 0 points 44 minutes ago why did you use grok for this? no one is going to read it permalink parent award report block reply Patriot4TN 5 points 39 minutes ago I read it and cannot fathom the total cost after 50 years. This is crazy. Who in their right mind would think this is a good ideal? Granted the house will more than likely be sold 3 times over during that 50 year life span, but still.... permalink parent award report block reply SHILL_DETECTOR 0 points 39 minutes ago https://www.mortgagecalculator.org/calculators/what-if-i-pay-more-calculator.php permalink parent award report block reply Patriot4TN 3 points 36 minutes ago People getting 50 year mortgages probably cannot afford to pay extra. If they did, they could just get a 30 year loan. Maybe in 10-15 years of owning the home as their pay check increases... But not right away. permalink parent award report block reply view 4 more comments... JoePlumber -2 points 43 minutes ago this is impossible to read. learn to format. also why would anyone just pay the minimum on their mortgage every month? terrible financial strategy that ignores the reality of extra principle payments. permalink parent award report block reply Tikk 3 points 31 minutes ago I've lowered the amount I pay in additional principle simply because my mortgage interest rate is relatively low (3.875%). The money I had been adding to my monthly payment would be better invested in a stock or mutual fund, which has a dividend of 4% - 17%.  Additionally those stock prices would be indexed with inflation. So there is the argument, based upon terms of the loan, that not paying additional principle is a good idea. permalink parent award report block reply JoePlumber 1 points 25 minutes ago This would be next-level personal finance. If people can't understand buying a house they can comfortably afford and then paying extra each month to reduce interest paid and pay it off early they certainly can't understand the rate of return vs the mortgage APR. I agree with what you're saying but one step at a time haha and also you and I have great mortgage rates but these days people are paying 6.5% or 7% so it's not like that anymore and they're probably better off paying extra even if they have the investment skills/knowlege. permalink parent award report block reply\nBullet3250 0 points 25 minutes ago A 50 year Mort is not a good option - I agree - but don't overlook a few other numbers. On the plus side: What was the home value after 50 years?    Maybe ten times or even more. All the equity falls to the owner. And Dollar inflation lowers the value of those mortgage payment dollars too - $1000 dollars in 1975 is now $6000.   But you are still paying $1000. You are paying the bank with cheaper and cheaper dollars. On the Negative side, additionally,  - a 50 year of house will likely fully need to replace half the house over 50 years. 3 roof replacements, 1-2 FULL HVAC systems, possibly 1 new set of windows.  it is possible the plumbing and electric will be need major work or replacement.  Those costs can be high - that is all a loss/maintenance. permalink parent award report block reply\nSHILL_DETECTOR 0 points 44 minutes ago why did you use grok for this? no one is going to read it permalink parent award report block reply Patriot4TN 5 points 39 minutes ago I read it and cannot fathom the total cost after 50 years. This is crazy. Who in their right mind would think this is a good ideal? Granted the house will more than likely be sold 3 times over during that 50 year life span, but still.... permalink parent award report block reply SHILL_DETECTOR 0 points 39 minutes ago https://www.mortgagecalculator.org/calculators/what-if-i-pay-more-calculator.php permalink parent award report block reply Patriot4TN 3 points 36 minutes ago People getting 50 year mortgages probably cannot afford to pay extra. If they did, they could just get a 30 year loan. Maybe in 10-15 years of owning the home as their pay check increases... But not right away. permalink parent award report block reply view 4 more comments...\nPatriot4TN 5 points 39 minutes ago I read it and cannot fathom the total cost after 50 years. This is crazy. Who in their right mind would think this is a good ideal? Granted the house will more than likely be sold 3 times over during that 50 year life span, but still.... permalink parent award report block reply SHILL_DETECTOR 0 points 39 minutes ago https://www.mortgagecalculator.org/calculators/what-if-i-pay-more-calculator.php permalink parent award report block reply Patriot4TN 3 points 36 minutes ago People getting 50 year mortgages probably cannot afford to pay extra. If they did, they could just get a 30 year loan. Maybe in 10-15 years of owning the home as their pay check increases... But not right away. permalink parent award report block reply view 4 more comments...\nSHILL_DETECTOR 0 points 39 minutes ago https://www.mortgagecalculator.org/calculators/what-if-i-pay-more-calculator.php permalink parent award report block reply Patriot4TN 3 points 36 minutes ago People getting 50 year mortgages probably cannot afford to pay extra. If they did, they could just get a 30 year loan. Maybe in 10-15 years of owning the home as their pay check increases... But not right away. permalink parent award report block reply view 4 more comments...\nPatriot4TN 3 points 36 minutes ago People getting 50 year mortgages probably cannot afford to pay extra. If they did, they could just get a 30 year loan. Maybe in 10-15 years of owning the home as their pay check increases... But not right away. permalink parent award report block reply view 4 more comments...\nJoePlumber -2 points 43 minutes ago this is impossible to read. learn to format. also why would anyone just pay the minimum on their mortgage every month? terrible financial strategy that ignores the reality of extra principle payments. permalink parent award report block reply Tikk 3 points 31 minutes ago I've lowered the amount I pay in additional principle simply because my mortgage interest rate is relatively low (3.875%). The money I had been adding to my monthly payment would be better invested in a stock or mutual fund, which has a dividend of 4% - 17%.  Additionally those stock prices would be indexed with inflation. So there is the argument, based upon terms of the loan, that not paying additional principle is a good idea. permalink parent award report block reply JoePlumber 1 points 25 minutes ago This would be next-level personal finance. If people can't understand buying a house they can comfortably afford and then paying extra each month to reduce interest paid and pay it off early they certainly can't understand the rate of return vs the mortgage APR. I agree with what you're saying but one step at a time haha and also you and I have great mortgage rates but these days people are paying 6.5% or 7% so it's not like that anymore and they're probably better off paying extra even if they have the investment skills/knowlege. permalink parent award report block reply\nTikk 3 points 31 minutes ago I've lowered the amount I pay in additional principle simply because my mortgage interest rate is relatively low (3.875%). The money I had been adding to my monthly payment would be better invested in a stock or mutual fund, which has a dividend of 4% - 17%.  Additionally those stock prices would be indexed with inflation. So there is the argument, based upon terms of the loan, that not paying additional principle is a good idea. permalink parent award report block reply JoePlumber 1 points 25 minutes ago This would be next-level personal finance. If people can't understand buying a house they can comfortably afford and then paying extra each month to reduce interest paid and pay it off early they certainly can't understand the rate of return vs the mortgage APR. I agree with what you're saying but one step at a time haha and also you and I have great mortgage rates but these days people are paying 6.5% or 7% so it's not like that anymore and they're probably better off paying extra even if they have the investment skills/knowlege. permalink parent award report block reply\nJoePlumber 1 points 25 minutes ago This would be next-level personal finance. If people can't understand buying a house they can comfortably afford and then paying extra each month to reduce interest paid and pay it off early they certainly can't understand the rate of return vs the mortgage APR. I agree with what you're saying but one step at a time haha and also you and I have great mortgage rates but these days people are paying 6.5% or 7% so it's not like that anymore and they're probably better off paying extra even if they have the investment skills/knowlege. permalink parent award report block reply\nsleepinggiant 1 points 28 minutes ago Yeah i dont know who trump is listening to but he certainly is fucking up his base. permalink award report block reply\nPatriotDescendant 1 points 15 minutes ago When we bought our first house in 1984, interest rates were pretty steep and we barely qualified for the 30 year. But four years later, following promotions and steps we took to curb wasteful spending (less partying and more adulting), plus two refinancings as rates fell, we were soon doubling our required payments with room to spare. I don't see much of an issue with 50-year loans. Smart people will get in, and when possible, accelerate paydown. Dumb people won't. Caveat motherfucking emptor. permalink award report block reply\ncouranto 0 points 19 minutes ago Gues what dumb fuck. It's not mandated. Get a 15 year, big shot. Plus almost no one even completes a 30 year loan, nvm a 50. permalink award report block reply Elephant_Trump OP -2 points 15 minutes ago ummm... I am not doing this shithow. I just wanted real numbers for educational purposes for myself and thought I might share with some folks who I assume also have brains and would take interest. I live a rural dream: 10 acres, 30 year loan with 27.5 remaining @ 5.12% interest. 3b2ba2ca 1900sqft (400 is basement) custom designed new construction 2023. calm down jeez... you're like a hysterical woman. permalink parent award report block reply\nElephant_Trump OP -2 points 15 minutes ago ummm... I am not doing this shithow. I just wanted real numbers for educational purposes for myself and thought I might share with some folks who I assume also have brains and would take interest. I live a rural dream: 10 acres, 30 year loan with 27.5 remaining @ 5.12% interest. 3b2ba2ca 1900sqft (400 is basement) custom designed new construction 2023. calm down jeez... you're like a hysterical woman. permalink parent award report block reply"}