{"id": "1ARK9irV9G", "contents": "431 Chad AF posted 2 days ago by SuperHonkey 29 comments award share report block 🇺🇸 𝓐𝓟𝓡𝓘𝓛 𝓢𝓟𝓐𝓡𝓚𝓢 🇺🇸 @AprilSpark1890 • 2d Dallas, Texas near Epic Mosque 💥💥👀🙏🏼✝️🇺🇸🇺🇸🇺🇸✝️🙏🏼👀💥💥 Man confronts a group of Muslims praying near a coffee shop.  He plays duck, duck, goose with them while saying The Lord’s Prayer over their prayers.  He lets them know that Jesus is the way, the truth, and the life.\n29 comments Sort by Top Top New Worst Old Save reversethefraud 22 points 2 days ago he needs to add those 30 men riding mohammed in the desert to his list of islam truths that moslems find embarrasing. permalink award report block reply SuperHonkey OP 11 points 2 days ago Muhammad, the original HyperFaggot permalink parent award report block reply impera 7 points 2 days ago The gay man that goes on to be a violent and infamous child molester archetype still holding strong for thousands of years. permalink parent award report block reply snoopy3210 2 points 2 days ago Angry because he couldn’t do miracles. permalink parent award report block reply apathy_meh 7 points 2 days ago Al-Zutt, put the power of 30 men inside him. Which you would think they would be pro-gay. permalink parent award report block reply Taqiyya_Mockingbird 18 points 2 days ago These are enemy combatants. permalink award report block reply SirPokeSmottington 1 points 2 days ago And as a result, it's idiotic to go to jail for assault and battery. Which he did. permalink parent award report block reply VanillaCupCake 13 points 2 days ago i cannot believe these people are not rounded up and deported. permalink award report block reply Smurfection 10 points 2 days ago If Christians were doing this outside a restaurant, they'd be asked to remove themselves from the property.  If they didn't, they'd be arrested. Also, I think it's great that there are people who are willing to preach the gospel over them when they are praying. If they don't want to be harassed, they can go to a mosque.  Don't let this praying outside anywhere thing become a \"tradition\" in America. permalink award report block reply YT45 9 points 2 days ago Muz don’t belong here. permalink award report block reply KarenLukasik 8 points 2 days ago Almost 70,but I might now be pregnant! permalink award report block reply SuperHonkey OP 4 points 2 days ago 🤣 permalink parent award report block reply dukeofdoorcounty 4 points 2 days ago he forgot to mention goat fvcking permalink award report block reply NoticesBugleOWO 3 points 2 days ago They simply aren't going to understand that sort of logic. Best treat them with something they know and understand... like a truck of peace. permalink award report block reply Lelleck 2 points 1 day ago They probably didn’t even understand him permalink parent award report block reply DontBeAFaggot 2 points 2 days ago Needs more bacon permalink award report block reply KeenanV71 2 points 2 days ago Is this bert kreischer's new thing to do? permalink award report block reply bluedevilga 2 points 2 days ago Reminds me of Merry Fucking Christmas from South park https://youtu.be/K40epl0r-Fg?si=wzQaqnzs-_OKddgb permalink award report block reply Whoopies_tds 1 points 1 day ago Mockingbird them unfortunately will not prevent the cancer from spreading permalink award report block reply WeHappyDeplorable 1 points 2 days ago I think this is ai. Look at the roof border, it breaks for no reason. Look also at the back window of the white suv on the right as walker dude goes behind the crowd. I maybe just don't know what car it is but it looks weird. permalink award report block reply chickeninoven 1 points 2 days ago Maybe not. I found the location: 222 E Farm To Market 544 #210, Murphy, TX 75094 Doesn't have the signage or chairs and tables out front, but otherwise the building is identical. permalink parent award report block reply WeHappyDeplorable 1 points 58 minutes ago Nice find. I guess the break could be a front to another store on the backend.\nMaybe you're right, though!\nAny idea about the car? permalink parent award report block reply 0illuminated1 -4 points 2 days ago Just because Jesus is the way, truth and life doesn't mean one's understanding of Christianity is. Most Christians wouldn't know Jesus even if they met him face to face. permalink award report block reply gillonba 6 points 2 days ago This man may not be a model Christian, but tolerating a religion that is openly expansionist and intolerant of your own is not a good survival strategy.  Why do you think Islam is dominant in the middle east today?  Try praying the Lord's Prayer in public and see what happens. permalink parent award report block reply 0illuminated1 0 points 2 days ago By no means saying to tolerate evil. permalink parent award report block reply TerribleParable 1 points 2 days ago True, he could have been more compassionate  while calling out their idolatry permalink parent award report block reply 0illuminated1 0 points 2 days ago If we could be more Christ-like perhaps we'd have more success helping the blind see. permalink parent award report block reply corntortilla -7 points 2 days ago I don’t see any chads. Just religious freaks. permalink award report block reply etcetera 1 points 2 days ago Comment removed by community moderators. permalink award report block reply FurtherRight 1 points 2 days ago Comment removed by community filter, pending further review. permalink award report block reply\nreversethefraud 22 points 2 days ago he needs to add those 30 men riding mohammed in the desert to his list of islam truths that moslems find embarrasing. permalink award report block reply SuperHonkey OP 11 points 2 days ago Muhammad, the original HyperFaggot permalink parent award report block reply impera 7 points 2 days ago The gay man that goes on to be a violent and infamous child molester archetype still holding strong for thousands of years. permalink parent award report block reply snoopy3210 2 points 2 days ago Angry because he couldn’t do miracles. permalink parent award report block reply apathy_meh 7 points 2 days ago Al-Zutt, put the power of 30 men inside him. Which you would think they would be pro-gay. permalink parent award report block reply\nSuperHonkey OP 11 points 2 days ago Muhammad, the original HyperFaggot permalink parent award report block reply impera 7 points 2 days ago The gay man that goes on to be a violent and infamous child molester archetype still holding strong for thousands of years. permalink parent award report block reply snoopy3210 2 points 2 days ago Angry because he couldn’t do miracles. permalink parent award report block reply\nimpera 7 points 2 days ago The gay man that goes on to be a violent and infamous child molester archetype still holding strong for thousands of years. permalink parent award report block reply\nsnoopy3210 2 points 2 days ago Angry because he couldn’t do miracles. permalink parent award report block reply\napathy_meh 7 points 2 days ago Al-Zutt, put the power of 30 men inside him. Which you would think they would be pro-gay. permalink parent award report block reply\nTaqiyya_Mockingbird 18 points 2 days ago These are enemy combatants. permalink award report block reply SirPokeSmottington 1 points 2 days ago And as a result, it's idiotic to go to jail for assault and battery. Which he did. permalink parent award report block reply\nSirPokeSmottington 1 points 2 days ago And as a result, it's idiotic to go to jail for assault and battery. Which he did. permalink parent award report block reply\nVanillaCupCake 13 points 2 days ago i cannot believe these people are not rounded up and deported. permalink award report block reply\nSmurfection 10 points 2 days ago If Christians were doing this outside a restaurant, they'd be asked to remove themselves from the property.  If they didn't, they'd be arrested. Also, I think it's great that there are people who are willing to preach the gospel over them when they are praying. If they don't want to be harassed, they can go to a mosque.  Don't let this praying outside anywhere thing become a \"tradition\" in America. permalink award report block reply\nYT45 9 points 2 days ago Muz don’t belong here. permalink award report block reply\nKarenLukasik 8 points 2 days ago Almost 70,but I might now be pregnant! permalink award report block reply SuperHonkey OP 4 points 2 days ago 🤣 permalink parent award report block reply\nSuperHonkey OP 4 points 2 days ago 🤣 permalink parent award report block reply\ndukeofdoorcounty 4 points 2 days ago he forgot to mention goat fvcking permalink award report block reply\nNoticesBugleOWO 3 points 2 days ago They simply aren't going to understand that sort of logic. Best treat them with something they know and understand... like a truck of peace. permalink award report block reply Lelleck 2 points 1 day ago They probably didn’t even understand him permalink parent award report block reply\nLelleck 2 points 1 day ago They probably didn’t even understand him permalink parent award report block reply\nDontBeAFaggot 2 points 2 days ago Needs more bacon permalink award report block reply\nKeenanV71 2 points 2 days ago Is this bert kreischer's new thing to do? permalink award report block reply\nbluedevilga 2 points 2 days ago Reminds me of Merry Fucking Christmas from South park https://youtu.be/K40epl0r-Fg?si=wzQaqnzs-_OKddgb permalink award report block reply\nWhoopies_tds 1 points 1 day ago Mockingbird them unfortunately will not prevent the cancer from spreading permalink award report block reply\nWeHappyDeplorable 1 points 2 days ago I think this is ai. Look at the roof border, it breaks for no reason. Look also at the back window of the white suv on the right as walker dude goes behind the crowd. I maybe just don't know what car it is but it looks weird. permalink award report block reply chickeninoven 1 points 2 days ago Maybe not. I found the location: 222 E Farm To Market 544 #210, Murphy, TX 75094 Doesn't have the signage or chairs and tables out front, but otherwise the building is identical. permalink parent award report block reply WeHappyDeplorable 1 points 58 minutes ago Nice find. I guess the break could be a front to another store on the backend.\nMaybe you're right, though!\nAny idea about the car? permalink parent award report block reply\nchickeninoven 1 points 2 days ago Maybe not. I found the location: 222 E Farm To Market 544 #210, Murphy, TX 75094 Doesn't have the signage or chairs and tables out front, but otherwise the building is identical. permalink parent award report block reply WeHappyDeplorable 1 points 58 minutes ago Nice find. I guess the break could be a front to another store on the backend.\nMaybe you're right, though!\nAny idea about the car? permalink parent award report block reply\nWeHappyDeplorable 1 points 58 minutes ago Nice find. I guess the break could be a front to another store on the backend.\nMaybe you're right, though!\nAny idea about the car? permalink parent award report block reply\n0illuminated1 -4 points 2 days ago Just because Jesus is the way, truth and life doesn't mean one's understanding of Christianity is. Most Christians wouldn't know Jesus even if they met him face to face. permalink award report block reply gillonba 6 points 2 days ago This man may not be a model Christian, but tolerating a religion that is openly expansionist and intolerant of your own is not a good survival strategy.  Why do you think Islam is dominant in the middle east today?  Try praying the Lord's Prayer in public and see what happens. permalink parent award report block reply 0illuminated1 0 points 2 days ago By no means saying to tolerate evil. permalink parent award report block reply TerribleParable 1 points 2 days ago True, he could have been more compassionate  while calling out their idolatry permalink parent award report block reply 0illuminated1 0 points 2 days ago If we could be more Christ-like perhaps we'd have more success helping the blind see. permalink parent award report block reply\ngillonba 6 points 2 days ago This man may not be a model Christian, but tolerating a religion that is openly expansionist and intolerant of your own is not a good survival strategy.  Why do you think Islam is dominant in the middle east today?  Try praying the Lord's Prayer in public and see what happens. permalink parent award report block reply 0illuminated1 0 points 2 days ago By no means saying to tolerate evil. permalink parent award report block reply\n0illuminated1 0 points 2 days ago By no means saying to tolerate evil. permalink parent award report block reply\nTerribleParable 1 points 2 days ago True, he could have been more compassionate  while calling out their idolatry permalink parent award report block reply 0illuminated1 0 points 2 days ago If we could be more Christ-like perhaps we'd have more success helping the blind see. permalink parent award report block reply\n0illuminated1 0 points 2 days ago If we could be more Christ-like perhaps we'd have more success helping the blind see. permalink parent award report block reply\ncorntortilla -7 points 2 days ago I don’t see any chads. Just religious freaks. permalink award report block reply\netcetera 1 points 2 days ago Comment removed by community moderators. permalink award report block reply\nFurtherRight 1 points 2 days ago Comment removed by community filter, pending further review. permalink award report block reply"}