{"id": "1ARK5BHQJg", "contents": "513 LAURA INGRAHAM: \"The requirement that companies post jobs or pay fines doesn't solve the problem.  With Americans being laid off by Big Tech, there should be zero H1-B visas.\" posted 3 days ago by bleeje 19 comments award share report block Laura Ingraham @IngrahamAngle • 3d The requirement that companies post jobs or pay fines doesn't solve the problem.  With Americans being laid off by Big Tech, there should be zero H1-B visas. johnny maga @_johnnymaga • 3d Woah. Trump’s Secretary of Labor just announced that they have over 175 investigations into companies suspected of abusing the H-1B visa program. She says they’re going to force employers to post job openings to the American public before hiring H-1Bs.\n19 comments Sort by Top Top New Worst Old Save Around the Web Awakened 18 points 3 days ago Trump, you need to end this shit. Then again, I forgot big tech bought you during the election. permalink award report block reply CanadianLad 11 points 3 days ago Canadian software engineer here who's end game is to work for a US software company, even I recognize that this would require an H1B, and, well, yall gotta have a go at those jobs first before foreigners. That's literally what America First means. permalink award report block reply Lamal 1 points 2 days ago I think if we eliminated the fraud from India and China there would be a lot less anger and resentment and you'd have a much better chance. And I appreciate that you get it -- USA is finally attempting to defend its birthright. I hope Canada somehow finds a way to do so also. permalink parent award report block reply CanadianLad 2 points 2 days ago Thanks man, totally appreciated. Canada's a lost cause. We're being overrun still by our current communist liberal regime. I still believe in the American Dream. Currently, my main way of getting into America is to open a software firm there, and create US jobs. There's a special category for technology, but it's viable, and creates America-first jobs. I live in Taiwan now, but yeah, eventually I gotta come back to North America. Born and raised. permalink parent award report block reply Nanteen 10 points 3 days ago If your company laid off anyone, you should be completely ineligible for H1Bs for at least 10 years permalink award report block reply user2827 8 points 3 days ago The simple fix is to make it so that hiring a foreigner will cost the company AT LEAST as much as hiring someone locally for the role, but the more above and beyond the better. There should also be some delays, like say, a 6 month period where companies have to post advertisements for the position and demonstrate how many applicants showed up before they can apply for some foreigners for that specific role only. permalink award report block reply ChilledCovfefe 5 points 3 days ago Cut them off!! American tech people are being laid off by tens of thousands and it’s impossible to find a full time role.  I know many in this situation. permalink award report block reply The_RedWolf 4 points 3 days ago Layoffs should come from H-1Bs first.  If youre laying off 100 people from a department, any H1Bs in that department need to be the first cut. permalink award report block reply BruddahIz 4 points 3 days ago Write your own sternly worded letter in two weeks in the job posting - we will  then let you hire all the H1B's you want. - Trump Admin. permalink award report block reply jermzdeejd 3 points 2 days ago When you fine a multi billion dollar company a few grand at a time it really doesn't have much of an effect. permalink award report block reply FromBilgewater 3 points 2 days ago Gotta get rid of the foreigners in managerial positions. Once they get in a position to hire, they ONLY hire their own. The Americans never even get a foot in the door to interview. permalink award report block reply greatpumpkin 3 points 2 days ago Void all visa programs NOW. permalink award report block reply MPitcher1776 3 points 3 days ago Verizon !!!!! permalink award report block reply Lamal 2 points 2 days ago This is the first time the DEPT. OF LABOR has ever done anything to benefit Americans ! This has been my top priority topic for 20 years. I'm happy with what the admin is doing and I want even more. If they are serious about the 100k/yr fee this will resolve 99% of abuse and take away the argument that we need to \"get the best and brightest\" permalink award report block reply UltraMagaWA 2 points 2 days ago Zero permalink award report block reply PatriotDescendant 2 points 2 days ago Fire an American worker? No, you must fire an H1B visa worker and move the US worker. Hell, most large business have already implemented internal talent market platforms (ITMs) that can easily execute the process. (Google \"Gartner Internal Talent Markets platforms\") This definitely needs to be a thing! Who's telling Trump? permalink award report block reply WildStar 2 points 2 days ago They already post the jobs. That's why they all require ten years of experience for an entry level position. permalink award report block reply NoticesBugleOWO 1 points 3 days ago If someone is so critical to a company's ability to function, then that company should be sponsoring that person for a green card and the person should be pledging allegiance to the US and give up their other citizenship once they meet the requirements for US citizenship. Ya know... normal shit. permalink award report block reply throat_GOAT_charlie 1 points 21 hours ago Comment removed upon the user being banned. permalink award report block reply\nAwakened 18 points 3 days ago Trump, you need to end this shit. Then again, I forgot big tech bought you during the election. permalink award report block reply\nCanadianLad 11 points 3 days ago Canadian software engineer here who's end game is to work for a US software company, even I recognize that this would require an H1B, and, well, yall gotta have a go at those jobs first before foreigners. That's literally what America First means. permalink award report block reply Lamal 1 points 2 days ago I think if we eliminated the fraud from India and China there would be a lot less anger and resentment and you'd have a much better chance. And I appreciate that you get it -- USA is finally attempting to defend its birthright. I hope Canada somehow finds a way to do so also. permalink parent award report block reply CanadianLad 2 points 2 days ago Thanks man, totally appreciated. Canada's a lost cause. We're being overrun still by our current communist liberal regime. I still believe in the American Dream. Currently, my main way of getting into America is to open a software firm there, and create US jobs. There's a special category for technology, but it's viable, and creates America-first jobs. I live in Taiwan now, but yeah, eventually I gotta come back to North America. Born and raised. permalink parent award report block reply\nLamal 1 points 2 days ago I think if we eliminated the fraud from India and China there would be a lot less anger and resentment and you'd have a much better chance. And I appreciate that you get it -- USA is finally attempting to defend its birthright. I hope Canada somehow finds a way to do so also. permalink parent award report block reply CanadianLad 2 points 2 days ago Thanks man, totally appreciated. Canada's a lost cause. We're being overrun still by our current communist liberal regime. I still believe in the American Dream. Currently, my main way of getting into America is to open a software firm there, and create US jobs. There's a special category for technology, but it's viable, and creates America-first jobs. I live in Taiwan now, but yeah, eventually I gotta come back to North America. Born and raised. permalink parent award report block reply\nCanadianLad 2 points 2 days ago Thanks man, totally appreciated. Canada's a lost cause. We're being overrun still by our current communist liberal regime. I still believe in the American Dream. Currently, my main way of getting into America is to open a software firm there, and create US jobs. There's a special category for technology, but it's viable, and creates America-first jobs. I live in Taiwan now, but yeah, eventually I gotta come back to North America. Born and raised. permalink parent award report block reply\nNanteen 10 points 3 days ago If your company laid off anyone, you should be completely ineligible for H1Bs for at least 10 years permalink award report block reply\nuser2827 8 points 3 days ago The simple fix is to make it so that hiring a foreigner will cost the company AT LEAST as much as hiring someone locally for the role, but the more above and beyond the better. There should also be some delays, like say, a 6 month period where companies have to post advertisements for the position and demonstrate how many applicants showed up before they can apply for some foreigners for that specific role only. permalink award report block reply\nChilledCovfefe 5 points 3 days ago Cut them off!! American tech people are being laid off by tens of thousands and it’s impossible to find a full time role.  I know many in this situation. permalink award report block reply\nThe_RedWolf 4 points 3 days ago Layoffs should come from H-1Bs first.  If youre laying off 100 people from a department, any H1Bs in that department need to be the first cut. permalink award report block reply\nBruddahIz 4 points 3 days ago Write your own sternly worded letter in two weeks in the job posting - we will  then let you hire all the H1B's you want. - Trump Admin. permalink award report block reply\njermzdeejd 3 points 2 days ago When you fine a multi billion dollar company a few grand at a time it really doesn't have much of an effect. permalink award report block reply\nFromBilgewater 3 points 2 days ago Gotta get rid of the foreigners in managerial positions. Once they get in a position to hire, they ONLY hire their own. The Americans never even get a foot in the door to interview. permalink award report block reply\ngreatpumpkin 3 points 2 days ago Void all visa programs NOW. permalink award report block reply\nMPitcher1776 3 points 3 days ago Verizon !!!!! permalink award report block reply\nLamal 2 points 2 days ago This is the first time the DEPT. OF LABOR has ever done anything to benefit Americans ! This has been my top priority topic for 20 years. I'm happy with what the admin is doing and I want even more. If they are serious about the 100k/yr fee this will resolve 99% of abuse and take away the argument that we need to \"get the best and brightest\" permalink award report block reply\nUltraMagaWA 2 points 2 days ago Zero permalink award report block reply\nPatriotDescendant 2 points 2 days ago Fire an American worker? No, you must fire an H1B visa worker and move the US worker. Hell, most large business have already implemented internal talent market platforms (ITMs) that can easily execute the process. (Google \"Gartner Internal Talent Markets platforms\") This definitely needs to be a thing! Who's telling Trump? permalink award report block reply\nWildStar 2 points 2 days ago They already post the jobs. That's why they all require ten years of experience for an entry level position. permalink award report block reply\nNoticesBugleOWO 1 points 3 days ago If someone is so critical to a company's ability to function, then that company should be sponsoring that person for a green card and the person should be pledging allegiance to the US and give up their other citizenship once they meet the requirements for US citizenship. Ya know... normal shit. permalink award report block reply\nthroat_GOAT_charlie 1 points 21 hours ago Comment removed upon the user being banned. permalink award report block reply"}