{"id": "1ARK512lRB", "contents": "420 Zelensky’s militants, backed with billions by European taxpayers, are now raiding Orthodox churches in Ukraine and threatening to shoot worshipers who dare to defend their church. posted 6 days ago by StopCorruptionDC 15 comments award share report block Gabe @GabeZZOZZ • 7d Zelensky’s militants, backed with billions by European taxpayers, are now raiding Orthodox churches in Ukraine and threatening to shoot worshippers who dare to defend their church. How can anyone support these bastards?\n15 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style _Liberty_Prime_ 12 points 6 days ago I don't believe anything from either side in that conflict. Almost every story turns out to be bullshit. permalink award report block reply YellowCrazyAnt 7 points 6 days ago You don’t believe this video proof?  A bunch of dudes yelling in a church in a language you don’t understand, shaky video, does not convince you of…….. something?    Something is going on here.   You should be outraged and demand that money be sent/not sent to Ukraine. Anyway, I think I will just go about my day. permalink parent award report block reply Elencher 7 points 6 days ago You don’t believe the unelected Jew midget would do this. It’s at the very least plausible. permalink parent award report block reply _Liberty_Prime_ 1 points 6 days ago \"Turns out to be bullshit.\" permalink parent award report block reply ThisTrainHasNoBrakes 1 points 6 days ago Rub two brain cells together.  That’s not what the comment you are replying to said. permalink parent award report block reply ReleasetheList 6 points 6 days ago Lindsey Graham watches this and gets wet. permalink award report block reply DITTOPatriot 2 points 6 days ago History records millions killed by the piano players when the gain control. permalink award report block reply lizardo221 2 points 6 days ago Why do I have a feeling this tweet lied about the context. permalink award report block reply Steve56775 2 points 6 days ago He’s nothing but a corrupt dictator who learned how to give “Rebates” to the politicians who support him. Look at the number of Congressman who have visited Ukraine. Why? permalink award report block reply Mhmm2MoreWeeks 1 points 6 days ago AZOV GAY NAZIS doing what AZOV GAY NAZIS do. permalink award report block reply red_holiday2 1 points 6 days ago Tiny hat terrorism strikes again permalink award report block reply redinmn 1 points 6 days ago The people of the Ukraine are 100% responsible for this.   They are right up there with the idiots who voted for socialism in NYC.  They are getting to live the nightmare they were too lazy to vote against.  Enjoy. permalink award report block reply flabbergast 0 points 6 days ago Lets not pretend your hands are clean in this .. \" European \" billions. You guys started all this shit and been pushing it forward at least since 2014 and before that as well. that the piece of shit WEF controlled EU leadership followed along while calling you daddy doesn't absolve you. permalink award report block reply HoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink award report block reply FullyDilated 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply\n_Liberty_Prime_ 12 points 6 days ago I don't believe anything from either side in that conflict. Almost every story turns out to be bullshit. permalink award report block reply YellowCrazyAnt 7 points 6 days ago You don’t believe this video proof?  A bunch of dudes yelling in a church in a language you don’t understand, shaky video, does not convince you of…….. something?    Something is going on here.   You should be outraged and demand that money be sent/not sent to Ukraine. Anyway, I think I will just go about my day. permalink parent award report block reply Elencher 7 points 6 days ago You don’t believe the unelected Jew midget would do this. It’s at the very least plausible. permalink parent award report block reply _Liberty_Prime_ 1 points 6 days ago \"Turns out to be bullshit.\" permalink parent award report block reply ThisTrainHasNoBrakes 1 points 6 days ago Rub two brain cells together.  That’s not what the comment you are replying to said. permalink parent award report block reply\nYellowCrazyAnt 7 points 6 days ago You don’t believe this video proof?  A bunch of dudes yelling in a church in a language you don’t understand, shaky video, does not convince you of…….. something?    Something is going on here.   You should be outraged and demand that money be sent/not sent to Ukraine. Anyway, I think I will just go about my day. permalink parent award report block reply\nElencher 7 points 6 days ago You don’t believe the unelected Jew midget would do this. It’s at the very least plausible. permalink parent award report block reply _Liberty_Prime_ 1 points 6 days ago \"Turns out to be bullshit.\" permalink parent award report block reply ThisTrainHasNoBrakes 1 points 6 days ago Rub two brain cells together.  That’s not what the comment you are replying to said. permalink parent award report block reply\n_Liberty_Prime_ 1 points 6 days ago \"Turns out to be bullshit.\" permalink parent award report block reply\nThisTrainHasNoBrakes 1 points 6 days ago Rub two brain cells together.  That’s not what the comment you are replying to said. permalink parent award report block reply\nReleasetheList 6 points 6 days ago Lindsey Graham watches this and gets wet. permalink award report block reply\nDITTOPatriot 2 points 6 days ago History records millions killed by the piano players when the gain control. permalink award report block reply\nlizardo221 2 points 6 days ago Why do I have a feeling this tweet lied about the context. permalink award report block reply\nSteve56775 2 points 6 days ago He’s nothing but a corrupt dictator who learned how to give “Rebates” to the politicians who support him. Look at the number of Congressman who have visited Ukraine. Why? permalink award report block reply\nMhmm2MoreWeeks 1 points 6 days ago AZOV GAY NAZIS doing what AZOV GAY NAZIS do. permalink award report block reply\nred_holiday2 1 points 6 days ago Tiny hat terrorism strikes again permalink award report block reply\nredinmn 1 points 6 days ago The people of the Ukraine are 100% responsible for this.   They are right up there with the idiots who voted for socialism in NYC.  They are getting to live the nightmare they were too lazy to vote against.  Enjoy. permalink award report block reply\nflabbergast 0 points 6 days ago Lets not pretend your hands are clean in this .. \" European \" billions. You guys started all this shit and been pushing it forward at least since 2014 and before that as well. that the piece of shit WEF controlled EU leadership followed along while calling you daddy doesn't absolve you. permalink award report block reply\nHoodooOperator 1 points 6 days ago Comment removed by community moderators. permalink award report block reply\nFullyDilated 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply"}