{"id": "1ARK9oXTkc", "contents": "300 Charlie was the last person with access to Trump who represented We the People. Since his death it seems only donors get in the Oval Office now. posted 15 hours ago by Antenna 28 comments award share download report block\n28 comments Sort by Top Top New Worst Old Save TheAftermath 25 points 15 hours ago Yes, I think President Trump relied on Charlie more than we realized. permalink award report block reply shadypollster 16 points 15 hours ago This makes me sad. permalink parent award report block reply TheAftermath 17 points 15 hours ago There was a reason why they took dear Charlie out. permalink parent award report block reply patrioticwinning3 4 points 12 hours ago \"Alright boys, we're gonna need more H1Bs and 'legal' immigrants, Americans are just too stupid and lazy to do ANY WORK! Blue collar? Get the fuckin' illegals to do it! White Collar? Get the street shitters to do it! Academia? Get the chicoms to do it! FUCK 'EM ALL! Wait, what? What do you mean my poll numbers are in the shitter!?\" -Trump tonight probably :p permalink parent award report block reply Afeazo 10 points 14 hours ago Why do you think off all the activists on the Right they went for Kirk specifically? He was the most influential, and that doesn't mean just with social media clicks. permalink parent award report block reply TheAftermath 10 points 14 hours ago I fully agree. And Charlie had all the makings of a future President. A truly America First President. They were fully aware of this and decided to act before time. permalink parent award report block reply DeplorableNeandertal 4 points 6 hours ago I was looking forward to voting for him… still miss that guy and his show is empty without him permalink parent award report block reply FUCK_TYLER 4 points 12 hours ago 💔 permalink parent award report block reply TheAftermath 3 points 3 hours ago 🙏 permalink parent award report block reply Theosco 3 points 10 hours ago Im pretty sure they are talking about the economy permalink parent award report block reply OlivaireBandaloo 12 points 15 hours ago And who is his gatekeeper?  Susie Wiles. permalink award report block reply spezisacuckold 6 points 14 hours ago I love that we rely on a Rosie O'Donnell looking Boomer for running day to day White House scheduling. permalink parent award report block reply 1_Badcop 5 points 11 hours ago Don't minimize how fucking evil that woman is or how much power she wields. permalink parent award report block reply blitzstrasse 6 points 15 hours ago Susie Wiles is a suppurating cunt and in the fullness of time, will be revealed to have been working against us all for the entire time. That whore serves Satan. permalink award report block reply _fidelio 5 points 8 hours ago She literally worked for Israel before joining Trump’s campaign. permalink parent award report block reply Antenna OP 1 points 39 minutes ago She ran Nettinyahoo's campaign for office. permalink parent award report block reply assblast 6 points 15 hours ago That is inherently not true. Why do you people think Charlie was like, on a phonecall basis day to day with Trump? You're significantly overplaying his importance in that regard. Secondly, you do have to talk with CEOs like this even if they are bad actors or enemies. I'm all for calling out Trump but jumping to random ass conclusions from incorrect data is just retarded. permalink award report block reply MagaJay02 2 points 14 hours ago Finally, common sense. permalink parent award report block reply lostmyoldpassword 4 points 14 hours ago what? you guys didn't like that little play they put on?  Not fans of the performing arts I guess? permalink parent award report block reply Tiberius1 4 points 12 hours ago Fuck all these people. permalink award report block reply breadbaker 4 points 15 hours ago I looked at the pic of Loomers X post so many times and can't decide if she is just straight reporting it or if she is at peace because the richest get special access. permalink award report block reply NoticesBugleOWO 3 points 9 hours ago Yes, this looks shitty. But can Trump really just ignore the mountains of money in the room? His strategy is to grow our way out of the insane amount of debt our government has foisted onto us. He can't do that without getting all of the big money on board. permalink award report block reply Theosco 1 points 10 hours ago Maybe dont have everyone put thier geoceries on credit cards. permalink award report block reply Antemalagon 1 points 12 hours ago Trump needs a regular joe delegate from the donald to tell him how things really are and what real Americans are thinking. permalink award report block reply Antenna OP 1 points 41 minutes ago I agree. He needs a dedicated staff member to be on this site. permalink parent award report block reply KnoxVegasGirl -2 points 13 hours ago Another concerned faggy post…. permalink award report block reply spezisacuckold -5 points 14 hours ago I'd wager Tucker Carlson is up there, but his nasally voice and unconscious exasperated tone would drag down any prospects if ever running for prominent federal office. permalink award report block reply SCHULTZ 1 points 15 hours ago Comment removed by community moderators. permalink award report block reply\nTheAftermath 25 points 15 hours ago Yes, I think President Trump relied on Charlie more than we realized. permalink award report block reply shadypollster 16 points 15 hours ago This makes me sad. permalink parent award report block reply TheAftermath 17 points 15 hours ago There was a reason why they took dear Charlie out. permalink parent award report block reply patrioticwinning3 4 points 12 hours ago \"Alright boys, we're gonna need more H1Bs and 'legal' immigrants, Americans are just too stupid and lazy to do ANY WORK! Blue collar? Get the fuckin' illegals to do it! White Collar? Get the street shitters to do it! Academia? Get the chicoms to do it! FUCK 'EM ALL! Wait, what? What do you mean my poll numbers are in the shitter!?\" -Trump tonight probably :p permalink parent award report block reply Afeazo 10 points 14 hours ago Why do you think off all the activists on the Right they went for Kirk specifically? He was the most influential, and that doesn't mean just with social media clicks. permalink parent award report block reply TheAftermath 10 points 14 hours ago I fully agree. And Charlie had all the makings of a future President. A truly America First President. They were fully aware of this and decided to act before time. permalink parent award report block reply DeplorableNeandertal 4 points 6 hours ago I was looking forward to voting for him… still miss that guy and his show is empty without him permalink parent award report block reply FUCK_TYLER 4 points 12 hours ago 💔 permalink parent award report block reply TheAftermath 3 points 3 hours ago 🙏 permalink parent award report block reply Theosco 3 points 10 hours ago Im pretty sure they are talking about the economy permalink parent award report block reply\nshadypollster 16 points 15 hours ago This makes me sad. permalink parent award report block reply TheAftermath 17 points 15 hours ago There was a reason why they took dear Charlie out. permalink parent award report block reply patrioticwinning3 4 points 12 hours ago \"Alright boys, we're gonna need more H1Bs and 'legal' immigrants, Americans are just too stupid and lazy to do ANY WORK! Blue collar? Get the fuckin' illegals to do it! White Collar? Get the street shitters to do it! Academia? Get the chicoms to do it! FUCK 'EM ALL! Wait, what? What do you mean my poll numbers are in the shitter!?\" -Trump tonight probably :p permalink parent award report block reply\nTheAftermath 17 points 15 hours ago There was a reason why they took dear Charlie out. permalink parent award report block reply patrioticwinning3 4 points 12 hours ago \"Alright boys, we're gonna need more H1Bs and 'legal' immigrants, Americans are just too stupid and lazy to do ANY WORK! Blue collar? Get the fuckin' illegals to do it! White Collar? Get the street shitters to do it! Academia? Get the chicoms to do it! FUCK 'EM ALL! Wait, what? What do you mean my poll numbers are in the shitter!?\" -Trump tonight probably :p permalink parent award report block reply\npatrioticwinning3 4 points 12 hours ago \"Alright boys, we're gonna need more H1Bs and 'legal' immigrants, Americans are just too stupid and lazy to do ANY WORK! Blue collar? Get the fuckin' illegals to do it! White Collar? Get the street shitters to do it! Academia? Get the chicoms to do it! FUCK 'EM ALL! Wait, what? What do you mean my poll numbers are in the shitter!?\" -Trump tonight probably :p permalink parent award report block reply\nAfeazo 10 points 14 hours ago Why do you think off all the activists on the Right they went for Kirk specifically? He was the most influential, and that doesn't mean just with social media clicks. permalink parent award report block reply TheAftermath 10 points 14 hours ago I fully agree. And Charlie had all the makings of a future President. A truly America First President. They were fully aware of this and decided to act before time. permalink parent award report block reply DeplorableNeandertal 4 points 6 hours ago I was looking forward to voting for him… still miss that guy and his show is empty without him permalink parent award report block reply\nTheAftermath 10 points 14 hours ago I fully agree. And Charlie had all the makings of a future President. A truly America First President. They were fully aware of this and decided to act before time. permalink parent award report block reply\nDeplorableNeandertal 4 points 6 hours ago I was looking forward to voting for him… still miss that guy and his show is empty without him permalink parent award report block reply\nFUCK_TYLER 4 points 12 hours ago 💔 permalink parent award report block reply TheAftermath 3 points 3 hours ago 🙏 permalink parent award report block reply\nTheAftermath 3 points 3 hours ago 🙏 permalink parent award report block reply\nTheosco 3 points 10 hours ago Im pretty sure they are talking about the economy permalink parent award report block reply\nOlivaireBandaloo 12 points 15 hours ago And who is his gatekeeper?  Susie Wiles. permalink award report block reply spezisacuckold 6 points 14 hours ago I love that we rely on a Rosie O'Donnell looking Boomer for running day to day White House scheduling. permalink parent award report block reply 1_Badcop 5 points 11 hours ago Don't minimize how fucking evil that woman is or how much power she wields. permalink parent award report block reply\nspezisacuckold 6 points 14 hours ago I love that we rely on a Rosie O'Donnell looking Boomer for running day to day White House scheduling. permalink parent award report block reply 1_Badcop 5 points 11 hours ago Don't minimize how fucking evil that woman is or how much power she wields. permalink parent award report block reply\n1_Badcop 5 points 11 hours ago Don't minimize how fucking evil that woman is or how much power she wields. permalink parent award report block reply\nblitzstrasse 6 points 15 hours ago Susie Wiles is a suppurating cunt and in the fullness of time, will be revealed to have been working against us all for the entire time. That whore serves Satan. permalink award report block reply _fidelio 5 points 8 hours ago She literally worked for Israel before joining Trump’s campaign. permalink parent award report block reply Antenna OP 1 points 39 minutes ago She ran Nettinyahoo's campaign for office. permalink parent award report block reply\n_fidelio 5 points 8 hours ago She literally worked for Israel before joining Trump’s campaign. permalink parent award report block reply Antenna OP 1 points 39 minutes ago She ran Nettinyahoo's campaign for office. permalink parent award report block reply\nAntenna OP 1 points 39 minutes ago She ran Nettinyahoo's campaign for office. permalink parent award report block reply\nassblast 6 points 15 hours ago That is inherently not true. Why do you people think Charlie was like, on a phonecall basis day to day with Trump? You're significantly overplaying his importance in that regard. Secondly, you do have to talk with CEOs like this even if they are bad actors or enemies. I'm all for calling out Trump but jumping to random ass conclusions from incorrect data is just retarded. permalink award report block reply MagaJay02 2 points 14 hours ago Finally, common sense. permalink parent award report block reply lostmyoldpassword 4 points 14 hours ago what? you guys didn't like that little play they put on?  Not fans of the performing arts I guess? permalink parent award report block reply\nMagaJay02 2 points 14 hours ago Finally, common sense. permalink parent award report block reply lostmyoldpassword 4 points 14 hours ago what? you guys didn't like that little play they put on?  Not fans of the performing arts I guess? permalink parent award report block reply\nlostmyoldpassword 4 points 14 hours ago what? you guys didn't like that little play they put on?  Not fans of the performing arts I guess? permalink parent award report block reply\nTiberius1 4 points 12 hours ago Fuck all these people. permalink award report block reply\nbreadbaker 4 points 15 hours ago I looked at the pic of Loomers X post so many times and can't decide if she is just straight reporting it or if she is at peace because the richest get special access. permalink award report block reply\nNoticesBugleOWO 3 points 9 hours ago Yes, this looks shitty. But can Trump really just ignore the mountains of money in the room? His strategy is to grow our way out of the insane amount of debt our government has foisted onto us. He can't do that without getting all of the big money on board. permalink award report block reply\nTheosco 1 points 10 hours ago Maybe dont have everyone put thier geoceries on credit cards. permalink award report block reply\nAntemalagon 1 points 12 hours ago Trump needs a regular joe delegate from the donald to tell him how things really are and what real Americans are thinking. permalink award report block reply Antenna OP 1 points 41 minutes ago I agree. He needs a dedicated staff member to be on this site. permalink parent award report block reply\nAntenna OP 1 points 41 minutes ago I agree. He needs a dedicated staff member to be on this site. permalink parent award report block reply\nKnoxVegasGirl -2 points 13 hours ago Another concerned faggy post…. permalink award report block reply\nspezisacuckold -5 points 14 hours ago I'd wager Tucker Carlson is up there, but his nasally voice and unconscious exasperated tone would drag down any prospects if ever running for prominent federal office. permalink award report block reply\nSCHULTZ 1 points 15 hours ago Comment removed by community moderators. permalink award report block reply"}