{"id": "1ARK58zX50", "contents": "1284 Kind of shocked this oldie isn’t making the rounds. posted 4 days ago by Comntrinchief 30 comments award share download report block\n30 comments Sort by Top Top New Worst Old Save IncredibleMrE1 28 points 4 days ago Now that's a meme I haven't seen in a long, long time. permalink award report block reply BeauHD 18 points 4 days ago It's an older meme, sir, but it checks out. permalink parent award report block reply GallowsTime 6 points 4 days ago 100% of the time, it works every time. permalink parent award report block reply patrioticwinning3 14 points 4 days ago Definitely, an all time Favorite! permalink award report block reply Skogin 13 points 4 days ago It’s and older meme, but it checks out. permalink award report block reply TheRedPilledArtist 11 points 4 days ago Well isn't that a blast from the past permalink award report block reply Girthquakes 9 points 4 days ago High energy post. 👌 permalink award report block reply jatergator 9 points 4 days ago When saying Merry Christmas was considered a bad thing. permalink award report block reply Rock9Head 8 points 4 days ago Something about timeless messages that make me teary-eyed. permalink award report block reply Constitution_1788 6 points 4 days ago So simple. Yet so effective. permalink award report block reply Nightbringer33 6 points 4 days ago It is my favorite! permalink award report block reply Aggrieved03 5 points 4 days ago Democrats or Republicans? permalink award report block reply Handskakey 2 points 4 days ago Either way you're threatening the Uni party with a time that they would thoroughly enjoy permalink parent award report block reply realJohnGalt 4 points 4 days ago Takes a true Pede to be able to pull that one. permalink award report block reply warlord30 4 points 4 days ago ❤️ permalink award report block reply SenorTrumper 3 points 4 days ago LOL permalink award report block reply NoMoreShinesBilly 3 points 4 days ago LOLOLOLOLOLOLOL permalink award report block reply Lovethatorangeman 3 points 4 days ago A whole bag permalink award report block reply Nightbringer33 2 points 4 days ago And the hairy balls too! permalink parent award report block reply BoomShtick 3 points 4 days ago It may resort to that literally in a communist regime. permalink award report block reply Comntrinchief OP 2 points 3 days ago You win best comment fren ❤️ permalink parent award report block reply JesusTheOnlyWay 3 points 4 days ago Unfortunately, Trump isn't matching the Commies' energy, and ground is being lost. More unfortunate is the reality that we needed (expected) Trump to go Bukele on the Commies, and significantly exceed their energy to save America. permalink award report block reply Michalusmichalus 1 points 3 days ago Thanksgiving is going to be different for a whole lot of people this year. The Dims are finally realizing that just saying Trump did something ain't good enough when people can see for themselves. permalink parent award report block reply MAGA-Fett 3 points 4 days ago Kek, this is my old meme. permalink award report block reply SuperHonkey 2 points 3 days ago Don't threaten them with a good time 😳 permalink award report block reply Feddny 1 points 3 days ago I see it every day on my x.com sticky post permalink award report block reply Feddny 1 points 3 days ago https://x.com/Feddny/status/1601357529262751744?s=20 I see it everyday permalink award report block reply keeman -1 points 4 days ago Would work better if Trump were actually rolling back any socialism. permalink award report block reply Dem_slayer -2 points 4 days ago No but he'll open the gates for mass muslim migration permalink award report block reply wmmiv2016v2 -3 points 4 days ago Probably cause trump has indicated he's Zionist friendly after his comments about Epstein. permalink award report block reply\nIncredibleMrE1 28 points 4 days ago Now that's a meme I haven't seen in a long, long time. permalink award report block reply BeauHD 18 points 4 days ago It's an older meme, sir, but it checks out. permalink parent award report block reply GallowsTime 6 points 4 days ago 100% of the time, it works every time. permalink parent award report block reply\nBeauHD 18 points 4 days ago It's an older meme, sir, but it checks out. permalink parent award report block reply GallowsTime 6 points 4 days ago 100% of the time, it works every time. permalink parent award report block reply\nGallowsTime 6 points 4 days ago 100% of the time, it works every time. permalink parent award report block reply\npatrioticwinning3 14 points 4 days ago Definitely, an all time Favorite! permalink award report block reply\nSkogin 13 points 4 days ago It’s and older meme, but it checks out. permalink award report block reply\nTheRedPilledArtist 11 points 4 days ago Well isn't that a blast from the past permalink award report block reply\nGirthquakes 9 points 4 days ago High energy post. 👌 permalink award report block reply\njatergator 9 points 4 days ago When saying Merry Christmas was considered a bad thing. permalink award report block reply\nRock9Head 8 points 4 days ago Something about timeless messages that make me teary-eyed. permalink award report block reply\nConstitution_1788 6 points 4 days ago So simple. Yet so effective. permalink award report block reply\nNightbringer33 6 points 4 days ago It is my favorite! permalink award report block reply\nAggrieved03 5 points 4 days ago Democrats or Republicans? permalink award report block reply Handskakey 2 points 4 days ago Either way you're threatening the Uni party with a time that they would thoroughly enjoy permalink parent award report block reply\nHandskakey 2 points 4 days ago Either way you're threatening the Uni party with a time that they would thoroughly enjoy permalink parent award report block reply\nrealJohnGalt 4 points 4 days ago Takes a true Pede to be able to pull that one. permalink award report block reply\nwarlord30 4 points 4 days ago ❤️ permalink award report block reply\nSenorTrumper 3 points 4 days ago LOL permalink award report block reply\nNoMoreShinesBilly 3 points 4 days ago LOLOLOLOLOLOLOL permalink award report block reply\nLovethatorangeman 3 points 4 days ago A whole bag permalink award report block reply Nightbringer33 2 points 4 days ago And the hairy balls too! permalink parent award report block reply\nNightbringer33 2 points 4 days ago And the hairy balls too! permalink parent award report block reply\nBoomShtick 3 points 4 days ago It may resort to that literally in a communist regime. permalink award report block reply Comntrinchief OP 2 points 3 days ago You win best comment fren ❤️ permalink parent award report block reply\nComntrinchief OP 2 points 3 days ago You win best comment fren ❤️ permalink parent award report block reply\nJesusTheOnlyWay 3 points 4 days ago Unfortunately, Trump isn't matching the Commies' energy, and ground is being lost. More unfortunate is the reality that we needed (expected) Trump to go Bukele on the Commies, and significantly exceed their energy to save America. permalink award report block reply Michalusmichalus 1 points 3 days ago Thanksgiving is going to be different for a whole lot of people this year. The Dims are finally realizing that just saying Trump did something ain't good enough when people can see for themselves. permalink parent award report block reply\nMichalusmichalus 1 points 3 days ago Thanksgiving is going to be different for a whole lot of people this year. The Dims are finally realizing that just saying Trump did something ain't good enough when people can see for themselves. permalink parent award report block reply\nMAGA-Fett 3 points 4 days ago Kek, this is my old meme. permalink award report block reply\nSuperHonkey 2 points 3 days ago Don't threaten them with a good time 😳 permalink award report block reply\nFeddny 1 points 3 days ago I see it every day on my x.com sticky post permalink award report block reply\nFeddny 1 points 3 days ago https://x.com/Feddny/status/1601357529262751744?s=20 I see it everyday permalink award report block reply\nkeeman -1 points 4 days ago Would work better if Trump were actually rolling back any socialism. permalink award report block reply\nDem_slayer -2 points 4 days ago No but he'll open the gates for mass muslim migration permalink award report block reply\nwmmiv2016v2 -3 points 4 days ago Probably cause trump has indicated he's Zionist friendly after his comments about Epstein. permalink award report block reply"}