{"id": "1ARK9l7TF3", "contents": "560 You really cant make this up…\n\nOfficer Yogananda Pittman helped with all aspects of the Jan 6th op.\n\nShe gets a high paying Chief of Police job as a reward.\n\nWhere? \n\nUC Berkeley…\n\nWhere Antifa is allowed to riot and terrorize a Turning Point USA event.\n\nAlways the same people. posted 1 day ago by Sunnybats2 22 comments award share download report block\n22 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Save on Your Electric Bill (Try Tonight) GadgetCyno TheAftermath 13 points 1 day ago C.I.A.'s equivalent of Central Casting. They always have a bunch of these rodents at hand. permalink award report block reply CorkyKnightrider 2 points 16 hours ago Trump often references \"central casting\". Funny enough. That was how I referred to Romney when he went against obama. Literally when I learned politics were fake. permalink parent award report block reply SicSemperTyrannis2 2 points 15 hours ago Yogananda, that's a good American name. permalink parent award report block reply Lorrainer 10 points 1 day ago Yogi Bear wants his name back. permalink award report block reply UntakenUsername 10 points 1 day ago The fuck is a Yoganonda? permalink award report block reply YT45 7 points 1 day ago Scrabble score? permalink parent award report block reply UntakenUsername 5 points 1 day ago hahahaha! permalink parent award report block reply mydogma8yourkarma 2 points 20 hours ago Rhymes with Wakanda, you do the math. permalink parent award report block reply 26magarat 5 points 1 day ago Her name sounds like some overpriced coffee drink or a smoothie. permalink award report block reply TiggerLovingPooh 5 points 1 day ago sheeeeeeeeeeit permalink award report block reply Formerlurker92 4 points 1 day ago Just like with covid, they'll do it again cause we didn't hang them the first time round permalink award report block reply hairless_ap3 4 points 1 day ago And she's a N permalink award report block reply vongregormench 4 points 1 day ago Well hopefully she’s rewarded with prison. permalink award report block reply Greenhills 4 points 1 day ago Weird, I wonder who was in charge of the capitol police who had connection in San Francisco to get this woman a job. permalink award report block reply Blackmore 4 points 23 hours ago Nancy…..let me guess permalink parent award report block reply SteveRogers42 2 points 19 hours ago The left rewards its friends and punishes its enemies. MAGA should take note. permalink parent award report block reply Bullwinkle 3 points 1 day ago The privileged. permalink award report block reply Atlis34 2 points 24 hours ago Hand rubbing going on in the lower left photo. permalink award report block reply Thereiwas001 2 points 23 hours ago What goes around,  comes around.\nOld saying, have meaning.usualy trufr permalink award report block reply Sunnybats2 OP 1 points 20 hours ago Hope! permalink parent award report block reply Fuck_commies_2024 1 points 1 day ago What’s a fucking “Yogananda”? permalink award report block reply TheSwampThang 1 points 1 day ago Arrest when? permalink award report block reply\nTheAftermath 13 points 1 day ago C.I.A.'s equivalent of Central Casting. They always have a bunch of these rodents at hand. permalink award report block reply CorkyKnightrider 2 points 16 hours ago Trump often references \"central casting\". Funny enough. That was how I referred to Romney when he went against obama. Literally when I learned politics were fake. permalink parent award report block reply SicSemperTyrannis2 2 points 15 hours ago Yogananda, that's a good American name. permalink parent award report block reply\nCorkyKnightrider 2 points 16 hours ago Trump often references \"central casting\". Funny enough. That was how I referred to Romney when he went against obama. Literally when I learned politics were fake. permalink parent award report block reply\nSicSemperTyrannis2 2 points 15 hours ago Yogananda, that's a good American name. permalink parent award report block reply\nLorrainer 10 points 1 day ago Yogi Bear wants his name back. permalink award report block reply\nUntakenUsername 10 points 1 day ago The fuck is a Yoganonda? permalink award report block reply YT45 7 points 1 day ago Scrabble score? permalink parent award report block reply UntakenUsername 5 points 1 day ago hahahaha! permalink parent award report block reply mydogma8yourkarma 2 points 20 hours ago Rhymes with Wakanda, you do the math. permalink parent award report block reply\nYT45 7 points 1 day ago Scrabble score? permalink parent award report block reply UntakenUsername 5 points 1 day ago hahahaha! permalink parent award report block reply\nUntakenUsername 5 points 1 day ago hahahaha! permalink parent award report block reply\nmydogma8yourkarma 2 points 20 hours ago Rhymes with Wakanda, you do the math. permalink parent award report block reply\n26magarat 5 points 1 day ago Her name sounds like some overpriced coffee drink or a smoothie. permalink award report block reply\nTiggerLovingPooh 5 points 1 day ago sheeeeeeeeeeit permalink award report block reply\nFormerlurker92 4 points 1 day ago Just like with covid, they'll do it again cause we didn't hang them the first time round permalink award report block reply\nhairless_ap3 4 points 1 day ago And she's a N permalink award report block reply\nvongregormench 4 points 1 day ago Well hopefully she’s rewarded with prison. permalink award report block reply\nGreenhills 4 points 1 day ago Weird, I wonder who was in charge of the capitol police who had connection in San Francisco to get this woman a job. permalink award report block reply Blackmore 4 points 23 hours ago Nancy…..let me guess permalink parent award report block reply SteveRogers42 2 points 19 hours ago The left rewards its friends and punishes its enemies. MAGA should take note. permalink parent award report block reply\nBlackmore 4 points 23 hours ago Nancy…..let me guess permalink parent award report block reply SteveRogers42 2 points 19 hours ago The left rewards its friends and punishes its enemies. MAGA should take note. permalink parent award report block reply\nSteveRogers42 2 points 19 hours ago The left rewards its friends and punishes its enemies. MAGA should take note. permalink parent award report block reply\nBullwinkle 3 points 1 day ago The privileged. permalink award report block reply\nAtlis34 2 points 24 hours ago Hand rubbing going on in the lower left photo. permalink award report block reply\nThereiwas001 2 points 23 hours ago What goes around,  comes around.\nOld saying, have meaning.usualy trufr permalink award report block reply Sunnybats2 OP 1 points 20 hours ago Hope! permalink parent award report block reply\nSunnybats2 OP 1 points 20 hours ago Hope! permalink parent award report block reply\nFuck_commies_2024 1 points 1 day ago What’s a fucking “Yogananda”? permalink award report block reply\nTheSwampThang 1 points 1 day ago Arrest when? permalink award report block reply"}