{"id": "1ARK56kwAF", "contents": "496 It was a Hiroshima level event posted 4 days ago by kek_saved_the_world 29 comments award share report block Swan @AndySwan • 5d The distrusting stare.  The trap recognition.  The reframe to \"I will decide what I discuss\". This is how a \"10\" becomes an icon\n29 comments Sort by Top Top New Worst Old Save Bullet3250 30 points 4 days ago I always thought she was kind of cute... but now I see her as Brilliant, sly, cunning. permalink award report block reply DrGreygoose 17 points 4 days ago She's a hell of a shot to boot. permalink parent award report block reply Bullet3250 7 points 4 days ago 'eye twitches up' permalink parent award report block reply Covfefebrulee 16 points 4 days ago An excellent role model for young Patriots. permalink parent award report block reply Thesteelerfan181 6 points 4 days ago She is better than some others but too many nudity scenes depicting high schoolers is going to f up the incoming generation into believing that’s normal. permalink parent award report block reply Covfefebrulee 4 points 4 days ago Too much of anything, except coffee and love, isn’t healthy. permalink parent award report block reply SanityGumby 5 points 4 days ago And she is trained in grappling with serious pros, only stopped because she can’t be always bruised up from training while acting permalink parent award report block reply Greenhills 20 points 4 days ago So basically the interviewer is admitting white people are genetically superior? What a self own. permalink award report block reply JerryNadlerBeltFund 8 points 4 days ago Apparently not ALL white people! permalink parent award report block reply SanityGumby 2 points 4 days ago Is she white? Who nose. permalink parent award report block reply SicSemperTyrannis2 -1 points 4 days ago Not remotely White, no. permalink parent award report block reply TheGoyimWhisperer 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply knnbccb 8 points 4 days ago Why give interview time to these cockroaches? Gotcha questions against their ideological enemies is how these pretend-journalists gain a boost or 'street cred' in their career. They are not journalists. They are not the Fourth Estate. Fuck them to hell. permalink award report block reply SanityGumby 7 points 4 days ago Why not. She just put herself in the spotlight again, further endearing fans, and this goblin bitch had to nuke her Twitter over the backlash permalink parent award report block reply SicSemperTyrannis2 -1 points 4 days ago Kek :) permalink parent award report block reply SJWsHateUs 7 points 4 days ago Specifucullyuh. Her voice went way up at the end of that word. permalink award report block reply TrumpAndGodWin 2 points 4 days ago I never expected that voice and those mannerisms out of that manly lady. Possibly an act by her to seem non-threatening while setting the trap. permalink parent award report block reply SenorTrumper 5 points 4 days ago bookmarked permalink award report block reply GhostOfMyFormerSelf 5 points 4 days ago I don't joke about White supremacy. permalink award report block reply SicSemperTyrannis2 0 points 4 days ago It's not a joking matter! permalink parent award report block reply SJWsHateUs 4 points 4 days ago That interviewer has SSRI jaw misalignment and typical leftist speech patterns. permalink award report block reply Saltish 3 points 4 days ago I just hope she can maintain. The pressure on her now to \"disavow,\" etc. will be immense. She should avoid interviews for a good long while. permalink award report block reply SicSemperTyrannis2 1 points 3 days ago She seems to have handled herself just fine here, I don't see why she would turn to us for advice. permalink parent award report block reply FreedomFlowerDelta 2 points 4 days ago Fox-ay lady.....dum dum do da dum dum do permalink award report block reply SicSemperTyrannis2 -1 points 4 days ago https://m.youtube.com/watch?v=_PVjcIO4MT4&list=RD_PVjcIO4MT4&start_radio=1&pp=ygUwamltaSBoZW5kcml4IGZveHkgbGFkeSBsaXZlIGF0IG1vbnRlcmV5IHVzYSAxOTY3oAcB Live! permalink parent award report block reply TheGoyimWhisperer -1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply KeyboardWarrior94 3 points 4 days ago It's because we are tired of the culture of celebrity and the corporate media forcing politics into everything. Sydney just showed millions of people how to disarm those types of attacks and that she doesn't think it's celebrities' place to express their opinions about every little thing. It's very refreshing and it's a sign that the culture is moving in the right direction. A white pill if you will permalink parent award report block reply SicSemperTyrannis2 1 points 3 days ago She also showed that their entire mindset is ridiculous bullshit, not worthy of a response. Even better, she didn't get herself shot in the neck. I'm glad to see this clip in the OP, I think it fills me in on everything I needed to know with having to trudge through the whole interview, which I imagine was extremely cringe. I also don't think we should set ourselves up for SS being really based or even on our side, that might only lead to disappointment? Even a modicum of common sense from anyone in her position is a win, I can be happy with that. If she chooses to become the next Mel Gibson, the world will find out. permalink parent award report block reply\nBullet3250 30 points 4 days ago I always thought she was kind of cute... but now I see her as Brilliant, sly, cunning. permalink award report block reply DrGreygoose 17 points 4 days ago She's a hell of a shot to boot. permalink parent award report block reply Bullet3250 7 points 4 days ago 'eye twitches up' permalink parent award report block reply Covfefebrulee 16 points 4 days ago An excellent role model for young Patriots. permalink parent award report block reply Thesteelerfan181 6 points 4 days ago She is better than some others but too many nudity scenes depicting high schoolers is going to f up the incoming generation into believing that’s normal. permalink parent award report block reply Covfefebrulee 4 points 4 days ago Too much of anything, except coffee and love, isn’t healthy. permalink parent award report block reply SanityGumby 5 points 4 days ago And she is trained in grappling with serious pros, only stopped because she can’t be always bruised up from training while acting permalink parent award report block reply\nDrGreygoose 17 points 4 days ago She's a hell of a shot to boot. permalink parent award report block reply Bullet3250 7 points 4 days ago 'eye twitches up' permalink parent award report block reply\nBullet3250 7 points 4 days ago 'eye twitches up' permalink parent award report block reply\nCovfefebrulee 16 points 4 days ago An excellent role model for young Patriots. permalink parent award report block reply Thesteelerfan181 6 points 4 days ago She is better than some others but too many nudity scenes depicting high schoolers is going to f up the incoming generation into believing that’s normal. permalink parent award report block reply Covfefebrulee 4 points 4 days ago Too much of anything, except coffee and love, isn’t healthy. permalink parent award report block reply\nThesteelerfan181 6 points 4 days ago She is better than some others but too many nudity scenes depicting high schoolers is going to f up the incoming generation into believing that’s normal. permalink parent award report block reply Covfefebrulee 4 points 4 days ago Too much of anything, except coffee and love, isn’t healthy. permalink parent award report block reply\nCovfefebrulee 4 points 4 days ago Too much of anything, except coffee and love, isn’t healthy. permalink parent award report block reply\nSanityGumby 5 points 4 days ago And she is trained in grappling with serious pros, only stopped because she can’t be always bruised up from training while acting permalink parent award report block reply\nGreenhills 20 points 4 days ago So basically the interviewer is admitting white people are genetically superior? What a self own. permalink award report block reply JerryNadlerBeltFund 8 points 4 days ago Apparently not ALL white people! permalink parent award report block reply SanityGumby 2 points 4 days ago Is she white? Who nose. permalink parent award report block reply SicSemperTyrannis2 -1 points 4 days ago Not remotely White, no. permalink parent award report block reply TheGoyimWhisperer 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nJerryNadlerBeltFund 8 points 4 days ago Apparently not ALL white people! permalink parent award report block reply SanityGumby 2 points 4 days ago Is she white? Who nose. permalink parent award report block reply SicSemperTyrannis2 -1 points 4 days ago Not remotely White, no. permalink parent award report block reply\nSanityGumby 2 points 4 days ago Is she white? Who nose. permalink parent award report block reply SicSemperTyrannis2 -1 points 4 days ago Not remotely White, no. permalink parent award report block reply\nSicSemperTyrannis2 -1 points 4 days ago Not remotely White, no. permalink parent award report block reply\nTheGoyimWhisperer 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nknnbccb 8 points 4 days ago Why give interview time to these cockroaches? Gotcha questions against their ideological enemies is how these pretend-journalists gain a boost or 'street cred' in their career. They are not journalists. They are not the Fourth Estate. Fuck them to hell. permalink award report block reply SanityGumby 7 points 4 days ago Why not. She just put herself in the spotlight again, further endearing fans, and this goblin bitch had to nuke her Twitter over the backlash permalink parent award report block reply SicSemperTyrannis2 -1 points 4 days ago Kek :) permalink parent award report block reply\nSanityGumby 7 points 4 days ago Why not. She just put herself in the spotlight again, further endearing fans, and this goblin bitch had to nuke her Twitter over the backlash permalink parent award report block reply SicSemperTyrannis2 -1 points 4 days ago Kek :) permalink parent award report block reply\nSicSemperTyrannis2 -1 points 4 days ago Kek :) permalink parent award report block reply\nSJWsHateUs 7 points 4 days ago Specifucullyuh. Her voice went way up at the end of that word. permalink award report block reply TrumpAndGodWin 2 points 4 days ago I never expected that voice and those mannerisms out of that manly lady. Possibly an act by her to seem non-threatening while setting the trap. permalink parent award report block reply\nTrumpAndGodWin 2 points 4 days ago I never expected that voice and those mannerisms out of that manly lady. Possibly an act by her to seem non-threatening while setting the trap. permalink parent award report block reply\nSenorTrumper 5 points 4 days ago bookmarked permalink award report block reply\nGhostOfMyFormerSelf 5 points 4 days ago I don't joke about White supremacy. permalink award report block reply SicSemperTyrannis2 0 points 4 days ago It's not a joking matter! permalink parent award report block reply\nSicSemperTyrannis2 0 points 4 days ago It's not a joking matter! permalink parent award report block reply\nSJWsHateUs 4 points 4 days ago That interviewer has SSRI jaw misalignment and typical leftist speech patterns. permalink award report block reply\nSaltish 3 points 4 days ago I just hope she can maintain. The pressure on her now to \"disavow,\" etc. will be immense. She should avoid interviews for a good long while. permalink award report block reply SicSemperTyrannis2 1 points 3 days ago She seems to have handled herself just fine here, I don't see why she would turn to us for advice. permalink parent award report block reply\nSicSemperTyrannis2 1 points 3 days ago She seems to have handled herself just fine here, I don't see why she would turn to us for advice. permalink parent award report block reply\nFreedomFlowerDelta 2 points 4 days ago Fox-ay lady.....dum dum do da dum dum do permalink award report block reply SicSemperTyrannis2 -1 points 4 days ago https://m.youtube.com/watch?v=_PVjcIO4MT4&list=RD_PVjcIO4MT4&start_radio=1&pp=ygUwamltaSBoZW5kcml4IGZveHkgbGFkeSBsaXZlIGF0IG1vbnRlcmV5IHVzYSAxOTY3oAcB Live! permalink parent award report block reply\nSicSemperTyrannis2 -1 points 4 days ago https://m.youtube.com/watch?v=_PVjcIO4MT4&list=RD_PVjcIO4MT4&start_radio=1&pp=ygUwamltaSBoZW5kcml4IGZveHkgbGFkeSBsaXZlIGF0IG1vbnRlcmV5IHVzYSAxOTY3oAcB Live! permalink parent award report block reply\nTheGoyimWhisperer -1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply KeyboardWarrior94 3 points 4 days ago It's because we are tired of the culture of celebrity and the corporate media forcing politics into everything. Sydney just showed millions of people how to disarm those types of attacks and that she doesn't think it's celebrities' place to express their opinions about every little thing. It's very refreshing and it's a sign that the culture is moving in the right direction. A white pill if you will permalink parent award report block reply SicSemperTyrannis2 1 points 3 days ago She also showed that their entire mindset is ridiculous bullshit, not worthy of a response. Even better, she didn't get herself shot in the neck. I'm glad to see this clip in the OP, I think it fills me in on everything I needed to know with having to trudge through the whole interview, which I imagine was extremely cringe. I also don't think we should set ourselves up for SS being really based or even on our side, that might only lead to disappointment? Even a modicum of common sense from anyone in her position is a win, I can be happy with that. If she chooses to become the next Mel Gibson, the world will find out. permalink parent award report block reply\nKeyboardWarrior94 3 points 4 days ago It's because we are tired of the culture of celebrity and the corporate media forcing politics into everything. Sydney just showed millions of people how to disarm those types of attacks and that she doesn't think it's celebrities' place to express their opinions about every little thing. It's very refreshing and it's a sign that the culture is moving in the right direction. A white pill if you will permalink parent award report block reply SicSemperTyrannis2 1 points 3 days ago She also showed that their entire mindset is ridiculous bullshit, not worthy of a response. Even better, she didn't get herself shot in the neck. I'm glad to see this clip in the OP, I think it fills me in on everything I needed to know with having to trudge through the whole interview, which I imagine was extremely cringe. I also don't think we should set ourselves up for SS being really based or even on our side, that might only lead to disappointment? Even a modicum of common sense from anyone in her position is a win, I can be happy with that. If she chooses to become the next Mel Gibson, the world will find out. permalink parent award report block reply\nSicSemperTyrannis2 1 points 3 days ago She also showed that their entire mindset is ridiculous bullshit, not worthy of a response. Even better, she didn't get herself shot in the neck. I'm glad to see this clip in the OP, I think it fills me in on everything I needed to know with having to trudge through the whole interview, which I imagine was extremely cringe. I also don't think we should set ourselves up for SS being really based or even on our side, that might only lead to disappointment? Even a modicum of common sense from anyone in her position is a win, I can be happy with that. If she chooses to become the next Mel Gibson, the world will find out. permalink parent award report block reply"}