{"id": "1ARK0UcAee", "contents": "1359 Grammy winning rap legend 50 Cent just revealed he ‘escaped New York’ after Zohran Mamdani won the mayor election. posted 7 days ago by I-am-Orlando PRO 67 comments award share report block Dom Lucre | Breaker of Narratives @dom_lucre • 7d 🔥🚨BREAKING: Grammy winning rap legend 50 Cent just revealed he ‘escaped New York’ after Zohran Mamdani won the mayor election.\n67 comments Sort by Top Top New Worst Old Save TheRedPilledArtist 126 points 7 days ago 50 Cent was always more based than 30 Pence. permalink award report block reply Tophat9000 28 points 7 days ago Well the way New York will tax When done 50 Cent Will be Nickelback permalink parent award report block reply Metal4Freedom 1 points 7 days ago Top Kek! (and I enjoy Nickelback, especially their live shows) permalink parent award report block reply CharlieLovedTheJew 1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply BeauHD 27 points 7 days ago I wish I could put an \"insightful\" flare on this comment! permalink parent award report block reply Hanging_Chad 13 points 7 days ago 💡 permalink parent award report block reply MasterChief08 5 points 7 days ago He's voted for Trump permalink parent award report block reply caKAG 1 points 7 days ago He knows if he stays in New York he will become 20 cents permalink parent award report block reply CharlieLovedTheJew 1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply DJT_MFers1 38 points 7 days ago Got out before he was left with 50 cents in his pocket. Knowing that muzzie he’d get that too permalink award report block reply Th3Cho0sing0ne 30 points 7 days ago I'm a big fan of Curtis Jackson III.  Discovering how based and down to earth he is irl has been a treat.  He's funny af too. permalink award report block reply indigo_truther 25 points 7 days ago Only him and Kat Williams were calling Puffy gay before last year permalink parent award report block reply Th3Cho0sing0ne 20 points 7 days ago 50 actually took a lot of heat calling Puffy out.  It just seemed so wild at first.  All these years later...50 was proven right, and gains a ton of credibility for taking that risk.  I respect his courage. permalink parent award report block reply CharlieLovedTheJew -1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply MakeAmericaVapeAgain 26 points 7 days ago pretty soon we are going to run out places to run to. permalink award report block reply Kingoftheroad 4 points 7 days ago Why ive argued with everyone saying we should concede territory to leftists and divide the country in half. If we couldnt stop them we'll enough to protect the entire land, how long before the half of the land we have left gets invaded and overtaken and infiltrated and we have to conded half of that again until we become so small in territory that they have enough land and people to just wipe us out? And its against the American ideal. Run? Wtf kind of Americanism is that? Why not be an American and use ideas and decency along with might to retake and reclaim and rebuild what is actually American? Imagine saying to your grandparents I think we should just give up and let them have our country and run from them....they would slap you so hard you dont remember your own name. Its cowardice permalink parent award report block reply WildernessBro 4 points 7 days ago Yeah. Nevada has already been swept to a solidly blue state due to those faggots. Sometimes I think we just need to dig our heals in and fight back and turn this state red again. I truly believe we outnumber them here and they only get ahead through shady methods during elections. permalink parent award report block reply Pied-Trumper 1 points 6 days ago The only time for running is when you have the intention of retreating to a stronghold, engaging your opponent later. Unfortunately, the GOP is funded by people who don’t want that to happen, so we’ll retreat and then all the same people will continue migrating to where we are, further destroying the country until they’ve taken everything. permalink parent award report block reply SavingPrivateGrace 13 points 7 days ago He gave his 2 cents. permalink award report block reply MagaMan91 14 points 7 days ago Now he's 48 cent permalink parent award report block reply spinometer2 13 points 7 days ago just wait til the bankers start to move out permalink award report block reply Probably_tryna_sleep 5 points 7 days ago The investment firms have been leaving since 2019, and it accelerated during the plandemic. About a trillion dollars in investment portfolios have bailed out already. The rats they are abandoning a sinking ship lol. permalink parent award report block reply Bendadick_Arnold 1 points 7 days ago The bankers were never there (on paper) permalink parent award report block reply OutlawPurpleHairDye 10 points 7 days ago Shreveport? LMAO. That's like leaving Chicago because the mayor's a socialist retard and heading to some shithole suburb like Harvey. permalink award report block reply ScamBlondie 4 points 7 days ago I remember applying at an LSU residency program a few years back and you could buy a 2500 sqft house in Shreveport for like $120k lmao. But I stopped in Shreveport once and didn’t want to ever go back. permalink parent award report block reply Bogey 4 points 7 days ago Underrated comment. Shreveport is burnt out. It's only getting worse every generation and is nothing like the rough but big small town it was before the 80s. permalink parent award report block reply Trump454748 3 points 7 days ago Harvey? Yeah, that is a shit hole. permalink parent award report block reply Hikedelics 2 points 7 days ago Think he has some business/investment ties there. Can’t remember what exactly, but I recall reading about something he was spending money on there a few years back. I’ve only ever passed through Shreveport. Living in Baton Rouge was bad enough, I didn’t need to drive 4h just to experience more of the same. permalink parent award report block reply USDMaga 2 points 7 days ago I went on vacation to Shreveport, can confirm.  (friends lived there at the time, AF Barksdale) permalink parent award report block reply Hikedelics 4 points 7 days ago What do you do on vacation in Shreveport? That sounds like vacationing to Lake Charles or Alexandria, LA. permalink parent award report block reply load 2 more comments... FallenOne 10 points 7 days ago 50 Cent is a businessman now. He has massive TV and music deals going and he is basically rebuilding Shreveport LA and turning it into what Hollywood could be if Hollywood wasn't woke and gay. No surprise at all that 50 got the hell out of NYC. permalink award report block reply MixedBlacknWhite 8 points 7 days ago We will see more of this, though not from people we know. If I lived there and knew my taxes were about to shoot through the roof but I could afford to work/be retired/whatever the lower end millionaires do for income.. I'd leave too permalink award report block reply 556x45mm 2 points 7 days ago Please, dont dare Islamify my communist California, go to some other state /s permalink parent award report block reply Femprep 1 points 7 days ago California has enough problems without adding Islam to the mix. permalink parent award report block reply PatrioticVideo 6 points 7 days ago ...and this is a man who was fine living in an area where he was shot 9 times. permalink award report block reply KungPaoMcChicken 5 points 7 days ago He got rich from getting shot. permalink parent award report block reply StrongIsland 2 points 7 days ago Then they move into your neighborhood for “safety” What a tough guy? Huh? permalink parent award report block reply StrongIsland 5 points 7 days ago 50 cent use to live on Long Island in a rich white town directly next to a black ghetto, then he moved to another white town, he could have helped Wyandanch, but at least he stuck it to Chelsea Handler. permalink award report block reply ridge3z 5 points 7 days ago Not surprising. He's both an ardent capitalist and has also been long known to lean Republican since the early 2000s. permalink award report block reply TheJakeFroggy 5 points 7 days ago I bought tupacs of eminems for 50 cents. Wait, what did I just say? permalink award report block reply ShambolicPaul2 4 points 7 days ago What the fuck does that even mean permalink award report block reply Auroraalpha 4 points 7 days ago 50 cent would become 25 cent under the Dems. permalink award report block reply breadbaker 4 points 7 days ago 50 Cent has been living in the nice parts of southwest Connecticut for the last 20 years. permalink award report block reply JanOctSept 3 points 6 days ago I would unironically vote for 50 for NY mayor. permalink award report block reply Hanging_Chad 2 points 7 days ago 👌🏿 permalink award report block reply heightnoise 1 points 6 days ago Louisianian here. Shreveport is a perfect city for his plans. It is nationally centrally located, it's on the crux of major transportation passages and the Mississippi, it is dirt cheap land, and is in desperate need of things to bring in outside investment besides the casino and the LSU medical school. AND what's more (this is a big thing others like me are watching the Capital too) this will show to our State government (and King Landry) that the north of the State needs just as much if not more help with infrastructure than the south and can't be ignored any longer! I remember even back 50 years ago, my MaMa and PaPa on my father's side who lived in Avoyelles Parish (CenLa also needs some help too for that matter, though not as bad as the north) would say something like: \"From Minden to Spearsville to Jonesboro, that's the Black Triangle. The lights go out the more people move away, there's nothing that grows well there, and those who live there find themselves stuck.\" In the 1970s, even the 80s, Shreveport was a bustling city. Now it needs help, and 50 can hopefully help bring it back. ✊🏻 permalink award report block reply Liberats 1 points 7 days ago Now is the time for the wall around NYC and a ban on people leaving if they voted for this cunt. permalink award report block reply mailinvoter 1 points 7 days ago Yeah, after voting for him for some disgusting Chelsea Handler sloppy pootang. permalink award report block reply TooHotToFrost 1 points 6 days ago Must be nice to afford the $30 toll to leave permalink award report block reply YodaBannon 1 points 7 days ago ww got 50 and nicki and weezy permalink award report block reply Lynnforthetruth 1 points 7 days ago Hello world\nCan someone please create a spray bottle of pigs blood that Women and girls can carry for protection permalink award report block reply Tartakovsky 1 points 6 days ago Multi-millionaire relocates. How stunning. How brave. permalink award report block reply DITTOPatriot 1 points 6 days ago And then they all 👏. permalink award report block reply Snek_Plissken -2 points 7 days ago Following in my example. permalink award report block reply Thatunknownguy -2 points 7 days ago Stop showing me ugly joggers against my will permalink award report block reply Stlpoolguy 2 points 7 days ago This is that one in a million jogger permalink parent award report block reply Hanging_Chad 5 points 7 days ago the crème de la crème of joggers permalink parent award report block reply skyhawk 0 points 7 days ago You can take a million out of the joggers but you shouldn't take a jogger out of the millions permalink parent award report block reply deleted -3 points 7 days ago Hanging_Chad 2 points 7 days ago it’s sticky’d, so yes permalink parent award report block reply Snek_Plissken -4 points 7 days ago No shit I escorted him out. permalink award report block reply Peekov3 -13 points 7 days ago PIN IT PIN IT PIN IT!!! HURR DURR permalink award report block reply BeauHD 6 points 7 days ago I am deporting you for being a bot. Please enjoy your ban! permalink parent award report block reply Peekov3 -2 points 7 days ago Enjoy my cock up your arse permalink parent award report block reply CharlieLovedTheJew 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply questionmarks 0 points 7 days ago Comment removed by community filter. permalink award report block reply questionmarks 0 points 7 days ago Comment removed by community filter. permalink award report block reply\nTheRedPilledArtist 126 points 7 days ago 50 Cent was always more based than 30 Pence. permalink award report block reply Tophat9000 28 points 7 days ago Well the way New York will tax When done 50 Cent Will be Nickelback permalink parent award report block reply Metal4Freedom 1 points 7 days ago Top Kek! (and I enjoy Nickelback, especially their live shows) permalink parent award report block reply CharlieLovedTheJew 1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply BeauHD 27 points 7 days ago I wish I could put an \"insightful\" flare on this comment! permalink parent award report block reply Hanging_Chad 13 points 7 days ago 💡 permalink parent award report block reply MasterChief08 5 points 7 days ago He's voted for Trump permalink parent award report block reply caKAG 1 points 7 days ago He knows if he stays in New York he will become 20 cents permalink parent award report block reply CharlieLovedTheJew 1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nTophat9000 28 points 7 days ago Well the way New York will tax When done 50 Cent Will be Nickelback permalink parent award report block reply Metal4Freedom 1 points 7 days ago Top Kek! (and I enjoy Nickelback, especially their live shows) permalink parent award report block reply CharlieLovedTheJew 1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nMetal4Freedom 1 points 7 days ago Top Kek! (and I enjoy Nickelback, especially their live shows) permalink parent award report block reply CharlieLovedTheJew 1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nCharlieLovedTheJew 1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nBeauHD 27 points 7 days ago I wish I could put an \"insightful\" flare on this comment! permalink parent award report block reply Hanging_Chad 13 points 7 days ago 💡 permalink parent award report block reply\nHanging_Chad 13 points 7 days ago 💡 permalink parent award report block reply\nMasterChief08 5 points 7 days ago He's voted for Trump permalink parent award report block reply\ncaKAG 1 points 7 days ago He knows if he stays in New York he will become 20 cents permalink parent award report block reply\nCharlieLovedTheJew 1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nDJT_MFers1 38 points 7 days ago Got out before he was left with 50 cents in his pocket. Knowing that muzzie he’d get that too permalink award report block reply\nTh3Cho0sing0ne 30 points 7 days ago I'm a big fan of Curtis Jackson III.  Discovering how based and down to earth he is irl has been a treat.  He's funny af too. permalink award report block reply indigo_truther 25 points 7 days ago Only him and Kat Williams were calling Puffy gay before last year permalink parent award report block reply Th3Cho0sing0ne 20 points 7 days ago 50 actually took a lot of heat calling Puffy out.  It just seemed so wild at first.  All these years later...50 was proven right, and gains a ton of credibility for taking that risk.  I respect his courage. permalink parent award report block reply CharlieLovedTheJew -1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nindigo_truther 25 points 7 days ago Only him and Kat Williams were calling Puffy gay before last year permalink parent award report block reply Th3Cho0sing0ne 20 points 7 days ago 50 actually took a lot of heat calling Puffy out.  It just seemed so wild at first.  All these years later...50 was proven right, and gains a ton of credibility for taking that risk.  I respect his courage. permalink parent award report block reply\nTh3Cho0sing0ne 20 points 7 days ago 50 actually took a lot of heat calling Puffy out.  It just seemed so wild at first.  All these years later...50 was proven right, and gains a ton of credibility for taking that risk.  I respect his courage. permalink parent award report block reply\nCharlieLovedTheJew -1 points 6 days ago Comment removed by community filter, pending further review. permalink parent award report block reply\nMakeAmericaVapeAgain 26 points 7 days ago pretty soon we are going to run out places to run to. permalink award report block reply Kingoftheroad 4 points 7 days ago Why ive argued with everyone saying we should concede territory to leftists and divide the country in half. If we couldnt stop them we'll enough to protect the entire land, how long before the half of the land we have left gets invaded and overtaken and infiltrated and we have to conded half of that again until we become so small in territory that they have enough land and people to just wipe us out? And its against the American ideal. Run? Wtf kind of Americanism is that? Why not be an American and use ideas and decency along with might to retake and reclaim and rebuild what is actually American? Imagine saying to your grandparents I think we should just give up and let them have our country and run from them....they would slap you so hard you dont remember your own name. Its cowardice permalink parent award report block reply WildernessBro 4 points 7 days ago Yeah. Nevada has already been swept to a solidly blue state due to those faggots. Sometimes I think we just need to dig our heals in and fight back and turn this state red again. I truly believe we outnumber them here and they only get ahead through shady methods during elections. permalink parent award report block reply Pied-Trumper 1 points 6 days ago The only time for running is when you have the intention of retreating to a stronghold, engaging your opponent later. Unfortunately, the GOP is funded by people who don’t want that to happen, so we’ll retreat and then all the same people will continue migrating to where we are, further destroying the country until they’ve taken everything. permalink parent award report block reply\nKingoftheroad 4 points 7 days ago Why ive argued with everyone saying we should concede territory to leftists and divide the country in half. If we couldnt stop them we'll enough to protect the entire land, how long before the half of the land we have left gets invaded and overtaken and infiltrated and we have to conded half of that again until we become so small in territory that they have enough land and people to just wipe us out? And its against the American ideal. Run? Wtf kind of Americanism is that? Why not be an American and use ideas and decency along with might to retake and reclaim and rebuild what is actually American? Imagine saying to your grandparents I think we should just give up and let them have our country and run from them....they would slap you so hard you dont remember your own name. Its cowardice permalink parent award report block reply WildernessBro 4 points 7 days ago Yeah. Nevada has already been swept to a solidly blue state due to those faggots. Sometimes I think we just need to dig our heals in and fight back and turn this state red again. I truly believe we outnumber them here and they only get ahead through shady methods during elections. permalink parent award report block reply\nWildernessBro 4 points 7 days ago Yeah. Nevada has already been swept to a solidly blue state due to those faggots. Sometimes I think we just need to dig our heals in and fight back and turn this state red again. I truly believe we outnumber them here and they only get ahead through shady methods during elections. permalink parent award report block reply\nPied-Trumper 1 points 6 days ago The only time for running is when you have the intention of retreating to a stronghold, engaging your opponent later. Unfortunately, the GOP is funded by people who don’t want that to happen, so we’ll retreat and then all the same people will continue migrating to where we are, further destroying the country until they’ve taken everything. permalink parent award report block reply\nSavingPrivateGrace 13 points 7 days ago He gave his 2 cents. permalink award report block reply MagaMan91 14 points 7 days ago Now he's 48 cent permalink parent award report block reply\nMagaMan91 14 points 7 days ago Now he's 48 cent permalink parent award report block reply\nspinometer2 13 points 7 days ago just wait til the bankers start to move out permalink award report block reply Probably_tryna_sleep 5 points 7 days ago The investment firms have been leaving since 2019, and it accelerated during the plandemic. About a trillion dollars in investment portfolios have bailed out already. The rats they are abandoning a sinking ship lol. permalink parent award report block reply Bendadick_Arnold 1 points 7 days ago The bankers were never there (on paper) permalink parent award report block reply\nProbably_tryna_sleep 5 points 7 days ago The investment firms have been leaving since 2019, and it accelerated during the plandemic. About a trillion dollars in investment portfolios have bailed out already. The rats they are abandoning a sinking ship lol. permalink parent award report block reply\nBendadick_Arnold 1 points 7 days ago The bankers were never there (on paper) permalink parent award report block reply\nOutlawPurpleHairDye 10 points 7 days ago Shreveport? LMAO. That's like leaving Chicago because the mayor's a socialist retard and heading to some shithole suburb like Harvey. permalink award report block reply ScamBlondie 4 points 7 days ago I remember applying at an LSU residency program a few years back and you could buy a 2500 sqft house in Shreveport for like $120k lmao. But I stopped in Shreveport once and didn’t want to ever go back. permalink parent award report block reply Bogey 4 points 7 days ago Underrated comment. Shreveport is burnt out. It's only getting worse every generation and is nothing like the rough but big small town it was before the 80s. permalink parent award report block reply Trump454748 3 points 7 days ago Harvey? Yeah, that is a shit hole. permalink parent award report block reply Hikedelics 2 points 7 days ago Think he has some business/investment ties there. Can’t remember what exactly, but I recall reading about something he was spending money on there a few years back. I’ve only ever passed through Shreveport. Living in Baton Rouge was bad enough, I didn’t need to drive 4h just to experience more of the same. permalink parent award report block reply USDMaga 2 points 7 days ago I went on vacation to Shreveport, can confirm.  (friends lived there at the time, AF Barksdale) permalink parent award report block reply Hikedelics 4 points 7 days ago What do you do on vacation in Shreveport? That sounds like vacationing to Lake Charles or Alexandria, LA. permalink parent award report block reply load 2 more comments...\nScamBlondie 4 points 7 days ago I remember applying at an LSU residency program a few years back and you could buy a 2500 sqft house in Shreveport for like $120k lmao. But I stopped in Shreveport once and didn’t want to ever go back. permalink parent award report block reply\nBogey 4 points 7 days ago Underrated comment. Shreveport is burnt out. It's only getting worse every generation and is nothing like the rough but big small town it was before the 80s. permalink parent award report block reply\nTrump454748 3 points 7 days ago Harvey? Yeah, that is a shit hole. permalink parent award report block reply\nHikedelics 2 points 7 days ago Think he has some business/investment ties there. Can’t remember what exactly, but I recall reading about something he was spending money on there a few years back. I’ve only ever passed through Shreveport. Living in Baton Rouge was bad enough, I didn’t need to drive 4h just to experience more of the same. permalink parent award report block reply\nUSDMaga 2 points 7 days ago I went on vacation to Shreveport, can confirm.  (friends lived there at the time, AF Barksdale) permalink parent award report block reply Hikedelics 4 points 7 days ago What do you do on vacation in Shreveport? That sounds like vacationing to Lake Charles or Alexandria, LA. permalink parent award report block reply\nHikedelics 4 points 7 days ago What do you do on vacation in Shreveport? That sounds like vacationing to Lake Charles or Alexandria, LA. permalink parent award report block reply\nFallenOne 10 points 7 days ago 50 Cent is a businessman now. He has massive TV and music deals going and he is basically rebuilding Shreveport LA and turning it into what Hollywood could be if Hollywood wasn't woke and gay. No surprise at all that 50 got the hell out of NYC. permalink award report block reply\nMixedBlacknWhite 8 points 7 days ago We will see more of this, though not from people we know. If I lived there and knew my taxes were about to shoot through the roof but I could afford to work/be retired/whatever the lower end millionaires do for income.. I'd leave too permalink award report block reply 556x45mm 2 points 7 days ago Please, dont dare Islamify my communist California, go to some other state /s permalink parent award report block reply Femprep 1 points 7 days ago California has enough problems without adding Islam to the mix. permalink parent award report block reply\n556x45mm 2 points 7 days ago Please, dont dare Islamify my communist California, go to some other state /s permalink parent award report block reply Femprep 1 points 7 days ago California has enough problems without adding Islam to the mix. permalink parent award report block reply\nFemprep 1 points 7 days ago California has enough problems without adding Islam to the mix. permalink parent award report block reply\nPatrioticVideo 6 points 7 days ago ...and this is a man who was fine living in an area where he was shot 9 times. permalink award report block reply KungPaoMcChicken 5 points 7 days ago He got rich from getting shot. permalink parent award report block reply StrongIsland 2 points 7 days ago Then they move into your neighborhood for “safety” What a tough guy? Huh? permalink parent award report block reply\nKungPaoMcChicken 5 points 7 days ago He got rich from getting shot. permalink parent award report block reply\nStrongIsland 2 points 7 days ago Then they move into your neighborhood for “safety” What a tough guy? Huh? permalink parent award report block reply\nStrongIsland 5 points 7 days ago 50 cent use to live on Long Island in a rich white town directly next to a black ghetto, then he moved to another white town, he could have helped Wyandanch, but at least he stuck it to Chelsea Handler. permalink award report block reply\nridge3z 5 points 7 days ago Not surprising. He's both an ardent capitalist and has also been long known to lean Republican since the early 2000s. permalink award report block reply\nTheJakeFroggy 5 points 7 days ago I bought tupacs of eminems for 50 cents. Wait, what did I just say? permalink award report block reply\nShambolicPaul2 4 points 7 days ago What the fuck does that even mean permalink award report block reply\nAuroraalpha 4 points 7 days ago 50 cent would become 25 cent under the Dems. permalink award report block reply\nbreadbaker 4 points 7 days ago 50 Cent has been living in the nice parts of southwest Connecticut for the last 20 years. permalink award report block reply\nJanOctSept 3 points 6 days ago I would unironically vote for 50 for NY mayor. permalink award report block reply\nHanging_Chad 2 points 7 days ago 👌🏿 permalink award report block reply\nheightnoise 1 points 6 days ago Louisianian here. Shreveport is a perfect city for his plans. It is nationally centrally located, it's on the crux of major transportation passages and the Mississippi, it is dirt cheap land, and is in desperate need of things to bring in outside investment besides the casino and the LSU medical school. AND what's more (this is a big thing others like me are watching the Capital too) this will show to our State government (and King Landry) that the north of the State needs just as much if not more help with infrastructure than the south and can't be ignored any longer! I remember even back 50 years ago, my MaMa and PaPa on my father's side who lived in Avoyelles Parish (CenLa also needs some help too for that matter, though not as bad as the north) would say something like: \"From Minden to Spearsville to Jonesboro, that's the Black Triangle. The lights go out the more people move away, there's nothing that grows well there, and those who live there find themselves stuck.\" In the 1970s, even the 80s, Shreveport was a bustling city. Now it needs help, and 50 can hopefully help bring it back. ✊🏻 permalink award report block reply\nLiberats 1 points 7 days ago Now is the time for the wall around NYC and a ban on people leaving if they voted for this cunt. permalink award report block reply\nmailinvoter 1 points 7 days ago Yeah, after voting for him for some disgusting Chelsea Handler sloppy pootang. permalink award report block reply\nTooHotToFrost 1 points 6 days ago Must be nice to afford the $30 toll to leave permalink award report block reply\nYodaBannon 1 points 7 days ago ww got 50 and nicki and weezy permalink award report block reply\nLynnforthetruth 1 points 7 days ago Hello world\nCan someone please create a spray bottle of pigs blood that Women and girls can carry for protection permalink award report block reply\nTartakovsky 1 points 6 days ago Multi-millionaire relocates. How stunning. How brave. permalink award report block reply\nDITTOPatriot 1 points 6 days ago And then they all 👏. permalink award report block reply\nSnek_Plissken -2 points 7 days ago Following in my example. permalink award report block reply\nThatunknownguy -2 points 7 days ago Stop showing me ugly joggers against my will permalink award report block reply Stlpoolguy 2 points 7 days ago This is that one in a million jogger permalink parent award report block reply Hanging_Chad 5 points 7 days ago the crème de la crème of joggers permalink parent award report block reply skyhawk 0 points 7 days ago You can take a million out of the joggers but you shouldn't take a jogger out of the millions permalink parent award report block reply\nStlpoolguy 2 points 7 days ago This is that one in a million jogger permalink parent award report block reply Hanging_Chad 5 points 7 days ago the crème de la crème of joggers permalink parent award report block reply skyhawk 0 points 7 days ago You can take a million out of the joggers but you shouldn't take a jogger out of the millions permalink parent award report block reply\nHanging_Chad 5 points 7 days ago the crème de la crème of joggers permalink parent award report block reply\nskyhawk 0 points 7 days ago You can take a million out of the joggers but you shouldn't take a jogger out of the millions permalink parent award report block reply\ndeleted -3 points 7 days ago Hanging_Chad 2 points 7 days ago it’s sticky’d, so yes permalink parent award report block reply\nHanging_Chad 2 points 7 days ago it’s sticky’d, so yes permalink parent award report block reply\nSnek_Plissken -4 points 7 days ago No shit I escorted him out. permalink award report block reply\nPeekov3 -13 points 7 days ago PIN IT PIN IT PIN IT!!! HURR DURR permalink award report block reply BeauHD 6 points 7 days ago I am deporting you for being a bot. Please enjoy your ban! permalink parent award report block reply Peekov3 -2 points 7 days ago Enjoy my cock up your arse permalink parent award report block reply\nBeauHD 6 points 7 days ago I am deporting you for being a bot. Please enjoy your ban! permalink parent award report block reply Peekov3 -2 points 7 days ago Enjoy my cock up your arse permalink parent award report block reply\nPeekov3 -2 points 7 days ago Enjoy my cock up your arse permalink parent award report block reply\nCharlieLovedTheJew 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply\nquestionmarks 0 points 7 days ago Comment removed by community filter. permalink award report block reply\nquestionmarks 0 points 7 days ago Comment removed by community filter. permalink award report block reply"}