{"id": "1ARK9mHVer", "contents": "518 Man who attacked Charlie Kirk supporter at Berkeley is a Muslim rapper named ‘Jihad.’ posted 10 hours ago by kinbergfan 24 comments award share report block Andy Ngo @MrAndyNgo • 22h A Muslim far-left extremist who severely beat a TPUSA attendee on the face after robbing him at UC Berkeley has been identified as Jihad Dphrepaulezz. The 25-year-old listed @CAPublicHealth as his employer. Dphrepaulezz is a rapper known as \"A.R. The Believer.\" He tried Andy Ngo @MrAndyNgo • 2d UC Berkeley (Nov. 10) — A far-left extremist stole a conservative man's necklace & then punched him repeatedly in the face when he tried to take it back outside the TPUSA event. The victim was bloodied, and the leftists racially mocked him for being white.\n24 comments Sort by Top Top New Worst Old Save SuperDuperBasedMD 24 points 10 hours ago denaturalize and deport permalink award report block reply rebuildingMyself 11 points 7 hours ago His victim wasn't Jewish so I'm not optimistic permalink parent award report block reply God-is-good 5 points 6 hours ago I heard the necklace was a cross and the punched man was Christian. permalink parent award report block reply Mhmm2MoreWeeks 1 points 42 seconds ago If you were to study history you would know that those who go against Jews have lost every single time. The enemies of the Jews are against God. The trend will continue. permalink parent award report block reply twentytwentyfourr 14 points 9 hours ago works for the gov, shocker permalink award report block reply God-is-good 5 points 6 hours ago Lots coming out recently about the government funding degenerate rappers. With usaid drying up the billboards have been absent rap mysteriously. https://www.cbc.ca/arts/commotion/how-did-rap-fall-out-of-the-billboard-top-40-9.6974039 permalink parent award report block reply rebuildingMyself 2 points 3 hours ago Tax dollars hard at work as always permalink parent award report block reply Badfinz_FL 10 points 10 hours ago Time for jihad to be deported to GITMO permalink award report block reply Bigstick7 8 points 5 hours ago Conservatives need to start training with firearms and hand to hand (boxing, jit jitsu, something), and stay frosty. permalink award report block reply penguinjay1212 2 points 3 hours ago Why do you say he wasnt? Dude had 3 to 4 different fights. Supporting each other under lopsided ruling in crazed jurisdictions seems way more important. Dont put yourself in that situation to begin with. Dude shoulda had like 10 friends ready to stomp the life out of those people. Don't go protesting alone. Buddy system minimum. permalink parent award report block reply RudeFrog 8 points 7 hours ago Will he even be arrested? permalink award report block reply chuey_316 6 points 4 hours ago The left have openly and fully demonstrated that they cannot control their mental illness and are threats. Anyone who can legally carry needs to stay strapped. The victim would have been completely justified in giving this goat fucker a hole in the chest. permalink award report block reply rebuildingMyself 1 points 3 hours ago At this point I think even the Democrat machine knows they lost control of the radicals on their side permalink parent award report block reply Dev404 5 points 5 hours ago Gee, another beloved muslim animal that leftists eagerly bend over for. How surprising. permalink award report block reply Shitsbrokeyo 4 points 4 hours ago Criminal offense. Deport permalink award report block reply Pats5x 4 points 5 hours ago they all work in academia, ngos or in government permalink award report block reply TwoArizonaPedes 1 points 9 seconds ago Or medicine. permalink parent award report block reply BBvarn 3 points 8 hours ago Perfect resume for democrat politician. permalink award report block reply SpellingContable 2 points 3 hours ago \"dEvErSiTy iS oUr sTrEnGtH\" permalink award report block reply redditadminssuckit 2 points 10 minutes ago Sue the state for knowingly employing a terrorist permalink award report block reply Lady_MaGa 1 points 2 minutes ago My first reaction upon seeing that guy's face was:  Charles Manson? permalink award report block reply NoWorries77 0 points 21 minutes ago Is this Ireland? permalink award report block reply Ugh3rdaccount -2 points 9 hours ago Trump just said we need him though because we’re stupid. 🤷🏼‍♂️ permalink award report block reply ThisTrainHasNoBrakes 0 points 3 minutes ago Down voters are fags…this comment isn’t far off reality and it was obviously not meant to be literal. Maybe “Jihad” can help us process our 80 year mortgages. permalink parent award report block reply\nSuperDuperBasedMD 24 points 10 hours ago denaturalize and deport permalink award report block reply rebuildingMyself 11 points 7 hours ago His victim wasn't Jewish so I'm not optimistic permalink parent award report block reply God-is-good 5 points 6 hours ago I heard the necklace was a cross and the punched man was Christian. permalink parent award report block reply Mhmm2MoreWeeks 1 points 42 seconds ago If you were to study history you would know that those who go against Jews have lost every single time. The enemies of the Jews are against God. The trend will continue. permalink parent award report block reply\nrebuildingMyself 11 points 7 hours ago His victim wasn't Jewish so I'm not optimistic permalink parent award report block reply God-is-good 5 points 6 hours ago I heard the necklace was a cross and the punched man was Christian. permalink parent award report block reply Mhmm2MoreWeeks 1 points 42 seconds ago If you were to study history you would know that those who go against Jews have lost every single time. The enemies of the Jews are against God. The trend will continue. permalink parent award report block reply\nGod-is-good 5 points 6 hours ago I heard the necklace was a cross and the punched man was Christian. permalink parent award report block reply\nMhmm2MoreWeeks 1 points 42 seconds ago If you were to study history you would know that those who go against Jews have lost every single time. The enemies of the Jews are against God. The trend will continue. permalink parent award report block reply\ntwentytwentyfourr 14 points 9 hours ago works for the gov, shocker permalink award report block reply God-is-good 5 points 6 hours ago Lots coming out recently about the government funding degenerate rappers. With usaid drying up the billboards have been absent rap mysteriously. https://www.cbc.ca/arts/commotion/how-did-rap-fall-out-of-the-billboard-top-40-9.6974039 permalink parent award report block reply rebuildingMyself 2 points 3 hours ago Tax dollars hard at work as always permalink parent award report block reply\nGod-is-good 5 points 6 hours ago Lots coming out recently about the government funding degenerate rappers. With usaid drying up the billboards have been absent rap mysteriously. https://www.cbc.ca/arts/commotion/how-did-rap-fall-out-of-the-billboard-top-40-9.6974039 permalink parent award report block reply\nrebuildingMyself 2 points 3 hours ago Tax dollars hard at work as always permalink parent award report block reply\nBadfinz_FL 10 points 10 hours ago Time for jihad to be deported to GITMO permalink award report block reply\nBigstick7 8 points 5 hours ago Conservatives need to start training with firearms and hand to hand (boxing, jit jitsu, something), and stay frosty. permalink award report block reply penguinjay1212 2 points 3 hours ago Why do you say he wasnt? Dude had 3 to 4 different fights. Supporting each other under lopsided ruling in crazed jurisdictions seems way more important. Dont put yourself in that situation to begin with. Dude shoulda had like 10 friends ready to stomp the life out of those people. Don't go protesting alone. Buddy system minimum. permalink parent award report block reply\npenguinjay1212 2 points 3 hours ago Why do you say he wasnt? Dude had 3 to 4 different fights. Supporting each other under lopsided ruling in crazed jurisdictions seems way more important. Dont put yourself in that situation to begin with. Dude shoulda had like 10 friends ready to stomp the life out of those people. Don't go protesting alone. Buddy system minimum. permalink parent award report block reply\nRudeFrog 8 points 7 hours ago Will he even be arrested? permalink award report block reply\nchuey_316 6 points 4 hours ago The left have openly and fully demonstrated that they cannot control their mental illness and are threats. Anyone who can legally carry needs to stay strapped. The victim would have been completely justified in giving this goat fucker a hole in the chest. permalink award report block reply rebuildingMyself 1 points 3 hours ago At this point I think even the Democrat machine knows they lost control of the radicals on their side permalink parent award report block reply\nrebuildingMyself 1 points 3 hours ago At this point I think even the Democrat machine knows they lost control of the radicals on their side permalink parent award report block reply\nDev404 5 points 5 hours ago Gee, another beloved muslim animal that leftists eagerly bend over for. How surprising. permalink award report block reply\nShitsbrokeyo 4 points 4 hours ago Criminal offense. Deport permalink award report block reply\nPats5x 4 points 5 hours ago they all work in academia, ngos or in government permalink award report block reply TwoArizonaPedes 1 points 9 seconds ago Or medicine. permalink parent award report block reply\nTwoArizonaPedes 1 points 9 seconds ago Or medicine. permalink parent award report block reply\nBBvarn 3 points 8 hours ago Perfect resume for democrat politician. permalink award report block reply\nSpellingContable 2 points 3 hours ago \"dEvErSiTy iS oUr sTrEnGtH\" permalink award report block reply\nredditadminssuckit 2 points 10 minutes ago Sue the state for knowingly employing a terrorist permalink award report block reply\nLady_MaGa 1 points 2 minutes ago My first reaction upon seeing that guy's face was:  Charles Manson? permalink award report block reply\nNoWorries77 0 points 21 minutes ago Is this Ireland? permalink award report block reply\nUgh3rdaccount -2 points 9 hours ago Trump just said we need him though because we’re stupid. 🤷🏼‍♂️ permalink award report block reply ThisTrainHasNoBrakes 0 points 3 minutes ago Down voters are fags…this comment isn’t far off reality and it was obviously not meant to be literal. Maybe “Jihad” can help us process our 80 year mortgages. permalink parent award report block reply\nThisTrainHasNoBrakes 0 points 3 minutes ago Down voters are fags…this comment isn’t far off reality and it was obviously not meant to be literal. Maybe “Jihad” can help us process our 80 year mortgages. permalink parent award report block reply"}