{"id": "1ARK0UbcpA", "contents": "599 Just had to say goodbye to this precious boy. 8 years and 6 months Kevin was with my family. Just need strength/prayers right now. posted 7 days ago by USMC1234O10 48 comments award share download report block\n48 comments Sort by Top Top New Worst Old Save moxieprox 15 points 7 days ago Strange: https://patriots.win/p/1ARK0UbcUS/just-had-to-say-goodbye-to-this-/c/ permalink award report block reply c_programmer 5 points 7 days ago Bot activity permalink parent award report block reply BrookieDragon 5 points 7 days ago Was about to say, that's one rough 8 year old dog. Still, shill's be shilling. permalink parent award report block reply ForceMultiplier 2 points 6 days ago It's fake and ghay https://www.newsweek.com/shelter-using-gas-chambers-euthanize-dogs-sparks-outrage-viral-video-1702305 I don't know if this is a blatant attempt to earn fake internet point, or simple forum sliding, but the P(dot)W team needs to hand out a temporary ban at the absolute minimum. permalink parent award report block reply PensivePatriot 10 points 7 days ago Enough with the fucking dead dog FORUM SLIDING BULLSHIT permalink award report block reply Kmdub2 -2 points 6 days ago Calm down, this is a community of like minded people who sometimes need to share and have a human connection. Hate it? Scroll by. Damn permalink parent award report block reply jhewish 3 points 6 days ago I think you totally missed the point of the responses here. It appears to be a new account that is farming engagement. permalink parent award report block reply Kmdub2 -3 points 6 days ago OK my bad but what does that accomplish? permalink parent award report block reply MyNameIsTaxpayer 9 points 7 days ago If I could give you any comfort by any means I would. Your greatest bestest boy knows how much you love him. You gave all you could but more importantly, he gave everything he had for you. May God bring Kevin into his kingdom, comfort and love him until you can be reunited. I'm so so sorry for your loss. permalink award report block reply deleted 8 points 7 days ago TheDudeWillNotAbide 16 points 7 days ago This is a troll...see other post below...different dog permalink parent award report block reply VelmaFoundAClue 9 points 7 days ago Jinkies! It is almost as if... P-D-W is overrun with botz. What should we do, Fred? permalink parent award report block reply sumnayin2 6 points 7 days ago Elect a commie mod permalink parent award report block reply Retardloserimsogay 2 points 7 days ago Can that mod also be a Muslim? permalink parent award report block reply view 2 more comments... Metalheads4Trump 5 points 7 days ago Not only bots, but a quick strategy to make handshakes disappear from accounts to make it easier to infiltrate. Just post whatever causes upvotes. It doesn’t have to be real. People fall for it all the time here. Also, how fucked up is it to use pictures of dogs suffering, let alone on a fake post, for this purpose. permalink parent award report block reply BaguettesOfRudysSUB 3 points 7 days ago Also create accounts to bow to. Alts are USNVET71, USMC6541E5, Oldman1945, Seeker_17, Patriot4TN, Deplorablenycpr, Stlpoolguy, and MANY others. Place is overrun with automated accounts and overseas guptas/chicoms. I'd wager it's 75% of the active user base now. If I post the Discord channel, this post will be deleted, but we have most of them figured out. It's fucking obvious if you do a little stochastic modeling, not even to bring in the help of $5 worth of AI time. And I am not going to give any more details because they are ACTIVELY watching this thread. Notice how the first dead dog post was deleted. permalink parent award report block reply TheDudeWillNotAbide 3 points 7 days ago Thanks for the heads up...relatively new posting here, but lurking for a couple of years.  It is a new low. permalink parent award report block reply TheChillingEffect 8 points 7 days ago Prayers for you and your family. Had something happen in similar fashion 13 days ago.  Not easy... permalink award report block reply FusionBlack 5 points 7 days ago It's a family member. God bless. permalink award report block reply Cville123 4 points 7 days ago Very sorry.  You never get over it, nor do you want to. permalink award report block reply SigourneyPodgorny20 4 points 7 days ago :'( I know the pain and am so sorry for your loss. permalink award report block reply Pissonit 4 points 7 days ago Prayers Brother....I'm so sorry for your loss. Two months ago I had to put down my boy (German Shepherd). He was 8 years old. I know it hurts like hell brother but try to think of the good times you had. Time will help you heal. Thoughts and Prayers....Oh and by the way I truly believe our little friends will be in Heaven waiting for us. permalink award report block reply DarkKnightPatriot 3 points 7 days ago It's amazing how many people just blurt out thoughts and prayers, like some kind of knee jerk thing. When in the history of these forums is it popular or normal to post this many pictures and posts about dead pets? There is something else that needs to be noted. I'm all about sharing pics of pets but pictures of them dead? Most normal people share news of their loss and good happy pics of their pets and loved ones. I've seen 3, maybe 4 of the same kind of posts in the last two days. Very strange. permalink award report block reply UGetWhatUNeed 3 points 7 days ago I am so sorry Fren…may he be at peace and May you find comfort knowing you will be reunited in heaven.❤️ permalink award report block reply LadyGunslinger68 3 points 7 days ago So sorry you lost your boy. My heart goes out to you but take comfort in knowing that you gave him a good life and that he loved you. Treasure the memories you made with him ❤️ Our cat of sixteen years has a mass in her abdomen and is on borrowed time. I'm dreading when THAT day finally comes. Animals truly are a blessing from God 🙏 permalink award report block reply LaptopDied 2 points 7 days ago Beautiful dog. Sorry for your loss. permalink award report block reply iMeltSnowflakes 1 points 6 days ago I'm so sorry for the loss of your beloved family member. permalink award report block reply FredRedd 1 points 7 days ago Blessings to your family, especially Kevin. permalink award report block reply Littleirishmaid 1 points 7 days ago Kevin.  What a great name for such a great friend.  🙏🏻  He loved you his whole life. permalink award report block reply McShoty96 1 points 7 days ago Sending prayers for you and your family 🙏 permalink award report block reply schiff_for_brains 1 points 7 days ago Blessed is he who has known the love of an old dog. permalink award report block reply MSG1000 1 points 7 days ago Prayers sent. permalink award report block reply jhewish 1 points 6 days ago Man its one thing to post multiple times but to farm engagement using something like this takes a special type of piece of shit. permalink award report block reply mlp67 1 points 7 days ago I'm so very sorry.  It's so hard to say goodbye to your friend. permalink award report block reply RedCapNation 1 points 7 days ago Prayer sent. 🙏🐶❤️ permalink award report block reply Rerun1Central 1 points 7 days ago Prayers for Kevin and his Pack. permalink award report block reply Mungo 1 points 7 days ago We lost our boy Ike in May, he was our 4th.  It never gets easier.  We now have Gabe!  Just turned 7 months old.   Go out and give another dog a wonderful home! permalink award report block reply General_Specific 1 points 7 days ago I know how hard this is. My heart goes out to you. God bless you and your Kevin who went to heaven. ❤️ permalink award report block reply ShaeMossMemphrica 1 points 7 days ago u/-f-b-i- sticky please permalink award report block reply SavingPrivateGrace 1 points 7 days ago Sorry for your loss.  Prayers of comfort and blessings for your family during this difficult time. permalink award report block reply keeman 1 points 7 days ago Whenever I have a beloved family pet, I also put it in a small wire cage out in the elements with a cardboard floor. permalink award report block reply TEXinLA 1 points 7 days ago 🙏🙏 Prayers. So hard to do. permalink award report block reply jermzdeejd 0 points 6 days ago No leg and on cardboard box, supported by wires. That is no dog owner. permalink award report block reply questionmarks -2 points 7 days ago died in a cage like a piece of shit permalink award report block reply keeman 2 points 7 days ago If it makes you feel any better, this is some stock photo from a forum sliding troll. permalink parent award report block reply\nmoxieprox 15 points 7 days ago Strange: https://patriots.win/p/1ARK0UbcUS/just-had-to-say-goodbye-to-this-/c/ permalink award report block reply c_programmer 5 points 7 days ago Bot activity permalink parent award report block reply BrookieDragon 5 points 7 days ago Was about to say, that's one rough 8 year old dog. Still, shill's be shilling. permalink parent award report block reply ForceMultiplier 2 points 6 days ago It's fake and ghay https://www.newsweek.com/shelter-using-gas-chambers-euthanize-dogs-sparks-outrage-viral-video-1702305 I don't know if this is a blatant attempt to earn fake internet point, or simple forum sliding, but the P(dot)W team needs to hand out a temporary ban at the absolute minimum. permalink parent award report block reply\nc_programmer 5 points 7 days ago Bot activity permalink parent award report block reply\nBrookieDragon 5 points 7 days ago Was about to say, that's one rough 8 year old dog. Still, shill's be shilling. permalink parent award report block reply\nForceMultiplier 2 points 6 days ago It's fake and ghay https://www.newsweek.com/shelter-using-gas-chambers-euthanize-dogs-sparks-outrage-viral-video-1702305 I don't know if this is a blatant attempt to earn fake internet point, or simple forum sliding, but the P(dot)W team needs to hand out a temporary ban at the absolute minimum. permalink parent award report block reply\nPensivePatriot 10 points 7 days ago Enough with the fucking dead dog FORUM SLIDING BULLSHIT permalink award report block reply Kmdub2 -2 points 6 days ago Calm down, this is a community of like minded people who sometimes need to share and have a human connection. Hate it? Scroll by. Damn permalink parent award report block reply jhewish 3 points 6 days ago I think you totally missed the point of the responses here. It appears to be a new account that is farming engagement. permalink parent award report block reply Kmdub2 -3 points 6 days ago OK my bad but what does that accomplish? permalink parent award report block reply\nKmdub2 -2 points 6 days ago Calm down, this is a community of like minded people who sometimes need to share and have a human connection. Hate it? Scroll by. Damn permalink parent award report block reply jhewish 3 points 6 days ago I think you totally missed the point of the responses here. It appears to be a new account that is farming engagement. permalink parent award report block reply Kmdub2 -3 points 6 days ago OK my bad but what does that accomplish? permalink parent award report block reply\njhewish 3 points 6 days ago I think you totally missed the point of the responses here. It appears to be a new account that is farming engagement. permalink parent award report block reply Kmdub2 -3 points 6 days ago OK my bad but what does that accomplish? permalink parent award report block reply\nKmdub2 -3 points 6 days ago OK my bad but what does that accomplish? permalink parent award report block reply\nMyNameIsTaxpayer 9 points 7 days ago If I could give you any comfort by any means I would. Your greatest bestest boy knows how much you love him. You gave all you could but more importantly, he gave everything he had for you. May God bring Kevin into his kingdom, comfort and love him until you can be reunited. I'm so so sorry for your loss. permalink award report block reply\ndeleted 8 points 7 days ago TheDudeWillNotAbide 16 points 7 days ago This is a troll...see other post below...different dog permalink parent award report block reply VelmaFoundAClue 9 points 7 days ago Jinkies! It is almost as if... P-D-W is overrun with botz. What should we do, Fred? permalink parent award report block reply sumnayin2 6 points 7 days ago Elect a commie mod permalink parent award report block reply Retardloserimsogay 2 points 7 days ago Can that mod also be a Muslim? permalink parent award report block reply view 2 more comments... Metalheads4Trump 5 points 7 days ago Not only bots, but a quick strategy to make handshakes disappear from accounts to make it easier to infiltrate. Just post whatever causes upvotes. It doesn’t have to be real. People fall for it all the time here. Also, how fucked up is it to use pictures of dogs suffering, let alone on a fake post, for this purpose. permalink parent award report block reply BaguettesOfRudysSUB 3 points 7 days ago Also create accounts to bow to. Alts are USNVET71, USMC6541E5, Oldman1945, Seeker_17, Patriot4TN, Deplorablenycpr, Stlpoolguy, and MANY others. Place is overrun with automated accounts and overseas guptas/chicoms. I'd wager it's 75% of the active user base now. If I post the Discord channel, this post will be deleted, but we have most of them figured out. It's fucking obvious if you do a little stochastic modeling, not even to bring in the help of $5 worth of AI time. And I am not going to give any more details because they are ACTIVELY watching this thread. Notice how the first dead dog post was deleted. permalink parent award report block reply TheDudeWillNotAbide 3 points 7 days ago Thanks for the heads up...relatively new posting here, but lurking for a couple of years.  It is a new low. permalink parent award report block reply\nTheDudeWillNotAbide 16 points 7 days ago This is a troll...see other post below...different dog permalink parent award report block reply VelmaFoundAClue 9 points 7 days ago Jinkies! It is almost as if... P-D-W is overrun with botz. What should we do, Fred? permalink parent award report block reply sumnayin2 6 points 7 days ago Elect a commie mod permalink parent award report block reply Retardloserimsogay 2 points 7 days ago Can that mod also be a Muslim? permalink parent award report block reply view 2 more comments... Metalheads4Trump 5 points 7 days ago Not only bots, but a quick strategy to make handshakes disappear from accounts to make it easier to infiltrate. Just post whatever causes upvotes. It doesn’t have to be real. People fall for it all the time here. Also, how fucked up is it to use pictures of dogs suffering, let alone on a fake post, for this purpose. permalink parent award report block reply BaguettesOfRudysSUB 3 points 7 days ago Also create accounts to bow to. Alts are USNVET71, USMC6541E5, Oldman1945, Seeker_17, Patriot4TN, Deplorablenycpr, Stlpoolguy, and MANY others. Place is overrun with automated accounts and overseas guptas/chicoms. I'd wager it's 75% of the active user base now. If I post the Discord channel, this post will be deleted, but we have most of them figured out. It's fucking obvious if you do a little stochastic modeling, not even to bring in the help of $5 worth of AI time. And I am not going to give any more details because they are ACTIVELY watching this thread. Notice how the first dead dog post was deleted. permalink parent award report block reply TheDudeWillNotAbide 3 points 7 days ago Thanks for the heads up...relatively new posting here, but lurking for a couple of years.  It is a new low. permalink parent award report block reply\nVelmaFoundAClue 9 points 7 days ago Jinkies! It is almost as if... P-D-W is overrun with botz. What should we do, Fred? permalink parent award report block reply sumnayin2 6 points 7 days ago Elect a commie mod permalink parent award report block reply Retardloserimsogay 2 points 7 days ago Can that mod also be a Muslim? permalink parent award report block reply view 2 more comments...\nsumnayin2 6 points 7 days ago Elect a commie mod permalink parent award report block reply Retardloserimsogay 2 points 7 days ago Can that mod also be a Muslim? permalink parent award report block reply view 2 more comments...\nRetardloserimsogay 2 points 7 days ago Can that mod also be a Muslim? permalink parent award report block reply view 2 more comments...\nMetalheads4Trump 5 points 7 days ago Not only bots, but a quick strategy to make handshakes disappear from accounts to make it easier to infiltrate. Just post whatever causes upvotes. It doesn’t have to be real. People fall for it all the time here. Also, how fucked up is it to use pictures of dogs suffering, let alone on a fake post, for this purpose. permalink parent award report block reply BaguettesOfRudysSUB 3 points 7 days ago Also create accounts to bow to. Alts are USNVET71, USMC6541E5, Oldman1945, Seeker_17, Patriot4TN, Deplorablenycpr, Stlpoolguy, and MANY others. Place is overrun with automated accounts and overseas guptas/chicoms. I'd wager it's 75% of the active user base now. If I post the Discord channel, this post will be deleted, but we have most of them figured out. It's fucking obvious if you do a little stochastic modeling, not even to bring in the help of $5 worth of AI time. And I am not going to give any more details because they are ACTIVELY watching this thread. Notice how the first dead dog post was deleted. permalink parent award report block reply TheDudeWillNotAbide 3 points 7 days ago Thanks for the heads up...relatively new posting here, but lurking for a couple of years.  It is a new low. permalink parent award report block reply\nBaguettesOfRudysSUB 3 points 7 days ago Also create accounts to bow to. Alts are USNVET71, USMC6541E5, Oldman1945, Seeker_17, Patriot4TN, Deplorablenycpr, Stlpoolguy, and MANY others. Place is overrun with automated accounts and overseas guptas/chicoms. I'd wager it's 75% of the active user base now. If I post the Discord channel, this post will be deleted, but we have most of them figured out. It's fucking obvious if you do a little stochastic modeling, not even to bring in the help of $5 worth of AI time. And I am not going to give any more details because they are ACTIVELY watching this thread. Notice how the first dead dog post was deleted. permalink parent award report block reply\nTheDudeWillNotAbide 3 points 7 days ago Thanks for the heads up...relatively new posting here, but lurking for a couple of years.  It is a new low. permalink parent award report block reply\nTheChillingEffect 8 points 7 days ago Prayers for you and your family. Had something happen in similar fashion 13 days ago.  Not easy... permalink award report block reply\nFusionBlack 5 points 7 days ago It's a family member. God bless. permalink award report block reply\nCville123 4 points 7 days ago Very sorry.  You never get over it, nor do you want to. permalink award report block reply\nSigourneyPodgorny20 4 points 7 days ago :'( I know the pain and am so sorry for your loss. permalink award report block reply\nPissonit 4 points 7 days ago Prayers Brother....I'm so sorry for your loss. Two months ago I had to put down my boy (German Shepherd). He was 8 years old. I know it hurts like hell brother but try to think of the good times you had. Time will help you heal. Thoughts and Prayers....Oh and by the way I truly believe our little friends will be in Heaven waiting for us. permalink award report block reply\nDarkKnightPatriot 3 points 7 days ago It's amazing how many people just blurt out thoughts and prayers, like some kind of knee jerk thing. When in the history of these forums is it popular or normal to post this many pictures and posts about dead pets? There is something else that needs to be noted. I'm all about sharing pics of pets but pictures of them dead? Most normal people share news of their loss and good happy pics of their pets and loved ones. I've seen 3, maybe 4 of the same kind of posts in the last two days. Very strange. permalink award report block reply\nUGetWhatUNeed 3 points 7 days ago I am so sorry Fren…may he be at peace and May you find comfort knowing you will be reunited in heaven.❤️ permalink award report block reply\nLadyGunslinger68 3 points 7 days ago So sorry you lost your boy. My heart goes out to you but take comfort in knowing that you gave him a good life and that he loved you. Treasure the memories you made with him ❤️ Our cat of sixteen years has a mass in her abdomen and is on borrowed time. I'm dreading when THAT day finally comes. Animals truly are a blessing from God 🙏 permalink award report block reply\nLaptopDied 2 points 7 days ago Beautiful dog. Sorry for your loss. permalink award report block reply\niMeltSnowflakes 1 points 6 days ago I'm so sorry for the loss of your beloved family member. permalink award report block reply\nFredRedd 1 points 7 days ago Blessings to your family, especially Kevin. permalink award report block reply\nLittleirishmaid 1 points 7 days ago Kevin.  What a great name for such a great friend.  🙏🏻  He loved you his whole life. permalink award report block reply\nMcShoty96 1 points 7 days ago Sending prayers for you and your family 🙏 permalink award report block reply\nschiff_for_brains 1 points 7 days ago Blessed is he who has known the love of an old dog. permalink award report block reply\nMSG1000 1 points 7 days ago Prayers sent. permalink award report block reply\njhewish 1 points 6 days ago Man its one thing to post multiple times but to farm engagement using something like this takes a special type of piece of shit. permalink award report block reply\nmlp67 1 points 7 days ago I'm so very sorry.  It's so hard to say goodbye to your friend. permalink award report block reply\nRedCapNation 1 points 7 days ago Prayer sent. 🙏🐶❤️ permalink award report block reply\nRerun1Central 1 points 7 days ago Prayers for Kevin and his Pack. permalink award report block reply\nMungo 1 points 7 days ago We lost our boy Ike in May, he was our 4th.  It never gets easier.  We now have Gabe!  Just turned 7 months old.   Go out and give another dog a wonderful home! permalink award report block reply\nGeneral_Specific 1 points 7 days ago I know how hard this is. My heart goes out to you. God bless you and your Kevin who went to heaven. ❤️ permalink award report block reply\nShaeMossMemphrica 1 points 7 days ago u/-f-b-i- sticky please permalink award report block reply\nSavingPrivateGrace 1 points 7 days ago Sorry for your loss.  Prayers of comfort and blessings for your family during this difficult time. permalink award report block reply\nkeeman 1 points 7 days ago Whenever I have a beloved family pet, I also put it in a small wire cage out in the elements with a cardboard floor. permalink award report block reply\nTEXinLA 1 points 7 days ago 🙏🙏 Prayers. So hard to do. permalink award report block reply\njermzdeejd 0 points 6 days ago No leg and on cardboard box, supported by wires. That is no dog owner. permalink award report block reply\nquestionmarks -2 points 7 days ago died in a cage like a piece of shit permalink award report block reply keeman 2 points 7 days ago If it makes you feel any better, this is some stock photo from a forum sliding troll. permalink parent award report block reply\nkeeman 2 points 7 days ago If it makes you feel any better, this is some stock photo from a forum sliding troll. permalink parent award report block reply"}