{"id": "1ARK0Ub4OO", "contents": "368 Dr Oz announces 6 Democrat states have been stealing federal tax dollars for healthcare for illegals: We found already $1.3 billion has been inappropriately taken from federal taxpayers in just the past few months. We just clawed back $300 million. posted 7 days ago by Mr_Rightside 7 comments award share report block Wall Street Apes @WallStreetApes • 7d WOW 🚨 Dr Oz, Administrator for the Centers for Medicare & Medicaid Services, announces they have evidence 6 Democrat states have been stealing federal tax dollars for healthcare for illegals Over a billion dollars stolen in just the last few months “We decided to investigate\n7 comments Sort by Top Top New Worst Old Save Around the Web FusionBlack 8 points 7 days ago How many have been arrested?  None is a huge number. How many illegals have been removed from government benefit programs? Same . permalink award report block reply Grindelwald 5 points 7 days ago And this is why we must keep the government shut down.  Keep investigating.   It’s easier to find money when it slows down. permalink award report block reply Helly 3 points 7 days ago Scam bondi is on it permalink award report block reply Krat 3 points 7 days ago And zero arrests ! I am sure they soooo swowwy permalink award report block reply KennyUS 2 points 7 days ago If this is true there better be some arrests and prison terms.  Exposing fraud without consequences only intensifies frustration and anger at a gutless spineless GOP. permalink award report block reply onesummerdream 1 points 7 days ago Claw it back then. Let me know when it gets returned. permalink award report block reply goodguy 1 points 7 days ago he's doing that used car salesman thing by over using hand gestures - cheap, untrustworthy, and cringe permalink award report block reply\nFusionBlack 8 points 7 days ago How many have been arrested?  None is a huge number. How many illegals have been removed from government benefit programs? Same . permalink award report block reply\nGrindelwald 5 points 7 days ago And this is why we must keep the government shut down.  Keep investigating.   It’s easier to find money when it slows down. permalink award report block reply\nHelly 3 points 7 days ago Scam bondi is on it permalink award report block reply\nKrat 3 points 7 days ago And zero arrests ! I am sure they soooo swowwy permalink award report block reply\nKennyUS 2 points 7 days ago If this is true there better be some arrests and prison terms.  Exposing fraud without consequences only intensifies frustration and anger at a gutless spineless GOP. permalink award report block reply\nonesummerdream 1 points 7 days ago Claw it back then. Let me know when it gets returned. permalink award report block reply\ngoodguy 1 points 7 days ago he's doing that used car salesman thing by over using hand gestures - cheap, untrustworthy, and cringe permalink award report block reply"}