{"id": "1ARK54RfPs", "contents": "600 Transgender New Hampshire State Rep. Pleads Guilty in Connection to Child Sex Crimes (www.thegatewaypundit.com) posted 5 days ago by rdvs34283 29 comments award share report block Former Transgender New Hampshire State Rep. Pleads Guilty in Connection to Child Sex Crimes | The Gateway Pundit | by Cristina L... A former transgender New Hampshire state legislator pleaded guilty to sexual exploitation of children this week. www.thegatewaypundit.com\n29 comments Sort by Top Top New Worst Old Save AwShitHereWeGoAgain 24 points 5 days ago Woodchipper. permalink award report block reply tooanalytical 6 points 5 days ago Feet first, on the slowest setting. permalink parent award report block reply AwShitHereWeGoAgain 2 points 5 days ago Your terms are acceptable. permalink parent award report block reply 19American62Woman 12 points 5 days ago Millstone and done permalink award report block reply tralbolh 11 points 5 days ago former transgender New Hampshire state legislator should that be \"transgender former New Hampshire state legislator\"? Is the perp a former legislator, formerly transgender, both? Would only be half surprised if some states actually had a position of \"transgender state legislator\". Guess the news headline GWP screenshotted makes it clearer, currently transgender and a former legistlator In 2023, Laughton, 41, of Nashua, New Hampshire, and his former intimate partner and daycare worker, Lindsay Groves, were charged with child exploitation. Another confusingly worded former, one would hop Groves was terminated, and perhaps was. Groves admitted to taking sexually explicit photos of children at the daycare center and sending them to Laughton. Laughton was charged with one count of sexual exploitation of children – and aiding and abetting, according to the DOJ. “According to the charging documents, a preliminary forensic review of Groves’ cellphone allegedly revealed over 10,000 text messages between Laughton and Groves that included discussion about, and transfer of, explicit photographs that Groves had taken of children while employed at Creative Minds daycare – including at least four sexually explicit images of children who appear to be approximately three to five years old, as well as explicit descriptions of sex with each other and others, including children ,” the DOJ said. Sounds like they should be interviewing children for multiple rape charges instead of settling for single child abuse and child pornography charge. 15 years and up to 30 years in prison, at least five years 15 years, with good prison behavior and parole could be out in a third, which makes the 5 years.  Keep looking into a rape charge, it sounds like they committed them. They need to be kept away. permalink award report block reply 16BeatsAOne 1 points 5 days ago former transgender mentally ill man New Hampshire state legislator Fixed it. permalink parent award report block reply BaronFalcon 8 points 5 days ago Groomers, all of them. permalink award report block reply BillGateCanSuckIt 6 points 5 days ago That's an ugly pizza hut permalink award report block reply anotherthing 2 points 5 days ago Buffalo Bill passed better. permalink parent award report block reply makenomistake 1 points 5 days ago </>thread permalink parent award report block reply COLDWARPATRIOT55 3 points 5 days ago Former transgender or former state legislator? permalink award report block reply Johnkimble111 3 points 5 days ago There’s no such thing as “transgender” permalink parent award report block reply TGNX 2 points 5 days ago Every time. permalink award report block reply Beeboy 2 points 5 days ago That's demoRATS for you!!! Satanic permalink award report block reply PearlyGaits57 2 points 5 days ago To the GALLOWS. \"OFF WITH IT'S HEAD\" \"former transgender\" I love how they can proclaim to be a woman when biologically they are male, one day, then just say, \"oh I don't like this that I have chosen for myself\" I think I want to be a man again. WTF! permalink award report block reply Megabrain1960 2 points 5 days ago Let him be Jonathan Watson's next cellmate. https://www.fox32chicago.com/news/report-prisoner-confesses-to-killing-2-child-molesters permalink award report block reply SALTY-OGRE 2 points 5 days ago MILLSTONE permalink award report block reply jiujiujiu 1 points 5 days ago Men pretending to be women is extreme human degeneracy and forcing people to enable it is an exercise in mass humiliation. permalink award report block reply schiff_for_brains 1 points 5 days ago He's no longer transgender? permalink award report block reply Now_On_to_Mars 1 points 5 days ago I started reading this title and thought Pedo, was not wrong. permalink award report block reply SnowSnake 1 points 5 days ago Scaphism. permalink award report block reply BidensfullAFdiaper 1 points 5 days ago So fucking ugly. permalink award report block reply hairless_ap3 1 points 5 days ago People voted for it permalink award report block reply TheLeftIsAntiRight 1 points 5 days ago IMAGINE MY SHOCK permalink award report block reply GTHAYS 1 points 5 days ago Before you tried to pull off this look, you should have invested heavily in \"The Hair Club for Men\".  Just saying. permalink award report block reply PhantomShield72 1 points 5 days ago When you're a \"woman\" - male pattern baldness is a real bitch... permalink award report block reply knnbccb 1 points 5 days ago These creatures should not even be allowed to vote, much less become a 'legislator'. permalink award report block reply Justjayce 0 points 5 days ago I think the Muslims have the penalty right permalink award report block reply USNVET71 -5 points 5 days ago These people are mentally ill pedophile rapist, fucking losers and now they're in positions of authority. permalink award report block reply\nAwShitHereWeGoAgain 24 points 5 days ago Woodchipper. permalink award report block reply tooanalytical 6 points 5 days ago Feet first, on the slowest setting. permalink parent award report block reply AwShitHereWeGoAgain 2 points 5 days ago Your terms are acceptable. permalink parent award report block reply\ntooanalytical 6 points 5 days ago Feet first, on the slowest setting. permalink parent award report block reply AwShitHereWeGoAgain 2 points 5 days ago Your terms are acceptable. permalink parent award report block reply\nAwShitHereWeGoAgain 2 points 5 days ago Your terms are acceptable. permalink parent award report block reply\n19American62Woman 12 points 5 days ago Millstone and done permalink award report block reply\ntralbolh 11 points 5 days ago former transgender New Hampshire state legislator should that be \"transgender former New Hampshire state legislator\"? Is the perp a former legislator, formerly transgender, both? Would only be half surprised if some states actually had a position of \"transgender state legislator\". Guess the news headline GWP screenshotted makes it clearer, currently transgender and a former legistlator In 2023, Laughton, 41, of Nashua, New Hampshire, and his former intimate partner and daycare worker, Lindsay Groves, were charged with child exploitation. Another confusingly worded former, one would hop Groves was terminated, and perhaps was. Groves admitted to taking sexually explicit photos of children at the daycare center and sending them to Laughton. Laughton was charged with one count of sexual exploitation of children – and aiding and abetting, according to the DOJ. “According to the charging documents, a preliminary forensic review of Groves’ cellphone allegedly revealed over 10,000 text messages between Laughton and Groves that included discussion about, and transfer of, explicit photographs that Groves had taken of children while employed at Creative Minds daycare – including at least four sexually explicit images of children who appear to be approximately three to five years old, as well as explicit descriptions of sex with each other and others, including children ,” the DOJ said. Sounds like they should be interviewing children for multiple rape charges instead of settling for single child abuse and child pornography charge. 15 years and up to 30 years in prison, at least five years 15 years, with good prison behavior and parole could be out in a third, which makes the 5 years.  Keep looking into a rape charge, it sounds like they committed them. They need to be kept away. permalink award report block reply 16BeatsAOne 1 points 5 days ago former transgender mentally ill man New Hampshire state legislator Fixed it. permalink parent award report block reply\n16BeatsAOne 1 points 5 days ago former transgender mentally ill man New Hampshire state legislator Fixed it. permalink parent award report block reply\nBaronFalcon 8 points 5 days ago Groomers, all of them. permalink award report block reply\nBillGateCanSuckIt 6 points 5 days ago That's an ugly pizza hut permalink award report block reply anotherthing 2 points 5 days ago Buffalo Bill passed better. permalink parent award report block reply makenomistake 1 points 5 days ago </>thread permalink parent award report block reply\nanotherthing 2 points 5 days ago Buffalo Bill passed better. permalink parent award report block reply\nmakenomistake 1 points 5 days ago </>thread permalink parent award report block reply\nCOLDWARPATRIOT55 3 points 5 days ago Former transgender or former state legislator? permalink award report block reply Johnkimble111 3 points 5 days ago There’s no such thing as “transgender” permalink parent award report block reply\nJohnkimble111 3 points 5 days ago There’s no such thing as “transgender” permalink parent award report block reply\nTGNX 2 points 5 days ago Every time. permalink award report block reply\nBeeboy 2 points 5 days ago That's demoRATS for you!!! Satanic permalink award report block reply\nPearlyGaits57 2 points 5 days ago To the GALLOWS. \"OFF WITH IT'S HEAD\" \"former transgender\" I love how they can proclaim to be a woman when biologically they are male, one day, then just say, \"oh I don't like this that I have chosen for myself\" I think I want to be a man again. WTF! permalink award report block reply\nMegabrain1960 2 points 5 days ago Let him be Jonathan Watson's next cellmate. https://www.fox32chicago.com/news/report-prisoner-confesses-to-killing-2-child-molesters permalink award report block reply\nSALTY-OGRE 2 points 5 days ago MILLSTONE permalink award report block reply\njiujiujiu 1 points 5 days ago Men pretending to be women is extreme human degeneracy and forcing people to enable it is an exercise in mass humiliation. permalink award report block reply\nschiff_for_brains 1 points 5 days ago He's no longer transgender? permalink award report block reply\nNow_On_to_Mars 1 points 5 days ago I started reading this title and thought Pedo, was not wrong. permalink award report block reply\nSnowSnake 1 points 5 days ago Scaphism. permalink award report block reply\nBidensfullAFdiaper 1 points 5 days ago So fucking ugly. permalink award report block reply\nhairless_ap3 1 points 5 days ago People voted for it permalink award report block reply\nTheLeftIsAntiRight 1 points 5 days ago IMAGINE MY SHOCK permalink award report block reply\nGTHAYS 1 points 5 days ago Before you tried to pull off this look, you should have invested heavily in \"The Hair Club for Men\".  Just saying. permalink award report block reply\nPhantomShield72 1 points 5 days ago When you're a \"woman\" - male pattern baldness is a real bitch... permalink award report block reply\nknnbccb 1 points 5 days ago These creatures should not even be allowed to vote, much less become a 'legislator'. permalink award report block reply\nJustjayce 0 points 5 days ago I think the Muslims have the penalty right permalink award report block reply\nUSNVET71 -5 points 5 days ago These people are mentally ill pedophile rapist, fucking losers and now they're in positions of authority. permalink award report block reply"}