{"id": "1ARK9pg93R", "contents": "944 80% of H-1B approvals are for ENTRY LEVEL JOBS posted 4 hours ago by FuckAllDemocrats 150 comments award share report block Still Boneless @still_boneless • 13h 80% of H-1B approvals are for ENTRY LEVEL JOBS This is not just a scam, it is a scandal. Spitting in the face of the American people. Cernovich @Cernovich • 14h The H-1B scam.\n150 comments Sort by Top Top New Worst Old Save Brandon1776 96 points 4 hours ago Now, now, now, I've been told by shills for days that they are less than 3% of the blah, blah, blah America Only or GTFO permalink award report block reply zigZag590 69 points 3 hours ago It's clear that Trump only cares about stock market going up and GDP going up. He, like most boomers, don't really give a fuck that the younger generations can't afford homes or to start families. He has completely sold out MAGA. permalink parent award report block reply Here_we_go 28 points 3 hours ago I was just going to say this. Its all about the stock market to him. Hope it fucking nosedives. Maybe then he will understand about the real economy. permalink parent award report block reply RedWizard 11 points 2 hours ago Go back to the 20's when stock market gains outpaced company performance. Look at our major indices and tell me we're not in a massive bubble today. permalink parent award report block reply yeptheguy 5 points 2 hours ago You can't discount the money supply. Compare the stock market to gold. The thing losing is the dollar. permalink parent award report block reply NonbinaryPotatohead 3 points 34 minutes ago he and melania did launch 2 crypto scams...\"line go up\", well at least for them it did they collected a few billion as they profited off of each trade which resulted in severe losses for those who bought permalink parent award report block reply Tigrboy1 1 points 19 minutes ago Private Company management is driven by stock price appreciation. The goal is to have appreciating profits in short term as there are quarterly reports. One easy way to get there is to hire H1b. We all cheer when our 401k portfolio shows double digit gains. Can only happen with technology change that replaces workers or getting slave labor. You get AI and H1b replacing workers. My 401 K has healthy gains though. Yaay permalink parent award report block reply Klown_Kutz 10 points 3 hours ago It's not that boomers don't give a fuck.  What we have is what they want.  The whole mindset of that awful generation is that they don't want anyone else to have what they did. permalink parent award report block reply Pissonit 9 points 3 hours ago So your saying a boomer wouldn't want their kids to succeed in life, have a good job, start a family, buy their own home instead of having to live with their parents the rest of their lives....is that what boomers want? permalink parent award report block reply FatigueIsReal 12 points 2 hours ago This is correct, but you're off at the end. The vast majority of boomers want their kids to take care of them rather than take care of their kids. They don't want their kids to live with them.  That would mean taking care of them. They simply don't lift a finger to help their kids get ahead. They have no concept of legacy or passing things down to the next generation. They sit in positions at businesses until they are forced out instead of getting out of the way. They spend their money on toys and vacations instead of setting up trust funds. permalink parent award report block reply view 3 more comments... TheTelltaleFly 11 points 2 hours ago That’s certainly what’s borne out by their actions. permalink parent award report block reply Klown_Kutz 4 points 53 minutes ago For my entire 54 years, I have watched boomers try to hold others back. permalink parent award report block reply someguy7738 3 points 1 hour ago Judging by my own parent's actions... That's a definite maybe. In any case, they're at the very least indifferent to their children's success. permalink parent award report block reply breathittbill -1 points 54 minutes ago I would say it’s not all boomers. It’s the boomer politicians that are greedy and self absorbed. It’s also the location where they are. Boomers that aren’t living on either coast think different from the ones in the rest of America. That’s why Nancy P said middle America is fly over country. permalink parent award report block reply Klown_Kutz 1 points 30 minutes ago Boomers as a generation inherited so much and they have spent their lives and careers making sure that no one else would enjoy what they had handed to them. permalink parent award report block reply Wexit-Delecto 0 points 33 minutes ago When people shit-talk zoomers, the zoomers here don't chime in with \"nuh uh! not all zoomers!\" They laugh along at their gay generation. But for some reason, the boomers are incapable of doing this. permalink parent award report block reply view 5 more comments... RizzlieDoodad 8 points 3 hours ago Trump is not America first. We are Christ first and America first. permalink parent award report block reply Elencher 7 points 2 hours ago I know why you’re downvoted but you’re 100% correct. There is no way to reconcile his recent interviews with America first. permalink parent award report block reply RizzlieDoodad 6 points 2 hours ago I get it. But I don't care about updoots or downdoots. It's reddit stupidity. This site is a super pro Trump board. I've been here since r/The_Donald. Trump is a boomer and his solutions are boomer solutions. Those solutions and ideas got us into the situation we're in. It's time to look forward to someone who will actually be America first. permalink parent award report block reply view 2 more comments... RizzlieDoodad 6 points 1 hour ago Trump is not America first. This is America last policies permalink parent award report block reply Burneraccountno4 6 points 2 hours ago I hate to admit it but you are right. I had hoped he learned his lesson after he let shit shit slide in his first term and was rewarded with a stolen election and them trying to kill and bankrupt him. Yet here we are. permalink parent award report block reply Wexit-Delecto 1 points 28 minutes ago I can't imagine thinking \"I'm going to just go easy on the people who tried to have me publicly shot.\" The news all showed up for that speech. That one reporter was front and centre taking pictures of President Trump's head in burst mode and caught the bullet. They wanted images of President Trump's head exploding like Charlie Kirk's neck, broadcast all around the world for everyone to see what happens when you oppose them. And now he's just going to pull the punch? It's simply not a credible version of events. I don't believe President Trump has turned on MAGA. I could believe he's been threatened and somehow brought into submission, but I don't believe it's betrayal. I don't think he would want MAGA to blindly follow him back into the globalist flock, he would want MAGA to stick to its principles and make America great again, with or without him. permalink parent award report block reply load 11 more comments... JoesNoseKnows 7 points 2 hours ago If they're \"only\" 3% then they must've all moved to the most expensive parts of the towns around San Jose, CA or Austin, TX (and many others) cause towns like Sunnyvale or Leander are basically 80% Indian - making them even more expensive. Walk through Sunnyvale downtown and play \"spot the white family\", you'll lose permalink parent award report block reply DeportThemAllForever 2 points 39 minutes ago Never been, but I imagine those places you describe look like old southern slave farms.  In 1800s it was 1 farm owner family and few hundred negro slaves.  Now it’s one boss and 100 Indian foreign laborers. Rest of the country starting to look same, we sadly not far behind.  Here comes your everyday contractor builder landscaper with 50 Mexican illegals who will work for cheaper.  Can definitely play spot the white family game. permalink parent award report block reply Wexit-Delecto 1 points 24 minutes ago It is tactically unsound to be that badly outnumbered. permalink parent award report block reply Viewer01 5 points 2 hours ago Here is the only truth I’ll say to this comment.\nIt’s dei. Colleges have cranked out millions of incompetents that either underperform or simply leave the field. Thus creating a shortage due to all the white males displaced. However, this is maybe 25-30% of the problem. Companies are 100% using jeets to suppress wages. Which makes it an impossible situation politically you can’t come out and say browns are retarded and we need more white men in college. So Trump chickens out and sells us down the river to jeets rather than be racist. permalink parent award report block reply TheRedPike 3 points 1 hour ago Companies are 100% using jeets to suppress wages. It's not even that.  They have so entrenched themselves that jeets will do anything to hire more jeets at full price.  IT has become a metastasizing cancer. permalink parent award report block reply Cuetardian 3 points 54 minutes ago It’s dei. Colleges have cranked out millions of incompetents that either underperform or simply leave the field. Thus creating a shortage due to all the white males displaced. This right here explains the deliberate destruction of the U.S. and European college system. It was done because it left the door wide open to say, \"Gosh, we just can't find any good workers . . . we have no choice but to import them by the thousands from foreign countries.\" It was all intentional. All of it. permalink parent award report block reply NotYourMan 2 points 1 hour ago H1B-visas should be for highly skilled workers who had true value to a company.  Entry level positions should go to Americans.  When working for high-tech companies I noticed all the H1B-visa employees where right out of school.  The ones I knew graduated from ASU which was a hotbed of international students and they could get their tuition paid by the US government.  This is why GenZ and Millennials can't get good high-tech jobs.  Cancel all H1B-visas because its corrupt. permalink parent award report block reply BooKoo 1 points 21 minutes ago Guys you forget - these are very talented people.  You can't find people like this here in America. permalink parent award report block reply load 2 more comments... newuser8 72 points 4 hours ago Trump not listening to Miller and not ending H1B and all the other Indian scam visas is a major blunder. I won't forget it. permalink award report block reply Here_we_go 31 points 3 hours ago Giving our childrens inheritance to America (their born right) away to street shitters and commie spies for the fucking stock market. permalink parent award report block reply invalid_data 12 points 2 hours ago Trump has Vance in his ear who is sympathetic to india. permalink parent award report block reply Wexit-Delecto 1 points 23 minutes ago You mean the guy who had regular jobs like you and I could get until one day he woke up and decided to become a wealthy venture capitalist? (I am asking \"how did he get rich?\") permalink parent award report block reply jatergator 1 points 2 hours ago Did everyone forget that he did effectively end the program for low level H1-Bs? No company is going to pay $100k on top of the salary for low level positions. permalink parent award report block reply Brakesbreaktrains2 7 points 1 hour ago 100k once. Not annually and so they absolutely will permalink parent award report block reply Tigrboy1 0 points 50 minutes ago Not for entry level jobs. The visa is only good for three years and you have two pay $100,000 to renew it again. This if properly enforced effectively ends abuse of H1 B visa. permalink parent award report block reply ImYourHuckleberry24 2 points 40 minutes ago \"Properly enforced\" LMFAO! permalink parent award report block reply Wexit-Delecto 1 points 20 minutes ago you have two pay $100,000 to renew it again This should be true but it isn't. The $100k is one time. So if a company can save $100k over three years hiring a jeet over an American (the equivalent of hiring at $100k instead of $140k for three years), they will. Americans, and Westerners generally, shouldn't have to compete with the entire second and third world for jobs in our own countries. permalink parent award report block reply CocaineNewsome 56 points 4 hours ago Apparently we are too dumb to do low level desktop support and be junior developers. We need to be trained by superior jeets on how to do the needful. Both parties say so. permalink award report block reply zigZag590 38 points 3 hours ago Only thing we are capable of doing is dying for Israel and keeping Israel safe as a Jewish ethnostate. permalink parent award report block reply Nancys_drooping_eye 21 points 3 hours ago You're forgetting all the other perks of that job like boomers saying \"thank you for your service\" as they throw their pocket change into your tin cup after losing your legs to an IED. permalink parent award report block reply Spicy_cat 9 points 3 hours ago You know they're too greedy to part with their pocket change permalink parent award report block reply Nancys_drooping_eye 5 points 3 hours ago I didn't say ALL of their pocket change.   Of course the nickels, dimes, and quarters are going into the jar when they get home. permalink parent award report block reply view 1 more comments... AssPhixEAtion627 2 points 33 minutes ago Boomers sound a bit jewish. No wonder theyre all in isreals ass permalink parent award report block reply zigZag590 6 points 2 hours ago Now that you've lost your legs to an IED, it's time you pull yourself up by your own bootstraps, you lazy millennial! permalink parent award report block reply Viewer01 2 points 2 hours ago Yea but when a white guy tips poor portonoy he gets arrested. permalink parent award report block reply Wexit-Delecto 2 points 19 minutes ago Lol permalink parent award report block reply LearnAboutRoaches 1 points 2 hours ago .. Which, of course, is all Trumps fault too lol. permalink parent award report block reply Here_we_go 3 points 3 hours ago I need to know if Trump allowed those koreans back into the country to make those batteries, because it sounds like he did. permalink parent award report block reply ModernKnight 21 points 3 hours ago Not just junior developer type jobs... things like almost 43,000 assistant professors.  Over 57,000 \"business analysts.\"  Over 20,000 accountants.  Almost 37,000 \"consultants.\"  Almost 15,000 managers.  All sorts of things we don't need street shitters for. https://h1bgrader.com/job-titles#All permalink parent award report block reply CocaineNewsome 7 points 3 hours ago I got a kick out of 7-11 clerks in one doc. permalink parent award report block reply Here_we_go 5 points 3 hours ago And gas station attendant. permalink parent award report block reply Nitrenes 2 points 33 minutes ago Universities love Chinese and Indian professors. Why? Because they partner with others from their home countries, and those they partner with are desperate to come here, the result being scads of publications and a potential ticket to ride. permalink parent award report block reply hatredcopter 1 points 1 minute ago Business analyst is not a title you should be putting into quotes. permalink parent award report block reply rebuildingMyself 17 points 3 hours ago Even the \"they are here to train us\" talking point is pure cope. They are here to replace us and make us pay for their welfare permalink parent award report block reply CocaineNewsome 4 points 3 hours ago Ye, I never even saw that. The battery koreans example was the first and only time it ever came up. permalink parent award report block reply rebuildingMyself 4 points 3 hours ago That should be a special class of visa, imo. Explicitly here to train Americans on a valuable skill then leave after. H1B can be completely dismantled since it's here specifically to replace Americans with cheaper labor. permalink parent award report block reply Here_we_go 3 points 3 hours ago I need to know if Trump allowed those koreans back into the country to make those batteries, because it sounds like he did. permalink parent award report block reply Populistdeplorable 2 points 3 hours ago Now they are suing us. permalink parent award report block reply Tigrboy1 1 points 4 minutes ago The reality is computer skills are not that glamorous when you realize that coding skills you have spent last two years learning are completely outdated in 4-6 years and you have to learn new upcoming languages in your spare time or be replaced by new wave of workers in six years. As a former code writer, I was too lazy to do that as I needed work life balance. I changed professions. Most here shitting on Trump are clueless about realities of a coding job. Your skill set has a lifespan of 6 years tops. permalink parent award report block reply DiamondDroid 31 points 4 hours ago H-1Bs are the Covid scam of this term. Evil advisors and operatives misleading Trump. And I fear he is too proud to beleive or admit he is being duped. permalink award report block reply newuser8 23 points 4 hours ago All he needs to do is listen to Miller permalink parent award report block reply Roadpower 18 points 4 hours ago His ego and his lust to make a buck is the undoing of us all and it is funny that you mention COVID in this because Trump was completely sold out to big pharma (including his boomer stupidity) which is how we got Operation Warp Speed. April 19 2017\nTrump’s inaugural committee raised a record $106.7 million — here’s who donated https://www.cnbc.com/2017/04/19/trumps-inaugural-committee-raised-a-record-106-7-million--heres-who-donated.html March 10, 2017\nTrump chooses Gottlieb to run FDA; Pharma breathes sigh of relief (and see additional note below) https://www.reuters.com/article/world/trump-chooses-gottlieb-to-run-fda-pharma-breathes-sigh-of-relief-idUSKBN16H2AW/ April 19, 2017\nWith Drug Costs In Crosshairs, Health Firms Gave Generously To Trump’s Inauguration https://kffhealthnews.org/news/with-drug-costs-in-crosshairs-health-firms-gave-generously-to-trumps-inauguration/ 11/13/2017\nTrump picks ex-pharma executive Azar to lead HHS https://www.politico.com/story/2017/11/13/alex-azar-hhs-secretary-trump-244837 January 04 2023\nPfizer board member Scott Gottlieb leaned on Twitter to censor tweets which argued against vaccine passports and claimed natural immunity was stronger than the shot, latest Twitter files dump reveals https://www.dailymail.co.uk/health/ar permalink parent award report block reply DiamondDroid -4 points 3 hours ago Ego yes. But \"his lust to make a buck\" is the most retarded faggot bullshit you could say. Stop listening ingredients to the libtards, glomo talking points and the media propagandists. permalink parent award report block reply Roadpower 8 points 3 hours ago I bought the receipts, ignore them at your own peril. From the first link. (And remember, if they lied Trump would have sued them and they would have retracted the story.) Trump’s inaugural committee raised a record $106.7 million — here’s who donated Sheldon Adelson, a casino magnate and major Republican donor, gave $5 million Major corporations including Bank of America, Boeing, Pfizer, Qualcomm and Dow Chemical all contributed more than $1 million Details are in the article. permalink parent award report block reply TheRedPike 1 points 1 hour ago Sheldon Adelson Nice.  He found a way to write checks in his grave.  I'm surprised he isn't a democrat. permalink parent award report block reply Kraken_V_Algorithm -5 points 3 hours ago Those aren't receipts, you're just retarded.  Those are picks he made way before COVID, like hundreds of other picks he made on the advice of others.  Nothing to do with greed.  More to do with not having enough good people to trust in DC. permalink parent award report block reply view 1 more comments... PdwH4tesMAGA 3 points 1 hour ago Evil advisors and operatives misleading Trump. Such a clown excuse at this point. Either you are claiming he is incapable of exercising any agency of his own or he is in on it and hates you as much as the rest of the globalists. permalink parent award report block reply bluedevilga 26 points 4 hours ago Yes, because the bildeburg faggots and the WEF perverts want our men to be absolutely demoralized and become fentanyl addicts. We know this because they know who the women will vote for permalink award report block reply Female 10 points 4 hours ago yeh schlossberg permalink parent award report block reply DeepFrozenOcean 20 points 4 hours ago Think about all the amazing people we're stealing away from their poor poor shithole countries. We could improve those countries overnight if we just stopped this evil practice of \"brain drain\". They could be building skyscrapers and flying cars in their own countries, but no, we have to give them second-class status and pay them slave wages for their incredibly skilled work, instead of developing our own talent. permalink award report block reply ParticleCannon 10 points 3 hours ago The bleeding heart \"we must save the third world\" angle tends to avoid thinking about this. If we're taking the most talented and resourceful people from a country, what's left? permalink parent award report block reply DeepFrozenOcean 5 points 2 hours ago This is why Mexicans don't place in the Olympics. Anyone that can run, swim, or jump, they're already here. permalink parent award report block reply Wexit-Delecto 1 points 17 minutes ago Turns out you can't build a country out of foreign runners, jumpers, and joggers though. permalink parent award report block reply Trajano 3 points 2 hours ago No brain has been drained. permalink parent award report block reply Klown_Kutz 18 points 3 hours ago Oh great.  Are we in for a repeat of last year's bullshit from Vivek and the boomercons telling us to drive $50 cars and dumpster dive for food? permalink award report block reply blobbo123 12 points 3 hours ago Apply the 100k fee to all H1B's annually. If they are so critical, then companies should have no problem paying this. permalink award report block reply Burneraccountno4 4 points 60 minutes ago Did you see the exemption for foreign student visas holders in the USA transitioning to H1Bs when they graduate? All the fee does is encourage companies to hire their h1b slave labor from a local university. permalink parent award report block reply Trajano 4 points 2 hours ago That it is the solution. 100% agree. permalink parent award report block reply NonbinaryPotatohead 2 points 37 minutes ago Just get rid of H1B's or all of the higher paying positions will be flooded with H1B's. All of the C suite positions that can afford the 100k one time fee. permalink parent award report block reply ImYourHuckleberry24 1 points 34 minutes ago It's NOT annual permalink parent award report block reply rupok2 11 points 3 hours ago H1b removal is a bipartisan issue even the liberals in tech hate them but somehow both parties don't push to end it and similar visas. Only indian street shitters support it. Just another way you can tell government is extremely out of touch. permalink award report block reply TheTelltaleFly 8 points 2 hours ago Not out of touch, controlled by tech billionaires. Trump hosted Mark Zuckerberg for dinner at the White House, even after Mark Zuckerberg spent $400 million stealing the 2020 election from him. And banned him from Facebook. Bill Gates was there too. What chance do we have? permalink parent award report block reply Spicy_cat 5 points 3 hours ago Can the states pass laws where if you hire an H1B for an entry level position it's considered fraud? permalink parent award report block reply bluewhiteandred 1 points 2 hours ago idk but boycotting h1b companies could be a thing permalink parent award report block reply Spicy_cat 2 points 1 hour ago So like... all of them https://www.uscis.gov/tools/reports-and-studies/h-1b-employer-data-hub permalink parent award report block reply RizzlieDoodad 8 points 3 hours ago Usury, speeding up naturalization of immigrants, and adding 6x Chinese students because otherwise colleges that hate us and him will go out of business. Ok boomer permalink award report block reply PdwH4tesMAGA 0 points 59 minutes ago Trump is the great betrayer and this place will still simp for him. permalink parent award report block reply TPMJB 7 points 3 hours ago You don't understand! We don't have the unwashed talent that gets their degrees from diploma mills here! We NEED H1B slaves! permalink award report block reply IvIA6A 6 points 2 hours ago The streets aren't going to shit themselves permalink award report block reply SteelDriver 6 points 2 hours ago There has never been a tech worker shortage (or a tech worker talent deficit).  There has only ever been a cheap tech worker shortage.  Big businesses still like their indentured servitude (which is also why they like illegal immigration). permalink award report block reply GeorgeBailey 6 points 2 hours ago Yeah, but we need them because Americans aren’t talented enough to do entry-level jobs. Indians are much more talented at those jobs. <— I think that’s what Trump was saying to Laura Ingram the other day. permalink award report block reply NonbinaryPotatohead 1 points 36 minutes ago I couldn't believe he said that. Feels like Biden levels of gaffes recently. permalink parent award report block reply PatriotDescendant 6 points 3 hours ago We have thousands of them at my company (Dallas). Most are wonderful people, individually. Collectively, they are a pestilence! permalink award report block reply realPixelDust 4 points 2 hours ago You see that plus sign? It is way fucking worse than 80%. permalink award report block reply YellowstoneJoe 4 points 3 hours ago Now that is a big problem. Wouldn't the $100k per year fee fix this? permalink award report block reply Truthisunpopular 8 points 3 hours ago That 100k proposal is not per year it's a one time fee that is easily recovered within a couple of years when you consider how much employers save by paying extremely low wages to foreign garbage compared to what the job should pay if a citizen were hired. Also, they don't have to pay the 100k for the already existing h1-b's. permalink parent award report block reply Burneraccountno4 3 points 49 minutes ago It also doesn't apply to student visa holders in the USA transitioning to H1Bs upon graduation. Indians will just register for courses at some shit tier American University to get around the fee. The fee is really just a gift to shit tier American universities and colleges that couldn't survive without charging international tuition rates. Trump basically said as much the other day. permalink parent award report block reply Truthisunpopular 2 points 44 minutes ago What a complete clusterfuck. The more you learn, the more tiresome it all becomes. permalink parent award report block reply learntocode 3 points 2 hours ago This is the exact opposite of securing a future for our children. permalink award report block reply unitedspeedalarm 3 points 1 hour ago The master class has made so much money that they don't need to care about the working man anymore. You and your kids better pay your rent on time. permalink award report block reply Throwingway22 3 points 2 hours ago America doesn't have the talent for entry level. We should be flinging feces at each other and calling it a festival. permalink award report block reply jiujiujiu 2 points 2 hours ago They want high level intellect while paying the lowest wage possible. Make. It. Illegal. permalink award report block reply Greenhills 2 points 2 hours ago I wish there was just some way we could figure out how to deradicalize college grads. Some way? Hmm. permalink award report block reply MegoThor 2 points 31 minutes ago “How much shit do you want with your fries, saar?” permalink award report block reply Wexit-Delecto 1 points 14 minutes ago With jeets the shit is complementary and comes with every meal. permalink parent award report block reply Wiggle-Hard 2 points 1 hour ago What immigrants dont replace ai will, we are fucked and unless trump both ends h1b and regulates ai in a way that takes the insane profits companies will make and pay them back to the tax payer in some way, you’ll have a nation of jobless youth voting AOC in 2028 permalink award report block reply Wiggle-Hard 2 points 51 minutes ago The reality is, the tech industry, engineering, trucking, management, walmart, and several other employers now belong to immigrants and ai permalink award report block reply ravonaf 2 points 2 hours ago This is why you see the same jobs over and over on job sites. No matter how many people apply, the same job sits there for months. They are telling the government these jobs can't be filled. When in reality, they are letting them sit empty as justification to bring in H1B workers who work for half the price of Americans. permalink award report block reply bluewhiteandred 2 points 2 hours ago \"scam and scandal\" well, idk if I would describe it like that, but let's break down what's happening these jobs can be done for cheaper by non-Americans. So the companies want to save a buck by either importing cheaper labor or offshoring operations to somewhere else. This is felt to be a win-win for the company that saves costs on labor and for the laborer from another country that makes more money than the would otherwise. It can also be a win for us if it enables us to do other work for higher pay But then some problems come in: if they import the labor like with h1bs, they're also importing those cultures and politics. We're kind of coming to an agreement that doesn't work very well Offshoring the jobs also hasn't necessarily worked since those jobs weren't necessarily replaced with higher paying jobs; greedy corps simply pocketed the money that would have otherwise been paid \"more\" to middle class working Americans Also, you can create this highly dependent global economic situation, where say the third world could grow all our food while the 1st world builds computers and machines to help them grow it. However, if they decided they didn't want to sell us food that we depend on them for (for example), then we would have a national security issue of getting access to food. So, there probably needs to be a balance and backup plans when we offshore jobs (if we're going to do so) if trades don't work out. Alternatively people could be poorer but more self-sufficient and self-sufficient as a country / nation. So Trump is getting lost in some of these economic considerations, either he needs to bring about better jobs for the manufacturing jobs that get outsourced, or to maybe discourage companies from sending jobs overseas at something of a loss to their \"bottom line\" (it will probably cost more in labor) edit: so a \"profits first\" policy, not necessarily a scam or scandal so much as not \"america first\" edit 2: so another way some economic pull could be exerted is by identifying companies that make use of h1bs and organizing boycotts or advertising their company policies for people to make a stir about permalink award report block reply Wiggle-Hard 2 points 1 hour ago Reality time The technology and warehousing industries have seen the most layoffs, largely driven by AI integration, cost-cutting, and shifting consumer demand. Other sectors like retail and government have also experienced significant job cuts, with year-to-date totals in these areas exceeding those from the previous year.\nLeading industries by layoff numbers\nTechnology: This sector continues to lead in layoffs, with job cuts attributed to AI integration, slower demand, and a focus on efficiency. For the year 2025, tech firms have announced over 141,000 job cuts.\nWarehousing: This industry had the highest number of layoffs in a single month (October 2025) and has seen a dramatic increase in year-to-date job cuts compared to 2024.\nRetail: This sector is still facing pressure due to shifting consumer habits, rising costs, and ongoing store closures. Year-to-date job cuts are up significantly from the previous year.\nGovernment: This sector has announced the most layoffs year-to-date, exceeding the total for the entire year of 2024.\nServices: The services sector, which includes companies providing support services, has also seen an increase in job cuts compared to 2024.\nDriving factors for layoffs\nAI integration: The adoption of AI is a major factor, as companies restructure to take advantage of new efficiencies.\nCost-cutting and efficiency: Companies are tightening their belts in response to rising costs and softer consumer and corporate spending.\nShifting demand and store closures: The retail sector, in particular, is navigating changing consumer habits, leading to store closures and job cuts. permalink award report block reply mohel 2 points 2 hours ago Why is everything, the government does, a scam? permalink award report block reply GeneticsGuy 1 points 31 minutes ago Software dev here. Literally every Indian H1-B job hire I ever met was here taking jobs from Americans and were generally worse at their jobs. permalink award report block reply Steve56775 1 points 18 minutes ago We are Full. Until 40 million are deported, no one comes in. permalink award report block reply NonbinaryPotatohead 1 points 40 minutes ago Remember the last 20+ years all the job postings for entry level positions had requirements of prior experience that you can only get from posted entry level position? It was because it was never for Americans! It's basically a reserved seat for foreigners. permalink award report block reply Michalusmichalus 1 points 40 minutes ago This is why vocations are where kids should be focusing. There's no reason to pay for school if companies aren't hiring Americans. permalink award report block reply jermzdeejd 1 points 40 minutes ago Then when you finally get through the door they ask for your experience when you cant get it because h1 is getting the experience. The vicious cycle continues. permalink award report block reply PillarOfWisdom 1 points 27 minutes ago Wait until you understand H-2Bs.  Those are the people the Trump and Congress are bringing and have been bringing in to replace hourly people. permalink award report block reply cbonez416 1 points 3 hours ago Didn't Trump change the vetting rules and make it cost 150k for an application to try to get in the USA? Didn't this stop all the abuse and bullshit bc it's to expensive now? It only use to cost 1000 bucks to apply!! Now it's super expensive and can't be abused for profit. permalink award report block reply Aggrieved03 1 points 3 hours ago Burger King, Walmart, Subway, gas station, etc ...... permalink award report block reply Seeker_17 1 points 2 hours ago WTF??? permalink award report block reply Wexit-Delecto 1 points 35 minutes ago Half this board wants them to keep coming, apparently. permalink award report block reply josiborg 1 points 11 minutes ago \"entry level\" https://h1bdata.info/index.php?em=publix+super+markets+inc&job=&city=&year=2025 permalink award report block reply DagneyTaggart 1 points 3 hours ago “Talent”\nIs that what we call wiping without toilet paper? permalink award report block reply MaxineWaters4Prez 1 points 34 minutes ago It's the same shit with illegals and H1Bs. They want to pay people less to do menial work. They're killing off unskilled labor (which should be a low, but liveable wage) to be done by beans and jeets for less than an American laborer. All with a nice little tax incentive attached. We're being robbed at every turn. permalink award report block reply GeneticsGuy 1 points 34 minutes ago And with the supposed AI revolution thst is going to take jobs, why are we still importing people? permalink award report block reply PedePete 1 points 10 minutes ago This H1B problem is the real issue of the moment. We CANNOT allow this to continue if we want to have a country at all! permalink award report block reply LearnAboutRoaches -4 points 4 hours ago Fake news permalink award report block reply\nBrandon1776 96 points 4 hours ago Now, now, now, I've been told by shills for days that they are less than 3% of the blah, blah, blah America Only or GTFO permalink award report block reply zigZag590 69 points 3 hours ago It's clear that Trump only cares about stock market going up and GDP going up. He, like most boomers, don't really give a fuck that the younger generations can't afford homes or to start families. He has completely sold out MAGA. permalink parent award report block reply Here_we_go 28 points 3 hours ago I was just going to say this. Its all about the stock market to him. Hope it fucking nosedives. Maybe then he will understand about the real economy. permalink parent award report block reply RedWizard 11 points 2 hours ago Go back to the 20's when stock market gains outpaced company performance. Look at our major indices and tell me we're not in a massive bubble today. permalink parent award report block reply yeptheguy 5 points 2 hours ago You can't discount the money supply. Compare the stock market to gold. The thing losing is the dollar. permalink parent award report block reply NonbinaryPotatohead 3 points 34 minutes ago he and melania did launch 2 crypto scams...\"line go up\", well at least for them it did they collected a few billion as they profited off of each trade which resulted in severe losses for those who bought permalink parent award report block reply Tigrboy1 1 points 19 minutes ago Private Company management is driven by stock price appreciation. The goal is to have appreciating profits in short term as there are quarterly reports. One easy way to get there is to hire H1b. We all cheer when our 401k portfolio shows double digit gains. Can only happen with technology change that replaces workers or getting slave labor. You get AI and H1b replacing workers. My 401 K has healthy gains though. Yaay permalink parent award report block reply Klown_Kutz 10 points 3 hours ago It's not that boomers don't give a fuck.  What we have is what they want.  The whole mindset of that awful generation is that they don't want anyone else to have what they did. permalink parent award report block reply Pissonit 9 points 3 hours ago So your saying a boomer wouldn't want their kids to succeed in life, have a good job, start a family, buy their own home instead of having to live with their parents the rest of their lives....is that what boomers want? permalink parent award report block reply FatigueIsReal 12 points 2 hours ago This is correct, but you're off at the end. The vast majority of boomers want their kids to take care of them rather than take care of their kids. They don't want their kids to live with them.  That would mean taking care of them. They simply don't lift a finger to help their kids get ahead. They have no concept of legacy or passing things down to the next generation. They sit in positions at businesses until they are forced out instead of getting out of the way. They spend their money on toys and vacations instead of setting up trust funds. permalink parent award report block reply view 3 more comments... TheTelltaleFly 11 points 2 hours ago That’s certainly what’s borne out by their actions. permalink parent award report block reply Klown_Kutz 4 points 53 minutes ago For my entire 54 years, I have watched boomers try to hold others back. permalink parent award report block reply someguy7738 3 points 1 hour ago Judging by my own parent's actions... That's a definite maybe. In any case, they're at the very least indifferent to their children's success. permalink parent award report block reply breathittbill -1 points 54 minutes ago I would say it’s not all boomers. It’s the boomer politicians that are greedy and self absorbed. It’s also the location where they are. Boomers that aren’t living on either coast think different from the ones in the rest of America. That’s why Nancy P said middle America is fly over country. permalink parent award report block reply Klown_Kutz 1 points 30 minutes ago Boomers as a generation inherited so much and they have spent their lives and careers making sure that no one else would enjoy what they had handed to them. permalink parent award report block reply Wexit-Delecto 0 points 33 minutes ago When people shit-talk zoomers, the zoomers here don't chime in with \"nuh uh! not all zoomers!\" They laugh along at their gay generation. But for some reason, the boomers are incapable of doing this. permalink parent award report block reply view 5 more comments... RizzlieDoodad 8 points 3 hours ago Trump is not America first. We are Christ first and America first. permalink parent award report block reply Elencher 7 points 2 hours ago I know why you’re downvoted but you’re 100% correct. There is no way to reconcile his recent interviews with America first. permalink parent award report block reply RizzlieDoodad 6 points 2 hours ago I get it. But I don't care about updoots or downdoots. It's reddit stupidity. This site is a super pro Trump board. I've been here since r/The_Donald. Trump is a boomer and his solutions are boomer solutions. Those solutions and ideas got us into the situation we're in. It's time to look forward to someone who will actually be America first. permalink parent award report block reply view 2 more comments... RizzlieDoodad 6 points 1 hour ago Trump is not America first. This is America last policies permalink parent award report block reply Burneraccountno4 6 points 2 hours ago I hate to admit it but you are right. I had hoped he learned his lesson after he let shit shit slide in his first term and was rewarded with a stolen election and them trying to kill and bankrupt him. Yet here we are. permalink parent award report block reply Wexit-Delecto 1 points 28 minutes ago I can't imagine thinking \"I'm going to just go easy on the people who tried to have me publicly shot.\" The news all showed up for that speech. That one reporter was front and centre taking pictures of President Trump's head in burst mode and caught the bullet. They wanted images of President Trump's head exploding like Charlie Kirk's neck, broadcast all around the world for everyone to see what happens when you oppose them. And now he's just going to pull the punch? It's simply not a credible version of events. I don't believe President Trump has turned on MAGA. I could believe he's been threatened and somehow brought into submission, but I don't believe it's betrayal. I don't think he would want MAGA to blindly follow him back into the globalist flock, he would want MAGA to stick to its principles and make America great again, with or without him. permalink parent award report block reply load 11 more comments... JoesNoseKnows 7 points 2 hours ago If they're \"only\" 3% then they must've all moved to the most expensive parts of the towns around San Jose, CA or Austin, TX (and many others) cause towns like Sunnyvale or Leander are basically 80% Indian - making them even more expensive. Walk through Sunnyvale downtown and play \"spot the white family\", you'll lose permalink parent award report block reply DeportThemAllForever 2 points 39 minutes ago Never been, but I imagine those places you describe look like old southern slave farms.  In 1800s it was 1 farm owner family and few hundred negro slaves.  Now it’s one boss and 100 Indian foreign laborers. Rest of the country starting to look same, we sadly not far behind.  Here comes your everyday contractor builder landscaper with 50 Mexican illegals who will work for cheaper.  Can definitely play spot the white family game. permalink parent award report block reply Wexit-Delecto 1 points 24 minutes ago It is tactically unsound to be that badly outnumbered. permalink parent award report block reply Viewer01 5 points 2 hours ago Here is the only truth I’ll say to this comment.\nIt’s dei. Colleges have cranked out millions of incompetents that either underperform or simply leave the field. Thus creating a shortage due to all the white males displaced. However, this is maybe 25-30% of the problem. Companies are 100% using jeets to suppress wages. Which makes it an impossible situation politically you can’t come out and say browns are retarded and we need more white men in college. So Trump chickens out and sells us down the river to jeets rather than be racist. permalink parent award report block reply TheRedPike 3 points 1 hour ago Companies are 100% using jeets to suppress wages. It's not even that.  They have so entrenched themselves that jeets will do anything to hire more jeets at full price.  IT has become a metastasizing cancer. permalink parent award report block reply Cuetardian 3 points 54 minutes ago It’s dei. Colleges have cranked out millions of incompetents that either underperform or simply leave the field. Thus creating a shortage due to all the white males displaced. This right here explains the deliberate destruction of the U.S. and European college system. It was done because it left the door wide open to say, \"Gosh, we just can't find any good workers . . . we have no choice but to import them by the thousands from foreign countries.\" It was all intentional. All of it. permalink parent award report block reply NotYourMan 2 points 1 hour ago H1B-visas should be for highly skilled workers who had true value to a company.  Entry level positions should go to Americans.  When working for high-tech companies I noticed all the H1B-visa employees where right out of school.  The ones I knew graduated from ASU which was a hotbed of international students and they could get their tuition paid by the US government.  This is why GenZ and Millennials can't get good high-tech jobs.  Cancel all H1B-visas because its corrupt. permalink parent award report block reply BooKoo 1 points 21 minutes ago Guys you forget - these are very talented people.  You can't find people like this here in America. permalink parent award report block reply load 2 more comments...\nzigZag590 69 points 3 hours ago It's clear that Trump only cares about stock market going up and GDP going up. He, like most boomers, don't really give a fuck that the younger generations can't afford homes or to start families. He has completely sold out MAGA. permalink parent award report block reply Here_we_go 28 points 3 hours ago I was just going to say this. Its all about the stock market to him. Hope it fucking nosedives. Maybe then he will understand about the real economy. permalink parent award report block reply RedWizard 11 points 2 hours ago Go back to the 20's when stock market gains outpaced company performance. Look at our major indices and tell me we're not in a massive bubble today. permalink parent award report block reply yeptheguy 5 points 2 hours ago You can't discount the money supply. Compare the stock market to gold. The thing losing is the dollar. permalink parent award report block reply NonbinaryPotatohead 3 points 34 minutes ago he and melania did launch 2 crypto scams...\"line go up\", well at least for them it did they collected a few billion as they profited off of each trade which resulted in severe losses for those who bought permalink parent award report block reply Tigrboy1 1 points 19 minutes ago Private Company management is driven by stock price appreciation. The goal is to have appreciating profits in short term as there are quarterly reports. One easy way to get there is to hire H1b. We all cheer when our 401k portfolio shows double digit gains. Can only happen with technology change that replaces workers or getting slave labor. You get AI and H1b replacing workers. My 401 K has healthy gains though. Yaay permalink parent award report block reply Klown_Kutz 10 points 3 hours ago It's not that boomers don't give a fuck.  What we have is what they want.  The whole mindset of that awful generation is that they don't want anyone else to have what they did. permalink parent award report block reply Pissonit 9 points 3 hours ago So your saying a boomer wouldn't want their kids to succeed in life, have a good job, start a family, buy their own home instead of having to live with their parents the rest of their lives....is that what boomers want? permalink parent award report block reply FatigueIsReal 12 points 2 hours ago This is correct, but you're off at the end. The vast majority of boomers want their kids to take care of them rather than take care of their kids. They don't want their kids to live with them.  That would mean taking care of them. They simply don't lift a finger to help their kids get ahead. They have no concept of legacy or passing things down to the next generation. They sit in positions at businesses until they are forced out instead of getting out of the way. They spend their money on toys and vacations instead of setting up trust funds. permalink parent award report block reply view 3 more comments... TheTelltaleFly 11 points 2 hours ago That’s certainly what’s borne out by their actions. permalink parent award report block reply Klown_Kutz 4 points 53 minutes ago For my entire 54 years, I have watched boomers try to hold others back. permalink parent award report block reply someguy7738 3 points 1 hour ago Judging by my own parent's actions... That's a definite maybe. In any case, they're at the very least indifferent to their children's success. permalink parent award report block reply breathittbill -1 points 54 minutes ago I would say it’s not all boomers. It’s the boomer politicians that are greedy and self absorbed. It’s also the location where they are. Boomers that aren’t living on either coast think different from the ones in the rest of America. That’s why Nancy P said middle America is fly over country. permalink parent award report block reply Klown_Kutz 1 points 30 minutes ago Boomers as a generation inherited so much and they have spent their lives and careers making sure that no one else would enjoy what they had handed to them. permalink parent award report block reply Wexit-Delecto 0 points 33 minutes ago When people shit-talk zoomers, the zoomers here don't chime in with \"nuh uh! not all zoomers!\" They laugh along at their gay generation. But for some reason, the boomers are incapable of doing this. permalink parent award report block reply view 5 more comments... RizzlieDoodad 8 points 3 hours ago Trump is not America first. We are Christ first and America first. permalink parent award report block reply Elencher 7 points 2 hours ago I know why you’re downvoted but you’re 100% correct. There is no way to reconcile his recent interviews with America first. permalink parent award report block reply RizzlieDoodad 6 points 2 hours ago I get it. But I don't care about updoots or downdoots. It's reddit stupidity. This site is a super pro Trump board. I've been here since r/The_Donald. Trump is a boomer and his solutions are boomer solutions. Those solutions and ideas got us into the situation we're in. It's time to look forward to someone who will actually be America first. permalink parent award report block reply view 2 more comments... RizzlieDoodad 6 points 1 hour ago Trump is not America first. This is America last policies permalink parent award report block reply Burneraccountno4 6 points 2 hours ago I hate to admit it but you are right. I had hoped he learned his lesson after he let shit shit slide in his first term and was rewarded with a stolen election and them trying to kill and bankrupt him. Yet here we are. permalink parent award report block reply Wexit-Delecto 1 points 28 minutes ago I can't imagine thinking \"I'm going to just go easy on the people who tried to have me publicly shot.\" The news all showed up for that speech. That one reporter was front and centre taking pictures of President Trump's head in burst mode and caught the bullet. They wanted images of President Trump's head exploding like Charlie Kirk's neck, broadcast all around the world for everyone to see what happens when you oppose them. And now he's just going to pull the punch? It's simply not a credible version of events. I don't believe President Trump has turned on MAGA. I could believe he's been threatened and somehow brought into submission, but I don't believe it's betrayal. I don't think he would want MAGA to blindly follow him back into the globalist flock, he would want MAGA to stick to its principles and make America great again, with or without him. permalink parent award report block reply load 11 more comments...\nHere_we_go 28 points 3 hours ago I was just going to say this. Its all about the stock market to him. Hope it fucking nosedives. Maybe then he will understand about the real economy. permalink parent award report block reply RedWizard 11 points 2 hours ago Go back to the 20's when stock market gains outpaced company performance. Look at our major indices and tell me we're not in a massive bubble today. permalink parent award report block reply yeptheguy 5 points 2 hours ago You can't discount the money supply. Compare the stock market to gold. The thing losing is the dollar. permalink parent award report block reply NonbinaryPotatohead 3 points 34 minutes ago he and melania did launch 2 crypto scams...\"line go up\", well at least for them it did they collected a few billion as they profited off of each trade which resulted in severe losses for those who bought permalink parent award report block reply Tigrboy1 1 points 19 minutes ago Private Company management is driven by stock price appreciation. The goal is to have appreciating profits in short term as there are quarterly reports. One easy way to get there is to hire H1b. We all cheer when our 401k portfolio shows double digit gains. Can only happen with technology change that replaces workers or getting slave labor. You get AI and H1b replacing workers. My 401 K has healthy gains though. Yaay permalink parent award report block reply\nRedWizard 11 points 2 hours ago Go back to the 20's when stock market gains outpaced company performance. Look at our major indices and tell me we're not in a massive bubble today. permalink parent award report block reply yeptheguy 5 points 2 hours ago You can't discount the money supply. Compare the stock market to gold. The thing losing is the dollar. permalink parent award report block reply\nyeptheguy 5 points 2 hours ago You can't discount the money supply. Compare the stock market to gold. The thing losing is the dollar. permalink parent award report block reply\nNonbinaryPotatohead 3 points 34 minutes ago he and melania did launch 2 crypto scams...\"line go up\", well at least for them it did they collected a few billion as they profited off of each trade which resulted in severe losses for those who bought permalink parent award report block reply\nTigrboy1 1 points 19 minutes ago Private Company management is driven by stock price appreciation. The goal is to have appreciating profits in short term as there are quarterly reports. One easy way to get there is to hire H1b. We all cheer when our 401k portfolio shows double digit gains. Can only happen with technology change that replaces workers or getting slave labor. You get AI and H1b replacing workers. My 401 K has healthy gains though. Yaay permalink parent award report block reply\nKlown_Kutz 10 points 3 hours ago It's not that boomers don't give a fuck.  What we have is what they want.  The whole mindset of that awful generation is that they don't want anyone else to have what they did. permalink parent award report block reply Pissonit 9 points 3 hours ago So your saying a boomer wouldn't want their kids to succeed in life, have a good job, start a family, buy their own home instead of having to live with their parents the rest of their lives....is that what boomers want? permalink parent award report block reply FatigueIsReal 12 points 2 hours ago This is correct, but you're off at the end. The vast majority of boomers want their kids to take care of them rather than take care of their kids. They don't want their kids to live with them.  That would mean taking care of them. They simply don't lift a finger to help their kids get ahead. They have no concept of legacy or passing things down to the next generation. They sit in positions at businesses until they are forced out instead of getting out of the way. They spend their money on toys and vacations instead of setting up trust funds. permalink parent award report block reply view 3 more comments... TheTelltaleFly 11 points 2 hours ago That’s certainly what’s borne out by their actions. permalink parent award report block reply Klown_Kutz 4 points 53 minutes ago For my entire 54 years, I have watched boomers try to hold others back. permalink parent award report block reply someguy7738 3 points 1 hour ago Judging by my own parent's actions... That's a definite maybe. In any case, they're at the very least indifferent to their children's success. permalink parent award report block reply breathittbill -1 points 54 minutes ago I would say it’s not all boomers. It’s the boomer politicians that are greedy and self absorbed. It’s also the location where they are. Boomers that aren’t living on either coast think different from the ones in the rest of America. That’s why Nancy P said middle America is fly over country. permalink parent award report block reply Klown_Kutz 1 points 30 minutes ago Boomers as a generation inherited so much and they have spent their lives and careers making sure that no one else would enjoy what they had handed to them. permalink parent award report block reply Wexit-Delecto 0 points 33 minutes ago When people shit-talk zoomers, the zoomers here don't chime in with \"nuh uh! not all zoomers!\" They laugh along at their gay generation. But for some reason, the boomers are incapable of doing this. permalink parent award report block reply view 5 more comments...\nPissonit 9 points 3 hours ago So your saying a boomer wouldn't want their kids to succeed in life, have a good job, start a family, buy their own home instead of having to live with their parents the rest of their lives....is that what boomers want? permalink parent award report block reply FatigueIsReal 12 points 2 hours ago This is correct, but you're off at the end. The vast majority of boomers want their kids to take care of them rather than take care of their kids. They don't want their kids to live with them.  That would mean taking care of them. They simply don't lift a finger to help their kids get ahead. They have no concept of legacy or passing things down to the next generation. They sit in positions at businesses until they are forced out instead of getting out of the way. They spend their money on toys and vacations instead of setting up trust funds. permalink parent award report block reply view 3 more comments... TheTelltaleFly 11 points 2 hours ago That’s certainly what’s borne out by their actions. permalink parent award report block reply Klown_Kutz 4 points 53 minutes ago For my entire 54 years, I have watched boomers try to hold others back. permalink parent award report block reply someguy7738 3 points 1 hour ago Judging by my own parent's actions... That's a definite maybe. In any case, they're at the very least indifferent to their children's success. permalink parent award report block reply\nFatigueIsReal 12 points 2 hours ago This is correct, but you're off at the end. The vast majority of boomers want their kids to take care of them rather than take care of their kids. They don't want their kids to live with them.  That would mean taking care of them. They simply don't lift a finger to help their kids get ahead. They have no concept of legacy or passing things down to the next generation. They sit in positions at businesses until they are forced out instead of getting out of the way. They spend their money on toys and vacations instead of setting up trust funds. permalink parent award report block reply view 3 more comments...\nTheTelltaleFly 11 points 2 hours ago That’s certainly what’s borne out by their actions. permalink parent award report block reply\nKlown_Kutz 4 points 53 minutes ago For my entire 54 years, I have watched boomers try to hold others back. permalink parent award report block reply\nsomeguy7738 3 points 1 hour ago Judging by my own parent's actions... That's a definite maybe. In any case, they're at the very least indifferent to their children's success. permalink parent award report block reply\nbreathittbill -1 points 54 minutes ago I would say it’s not all boomers. It’s the boomer politicians that are greedy and self absorbed. It’s also the location where they are. Boomers that aren’t living on either coast think different from the ones in the rest of America. That’s why Nancy P said middle America is fly over country. permalink parent award report block reply Klown_Kutz 1 points 30 minutes ago Boomers as a generation inherited so much and they have spent their lives and careers making sure that no one else would enjoy what they had handed to them. permalink parent award report block reply Wexit-Delecto 0 points 33 minutes ago When people shit-talk zoomers, the zoomers here don't chime in with \"nuh uh! not all zoomers!\" They laugh along at their gay generation. But for some reason, the boomers are incapable of doing this. permalink parent award report block reply view 5 more comments...\nKlown_Kutz 1 points 30 minutes ago Boomers as a generation inherited so much and they have spent their lives and careers making sure that no one else would enjoy what they had handed to them. permalink parent award report block reply\nWexit-Delecto 0 points 33 minutes ago When people shit-talk zoomers, the zoomers here don't chime in with \"nuh uh! not all zoomers!\" They laugh along at their gay generation. But for some reason, the boomers are incapable of doing this. permalink parent award report block reply view 5 more comments...\nRizzlieDoodad 8 points 3 hours ago Trump is not America first. We are Christ first and America first. permalink parent award report block reply Elencher 7 points 2 hours ago I know why you’re downvoted but you’re 100% correct. There is no way to reconcile his recent interviews with America first. permalink parent award report block reply RizzlieDoodad 6 points 2 hours ago I get it. But I don't care about updoots or downdoots. It's reddit stupidity. This site is a super pro Trump board. I've been here since r/The_Donald. Trump is a boomer and his solutions are boomer solutions. Those solutions and ideas got us into the situation we're in. It's time to look forward to someone who will actually be America first. permalink parent award report block reply view 2 more comments...\nElencher 7 points 2 hours ago I know why you’re downvoted but you’re 100% correct. There is no way to reconcile his recent interviews with America first. permalink parent award report block reply RizzlieDoodad 6 points 2 hours ago I get it. But I don't care about updoots or downdoots. It's reddit stupidity. This site is a super pro Trump board. I've been here since r/The_Donald. Trump is a boomer and his solutions are boomer solutions. Those solutions and ideas got us into the situation we're in. It's time to look forward to someone who will actually be America first. permalink parent award report block reply view 2 more comments...\nRizzlieDoodad 6 points 2 hours ago I get it. But I don't care about updoots or downdoots. It's reddit stupidity. This site is a super pro Trump board. I've been here since r/The_Donald. Trump is a boomer and his solutions are boomer solutions. Those solutions and ideas got us into the situation we're in. It's time to look forward to someone who will actually be America first. permalink parent award report block reply view 2 more comments...\nRizzlieDoodad 6 points 1 hour ago Trump is not America first. This is America last policies permalink parent award report block reply\nBurneraccountno4 6 points 2 hours ago I hate to admit it but you are right. I had hoped he learned his lesson after he let shit shit slide in his first term and was rewarded with a stolen election and them trying to kill and bankrupt him. Yet here we are. permalink parent award report block reply Wexit-Delecto 1 points 28 minutes ago I can't imagine thinking \"I'm going to just go easy on the people who tried to have me publicly shot.\" The news all showed up for that speech. That one reporter was front and centre taking pictures of President Trump's head in burst mode and caught the bullet. They wanted images of President Trump's head exploding like Charlie Kirk's neck, broadcast all around the world for everyone to see what happens when you oppose them. And now he's just going to pull the punch? It's simply not a credible version of events. I don't believe President Trump has turned on MAGA. I could believe he's been threatened and somehow brought into submission, but I don't believe it's betrayal. I don't think he would want MAGA to blindly follow him back into the globalist flock, he would want MAGA to stick to its principles and make America great again, with or without him. permalink parent award report block reply\nWexit-Delecto 1 points 28 minutes ago I can't imagine thinking \"I'm going to just go easy on the people who tried to have me publicly shot.\" The news all showed up for that speech. That one reporter was front and centre taking pictures of President Trump's head in burst mode and caught the bullet. They wanted images of President Trump's head exploding like Charlie Kirk's neck, broadcast all around the world for everyone to see what happens when you oppose them. And now he's just going to pull the punch? It's simply not a credible version of events. I don't believe President Trump has turned on MAGA. I could believe he's been threatened and somehow brought into submission, but I don't believe it's betrayal. I don't think he would want MAGA to blindly follow him back into the globalist flock, he would want MAGA to stick to its principles and make America great again, with or without him. permalink parent award report block reply\nJoesNoseKnows 7 points 2 hours ago If they're \"only\" 3% then they must've all moved to the most expensive parts of the towns around San Jose, CA or Austin, TX (and many others) cause towns like Sunnyvale or Leander are basically 80% Indian - making them even more expensive. Walk through Sunnyvale downtown and play \"spot the white family\", you'll lose permalink parent award report block reply DeportThemAllForever 2 points 39 minutes ago Never been, but I imagine those places you describe look like old southern slave farms.  In 1800s it was 1 farm owner family and few hundred negro slaves.  Now it’s one boss and 100 Indian foreign laborers. Rest of the country starting to look same, we sadly not far behind.  Here comes your everyday contractor builder landscaper with 50 Mexican illegals who will work for cheaper.  Can definitely play spot the white family game. permalink parent award report block reply Wexit-Delecto 1 points 24 minutes ago It is tactically unsound to be that badly outnumbered. permalink parent award report block reply\nDeportThemAllForever 2 points 39 minutes ago Never been, but I imagine those places you describe look like old southern slave farms.  In 1800s it was 1 farm owner family and few hundred negro slaves.  Now it’s one boss and 100 Indian foreign laborers. Rest of the country starting to look same, we sadly not far behind.  Here comes your everyday contractor builder landscaper with 50 Mexican illegals who will work for cheaper.  Can definitely play spot the white family game. permalink parent award report block reply Wexit-Delecto 1 points 24 minutes ago It is tactically unsound to be that badly outnumbered. permalink parent award report block reply\nWexit-Delecto 1 points 24 minutes ago It is tactically unsound to be that badly outnumbered. permalink parent award report block reply\nViewer01 5 points 2 hours ago Here is the only truth I’ll say to this comment.\nIt’s dei. Colleges have cranked out millions of incompetents that either underperform or simply leave the field. Thus creating a shortage due to all the white males displaced. However, this is maybe 25-30% of the problem. Companies are 100% using jeets to suppress wages. Which makes it an impossible situation politically you can’t come out and say browns are retarded and we need more white men in college. So Trump chickens out and sells us down the river to jeets rather than be racist. permalink parent award report block reply TheRedPike 3 points 1 hour ago Companies are 100% using jeets to suppress wages. It's not even that.  They have so entrenched themselves that jeets will do anything to hire more jeets at full price.  IT has become a metastasizing cancer. permalink parent award report block reply Cuetardian 3 points 54 minutes ago It’s dei. Colleges have cranked out millions of incompetents that either underperform or simply leave the field. Thus creating a shortage due to all the white males displaced. This right here explains the deliberate destruction of the U.S. and European college system. It was done because it left the door wide open to say, \"Gosh, we just can't find any good workers . . . we have no choice but to import them by the thousands from foreign countries.\" It was all intentional. All of it. permalink parent award report block reply\nTheRedPike 3 points 1 hour ago Companies are 100% using jeets to suppress wages. It's not even that.  They have so entrenched themselves that jeets will do anything to hire more jeets at full price.  IT has become a metastasizing cancer. permalink parent award report block reply\nCuetardian 3 points 54 minutes ago It’s dei. Colleges have cranked out millions of incompetents that either underperform or simply leave the field. Thus creating a shortage due to all the white males displaced. This right here explains the deliberate destruction of the U.S. and European college system. It was done because it left the door wide open to say, \"Gosh, we just can't find any good workers . . . we have no choice but to import them by the thousands from foreign countries.\" It was all intentional. All of it. permalink parent award report block reply\nNotYourMan 2 points 1 hour ago H1B-visas should be for highly skilled workers who had true value to a company.  Entry level positions should go to Americans.  When working for high-tech companies I noticed all the H1B-visa employees where right out of school.  The ones I knew graduated from ASU which was a hotbed of international students and they could get their tuition paid by the US government.  This is why GenZ and Millennials can't get good high-tech jobs.  Cancel all H1B-visas because its corrupt. permalink parent award report block reply\nBooKoo 1 points 21 minutes ago Guys you forget - these are very talented people.  You can't find people like this here in America. permalink parent award report block reply\nnewuser8 72 points 4 hours ago Trump not listening to Miller and not ending H1B and all the other Indian scam visas is a major blunder. I won't forget it. permalink award report block reply Here_we_go 31 points 3 hours ago Giving our childrens inheritance to America (their born right) away to street shitters and commie spies for the fucking stock market. permalink parent award report block reply invalid_data 12 points 2 hours ago Trump has Vance in his ear who is sympathetic to india. permalink parent award report block reply Wexit-Delecto 1 points 23 minutes ago You mean the guy who had regular jobs like you and I could get until one day he woke up and decided to become a wealthy venture capitalist? (I am asking \"how did he get rich?\") permalink parent award report block reply jatergator 1 points 2 hours ago Did everyone forget that he did effectively end the program for low level H1-Bs? No company is going to pay $100k on top of the salary for low level positions. permalink parent award report block reply Brakesbreaktrains2 7 points 1 hour ago 100k once. Not annually and so they absolutely will permalink parent award report block reply Tigrboy1 0 points 50 minutes ago Not for entry level jobs. The visa is only good for three years and you have two pay $100,000 to renew it again. This if properly enforced effectively ends abuse of H1 B visa. permalink parent award report block reply ImYourHuckleberry24 2 points 40 minutes ago \"Properly enforced\" LMFAO! permalink parent award report block reply Wexit-Delecto 1 points 20 minutes ago you have two pay $100,000 to renew it again This should be true but it isn't. The $100k is one time. So if a company can save $100k over three years hiring a jeet over an American (the equivalent of hiring at $100k instead of $140k for three years), they will. Americans, and Westerners generally, shouldn't have to compete with the entire second and third world for jobs in our own countries. permalink parent award report block reply\nHere_we_go 31 points 3 hours ago Giving our childrens inheritance to America (their born right) away to street shitters and commie spies for the fucking stock market. permalink parent award report block reply\ninvalid_data 12 points 2 hours ago Trump has Vance in his ear who is sympathetic to india. permalink parent award report block reply Wexit-Delecto 1 points 23 minutes ago You mean the guy who had regular jobs like you and I could get until one day he woke up and decided to become a wealthy venture capitalist? (I am asking \"how did he get rich?\") permalink parent award report block reply\nWexit-Delecto 1 points 23 minutes ago You mean the guy who had regular jobs like you and I could get until one day he woke up and decided to become a wealthy venture capitalist? (I am asking \"how did he get rich?\") permalink parent award report block reply\njatergator 1 points 2 hours ago Did everyone forget that he did effectively end the program for low level H1-Bs? No company is going to pay $100k on top of the salary for low level positions. permalink parent award report block reply Brakesbreaktrains2 7 points 1 hour ago 100k once. Not annually and so they absolutely will permalink parent award report block reply Tigrboy1 0 points 50 minutes ago Not for entry level jobs. The visa is only good for three years and you have two pay $100,000 to renew it again. This if properly enforced effectively ends abuse of H1 B visa. permalink parent award report block reply ImYourHuckleberry24 2 points 40 minutes ago \"Properly enforced\" LMFAO! permalink parent award report block reply Wexit-Delecto 1 points 20 minutes ago you have two pay $100,000 to renew it again This should be true but it isn't. The $100k is one time. So if a company can save $100k over three years hiring a jeet over an American (the equivalent of hiring at $100k instead of $140k for three years), they will. Americans, and Westerners generally, shouldn't have to compete with the entire second and third world for jobs in our own countries. permalink parent award report block reply\nBrakesbreaktrains2 7 points 1 hour ago 100k once. Not annually and so they absolutely will permalink parent award report block reply Tigrboy1 0 points 50 minutes ago Not for entry level jobs. The visa is only good for three years and you have two pay $100,000 to renew it again. This if properly enforced effectively ends abuse of H1 B visa. permalink parent award report block reply ImYourHuckleberry24 2 points 40 minutes ago \"Properly enforced\" LMFAO! permalink parent award report block reply Wexit-Delecto 1 points 20 minutes ago you have two pay $100,000 to renew it again This should be true but it isn't. The $100k is one time. So if a company can save $100k over three years hiring a jeet over an American (the equivalent of hiring at $100k instead of $140k for three years), they will. Americans, and Westerners generally, shouldn't have to compete with the entire second and third world for jobs in our own countries. permalink parent award report block reply\nTigrboy1 0 points 50 minutes ago Not for entry level jobs. The visa is only good for three years and you have two pay $100,000 to renew it again. This if properly enforced effectively ends abuse of H1 B visa. permalink parent award report block reply ImYourHuckleberry24 2 points 40 minutes ago \"Properly enforced\" LMFAO! permalink parent award report block reply Wexit-Delecto 1 points 20 minutes ago you have two pay $100,000 to renew it again This should be true but it isn't. The $100k is one time. So if a company can save $100k over three years hiring a jeet over an American (the equivalent of hiring at $100k instead of $140k for three years), they will. Americans, and Westerners generally, shouldn't have to compete with the entire second and third world for jobs in our own countries. permalink parent award report block reply\nImYourHuckleberry24 2 points 40 minutes ago \"Properly enforced\" LMFAO! permalink parent award report block reply\nWexit-Delecto 1 points 20 minutes ago you have two pay $100,000 to renew it again This should be true but it isn't. The $100k is one time. So if a company can save $100k over three years hiring a jeet over an American (the equivalent of hiring at $100k instead of $140k for three years), they will. Americans, and Westerners generally, shouldn't have to compete with the entire second and third world for jobs in our own countries. permalink parent award report block reply\nCocaineNewsome 56 points 4 hours ago Apparently we are too dumb to do low level desktop support and be junior developers. We need to be trained by superior jeets on how to do the needful. Both parties say so. permalink award report block reply zigZag590 38 points 3 hours ago Only thing we are capable of doing is dying for Israel and keeping Israel safe as a Jewish ethnostate. permalink parent award report block reply Nancys_drooping_eye 21 points 3 hours ago You're forgetting all the other perks of that job like boomers saying \"thank you for your service\" as they throw their pocket change into your tin cup after losing your legs to an IED. permalink parent award report block reply Spicy_cat 9 points 3 hours ago You know they're too greedy to part with their pocket change permalink parent award report block reply Nancys_drooping_eye 5 points 3 hours ago I didn't say ALL of their pocket change.   Of course the nickels, dimes, and quarters are going into the jar when they get home. permalink parent award report block reply view 1 more comments... AssPhixEAtion627 2 points 33 minutes ago Boomers sound a bit jewish. No wonder theyre all in isreals ass permalink parent award report block reply zigZag590 6 points 2 hours ago Now that you've lost your legs to an IED, it's time you pull yourself up by your own bootstraps, you lazy millennial! permalink parent award report block reply Viewer01 2 points 2 hours ago Yea but when a white guy tips poor portonoy he gets arrested. permalink parent award report block reply Wexit-Delecto 2 points 19 minutes ago Lol permalink parent award report block reply LearnAboutRoaches 1 points 2 hours ago .. Which, of course, is all Trumps fault too lol. permalink parent award report block reply Here_we_go 3 points 3 hours ago I need to know if Trump allowed those koreans back into the country to make those batteries, because it sounds like he did. permalink parent award report block reply ModernKnight 21 points 3 hours ago Not just junior developer type jobs... things like almost 43,000 assistant professors.  Over 57,000 \"business analysts.\"  Over 20,000 accountants.  Almost 37,000 \"consultants.\"  Almost 15,000 managers.  All sorts of things we don't need street shitters for. https://h1bgrader.com/job-titles#All permalink parent award report block reply CocaineNewsome 7 points 3 hours ago I got a kick out of 7-11 clerks in one doc. permalink parent award report block reply Here_we_go 5 points 3 hours ago And gas station attendant. permalink parent award report block reply Nitrenes 2 points 33 minutes ago Universities love Chinese and Indian professors. Why? Because they partner with others from their home countries, and those they partner with are desperate to come here, the result being scads of publications and a potential ticket to ride. permalink parent award report block reply hatredcopter 1 points 1 minute ago Business analyst is not a title you should be putting into quotes. permalink parent award report block reply rebuildingMyself 17 points 3 hours ago Even the \"they are here to train us\" talking point is pure cope. They are here to replace us and make us pay for their welfare permalink parent award report block reply CocaineNewsome 4 points 3 hours ago Ye, I never even saw that. The battery koreans example was the first and only time it ever came up. permalink parent award report block reply rebuildingMyself 4 points 3 hours ago That should be a special class of visa, imo. Explicitly here to train Americans on a valuable skill then leave after. H1B can be completely dismantled since it's here specifically to replace Americans with cheaper labor. permalink parent award report block reply Here_we_go 3 points 3 hours ago I need to know if Trump allowed those koreans back into the country to make those batteries, because it sounds like he did. permalink parent award report block reply Populistdeplorable 2 points 3 hours ago Now they are suing us. permalink parent award report block reply Tigrboy1 1 points 4 minutes ago The reality is computer skills are not that glamorous when you realize that coding skills you have spent last two years learning are completely outdated in 4-6 years and you have to learn new upcoming languages in your spare time or be replaced by new wave of workers in six years. As a former code writer, I was too lazy to do that as I needed work life balance. I changed professions. Most here shitting on Trump are clueless about realities of a coding job. Your skill set has a lifespan of 6 years tops. permalink parent award report block reply\nzigZag590 38 points 3 hours ago Only thing we are capable of doing is dying for Israel and keeping Israel safe as a Jewish ethnostate. permalink parent award report block reply Nancys_drooping_eye 21 points 3 hours ago You're forgetting all the other perks of that job like boomers saying \"thank you for your service\" as they throw their pocket change into your tin cup after losing your legs to an IED. permalink parent award report block reply Spicy_cat 9 points 3 hours ago You know they're too greedy to part with their pocket change permalink parent award report block reply Nancys_drooping_eye 5 points 3 hours ago I didn't say ALL of their pocket change.   Of course the nickels, dimes, and quarters are going into the jar when they get home. permalink parent award report block reply view 1 more comments... AssPhixEAtion627 2 points 33 minutes ago Boomers sound a bit jewish. No wonder theyre all in isreals ass permalink parent award report block reply zigZag590 6 points 2 hours ago Now that you've lost your legs to an IED, it's time you pull yourself up by your own bootstraps, you lazy millennial! permalink parent award report block reply Viewer01 2 points 2 hours ago Yea but when a white guy tips poor portonoy he gets arrested. permalink parent award report block reply Wexit-Delecto 2 points 19 minutes ago Lol permalink parent award report block reply LearnAboutRoaches 1 points 2 hours ago .. Which, of course, is all Trumps fault too lol. permalink parent award report block reply Here_we_go 3 points 3 hours ago I need to know if Trump allowed those koreans back into the country to make those batteries, because it sounds like he did. permalink parent award report block reply\nNancys_drooping_eye 21 points 3 hours ago You're forgetting all the other perks of that job like boomers saying \"thank you for your service\" as they throw their pocket change into your tin cup after losing your legs to an IED. permalink parent award report block reply Spicy_cat 9 points 3 hours ago You know they're too greedy to part with their pocket change permalink parent award report block reply Nancys_drooping_eye 5 points 3 hours ago I didn't say ALL of their pocket change.   Of course the nickels, dimes, and quarters are going into the jar when they get home. permalink parent award report block reply view 1 more comments... AssPhixEAtion627 2 points 33 minutes ago Boomers sound a bit jewish. No wonder theyre all in isreals ass permalink parent award report block reply zigZag590 6 points 2 hours ago Now that you've lost your legs to an IED, it's time you pull yourself up by your own bootstraps, you lazy millennial! permalink parent award report block reply Viewer01 2 points 2 hours ago Yea but when a white guy tips poor portonoy he gets arrested. permalink parent award report block reply Wexit-Delecto 2 points 19 minutes ago Lol permalink parent award report block reply LearnAboutRoaches 1 points 2 hours ago .. Which, of course, is all Trumps fault too lol. permalink parent award report block reply\nSpicy_cat 9 points 3 hours ago You know they're too greedy to part with their pocket change permalink parent award report block reply Nancys_drooping_eye 5 points 3 hours ago I didn't say ALL of their pocket change.   Of course the nickels, dimes, and quarters are going into the jar when they get home. permalink parent award report block reply view 1 more comments... AssPhixEAtion627 2 points 33 minutes ago Boomers sound a bit jewish. No wonder theyre all in isreals ass permalink parent award report block reply\nNancys_drooping_eye 5 points 3 hours ago I didn't say ALL of their pocket change.   Of course the nickels, dimes, and quarters are going into the jar when they get home. permalink parent award report block reply view 1 more comments...\nAssPhixEAtion627 2 points 33 minutes ago Boomers sound a bit jewish. No wonder theyre all in isreals ass permalink parent award report block reply\nzigZag590 6 points 2 hours ago Now that you've lost your legs to an IED, it's time you pull yourself up by your own bootstraps, you lazy millennial! permalink parent award report block reply\nViewer01 2 points 2 hours ago Yea but when a white guy tips poor portonoy he gets arrested. permalink parent award report block reply Wexit-Delecto 2 points 19 minutes ago Lol permalink parent award report block reply\nWexit-Delecto 2 points 19 minutes ago Lol permalink parent award report block reply\nLearnAboutRoaches 1 points 2 hours ago .. Which, of course, is all Trumps fault too lol. permalink parent award report block reply\nHere_we_go 3 points 3 hours ago I need to know if Trump allowed those koreans back into the country to make those batteries, because it sounds like he did. permalink parent award report block reply\nModernKnight 21 points 3 hours ago Not just junior developer type jobs... things like almost 43,000 assistant professors.  Over 57,000 \"business analysts.\"  Over 20,000 accountants.  Almost 37,000 \"consultants.\"  Almost 15,000 managers.  All sorts of things we don't need street shitters for. https://h1bgrader.com/job-titles#All permalink parent award report block reply CocaineNewsome 7 points 3 hours ago I got a kick out of 7-11 clerks in one doc. permalink parent award report block reply Here_we_go 5 points 3 hours ago And gas station attendant. permalink parent award report block reply Nitrenes 2 points 33 minutes ago Universities love Chinese and Indian professors. Why? Because they partner with others from their home countries, and those they partner with are desperate to come here, the result being scads of publications and a potential ticket to ride. permalink parent award report block reply hatredcopter 1 points 1 minute ago Business analyst is not a title you should be putting into quotes. permalink parent award report block reply\nCocaineNewsome 7 points 3 hours ago I got a kick out of 7-11 clerks in one doc. permalink parent award report block reply Here_we_go 5 points 3 hours ago And gas station attendant. permalink parent award report block reply\nHere_we_go 5 points 3 hours ago And gas station attendant. permalink parent award report block reply\nNitrenes 2 points 33 minutes ago Universities love Chinese and Indian professors. Why? Because they partner with others from their home countries, and those they partner with are desperate to come here, the result being scads of publications and a potential ticket to ride. permalink parent award report block reply\nhatredcopter 1 points 1 minute ago Business analyst is not a title you should be putting into quotes. permalink parent award report block reply\nrebuildingMyself 17 points 3 hours ago Even the \"they are here to train us\" talking point is pure cope. They are here to replace us and make us pay for their welfare permalink parent award report block reply CocaineNewsome 4 points 3 hours ago Ye, I never even saw that. The battery koreans example was the first and only time it ever came up. permalink parent award report block reply rebuildingMyself 4 points 3 hours ago That should be a special class of visa, imo. Explicitly here to train Americans on a valuable skill then leave after. H1B can be completely dismantled since it's here specifically to replace Americans with cheaper labor. permalink parent award report block reply Here_we_go 3 points 3 hours ago I need to know if Trump allowed those koreans back into the country to make those batteries, because it sounds like he did. permalink parent award report block reply Populistdeplorable 2 points 3 hours ago Now they are suing us. permalink parent award report block reply\nCocaineNewsome 4 points 3 hours ago Ye, I never even saw that. The battery koreans example was the first and only time it ever came up. permalink parent award report block reply rebuildingMyself 4 points 3 hours ago That should be a special class of visa, imo. Explicitly here to train Americans on a valuable skill then leave after. H1B can be completely dismantled since it's here specifically to replace Americans with cheaper labor. permalink parent award report block reply Here_we_go 3 points 3 hours ago I need to know if Trump allowed those koreans back into the country to make those batteries, because it sounds like he did. permalink parent award report block reply Populistdeplorable 2 points 3 hours ago Now they are suing us. permalink parent award report block reply\nrebuildingMyself 4 points 3 hours ago That should be a special class of visa, imo. Explicitly here to train Americans on a valuable skill then leave after. H1B can be completely dismantled since it's here specifically to replace Americans with cheaper labor. permalink parent award report block reply\nHere_we_go 3 points 3 hours ago I need to know if Trump allowed those koreans back into the country to make those batteries, because it sounds like he did. permalink parent award report block reply Populistdeplorable 2 points 3 hours ago Now they are suing us. permalink parent award report block reply\nPopulistdeplorable 2 points 3 hours ago Now they are suing us. permalink parent award report block reply\nTigrboy1 1 points 4 minutes ago The reality is computer skills are not that glamorous when you realize that coding skills you have spent last two years learning are completely outdated in 4-6 years and you have to learn new upcoming languages in your spare time or be replaced by new wave of workers in six years. As a former code writer, I was too lazy to do that as I needed work life balance. I changed professions. Most here shitting on Trump are clueless about realities of a coding job. Your skill set has a lifespan of 6 years tops. permalink parent award report block reply\nDiamondDroid 31 points 4 hours ago H-1Bs are the Covid scam of this term. Evil advisors and operatives misleading Trump. And I fear he is too proud to beleive or admit he is being duped. permalink award report block reply newuser8 23 points 4 hours ago All he needs to do is listen to Miller permalink parent award report block reply Roadpower 18 points 4 hours ago His ego and his lust to make a buck is the undoing of us all and it is funny that you mention COVID in this because Trump was completely sold out to big pharma (including his boomer stupidity) which is how we got Operation Warp Speed. April 19 2017\nTrump’s inaugural committee raised a record $106.7 million — here’s who donated https://www.cnbc.com/2017/04/19/trumps-inaugural-committee-raised-a-record-106-7-million--heres-who-donated.html March 10, 2017\nTrump chooses Gottlieb to run FDA; Pharma breathes sigh of relief (and see additional note below) https://www.reuters.com/article/world/trump-chooses-gottlieb-to-run-fda-pharma-breathes-sigh-of-relief-idUSKBN16H2AW/ April 19, 2017\nWith Drug Costs In Crosshairs, Health Firms Gave Generously To Trump’s Inauguration https://kffhealthnews.org/news/with-drug-costs-in-crosshairs-health-firms-gave-generously-to-trumps-inauguration/ 11/13/2017\nTrump picks ex-pharma executive Azar to lead HHS https://www.politico.com/story/2017/11/13/alex-azar-hhs-secretary-trump-244837 January 04 2023\nPfizer board member Scott Gottlieb leaned on Twitter to censor tweets which argued against vaccine passports and claimed natural immunity was stronger than the shot, latest Twitter files dump reveals https://www.dailymail.co.uk/health/ar permalink parent award report block reply DiamondDroid -4 points 3 hours ago Ego yes. But \"his lust to make a buck\" is the most retarded faggot bullshit you could say. Stop listening ingredients to the libtards, glomo talking points and the media propagandists. permalink parent award report block reply Roadpower 8 points 3 hours ago I bought the receipts, ignore them at your own peril. From the first link. (And remember, if they lied Trump would have sued them and they would have retracted the story.) Trump’s inaugural committee raised a record $106.7 million — here’s who donated Sheldon Adelson, a casino magnate and major Republican donor, gave $5 million Major corporations including Bank of America, Boeing, Pfizer, Qualcomm and Dow Chemical all contributed more than $1 million Details are in the article. permalink parent award report block reply TheRedPike 1 points 1 hour ago Sheldon Adelson Nice.  He found a way to write checks in his grave.  I'm surprised he isn't a democrat. permalink parent award report block reply Kraken_V_Algorithm -5 points 3 hours ago Those aren't receipts, you're just retarded.  Those are picks he made way before COVID, like hundreds of other picks he made on the advice of others.  Nothing to do with greed.  More to do with not having enough good people to trust in DC. permalink parent award report block reply view 1 more comments... PdwH4tesMAGA 3 points 1 hour ago Evil advisors and operatives misleading Trump. Such a clown excuse at this point. Either you are claiming he is incapable of exercising any agency of his own or he is in on it and hates you as much as the rest of the globalists. permalink parent award report block reply\nnewuser8 23 points 4 hours ago All he needs to do is listen to Miller permalink parent award report block reply\nRoadpower 18 points 4 hours ago His ego and his lust to make a buck is the undoing of us all and it is funny that you mention COVID in this because Trump was completely sold out to big pharma (including his boomer stupidity) which is how we got Operation Warp Speed. April 19 2017\nTrump’s inaugural committee raised a record $106.7 million — here’s who donated https://www.cnbc.com/2017/04/19/trumps-inaugural-committee-raised-a-record-106-7-million--heres-who-donated.html March 10, 2017\nTrump chooses Gottlieb to run FDA; Pharma breathes sigh of relief (and see additional note below) https://www.reuters.com/article/world/trump-chooses-gottlieb-to-run-fda-pharma-breathes-sigh-of-relief-idUSKBN16H2AW/ April 19, 2017\nWith Drug Costs In Crosshairs, Health Firms Gave Generously To Trump’s Inauguration https://kffhealthnews.org/news/with-drug-costs-in-crosshairs-health-firms-gave-generously-to-trumps-inauguration/ 11/13/2017\nTrump picks ex-pharma executive Azar to lead HHS https://www.politico.com/story/2017/11/13/alex-azar-hhs-secretary-trump-244837 January 04 2023\nPfizer board member Scott Gottlieb leaned on Twitter to censor tweets which argued against vaccine passports and claimed natural immunity was stronger than the shot, latest Twitter files dump reveals https://www.dailymail.co.uk/health/ar permalink parent award report block reply DiamondDroid -4 points 3 hours ago Ego yes. But \"his lust to make a buck\" is the most retarded faggot bullshit you could say. Stop listening ingredients to the libtards, glomo talking points and the media propagandists. permalink parent award report block reply Roadpower 8 points 3 hours ago I bought the receipts, ignore them at your own peril. From the first link. (And remember, if they lied Trump would have sued them and they would have retracted the story.) Trump’s inaugural committee raised a record $106.7 million — here’s who donated Sheldon Adelson, a casino magnate and major Republican donor, gave $5 million Major corporations including Bank of America, Boeing, Pfizer, Qualcomm and Dow Chemical all contributed more than $1 million Details are in the article. permalink parent award report block reply TheRedPike 1 points 1 hour ago Sheldon Adelson Nice.  He found a way to write checks in his grave.  I'm surprised he isn't a democrat. permalink parent award report block reply Kraken_V_Algorithm -5 points 3 hours ago Those aren't receipts, you're just retarded.  Those are picks he made way before COVID, like hundreds of other picks he made on the advice of others.  Nothing to do with greed.  More to do with not having enough good people to trust in DC. permalink parent award report block reply view 1 more comments...\nDiamondDroid -4 points 3 hours ago Ego yes. But \"his lust to make a buck\" is the most retarded faggot bullshit you could say. Stop listening ingredients to the libtards, glomo talking points and the media propagandists. permalink parent award report block reply Roadpower 8 points 3 hours ago I bought the receipts, ignore them at your own peril. From the first link. (And remember, if they lied Trump would have sued them and they would have retracted the story.) Trump’s inaugural committee raised a record $106.7 million — here’s who donated Sheldon Adelson, a casino magnate and major Republican donor, gave $5 million Major corporations including Bank of America, Boeing, Pfizer, Qualcomm and Dow Chemical all contributed more than $1 million Details are in the article. permalink parent award report block reply TheRedPike 1 points 1 hour ago Sheldon Adelson Nice.  He found a way to write checks in his grave.  I'm surprised he isn't a democrat. permalink parent award report block reply Kraken_V_Algorithm -5 points 3 hours ago Those aren't receipts, you're just retarded.  Those are picks he made way before COVID, like hundreds of other picks he made on the advice of others.  Nothing to do with greed.  More to do with not having enough good people to trust in DC. permalink parent award report block reply view 1 more comments...\nRoadpower 8 points 3 hours ago I bought the receipts, ignore them at your own peril. From the first link. (And remember, if they lied Trump would have sued them and they would have retracted the story.) Trump’s inaugural committee raised a record $106.7 million — here’s who donated Sheldon Adelson, a casino magnate and major Republican donor, gave $5 million Major corporations including Bank of America, Boeing, Pfizer, Qualcomm and Dow Chemical all contributed more than $1 million Details are in the article. permalink parent award report block reply TheRedPike 1 points 1 hour ago Sheldon Adelson Nice.  He found a way to write checks in his grave.  I'm surprised he isn't a democrat. permalink parent award report block reply Kraken_V_Algorithm -5 points 3 hours ago Those aren't receipts, you're just retarded.  Those are picks he made way before COVID, like hundreds of other picks he made on the advice of others.  Nothing to do with greed.  More to do with not having enough good people to trust in DC. permalink parent award report block reply view 1 more comments...\nTheRedPike 1 points 1 hour ago Sheldon Adelson Nice.  He found a way to write checks in his grave.  I'm surprised he isn't a democrat. permalink parent award report block reply\nKraken_V_Algorithm -5 points 3 hours ago Those aren't receipts, you're just retarded.  Those are picks he made way before COVID, like hundreds of other picks he made on the advice of others.  Nothing to do with greed.  More to do with not having enough good people to trust in DC. permalink parent award report block reply view 1 more comments...\nPdwH4tesMAGA 3 points 1 hour ago Evil advisors and operatives misleading Trump. Such a clown excuse at this point. Either you are claiming he is incapable of exercising any agency of his own or he is in on it and hates you as much as the rest of the globalists. permalink parent award report block reply\nbluedevilga 26 points 4 hours ago Yes, because the bildeburg faggots and the WEF perverts want our men to be absolutely demoralized and become fentanyl addicts. We know this because they know who the women will vote for permalink award report block reply Female 10 points 4 hours ago yeh schlossberg permalink parent award report block reply\nFemale 10 points 4 hours ago yeh schlossberg permalink parent award report block reply\nDeepFrozenOcean 20 points 4 hours ago Think about all the amazing people we're stealing away from their poor poor shithole countries. We could improve those countries overnight if we just stopped this evil practice of \"brain drain\". They could be building skyscrapers and flying cars in their own countries, but no, we have to give them second-class status and pay them slave wages for their incredibly skilled work, instead of developing our own talent. permalink award report block reply ParticleCannon 10 points 3 hours ago The bleeding heart \"we must save the third world\" angle tends to avoid thinking about this. If we're taking the most talented and resourceful people from a country, what's left? permalink parent award report block reply DeepFrozenOcean 5 points 2 hours ago This is why Mexicans don't place in the Olympics. Anyone that can run, swim, or jump, they're already here. permalink parent award report block reply Wexit-Delecto 1 points 17 minutes ago Turns out you can't build a country out of foreign runners, jumpers, and joggers though. permalink parent award report block reply Trajano 3 points 2 hours ago No brain has been drained. permalink parent award report block reply\nParticleCannon 10 points 3 hours ago The bleeding heart \"we must save the third world\" angle tends to avoid thinking about this. If we're taking the most talented and resourceful people from a country, what's left? permalink parent award report block reply DeepFrozenOcean 5 points 2 hours ago This is why Mexicans don't place in the Olympics. Anyone that can run, swim, or jump, they're already here. permalink parent award report block reply Wexit-Delecto 1 points 17 minutes ago Turns out you can't build a country out of foreign runners, jumpers, and joggers though. permalink parent award report block reply\nDeepFrozenOcean 5 points 2 hours ago This is why Mexicans don't place in the Olympics. Anyone that can run, swim, or jump, they're already here. permalink parent award report block reply Wexit-Delecto 1 points 17 minutes ago Turns out you can't build a country out of foreign runners, jumpers, and joggers though. permalink parent award report block reply\nWexit-Delecto 1 points 17 minutes ago Turns out you can't build a country out of foreign runners, jumpers, and joggers though. permalink parent award report block reply\nTrajano 3 points 2 hours ago No brain has been drained. permalink parent award report block reply\nKlown_Kutz 18 points 3 hours ago Oh great.  Are we in for a repeat of last year's bullshit from Vivek and the boomercons telling us to drive $50 cars and dumpster dive for food? permalink award report block reply\nblobbo123 12 points 3 hours ago Apply the 100k fee to all H1B's annually. If they are so critical, then companies should have no problem paying this. permalink award report block reply Burneraccountno4 4 points 60 minutes ago Did you see the exemption for foreign student visas holders in the USA transitioning to H1Bs when they graduate? All the fee does is encourage companies to hire their h1b slave labor from a local university. permalink parent award report block reply Trajano 4 points 2 hours ago That it is the solution. 100% agree. permalink parent award report block reply NonbinaryPotatohead 2 points 37 minutes ago Just get rid of H1B's or all of the higher paying positions will be flooded with H1B's. All of the C suite positions that can afford the 100k one time fee. permalink parent award report block reply ImYourHuckleberry24 1 points 34 minutes ago It's NOT annual permalink parent award report block reply\nBurneraccountno4 4 points 60 minutes ago Did you see the exemption for foreign student visas holders in the USA transitioning to H1Bs when they graduate? All the fee does is encourage companies to hire their h1b slave labor from a local university. permalink parent award report block reply\nTrajano 4 points 2 hours ago That it is the solution. 100% agree. permalink parent award report block reply\nNonbinaryPotatohead 2 points 37 minutes ago Just get rid of H1B's or all of the higher paying positions will be flooded with H1B's. All of the C suite positions that can afford the 100k one time fee. permalink parent award report block reply\nImYourHuckleberry24 1 points 34 minutes ago It's NOT annual permalink parent award report block reply\nrupok2 11 points 3 hours ago H1b removal is a bipartisan issue even the liberals in tech hate them but somehow both parties don't push to end it and similar visas. Only indian street shitters support it. Just another way you can tell government is extremely out of touch. permalink award report block reply TheTelltaleFly 8 points 2 hours ago Not out of touch, controlled by tech billionaires. Trump hosted Mark Zuckerberg for dinner at the White House, even after Mark Zuckerberg spent $400 million stealing the 2020 election from him. And banned him from Facebook. Bill Gates was there too. What chance do we have? permalink parent award report block reply Spicy_cat 5 points 3 hours ago Can the states pass laws where if you hire an H1B for an entry level position it's considered fraud? permalink parent award report block reply bluewhiteandred 1 points 2 hours ago idk but boycotting h1b companies could be a thing permalink parent award report block reply Spicy_cat 2 points 1 hour ago So like... all of them https://www.uscis.gov/tools/reports-and-studies/h-1b-employer-data-hub permalink parent award report block reply\nTheTelltaleFly 8 points 2 hours ago Not out of touch, controlled by tech billionaires. Trump hosted Mark Zuckerberg for dinner at the White House, even after Mark Zuckerberg spent $400 million stealing the 2020 election from him. And banned him from Facebook. Bill Gates was there too. What chance do we have? permalink parent award report block reply\nSpicy_cat 5 points 3 hours ago Can the states pass laws where if you hire an H1B for an entry level position it's considered fraud? permalink parent award report block reply bluewhiteandred 1 points 2 hours ago idk but boycotting h1b companies could be a thing permalink parent award report block reply Spicy_cat 2 points 1 hour ago So like... all of them https://www.uscis.gov/tools/reports-and-studies/h-1b-employer-data-hub permalink parent award report block reply\nbluewhiteandred 1 points 2 hours ago idk but boycotting h1b companies could be a thing permalink parent award report block reply Spicy_cat 2 points 1 hour ago So like... all of them https://www.uscis.gov/tools/reports-and-studies/h-1b-employer-data-hub permalink parent award report block reply\nSpicy_cat 2 points 1 hour ago So like... all of them https://www.uscis.gov/tools/reports-and-studies/h-1b-employer-data-hub permalink parent award report block reply\nRizzlieDoodad 8 points 3 hours ago Usury, speeding up naturalization of immigrants, and adding 6x Chinese students because otherwise colleges that hate us and him will go out of business. Ok boomer permalink award report block reply PdwH4tesMAGA 0 points 59 minutes ago Trump is the great betrayer and this place will still simp for him. permalink parent award report block reply\nPdwH4tesMAGA 0 points 59 minutes ago Trump is the great betrayer and this place will still simp for him. permalink parent award report block reply\nTPMJB 7 points 3 hours ago You don't understand! We don't have the unwashed talent that gets their degrees from diploma mills here! We NEED H1B slaves! permalink award report block reply\nIvIA6A 6 points 2 hours ago The streets aren't going to shit themselves permalink award report block reply\nSteelDriver 6 points 2 hours ago There has never been a tech worker shortage (or a tech worker talent deficit).  There has only ever been a cheap tech worker shortage.  Big businesses still like their indentured servitude (which is also why they like illegal immigration). permalink award report block reply\nGeorgeBailey 6 points 2 hours ago Yeah, but we need them because Americans aren’t talented enough to do entry-level jobs. Indians are much more talented at those jobs. <— I think that’s what Trump was saying to Laura Ingram the other day. permalink award report block reply NonbinaryPotatohead 1 points 36 minutes ago I couldn't believe he said that. Feels like Biden levels of gaffes recently. permalink parent award report block reply\nNonbinaryPotatohead 1 points 36 minutes ago I couldn't believe he said that. Feels like Biden levels of gaffes recently. permalink parent award report block reply\nPatriotDescendant 6 points 3 hours ago We have thousands of them at my company (Dallas). Most are wonderful people, individually. Collectively, they are a pestilence! permalink award report block reply\nrealPixelDust 4 points 2 hours ago You see that plus sign? It is way fucking worse than 80%. permalink award report block reply\nYellowstoneJoe 4 points 3 hours ago Now that is a big problem. Wouldn't the $100k per year fee fix this? permalink award report block reply Truthisunpopular 8 points 3 hours ago That 100k proposal is not per year it's a one time fee that is easily recovered within a couple of years when you consider how much employers save by paying extremely low wages to foreign garbage compared to what the job should pay if a citizen were hired. Also, they don't have to pay the 100k for the already existing h1-b's. permalink parent award report block reply Burneraccountno4 3 points 49 minutes ago It also doesn't apply to student visa holders in the USA transitioning to H1Bs upon graduation. Indians will just register for courses at some shit tier American University to get around the fee. The fee is really just a gift to shit tier American universities and colleges that couldn't survive without charging international tuition rates. Trump basically said as much the other day. permalink parent award report block reply Truthisunpopular 2 points 44 minutes ago What a complete clusterfuck. The more you learn, the more tiresome it all becomes. permalink parent award report block reply\nTruthisunpopular 8 points 3 hours ago That 100k proposal is not per year it's a one time fee that is easily recovered within a couple of years when you consider how much employers save by paying extremely low wages to foreign garbage compared to what the job should pay if a citizen were hired. Also, they don't have to pay the 100k for the already existing h1-b's. permalink parent award report block reply Burneraccountno4 3 points 49 minutes ago It also doesn't apply to student visa holders in the USA transitioning to H1Bs upon graduation. Indians will just register for courses at some shit tier American University to get around the fee. The fee is really just a gift to shit tier American universities and colleges that couldn't survive without charging international tuition rates. Trump basically said as much the other day. permalink parent award report block reply Truthisunpopular 2 points 44 minutes ago What a complete clusterfuck. The more you learn, the more tiresome it all becomes. permalink parent award report block reply\nBurneraccountno4 3 points 49 minutes ago It also doesn't apply to student visa holders in the USA transitioning to H1Bs upon graduation. Indians will just register for courses at some shit tier American University to get around the fee. The fee is really just a gift to shit tier American universities and colleges that couldn't survive without charging international tuition rates. Trump basically said as much the other day. permalink parent award report block reply Truthisunpopular 2 points 44 minutes ago What a complete clusterfuck. The more you learn, the more tiresome it all becomes. permalink parent award report block reply\nTruthisunpopular 2 points 44 minutes ago What a complete clusterfuck. The more you learn, the more tiresome it all becomes. permalink parent award report block reply\nlearntocode 3 points 2 hours ago This is the exact opposite of securing a future for our children. permalink award report block reply\nunitedspeedalarm 3 points 1 hour ago The master class has made so much money that they don't need to care about the working man anymore. You and your kids better pay your rent on time. permalink award report block reply\nThrowingway22 3 points 2 hours ago America doesn't have the talent for entry level. We should be flinging feces at each other and calling it a festival. permalink award report block reply\njiujiujiu 2 points 2 hours ago They want high level intellect while paying the lowest wage possible. Make. It. Illegal. permalink award report block reply\nGreenhills 2 points 2 hours ago I wish there was just some way we could figure out how to deradicalize college grads. Some way? Hmm. permalink award report block reply\nMegoThor 2 points 31 minutes ago “How much shit do you want with your fries, saar?” permalink award report block reply Wexit-Delecto 1 points 14 minutes ago With jeets the shit is complementary and comes with every meal. permalink parent award report block reply\nWexit-Delecto 1 points 14 minutes ago With jeets the shit is complementary and comes with every meal. permalink parent award report block reply\nWiggle-Hard 2 points 1 hour ago What immigrants dont replace ai will, we are fucked and unless trump both ends h1b and regulates ai in a way that takes the insane profits companies will make and pay them back to the tax payer in some way, you’ll have a nation of jobless youth voting AOC in 2028 permalink award report block reply\nWiggle-Hard 2 points 51 minutes ago The reality is, the tech industry, engineering, trucking, management, walmart, and several other employers now belong to immigrants and ai permalink award report block reply\nravonaf 2 points 2 hours ago This is why you see the same jobs over and over on job sites. No matter how many people apply, the same job sits there for months. They are telling the government these jobs can't be filled. When in reality, they are letting them sit empty as justification to bring in H1B workers who work for half the price of Americans. permalink award report block reply\nbluewhiteandred 2 points 2 hours ago \"scam and scandal\" well, idk if I would describe it like that, but let's break down what's happening these jobs can be done for cheaper by non-Americans. So the companies want to save a buck by either importing cheaper labor or offshoring operations to somewhere else. This is felt to be a win-win for the company that saves costs on labor and for the laborer from another country that makes more money than the would otherwise. It can also be a win for us if it enables us to do other work for higher pay But then some problems come in: if they import the labor like with h1bs, they're also importing those cultures and politics. We're kind of coming to an agreement that doesn't work very well Offshoring the jobs also hasn't necessarily worked since those jobs weren't necessarily replaced with higher paying jobs; greedy corps simply pocketed the money that would have otherwise been paid \"more\" to middle class working Americans Also, you can create this highly dependent global economic situation, where say the third world could grow all our food while the 1st world builds computers and machines to help them grow it. However, if they decided they didn't want to sell us food that we depend on them for (for example), then we would have a national security issue of getting access to food. So, there probably needs to be a balance and backup plans when we offshore jobs (if we're going to do so) if trades don't work out. Alternatively people could be poorer but more self-sufficient and self-sufficient as a country / nation. So Trump is getting lost in some of these economic considerations, either he needs to bring about better jobs for the manufacturing jobs that get outsourced, or to maybe discourage companies from sending jobs overseas at something of a loss to their \"bottom line\" (it will probably cost more in labor) edit: so a \"profits first\" policy, not necessarily a scam or scandal so much as not \"america first\" edit 2: so another way some economic pull could be exerted is by identifying companies that make use of h1bs and organizing boycotts or advertising their company policies for people to make a stir about permalink award report block reply\nWiggle-Hard 2 points 1 hour ago Reality time The technology and warehousing industries have seen the most layoffs, largely driven by AI integration, cost-cutting, and shifting consumer demand. Other sectors like retail and government have also experienced significant job cuts, with year-to-date totals in these areas exceeding those from the previous year.\nLeading industries by layoff numbers\nTechnology: This sector continues to lead in layoffs, with job cuts attributed to AI integration, slower demand, and a focus on efficiency. For the year 2025, tech firms have announced over 141,000 job cuts.\nWarehousing: This industry had the highest number of layoffs in a single month (October 2025) and has seen a dramatic increase in year-to-date job cuts compared to 2024.\nRetail: This sector is still facing pressure due to shifting consumer habits, rising costs, and ongoing store closures. Year-to-date job cuts are up significantly from the previous year.\nGovernment: This sector has announced the most layoffs year-to-date, exceeding the total for the entire year of 2024.\nServices: The services sector, which includes companies providing support services, has also seen an increase in job cuts compared to 2024.\nDriving factors for layoffs\nAI integration: The adoption of AI is a major factor, as companies restructure to take advantage of new efficiencies.\nCost-cutting and efficiency: Companies are tightening their belts in response to rising costs and softer consumer and corporate spending.\nShifting demand and store closures: The retail sector, in particular, is navigating changing consumer habits, leading to store closures and job cuts. permalink award report block reply\nmohel 2 points 2 hours ago Why is everything, the government does, a scam? permalink award report block reply\nGeneticsGuy 1 points 31 minutes ago Software dev here. Literally every Indian H1-B job hire I ever met was here taking jobs from Americans and were generally worse at their jobs. permalink award report block reply\nSteve56775 1 points 18 minutes ago We are Full. Until 40 million are deported, no one comes in. permalink award report block reply\nNonbinaryPotatohead 1 points 40 minutes ago Remember the last 20+ years all the job postings for entry level positions had requirements of prior experience that you can only get from posted entry level position? It was because it was never for Americans! It's basically a reserved seat for foreigners. permalink award report block reply\nMichalusmichalus 1 points 40 minutes ago This is why vocations are where kids should be focusing. There's no reason to pay for school if companies aren't hiring Americans. permalink award report block reply\njermzdeejd 1 points 40 minutes ago Then when you finally get through the door they ask for your experience when you cant get it because h1 is getting the experience. The vicious cycle continues. permalink award report block reply\nPillarOfWisdom 1 points 27 minutes ago Wait until you understand H-2Bs.  Those are the people the Trump and Congress are bringing and have been bringing in to replace hourly people. permalink award report block reply\ncbonez416 1 points 3 hours ago Didn't Trump change the vetting rules and make it cost 150k for an application to try to get in the USA? Didn't this stop all the abuse and bullshit bc it's to expensive now? It only use to cost 1000 bucks to apply!! Now it's super expensive and can't be abused for profit. permalink award report block reply\nAggrieved03 1 points 3 hours ago Burger King, Walmart, Subway, gas station, etc ...... permalink award report block reply\nSeeker_17 1 points 2 hours ago WTF??? permalink award report block reply\nWexit-Delecto 1 points 35 minutes ago Half this board wants them to keep coming, apparently. permalink award report block reply\njosiborg 1 points 11 minutes ago \"entry level\" https://h1bdata.info/index.php?em=publix+super+markets+inc&job=&city=&year=2025 permalink award report block reply\nDagneyTaggart 1 points 3 hours ago “Talent”\nIs that what we call wiping without toilet paper? permalink award report block reply\nMaxineWaters4Prez 1 points 34 minutes ago It's the same shit with illegals and H1Bs. They want to pay people less to do menial work. They're killing off unskilled labor (which should be a low, but liveable wage) to be done by beans and jeets for less than an American laborer. All with a nice little tax incentive attached. We're being robbed at every turn. permalink award report block reply\nGeneticsGuy 1 points 34 minutes ago And with the supposed AI revolution thst is going to take jobs, why are we still importing people? permalink award report block reply\nPedePete 1 points 10 minutes ago This H1B problem is the real issue of the moment. We CANNOT allow this to continue if we want to have a country at all! permalink award report block reply\nLearnAboutRoaches -4 points 4 hours ago Fake news permalink award report block reply"}