{"id": "1ARK9hiHPn", "contents": "449 A Democrat senator who helped keep the shutdown alive is now admitting the truth: he caved because the strategy had completely collapsed. posted 2 days ago by KuzoKevin 6 comments award share report block Overton @overton_news • 3d A Democrat senator who helped keep the shutdown alive is now admitting the truth: he caved because the strategy had completely collapsed. Sen. Angus King told reporters he voted for the compromise funding deal for one simple reason — “it wasn’t working.” And he openly\n6 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style reasonablydisturbed 18 points 2 days ago That ACA vote the GOP promised should be a repeal vote only. Time to stick it to the Dems hard. permalink award report block reply CyanScales 11 points 2 days ago \"Well what are you going to replace it with??\" NOTHING! That's a trick question. You can have a few smart regulations without an entire government run framework. Shit, just making it easier to sue insurance companies may be enough to fix the issues. permalink parent award report block reply astralentity 5 points 2 days ago There's going to be a problem if they didn't consult with the House on it. permalink parent award report block reply barc 6 points 2 days ago King voted to open the government all 16 times. permalink award report block reply imnotdeadyet 1 points 2 days ago I believe King is an independent from Maine.  He normally votes Democrat, so I can see why it may confuse some. permalink parent award report block reply mikethemarine 2 points 2 days ago the only true reason they held the shutdown for so long is they wanted to be able to cheat in those last elections and it was a huge distraction from what they were doing, and to be able to try and say the reason republicans lost those elections was because of the shutdown. IT WAS ALL BULLSHIT. permalink award report block reply\nreasonablydisturbed 18 points 2 days ago That ACA vote the GOP promised should be a repeal vote only. Time to stick it to the Dems hard. permalink award report block reply CyanScales 11 points 2 days ago \"Well what are you going to replace it with??\" NOTHING! That's a trick question. You can have a few smart regulations without an entire government run framework. Shit, just making it easier to sue insurance companies may be enough to fix the issues. permalink parent award report block reply astralentity 5 points 2 days ago There's going to be a problem if they didn't consult with the House on it. permalink parent award report block reply\nCyanScales 11 points 2 days ago \"Well what are you going to replace it with??\" NOTHING! That's a trick question. You can have a few smart regulations without an entire government run framework. Shit, just making it easier to sue insurance companies may be enough to fix the issues. permalink parent award report block reply\nastralentity 5 points 2 days ago There's going to be a problem if they didn't consult with the House on it. permalink parent award report block reply\nbarc 6 points 2 days ago King voted to open the government all 16 times. permalink award report block reply imnotdeadyet 1 points 2 days ago I believe King is an independent from Maine.  He normally votes Democrat, so I can see why it may confuse some. permalink parent award report block reply\nimnotdeadyet 1 points 2 days ago I believe King is an independent from Maine.  He normally votes Democrat, so I can see why it may confuse some. permalink parent award report block reply\nmikethemarine 2 points 2 days ago the only true reason they held the shutdown for so long is they wanted to be able to cheat in those last elections and it was a huge distraction from what they were doing, and to be able to try and say the reason republicans lost those elections was because of the shutdown. IT WAS ALL BULLSHIT. permalink award report block reply"}