{"id": "1ARK9oWNUP", "contents": "49 We're not doing that shit anymore!! YES posted 2 hours ago by SuperHonkey 8 comments award share report block Defiant L’s @DefiantLs • 2d Hegseth: \"These are men who think they are women?\" Jacobs: \"They are women; I’m happy to educate you.\" Hegseth: \"We've identified there’s mental health issues with that belief system that are detrimental to readiness.\"\n8 comments Sort by Top Top New Worst Old Save Around the Web Hair Will Grow Back! No Matter How Severe The Baldness HaloGrow MrUnderhill 5 points 2 hours ago That nose reminds me of..... permalink award report block reply duckduck 4 points 2 hours ago Hegseth rules. permalink award report block reply PatriotSkorzeny 3 points 1 hour ago “They have non-standard, burdensome excess medical requirements. There exists a thousands year body of knowledge concerning battlefield medical techniques, from trench foot to the golden hour, the sucking chest wound and cauterizing gashes.” permalink award report block reply SuperHonkey OP 1 points 1 hour ago Plus they're gross faggots permalink parent award report block reply SpeekFreely 2 points 1 hour ago At least not for the next 3 years permalink award report block reply ColonelKlink 1 points 43 minutes ago The commie left's obsession with faggotry and pedophilia is evil. permalink award report block reply Veritas264 1 points 1 hour ago Despicable Me dude?! permalink award report block reply ManWhoMakesTheMusic 1 points 2 hours ago Comment removed by community moderators. permalink award report block reply\nMrUnderhill 5 points 2 hours ago That nose reminds me of..... permalink award report block reply\nduckduck 4 points 2 hours ago Hegseth rules. permalink award report block reply\nPatriotSkorzeny 3 points 1 hour ago “They have non-standard, burdensome excess medical requirements. There exists a thousands year body of knowledge concerning battlefield medical techniques, from trench foot to the golden hour, the sucking chest wound and cauterizing gashes.” permalink award report block reply SuperHonkey OP 1 points 1 hour ago Plus they're gross faggots permalink parent award report block reply\nSuperHonkey OP 1 points 1 hour ago Plus they're gross faggots permalink parent award report block reply\nSpeekFreely 2 points 1 hour ago At least not for the next 3 years permalink award report block reply\nColonelKlink 1 points 43 minutes ago The commie left's obsession with faggotry and pedophilia is evil. permalink award report block reply\nVeritas264 1 points 1 hour ago Despicable Me dude?! permalink award report block reply\nManWhoMakesTheMusic 1 points 2 hours ago Comment removed by community moderators. permalink award report block reply"}