{"id": "1ARK9jztGj", "contents": "1161 Veterans..... Thank you! posted 1 day ago by Bullet3250 39 comments award share download report block\n39 comments Sort by Top Top New Worst Old Save Around the Web Stop Eating These 3 Foods That Are Known to Cause Parasites Paratoxil USMC1234O10 31 points 1 day ago SEMPER FI and YOU PEDES ARE WELCOME! permalink award report block reply ThisTrainHasNoBrakes 8 points 1 day ago USAF vet checking in, if that counts. 🤣 permalink parent award report block reply Emodius 1 points 1 day ago I make the same joke every time lol permalink parent award report block reply PatriotForTN 6 points 1 day ago Thank you for your service sir permalink parent award report block reply DogPilledMAGA 6 points 1 day ago Semper Fi! permalink parent award report block reply ProtestantPatriot777 3 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply DogPilledMAGA 1 points 1 day ago Comment removed by community filter, pending further review. permalink parent award report block reply JiggsawCalrissian 8 points 1 day ago Its just a shame you all seemed to have sacrificed yourself for nothing but thankyou permalink award report block reply Bullet3250 OP 4 points 1 day ago all caps time.... Even in Iraq and Afghanistan wars - while 99% worthless - DID SHOW THE WORLD -  AND EVERY ENEMY THAT THE WEST HAS - THAT WE CAN AND WILL SEND THE GREATEST FIGHTING FORCE EVER KNOWN -  TO ANYWHERE IN THE WORLD AND FIGHT TOWEL HEADS IN CAVES IN THE MIDDLE OF 'NO WHERE' - AND SPEND $6 TRILLION DOLLARS DOING IT. 'TREAD LIGHTLY' permalink parent award report block reply conservativefrank 4 points 1 day ago That we will send our young people to die for nonsense. permalink parent award report block reply Bullet3250 OP 4 points 1 day ago Should scare our enemies even more! permalink parent award report block reply Bazhosh 3 points 1 day ago What enemies? Nobody in Russia, North Korea or Iran is threatening my freedom. My only enemy is my own Government. permalink parent award report block reply Burneraccountno4 2 points 1 day ago Except we then import the sons of those enemies to the USA to breed with the daughters of those US soldiers. permalink parent award report block reply ParadigmShift2070 0 points 1 day ago cool it with antisemitic remarks permalink parent award report block reply schnazzmizzle 1 points 1 day ago That's just the history of humanity isn't it? GI Bill and a pension at 38 wasn't a bad way to spend my time. permalink parent award report block reply Aggrieved03 7 points 1 day ago We will be needed once more. 🪖 permalink award report block reply Patriot4TN 7 points 1 day ago Thank you. And thanks to all my fellow brother's and sister's who stood beside me. It was an honor to serve with you. permalink award report block reply Bendadick_Arnold 2 points 1 day ago Thank you to those who served before me. Thank you to those who served after me. Thank you to those who served with me. permalink parent award report block reply Mortal_Wombat 5 points 1 day ago We did it out of love for our country. What a learning experience that turned out to be. Thank you fren for being based! permalink award report block reply Bullet3250 OP 4 points 1 day ago Even if some of those 'wars' were utterly fake and gay - know this - that you did SEND A MESSAGE to every enemy the WEST HAS...  all across the planet.... that we will send the greatest fighting force the World has ever known - to any God Forsaken Cave or Desert or Mountain range - absolutely ANYWHERE in the world - and spend Trillions of  dollars doing it.... to tear down any enemy. Thanks for putting up with our most unPatriotic Leaders... and waiting for our most Patriotic too. permalink parent award report block reply airborne3502 5 points 1 day ago Ya'll frens are completely worth it. permalink award report block reply Emodius 4 points 1 day ago You're welcome, and thank you fellow vets permalink award report block reply God-is-good 4 points 1 day ago The best reply I wish I had come up with was “Jesus thought you were worth dying for and so do I.” permalink award report block reply grannylovestrump 4 points 1 day ago Yes we are so damn proud of our Patriots! Thank you for all you have done and will do when times get hard. You are our pride an joy! permalink award report block reply Emodius 4 points 1 day ago Thank you ♥ permalink parent award report block reply ProtestantPatriot777 2 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply grannylovestrump 1 points 1 day ago LOL oh ok. Not taking the bait. I still hope you have a wonderful day and God bless you. permalink parent award report block reply ProtestantPatriot777 12 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply grannylovestrump -4 points 1 day ago You do know that when you point one finger forward you are pointing three fingers back. The guilty dog barks loudest. I have nothing to prove to anybody so you can think whatever you want. It is a free country! Once again commie infiltrator have a great day! permalink parent award report block reply JustInTime2_ 3 points 1 day ago Thank you All. permalink award report block reply USMCWolf 3 points 1 day ago Thank you for your service! permalink award report block reply Bullet3250 OP 1 points 1 day ago I just steael memes.... You are the one we should all be thanking. permalink parent award report block reply NonbinaryPotatohead 3 points 1 day ago No more wars for Israel!\nProtecc your family lineage and bloodlines! permalink award report block reply _Liberty_Prime_ 1 points 1 day ago Neither I nor my brothers \"died for Israel.\" Hamas did, tho. permalink parent award report block reply ParadigmShift2070 -1 points 1 day ago 👆 literal jidf permalink parent award report block reply _Liberty_Prime_ 1 points 1 day ago \"From the river to the...hold on, my beeper's going off.\" permalink parent award report block reply tdtech9 2 points 1 day ago Dank permalink award report block reply JohnN 2 points 1 day ago Thank you. And thanks for being a taxpayer.  (They don't get thanked nearly enough). permalink award report block reply liberalshitlord 2 points 1 day ago My pleasure. permalink award report block reply\nUSMC1234O10 31 points 1 day ago SEMPER FI and YOU PEDES ARE WELCOME! permalink award report block reply ThisTrainHasNoBrakes 8 points 1 day ago USAF vet checking in, if that counts. 🤣 permalink parent award report block reply Emodius 1 points 1 day ago I make the same joke every time lol permalink parent award report block reply PatriotForTN 6 points 1 day ago Thank you for your service sir permalink parent award report block reply DogPilledMAGA 6 points 1 day ago Semper Fi! permalink parent award report block reply ProtestantPatriot777 3 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply DogPilledMAGA 1 points 1 day ago Comment removed by community filter, pending further review. permalink parent award report block reply\nThisTrainHasNoBrakes 8 points 1 day ago USAF vet checking in, if that counts. 🤣 permalink parent award report block reply Emodius 1 points 1 day ago I make the same joke every time lol permalink parent award report block reply\nEmodius 1 points 1 day ago I make the same joke every time lol permalink parent award report block reply\nPatriotForTN 6 points 1 day ago Thank you for your service sir permalink parent award report block reply\nDogPilledMAGA 6 points 1 day ago Semper Fi! permalink parent award report block reply\nProtestantPatriot777 3 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply DogPilledMAGA 1 points 1 day ago Comment removed by community filter, pending further review. permalink parent award report block reply\nDogPilledMAGA 1 points 1 day ago Comment removed by community filter, pending further review. permalink parent award report block reply\nJiggsawCalrissian 8 points 1 day ago Its just a shame you all seemed to have sacrificed yourself for nothing but thankyou permalink award report block reply Bullet3250 OP 4 points 1 day ago all caps time.... Even in Iraq and Afghanistan wars - while 99% worthless - DID SHOW THE WORLD -  AND EVERY ENEMY THAT THE WEST HAS - THAT WE CAN AND WILL SEND THE GREATEST FIGHTING FORCE EVER KNOWN -  TO ANYWHERE IN THE WORLD AND FIGHT TOWEL HEADS IN CAVES IN THE MIDDLE OF 'NO WHERE' - AND SPEND $6 TRILLION DOLLARS DOING IT. 'TREAD LIGHTLY' permalink parent award report block reply conservativefrank 4 points 1 day ago That we will send our young people to die for nonsense. permalink parent award report block reply Bullet3250 OP 4 points 1 day ago Should scare our enemies even more! permalink parent award report block reply Bazhosh 3 points 1 day ago What enemies? Nobody in Russia, North Korea or Iran is threatening my freedom. My only enemy is my own Government. permalink parent award report block reply Burneraccountno4 2 points 1 day ago Except we then import the sons of those enemies to the USA to breed with the daughters of those US soldiers. permalink parent award report block reply ParadigmShift2070 0 points 1 day ago cool it with antisemitic remarks permalink parent award report block reply schnazzmizzle 1 points 1 day ago That's just the history of humanity isn't it? GI Bill and a pension at 38 wasn't a bad way to spend my time. permalink parent award report block reply\nBullet3250 OP 4 points 1 day ago all caps time.... Even in Iraq and Afghanistan wars - while 99% worthless - DID SHOW THE WORLD -  AND EVERY ENEMY THAT THE WEST HAS - THAT WE CAN AND WILL SEND THE GREATEST FIGHTING FORCE EVER KNOWN -  TO ANYWHERE IN THE WORLD AND FIGHT TOWEL HEADS IN CAVES IN THE MIDDLE OF 'NO WHERE' - AND SPEND $6 TRILLION DOLLARS DOING IT. 'TREAD LIGHTLY' permalink parent award report block reply conservativefrank 4 points 1 day ago That we will send our young people to die for nonsense. permalink parent award report block reply Bullet3250 OP 4 points 1 day ago Should scare our enemies even more! permalink parent award report block reply Bazhosh 3 points 1 day ago What enemies? Nobody in Russia, North Korea or Iran is threatening my freedom. My only enemy is my own Government. permalink parent award report block reply Burneraccountno4 2 points 1 day ago Except we then import the sons of those enemies to the USA to breed with the daughters of those US soldiers. permalink parent award report block reply ParadigmShift2070 0 points 1 day ago cool it with antisemitic remarks permalink parent award report block reply\nconservativefrank 4 points 1 day ago That we will send our young people to die for nonsense. permalink parent award report block reply Bullet3250 OP 4 points 1 day ago Should scare our enemies even more! permalink parent award report block reply Bazhosh 3 points 1 day ago What enemies? Nobody in Russia, North Korea or Iran is threatening my freedom. My only enemy is my own Government. permalink parent award report block reply Burneraccountno4 2 points 1 day ago Except we then import the sons of those enemies to the USA to breed with the daughters of those US soldiers. permalink parent award report block reply ParadigmShift2070 0 points 1 day ago cool it with antisemitic remarks permalink parent award report block reply\nBullet3250 OP 4 points 1 day ago Should scare our enemies even more! permalink parent award report block reply Bazhosh 3 points 1 day ago What enemies? Nobody in Russia, North Korea or Iran is threatening my freedom. My only enemy is my own Government. permalink parent award report block reply Burneraccountno4 2 points 1 day ago Except we then import the sons of those enemies to the USA to breed with the daughters of those US soldiers. permalink parent award report block reply\nBazhosh 3 points 1 day ago What enemies? Nobody in Russia, North Korea or Iran is threatening my freedom. My only enemy is my own Government. permalink parent award report block reply\nBurneraccountno4 2 points 1 day ago Except we then import the sons of those enemies to the USA to breed with the daughters of those US soldiers. permalink parent award report block reply\nParadigmShift2070 0 points 1 day ago cool it with antisemitic remarks permalink parent award report block reply\nschnazzmizzle 1 points 1 day ago That's just the history of humanity isn't it? GI Bill and a pension at 38 wasn't a bad way to spend my time. permalink parent award report block reply\nAggrieved03 7 points 1 day ago We will be needed once more. 🪖 permalink award report block reply\nPatriot4TN 7 points 1 day ago Thank you. And thanks to all my fellow brother's and sister's who stood beside me. It was an honor to serve with you. permalink award report block reply Bendadick_Arnold 2 points 1 day ago Thank you to those who served before me. Thank you to those who served after me. Thank you to those who served with me. permalink parent award report block reply\nBendadick_Arnold 2 points 1 day ago Thank you to those who served before me. Thank you to those who served after me. Thank you to those who served with me. permalink parent award report block reply\nMortal_Wombat 5 points 1 day ago We did it out of love for our country. What a learning experience that turned out to be. Thank you fren for being based! permalink award report block reply Bullet3250 OP 4 points 1 day ago Even if some of those 'wars' were utterly fake and gay - know this - that you did SEND A MESSAGE to every enemy the WEST HAS...  all across the planet.... that we will send the greatest fighting force the World has ever known - to any God Forsaken Cave or Desert or Mountain range - absolutely ANYWHERE in the world - and spend Trillions of  dollars doing it.... to tear down any enemy. Thanks for putting up with our most unPatriotic Leaders... and waiting for our most Patriotic too. permalink parent award report block reply\nBullet3250 OP 4 points 1 day ago Even if some of those 'wars' were utterly fake and gay - know this - that you did SEND A MESSAGE to every enemy the WEST HAS...  all across the planet.... that we will send the greatest fighting force the World has ever known - to any God Forsaken Cave or Desert or Mountain range - absolutely ANYWHERE in the world - and spend Trillions of  dollars doing it.... to tear down any enemy. Thanks for putting up with our most unPatriotic Leaders... and waiting for our most Patriotic too. permalink parent award report block reply\nairborne3502 5 points 1 day ago Ya'll frens are completely worth it. permalink award report block reply\nEmodius 4 points 1 day ago You're welcome, and thank you fellow vets permalink award report block reply\nGod-is-good 4 points 1 day ago The best reply I wish I had come up with was “Jesus thought you were worth dying for and so do I.” permalink award report block reply\ngrannylovestrump 4 points 1 day ago Yes we are so damn proud of our Patriots! Thank you for all you have done and will do when times get hard. You are our pride an joy! permalink award report block reply Emodius 4 points 1 day ago Thank you ♥ permalink parent award report block reply ProtestantPatriot777 2 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply grannylovestrump 1 points 1 day ago LOL oh ok. Not taking the bait. I still hope you have a wonderful day and God bless you. permalink parent award report block reply ProtestantPatriot777 12 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply grannylovestrump -4 points 1 day ago You do know that when you point one finger forward you are pointing three fingers back. The guilty dog barks loudest. I have nothing to prove to anybody so you can think whatever you want. It is a free country! Once again commie infiltrator have a great day! permalink parent award report block reply\nEmodius 4 points 1 day ago Thank you ♥ permalink parent award report block reply\nProtestantPatriot777 2 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply grannylovestrump 1 points 1 day ago LOL oh ok. Not taking the bait. I still hope you have a wonderful day and God bless you. permalink parent award report block reply ProtestantPatriot777 12 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply grannylovestrump -4 points 1 day ago You do know that when you point one finger forward you are pointing three fingers back. The guilty dog barks loudest. I have nothing to prove to anybody so you can think whatever you want. It is a free country! Once again commie infiltrator have a great day! permalink parent award report block reply\ngrannylovestrump 1 points 1 day ago LOL oh ok. Not taking the bait. I still hope you have a wonderful day and God bless you. permalink parent award report block reply ProtestantPatriot777 12 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply grannylovestrump -4 points 1 day ago You do know that when you point one finger forward you are pointing three fingers back. The guilty dog barks loudest. I have nothing to prove to anybody so you can think whatever you want. It is a free country! Once again commie infiltrator have a great day! permalink parent award report block reply\nProtestantPatriot777 12 points 1 day ago Comment removed upon the user being banned. permalink parent award report block reply grannylovestrump -4 points 1 day ago You do know that when you point one finger forward you are pointing three fingers back. The guilty dog barks loudest. I have nothing to prove to anybody so you can think whatever you want. It is a free country! Once again commie infiltrator have a great day! permalink parent award report block reply\ngrannylovestrump -4 points 1 day ago You do know that when you point one finger forward you are pointing three fingers back. The guilty dog barks loudest. I have nothing to prove to anybody so you can think whatever you want. It is a free country! Once again commie infiltrator have a great day! permalink parent award report block reply\nJustInTime2_ 3 points 1 day ago Thank you All. permalink award report block reply\nUSMCWolf 3 points 1 day ago Thank you for your service! permalink award report block reply Bullet3250 OP 1 points 1 day ago I just steael memes.... You are the one we should all be thanking. permalink parent award report block reply\nBullet3250 OP 1 points 1 day ago I just steael memes.... You are the one we should all be thanking. permalink parent award report block reply\nNonbinaryPotatohead 3 points 1 day ago No more wars for Israel!\nProtecc your family lineage and bloodlines! permalink award report block reply _Liberty_Prime_ 1 points 1 day ago Neither I nor my brothers \"died for Israel.\" Hamas did, tho. permalink parent award report block reply ParadigmShift2070 -1 points 1 day ago 👆 literal jidf permalink parent award report block reply _Liberty_Prime_ 1 points 1 day ago \"From the river to the...hold on, my beeper's going off.\" permalink parent award report block reply\n_Liberty_Prime_ 1 points 1 day ago Neither I nor my brothers \"died for Israel.\" Hamas did, tho. permalink parent award report block reply ParadigmShift2070 -1 points 1 day ago 👆 literal jidf permalink parent award report block reply _Liberty_Prime_ 1 points 1 day ago \"From the river to the...hold on, my beeper's going off.\" permalink parent award report block reply\nParadigmShift2070 -1 points 1 day ago 👆 literal jidf permalink parent award report block reply _Liberty_Prime_ 1 points 1 day ago \"From the river to the...hold on, my beeper's going off.\" permalink parent award report block reply\n_Liberty_Prime_ 1 points 1 day ago \"From the river to the...hold on, my beeper's going off.\" permalink parent award report block reply\ntdtech9 2 points 1 day ago Dank permalink award report block reply\nJohnN 2 points 1 day ago Thank you. And thanks for being a taxpayer.  (They don't get thanked nearly enough). permalink award report block reply\nliberalshitlord 2 points 1 day ago My pleasure. permalink award report block reply"}