{"id": "1ARK56jq6K", "contents": "468 👌🏻 posted 5 days ago by HappyFunBall 17 comments award share download report block\n17 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style 38WendysHamSquare79 8 points 5 days ago Conservative women are ALWAYS bette looking than liberal women. permalink award report block reply ADAM_SCHITT 4 points 5 days ago While true, this is a drawing permalink parent award report block reply EDDIT_IS_CUCKED 2 points 4 days ago And this is exactly what leftist slampigs do. They use some \"GAY\"I to create cartoons of themselves and always choose ones that look nothing like themselves and are actually attractive, because they know reality is not so kind. permalink parent award report block reply patrioticwinning3 5 points 5 days ago Most White people were not even here during the Civil War.  Most White People that were fought for the North.  Most people in the South didn't even own slaves.  Even if someone's ancestors did own slave that's NOT THEM! permalink award report block reply Stolen 3 points 5 days ago Now let us talk about Muslims owning slaves and  Ottomans owning Slavics permalink parent award report block reply patrioticwinning3 1 points 3 days ago Like how they started the African slave trade, still have slaves to this day and in their writings view blacks as \"subhuman?\" permalink parent award report block reply SimaYi 1 points 4 days ago Who cares? I don't give a shit if we owned slaves yesterday. How about fuck off? permalink parent award report block reply Johnkimble111 4 points 5 days ago Most white people today oppose slavery. Meanwhile Muslim ideology hasn’t changed in 1400 years, let alone the last 24 years. permalink award report block reply _Sully_ 1 points 5 days ago Honestly, at least they knew cutting off their dick would spare them a ton of headache. permalink parent award report block reply UncleTrumpsBand 2 points 5 days ago No human is illegal and no boarders n shi….white europeans are the OG refugees and therefore are entitled to all the free gibs. permalink award report block reply SimaYi 2 points 4 days ago Non-Whites have to go. permalink award report block reply Tacoboutit 1 points 4 days ago You mean he still acts like a child. permalink award report block reply Beat_to_Quarters 1 points 5 days ago Not a fair comparison either because you're blaming the religion that he follows which was responsible as the motive for a terrorist attack. That is not a superficial derail. permalink award report block reply Honkey_McCracker 1 points 4 days ago I know for a fact that several of my ancestors had slaves. Still don't care. permalink award report block reply FaratsiMoohamad 1 points 5 days ago Do not taunt happy fun ball permalink award report block reply Darkpoisonousshaddow 1 points 5 days ago Can we stop blaming Muslims for 9/11? Not that I'm batting for the ragheads but, it detracts from the fact that this was the American government that did this to its people, let's not forget that, otherwise we might as well start blaming Harvey Oswald for Kennedy's assassination. permalink award report block reply _Sully_ 1 points 5 days ago I know for a fact mine didn't. Doesn't matter. I'm complicit in a system that demands bigots blame me. I figured with that kind of power I would at least not do that. permalink award report block reply\n38WendysHamSquare79 8 points 5 days ago Conservative women are ALWAYS bette looking than liberal women. permalink award report block reply ADAM_SCHITT 4 points 5 days ago While true, this is a drawing permalink parent award report block reply EDDIT_IS_CUCKED 2 points 4 days ago And this is exactly what leftist slampigs do. They use some \"GAY\"I to create cartoons of themselves and always choose ones that look nothing like themselves and are actually attractive, because they know reality is not so kind. permalink parent award report block reply\nADAM_SCHITT 4 points 5 days ago While true, this is a drawing permalink parent award report block reply EDDIT_IS_CUCKED 2 points 4 days ago And this is exactly what leftist slampigs do. They use some \"GAY\"I to create cartoons of themselves and always choose ones that look nothing like themselves and are actually attractive, because they know reality is not so kind. permalink parent award report block reply\nEDDIT_IS_CUCKED 2 points 4 days ago And this is exactly what leftist slampigs do. They use some \"GAY\"I to create cartoons of themselves and always choose ones that look nothing like themselves and are actually attractive, because they know reality is not so kind. permalink parent award report block reply\npatrioticwinning3 5 points 5 days ago Most White people were not even here during the Civil War.  Most White People that were fought for the North.  Most people in the South didn't even own slaves.  Even if someone's ancestors did own slave that's NOT THEM! permalink award report block reply Stolen 3 points 5 days ago Now let us talk about Muslims owning slaves and  Ottomans owning Slavics permalink parent award report block reply patrioticwinning3 1 points 3 days ago Like how they started the African slave trade, still have slaves to this day and in their writings view blacks as \"subhuman?\" permalink parent award report block reply SimaYi 1 points 4 days ago Who cares? I don't give a shit if we owned slaves yesterday. How about fuck off? permalink parent award report block reply\nStolen 3 points 5 days ago Now let us talk about Muslims owning slaves and  Ottomans owning Slavics permalink parent award report block reply patrioticwinning3 1 points 3 days ago Like how they started the African slave trade, still have slaves to this day and in their writings view blacks as \"subhuman?\" permalink parent award report block reply\npatrioticwinning3 1 points 3 days ago Like how they started the African slave trade, still have slaves to this day and in their writings view blacks as \"subhuman?\" permalink parent award report block reply\nSimaYi 1 points 4 days ago Who cares? I don't give a shit if we owned slaves yesterday. How about fuck off? permalink parent award report block reply\nJohnkimble111 4 points 5 days ago Most white people today oppose slavery. Meanwhile Muslim ideology hasn’t changed in 1400 years, let alone the last 24 years. permalink award report block reply _Sully_ 1 points 5 days ago Honestly, at least they knew cutting off their dick would spare them a ton of headache. permalink parent award report block reply\n_Sully_ 1 points 5 days ago Honestly, at least they knew cutting off their dick would spare them a ton of headache. permalink parent award report block reply\nUncleTrumpsBand 2 points 5 days ago No human is illegal and no boarders n shi….white europeans are the OG refugees and therefore are entitled to all the free gibs. permalink award report block reply\nSimaYi 2 points 4 days ago Non-Whites have to go. permalink award report block reply\nTacoboutit 1 points 4 days ago You mean he still acts like a child. permalink award report block reply\nBeat_to_Quarters 1 points 5 days ago Not a fair comparison either because you're blaming the religion that he follows which was responsible as the motive for a terrorist attack. That is not a superficial derail. permalink award report block reply\nHonkey_McCracker 1 points 4 days ago I know for a fact that several of my ancestors had slaves. Still don't care. permalink award report block reply\nFaratsiMoohamad 1 points 5 days ago Do not taunt happy fun ball permalink award report block reply\nDarkpoisonousshaddow 1 points 5 days ago Can we stop blaming Muslims for 9/11? Not that I'm batting for the ragheads but, it detracts from the fact that this was the American government that did this to its people, let's not forget that, otherwise we might as well start blaming Harvey Oswald for Kennedy's assassination. permalink award report block reply\n_Sully_ 1 points 5 days ago I know for a fact mine didn't. Doesn't matter. I'm complicit in a system that demands bigots blame me. I figured with that kind of power I would at least not do that. permalink award report block reply"}