{"id": "1ARK512l6f", "contents": "545 If taxpayers fund it, taxpayers should own it. Otherwise, no deal. posted 7 days ago by kinbergfan 19 comments award share report block Grace Chong, MBI @gc22gc • 7d If taxpayers fund it, taxpayers should own it. Otherwise, no deal. Edward Dowd @DowdEdward • 7d If the Trump Administration backstops Open AI, who is planning to IPO at $ 1 trillion dollar valuation  for the benefit of its exclusive shareholders, you can kiss the midterms goodbye and it will be deserved.\n19 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style DeportThemAllForever 16 points 6 days ago Why would anyone fund that?  They make no money, they hemorrhage dollars, their revenues are peanuts compared to colossal expenses. This whole thing just doesn’t pencil out.  Engaging in circle investment pump and dump deals. Cramer already said AI is great investment and pumped every circle scheme investment. This is your next AOL moment. permalink award report block reply joggin_noggin 7 points 6 days ago $JIM, rarely wrong. When he says buy, you sell. permalink parent award report block reply DeportThemAllForever 2 points 6 days ago Best part is how they all trade products (barter) with each other, yet claim that is income on their balance sheets and get investors to give them dollars.  Entire AI is a giant circle jerk. If I give you milk, and you trade me eggs for it.  Neither one of us made money.  But when they trade graphics cards for promises of future usage in return... that's pretend income both ways.  This is insanely stupid.  And fucking Cramer sits there and tells us how thats amazing.  Fuck you Cramer!!! permalink parent award report block reply Formerlurker92 1 points 6 days ago This bubble is gonna destroy Republicans permalink parent award report block reply hillaryforprison 1 points 6 days ago Newsflash- some of the richest companies choose to 'make no money' on paper for many many years. It doesn't mean they aren't extremely valuable, like Amazon, Tesla, etc. It means they're avoiding taxes by spending that $ on their business instead of giving it away to the government. It's smart and that's how they get rich. AI is absolutely enormous and is changing the world, so yes, this will have insane levels of income potential never seen before, and those who reinvest in total dominance with infrastructure are smart, not dumb. Trump is smart for supporting the industry so the US is dominant. People were cynical like you with Google, Apple, and other companies 20-30 years ago and see how that turned out. This is way bigger than that in ways most people cannot comprehend. permalink parent award report block reply MastaJoda 13 points 6 days ago TAX PAYERS??? LOL You mean this unrepresentative, criminal federal government??? You know the fed gov hates us right? They openly propagandize and gaslight us ffs permalink award report block reply rebuildingMyself 7 points 6 days ago The fear is that if we don't do it, China will and if AI pans out we'll never catch up with them and they'll always be steps ahead in progress (think medical research, dominance in space and beyond, military tech, automated drones, etc) Not saying I believe it 100% but that's the talking point. permalink award report block reply newestofnew 6 points 6 days ago they can't do it if we don't first. they just use their espionage network to take our research. besides it's a path to ruin, agi is not possible with llm's, and no company has found roi on ai investment. permalink parent award report block reply yuge_covfefe 2 points 6 days ago I think there's value in llms (though maybe not via direct investment in llms, but more like investment in companies that leverage llms to accomplish legit non-ai business goals) - but I don't think llms are the path to agis. Maybe they'll factor in to, like, human input processing or some other relatively minor aspect. But they aren't anywhere near what people are heralding them as. They're basically Google, but faster (sometimes at the cost of accuracy of course). permalink parent award report block reply AmericanJawa 3 points 6 days ago I question the idea that AI research is as essential to the advancement of society as conventional wisdom claims. permalink parent award report block reply AmericanJawa 4 points 6 days ago If Open AI can't exist without government funding, then it shouldn't exist. permalink award report block reply Powerlevel9000 3 points 6 days ago Backstops? permalink award report block reply entwickelnden 7 points 6 days ago Helps them out, think to big to fail. permalink parent award report block reply Wexit-Delecto 3 points 6 days ago If the taxpayers owned this component of the automated open-air prison, then it wouldn't be possible to throw the taxpayers into the automated open-air prison. permalink award report block reply Mhmm2MoreWeeks 2 points 6 days ago My vote is not affected by this. My vote requires  at least 2/3 things. Clearer separation between Woke Right and mainstream MAGA. Traitors be prosecuted. COVID19 accountability. Without at least 2/3 of these I simply abstain in the midterms. Its entirely possible things have to go back to Democrat and get worse again if America has not yet learned. Perhaps another 4 year lesson is required? permalink award report block reply CanadianTrump2 1 points 6 days ago Yep well said. 2016 and 2024 was a dead cat bounce permalink parent award report block reply mailinvoter 1 points 6 days ago I find it disturbingly peculiar that the sheep always vote for the wolves instead of attempting to complain to the shepherd.  Regardless, both will eat you, but one will do it humanely. permalink award report block reply TooHotToFrost 1 points 6 days ago Time to short the US Economy. permalink award report block reply\nDeportThemAllForever 16 points 6 days ago Why would anyone fund that?  They make no money, they hemorrhage dollars, their revenues are peanuts compared to colossal expenses. This whole thing just doesn’t pencil out.  Engaging in circle investment pump and dump deals. Cramer already said AI is great investment and pumped every circle scheme investment. This is your next AOL moment. permalink award report block reply joggin_noggin 7 points 6 days ago $JIM, rarely wrong. When he says buy, you sell. permalink parent award report block reply DeportThemAllForever 2 points 6 days ago Best part is how they all trade products (barter) with each other, yet claim that is income on their balance sheets and get investors to give them dollars.  Entire AI is a giant circle jerk. If I give you milk, and you trade me eggs for it.  Neither one of us made money.  But when they trade graphics cards for promises of future usage in return... that's pretend income both ways.  This is insanely stupid.  And fucking Cramer sits there and tells us how thats amazing.  Fuck you Cramer!!! permalink parent award report block reply Formerlurker92 1 points 6 days ago This bubble is gonna destroy Republicans permalink parent award report block reply hillaryforprison 1 points 6 days ago Newsflash- some of the richest companies choose to 'make no money' on paper for many many years. It doesn't mean they aren't extremely valuable, like Amazon, Tesla, etc. It means they're avoiding taxes by spending that $ on their business instead of giving it away to the government. It's smart and that's how they get rich. AI is absolutely enormous and is changing the world, so yes, this will have insane levels of income potential never seen before, and those who reinvest in total dominance with infrastructure are smart, not dumb. Trump is smart for supporting the industry so the US is dominant. People were cynical like you with Google, Apple, and other companies 20-30 years ago and see how that turned out. This is way bigger than that in ways most people cannot comprehend. permalink parent award report block reply\njoggin_noggin 7 points 6 days ago $JIM, rarely wrong. When he says buy, you sell. permalink parent award report block reply DeportThemAllForever 2 points 6 days ago Best part is how they all trade products (barter) with each other, yet claim that is income on their balance sheets and get investors to give them dollars.  Entire AI is a giant circle jerk. If I give you milk, and you trade me eggs for it.  Neither one of us made money.  But when they trade graphics cards for promises of future usage in return... that's pretend income both ways.  This is insanely stupid.  And fucking Cramer sits there and tells us how thats amazing.  Fuck you Cramer!!! permalink parent award report block reply\nDeportThemAllForever 2 points 6 days ago Best part is how they all trade products (barter) with each other, yet claim that is income on their balance sheets and get investors to give them dollars.  Entire AI is a giant circle jerk. If I give you milk, and you trade me eggs for it.  Neither one of us made money.  But when they trade graphics cards for promises of future usage in return... that's pretend income both ways.  This is insanely stupid.  And fucking Cramer sits there and tells us how thats amazing.  Fuck you Cramer!!! permalink parent award report block reply\nFormerlurker92 1 points 6 days ago This bubble is gonna destroy Republicans permalink parent award report block reply\nhillaryforprison 1 points 6 days ago Newsflash- some of the richest companies choose to 'make no money' on paper for many many years. It doesn't mean they aren't extremely valuable, like Amazon, Tesla, etc. It means they're avoiding taxes by spending that $ on their business instead of giving it away to the government. It's smart and that's how they get rich. AI is absolutely enormous and is changing the world, so yes, this will have insane levels of income potential never seen before, and those who reinvest in total dominance with infrastructure are smart, not dumb. Trump is smart for supporting the industry so the US is dominant. People were cynical like you with Google, Apple, and other companies 20-30 years ago and see how that turned out. This is way bigger than that in ways most people cannot comprehend. permalink parent award report block reply\nMastaJoda 13 points 6 days ago TAX PAYERS??? LOL You mean this unrepresentative, criminal federal government??? You know the fed gov hates us right? They openly propagandize and gaslight us ffs permalink award report block reply\nrebuildingMyself 7 points 6 days ago The fear is that if we don't do it, China will and if AI pans out we'll never catch up with them and they'll always be steps ahead in progress (think medical research, dominance in space and beyond, military tech, automated drones, etc) Not saying I believe it 100% but that's the talking point. permalink award report block reply newestofnew 6 points 6 days ago they can't do it if we don't first. they just use their espionage network to take our research. besides it's a path to ruin, agi is not possible with llm's, and no company has found roi on ai investment. permalink parent award report block reply yuge_covfefe 2 points 6 days ago I think there's value in llms (though maybe not via direct investment in llms, but more like investment in companies that leverage llms to accomplish legit non-ai business goals) - but I don't think llms are the path to agis. Maybe they'll factor in to, like, human input processing or some other relatively minor aspect. But they aren't anywhere near what people are heralding them as. They're basically Google, but faster (sometimes at the cost of accuracy of course). permalink parent award report block reply AmericanJawa 3 points 6 days ago I question the idea that AI research is as essential to the advancement of society as conventional wisdom claims. permalink parent award report block reply\nnewestofnew 6 points 6 days ago they can't do it if we don't first. they just use their espionage network to take our research. besides it's a path to ruin, agi is not possible with llm's, and no company has found roi on ai investment. permalink parent award report block reply yuge_covfefe 2 points 6 days ago I think there's value in llms (though maybe not via direct investment in llms, but more like investment in companies that leverage llms to accomplish legit non-ai business goals) - but I don't think llms are the path to agis. Maybe they'll factor in to, like, human input processing or some other relatively minor aspect. But they aren't anywhere near what people are heralding them as. They're basically Google, but faster (sometimes at the cost of accuracy of course). permalink parent award report block reply\nyuge_covfefe 2 points 6 days ago I think there's value in llms (though maybe not via direct investment in llms, but more like investment in companies that leverage llms to accomplish legit non-ai business goals) - but I don't think llms are the path to agis. Maybe they'll factor in to, like, human input processing or some other relatively minor aspect. But they aren't anywhere near what people are heralding them as. They're basically Google, but faster (sometimes at the cost of accuracy of course). permalink parent award report block reply\nAmericanJawa 3 points 6 days ago I question the idea that AI research is as essential to the advancement of society as conventional wisdom claims. permalink parent award report block reply\nAmericanJawa 4 points 6 days ago If Open AI can't exist without government funding, then it shouldn't exist. permalink award report block reply\nPowerlevel9000 3 points 6 days ago Backstops? permalink award report block reply entwickelnden 7 points 6 days ago Helps them out, think to big to fail. permalink parent award report block reply\nentwickelnden 7 points 6 days ago Helps them out, think to big to fail. permalink parent award report block reply\nWexit-Delecto 3 points 6 days ago If the taxpayers owned this component of the automated open-air prison, then it wouldn't be possible to throw the taxpayers into the automated open-air prison. permalink award report block reply\nMhmm2MoreWeeks 2 points 6 days ago My vote is not affected by this. My vote requires  at least 2/3 things. Clearer separation between Woke Right and mainstream MAGA. Traitors be prosecuted. COVID19 accountability. Without at least 2/3 of these I simply abstain in the midterms. Its entirely possible things have to go back to Democrat and get worse again if America has not yet learned. Perhaps another 4 year lesson is required? permalink award report block reply CanadianTrump2 1 points 6 days ago Yep well said. 2016 and 2024 was a dead cat bounce permalink parent award report block reply\nCanadianTrump2 1 points 6 days ago Yep well said. 2016 and 2024 was a dead cat bounce permalink parent award report block reply\nmailinvoter 1 points 6 days ago I find it disturbingly peculiar that the sheep always vote for the wolves instead of attempting to complain to the shepherd.  Regardless, both will eat you, but one will do it humanely. permalink award report block reply\nTooHotToFrost 1 points 6 days ago Time to short the US Economy. permalink award report block reply"}