{"id": "1ARK9hkCpC", "contents": "749 Together, Bill Maher and Cheryl Hines expose the key difference between Republicans and the modern-day left. posted 2 days ago by kek_saved_the_world 40 comments award share report block Overton @overton_news • 2d Together, Bill Maher and Cheryl Hines expose the key difference between Republicans and the modern-day left. One side thinks you’re wrong, the other wants to shun you entirely. Maher shared a glimpse of this from his dinner with President Trump. MAHER: “I hope to have dinner\n40 comments Sort by Top Top New Worst Old Save Elon Walked Away – Now We Know Why Read More Ads by Ad.Style reversethefraud 50 points 2 days ago Mahr, that stupid little fuck, gets is incorrect again. They do not want to shun us, they want to violence us. permalink award report block reply Oldman6541E5 30 points 2 days ago He is and always has been a weasel. permalink parent award report block reply MagaMom69 18 points 2 days ago One of my girlfriends had an extra ticket (her husband didn't want to go) 10 years ago, and she lost it when I said something just like that, \"He is such a weasel.\" permalink parent award report block reply Patriot5TN 8 points 2 days ago Vanessa? We are divorced now. permalink parent award report block reply ImYourHuckleberry24 8 points 2 days ago They want us all dead. permalink parent award report block reply SicSemperTyrannis2 1 points 2 days ago Charlie Kirk style permalink parent award report block reply awsure 6 points 2 days ago Just who the fuck are these imaginary nice democrats he remembers from the past? Ted Kennedy? LBJ? Wilson? Booth? permalink parent award report block reply TrumpAndGodWin 2 points 2 days ago Ted Kennedy was a pedophile, infowars dot com (from the George Green recording). permalink parent award report block reply Viewer01 2 points 2 days ago Boomers are just trying to die broke and in denial, whilst leaving us in the middle of a communist revolution. These past few months have me real worried. Communists and antifa are out in the open now and the young right is ready to start murdering people. We’re soon to get our own militant branch on the right. All it’s going to take is boomers dying and for these commies to get in even deeper and then we’re going to be counter revolting against communists. Kirk dying has unironically put us on a crash course with civil war. permalink parent award report block reply Coprolite 7 points 2 days ago Look to the end of Weimar Germany for pointers. permalink parent award report block reply Viewer01 4 points 2 days ago That is why I’m stressing. Fuentes and carlson are probably the two most important heart beats in America right now. permalink parent award report block reply Coprolite 2 points 2 days ago Best advice I can give is read the book \"when money dies\" and for the love of God don't be greedy. permalink parent award report block reply edxzxz 1 points 2 days ago So what are you worried about, that it won't come soon enough?  I was hoping they'd steal the election again in 2024 so we could just get to the inevitable civil war sooner rather than later. permalink parent award report block reply LiberalsAreMental 2 points 2 days ago they want to violence us. Look at what they do to their own children: https://clinicquotes.com/abortion-pictures permalink parent award report block reply load 2 more comments... PensivePatriot 15 points 2 days ago Really? Shun? No, Maher. They want to Shoot us. Saying any different is mitigating speech in democrats favor. permalink award report block reply TGNX 2 points 2 days ago He's not there, yet. He has slowly become more and more aware of the communist infiltration of the Democrats, but he's still just scratching the surface that we broke through years ago. He's getting there slowly, but may not figure it out in his lifetime. permalink parent award report block reply ThorsonTT 7 points 2 days ago Conservatives, for years, have described it as 'one side thiks you're wrong, the other thinks you're evil'. permalink award report block reply Noire 9 points 2 days ago This used to my stance but at this point, a whole lot of them are in fact evil. permalink parent award report block reply Agenda47 5 points 2 days ago They are. The version I prefer is \"Leftists think conservatives are evil, but we're really just naive. Conservatives think the left are naive, but they're really just evil.\" permalink parent award report block reply Doritalos 5 points 2 days ago Who cares what the (((goblin))) has to say. permalink award report block reply AmericanJawa 4 points 2 days ago It's like he wants to leave the Democrat party but he just can't bring himself to do it for some reason. permalink award report block reply Psarg 2 points 2 days ago Bill Maher exists to keep questioning Democrats voting Democrat. permalink parent award report block reply redditadminssuckit 3 points 2 days ago Dumb cunts admit that Democrats don't listen, they are irrational, they are inflexible and intolerant and yet they continue to vote for democrats. Fuck both of them permalink award report block reply 4886Battery 0 points 2 days ago They're perfectly rational if you consider their beliefs system, they see us as evil and ending us would bring about their liberal utopia, in their minds. permalink parent award report block reply negative_entropy 3 points 2 days ago the dems when they left they had cultural ascendency cancelled anyone who did not conform to their heterodoxy. Now that they dont have any more power, that shit is gonna be ineffective permalink award report block reply BillPigg 2 points 2 days ago Today's MAGA philosophies are pretty much the same as the democrats from 30 years ago. Just listen to any speech from the mid 1990s. Today's modern Democrats have gone full communist. permalink award report block reply Bubbahax 2 points 2 days ago Maher is an avowed leftist who stays semi-relevant by making an occasional remark that caters to the right.  Ignore him forever. permalink award report block reply Pede 2 points 2 days ago Forgive us, we have a lot of idiots here who have a visceral reaction to seeing Bill Maher, exactly like TDS, and they won't turn on their brain to understand how positive it is for a Democrat to point out to his large Democrat audience the way Democrats have been acting, and have his Democrat audience in the cup of his hand enough that they sit there and listen without booing him for it. permalink award report block reply RoosterCrow 1 points 2 days ago He’s so tiny. permalink award report block reply Skabliggum2 1 points 2 days ago Bill's done so much coke that he's become sane permalink award report block reply TenchuStealthAss 1 points 2 days ago \"That's the difference, I think...people don't see.\" This fuck nut is like 10 years late on this. permalink award report block reply Kolob64 1 points 2 days ago As someone fairly centrist, I have lived in D areas and R areas.  Guess who was nicer to me?  Yep, R. permalink award report block reply Bramage 1 points 2 days ago Uniparty permalink award report block reply 4886Battery 1 points 2 days ago Identity politics has been the best friend of the Marxists.  We're raised with morals and principles handed down to us from our parents and we use those lessons to determine our social and political belief systems.  The Left is ass-backward, they either reject those lessons or never learn them, then they enter college and/or adulthood not really having an identity, so they gravitate to what makes them feel good, what makes them feel like they belong, and at those ages and those settings that's going to be liberal ideology, the plan based almost entirely on emotional premises and denouncing facts and reality.  Their social and political ideology forms their identity, and as such and by definition, a person like that cannot have a discussion with those who believe differently, even slightly, because that would be the same as agreeing with the other \"side\".  The best they can do is pretend to act civilly while on the inside they wish you didn't exist.  This is how seemingly moral and nice people can show glee when others are killed who they simply disagree on their political and/or social beliefs. permalink award report block reply edxzxz 0 points 2 days ago Cheryl Hines is a disgusting commie retard whore.  She shilled to have Alexander Vindman in a recurring role in 'Curb Your Enthusiasm' casting him as a hero, in that show she divorces her husband to fuck around with Ted Danson, who is a rabid leftard and who was married to Whoopie Goldberg in real life.  The whole group of her professional and personal associates are rabid TDS retards.  I assume her only reason for being with RFK Jr.s is publicity, since she's a shameless whore. permalink award report block reply FatigueIsReal -4 points 2 days ago Translation: \"Its a shit political party, but I'll vote for them anyway because I like keeping my job.\" permalink award report block reply bidensmissingbrain 2 points 2 days ago I mean, no job = no money and he is jewish... permalink parent award report block reply PensivePatriot -2 points 2 days ago Why in the utter fuck are you being downvoted? That’s been Maher’s shtick for literally my entire life. permalink parent award report block reply BaguettesOfRudysSUB 1 points 2 days ago It's an anti-MAGA bot, you dipshit. permalink parent award report block reply\nreversethefraud 50 points 2 days ago Mahr, that stupid little fuck, gets is incorrect again. They do not want to shun us, they want to violence us. permalink award report block reply Oldman6541E5 30 points 2 days ago He is and always has been a weasel. permalink parent award report block reply MagaMom69 18 points 2 days ago One of my girlfriends had an extra ticket (her husband didn't want to go) 10 years ago, and she lost it when I said something just like that, \"He is such a weasel.\" permalink parent award report block reply Patriot5TN 8 points 2 days ago Vanessa? We are divorced now. permalink parent award report block reply ImYourHuckleberry24 8 points 2 days ago They want us all dead. permalink parent award report block reply SicSemperTyrannis2 1 points 2 days ago Charlie Kirk style permalink parent award report block reply awsure 6 points 2 days ago Just who the fuck are these imaginary nice democrats he remembers from the past? Ted Kennedy? LBJ? Wilson? Booth? permalink parent award report block reply TrumpAndGodWin 2 points 2 days ago Ted Kennedy was a pedophile, infowars dot com (from the George Green recording). permalink parent award report block reply Viewer01 2 points 2 days ago Boomers are just trying to die broke and in denial, whilst leaving us in the middle of a communist revolution. These past few months have me real worried. Communists and antifa are out in the open now and the young right is ready to start murdering people. We’re soon to get our own militant branch on the right. All it’s going to take is boomers dying and for these commies to get in even deeper and then we’re going to be counter revolting against communists. Kirk dying has unironically put us on a crash course with civil war. permalink parent award report block reply Coprolite 7 points 2 days ago Look to the end of Weimar Germany for pointers. permalink parent award report block reply Viewer01 4 points 2 days ago That is why I’m stressing. Fuentes and carlson are probably the two most important heart beats in America right now. permalink parent award report block reply Coprolite 2 points 2 days ago Best advice I can give is read the book \"when money dies\" and for the love of God don't be greedy. permalink parent award report block reply edxzxz 1 points 2 days ago So what are you worried about, that it won't come soon enough?  I was hoping they'd steal the election again in 2024 so we could just get to the inevitable civil war sooner rather than later. permalink parent award report block reply LiberalsAreMental 2 points 2 days ago they want to violence us. Look at what they do to their own children: https://clinicquotes.com/abortion-pictures permalink parent award report block reply load 2 more comments...\nOldman6541E5 30 points 2 days ago He is and always has been a weasel. permalink parent award report block reply MagaMom69 18 points 2 days ago One of my girlfriends had an extra ticket (her husband didn't want to go) 10 years ago, and she lost it when I said something just like that, \"He is such a weasel.\" permalink parent award report block reply Patriot5TN 8 points 2 days ago Vanessa? We are divorced now. permalink parent award report block reply\nMagaMom69 18 points 2 days ago One of my girlfriends had an extra ticket (her husband didn't want to go) 10 years ago, and she lost it when I said something just like that, \"He is such a weasel.\" permalink parent award report block reply Patriot5TN 8 points 2 days ago Vanessa? We are divorced now. permalink parent award report block reply\nPatriot5TN 8 points 2 days ago Vanessa? We are divorced now. permalink parent award report block reply\nImYourHuckleberry24 8 points 2 days ago They want us all dead. permalink parent award report block reply SicSemperTyrannis2 1 points 2 days ago Charlie Kirk style permalink parent award report block reply\nSicSemperTyrannis2 1 points 2 days ago Charlie Kirk style permalink parent award report block reply\nawsure 6 points 2 days ago Just who the fuck are these imaginary nice democrats he remembers from the past? Ted Kennedy? LBJ? Wilson? Booth? permalink parent award report block reply TrumpAndGodWin 2 points 2 days ago Ted Kennedy was a pedophile, infowars dot com (from the George Green recording). permalink parent award report block reply\nTrumpAndGodWin 2 points 2 days ago Ted Kennedy was a pedophile, infowars dot com (from the George Green recording). permalink parent award report block reply\nViewer01 2 points 2 days ago Boomers are just trying to die broke and in denial, whilst leaving us in the middle of a communist revolution. These past few months have me real worried. Communists and antifa are out in the open now and the young right is ready to start murdering people. We’re soon to get our own militant branch on the right. All it’s going to take is boomers dying and for these commies to get in even deeper and then we’re going to be counter revolting against communists. Kirk dying has unironically put us on a crash course with civil war. permalink parent award report block reply Coprolite 7 points 2 days ago Look to the end of Weimar Germany for pointers. permalink parent award report block reply Viewer01 4 points 2 days ago That is why I’m stressing. Fuentes and carlson are probably the two most important heart beats in America right now. permalink parent award report block reply Coprolite 2 points 2 days ago Best advice I can give is read the book \"when money dies\" and for the love of God don't be greedy. permalink parent award report block reply edxzxz 1 points 2 days ago So what are you worried about, that it won't come soon enough?  I was hoping they'd steal the election again in 2024 so we could just get to the inevitable civil war sooner rather than later. permalink parent award report block reply\nCoprolite 7 points 2 days ago Look to the end of Weimar Germany for pointers. permalink parent award report block reply Viewer01 4 points 2 days ago That is why I’m stressing. Fuentes and carlson are probably the two most important heart beats in America right now. permalink parent award report block reply Coprolite 2 points 2 days ago Best advice I can give is read the book \"when money dies\" and for the love of God don't be greedy. permalink parent award report block reply\nViewer01 4 points 2 days ago That is why I’m stressing. Fuentes and carlson are probably the two most important heart beats in America right now. permalink parent award report block reply Coprolite 2 points 2 days ago Best advice I can give is read the book \"when money dies\" and for the love of God don't be greedy. permalink parent award report block reply\nCoprolite 2 points 2 days ago Best advice I can give is read the book \"when money dies\" and for the love of God don't be greedy. permalink parent award report block reply\nedxzxz 1 points 2 days ago So what are you worried about, that it won't come soon enough?  I was hoping they'd steal the election again in 2024 so we could just get to the inevitable civil war sooner rather than later. permalink parent award report block reply\nLiberalsAreMental 2 points 2 days ago they want to violence us. Look at what they do to their own children: https://clinicquotes.com/abortion-pictures permalink parent award report block reply\nPensivePatriot 15 points 2 days ago Really? Shun? No, Maher. They want to Shoot us. Saying any different is mitigating speech in democrats favor. permalink award report block reply TGNX 2 points 2 days ago He's not there, yet. He has slowly become more and more aware of the communist infiltration of the Democrats, but he's still just scratching the surface that we broke through years ago. He's getting there slowly, but may not figure it out in his lifetime. permalink parent award report block reply\nTGNX 2 points 2 days ago He's not there, yet. He has slowly become more and more aware of the communist infiltration of the Democrats, but he's still just scratching the surface that we broke through years ago. He's getting there slowly, but may not figure it out in his lifetime. permalink parent award report block reply\nThorsonTT 7 points 2 days ago Conservatives, for years, have described it as 'one side thiks you're wrong, the other thinks you're evil'. permalink award report block reply Noire 9 points 2 days ago This used to my stance but at this point, a whole lot of them are in fact evil. permalink parent award report block reply Agenda47 5 points 2 days ago They are. The version I prefer is \"Leftists think conservatives are evil, but we're really just naive. Conservatives think the left are naive, but they're really just evil.\" permalink parent award report block reply\nNoire 9 points 2 days ago This used to my stance but at this point, a whole lot of them are in fact evil. permalink parent award report block reply Agenda47 5 points 2 days ago They are. The version I prefer is \"Leftists think conservatives are evil, but we're really just naive. Conservatives think the left are naive, but they're really just evil.\" permalink parent award report block reply\nAgenda47 5 points 2 days ago They are. The version I prefer is \"Leftists think conservatives are evil, but we're really just naive. Conservatives think the left are naive, but they're really just evil.\" permalink parent award report block reply\nDoritalos 5 points 2 days ago Who cares what the (((goblin))) has to say. permalink award report block reply\nAmericanJawa 4 points 2 days ago It's like he wants to leave the Democrat party but he just can't bring himself to do it for some reason. permalink award report block reply Psarg 2 points 2 days ago Bill Maher exists to keep questioning Democrats voting Democrat. permalink parent award report block reply\nPsarg 2 points 2 days ago Bill Maher exists to keep questioning Democrats voting Democrat. permalink parent award report block reply\nredditadminssuckit 3 points 2 days ago Dumb cunts admit that Democrats don't listen, they are irrational, they are inflexible and intolerant and yet they continue to vote for democrats. Fuck both of them permalink award report block reply 4886Battery 0 points 2 days ago They're perfectly rational if you consider their beliefs system, they see us as evil and ending us would bring about their liberal utopia, in their minds. permalink parent award report block reply\n4886Battery 0 points 2 days ago They're perfectly rational if you consider their beliefs system, they see us as evil and ending us would bring about their liberal utopia, in their minds. permalink parent award report block reply\nnegative_entropy 3 points 2 days ago the dems when they left they had cultural ascendency cancelled anyone who did not conform to their heterodoxy. Now that they dont have any more power, that shit is gonna be ineffective permalink award report block reply\nBillPigg 2 points 2 days ago Today's MAGA philosophies are pretty much the same as the democrats from 30 years ago. Just listen to any speech from the mid 1990s. Today's modern Democrats have gone full communist. permalink award report block reply\nBubbahax 2 points 2 days ago Maher is an avowed leftist who stays semi-relevant by making an occasional remark that caters to the right.  Ignore him forever. permalink award report block reply\nPede 2 points 2 days ago Forgive us, we have a lot of idiots here who have a visceral reaction to seeing Bill Maher, exactly like TDS, and they won't turn on their brain to understand how positive it is for a Democrat to point out to his large Democrat audience the way Democrats have been acting, and have his Democrat audience in the cup of his hand enough that they sit there and listen without booing him for it. permalink award report block reply\nRoosterCrow 1 points 2 days ago He’s so tiny. permalink award report block reply\nSkabliggum2 1 points 2 days ago Bill's done so much coke that he's become sane permalink award report block reply\nTenchuStealthAss 1 points 2 days ago \"That's the difference, I think...people don't see.\" This fuck nut is like 10 years late on this. permalink award report block reply\nKolob64 1 points 2 days ago As someone fairly centrist, I have lived in D areas and R areas.  Guess who was nicer to me?  Yep, R. permalink award report block reply\nBramage 1 points 2 days ago Uniparty permalink award report block reply\n4886Battery 1 points 2 days ago Identity politics has been the best friend of the Marxists.  We're raised with morals and principles handed down to us from our parents and we use those lessons to determine our social and political belief systems.  The Left is ass-backward, they either reject those lessons or never learn them, then they enter college and/or adulthood not really having an identity, so they gravitate to what makes them feel good, what makes them feel like they belong, and at those ages and those settings that's going to be liberal ideology, the plan based almost entirely on emotional premises and denouncing facts and reality.  Their social and political ideology forms their identity, and as such and by definition, a person like that cannot have a discussion with those who believe differently, even slightly, because that would be the same as agreeing with the other \"side\".  The best they can do is pretend to act civilly while on the inside they wish you didn't exist.  This is how seemingly moral and nice people can show glee when others are killed who they simply disagree on their political and/or social beliefs. permalink award report block reply\nedxzxz 0 points 2 days ago Cheryl Hines is a disgusting commie retard whore.  She shilled to have Alexander Vindman in a recurring role in 'Curb Your Enthusiasm' casting him as a hero, in that show she divorces her husband to fuck around with Ted Danson, who is a rabid leftard and who was married to Whoopie Goldberg in real life.  The whole group of her professional and personal associates are rabid TDS retards.  I assume her only reason for being with RFK Jr.s is publicity, since she's a shameless whore. permalink award report block reply\nFatigueIsReal -4 points 2 days ago Translation: \"Its a shit political party, but I'll vote for them anyway because I like keeping my job.\" permalink award report block reply bidensmissingbrain 2 points 2 days ago I mean, no job = no money and he is jewish... permalink parent award report block reply PensivePatriot -2 points 2 days ago Why in the utter fuck are you being downvoted? That’s been Maher’s shtick for literally my entire life. permalink parent award report block reply BaguettesOfRudysSUB 1 points 2 days ago It's an anti-MAGA bot, you dipshit. permalink parent award report block reply\nbidensmissingbrain 2 points 2 days ago I mean, no job = no money and he is jewish... permalink parent award report block reply\nPensivePatriot -2 points 2 days ago Why in the utter fuck are you being downvoted? That’s been Maher’s shtick for literally my entire life. permalink parent award report block reply BaguettesOfRudysSUB 1 points 2 days ago It's an anti-MAGA bot, you dipshit. permalink parent award report block reply\nBaguettesOfRudysSUB 1 points 2 days ago It's an anti-MAGA bot, you dipshit. permalink parent award report block reply"}