{"id": "1ARK9mHmZZ", "contents": "49 Open Post to all obvious faggots - If Trump was focusing on America and securing our future ... then there would not be an upheaval against him. posted 11 hours ago by MickHigan2 17 comments award share report block He is focusing on shit NONE of us voted for. 600k chinese students, military bases in the middle east, posturing for more H1-b imports (after saying Americans are less capable than Indians)... the list goes on. The fact your countersignaling real AF  /  MAGA shows us that you are not serious about our future as a nation. Your disdain for people calling out what's right shows us that you don't really give a shit about our future. To be honest, this is precisely what paid shills would do. You're not going to guilt us into relinquishing real AF / MAGA policies. Trump can fix this if he just acts accordingly and listens.. but since scamela blondi is still at the helm... people are losing hope that he will correct ship.\n17 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style MickHigan2 OP 11 points 11 hours ago Laura: \"We have plenty of talented people here!\" Trump: \"No, you don't. No, you don't... No, you don't have... You don't have certain talents and you have to... People have to learn.\" Seriously... what the fuck and who the fuck is in his ear? https://x.com/disclosetv/status/1988413738962112713 permalink award report block reply couranto 0 points 10 hours ago Vote Democrat then. permalink parent award report block reply _2022_ 10 points 11 hours ago Yeah man the blind loyalty on this site to Trump and to a party that does nothing for them is comparable to mindless dems who vote blue no matter who. permalink award report block reply SuperDuperBasedMD 5 points 11 hours ago So, I agree that those are not pro-MAGA positions. But this is politics. There are always compromises. But what do you think is more important?\ncutting H1b or reshoring manufacturing through tariffs? allowing 600k Chinese students or bringing Universities to heel and stopping mass indoctrination of our children? Mideast military bases or not getting sucked into a land war in Iran or a direct confrontation with Russia in Ukraine? What's more important than mass deportations?\nWhat's more important than a secure border?\nWhat's more important than cutting Fentanyl deaths?\nWhat's more important than stopping crime in our cities? You can disagree with Trump. But when people talk about abandoning Trump then I think that they're not really MAGA. I begin to wonder whether they're shills. permalink award report block reply SpaceWizard 4 points 11 hours ago Also what's going to happen if the Dems win? Digital ID? Open the flood gates at the border? Probably way worse. Abandoning Trump now would be extremely foolish. He's the best we got, we gotta stand strong with him and trust him. MAGA🇺🇸✝️ permalink parent award report block reply AgnosticTemplar 5 points 10 hours ago No, we gotta hammer him and bring hin to heel. He's meant to serve us. permalink parent award report block reply SuperDuperBasedMD 4 points 11 hours ago The first thing will probably be Abolish the filibuster (lol)\nOpen the floodgates to illegals\nMass amnesty for illegals\nRepeal tariffs\nBoots on the ground in Ukraine\nPossible hot war with Russia\nFurther penetration of our economy/elites by China\nPack the Supreme Court\nEviscerate 2A\nAbortion legal everywhere\nMail in ballots everywhere\nArrest prominent conservatives\nLawfare against outspoken conservatives\nDEI everywhere (no jobs for your children unless they Trans)\nTrans agenda\nMAP agenda\nMore corruption\nGay the military again\nMore socialism\nNo free speech, especially on social media permalink parent award report block reply Aggrieved03 0 points 10 hours ago He’s assuring them a win! permalink parent award report block reply BonginosRac1stCowboy 1 points 11 hours ago Comment removed by community moderators. permalink parent award report block reply RejectRedditization 3 points 11 hours ago Yeah it's politics, and it's helping the Dems. permalink parent award report block reply tt777 1 points 10 hours ago We can walk and chew gum at the same time. Great to do things that might create more manufacturing jobs, wrong to keep policies destroying white collar jobs. Great to take universities to heel for their woke indoctrination, wrong to allow hundreds of thousands of communists into those universities. permalink parent award report block reply Be_The_Change 1 points 11 hours ago Comment removed by community moderators. permalink parent award report block reply Sancei 2 points 7 hours ago They did try to kill him, and he does have family...what would you do really?\nThe whole system is corrupted.\nAnd he is one man with enemies all around. But the 2 more week crap and the endless compromise have to stop. He needs to level with people. That way Americans can more forward. permalink award report block reply JiggsawCalrissian 1 points 11 hours ago Yeah... not looking all that great. But the alternative is swallowing a leftists gun. So... whats plan b permalink award report block reply Aggrieved03 1 points 10 hours ago Doomer! The Gaza Taj Mahal is going to be amazing! permalink award report block reply SisterCovfefeToo 0 points 10 hours ago He's making off hand comments that are being given the weight of policy by others so they can get attention on the internet. It's the right's version of the TikTok influencer having a meltdown in her car. permalink award report block reply Givesgunstogrannies 0 points 10 hours ago If he had rallies still, the boos would cause him to course correct.  Instead his advisors are f'ng him. I have about 15 MAGA hats I've retired from wear and tear/sweat stains.  I have 4 that I can currently wear. They have been put away. It's all White Boy Summer hats from here out.  America First > MAGA permalink award report block reply\nMickHigan2 OP 11 points 11 hours ago Laura: \"We have plenty of talented people here!\" Trump: \"No, you don't. No, you don't... No, you don't have... You don't have certain talents and you have to... People have to learn.\" Seriously... what the fuck and who the fuck is in his ear? https://x.com/disclosetv/status/1988413738962112713 permalink award report block reply couranto 0 points 10 hours ago Vote Democrat then. permalink parent award report block reply\ncouranto 0 points 10 hours ago Vote Democrat then. permalink parent award report block reply\n_2022_ 10 points 11 hours ago Yeah man the blind loyalty on this site to Trump and to a party that does nothing for them is comparable to mindless dems who vote blue no matter who. permalink award report block reply\nSuperDuperBasedMD 5 points 11 hours ago So, I agree that those are not pro-MAGA positions. But this is politics. There are always compromises. But what do you think is more important?\ncutting H1b or reshoring manufacturing through tariffs? allowing 600k Chinese students or bringing Universities to heel and stopping mass indoctrination of our children? Mideast military bases or not getting sucked into a land war in Iran or a direct confrontation with Russia in Ukraine? What's more important than mass deportations?\nWhat's more important than a secure border?\nWhat's more important than cutting Fentanyl deaths?\nWhat's more important than stopping crime in our cities? You can disagree with Trump. But when people talk about abandoning Trump then I think that they're not really MAGA. I begin to wonder whether they're shills. permalink award report block reply SpaceWizard 4 points 11 hours ago Also what's going to happen if the Dems win? Digital ID? Open the flood gates at the border? Probably way worse. Abandoning Trump now would be extremely foolish. He's the best we got, we gotta stand strong with him and trust him. MAGA🇺🇸✝️ permalink parent award report block reply AgnosticTemplar 5 points 10 hours ago No, we gotta hammer him and bring hin to heel. He's meant to serve us. permalink parent award report block reply SuperDuperBasedMD 4 points 11 hours ago The first thing will probably be Abolish the filibuster (lol)\nOpen the floodgates to illegals\nMass amnesty for illegals\nRepeal tariffs\nBoots on the ground in Ukraine\nPossible hot war with Russia\nFurther penetration of our economy/elites by China\nPack the Supreme Court\nEviscerate 2A\nAbortion legal everywhere\nMail in ballots everywhere\nArrest prominent conservatives\nLawfare against outspoken conservatives\nDEI everywhere (no jobs for your children unless they Trans)\nTrans agenda\nMAP agenda\nMore corruption\nGay the military again\nMore socialism\nNo free speech, especially on social media permalink parent award report block reply Aggrieved03 0 points 10 hours ago He’s assuring them a win! permalink parent award report block reply BonginosRac1stCowboy 1 points 11 hours ago Comment removed by community moderators. permalink parent award report block reply RejectRedditization 3 points 11 hours ago Yeah it's politics, and it's helping the Dems. permalink parent award report block reply tt777 1 points 10 hours ago We can walk and chew gum at the same time. Great to do things that might create more manufacturing jobs, wrong to keep policies destroying white collar jobs. Great to take universities to heel for their woke indoctrination, wrong to allow hundreds of thousands of communists into those universities. permalink parent award report block reply Be_The_Change 1 points 11 hours ago Comment removed by community moderators. permalink parent award report block reply\nSpaceWizard 4 points 11 hours ago Also what's going to happen if the Dems win? Digital ID? Open the flood gates at the border? Probably way worse. Abandoning Trump now would be extremely foolish. He's the best we got, we gotta stand strong with him and trust him. MAGA🇺🇸✝️ permalink parent award report block reply AgnosticTemplar 5 points 10 hours ago No, we gotta hammer him and bring hin to heel. He's meant to serve us. permalink parent award report block reply SuperDuperBasedMD 4 points 11 hours ago The first thing will probably be Abolish the filibuster (lol)\nOpen the floodgates to illegals\nMass amnesty for illegals\nRepeal tariffs\nBoots on the ground in Ukraine\nPossible hot war with Russia\nFurther penetration of our economy/elites by China\nPack the Supreme Court\nEviscerate 2A\nAbortion legal everywhere\nMail in ballots everywhere\nArrest prominent conservatives\nLawfare against outspoken conservatives\nDEI everywhere (no jobs for your children unless they Trans)\nTrans agenda\nMAP agenda\nMore corruption\nGay the military again\nMore socialism\nNo free speech, especially on social media permalink parent award report block reply Aggrieved03 0 points 10 hours ago He’s assuring them a win! permalink parent award report block reply BonginosRac1stCowboy 1 points 11 hours ago Comment removed by community moderators. permalink parent award report block reply\nAgnosticTemplar 5 points 10 hours ago No, we gotta hammer him and bring hin to heel. He's meant to serve us. permalink parent award report block reply\nSuperDuperBasedMD 4 points 11 hours ago The first thing will probably be Abolish the filibuster (lol)\nOpen the floodgates to illegals\nMass amnesty for illegals\nRepeal tariffs\nBoots on the ground in Ukraine\nPossible hot war with Russia\nFurther penetration of our economy/elites by China\nPack the Supreme Court\nEviscerate 2A\nAbortion legal everywhere\nMail in ballots everywhere\nArrest prominent conservatives\nLawfare against outspoken conservatives\nDEI everywhere (no jobs for your children unless they Trans)\nTrans agenda\nMAP agenda\nMore corruption\nGay the military again\nMore socialism\nNo free speech, especially on social media permalink parent award report block reply\nAggrieved03 0 points 10 hours ago He’s assuring them a win! permalink parent award report block reply\nBonginosRac1stCowboy 1 points 11 hours ago Comment removed by community moderators. permalink parent award report block reply\nRejectRedditization 3 points 11 hours ago Yeah it's politics, and it's helping the Dems. permalink parent award report block reply\ntt777 1 points 10 hours ago We can walk and chew gum at the same time. Great to do things that might create more manufacturing jobs, wrong to keep policies destroying white collar jobs. Great to take universities to heel for their woke indoctrination, wrong to allow hundreds of thousands of communists into those universities. permalink parent award report block reply\nBe_The_Change 1 points 11 hours ago Comment removed by community moderators. permalink parent award report block reply\nSancei 2 points 7 hours ago They did try to kill him, and he does have family...what would you do really?\nThe whole system is corrupted.\nAnd he is one man with enemies all around. But the 2 more week crap and the endless compromise have to stop. He needs to level with people. That way Americans can more forward. permalink award report block reply\nJiggsawCalrissian 1 points 11 hours ago Yeah... not looking all that great. But the alternative is swallowing a leftists gun. So... whats plan b permalink award report block reply\nAggrieved03 1 points 10 hours ago Doomer! The Gaza Taj Mahal is going to be amazing! permalink award report block reply\nSisterCovfefeToo 0 points 10 hours ago He's making off hand comments that are being given the weight of policy by others so they can get attention on the internet. It's the right's version of the TikTok influencer having a meltdown in her car. permalink award report block reply\nGivesgunstogrannies 0 points 10 hours ago If he had rallies still, the boos would cause him to course correct.  Instead his advisors are f'ng him. I have about 15 MAGA hats I've retired from wear and tear/sweat stains.  I have 4 that I can currently wear. They have been put away. It's all White Boy Summer hats from here out.  America First > MAGA permalink award report block reply"}