{"id": "1ARK9jzLdd", "contents": "816 What ever Arabs say in English is different from what they say in Arabic posted 2 days ago by sebster 41 comments award share download report block\n41 comments Sort by Top Top New Worst Old Save TwoArizonaPedes 57 points 2 days ago Muslims lie. Muslims lie. Muslims lie. Muslims lie. Muslims lie. Fight back! It begins by getting together a group of like-minded patriots. Start with your church and your friends and grow from there. Set up a phone tree. Use burner phones. Don't text. Organize, coordinate, think, be creative! You already know how to respond to their street-blocking \"prayers.\" Pick a name or organization and get involved. permalink award report block reply Calumet57 7 points 2 days ago Oh that's not true - Leslie Stahl (interviewer of Trump, longtime CIA/CBS and esteemed member of the CFR). permalink parent award report block reply Standingoak 7 points 1 day ago They and their neighbors are Mandated to lie : https://illinoisfamily.org/islam-sharia/knowing-four-arabic-words-may-save-our-civilization-from-islamic-takeover/ Don't accept Man dates. permalink parent award report block reply MatterThatMetals 5 points 1 day ago THIS. I'm in a business that does a lot of business with Muslims. I do not trust any of them. Most of them are overly friendly. Lot's of \"friend and brother\" calling. Never let your guard down around them. permalink parent award report block reply TwoArizonaPedes 3 points 22 hours ago It's all fake and a lie, especially since their holy books specifically and repeatedly forbid them from befriending non-Muslims... ... unless it's to deceive us. They aren't even allowed to be friends with family members who aren't Muslims. That's a CULT. permalink parent award report block reply GunsWithGooglyEyes 21 points 2 days ago I believe it is important to learn languages outside of English for this very reason. We used Navaho to confuse the Japanese, they are using Arabic because they know most Americans are monolingual. Time to start using Duolingo. permalink award report block reply Melodicgrog 9 points 1 day ago Been using that psychotic owl for Japanese. So far I’ve lost two kids and a dog because I didn’t finish a lesson each day. permalink parent award report block reply Kekistani 2 points 1 day ago That owl is pretty persistent isn't he? After a few months he shuts up lol permalink parent award report block reply ElectionDenier2020 7 points 1 day ago Or just kick them out. permalink parent award report block reply Lady_MaGa 6 points 1 day ago I barely recall the story of a couple who went to an muslim country and did something innocent. However, for whatever they did, they were arrested and had to go to court.  They were given an interpreter to tell the court their side.  The couple explained their innocence but the interpreter told the judge the couple plead guilty to all charges.  After backlashes and some jail time, the couple were let go.  Later, the lawyer admitted that the interpreter deliberately lied about the interpretation to benefit the actual culprit of whatever the crime was because the culprit was one of them. permalink parent award report block reply GunsWithGooglyEyes 3 points 1 day ago Exactly. They know the edge they have. If we are going to be smarter than them, we have to learn how they speak. Know your enemy. permalink parent award report block reply MediaBro 2 points 1 day ago The only group of people in the US who are known to be speakers of more than one language are members of the Mormon Church, cos they actually  have to learn the language of the place where they go on their mission. The others are obviously migrants and the Amish, who still speak a form of German. permalink parent award report block reply TrumpMagaNoBama 11 points 2 days ago FUCK iSLAM! permalink award report block reply benjovikenobi 10 points 2 days ago Known this for 30 years, only because I'm too young to have known it longer than that. It's nice to see people starting to have a clue. permalink award report block reply brimshae 0 points 1 day ago Hey, remember when we kept getting told we had to get our sons killed because \"If we fight them over there we don't have to fight them over here?\" permalink parent award report block reply Steve56775 3 points 1 day ago We dropped that after we imported “them” here! permalink parent award report block reply brimshae 1 points 1 day ago Or.... hear me out: It was a lie from the beginning. permalink parent award report block reply benjovikenobi 3 points 1 day ago All too well. You could tell shit was fucked as soon as the \"9/11 mosque\" hit the news. It wasn't the first clue, but it might have been the biggest. Maybe the first clue should have been that all of the alphabet agencies were getting bullshit \"sensitivity training\" and signing consulting contracts with CAIR almost immediately after 9/11, and ISNA has a major office next door to the capital. The enemy was already here the whole time. \"If we fight them over there we don't have to fight them over here\" It fucks me up, remembering how those motherfuckers said that with a straight face. THEY KNEW. Check your integrity, patriotism, and morals at the door when you visit Washington DC. I was so naive back then... permalink parent award report block reply Tellman125 9 points 2 days ago Dirt-eating shit people. Absolutely every one of us needs to make sure to vote; it kept Kamala out of office, kept that Somalian in Minneapolis out of office, and defeated other garbage candidates like Stacy Abrams and Andrew Gillum (DeSantis's opponent who kept calling DeSantis racist). permalink award report block reply SteveRogers42 3 points 1 day ago I agree in spirit, but I gotta counsel: Word is that the primitive biped in Minneapolis only lost because he was a member of the Ooga -booga tribe, and the other Somalis from the Booga -ooga tribe wouldn’t vote for him  because of a long-standing feud over a goat brothel, or something. permalink parent award report block reply Kricket 9 points 1 day ago And if you got anything other than “conquest” from these situations, regardless of language, you’re part of the problem. permalink award report block reply Smurfection 5 points 1 day ago Islam is a backwards, cruel, barbaric religion. Mohammed probably didn't even exist. Mecca wasn't originally in Saudi Arabia.  It was Petra Syria. The Zum Zum well ran dry over a thousand years ago.  Saudis ship water in to fill it to keep the illusion going. The \"muslims\" didn't sack Jerusalem in the 7th century because the Arabs that sacked Jerusalem never said they were followers of Mohammed, were Muslims or had a book called the Koran.  Islam is a knock off of Judaism and Jews in the 7th century welcomed the Arab invaders in because they thought they were Jews who would rebuild the temple. permalink award report block reply DCYR66 4 points 1 day ago Here’s what I say in universal language even sand nigs can understand, 🖕🖕🖕🖕🖕!!!! permalink award report block reply Secondrun007 4 points 1 day ago Muslims are gross! permalink award report block reply PillarOfWisdom 3 points 1 day ago Jews do the same thing.  What they publish in Israel is wildly different than what they release to the rest of the world. permalink award report block reply Pongpagongbatibot 1 points 1 day ago Fuck off you iranian groyper. I will not mind Israel as long as it keeps piling up dead bodies of your shitty religion permalink parent award report block reply PillarOfWisdom 4 points 1 day ago Nope...Orthodox Christian who is tired of watching jews genocide women and children. You know what the leading cause of anti-semitism is?  Jew behavior.  109+ countries can't all be wrong, can they? permalink parent award report block reply Lurking_centipede 0 points 1 day ago Migatard. permalink parent award report block reply Psalm-118_24 3 points 1 day ago Taqiyya is their rule. permalink award report block reply Dewormed_Patriot 3 points 1 day ago Confirmed with Google Translate permalink award report block reply Duke442games 3 points 2 days ago Ummm, according to Grok, that's not what the headlines say. Left Newspaper (Arabic)Main Headline (bottom):\nفوز غفوة الأسطوري\n(Legendary Ghafwa Victory)Subheadline (bottom):\nانتصارات ساحقة في ديربورن وديربورن هايتس\n(Landslide Victories in Dearborn and Dearborn Heights)Top Banner:\nالحال\n(Al-Hal, likely the newspaper name) permalink award report block reply arunlima10 7 points 1 day ago Top banner doesn't say Al Hal.. even the Arabic letters you used doesn't match the picture. permalink parent award report block reply elstegosaur 6 points 1 day ago Maybe Grok got it wrong?  These people say the translation is conquest: https://xcancel.com/Cathalain/status/1988221763915051189#m permalink parent award report block reply Pongpagongbatibot 2 points 1 day ago Fuck off you iranian groyper. Don't spread your lies here. May Israel kill more of your soldiers permalink parent award report block reply Melodicgrog 2 points 1 day ago When we fight them this time we get ac and better food. permalink award report block reply TheWhitestOfFangs 2 points 1 day ago https://x.com/DanBurmawy/status/1987742557938368569 permalink award report block reply Ch3f4554551n -1 points 1 day ago There really isn't such a thing as 'translation' of non latin-based language. It is an approximation bereft of context. permalink award report block reply hoodar -4 points 1 day ago Sometimes, those words don't exist in translation and that's the closest they have. permalink award report block reply morememesplz 3 points 14 hours ago Except Islam keeps using translation excuses to facilitate their lies. Like telling people the word Islam derives from the root word for \"peace\" when it's true root word means \"submission\". permalink parent award report block reply\nTwoArizonaPedes 57 points 2 days ago Muslims lie. Muslims lie. Muslims lie. Muslims lie. Muslims lie. Fight back! It begins by getting together a group of like-minded patriots. Start with your church and your friends and grow from there. Set up a phone tree. Use burner phones. Don't text. Organize, coordinate, think, be creative! You already know how to respond to their street-blocking \"prayers.\" Pick a name or organization and get involved. permalink award report block reply Calumet57 7 points 2 days ago Oh that's not true - Leslie Stahl (interviewer of Trump, longtime CIA/CBS and esteemed member of the CFR). permalink parent award report block reply Standingoak 7 points 1 day ago They and their neighbors are Mandated to lie : https://illinoisfamily.org/islam-sharia/knowing-four-arabic-words-may-save-our-civilization-from-islamic-takeover/ Don't accept Man dates. permalink parent award report block reply MatterThatMetals 5 points 1 day ago THIS. I'm in a business that does a lot of business with Muslims. I do not trust any of them. Most of them are overly friendly. Lot's of \"friend and brother\" calling. Never let your guard down around them. permalink parent award report block reply TwoArizonaPedes 3 points 22 hours ago It's all fake and a lie, especially since their holy books specifically and repeatedly forbid them from befriending non-Muslims... ... unless it's to deceive us. They aren't even allowed to be friends with family members who aren't Muslims. That's a CULT. permalink parent award report block reply\nCalumet57 7 points 2 days ago Oh that's not true - Leslie Stahl (interviewer of Trump, longtime CIA/CBS and esteemed member of the CFR). permalink parent award report block reply\nStandingoak 7 points 1 day ago They and their neighbors are Mandated to lie : https://illinoisfamily.org/islam-sharia/knowing-four-arabic-words-may-save-our-civilization-from-islamic-takeover/ Don't accept Man dates. permalink parent award report block reply\nMatterThatMetals 5 points 1 day ago THIS. I'm in a business that does a lot of business with Muslims. I do not trust any of them. Most of them are overly friendly. Lot's of \"friend and brother\" calling. Never let your guard down around them. permalink parent award report block reply TwoArizonaPedes 3 points 22 hours ago It's all fake and a lie, especially since their holy books specifically and repeatedly forbid them from befriending non-Muslims... ... unless it's to deceive us. They aren't even allowed to be friends with family members who aren't Muslims. That's a CULT. permalink parent award report block reply\nTwoArizonaPedes 3 points 22 hours ago It's all fake and a lie, especially since their holy books specifically and repeatedly forbid them from befriending non-Muslims... ... unless it's to deceive us. They aren't even allowed to be friends with family members who aren't Muslims. That's a CULT. permalink parent award report block reply\nGunsWithGooglyEyes 21 points 2 days ago I believe it is important to learn languages outside of English for this very reason. We used Navaho to confuse the Japanese, they are using Arabic because they know most Americans are monolingual. Time to start using Duolingo. permalink award report block reply Melodicgrog 9 points 1 day ago Been using that psychotic owl for Japanese. So far I’ve lost two kids and a dog because I didn’t finish a lesson each day. permalink parent award report block reply Kekistani 2 points 1 day ago That owl is pretty persistent isn't he? After a few months he shuts up lol permalink parent award report block reply ElectionDenier2020 7 points 1 day ago Or just kick them out. permalink parent award report block reply Lady_MaGa 6 points 1 day ago I barely recall the story of a couple who went to an muslim country and did something innocent. However, for whatever they did, they were arrested and had to go to court.  They were given an interpreter to tell the court their side.  The couple explained their innocence but the interpreter told the judge the couple plead guilty to all charges.  After backlashes and some jail time, the couple were let go.  Later, the lawyer admitted that the interpreter deliberately lied about the interpretation to benefit the actual culprit of whatever the crime was because the culprit was one of them. permalink parent award report block reply GunsWithGooglyEyes 3 points 1 day ago Exactly. They know the edge they have. If we are going to be smarter than them, we have to learn how they speak. Know your enemy. permalink parent award report block reply MediaBro 2 points 1 day ago The only group of people in the US who are known to be speakers of more than one language are members of the Mormon Church, cos they actually  have to learn the language of the place where they go on their mission. The others are obviously migrants and the Amish, who still speak a form of German. permalink parent award report block reply\nMelodicgrog 9 points 1 day ago Been using that psychotic owl for Japanese. So far I’ve lost two kids and a dog because I didn’t finish a lesson each day. permalink parent award report block reply Kekistani 2 points 1 day ago That owl is pretty persistent isn't he? After a few months he shuts up lol permalink parent award report block reply\nKekistani 2 points 1 day ago That owl is pretty persistent isn't he? After a few months he shuts up lol permalink parent award report block reply\nElectionDenier2020 7 points 1 day ago Or just kick them out. permalink parent award report block reply\nLady_MaGa 6 points 1 day ago I barely recall the story of a couple who went to an muslim country and did something innocent. However, for whatever they did, they were arrested and had to go to court.  They were given an interpreter to tell the court their side.  The couple explained their innocence but the interpreter told the judge the couple plead guilty to all charges.  After backlashes and some jail time, the couple were let go.  Later, the lawyer admitted that the interpreter deliberately lied about the interpretation to benefit the actual culprit of whatever the crime was because the culprit was one of them. permalink parent award report block reply GunsWithGooglyEyes 3 points 1 day ago Exactly. They know the edge they have. If we are going to be smarter than them, we have to learn how they speak. Know your enemy. permalink parent award report block reply\nGunsWithGooglyEyes 3 points 1 day ago Exactly. They know the edge they have. If we are going to be smarter than them, we have to learn how they speak. Know your enemy. permalink parent award report block reply\nMediaBro 2 points 1 day ago The only group of people in the US who are known to be speakers of more than one language are members of the Mormon Church, cos they actually  have to learn the language of the place where they go on their mission. The others are obviously migrants and the Amish, who still speak a form of German. permalink parent award report block reply\nTrumpMagaNoBama 11 points 2 days ago FUCK iSLAM! permalink award report block reply\nbenjovikenobi 10 points 2 days ago Known this for 30 years, only because I'm too young to have known it longer than that. It's nice to see people starting to have a clue. permalink award report block reply brimshae 0 points 1 day ago Hey, remember when we kept getting told we had to get our sons killed because \"If we fight them over there we don't have to fight them over here?\" permalink parent award report block reply Steve56775 3 points 1 day ago We dropped that after we imported “them” here! permalink parent award report block reply brimshae 1 points 1 day ago Or.... hear me out: It was a lie from the beginning. permalink parent award report block reply benjovikenobi 3 points 1 day ago All too well. You could tell shit was fucked as soon as the \"9/11 mosque\" hit the news. It wasn't the first clue, but it might have been the biggest. Maybe the first clue should have been that all of the alphabet agencies were getting bullshit \"sensitivity training\" and signing consulting contracts with CAIR almost immediately after 9/11, and ISNA has a major office next door to the capital. The enemy was already here the whole time. \"If we fight them over there we don't have to fight them over here\" It fucks me up, remembering how those motherfuckers said that with a straight face. THEY KNEW. Check your integrity, patriotism, and morals at the door when you visit Washington DC. I was so naive back then... permalink parent award report block reply\nbrimshae 0 points 1 day ago Hey, remember when we kept getting told we had to get our sons killed because \"If we fight them over there we don't have to fight them over here?\" permalink parent award report block reply Steve56775 3 points 1 day ago We dropped that after we imported “them” here! permalink parent award report block reply brimshae 1 points 1 day ago Or.... hear me out: It was a lie from the beginning. permalink parent award report block reply benjovikenobi 3 points 1 day ago All too well. You could tell shit was fucked as soon as the \"9/11 mosque\" hit the news. It wasn't the first clue, but it might have been the biggest. Maybe the first clue should have been that all of the alphabet agencies were getting bullshit \"sensitivity training\" and signing consulting contracts with CAIR almost immediately after 9/11, and ISNA has a major office next door to the capital. The enemy was already here the whole time. \"If we fight them over there we don't have to fight them over here\" It fucks me up, remembering how those motherfuckers said that with a straight face. THEY KNEW. Check your integrity, patriotism, and morals at the door when you visit Washington DC. I was so naive back then... permalink parent award report block reply\nSteve56775 3 points 1 day ago We dropped that after we imported “them” here! permalink parent award report block reply brimshae 1 points 1 day ago Or.... hear me out: It was a lie from the beginning. permalink parent award report block reply\nbrimshae 1 points 1 day ago Or.... hear me out: It was a lie from the beginning. permalink parent award report block reply\nbenjovikenobi 3 points 1 day ago All too well. You could tell shit was fucked as soon as the \"9/11 mosque\" hit the news. It wasn't the first clue, but it might have been the biggest. Maybe the first clue should have been that all of the alphabet agencies were getting bullshit \"sensitivity training\" and signing consulting contracts with CAIR almost immediately after 9/11, and ISNA has a major office next door to the capital. The enemy was already here the whole time. \"If we fight them over there we don't have to fight them over here\" It fucks me up, remembering how those motherfuckers said that with a straight face. THEY KNEW. Check your integrity, patriotism, and morals at the door when you visit Washington DC. I was so naive back then... permalink parent award report block reply\nTellman125 9 points 2 days ago Dirt-eating shit people. Absolutely every one of us needs to make sure to vote; it kept Kamala out of office, kept that Somalian in Minneapolis out of office, and defeated other garbage candidates like Stacy Abrams and Andrew Gillum (DeSantis's opponent who kept calling DeSantis racist). permalink award report block reply SteveRogers42 3 points 1 day ago I agree in spirit, but I gotta counsel: Word is that the primitive biped in Minneapolis only lost because he was a member of the Ooga -booga tribe, and the other Somalis from the Booga -ooga tribe wouldn’t vote for him  because of a long-standing feud over a goat brothel, or something. permalink parent award report block reply\nSteveRogers42 3 points 1 day ago I agree in spirit, but I gotta counsel: Word is that the primitive biped in Minneapolis only lost because he was a member of the Ooga -booga tribe, and the other Somalis from the Booga -ooga tribe wouldn’t vote for him  because of a long-standing feud over a goat brothel, or something. permalink parent award report block reply\nKricket 9 points 1 day ago And if you got anything other than “conquest” from these situations, regardless of language, you’re part of the problem. permalink award report block reply\nSmurfection 5 points 1 day ago Islam is a backwards, cruel, barbaric religion. Mohammed probably didn't even exist. Mecca wasn't originally in Saudi Arabia.  It was Petra Syria. The Zum Zum well ran dry over a thousand years ago.  Saudis ship water in to fill it to keep the illusion going. The \"muslims\" didn't sack Jerusalem in the 7th century because the Arabs that sacked Jerusalem never said they were followers of Mohammed, were Muslims or had a book called the Koran.  Islam is a knock off of Judaism and Jews in the 7th century welcomed the Arab invaders in because they thought they were Jews who would rebuild the temple. permalink award report block reply\nDCYR66 4 points 1 day ago Here’s what I say in universal language even sand nigs can understand, 🖕🖕🖕🖕🖕!!!! permalink award report block reply\nSecondrun007 4 points 1 day ago Muslims are gross! permalink award report block reply\nPillarOfWisdom 3 points 1 day ago Jews do the same thing.  What they publish in Israel is wildly different than what they release to the rest of the world. permalink award report block reply Pongpagongbatibot 1 points 1 day ago Fuck off you iranian groyper. I will not mind Israel as long as it keeps piling up dead bodies of your shitty religion permalink parent award report block reply PillarOfWisdom 4 points 1 day ago Nope...Orthodox Christian who is tired of watching jews genocide women and children. You know what the leading cause of anti-semitism is?  Jew behavior.  109+ countries can't all be wrong, can they? permalink parent award report block reply Lurking_centipede 0 points 1 day ago Migatard. permalink parent award report block reply\nPongpagongbatibot 1 points 1 day ago Fuck off you iranian groyper. I will not mind Israel as long as it keeps piling up dead bodies of your shitty religion permalink parent award report block reply PillarOfWisdom 4 points 1 day ago Nope...Orthodox Christian who is tired of watching jews genocide women and children. You know what the leading cause of anti-semitism is?  Jew behavior.  109+ countries can't all be wrong, can they? permalink parent award report block reply Lurking_centipede 0 points 1 day ago Migatard. permalink parent award report block reply\nPillarOfWisdom 4 points 1 day ago Nope...Orthodox Christian who is tired of watching jews genocide women and children. You know what the leading cause of anti-semitism is?  Jew behavior.  109+ countries can't all be wrong, can they? permalink parent award report block reply\nLurking_centipede 0 points 1 day ago Migatard. permalink parent award report block reply\nPsalm-118_24 3 points 1 day ago Taqiyya is their rule. permalink award report block reply\nDewormed_Patriot 3 points 1 day ago Confirmed with Google Translate permalink award report block reply\nDuke442games 3 points 2 days ago Ummm, according to Grok, that's not what the headlines say. Left Newspaper (Arabic)Main Headline (bottom):\nفوز غفوة الأسطوري\n(Legendary Ghafwa Victory)Subheadline (bottom):\nانتصارات ساحقة في ديربورن وديربورن هايتس\n(Landslide Victories in Dearborn and Dearborn Heights)Top Banner:\nالحال\n(Al-Hal, likely the newspaper name) permalink award report block reply arunlima10 7 points 1 day ago Top banner doesn't say Al Hal.. even the Arabic letters you used doesn't match the picture. permalink parent award report block reply elstegosaur 6 points 1 day ago Maybe Grok got it wrong?  These people say the translation is conquest: https://xcancel.com/Cathalain/status/1988221763915051189#m permalink parent award report block reply Pongpagongbatibot 2 points 1 day ago Fuck off you iranian groyper. Don't spread your lies here. May Israel kill more of your soldiers permalink parent award report block reply\narunlima10 7 points 1 day ago Top banner doesn't say Al Hal.. even the Arabic letters you used doesn't match the picture. permalink parent award report block reply\nelstegosaur 6 points 1 day ago Maybe Grok got it wrong?  These people say the translation is conquest: https://xcancel.com/Cathalain/status/1988221763915051189#m permalink parent award report block reply\nPongpagongbatibot 2 points 1 day ago Fuck off you iranian groyper. Don't spread your lies here. May Israel kill more of your soldiers permalink parent award report block reply\nMelodicgrog 2 points 1 day ago When we fight them this time we get ac and better food. permalink award report block reply\nTheWhitestOfFangs 2 points 1 day ago https://x.com/DanBurmawy/status/1987742557938368569 permalink award report block reply\nCh3f4554551n -1 points 1 day ago There really isn't such a thing as 'translation' of non latin-based language. It is an approximation bereft of context. permalink award report block reply\nhoodar -4 points 1 day ago Sometimes, those words don't exist in translation and that's the closest they have. permalink award report block reply morememesplz 3 points 14 hours ago Except Islam keeps using translation excuses to facilitate their lies. Like telling people the word Islam derives from the root word for \"peace\" when it's true root word means \"submission\". permalink parent award report block reply\nmorememesplz 3 points 14 hours ago Except Islam keeps using translation excuses to facilitate their lies. Like telling people the word Islam derives from the root word for \"peace\" when it's true root word means \"submission\". permalink parent award report block reply"}