{"id": "1ARK9oW6J4", "contents": "16 bing bong BE  LESS  RETARDED posted 38 minutes ago by YodaBannon 15 comments award share download report block\n15 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style ReleasetheList 6 points 36 minutes ago Nothing more permanent than a temporary govt program. Income tax was supposed to be temporary to pay for WW1 and it was 2% at the time. How did that work out? H1B isn't for smart people, it's for retards that will work for slave wages. Trying to sell us a lie. permalink award report block reply YodaBannon OP 1 points 34 minutes ago frrrrt permalink parent award report block reply berserkerbarrage 0 points 27 minutes ago H-1B employees are not paid less than Americans. permalink parent award report block reply ReleasetheList 1 points 22 minutes ago No one can be this retarded, can they? \"Key findings\nThe two lowest permissible H-1B prevailing wage levels are significantly lower than the local median salaries surveyed for occupations. The two lowest H-1B wage levels set by DOL correspond to the 17th and 34th wage percentiles locally for an occupation. This translates into salaries that are significantly lower than local median salaries—17% to 34% lower on average for computer occupations (which are among the most common H-1B occupations). H-1B employers can reap significant savings by selecting one of the two lowest wage levels instead of the Level 3 wage (the median, or 50th-percentile, wage) or the Level 4 wage (above the median, at the 67th percentile). Not surprisingly, three-fifths of all H-1B jobs were certified at the two lowest prevailing wage levels in 2019. In fiscal 2019, a total of 60% of H-1B positions certified by DOL had been assigned wage levels well below the local median wage for the occupation: 14% were at H-1B Level 1 (the 17th percentile) and 46% were at H-1B Level 2 (34th percentile). Likewise, three-fifths of H-1B jobs certified for the top 30 H-1B employers were at the two lowest prevailing wage levels.\" https://www.epi.org/publication/h-1b-visas-and-prevailing-wage-levels/#:~:text=Key%20findings,two%20lowest%20prevailing%20wage%20levels . permalink parent award report block reply wharfthrowaway 1 points 21 minutes ago No, a company puts up a shit offer for a position that no American will degrade themselves for, then the company turns around and begs the government for an H1B worker because “we couldn’t find anyone to work for our shit offer” permalink parent award report block reply berserkerbarrage 1 points 18 minutes ago Look up the average H-1B base salary. permalink parent award report block reply SnowSnake 2 points 30 minutes ago Whew. For a second there I thought it was permanent. But wait.. can't they \"train\" us dumb Americans over zoom? We are at least that smart, to figure out how to set up a zoom meeting. Then they never have to come here!! permalink award report block reply berserkerbarrage 1 points 28 minutes ago Except he never said that Americans were dumb, he said that we are lacking American talent in certain industries, that they \"have to learn\" and that you can't just take people off the unemployment line and have them start building missiles and batteries, all of which is true. permalink parent award report block reply SnowSnake 1 points 24 minutes ago I didn't say he said we were dumb. I'm inferring that someone thinks Americans are lesser in some way, that we need to be trained by 3rd world shithole dwellers. permalink parent award report block reply KewMan 2 points 32 minutes ago Oh... Well I feel much better now. permalink award report block reply Ostia 1 points 7 minutes ago That's called damage control. permalink award report block reply CommietownUSA 1 points 29 minutes ago Yeah man we don’t have deportation detainers from like 08 still lmao. What a joke. permalink award report block reply TheJakeFroggy 1 points 14 minutes ago My problem with this is, why can't Americans be trained by other Americans? Like, okay with you want to temporarily bring in foreign workers to train Americans and then send them back, but I feel like that's not really even needed in the first place. Why can't Americans be trained at home rather than needing foreign help? permalink award report block reply GhostOfTheRepublic 1 points 10 minutes ago that's fking rich, bring in foreigners that Americans trained to now train Americans?  You are not supposed to smoke the batshit!  it will make you crazy, Scott!!! permalink award report block reply Be_The_Change 1 points 33 minutes ago Comment removed by community moderators. permalink award report block reply\nReleasetheList 6 points 36 minutes ago Nothing more permanent than a temporary govt program. Income tax was supposed to be temporary to pay for WW1 and it was 2% at the time. How did that work out? H1B isn't for smart people, it's for retards that will work for slave wages. Trying to sell us a lie. permalink award report block reply YodaBannon OP 1 points 34 minutes ago frrrrt permalink parent award report block reply berserkerbarrage 0 points 27 minutes ago H-1B employees are not paid less than Americans. permalink parent award report block reply ReleasetheList 1 points 22 minutes ago No one can be this retarded, can they? \"Key findings\nThe two lowest permissible H-1B prevailing wage levels are significantly lower than the local median salaries surveyed for occupations. The two lowest H-1B wage levels set by DOL correspond to the 17th and 34th wage percentiles locally for an occupation. This translates into salaries that are significantly lower than local median salaries—17% to 34% lower on average for computer occupations (which are among the most common H-1B occupations). H-1B employers can reap significant savings by selecting one of the two lowest wage levels instead of the Level 3 wage (the median, or 50th-percentile, wage) or the Level 4 wage (above the median, at the 67th percentile). Not surprisingly, three-fifths of all H-1B jobs were certified at the two lowest prevailing wage levels in 2019. In fiscal 2019, a total of 60% of H-1B positions certified by DOL had been assigned wage levels well below the local median wage for the occupation: 14% were at H-1B Level 1 (the 17th percentile) and 46% were at H-1B Level 2 (34th percentile). Likewise, three-fifths of H-1B jobs certified for the top 30 H-1B employers were at the two lowest prevailing wage levels.\" https://www.epi.org/publication/h-1b-visas-and-prevailing-wage-levels/#:~:text=Key%20findings,two%20lowest%20prevailing%20wage%20levels . permalink parent award report block reply wharfthrowaway 1 points 21 minutes ago No, a company puts up a shit offer for a position that no American will degrade themselves for, then the company turns around and begs the government for an H1B worker because “we couldn’t find anyone to work for our shit offer” permalink parent award report block reply berserkerbarrage 1 points 18 minutes ago Look up the average H-1B base salary. permalink parent award report block reply\nYodaBannon OP 1 points 34 minutes ago frrrrt permalink parent award report block reply\nberserkerbarrage 0 points 27 minutes ago H-1B employees are not paid less than Americans. permalink parent award report block reply ReleasetheList 1 points 22 minutes ago No one can be this retarded, can they? \"Key findings\nThe two lowest permissible H-1B prevailing wage levels are significantly lower than the local median salaries surveyed for occupations. The two lowest H-1B wage levels set by DOL correspond to the 17th and 34th wage percentiles locally for an occupation. This translates into salaries that are significantly lower than local median salaries—17% to 34% lower on average for computer occupations (which are among the most common H-1B occupations). H-1B employers can reap significant savings by selecting one of the two lowest wage levels instead of the Level 3 wage (the median, or 50th-percentile, wage) or the Level 4 wage (above the median, at the 67th percentile). Not surprisingly, three-fifths of all H-1B jobs were certified at the two lowest prevailing wage levels in 2019. In fiscal 2019, a total of 60% of H-1B positions certified by DOL had been assigned wage levels well below the local median wage for the occupation: 14% were at H-1B Level 1 (the 17th percentile) and 46% were at H-1B Level 2 (34th percentile). Likewise, three-fifths of H-1B jobs certified for the top 30 H-1B employers were at the two lowest prevailing wage levels.\" https://www.epi.org/publication/h-1b-visas-and-prevailing-wage-levels/#:~:text=Key%20findings,two%20lowest%20prevailing%20wage%20levels . permalink parent award report block reply wharfthrowaway 1 points 21 minutes ago No, a company puts up a shit offer for a position that no American will degrade themselves for, then the company turns around and begs the government for an H1B worker because “we couldn’t find anyone to work for our shit offer” permalink parent award report block reply berserkerbarrage 1 points 18 minutes ago Look up the average H-1B base salary. permalink parent award report block reply\nReleasetheList 1 points 22 minutes ago No one can be this retarded, can they? \"Key findings\nThe two lowest permissible H-1B prevailing wage levels are significantly lower than the local median salaries surveyed for occupations. The two lowest H-1B wage levels set by DOL correspond to the 17th and 34th wage percentiles locally for an occupation. This translates into salaries that are significantly lower than local median salaries—17% to 34% lower on average for computer occupations (which are among the most common H-1B occupations). H-1B employers can reap significant savings by selecting one of the two lowest wage levels instead of the Level 3 wage (the median, or 50th-percentile, wage) or the Level 4 wage (above the median, at the 67th percentile). Not surprisingly, three-fifths of all H-1B jobs were certified at the two lowest prevailing wage levels in 2019. In fiscal 2019, a total of 60% of H-1B positions certified by DOL had been assigned wage levels well below the local median wage for the occupation: 14% were at H-1B Level 1 (the 17th percentile) and 46% were at H-1B Level 2 (34th percentile). Likewise, three-fifths of H-1B jobs certified for the top 30 H-1B employers were at the two lowest prevailing wage levels.\" https://www.epi.org/publication/h-1b-visas-and-prevailing-wage-levels/#:~:text=Key%20findings,two%20lowest%20prevailing%20wage%20levels . permalink parent award report block reply\nwharfthrowaway 1 points 21 minutes ago No, a company puts up a shit offer for a position that no American will degrade themselves for, then the company turns around and begs the government for an H1B worker because “we couldn’t find anyone to work for our shit offer” permalink parent award report block reply berserkerbarrage 1 points 18 minutes ago Look up the average H-1B base salary. permalink parent award report block reply\nberserkerbarrage 1 points 18 minutes ago Look up the average H-1B base salary. permalink parent award report block reply\nSnowSnake 2 points 30 minutes ago Whew. For a second there I thought it was permanent. But wait.. can't they \"train\" us dumb Americans over zoom? We are at least that smart, to figure out how to set up a zoom meeting. Then they never have to come here!! permalink award report block reply berserkerbarrage 1 points 28 minutes ago Except he never said that Americans were dumb, he said that we are lacking American talent in certain industries, that they \"have to learn\" and that you can't just take people off the unemployment line and have them start building missiles and batteries, all of which is true. permalink parent award report block reply SnowSnake 1 points 24 minutes ago I didn't say he said we were dumb. I'm inferring that someone thinks Americans are lesser in some way, that we need to be trained by 3rd world shithole dwellers. permalink parent award report block reply\nberserkerbarrage 1 points 28 minutes ago Except he never said that Americans were dumb, he said that we are lacking American talent in certain industries, that they \"have to learn\" and that you can't just take people off the unemployment line and have them start building missiles and batteries, all of which is true. permalink parent award report block reply SnowSnake 1 points 24 minutes ago I didn't say he said we were dumb. I'm inferring that someone thinks Americans are lesser in some way, that we need to be trained by 3rd world shithole dwellers. permalink parent award report block reply\nSnowSnake 1 points 24 minutes ago I didn't say he said we were dumb. I'm inferring that someone thinks Americans are lesser in some way, that we need to be trained by 3rd world shithole dwellers. permalink parent award report block reply\nKewMan 2 points 32 minutes ago Oh... Well I feel much better now. permalink award report block reply\nOstia 1 points 7 minutes ago That's called damage control. permalink award report block reply\nCommietownUSA 1 points 29 minutes ago Yeah man we don’t have deportation detainers from like 08 still lmao. What a joke. permalink award report block reply\nTheJakeFroggy 1 points 14 minutes ago My problem with this is, why can't Americans be trained by other Americans? Like, okay with you want to temporarily bring in foreign workers to train Americans and then send them back, but I feel like that's not really even needed in the first place. Why can't Americans be trained at home rather than needing foreign help? permalink award report block reply\nGhostOfTheRepublic 1 points 10 minutes ago that's fking rich, bring in foreigners that Americans trained to now train Americans?  You are not supposed to smoke the batshit!  it will make you crazy, Scott!!! permalink award report block reply\nBe_The_Change 1 points 33 minutes ago Comment removed by community moderators. permalink award report block reply"}