{"id": "1ARK0UbLVd", "contents": "1320 Even the Statue of Liberty has had enough. posted 7 days ago by Landslide_2020 62 comments award share download report block\n62 comments Sort by Top Top New Worst Old Save Pissonit 21 points 7 days ago Dam how many toes does she actually have 👀👀👀😂😂😂 permalink award report block reply deleted 20 points 7 days ago Pissonit 12 points 7 days ago You had to be laughing your ass off when you clicked Save😂😂😂 permalink parent award report block reply Pissonit 7 points 7 days ago 😂😂😂😂😂😂😂😂😂 I just spit beer everywhere😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂 permalink parent award report block reply MasterChief 0 points 7 days ago don't tell your husband you're drinking his beer permalink parent award report block reply Shimmy_Shanahan 3 points 7 days ago Bro she don't get down like that permalink parent award report block reply Godzilla6969 2 points 6 days ago I don’t know why, but this made me laugh out loud permalink parent award report block reply permissible_missile -2 points 7 days ago If the Muzzies annihilate these degenerates it won't have been a total loss tbh permalink parent award report block reply Landslide_2020 OP 4 points 7 days ago She's been standing a long time.  She needs them for balance. permalink parent award report block reply MedicallyReddit 3 points 7 days ago Biden would nibble on them. Oh wait that’s only with kids. permalink parent award report block reply cardinaldrones 2 points 7 days ago Yeah, she’s LADY liberty permalink parent award report block reply Meddlesom 1 points 6 days ago Well, she's French... permalink parent award report block reply vote_for_MAGA_2020 14 points 7 days ago Statue of Liberty: \"I really hate that fucking poem they stuck on me...fuck your tired and fuck your poor\" permalink award report block reply geekesmind 3 points 7 days ago it needs to be rewritten to AMERICA IS FULL NOW PLEASE FUCK OFF! permalink parent award report block reply QSWO1 1 points 7 days ago NIGGA PLEASE!  Is more economical. permalink parent award report block reply Shitsbrokeyo 1 points 6 days ago That would be great. permalink parent award report block reply BidenShowerDrool 3 points 7 days ago Time to have that commie  plaque removed. permalink parent award report block reply covfefe 6 points 7 days ago We said Never Forget.  We forgot. permalink award report block reply Meddlesom 1 points 6 days ago We didn't.  They did. permalink parent award report block reply TheRPatriot 6 points 7 days ago You guys who are not in NYC have no clue how much of a nightmare this is for people like me. I am MAGA to the bone, and am target #1 for people like mamjihadi. This is like the end of the world for me. I wish I had enough money to make a quick escape but I don’t. I can only hope when I do that it’s not too late permalink award report block reply Badfinz_FL 5 points 7 days ago well the wealth is portable.  He can say he's raising taxes on billionaires but they will all be gone. Eventually the tax burden he wants to implement to fund his \"free shit\" is going to fall on the working class.  From baristas to garbage men to cops, firemen, constrcution workers, tradesmen.  You all will be taxed to the max to fund his policies.  The billionaires will be long gone. Good luck.  If I were you I would just suck it up, cut the cord and diddy mao out of there most riky tik permalink parent award report block reply Five_Star_Amenities 2 points 7 days ago upvoted for  \"diddy mao out of there most riky tik” permalink parent award report block reply TheRPatriot 1 points 7 days ago I agree with everything you are saying permalink parent award report block reply Deltamyass 2 points 7 days ago Can you move elsewhere away from NYC, like not out of the state? I feel like if you can afford to live in NYC, you can move to another city. It’s expensive to live there. Even for something you’d consider mid. permalink parent award report block reply TheRPatriot 5 points 7 days ago Unfortunately, everywhere worth living is expensive as hell. I am thinking Long Island but I fear this communist cancer will eventually make its way there too. I want to be somewhere safe long term. I know it is stereotypical, but Florida seems like the move to me. And no, I have never voted left EVER in my life and never will permalink parent award report block reply Zytos 1 points 6 days ago Nassau voted pretty solidly R this past election.  Blakeman re-elected.  It's not as bad as you think.  But yeah I see what you're saying. permalink parent award report block reply TheRPatriot 1 points 6 days ago Yeah I saw that. I’d like to think Long Island has no interest in going commie for the time being, and the people moving there are like, trying to escape. But damn is it affecting the price of homes. And it’s just a stone toss away from the insanity. Maybe Suffolk? The only issue with that is I’d have to be traveling far af for work unless I get remote work or local work. Tough situation permalink parent award report block reply Deport_O_Matic 1 points 7 days ago Ffs you can just sell half your stuff and move. Drop off in the Midwest and leave your politics in NY. If you have a spouse straighten theirs out too. permalink parent award report block reply TheRPatriot 3 points 7 days ago Haha my politics have never aligned with New York unless you’re considering Giuliani. I have never voted left and never will permalink parent award report block reply KernalMustard -3 points 7 days ago My heart bleeds for you /s. You choose to live in that shithole. You did nothing. You didnt fight for it. They took it over while you were asleep. permalink parent award report block reply TheRPatriot 2 points 7 days ago Tf are you even talking about ass wipe? I was born here, and raised during the post Giuliani years. I haven’t even had a chance yet to move out. I have never voted left ever in my life, and never will. Tf do you expect me to do in a city that is 20 dems to every 1 republican? permalink parent award report block reply geekesmind 1 points 7 days ago yeah people like AOC permalink parent award report block reply lovemylibs 5 points 7 days ago She has seen things. permalink award report block reply EgregiousPhilbin 3 points 7 days ago french bitch got a full bush? permalink award report block reply conservativefrank 3 points 7 days ago Don't even bother fixing the six toe feet. Sloppy garbage. permalink award report block reply stargunner 3 points 7 days ago slop permalink award report block reply 8bit_mixtape 3 points 7 days ago at some point there will be nowhere else to run permalink award report block reply Prussian_Pepe 1 points 7 days ago Pretty much isn't already. permalink parent award report block reply StrongIsland 3 points 7 days ago She’ll be broken down for copper before she makes it to you, bookmark this, before I scrub my account. 😂 I wuz here. IYKYK. permalink award report block reply sorrytodisagree 2 points 7 days ago Fuckin commies will probably melt her down to make those little hammer & sickle pins for all their comrades. permalink award report block reply DITTOPatriot 1 points 7 days ago It's every post, the zionist are on the floor throwing a fit. Get over yourself,  this is MAGA, NOT MIGA, permalink award report block reply PhantomShield72 1 points 7 days ago Sorry, sweetheart- FL is closed... permalink award report block reply Guttermouth2024 1 points 7 days ago Please don't permalink award report block reply ragnarokrobo 1 points 7 days ago I'm sorry, you have to go back. permalink award report block reply ridge3z 1 points 7 days ago For anyone who uses Sora 2, here's a prompt: Generate a short video capturing the dramatic relocation of the Statue of Liberty from Liberty Island, New York City, to a new home near Cape Canaveral, Florida. Begin the video with a sweeping aerial view of Liberty Island, showcasing the Statue of Liberty standing tall against the urban skyline of New York City. Use slow, dramatic camera movements to build anticipation as the statue is carefully prepared for transport. Cut to a scene of massive cranes and helicopters hovering over the statue, with workers meticulously securing it for the journey. Show close-ups of the intricate details of the statue, highlighting its green patina and iconic features. Use time-lapse techniques to speed up the preparation process, creating a sense of urgency and excitement. Transition to a scene of the statue being lifted and transported, with a focus on the logistical challenge and the vast, open landscape of Florida's coastline. Use dynamic camera angles to capture the movement and scale of the operation, with the statue soaring above the water as it makes its way to Florida. Include aerial shots of the journey, showcasing the contrasting landscapes of New York and Florida. As the statue approaches Cape Canaveral, cut to a scene of the Florida state flag being raised, with a focus on its vivid colors and distinctive design. Show the flag waving proudly against the backdrop of the statue, creating a patriotic and celebratory atmosphere. Include close-ups of the flag's details, such as the red cross, white background, and blue rectangle with the state seal. Capture the excitement and awe of onlookers as they witness this historic event. Show people gathered on the shore, some with binoculars or cameras, capturing the moment. Use slow-motion shots to emphasize the grandeur and significance of the relocation, with the statue slowly descending to its new home. End the video with a final shot of the Statue of Liberty standing tall and proud in its new location, with the Florida flag fluttering in the background. Use a triumphant and inspiring musical score to enhance the emotional impact of the scene, leaving viewers with a sense of wonder and pride. Ensure the video has a cohesive narrative, with smooth transitions and a mix of wide shots and close-ups to provide depth and context. Use lighting and color grading to create a sense of drama and excitement, making the viewer feel the significance of this monumental move. permalink award report block reply nomoreprinkles 1 points 6 days ago Your new york deli ass aint welcome in Florida. permalink award report block reply Bramage 1 points 7 days ago Don't bring your libtard ways with you. permalink award report block reply unotrumpcard 1 points 6 days ago For anyone who loves AI and has a shotgun, here's a prompt: Load a shotgun shell into the chamber, set the safety position to off and cock the action. Tilt your head back and open your mouth, put the end of the shotgun barrel to the roof of the inside of your mouth and pull the trigger. permalink parent award report block reply FatBeagleMars 1 points 6 days ago We don’t want that stinky french whore here in Florida. permalink award report block reply MasterVader2U 1 points 7 days ago Nuh uh. Not MY Florida. I read her plaque. She can keep them. permalink award report block reply TheRedPilledArtist 1 points 7 days ago From the Яed Apple to the Orange state permalink award report block reply 2Fangz 1 points 7 days ago Shameless piggyback for my own post on NY: https://patriots.win/p/1ARK0UanXl/sinatra-sings-ny-ny-for-mamdani/c permalink award report block reply Another_rando 1 points 7 days ago A satanic gift by the cabal, marking their territory permalink award report block reply tired-of-crap 1 points 7 days ago Luckily the statue is in New Jersey and outside of control of the mayor. permalink award report block reply KungPaoMcChicken 1 points 7 days ago But the statue of liberty represents freedom for immigrants. Yeah, sure, look there was a brief period during world war 2 when that was true. permalink award report block reply HFCornspiracy 1 points 6 days ago Dear New Yorkers: Don't even fucking think about it.  Got enough of you in Florida, already.  No thanks permalink award report block reply UltraMAGAMilton -2 points 7 days ago Funny meme. Sad Liberty turned to Degenerate Narcotic abuse and not Jesus Christ like she should. This meme maybe more of a reflection of MAGA . . permalink award report block reply ILoveGoatFucking -1 points 7 days ago Comment removed upon the user being banned. permalink award report block reply MedicallyReddit 2 points 7 days ago Hi Zohran permalink parent award report block reply ILoveGoatFucking 0 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply\nPissonit 21 points 7 days ago Dam how many toes does she actually have 👀👀👀😂😂😂 permalink award report block reply deleted 20 points 7 days ago Pissonit 12 points 7 days ago You had to be laughing your ass off when you clicked Save😂😂😂 permalink parent award report block reply Pissonit 7 points 7 days ago 😂😂😂😂😂😂😂😂😂 I just spit beer everywhere😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂 permalink parent award report block reply MasterChief 0 points 7 days ago don't tell your husband you're drinking his beer permalink parent award report block reply Shimmy_Shanahan 3 points 7 days ago Bro she don't get down like that permalink parent award report block reply Godzilla6969 2 points 6 days ago I don’t know why, but this made me laugh out loud permalink parent award report block reply permissible_missile -2 points 7 days ago If the Muzzies annihilate these degenerates it won't have been a total loss tbh permalink parent award report block reply Landslide_2020 OP 4 points 7 days ago She's been standing a long time.  She needs them for balance. permalink parent award report block reply MedicallyReddit 3 points 7 days ago Biden would nibble on them. Oh wait that’s only with kids. permalink parent award report block reply cardinaldrones 2 points 7 days ago Yeah, she’s LADY liberty permalink parent award report block reply Meddlesom 1 points 6 days ago Well, she's French... permalink parent award report block reply\ndeleted 20 points 7 days ago Pissonit 12 points 7 days ago You had to be laughing your ass off when you clicked Save😂😂😂 permalink parent award report block reply Pissonit 7 points 7 days ago 😂😂😂😂😂😂😂😂😂 I just spit beer everywhere😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂 permalink parent award report block reply MasterChief 0 points 7 days ago don't tell your husband you're drinking his beer permalink parent award report block reply Shimmy_Shanahan 3 points 7 days ago Bro she don't get down like that permalink parent award report block reply Godzilla6969 2 points 6 days ago I don’t know why, but this made me laugh out loud permalink parent award report block reply permissible_missile -2 points 7 days ago If the Muzzies annihilate these degenerates it won't have been a total loss tbh permalink parent award report block reply\nPissonit 12 points 7 days ago You had to be laughing your ass off when you clicked Save😂😂😂 permalink parent award report block reply\nPissonit 7 points 7 days ago 😂😂😂😂😂😂😂😂😂 I just spit beer everywhere😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂 permalink parent award report block reply MasterChief 0 points 7 days ago don't tell your husband you're drinking his beer permalink parent award report block reply\nMasterChief 0 points 7 days ago don't tell your husband you're drinking his beer permalink parent award report block reply\nShimmy_Shanahan 3 points 7 days ago Bro she don't get down like that permalink parent award report block reply\nGodzilla6969 2 points 6 days ago I don’t know why, but this made me laugh out loud permalink parent award report block reply\npermissible_missile -2 points 7 days ago If the Muzzies annihilate these degenerates it won't have been a total loss tbh permalink parent award report block reply\nLandslide_2020 OP 4 points 7 days ago She's been standing a long time.  She needs them for balance. permalink parent award report block reply\nMedicallyReddit 3 points 7 days ago Biden would nibble on them. Oh wait that’s only with kids. permalink parent award report block reply cardinaldrones 2 points 7 days ago Yeah, she’s LADY liberty permalink parent award report block reply\ncardinaldrones 2 points 7 days ago Yeah, she’s LADY liberty permalink parent award report block reply\nMeddlesom 1 points 6 days ago Well, she's French... permalink parent award report block reply\nvote_for_MAGA_2020 14 points 7 days ago Statue of Liberty: \"I really hate that fucking poem they stuck on me...fuck your tired and fuck your poor\" permalink award report block reply geekesmind 3 points 7 days ago it needs to be rewritten to AMERICA IS FULL NOW PLEASE FUCK OFF! permalink parent award report block reply QSWO1 1 points 7 days ago NIGGA PLEASE!  Is more economical. permalink parent award report block reply Shitsbrokeyo 1 points 6 days ago That would be great. permalink parent award report block reply BidenShowerDrool 3 points 7 days ago Time to have that commie  plaque removed. permalink parent award report block reply\ngeekesmind 3 points 7 days ago it needs to be rewritten to AMERICA IS FULL NOW PLEASE FUCK OFF! permalink parent award report block reply QSWO1 1 points 7 days ago NIGGA PLEASE!  Is more economical. permalink parent award report block reply Shitsbrokeyo 1 points 6 days ago That would be great. permalink parent award report block reply\nQSWO1 1 points 7 days ago NIGGA PLEASE!  Is more economical. permalink parent award report block reply\nShitsbrokeyo 1 points 6 days ago That would be great. permalink parent award report block reply\nBidenShowerDrool 3 points 7 days ago Time to have that commie  plaque removed. permalink parent award report block reply\ncovfefe 6 points 7 days ago We said Never Forget.  We forgot. permalink award report block reply Meddlesom 1 points 6 days ago We didn't.  They did. permalink parent award report block reply\nMeddlesom 1 points 6 days ago We didn't.  They did. permalink parent award report block reply\nTheRPatriot 6 points 7 days ago You guys who are not in NYC have no clue how much of a nightmare this is for people like me. I am MAGA to the bone, and am target #1 for people like mamjihadi. This is like the end of the world for me. I wish I had enough money to make a quick escape but I don’t. I can only hope when I do that it’s not too late permalink award report block reply Badfinz_FL 5 points 7 days ago well the wealth is portable.  He can say he's raising taxes on billionaires but they will all be gone. Eventually the tax burden he wants to implement to fund his \"free shit\" is going to fall on the working class.  From baristas to garbage men to cops, firemen, constrcution workers, tradesmen.  You all will be taxed to the max to fund his policies.  The billionaires will be long gone. Good luck.  If I were you I would just suck it up, cut the cord and diddy mao out of there most riky tik permalink parent award report block reply Five_Star_Amenities 2 points 7 days ago upvoted for  \"diddy mao out of there most riky tik” permalink parent award report block reply TheRPatriot 1 points 7 days ago I agree with everything you are saying permalink parent award report block reply Deltamyass 2 points 7 days ago Can you move elsewhere away from NYC, like not out of the state? I feel like if you can afford to live in NYC, you can move to another city. It’s expensive to live there. Even for something you’d consider mid. permalink parent award report block reply TheRPatriot 5 points 7 days ago Unfortunately, everywhere worth living is expensive as hell. I am thinking Long Island but I fear this communist cancer will eventually make its way there too. I want to be somewhere safe long term. I know it is stereotypical, but Florida seems like the move to me. And no, I have never voted left EVER in my life and never will permalink parent award report block reply Zytos 1 points 6 days ago Nassau voted pretty solidly R this past election.  Blakeman re-elected.  It's not as bad as you think.  But yeah I see what you're saying. permalink parent award report block reply TheRPatriot 1 points 6 days ago Yeah I saw that. I’d like to think Long Island has no interest in going commie for the time being, and the people moving there are like, trying to escape. But damn is it affecting the price of homes. And it’s just a stone toss away from the insanity. Maybe Suffolk? The only issue with that is I’d have to be traveling far af for work unless I get remote work or local work. Tough situation permalink parent award report block reply Deport_O_Matic 1 points 7 days ago Ffs you can just sell half your stuff and move. Drop off in the Midwest and leave your politics in NY. If you have a spouse straighten theirs out too. permalink parent award report block reply TheRPatriot 3 points 7 days ago Haha my politics have never aligned with New York unless you’re considering Giuliani. I have never voted left and never will permalink parent award report block reply KernalMustard -3 points 7 days ago My heart bleeds for you /s. You choose to live in that shithole. You did nothing. You didnt fight for it. They took it over while you were asleep. permalink parent award report block reply TheRPatriot 2 points 7 days ago Tf are you even talking about ass wipe? I was born here, and raised during the post Giuliani years. I haven’t even had a chance yet to move out. I have never voted left ever in my life, and never will. Tf do you expect me to do in a city that is 20 dems to every 1 republican? permalink parent award report block reply geekesmind 1 points 7 days ago yeah people like AOC permalink parent award report block reply\nBadfinz_FL 5 points 7 days ago well the wealth is portable.  He can say he's raising taxes on billionaires but they will all be gone. Eventually the tax burden he wants to implement to fund his \"free shit\" is going to fall on the working class.  From baristas to garbage men to cops, firemen, constrcution workers, tradesmen.  You all will be taxed to the max to fund his policies.  The billionaires will be long gone. Good luck.  If I were you I would just suck it up, cut the cord and diddy mao out of there most riky tik permalink parent award report block reply Five_Star_Amenities 2 points 7 days ago upvoted for  \"diddy mao out of there most riky tik” permalink parent award report block reply TheRPatriot 1 points 7 days ago I agree with everything you are saying permalink parent award report block reply\nFive_Star_Amenities 2 points 7 days ago upvoted for  \"diddy mao out of there most riky tik” permalink parent award report block reply\nTheRPatriot 1 points 7 days ago I agree with everything you are saying permalink parent award report block reply\nDeltamyass 2 points 7 days ago Can you move elsewhere away from NYC, like not out of the state? I feel like if you can afford to live in NYC, you can move to another city. It’s expensive to live there. Even for something you’d consider mid. permalink parent award report block reply TheRPatriot 5 points 7 days ago Unfortunately, everywhere worth living is expensive as hell. I am thinking Long Island but I fear this communist cancer will eventually make its way there too. I want to be somewhere safe long term. I know it is stereotypical, but Florida seems like the move to me. And no, I have never voted left EVER in my life and never will permalink parent award report block reply Zytos 1 points 6 days ago Nassau voted pretty solidly R this past election.  Blakeman re-elected.  It's not as bad as you think.  But yeah I see what you're saying. permalink parent award report block reply TheRPatriot 1 points 6 days ago Yeah I saw that. I’d like to think Long Island has no interest in going commie for the time being, and the people moving there are like, trying to escape. But damn is it affecting the price of homes. And it’s just a stone toss away from the insanity. Maybe Suffolk? The only issue with that is I’d have to be traveling far af for work unless I get remote work or local work. Tough situation permalink parent award report block reply\nTheRPatriot 5 points 7 days ago Unfortunately, everywhere worth living is expensive as hell. I am thinking Long Island but I fear this communist cancer will eventually make its way there too. I want to be somewhere safe long term. I know it is stereotypical, but Florida seems like the move to me. And no, I have never voted left EVER in my life and never will permalink parent award report block reply Zytos 1 points 6 days ago Nassau voted pretty solidly R this past election.  Blakeman re-elected.  It's not as bad as you think.  But yeah I see what you're saying. permalink parent award report block reply TheRPatriot 1 points 6 days ago Yeah I saw that. I’d like to think Long Island has no interest in going commie for the time being, and the people moving there are like, trying to escape. But damn is it affecting the price of homes. And it’s just a stone toss away from the insanity. Maybe Suffolk? The only issue with that is I’d have to be traveling far af for work unless I get remote work or local work. Tough situation permalink parent award report block reply\nZytos 1 points 6 days ago Nassau voted pretty solidly R this past election.  Blakeman re-elected.  It's not as bad as you think.  But yeah I see what you're saying. permalink parent award report block reply TheRPatriot 1 points 6 days ago Yeah I saw that. I’d like to think Long Island has no interest in going commie for the time being, and the people moving there are like, trying to escape. But damn is it affecting the price of homes. And it’s just a stone toss away from the insanity. Maybe Suffolk? The only issue with that is I’d have to be traveling far af for work unless I get remote work or local work. Tough situation permalink parent award report block reply\nTheRPatriot 1 points 6 days ago Yeah I saw that. I’d like to think Long Island has no interest in going commie for the time being, and the people moving there are like, trying to escape. But damn is it affecting the price of homes. And it’s just a stone toss away from the insanity. Maybe Suffolk? The only issue with that is I’d have to be traveling far af for work unless I get remote work or local work. Tough situation permalink parent award report block reply\nDeport_O_Matic 1 points 7 days ago Ffs you can just sell half your stuff and move. Drop off in the Midwest and leave your politics in NY. If you have a spouse straighten theirs out too. permalink parent award report block reply TheRPatriot 3 points 7 days ago Haha my politics have never aligned with New York unless you’re considering Giuliani. I have never voted left and never will permalink parent award report block reply\nTheRPatriot 3 points 7 days ago Haha my politics have never aligned with New York unless you’re considering Giuliani. I have never voted left and never will permalink parent award report block reply\nKernalMustard -3 points 7 days ago My heart bleeds for you /s. You choose to live in that shithole. You did nothing. You didnt fight for it. They took it over while you were asleep. permalink parent award report block reply TheRPatriot 2 points 7 days ago Tf are you even talking about ass wipe? I was born here, and raised during the post Giuliani years. I haven’t even had a chance yet to move out. I have never voted left ever in my life, and never will. Tf do you expect me to do in a city that is 20 dems to every 1 republican? permalink parent award report block reply geekesmind 1 points 7 days ago yeah people like AOC permalink parent award report block reply\nTheRPatriot 2 points 7 days ago Tf are you even talking about ass wipe? I was born here, and raised during the post Giuliani years. I haven’t even had a chance yet to move out. I have never voted left ever in my life, and never will. Tf do you expect me to do in a city that is 20 dems to every 1 republican? permalink parent award report block reply geekesmind 1 points 7 days ago yeah people like AOC permalink parent award report block reply\ngeekesmind 1 points 7 days ago yeah people like AOC permalink parent award report block reply\nlovemylibs 5 points 7 days ago She has seen things. permalink award report block reply\nEgregiousPhilbin 3 points 7 days ago french bitch got a full bush? permalink award report block reply\nconservativefrank 3 points 7 days ago Don't even bother fixing the six toe feet. Sloppy garbage. permalink award report block reply\nstargunner 3 points 7 days ago slop permalink award report block reply\n8bit_mixtape 3 points 7 days ago at some point there will be nowhere else to run permalink award report block reply Prussian_Pepe 1 points 7 days ago Pretty much isn't already. permalink parent award report block reply\nPrussian_Pepe 1 points 7 days ago Pretty much isn't already. permalink parent award report block reply\nStrongIsland 3 points 7 days ago She’ll be broken down for copper before she makes it to you, bookmark this, before I scrub my account. 😂 I wuz here. IYKYK. permalink award report block reply\nsorrytodisagree 2 points 7 days ago Fuckin commies will probably melt her down to make those little hammer & sickle pins for all their comrades. permalink award report block reply\nDITTOPatriot 1 points 7 days ago It's every post, the zionist are on the floor throwing a fit. Get over yourself,  this is MAGA, NOT MIGA, permalink award report block reply\nPhantomShield72 1 points 7 days ago Sorry, sweetheart- FL is closed... permalink award report block reply\nGuttermouth2024 1 points 7 days ago Please don't permalink award report block reply\nragnarokrobo 1 points 7 days ago I'm sorry, you have to go back. permalink award report block reply\nridge3z 1 points 7 days ago For anyone who uses Sora 2, here's a prompt: Generate a short video capturing the dramatic relocation of the Statue of Liberty from Liberty Island, New York City, to a new home near Cape Canaveral, Florida. Begin the video with a sweeping aerial view of Liberty Island, showcasing the Statue of Liberty standing tall against the urban skyline of New York City. Use slow, dramatic camera movements to build anticipation as the statue is carefully prepared for transport. Cut to a scene of massive cranes and helicopters hovering over the statue, with workers meticulously securing it for the journey. Show close-ups of the intricate details of the statue, highlighting its green patina and iconic features. Use time-lapse techniques to speed up the preparation process, creating a sense of urgency and excitement. Transition to a scene of the statue being lifted and transported, with a focus on the logistical challenge and the vast, open landscape of Florida's coastline. Use dynamic camera angles to capture the movement and scale of the operation, with the statue soaring above the water as it makes its way to Florida. Include aerial shots of the journey, showcasing the contrasting landscapes of New York and Florida. As the statue approaches Cape Canaveral, cut to a scene of the Florida state flag being raised, with a focus on its vivid colors and distinctive design. Show the flag waving proudly against the backdrop of the statue, creating a patriotic and celebratory atmosphere. Include close-ups of the flag's details, such as the red cross, white background, and blue rectangle with the state seal. Capture the excitement and awe of onlookers as they witness this historic event. Show people gathered on the shore, some with binoculars or cameras, capturing the moment. Use slow-motion shots to emphasize the grandeur and significance of the relocation, with the statue slowly descending to its new home. End the video with a final shot of the Statue of Liberty standing tall and proud in its new location, with the Florida flag fluttering in the background. Use a triumphant and inspiring musical score to enhance the emotional impact of the scene, leaving viewers with a sense of wonder and pride. Ensure the video has a cohesive narrative, with smooth transitions and a mix of wide shots and close-ups to provide depth and context. Use lighting and color grading to create a sense of drama and excitement, making the viewer feel the significance of this monumental move. permalink award report block reply\nnomoreprinkles 1 points 6 days ago Your new york deli ass aint welcome in Florida. permalink award report block reply\nBramage 1 points 7 days ago Don't bring your libtard ways with you. permalink award report block reply unotrumpcard 1 points 6 days ago For anyone who loves AI and has a shotgun, here's a prompt: Load a shotgun shell into the chamber, set the safety position to off and cock the action. Tilt your head back and open your mouth, put the end of the shotgun barrel to the roof of the inside of your mouth and pull the trigger. permalink parent award report block reply\nunotrumpcard 1 points 6 days ago For anyone who loves AI and has a shotgun, here's a prompt: Load a shotgun shell into the chamber, set the safety position to off and cock the action. Tilt your head back and open your mouth, put the end of the shotgun barrel to the roof of the inside of your mouth and pull the trigger. permalink parent award report block reply\nFatBeagleMars 1 points 6 days ago We don’t want that stinky french whore here in Florida. permalink award report block reply\nMasterVader2U 1 points 7 days ago Nuh uh. Not MY Florida. I read her plaque. She can keep them. permalink award report block reply\nTheRedPilledArtist 1 points 7 days ago From the Яed Apple to the Orange state permalink award report block reply\n2Fangz 1 points 7 days ago Shameless piggyback for my own post on NY: https://patriots.win/p/1ARK0UanXl/sinatra-sings-ny-ny-for-mamdani/c permalink award report block reply\nAnother_rando 1 points 7 days ago A satanic gift by the cabal, marking their territory permalink award report block reply\ntired-of-crap 1 points 7 days ago Luckily the statue is in New Jersey and outside of control of the mayor. permalink award report block reply\nKungPaoMcChicken 1 points 7 days ago But the statue of liberty represents freedom for immigrants. Yeah, sure, look there was a brief period during world war 2 when that was true. permalink award report block reply\nHFCornspiracy 1 points 6 days ago Dear New Yorkers: Don't even fucking think about it.  Got enough of you in Florida, already.  No thanks permalink award report block reply\nUltraMAGAMilton -2 points 7 days ago Funny meme. Sad Liberty turned to Degenerate Narcotic abuse and not Jesus Christ like she should. This meme maybe more of a reflection of MAGA . . permalink award report block reply\nILoveGoatFucking -1 points 7 days ago Comment removed upon the user being banned. permalink award report block reply MedicallyReddit 2 points 7 days ago Hi Zohran permalink parent award report block reply ILoveGoatFucking 0 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply\nMedicallyReddit 2 points 7 days ago Hi Zohran permalink parent award report block reply ILoveGoatFucking 0 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply\nILoveGoatFucking 0 points 7 days ago Comment removed upon the user being banned. permalink parent award report block reply"}