{"id": "1ARK9pfs0I", "contents": "106 The chick who beat Joe Kent in his congressional race pleasantly surprised the nation tonight posted 7 hours ago by SALTYinSeattle 11 comments award share download report block\n11 comments Sort by Top Top New Worst Old Save Around the Web mykillk 7 points 7 hours ago Decent message although I'm pressing 'F' to doubt she has \"friends who rely on SNAP\" permalink award report block reply darkmodeforgotpass 8 points 7 hours ago It's just a lie to push a message. Both sides are fucked and retarded. permalink parent award report block reply Squentin 6 points 7 hours ago It was the flight cancellations that made them cave Low lifes permalink award report block reply Brandon1776 4 points 6 hours ago Joe Kent worked for the CIA.....I thiuhht we hated those kinds of people. Cant be trusted permalink award report block reply duckduck 2 points 6 hours ago She ran as a moderate, deemphasizing running as a Democrat, and having rural cliches like tractors in her ads. permalink award report block reply Necrovoter 3 points 6 hours ago Why do we need those CO2 producing farms anyway?  We get almost all of our food from grocery stores!  /s She probably figured that vote was one of the first steps in her gaining some future brokering power with the uniparty.   They all knew it would end soon. permalink parent award report block reply TheBasedFriscoMan 2 points 6 hours ago She looks like a man, baby! permalink award report block reply Aisle-is-closed 1 points 3 hours ago Low key message about universal healthcare. permalink award report block reply SALTYinSeattle OP 1 points 7 hours ago https://x.com/RepMGP/status/1988781065658650656 permalink award report block reply darkmodeforgotpass 1 points 7 hours ago Gay permalink award report block reply PlantTrees 1 points 6 hours ago Ok, one datapoint granted .. but I'll reserve judgement til we see her standing on ICE, deportations, 'climate change', Ukraine, etc etc etc. permalink award report block reply\nmykillk 7 points 7 hours ago Decent message although I'm pressing 'F' to doubt she has \"friends who rely on SNAP\" permalink award report block reply darkmodeforgotpass 8 points 7 hours ago It's just a lie to push a message. Both sides are fucked and retarded. permalink parent award report block reply\ndarkmodeforgotpass 8 points 7 hours ago It's just a lie to push a message. Both sides are fucked and retarded. permalink parent award report block reply\nSquentin 6 points 7 hours ago It was the flight cancellations that made them cave Low lifes permalink award report block reply\nBrandon1776 4 points 6 hours ago Joe Kent worked for the CIA.....I thiuhht we hated those kinds of people. Cant be trusted permalink award report block reply\nduckduck 2 points 6 hours ago She ran as a moderate, deemphasizing running as a Democrat, and having rural cliches like tractors in her ads. permalink award report block reply Necrovoter 3 points 6 hours ago Why do we need those CO2 producing farms anyway?  We get almost all of our food from grocery stores!  /s She probably figured that vote was one of the first steps in her gaining some future brokering power with the uniparty.   They all knew it would end soon. permalink parent award report block reply\nNecrovoter 3 points 6 hours ago Why do we need those CO2 producing farms anyway?  We get almost all of our food from grocery stores!  /s She probably figured that vote was one of the first steps in her gaining some future brokering power with the uniparty.   They all knew it would end soon. permalink parent award report block reply\nTheBasedFriscoMan 2 points 6 hours ago She looks like a man, baby! permalink award report block reply\nAisle-is-closed 1 points 3 hours ago Low key message about universal healthcare. permalink award report block reply\nSALTYinSeattle OP 1 points 7 hours ago https://x.com/RepMGP/status/1988781065658650656 permalink award report block reply\ndarkmodeforgotpass 1 points 7 hours ago Gay permalink award report block reply\nPlantTrees 1 points 6 hours ago Ok, one datapoint granted .. but I'll reserve judgement til we see her standing on ICE, deportations, 'climate change', Ukraine, etc etc etc. permalink award report block reply"}