{"id": "1ARK9nPu6q", "contents": "15 I hate Islam but they make up 1% of usa. posted 5 hours ago by TrumpYouMagaFrenner 12 comments award share report block Christians make up 67%. Just wanted a reminder for a little cheer.\n12 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget CrossTheRubixCube 6 points 5 hours ago Jews are 2.5% yet here we are. permalink award report block reply TrumpYouMagaFrenner OP 3 points 5 hours ago Here we are what? Defending Israel? permalink parent award report block reply CrossTheRubixCube 3 points 5 hours ago I’m saying you don’t need a large percentage to have massive influence in this country. 1% is easy to scoff at, but if these people get in the right places they will be even more of an issue. permalink parent award report block reply JayKay1776 4 points 5 hours ago Considering their ideology and that if we don't convert to their ideology we must be destroyed. 0% belong here zero! They're religion is not compatible with the west and considering what they did to us during the real slave trade you know the one that was created the Crusades. We should have wiped Muslims off the face of the Earth after that. permalink award report block reply TrumpYouMagaFrenner OP 1 points 5 hours ago I agree but its good to remember how tuly insignificant they are here. 0 is best. But videos of them marching like the ones stickied make it seem as if they are much more of a problem than they are. Just like showing a video of one bad cop makes all cops look bad. permalink parent award report block reply JayKay1776 4 points 5 hours ago I think I think they're illustrating that the Islam or Muslims are like a fucking virus or infection if you don't deal with it 0% turns to 20% and then mondami is fucking elected or Dearborn is taking over where they're playing prayer music it's starts little but balloons really quickly because of their infestation. permalink parent award report block reply TrumpYouMagaFrenner OP 1 points 5 hours ago Well let them try that in a small town as jason Aldean would say permalink parent award report block reply henri_derelicte 3 points 5 hours ago If Islam is this much of a problem at 1%, imagine how much worse it’ll be at 5% or 10% permalink award report block reply TrumpYouMagaFrenner OP 1 points 5 hours ago It'll never get that way permalink parent award report block reply SpaceWizard 2 points 5 hours ago Ya. Muslims can suck a dick permalink award report block reply MemeWarsVet 1 points 4 hours ago So far. permalink award report block reply rpettit 1 points 4 hours ago 1%...... so far.  Prevention is always the best medicine. permalink award report block reply\nCrossTheRubixCube 6 points 5 hours ago Jews are 2.5% yet here we are. permalink award report block reply TrumpYouMagaFrenner OP 3 points 5 hours ago Here we are what? Defending Israel? permalink parent award report block reply CrossTheRubixCube 3 points 5 hours ago I’m saying you don’t need a large percentage to have massive influence in this country. 1% is easy to scoff at, but if these people get in the right places they will be even more of an issue. permalink parent award report block reply\nTrumpYouMagaFrenner OP 3 points 5 hours ago Here we are what? Defending Israel? permalink parent award report block reply CrossTheRubixCube 3 points 5 hours ago I’m saying you don’t need a large percentage to have massive influence in this country. 1% is easy to scoff at, but if these people get in the right places they will be even more of an issue. permalink parent award report block reply\nCrossTheRubixCube 3 points 5 hours ago I’m saying you don’t need a large percentage to have massive influence in this country. 1% is easy to scoff at, but if these people get in the right places they will be even more of an issue. permalink parent award report block reply\nJayKay1776 4 points 5 hours ago Considering their ideology and that if we don't convert to their ideology we must be destroyed. 0% belong here zero! They're religion is not compatible with the west and considering what they did to us during the real slave trade you know the one that was created the Crusades. We should have wiped Muslims off the face of the Earth after that. permalink award report block reply TrumpYouMagaFrenner OP 1 points 5 hours ago I agree but its good to remember how tuly insignificant they are here. 0 is best. But videos of them marching like the ones stickied make it seem as if they are much more of a problem than they are. Just like showing a video of one bad cop makes all cops look bad. permalink parent award report block reply JayKay1776 4 points 5 hours ago I think I think they're illustrating that the Islam or Muslims are like a fucking virus or infection if you don't deal with it 0% turns to 20% and then mondami is fucking elected or Dearborn is taking over where they're playing prayer music it's starts little but balloons really quickly because of their infestation. permalink parent award report block reply TrumpYouMagaFrenner OP 1 points 5 hours ago Well let them try that in a small town as jason Aldean would say permalink parent award report block reply\nTrumpYouMagaFrenner OP 1 points 5 hours ago I agree but its good to remember how tuly insignificant they are here. 0 is best. But videos of them marching like the ones stickied make it seem as if they are much more of a problem than they are. Just like showing a video of one bad cop makes all cops look bad. permalink parent award report block reply JayKay1776 4 points 5 hours ago I think I think they're illustrating that the Islam or Muslims are like a fucking virus or infection if you don't deal with it 0% turns to 20% and then mondami is fucking elected or Dearborn is taking over where they're playing prayer music it's starts little but balloons really quickly because of their infestation. permalink parent award report block reply TrumpYouMagaFrenner OP 1 points 5 hours ago Well let them try that in a small town as jason Aldean would say permalink parent award report block reply\nJayKay1776 4 points 5 hours ago I think I think they're illustrating that the Islam or Muslims are like a fucking virus or infection if you don't deal with it 0% turns to 20% and then mondami is fucking elected or Dearborn is taking over where they're playing prayer music it's starts little but balloons really quickly because of their infestation. permalink parent award report block reply TrumpYouMagaFrenner OP 1 points 5 hours ago Well let them try that in a small town as jason Aldean would say permalink parent award report block reply\nTrumpYouMagaFrenner OP 1 points 5 hours ago Well let them try that in a small town as jason Aldean would say permalink parent award report block reply\nhenri_derelicte 3 points 5 hours ago If Islam is this much of a problem at 1%, imagine how much worse it’ll be at 5% or 10% permalink award report block reply TrumpYouMagaFrenner OP 1 points 5 hours ago It'll never get that way permalink parent award report block reply\nTrumpYouMagaFrenner OP 1 points 5 hours ago It'll never get that way permalink parent award report block reply\nSpaceWizard 2 points 5 hours ago Ya. Muslims can suck a dick permalink award report block reply\nMemeWarsVet 1 points 4 hours ago So far. permalink award report block reply\nrpettit 1 points 4 hours ago 1%...... so far.  Prevention is always the best medicine. permalink award report block reply"}