{"id": "1ARK0Ub4ev", "contents": "795 Kilter Knows posted 7 days ago by rdvs34283 12 comments award share download report block\n12 comments Sort by Top Top New Worst Old Save Around the Web Hair Will Grow Back! No Matter How Severe The Baldness HaloGrow Krat 13 points 7 days ago Can you believe the people just sit there and do nothing while getting enslaved ?!?! permalink award report block reply localhost 3 points 7 days ago And what are you doing, Mr. Keyboard Warrior, to drive them from our lands? permalink parent award report block reply Waco419 9 points 7 days ago It amazes me that some people actually believe that they are morally obliged to accept someone else’s ridiculous assertion that they must be obeyed. Nobody has the moral duty to obey anyone else. Ever. Political Authority is a myth and a mass delusion. permalink award report block reply SimaYi 3 points 7 days ago That will eventually be realized. permalink parent award report block reply eclectic22 8 points 7 days ago What a surprise! permalink award report block reply Counterwhat 5 points 7 days ago How odd. permalink award report block reply DogFart_ 3 points 7 days ago yes. yes i believe it permalink award report block reply Megaboom2025 2 points 7 days ago Reddit: “this is a good thing, no more evil white men” permalink award report block reply SimaYi 2 points 7 days ago bingo. Wait until you're a White minority in 10 years. You're gonna love it. permalink award report block reply neveser 1 points 7 days ago Definitely verklempt over this. permalink award report block reply A_Colostomy_Bag 1 points 7 days ago As the brainwashed leftists like to say, we're being \"colonized\"! permalink award report block reply BillGateCanSuckIt 1 points 6 days ago Take over countries with this one simple trick. permalink award report block reply\nKrat 13 points 7 days ago Can you believe the people just sit there and do nothing while getting enslaved ?!?! permalink award report block reply localhost 3 points 7 days ago And what are you doing, Mr. Keyboard Warrior, to drive them from our lands? permalink parent award report block reply\nlocalhost 3 points 7 days ago And what are you doing, Mr. Keyboard Warrior, to drive them from our lands? permalink parent award report block reply\nWaco419 9 points 7 days ago It amazes me that some people actually believe that they are morally obliged to accept someone else’s ridiculous assertion that they must be obeyed. Nobody has the moral duty to obey anyone else. Ever. Political Authority is a myth and a mass delusion. permalink award report block reply SimaYi 3 points 7 days ago That will eventually be realized. permalink parent award report block reply\nSimaYi 3 points 7 days ago That will eventually be realized. permalink parent award report block reply\neclectic22 8 points 7 days ago What a surprise! permalink award report block reply\nCounterwhat 5 points 7 days ago How odd. permalink award report block reply\nDogFart_ 3 points 7 days ago yes. yes i believe it permalink award report block reply\nMegaboom2025 2 points 7 days ago Reddit: “this is a good thing, no more evil white men” permalink award report block reply\nSimaYi 2 points 7 days ago bingo. Wait until you're a White minority in 10 years. You're gonna love it. permalink award report block reply\nneveser 1 points 7 days ago Definitely verklempt over this. permalink award report block reply\nA_Colostomy_Bag 1 points 7 days ago As the brainwashed leftists like to say, we're being \"colonized\"! permalink award report block reply\nBillGateCanSuckIt 1 points 6 days ago Take over countries with this one simple trick. permalink award report block reply"}