{"id": "1ARK9mFrlR", "contents": "98 Erika Kirk: \"I see you alive in our babies; especially at night. I remember walking into her room and hearing both of you singing Jesus Loves Me as she falls asleep.... And now, she sings it for her baby brother as she puts him to bed every night. Her voice now carries both you and her in one. (www.instagram.com) posted 21 hours ago by AccipiterQ 4 comments award share report block E. on Instagram: \"…I see you alive in our babies; especially at night. I remember walking into her room and hearing both of you ... 867K likes, 18K comments - mrserikakirk on November 7, 2025: \"…I see you alive in our babies; especially at night. I remember walking into her room and hearing both of you singing Jesus Loves Me as she falls asleep. My heart would melt; seeing you in dad m... www.instagram.com\n4 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style Greenspikefrog 0 points 19 hours ago Just what I would expect of Erika Kirk.  She let Charlie do all the work, and put the kids to bed.  Now she’s letting the oldest do it? This woman’s sus permalink award report block reply HockeyMom4Trump 1 points 8 hours ago Not sure I would call putting the children to bed work. It was always a joy for me. Bedtime stories and cuddles and tucking them in nice and cozy. That being said, the monitor is creepy. How did generations of women raise children without cameras monitoring their every moment? permalink parent award report block reply DontBeAFaggot 1 points 13 hours ago Bought and paid for permalink parent award report block reply Reddit2016 1 points 18 hours ago That's what you got out of this video?? You're the one who's sus permalink parent award report block reply\nGreenspikefrog 0 points 19 hours ago Just what I would expect of Erika Kirk.  She let Charlie do all the work, and put the kids to bed.  Now she’s letting the oldest do it? This woman’s sus permalink award report block reply HockeyMom4Trump 1 points 8 hours ago Not sure I would call putting the children to bed work. It was always a joy for me. Bedtime stories and cuddles and tucking them in nice and cozy. That being said, the monitor is creepy. How did generations of women raise children without cameras monitoring their every moment? permalink parent award report block reply DontBeAFaggot 1 points 13 hours ago Bought and paid for permalink parent award report block reply Reddit2016 1 points 18 hours ago That's what you got out of this video?? You're the one who's sus permalink parent award report block reply\nHockeyMom4Trump 1 points 8 hours ago Not sure I would call putting the children to bed work. It was always a joy for me. Bedtime stories and cuddles and tucking them in nice and cozy. That being said, the monitor is creepy. How did generations of women raise children without cameras monitoring their every moment? permalink parent award report block reply\nDontBeAFaggot 1 points 13 hours ago Bought and paid for permalink parent award report block reply\nReddit2016 1 points 18 hours ago That's what you got out of this video?? You're the one who's sus permalink parent award report block reply"}