{"id": "1ARK0UbcxP", "contents": "591 Troon tiktoker has “kiII all Republicans” in bio, his name is “I make bombs” and his pfp is “rape Elon.” He also celebrated Charlie’s ass*ssination, calls for a “revolution” while posing with a gun and wants Republicans to “be afraid.” Definitely a future school/church shooter. @FBI posted 7 days ago by Mr_Rightside 34 comments award share download report block\n34 comments Sort by Top Top New Worst Old Save ColonelKlink 25 points 7 days ago Pedos/rapists are the most violent people. permalink award report block reply BarronVonSaltzburg26 6 points 7 days ago You forgot to add Trannies to your list permalink parent award report block reply IlhanOmarsFagBrother 6 points 6 days ago Already inclusive when you mention pedos and rapists permalink parent award report block reply Filo76 17 points 7 days ago LOL Of course he calls himself Lilith. permalink award report block reply UCantStumpTheTrump 5 points 7 days ago If you had posted anything remotely threatening like this under the Biden regime, the FBI would be bursting in your door looking to shoot you in the head in a heartbeat permalink parent award report block reply TrancePhreak 14 points 7 days ago Trannies are disgusting. People rarely get one mental illness, it usually comes in sets. permalink award report block reply GallowsTime 9 points 7 days ago They only succeed in looking nothing like a male or a female. permalink parent award report block reply CleanUpPhillyTrump24 13 points 7 days ago https://tips.fbi.gov/home permalink award report block reply TrancePhreak 9 points 7 days ago That's the real way. permalink parent award report block reply snoozeflu 2 points 7 days ago Does reporting this shit even do anything? I get the feeling it's a big waste of time. permalink parent award report block reply worldowedexplanation 1 points 6 days ago No, they just use him for their next planned shooting permalink parent award report block reply RedFoxOnFire 8 points 7 days ago Sounds like he has a future in politics.  Someone get this guy to run for AG. permalink award report block reply Mr_Rightside OP 6 points 7 days ago https://x.com/libsoftiktok/status/1986233829179158568 permalink award report block reply Threaper666 6 points 7 days ago The Trump administration won't do anything about it.  If I was in power all these fucks would be behind bars.  There would be no Antifa. permalink parent award report block reply Toecutter7N6 6 points 7 days ago 3rd graders everywhere should be concerned. permalink award report block reply RedEnsign4Trump 4 points 7 days ago \"Lilith\" is also a demonic name, the demon of lust. \"The name Lilith originates from ancient Mesopotamian mythology, derived from the Akkadian word lilitu, meaning \"female night spirit\" or \"demon. It is associated with the Sumerian lilītu and the related ardat lilī, which referred to female demons or wind spirits believed to inhabit desert lands and cause harm to pregnant women and infants.\" permalink award report block reply PM-Melania-feet-pics 1 points 6 days ago Tracks permalink parent award report block reply blitzkrieg1 3 points 7 days ago The part missing is the person who kills another that has never done that before gets to watch. Hard lesson for any of US. permalink award report block reply mydogma8yourkarma 3 points 7 days ago \"Best we can do is wait for him to shoot up a school\" - Probably Rick or Corey permalink award report block reply boataholic 2 points 6 days ago Known to the FBI they will say. permalink award report block reply MajorG 2 points 7 days ago He’s more likely to use that gun on himself or innocent children than grown republicans. permalink award report block reply worldowedexplanation 1 points 6 days ago FBI is busy recruiting him permalink award report block reply KungPaoMcChicken 1 points 7 days ago Off to school troon. Show us how brave you are by taking your anger out on some kids. permalink award report block reply PM-Melania-feet-pics 1 points 6 days ago We need armed guards. Or to allow teachers to CCW permalink parent award report block reply lavebug 1 points 7 days ago We need a name and an address permalink award report block reply BitterRoots 1 points 6 days ago Troon trying to look and sound tough. permalink award report block reply SimaYi 1 points 7 days ago Waiting for someone to fight your battles for you? You know who he is. Take care of it. permalink award report block reply BillGateCanSuckIt 1 points 6 days ago Extra hormones for life what could go wrong? permalink award report block reply Wupta PRO 1 points 7 days ago A walking dead man permalink award report block reply Brownwaterboys 1 points 6 days ago The nose in the bottom right sort of checks out. permalink award report block reply AccelerateAlready 1 points 7 days ago What a fag. permalink award report block reply jermzdeejd 1 points 6 days ago Is it all the drugs that make them so susceptible to the propaganda? permalink award report block reply taytaytay -1 points 7 days ago jeez calm down m'guy permalink award report block reply\nColonelKlink 25 points 7 days ago Pedos/rapists are the most violent people. permalink award report block reply BarronVonSaltzburg26 6 points 7 days ago You forgot to add Trannies to your list permalink parent award report block reply IlhanOmarsFagBrother 6 points 6 days ago Already inclusive when you mention pedos and rapists permalink parent award report block reply\nBarronVonSaltzburg26 6 points 7 days ago You forgot to add Trannies to your list permalink parent award report block reply IlhanOmarsFagBrother 6 points 6 days ago Already inclusive when you mention pedos and rapists permalink parent award report block reply\nIlhanOmarsFagBrother 6 points 6 days ago Already inclusive when you mention pedos and rapists permalink parent award report block reply\nFilo76 17 points 7 days ago LOL Of course he calls himself Lilith. permalink award report block reply UCantStumpTheTrump 5 points 7 days ago If you had posted anything remotely threatening like this under the Biden regime, the FBI would be bursting in your door looking to shoot you in the head in a heartbeat permalink parent award report block reply\nUCantStumpTheTrump 5 points 7 days ago If you had posted anything remotely threatening like this under the Biden regime, the FBI would be bursting in your door looking to shoot you in the head in a heartbeat permalink parent award report block reply\nTrancePhreak 14 points 7 days ago Trannies are disgusting. People rarely get one mental illness, it usually comes in sets. permalink award report block reply GallowsTime 9 points 7 days ago They only succeed in looking nothing like a male or a female. permalink parent award report block reply\nGallowsTime 9 points 7 days ago They only succeed in looking nothing like a male or a female. permalink parent award report block reply\nCleanUpPhillyTrump24 13 points 7 days ago https://tips.fbi.gov/home permalink award report block reply TrancePhreak 9 points 7 days ago That's the real way. permalink parent award report block reply snoozeflu 2 points 7 days ago Does reporting this shit even do anything? I get the feeling it's a big waste of time. permalink parent award report block reply worldowedexplanation 1 points 6 days ago No, they just use him for their next planned shooting permalink parent award report block reply\nTrancePhreak 9 points 7 days ago That's the real way. permalink parent award report block reply\nsnoozeflu 2 points 7 days ago Does reporting this shit even do anything? I get the feeling it's a big waste of time. permalink parent award report block reply worldowedexplanation 1 points 6 days ago No, they just use him for their next planned shooting permalink parent award report block reply\nworldowedexplanation 1 points 6 days ago No, they just use him for their next planned shooting permalink parent award report block reply\nRedFoxOnFire 8 points 7 days ago Sounds like he has a future in politics.  Someone get this guy to run for AG. permalink award report block reply\nMr_Rightside OP 6 points 7 days ago https://x.com/libsoftiktok/status/1986233829179158568 permalink award report block reply Threaper666 6 points 7 days ago The Trump administration won't do anything about it.  If I was in power all these fucks would be behind bars.  There would be no Antifa. permalink parent award report block reply\nThreaper666 6 points 7 days ago The Trump administration won't do anything about it.  If I was in power all these fucks would be behind bars.  There would be no Antifa. permalink parent award report block reply\nToecutter7N6 6 points 7 days ago 3rd graders everywhere should be concerned. permalink award report block reply\nRedEnsign4Trump 4 points 7 days ago \"Lilith\" is also a demonic name, the demon of lust. \"The name Lilith originates from ancient Mesopotamian mythology, derived from the Akkadian word lilitu, meaning \"female night spirit\" or \"demon. It is associated with the Sumerian lilītu and the related ardat lilī, which referred to female demons or wind spirits believed to inhabit desert lands and cause harm to pregnant women and infants.\" permalink award report block reply PM-Melania-feet-pics 1 points 6 days ago Tracks permalink parent award report block reply\nPM-Melania-feet-pics 1 points 6 days ago Tracks permalink parent award report block reply\nblitzkrieg1 3 points 7 days ago The part missing is the person who kills another that has never done that before gets to watch. Hard lesson for any of US. permalink award report block reply\nmydogma8yourkarma 3 points 7 days ago \"Best we can do is wait for him to shoot up a school\" - Probably Rick or Corey permalink award report block reply\nboataholic 2 points 6 days ago Known to the FBI they will say. permalink award report block reply\nMajorG 2 points 7 days ago He’s more likely to use that gun on himself or innocent children than grown republicans. permalink award report block reply\nworldowedexplanation 1 points 6 days ago FBI is busy recruiting him permalink award report block reply\nKungPaoMcChicken 1 points 7 days ago Off to school troon. Show us how brave you are by taking your anger out on some kids. permalink award report block reply PM-Melania-feet-pics 1 points 6 days ago We need armed guards. Or to allow teachers to CCW permalink parent award report block reply\nPM-Melania-feet-pics 1 points 6 days ago We need armed guards. Or to allow teachers to CCW permalink parent award report block reply\nlavebug 1 points 7 days ago We need a name and an address permalink award report block reply\nBitterRoots 1 points 6 days ago Troon trying to look and sound tough. permalink award report block reply\nSimaYi 1 points 7 days ago Waiting for someone to fight your battles for you? You know who he is. Take care of it. permalink award report block reply\nBillGateCanSuckIt 1 points 6 days ago Extra hormones for life what could go wrong? permalink award report block reply\nWupta PRO 1 points 7 days ago A walking dead man permalink award report block reply\nBrownwaterboys 1 points 6 days ago The nose in the bottom right sort of checks out. permalink award report block reply\nAccelerateAlready 1 points 7 days ago What a fag. permalink award report block reply\njermzdeejd 1 points 6 days ago Is it all the drugs that make them so susceptible to the propaganda? permalink award report block reply\ntaytaytay -1 points 7 days ago jeez calm down m'guy permalink award report block reply"}