{"id": "1ARK9oWNDn", "contents": "70 Hope JD Vance recognizes that no immigration, mass deportations, and ending the income tax would give him 2028 in a landslide. posted 3 hours ago by wharfthrowaway 7 comments award share report block The left is still imploding and the right isn’t far enough to the right\n7 comments Sort by Top Top New Worst Old Save Around the Web Stop Eating These 3 Foods That Are Known to Cause Parasites Paratoxil loooooof 10 points 3 hours ago Unless drastic changes are made, the mid-terms will be a bloodbath for Republicans. permalink award report block reply Say_what_again 3 points 2 hours ago Just as the GOP planned it permalink parent award report block reply Iremembermypassword 7 points 3 hours ago JD has to choose between his in-Laws and his Nation. permalink award report block reply ReleasetheList 5 points 2 hours ago Trump ran on mass deportations and removal of the income tax. It's easy to promise the world, it's another thing entirely to actually deliver. permalink award report block reply RED_WAVE 2 points 2 hours ago On the topic of immigration - he doesn't recognize that.  And he wouldn't follow through even if he made that promise.  I mean look who he's married to... permalink award report block reply SpeekFreely 1 points 2 hours ago Vance won’t even be an option, he’s probably smart enough to sit out a cycle or two. permalink award report block reply EyesSewnShut 1 points 3 hours ago Comment removed by community moderators. permalink award report block reply\nloooooof 10 points 3 hours ago Unless drastic changes are made, the mid-terms will be a bloodbath for Republicans. permalink award report block reply Say_what_again 3 points 2 hours ago Just as the GOP planned it permalink parent award report block reply\nSay_what_again 3 points 2 hours ago Just as the GOP planned it permalink parent award report block reply\nIremembermypassword 7 points 3 hours ago JD has to choose between his in-Laws and his Nation. permalink award report block reply\nReleasetheList 5 points 2 hours ago Trump ran on mass deportations and removal of the income tax. It's easy to promise the world, it's another thing entirely to actually deliver. permalink award report block reply\nRED_WAVE 2 points 2 hours ago On the topic of immigration - he doesn't recognize that.  And he wouldn't follow through even if he made that promise.  I mean look who he's married to... permalink award report block reply\nSpeekFreely 1 points 2 hours ago Vance won’t even be an option, he’s probably smart enough to sit out a cycle or two. permalink award report block reply\nEyesSewnShut 1 points 3 hours ago Comment removed by community moderators. permalink award report block reply"}