{"id": "1ARK9jzckn", "contents": "346 Tucker Carlson - \"If Lindsey Graham gets reelected to the US Senate, there’s no reason to have a Republican Party. Here’s how to stop it.\" posted 1 day ago by Royall 11 comments award share report block Tucker Carlson @TuckerCarlson • 7d If Lindsey Graham gets reelected to the US Senate, there’s no reason to have a Republican Party. Here’s how to stop it. (0:00) Monologue (45:23) Why Paul Dans Decided to Run Against Lindsey Graham (1:00:01) How Globalism Destroyed the United States (1:05:45) Republicans Secretly\n11 comments Sort by Top Top New Worst Old Save TrumpVoter1 10 points 1 day ago Graham will be re-elected. you can take that to the bank. safest seat in the entire country permalink award report block reply Simple_Doot 8 points 1 day ago Trump loves Lady G and, unbelievably, has endorsed they/them. permalink parent award report block reply TrumpVoter1 4 points 1 day ago love is not the word. useful is better when it comes to Trump &  graham. like him or not he does have influence in the senate permalink parent award report block reply patrioticwinning3 3 points 1 day ago Meaning he has pictures of half the Senators :p permalink parent award report block reply Simple_Doot 2 points 1 day ago Yeah not worth it.  Break his neck and throw him in a dumpster. permalink parent award report block reply SaxonRealm 4 points 1 day ago Why do they keep voting for Graham? He’s terrible. permalink parent award report block reply TrumpVoter1 7 points 1 day ago he is the only candidate that the SC GOP give them to vote for. IMHO they are the proof that the GOP also cheat in elections, though in this case its vetting and in the primaries.  But in the general voters do turnout for him. In his last re-election he received almost 1.5 million votes in a state of around 5 million. permalink parent award report block reply 5DchessWatch 6 points 1 day ago lol, Tucker implied that Graham was on Grindr permalink award report block reply 5DchessWatch 2 points 1 day ago 1:45 - Paul Dans starts talking about how TPUSA was totally against Lindsey Graham.  Was Graham also involved in Kirk's slaying? He said Charlie was in SC weeks before he was killed telling SClinians that they need a new senator other than Lindsey.  That's what added to Paul Dans' motivation to run against Graham permalink award report block reply 5DchessWatch 2 points 1 day ago Who is Rabbi Buttplug?  edit: oh its rabbi schmooly.  alex jones term permalink award report block reply PatPede1 2 points 1 day ago Paul Dans seems great, but isn’t really a politician.  Lady Lindsay will fill up on martinis and go for the jugular like a rabid poodle. permalink award report block reply\nTrumpVoter1 10 points 1 day ago Graham will be re-elected. you can take that to the bank. safest seat in the entire country permalink award report block reply Simple_Doot 8 points 1 day ago Trump loves Lady G and, unbelievably, has endorsed they/them. permalink parent award report block reply TrumpVoter1 4 points 1 day ago love is not the word. useful is better when it comes to Trump &  graham. like him or not he does have influence in the senate permalink parent award report block reply patrioticwinning3 3 points 1 day ago Meaning he has pictures of half the Senators :p permalink parent award report block reply Simple_Doot 2 points 1 day ago Yeah not worth it.  Break his neck and throw him in a dumpster. permalink parent award report block reply SaxonRealm 4 points 1 day ago Why do they keep voting for Graham? He’s terrible. permalink parent award report block reply TrumpVoter1 7 points 1 day ago he is the only candidate that the SC GOP give them to vote for. IMHO they are the proof that the GOP also cheat in elections, though in this case its vetting and in the primaries.  But in the general voters do turnout for him. In his last re-election he received almost 1.5 million votes in a state of around 5 million. permalink parent award report block reply\nSimple_Doot 8 points 1 day ago Trump loves Lady G and, unbelievably, has endorsed they/them. permalink parent award report block reply TrumpVoter1 4 points 1 day ago love is not the word. useful is better when it comes to Trump &  graham. like him or not he does have influence in the senate permalink parent award report block reply patrioticwinning3 3 points 1 day ago Meaning he has pictures of half the Senators :p permalink parent award report block reply Simple_Doot 2 points 1 day ago Yeah not worth it.  Break his neck and throw him in a dumpster. permalink parent award report block reply\nTrumpVoter1 4 points 1 day ago love is not the word. useful is better when it comes to Trump &  graham. like him or not he does have influence in the senate permalink parent award report block reply patrioticwinning3 3 points 1 day ago Meaning he has pictures of half the Senators :p permalink parent award report block reply Simple_Doot 2 points 1 day ago Yeah not worth it.  Break his neck and throw him in a dumpster. permalink parent award report block reply\npatrioticwinning3 3 points 1 day ago Meaning he has pictures of half the Senators :p permalink parent award report block reply\nSimple_Doot 2 points 1 day ago Yeah not worth it.  Break his neck and throw him in a dumpster. permalink parent award report block reply\nSaxonRealm 4 points 1 day ago Why do they keep voting for Graham? He’s terrible. permalink parent award report block reply TrumpVoter1 7 points 1 day ago he is the only candidate that the SC GOP give them to vote for. IMHO they are the proof that the GOP also cheat in elections, though in this case its vetting and in the primaries.  But in the general voters do turnout for him. In his last re-election he received almost 1.5 million votes in a state of around 5 million. permalink parent award report block reply\nTrumpVoter1 7 points 1 day ago he is the only candidate that the SC GOP give them to vote for. IMHO they are the proof that the GOP also cheat in elections, though in this case its vetting and in the primaries.  But in the general voters do turnout for him. In his last re-election he received almost 1.5 million votes in a state of around 5 million. permalink parent award report block reply\n5DchessWatch 6 points 1 day ago lol, Tucker implied that Graham was on Grindr permalink award report block reply\n5DchessWatch 2 points 1 day ago 1:45 - Paul Dans starts talking about how TPUSA was totally against Lindsey Graham.  Was Graham also involved in Kirk's slaying? He said Charlie was in SC weeks before he was killed telling SClinians that they need a new senator other than Lindsey.  That's what added to Paul Dans' motivation to run against Graham permalink award report block reply\n5DchessWatch 2 points 1 day ago Who is Rabbi Buttplug?  edit: oh its rabbi schmooly.  alex jones term permalink award report block reply\nPatPede1 2 points 1 day ago Paul Dans seems great, but isn’t really a politician.  Lady Lindsay will fill up on martinis and go for the jugular like a rabid poodle. permalink award report block reply"}