{"id": "1ARK9hiYKd", "contents": "807 Europe in 2050 posted 2 days ago by Chukna 177 comments award share download report block\n177 comments Sort by Top Top New Worst Old Save Mungo 62 points 2 days ago Um…..why is there East and West Germany?   Pretty sure Reagan took care of that. permalink award report block reply Svaap 28 points 2 days ago Huh, you're right!  I'm old enough where I didn't actually have that sink in at first, but WTH is that!?  LOL permalink parent award report block reply Aoikaze2000 16 points 2 days ago Yeah, I was seeing if this wasn't an old projection, but saw no USSR, Yugoslavia, nor Czechoslavakia so I'm not sure what this is tbh. permalink parent award report block reply TwoArizonaPedes 6 points 2 days ago It's Muslim propaganda bullshit from Prince Sultan University in Saudi Arabia. Why is it posted here? permalink parent award report block reply Aoikaze2000 4 points 2 days ago Maybe so, but it means we gotta push harder against the death cult... or we're gonna completely lose our European heritage. permalink parent award report block reply view 1 more comments... Chukna OP -2 points 2 days ago What propaganda? This is warning of islamization of Europe through uncontrolled immigration. permalink parent award report block reply view 4 more comments... KarameloKamala 1 points 2 days ago East Germany is far more politically right.  Im guessing its some sort of interpretation based on political leaning, so they made it a separate state. permalink parent award report block reply Svaap 1 points 1 day ago That makes no sense though.  Germany is a unified country since 1989, that's the first time I've seen East/West on a map since high school! permalink parent award report block reply South_Florida_Guy 14 points 2 days ago They might be better off going back to that permalink parent award report block reply ActNow 5 points 2 days ago Wonder if the guards would be shooting people escaping to East Germany this time. permalink parent award report block reply DeportThemAllForever -3 points 2 days ago Pretty soon guards would be escaping Germany. permalink parent award report block reply 3percenterFan 9 points 2 days ago I suspect that the Muslim population gravitates more to the West, which is softer, weaker, more liberal, easier to exploit. permalink parent award report block reply Wexit-Delecto -3 points 2 days ago There could be another reason. Invaders from without need gate openers from within: https://en.wikipedia.org/wiki/Jewish_population_by_country permalink parent award report block reply Nitrenes 8 points 2 days ago I like the distinction, they are still somewhat culturally different, and East Germans are more wary of foreigners. As far as I could tell the older the person the greater the difference. permalink parent award report block reply Johnkimble111 4 points 2 days ago They don’t care for Commies and Muslims in East Germany and so refuse to suffer again permalink parent award report block reply load 15 more comments... Shih_Tabed 25 points 2 days ago Poland.  I believe they shoot to kill with live ammo at the border.  Looks like that plan is working out. permalink award report block reply billybaldwin2 16 points 2 days ago Spain did let in a lot for a few hundred years, before they wiped them out of the country. Then, they solidified what Spain is. Portugal too. permalink award report block reply ParadigmShift2070 5 points 2 days ago who opened the gates of Toledo permalink parent award report block reply Taqiyya_Mockingbird 3 points 2 days ago Maybe Barbara Lerner Spectre can explain it permalink parent award report block reply mty_green_go 1 points 2 days ago Then Spain had giant \"REFUGEES WELCOME\" banners all of their capital a few years ago. https://www.shutterstock.com/search/madrid-refugees-welcome permalink parent award report block reply NomadicKrow2 8 points 2 days ago The guys who fought and died in the Spanish reclamation are rolling so fast they're drilling to China. permalink parent award report block reply TEXinLA 13 points 2 days ago Cut off the free stuff and require everyone over 18 to work. They'll leave permalink award report block reply Beardholder 8 points 2 days ago And ban Islamic gatherings in public and mosques permalink parent award report block reply Waco419 11 points 2 days ago Can anybody explain why \"East Germany\" (which was largely absorbed by and politically unified with West Germany starting in 1990) is projected to be only 4% Muslim in 2050, while the western part of Germany is projected to be at 24%? permalink award report block reply mty_green_go 17 points 2 days ago because the map is fake and gay ? permalink parent award report block reply intamin -1 points 2 days ago Found this on reddit, surprisingly based comments: https://www.reddit.com/r/MapPorn/comments/10o5vxv/muslim_population_in_europe_in_2050_no_migration/ permalink parent award report block reply Chukna OP -5 points 2 days ago It's not fake. Fucking Muslim dick sucking faggot. permalink parent award report block reply TwoArizonaPedes 4 points 2 days ago Because this is Muslim propaganda bullshit. It comes from PSU Research Review: Prince Sultan University in Saudi Arabia. It's nonsense that ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within, destroyed by their own \"scholars.\" permalink parent award report block reply Chukna OP -5 points 2 days ago It's not Muslim propaganda, you're retarded Muslim dick sucking faggot. This is a real map showing the results of uncontrolled Muslim immigration. Europe has been suicidal and allowed too many Muslims to their countries. permalink parent award report block reply TwoArizonaPedes 4 points 2 days ago It's not Muslim propaganda, you're retarded Muslim dick sucking faggot. This is a real map showing the results of uncontrolled Muslim immigration. Europe has been suicidal and allowed too many Muslims to their countries. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -2 points 2 days ago It's not Saudi propaganda, this is not even propaganda but a warning of what happens when you have uncontrolled Muslim immigration too long. Europe has been suicidal and now Europe has also some of the world's worst rape rates in the world because of all these Muslim migrants. permalink parent award report block reply view 2 more comments... Iremembermypassword 9 points 2 days ago All done against the will of the voter. permalink award report block reply possibletower -6 points 2 days ago No. They voted for this. Europeans are socialists. The British Conservative Party is more left wing than Bernie Sanders and Nancy Pelosi 🤣. Socialists love virtue signaling like this. Stop simping for Europe just because some of their women, who are mostly leftist btw, are hot. permalink parent award report block reply Leporidae 11 points 2 days ago They voted for it the way we voted for Biden and keep voting for sending infinity money to israel. permalink parent award report block reply Jaunty_Haul 6 points 2 days ago rereconquista permalink award report block reply HeavenlyTrumpets 6 points 2 days ago Throw them the fuck out before it's too late. permalink award report block reply knnbccb 5 points 2 days ago Implement a Muslim tax, kill those who refuse to pay. That's how you deal with the problem. Pay. Leave. Die. Three choices. permalink award report block reply ahamrbond 5 points 2 days ago I fact checked a couple of these numbers and they are trash permalink award report block reply TwoArizonaPedes 5 points 2 days ago Yes. This is Muslim propaganda bullshit. It comes from PSU Research Review: Prince Sultan University in Saudi Arabia. It's nonsense that ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within, destroyed by their own \"scholars.\" permalink parent award report block reply Chukna OP -4 points 2 days ago No, it's not propaganda fucking retarded faggot. It's a result of uncontrolled Muslim immigration Europe has been allowing too long to happen. permalink parent award report block reply TwoArizonaPedes 4 points 2 days ago Stop being a muslim cock sucking retard. Europe has been suicidal and allowed too many Muslim pedophile rapists move to their countries and this is the result we will see in a couple of decades. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -4 points 2 days ago You're retarded pedophile Muslim loving faggot. You sound exactly like the liberals claiming that the number Muslims isn't so high in Europe. FUCK OFF RETARDED LIBTARD permalink parent award report block reply view 14 more comments... Chukna OP -4 points 2 days ago No, these numbers are not trash, you are a fucking muslim dick sucking faggot. Probably also a pedophile like all Muslims. permalink parent award report block reply TwoArizonaPedes 4 points 2 days ago Stop spreading Muslim propaganda. This is not MAGA. It's bullshit that comes from PSU Research Review: Prince Sultan University in Saudi Arabia. It's nonsense that ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within, destroyed by their own \"scholars.\" permalink award report block reply Chukna OP -4 points 2 days ago Stop being a muslim cock sucking retard. Europe has been suicidal and allowed too many Muslim pedophile rapists move to their countries and this is the result we will see in a couple of decades. permalink parent award report block reply TwoArizonaPedes 2 points 2 days ago Stop being a muslim cock sucking retard. Europe has been suicidal and allowed too many Muslim pedophile rapists move to their countries and this is the result we will see in a couple of decades. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -2 points 2 days ago Because it's not Saudi propaganda, it's right-wing warning of what the uncontrolled immigration will do to Europe. You are fucking retaded immigant loving pedophile faggot. permalink parent award report block reply TwoArizonaPedes 5 points 2 days ago Because it's not Saudi propaganda It comes from the \"PSU Research Review,\" which is published by Prince Sultan University in Saudi Arabia. Everyone would know that if you hadn't used an image with the source cut off the bottom. permalink parent award report block reply Smurfection 4 points 2 days ago The thing about current trends being projected out decades is current trends rarely persist.   However, the use of projecting current trends into the future is to motivated people now to prevent the current trend from continuing before it becomes reality. permalink award report block reply Lol_Garrus 3 points 2 days ago Berlin Wall about to make a comeback. permalink award report block reply fponick 3 points 2 days ago Ireland’s numbers are too low. permalink award report block reply XlDEN 1 points 2 days ago Most of those numbers are already too low, except in the Soviet bloc. permalink parent award report block reply TwoArizonaPedes 5 points 2 days ago The numbers are fantasy because this is Muslim propaganda bullshit from Saudi Arabia. It's nonsense that ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within, destroyed by their own \"scholars.\" permalink parent award report block reply Chukna OP -3 points 2 days ago You're retarded faggot. Does the Muslim dick taste that great? I bet you're also a pedophile like all muslims. This map shows the result of uncontrolled Muslim immigration that Europe has allowed too long to happen. permalink parent award report block reply TwoArizonaPedes 3 points 2 days ago It's not Muslim propaganda, you're retarded Muslim dick sucking faggot. This is a real map showing the results of uncontrolled Muslim immigration. Europe has been suicidal and allowed too many Muslims to their countries. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply view 1 more comments... Righteous 2 points 2 days ago OP really imploding in the comments. Bro just say it's a guess who fckn cares. permalink award report block reply MaybeKari 2 points 2 days ago He is having a bad day. permalink parent award report block reply Chukna OP 1 points 2 days ago Libtards commenting and calling this a conspiracy theory are fucking retards. Europeans are being replaced if we don't do anything. permalink parent award report block reply MrJinxy 2 points 2 days ago La cucarachas. permalink award report block reply Tacitus1963 2 points 2 days ago These are rookie numbers.\nThe Moz breed like rabbits.\nThere will be few white native Europeans left well before 2050. permalink award report block reply 2016TrumpMAGA 2 points 2 days ago Those numbers are way low.  Muslims breed like rats. permalink award report block reply Chukna OP 0 points 2 days ago True, birth rates of the white christian Europeans are plummeting while Muslims breed like rats. permalink parent award report block reply bitemeballs 2 points 2 days ago So much for the blue eyed blonds. permalink award report block reply Pepbrandt 2 points 2 days ago All of the AI bots, including Grok will tell you there's nothing to see here and you need to be more understanding of other cultures. permalink award report block reply FusionBlack 2 points 2 days ago I wont be around to see it but this part of the world will be next warfront. Don't be surprised if its the US and Russia against the Muslim Hord. That's if we haven't killed that relationship for good and they will sit back and watch. We are already being eaten from within by these savage Islamist. permalink award report block reply boomerbutnotOKBoomer 2 points 2 days ago https://www.express.co.uk/news/uk/597254/ISIS-Map-Europe-Terror-Organisation-Andrew-Hosken-Caliphate-Abu-Musab-al-Zarqawi Sent this to my libtard sister years ago when it came out. Can't get her to talk about it now that it's coming true. Failure to study History quote and all that... Just as with Bolsheviks... they are playing a long game and people are worried about food stamps or their manicure appointment... sheesh. Slow march towards totalitarianism and we're fighting over stupid shit. permalink award report block reply mediweevil 2 points 2 days ago I was hoping to go to Europe for a holiday when I retired but looks like I'm not going to get the chance now, it's gone. permalink award report block reply South_Florida_Guy 2 points 2 days ago RIP Sweden permalink award report block reply DelendaEstMarxismo 1 points 2 days ago Some of the hottest women on the planet, now communal fleshlights for savages. permalink parent award report block reply Saltish 2 points 2 days ago Thanks to their traitorous leaders who ushered in the raping hordes to prey on their citizens. permalink parent award report block reply HockeyMom4Trump 2 points 2 days ago Sweden is fucked. Sad. permalink award report block reply n3IVI0 2 points 2 days ago C'mon Poland. You can get that number down to 0. permalink award report block reply CJ74U2NV 2 points 2 days ago Sweden is more than enough to sway the vote in any and every election.  They're fukked. permalink award report block reply GoldwaterVoter 2 points 2 days ago Search forMark Steyn on this issue. Gotta run to work! permalink award report block reply tuaris 2 points 2 days ago I keep being told that islam isn't a race (and no it is not a race).  So is this map suppose to be a projection of how many people (regardless of melanin levels) will be muslim? Or is it trying to illustrate north african migrant populations? permalink award report block reply TwoArizonaPedes 3 points 2 days ago This comes from Prince Sultan University in Saudi Arabia. It ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within. It's just fantasy propaganda to encourage Muslims, nothing more. permalink parent award report block reply Chukna OP -1 points 2 days ago Europe is becoming Islamic caliphate in future if Europeans continue with the same suicidal immigration policies. permalink parent award report block reply TwoArizonaPedes 2 points 2 days ago Europe is becoming Islamic caliphate in future EFL much? permalink parent award report block reply Tellman125 1 points 2 days ago HUMAN ROACHES!!!!!!!! permalink award report block reply Johnkimble111 1 points 2 days ago Denmark is definitely fixing things to prevent their projected figure. I’d definitely bet on a lower number there. permalink award report block reply Stanwyk74 1 points 2 days ago I think it will be more than that. Nice knowing you sweden. Swedish burkini team here we come. permalink award report block reply AbrahamLincoln 1 points 2 days ago Germany and France can finally get along once all those pesky French and German people are gone.  Except still probably not, the goatfuckers will still find something to fight about. permalink award report block reply Pats5x 1 points 2 days ago former soviet bloc is the way to go permalink award report block reply ActNow 1 points 2 days ago Michael Malice would like a word with you. permalink parent award report block reply KarameloKamala 1 points 2 days ago I love being Polish permalink award report block reply lifeisahologram 1 points 2 days ago Imagine going back to 1950, and telling everyone that in 100 years because we sided with the communists in world war 2, that communism infiltrates every aspect of western society and government. Imagine all the shocked pikachu faces! permalink award report block reply AmericanJawa 1 points 2 days ago Imagine going back to 1950, and telling everyone that in 100 years because we sided with the communists in world war 2, that communism infiltrates every aspect of western society and government. You are aware that in 1950 the US was in the middle of the Cold War when they were already concerned about Communists infiltrating the US, right? permalink parent award report block reply lifeisahologram 2 points 2 days ago Cold War yes, but I disagree, I don’t think there was massive retrospective public thoughts on their decisions in WW2 like there is today. permalink parent award report block reply Seeker_17 1 points 2 days ago They're so fucked. permalink award report block reply TwoArizonaPedes 5 points 2 days ago No. This is just Muslim propaganda bullshit. It comes from PSU Research Review: Prince Sultan University in Saudi Arabia. It's nonsense that ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within, destroyed by their own \"scholars.\" permalink parent award report block reply Chukna OP -3 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. permalink parent award report block reply M4ster_Yoda 2 points 2 days ago Haha, it's ludacrious to think there won't be war before that. permalink parent award report block reply Chukna OP 1 points 2 days ago This is what too liberal immigration policies can cause. Europe is lost case if nothing happens near future. permalink award report block reply Big-E 1 points 2 days ago That is an old map. permalink award report block reply TwoArizonaPedes 4 points 2 days ago It's Muslim propaganda bullshit. It comes from PSU Research Review: Prince Sultan University in Saudi Arabia. It's nonsense that ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within, destroyed by their own \"scholars.\" permalink parent award report block reply Chukna OP -3 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. permalink parent award report block reply TwoArizonaPedes 2 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those aren't even real numbers. Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -1 points 2 days ago Immigrant loving faggot. I bet you love rape little girls like your Muslim friends, or are little boys more of your thing? Retarded  faggot. You sound exactly like all the libtards who claim that these warnings are nothing but anti-immigrant propaganda. permalink parent award report block reply view 1 more comments... AmericanJawa 1 points 2 days ago Why are East and West Germany divided in half on this map? permalink award report block reply TwoArizonaPedes 5 points 2 days ago Because this is Muslim propaganda bullshit. It comes from PSU Research Review: Prince Sultan University in Saudi Arabia. It's nonsense that ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within, destroyed by their own \"scholars.\" permalink parent award report block reply Chukna OP -3 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. permalink parent award report block reply TwoArizonaPedes 2 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those aren't even real numbers. They're fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -2 points 2 days ago Immigrant loving faggot. I bet you love rape little girls like your Muslim friends, or are little boys more of your thing? Retarded  faggot. You sound exactly like all the libtards who claim that these warnings are nothing but anti-immigrant propaganda. permalink parent award report block reply view 1 more comments... 5DchessWatch 1 points 2 days ago Yo yoyo Eastern bloc represent permalink award report block reply HazelHen 1 points 2 days ago Now do the US with whites. permalink award report block reply tt777 1 points 2 days ago I foresee lots of rapes in the future in Europe. permalink award report block reply Veritas264 1 points 2 days ago East Germany is back in 2050? permalink award report block reply TwoArizonaPedes 2 points 2 days ago It's Muslim propaganda bullshit. It comes from PSU Research Review: Prince Sultan University in Saudi Arabia. It's nonsense that ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within, destroyed by their own \"scholars.\" permalink parent award report block reply Chukna OP -2 points 2 days ago It's not pro-Islam propaganda, this is warning of the uncontrolled immigration of Europe that will result islamization of Europe if it's allowed to continue. permalink parent award report block reply TwoArizonaPedes 3 points 2 days ago It's not pro-Islam propaganda, this is warning of the uncontrolled immigration of Europe that will result islamization of Europe if it's allowed to continue. It's propaganda out of Saudi Arabia and you used an image with the attribution cut off the bottom so people couldn't see it for themselves. Why? Oh, right... permalink parent award report block reply Chukna OP -2 points 2 days ago You're retarded faggot. This map is warning of what happens if Europe continues being suicidal and allows uncontrolled Muslim immigration to their countries. permalink parent award report block reply Chukna OP -2 points 2 days ago Likely. They're politically very different from West Germany, more conservative. They probably will like to break away from Germany if Germany continues its suicidal politics. permalink parent award report block reply captflerbus 1 points 2 days ago time to re form the warsaw pact against the caliphate of western europe deus vult permalink award report block reply Easzq8 1 points 2 days ago Blachkum acchhh snakbar kaboom! permalink award report block reply PhantomShield72 1 points 2 days ago They cannot be allowed to go Muslim AND keep nuclear weapons... permalink award report block reply TwoArizonaPedes 2 points 2 days ago Pakistan already does. permalink parent award report block reply PhantomShield72 1 points 2 days ago Yes. Why would we want more? permalink parent award report block reply RocksCanOnlyWait 1 points 2 days ago It's funny that Spain, which was ruled by Muslim caliphates for centuries, is significantly less Muslim than other countries in Europe. permalink award report block reply deleted 1 points 2 days ago TwoArizonaPedes 4 points 2 days ago They're nonsense numbers because this is Muslim propaganda bullshit. It comes from PSU Research Review: Prince Sultan University in Saudi Arabia. It  ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within, destroyed by their own \"scholars.\" permalink parent award report block reply Chukna OP 0 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. permalink parent award report block reply TwoArizonaPedes 2 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those aren't even real numbers. Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -2 points 2 days ago Immigrant loving faggot. I bet you love rape little girls like your Muslim friends, or are little boys more of your thing? Retarded  faggot. You sound exactly like all the libtards who claim that these warnings are nothing but anti-immigrant propaganda. permalink parent award report block reply view 1 more comments... Chukna OP -3 points 2 days ago Probably, the immigration rates are only rising. permalink parent award report block reply TenchuStealthAss 1 points 2 days ago Those luxembourg numbers aren't possible. permalink award report block reply IAmDisappoint -1 points 2 days ago Invasion going as planned. But eurofags deserve this, this is what they voted for. permalink award report block reply Rock9Head -1 points 2 days ago A nuclear war would be an improvement. permalink award report block reply 5DchessWatch -1 points 2 days ago Germany is skewed in a way because they've been importing Turks (turkey) for 150 yrs.  Its where the nazi black sun brigade, thule society et al got their occultic sufi alchemy gnosto-shit.  Turkish kind of don't count because they're not necessarily the \"bad ones\" (sharia)  because turkey is secular and don't recognize sharia law. permalink award report block reply DeltaSierra -2 points 2 days ago I don’t blame them for going to Sweden to get the blonde chicks.  I don’t get the hate.  These are smart brothers. permalink award report block reply MythArcana -2 points 2 days ago Conquered. permalink award report block reply mikethemarine -2 points 2 days ago A stanch thing is , it only takes 10% of the population that is willing to fight to overthrow a country, those above 10% have already lost permalink award report block reply DeltaSierra -3 points 2 days ago You are looking at this wrong.  Those brothers are conservatives and they are taking countries already lost to the left.  Why not just sit back and enjoy? permalink parent award report block reply mikethemarine 5 points 2 days ago it will spread. permalink parent award report block reply ActNow 4 points 2 days ago Too many people don't seem to understand this. permalink parent award report block reply MaybeKari 4 points 2 days ago Those brothers are conservatives They're not our brothers. They might be your brother -- if you're also Muslim. permalink parent award report block reply possibletower -6 points 2 days ago I remember when faggots here fapped to Sweden the past 5 years because \"muh based Sweden leads the resistance against the muh poison shots\" 🤣 Cognitive dissonance prime example right there. Who the fuck cares about Sweden and poison shots when they are the kings of cucking out to Islam? permalink award report block reply ParadigmShift2070 2 points 2 days ago the resistance against shots were probably mostly from the browns, Sweden not wanting to be called racist stopped the enforcements permalink parent award report block reply\nMungo 62 points 2 days ago Um…..why is there East and West Germany?   Pretty sure Reagan took care of that. permalink award report block reply Svaap 28 points 2 days ago Huh, you're right!  I'm old enough where I didn't actually have that sink in at first, but WTH is that!?  LOL permalink parent award report block reply Aoikaze2000 16 points 2 days ago Yeah, I was seeing if this wasn't an old projection, but saw no USSR, Yugoslavia, nor Czechoslavakia so I'm not sure what this is tbh. permalink parent award report block reply TwoArizonaPedes 6 points 2 days ago It's Muslim propaganda bullshit from Prince Sultan University in Saudi Arabia. Why is it posted here? permalink parent award report block reply Aoikaze2000 4 points 2 days ago Maybe so, but it means we gotta push harder against the death cult... or we're gonna completely lose our European heritage. permalink parent award report block reply view 1 more comments... Chukna OP -2 points 2 days ago What propaganda? This is warning of islamization of Europe through uncontrolled immigration. permalink parent award report block reply view 4 more comments... KarameloKamala 1 points 2 days ago East Germany is far more politically right.  Im guessing its some sort of interpretation based on political leaning, so they made it a separate state. permalink parent award report block reply Svaap 1 points 1 day ago That makes no sense though.  Germany is a unified country since 1989, that's the first time I've seen East/West on a map since high school! permalink parent award report block reply South_Florida_Guy 14 points 2 days ago They might be better off going back to that permalink parent award report block reply ActNow 5 points 2 days ago Wonder if the guards would be shooting people escaping to East Germany this time. permalink parent award report block reply DeportThemAllForever -3 points 2 days ago Pretty soon guards would be escaping Germany. permalink parent award report block reply 3percenterFan 9 points 2 days ago I suspect that the Muslim population gravitates more to the West, which is softer, weaker, more liberal, easier to exploit. permalink parent award report block reply Wexit-Delecto -3 points 2 days ago There could be another reason. Invaders from without need gate openers from within: https://en.wikipedia.org/wiki/Jewish_population_by_country permalink parent award report block reply Nitrenes 8 points 2 days ago I like the distinction, they are still somewhat culturally different, and East Germans are more wary of foreigners. As far as I could tell the older the person the greater the difference. permalink parent award report block reply Johnkimble111 4 points 2 days ago They don’t care for Commies and Muslims in East Germany and so refuse to suffer again permalink parent award report block reply load 15 more comments...\nSvaap 28 points 2 days ago Huh, you're right!  I'm old enough where I didn't actually have that sink in at first, but WTH is that!?  LOL permalink parent award report block reply Aoikaze2000 16 points 2 days ago Yeah, I was seeing if this wasn't an old projection, but saw no USSR, Yugoslavia, nor Czechoslavakia so I'm not sure what this is tbh. permalink parent award report block reply TwoArizonaPedes 6 points 2 days ago It's Muslim propaganda bullshit from Prince Sultan University in Saudi Arabia. Why is it posted here? permalink parent award report block reply Aoikaze2000 4 points 2 days ago Maybe so, but it means we gotta push harder against the death cult... or we're gonna completely lose our European heritage. permalink parent award report block reply view 1 more comments... Chukna OP -2 points 2 days ago What propaganda? This is warning of islamization of Europe through uncontrolled immigration. permalink parent award report block reply view 4 more comments... KarameloKamala 1 points 2 days ago East Germany is far more politically right.  Im guessing its some sort of interpretation based on political leaning, so they made it a separate state. permalink parent award report block reply Svaap 1 points 1 day ago That makes no sense though.  Germany is a unified country since 1989, that's the first time I've seen East/West on a map since high school! permalink parent award report block reply\nAoikaze2000 16 points 2 days ago Yeah, I was seeing if this wasn't an old projection, but saw no USSR, Yugoslavia, nor Czechoslavakia so I'm not sure what this is tbh. permalink parent award report block reply TwoArizonaPedes 6 points 2 days ago It's Muslim propaganda bullshit from Prince Sultan University in Saudi Arabia. Why is it posted here? permalink parent award report block reply Aoikaze2000 4 points 2 days ago Maybe so, but it means we gotta push harder against the death cult... or we're gonna completely lose our European heritage. permalink parent award report block reply view 1 more comments... Chukna OP -2 points 2 days ago What propaganda? This is warning of islamization of Europe through uncontrolled immigration. permalink parent award report block reply view 4 more comments...\nTwoArizonaPedes 6 points 2 days ago It's Muslim propaganda bullshit from Prince Sultan University in Saudi Arabia. Why is it posted here? permalink parent award report block reply Aoikaze2000 4 points 2 days ago Maybe so, but it means we gotta push harder against the death cult... or we're gonna completely lose our European heritage. permalink parent award report block reply view 1 more comments... Chukna OP -2 points 2 days ago What propaganda? This is warning of islamization of Europe through uncontrolled immigration. permalink parent award report block reply view 4 more comments...\nAoikaze2000 4 points 2 days ago Maybe so, but it means we gotta push harder against the death cult... or we're gonna completely lose our European heritage. permalink parent award report block reply view 1 more comments...\nChukna OP -2 points 2 days ago What propaganda? This is warning of islamization of Europe through uncontrolled immigration. permalink parent award report block reply view 4 more comments...\nKarameloKamala 1 points 2 days ago East Germany is far more politically right.  Im guessing its some sort of interpretation based on political leaning, so they made it a separate state. permalink parent award report block reply Svaap 1 points 1 day ago That makes no sense though.  Germany is a unified country since 1989, that's the first time I've seen East/West on a map since high school! permalink parent award report block reply\nSvaap 1 points 1 day ago That makes no sense though.  Germany is a unified country since 1989, that's the first time I've seen East/West on a map since high school! permalink parent award report block reply\nSouth_Florida_Guy 14 points 2 days ago They might be better off going back to that permalink parent award report block reply ActNow 5 points 2 days ago Wonder if the guards would be shooting people escaping to East Germany this time. permalink parent award report block reply DeportThemAllForever -3 points 2 days ago Pretty soon guards would be escaping Germany. permalink parent award report block reply\nActNow 5 points 2 days ago Wonder if the guards would be shooting people escaping to East Germany this time. permalink parent award report block reply DeportThemAllForever -3 points 2 days ago Pretty soon guards would be escaping Germany. permalink parent award report block reply\nDeportThemAllForever -3 points 2 days ago Pretty soon guards would be escaping Germany. permalink parent award report block reply\n3percenterFan 9 points 2 days ago I suspect that the Muslim population gravitates more to the West, which is softer, weaker, more liberal, easier to exploit. permalink parent award report block reply Wexit-Delecto -3 points 2 days ago There could be another reason. Invaders from without need gate openers from within: https://en.wikipedia.org/wiki/Jewish_population_by_country permalink parent award report block reply\nWexit-Delecto -3 points 2 days ago There could be another reason. Invaders from without need gate openers from within: https://en.wikipedia.org/wiki/Jewish_population_by_country permalink parent award report block reply\nNitrenes 8 points 2 days ago I like the distinction, they are still somewhat culturally different, and East Germans are more wary of foreigners. As far as I could tell the older the person the greater the difference. permalink parent award report block reply\nJohnkimble111 4 points 2 days ago They don’t care for Commies and Muslims in East Germany and so refuse to suffer again permalink parent award report block reply\nShih_Tabed 25 points 2 days ago Poland.  I believe they shoot to kill with live ammo at the border.  Looks like that plan is working out. permalink award report block reply\nbillybaldwin2 16 points 2 days ago Spain did let in a lot for a few hundred years, before they wiped them out of the country. Then, they solidified what Spain is. Portugal too. permalink award report block reply ParadigmShift2070 5 points 2 days ago who opened the gates of Toledo permalink parent award report block reply Taqiyya_Mockingbird 3 points 2 days ago Maybe Barbara Lerner Spectre can explain it permalink parent award report block reply mty_green_go 1 points 2 days ago Then Spain had giant \"REFUGEES WELCOME\" banners all of their capital a few years ago. https://www.shutterstock.com/search/madrid-refugees-welcome permalink parent award report block reply NomadicKrow2 8 points 2 days ago The guys who fought and died in the Spanish reclamation are rolling so fast they're drilling to China. permalink parent award report block reply\nParadigmShift2070 5 points 2 days ago who opened the gates of Toledo permalink parent award report block reply Taqiyya_Mockingbird 3 points 2 days ago Maybe Barbara Lerner Spectre can explain it permalink parent award report block reply\nTaqiyya_Mockingbird 3 points 2 days ago Maybe Barbara Lerner Spectre can explain it permalink parent award report block reply\nmty_green_go 1 points 2 days ago Then Spain had giant \"REFUGEES WELCOME\" banners all of their capital a few years ago. https://www.shutterstock.com/search/madrid-refugees-welcome permalink parent award report block reply NomadicKrow2 8 points 2 days ago The guys who fought and died in the Spanish reclamation are rolling so fast they're drilling to China. permalink parent award report block reply\nNomadicKrow2 8 points 2 days ago The guys who fought and died in the Spanish reclamation are rolling so fast they're drilling to China. permalink parent award report block reply\nTEXinLA 13 points 2 days ago Cut off the free stuff and require everyone over 18 to work. They'll leave permalink award report block reply Beardholder 8 points 2 days ago And ban Islamic gatherings in public and mosques permalink parent award report block reply\nBeardholder 8 points 2 days ago And ban Islamic gatherings in public and mosques permalink parent award report block reply\nWaco419 11 points 2 days ago Can anybody explain why \"East Germany\" (which was largely absorbed by and politically unified with West Germany starting in 1990) is projected to be only 4% Muslim in 2050, while the western part of Germany is projected to be at 24%? permalink award report block reply mty_green_go 17 points 2 days ago because the map is fake and gay ? permalink parent award report block reply intamin -1 points 2 days ago Found this on reddit, surprisingly based comments: https://www.reddit.com/r/MapPorn/comments/10o5vxv/muslim_population_in_europe_in_2050_no_migration/ permalink parent award report block reply Chukna OP -5 points 2 days ago It's not fake. Fucking Muslim dick sucking faggot. permalink parent award report block reply TwoArizonaPedes 4 points 2 days ago Because this is Muslim propaganda bullshit. It comes from PSU Research Review: Prince Sultan University in Saudi Arabia. It's nonsense that ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within, destroyed by their own \"scholars.\" permalink parent award report block reply Chukna OP -5 points 2 days ago It's not Muslim propaganda, you're retarded Muslim dick sucking faggot. This is a real map showing the results of uncontrolled Muslim immigration. Europe has been suicidal and allowed too many Muslims to their countries. permalink parent award report block reply TwoArizonaPedes 4 points 2 days ago It's not Muslim propaganda, you're retarded Muslim dick sucking faggot. This is a real map showing the results of uncontrolled Muslim immigration. Europe has been suicidal and allowed too many Muslims to their countries. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -2 points 2 days ago It's not Saudi propaganda, this is not even propaganda but a warning of what happens when you have uncontrolled Muslim immigration too long. Europe has been suicidal and now Europe has also some of the world's worst rape rates in the world because of all these Muslim migrants. permalink parent award report block reply view 2 more comments...\nmty_green_go 17 points 2 days ago because the map is fake and gay ? permalink parent award report block reply intamin -1 points 2 days ago Found this on reddit, surprisingly based comments: https://www.reddit.com/r/MapPorn/comments/10o5vxv/muslim_population_in_europe_in_2050_no_migration/ permalink parent award report block reply Chukna OP -5 points 2 days ago It's not fake. Fucking Muslim dick sucking faggot. permalink parent award report block reply\nintamin -1 points 2 days ago Found this on reddit, surprisingly based comments: https://www.reddit.com/r/MapPorn/comments/10o5vxv/muslim_population_in_europe_in_2050_no_migration/ permalink parent award report block reply\nChukna OP -5 points 2 days ago It's not fake. Fucking Muslim dick sucking faggot. permalink parent award report block reply\nTwoArizonaPedes 4 points 2 days ago Because this is Muslim propaganda bullshit. It comes from PSU Research Review: Prince Sultan University in Saudi Arabia. It's nonsense that ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within, destroyed by their own \"scholars.\" permalink parent award report block reply Chukna OP -5 points 2 days ago It's not Muslim propaganda, you're retarded Muslim dick sucking faggot. This is a real map showing the results of uncontrolled Muslim immigration. Europe has been suicidal and allowed too many Muslims to their countries. permalink parent award report block reply TwoArizonaPedes 4 points 2 days ago It's not Muslim propaganda, you're retarded Muslim dick sucking faggot. This is a real map showing the results of uncontrolled Muslim immigration. Europe has been suicidal and allowed too many Muslims to their countries. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -2 points 2 days ago It's not Saudi propaganda, this is not even propaganda but a warning of what happens when you have uncontrolled Muslim immigration too long. Europe has been suicidal and now Europe has also some of the world's worst rape rates in the world because of all these Muslim migrants. permalink parent award report block reply view 2 more comments...\nChukna OP -5 points 2 days ago It's not Muslim propaganda, you're retarded Muslim dick sucking faggot. This is a real map showing the results of uncontrolled Muslim immigration. Europe has been suicidal and allowed too many Muslims to their countries. permalink parent award report block reply TwoArizonaPedes 4 points 2 days ago It's not Muslim propaganda, you're retarded Muslim dick sucking faggot. This is a real map showing the results of uncontrolled Muslim immigration. Europe has been suicidal and allowed too many Muslims to their countries. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -2 points 2 days ago It's not Saudi propaganda, this is not even propaganda but a warning of what happens when you have uncontrolled Muslim immigration too long. Europe has been suicidal and now Europe has also some of the world's worst rape rates in the world because of all these Muslim migrants. permalink parent award report block reply view 2 more comments...\nTwoArizonaPedes 4 points 2 days ago It's not Muslim propaganda, you're retarded Muslim dick sucking faggot. This is a real map showing the results of uncontrolled Muslim immigration. Europe has been suicidal and allowed too many Muslims to their countries. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -2 points 2 days ago It's not Saudi propaganda, this is not even propaganda but a warning of what happens when you have uncontrolled Muslim immigration too long. Europe has been suicidal and now Europe has also some of the world's worst rape rates in the world because of all these Muslim migrants. permalink parent award report block reply view 2 more comments...\nChukna OP -2 points 2 days ago It's not Saudi propaganda, this is not even propaganda but a warning of what happens when you have uncontrolled Muslim immigration too long. Europe has been suicidal and now Europe has also some of the world's worst rape rates in the world because of all these Muslim migrants. permalink parent award report block reply view 2 more comments...\nIremembermypassword 9 points 2 days ago All done against the will of the voter. permalink award report block reply possibletower -6 points 2 days ago No. They voted for this. Europeans are socialists. The British Conservative Party is more left wing than Bernie Sanders and Nancy Pelosi 🤣. Socialists love virtue signaling like this. Stop simping for Europe just because some of their women, who are mostly leftist btw, are hot. permalink parent award report block reply Leporidae 11 points 2 days ago They voted for it the way we voted for Biden and keep voting for sending infinity money to israel. permalink parent award report block reply\npossibletower -6 points 2 days ago No. They voted for this. Europeans are socialists. The British Conservative Party is more left wing than Bernie Sanders and Nancy Pelosi 🤣. Socialists love virtue signaling like this. Stop simping for Europe just because some of their women, who are mostly leftist btw, are hot. permalink parent award report block reply Leporidae 11 points 2 days ago They voted for it the way we voted for Biden and keep voting for sending infinity money to israel. permalink parent award report block reply\nLeporidae 11 points 2 days ago They voted for it the way we voted for Biden and keep voting for sending infinity money to israel. permalink parent award report block reply\nJaunty_Haul 6 points 2 days ago rereconquista permalink award report block reply\nHeavenlyTrumpets 6 points 2 days ago Throw them the fuck out before it's too late. permalink award report block reply\nknnbccb 5 points 2 days ago Implement a Muslim tax, kill those who refuse to pay. That's how you deal with the problem. Pay. Leave. Die. Three choices. permalink award report block reply\nahamrbond 5 points 2 days ago I fact checked a couple of these numbers and they are trash permalink award report block reply TwoArizonaPedes 5 points 2 days ago Yes. This is Muslim propaganda bullshit. It comes from PSU Research Review: Prince Sultan University in Saudi Arabia. It's nonsense that ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within, destroyed by their own \"scholars.\" permalink parent award report block reply Chukna OP -4 points 2 days ago No, it's not propaganda fucking retarded faggot. It's a result of uncontrolled Muslim immigration Europe has been allowing too long to happen. permalink parent award report block reply TwoArizonaPedes 4 points 2 days ago Stop being a muslim cock sucking retard. Europe has been suicidal and allowed too many Muslim pedophile rapists move to their countries and this is the result we will see in a couple of decades. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -4 points 2 days ago You're retarded pedophile Muslim loving faggot. You sound exactly like the liberals claiming that the number Muslims isn't so high in Europe. FUCK OFF RETARDED LIBTARD permalink parent award report block reply view 14 more comments... Chukna OP -4 points 2 days ago No, these numbers are not trash, you are a fucking muslim dick sucking faggot. Probably also a pedophile like all Muslims. permalink parent award report block reply\nTwoArizonaPedes 5 points 2 days ago Yes. This is Muslim propaganda bullshit. It comes from PSU Research Review: Prince Sultan University in Saudi Arabia. It's nonsense that ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within, destroyed by their own \"scholars.\" permalink parent award report block reply Chukna OP -4 points 2 days ago No, it's not propaganda fucking retarded faggot. It's a result of uncontrolled Muslim immigration Europe has been allowing too long to happen. permalink parent award report block reply TwoArizonaPedes 4 points 2 days ago Stop being a muslim cock sucking retard. Europe has been suicidal and allowed too many Muslim pedophile rapists move to their countries and this is the result we will see in a couple of decades. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -4 points 2 days ago You're retarded pedophile Muslim loving faggot. You sound exactly like the liberals claiming that the number Muslims isn't so high in Europe. FUCK OFF RETARDED LIBTARD permalink parent award report block reply view 14 more comments...\nChukna OP -4 points 2 days ago No, it's not propaganda fucking retarded faggot. It's a result of uncontrolled Muslim immigration Europe has been allowing too long to happen. permalink parent award report block reply TwoArizonaPedes 4 points 2 days ago Stop being a muslim cock sucking retard. Europe has been suicidal and allowed too many Muslim pedophile rapists move to their countries and this is the result we will see in a couple of decades. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -4 points 2 days ago You're retarded pedophile Muslim loving faggot. You sound exactly like the liberals claiming that the number Muslims isn't so high in Europe. FUCK OFF RETARDED LIBTARD permalink parent award report block reply view 14 more comments...\nTwoArizonaPedes 4 points 2 days ago Stop being a muslim cock sucking retard. Europe has been suicidal and allowed too many Muslim pedophile rapists move to their countries and this is the result we will see in a couple of decades. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -4 points 2 days ago You're retarded pedophile Muslim loving faggot. You sound exactly like the liberals claiming that the number Muslims isn't so high in Europe. FUCK OFF RETARDED LIBTARD permalink parent award report block reply view 14 more comments...\nChukna OP -4 points 2 days ago You're retarded pedophile Muslim loving faggot. You sound exactly like the liberals claiming that the number Muslims isn't so high in Europe. FUCK OFF RETARDED LIBTARD permalink parent award report block reply view 14 more comments...\nChukna OP -4 points 2 days ago No, these numbers are not trash, you are a fucking muslim dick sucking faggot. Probably also a pedophile like all Muslims. permalink parent award report block reply\nTwoArizonaPedes 4 points 2 days ago Stop spreading Muslim propaganda. This is not MAGA. It's bullshit that comes from PSU Research Review: Prince Sultan University in Saudi Arabia. It's nonsense that ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within, destroyed by their own \"scholars.\" permalink award report block reply Chukna OP -4 points 2 days ago Stop being a muslim cock sucking retard. Europe has been suicidal and allowed too many Muslim pedophile rapists move to their countries and this is the result we will see in a couple of decades. permalink parent award report block reply TwoArizonaPedes 2 points 2 days ago Stop being a muslim cock sucking retard. Europe has been suicidal and allowed too many Muslim pedophile rapists move to their countries and this is the result we will see in a couple of decades. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -2 points 2 days ago Because it's not Saudi propaganda, it's right-wing warning of what the uncontrolled immigration will do to Europe. You are fucking retaded immigant loving pedophile faggot. permalink parent award report block reply TwoArizonaPedes 5 points 2 days ago Because it's not Saudi propaganda It comes from the \"PSU Research Review,\" which is published by Prince Sultan University in Saudi Arabia. Everyone would know that if you hadn't used an image with the source cut off the bottom. permalink parent award report block reply\nChukna OP -4 points 2 days ago Stop being a muslim cock sucking retard. Europe has been suicidal and allowed too many Muslim pedophile rapists move to their countries and this is the result we will see in a couple of decades. permalink parent award report block reply TwoArizonaPedes 2 points 2 days ago Stop being a muslim cock sucking retard. Europe has been suicidal and allowed too many Muslim pedophile rapists move to their countries and this is the result we will see in a couple of decades. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -2 points 2 days ago Because it's not Saudi propaganda, it's right-wing warning of what the uncontrolled immigration will do to Europe. You are fucking retaded immigant loving pedophile faggot. permalink parent award report block reply TwoArizonaPedes 5 points 2 days ago Because it's not Saudi propaganda It comes from the \"PSU Research Review,\" which is published by Prince Sultan University in Saudi Arabia. Everyone would know that if you hadn't used an image with the source cut off the bottom. permalink parent award report block reply\nTwoArizonaPedes 2 points 2 days ago Stop being a muslim cock sucking retard. Europe has been suicidal and allowed too many Muslim pedophile rapists move to their countries and this is the result we will see in a couple of decades. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -2 points 2 days ago Because it's not Saudi propaganda, it's right-wing warning of what the uncontrolled immigration will do to Europe. You are fucking retaded immigant loving pedophile faggot. permalink parent award report block reply TwoArizonaPedes 5 points 2 days ago Because it's not Saudi propaganda It comes from the \"PSU Research Review,\" which is published by Prince Sultan University in Saudi Arabia. Everyone would know that if you hadn't used an image with the source cut off the bottom. permalink parent award report block reply\nChukna OP -2 points 2 days ago Because it's not Saudi propaganda, it's right-wing warning of what the uncontrolled immigration will do to Europe. You are fucking retaded immigant loving pedophile faggot. permalink parent award report block reply TwoArizonaPedes 5 points 2 days ago Because it's not Saudi propaganda It comes from the \"PSU Research Review,\" which is published by Prince Sultan University in Saudi Arabia. Everyone would know that if you hadn't used an image with the source cut off the bottom. permalink parent award report block reply\nTwoArizonaPedes 5 points 2 days ago Because it's not Saudi propaganda It comes from the \"PSU Research Review,\" which is published by Prince Sultan University in Saudi Arabia. Everyone would know that if you hadn't used an image with the source cut off the bottom. permalink parent award report block reply\nSmurfection 4 points 2 days ago The thing about current trends being projected out decades is current trends rarely persist.   However, the use of projecting current trends into the future is to motivated people now to prevent the current trend from continuing before it becomes reality. permalink award report block reply\nLol_Garrus 3 points 2 days ago Berlin Wall about to make a comeback. permalink award report block reply\nfponick 3 points 2 days ago Ireland’s numbers are too low. permalink award report block reply XlDEN 1 points 2 days ago Most of those numbers are already too low, except in the Soviet bloc. permalink parent award report block reply TwoArizonaPedes 5 points 2 days ago The numbers are fantasy because this is Muslim propaganda bullshit from Saudi Arabia. It's nonsense that ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within, destroyed by their own \"scholars.\" permalink parent award report block reply Chukna OP -3 points 2 days ago You're retarded faggot. Does the Muslim dick taste that great? I bet you're also a pedophile like all muslims. This map shows the result of uncontrolled Muslim immigration that Europe has allowed too long to happen. permalink parent award report block reply TwoArizonaPedes 3 points 2 days ago It's not Muslim propaganda, you're retarded Muslim dick sucking faggot. This is a real map showing the results of uncontrolled Muslim immigration. Europe has been suicidal and allowed too many Muslims to their countries. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply view 1 more comments...\nXlDEN 1 points 2 days ago Most of those numbers are already too low, except in the Soviet bloc. permalink parent award report block reply TwoArizonaPedes 5 points 2 days ago The numbers are fantasy because this is Muslim propaganda bullshit from Saudi Arabia. It's nonsense that ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within, destroyed by their own \"scholars.\" permalink parent award report block reply Chukna OP -3 points 2 days ago You're retarded faggot. Does the Muslim dick taste that great? I bet you're also a pedophile like all muslims. This map shows the result of uncontrolled Muslim immigration that Europe has allowed too long to happen. permalink parent award report block reply TwoArizonaPedes 3 points 2 days ago It's not Muslim propaganda, you're retarded Muslim dick sucking faggot. This is a real map showing the results of uncontrolled Muslim immigration. Europe has been suicidal and allowed too many Muslims to their countries. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply view 1 more comments...\nTwoArizonaPedes 5 points 2 days ago The numbers are fantasy because this is Muslim propaganda bullshit from Saudi Arabia. It's nonsense that ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within, destroyed by their own \"scholars.\" permalink parent award report block reply Chukna OP -3 points 2 days ago You're retarded faggot. Does the Muslim dick taste that great? I bet you're also a pedophile like all muslims. This map shows the result of uncontrolled Muslim immigration that Europe has allowed too long to happen. permalink parent award report block reply TwoArizonaPedes 3 points 2 days ago It's not Muslim propaganda, you're retarded Muslim dick sucking faggot. This is a real map showing the results of uncontrolled Muslim immigration. Europe has been suicidal and allowed too many Muslims to their countries. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply view 1 more comments...\nChukna OP -3 points 2 days ago You're retarded faggot. Does the Muslim dick taste that great? I bet you're also a pedophile like all muslims. This map shows the result of uncontrolled Muslim immigration that Europe has allowed too long to happen. permalink parent award report block reply TwoArizonaPedes 3 points 2 days ago It's not Muslim propaganda, you're retarded Muslim dick sucking faggot. This is a real map showing the results of uncontrolled Muslim immigration. Europe has been suicidal and allowed too many Muslims to their countries. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply view 1 more comments...\nTwoArizonaPedes 3 points 2 days ago It's not Muslim propaganda, you're retarded Muslim dick sucking faggot. This is a real map showing the results of uncontrolled Muslim immigration. Europe has been suicidal and allowed too many Muslims to their countries. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply view 1 more comments...\nRighteous 2 points 2 days ago OP really imploding in the comments. Bro just say it's a guess who fckn cares. permalink award report block reply MaybeKari 2 points 2 days ago He is having a bad day. permalink parent award report block reply Chukna OP 1 points 2 days ago Libtards commenting and calling this a conspiracy theory are fucking retards. Europeans are being replaced if we don't do anything. permalink parent award report block reply\nMaybeKari 2 points 2 days ago He is having a bad day. permalink parent award report block reply\nChukna OP 1 points 2 days ago Libtards commenting and calling this a conspiracy theory are fucking retards. Europeans are being replaced if we don't do anything. permalink parent award report block reply\nMrJinxy 2 points 2 days ago La cucarachas. permalink award report block reply\nTacitus1963 2 points 2 days ago These are rookie numbers.\nThe Moz breed like rabbits.\nThere will be few white native Europeans left well before 2050. permalink award report block reply\n2016TrumpMAGA 2 points 2 days ago Those numbers are way low.  Muslims breed like rats. permalink award report block reply Chukna OP 0 points 2 days ago True, birth rates of the white christian Europeans are plummeting while Muslims breed like rats. permalink parent award report block reply\nChukna OP 0 points 2 days ago True, birth rates of the white christian Europeans are plummeting while Muslims breed like rats. permalink parent award report block reply\nbitemeballs 2 points 2 days ago So much for the blue eyed blonds. permalink award report block reply\nPepbrandt 2 points 2 days ago All of the AI bots, including Grok will tell you there's nothing to see here and you need to be more understanding of other cultures. permalink award report block reply\nFusionBlack 2 points 2 days ago I wont be around to see it but this part of the world will be next warfront. Don't be surprised if its the US and Russia against the Muslim Hord. That's if we haven't killed that relationship for good and they will sit back and watch. We are already being eaten from within by these savage Islamist. permalink award report block reply\nboomerbutnotOKBoomer 2 points 2 days ago https://www.express.co.uk/news/uk/597254/ISIS-Map-Europe-Terror-Organisation-Andrew-Hosken-Caliphate-Abu-Musab-al-Zarqawi Sent this to my libtard sister years ago when it came out. Can't get her to talk about it now that it's coming true. Failure to study History quote and all that... Just as with Bolsheviks... they are playing a long game and people are worried about food stamps or their manicure appointment... sheesh. Slow march towards totalitarianism and we're fighting over stupid shit. permalink award report block reply\nmediweevil 2 points 2 days ago I was hoping to go to Europe for a holiday when I retired but looks like I'm not going to get the chance now, it's gone. permalink award report block reply\nSouth_Florida_Guy 2 points 2 days ago RIP Sweden permalink award report block reply DelendaEstMarxismo 1 points 2 days ago Some of the hottest women on the planet, now communal fleshlights for savages. permalink parent award report block reply Saltish 2 points 2 days ago Thanks to their traitorous leaders who ushered in the raping hordes to prey on their citizens. permalink parent award report block reply\nDelendaEstMarxismo 1 points 2 days ago Some of the hottest women on the planet, now communal fleshlights for savages. permalink parent award report block reply Saltish 2 points 2 days ago Thanks to their traitorous leaders who ushered in the raping hordes to prey on their citizens. permalink parent award report block reply\nSaltish 2 points 2 days ago Thanks to their traitorous leaders who ushered in the raping hordes to prey on their citizens. permalink parent award report block reply\nHockeyMom4Trump 2 points 2 days ago Sweden is fucked. Sad. permalink award report block reply\nn3IVI0 2 points 2 days ago C'mon Poland. You can get that number down to 0. permalink award report block reply\nCJ74U2NV 2 points 2 days ago Sweden is more than enough to sway the vote in any and every election.  They're fukked. permalink award report block reply\nGoldwaterVoter 2 points 2 days ago Search forMark Steyn on this issue. Gotta run to work! permalink award report block reply\ntuaris 2 points 2 days ago I keep being told that islam isn't a race (and no it is not a race).  So is this map suppose to be a projection of how many people (regardless of melanin levels) will be muslim? Or is it trying to illustrate north african migrant populations? permalink award report block reply TwoArizonaPedes 3 points 2 days ago This comes from Prince Sultan University in Saudi Arabia. It ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within. It's just fantasy propaganda to encourage Muslims, nothing more. permalink parent award report block reply Chukna OP -1 points 2 days ago Europe is becoming Islamic caliphate in future if Europeans continue with the same suicidal immigration policies. permalink parent award report block reply TwoArizonaPedes 2 points 2 days ago Europe is becoming Islamic caliphate in future EFL much? permalink parent award report block reply\nTwoArizonaPedes 3 points 2 days ago This comes from Prince Sultan University in Saudi Arabia. It ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within. It's just fantasy propaganda to encourage Muslims, nothing more. permalink parent award report block reply Chukna OP -1 points 2 days ago Europe is becoming Islamic caliphate in future if Europeans continue with the same suicidal immigration policies. permalink parent award report block reply TwoArizonaPedes 2 points 2 days ago Europe is becoming Islamic caliphate in future EFL much? permalink parent award report block reply\nChukna OP -1 points 2 days ago Europe is becoming Islamic caliphate in future if Europeans continue with the same suicidal immigration policies. permalink parent award report block reply TwoArizonaPedes 2 points 2 days ago Europe is becoming Islamic caliphate in future EFL much? permalink parent award report block reply\nTwoArizonaPedes 2 points 2 days ago Europe is becoming Islamic caliphate in future EFL much? permalink parent award report block reply\nTellman125 1 points 2 days ago HUMAN ROACHES!!!!!!!! permalink award report block reply\nJohnkimble111 1 points 2 days ago Denmark is definitely fixing things to prevent their projected figure. I’d definitely bet on a lower number there. permalink award report block reply\nStanwyk74 1 points 2 days ago I think it will be more than that. Nice knowing you sweden. Swedish burkini team here we come. permalink award report block reply\nAbrahamLincoln 1 points 2 days ago Germany and France can finally get along once all those pesky French and German people are gone.  Except still probably not, the goatfuckers will still find something to fight about. permalink award report block reply\nPats5x 1 points 2 days ago former soviet bloc is the way to go permalink award report block reply ActNow 1 points 2 days ago Michael Malice would like a word with you. permalink parent award report block reply\nActNow 1 points 2 days ago Michael Malice would like a word with you. permalink parent award report block reply\nKarameloKamala 1 points 2 days ago I love being Polish permalink award report block reply\nlifeisahologram 1 points 2 days ago Imagine going back to 1950, and telling everyone that in 100 years because we sided with the communists in world war 2, that communism infiltrates every aspect of western society and government. Imagine all the shocked pikachu faces! permalink award report block reply AmericanJawa 1 points 2 days ago Imagine going back to 1950, and telling everyone that in 100 years because we sided with the communists in world war 2, that communism infiltrates every aspect of western society and government. You are aware that in 1950 the US was in the middle of the Cold War when they were already concerned about Communists infiltrating the US, right? permalink parent award report block reply lifeisahologram 2 points 2 days ago Cold War yes, but I disagree, I don’t think there was massive retrospective public thoughts on their decisions in WW2 like there is today. permalink parent award report block reply\nAmericanJawa 1 points 2 days ago Imagine going back to 1950, and telling everyone that in 100 years because we sided with the communists in world war 2, that communism infiltrates every aspect of western society and government. You are aware that in 1950 the US was in the middle of the Cold War when they were already concerned about Communists infiltrating the US, right? permalink parent award report block reply lifeisahologram 2 points 2 days ago Cold War yes, but I disagree, I don’t think there was massive retrospective public thoughts on their decisions in WW2 like there is today. permalink parent award report block reply\nlifeisahologram 2 points 2 days ago Cold War yes, but I disagree, I don’t think there was massive retrospective public thoughts on their decisions in WW2 like there is today. permalink parent award report block reply\nSeeker_17 1 points 2 days ago They're so fucked. permalink award report block reply TwoArizonaPedes 5 points 2 days ago No. This is just Muslim propaganda bullshit. It comes from PSU Research Review: Prince Sultan University in Saudi Arabia. It's nonsense that ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within, destroyed by their own \"scholars.\" permalink parent award report block reply Chukna OP -3 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. permalink parent award report block reply M4ster_Yoda 2 points 2 days ago Haha, it's ludacrious to think there won't be war before that. permalink parent award report block reply\nTwoArizonaPedes 5 points 2 days ago No. This is just Muslim propaganda bullshit. It comes from PSU Research Review: Prince Sultan University in Saudi Arabia. It's nonsense that ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within, destroyed by their own \"scholars.\" permalink parent award report block reply Chukna OP -3 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. permalink parent award report block reply\nChukna OP -3 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. permalink parent award report block reply\nM4ster_Yoda 2 points 2 days ago Haha, it's ludacrious to think there won't be war before that. permalink parent award report block reply\nChukna OP 1 points 2 days ago This is what too liberal immigration policies can cause. Europe is lost case if nothing happens near future. permalink award report block reply\nBig-E 1 points 2 days ago That is an old map. permalink award report block reply TwoArizonaPedes 4 points 2 days ago It's Muslim propaganda bullshit. It comes from PSU Research Review: Prince Sultan University in Saudi Arabia. It's nonsense that ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within, destroyed by their own \"scholars.\" permalink parent award report block reply Chukna OP -3 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. permalink parent award report block reply TwoArizonaPedes 2 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those aren't even real numbers. Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -1 points 2 days ago Immigrant loving faggot. I bet you love rape little girls like your Muslim friends, or are little boys more of your thing? Retarded  faggot. You sound exactly like all the libtards who claim that these warnings are nothing but anti-immigrant propaganda. permalink parent award report block reply view 1 more comments...\nTwoArizonaPedes 4 points 2 days ago It's Muslim propaganda bullshit. It comes from PSU Research Review: Prince Sultan University in Saudi Arabia. It's nonsense that ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within, destroyed by their own \"scholars.\" permalink parent award report block reply Chukna OP -3 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. permalink parent award report block reply TwoArizonaPedes 2 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those aren't even real numbers. Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -1 points 2 days ago Immigrant loving faggot. I bet you love rape little girls like your Muslim friends, or are little boys more of your thing? Retarded  faggot. You sound exactly like all the libtards who claim that these warnings are nothing but anti-immigrant propaganda. permalink parent award report block reply view 1 more comments...\nChukna OP -3 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. permalink parent award report block reply TwoArizonaPedes 2 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those aren't even real numbers. Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -1 points 2 days ago Immigrant loving faggot. I bet you love rape little girls like your Muslim friends, or are little boys more of your thing? Retarded  faggot. You sound exactly like all the libtards who claim that these warnings are nothing but anti-immigrant propaganda. permalink parent award report block reply view 1 more comments...\nTwoArizonaPedes 2 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those aren't even real numbers. Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -1 points 2 days ago Immigrant loving faggot. I bet you love rape little girls like your Muslim friends, or are little boys more of your thing? Retarded  faggot. You sound exactly like all the libtards who claim that these warnings are nothing but anti-immigrant propaganda. permalink parent award report block reply view 1 more comments...\nChukna OP -1 points 2 days ago Immigrant loving faggot. I bet you love rape little girls like your Muslim friends, or are little boys more of your thing? Retarded  faggot. You sound exactly like all the libtards who claim that these warnings are nothing but anti-immigrant propaganda. permalink parent award report block reply view 1 more comments...\nAmericanJawa 1 points 2 days ago Why are East and West Germany divided in half on this map? permalink award report block reply TwoArizonaPedes 5 points 2 days ago Because this is Muslim propaganda bullshit. It comes from PSU Research Review: Prince Sultan University in Saudi Arabia. It's nonsense that ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within, destroyed by their own \"scholars.\" permalink parent award report block reply Chukna OP -3 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. permalink parent award report block reply TwoArizonaPedes 2 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those aren't even real numbers. They're fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -2 points 2 days ago Immigrant loving faggot. I bet you love rape little girls like your Muslim friends, or are little boys more of your thing? Retarded  faggot. You sound exactly like all the libtards who claim that these warnings are nothing but anti-immigrant propaganda. permalink parent award report block reply view 1 more comments...\nTwoArizonaPedes 5 points 2 days ago Because this is Muslim propaganda bullshit. It comes from PSU Research Review: Prince Sultan University in Saudi Arabia. It's nonsense that ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within, destroyed by their own \"scholars.\" permalink parent award report block reply Chukna OP -3 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. permalink parent award report block reply TwoArizonaPedes 2 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those aren't even real numbers. They're fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -2 points 2 days ago Immigrant loving faggot. I bet you love rape little girls like your Muslim friends, or are little boys more of your thing? Retarded  faggot. You sound exactly like all the libtards who claim that these warnings are nothing but anti-immigrant propaganda. permalink parent award report block reply view 1 more comments...\nChukna OP -3 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. permalink parent award report block reply TwoArizonaPedes 2 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those aren't even real numbers. They're fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -2 points 2 days ago Immigrant loving faggot. I bet you love rape little girls like your Muslim friends, or are little boys more of your thing? Retarded  faggot. You sound exactly like all the libtards who claim that these warnings are nothing but anti-immigrant propaganda. permalink parent award report block reply view 1 more comments...\nTwoArizonaPedes 2 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those aren't even real numbers. They're fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -2 points 2 days ago Immigrant loving faggot. I bet you love rape little girls like your Muslim friends, or are little boys more of your thing? Retarded  faggot. You sound exactly like all the libtards who claim that these warnings are nothing but anti-immigrant propaganda. permalink parent award report block reply view 1 more comments...\nChukna OP -2 points 2 days ago Immigrant loving faggot. I bet you love rape little girls like your Muslim friends, or are little boys more of your thing? Retarded  faggot. You sound exactly like all the libtards who claim that these warnings are nothing but anti-immigrant propaganda. permalink parent award report block reply view 1 more comments...\n5DchessWatch 1 points 2 days ago Yo yoyo Eastern bloc represent permalink award report block reply\nHazelHen 1 points 2 days ago Now do the US with whites. permalink award report block reply\ntt777 1 points 2 days ago I foresee lots of rapes in the future in Europe. permalink award report block reply\nVeritas264 1 points 2 days ago East Germany is back in 2050? permalink award report block reply TwoArizonaPedes 2 points 2 days ago It's Muslim propaganda bullshit. It comes from PSU Research Review: Prince Sultan University in Saudi Arabia. It's nonsense that ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within, destroyed by their own \"scholars.\" permalink parent award report block reply Chukna OP -2 points 2 days ago It's not pro-Islam propaganda, this is warning of the uncontrolled immigration of Europe that will result islamization of Europe if it's allowed to continue. permalink parent award report block reply TwoArizonaPedes 3 points 2 days ago It's not pro-Islam propaganda, this is warning of the uncontrolled immigration of Europe that will result islamization of Europe if it's allowed to continue. It's propaganda out of Saudi Arabia and you used an image with the attribution cut off the bottom so people couldn't see it for themselves. Why? Oh, right... permalink parent award report block reply Chukna OP -2 points 2 days ago You're retarded faggot. This map is warning of what happens if Europe continues being suicidal and allows uncontrolled Muslim immigration to their countries. permalink parent award report block reply Chukna OP -2 points 2 days ago Likely. They're politically very different from West Germany, more conservative. They probably will like to break away from Germany if Germany continues its suicidal politics. permalink parent award report block reply\nTwoArizonaPedes 2 points 2 days ago It's Muslim propaganda bullshit. It comes from PSU Research Review: Prince Sultan University in Saudi Arabia. It's nonsense that ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within, destroyed by their own \"scholars.\" permalink parent award report block reply Chukna OP -2 points 2 days ago It's not pro-Islam propaganda, this is warning of the uncontrolled immigration of Europe that will result islamization of Europe if it's allowed to continue. permalink parent award report block reply TwoArizonaPedes 3 points 2 days ago It's not pro-Islam propaganda, this is warning of the uncontrolled immigration of Europe that will result islamization of Europe if it's allowed to continue. It's propaganda out of Saudi Arabia and you used an image with the attribution cut off the bottom so people couldn't see it for themselves. Why? Oh, right... permalink parent award report block reply Chukna OP -2 points 2 days ago You're retarded faggot. This map is warning of what happens if Europe continues being suicidal and allows uncontrolled Muslim immigration to their countries. permalink parent award report block reply\nChukna OP -2 points 2 days ago It's not pro-Islam propaganda, this is warning of the uncontrolled immigration of Europe that will result islamization of Europe if it's allowed to continue. permalink parent award report block reply TwoArizonaPedes 3 points 2 days ago It's not pro-Islam propaganda, this is warning of the uncontrolled immigration of Europe that will result islamization of Europe if it's allowed to continue. It's propaganda out of Saudi Arabia and you used an image with the attribution cut off the bottom so people couldn't see it for themselves. Why? Oh, right... permalink parent award report block reply Chukna OP -2 points 2 days ago You're retarded faggot. This map is warning of what happens if Europe continues being suicidal and allows uncontrolled Muslim immigration to their countries. permalink parent award report block reply\nTwoArizonaPedes 3 points 2 days ago It's not pro-Islam propaganda, this is warning of the uncontrolled immigration of Europe that will result islamization of Europe if it's allowed to continue. It's propaganda out of Saudi Arabia and you used an image with the attribution cut off the bottom so people couldn't see it for themselves. Why? Oh, right... permalink parent award report block reply Chukna OP -2 points 2 days ago You're retarded faggot. This map is warning of what happens if Europe continues being suicidal and allows uncontrolled Muslim immigration to their countries. permalink parent award report block reply\nChukna OP -2 points 2 days ago You're retarded faggot. This map is warning of what happens if Europe continues being suicidal and allows uncontrolled Muslim immigration to their countries. permalink parent award report block reply\nChukna OP -2 points 2 days ago Likely. They're politically very different from West Germany, more conservative. They probably will like to break away from Germany if Germany continues its suicidal politics. permalink parent award report block reply\ncaptflerbus 1 points 2 days ago time to re form the warsaw pact against the caliphate of western europe deus vult permalink award report block reply\nEaszq8 1 points 2 days ago Blachkum acchhh snakbar kaboom! permalink award report block reply\nPhantomShield72 1 points 2 days ago They cannot be allowed to go Muslim AND keep nuclear weapons... permalink award report block reply TwoArizonaPedes 2 points 2 days ago Pakistan already does. permalink parent award report block reply PhantomShield72 1 points 2 days ago Yes. Why would we want more? permalink parent award report block reply\nTwoArizonaPedes 2 points 2 days ago Pakistan already does. permalink parent award report block reply PhantomShield72 1 points 2 days ago Yes. Why would we want more? permalink parent award report block reply\nPhantomShield72 1 points 2 days ago Yes. Why would we want more? permalink parent award report block reply\nRocksCanOnlyWait 1 points 2 days ago It's funny that Spain, which was ruled by Muslim caliphates for centuries, is significantly less Muslim than other countries in Europe. permalink award report block reply\ndeleted 1 points 2 days ago TwoArizonaPedes 4 points 2 days ago They're nonsense numbers because this is Muslim propaganda bullshit. It comes from PSU Research Review: Prince Sultan University in Saudi Arabia. It  ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within, destroyed by their own \"scholars.\" permalink parent award report block reply Chukna OP 0 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. permalink parent award report block reply TwoArizonaPedes 2 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those aren't even real numbers. Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -2 points 2 days ago Immigrant loving faggot. I bet you love rape little girls like your Muslim friends, or are little boys more of your thing? Retarded  faggot. You sound exactly like all the libtards who claim that these warnings are nothing but anti-immigrant propaganda. permalink parent award report block reply view 1 more comments... Chukna OP -3 points 2 days ago Probably, the immigration rates are only rising. permalink parent award report block reply\nTwoArizonaPedes 4 points 2 days ago They're nonsense numbers because this is Muslim propaganda bullshit. It comes from PSU Research Review: Prince Sultan University in Saudi Arabia. It  ignores things like declining birth rates and increasing apostasy rates and the fact that Islamic theology is crumbling from within, destroyed by their own \"scholars.\" permalink parent award report block reply Chukna OP 0 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. permalink parent award report block reply TwoArizonaPedes 2 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those aren't even real numbers. Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -2 points 2 days ago Immigrant loving faggot. I bet you love rape little girls like your Muslim friends, or are little boys more of your thing? Retarded  faggot. You sound exactly like all the libtards who claim that these warnings are nothing but anti-immigrant propaganda. permalink parent award report block reply view 1 more comments...\nChukna OP 0 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. permalink parent award report block reply TwoArizonaPedes 2 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those aren't even real numbers. Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -2 points 2 days ago Immigrant loving faggot. I bet you love rape little girls like your Muslim friends, or are little boys more of your thing? Retarded  faggot. You sound exactly like all the libtards who claim that these warnings are nothing but anti-immigrant propaganda. permalink parent award report block reply view 1 more comments...\nTwoArizonaPedes 2 points 2 days ago Stop being a fucking degenerate Muslim loving pedophile faggot. Europe has been too suicidal for too long and allowed uncontrolled Muslim immigration to their countries. This is the result we will see in a few decades. Why would Saudis publish warnings about uncontrolled Muslim immigration? LOL Those aren't even real numbers. Those are fantasy projections to encourage their fellow Muslims. STOP posting Islamic propaganda here. permalink parent award report block reply Chukna OP -2 points 2 days ago Immigrant loving faggot. I bet you love rape little girls like your Muslim friends, or are little boys more of your thing? Retarded  faggot. You sound exactly like all the libtards who claim that these warnings are nothing but anti-immigrant propaganda. permalink parent award report block reply view 1 more comments...\nChukna OP -2 points 2 days ago Immigrant loving faggot. I bet you love rape little girls like your Muslim friends, or are little boys more of your thing? Retarded  faggot. You sound exactly like all the libtards who claim that these warnings are nothing but anti-immigrant propaganda. permalink parent award report block reply view 1 more comments...\nChukna OP -3 points 2 days ago Probably, the immigration rates are only rising. permalink parent award report block reply\nTenchuStealthAss 1 points 2 days ago Those luxembourg numbers aren't possible. permalink award report block reply\nIAmDisappoint -1 points 2 days ago Invasion going as planned. But eurofags deserve this, this is what they voted for. permalink award report block reply\nRock9Head -1 points 2 days ago A nuclear war would be an improvement. permalink award report block reply\n5DchessWatch -1 points 2 days ago Germany is skewed in a way because they've been importing Turks (turkey) for 150 yrs.  Its where the nazi black sun brigade, thule society et al got their occultic sufi alchemy gnosto-shit.  Turkish kind of don't count because they're not necessarily the \"bad ones\" (sharia)  because turkey is secular and don't recognize sharia law. permalink award report block reply\nDeltaSierra -2 points 2 days ago I don’t blame them for going to Sweden to get the blonde chicks.  I don’t get the hate.  These are smart brothers. permalink award report block reply\nMythArcana -2 points 2 days ago Conquered. permalink award report block reply\nmikethemarine -2 points 2 days ago A stanch thing is , it only takes 10% of the population that is willing to fight to overthrow a country, those above 10% have already lost permalink award report block reply DeltaSierra -3 points 2 days ago You are looking at this wrong.  Those brothers are conservatives and they are taking countries already lost to the left.  Why not just sit back and enjoy? permalink parent award report block reply mikethemarine 5 points 2 days ago it will spread. permalink parent award report block reply ActNow 4 points 2 days ago Too many people don't seem to understand this. permalink parent award report block reply MaybeKari 4 points 2 days ago Those brothers are conservatives They're not our brothers. They might be your brother -- if you're also Muslim. permalink parent award report block reply\nDeltaSierra -3 points 2 days ago You are looking at this wrong.  Those brothers are conservatives and they are taking countries already lost to the left.  Why not just sit back and enjoy? permalink parent award report block reply mikethemarine 5 points 2 days ago it will spread. permalink parent award report block reply ActNow 4 points 2 days ago Too many people don't seem to understand this. permalink parent award report block reply MaybeKari 4 points 2 days ago Those brothers are conservatives They're not our brothers. They might be your brother -- if you're also Muslim. permalink parent award report block reply\nmikethemarine 5 points 2 days ago it will spread. permalink parent award report block reply ActNow 4 points 2 days ago Too many people don't seem to understand this. permalink parent award report block reply\nActNow 4 points 2 days ago Too many people don't seem to understand this. permalink parent award report block reply\nMaybeKari 4 points 2 days ago Those brothers are conservatives They're not our brothers. They might be your brother -- if you're also Muslim. permalink parent award report block reply\npossibletower -6 points 2 days ago I remember when faggots here fapped to Sweden the past 5 years because \"muh based Sweden leads the resistance against the muh poison shots\" 🤣 Cognitive dissonance prime example right there. Who the fuck cares about Sweden and poison shots when they are the kings of cucking out to Islam? permalink award report block reply ParadigmShift2070 2 points 2 days ago the resistance against shots were probably mostly from the browns, Sweden not wanting to be called racist stopped the enforcements permalink parent award report block reply\nParadigmShift2070 2 points 2 days ago the resistance against shots were probably mostly from the browns, Sweden not wanting to be called racist stopped the enforcements permalink parent award report block reply"}