{"id": "1ARK56kwMe", "contents": "245 Democrats are not interested in solving any problem posted 4 days ago by Belleoffreedom 11 comments award share report block Mike Lee @BasedMikeLee • 5d Tonight we tried to give relief to unpaid military personnel & federal workers Democrats blocked it Indefensible Mike Lee @SenMikeLee • 5d Democrats just refused to pay the federal workers and American troops hurt by their shutdown. Sending your money to big insurance companies and keeping their Obamacare failure on life support is too important to them.\n11 comments Sort by Top Top New Worst Old Save Around the Web 23 Ridiculously Cool Gadgets You'll Want to Buy Immediately Trending Gadget Lunk 5 points 4 days ago Neither are republicans permalink award report block reply LordCommissarYarrick 3 points 4 days ago Yep. People have to realize that both parties don't give a shit about the peasantry. permalink parent award report block reply corporateshizer 2 points 4 days ago Sounds good to me. Keep the federal government closed permanently. permalink award report block reply DrWeeGee 2 points 4 days ago I want my taxes to reflect that (0%) permalink parent award report block reply Unboosted 1 points 4 days ago We have never had so much power. 2026 tax strike! permalink parent award report block reply Belleoffreedom OP 2 points 4 days ago https://x.com/BasedMikeLee/status/1986960771595538741?s=20 permalink award report block reply Bullet3250 2 points 4 days ago Problems are their TOOLS... Tools for Manipulation Tools for Fundraising... Tools for Campaigning... Tools for Dismantling the Nation - piece by piece. Tools for Taking Power permalink award report block reply Unboosted 1 points 4 days ago Blue retards will never see this permalink award report block reply God-is-good 1 points 4 days ago Sing it from the roof tops, yet the media will not tell the truth. The suffering will continue as it is the only leverage demonrats have left and they will Milk it while they control the ability to frame the pain blame as not their own fault. permalink award report block reply\nLunk 5 points 4 days ago Neither are republicans permalink award report block reply LordCommissarYarrick 3 points 4 days ago Yep. People have to realize that both parties don't give a shit about the peasantry. permalink parent award report block reply\nLordCommissarYarrick 3 points 4 days ago Yep. People have to realize that both parties don't give a shit about the peasantry. permalink parent award report block reply\ncorporateshizer 2 points 4 days ago Sounds good to me. Keep the federal government closed permanently. permalink award report block reply DrWeeGee 2 points 4 days ago I want my taxes to reflect that (0%) permalink parent award report block reply Unboosted 1 points 4 days ago We have never had so much power. 2026 tax strike! permalink parent award report block reply\nDrWeeGee 2 points 4 days ago I want my taxes to reflect that (0%) permalink parent award report block reply Unboosted 1 points 4 days ago We have never had so much power. 2026 tax strike! permalink parent award report block reply\nUnboosted 1 points 4 days ago We have never had so much power. 2026 tax strike! permalink parent award report block reply\nBelleoffreedom OP 2 points 4 days ago https://x.com/BasedMikeLee/status/1986960771595538741?s=20 permalink award report block reply\nBullet3250 2 points 4 days ago Problems are their TOOLS... Tools for Manipulation Tools for Fundraising... Tools for Campaigning... Tools for Dismantling the Nation - piece by piece. Tools for Taking Power permalink award report block reply\nUnboosted 1 points 4 days ago Blue retards will never see this permalink award report block reply\nGod-is-good 1 points 4 days ago Sing it from the roof tops, yet the media will not tell the truth. The suffering will continue as it is the only leverage demonrats have left and they will Milk it while they control the ability to frame the pain blame as not their own fault. permalink award report block reply"}