{"id": "1ARK5A8C7H", "contents": "717 DAMNING Post Explaining How Obamacare Really 'Works' (twitchy.com) 🚁 FREE CHOPPER RIDES 🚁 posted 3 days ago by Trick 49 comments award share report block What Democrats Don't Want YOU to Know: DAMNING Post Explaining How Obamacare Really 'Works' a MUST-Read Discover the hidden truths about Obamacare and how it affects American healthcare. twitchy.com\n49 comments Sort by Top Top New Worst Old Save DCPower 64 points 3 days ago Summary: the government gives 40 billion to insurance companies regardless of what they do, then gives tax breaks to hospitals, adding up to roughly $200 billion. But the insurance companies and hospitals still charge all of us the same while using their newfound money to drive out small practices, eliminating all competition so they can jack up the prices even higher. permalink award report block reply roadrunner0 23 points 3 days ago Government regulations pushed by larger corporate run hospitals drove free clinics and church run low cost hospitals out of operation to force a monopoly on us.. permalink parent award report block reply terribletwos 17 points 3 days ago Then they fill those hospitals with illegal aliens who don't have money and get free healthcare, so much that they make tents inside hallways. So you can't get access to care or very limited. I've sat next to them in tents in an emergency room and listened to them having bullshit problems they only came in for because they know it's free. edit: I just wanted to add that this is really the same scam as the hotel scam. It's just money extraction through fraud. permalink parent award report block reply NotYourMan 7 points 3 days ago The government workers and politicians gain control.  Notice how socialized health care done this way gives a small number of power corporations all control.  They get money from the government and funnel that into reelection campaigns basically buying the politicians.  Because health care is so expensive, people in the lower middle class choose poverty to get it for free or close to free and those in poverty can never get out.  This is socialism which is government control of everything.  This is why we have such a great split between the poor and rich right now.  Democrats sold out the middle class again. permalink parent award report block reply HockeyMom4Trump 5 points 3 days ago Yes, in MN everything seems to be through a couple because corporations. M Health Fairview is one. permalink parent award report block reply bejeavis 5 points 3 days ago Working as intended (no sarcasm) permalink parent award report block reply DCPower 4 points 3 days ago Agreed permalink parent award report block reply load 1 more comments... Seeing_Red 25 points 3 days ago TL;DR: ChatGPT: Obamacare funnels large amounts of taxpayer money to insurance companies and big hospital systems, while ordinary people still pay high premiums, high deductibles, and inflated medical bills. It says insurance companies receive a guaranteed $40 billion a year in subsidies that aren’t tied to lowering patient costs. Large “nonprofit” hospital networks are described as taking in over $150 billion in tax breaks and extra payments while paying executives millions, buying up smaller practices to reduce competition, and charging extreme markups for basic supplies. The overall point is that taxpayers pay multiple times: through taxes, through monthly premiums, and through hospital bills, while access to affordable care remains out of reach. The claimed beneficiaries are lawmakers, insurance companies, and hospital executives, not the patients the system was supposed to help. permalink award report block reply HockeyMom4Trump 13 points 3 days ago Sounds accurate. Our premiums are high. If we go in, we have to pay because our deductible is high. We never really feel comfortable going in for anything like a sore throat, because when we do, we get a bill for $700 plus dollars. Meanwhile, the people with no insurance in this country illegal seem to pay nothing. permalink parent award report block reply deleted 5 points 3 days ago Hanging_Chad 3 points 3 days ago Arizona Health Care Cost Containment System (AHCCCS) has a 2-star rating on Google permalink parent award report block reply DCPower 2 points 3 days ago On the other hand, I’ve found an amazing amount of home remedies that work a lot better than prescription drugs. permalink parent award report block reply HillarysFUPA 15 points 3 days ago I'm friends with an anesthesiologist and he had a private practice. Cleveland clinic purchased his practice, pays him double what he used to get paid, and he now works half the hours. They are purposely destroying private practice and it is costing several times more. They have the money to do it because they are creating a healthcare monopoly at the expense of tax payers. permalink award report block reply booblitchutz 5 points 3 days ago Insurance companies and government regulations are both stacked firmly against private practice medical providers. The records regulations alone make starting a new private practice virtually impossible. permalink parent award report block reply conservativefrank 9 points 3 days ago TL/DR Tax payers are sending nearly $200 billion a year in subsidies to insurance companies and “nonprofit” hospitals, while they charge us a fortune on top of that and we still can’t afford basic medical care. permalink award report block reply roadrunner0 8 points 3 days ago Of course it was a Federal Government power grab because health care is 1/6 of domestic GDP.. They have hooks into food production, energy, technology and other areas in a slow creep toward Communist control of We the People.. permalink award report block reply trueredthruandthru 6 points 3 days ago As a doctor I can tell you that healthcare is beyond broken--from the top to the bottom. Massive fraud, constant turnover, subpar care, rules/policies broken, inflated admin salaries, small private practices being squeezed by 'non-profit' hospital orgs, essential services being dropped, and on and on...And that doesn't even scratch the surface of MASSIVE amount of illegals who get thrown on medicaid and pay literally nothing. The worst part is that the rural hospitals survive off these illegals on medicaid. So if illegals get deported or thrown off medicaid then the hospitals go bankrupt and close and the local citizens suffer big time. The stories I could tell....I've been in it for 13 years and I used to have a crazy story maybe once a month of what I saw. Now it is daily. Constant unsettling problems popping up on a daily basis. Healthcare is in big big big trouble and has been trending this way since Obamacare, and the public is just starting to notice. permalink award report block reply MonolitoVeritas 6 points 3 days ago Retirees have known for long time that the best, cheapest and fastest health care is received through cash as you go care.  You can get no-kidding same or next day house calls from doctors with no deductible CHEAPER than the in-network-scam-jobs that the dumbed down public accept as the norm.. permalink award report block reply Spicy_cat 1 points 3 days ago Online doctor that will call you and then send your prescription in to pharmacy of your choice: $50 Emergency room hospital visit: $5000 Women: \"bawww I have a tummy ache take me to the hospital\" permalink parent award report block reply Hanging_Chad 5 points 3 days ago TL;dr? permalink award report block reply HerrnMalor 19 points 3 days ago So you’re paying THREE times: Through taxes (subsidizing insurers and hospitals) Through premiums (to insurance companies) Through bills (to hospitals with massive markups) Who Wins? Lawmakers. Insurance company CEOs and shareholders Hospital system executives Who Loses? You. Your family. Every American who actually needs healthcare. permalink parent award report block reply roadrunner0 6 points 3 days ago The Government Mafioso has created a massive protection racket revenue stream for themselves by extorting working people and companies providing health care.. Speaking of rackets, relative was moved from one hospital to another 10 minutes away with non critical illness by helicopter she never requested or even was told about until they were putting her on it.. This ride cost $70,000 and is a major scam.. permalink parent award report block reply SavingPrivateGrace 2 points 3 days ago Hospital system executives include the Doctors.  I remember back when Obamacare was introduced the fear among the doctors was their salaries would be set and capped. permalink parent award report block reply DCPower 4 points 3 days ago Summary would be nice, agreed. Edit made my own and posted to the comments. permalink parent award report block reply Seeing_Red 1 points 3 days ago above permalink parent award report block reply deleted 2 points 3 days ago Seeing_Red 1 points 3 days ago above permalink parent award report block reply load 2 more comments... Rucktoe 3 points 3 days ago Reagan was correct when talking about these words, \"I'm from the government and I am here to help.\" permalink award report block reply monkadelic 3 points 3 days ago If you didn't already know all of this, you're way too uninformed on one of our most pressing issues. permalink award report block reply Nibba2 2 points 3 days ago How Obamacare really works is simple. You give free healthcare to those who don’t try. You set the threshold for “reduced coverage” so low that holding a job makes you ineligible working part time making $15k/yr. Make the cost of living higher than tons of people make. Make holding a job a useless venture so nobody builds a career. Get them all on government handouts. permalink award report block reply Agent_86 1 points 3 days ago Well damn. I pay 167.00 a month with 0 deductible. Soooo.... permalink award report block reply NowTheyAllLose 3 points 3 days ago Good for you.  I make $70k/yr and have a wife and 1 kid. My premium is $1,100/mo and deductible is $5k.  This is for the cheapest non HDHP coverage offered. permalink parent award report block reply Michalusmichalus 2 points 3 days ago How much does your job contribute? Companies started contributing kesa because of the subsidies. permalink parent award report block reply NowTheyAllLose 2 points 3 days ago They contribute right at 50%.  Like 52% or something. And I don't live in an expensive state either.... permalink parent award report block reply Michalusmichalus 2 points 2 days ago That's very good these days. The average lately seems to be -/+ 25%. The worst thing a company can do is self insure. People don't pay enough attention to that. You do NOT want your employer having access to your medical records. permalink parent award report block reply Agent_86 2 points 3 days ago I guess that's good. When my wife was alive she had bcbs. So i hade her insurance but not anymore. After she passed away I retired. I got 3 dogs my son lives on his own. permalink parent award report block reply 08G8GTsupercharged 1 points 3 days ago Holy shit. I pay 1462 for just me with 10k deductible. No dental or vision like the majority of us. Recently the insurance has denied a mri and ct scan to figure out why I've had really shitty headaches for the last 3 month almost nonstop. Insurance is just about worthless. permalink parent award report block reply Agent_86 1 points 3 days ago Its all a scam pretty much. I found out some drs prefer cash. Then the price of the procedure goes way down. permalink parent award report block reply Hikedelics 1 points 3 days ago Keep the government shutdown for as long as it takes to choke those rat bastards out. Idgaf if that means 20 years, this can’t be allowed to continue. permalink award report block reply JimRaynor 1 points 3 days ago It’s in effect in European welfare countries The hardworking tax slaves are on mandatory healthcare insurance with high premiums, and are exploited by the lazy and the sick who pay nothing permalink award report block reply taytaytay 1 points 3 days ago Yep, that about covers it permalink award report block reply PatriotPrep1775 1 points 3 days ago You have to vote on the bill before you can read what's in it. permalink award report block reply mateus 1 points 3 days ago The most important part: DEMOCRATS IN CONGRESS WANT EVERYONE (EXCEPT THEMSELVES) ON IT. How soon we forget: 2010 and how outraged Americans who were AWARE of the above, descended on Town Halls because they wanted to keep their private health care insurance. The Dems are still at it, and their agenda is to eliminate private health care amid current cries of how \"broken\" it is. Well, it isn't broken for everyone. My husband and I pay a reasonable premium, and are able to choose our own doctor/specialist if needed. We're certainly not the only ones in the U.S. to do so. And there's no need for the annual Obamacare clown show, where people get on line to search for a new plan. We've had the same employer plan for decades. So I'd think long and hard before getting on the \"U.S. health care is broken\" bandwagon. Unless, like us, you can afford to pay the fines you'll have to pay for not complying. Yes, that's another thing: when they started talking about fines (that Justice Roberts deemed a \"tax,\" so it was upheld) WE got busy and saved like crazy in an account dedicated to pay those fines, and to which we still contribute. Luckily, we never had to pay them. But should that scenario come around again, like all of the elites, we will also be able to pay that fine (tax) for non-compliance and, frankly, for concierge care, if necessary. NO ONE will be telling\nus what to do with regards to health care. So appreciate what you have while you have it. permalink award report block reply MajorClark 0 points 3 days ago Obama, Biden, Schumer and other corrupt politicians getting kickbacks in the millions. permalink award report block reply\nDCPower 64 points 3 days ago Summary: the government gives 40 billion to insurance companies regardless of what they do, then gives tax breaks to hospitals, adding up to roughly $200 billion. But the insurance companies and hospitals still charge all of us the same while using their newfound money to drive out small practices, eliminating all competition so they can jack up the prices even higher. permalink award report block reply roadrunner0 23 points 3 days ago Government regulations pushed by larger corporate run hospitals drove free clinics and church run low cost hospitals out of operation to force a monopoly on us.. permalink parent award report block reply terribletwos 17 points 3 days ago Then they fill those hospitals with illegal aliens who don't have money and get free healthcare, so much that they make tents inside hallways. So you can't get access to care or very limited. I've sat next to them in tents in an emergency room and listened to them having bullshit problems they only came in for because they know it's free. edit: I just wanted to add that this is really the same scam as the hotel scam. It's just money extraction through fraud. permalink parent award report block reply NotYourMan 7 points 3 days ago The government workers and politicians gain control.  Notice how socialized health care done this way gives a small number of power corporations all control.  They get money from the government and funnel that into reelection campaigns basically buying the politicians.  Because health care is so expensive, people in the lower middle class choose poverty to get it for free or close to free and those in poverty can never get out.  This is socialism which is government control of everything.  This is why we have such a great split between the poor and rich right now.  Democrats sold out the middle class again. permalink parent award report block reply HockeyMom4Trump 5 points 3 days ago Yes, in MN everything seems to be through a couple because corporations. M Health Fairview is one. permalink parent award report block reply bejeavis 5 points 3 days ago Working as intended (no sarcasm) permalink parent award report block reply DCPower 4 points 3 days ago Agreed permalink parent award report block reply load 1 more comments...\nroadrunner0 23 points 3 days ago Government regulations pushed by larger corporate run hospitals drove free clinics and church run low cost hospitals out of operation to force a monopoly on us.. permalink parent award report block reply\nterribletwos 17 points 3 days ago Then they fill those hospitals with illegal aliens who don't have money and get free healthcare, so much that they make tents inside hallways. So you can't get access to care or very limited. I've sat next to them in tents in an emergency room and listened to them having bullshit problems they only came in for because they know it's free. edit: I just wanted to add that this is really the same scam as the hotel scam. It's just money extraction through fraud. permalink parent award report block reply\nNotYourMan 7 points 3 days ago The government workers and politicians gain control.  Notice how socialized health care done this way gives a small number of power corporations all control.  They get money from the government and funnel that into reelection campaigns basically buying the politicians.  Because health care is so expensive, people in the lower middle class choose poverty to get it for free or close to free and those in poverty can never get out.  This is socialism which is government control of everything.  This is why we have such a great split between the poor and rich right now.  Democrats sold out the middle class again. permalink parent award report block reply\nHockeyMom4Trump 5 points 3 days ago Yes, in MN everything seems to be through a couple because corporations. M Health Fairview is one. permalink parent award report block reply\nbejeavis 5 points 3 days ago Working as intended (no sarcasm) permalink parent award report block reply DCPower 4 points 3 days ago Agreed permalink parent award report block reply\nDCPower 4 points 3 days ago Agreed permalink parent award report block reply\nSeeing_Red 25 points 3 days ago TL;DR: ChatGPT: Obamacare funnels large amounts of taxpayer money to insurance companies and big hospital systems, while ordinary people still pay high premiums, high deductibles, and inflated medical bills. It says insurance companies receive a guaranteed $40 billion a year in subsidies that aren’t tied to lowering patient costs. Large “nonprofit” hospital networks are described as taking in over $150 billion in tax breaks and extra payments while paying executives millions, buying up smaller practices to reduce competition, and charging extreme markups for basic supplies. The overall point is that taxpayers pay multiple times: through taxes, through monthly premiums, and through hospital bills, while access to affordable care remains out of reach. The claimed beneficiaries are lawmakers, insurance companies, and hospital executives, not the patients the system was supposed to help. permalink award report block reply HockeyMom4Trump 13 points 3 days ago Sounds accurate. Our premiums are high. If we go in, we have to pay because our deductible is high. We never really feel comfortable going in for anything like a sore throat, because when we do, we get a bill for $700 plus dollars. Meanwhile, the people with no insurance in this country illegal seem to pay nothing. permalink parent award report block reply deleted 5 points 3 days ago Hanging_Chad 3 points 3 days ago Arizona Health Care Cost Containment System (AHCCCS) has a 2-star rating on Google permalink parent award report block reply DCPower 2 points 3 days ago On the other hand, I’ve found an amazing amount of home remedies that work a lot better than prescription drugs. permalink parent award report block reply\nHockeyMom4Trump 13 points 3 days ago Sounds accurate. Our premiums are high. If we go in, we have to pay because our deductible is high. We never really feel comfortable going in for anything like a sore throat, because when we do, we get a bill for $700 plus dollars. Meanwhile, the people with no insurance in this country illegal seem to pay nothing. permalink parent award report block reply deleted 5 points 3 days ago Hanging_Chad 3 points 3 days ago Arizona Health Care Cost Containment System (AHCCCS) has a 2-star rating on Google permalink parent award report block reply DCPower 2 points 3 days ago On the other hand, I’ve found an amazing amount of home remedies that work a lot better than prescription drugs. permalink parent award report block reply\ndeleted 5 points 3 days ago Hanging_Chad 3 points 3 days ago Arizona Health Care Cost Containment System (AHCCCS) has a 2-star rating on Google permalink parent award report block reply\nHanging_Chad 3 points 3 days ago Arizona Health Care Cost Containment System (AHCCCS) has a 2-star rating on Google permalink parent award report block reply\nDCPower 2 points 3 days ago On the other hand, I’ve found an amazing amount of home remedies that work a lot better than prescription drugs. permalink parent award report block reply\nHillarysFUPA 15 points 3 days ago I'm friends with an anesthesiologist and he had a private practice. Cleveland clinic purchased his practice, pays him double what he used to get paid, and he now works half the hours. They are purposely destroying private practice and it is costing several times more. They have the money to do it because they are creating a healthcare monopoly at the expense of tax payers. permalink award report block reply booblitchutz 5 points 3 days ago Insurance companies and government regulations are both stacked firmly against private practice medical providers. The records regulations alone make starting a new private practice virtually impossible. permalink parent award report block reply\nbooblitchutz 5 points 3 days ago Insurance companies and government regulations are both stacked firmly against private practice medical providers. The records regulations alone make starting a new private practice virtually impossible. permalink parent award report block reply\nconservativefrank 9 points 3 days ago TL/DR Tax payers are sending nearly $200 billion a year in subsidies to insurance companies and “nonprofit” hospitals, while they charge us a fortune on top of that and we still can’t afford basic medical care. permalink award report block reply\nroadrunner0 8 points 3 days ago Of course it was a Federal Government power grab because health care is 1/6 of domestic GDP.. They have hooks into food production, energy, technology and other areas in a slow creep toward Communist control of We the People.. permalink award report block reply\ntrueredthruandthru 6 points 3 days ago As a doctor I can tell you that healthcare is beyond broken--from the top to the bottom. Massive fraud, constant turnover, subpar care, rules/policies broken, inflated admin salaries, small private practices being squeezed by 'non-profit' hospital orgs, essential services being dropped, and on and on...And that doesn't even scratch the surface of MASSIVE amount of illegals who get thrown on medicaid and pay literally nothing. The worst part is that the rural hospitals survive off these illegals on medicaid. So if illegals get deported or thrown off medicaid then the hospitals go bankrupt and close and the local citizens suffer big time. The stories I could tell....I've been in it for 13 years and I used to have a crazy story maybe once a month of what I saw. Now it is daily. Constant unsettling problems popping up on a daily basis. Healthcare is in big big big trouble and has been trending this way since Obamacare, and the public is just starting to notice. permalink award report block reply\nMonolitoVeritas 6 points 3 days ago Retirees have known for long time that the best, cheapest and fastest health care is received through cash as you go care.  You can get no-kidding same or next day house calls from doctors with no deductible CHEAPER than the in-network-scam-jobs that the dumbed down public accept as the norm.. permalink award report block reply Spicy_cat 1 points 3 days ago Online doctor that will call you and then send your prescription in to pharmacy of your choice: $50 Emergency room hospital visit: $5000 Women: \"bawww I have a tummy ache take me to the hospital\" permalink parent award report block reply\nSpicy_cat 1 points 3 days ago Online doctor that will call you and then send your prescription in to pharmacy of your choice: $50 Emergency room hospital visit: $5000 Women: \"bawww I have a tummy ache take me to the hospital\" permalink parent award report block reply\nHanging_Chad 5 points 3 days ago TL;dr? permalink award report block reply HerrnMalor 19 points 3 days ago So you’re paying THREE times: Through taxes (subsidizing insurers and hospitals) Through premiums (to insurance companies) Through bills (to hospitals with massive markups) Who Wins? Lawmakers. Insurance company CEOs and shareholders Hospital system executives Who Loses? You. Your family. Every American who actually needs healthcare. permalink parent award report block reply roadrunner0 6 points 3 days ago The Government Mafioso has created a massive protection racket revenue stream for themselves by extorting working people and companies providing health care.. Speaking of rackets, relative was moved from one hospital to another 10 minutes away with non critical illness by helicopter she never requested or even was told about until they were putting her on it.. This ride cost $70,000 and is a major scam.. permalink parent award report block reply SavingPrivateGrace 2 points 3 days ago Hospital system executives include the Doctors.  I remember back when Obamacare was introduced the fear among the doctors was their salaries would be set and capped. permalink parent award report block reply DCPower 4 points 3 days ago Summary would be nice, agreed. Edit made my own and posted to the comments. permalink parent award report block reply Seeing_Red 1 points 3 days ago above permalink parent award report block reply deleted 2 points 3 days ago Seeing_Red 1 points 3 days ago above permalink parent award report block reply load 2 more comments...\nHerrnMalor 19 points 3 days ago So you’re paying THREE times: Through taxes (subsidizing insurers and hospitals) Through premiums (to insurance companies) Through bills (to hospitals with massive markups) Who Wins? Lawmakers. Insurance company CEOs and shareholders Hospital system executives Who Loses? You. Your family. Every American who actually needs healthcare. permalink parent award report block reply roadrunner0 6 points 3 days ago The Government Mafioso has created a massive protection racket revenue stream for themselves by extorting working people and companies providing health care.. Speaking of rackets, relative was moved from one hospital to another 10 minutes away with non critical illness by helicopter she never requested or even was told about until they were putting her on it.. This ride cost $70,000 and is a major scam.. permalink parent award report block reply SavingPrivateGrace 2 points 3 days ago Hospital system executives include the Doctors.  I remember back when Obamacare was introduced the fear among the doctors was their salaries would be set and capped. permalink parent award report block reply\nroadrunner0 6 points 3 days ago The Government Mafioso has created a massive protection racket revenue stream for themselves by extorting working people and companies providing health care.. Speaking of rackets, relative was moved from one hospital to another 10 minutes away with non critical illness by helicopter she never requested or even was told about until they were putting her on it.. This ride cost $70,000 and is a major scam.. permalink parent award report block reply\nSavingPrivateGrace 2 points 3 days ago Hospital system executives include the Doctors.  I remember back when Obamacare was introduced the fear among the doctors was their salaries would be set and capped. permalink parent award report block reply\nDCPower 4 points 3 days ago Summary would be nice, agreed. Edit made my own and posted to the comments. permalink parent award report block reply Seeing_Red 1 points 3 days ago above permalink parent award report block reply\nSeeing_Red 1 points 3 days ago above permalink parent award report block reply\ndeleted 2 points 3 days ago\nSeeing_Red 1 points 3 days ago above permalink parent award report block reply\nRucktoe 3 points 3 days ago Reagan was correct when talking about these words, \"I'm from the government and I am here to help.\" permalink award report block reply\nmonkadelic 3 points 3 days ago If you didn't already know all of this, you're way too uninformed on one of our most pressing issues. permalink award report block reply\nNibba2 2 points 3 days ago How Obamacare really works is simple. You give free healthcare to those who don’t try. You set the threshold for “reduced coverage” so low that holding a job makes you ineligible working part time making $15k/yr. Make the cost of living higher than tons of people make. Make holding a job a useless venture so nobody builds a career. Get them all on government handouts. permalink award report block reply\nAgent_86 1 points 3 days ago Well damn. I pay 167.00 a month with 0 deductible. Soooo.... permalink award report block reply NowTheyAllLose 3 points 3 days ago Good for you.  I make $70k/yr and have a wife and 1 kid. My premium is $1,100/mo and deductible is $5k.  This is for the cheapest non HDHP coverage offered. permalink parent award report block reply Michalusmichalus 2 points 3 days ago How much does your job contribute? Companies started contributing kesa because of the subsidies. permalink parent award report block reply NowTheyAllLose 2 points 3 days ago They contribute right at 50%.  Like 52% or something. And I don't live in an expensive state either.... permalink parent award report block reply Michalusmichalus 2 points 2 days ago That's very good these days. The average lately seems to be -/+ 25%. The worst thing a company can do is self insure. People don't pay enough attention to that. You do NOT want your employer having access to your medical records. permalink parent award report block reply Agent_86 2 points 3 days ago I guess that's good. When my wife was alive she had bcbs. So i hade her insurance but not anymore. After she passed away I retired. I got 3 dogs my son lives on his own. permalink parent award report block reply 08G8GTsupercharged 1 points 3 days ago Holy shit. I pay 1462 for just me with 10k deductible. No dental or vision like the majority of us. Recently the insurance has denied a mri and ct scan to figure out why I've had really shitty headaches for the last 3 month almost nonstop. Insurance is just about worthless. permalink parent award report block reply Agent_86 1 points 3 days ago Its all a scam pretty much. I found out some drs prefer cash. Then the price of the procedure goes way down. permalink parent award report block reply\nNowTheyAllLose 3 points 3 days ago Good for you.  I make $70k/yr and have a wife and 1 kid. My premium is $1,100/mo and deductible is $5k.  This is for the cheapest non HDHP coverage offered. permalink parent award report block reply Michalusmichalus 2 points 3 days ago How much does your job contribute? Companies started contributing kesa because of the subsidies. permalink parent award report block reply NowTheyAllLose 2 points 3 days ago They contribute right at 50%.  Like 52% or something. And I don't live in an expensive state either.... permalink parent award report block reply Michalusmichalus 2 points 2 days ago That's very good these days. The average lately seems to be -/+ 25%. The worst thing a company can do is self insure. People don't pay enough attention to that. You do NOT want your employer having access to your medical records. permalink parent award report block reply Agent_86 2 points 3 days ago I guess that's good. When my wife was alive she had bcbs. So i hade her insurance but not anymore. After she passed away I retired. I got 3 dogs my son lives on his own. permalink parent award report block reply\nMichalusmichalus 2 points 3 days ago How much does your job contribute? Companies started contributing kesa because of the subsidies. permalink parent award report block reply NowTheyAllLose 2 points 3 days ago They contribute right at 50%.  Like 52% or something. And I don't live in an expensive state either.... permalink parent award report block reply Michalusmichalus 2 points 2 days ago That's very good these days. The average lately seems to be -/+ 25%. The worst thing a company can do is self insure. People don't pay enough attention to that. You do NOT want your employer having access to your medical records. permalink parent award report block reply\nNowTheyAllLose 2 points 3 days ago They contribute right at 50%.  Like 52% or something. And I don't live in an expensive state either.... permalink parent award report block reply Michalusmichalus 2 points 2 days ago That's very good these days. The average lately seems to be -/+ 25%. The worst thing a company can do is self insure. People don't pay enough attention to that. You do NOT want your employer having access to your medical records. permalink parent award report block reply\nMichalusmichalus 2 points 2 days ago That's very good these days. The average lately seems to be -/+ 25%. The worst thing a company can do is self insure. People don't pay enough attention to that. You do NOT want your employer having access to your medical records. permalink parent award report block reply\nAgent_86 2 points 3 days ago I guess that's good. When my wife was alive she had bcbs. So i hade her insurance but not anymore. After she passed away I retired. I got 3 dogs my son lives on his own. permalink parent award report block reply\n08G8GTsupercharged 1 points 3 days ago Holy shit. I pay 1462 for just me with 10k deductible. No dental or vision like the majority of us. Recently the insurance has denied a mri and ct scan to figure out why I've had really shitty headaches for the last 3 month almost nonstop. Insurance is just about worthless. permalink parent award report block reply Agent_86 1 points 3 days ago Its all a scam pretty much. I found out some drs prefer cash. Then the price of the procedure goes way down. permalink parent award report block reply\nAgent_86 1 points 3 days ago Its all a scam pretty much. I found out some drs prefer cash. Then the price of the procedure goes way down. permalink parent award report block reply\nHikedelics 1 points 3 days ago Keep the government shutdown for as long as it takes to choke those rat bastards out. Idgaf if that means 20 years, this can’t be allowed to continue. permalink award report block reply\nJimRaynor 1 points 3 days ago It’s in effect in European welfare countries The hardworking tax slaves are on mandatory healthcare insurance with high premiums, and are exploited by the lazy and the sick who pay nothing permalink award report block reply\ntaytaytay 1 points 3 days ago Yep, that about covers it permalink award report block reply\nPatriotPrep1775 1 points 3 days ago You have to vote on the bill before you can read what's in it. permalink award report block reply\nmateus 1 points 3 days ago The most important part: DEMOCRATS IN CONGRESS WANT EVERYONE (EXCEPT THEMSELVES) ON IT. How soon we forget: 2010 and how outraged Americans who were AWARE of the above, descended on Town Halls because they wanted to keep their private health care insurance. The Dems are still at it, and their agenda is to eliminate private health care amid current cries of how \"broken\" it is. Well, it isn't broken for everyone. My husband and I pay a reasonable premium, and are able to choose our own doctor/specialist if needed. We're certainly not the only ones in the U.S. to do so. And there's no need for the annual Obamacare clown show, where people get on line to search for a new plan. We've had the same employer plan for decades. So I'd think long and hard before getting on the \"U.S. health care is broken\" bandwagon. Unless, like us, you can afford to pay the fines you'll have to pay for not complying. Yes, that's another thing: when they started talking about fines (that Justice Roberts deemed a \"tax,\" so it was upheld) WE got busy and saved like crazy in an account dedicated to pay those fines, and to which we still contribute. Luckily, we never had to pay them. But should that scenario come around again, like all of the elites, we will also be able to pay that fine (tax) for non-compliance and, frankly, for concierge care, if necessary. NO ONE will be telling\nus what to do with regards to health care. So appreciate what you have while you have it. permalink award report block reply\nMajorClark 0 points 3 days ago Obama, Biden, Schumer and other corrupt politicians getting kickbacks in the millions. permalink award report block reply"}