{"id": "1ARK9irEAM", "contents": "381 BREAKING: Texas Attorney General Ken Paxton is suing the “JOLT” group for allegedly unlawfully registering illegals to vote in Texas posted 2 days ago by Mr_Rightside 6 comments award share download report block\n6 comments Sort by Top Top New Worst Old Save CleanUpPhillyTrump24 9 points 2 days ago Instead of suing, how about CHARGING THEM WITH THEIR CRIMES? permalink award report block reply MastaJoda 3 points 2 days ago The fact that you are forced to ask the obvious question is down right maddening. permalink parent award report block reply Mr_Rightside OP 6 points 2 days ago https://x.com/libsoftiktok/status/1987999315327951113 Attorney General Ken Paxton: I'm suing a radical organization for unlawfully registering illegals to vote in Texas. Any organization attempting to register illegals, who are all criminals, must be completely crushed and shut down immediately. Jolt Initiative was founded by Cristina Tzintzún Ramirez. She was featured on the site for the J.M. Kaplan Fund. She was also a failed Democrat candidate in the 2020 Texas Senate race From August 12, 2019 until March 3, 2020, Tzintzún Ramirez was a potential challenger to incumbent United States Senator John Cornyn in the 2020 United States Senate election in Texas as part of a twelve-person Democratic primary, in which she placed third. If you go on Jolt Initiatives website and look at Jolt History or Board of Directors under the About section it's been scrubbed and you're met with \"Oops! That page can’t be found.\" permalink award report block reply bill_in_texas 1 points 2 days ago The J.M. Kaplan fund, you say? permalink parent award report block reply Trooph-Hurts 6 points 2 days ago Open criminal investigation permalink award report block reply kamalas_knees 1 points 1 day ago JOLT cola was amazing. permalink award report block reply\nCleanUpPhillyTrump24 9 points 2 days ago Instead of suing, how about CHARGING THEM WITH THEIR CRIMES? permalink award report block reply MastaJoda 3 points 2 days ago The fact that you are forced to ask the obvious question is down right maddening. permalink parent award report block reply\nMastaJoda 3 points 2 days ago The fact that you are forced to ask the obvious question is down right maddening. permalink parent award report block reply\nMr_Rightside OP 6 points 2 days ago https://x.com/libsoftiktok/status/1987999315327951113 Attorney General Ken Paxton: I'm suing a radical organization for unlawfully registering illegals to vote in Texas. Any organization attempting to register illegals, who are all criminals, must be completely crushed and shut down immediately. Jolt Initiative was founded by Cristina Tzintzún Ramirez. She was featured on the site for the J.M. Kaplan Fund. She was also a failed Democrat candidate in the 2020 Texas Senate race From August 12, 2019 until March 3, 2020, Tzintzún Ramirez was a potential challenger to incumbent United States Senator John Cornyn in the 2020 United States Senate election in Texas as part of a twelve-person Democratic primary, in which she placed third. If you go on Jolt Initiatives website and look at Jolt History or Board of Directors under the About section it's been scrubbed and you're met with \"Oops! That page can’t be found.\" permalink award report block reply bill_in_texas 1 points 2 days ago The J.M. Kaplan fund, you say? permalink parent award report block reply\nbill_in_texas 1 points 2 days ago The J.M. Kaplan fund, you say? permalink parent award report block reply\nTrooph-Hurts 6 points 2 days ago Open criminal investigation permalink award report block reply\nkamalas_knees 1 points 1 day ago JOLT cola was amazing. permalink award report block reply"}