{"id": "1ARK9nQBMJ", "contents": "83 Jeet/Asia Fatigue at Costco posted 2 hours ago by XenogenUltra 18 comments award share report block I live in a large city in the hell that is Canada now. There is a Costco near my home that has slowly turned into an Indian Bizarre. Total chaos, no lines, no manners, stinks, clothing all a giant mess. Shoes all taken out of the boxes and not put back. A giant disaster. So we got fed up and decided to drive 30 minutes to the Costco that is in a suburb outside of the city, that was about 5 months ago. What an amazing experience, yes, mostly white, farmers, small town folk. Everyone polite, manners, not loud, not messy, not stinky. Felt like the 90's again. Well, it was fun while it lasted. Went with my wife on Saturday, uggh. Looks like the foreigners discovered it and decided to leave the Hell Costco in the city for the small town Costco. Now the small town Costco, is also a hell Costco, they all fled from themselves to infect the next untarnished place. They are like PARASITES.\n18 comments Sort by Top Top New Worst Old Save Elon Reveals the Real Reason He Walks Away From Trump Read More Ads by Ad.Style wharfthrowaway 7 points 2 hours ago That’s always been the plan. Locusts permalink award report block reply SHILL_DETECTOR 6 points 1 hour ago this is the default costco experience so many low iq people it makes me question if its not a straight up rip off sams club is pleasant permalink award report block reply Region 2 points 34 minutes ago Mine is the opposite. Costco is White middle class suburb people and Sam’s is the trailer park type people. permalink parent award report block reply RedStoneDeepState 1 points 36 minutes ago Sam's Club knows it's a wholesale Walmart. Lots of Mexicans at my local one but they are in and out. Food trucks is my guess. Costco targets \"families\". permalink parent award report block reply SHILL_DETECTOR 1 points 34 minutes ago costco is just full of foreigners here, and they are all rude as fuck and the place is way too packed samsclub is peaceful and clean costco isnt even that good of a deal on almost everything. permalink parent award report block reply RedStoneDeepState 1 points 33 minutes ago Completely agree. I have a Costco membership because I buy clothes and a small handful of products. That is it. Samsclub is clean. I wouldn't say peaceful but it's efficient. permalink parent award report block reply SHILL_DETECTOR 1 points 30 minutes ago all i buy at costco is feta and kalamata olives anymore i bought a 500 dollar cash card so i dont have to have a membership (had for 1 year) permalink parent award report block reply view 1 more comments... Region 3 points 36 minutes ago Point of fact.. they aren’t “like” parasites. permalink award report block reply Mintap 2 points 23 minutes ago Welcome to Costco, I love you. Welcome to Costco, I love you. ... permalink award report block reply GuerillaYourDreams 1 points 17 minutes ago The Deal Guy? 😊 permalink parent award report block reply Mintap 2 points 13 minutes ago No, Idiocracy: https://youtu.be/ZIFCWpn4qQ4?si=O6oVooFPItZ_-tYM permalink parent award report block reply GoldenEarz 2 points 33 minutes ago They are like PARASITES. Invasive species? permalink award report block reply sobriquet 3 points 27 minutes ago Bioweapon permalink parent award report block reply NazisWereSocialist 2 points 18 minutes ago Save the west, deport the rest permalink award report block reply Shaffro 2 points 1 hour ago Cockroaches. permalink award report block reply bluedevilga 1 points 43 minutes ago Like a virus permalink award report block reply magnokor 1 points 27 minutes ago Do not ask them what city, information is not required. Will let you know what city. Every one of them. Okay, probably not the French ones, as words like 'also Haitians and Algerians and Burkina Faso people' were not used. Close the borders, ban them all and their invasion and their 'religion' which is their form of government they impose on you, or be wiped out like England and Canada. Several years ago, given the Costco card.  After a few visits, and the Third World India/Pakistan hateful staff there, never went back. A store where you have to show all your papers to an angry person from Calcutta, no, not going. permalink award report block reply\nwharfthrowaway 7 points 2 hours ago That’s always been the plan. Locusts permalink award report block reply\nSHILL_DETECTOR 6 points 1 hour ago this is the default costco experience so many low iq people it makes me question if its not a straight up rip off sams club is pleasant permalink award report block reply Region 2 points 34 minutes ago Mine is the opposite. Costco is White middle class suburb people and Sam’s is the trailer park type people. permalink parent award report block reply RedStoneDeepState 1 points 36 minutes ago Sam's Club knows it's a wholesale Walmart. Lots of Mexicans at my local one but they are in and out. Food trucks is my guess. Costco targets \"families\". permalink parent award report block reply SHILL_DETECTOR 1 points 34 minutes ago costco is just full of foreigners here, and they are all rude as fuck and the place is way too packed samsclub is peaceful and clean costco isnt even that good of a deal on almost everything. permalink parent award report block reply RedStoneDeepState 1 points 33 minutes ago Completely agree. I have a Costco membership because I buy clothes and a small handful of products. That is it. Samsclub is clean. I wouldn't say peaceful but it's efficient. permalink parent award report block reply SHILL_DETECTOR 1 points 30 minutes ago all i buy at costco is feta and kalamata olives anymore i bought a 500 dollar cash card so i dont have to have a membership (had for 1 year) permalink parent award report block reply view 1 more comments...\nRegion 2 points 34 minutes ago Mine is the opposite. Costco is White middle class suburb people and Sam’s is the trailer park type people. permalink parent award report block reply\nRedStoneDeepState 1 points 36 minutes ago Sam's Club knows it's a wholesale Walmart. Lots of Mexicans at my local one but they are in and out. Food trucks is my guess. Costco targets \"families\". permalink parent award report block reply SHILL_DETECTOR 1 points 34 minutes ago costco is just full of foreigners here, and they are all rude as fuck and the place is way too packed samsclub is peaceful and clean costco isnt even that good of a deal on almost everything. permalink parent award report block reply RedStoneDeepState 1 points 33 minutes ago Completely agree. I have a Costco membership because I buy clothes and a small handful of products. That is it. Samsclub is clean. I wouldn't say peaceful but it's efficient. permalink parent award report block reply SHILL_DETECTOR 1 points 30 minutes ago all i buy at costco is feta and kalamata olives anymore i bought a 500 dollar cash card so i dont have to have a membership (had for 1 year) permalink parent award report block reply view 1 more comments...\nSHILL_DETECTOR 1 points 34 minutes ago costco is just full of foreigners here, and they are all rude as fuck and the place is way too packed samsclub is peaceful and clean costco isnt even that good of a deal on almost everything. permalink parent award report block reply RedStoneDeepState 1 points 33 minutes ago Completely agree. I have a Costco membership because I buy clothes and a small handful of products. That is it. Samsclub is clean. I wouldn't say peaceful but it's efficient. permalink parent award report block reply SHILL_DETECTOR 1 points 30 minutes ago all i buy at costco is feta and kalamata olives anymore i bought a 500 dollar cash card so i dont have to have a membership (had for 1 year) permalink parent award report block reply view 1 more comments...\nRedStoneDeepState 1 points 33 minutes ago Completely agree. I have a Costco membership because I buy clothes and a small handful of products. That is it. Samsclub is clean. I wouldn't say peaceful but it's efficient. permalink parent award report block reply SHILL_DETECTOR 1 points 30 minutes ago all i buy at costco is feta and kalamata olives anymore i bought a 500 dollar cash card so i dont have to have a membership (had for 1 year) permalink parent award report block reply view 1 more comments...\nSHILL_DETECTOR 1 points 30 minutes ago all i buy at costco is feta and kalamata olives anymore i bought a 500 dollar cash card so i dont have to have a membership (had for 1 year) permalink parent award report block reply view 1 more comments...\nRegion 3 points 36 minutes ago Point of fact.. they aren’t “like” parasites. permalink award report block reply\nMintap 2 points 23 minutes ago Welcome to Costco, I love you. Welcome to Costco, I love you. ... permalink award report block reply GuerillaYourDreams 1 points 17 minutes ago The Deal Guy? 😊 permalink parent award report block reply Mintap 2 points 13 minutes ago No, Idiocracy: https://youtu.be/ZIFCWpn4qQ4?si=O6oVooFPItZ_-tYM permalink parent award report block reply\nGuerillaYourDreams 1 points 17 minutes ago The Deal Guy? 😊 permalink parent award report block reply Mintap 2 points 13 minutes ago No, Idiocracy: https://youtu.be/ZIFCWpn4qQ4?si=O6oVooFPItZ_-tYM permalink parent award report block reply\nMintap 2 points 13 minutes ago No, Idiocracy: https://youtu.be/ZIFCWpn4qQ4?si=O6oVooFPItZ_-tYM permalink parent award report block reply\nGoldenEarz 2 points 33 minutes ago They are like PARASITES. Invasive species? permalink award report block reply sobriquet 3 points 27 minutes ago Bioweapon permalink parent award report block reply\nsobriquet 3 points 27 minutes ago Bioweapon permalink parent award report block reply\nNazisWereSocialist 2 points 18 minutes ago Save the west, deport the rest permalink award report block reply\nShaffro 2 points 1 hour ago Cockroaches. permalink award report block reply\nbluedevilga 1 points 43 minutes ago Like a virus permalink award report block reply\nmagnokor 1 points 27 minutes ago Do not ask them what city, information is not required. Will let you know what city. Every one of them. Okay, probably not the French ones, as words like 'also Haitians and Algerians and Burkina Faso people' were not used. Close the borders, ban them all and their invasion and their 'religion' which is their form of government they impose on you, or be wiped out like England and Canada. Several years ago, given the Costco card.  After a few visits, and the Third World India/Pakistan hateful staff there, never went back. A store where you have to show all your papers to an angry person from Calcutta, no, not going. permalink award report block reply"}