{"id": "1ARK9pfsGr", "contents": "18 C'mon bro please bro just one look dude I need it bad fr fr fr posted 5 hours ago by FearGodTheAlmighty 7 comments award share download report block\n7 comments Sort by Top Top New Worst Old Save FearGodTheAlmighty OP 2 points 5 hours ago 💀💀💀 permalink award report block reply 47urOFH3d 1 points 4 hours ago \"I want to know what's in the syringe, and I want to know what's in the files.\" \"LOL, what a sheep!\" permalink award report block reply FearGodTheAlmighty OP 0 points 4 hours ago I need both bro! permalink parent award report block reply UH60MAGA 1 points 5 hours ago D: \"sure.\" P: \"really? Just like that?\" D: \"this was cyanide you idiot. LMAO.\" permalink award report block reply FearGodTheAlmighty OP 1 points 5 hours ago Why are NPCs addicted to things they don't understand? permalink parent award report block reply Darkpoisonousshaddow 1 points 4 hours ago Such as? permalink parent award report block reply FearGodTheAlmighty OP 0 points 4 hours ago \"C'mon man\" permalink parent award report block reply\nFearGodTheAlmighty OP 2 points 5 hours ago 💀💀💀 permalink award report block reply\n47urOFH3d 1 points 4 hours ago \"I want to know what's in the syringe, and I want to know what's in the files.\" \"LOL, what a sheep!\" permalink award report block reply FearGodTheAlmighty OP 0 points 4 hours ago I need both bro! permalink parent award report block reply\nFearGodTheAlmighty OP 0 points 4 hours ago I need both bro! permalink parent award report block reply\nUH60MAGA 1 points 5 hours ago D: \"sure.\" P: \"really? Just like that?\" D: \"this was cyanide you idiot. LMAO.\" permalink award report block reply FearGodTheAlmighty OP 1 points 5 hours ago Why are NPCs addicted to things they don't understand? permalink parent award report block reply Darkpoisonousshaddow 1 points 4 hours ago Such as? permalink parent award report block reply FearGodTheAlmighty OP 0 points 4 hours ago \"C'mon man\" permalink parent award report block reply\nFearGodTheAlmighty OP 1 points 5 hours ago Why are NPCs addicted to things they don't understand? permalink parent award report block reply Darkpoisonousshaddow 1 points 4 hours ago Such as? permalink parent award report block reply FearGodTheAlmighty OP 0 points 4 hours ago \"C'mon man\" permalink parent award report block reply\nDarkpoisonousshaddow 1 points 4 hours ago Such as? permalink parent award report block reply FearGodTheAlmighty OP 0 points 4 hours ago \"C'mon man\" permalink parent award report block reply\nFearGodTheAlmighty OP 0 points 4 hours ago \"C'mon man\" permalink parent award report block reply"}