{"id": "1ARK9mHn2T", "contents": "176 Another judge Exceeding his authority (www.thegatewaypundit.com) posted 9 hours ago by Grindelwald 9 comments award share report block Biden-Appointed Judge Poised to Order Mass Release of Illegal Aliens Detained in ICE’s “Operation Blitz” — Thousands Could Be Du... In yet another blow to immigration enforcement, a federal judge in Illinois is reportedly preparing to order the mass release of thousands of illegal aliens detained during ICE’s “Operation Blitz,” a nationwide crackdown on criminal and repeat im... www.thegatewaypundit.com\n9 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style ChyNahAzzWhole1 6 points 8 hours ago Fuck no. Start the impeachment process! permalink award report block reply Nutt_bugget 5 points 8 hours ago How about \"No.\" How does that sound? permalink award report block reply Trooph-Hurts 3 points 9 hours ago I can see the pedo in the eyes permalink award report block reply friarfox 2 points 7 hours ago If that were to happen, Trump may as well take his retirement and go golfing at this point because it's over and done. Stick a fork in it. permalink award report block reply greatpumpkin 1 points 3 hours ago Transfer all arrested IL illegals to FL immediately after processing? Re-arrest and transfer to FL immediately after O'Biden-judge order? Arrest O'Biden-judge for interfering with ongoing police action? permalink award report block reply HeatherSwanson 1 points 7 hours ago Cock sucker lips, naggerz skin, stoner smile, faggot smile, DEI degree. Yup. Biden appointee permalink award report block reply Throwingway22 1 points 7 hours ago A judge's authority is what he's allowed to get away with. If the admin releases thousands back into the community, that's on them at this point. Crooked judges are baked into the cake. permalink award report block reply radicalyoldfashioned 1 points 3 hours ago Is he one of the kings so many people are protesting against? permalink award report block reply\nChyNahAzzWhole1 6 points 8 hours ago Fuck no. Start the impeachment process! permalink award report block reply\nNutt_bugget 5 points 8 hours ago How about \"No.\" How does that sound? permalink award report block reply\nTrooph-Hurts 3 points 9 hours ago I can see the pedo in the eyes permalink award report block reply\nfriarfox 2 points 7 hours ago If that were to happen, Trump may as well take his retirement and go golfing at this point because it's over and done. Stick a fork in it. permalink award report block reply\ngreatpumpkin 1 points 3 hours ago Transfer all arrested IL illegals to FL immediately after processing? Re-arrest and transfer to FL immediately after O'Biden-judge order? Arrest O'Biden-judge for interfering with ongoing police action? permalink award report block reply\nHeatherSwanson 1 points 7 hours ago Cock sucker lips, naggerz skin, stoner smile, faggot smile, DEI degree. Yup. Biden appointee permalink award report block reply\nThrowingway22 1 points 7 hours ago A judge's authority is what he's allowed to get away with. If the admin releases thousands back into the community, that's on them at this point. Crooked judges are baked into the cake. permalink award report block reply\nradicalyoldfashioned 1 points 3 hours ago Is he one of the kings so many people are protesting against? permalink award report block reply"}