{"id": "1ARK9oXkrg", "contents": "159 \"I find it INTERESTING all these countries want us to send nuclear-capable Tomahawk missiles to defend Europe. But when the United States positions aircraft carriers in OUR hemisphere, where we live, somehow that's a PROBLEM!\" posted 14 hours ago by PiratePatriotParrot 3 comments award share report block Eric Daugherty @EricLDaugh • 16h 🚨 HOLY CRAP! Sec. Marco Rubio DROPS THE MIC on the EU accusing President Trump of violating \"international law\" by striking narco-terrorists \"I find it INTERESTING all these countries want us to send nuclear-capable Tomahawk missiles to defend Europe. But when the United States\n3 comments Sort by Top Top New Worst Old Save PiratePatriotParrot OP 3 points 14 hours ago \"🚨 HOLY CRAP! Sec. Marco Rubio DROPS THE MIC on the EU accusing President Trump of violating \"international law\" by striking narco-terrorists \"I find it INTERESTING all these countries want us to send nuclear-capable Tomahawk missiles to defend Europe. But when the United States positions aircraft carriers in OUR hemisphere, where we live, somehow that's a PROBLEM!\" BOOM 🔥🔥🔥 \"I don't think that the European Union gets to determine what international law is. They CERTAINLY don't get to determine how the United States defends its national security!\" \"The United States is under attack from organized, criminal narco-terrorists in our hemisphere - and the president is responding in the DEFENSE of our country.\" \"So I would say that the United States and this president has made very clear his job is to protect the United States from threats against the United States...and THAT is what he's doing in this operation.\" BIG MARCO UNLEASHED.\" permalink award report block reply henri_derelicte 1 points 14 hours ago Tomahawks haven’t been nuclear-capable in years permalink award report block reply perma-maga 1 points 14 hours ago European governments think too highly of themselves. permalink award report block reply suckmycorona 1 points 13 hours ago Imagine if you had a male instead of a female in many of trumps appointed positions.  Shit would be getting done but instead we replaced swamp donkey pence with Siles and Blondi. permalink award report block reply\nPiratePatriotParrot OP 3 points 14 hours ago \"🚨 HOLY CRAP! Sec. Marco Rubio DROPS THE MIC on the EU accusing President Trump of violating \"international law\" by striking narco-terrorists \"I find it INTERESTING all these countries want us to send nuclear-capable Tomahawk missiles to defend Europe. But when the United States positions aircraft carriers in OUR hemisphere, where we live, somehow that's a PROBLEM!\" BOOM 🔥🔥🔥 \"I don't think that the European Union gets to determine what international law is. They CERTAINLY don't get to determine how the United States defends its national security!\" \"The United States is under attack from organized, criminal narco-terrorists in our hemisphere - and the president is responding in the DEFENSE of our country.\" \"So I would say that the United States and this president has made very clear his job is to protect the United States from threats against the United States...and THAT is what he's doing in this operation.\" BIG MARCO UNLEASHED.\" permalink award report block reply\nhenri_derelicte 1 points 14 hours ago Tomahawks haven’t been nuclear-capable in years permalink award report block reply\nperma-maga 1 points 14 hours ago European governments think too highly of themselves. permalink award report block reply\nsuckmycorona 1 points 13 hours ago Imagine if you had a male instead of a female in many of trumps appointed positions.  Shit would be getting done but instead we replaced swamp donkey pence with Siles and Blondi. permalink award report block reply"}