{"id": "1ARK9oWvJr", "contents": "18 🔴Simmer down, Panicans!\n\nFirst you were tariff experts.\n\nThen Iran experts.\n\nThen immigrant employment experts.\n\nThen Narcoterrorist experts.\n\nThen mortgage experts.\n\nAnd now you’re China trade deal experts?\n\nI am going to have faith in the man I trusted enough to vote for.\n\nI support Trump. 🧠  STABLE GENIUS  🧠 posted 2 hours ago by DeusVult1096 11 comments award share download report block\n11 comments Sort by Top Top New Worst Old Save Around the Web Hair Will Grow Back! No Matter How Severe The Baldness HaloGrow SpeekFreely 9 points 1 hour ago We’re living life on the fuckin streets first hand, so yeh we’re experts at this. permalink award report block reply patrioticwinning3 2 points 13 minutes ago Speaking of living life in the streets, while foriegners are imported to take American jobs and American places in American collages, did you know influencers are now getting paid $3-5k PER POST for \"pro-h1b\" content?  I wonder how OP is going to spend his blood money :p https://x.com/Will_Panic/status/1988676599303270490 permalink parent award report block reply Trooph-Hurts 7 points 1 hour ago No deal until this administration starts doing things for us and undoing the things and everything that has happened to us. So you can talk about all of the intangible of futuristic bull crap that we’re supposed to like cross our fingers on, but we’ve already crossed our fingers and we’re already getting screwed! permalink award report block reply patrioticwinning3 2 points 10 minutes ago Trump is pushing the lies that Americans don't want and are too lazy to go to college and do the jobs.  Over a million US tech workers have been laid off in favor of importing cheaper labor or outsourcing cheaper labor!  These are also the same talking points that the left used for ILLEGAL ALIENS! Now \"someone\" is offering influencers $3-5k PER POST for \"pro-h1b\" content.  I wonder how OP will spend his :p permalink parent award report block reply Mulletgunning 6 points 59 minutes ago Get BBs cock out of your mouth. Worthless gargoyle loving faggot. Im really starting to believe its Bill Mitchell running this account. If not,he sure likes getting splooged  daily for Israel just like that Universal faggot. MAGA AF permalink award report block reply covfefe77 4 points 1 hour ago maybe chyna would like 600K u.s. 'students' permalink award report block reply AynRand22 1 points 33 minutes ago It's called common sense. permalink award report block reply Awakened 1 points 2 minutes ago Waiting has only gotten us fucked in the past. If you want to win the midterms you better start screaming your lungs out in the hope he reverses course. And only a complete faggot uses the term 'panican'. Like Bill Mitchell level fagottry. permalink award report block reply SpaceWizard -1 points 58 minutes ago 💯 permalink award report block reply henri_derelicte -4 points 2 hours ago How soon until they’re Venezuela experts? Asking for a fren permalink award report block reply YaharaRiver -7 points 1 hour ago Excellent post 😆👍✨ permalink award report block reply\nSpeekFreely 9 points 1 hour ago We’re living life on the fuckin streets first hand, so yeh we’re experts at this. permalink award report block reply patrioticwinning3 2 points 13 minutes ago Speaking of living life in the streets, while foriegners are imported to take American jobs and American places in American collages, did you know influencers are now getting paid $3-5k PER POST for \"pro-h1b\" content?  I wonder how OP is going to spend his blood money :p https://x.com/Will_Panic/status/1988676599303270490 permalink parent award report block reply\npatrioticwinning3 2 points 13 minutes ago Speaking of living life in the streets, while foriegners are imported to take American jobs and American places in American collages, did you know influencers are now getting paid $3-5k PER POST for \"pro-h1b\" content?  I wonder how OP is going to spend his blood money :p https://x.com/Will_Panic/status/1988676599303270490 permalink parent award report block reply\nTrooph-Hurts 7 points 1 hour ago No deal until this administration starts doing things for us and undoing the things and everything that has happened to us. So you can talk about all of the intangible of futuristic bull crap that we’re supposed to like cross our fingers on, but we’ve already crossed our fingers and we’re already getting screwed! permalink award report block reply patrioticwinning3 2 points 10 minutes ago Trump is pushing the lies that Americans don't want and are too lazy to go to college and do the jobs.  Over a million US tech workers have been laid off in favor of importing cheaper labor or outsourcing cheaper labor!  These are also the same talking points that the left used for ILLEGAL ALIENS! Now \"someone\" is offering influencers $3-5k PER POST for \"pro-h1b\" content.  I wonder how OP will spend his :p permalink parent award report block reply\npatrioticwinning3 2 points 10 minutes ago Trump is pushing the lies that Americans don't want and are too lazy to go to college and do the jobs.  Over a million US tech workers have been laid off in favor of importing cheaper labor or outsourcing cheaper labor!  These are also the same talking points that the left used for ILLEGAL ALIENS! Now \"someone\" is offering influencers $3-5k PER POST for \"pro-h1b\" content.  I wonder how OP will spend his :p permalink parent award report block reply\nMulletgunning 6 points 59 minutes ago Get BBs cock out of your mouth. Worthless gargoyle loving faggot. Im really starting to believe its Bill Mitchell running this account. If not,he sure likes getting splooged  daily for Israel just like that Universal faggot. MAGA AF permalink award report block reply\ncovfefe77 4 points 1 hour ago maybe chyna would like 600K u.s. 'students' permalink award report block reply\nAynRand22 1 points 33 minutes ago It's called common sense. permalink award report block reply\nAwakened 1 points 2 minutes ago Waiting has only gotten us fucked in the past. If you want to win the midterms you better start screaming your lungs out in the hope he reverses course. And only a complete faggot uses the term 'panican'. Like Bill Mitchell level fagottry. permalink award report block reply\nSpaceWizard -1 points 58 minutes ago 💯 permalink award report block reply\nhenri_derelicte -4 points 2 hours ago How soon until they’re Venezuela experts? Asking for a fren permalink award report block reply\nYaharaRiver -7 points 1 hour ago Excellent post 😆👍✨ permalink award report block reply"}