{"id": "1ARK5BHQBO", "contents": "1127 GN, Frens... posted 3 days ago by KuzoKevin 34 comments award share download report block\n34 comments Sort by Top Top New Worst Old Save Around the Web 1 Simple Hack to Cut Your Electric Bill (Try Tonight) GadgetCyno SavingPrivateGrace 21 points 3 days ago Good Night 🐸 permalink award report block reply Spindle-spin 8 points 3 days ago Government back in business, Trump wins again, and Congress gets back to work tomorrow Here's hoping we finally wake up to the Epstein files getting released tomorrow. About damn time. permalink parent award report block reply MediaBro 4 points 3 days ago Those files aren't getting released, especially not after they showed you that they can manipulate shit with AI. Anyone getting exposed will claim the list is doctored at this point. The raid on the Island told you they've taken stuff away. There will be no files released. permalink parent award report block reply WhatsFappening 1 points 3 days ago Locked away with the Ark of the Covenant. permalink parent award report block reply Klaus73 1 points 2 days ago Coming next Fall \"Indiana Jones and the portfolio of pedos.\" permalink parent award report block reply Klaus73 2 points 2 days ago \"Good night Stalin, Good night Marx; Shall the homeless be homeless as they shit in your parks.\"\n\"Good night Lenin, Good night Mao. I bet your all feeling pretty stupid now.\"\n\"Good night Castro, Good night Che. I wonder why the overwhelming amount of your political adherrants are gay.\"\n\"Good night Trotsky, Good night Pol Pot; If America is to survive then your failures should never be forgot.\" permalink parent award report block reply SavingPrivateGrace 1 points 2 days ago Lights out commies! permalink parent award report block reply FlushFive 14 points 3 days ago But thay wasnt real communism permalink award report block reply bigdickhangsright 6 points 3 days ago It's funny how leftist utopias are always attempted on the backs of capitalists they despise so much. Why can't they go to Mars and start their fantasy land fresh? permalink parent award report block reply yukondave 2 points 3 days ago Your first mistake is the use of the word \"leftists\".    I think you wanted to say \"communist\".   Lenin and Marx both said you must destroy capitalism with socialism before you can usher in Communist Utopia. permalink parent award report block reply MI_MAGA 2 points 3 days ago They’d have to get there first. And there are no free rides to Mars. So no, they can only live parasitically on the backs of actual working people and businesses. They do not exist in a vacuum because there is nothing already created ready to be stolen. permalink parent award report block reply Leeboscan 2 points 3 days ago Even right down to Marx himself. Makes you think doesn't it? permalink parent award report block reply yukondave 1 points 3 days ago \"This time it will be different\" Photo of Antifa flag outside of Communist Headquarters in 1932 Germany. Karl-Liebknecht-Haus https://en.wikipedia.org/wiki/Karl-Liebknecht-Haus#/media/File:Bundesarchiv_Bild_183-09424-0006,_Berlin,_Karl-Liebknecht-Haus_am_Tag_der_Reichstagswahl.jpg permalink parent award report block reply sordfysh PRO 1 points 3 days ago The communists are always hoping for a benevolent dictator. The only truly benevolent king is the Lord Jesus Christ. And Jesus makes a place in His Kingdom for people who truly want some holy form of communism. It's talked about in Acts 2 as a very holy way to live. permalink parent award report block reply Friendly_B 2 points 2 days ago holy form of communism. It's talked about in Acts 2 It absolutely is not. Acts 2 does not mention communism.  What it is describing is wealthy people (and some maybe not as wealthy) CHOOSING to give of their wealth to share it around among people. That's not Communism, it's charity.  Capitalists already do this. Communism would have been if the Apostles got a bunch of swords and worked for the Roman tax collectors, going door to door taking people's money from them.  Then they would build a palace and feed poor people from the back porch with what ever was left over from lunch. Communism requires godlessness.  It is a Luciferian doctrine. Acts 2 44 And all that believed were together, and had all things common; 45 And sold their possessions and goods, and parted them to all men, as every man had need. 46 And they, continuing daily with one accord in the temple, and breaking bread from house to house, did eat their meat with gladness and singleness of heart, permalink parent award report block reply sordfysh PRO 1 points 1 day ago Communism isn't determined by its name. It's determined by what it is. Communism is based on the \"commune\". The group of people in Acts 2 were what we call a commune today. And communism isn't defined by taking money and property because they are not unique in that. It's how they say they will distribute it. If government forcing people to give their money and property is communism, then we already live in communism and so does the rest of the Western world. But also, you say capitalists already live like the people in Acts 2. Show me one group of people that lives like that who are known as capitalists. permalink parent award report block reply Lol_Garrus 12 points 3 days ago \"Oooops, burnt the souffle again!\" permalink award report block reply Neonentity 5 points 3 days ago And after breaking all those peop- uh -EGGS, too! permalink parent award report block reply AdmrlNelson 8 points 3 days ago It's by Thaddeus Trenchant if anyone is interested. Amazon link permalink award report block reply bigdickhangsright 1 points 3 days ago 3.3 and no reviews --- the cowards. It has no reviews on Goodreads. I'd read it but I suspect that those commies disallow you from leaving a review or score. permalink parent award report block reply CaliAli 7 points 3 days ago Epilogue: And 148 million died permalink award report block reply TrumpWonByALandslide 6 points 3 days ago Who's the lucky bastard who made it to tell the tale? permalink award report block reply Aquamine-Amarine 6 points 3 days ago There needs to be a patriot book club around here. Recommendations would include not woke fictional novels, nonfiction books, etc. I stopped reading young adult novels a long time ago when it started to become woke cringy garbage. permalink award report block reply Roadpower 2 points 3 days ago Early philosophical works are what I would strongly recommend, especially for very young children. My mother had me reading such things by the time I was four to six years old. Aesop Fables, Grim's Fairly tales, Animal Farm et al. Philosophy is the basis of a critical mind. permalink parent award report block reply Klaus73 1 points 2 days ago A really good fantasy series I suggest is Joe Abercrombies stuff - the First Law and the shit ton of books in the setting are really good reads and not jammed full of woke shit. permalink parent award report block reply awsure 4 points 3 days ago They just didn’t do it right permalink award report block reply AR_MAGA 3 points 3 days ago But it'll be always a small amount  of idiots who believe that they'll make it work and a huge amount of powerful people who brainwashed the others to start over and over again. permalink award report block reply fu-greta 2 points 3 days ago But it's gonna work next time! permalink award report block reply Dangerous 1 points 3 days ago \"Talk about abbreviated, there aren't even any pages in this thing!\" permalink award report block reply Hanging_Chad 1 points 3 days ago kek. GN permalink award report block reply I_Love_45-70_Gov 1 points 3 days ago Thumbnail looks like a confused face. 👍👍 permalink award report block reply Nomad899 1 points 3 days ago I know a few who need to read this book permalink award report block reply RogueLeaderX 1 points 3 days ago New yorkers are about to learn this lesson. permalink award report block reply Megaboom2025 1 points 3 days ago Depends on if you’re the ruling class or the slave class permalink award report block reply\nSavingPrivateGrace 21 points 3 days ago Good Night 🐸 permalink award report block reply Spindle-spin 8 points 3 days ago Government back in business, Trump wins again, and Congress gets back to work tomorrow Here's hoping we finally wake up to the Epstein files getting released tomorrow. About damn time. permalink parent award report block reply MediaBro 4 points 3 days ago Those files aren't getting released, especially not after they showed you that they can manipulate shit with AI. Anyone getting exposed will claim the list is doctored at this point. The raid on the Island told you they've taken stuff away. There will be no files released. permalink parent award report block reply WhatsFappening 1 points 3 days ago Locked away with the Ark of the Covenant. permalink parent award report block reply Klaus73 1 points 2 days ago Coming next Fall \"Indiana Jones and the portfolio of pedos.\" permalink parent award report block reply Klaus73 2 points 2 days ago \"Good night Stalin, Good night Marx; Shall the homeless be homeless as they shit in your parks.\"\n\"Good night Lenin, Good night Mao. I bet your all feeling pretty stupid now.\"\n\"Good night Castro, Good night Che. I wonder why the overwhelming amount of your political adherrants are gay.\"\n\"Good night Trotsky, Good night Pol Pot; If America is to survive then your failures should never be forgot.\" permalink parent award report block reply SavingPrivateGrace 1 points 2 days ago Lights out commies! permalink parent award report block reply\nSpindle-spin 8 points 3 days ago Government back in business, Trump wins again, and Congress gets back to work tomorrow Here's hoping we finally wake up to the Epstein files getting released tomorrow. About damn time. permalink parent award report block reply MediaBro 4 points 3 days ago Those files aren't getting released, especially not after they showed you that they can manipulate shit with AI. Anyone getting exposed will claim the list is doctored at this point. The raid on the Island told you they've taken stuff away. There will be no files released. permalink parent award report block reply WhatsFappening 1 points 3 days ago Locked away with the Ark of the Covenant. permalink parent award report block reply Klaus73 1 points 2 days ago Coming next Fall \"Indiana Jones and the portfolio of pedos.\" permalink parent award report block reply\nMediaBro 4 points 3 days ago Those files aren't getting released, especially not after they showed you that they can manipulate shit with AI. Anyone getting exposed will claim the list is doctored at this point. The raid on the Island told you they've taken stuff away. There will be no files released. permalink parent award report block reply WhatsFappening 1 points 3 days ago Locked away with the Ark of the Covenant. permalink parent award report block reply Klaus73 1 points 2 days ago Coming next Fall \"Indiana Jones and the portfolio of pedos.\" permalink parent award report block reply\nWhatsFappening 1 points 3 days ago Locked away with the Ark of the Covenant. permalink parent award report block reply Klaus73 1 points 2 days ago Coming next Fall \"Indiana Jones and the portfolio of pedos.\" permalink parent award report block reply\nKlaus73 1 points 2 days ago Coming next Fall \"Indiana Jones and the portfolio of pedos.\" permalink parent award report block reply\nKlaus73 2 points 2 days ago \"Good night Stalin, Good night Marx; Shall the homeless be homeless as they shit in your parks.\"\n\"Good night Lenin, Good night Mao. I bet your all feeling pretty stupid now.\"\n\"Good night Castro, Good night Che. I wonder why the overwhelming amount of your political adherrants are gay.\"\n\"Good night Trotsky, Good night Pol Pot; If America is to survive then your failures should never be forgot.\" permalink parent award report block reply SavingPrivateGrace 1 points 2 days ago Lights out commies! permalink parent award report block reply\nSavingPrivateGrace 1 points 2 days ago Lights out commies! permalink parent award report block reply\nFlushFive 14 points 3 days ago But thay wasnt real communism permalink award report block reply bigdickhangsright 6 points 3 days ago It's funny how leftist utopias are always attempted on the backs of capitalists they despise so much. Why can't they go to Mars and start their fantasy land fresh? permalink parent award report block reply yukondave 2 points 3 days ago Your first mistake is the use of the word \"leftists\".    I think you wanted to say \"communist\".   Lenin and Marx both said you must destroy capitalism with socialism before you can usher in Communist Utopia. permalink parent award report block reply MI_MAGA 2 points 3 days ago They’d have to get there first. And there are no free rides to Mars. So no, they can only live parasitically on the backs of actual working people and businesses. They do not exist in a vacuum because there is nothing already created ready to be stolen. permalink parent award report block reply Leeboscan 2 points 3 days ago Even right down to Marx himself. Makes you think doesn't it? permalink parent award report block reply yukondave 1 points 3 days ago \"This time it will be different\" Photo of Antifa flag outside of Communist Headquarters in 1932 Germany. Karl-Liebknecht-Haus https://en.wikipedia.org/wiki/Karl-Liebknecht-Haus#/media/File:Bundesarchiv_Bild_183-09424-0006,_Berlin,_Karl-Liebknecht-Haus_am_Tag_der_Reichstagswahl.jpg permalink parent award report block reply sordfysh PRO 1 points 3 days ago The communists are always hoping for a benevolent dictator. The only truly benevolent king is the Lord Jesus Christ. And Jesus makes a place in His Kingdom for people who truly want some holy form of communism. It's talked about in Acts 2 as a very holy way to live. permalink parent award report block reply Friendly_B 2 points 2 days ago holy form of communism. It's talked about in Acts 2 It absolutely is not. Acts 2 does not mention communism.  What it is describing is wealthy people (and some maybe not as wealthy) CHOOSING to give of their wealth to share it around among people. That's not Communism, it's charity.  Capitalists already do this. Communism would have been if the Apostles got a bunch of swords and worked for the Roman tax collectors, going door to door taking people's money from them.  Then they would build a palace and feed poor people from the back porch with what ever was left over from lunch. Communism requires godlessness.  It is a Luciferian doctrine. Acts 2 44 And all that believed were together, and had all things common; 45 And sold their possessions and goods, and parted them to all men, as every man had need. 46 And they, continuing daily with one accord in the temple, and breaking bread from house to house, did eat their meat with gladness and singleness of heart, permalink parent award report block reply sordfysh PRO 1 points 1 day ago Communism isn't determined by its name. It's determined by what it is. Communism is based on the \"commune\". The group of people in Acts 2 were what we call a commune today. And communism isn't defined by taking money and property because they are not unique in that. It's how they say they will distribute it. If government forcing people to give their money and property is communism, then we already live in communism and so does the rest of the Western world. But also, you say capitalists already live like the people in Acts 2. Show me one group of people that lives like that who are known as capitalists. permalink parent award report block reply\nbigdickhangsright 6 points 3 days ago It's funny how leftist utopias are always attempted on the backs of capitalists they despise so much. Why can't they go to Mars and start their fantasy land fresh? permalink parent award report block reply yukondave 2 points 3 days ago Your first mistake is the use of the word \"leftists\".    I think you wanted to say \"communist\".   Lenin and Marx both said you must destroy capitalism with socialism before you can usher in Communist Utopia. permalink parent award report block reply MI_MAGA 2 points 3 days ago They’d have to get there first. And there are no free rides to Mars. So no, they can only live parasitically on the backs of actual working people and businesses. They do not exist in a vacuum because there is nothing already created ready to be stolen. permalink parent award report block reply Leeboscan 2 points 3 days ago Even right down to Marx himself. Makes you think doesn't it? permalink parent award report block reply\nyukondave 2 points 3 days ago Your first mistake is the use of the word \"leftists\".    I think you wanted to say \"communist\".   Lenin and Marx both said you must destroy capitalism with socialism before you can usher in Communist Utopia. permalink parent award report block reply\nMI_MAGA 2 points 3 days ago They’d have to get there first. And there are no free rides to Mars. So no, they can only live parasitically on the backs of actual working people and businesses. They do not exist in a vacuum because there is nothing already created ready to be stolen. permalink parent award report block reply\nLeeboscan 2 points 3 days ago Even right down to Marx himself. Makes you think doesn't it? permalink parent award report block reply\nyukondave 1 points 3 days ago \"This time it will be different\" Photo of Antifa flag outside of Communist Headquarters in 1932 Germany. Karl-Liebknecht-Haus https://en.wikipedia.org/wiki/Karl-Liebknecht-Haus#/media/File:Bundesarchiv_Bild_183-09424-0006,_Berlin,_Karl-Liebknecht-Haus_am_Tag_der_Reichstagswahl.jpg permalink parent award report block reply\nsordfysh PRO 1 points 3 days ago The communists are always hoping for a benevolent dictator. The only truly benevolent king is the Lord Jesus Christ. And Jesus makes a place in His Kingdom for people who truly want some holy form of communism. It's talked about in Acts 2 as a very holy way to live. permalink parent award report block reply Friendly_B 2 points 2 days ago holy form of communism. It's talked about in Acts 2 It absolutely is not. Acts 2 does not mention communism.  What it is describing is wealthy people (and some maybe not as wealthy) CHOOSING to give of their wealth to share it around among people. That's not Communism, it's charity.  Capitalists already do this. Communism would have been if the Apostles got a bunch of swords and worked for the Roman tax collectors, going door to door taking people's money from them.  Then they would build a palace and feed poor people from the back porch with what ever was left over from lunch. Communism requires godlessness.  It is a Luciferian doctrine. Acts 2 44 And all that believed were together, and had all things common; 45 And sold their possessions and goods, and parted them to all men, as every man had need. 46 And they, continuing daily with one accord in the temple, and breaking bread from house to house, did eat their meat with gladness and singleness of heart, permalink parent award report block reply sordfysh PRO 1 points 1 day ago Communism isn't determined by its name. It's determined by what it is. Communism is based on the \"commune\". The group of people in Acts 2 were what we call a commune today. And communism isn't defined by taking money and property because they are not unique in that. It's how they say they will distribute it. If government forcing people to give their money and property is communism, then we already live in communism and so does the rest of the Western world. But also, you say capitalists already live like the people in Acts 2. Show me one group of people that lives like that who are known as capitalists. permalink parent award report block reply\nFriendly_B 2 points 2 days ago holy form of communism. It's talked about in Acts 2 It absolutely is not. Acts 2 does not mention communism.  What it is describing is wealthy people (and some maybe not as wealthy) CHOOSING to give of their wealth to share it around among people. That's not Communism, it's charity.  Capitalists already do this. Communism would have been if the Apostles got a bunch of swords and worked for the Roman tax collectors, going door to door taking people's money from them.  Then they would build a palace and feed poor people from the back porch with what ever was left over from lunch. Communism requires godlessness.  It is a Luciferian doctrine. Acts 2 44 And all that believed were together, and had all things common; 45 And sold their possessions and goods, and parted them to all men, as every man had need. 46 And they, continuing daily with one accord in the temple, and breaking bread from house to house, did eat their meat with gladness and singleness of heart, permalink parent award report block reply sordfysh PRO 1 points 1 day ago Communism isn't determined by its name. It's determined by what it is. Communism is based on the \"commune\". The group of people in Acts 2 were what we call a commune today. And communism isn't defined by taking money and property because they are not unique in that. It's how they say they will distribute it. If government forcing people to give their money and property is communism, then we already live in communism and so does the rest of the Western world. But also, you say capitalists already live like the people in Acts 2. Show me one group of people that lives like that who are known as capitalists. permalink parent award report block reply\nsordfysh PRO 1 points 1 day ago Communism isn't determined by its name. It's determined by what it is. Communism is based on the \"commune\". The group of people in Acts 2 were what we call a commune today. And communism isn't defined by taking money and property because they are not unique in that. It's how they say they will distribute it. If government forcing people to give their money and property is communism, then we already live in communism and so does the rest of the Western world. But also, you say capitalists already live like the people in Acts 2. Show me one group of people that lives like that who are known as capitalists. permalink parent award report block reply\nLol_Garrus 12 points 3 days ago \"Oooops, burnt the souffle again!\" permalink award report block reply Neonentity 5 points 3 days ago And after breaking all those peop- uh -EGGS, too! permalink parent award report block reply\nNeonentity 5 points 3 days ago And after breaking all those peop- uh -EGGS, too! permalink parent award report block reply\nAdmrlNelson 8 points 3 days ago It's by Thaddeus Trenchant if anyone is interested. Amazon link permalink award report block reply bigdickhangsright 1 points 3 days ago 3.3 and no reviews --- the cowards. It has no reviews on Goodreads. I'd read it but I suspect that those commies disallow you from leaving a review or score. permalink parent award report block reply\nbigdickhangsright 1 points 3 days ago 3.3 and no reviews --- the cowards. It has no reviews on Goodreads. I'd read it but I suspect that those commies disallow you from leaving a review or score. permalink parent award report block reply\nCaliAli 7 points 3 days ago Epilogue: And 148 million died permalink award report block reply\nTrumpWonByALandslide 6 points 3 days ago Who's the lucky bastard who made it to tell the tale? permalink award report block reply\nAquamine-Amarine 6 points 3 days ago There needs to be a patriot book club around here. Recommendations would include not woke fictional novels, nonfiction books, etc. I stopped reading young adult novels a long time ago when it started to become woke cringy garbage. permalink award report block reply Roadpower 2 points 3 days ago Early philosophical works are what I would strongly recommend, especially for very young children. My mother had me reading such things by the time I was four to six years old. Aesop Fables, Grim's Fairly tales, Animal Farm et al. Philosophy is the basis of a critical mind. permalink parent award report block reply Klaus73 1 points 2 days ago A really good fantasy series I suggest is Joe Abercrombies stuff - the First Law and the shit ton of books in the setting are really good reads and not jammed full of woke shit. permalink parent award report block reply\nRoadpower 2 points 3 days ago Early philosophical works are what I would strongly recommend, especially for very young children. My mother had me reading such things by the time I was four to six years old. Aesop Fables, Grim's Fairly tales, Animal Farm et al. Philosophy is the basis of a critical mind. permalink parent award report block reply\nKlaus73 1 points 2 days ago A really good fantasy series I suggest is Joe Abercrombies stuff - the First Law and the shit ton of books in the setting are really good reads and not jammed full of woke shit. permalink parent award report block reply\nawsure 4 points 3 days ago They just didn’t do it right permalink award report block reply\nAR_MAGA 3 points 3 days ago But it'll be always a small amount  of idiots who believe that they'll make it work and a huge amount of powerful people who brainwashed the others to start over and over again. permalink award report block reply\nfu-greta 2 points 3 days ago But it's gonna work next time! permalink award report block reply\nDangerous 1 points 3 days ago \"Talk about abbreviated, there aren't even any pages in this thing!\" permalink award report block reply\nHanging_Chad 1 points 3 days ago kek. GN permalink award report block reply\nI_Love_45-70_Gov 1 points 3 days ago Thumbnail looks like a confused face. 👍👍 permalink award report block reply\nNomad899 1 points 3 days ago I know a few who need to read this book permalink award report block reply\nRogueLeaderX 1 points 3 days ago New yorkers are about to learn this lesson. permalink award report block reply\nMegaboom2025 1 points 3 days ago Depends on if you’re the ruling class or the slave class permalink award report block reply"}