{"id": "8169674", "contents": "1200 Mamdani announces \"All female transition team\" 😂 🤡🌎  HONK  HONK  🌎🤡 posted 7 days ago by MAGAguitar 207 comments award share download report block\n207 comments Sort by Top Top New Worst Old Save I_Love_Trump 190 points 7 days ago This ship will sink fast. permalink award report block reply UsernameChexOut 97 points 7 days ago The world's longest con to get some pussy permalink parent award report block reply PatGarrett 77 points 7 days ago He’s gay permalink parent award report block reply 1amS3lly 37 points 7 days ago A gay Muslim? How has he not chucked himself off a roof yet? permalink parent award report block reply _Liberty_Prime_ 33 points 7 days ago Taqiyya. permalink parent award report block reply view 2 more comments... The_Return_of_User_x 3 points 6 days ago He had to become mayor first so he could find his way onto the tallest. Keep him away from 1WTC permalink parent award report block reply 45fan 1 points 6 days ago It's only gay to them if you bottom. So he's just hiding that he's the bottom-king. permalink parent award report block reply Hanging_Chad 14 points 7 days ago he may as well transition himself as he apparently has no balls permalink parent award report block reply UsernameChexOut 9 points 7 days ago He said he's gay cause he couldn't get pussy. Maybe this dude is secretly based, looks like he's conversion therapying himself lol permalink parent award report block reply Aoikaze2000 10 points 7 days ago If he's trying that with a bunch of DNC cougars, that's gonna guarantee he stays gay. permalink parent award report block reply view 1 more comments... patrioticwinning3 2 points 7 days ago Well he could have multiple wives... permalink parent award report block reply FromBilgewater 2 points 7 days ago That's what the \"it's Ma'ams\" are for. permalink parent award report block reply bubadmt 2 points 7 days ago Does being into goats count as gay? Or is he just sheepish? permalink parent award report block reply load 3 more comments... uniformist 9 points 7 days ago Worst pussy in the United States permalink parent award report block reply 3percenterFan 6 points 7 days ago nah they fugly permalink parent award report block reply Moose_Antlers 3 points 7 days ago Given what I'm looking at in that picture, I say let him have at it. permalink parent award report block reply CharlieMike 2 points 6 days ago In some cultures, women are the most vicious and often inflicted the most horrendous tortures to captives.  Better flee now New Yorkers. permalink parent award report block reply load 1 more comments... MAGABOND 37 points 7 days ago Proof he’s not actually a Muslim, and is more a cringe Millennial socialist millionaire. permalink parent award report block reply DeportThemAllForever 18 points 7 days ago Muslims have multiple wives, harems… permalink parent award report block reply MAGABOND 9 points 7 days ago What the fuck does that have to do with what i said? Do you think I was implying that there are no Muslim women? What positions of any power, or responsibility outside the family do ardent Muslim men allow those wives to partake in! permalink parent award report block reply DeportThemAllForever 0 points 6 days ago Thread topic duh!!! What are you talking about? permalink parent award report block reply goldkeyboardwarrior 3 points 7 days ago Wouldn’t mean he’s a Muslim and could easily mean he’s just doing what he knew would get all of the AWFLs voting for him. Besides, a true Muslim wouldn’t tolerate women in a position of power, or transgenderism, or about 90% of the stuff he claims to represent as a Democratic Socialist. permalink parent award report block reply popcycle 2 points 7 days ago thats not a harem that's a haram permalink parent award report block reply GoUSA 1 points 7 days ago You mean boyfriends permalink parent award report block reply Elencher 6 points 6 days ago Same shit with women in government in Africa. They do not view the western power structures as legitimate and have their own parallel power structures run by men. They send women to run the western gov since they know they are a protected class thanks to cultural Marxism and as a humiliation ritual for whites to be ruled over by women. permalink parent award report block reply MAGABOND 2 points 6 days ago Good point. permalink parent award report block reply MySidesGoUp 1 points 6 days ago No way bro. We’re told to hate muzzies here. If he’s friendly with jews we won’t know what to do.  Boss says they’re the chosen tribe… permalink parent award report block reply covfefe_energy 1 points 6 days ago Muslims rape anything with a hole. Women, girls, boys, goats, donkeys. Anything. permalink parent award report block reply RyanKeyOh 2 points 7 days ago That’s the goal permalink parent award report block reply bubadmt 11 points 7 days ago Goat* permalink parent award report block reply Threaper666 2 points 7 days ago How long before he is accused of sexual harassment?  *Not made up accusations. permalink parent award report block reply projectarcturus1 2 points 7 days ago Fucking kek permalink parent award report block reply load 1 more comments... redditadminssuckit 147 points 7 days ago \"It was always the women, and above all the young ones, who were the most bigoted adherents of the Party, the swallowers of slogans, the amateur spies and nosers-out of unorthodoxy.\" --George Orwell, 1984 permalink award report block reply 762xPat 28 points 7 days ago You got it before me....Bravo sir. permalink parent award report block reply Hanging_Chad 19 points 7 days ago slogans aren’t the only things they swallow permalink parent award report block reply UCantStumpTheTrump 19 points 7 days ago His administration will be a disaster because teams of women have no cohesion and tear themselves apart over petty bullshit permalink parent award report block reply ParkerFH 8 points 7 days ago Can confirm (I'm a woman). permalink parent award report block reply Smurfection 5 points 7 days ago Also, no strategy and nothing actionable will ever happen in a meeting.  New York City may have dodged a bullet based on the sheer incompetence of Mamdani. permalink parent award report block reply covfefe_energy 3 points 6 days ago It's going to be as bad as we could imagine. His team will bus-drop Muslim invaders by the thousands. Within these 4 years, we'll be hearing the call to prayer daily in mid-town Manhattan. Every other store will be Halal food, foreign currency exchange, and international phone shops. 100s of \"Asian\" rape crimes. Women won't be able to go anywhere without harassment. Central Park will be abandoned after being filled with sand monkeys and trash. This will be London on steroids. It will happen. permalink parent award report block reply 45ichooseu 10 points 7 days ago My first exact thought was this quote. Women might actually lose their voting rights in a few decades. permalink parent award report block reply TheTelltaleFly 5 points 6 days ago The only silver lining to this election. permalink parent award report block reply Abovethefray 1 points 6 days ago ha permalink parent award report block reply EyesSewnShut 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply Klown_Kutz 6 points 6 days ago Women will burn this country to the ground to prevent the blue collar men they despise from enjoying the prosperity we had under the first Trump administration. permalink parent award report block reply load 1 more comments... TheMadHodker1 102 points 7 days ago All liberal women think they know what's best for everyone else. permalink award report block reply 24601 58 points 7 days ago That's because they don't have any children to look after. permalink parent award report block reply ScamBlondie 43 points 7 days ago That demon that just got elected Virginia governor has young daughters and refused to denounce her new AG wishing death upon the children of conservatives. And she’s supposedly a moderate Democrat. permalink parent award report block reply covfefe_energy 2 points 6 days ago It's unreal (because it was stolen). permalink parent award report block reply UCantStumpTheTrump 13 points 7 days ago They have “fur babies” aka child replacements permalink parent award report block reply Klown_Kutz 2 points 6 days ago That’s irrelevant. This is women being women. permalink parent award report block reply Krat 11 points 7 days ago Thats because nobody has shut their mouth up like they do with young boys permalink parent award report block reply JoeCubicle 1 points 6 days ago It's the motherhood instinct that is  unfilled/misplaced. That's also why they have cats, lot's of cats. permalink parent award report block reply invalid_data 56 points 7 days ago Isaiah 3:12 Childish leaders oppress my people,\nand women rule over them.\nO my people, your leaders mislead you;\nthey send you down the wrong road. permalink award report block reply UCantStumpTheTrump 25 points 7 days ago Yep, it’s literally a Biblical curse to be ruled over by women permalink parent award report block reply patiohimself 37 points 7 days ago Already a great start to this total shitshow permalink award report block reply usernamechecksout 30 points 7 days ago How inclusive permalink award report block reply Hanging_Chad 19 points 7 days ago seems exclusive of males permalink parent award report block reply rebuildingMyself 2 points 6 days ago So nothing different from that side of the aisle permalink parent award report block reply Lelleck 4 points 7 days ago And they feel flattered and will tell you how charming this muslim is. permalink parent award report block reply barwhack 29 points 7 days ago An all trans-female team, you say? permalink award report block reply Bendadick_Arnold 6 points 7 days ago Are they lining up for surgery? permalink parent award report block reply barwhack 2 points 7 days ago Nope. Maam Dummy is their GOAT. permalink parent award report block reply here2red 20 points 7 days ago Lina Khan. LOL. If businesses havent packed their bags at the mention of her name I dont know WTF they are waiting for. permalink award report block reply LaptopDied 3 points 7 days ago Yes. Pakistani. Not Jewish. London born. Lawyer. permalink parent award report block reply Lelleck 11 points 7 days ago London is the blueprint permalink parent award report block reply UsernameChexOut 15 points 7 days ago Dude is gonna get #metoo'd in 3... 2... 1... permalink award report block reply Cuetardian 14 points 7 days ago I don't think they would. That's a Western concept (treating women decently.) The repercussions of daring to accuse a muslim man that they are willingly working for - I don't see that happening. They know damn well the man would never tolerate that. permalink parent award report block reply al-phabitz89 -12 points 7 days ago How retarded to think the west has a copyright on treating women decently. permalink parent award report block reply RyanKeyOh 8 points 7 days ago Who else does it? permalink parent award report block reply _Sully_ 3 points 7 days ago You see, you fell into the trap. Of course other countries treat women \"decently\" but from the eyes of a modern American women they see it as oppression. The reality is the West doesn't treat women decently because it let's a lot of them destroy themselves. permalink parent award report block reply Waterlaw 2 points 7 days ago exectly western countries allow self destructing behaviour to woman. Woman shouldnt be allowed vote tbh permalink parent award report block reply SaltyKrakenBalls 1 points 6 days ago Visit any Muslim ruled nation before you cast stones at a woman’s face. permalink parent award report block reply Braujager 13 points 7 days ago Political or sexual transition team? permalink award report block reply armyofpedes4usa 11 points 7 days ago How many of them are actually troons? permalink award report block reply jonnyuno 11 points 7 days ago I wish we would boycott anything related to him.  Let NY sink. permalink award report block reply Meddlesom 11 points 7 days ago AKA his harem. permalink award report block reply maleitch 10 points 7 days ago https://www.jfrej.org/news/2025/06/jews4zohran permalink award report block reply ScamBlondie 5 points 7 days ago Cows for steak. permalink parent award report block reply ShadowInv 4 points 7 days ago Aren’t they the landlords that he is trying to save the youth from? permalink parent award report block reply keeponwinning 10 points 7 days ago All born female?   Transphobe. permalink award report block reply FrenFinder 9 points 7 days ago Socialists know their target demographic. It also work for the islamic side to make them think anything but subjugation comes with islam. permalink award report block reply LaWhoreVagistani 9 points 7 days ago 50% women and the other 50% are men identifying as women permalink award report block reply Icepck 8 points 7 days ago Oh, they will argue and chamge nothing substantial, at best, or make things worse than male communists. permalink award report block reply knnbccb 7 points 7 days ago No diaperhead among them? permalink award report block reply UsernameChexOut 8 points 7 days ago First name listed is Khan... lol permalink parent award report block reply LaptopDied 3 points 7 days ago Pakistani. Not Jewish. Lawyer. London born. permalink parent award report block reply TennesseeBorn 5 points 7 days ago A London born Muslim permalink parent award report block reply LaptopDied 2 points 7 days ago Yes. permalink parent award report block reply ozgroginexile 5 points 7 days ago Using the London playbook, gotta have someone to oversee that permalink parent award report block reply CmonGubMintGibMe 6 points 7 days ago Lol oh man this is gonna go so badly permalink award report block reply Hanging_Chad 6 points 7 days ago kek permalink award report block reply IncredibleMrE1 6 points 7 days ago kek permalink award report block reply Gunmolester 6 points 7 days ago HAHAHAHAHAHAHAHAHAHAHAHAHAHAHA permalink award report block reply dorkana 5 points 7 days ago lolllllll permalink award report block reply ythehorses 5 points 7 days ago Except none will be women. All trannies. permalink award report block reply ElectricDragon- 5 points 7 days ago Faggot energy permalink award report block reply mateus 5 points 7 days ago Hilarious. A Democrat mayor-elect publicly announcing he's going to violate EEOC laws. Someone should tell him those WANTED:FEMALE/WANTED:MALE employment adds became verboten before he was born.\nMen wanting the job should just put on a skirt and wig and \"identify\" as women. 😂 permalink award report block reply BoomShtick 5 points 7 days ago And here …. We…. Go permalink award report block reply Saltyminer11 5 points 7 days ago Popcorn: check, butter: check..... permalink parent award report block reply TheRedPike 4 points 7 days ago Dont forget the salt. permalink parent award report block reply Saltyminer11 3 points 7 days ago 🤣 permalink parent award report block reply MinneMAGA 5 points 7 days ago Someone told him all the democrat women have penises, right? permalink award report block reply SavingPrivateGrace 5 points 7 days ago More like A New Error.  He's 34, never had a job and has no friends. permalink award report block reply GuerillaYourDreams 5 points 7 days ago Are they all going to transition to male? permalink award report block reply FeistyCrawfish 4 points 7 days ago Ah yes, the harem permalink award report block reply keeman 4 points 7 days ago This will be a glorious disaster.  To teach a lesson to the world how this woke commie islamist crap ends up.  Sorry NYC, you are the demonstration subject.  But then, you (allegedly) voted for it. permalink award report block reply MajorClark 4 points 7 days ago all female transitioning to males? permalink award report block reply Snek_Plissken 4 points 7 days ago I hope they are wearing hijabs. permalink award report block reply RoughBoy 4 points 7 days ago Females made him a mayor permalink award report block reply PatrioticVideo 4 points 7 days ago Mothers Of Society for which all females must model their lives.  It is a holy commandment.  Do not veer from the Great Message.  Elder Father Mandami is here.  Compliance is no longer optional. permalink award report block reply ImpeachThisBitch 4 points 7 days ago Bears! He’s put the whole city in danger. permalink award report block reply KungPaoMcChicken 4 points 7 days ago He wants to be as close as possible to the puss. permalink award report block reply ChickenStrips 4 points 7 days ago Seems to be a trend… there are A LOT of women in politics on the west coast. Kamikazes permalink award report block reply Roadpower 4 points 7 days ago This guy is going to fuck up this city so bad, lol. I'm only laughing because he is off to a royal start. We are really fucked this time around. Oh well, things gonna have to play out as they going to play out. permalink award report block reply Wtf_socialismreally 3 points 7 days ago Because they're subservient to men, and he knows they'll be subservient to him. Even though I'm not sure he's much of a man really. permalink award report block reply JoeFromHR 3 points 7 days ago Seems discriminatory against males. Can't wait for this clusterfuck to implode. permalink award report block reply obar1 3 points 6 days ago because they are the easiest to be manipulated and no one of them will say shit coz the fear to be seen as a contrarian permalink award report block reply okboomer59 3 points 6 days ago And suddenly they all know what a woman is. permalink award report block reply yourheadasplode 3 points 7 days ago What about transwomen? permalink award report block reply paullyj67in24 3 points 7 days ago sweden did this and its at the top of rapes per capita by country  although UK might have passed them permalink award report block reply Obambi 3 points 7 days ago 99 percent of Women are idiots permalink award report block reply Beat_to_Quarters 2 points 6 days ago The clown show starts immediately. permalink award report block reply Electrician 2 points 6 days ago Good lord…imagine what a train wreck that’s gonna be. LOL permalink award report block reply Returningtogod 2 points 6 days ago What could possibly go wrong? permalink award report block reply Lemonhead965 2 points 7 days ago Are the women transitioning. Watch it be mostly poc troons permalink award report block reply FrmrAmericanRepublic 2 points 6 days ago This will go about as well as the all-female engineering team that made the pedestrian bridge - which promptly collapsed. permalink award report block reply DontTreadOnSnek 2 points 7 days ago How many are \"trans\"? permalink award report block reply jiujiujiu 2 points 7 days ago Checks in boxes for these people. What’s the point other than to cripple and humiliate our country? permalink award report block reply KTGArtist 2 points 6 days ago This POS is already tiresome. A harem? Lovely. How muzzy of you.\nHow long before we have prayer that shuts down Wall Street, with Mister Muzzy Commie Mayor at the head? permalink award report block reply Zippythekid 2 points 7 days ago God help the decent people of New York the rest deserve what they get. permalink award report block reply ThouShallNotSteal 1 points 6 days ago Female goats? permalink award report block reply xkgb 1 points 6 days ago Female transition? permalink award report block reply SurveilThis 1 points 7 days ago One catch - only FGM ladies need apply. permalink award report block reply DrewJackson 1 points 6 days ago A Beastly Harem.    That smell. permalink award report block reply Hambonemcgee 1 points 6 days ago Makes you wonder what sort of Muslim would do that? permalink award report block reply Klaus73 1 points 7 days ago Does one of them have like G cup tits wear shades and never speak?  ( bonus if someone gets the movie ref) permalink award report block reply emorphia 1 points 7 days ago he wants concubines it seems. permalink award report block reply IAmDisappoint 1 points 7 days ago LOL that is not discriminatory at all. Imagine if it was the other way around. permalink award report block reply LakeAmeritaga 1 points 7 days ago now he wants funding for his harem permalink award report block reply Shitonprogressives 1 points 7 days ago What is a woman you fucking commie bigot /s permalink award report block reply TexasBrowncoat 1 points 6 days ago Are these the 72 virgins that he was promised, or are there 7 of them and they all rate a '2'? permalink award report block reply Tophat9000 1 points 7 days ago The handmaidens permalink award report block reply Steve56775 1 points 7 days ago Is that like 27 virgins? permalink award report block reply Prandogolio 1 points 7 days ago I think all communists should be shot, even if they are women. permalink award report block reply Psarg 1 points 7 days ago Women and gay guys are Antifa'a leaders.  Then come straight guys.  Troons are the foot soldiers. permalink award report block reply learntocode 1 points 7 days ago His is coming with a crew of nation wreckers. This coven of witched is going to dismantle Americas banking capitol. This is a HUGE national crisis. All of our financial transactions pass through New York. permalink award report block reply AbrahamLincoln 1 points 6 days ago How many cats are on the transition team? permalink award report block reply Perseverant 1 points 7 days ago Wow, he opted for only half of a transition team that is intellectually deficient (according to Islam). permalink award report block reply BusterHyman99 1 points 7 days ago 😂 the policies will be better than I thought permalink award report block reply Retardloserimsogay 1 points 7 days ago I seen this earlier today. They are the mayor, he has no clue what to do and it's obvious. This is going to a mayoral committee and they'll get their orders from nameless faceless DSA high ups. permalink award report block reply sod_off_shotgun 1 points 6 days ago What about diversity? Or does that mean it's 100% diverse? permalink award report block reply xkgb 1 points 7 days ago What's a woman? permalink award report block reply Jehsun 1 points 7 days ago Well if that's the case we may be alright. He may not ever get into office permalink award report block reply WassermanSchultz 1 points 7 days ago I'm sure some of those women have transitioned, too. permalink award report block reply RedPillDropper 1 points 6 days ago Oh, so his harem? permalink award report block reply TooBright 1 points 6 days ago So... Men? permalink award report block reply uniformist 1 points 7 days ago Next week they’re all going out to get nose rings and dye their hair blue. permalink award report block reply darkmatter1985 1 points 6 days ago How long before \"Escape from NY\" is a reality? 1 year? permalink award report block reply Ferretman 1 points 7 days ago Idiot permalink award report block reply fjzappa 1 points 6 days ago What is a woman? permalink award report block reply Quiznos585 1 points 7 days ago LMAO permalink award report block reply MakeAmericaVapeAgain 1 points 7 days ago are they still leaning into this shit? isn’t it enough that he is a dem sociopath and brown? permalink award report block reply PotatusHead 1 points 7 days ago You mean \"Transitioning Team\". permalink award report block reply Probably_tryna_sleep 1 points 7 days ago Ooooof. Buncha women without hijab doing official business?!!? Dudes immediately alienating the dunecoon vote lol. We taking bets on when the first vest clacks off in time square? permalink award report block reply Aut_MAGA_Aut_Nihil 1 points 7 days ago He can call his “transition” team the Ma’amdummies. permalink award report block reply Roof_Korean 1 points 7 days ago We're reaching levels of pandering and Taqiyya I never thought possible. permalink award report block reply corntortilla 1 points 7 days ago That doesn’t sound very Islamic. When do we get to the Islamic anti women stuff? Tomorrow? Maybe in two weeks? When do we get burkas for lib women? Waiting. permalink award report block reply hillaryforprison 1 points 7 days ago like a harem. permalink award report block reply Jonald_Trump 1 points 6 days ago Sounds discriminatory permalink award report block reply flashersenpai 1 points 6 days ago He's not an islamist. He's a shitlib play acting just like Bernie and AOC permalink award report block reply ncswicn 1 points 7 days ago Next week he'll announce the new team uniform aka burqa and for casual Friday's a hijab! 😜 permalink award report block reply Shaffro 1 points 7 days ago I am so blessed I don't live in that third world shit hole. permalink award report block reply Bramage 1 points 7 days ago Figures since he's a beta cuck. permalink award report block reply Reclaimer69 1 points 6 days ago Ask them how long it has been since they've transitioned. Plz record. permalink award report block reply dres3 1 points 7 days ago Mammy's Harem. permalink award report block reply 5DchessWatch 1 points 6 days ago Why aren't they wearing their durkadurkas? permalink award report block reply BobDolesBanana 1 points 7 days ago Nobody cares. permalink award report block reply EvensoAmen 1 points 7 days ago https://dailycaller.com/2025/11/05/mamdani-spanberger-mikie-sherrill-helen-andrews-young-women-liberal-leftism-democrats-social-children/ permalink parent award report block reply BobDolesBanana 1 points 7 days ago If you read the article then you would have read: \"It serves to remember that a huge majority of women vote Democrat because their phone told them that voting Republican is low class. That is the sum total of their belief system.\" Women don't vote for candidates who have all women cabinets. They vote for what emotionally fits their current state of mind. permalink parent award report block reply TooHotToFrost 1 points 6 days ago All white meat chicken nuggets permalink award report block reply tuaris 1 points 7 days ago Oh my. permalink award report block reply MudDog 1 points 7 days ago all transitioning transition team! permalink award report block reply Oodles 1 points 7 days ago Much easier to control. You can leverage their empathy to convince them to commit genocide permalink award report block reply ConsrvspkgNJ 1 points 6 days ago Naaah, this is just to throw people off the scent. This is something they can point to when they get called misogynist when they implement Sharia law that says women are forbidden to work and must wear a burkha outdoors and can never walk alone without a man escorting them. permalink award report block reply C0drus 1 points 7 days ago Sounds like he’s “Transitioning”, just look what happened to Bruce Jenner when he had a bunch of women around him 🤣 permalink award report block reply Beer-_-Belly 1 points 6 days ago If there is one thing that Muslims are known for it is uplifting women. permalink award report block reply patrioticwinning3 1 points 7 days ago His mooslim constituents are already getting their stones ready :p permalink award report block reply GreyKnight 1 points 7 days ago “See. I’m not a radical Muslim” permalink award report block reply MAGAguitar OP 2 points 7 days ago Taqiyya permalink parent award report block reply SGT_Glowie 1 points 7 days ago That’s to distract from the fact he doesn’t believe women should have rights lol permalink award report block reply JackOfAllTirades 1 points 6 days ago Islam is going to rubbed into the faces of New Yorkers every moment of the next 4 years. permalink award report block reply journalist 1 points 7 days ago This is going to be a disaster of historic proportions. permalink award report block reply permissible_missile 1 points 7 days ago If you think that's going to work, I've got a South Florida bridge to sell ya permalink award report block reply HockeyMom4Trump 1 points 7 days ago I wonder if any of his all women transition team have penises permalink award report block reply whitman_99 1 points 6 days ago So the transition team will all be wearing burkas? permalink award report block reply SimaYi 1 points 7 days ago his harem? permalink award report block reply Redeemable 1 points 6 days ago He is forming his harem and the women have no idea. permalink award report block reply TheWhitestOfFangs 1 points 6 days ago Islam allows multiple wives... permalink award report block reply Aquamine-Amarine 1 points 7 days ago Leftist women are retarded. Don't be surprised they turn out this way when the education system is run by leftists. permalink award report block reply TLMFR 1 points 6 days ago Sooo... a bunch of dudes pretending to be chicks? permalink award report block reply 1_Badcop 0 points 7 days ago Are they all his wives? permalink award report block reply\nI_Love_Trump 190 points 7 days ago This ship will sink fast. permalink award report block reply UsernameChexOut 97 points 7 days ago The world's longest con to get some pussy permalink parent award report block reply PatGarrett 77 points 7 days ago He’s gay permalink parent award report block reply 1amS3lly 37 points 7 days ago A gay Muslim? How has he not chucked himself off a roof yet? permalink parent award report block reply _Liberty_Prime_ 33 points 7 days ago Taqiyya. permalink parent award report block reply view 2 more comments... The_Return_of_User_x 3 points 6 days ago He had to become mayor first so he could find his way onto the tallest. Keep him away from 1WTC permalink parent award report block reply 45fan 1 points 6 days ago It's only gay to them if you bottom. So he's just hiding that he's the bottom-king. permalink parent award report block reply Hanging_Chad 14 points 7 days ago he may as well transition himself as he apparently has no balls permalink parent award report block reply UsernameChexOut 9 points 7 days ago He said he's gay cause he couldn't get pussy. Maybe this dude is secretly based, looks like he's conversion therapying himself lol permalink parent award report block reply Aoikaze2000 10 points 7 days ago If he's trying that with a bunch of DNC cougars, that's gonna guarantee he stays gay. permalink parent award report block reply view 1 more comments... patrioticwinning3 2 points 7 days ago Well he could have multiple wives... permalink parent award report block reply FromBilgewater 2 points 7 days ago That's what the \"it's Ma'ams\" are for. permalink parent award report block reply bubadmt 2 points 7 days ago Does being into goats count as gay? Or is he just sheepish? permalink parent award report block reply load 3 more comments... uniformist 9 points 7 days ago Worst pussy in the United States permalink parent award report block reply 3percenterFan 6 points 7 days ago nah they fugly permalink parent award report block reply Moose_Antlers 3 points 7 days ago Given what I'm looking at in that picture, I say let him have at it. permalink parent award report block reply CharlieMike 2 points 6 days ago In some cultures, women are the most vicious and often inflicted the most horrendous tortures to captives.  Better flee now New Yorkers. permalink parent award report block reply load 1 more comments... MAGABOND 37 points 7 days ago Proof he’s not actually a Muslim, and is more a cringe Millennial socialist millionaire. permalink parent award report block reply DeportThemAllForever 18 points 7 days ago Muslims have multiple wives, harems… permalink parent award report block reply MAGABOND 9 points 7 days ago What the fuck does that have to do with what i said? Do you think I was implying that there are no Muslim women? What positions of any power, or responsibility outside the family do ardent Muslim men allow those wives to partake in! permalink parent award report block reply DeportThemAllForever 0 points 6 days ago Thread topic duh!!! What are you talking about? permalink parent award report block reply goldkeyboardwarrior 3 points 7 days ago Wouldn’t mean he’s a Muslim and could easily mean he’s just doing what he knew would get all of the AWFLs voting for him. Besides, a true Muslim wouldn’t tolerate women in a position of power, or transgenderism, or about 90% of the stuff he claims to represent as a Democratic Socialist. permalink parent award report block reply popcycle 2 points 7 days ago thats not a harem that's a haram permalink parent award report block reply GoUSA 1 points 7 days ago You mean boyfriends permalink parent award report block reply Elencher 6 points 6 days ago Same shit with women in government in Africa. They do not view the western power structures as legitimate and have their own parallel power structures run by men. They send women to run the western gov since they know they are a protected class thanks to cultural Marxism and as a humiliation ritual for whites to be ruled over by women. permalink parent award report block reply MAGABOND 2 points 6 days ago Good point. permalink parent award report block reply MySidesGoUp 1 points 6 days ago No way bro. We’re told to hate muzzies here. If he’s friendly with jews we won’t know what to do.  Boss says they’re the chosen tribe… permalink parent award report block reply covfefe_energy 1 points 6 days ago Muslims rape anything with a hole. Women, girls, boys, goats, donkeys. Anything. permalink parent award report block reply RyanKeyOh 2 points 7 days ago That’s the goal permalink parent award report block reply bubadmt 11 points 7 days ago Goat* permalink parent award report block reply Threaper666 2 points 7 days ago How long before he is accused of sexual harassment?  *Not made up accusations. permalink parent award report block reply projectarcturus1 2 points 7 days ago Fucking kek permalink parent award report block reply load 1 more comments...\nUsernameChexOut 97 points 7 days ago The world's longest con to get some pussy permalink parent award report block reply PatGarrett 77 points 7 days ago He’s gay permalink parent award report block reply 1amS3lly 37 points 7 days ago A gay Muslim? How has he not chucked himself off a roof yet? permalink parent award report block reply _Liberty_Prime_ 33 points 7 days ago Taqiyya. permalink parent award report block reply view 2 more comments... The_Return_of_User_x 3 points 6 days ago He had to become mayor first so he could find his way onto the tallest. Keep him away from 1WTC permalink parent award report block reply 45fan 1 points 6 days ago It's only gay to them if you bottom. So he's just hiding that he's the bottom-king. permalink parent award report block reply Hanging_Chad 14 points 7 days ago he may as well transition himself as he apparently has no balls permalink parent award report block reply UsernameChexOut 9 points 7 days ago He said he's gay cause he couldn't get pussy. Maybe this dude is secretly based, looks like he's conversion therapying himself lol permalink parent award report block reply Aoikaze2000 10 points 7 days ago If he's trying that with a bunch of DNC cougars, that's gonna guarantee he stays gay. permalink parent award report block reply view 1 more comments... patrioticwinning3 2 points 7 days ago Well he could have multiple wives... permalink parent award report block reply FromBilgewater 2 points 7 days ago That's what the \"it's Ma'ams\" are for. permalink parent award report block reply bubadmt 2 points 7 days ago Does being into goats count as gay? Or is he just sheepish? permalink parent award report block reply load 3 more comments... uniformist 9 points 7 days ago Worst pussy in the United States permalink parent award report block reply 3percenterFan 6 points 7 days ago nah they fugly permalink parent award report block reply Moose_Antlers 3 points 7 days ago Given what I'm looking at in that picture, I say let him have at it. permalink parent award report block reply CharlieMike 2 points 6 days ago In some cultures, women are the most vicious and often inflicted the most horrendous tortures to captives.  Better flee now New Yorkers. permalink parent award report block reply load 1 more comments...\nPatGarrett 77 points 7 days ago He’s gay permalink parent award report block reply 1amS3lly 37 points 7 days ago A gay Muslim? How has he not chucked himself off a roof yet? permalink parent award report block reply _Liberty_Prime_ 33 points 7 days ago Taqiyya. permalink parent award report block reply view 2 more comments... The_Return_of_User_x 3 points 6 days ago He had to become mayor first so he could find his way onto the tallest. Keep him away from 1WTC permalink parent award report block reply 45fan 1 points 6 days ago It's only gay to them if you bottom. So he's just hiding that he's the bottom-king. permalink parent award report block reply Hanging_Chad 14 points 7 days ago he may as well transition himself as he apparently has no balls permalink parent award report block reply UsernameChexOut 9 points 7 days ago He said he's gay cause he couldn't get pussy. Maybe this dude is secretly based, looks like he's conversion therapying himself lol permalink parent award report block reply Aoikaze2000 10 points 7 days ago If he's trying that with a bunch of DNC cougars, that's gonna guarantee he stays gay. permalink parent award report block reply view 1 more comments... patrioticwinning3 2 points 7 days ago Well he could have multiple wives... permalink parent award report block reply FromBilgewater 2 points 7 days ago That's what the \"it's Ma'ams\" are for. permalink parent award report block reply bubadmt 2 points 7 days ago Does being into goats count as gay? Or is he just sheepish? permalink parent award report block reply load 3 more comments...\n1amS3lly 37 points 7 days ago A gay Muslim? How has he not chucked himself off a roof yet? permalink parent award report block reply _Liberty_Prime_ 33 points 7 days ago Taqiyya. permalink parent award report block reply view 2 more comments... The_Return_of_User_x 3 points 6 days ago He had to become mayor first so he could find his way onto the tallest. Keep him away from 1WTC permalink parent award report block reply 45fan 1 points 6 days ago It's only gay to them if you bottom. So he's just hiding that he's the bottom-king. permalink parent award report block reply\n_Liberty_Prime_ 33 points 7 days ago Taqiyya. permalink parent award report block reply view 2 more comments...\nThe_Return_of_User_x 3 points 6 days ago He had to become mayor first so he could find his way onto the tallest. Keep him away from 1WTC permalink parent award report block reply\n45fan 1 points 6 days ago It's only gay to them if you bottom. So he's just hiding that he's the bottom-king. permalink parent award report block reply\nHanging_Chad 14 points 7 days ago he may as well transition himself as he apparently has no balls permalink parent award report block reply\nUsernameChexOut 9 points 7 days ago He said he's gay cause he couldn't get pussy. Maybe this dude is secretly based, looks like he's conversion therapying himself lol permalink parent award report block reply Aoikaze2000 10 points 7 days ago If he's trying that with a bunch of DNC cougars, that's gonna guarantee he stays gay. permalink parent award report block reply view 1 more comments... patrioticwinning3 2 points 7 days ago Well he could have multiple wives... permalink parent award report block reply\nAoikaze2000 10 points 7 days ago If he's trying that with a bunch of DNC cougars, that's gonna guarantee he stays gay. permalink parent award report block reply view 1 more comments...\npatrioticwinning3 2 points 7 days ago Well he could have multiple wives... permalink parent award report block reply\nFromBilgewater 2 points 7 days ago That's what the \"it's Ma'ams\" are for. permalink parent award report block reply\nbubadmt 2 points 7 days ago Does being into goats count as gay? Or is he just sheepish? permalink parent award report block reply\nuniformist 9 points 7 days ago Worst pussy in the United States permalink parent award report block reply\n3percenterFan 6 points 7 days ago nah they fugly permalink parent award report block reply\nMoose_Antlers 3 points 7 days ago Given what I'm looking at in that picture, I say let him have at it. permalink parent award report block reply\nCharlieMike 2 points 6 days ago In some cultures, women are the most vicious and often inflicted the most horrendous tortures to captives.  Better flee now New Yorkers. permalink parent award report block reply\nMAGABOND 37 points 7 days ago Proof he’s not actually a Muslim, and is more a cringe Millennial socialist millionaire. permalink parent award report block reply DeportThemAllForever 18 points 7 days ago Muslims have multiple wives, harems… permalink parent award report block reply MAGABOND 9 points 7 days ago What the fuck does that have to do with what i said? Do you think I was implying that there are no Muslim women? What positions of any power, or responsibility outside the family do ardent Muslim men allow those wives to partake in! permalink parent award report block reply DeportThemAllForever 0 points 6 days ago Thread topic duh!!! What are you talking about? permalink parent award report block reply goldkeyboardwarrior 3 points 7 days ago Wouldn’t mean he’s a Muslim and could easily mean he’s just doing what he knew would get all of the AWFLs voting for him. Besides, a true Muslim wouldn’t tolerate women in a position of power, or transgenderism, or about 90% of the stuff he claims to represent as a Democratic Socialist. permalink parent award report block reply popcycle 2 points 7 days ago thats not a harem that's a haram permalink parent award report block reply GoUSA 1 points 7 days ago You mean boyfriends permalink parent award report block reply Elencher 6 points 6 days ago Same shit with women in government in Africa. They do not view the western power structures as legitimate and have their own parallel power structures run by men. They send women to run the western gov since they know they are a protected class thanks to cultural Marxism and as a humiliation ritual for whites to be ruled over by women. permalink parent award report block reply MAGABOND 2 points 6 days ago Good point. permalink parent award report block reply MySidesGoUp 1 points 6 days ago No way bro. We’re told to hate muzzies here. If he’s friendly with jews we won’t know what to do.  Boss says they’re the chosen tribe… permalink parent award report block reply covfefe_energy 1 points 6 days ago Muslims rape anything with a hole. Women, girls, boys, goats, donkeys. Anything. permalink parent award report block reply\nDeportThemAllForever 18 points 7 days ago Muslims have multiple wives, harems… permalink parent award report block reply MAGABOND 9 points 7 days ago What the fuck does that have to do with what i said? Do you think I was implying that there are no Muslim women? What positions of any power, or responsibility outside the family do ardent Muslim men allow those wives to partake in! permalink parent award report block reply DeportThemAllForever 0 points 6 days ago Thread topic duh!!! What are you talking about? permalink parent award report block reply goldkeyboardwarrior 3 points 7 days ago Wouldn’t mean he’s a Muslim and could easily mean he’s just doing what he knew would get all of the AWFLs voting for him. Besides, a true Muslim wouldn’t tolerate women in a position of power, or transgenderism, or about 90% of the stuff he claims to represent as a Democratic Socialist. permalink parent award report block reply popcycle 2 points 7 days ago thats not a harem that's a haram permalink parent award report block reply GoUSA 1 points 7 days ago You mean boyfriends permalink parent award report block reply\nMAGABOND 9 points 7 days ago What the fuck does that have to do with what i said? Do you think I was implying that there are no Muslim women? What positions of any power, or responsibility outside the family do ardent Muslim men allow those wives to partake in! permalink parent award report block reply DeportThemAllForever 0 points 6 days ago Thread topic duh!!! What are you talking about? permalink parent award report block reply\nDeportThemAllForever 0 points 6 days ago Thread topic duh!!! What are you talking about? permalink parent award report block reply\ngoldkeyboardwarrior 3 points 7 days ago Wouldn’t mean he’s a Muslim and could easily mean he’s just doing what he knew would get all of the AWFLs voting for him. Besides, a true Muslim wouldn’t tolerate women in a position of power, or transgenderism, or about 90% of the stuff he claims to represent as a Democratic Socialist. permalink parent award report block reply\npopcycle 2 points 7 days ago thats not a harem that's a haram permalink parent award report block reply\nGoUSA 1 points 7 days ago You mean boyfriends permalink parent award report block reply\nElencher 6 points 6 days ago Same shit with women in government in Africa. They do not view the western power structures as legitimate and have their own parallel power structures run by men. They send women to run the western gov since they know they are a protected class thanks to cultural Marxism and as a humiliation ritual for whites to be ruled over by women. permalink parent award report block reply MAGABOND 2 points 6 days ago Good point. permalink parent award report block reply\nMAGABOND 2 points 6 days ago Good point. permalink parent award report block reply\nMySidesGoUp 1 points 6 days ago No way bro. We’re told to hate muzzies here. If he’s friendly with jews we won’t know what to do.  Boss says they’re the chosen tribe… permalink parent award report block reply\ncovfefe_energy 1 points 6 days ago Muslims rape anything with a hole. Women, girls, boys, goats, donkeys. Anything. permalink parent award report block reply\nRyanKeyOh 2 points 7 days ago That’s the goal permalink parent award report block reply bubadmt 11 points 7 days ago Goat* permalink parent award report block reply\nbubadmt 11 points 7 days ago Goat* permalink parent award report block reply\nThreaper666 2 points 7 days ago How long before he is accused of sexual harassment?  *Not made up accusations. permalink parent award report block reply\nprojectarcturus1 2 points 7 days ago Fucking kek permalink parent award report block reply\nredditadminssuckit 147 points 7 days ago \"It was always the women, and above all the young ones, who were the most bigoted adherents of the Party, the swallowers of slogans, the amateur spies and nosers-out of unorthodoxy.\" --George Orwell, 1984 permalink award report block reply 762xPat 28 points 7 days ago You got it before me....Bravo sir. permalink parent award report block reply Hanging_Chad 19 points 7 days ago slogans aren’t the only things they swallow permalink parent award report block reply UCantStumpTheTrump 19 points 7 days ago His administration will be a disaster because teams of women have no cohesion and tear themselves apart over petty bullshit permalink parent award report block reply ParkerFH 8 points 7 days ago Can confirm (I'm a woman). permalink parent award report block reply Smurfection 5 points 7 days ago Also, no strategy and nothing actionable will ever happen in a meeting.  New York City may have dodged a bullet based on the sheer incompetence of Mamdani. permalink parent award report block reply covfefe_energy 3 points 6 days ago It's going to be as bad as we could imagine. His team will bus-drop Muslim invaders by the thousands. Within these 4 years, we'll be hearing the call to prayer daily in mid-town Manhattan. Every other store will be Halal food, foreign currency exchange, and international phone shops. 100s of \"Asian\" rape crimes. Women won't be able to go anywhere without harassment. Central Park will be abandoned after being filled with sand monkeys and trash. This will be London on steroids. It will happen. permalink parent award report block reply 45ichooseu 10 points 7 days ago My first exact thought was this quote. Women might actually lose their voting rights in a few decades. permalink parent award report block reply TheTelltaleFly 5 points 6 days ago The only silver lining to this election. permalink parent award report block reply Abovethefray 1 points 6 days ago ha permalink parent award report block reply EyesSewnShut 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply Klown_Kutz 6 points 6 days ago Women will burn this country to the ground to prevent the blue collar men they despise from enjoying the prosperity we had under the first Trump administration. permalink parent award report block reply load 1 more comments...\n762xPat 28 points 7 days ago You got it before me....Bravo sir. permalink parent award report block reply\nHanging_Chad 19 points 7 days ago slogans aren’t the only things they swallow permalink parent award report block reply\nUCantStumpTheTrump 19 points 7 days ago His administration will be a disaster because teams of women have no cohesion and tear themselves apart over petty bullshit permalink parent award report block reply ParkerFH 8 points 7 days ago Can confirm (I'm a woman). permalink parent award report block reply Smurfection 5 points 7 days ago Also, no strategy and nothing actionable will ever happen in a meeting.  New York City may have dodged a bullet based on the sheer incompetence of Mamdani. permalink parent award report block reply covfefe_energy 3 points 6 days ago It's going to be as bad as we could imagine. His team will bus-drop Muslim invaders by the thousands. Within these 4 years, we'll be hearing the call to prayer daily in mid-town Manhattan. Every other store will be Halal food, foreign currency exchange, and international phone shops. 100s of \"Asian\" rape crimes. Women won't be able to go anywhere without harassment. Central Park will be abandoned after being filled with sand monkeys and trash. This will be London on steroids. It will happen. permalink parent award report block reply\nParkerFH 8 points 7 days ago Can confirm (I'm a woman). permalink parent award report block reply\nSmurfection 5 points 7 days ago Also, no strategy and nothing actionable will ever happen in a meeting.  New York City may have dodged a bullet based on the sheer incompetence of Mamdani. permalink parent award report block reply\ncovfefe_energy 3 points 6 days ago It's going to be as bad as we could imagine. His team will bus-drop Muslim invaders by the thousands. Within these 4 years, we'll be hearing the call to prayer daily in mid-town Manhattan. Every other store will be Halal food, foreign currency exchange, and international phone shops. 100s of \"Asian\" rape crimes. Women won't be able to go anywhere without harassment. Central Park will be abandoned after being filled with sand monkeys and trash. This will be London on steroids. It will happen. permalink parent award report block reply\n45ichooseu 10 points 7 days ago My first exact thought was this quote. Women might actually lose their voting rights in a few decades. permalink parent award report block reply TheTelltaleFly 5 points 6 days ago The only silver lining to this election. permalink parent award report block reply Abovethefray 1 points 6 days ago ha permalink parent award report block reply EyesSewnShut 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply\nTheTelltaleFly 5 points 6 days ago The only silver lining to this election. permalink parent award report block reply\nAbovethefray 1 points 6 days ago ha permalink parent award report block reply\nEyesSewnShut 1 points 6 days ago Comment removed by community moderators. permalink parent award report block reply\nKlown_Kutz 6 points 6 days ago Women will burn this country to the ground to prevent the blue collar men they despise from enjoying the prosperity we had under the first Trump administration. permalink parent award report block reply\nTheMadHodker1 102 points 7 days ago All liberal women think they know what's best for everyone else. permalink award report block reply 24601 58 points 7 days ago That's because they don't have any children to look after. permalink parent award report block reply ScamBlondie 43 points 7 days ago That demon that just got elected Virginia governor has young daughters and refused to denounce her new AG wishing death upon the children of conservatives. And she’s supposedly a moderate Democrat. permalink parent award report block reply covfefe_energy 2 points 6 days ago It's unreal (because it was stolen). permalink parent award report block reply UCantStumpTheTrump 13 points 7 days ago They have “fur babies” aka child replacements permalink parent award report block reply Klown_Kutz 2 points 6 days ago That’s irrelevant. This is women being women. permalink parent award report block reply Krat 11 points 7 days ago Thats because nobody has shut their mouth up like they do with young boys permalink parent award report block reply JoeCubicle 1 points 6 days ago It's the motherhood instinct that is  unfilled/misplaced. That's also why they have cats, lot's of cats. permalink parent award report block reply\n24601 58 points 7 days ago That's because they don't have any children to look after. permalink parent award report block reply ScamBlondie 43 points 7 days ago That demon that just got elected Virginia governor has young daughters and refused to denounce her new AG wishing death upon the children of conservatives. And she’s supposedly a moderate Democrat. permalink parent award report block reply covfefe_energy 2 points 6 days ago It's unreal (because it was stolen). permalink parent award report block reply UCantStumpTheTrump 13 points 7 days ago They have “fur babies” aka child replacements permalink parent award report block reply Klown_Kutz 2 points 6 days ago That’s irrelevant. This is women being women. permalink parent award report block reply\nScamBlondie 43 points 7 days ago That demon that just got elected Virginia governor has young daughters and refused to denounce her new AG wishing death upon the children of conservatives. And she’s supposedly a moderate Democrat. permalink parent award report block reply covfefe_energy 2 points 6 days ago It's unreal (because it was stolen). permalink parent award report block reply\ncovfefe_energy 2 points 6 days ago It's unreal (because it was stolen). permalink parent award report block reply\nUCantStumpTheTrump 13 points 7 days ago They have “fur babies” aka child replacements permalink parent award report block reply\nKlown_Kutz 2 points 6 days ago That’s irrelevant. This is women being women. permalink parent award report block reply\nKrat 11 points 7 days ago Thats because nobody has shut their mouth up like they do with young boys permalink parent award report block reply\nJoeCubicle 1 points 6 days ago It's the motherhood instinct that is  unfilled/misplaced. That's also why they have cats, lot's of cats. permalink parent award report block reply\ninvalid_data 56 points 7 days ago Isaiah 3:12 Childish leaders oppress my people,\nand women rule over them.\nO my people, your leaders mislead you;\nthey send you down the wrong road. permalink award report block reply UCantStumpTheTrump 25 points 7 days ago Yep, it’s literally a Biblical curse to be ruled over by women permalink parent award report block reply\nUCantStumpTheTrump 25 points 7 days ago Yep, it’s literally a Biblical curse to be ruled over by women permalink parent award report block reply\npatiohimself 37 points 7 days ago Already a great start to this total shitshow permalink award report block reply\nusernamechecksout 30 points 7 days ago How inclusive permalink award report block reply Hanging_Chad 19 points 7 days ago seems exclusive of males permalink parent award report block reply rebuildingMyself 2 points 6 days ago So nothing different from that side of the aisle permalink parent award report block reply Lelleck 4 points 7 days ago And they feel flattered and will tell you how charming this muslim is. permalink parent award report block reply\nHanging_Chad 19 points 7 days ago seems exclusive of males permalink parent award report block reply rebuildingMyself 2 points 6 days ago So nothing different from that side of the aisle permalink parent award report block reply\nrebuildingMyself 2 points 6 days ago So nothing different from that side of the aisle permalink parent award report block reply\nLelleck 4 points 7 days ago And they feel flattered and will tell you how charming this muslim is. permalink parent award report block reply\nbarwhack 29 points 7 days ago An all trans-female team, you say? permalink award report block reply Bendadick_Arnold 6 points 7 days ago Are they lining up for surgery? permalink parent award report block reply barwhack 2 points 7 days ago Nope. Maam Dummy is their GOAT. permalink parent award report block reply\nBendadick_Arnold 6 points 7 days ago Are they lining up for surgery? permalink parent award report block reply barwhack 2 points 7 days ago Nope. Maam Dummy is their GOAT. permalink parent award report block reply\nbarwhack 2 points 7 days ago Nope. Maam Dummy is their GOAT. permalink parent award report block reply\nhere2red 20 points 7 days ago Lina Khan. LOL. If businesses havent packed their bags at the mention of her name I dont know WTF they are waiting for. permalink award report block reply LaptopDied 3 points 7 days ago Yes. Pakistani. Not Jewish. London born. Lawyer. permalink parent award report block reply Lelleck 11 points 7 days ago London is the blueprint permalink parent award report block reply\nLaptopDied 3 points 7 days ago Yes. Pakistani. Not Jewish. London born. Lawyer. permalink parent award report block reply Lelleck 11 points 7 days ago London is the blueprint permalink parent award report block reply\nLelleck 11 points 7 days ago London is the blueprint permalink parent award report block reply\nUsernameChexOut 15 points 7 days ago Dude is gonna get #metoo'd in 3... 2... 1... permalink award report block reply Cuetardian 14 points 7 days ago I don't think they would. That's a Western concept (treating women decently.) The repercussions of daring to accuse a muslim man that they are willingly working for - I don't see that happening. They know damn well the man would never tolerate that. permalink parent award report block reply al-phabitz89 -12 points 7 days ago How retarded to think the west has a copyright on treating women decently. permalink parent award report block reply RyanKeyOh 8 points 7 days ago Who else does it? permalink parent award report block reply _Sully_ 3 points 7 days ago You see, you fell into the trap. Of course other countries treat women \"decently\" but from the eyes of a modern American women they see it as oppression. The reality is the West doesn't treat women decently because it let's a lot of them destroy themselves. permalink parent award report block reply Waterlaw 2 points 7 days ago exectly western countries allow self destructing behaviour to woman. Woman shouldnt be allowed vote tbh permalink parent award report block reply SaltyKrakenBalls 1 points 6 days ago Visit any Muslim ruled nation before you cast stones at a woman’s face. permalink parent award report block reply\nCuetardian 14 points 7 days ago I don't think they would. That's a Western concept (treating women decently.) The repercussions of daring to accuse a muslim man that they are willingly working for - I don't see that happening. They know damn well the man would never tolerate that. permalink parent award report block reply al-phabitz89 -12 points 7 days ago How retarded to think the west has a copyright on treating women decently. permalink parent award report block reply RyanKeyOh 8 points 7 days ago Who else does it? permalink parent award report block reply _Sully_ 3 points 7 days ago You see, you fell into the trap. Of course other countries treat women \"decently\" but from the eyes of a modern American women they see it as oppression. The reality is the West doesn't treat women decently because it let's a lot of them destroy themselves. permalink parent award report block reply Waterlaw 2 points 7 days ago exectly western countries allow self destructing behaviour to woman. Woman shouldnt be allowed vote tbh permalink parent award report block reply SaltyKrakenBalls 1 points 6 days ago Visit any Muslim ruled nation before you cast stones at a woman’s face. permalink parent award report block reply\nal-phabitz89 -12 points 7 days ago How retarded to think the west has a copyright on treating women decently. permalink parent award report block reply RyanKeyOh 8 points 7 days ago Who else does it? permalink parent award report block reply _Sully_ 3 points 7 days ago You see, you fell into the trap. Of course other countries treat women \"decently\" but from the eyes of a modern American women they see it as oppression. The reality is the West doesn't treat women decently because it let's a lot of them destroy themselves. permalink parent award report block reply Waterlaw 2 points 7 days ago exectly western countries allow self destructing behaviour to woman. Woman shouldnt be allowed vote tbh permalink parent award report block reply SaltyKrakenBalls 1 points 6 days ago Visit any Muslim ruled nation before you cast stones at a woman’s face. permalink parent award report block reply\nRyanKeyOh 8 points 7 days ago Who else does it? permalink parent award report block reply\n_Sully_ 3 points 7 days ago You see, you fell into the trap. Of course other countries treat women \"decently\" but from the eyes of a modern American women they see it as oppression. The reality is the West doesn't treat women decently because it let's a lot of them destroy themselves. permalink parent award report block reply Waterlaw 2 points 7 days ago exectly western countries allow self destructing behaviour to woman. Woman shouldnt be allowed vote tbh permalink parent award report block reply\nWaterlaw 2 points 7 days ago exectly western countries allow self destructing behaviour to woman. Woman shouldnt be allowed vote tbh permalink parent award report block reply\nSaltyKrakenBalls 1 points 6 days ago Visit any Muslim ruled nation before you cast stones at a woman’s face. permalink parent award report block reply\nBraujager 13 points 7 days ago Political or sexual transition team? permalink award report block reply\narmyofpedes4usa 11 points 7 days ago How many of them are actually troons? permalink award report block reply\njonnyuno 11 points 7 days ago I wish we would boycott anything related to him.  Let NY sink. permalink award report block reply\nMeddlesom 11 points 7 days ago AKA his harem. permalink award report block reply\nmaleitch 10 points 7 days ago https://www.jfrej.org/news/2025/06/jews4zohran permalink award report block reply ScamBlondie 5 points 7 days ago Cows for steak. permalink parent award report block reply ShadowInv 4 points 7 days ago Aren’t they the landlords that he is trying to save the youth from? permalink parent award report block reply\nScamBlondie 5 points 7 days ago Cows for steak. permalink parent award report block reply\nShadowInv 4 points 7 days ago Aren’t they the landlords that he is trying to save the youth from? permalink parent award report block reply\nkeeponwinning 10 points 7 days ago All born female?   Transphobe. permalink award report block reply\nFrenFinder 9 points 7 days ago Socialists know their target demographic. It also work for the islamic side to make them think anything but subjugation comes with islam. permalink award report block reply\nLaWhoreVagistani 9 points 7 days ago 50% women and the other 50% are men identifying as women permalink award report block reply\nIcepck 8 points 7 days ago Oh, they will argue and chamge nothing substantial, at best, or make things worse than male communists. permalink award report block reply\nknnbccb 7 points 7 days ago No diaperhead among them? permalink award report block reply UsernameChexOut 8 points 7 days ago First name listed is Khan... lol permalink parent award report block reply LaptopDied 3 points 7 days ago Pakistani. Not Jewish. Lawyer. London born. permalink parent award report block reply TennesseeBorn 5 points 7 days ago A London born Muslim permalink parent award report block reply LaptopDied 2 points 7 days ago Yes. permalink parent award report block reply ozgroginexile 5 points 7 days ago Using the London playbook, gotta have someone to oversee that permalink parent award report block reply\nUsernameChexOut 8 points 7 days ago First name listed is Khan... lol permalink parent award report block reply LaptopDied 3 points 7 days ago Pakistani. Not Jewish. Lawyer. London born. permalink parent award report block reply TennesseeBorn 5 points 7 days ago A London born Muslim permalink parent award report block reply LaptopDied 2 points 7 days ago Yes. permalink parent award report block reply ozgroginexile 5 points 7 days ago Using the London playbook, gotta have someone to oversee that permalink parent award report block reply\nLaptopDied 3 points 7 days ago Pakistani. Not Jewish. Lawyer. London born. permalink parent award report block reply TennesseeBorn 5 points 7 days ago A London born Muslim permalink parent award report block reply LaptopDied 2 points 7 days ago Yes. permalink parent award report block reply ozgroginexile 5 points 7 days ago Using the London playbook, gotta have someone to oversee that permalink parent award report block reply\nTennesseeBorn 5 points 7 days ago A London born Muslim permalink parent award report block reply LaptopDied 2 points 7 days ago Yes. permalink parent award report block reply\nLaptopDied 2 points 7 days ago Yes. permalink parent award report block reply\nozgroginexile 5 points 7 days ago Using the London playbook, gotta have someone to oversee that permalink parent award report block reply\nCmonGubMintGibMe 6 points 7 days ago Lol oh man this is gonna go so badly permalink award report block reply\nHanging_Chad 6 points 7 days ago kek permalink award report block reply\nIncredibleMrE1 6 points 7 days ago kek permalink award report block reply\nGunmolester 6 points 7 days ago HAHAHAHAHAHAHAHAHAHAHAHAHAHAHA permalink award report block reply\ndorkana 5 points 7 days ago lolllllll permalink award report block reply\nythehorses 5 points 7 days ago Except none will be women. All trannies. permalink award report block reply\nElectricDragon- 5 points 7 days ago Faggot energy permalink award report block reply\nmateus 5 points 7 days ago Hilarious. A Democrat mayor-elect publicly announcing he's going to violate EEOC laws. Someone should tell him those WANTED:FEMALE/WANTED:MALE employment adds became verboten before he was born.\nMen wanting the job should just put on a skirt and wig and \"identify\" as women. 😂 permalink award report block reply\nBoomShtick 5 points 7 days ago And here …. We…. Go permalink award report block reply Saltyminer11 5 points 7 days ago Popcorn: check, butter: check..... permalink parent award report block reply TheRedPike 4 points 7 days ago Dont forget the salt. permalink parent award report block reply Saltyminer11 3 points 7 days ago 🤣 permalink parent award report block reply\nSaltyminer11 5 points 7 days ago Popcorn: check, butter: check..... permalink parent award report block reply TheRedPike 4 points 7 days ago Dont forget the salt. permalink parent award report block reply Saltyminer11 3 points 7 days ago 🤣 permalink parent award report block reply\nTheRedPike 4 points 7 days ago Dont forget the salt. permalink parent award report block reply Saltyminer11 3 points 7 days ago 🤣 permalink parent award report block reply\nSaltyminer11 3 points 7 days ago 🤣 permalink parent award report block reply\nMinneMAGA 5 points 7 days ago Someone told him all the democrat women have penises, right? permalink award report block reply\nSavingPrivateGrace 5 points 7 days ago More like A New Error.  He's 34, never had a job and has no friends. permalink award report block reply\nGuerillaYourDreams 5 points 7 days ago Are they all going to transition to male? permalink award report block reply\nFeistyCrawfish 4 points 7 days ago Ah yes, the harem permalink award report block reply\nkeeman 4 points 7 days ago This will be a glorious disaster.  To teach a lesson to the world how this woke commie islamist crap ends up.  Sorry NYC, you are the demonstration subject.  But then, you (allegedly) voted for it. permalink award report block reply\nMajorClark 4 points 7 days ago all female transitioning to males? permalink award report block reply\nSnek_Plissken 4 points 7 days ago I hope they are wearing hijabs. permalink award report block reply\nRoughBoy 4 points 7 days ago Females made him a mayor permalink award report block reply\nPatrioticVideo 4 points 7 days ago Mothers Of Society for which all females must model their lives.  It is a holy commandment.  Do not veer from the Great Message.  Elder Father Mandami is here.  Compliance is no longer optional. permalink award report block reply\nImpeachThisBitch 4 points 7 days ago Bears! He’s put the whole city in danger. permalink award report block reply\nKungPaoMcChicken 4 points 7 days ago He wants to be as close as possible to the puss. permalink award report block reply\nChickenStrips 4 points 7 days ago Seems to be a trend… there are A LOT of women in politics on the west coast. Kamikazes permalink award report block reply\nRoadpower 4 points 7 days ago This guy is going to fuck up this city so bad, lol. I'm only laughing because he is off to a royal start. We are really fucked this time around. Oh well, things gonna have to play out as they going to play out. permalink award report block reply\nWtf_socialismreally 3 points 7 days ago Because they're subservient to men, and he knows they'll be subservient to him. Even though I'm not sure he's much of a man really. permalink award report block reply\nJoeFromHR 3 points 7 days ago Seems discriminatory against males. Can't wait for this clusterfuck to implode. permalink award report block reply\nobar1 3 points 6 days ago because they are the easiest to be manipulated and no one of them will say shit coz the fear to be seen as a contrarian permalink award report block reply\nokboomer59 3 points 6 days ago And suddenly they all know what a woman is. permalink award report block reply\nyourheadasplode 3 points 7 days ago What about transwomen? permalink award report block reply\npaullyj67in24 3 points 7 days ago sweden did this and its at the top of rapes per capita by country  although UK might have passed them permalink award report block reply\nObambi 3 points 7 days ago 99 percent of Women are idiots permalink award report block reply\nBeat_to_Quarters 2 points 6 days ago The clown show starts immediately. permalink award report block reply\nElectrician 2 points 6 days ago Good lord…imagine what a train wreck that’s gonna be. LOL permalink award report block reply\nReturningtogod 2 points 6 days ago What could possibly go wrong? permalink award report block reply\nLemonhead965 2 points 7 days ago Are the women transitioning. Watch it be mostly poc troons permalink award report block reply\nFrmrAmericanRepublic 2 points 6 days ago This will go about as well as the all-female engineering team that made the pedestrian bridge - which promptly collapsed. permalink award report block reply\nDontTreadOnSnek 2 points 7 days ago How many are \"trans\"? permalink award report block reply\njiujiujiu 2 points 7 days ago Checks in boxes for these people. What’s the point other than to cripple and humiliate our country? permalink award report block reply\nKTGArtist 2 points 6 days ago This POS is already tiresome. A harem? Lovely. How muzzy of you.\nHow long before we have prayer that shuts down Wall Street, with Mister Muzzy Commie Mayor at the head? permalink award report block reply\nZippythekid 2 points 7 days ago God help the decent people of New York the rest deserve what they get. permalink award report block reply\nThouShallNotSteal 1 points 6 days ago Female goats? permalink award report block reply\nxkgb 1 points 6 days ago Female transition? permalink award report block reply\nSurveilThis 1 points 7 days ago One catch - only FGM ladies need apply. permalink award report block reply\nDrewJackson 1 points 6 days ago A Beastly Harem.    That smell. permalink award report block reply\nHambonemcgee 1 points 6 days ago Makes you wonder what sort of Muslim would do that? permalink award report block reply\nKlaus73 1 points 7 days ago Does one of them have like G cup tits wear shades and never speak?  ( bonus if someone gets the movie ref) permalink award report block reply\nemorphia 1 points 7 days ago he wants concubines it seems. permalink award report block reply\nIAmDisappoint 1 points 7 days ago LOL that is not discriminatory at all. Imagine if it was the other way around. permalink award report block reply\nLakeAmeritaga 1 points 7 days ago now he wants funding for his harem permalink award report block reply\nShitonprogressives 1 points 7 days ago What is a woman you fucking commie bigot /s permalink award report block reply\nTexasBrowncoat 1 points 6 days ago Are these the 72 virgins that he was promised, or are there 7 of them and they all rate a '2'? permalink award report block reply\nTophat9000 1 points 7 days ago The handmaidens permalink award report block reply\nSteve56775 1 points 7 days ago Is that like 27 virgins? permalink award report block reply\nPrandogolio 1 points 7 days ago I think all communists should be shot, even if they are women. permalink award report block reply\nPsarg 1 points 7 days ago Women and gay guys are Antifa'a leaders.  Then come straight guys.  Troons are the foot soldiers. permalink award report block reply\nlearntocode 1 points 7 days ago His is coming with a crew of nation wreckers. This coven of witched is going to dismantle Americas banking capitol. This is a HUGE national crisis. All of our financial transactions pass through New York. permalink award report block reply\nAbrahamLincoln 1 points 6 days ago How many cats are on the transition team? permalink award report block reply\nPerseverant 1 points 7 days ago Wow, he opted for only half of a transition team that is intellectually deficient (according to Islam). permalink award report block reply\nBusterHyman99 1 points 7 days ago 😂 the policies will be better than I thought permalink award report block reply\nRetardloserimsogay 1 points 7 days ago I seen this earlier today. They are the mayor, he has no clue what to do and it's obvious. This is going to a mayoral committee and they'll get their orders from nameless faceless DSA high ups. permalink award report block reply\nsod_off_shotgun 1 points 6 days ago What about diversity? Or does that mean it's 100% diverse? permalink award report block reply\nxkgb 1 points 7 days ago What's a woman? permalink award report block reply\nJehsun 1 points 7 days ago Well if that's the case we may be alright. He may not ever get into office permalink award report block reply\nWassermanSchultz 1 points 7 days ago I'm sure some of those women have transitioned, too. permalink award report block reply\nRedPillDropper 1 points 6 days ago Oh, so his harem? permalink award report block reply\nTooBright 1 points 6 days ago So... Men? permalink award report block reply\nuniformist 1 points 7 days ago Next week they’re all going out to get nose rings and dye their hair blue. permalink award report block reply\ndarkmatter1985 1 points 6 days ago How long before \"Escape from NY\" is a reality? 1 year? permalink award report block reply\nFerretman 1 points 7 days ago Idiot permalink award report block reply\nfjzappa 1 points 6 days ago What is a woman? permalink award report block reply\nQuiznos585 1 points 7 days ago LMAO permalink award report block reply\nMakeAmericaVapeAgain 1 points 7 days ago are they still leaning into this shit? isn’t it enough that he is a dem sociopath and brown? permalink award report block reply\nPotatusHead 1 points 7 days ago You mean \"Transitioning Team\". permalink award report block reply\nProbably_tryna_sleep 1 points 7 days ago Ooooof. Buncha women without hijab doing official business?!!? Dudes immediately alienating the dunecoon vote lol. We taking bets on when the first vest clacks off in time square? permalink award report block reply\nAut_MAGA_Aut_Nihil 1 points 7 days ago He can call his “transition” team the Ma’amdummies. permalink award report block reply\nRoof_Korean 1 points 7 days ago We're reaching levels of pandering and Taqiyya I never thought possible. permalink award report block reply\ncorntortilla 1 points 7 days ago That doesn’t sound very Islamic. When do we get to the Islamic anti women stuff? Tomorrow? Maybe in two weeks? When do we get burkas for lib women? Waiting. permalink award report block reply\nhillaryforprison 1 points 7 days ago like a harem. permalink award report block reply\nJonald_Trump 1 points 6 days ago Sounds discriminatory permalink award report block reply\nflashersenpai 1 points 6 days ago He's not an islamist. He's a shitlib play acting just like Bernie and AOC permalink award report block reply\nncswicn 1 points 7 days ago Next week he'll announce the new team uniform aka burqa and for casual Friday's a hijab! 😜 permalink award report block reply\nShaffro 1 points 7 days ago I am so blessed I don't live in that third world shit hole. permalink award report block reply\nBramage 1 points 7 days ago Figures since he's a beta cuck. permalink award report block reply\nReclaimer69 1 points 6 days ago Ask them how long it has been since they've transitioned. Plz record. permalink award report block reply\ndres3 1 points 7 days ago Mammy's Harem. permalink award report block reply\n5DchessWatch 1 points 6 days ago Why aren't they wearing their durkadurkas? permalink award report block reply\nBobDolesBanana 1 points 7 days ago Nobody cares. permalink award report block reply EvensoAmen 1 points 7 days ago https://dailycaller.com/2025/11/05/mamdani-spanberger-mikie-sherrill-helen-andrews-young-women-liberal-leftism-democrats-social-children/ permalink parent award report block reply BobDolesBanana 1 points 7 days ago If you read the article then you would have read: \"It serves to remember that a huge majority of women vote Democrat because their phone told them that voting Republican is low class. That is the sum total of their belief system.\" Women don't vote for candidates who have all women cabinets. They vote for what emotionally fits their current state of mind. permalink parent award report block reply\nEvensoAmen 1 points 7 days ago https://dailycaller.com/2025/11/05/mamdani-spanberger-mikie-sherrill-helen-andrews-young-women-liberal-leftism-democrats-social-children/ permalink parent award report block reply BobDolesBanana 1 points 7 days ago If you read the article then you would have read: \"It serves to remember that a huge majority of women vote Democrat because their phone told them that voting Republican is low class. That is the sum total of their belief system.\" Women don't vote for candidates who have all women cabinets. They vote for what emotionally fits their current state of mind. permalink parent award report block reply\nBobDolesBanana 1 points 7 days ago If you read the article then you would have read: \"It serves to remember that a huge majority of women vote Democrat because their phone told them that voting Republican is low class. That is the sum total of their belief system.\" Women don't vote for candidates who have all women cabinets. They vote for what emotionally fits their current state of mind. permalink parent award report block reply\nTooHotToFrost 1 points 6 days ago All white meat chicken nuggets permalink award report block reply\ntuaris 1 points 7 days ago Oh my. permalink award report block reply\nMudDog 1 points 7 days ago all transitioning transition team! permalink award report block reply\nOodles 1 points 7 days ago Much easier to control. You can leverage their empathy to convince them to commit genocide permalink award report block reply\nConsrvspkgNJ 1 points 6 days ago Naaah, this is just to throw people off the scent. This is something they can point to when they get called misogynist when they implement Sharia law that says women are forbidden to work and must wear a burkha outdoors and can never walk alone without a man escorting them. permalink award report block reply\nC0drus 1 points 7 days ago Sounds like he’s “Transitioning”, just look what happened to Bruce Jenner when he had a bunch of women around him 🤣 permalink award report block reply\nBeer-_-Belly 1 points 6 days ago If there is one thing that Muslims are known for it is uplifting women. permalink award report block reply\npatrioticwinning3 1 points 7 days ago His mooslim constituents are already getting their stones ready :p permalink award report block reply\nGreyKnight 1 points 7 days ago “See. I’m not a radical Muslim” permalink award report block reply MAGAguitar OP 2 points 7 days ago Taqiyya permalink parent award report block reply\nMAGAguitar OP 2 points 7 days ago Taqiyya permalink parent award report block reply\nSGT_Glowie 1 points 7 days ago That’s to distract from the fact he doesn’t believe women should have rights lol permalink award report block reply\nJackOfAllTirades 1 points 6 days ago Islam is going to rubbed into the faces of New Yorkers every moment of the next 4 years. permalink award report block reply\njournalist 1 points 7 days ago This is going to be a disaster of historic proportions. permalink award report block reply\npermissible_missile 1 points 7 days ago If you think that's going to work, I've got a South Florida bridge to sell ya permalink award report block reply\nHockeyMom4Trump 1 points 7 days ago I wonder if any of his all women transition team have penises permalink award report block reply\nwhitman_99 1 points 6 days ago So the transition team will all be wearing burkas? permalink award report block reply\nSimaYi 1 points 7 days ago his harem? permalink award report block reply\nRedeemable 1 points 6 days ago He is forming his harem and the women have no idea. permalink award report block reply\nTheWhitestOfFangs 1 points 6 days ago Islam allows multiple wives... permalink award report block reply\nAquamine-Amarine 1 points 7 days ago Leftist women are retarded. Don't be surprised they turn out this way when the education system is run by leftists. permalink award report block reply\nTLMFR 1 points 6 days ago Sooo... a bunch of dudes pretending to be chicks? permalink award report block reply\n1_Badcop 0 points 7 days ago Are they all his wives? permalink award report block reply"}