{"id": "8170770", "contents": "1738 He stopped spinning in his grave to send this message posted 6 days ago by Now_On_to_Mars 80 comments award share download report block\n80 comments Sort by Top Top New Worst Old Save OutlawPurpleHairDye 115 points 6 days ago McCarthy was right, Hollywood is full of commies.  If anything, he probably underestimated the infiltration. permalink award report block reply BeauHD 73 points 6 days ago The commies owned the media and gave him a bad name. permalink parent award report block reply midgetpornrocks 40 points 6 days ago They still own the media. permalink parent award report block reply Aquamine-Amarine 31 points 6 days ago And the education system. permalink parent award report block reply Solo_Dad 24 points 6 days ago And the judicial system. permalink parent award report block reply view 4 more comments... Returningtogod 12 points 6 days ago They absolutely own the law schools. What our young lawyers are being taught, and what they are NOT being taught, only exacerbates the situation we are in. permalink parent award report block reply bejeavis 13 points 6 days ago They were balls deep (and believe it or not, very gay) in the state department too. permalink parent award report block reply Judenfrei 1 points 6 days ago A good read. https://archive.org/details/B-001-002-034/mode/1up permalink parent award report block reply Govtizbad 19 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply bck- 42 points 6 days ago McCarthy died at the age of  48 with a cause of death still in question. Meanwhile his seat was held by a Democrat for 50+ years. permalink parent award report block reply FKH2 24 points 6 days ago He got Charlie Kirked permalink parent award report block reply Klaus73 8 points 6 days ago When is the autopsy? permalink parent award report block reply chickeninoven -9 points 6 days ago Ask Erika \"Hot Pants\" permalink parent award report block reply Bigdeal 13 points 6 days ago Biggest problem was all the commies ended up being Jewish. So Roy Cohn ended up tricking Mccarthy into blaming the wrong people as being commies to discredit the very good work McCarthy had been doing. permalink parent award report block reply InternetSolutions 2 points 6 days ago Biggest problem was all the commies ended up being Jewish. So Roy Cohn ended up tricking Mccarthy into blaming the wrong people as being commies to discredit the very good work McCarthy had been doing. Newbie question: Could you elaborate on this? He got tricked into blaming jews or non-jews or am I misunderstanding your statement entirely? permalink parent award report block reply HazelHen 11 points 6 days ago You can start by confirming the fact that Jews were crazily over represented in the early Soviet government and were the majority in almost all institutions of power until Stalin’s purges. Second, the failed Bolshevik revolution in Germany was basically lead only by Jews, just check Wikipedia and early life of the leaders. Next to last, see what Solzhenitsyn has to say about Jews and their role in the revolution, mass killings and terror (check out the ethnicities of who slaughtered the Russian royal family and who desecrated the corpses). Lastly, who betrayed the US and gave our nuclear secrets to the Soviets? Who are the Frankfurt School (predecessor to cultural Marxism/woke/anti-white). permalink parent award report block reply mohel 7 points 6 days ago This is hardly ever mentioned now - American married couple Julius and Ethel Rosenberg permalink parent award report block reply Bigdeal 2 points 6 days ago The real downfall of McCarthy happened after McCarthy foolishly went after the Army at the behest of Cohn. Some say Cohn did it because was he was upset about not getting a direct commision for a Private G. David Schine others may say Cohn did it to save his tribe that had an outsized membership in the communist party. permalink parent award report block reply PapaPepe 8 points 6 days ago He was right and he didn't go far enough. permalink parent award report block reply sordfysh PRO 6 points 6 days ago I don't think God gives a nation a pass on rejecting truth when they give the excuse, \"I was just trusting what the news and public school told me.\" Notice how a neighborhood in Chicago can have a dozen mass shootings in a month and the local news will not report on it. This has been happening for many decades, and it should have been obvious that something was seriously wrong when normal people found out these things weren't being reported. I tell you what, the Communists see these shootings happen, and they talk about it. When they are the only ones talking about it, they bring a lot of people over to their side. Trump saw these shooting happen, and he talked about it in 2016. It made him very popular. Bringing the national guard into Memphis to clean up crime has been one of the biggest wins of the year for the Republican party, and yet nobody talks about it. That's why Republicans lose. permalink parent award report block reply Aambrick 2 points 6 days ago Its not that they don't talk about it, but its when they start that everyone else do their best to silence it via silencing, discrediting, or even being so loud on other topics which falls under not reporting or making it so minimal in time spent that just a paragraph mentioned at the bottom of the screen on tv or in a news feed on a smart phone. Its the fact we stopped calling the media fake news that they regained a foothold. permalink parent award report block reply load 8 more comments... IncredibleMrE1 53 points 6 days ago This man was a patriot. permalink award report block reply Govtizbad 18 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply OTher55 40 points 6 days ago McCarthy said nothing wrong permalink award report block reply AliceCooperBiden 14 points 6 days ago He actually just told the absolute truth and they killed him for it. permalink parent award report block reply Covfefe_Commando 1 points 6 days ago Tailgunner Joe was never wrong! permalink parent award report block reply Pyroth5687 29 points 6 days ago The problem he didn't see was that tens of millions of foreigners would flood our country for handouts and vote to get more. permalink award report block reply mark2398 8 points 6 days ago That's the deal, people keep saying the New Yorkers voted for this.   That's not the whole story when you have half the city flooded with immigrants that can't even speak English.  They want free stuff and to bring their families over to the USA.  Democrats will let them do this.  There isn't enough white Americans to stop it from happening. permalink parent award report block reply Viewer01 2 points 6 days ago NYC voted to be displaced. permalink parent award report block reply Govtizbad 24 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply Cuetardian 13 points 6 days ago The concept of \"treat everyone fairly and equally\" is part of Western civilization. The parable Jesus told of the Good Samaritan was meant to teach this idea. You will not find this outlook in other religions or political systems. Virtually everywhere else, it is perfectly normal and actually expected that you can treat outsiders any way you like. You can cheat them, lie to them, steal from them, use them, buy them, sell them, and even kill them without consequence. As long as you treat your own immediate family well, and your own small tribe well, using outsiders is just the way life is. It's how you survive and, sometimes, grow rich. But those in the West do not understand that. They think everybody is just like we are and follows all the same rules. They don't. Not even close. And even if they claim to be Christian/Catholic, many, many people in South and Central America trace their ancestors to the Mayans and Aztecs, two very bloodthirsty cultures. (Drug cartels are the descendants of those same groups.) permalink parent award report block reply CommanderOfCheese 4 points 6 days ago We're all reading the parable of the Good Samaritan wrong. The Levite and the Pharisee in the parable rightly saw the potential \"charity\" trap -- helping such a person would likely in reality lead to being robbed, and indeed the injured man may likely have been part of such a trap. The Good Samaritan is not just some strange rando who we're supposed to accept as the model of a perfect person. The Good Samaritan is the Savior Himself. He came prepared not just for a random encounter, but rather specifically for the injured man, prepared for his injuries, transport and to provide for his care. Who are YOU in the parable? YOU are the \"certain man\" who is set upon by thieves, left bruised and broken for Jesus to pick you up. permalink parent award report block reply KernalMustard 1 points 6 days ago a crown of love is being twined for him who loves his neighbour permalink parent award report block reply Long_time_lurker 3 points 6 days ago The concept of \"treat everyone fairly and equally\" is part of Western civilization. I think it's part of how we got our civilization, by being better at cooperating, despite everything.  And now we have people joining it for benefits and instead diluting the trust which makes people willing to cooperate in the first place instead of assimilating. Then we have the pro-crime commies and few consequences for being arrested 127 times, when such people need to be removed from society. permalink parent award report block reply HazelHen 3 points 6 days ago One day, you may mature and realize all of politics and civilization itself boils down to tribe, to kin, to biology. Western civilization’s forms of government only work in an ethnically homogeneous, high-trust society (both of these correlate). This has been known even since antiquity as Ancient Greek writers explicitly discussed this because they had observations of their own.\nEverything is downstream of how homogeneous a society is. Hell, even the character of the US started to shift, potentially for the worse, when it deviated form the founding WASP stock with the importations of other Europeans. Today, the US in its current form is lost cause without currently unthinkable repatriations, or complete politicsl separation, of nons and all those tainted with the mind virus. permalink parent award report block reply InternetSolutions 3 points 6 days ago Virtually everywhere else, it is perfectly normal and actually expected that you can treat outsiders any way you like. You can cheat them, lie to them, steal from them, use them, buy them, sell them, and even kill them without consequence. Well said. When rich arab countries recruit foreign laborers from India or Philippines, it is common to essentially enslave them by indebting them for the cost of food & rent, then making them \"earn\" their way out of debt and sent home 2-3 years later with little money to show for it. The arab companies also hold onto their money, passports, travel documents, and any other important paperwork that would let them go back to their home country. permalink parent award report block reply BeauHD 1 points 6 days ago Don't feed the bots, man! permalink parent award report block reply Govtizbad 4 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply Decepticons-superior 4 points 6 days ago Reminds me of those two idiots who quit their fancy jobs and decided to ride bicycles across the continents. They kept a diary and everything went fairly well, until they got to ISIS territory. You can guess what happened next. Here’s a link to the story. They looked exactly the way you would think they would look. She even called her boyfriend her “partner.” https://archive.is/u1W5d permalink parent award report block reply glow-operator-2-0 1 points 6 days ago they can't comprehend that the rest of the world doesn't necessarily share their values Robert Young Pelton knows. permalink parent award report block reply HeavyMetalPatriot 4 points 6 days ago Very few Turd Worlders can assimilate to the First World. Instead they become a resentful underclass to be exploited by the power hungry and used as weapons. This is reality. permalink parent award report block reply Govtizbad 3 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply HeavyMetalPatriot 1 points 6 days ago A failed country permalink parent award report block reply RogueLeaderX 14 points 6 days ago Man was an absolute hero, who was mustered by globalists! permalink award report block reply elmerecido 12 points 6 days ago McCarthy Did Nothing Wrong. Change my mind. permalink award report block reply BoomShtick 8 points 6 days ago If anything, the only thing he did wrong was using half measures on these commie fucks. Should have been televised executions for treasonous behavior permalink parent award report block reply mohel 9 points 6 days ago He was sabotaged by Roy Cohn who used David Schine to take wind off the momentum they had during army hearings https://en.wikipedia.org/wiki/Army%E2%80%93McCarthy_hearings permalink award report block reply SavingPrivateGrace 8 points 6 days ago He didn't get to see the full peak of globo, social, hommo, commie, marxist, muzzies our government created, and nothing ever happened to the traitors. permalink award report block reply starjello 7 points 6 days ago Joe McCarthy was absolutely right and so was Father Coughlin. They were both vilified even back in those days. You imagine now what will be said about them if they were alive and preaching the same truth. permalink award report block reply Pied-Trumper 5 points 6 days ago “Ashkenazi Jews or Ashkenazim form a distinct subgroup of the Jewish diaspora, that emerged in the Holy Roman Empire in the Early Middle Ages, originating from the Jewish communities who lived in the 10th century in the Rhineland valley and in neighbouring France before they migrated eastward to Slavic lands after the Crusades during the 11th and 13th centuries.” ah permalink award report block reply PhantomShield72 5 points 6 days ago Needs to be issued a posthumous award for his work. He was right about it all... permalink award report block reply MeMargie 4 points 6 days ago Know that feeling :( permalink award report block reply SteelDriver 3 points 6 days ago We need to have a McCarthy to rid us of the Islamic Jihadist scourge.  ...maybe toss out some white lefties while we're at it. permalink award report block reply Deporter 3 points 6 days ago Yet, I frequently hear rightwingers use his name as a disparagment. I've even heard Don Jr. do it. permalink award report block reply StruggleSession 3 points 6 days ago It's complicated. The theory presented in the book The Devil's Chessboard suggests that Senator Joseph McCarthy was initially a covertly managed asset for the powerful Dulles brothers: Allen Dulles, Director of the CIA, and John Foster Dulles, Secretary of State. Rather than being a purely independent crusader against communism, McCarthy allegedly received leaked intelligence from the Dulles network. This information served a dual purpose: first, it validated McCarthy's public anti-communist standing during the heightened Cold War fear; second, and more critically, it allowed the Dulles-led security state to strategically purge its political and organizational enemies from government agencies by branding them as security risks or communist sympathizers. McCarthy was, in this view, a useful political bomb employed to restructure the federal bureaucracy to their liking. McCarthy's career began to unravel when he lost the crucial support of the intelligence establishment. The turning point came when the Senator began to set his sights and investigative crosshairs on the very agencies that had tacitly supported him, particularly the CIA. Allen Dulles viewed any scrutiny of the CIA as a fundamental threat to its secret operations and independence, making McCarthy a liability rather than an asset. By challenging the institution that the Dulles brothers had built into a self-governing power, McCarthy signaled his loss of control and his new status as a dangerous rogue element. The final act of McCarthy's professional demise was his public attack on the U.S. Army, culminating in the televised Army-McCarthy Hearings. This aggressive action alienated him from the military and, crucially, from President Dwight D. Eisenhower. With the CIA refusing to feed him information, and the Executive Branch and military establishment actively opposing him, McCarthy had lost his political shield and operational intelligence source. His increasingly erratic behavior during the hearings exposed him to public condemnation, leading directly to his censure by the Senate and the effective end of his influential, yet controversial, career. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Thank you! permalink parent award report block reply anon2309011 3 points 6 days ago We let them stop him with a new made up \"ism\". permalink award report block reply MkultraUSA 3 points 6 days ago He was in the Senate and had nothing to do with HUAC, He was concerned about the state department and the department of the Army. The thing that is crazy is the left 1984ed him into a word that means going after actors and writers. That was the House Unamerican Activity Committee not him. We all use it today and know its dumb meaning but not about the actual guy and what he did which was awesome and based. permalink award report block reply TheSonOfGadsden 2 points 6 days ago And every history book I had in social studies and US history when I was in school painted him in a bad light. McCarthy was right. All commies must hang! permalink award report block reply Mkgoenti 2 points 6 days ago Even nancy pelosi decided to call it quits HAHAHAHAHAHA permalink award report block reply AntiCommieAktion 2 points 6 days ago Of course he was right. Only problem is that nobody gives a shit for what he had to say. permalink award report block reply MemoryHoleyeO 1 points 6 days ago I remember McCarthy being a crazy lunatic in the high school history books way back in early 2000s permalink award report block reply Steve56775 1 points 6 days ago I remember his famous line “are you now or have you ever been a member of the communist party?” permalink award report block reply BillyBobJimmyJoe 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply\nOutlawPurpleHairDye 115 points 6 days ago McCarthy was right, Hollywood is full of commies.  If anything, he probably underestimated the infiltration. permalink award report block reply BeauHD 73 points 6 days ago The commies owned the media and gave him a bad name. permalink parent award report block reply midgetpornrocks 40 points 6 days ago They still own the media. permalink parent award report block reply Aquamine-Amarine 31 points 6 days ago And the education system. permalink parent award report block reply Solo_Dad 24 points 6 days ago And the judicial system. permalink parent award report block reply view 4 more comments... Returningtogod 12 points 6 days ago They absolutely own the law schools. What our young lawyers are being taught, and what they are NOT being taught, only exacerbates the situation we are in. permalink parent award report block reply bejeavis 13 points 6 days ago They were balls deep (and believe it or not, very gay) in the state department too. permalink parent award report block reply Judenfrei 1 points 6 days ago A good read. https://archive.org/details/B-001-002-034/mode/1up permalink parent award report block reply Govtizbad 19 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply bck- 42 points 6 days ago McCarthy died at the age of  48 with a cause of death still in question. Meanwhile his seat was held by a Democrat for 50+ years. permalink parent award report block reply FKH2 24 points 6 days ago He got Charlie Kirked permalink parent award report block reply Klaus73 8 points 6 days ago When is the autopsy? permalink parent award report block reply chickeninoven -9 points 6 days ago Ask Erika \"Hot Pants\" permalink parent award report block reply Bigdeal 13 points 6 days ago Biggest problem was all the commies ended up being Jewish. So Roy Cohn ended up tricking Mccarthy into blaming the wrong people as being commies to discredit the very good work McCarthy had been doing. permalink parent award report block reply InternetSolutions 2 points 6 days ago Biggest problem was all the commies ended up being Jewish. So Roy Cohn ended up tricking Mccarthy into blaming the wrong people as being commies to discredit the very good work McCarthy had been doing. Newbie question: Could you elaborate on this? He got tricked into blaming jews or non-jews or am I misunderstanding your statement entirely? permalink parent award report block reply HazelHen 11 points 6 days ago You can start by confirming the fact that Jews were crazily over represented in the early Soviet government and were the majority in almost all institutions of power until Stalin’s purges. Second, the failed Bolshevik revolution in Germany was basically lead only by Jews, just check Wikipedia and early life of the leaders. Next to last, see what Solzhenitsyn has to say about Jews and their role in the revolution, mass killings and terror (check out the ethnicities of who slaughtered the Russian royal family and who desecrated the corpses). Lastly, who betrayed the US and gave our nuclear secrets to the Soviets? Who are the Frankfurt School (predecessor to cultural Marxism/woke/anti-white). permalink parent award report block reply mohel 7 points 6 days ago This is hardly ever mentioned now - American married couple Julius and Ethel Rosenberg permalink parent award report block reply Bigdeal 2 points 6 days ago The real downfall of McCarthy happened after McCarthy foolishly went after the Army at the behest of Cohn. Some say Cohn did it because was he was upset about not getting a direct commision for a Private G. David Schine others may say Cohn did it to save his tribe that had an outsized membership in the communist party. permalink parent award report block reply PapaPepe 8 points 6 days ago He was right and he didn't go far enough. permalink parent award report block reply sordfysh PRO 6 points 6 days ago I don't think God gives a nation a pass on rejecting truth when they give the excuse, \"I was just trusting what the news and public school told me.\" Notice how a neighborhood in Chicago can have a dozen mass shootings in a month and the local news will not report on it. This has been happening for many decades, and it should have been obvious that something was seriously wrong when normal people found out these things weren't being reported. I tell you what, the Communists see these shootings happen, and they talk about it. When they are the only ones talking about it, they bring a lot of people over to their side. Trump saw these shooting happen, and he talked about it in 2016. It made him very popular. Bringing the national guard into Memphis to clean up crime has been one of the biggest wins of the year for the Republican party, and yet nobody talks about it. That's why Republicans lose. permalink parent award report block reply Aambrick 2 points 6 days ago Its not that they don't talk about it, but its when they start that everyone else do their best to silence it via silencing, discrediting, or even being so loud on other topics which falls under not reporting or making it so minimal in time spent that just a paragraph mentioned at the bottom of the screen on tv or in a news feed on a smart phone. Its the fact we stopped calling the media fake news that they regained a foothold. permalink parent award report block reply load 8 more comments...\nBeauHD 73 points 6 days ago The commies owned the media and gave him a bad name. permalink parent award report block reply midgetpornrocks 40 points 6 days ago They still own the media. permalink parent award report block reply Aquamine-Amarine 31 points 6 days ago And the education system. permalink parent award report block reply Solo_Dad 24 points 6 days ago And the judicial system. permalink parent award report block reply view 4 more comments... Returningtogod 12 points 6 days ago They absolutely own the law schools. What our young lawyers are being taught, and what they are NOT being taught, only exacerbates the situation we are in. permalink parent award report block reply bejeavis 13 points 6 days ago They were balls deep (and believe it or not, very gay) in the state department too. permalink parent award report block reply Judenfrei 1 points 6 days ago A good read. https://archive.org/details/B-001-002-034/mode/1up permalink parent award report block reply Govtizbad 19 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nmidgetpornrocks 40 points 6 days ago They still own the media. permalink parent award report block reply Aquamine-Amarine 31 points 6 days ago And the education system. permalink parent award report block reply Solo_Dad 24 points 6 days ago And the judicial system. permalink parent award report block reply view 4 more comments... Returningtogod 12 points 6 days ago They absolutely own the law schools. What our young lawyers are being taught, and what they are NOT being taught, only exacerbates the situation we are in. permalink parent award report block reply\nAquamine-Amarine 31 points 6 days ago And the education system. permalink parent award report block reply Solo_Dad 24 points 6 days ago And the judicial system. permalink parent award report block reply view 4 more comments... Returningtogod 12 points 6 days ago They absolutely own the law schools. What our young lawyers are being taught, and what they are NOT being taught, only exacerbates the situation we are in. permalink parent award report block reply\nSolo_Dad 24 points 6 days ago And the judicial system. permalink parent award report block reply view 4 more comments...\nReturningtogod 12 points 6 days ago They absolutely own the law schools. What our young lawyers are being taught, and what they are NOT being taught, only exacerbates the situation we are in. permalink parent award report block reply\nbejeavis 13 points 6 days ago They were balls deep (and believe it or not, very gay) in the state department too. permalink parent award report block reply\nJudenfrei 1 points 6 days ago A good read. https://archive.org/details/B-001-002-034/mode/1up permalink parent award report block reply\nGovtizbad 19 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nbck- 42 points 6 days ago McCarthy died at the age of  48 with a cause of death still in question. Meanwhile his seat was held by a Democrat for 50+ years. permalink parent award report block reply FKH2 24 points 6 days ago He got Charlie Kirked permalink parent award report block reply Klaus73 8 points 6 days ago When is the autopsy? permalink parent award report block reply chickeninoven -9 points 6 days ago Ask Erika \"Hot Pants\" permalink parent award report block reply\nFKH2 24 points 6 days ago He got Charlie Kirked permalink parent award report block reply Klaus73 8 points 6 days ago When is the autopsy? permalink parent award report block reply chickeninoven -9 points 6 days ago Ask Erika \"Hot Pants\" permalink parent award report block reply\nKlaus73 8 points 6 days ago When is the autopsy? permalink parent award report block reply chickeninoven -9 points 6 days ago Ask Erika \"Hot Pants\" permalink parent award report block reply\nchickeninoven -9 points 6 days ago Ask Erika \"Hot Pants\" permalink parent award report block reply\nBigdeal 13 points 6 days ago Biggest problem was all the commies ended up being Jewish. So Roy Cohn ended up tricking Mccarthy into blaming the wrong people as being commies to discredit the very good work McCarthy had been doing. permalink parent award report block reply InternetSolutions 2 points 6 days ago Biggest problem was all the commies ended up being Jewish. So Roy Cohn ended up tricking Mccarthy into blaming the wrong people as being commies to discredit the very good work McCarthy had been doing. Newbie question: Could you elaborate on this? He got tricked into blaming jews or non-jews or am I misunderstanding your statement entirely? permalink parent award report block reply HazelHen 11 points 6 days ago You can start by confirming the fact that Jews were crazily over represented in the early Soviet government and were the majority in almost all institutions of power until Stalin’s purges. Second, the failed Bolshevik revolution in Germany was basically lead only by Jews, just check Wikipedia and early life of the leaders. Next to last, see what Solzhenitsyn has to say about Jews and their role in the revolution, mass killings and terror (check out the ethnicities of who slaughtered the Russian royal family and who desecrated the corpses). Lastly, who betrayed the US and gave our nuclear secrets to the Soviets? Who are the Frankfurt School (predecessor to cultural Marxism/woke/anti-white). permalink parent award report block reply mohel 7 points 6 days ago This is hardly ever mentioned now - American married couple Julius and Ethel Rosenberg permalink parent award report block reply Bigdeal 2 points 6 days ago The real downfall of McCarthy happened after McCarthy foolishly went after the Army at the behest of Cohn. Some say Cohn did it because was he was upset about not getting a direct commision for a Private G. David Schine others may say Cohn did it to save his tribe that had an outsized membership in the communist party. permalink parent award report block reply\nInternetSolutions 2 points 6 days ago Biggest problem was all the commies ended up being Jewish. So Roy Cohn ended up tricking Mccarthy into blaming the wrong people as being commies to discredit the very good work McCarthy had been doing. Newbie question: Could you elaborate on this? He got tricked into blaming jews or non-jews or am I misunderstanding your statement entirely? permalink parent award report block reply HazelHen 11 points 6 days ago You can start by confirming the fact that Jews were crazily over represented in the early Soviet government and were the majority in almost all institutions of power until Stalin’s purges. Second, the failed Bolshevik revolution in Germany was basically lead only by Jews, just check Wikipedia and early life of the leaders. Next to last, see what Solzhenitsyn has to say about Jews and their role in the revolution, mass killings and terror (check out the ethnicities of who slaughtered the Russian royal family and who desecrated the corpses). Lastly, who betrayed the US and gave our nuclear secrets to the Soviets? Who are the Frankfurt School (predecessor to cultural Marxism/woke/anti-white). permalink parent award report block reply mohel 7 points 6 days ago This is hardly ever mentioned now - American married couple Julius and Ethel Rosenberg permalink parent award report block reply Bigdeal 2 points 6 days ago The real downfall of McCarthy happened after McCarthy foolishly went after the Army at the behest of Cohn. Some say Cohn did it because was he was upset about not getting a direct commision for a Private G. David Schine others may say Cohn did it to save his tribe that had an outsized membership in the communist party. permalink parent award report block reply\nHazelHen 11 points 6 days ago You can start by confirming the fact that Jews were crazily over represented in the early Soviet government and were the majority in almost all institutions of power until Stalin’s purges. Second, the failed Bolshevik revolution in Germany was basically lead only by Jews, just check Wikipedia and early life of the leaders. Next to last, see what Solzhenitsyn has to say about Jews and their role in the revolution, mass killings and terror (check out the ethnicities of who slaughtered the Russian royal family and who desecrated the corpses). Lastly, who betrayed the US and gave our nuclear secrets to the Soviets? Who are the Frankfurt School (predecessor to cultural Marxism/woke/anti-white). permalink parent award report block reply mohel 7 points 6 days ago This is hardly ever mentioned now - American married couple Julius and Ethel Rosenberg permalink parent award report block reply\nmohel 7 points 6 days ago This is hardly ever mentioned now - American married couple Julius and Ethel Rosenberg permalink parent award report block reply\nBigdeal 2 points 6 days ago The real downfall of McCarthy happened after McCarthy foolishly went after the Army at the behest of Cohn. Some say Cohn did it because was he was upset about not getting a direct commision for a Private G. David Schine others may say Cohn did it to save his tribe that had an outsized membership in the communist party. permalink parent award report block reply\nPapaPepe 8 points 6 days ago He was right and he didn't go far enough. permalink parent award report block reply\nsordfysh PRO 6 points 6 days ago I don't think God gives a nation a pass on rejecting truth when they give the excuse, \"I was just trusting what the news and public school told me.\" Notice how a neighborhood in Chicago can have a dozen mass shootings in a month and the local news will not report on it. This has been happening for many decades, and it should have been obvious that something was seriously wrong when normal people found out these things weren't being reported. I tell you what, the Communists see these shootings happen, and they talk about it. When they are the only ones talking about it, they bring a lot of people over to their side. Trump saw these shooting happen, and he talked about it in 2016. It made him very popular. Bringing the national guard into Memphis to clean up crime has been one of the biggest wins of the year for the Republican party, and yet nobody talks about it. That's why Republicans lose. permalink parent award report block reply Aambrick 2 points 6 days ago Its not that they don't talk about it, but its when they start that everyone else do their best to silence it via silencing, discrediting, or even being so loud on other topics which falls under not reporting or making it so minimal in time spent that just a paragraph mentioned at the bottom of the screen on tv or in a news feed on a smart phone. Its the fact we stopped calling the media fake news that they regained a foothold. permalink parent award report block reply\nAambrick 2 points 6 days ago Its not that they don't talk about it, but its when they start that everyone else do their best to silence it via silencing, discrediting, or even being so loud on other topics which falls under not reporting or making it so minimal in time spent that just a paragraph mentioned at the bottom of the screen on tv or in a news feed on a smart phone. Its the fact we stopped calling the media fake news that they regained a foothold. permalink parent award report block reply\nIncredibleMrE1 53 points 6 days ago This man was a patriot. permalink award report block reply Govtizbad 18 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nGovtizbad 18 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply\nOTher55 40 points 6 days ago McCarthy said nothing wrong permalink award report block reply AliceCooperBiden 14 points 6 days ago He actually just told the absolute truth and they killed him for it. permalink parent award report block reply Covfefe_Commando 1 points 6 days ago Tailgunner Joe was never wrong! permalink parent award report block reply\nAliceCooperBiden 14 points 6 days ago He actually just told the absolute truth and they killed him for it. permalink parent award report block reply Covfefe_Commando 1 points 6 days ago Tailgunner Joe was never wrong! permalink parent award report block reply\nCovfefe_Commando 1 points 6 days ago Tailgunner Joe was never wrong! permalink parent award report block reply\nPyroth5687 29 points 6 days ago The problem he didn't see was that tens of millions of foreigners would flood our country for handouts and vote to get more. permalink award report block reply mark2398 8 points 6 days ago That's the deal, people keep saying the New Yorkers voted for this.   That's not the whole story when you have half the city flooded with immigrants that can't even speak English.  They want free stuff and to bring their families over to the USA.  Democrats will let them do this.  There isn't enough white Americans to stop it from happening. permalink parent award report block reply Viewer01 2 points 6 days ago NYC voted to be displaced. permalink parent award report block reply Govtizbad 24 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply Cuetardian 13 points 6 days ago The concept of \"treat everyone fairly and equally\" is part of Western civilization. The parable Jesus told of the Good Samaritan was meant to teach this idea. You will not find this outlook in other religions or political systems. Virtually everywhere else, it is perfectly normal and actually expected that you can treat outsiders any way you like. You can cheat them, lie to them, steal from them, use them, buy them, sell them, and even kill them without consequence. As long as you treat your own immediate family well, and your own small tribe well, using outsiders is just the way life is. It's how you survive and, sometimes, grow rich. But those in the West do not understand that. They think everybody is just like we are and follows all the same rules. They don't. Not even close. And even if they claim to be Christian/Catholic, many, many people in South and Central America trace their ancestors to the Mayans and Aztecs, two very bloodthirsty cultures. (Drug cartels are the descendants of those same groups.) permalink parent award report block reply CommanderOfCheese 4 points 6 days ago We're all reading the parable of the Good Samaritan wrong. The Levite and the Pharisee in the parable rightly saw the potential \"charity\" trap -- helping such a person would likely in reality lead to being robbed, and indeed the injured man may likely have been part of such a trap. The Good Samaritan is not just some strange rando who we're supposed to accept as the model of a perfect person. The Good Samaritan is the Savior Himself. He came prepared not just for a random encounter, but rather specifically for the injured man, prepared for his injuries, transport and to provide for his care. Who are YOU in the parable? YOU are the \"certain man\" who is set upon by thieves, left bruised and broken for Jesus to pick you up. permalink parent award report block reply KernalMustard 1 points 6 days ago a crown of love is being twined for him who loves his neighbour permalink parent award report block reply Long_time_lurker 3 points 6 days ago The concept of \"treat everyone fairly and equally\" is part of Western civilization. I think it's part of how we got our civilization, by being better at cooperating, despite everything.  And now we have people joining it for benefits and instead diluting the trust which makes people willing to cooperate in the first place instead of assimilating. Then we have the pro-crime commies and few consequences for being arrested 127 times, when such people need to be removed from society. permalink parent award report block reply HazelHen 3 points 6 days ago One day, you may mature and realize all of politics and civilization itself boils down to tribe, to kin, to biology. Western civilization’s forms of government only work in an ethnically homogeneous, high-trust society (both of these correlate). This has been known even since antiquity as Ancient Greek writers explicitly discussed this because they had observations of their own.\nEverything is downstream of how homogeneous a society is. Hell, even the character of the US started to shift, potentially for the worse, when it deviated form the founding WASP stock with the importations of other Europeans. Today, the US in its current form is lost cause without currently unthinkable repatriations, or complete politicsl separation, of nons and all those tainted with the mind virus. permalink parent award report block reply InternetSolutions 3 points 6 days ago Virtually everywhere else, it is perfectly normal and actually expected that you can treat outsiders any way you like. You can cheat them, lie to them, steal from them, use them, buy them, sell them, and even kill them without consequence. Well said. When rich arab countries recruit foreign laborers from India or Philippines, it is common to essentially enslave them by indebting them for the cost of food & rent, then making them \"earn\" their way out of debt and sent home 2-3 years later with little money to show for it. The arab companies also hold onto their money, passports, travel documents, and any other important paperwork that would let them go back to their home country. permalink parent award report block reply BeauHD 1 points 6 days ago Don't feed the bots, man! permalink parent award report block reply Govtizbad 4 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply Decepticons-superior 4 points 6 days ago Reminds me of those two idiots who quit their fancy jobs and decided to ride bicycles across the continents. They kept a diary and everything went fairly well, until they got to ISIS territory. You can guess what happened next. Here’s a link to the story. They looked exactly the way you would think they would look. She even called her boyfriend her “partner.” https://archive.is/u1W5d permalink parent award report block reply glow-operator-2-0 1 points 6 days ago they can't comprehend that the rest of the world doesn't necessarily share their values Robert Young Pelton knows. permalink parent award report block reply HeavyMetalPatriot 4 points 6 days ago Very few Turd Worlders can assimilate to the First World. Instead they become a resentful underclass to be exploited by the power hungry and used as weapons. This is reality. permalink parent award report block reply Govtizbad 3 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply HeavyMetalPatriot 1 points 6 days ago A failed country permalink parent award report block reply\nmark2398 8 points 6 days ago That's the deal, people keep saying the New Yorkers voted for this.   That's not the whole story when you have half the city flooded with immigrants that can't even speak English.  They want free stuff and to bring their families over to the USA.  Democrats will let them do this.  There isn't enough white Americans to stop it from happening. permalink parent award report block reply Viewer01 2 points 6 days ago NYC voted to be displaced. permalink parent award report block reply\nViewer01 2 points 6 days ago NYC voted to be displaced. permalink parent award report block reply\nGovtizbad 24 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply Cuetardian 13 points 6 days ago The concept of \"treat everyone fairly and equally\" is part of Western civilization. The parable Jesus told of the Good Samaritan was meant to teach this idea. You will not find this outlook in other religions or political systems. Virtually everywhere else, it is perfectly normal and actually expected that you can treat outsiders any way you like. You can cheat them, lie to them, steal from them, use them, buy them, sell them, and even kill them without consequence. As long as you treat your own immediate family well, and your own small tribe well, using outsiders is just the way life is. It's how you survive and, sometimes, grow rich. But those in the West do not understand that. They think everybody is just like we are and follows all the same rules. They don't. Not even close. And even if they claim to be Christian/Catholic, many, many people in South and Central America trace their ancestors to the Mayans and Aztecs, two very bloodthirsty cultures. (Drug cartels are the descendants of those same groups.) permalink parent award report block reply CommanderOfCheese 4 points 6 days ago We're all reading the parable of the Good Samaritan wrong. The Levite and the Pharisee in the parable rightly saw the potential \"charity\" trap -- helping such a person would likely in reality lead to being robbed, and indeed the injured man may likely have been part of such a trap. The Good Samaritan is not just some strange rando who we're supposed to accept as the model of a perfect person. The Good Samaritan is the Savior Himself. He came prepared not just for a random encounter, but rather specifically for the injured man, prepared for his injuries, transport and to provide for his care. Who are YOU in the parable? YOU are the \"certain man\" who is set upon by thieves, left bruised and broken for Jesus to pick you up. permalink parent award report block reply KernalMustard 1 points 6 days ago a crown of love is being twined for him who loves his neighbour permalink parent award report block reply Long_time_lurker 3 points 6 days ago The concept of \"treat everyone fairly and equally\" is part of Western civilization. I think it's part of how we got our civilization, by being better at cooperating, despite everything.  And now we have people joining it for benefits and instead diluting the trust which makes people willing to cooperate in the first place instead of assimilating. Then we have the pro-crime commies and few consequences for being arrested 127 times, when such people need to be removed from society. permalink parent award report block reply HazelHen 3 points 6 days ago One day, you may mature and realize all of politics and civilization itself boils down to tribe, to kin, to biology. Western civilization’s forms of government only work in an ethnically homogeneous, high-trust society (both of these correlate). This has been known even since antiquity as Ancient Greek writers explicitly discussed this because they had observations of their own.\nEverything is downstream of how homogeneous a society is. Hell, even the character of the US started to shift, potentially for the worse, when it deviated form the founding WASP stock with the importations of other Europeans. Today, the US in its current form is lost cause without currently unthinkable repatriations, or complete politicsl separation, of nons and all those tainted with the mind virus. permalink parent award report block reply InternetSolutions 3 points 6 days ago Virtually everywhere else, it is perfectly normal and actually expected that you can treat outsiders any way you like. You can cheat them, lie to them, steal from them, use them, buy them, sell them, and even kill them without consequence. Well said. When rich arab countries recruit foreign laborers from India or Philippines, it is common to essentially enslave them by indebting them for the cost of food & rent, then making them \"earn\" their way out of debt and sent home 2-3 years later with little money to show for it. The arab companies also hold onto their money, passports, travel documents, and any other important paperwork that would let them go back to their home country. permalink parent award report block reply BeauHD 1 points 6 days ago Don't feed the bots, man! permalink parent award report block reply Govtizbad 4 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply Decepticons-superior 4 points 6 days ago Reminds me of those two idiots who quit their fancy jobs and decided to ride bicycles across the continents. They kept a diary and everything went fairly well, until they got to ISIS territory. You can guess what happened next. Here’s a link to the story. They looked exactly the way you would think they would look. She even called her boyfriend her “partner.” https://archive.is/u1W5d permalink parent award report block reply glow-operator-2-0 1 points 6 days ago they can't comprehend that the rest of the world doesn't necessarily share their values Robert Young Pelton knows. permalink parent award report block reply HeavyMetalPatriot 4 points 6 days ago Very few Turd Worlders can assimilate to the First World. Instead they become a resentful underclass to be exploited by the power hungry and used as weapons. This is reality. permalink parent award report block reply Govtizbad 3 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply HeavyMetalPatriot 1 points 6 days ago A failed country permalink parent award report block reply\nCuetardian 13 points 6 days ago The concept of \"treat everyone fairly and equally\" is part of Western civilization. The parable Jesus told of the Good Samaritan was meant to teach this idea. You will not find this outlook in other religions or political systems. Virtually everywhere else, it is perfectly normal and actually expected that you can treat outsiders any way you like. You can cheat them, lie to them, steal from them, use them, buy them, sell them, and even kill them without consequence. As long as you treat your own immediate family well, and your own small tribe well, using outsiders is just the way life is. It's how you survive and, sometimes, grow rich. But those in the West do not understand that. They think everybody is just like we are and follows all the same rules. They don't. Not even close. And even if they claim to be Christian/Catholic, many, many people in South and Central America trace their ancestors to the Mayans and Aztecs, two very bloodthirsty cultures. (Drug cartels are the descendants of those same groups.) permalink parent award report block reply CommanderOfCheese 4 points 6 days ago We're all reading the parable of the Good Samaritan wrong. The Levite and the Pharisee in the parable rightly saw the potential \"charity\" trap -- helping such a person would likely in reality lead to being robbed, and indeed the injured man may likely have been part of such a trap. The Good Samaritan is not just some strange rando who we're supposed to accept as the model of a perfect person. The Good Samaritan is the Savior Himself. He came prepared not just for a random encounter, but rather specifically for the injured man, prepared for his injuries, transport and to provide for his care. Who are YOU in the parable? YOU are the \"certain man\" who is set upon by thieves, left bruised and broken for Jesus to pick you up. permalink parent award report block reply KernalMustard 1 points 6 days ago a crown of love is being twined for him who loves his neighbour permalink parent award report block reply Long_time_lurker 3 points 6 days ago The concept of \"treat everyone fairly and equally\" is part of Western civilization. I think it's part of how we got our civilization, by being better at cooperating, despite everything.  And now we have people joining it for benefits and instead diluting the trust which makes people willing to cooperate in the first place instead of assimilating. Then we have the pro-crime commies and few consequences for being arrested 127 times, when such people need to be removed from society. permalink parent award report block reply HazelHen 3 points 6 days ago One day, you may mature and realize all of politics and civilization itself boils down to tribe, to kin, to biology. Western civilization’s forms of government only work in an ethnically homogeneous, high-trust society (both of these correlate). This has been known even since antiquity as Ancient Greek writers explicitly discussed this because they had observations of their own.\nEverything is downstream of how homogeneous a society is. Hell, even the character of the US started to shift, potentially for the worse, when it deviated form the founding WASP stock with the importations of other Europeans. Today, the US in its current form is lost cause without currently unthinkable repatriations, or complete politicsl separation, of nons and all those tainted with the mind virus. permalink parent award report block reply InternetSolutions 3 points 6 days ago Virtually everywhere else, it is perfectly normal and actually expected that you can treat outsiders any way you like. You can cheat them, lie to them, steal from them, use them, buy them, sell them, and even kill them without consequence. Well said. When rich arab countries recruit foreign laborers from India or Philippines, it is common to essentially enslave them by indebting them for the cost of food & rent, then making them \"earn\" their way out of debt and sent home 2-3 years later with little money to show for it. The arab companies also hold onto their money, passports, travel documents, and any other important paperwork that would let them go back to their home country. permalink parent award report block reply BeauHD 1 points 6 days ago Don't feed the bots, man! permalink parent award report block reply Govtizbad 4 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply Decepticons-superior 4 points 6 days ago Reminds me of those two idiots who quit their fancy jobs and decided to ride bicycles across the continents. They kept a diary and everything went fairly well, until they got to ISIS territory. You can guess what happened next. Here’s a link to the story. They looked exactly the way you would think they would look. She even called her boyfriend her “partner.” https://archive.is/u1W5d permalink parent award report block reply glow-operator-2-0 1 points 6 days ago they can't comprehend that the rest of the world doesn't necessarily share their values Robert Young Pelton knows. permalink parent award report block reply\nCommanderOfCheese 4 points 6 days ago We're all reading the parable of the Good Samaritan wrong. The Levite and the Pharisee in the parable rightly saw the potential \"charity\" trap -- helping such a person would likely in reality lead to being robbed, and indeed the injured man may likely have been part of such a trap. The Good Samaritan is not just some strange rando who we're supposed to accept as the model of a perfect person. The Good Samaritan is the Savior Himself. He came prepared not just for a random encounter, but rather specifically for the injured man, prepared for his injuries, transport and to provide for his care. Who are YOU in the parable? YOU are the \"certain man\" who is set upon by thieves, left bruised and broken for Jesus to pick you up. permalink parent award report block reply KernalMustard 1 points 6 days ago a crown of love is being twined for him who loves his neighbour permalink parent award report block reply\nKernalMustard 1 points 6 days ago a crown of love is being twined for him who loves his neighbour permalink parent award report block reply\nLong_time_lurker 3 points 6 days ago The concept of \"treat everyone fairly and equally\" is part of Western civilization. I think it's part of how we got our civilization, by being better at cooperating, despite everything.  And now we have people joining it for benefits and instead diluting the trust which makes people willing to cooperate in the first place instead of assimilating. Then we have the pro-crime commies and few consequences for being arrested 127 times, when such people need to be removed from society. permalink parent award report block reply HazelHen 3 points 6 days ago One day, you may mature and realize all of politics and civilization itself boils down to tribe, to kin, to biology. Western civilization’s forms of government only work in an ethnically homogeneous, high-trust society (both of these correlate). This has been known even since antiquity as Ancient Greek writers explicitly discussed this because they had observations of their own.\nEverything is downstream of how homogeneous a society is. Hell, even the character of the US started to shift, potentially for the worse, when it deviated form the founding WASP stock with the importations of other Europeans. Today, the US in its current form is lost cause without currently unthinkable repatriations, or complete politicsl separation, of nons and all those tainted with the mind virus. permalink parent award report block reply\nHazelHen 3 points 6 days ago One day, you may mature and realize all of politics and civilization itself boils down to tribe, to kin, to biology. Western civilization’s forms of government only work in an ethnically homogeneous, high-trust society (both of these correlate). This has been known even since antiquity as Ancient Greek writers explicitly discussed this because they had observations of their own.\nEverything is downstream of how homogeneous a society is. Hell, even the character of the US started to shift, potentially for the worse, when it deviated form the founding WASP stock with the importations of other Europeans. Today, the US in its current form is lost cause without currently unthinkable repatriations, or complete politicsl separation, of nons and all those tainted with the mind virus. permalink parent award report block reply\nInternetSolutions 3 points 6 days ago Virtually everywhere else, it is perfectly normal and actually expected that you can treat outsiders any way you like. You can cheat them, lie to them, steal from them, use them, buy them, sell them, and even kill them without consequence. Well said. When rich arab countries recruit foreign laborers from India or Philippines, it is common to essentially enslave them by indebting them for the cost of food & rent, then making them \"earn\" their way out of debt and sent home 2-3 years later with little money to show for it. The arab companies also hold onto their money, passports, travel documents, and any other important paperwork that would let them go back to their home country. permalink parent award report block reply\nBeauHD 1 points 6 days ago Don't feed the bots, man! permalink parent award report block reply\nGovtizbad 4 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply Decepticons-superior 4 points 6 days ago Reminds me of those two idiots who quit their fancy jobs and decided to ride bicycles across the continents. They kept a diary and everything went fairly well, until they got to ISIS territory. You can guess what happened next. Here’s a link to the story. They looked exactly the way you would think they would look. She even called her boyfriend her “partner.” https://archive.is/u1W5d permalink parent award report block reply glow-operator-2-0 1 points 6 days ago they can't comprehend that the rest of the world doesn't necessarily share their values Robert Young Pelton knows. permalink parent award report block reply\nDecepticons-superior 4 points 6 days ago Reminds me of those two idiots who quit their fancy jobs and decided to ride bicycles across the continents. They kept a diary and everything went fairly well, until they got to ISIS territory. You can guess what happened next. Here’s a link to the story. They looked exactly the way you would think they would look. She even called her boyfriend her “partner.” https://archive.is/u1W5d permalink parent award report block reply\nglow-operator-2-0 1 points 6 days ago they can't comprehend that the rest of the world doesn't necessarily share their values Robert Young Pelton knows. permalink parent award report block reply\nHeavyMetalPatriot 4 points 6 days ago Very few Turd Worlders can assimilate to the First World. Instead they become a resentful underclass to be exploited by the power hungry and used as weapons. This is reality. permalink parent award report block reply Govtizbad 3 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply HeavyMetalPatriot 1 points 6 days ago A failed country permalink parent award report block reply\nGovtizbad 3 points 6 days ago Comment removed upon the user being banned. permalink parent award report block reply HeavyMetalPatriot 1 points 6 days ago A failed country permalink parent award report block reply\nHeavyMetalPatriot 1 points 6 days ago A failed country permalink parent award report block reply\nRogueLeaderX 14 points 6 days ago Man was an absolute hero, who was mustered by globalists! permalink award report block reply\nelmerecido 12 points 6 days ago McCarthy Did Nothing Wrong. Change my mind. permalink award report block reply BoomShtick 8 points 6 days ago If anything, the only thing he did wrong was using half measures on these commie fucks. Should have been televised executions for treasonous behavior permalink parent award report block reply\nBoomShtick 8 points 6 days ago If anything, the only thing he did wrong was using half measures on these commie fucks. Should have been televised executions for treasonous behavior permalink parent award report block reply\nmohel 9 points 6 days ago He was sabotaged by Roy Cohn who used David Schine to take wind off the momentum they had during army hearings https://en.wikipedia.org/wiki/Army%E2%80%93McCarthy_hearings permalink award report block reply\nSavingPrivateGrace 8 points 6 days ago He didn't get to see the full peak of globo, social, hommo, commie, marxist, muzzies our government created, and nothing ever happened to the traitors. permalink award report block reply\nstarjello 7 points 6 days ago Joe McCarthy was absolutely right and so was Father Coughlin. They were both vilified even back in those days. You imagine now what will be said about them if they were alive and preaching the same truth. permalink award report block reply\nPied-Trumper 5 points 6 days ago “Ashkenazi Jews or Ashkenazim form a distinct subgroup of the Jewish diaspora, that emerged in the Holy Roman Empire in the Early Middle Ages, originating from the Jewish communities who lived in the 10th century in the Rhineland valley and in neighbouring France before they migrated eastward to Slavic lands after the Crusades during the 11th and 13th centuries.” ah permalink award report block reply\nPhantomShield72 5 points 6 days ago Needs to be issued a posthumous award for his work. He was right about it all... permalink award report block reply\nMeMargie 4 points 6 days ago Know that feeling :( permalink award report block reply\nSteelDriver 3 points 6 days ago We need to have a McCarthy to rid us of the Islamic Jihadist scourge.  ...maybe toss out some white lefties while we're at it. permalink award report block reply\nDeporter 3 points 6 days ago Yet, I frequently hear rightwingers use his name as a disparagment. I've even heard Don Jr. do it. permalink award report block reply StruggleSession 3 points 6 days ago It's complicated. The theory presented in the book The Devil's Chessboard suggests that Senator Joseph McCarthy was initially a covertly managed asset for the powerful Dulles brothers: Allen Dulles, Director of the CIA, and John Foster Dulles, Secretary of State. Rather than being a purely independent crusader against communism, McCarthy allegedly received leaked intelligence from the Dulles network. This information served a dual purpose: first, it validated McCarthy's public anti-communist standing during the heightened Cold War fear; second, and more critically, it allowed the Dulles-led security state to strategically purge its political and organizational enemies from government agencies by branding them as security risks or communist sympathizers. McCarthy was, in this view, a useful political bomb employed to restructure the federal bureaucracy to their liking. McCarthy's career began to unravel when he lost the crucial support of the intelligence establishment. The turning point came when the Senator began to set his sights and investigative crosshairs on the very agencies that had tacitly supported him, particularly the CIA. Allen Dulles viewed any scrutiny of the CIA as a fundamental threat to its secret operations and independence, making McCarthy a liability rather than an asset. By challenging the institution that the Dulles brothers had built into a self-governing power, McCarthy signaled his loss of control and his new status as a dangerous rogue element. The final act of McCarthy's professional demise was his public attack on the U.S. Army, culminating in the televised Army-McCarthy Hearings. This aggressive action alienated him from the military and, crucially, from President Dwight D. Eisenhower. With the CIA refusing to feed him information, and the Executive Branch and military establishment actively opposing him, McCarthy had lost his political shield and operational intelligence source. His increasingly erratic behavior during the hearings exposed him to public condemnation, leading directly to his censure by the Senate and the effective end of his influential, yet controversial, career. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Thank you! permalink parent award report block reply\nStruggleSession 3 points 6 days ago It's complicated. The theory presented in the book The Devil's Chessboard suggests that Senator Joseph McCarthy was initially a covertly managed asset for the powerful Dulles brothers: Allen Dulles, Director of the CIA, and John Foster Dulles, Secretary of State. Rather than being a purely independent crusader against communism, McCarthy allegedly received leaked intelligence from the Dulles network. This information served a dual purpose: first, it validated McCarthy's public anti-communist standing during the heightened Cold War fear; second, and more critically, it allowed the Dulles-led security state to strategically purge its political and organizational enemies from government agencies by branding them as security risks or communist sympathizers. McCarthy was, in this view, a useful political bomb employed to restructure the federal bureaucracy to their liking. McCarthy's career began to unravel when he lost the crucial support of the intelligence establishment. The turning point came when the Senator began to set his sights and investigative crosshairs on the very agencies that had tacitly supported him, particularly the CIA. Allen Dulles viewed any scrutiny of the CIA as a fundamental threat to its secret operations and independence, making McCarthy a liability rather than an asset. By challenging the institution that the Dulles brothers had built into a self-governing power, McCarthy signaled his loss of control and his new status as a dangerous rogue element. The final act of McCarthy's professional demise was his public attack on the U.S. Army, culminating in the televised Army-McCarthy Hearings. This aggressive action alienated him from the military and, crucially, from President Dwight D. Eisenhower. With the CIA refusing to feed him information, and the Executive Branch and military establishment actively opposing him, McCarthy had lost his political shield and operational intelligence source. His increasingly erratic behavior during the hearings exposed him to public condemnation, leading directly to his censure by the Senate and the effective end of his influential, yet controversial, career. permalink parent award report block reply SicSemperTyrannis2 1 points 6 days ago Thank you! permalink parent award report block reply\nSicSemperTyrannis2 1 points 6 days ago Thank you! permalink parent award report block reply\nanon2309011 3 points 6 days ago We let them stop him with a new made up \"ism\". permalink award report block reply\nMkultraUSA 3 points 6 days ago He was in the Senate and had nothing to do with HUAC, He was concerned about the state department and the department of the Army. The thing that is crazy is the left 1984ed him into a word that means going after actors and writers. That was the House Unamerican Activity Committee not him. We all use it today and know its dumb meaning but not about the actual guy and what he did which was awesome and based. permalink award report block reply\nTheSonOfGadsden 2 points 6 days ago And every history book I had in social studies and US history when I was in school painted him in a bad light. McCarthy was right. All commies must hang! permalink award report block reply\nMkgoenti 2 points 6 days ago Even nancy pelosi decided to call it quits HAHAHAHAHAHA permalink award report block reply\nAntiCommieAktion 2 points 6 days ago Of course he was right. Only problem is that nobody gives a shit for what he had to say. permalink award report block reply\nMemoryHoleyeO 1 points 6 days ago I remember McCarthy being a crazy lunatic in the high school history books way back in early 2000s permalink award report block reply\nSteve56775 1 points 6 days ago I remember his famous line “are you now or have you ever been a member of the communist party?” permalink award report block reply\nBillyBobJimmyJoe 1 points 6 days ago Comment removed by community filter, pending further review. permalink award report block reply"}