{"id": "8173721", "contents": "1397 If looks could kill, that teacher just got lasered into the Phantom Zone. 👋    IT'S  HAPPENING!   🖐️ posted 5 days ago by davidac1982 97 comments award share report block Bilbo Baggins @Jbanklestankle1 • 6d Me and my wife at school conferences when the teacher mentions her \"partner\"\n97 comments Sort by Top Top New Worst Old Save 2008RonPaul2012 98 points 5 days ago I like to ask people who talk about their \"partner\" if they're on the police force permalink award report block reply BaldyGull 47 points 5 days ago Or in business. permalink parent award report block reply Please_Clap 34 points 5 days ago Or are they just a couple of faggots? 😂 permalink parent award report block reply BaldyGull 24 points 5 days ago Definitely. But they feel ridiculous saying that out loud. So you force it. Make them say \"I have a male room mate that uses my butt hole to masturbate\". permalink parent award report block reply LearnAboutRoaches 5 points 5 days ago Make them say \"I have a male room mate that uses my butt hole to masturbate\". Back when I went to college this was called the Bro Rock Obalma Special aka \"bros\" permalink parent award report block reply ColonelKlink 1 points 5 days ago Most of them are not honest about degenerate and soul destroying their lifestyle is. permalink parent award report block reply Saltyminer11 1 points 5 days ago Lol permalink parent award report block reply quiznossucks 5 points 5 days ago 🤣🤣🤣🤣🤣  kid's get your shit  were going to home school ya..... permalink parent award report block reply Saltyminer11 2 points 5 days ago This permalink parent award report block reply they-see-me-trollin 2 points 5 days ago but you have to say it like that... wait, are you talking about your police partner, your business partner, or your faggot butt-fuck partner? permalink parent award report block reply MAGA-2028 1 points 5 days ago That’s what Grenell is along with his hairy man husband permalink parent award report block reply Rob_Belmonte 4 points 5 days ago \"What are you selling? C'mon, you said he's your partner, now what are you selling?\" permalink parent award report block reply bill_in_texas 2 points 5 days ago \"1970 Pontiac Firebird, the car I always wanted, and now I have it.  I rule!\" permalink parent award report block reply ianpatrick1966 3 points 5 days ago Maybe a fudge packing business? permalink parent award report block reply Ch3f4554551n 1 points 5 days ago Lol I do this every time! Partner is a business term. permalink parent award report block reply thisguy883 18 points 5 days ago I dont understand this liberal phenomenon,  and yes, only liberals do this. They refere to thier boyfriend or girlfriend as their partner. Even if they are a straight couple. EVEN IF THEY ARE MARRIED. like wtf? partner? business partner? partner in crime? If you refer to your significant other as a partner, im going to assume yall have an open relationship. permalink parent award report block reply 2008RonPaul2012 11 points 5 days ago It's about being an ally to gay people. If a straight man refers to his girlfriend as his partner, it moves the linguistic overton window away from conventional sexual norms toward the perverse. If everyone says partner no matter what the situation, the idea is it would place the onus on everyone else to ask if it's a man or a woman, which makes them \"weird\" for wanting to know. Why does it even matter?? Quit being cringe. Etc. permalink parent award report block reply Saltyminer11 4 points 5 days ago Its all about taking biblical language out of our cultural language. permalink parent award report block reply goldkeyboardwarrior 2 points 5 days ago I've seen more than one person who does it because they're not married and they think \"boy/girlfriend\" reminds them of being teenagers. Of course, I knew another woman who said she prefers \"manfriend\" because she says she's too old to call him her boyfriend, but saying partner makes people assume she's a lesbian until she clarifies. permalink parent award report block reply bratt 2 points 5 days ago Better than calling him her baby daddy. permalink parent award report block reply hatredcopter 3 points 5 days ago Everything they do, in politics or generally in life is about nihilism. permalink parent award report block reply Saltyminer11 2 points 5 days ago Me too. I lose respect immediately when someone says this silly thing. permalink parent award report block reply IwilldestroyISIS 2 points 5 days ago If you understand liberalism as being aligned with wanting to destroy hierarchy, it makes sense in that framework. They feel uncomfortable at even using the term “my wife” or “my husband” because it is connected with the traditions of marriage. Partner flattens the hierarchy and alleviates their anxiety when speaking about the tradition they participate in despite disagreeing with it. permalink parent award report block reply they-see-me-trollin 1 points 5 days ago because a leftard memo went out that said using gendered language is hate because it's sexist and/or homophobic, and using ungendered language like \"spouse\" is still hate because it's exclusionary of people with broken homes and shitty relationships. it's a kafka trap... no matter what, they're going to find a way to purity test you by demanding every more ridiculous compliance to nonsensical standards. permalink parent award report block reply load 3 more comments... MAGA-2028 2 points 5 days ago Richard Grenell has a partner and is part of the fucking administration. permalink parent award report block reply 2008RonPaul2012 1 points 5 days ago Same lawfirm or something? permalink parent award report block reply MAGA-2028 2 points 5 days ago It’s his man husband permalink parent award report block reply Watermelons 1 points 5 days ago I ask if it's their golf partner. (fourball/matchplay) permalink parent award report block reply 26magarat 1 points 5 days ago Or if they're in a Western. permalink parent award report block reply load 2 more comments... swift_water 36 points 5 days ago ...thats how I look at you folks refusing to raise your own children and instead sending them to \"school\". permalink award report block reply sordfysh PRO 18 points 5 days ago At some point, we have no sympathy for complainers when they refuse to even put their kids in church schools. If you can't afford it, there are several states in the USA that allow you to allocate your kids' public school funding to a parochial school. Move there. Or die on your knees and let the government raise your kids. permalink parent award report block reply Get_Off_Big_Tech 14 points 5 days ago Religious schools give better odds, but they still need to be monitored by the parents. I agree that moving should be considered to give kids a better life. permalink parent award report block reply guywholikesDjtof2024 1 points 4 days ago religious Christian. Substituting \"religious\" for \"Christian\" has led to a lot of confusion, and damage to humanity. Everyone has a religion. One big devastating thing is the pretense that the terms \"Christian\" and \"religion/religious\" are interchangeable. Ever wonder why only Christianity is interchanged?? When you say \"religion\" people assume Christianity. Not islam, buddism, atheism, agnosticism, nope!! ONLY Christianity gets this kind of confusion aimed at it. How curious. Almost as if Christianity is true and wicked people want to muddy waters by switching Christianity with the vague umbrella term \"religion\". What we need is BIBLICAL CHRISTIANITY. Not vague, unnamed, generic, \"religion\". permalink parent award report block reply Ch3f4554551n 3 points 5 days ago We teach at home. Just teach your kids where and how to learn, then encourage them and provide a structure. Humans teach themselves until they are put in an environment where they are either prevented from doing so, or are crushed psychologically to the point where they give up...like public schools. permalink parent award report block reply N14205ST205 2 points 5 days ago I desperately needed homeschooling when I was in K-12. I finally got it in the form of online college classes I took in my bedroom. It was a proving ground for me to put the skills managing time, resources, and strategies in the video games I have always loved playing- and; the ideas I gained from seeing the strengths of different ideas and ingenuity approaches in every kind of motorsports imaginable, to use. Those online college classes were the best academic years of my life. I made the Dean's List, got to understand the material in a way that let me connect it to my interests plus burgeoning MAGA and Trump support, and finally got to do work I was proud of because I could do it my way at my own pace. Examples come in the form of assignments where we commented on current events. I used them to explain why I thought MAGA and anti globalism ideas were better, even if that meant I couldn't do them the easy way and had to work harder. My teachers actually praised my conviction and detail and appreciated how my enthusiasm showed in my work. On the other hand, my K-12 schools (all private, religious, and in person) left me with severe trust issues, bad memories of a Dangerous Minds like gauntlet of status and chaos (I was literally the closest thing to a nerd in my 6th-8th grade school. Yes I was bullied for it, but the class wide punishments were what bothered me- I was proud that a bunch of youths, as this site defines them, didn't like me), a near lethal mental health crisis, and a deeply fractured family dynamic. They were awful. The kids were so disrespectful and prone to things like getting into fights or destroying and throwing property that the teachers were really heavy handed in their approaches to discipline. It felt like a warzone. I was so scared of getting in trouble and was so disgusted by my peers that I didn't talk at all at school for a decade unless it was to a teacher. I knew from the moment I started kindergarten that I was fundamentally incompatibile with the school environment. Over 12 years, I never felt at home at any of my schools. That's just half of it. Don't worry, I got better. Point is, there are some kids out there who really do need some kind of homeschooling or independent study so they can channel energy they'd otherwise spend trying to survive into delving deep into their passions, using them to understand other things in the world, and end up with a genuine growth journey that empowers them to chase their dreams and tap into potential that would otherwise be dormant if they were trapped in a traditional school environment. I am no longer in the K-12 school system and have successfully earned my degree and now have a fulfilling career. Nonetheless, it means a great deal for me to see others at least have the option to pursue something like homeschooling, if only so that they don't have to go through what I did. permalink parent award report block reply thisguy883 1 points 5 days ago My children were in a religious school until it closed down for lack of funding. The next closest school with the same religious affiliation, is an hour drive. Now we have them in a charter school that follows the same values, but without the religious overtones. permalink parent award report block reply MAGABOND 3 points 5 days ago Especially if the mom doesn’t have a fucking job, like my coworkers wife. permalink parent award report block reply Yaemz123 1 points 5 days ago I sent my son to public school. I also taught him critical thinking skills, watched very carefully all that the teachers taught, and worked with him throughout school on both his homework and advised him on social interactions. He learned about bullying, dealing with incompetent people placed in positions of authority over him, peer pressure, comformity vs non-conformity, when to push back vs when to bide his time, etc. As an involved parent, I believe the negatives of life during public school are some of the most important things children can learn, PROVIDED they have competent and supportive parents. A tree that is well watered grows deeper roots by enduring the storms of life. permalink parent award report block reply BlippiIsAPedo 1 points 5 days ago Cant do everything yourself. Nothing better than networking with other parents to enact real change permalink parent award report block reply CrankyCrab 18 points 5 days ago I have given this look a few times at work. There were times I used to question my decision to homeschool, but I am glad I stuck with it from elementary through high school.  My kiddo is a hard working, responsible young adult. permalink award report block reply RememberCharlieKirk 5 points 5 days ago Good! Do you have any advice on a curriculum? permalink parent award report block reply 2008RonPaul2012 4 points 5 days ago Ron Paul Curriculum is awesome permalink parent award report block reply patthepatriotic 2 points 5 days ago Look up classical education. permalink parent award report block reply CrankyCrab 2 points 4 days ago I developed my own curriculum using a variety of resources. I had considered using Calvert, but even 20+ years ago, it was quite expensive. To make sure there were no issues when applying to college, I enrolled my daughter in Penn Foster’s high school program. It’s regionally accredited, affordable, and relatively easy to complete. She finished the program in two years and was accepted to several state and private colleges (though not Ivy League schools). permalink parent award report block reply RememberCharlieKirk 3 points 4 days ago Thank you for your informative response! permalink parent award report block reply pedespeed 16 points 5 days ago your partner Me:  oh, you mean my Wife? We prefer the term partner so as not to offend Me:  it's my Wife and she is offended by being downgraded to the term \"partner\" 🥴 permalink award report block reply CaliAli 13 points 5 days ago Somebody please create the short gif/clip of lasers from Sweeny's eyes and then that interviewers head exploding. permalink award report block reply SHILL_DETECTOR 6 points 5 days ago drugged out eyes shooting lazers pew pew permalink parent award report block reply SHILL_DETECTOR 10 points 5 days ago san paku eyes are disturbing permalink award report block reply schnazzmizzle 11 points 5 days ago There's nothing wong with them. permalink parent award report block reply _Sully_ 8 points 5 days ago She actually got so much hotter. That harpy hates her guts and it's so obvious. And it isn't because of insensitivity. It's pure envy. permalink award report block reply Spacemonkey 8 points 5 days ago I visibly cringe whenever I hear someone say \"my partner\" it's your girlfriend or boyfriend or husband or wife you fucking faggot. permalink award report block reply Cowboy888 7 points 5 days ago Her padna is a carpet muncher. permalink award report block reply Toddyoungsvagina 6 points 5 days ago No shit saw at least 2 Troons teaching at my kids high school permalink award report block reply YouEssAye 8 points 5 days ago Imagine knowing this and still sending your kids to these indoctrination camps. permalink parent award report block reply ismellhippies 0 points 5 days ago ah yes, because everyone has the luxury of not requiring dual incomes to survive.  Homeschooling is great, and so are some private schools, but not everyone has the means.  I bet you're next comeback will be \"then don't have kids\"... and then you'll be bitching about how white people are becoming a minority. permalink parent award report block reply YouEssAye 3 points 5 days ago because everyone has the luxury of not requiring dual incomes to survive I probably make less than both you and your wife individually. My wife hasn't worked since she was 5 months preggo and she won't work until my youngest is out of the house. It's not easy, but it's worth it for my kid's future. but not everyone has the means You very likely do have the means, you're just not willing to part with your consumerist lifestyle. I bet you're next comeback will be \"then don't have kids\" That would've been a losing bet. Have kids and make whatever sacrifice is necessary to keep them out of indoctrination camps. permalink parent award report block reply TennesseeBorn 2 points 5 days ago Yes, most people don't want to be a one income household. permalink parent award report block reply ismellhippies 2 points 5 days ago You sound like good parents to sacrifice for your kids like that. My wife and I live in a very high cost of living area, we live well below our means, invest aggressively, and are fortunate enough that we expect be in a comfortable position to home school by the time our first is ready for elementary school. I just also happen to know plenty of people barely surviving with two incomes due to the high cost of living where we are.  They could could save if they move to the hood, otherwise they'd have to leave the area and try to find better employment. permalink parent award report block reply Toddyoungsvagina -5 points 5 days ago Ha ha, sorry pal not the case. But cute comeback. Maybe someday you’ll have kids. permalink parent award report block reply YouEssAye 2 points 5 days ago Ha ha, sorry pal not the case What's not the case? You just admitted you send your kids to a school with multiple tranny teachers lol. Maybe someday you’ll have kids. Mine are at home with their mom as we speak, yours are having their worldview shaped by trannies as we speak. We are not the same. permalink parent award report block reply diverscale -1 points 5 days ago Wow you're so perfect permalink parent award report block reply view 1 more comments... Toddyoungsvagina -1 points 5 days ago Leaving your kids schooling to a female? Bro are you gay? permalink parent award report block reply view 1 more comments... BeauHD 2 points 5 days ago Which one? permalink parent award report block reply johnfist2 6 points 5 days ago Report it as sexual harassment.  That's what the freakoids would do to you. permalink award report block reply TrumpRideorDie74 5 points 5 days ago I can't stand that fuckin term. It's code for overloaded faggotry whenever I hear it. permalink award report block reply FusionBlack 4 points 5 days ago Now that's a good fresh meme. permalink award report block reply HobisterCavinboub 4 points 5 days ago pusillanimous - Lacking strength and firmness of mind; wanting in courage and fortitude; being of weak courage; faint-hearted; mean-spirited; cowardly. So progressive!  They LOOKED at the teacher!  So STRONG!  /SARCASM Looks do not kill.  Looks do NOTHING.  Republicans...  Strong worded letter.  Weaktards!  No different than a LIBTARD. Either STAND UP [for your own KIDS], or remain seated and silent. permalink award report block reply RememberCharlieKirk 2 points 5 days ago A difference in interpretation: I read the post as a joke, rather than a recollection of a past sassy action by the author. You read the post as an ineffectual boast. permalink parent award report block reply HobisterCavinboub 2 points 5 days ago You are correct.  Tough morning for me.  Thanks. permalink parent award report block reply TrumpTank 4 points 5 days ago Howdy, partner. Yeah really fucking sexy. permalink award report block reply ElectionMeddler 4 points 5 days ago That's when you finally decide that homeschooling is happening the next day.  Pull the kids out of school.  Find like minded parents and homeschool your children to be raised with your morals. permalink award report block reply Now_On_to_Mars 4 points 5 days ago Do you fuck your partner?\nYes!\nAre you gay or an unethical businessperson? permalink award report block reply CaptainChewbacca 3 points 5 days ago I definitely appreciated the phantom zone reference. She should've been Super Girl. permalink award report block reply ChrisSuperDude 2 points 5 days ago She’d be a better fit for Power Girl. permalink parent award report block reply JanOctSept 3 points 5 days ago Wow, one look perfectly personifies my disgust and disdain for performative, leftist scolds. permalink award report block reply destroyer713 2 points 5 days ago It's an unfortunate change of language, but I see more and more people refer to their husband or wife as their \"partner\" even in a normal marriage. permalink award report block reply Get_Off_Big_Tech 6 points 5 days ago I only see that coming from liberals. permalink parent award report block reply Tardigrade 3 points 5 days ago It's funny, I mostly hear straight libs use it.  The gay guys I know have the balls to just say \"boyfriend\". permalink parent award report block reply Constitution_1788 2 points 5 days ago Homelander is one of the greatest characters ever created. permalink award report block reply KungPaoMcChicken 2 points 5 days ago I was watching Peacemaker from season 1. And of course there is the lesbian couple, and she's doing a presentation and there's a slide of her girls vagina. And you know what, it's funny how lesbians think normal straight men are, like we are sitting here waiting to be shown some vag. Yeah, you got us men perfectly summed up. We are just so one dimensional. permalink award report block reply raptormissle 2 points 5 days ago They call them their partner because it's just a business transaction and nothing more. permalink award report block reply quiznossucks 2 points 5 days ago Your wife ????   you mean the new ex Mrs smith....(my wife) permalink award report block reply anti_masker 2 points 5 days ago I hate the term partner, whether it's for faggotry reasons or not. permalink award report block reply conservativefrank 1 points 5 days ago A reference to THE WOKE BOYS = garbage. permalink award report block reply Nick-Kerr -1 points 5 days ago Disgusting reference. I hope no one is giving Amazon's \"The Boys\" any views. It's disgusting, degenerate, and should be rated X. They pushed it to kids, of course. I mean if you like seeing bodies and people's heads explode in vivid detail intermixed with sex scenes, then you may need to re-evaluate your man-child life. permalink award report block reply Gfloydvotestrump 0 points 5 days ago How's it feel being 100 years old? permalink parent award report block reply Nick-Kerr 0 points 4 days ago How's it feel to be souless and empty with no morals? Manchildren like you are the reason we're in this mess. You slop up the degenerate filth, larp and play all day. I bet you have star wars figures on your desk right now. Grow the fuck up. Be a man. permalink parent award report block reply Gfloydvotestrump 0 points 4 days ago A loser named Nick-Kerr has the gall to call anyone else a manchild lmfao. Get fucked old man, your diaper needs to be changed. permalink parent award report block reply Nick-Kerr 1 points 3 days ago Triggered another retard. What's the matter? Your temu anime pillow shipment late? permalink parent award report block reply The_Morrow_Outlander -1 points 5 days ago I mean, \"partner\" is fine in general, but when two people have a child together, it is safe to assume they're MARRIED until otherwise proven, and it's on THEM to correct you. permalink award report block reply freedom4Speech 1 points 5 days ago Comment removed by community moderators. permalink award report block reply\n2008RonPaul2012 98 points 5 days ago I like to ask people who talk about their \"partner\" if they're on the police force permalink award report block reply BaldyGull 47 points 5 days ago Or in business. permalink parent award report block reply Please_Clap 34 points 5 days ago Or are they just a couple of faggots? 😂 permalink parent award report block reply BaldyGull 24 points 5 days ago Definitely. But they feel ridiculous saying that out loud. So you force it. Make them say \"I have a male room mate that uses my butt hole to masturbate\". permalink parent award report block reply LearnAboutRoaches 5 points 5 days ago Make them say \"I have a male room mate that uses my butt hole to masturbate\". Back when I went to college this was called the Bro Rock Obalma Special aka \"bros\" permalink parent award report block reply ColonelKlink 1 points 5 days ago Most of them are not honest about degenerate and soul destroying their lifestyle is. permalink parent award report block reply Saltyminer11 1 points 5 days ago Lol permalink parent award report block reply quiznossucks 5 points 5 days ago 🤣🤣🤣🤣🤣  kid's get your shit  were going to home school ya..... permalink parent award report block reply Saltyminer11 2 points 5 days ago This permalink parent award report block reply they-see-me-trollin 2 points 5 days ago but you have to say it like that... wait, are you talking about your police partner, your business partner, or your faggot butt-fuck partner? permalink parent award report block reply MAGA-2028 1 points 5 days ago That’s what Grenell is along with his hairy man husband permalink parent award report block reply Rob_Belmonte 4 points 5 days ago \"What are you selling? C'mon, you said he's your partner, now what are you selling?\" permalink parent award report block reply bill_in_texas 2 points 5 days ago \"1970 Pontiac Firebird, the car I always wanted, and now I have it.  I rule!\" permalink parent award report block reply ianpatrick1966 3 points 5 days ago Maybe a fudge packing business? permalink parent award report block reply Ch3f4554551n 1 points 5 days ago Lol I do this every time! Partner is a business term. permalink parent award report block reply thisguy883 18 points 5 days ago I dont understand this liberal phenomenon,  and yes, only liberals do this. They refere to thier boyfriend or girlfriend as their partner. Even if they are a straight couple. EVEN IF THEY ARE MARRIED. like wtf? partner? business partner? partner in crime? If you refer to your significant other as a partner, im going to assume yall have an open relationship. permalink parent award report block reply 2008RonPaul2012 11 points 5 days ago It's about being an ally to gay people. If a straight man refers to his girlfriend as his partner, it moves the linguistic overton window away from conventional sexual norms toward the perverse. If everyone says partner no matter what the situation, the idea is it would place the onus on everyone else to ask if it's a man or a woman, which makes them \"weird\" for wanting to know. Why does it even matter?? Quit being cringe. Etc. permalink parent award report block reply Saltyminer11 4 points 5 days ago Its all about taking biblical language out of our cultural language. permalink parent award report block reply goldkeyboardwarrior 2 points 5 days ago I've seen more than one person who does it because they're not married and they think \"boy/girlfriend\" reminds them of being teenagers. Of course, I knew another woman who said she prefers \"manfriend\" because she says she's too old to call him her boyfriend, but saying partner makes people assume she's a lesbian until she clarifies. permalink parent award report block reply bratt 2 points 5 days ago Better than calling him her baby daddy. permalink parent award report block reply hatredcopter 3 points 5 days ago Everything they do, in politics or generally in life is about nihilism. permalink parent award report block reply Saltyminer11 2 points 5 days ago Me too. I lose respect immediately when someone says this silly thing. permalink parent award report block reply IwilldestroyISIS 2 points 5 days ago If you understand liberalism as being aligned with wanting to destroy hierarchy, it makes sense in that framework. They feel uncomfortable at even using the term “my wife” or “my husband” because it is connected with the traditions of marriage. Partner flattens the hierarchy and alleviates their anxiety when speaking about the tradition they participate in despite disagreeing with it. permalink parent award report block reply they-see-me-trollin 1 points 5 days ago because a leftard memo went out that said using gendered language is hate because it's sexist and/or homophobic, and using ungendered language like \"spouse\" is still hate because it's exclusionary of people with broken homes and shitty relationships. it's a kafka trap... no matter what, they're going to find a way to purity test you by demanding every more ridiculous compliance to nonsensical standards. permalink parent award report block reply load 3 more comments... MAGA-2028 2 points 5 days ago Richard Grenell has a partner and is part of the fucking administration. permalink parent award report block reply 2008RonPaul2012 1 points 5 days ago Same lawfirm or something? permalink parent award report block reply MAGA-2028 2 points 5 days ago It’s his man husband permalink parent award report block reply Watermelons 1 points 5 days ago I ask if it's their golf partner. (fourball/matchplay) permalink parent award report block reply 26magarat 1 points 5 days ago Or if they're in a Western. permalink parent award report block reply load 2 more comments...\nBaldyGull 47 points 5 days ago Or in business. permalink parent award report block reply Please_Clap 34 points 5 days ago Or are they just a couple of faggots? 😂 permalink parent award report block reply BaldyGull 24 points 5 days ago Definitely. But they feel ridiculous saying that out loud. So you force it. Make them say \"I have a male room mate that uses my butt hole to masturbate\". permalink parent award report block reply LearnAboutRoaches 5 points 5 days ago Make them say \"I have a male room mate that uses my butt hole to masturbate\". Back when I went to college this was called the Bro Rock Obalma Special aka \"bros\" permalink parent award report block reply ColonelKlink 1 points 5 days ago Most of them are not honest about degenerate and soul destroying their lifestyle is. permalink parent award report block reply Saltyminer11 1 points 5 days ago Lol permalink parent award report block reply quiznossucks 5 points 5 days ago 🤣🤣🤣🤣🤣  kid's get your shit  were going to home school ya..... permalink parent award report block reply Saltyminer11 2 points 5 days ago This permalink parent award report block reply they-see-me-trollin 2 points 5 days ago but you have to say it like that... wait, are you talking about your police partner, your business partner, or your faggot butt-fuck partner? permalink parent award report block reply MAGA-2028 1 points 5 days ago That’s what Grenell is along with his hairy man husband permalink parent award report block reply Rob_Belmonte 4 points 5 days ago \"What are you selling? C'mon, you said he's your partner, now what are you selling?\" permalink parent award report block reply bill_in_texas 2 points 5 days ago \"1970 Pontiac Firebird, the car I always wanted, and now I have it.  I rule!\" permalink parent award report block reply ianpatrick1966 3 points 5 days ago Maybe a fudge packing business? permalink parent award report block reply Ch3f4554551n 1 points 5 days ago Lol I do this every time! Partner is a business term. permalink parent award report block reply\nPlease_Clap 34 points 5 days ago Or are they just a couple of faggots? 😂 permalink parent award report block reply BaldyGull 24 points 5 days ago Definitely. But they feel ridiculous saying that out loud. So you force it. Make them say \"I have a male room mate that uses my butt hole to masturbate\". permalink parent award report block reply LearnAboutRoaches 5 points 5 days ago Make them say \"I have a male room mate that uses my butt hole to masturbate\". Back when I went to college this was called the Bro Rock Obalma Special aka \"bros\" permalink parent award report block reply ColonelKlink 1 points 5 days ago Most of them are not honest about degenerate and soul destroying their lifestyle is. permalink parent award report block reply Saltyminer11 1 points 5 days ago Lol permalink parent award report block reply quiznossucks 5 points 5 days ago 🤣🤣🤣🤣🤣  kid's get your shit  were going to home school ya..... permalink parent award report block reply Saltyminer11 2 points 5 days ago This permalink parent award report block reply they-see-me-trollin 2 points 5 days ago but you have to say it like that... wait, are you talking about your police partner, your business partner, or your faggot butt-fuck partner? permalink parent award report block reply MAGA-2028 1 points 5 days ago That’s what Grenell is along with his hairy man husband permalink parent award report block reply\nBaldyGull 24 points 5 days ago Definitely. But they feel ridiculous saying that out loud. So you force it. Make them say \"I have a male room mate that uses my butt hole to masturbate\". permalink parent award report block reply LearnAboutRoaches 5 points 5 days ago Make them say \"I have a male room mate that uses my butt hole to masturbate\". Back when I went to college this was called the Bro Rock Obalma Special aka \"bros\" permalink parent award report block reply ColonelKlink 1 points 5 days ago Most of them are not honest about degenerate and soul destroying their lifestyle is. permalink parent award report block reply Saltyminer11 1 points 5 days ago Lol permalink parent award report block reply\nLearnAboutRoaches 5 points 5 days ago Make them say \"I have a male room mate that uses my butt hole to masturbate\". Back when I went to college this was called the Bro Rock Obalma Special aka \"bros\" permalink parent award report block reply\nColonelKlink 1 points 5 days ago Most of them are not honest about degenerate and soul destroying their lifestyle is. permalink parent award report block reply\nSaltyminer11 1 points 5 days ago Lol permalink parent award report block reply\nquiznossucks 5 points 5 days ago 🤣🤣🤣🤣🤣  kid's get your shit  were going to home school ya..... permalink parent award report block reply\nSaltyminer11 2 points 5 days ago This permalink parent award report block reply\nthey-see-me-trollin 2 points 5 days ago but you have to say it like that... wait, are you talking about your police partner, your business partner, or your faggot butt-fuck partner? permalink parent award report block reply\nMAGA-2028 1 points 5 days ago That’s what Grenell is along with his hairy man husband permalink parent award report block reply\nRob_Belmonte 4 points 5 days ago \"What are you selling? C'mon, you said he's your partner, now what are you selling?\" permalink parent award report block reply bill_in_texas 2 points 5 days ago \"1970 Pontiac Firebird, the car I always wanted, and now I have it.  I rule!\" permalink parent award report block reply\nbill_in_texas 2 points 5 days ago \"1970 Pontiac Firebird, the car I always wanted, and now I have it.  I rule!\" permalink parent award report block reply\nianpatrick1966 3 points 5 days ago Maybe a fudge packing business? permalink parent award report block reply\nCh3f4554551n 1 points 5 days ago Lol I do this every time! Partner is a business term. permalink parent award report block reply\nthisguy883 18 points 5 days ago I dont understand this liberal phenomenon,  and yes, only liberals do this. They refere to thier boyfriend or girlfriend as their partner. Even if they are a straight couple. EVEN IF THEY ARE MARRIED. like wtf? partner? business partner? partner in crime? If you refer to your significant other as a partner, im going to assume yall have an open relationship. permalink parent award report block reply 2008RonPaul2012 11 points 5 days ago It's about being an ally to gay people. If a straight man refers to his girlfriend as his partner, it moves the linguistic overton window away from conventional sexual norms toward the perverse. If everyone says partner no matter what the situation, the idea is it would place the onus on everyone else to ask if it's a man or a woman, which makes them \"weird\" for wanting to know. Why does it even matter?? Quit being cringe. Etc. permalink parent award report block reply Saltyminer11 4 points 5 days ago Its all about taking biblical language out of our cultural language. permalink parent award report block reply goldkeyboardwarrior 2 points 5 days ago I've seen more than one person who does it because they're not married and they think \"boy/girlfriend\" reminds them of being teenagers. Of course, I knew another woman who said she prefers \"manfriend\" because she says she's too old to call him her boyfriend, but saying partner makes people assume she's a lesbian until she clarifies. permalink parent award report block reply bratt 2 points 5 days ago Better than calling him her baby daddy. permalink parent award report block reply hatredcopter 3 points 5 days ago Everything they do, in politics or generally in life is about nihilism. permalink parent award report block reply Saltyminer11 2 points 5 days ago Me too. I lose respect immediately when someone says this silly thing. permalink parent award report block reply IwilldestroyISIS 2 points 5 days ago If you understand liberalism as being aligned with wanting to destroy hierarchy, it makes sense in that framework. They feel uncomfortable at even using the term “my wife” or “my husband” because it is connected with the traditions of marriage. Partner flattens the hierarchy and alleviates their anxiety when speaking about the tradition they participate in despite disagreeing with it. permalink parent award report block reply they-see-me-trollin 1 points 5 days ago because a leftard memo went out that said using gendered language is hate because it's sexist and/or homophobic, and using ungendered language like \"spouse\" is still hate because it's exclusionary of people with broken homes and shitty relationships. it's a kafka trap... no matter what, they're going to find a way to purity test you by demanding every more ridiculous compliance to nonsensical standards. permalink parent award report block reply load 3 more comments...\n2008RonPaul2012 11 points 5 days ago It's about being an ally to gay people. If a straight man refers to his girlfriend as his partner, it moves the linguistic overton window away from conventional sexual norms toward the perverse. If everyone says partner no matter what the situation, the idea is it would place the onus on everyone else to ask if it's a man or a woman, which makes them \"weird\" for wanting to know. Why does it even matter?? Quit being cringe. Etc. permalink parent award report block reply Saltyminer11 4 points 5 days ago Its all about taking biblical language out of our cultural language. permalink parent award report block reply goldkeyboardwarrior 2 points 5 days ago I've seen more than one person who does it because they're not married and they think \"boy/girlfriend\" reminds them of being teenagers. Of course, I knew another woman who said she prefers \"manfriend\" because she says she's too old to call him her boyfriend, but saying partner makes people assume she's a lesbian until she clarifies. permalink parent award report block reply bratt 2 points 5 days ago Better than calling him her baby daddy. permalink parent award report block reply\nSaltyminer11 4 points 5 days ago Its all about taking biblical language out of our cultural language. permalink parent award report block reply\ngoldkeyboardwarrior 2 points 5 days ago I've seen more than one person who does it because they're not married and they think \"boy/girlfriend\" reminds them of being teenagers. Of course, I knew another woman who said she prefers \"manfriend\" because she says she's too old to call him her boyfriend, but saying partner makes people assume she's a lesbian until she clarifies. permalink parent award report block reply bratt 2 points 5 days ago Better than calling him her baby daddy. permalink parent award report block reply\nbratt 2 points 5 days ago Better than calling him her baby daddy. permalink parent award report block reply\nhatredcopter 3 points 5 days ago Everything they do, in politics or generally in life is about nihilism. permalink parent award report block reply\nSaltyminer11 2 points 5 days ago Me too. I lose respect immediately when someone says this silly thing. permalink parent award report block reply\nIwilldestroyISIS 2 points 5 days ago If you understand liberalism as being aligned with wanting to destroy hierarchy, it makes sense in that framework. They feel uncomfortable at even using the term “my wife” or “my husband” because it is connected with the traditions of marriage. Partner flattens the hierarchy and alleviates their anxiety when speaking about the tradition they participate in despite disagreeing with it. permalink parent award report block reply\nthey-see-me-trollin 1 points 5 days ago because a leftard memo went out that said using gendered language is hate because it's sexist and/or homophobic, and using ungendered language like \"spouse\" is still hate because it's exclusionary of people with broken homes and shitty relationships. it's a kafka trap... no matter what, they're going to find a way to purity test you by demanding every more ridiculous compliance to nonsensical standards. permalink parent award report block reply\nMAGA-2028 2 points 5 days ago Richard Grenell has a partner and is part of the fucking administration. permalink parent award report block reply 2008RonPaul2012 1 points 5 days ago Same lawfirm or something? permalink parent award report block reply MAGA-2028 2 points 5 days ago It’s his man husband permalink parent award report block reply\n2008RonPaul2012 1 points 5 days ago Same lawfirm or something? permalink parent award report block reply MAGA-2028 2 points 5 days ago It’s his man husband permalink parent award report block reply\nMAGA-2028 2 points 5 days ago It’s his man husband permalink parent award report block reply\nWatermelons 1 points 5 days ago I ask if it's their golf partner. (fourball/matchplay) permalink parent award report block reply\n26magarat 1 points 5 days ago Or if they're in a Western. permalink parent award report block reply\nswift_water 36 points 5 days ago ...thats how I look at you folks refusing to raise your own children and instead sending them to \"school\". permalink award report block reply sordfysh PRO 18 points 5 days ago At some point, we have no sympathy for complainers when they refuse to even put their kids in church schools. If you can't afford it, there are several states in the USA that allow you to allocate your kids' public school funding to a parochial school. Move there. Or die on your knees and let the government raise your kids. permalink parent award report block reply Get_Off_Big_Tech 14 points 5 days ago Religious schools give better odds, but they still need to be monitored by the parents. I agree that moving should be considered to give kids a better life. permalink parent award report block reply guywholikesDjtof2024 1 points 4 days ago religious Christian. Substituting \"religious\" for \"Christian\" has led to a lot of confusion, and damage to humanity. Everyone has a religion. One big devastating thing is the pretense that the terms \"Christian\" and \"religion/religious\" are interchangeable. Ever wonder why only Christianity is interchanged?? When you say \"religion\" people assume Christianity. Not islam, buddism, atheism, agnosticism, nope!! ONLY Christianity gets this kind of confusion aimed at it. How curious. Almost as if Christianity is true and wicked people want to muddy waters by switching Christianity with the vague umbrella term \"religion\". What we need is BIBLICAL CHRISTIANITY. Not vague, unnamed, generic, \"religion\". permalink parent award report block reply Ch3f4554551n 3 points 5 days ago We teach at home. Just teach your kids where and how to learn, then encourage them and provide a structure. Humans teach themselves until they are put in an environment where they are either prevented from doing so, or are crushed psychologically to the point where they give up...like public schools. permalink parent award report block reply N14205ST205 2 points 5 days ago I desperately needed homeschooling when I was in K-12. I finally got it in the form of online college classes I took in my bedroom. It was a proving ground for me to put the skills managing time, resources, and strategies in the video games I have always loved playing- and; the ideas I gained from seeing the strengths of different ideas and ingenuity approaches in every kind of motorsports imaginable, to use. Those online college classes were the best academic years of my life. I made the Dean's List, got to understand the material in a way that let me connect it to my interests plus burgeoning MAGA and Trump support, and finally got to do work I was proud of because I could do it my way at my own pace. Examples come in the form of assignments where we commented on current events. I used them to explain why I thought MAGA and anti globalism ideas were better, even if that meant I couldn't do them the easy way and had to work harder. My teachers actually praised my conviction and detail and appreciated how my enthusiasm showed in my work. On the other hand, my K-12 schools (all private, religious, and in person) left me with severe trust issues, bad memories of a Dangerous Minds like gauntlet of status and chaos (I was literally the closest thing to a nerd in my 6th-8th grade school. Yes I was bullied for it, but the class wide punishments were what bothered me- I was proud that a bunch of youths, as this site defines them, didn't like me), a near lethal mental health crisis, and a deeply fractured family dynamic. They were awful. The kids were so disrespectful and prone to things like getting into fights or destroying and throwing property that the teachers were really heavy handed in their approaches to discipline. It felt like a warzone. I was so scared of getting in trouble and was so disgusted by my peers that I didn't talk at all at school for a decade unless it was to a teacher. I knew from the moment I started kindergarten that I was fundamentally incompatibile with the school environment. Over 12 years, I never felt at home at any of my schools. That's just half of it. Don't worry, I got better. Point is, there are some kids out there who really do need some kind of homeschooling or independent study so they can channel energy they'd otherwise spend trying to survive into delving deep into their passions, using them to understand other things in the world, and end up with a genuine growth journey that empowers them to chase their dreams and tap into potential that would otherwise be dormant if they were trapped in a traditional school environment. I am no longer in the K-12 school system and have successfully earned my degree and now have a fulfilling career. Nonetheless, it means a great deal for me to see others at least have the option to pursue something like homeschooling, if only so that they don't have to go through what I did. permalink parent award report block reply thisguy883 1 points 5 days ago My children were in a religious school until it closed down for lack of funding. The next closest school with the same religious affiliation, is an hour drive. Now we have them in a charter school that follows the same values, but without the religious overtones. permalink parent award report block reply MAGABOND 3 points 5 days ago Especially if the mom doesn’t have a fucking job, like my coworkers wife. permalink parent award report block reply Yaemz123 1 points 5 days ago I sent my son to public school. I also taught him critical thinking skills, watched very carefully all that the teachers taught, and worked with him throughout school on both his homework and advised him on social interactions. He learned about bullying, dealing with incompetent people placed in positions of authority over him, peer pressure, comformity vs non-conformity, when to push back vs when to bide his time, etc. As an involved parent, I believe the negatives of life during public school are some of the most important things children can learn, PROVIDED they have competent and supportive parents. A tree that is well watered grows deeper roots by enduring the storms of life. permalink parent award report block reply BlippiIsAPedo 1 points 5 days ago Cant do everything yourself. Nothing better than networking with other parents to enact real change permalink parent award report block reply\nsordfysh PRO 18 points 5 days ago At some point, we have no sympathy for complainers when they refuse to even put their kids in church schools. If you can't afford it, there are several states in the USA that allow you to allocate your kids' public school funding to a parochial school. Move there. Or die on your knees and let the government raise your kids. permalink parent award report block reply Get_Off_Big_Tech 14 points 5 days ago Religious schools give better odds, but they still need to be monitored by the parents. I agree that moving should be considered to give kids a better life. permalink parent award report block reply guywholikesDjtof2024 1 points 4 days ago religious Christian. Substituting \"religious\" for \"Christian\" has led to a lot of confusion, and damage to humanity. Everyone has a religion. One big devastating thing is the pretense that the terms \"Christian\" and \"religion/religious\" are interchangeable. Ever wonder why only Christianity is interchanged?? When you say \"religion\" people assume Christianity. Not islam, buddism, atheism, agnosticism, nope!! ONLY Christianity gets this kind of confusion aimed at it. How curious. Almost as if Christianity is true and wicked people want to muddy waters by switching Christianity with the vague umbrella term \"religion\". What we need is BIBLICAL CHRISTIANITY. Not vague, unnamed, generic, \"religion\". permalink parent award report block reply Ch3f4554551n 3 points 5 days ago We teach at home. Just teach your kids where and how to learn, then encourage them and provide a structure. Humans teach themselves until they are put in an environment where they are either prevented from doing so, or are crushed psychologically to the point where they give up...like public schools. permalink parent award report block reply N14205ST205 2 points 5 days ago I desperately needed homeschooling when I was in K-12. I finally got it in the form of online college classes I took in my bedroom. It was a proving ground for me to put the skills managing time, resources, and strategies in the video games I have always loved playing- and; the ideas I gained from seeing the strengths of different ideas and ingenuity approaches in every kind of motorsports imaginable, to use. Those online college classes were the best academic years of my life. I made the Dean's List, got to understand the material in a way that let me connect it to my interests plus burgeoning MAGA and Trump support, and finally got to do work I was proud of because I could do it my way at my own pace. Examples come in the form of assignments where we commented on current events. I used them to explain why I thought MAGA and anti globalism ideas were better, even if that meant I couldn't do them the easy way and had to work harder. My teachers actually praised my conviction and detail and appreciated how my enthusiasm showed in my work. On the other hand, my K-12 schools (all private, religious, and in person) left me with severe trust issues, bad memories of a Dangerous Minds like gauntlet of status and chaos (I was literally the closest thing to a nerd in my 6th-8th grade school. Yes I was bullied for it, but the class wide punishments were what bothered me- I was proud that a bunch of youths, as this site defines them, didn't like me), a near lethal mental health crisis, and a deeply fractured family dynamic. They were awful. The kids were so disrespectful and prone to things like getting into fights or destroying and throwing property that the teachers were really heavy handed in their approaches to discipline. It felt like a warzone. I was so scared of getting in trouble and was so disgusted by my peers that I didn't talk at all at school for a decade unless it was to a teacher. I knew from the moment I started kindergarten that I was fundamentally incompatibile with the school environment. Over 12 years, I never felt at home at any of my schools. That's just half of it. Don't worry, I got better. Point is, there are some kids out there who really do need some kind of homeschooling or independent study so they can channel energy they'd otherwise spend trying to survive into delving deep into their passions, using them to understand other things in the world, and end up with a genuine growth journey that empowers them to chase their dreams and tap into potential that would otherwise be dormant if they were trapped in a traditional school environment. I am no longer in the K-12 school system and have successfully earned my degree and now have a fulfilling career. Nonetheless, it means a great deal for me to see others at least have the option to pursue something like homeschooling, if only so that they don't have to go through what I did. permalink parent award report block reply thisguy883 1 points 5 days ago My children were in a religious school until it closed down for lack of funding. The next closest school with the same religious affiliation, is an hour drive. Now we have them in a charter school that follows the same values, but without the religious overtones. permalink parent award report block reply\nGet_Off_Big_Tech 14 points 5 days ago Religious schools give better odds, but they still need to be monitored by the parents. I agree that moving should be considered to give kids a better life. permalink parent award report block reply guywholikesDjtof2024 1 points 4 days ago religious Christian. Substituting \"religious\" for \"Christian\" has led to a lot of confusion, and damage to humanity. Everyone has a religion. One big devastating thing is the pretense that the terms \"Christian\" and \"religion/religious\" are interchangeable. Ever wonder why only Christianity is interchanged?? When you say \"religion\" people assume Christianity. Not islam, buddism, atheism, agnosticism, nope!! ONLY Christianity gets this kind of confusion aimed at it. How curious. Almost as if Christianity is true and wicked people want to muddy waters by switching Christianity with the vague umbrella term \"religion\". What we need is BIBLICAL CHRISTIANITY. Not vague, unnamed, generic, \"religion\". permalink parent award report block reply\nguywholikesDjtof2024 1 points 4 days ago religious Christian. Substituting \"religious\" for \"Christian\" has led to a lot of confusion, and damage to humanity. Everyone has a religion. One big devastating thing is the pretense that the terms \"Christian\" and \"religion/religious\" are interchangeable. Ever wonder why only Christianity is interchanged?? When you say \"religion\" people assume Christianity. Not islam, buddism, atheism, agnosticism, nope!! ONLY Christianity gets this kind of confusion aimed at it. How curious. Almost as if Christianity is true and wicked people want to muddy waters by switching Christianity with the vague umbrella term \"religion\". What we need is BIBLICAL CHRISTIANITY. Not vague, unnamed, generic, \"religion\". permalink parent award report block reply\nCh3f4554551n 3 points 5 days ago We teach at home. Just teach your kids where and how to learn, then encourage them and provide a structure. Humans teach themselves until they are put in an environment where they are either prevented from doing so, or are crushed psychologically to the point where they give up...like public schools. permalink parent award report block reply N14205ST205 2 points 5 days ago I desperately needed homeschooling when I was in K-12. I finally got it in the form of online college classes I took in my bedroom. It was a proving ground for me to put the skills managing time, resources, and strategies in the video games I have always loved playing- and; the ideas I gained from seeing the strengths of different ideas and ingenuity approaches in every kind of motorsports imaginable, to use. Those online college classes were the best academic years of my life. I made the Dean's List, got to understand the material in a way that let me connect it to my interests plus burgeoning MAGA and Trump support, and finally got to do work I was proud of because I could do it my way at my own pace. Examples come in the form of assignments where we commented on current events. I used them to explain why I thought MAGA and anti globalism ideas were better, even if that meant I couldn't do them the easy way and had to work harder. My teachers actually praised my conviction and detail and appreciated how my enthusiasm showed in my work. On the other hand, my K-12 schools (all private, religious, and in person) left me with severe trust issues, bad memories of a Dangerous Minds like gauntlet of status and chaos (I was literally the closest thing to a nerd in my 6th-8th grade school. Yes I was bullied for it, but the class wide punishments were what bothered me- I was proud that a bunch of youths, as this site defines them, didn't like me), a near lethal mental health crisis, and a deeply fractured family dynamic. They were awful. The kids were so disrespectful and prone to things like getting into fights or destroying and throwing property that the teachers were really heavy handed in their approaches to discipline. It felt like a warzone. I was so scared of getting in trouble and was so disgusted by my peers that I didn't talk at all at school for a decade unless it was to a teacher. I knew from the moment I started kindergarten that I was fundamentally incompatibile with the school environment. Over 12 years, I never felt at home at any of my schools. That's just half of it. Don't worry, I got better. Point is, there are some kids out there who really do need some kind of homeschooling or independent study so they can channel energy they'd otherwise spend trying to survive into delving deep into their passions, using them to understand other things in the world, and end up with a genuine growth journey that empowers them to chase their dreams and tap into potential that would otherwise be dormant if they were trapped in a traditional school environment. I am no longer in the K-12 school system and have successfully earned my degree and now have a fulfilling career. Nonetheless, it means a great deal for me to see others at least have the option to pursue something like homeschooling, if only so that they don't have to go through what I did. permalink parent award report block reply\nN14205ST205 2 points 5 days ago I desperately needed homeschooling when I was in K-12. I finally got it in the form of online college classes I took in my bedroom. It was a proving ground for me to put the skills managing time, resources, and strategies in the video games I have always loved playing- and; the ideas I gained from seeing the strengths of different ideas and ingenuity approaches in every kind of motorsports imaginable, to use. Those online college classes were the best academic years of my life. I made the Dean's List, got to understand the material in a way that let me connect it to my interests plus burgeoning MAGA and Trump support, and finally got to do work I was proud of because I could do it my way at my own pace. Examples come in the form of assignments where we commented on current events. I used them to explain why I thought MAGA and anti globalism ideas were better, even if that meant I couldn't do them the easy way and had to work harder. My teachers actually praised my conviction and detail and appreciated how my enthusiasm showed in my work. On the other hand, my K-12 schools (all private, religious, and in person) left me with severe trust issues, bad memories of a Dangerous Minds like gauntlet of status and chaos (I was literally the closest thing to a nerd in my 6th-8th grade school. Yes I was bullied for it, but the class wide punishments were what bothered me- I was proud that a bunch of youths, as this site defines them, didn't like me), a near lethal mental health crisis, and a deeply fractured family dynamic. They were awful. The kids were so disrespectful and prone to things like getting into fights or destroying and throwing property that the teachers were really heavy handed in their approaches to discipline. It felt like a warzone. I was so scared of getting in trouble and was so disgusted by my peers that I didn't talk at all at school for a decade unless it was to a teacher. I knew from the moment I started kindergarten that I was fundamentally incompatibile with the school environment. Over 12 years, I never felt at home at any of my schools. That's just half of it. Don't worry, I got better. Point is, there are some kids out there who really do need some kind of homeschooling or independent study so they can channel energy they'd otherwise spend trying to survive into delving deep into their passions, using them to understand other things in the world, and end up with a genuine growth journey that empowers them to chase their dreams and tap into potential that would otherwise be dormant if they were trapped in a traditional school environment. I am no longer in the K-12 school system and have successfully earned my degree and now have a fulfilling career. Nonetheless, it means a great deal for me to see others at least have the option to pursue something like homeschooling, if only so that they don't have to go through what I did. permalink parent award report block reply\nthisguy883 1 points 5 days ago My children were in a religious school until it closed down for lack of funding. The next closest school with the same religious affiliation, is an hour drive. Now we have them in a charter school that follows the same values, but without the religious overtones. permalink parent award report block reply\nMAGABOND 3 points 5 days ago Especially if the mom doesn’t have a fucking job, like my coworkers wife. permalink parent award report block reply\nYaemz123 1 points 5 days ago I sent my son to public school. I also taught him critical thinking skills, watched very carefully all that the teachers taught, and worked with him throughout school on both his homework and advised him on social interactions. He learned about bullying, dealing with incompetent people placed in positions of authority over him, peer pressure, comformity vs non-conformity, when to push back vs when to bide his time, etc. As an involved parent, I believe the negatives of life during public school are some of the most important things children can learn, PROVIDED they have competent and supportive parents. A tree that is well watered grows deeper roots by enduring the storms of life. permalink parent award report block reply\nBlippiIsAPedo 1 points 5 days ago Cant do everything yourself. Nothing better than networking with other parents to enact real change permalink parent award report block reply\nCrankyCrab 18 points 5 days ago I have given this look a few times at work. There were times I used to question my decision to homeschool, but I am glad I stuck with it from elementary through high school.  My kiddo is a hard working, responsible young adult. permalink award report block reply RememberCharlieKirk 5 points 5 days ago Good! Do you have any advice on a curriculum? permalink parent award report block reply 2008RonPaul2012 4 points 5 days ago Ron Paul Curriculum is awesome permalink parent award report block reply patthepatriotic 2 points 5 days ago Look up classical education. permalink parent award report block reply CrankyCrab 2 points 4 days ago I developed my own curriculum using a variety of resources. I had considered using Calvert, but even 20+ years ago, it was quite expensive. To make sure there were no issues when applying to college, I enrolled my daughter in Penn Foster’s high school program. It’s regionally accredited, affordable, and relatively easy to complete. She finished the program in two years and was accepted to several state and private colleges (though not Ivy League schools). permalink parent award report block reply RememberCharlieKirk 3 points 4 days ago Thank you for your informative response! permalink parent award report block reply\nRememberCharlieKirk 5 points 5 days ago Good! Do you have any advice on a curriculum? permalink parent award report block reply 2008RonPaul2012 4 points 5 days ago Ron Paul Curriculum is awesome permalink parent award report block reply patthepatriotic 2 points 5 days ago Look up classical education. permalink parent award report block reply CrankyCrab 2 points 4 days ago I developed my own curriculum using a variety of resources. I had considered using Calvert, but even 20+ years ago, it was quite expensive. To make sure there were no issues when applying to college, I enrolled my daughter in Penn Foster’s high school program. It’s regionally accredited, affordable, and relatively easy to complete. She finished the program in two years and was accepted to several state and private colleges (though not Ivy League schools). permalink parent award report block reply RememberCharlieKirk 3 points 4 days ago Thank you for your informative response! permalink parent award report block reply\n2008RonPaul2012 4 points 5 days ago Ron Paul Curriculum is awesome permalink parent award report block reply\npatthepatriotic 2 points 5 days ago Look up classical education. permalink parent award report block reply\nCrankyCrab 2 points 4 days ago I developed my own curriculum using a variety of resources. I had considered using Calvert, but even 20+ years ago, it was quite expensive. To make sure there were no issues when applying to college, I enrolled my daughter in Penn Foster’s high school program. It’s regionally accredited, affordable, and relatively easy to complete. She finished the program in two years and was accepted to several state and private colleges (though not Ivy League schools). permalink parent award report block reply RememberCharlieKirk 3 points 4 days ago Thank you for your informative response! permalink parent award report block reply\nRememberCharlieKirk 3 points 4 days ago Thank you for your informative response! permalink parent award report block reply\npedespeed 16 points 5 days ago your partner Me:  oh, you mean my Wife? We prefer the term partner so as not to offend Me:  it's my Wife and she is offended by being downgraded to the term \"partner\" 🥴 permalink award report block reply\nCaliAli 13 points 5 days ago Somebody please create the short gif/clip of lasers from Sweeny's eyes and then that interviewers head exploding. permalink award report block reply SHILL_DETECTOR 6 points 5 days ago drugged out eyes shooting lazers pew pew permalink parent award report block reply\nSHILL_DETECTOR 6 points 5 days ago drugged out eyes shooting lazers pew pew permalink parent award report block reply\nSHILL_DETECTOR 10 points 5 days ago san paku eyes are disturbing permalink award report block reply schnazzmizzle 11 points 5 days ago There's nothing wong with them. permalink parent award report block reply\nschnazzmizzle 11 points 5 days ago There's nothing wong with them. permalink parent award report block reply\n_Sully_ 8 points 5 days ago She actually got so much hotter. That harpy hates her guts and it's so obvious. And it isn't because of insensitivity. It's pure envy. permalink award report block reply\nSpacemonkey 8 points 5 days ago I visibly cringe whenever I hear someone say \"my partner\" it's your girlfriend or boyfriend or husband or wife you fucking faggot. permalink award report block reply\nCowboy888 7 points 5 days ago Her padna is a carpet muncher. permalink award report block reply\nToddyoungsvagina 6 points 5 days ago No shit saw at least 2 Troons teaching at my kids high school permalink award report block reply YouEssAye 8 points 5 days ago Imagine knowing this and still sending your kids to these indoctrination camps. permalink parent award report block reply ismellhippies 0 points 5 days ago ah yes, because everyone has the luxury of not requiring dual incomes to survive.  Homeschooling is great, and so are some private schools, but not everyone has the means.  I bet you're next comeback will be \"then don't have kids\"... and then you'll be bitching about how white people are becoming a minority. permalink parent award report block reply YouEssAye 3 points 5 days ago because everyone has the luxury of not requiring dual incomes to survive I probably make less than both you and your wife individually. My wife hasn't worked since she was 5 months preggo and she won't work until my youngest is out of the house. It's not easy, but it's worth it for my kid's future. but not everyone has the means You very likely do have the means, you're just not willing to part with your consumerist lifestyle. I bet you're next comeback will be \"then don't have kids\" That would've been a losing bet. Have kids and make whatever sacrifice is necessary to keep them out of indoctrination camps. permalink parent award report block reply TennesseeBorn 2 points 5 days ago Yes, most people don't want to be a one income household. permalink parent award report block reply ismellhippies 2 points 5 days ago You sound like good parents to sacrifice for your kids like that. My wife and I live in a very high cost of living area, we live well below our means, invest aggressively, and are fortunate enough that we expect be in a comfortable position to home school by the time our first is ready for elementary school. I just also happen to know plenty of people barely surviving with two incomes due to the high cost of living where we are.  They could could save if they move to the hood, otherwise they'd have to leave the area and try to find better employment. permalink parent award report block reply Toddyoungsvagina -5 points 5 days ago Ha ha, sorry pal not the case. But cute comeback. Maybe someday you’ll have kids. permalink parent award report block reply YouEssAye 2 points 5 days ago Ha ha, sorry pal not the case What's not the case? You just admitted you send your kids to a school with multiple tranny teachers lol. Maybe someday you’ll have kids. Mine are at home with their mom as we speak, yours are having their worldview shaped by trannies as we speak. We are not the same. permalink parent award report block reply diverscale -1 points 5 days ago Wow you're so perfect permalink parent award report block reply view 1 more comments... Toddyoungsvagina -1 points 5 days ago Leaving your kids schooling to a female? Bro are you gay? permalink parent award report block reply view 1 more comments... BeauHD 2 points 5 days ago Which one? permalink parent award report block reply\nYouEssAye 8 points 5 days ago Imagine knowing this and still sending your kids to these indoctrination camps. permalink parent award report block reply ismellhippies 0 points 5 days ago ah yes, because everyone has the luxury of not requiring dual incomes to survive.  Homeschooling is great, and so are some private schools, but not everyone has the means.  I bet you're next comeback will be \"then don't have kids\"... and then you'll be bitching about how white people are becoming a minority. permalink parent award report block reply YouEssAye 3 points 5 days ago because everyone has the luxury of not requiring dual incomes to survive I probably make less than both you and your wife individually. My wife hasn't worked since she was 5 months preggo and she won't work until my youngest is out of the house. It's not easy, but it's worth it for my kid's future. but not everyone has the means You very likely do have the means, you're just not willing to part with your consumerist lifestyle. I bet you're next comeback will be \"then don't have kids\" That would've been a losing bet. Have kids and make whatever sacrifice is necessary to keep them out of indoctrination camps. permalink parent award report block reply TennesseeBorn 2 points 5 days ago Yes, most people don't want to be a one income household. permalink parent award report block reply ismellhippies 2 points 5 days ago You sound like good parents to sacrifice for your kids like that. My wife and I live in a very high cost of living area, we live well below our means, invest aggressively, and are fortunate enough that we expect be in a comfortable position to home school by the time our first is ready for elementary school. I just also happen to know plenty of people barely surviving with two incomes due to the high cost of living where we are.  They could could save if they move to the hood, otherwise they'd have to leave the area and try to find better employment. permalink parent award report block reply Toddyoungsvagina -5 points 5 days ago Ha ha, sorry pal not the case. But cute comeback. Maybe someday you’ll have kids. permalink parent award report block reply YouEssAye 2 points 5 days ago Ha ha, sorry pal not the case What's not the case? You just admitted you send your kids to a school with multiple tranny teachers lol. Maybe someday you’ll have kids. Mine are at home with their mom as we speak, yours are having their worldview shaped by trannies as we speak. We are not the same. permalink parent award report block reply diverscale -1 points 5 days ago Wow you're so perfect permalink parent award report block reply view 1 more comments... Toddyoungsvagina -1 points 5 days ago Leaving your kids schooling to a female? Bro are you gay? permalink parent award report block reply view 1 more comments...\nismellhippies 0 points 5 days ago ah yes, because everyone has the luxury of not requiring dual incomes to survive.  Homeschooling is great, and so are some private schools, but not everyone has the means.  I bet you're next comeback will be \"then don't have kids\"... and then you'll be bitching about how white people are becoming a minority. permalink parent award report block reply YouEssAye 3 points 5 days ago because everyone has the luxury of not requiring dual incomes to survive I probably make less than both you and your wife individually. My wife hasn't worked since she was 5 months preggo and she won't work until my youngest is out of the house. It's not easy, but it's worth it for my kid's future. but not everyone has the means You very likely do have the means, you're just not willing to part with your consumerist lifestyle. I bet you're next comeback will be \"then don't have kids\" That would've been a losing bet. Have kids and make whatever sacrifice is necessary to keep them out of indoctrination camps. permalink parent award report block reply TennesseeBorn 2 points 5 days ago Yes, most people don't want to be a one income household. permalink parent award report block reply ismellhippies 2 points 5 days ago You sound like good parents to sacrifice for your kids like that. My wife and I live in a very high cost of living area, we live well below our means, invest aggressively, and are fortunate enough that we expect be in a comfortable position to home school by the time our first is ready for elementary school. I just also happen to know plenty of people barely surviving with two incomes due to the high cost of living where we are.  They could could save if they move to the hood, otherwise they'd have to leave the area and try to find better employment. permalink parent award report block reply\nYouEssAye 3 points 5 days ago because everyone has the luxury of not requiring dual incomes to survive I probably make less than both you and your wife individually. My wife hasn't worked since she was 5 months preggo and she won't work until my youngest is out of the house. It's not easy, but it's worth it for my kid's future. but not everyone has the means You very likely do have the means, you're just not willing to part with your consumerist lifestyle. I bet you're next comeback will be \"then don't have kids\" That would've been a losing bet. Have kids and make whatever sacrifice is necessary to keep them out of indoctrination camps. permalink parent award report block reply TennesseeBorn 2 points 5 days ago Yes, most people don't want to be a one income household. permalink parent award report block reply ismellhippies 2 points 5 days ago You sound like good parents to sacrifice for your kids like that. My wife and I live in a very high cost of living area, we live well below our means, invest aggressively, and are fortunate enough that we expect be in a comfortable position to home school by the time our first is ready for elementary school. I just also happen to know plenty of people barely surviving with two incomes due to the high cost of living where we are.  They could could save if they move to the hood, otherwise they'd have to leave the area and try to find better employment. permalink parent award report block reply\nTennesseeBorn 2 points 5 days ago Yes, most people don't want to be a one income household. permalink parent award report block reply\nismellhippies 2 points 5 days ago You sound like good parents to sacrifice for your kids like that. My wife and I live in a very high cost of living area, we live well below our means, invest aggressively, and are fortunate enough that we expect be in a comfortable position to home school by the time our first is ready for elementary school. I just also happen to know plenty of people barely surviving with two incomes due to the high cost of living where we are.  They could could save if they move to the hood, otherwise they'd have to leave the area and try to find better employment. permalink parent award report block reply\nToddyoungsvagina -5 points 5 days ago Ha ha, sorry pal not the case. But cute comeback. Maybe someday you’ll have kids. permalink parent award report block reply YouEssAye 2 points 5 days ago Ha ha, sorry pal not the case What's not the case? You just admitted you send your kids to a school with multiple tranny teachers lol. Maybe someday you’ll have kids. Mine are at home with their mom as we speak, yours are having their worldview shaped by trannies as we speak. We are not the same. permalink parent award report block reply diverscale -1 points 5 days ago Wow you're so perfect permalink parent award report block reply view 1 more comments... Toddyoungsvagina -1 points 5 days ago Leaving your kids schooling to a female? Bro are you gay? permalink parent award report block reply view 1 more comments...\nYouEssAye 2 points 5 days ago Ha ha, sorry pal not the case What's not the case? You just admitted you send your kids to a school with multiple tranny teachers lol. Maybe someday you’ll have kids. Mine are at home with their mom as we speak, yours are having their worldview shaped by trannies as we speak. We are not the same. permalink parent award report block reply diverscale -1 points 5 days ago Wow you're so perfect permalink parent award report block reply view 1 more comments... Toddyoungsvagina -1 points 5 days ago Leaving your kids schooling to a female? Bro are you gay? permalink parent award report block reply view 1 more comments...\ndiverscale -1 points 5 days ago Wow you're so perfect permalink parent award report block reply view 1 more comments...\nToddyoungsvagina -1 points 5 days ago Leaving your kids schooling to a female? Bro are you gay? permalink parent award report block reply view 1 more comments...\nBeauHD 2 points 5 days ago Which one? permalink parent award report block reply\njohnfist2 6 points 5 days ago Report it as sexual harassment.  That's what the freakoids would do to you. permalink award report block reply\nTrumpRideorDie74 5 points 5 days ago I can't stand that fuckin term. It's code for overloaded faggotry whenever I hear it. permalink award report block reply\nFusionBlack 4 points 5 days ago Now that's a good fresh meme. permalink award report block reply\nHobisterCavinboub 4 points 5 days ago pusillanimous - Lacking strength and firmness of mind; wanting in courage and fortitude; being of weak courage; faint-hearted; mean-spirited; cowardly. So progressive!  They LOOKED at the teacher!  So STRONG!  /SARCASM Looks do not kill.  Looks do NOTHING.  Republicans...  Strong worded letter.  Weaktards!  No different than a LIBTARD. Either STAND UP [for your own KIDS], or remain seated and silent. permalink award report block reply RememberCharlieKirk 2 points 5 days ago A difference in interpretation: I read the post as a joke, rather than a recollection of a past sassy action by the author. You read the post as an ineffectual boast. permalink parent award report block reply HobisterCavinboub 2 points 5 days ago You are correct.  Tough morning for me.  Thanks. permalink parent award report block reply\nRememberCharlieKirk 2 points 5 days ago A difference in interpretation: I read the post as a joke, rather than a recollection of a past sassy action by the author. You read the post as an ineffectual boast. permalink parent award report block reply HobisterCavinboub 2 points 5 days ago You are correct.  Tough morning for me.  Thanks. permalink parent award report block reply\nHobisterCavinboub 2 points 5 days ago You are correct.  Tough morning for me.  Thanks. permalink parent award report block reply\nTrumpTank 4 points 5 days ago Howdy, partner. Yeah really fucking sexy. permalink award report block reply\nElectionMeddler 4 points 5 days ago That's when you finally decide that homeschooling is happening the next day.  Pull the kids out of school.  Find like minded parents and homeschool your children to be raised with your morals. permalink award report block reply\nNow_On_to_Mars 4 points 5 days ago Do you fuck your partner?\nYes!\nAre you gay or an unethical businessperson? permalink award report block reply\nCaptainChewbacca 3 points 5 days ago I definitely appreciated the phantom zone reference. She should've been Super Girl. permalink award report block reply ChrisSuperDude 2 points 5 days ago She’d be a better fit for Power Girl. permalink parent award report block reply\nChrisSuperDude 2 points 5 days ago She’d be a better fit for Power Girl. permalink parent award report block reply\nJanOctSept 3 points 5 days ago Wow, one look perfectly personifies my disgust and disdain for performative, leftist scolds. permalink award report block reply\ndestroyer713 2 points 5 days ago It's an unfortunate change of language, but I see more and more people refer to their husband or wife as their \"partner\" even in a normal marriage. permalink award report block reply Get_Off_Big_Tech 6 points 5 days ago I only see that coming from liberals. permalink parent award report block reply Tardigrade 3 points 5 days ago It's funny, I mostly hear straight libs use it.  The gay guys I know have the balls to just say \"boyfriend\". permalink parent award report block reply\nGet_Off_Big_Tech 6 points 5 days ago I only see that coming from liberals. permalink parent award report block reply\nTardigrade 3 points 5 days ago It's funny, I mostly hear straight libs use it.  The gay guys I know have the balls to just say \"boyfriend\". permalink parent award report block reply\nConstitution_1788 2 points 5 days ago Homelander is one of the greatest characters ever created. permalink award report block reply\nKungPaoMcChicken 2 points 5 days ago I was watching Peacemaker from season 1. And of course there is the lesbian couple, and she's doing a presentation and there's a slide of her girls vagina. And you know what, it's funny how lesbians think normal straight men are, like we are sitting here waiting to be shown some vag. Yeah, you got us men perfectly summed up. We are just so one dimensional. permalink award report block reply\nraptormissle 2 points 5 days ago They call them their partner because it's just a business transaction and nothing more. permalink award report block reply\nquiznossucks 2 points 5 days ago Your wife ????   you mean the new ex Mrs smith....(my wife) permalink award report block reply\nanti_masker 2 points 5 days ago I hate the term partner, whether it's for faggotry reasons or not. permalink award report block reply\nconservativefrank 1 points 5 days ago A reference to THE WOKE BOYS = garbage. permalink award report block reply\nNick-Kerr -1 points 5 days ago Disgusting reference. I hope no one is giving Amazon's \"The Boys\" any views. It's disgusting, degenerate, and should be rated X. They pushed it to kids, of course. I mean if you like seeing bodies and people's heads explode in vivid detail intermixed with sex scenes, then you may need to re-evaluate your man-child life. permalink award report block reply Gfloydvotestrump 0 points 5 days ago How's it feel being 100 years old? permalink parent award report block reply Nick-Kerr 0 points 4 days ago How's it feel to be souless and empty with no morals? Manchildren like you are the reason we're in this mess. You slop up the degenerate filth, larp and play all day. I bet you have star wars figures on your desk right now. Grow the fuck up. Be a man. permalink parent award report block reply Gfloydvotestrump 0 points 4 days ago A loser named Nick-Kerr has the gall to call anyone else a manchild lmfao. Get fucked old man, your diaper needs to be changed. permalink parent award report block reply Nick-Kerr 1 points 3 days ago Triggered another retard. What's the matter? Your temu anime pillow shipment late? permalink parent award report block reply\nGfloydvotestrump 0 points 5 days ago How's it feel being 100 years old? permalink parent award report block reply Nick-Kerr 0 points 4 days ago How's it feel to be souless and empty with no morals? Manchildren like you are the reason we're in this mess. You slop up the degenerate filth, larp and play all day. I bet you have star wars figures on your desk right now. Grow the fuck up. Be a man. permalink parent award report block reply Gfloydvotestrump 0 points 4 days ago A loser named Nick-Kerr has the gall to call anyone else a manchild lmfao. Get fucked old man, your diaper needs to be changed. permalink parent award report block reply Nick-Kerr 1 points 3 days ago Triggered another retard. What's the matter? Your temu anime pillow shipment late? permalink parent award report block reply\nNick-Kerr 0 points 4 days ago How's it feel to be souless and empty with no morals? Manchildren like you are the reason we're in this mess. You slop up the degenerate filth, larp and play all day. I bet you have star wars figures on your desk right now. Grow the fuck up. Be a man. permalink parent award report block reply Gfloydvotestrump 0 points 4 days ago A loser named Nick-Kerr has the gall to call anyone else a manchild lmfao. Get fucked old man, your diaper needs to be changed. permalink parent award report block reply Nick-Kerr 1 points 3 days ago Triggered another retard. What's the matter? Your temu anime pillow shipment late? permalink parent award report block reply\nGfloydvotestrump 0 points 4 days ago A loser named Nick-Kerr has the gall to call anyone else a manchild lmfao. Get fucked old man, your diaper needs to be changed. permalink parent award report block reply Nick-Kerr 1 points 3 days ago Triggered another retard. What's the matter? Your temu anime pillow shipment late? permalink parent award report block reply\nNick-Kerr 1 points 3 days ago Triggered another retard. What's the matter? Your temu anime pillow shipment late? permalink parent award report block reply\nThe_Morrow_Outlander -1 points 5 days ago I mean, \"partner\" is fine in general, but when two people have a child together, it is safe to assume they're MARRIED until otherwise proven, and it's on THEM to correct you. permalink award report block reply\nfreedom4Speech 1 points 5 days ago Comment removed by community moderators. permalink award report block reply"}