{"id": "8175762", "contents": "1106 GEOTUS has the best people running his accounts. posted 4 days ago by BallsackPaneer 64 comments award share download report block\n64 comments Sort by Top Top New Worst Old Save MathletesFoot 65 points 4 days ago If only he had the best people running his cabinet. permalink award report block reply DrWeeGee 11 points 4 days ago We don't even have average people. We have women and pajeets permalink parent award report block reply therealrivensky -2 points 4 days ago Imagine hating women and browns more than hating losing elections. Imagine admitting that the left's accusations that MAGA hate women and browns are true. I'm starting to think it's true that there's a coordinated and intentional subversion campaign being waged against us which aims to make MAGA lose the midterms by turning away all the normies that helped us win 2024 by portraying us as everything that the left says we are. You're either an idiot or you don't care if MAGA loses the midterms to the left. permalink parent award report block reply NomadicKrow2 11 points 4 days ago Pam Bondi, dude. I don't hate her pussy. I hate her pussyfooting. permalink parent award report block reply DrWeeGee 6 points 4 days ago I don't hate women. But Trump's picks are obviously shit permalink parent award report block reply Lady_MaGa 4 points 4 days ago Your comment is spot on.  And look at all the downvotes.  From infiltrators and subversives that lie and claim they love Trump but are really here doing what you exactly exposed.  I've said this many times and not only downvoted but attacked verbally.  I do believe the rest of the woman haters are exactly that, women haters. permalink parent award report block reply therealrivensky 4 points 4 days ago The only way to stop Trump is through a massively coordinated demoralization campaign that targets his base. It's clever because it does 2 things: 1. Makes sure that MAGA loses every election that doesn't have Trump's name on the ballot. 2. Makes sure that MAGA never fixes our elections so that every win we've had thus far was ultimately for nothing. And these people have basically been appointed to do just that. They are overtly helping the left in stalling MAGA, but they are doing this in a way that the left never could. Because the left can't make us look racist or misogynistic anymore to normies no matter how hard they or the fake news keep lying about it, but these people actually can. They can because we tolerate them in our base even as they go around whining nonstop about women and browns. What we need to understand is that most of these people just don't vote so we don't need them to win any election either. And that's because these people don't really care about winning any election, just about being proven right. You'll notice that all of them will eventually tell you that elections are rigged and pointless, if you listen to their whining long enough. Because that's the end goal, if MAGA doesn't vote, how can MAGA win? So yeah, these are low energy losers who should have never been allowed on this site. I don't really know why PDW tolerates their subversion, especially that this critical inflection point where we NEED to secure the midterms. permalink parent award report block reply view 4 more comments... MathletesFoot 3 points 4 days ago The Republicans don't need help losing midterms, they can do that all on thier own. permalink parent award report block reply therealrivensky 1 points 4 days ago The Republicans can be pressured into voting our agenda. The Democrats cannot. Look it's either we win the midterms or  the Democrats win. And if they win, there goes our hope to MAGA. permalink parent award report block reply view 3 more comments... UCantStumpTheTrump 2 points 4 days ago You are correct that this site (and social media in general) is flooded with the time-tested \"former trump supporter\" shills, the Democrats are backed into a corner with nothing to run on, so now their next best tactic is to make it seem like Trump's base has turned on him. Keep in mind, every election cycle Trump has gained millions of new voters - he is gaining support, not losing it permalink parent award report block reply load 4 more comments... guywholikesDjtof2024 6 points 4 days ago THE DEMONRATS CREATED THE CLIMATE LEADING TO KIRK GETTING MURDERED IN COLD BLOOD. THEY BROWBEAT YOU OVER THE SMALLEST OF NON-ISSUES, WHILE EVERYTHING IS A-OK WITH (D)EY/(D)EM. HAVE A WINNING MINDSET. BE ACTIVE. BECAUSE THEY ARE. THEY WANT US AND OUR FAVORITE PEOPLE DEAD AND WOULD CELEBRATE AND RUB THEIR DEATH IN OUR FACES. THEY GOT KIRK KILLED AND KEEP DOING WRONG BECAUSE THEY COULD KEEP GETTING AWAY WITH IT!! permalink parent award report block reply MAGABOND 6 points 4 days ago I get off on being a loser, that’s why I vote Republican. permalink parent award report block reply staroframphansbhole 2 points 4 days ago It’s amazing that nearly 10 years later, people still don’t get that without Trump and the MAGA ideology in general, the GOP would never win an election again. Party should be renamed because “Republican” carries a ton of fag baggage aka Lindsey Graham, Mitt Romney, John McCain, et al permalink parent award report block reply Appeal2Heaven98 1 points 4 days ago DOOMER! /s permalink parent award report block reply spinometer2 0 points 4 days ago HE HAS THE GREATEST CABINET EVER ASSEMBLED permalink parent award report block reply FuckEveryDemocrat 21 points 4 days ago Mock, belittle, and troll these people every chance you get. permalink award report block reply DelendaEstMarxismo 10 points 4 days ago It's not just funny, it's effective politics. For decades Republicans have treated the press as if they're professionals and groveled for their acceptance even though they have been nothing but lying partisan leftist propagandist hacks. Trump finally taught the GOP that you don't have to indulge them. When you mock and troll them like he does, you discredit their legitimacy. permalink parent award report block reply UCantStumpTheTrump 3 points 4 days ago Exactly. Ridicule works. Even here, we are flooded with shills who are pretending to be upset Trump supporters, claiming \"no arrests\" (provably false) or \"nothing done on the border\" (again, provably false). These people need to be called out and ran off the site, many are Redditors here specifically to sow discord permalink parent award report block reply x79q3pb 5 points 4 days ago Demon's weakness. permalink parent award report block reply RachetQueen2020 1 points 4 days ago It is my strategy. Never apologize and troll. permalink parent award report block reply TrumpAndSimpsNotMAGA 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply BallsackPaneer OP 19 points 4 days ago Sauce: https://x.com/rapidresponse47/status/1986132577862713413 permalink award report block reply I-am-Orlando PRO 2 points 4 days ago Thanks for the link permalink parent award report block reply magapatriot_pa 17 points 4 days ago I voted for this permalink award report block reply Darkheartisland 15 points 4 days ago I upvoted this. permalink parent award report block reply Mortal_Wombat 9 points 4 days ago I want my mommy 🥹 🤣🤣🤣 permalink parent award report block reply airborne3502 16 points 4 days ago Trump tissues would sell like hotcakes. permalink award report block reply Lurkermon 6 points 4 days ago giggity permalink parent award report block reply Mortal_Wombat 3 points 4 days ago Only if they leave an orange stain though. permalink parent award report block reply pepperonishoes 1 points 4 days ago Make it so. permalink parent award report block reply Norwegianskier 12 points 4 days ago Maybe they shouldnt base their political strategy around demonizing the opposition. What you do to others legitimize what others can do to you. Personally, I enjoy media being called names. I can understand why republicans do this from a strategic perspective. permalink award report block reply guywholikesDjtof2024 4 points 4 days ago it exposes yet more hypocrisy. the media screams about names, but never about how evil the left is for celebrating CJK's murder. permalink parent award report block reply Counterwhat 6 points 4 days ago Politics is a blood sport. Bruising is inevitable. Remember, it's like punching cows. Have to get them moving in the right direction. permalink award report block reply justicein2020 5 points 4 days ago They're so lucky. Still way nicer than i would wish on the presstitutes. permalink award report block reply Nibba2 3 points 4 days ago It’s funny because they still do and did for the better part of a decade freely and openly print that the right were mentally deranged lunatics causing how much violence and even assassinations? permalink parent award report block reply Rope_Tree_Journalist 1 points 4 days ago Yup permalink parent award report block reply Nerdrem3 5 points 4 days ago Going easy on them. permalink award report block reply TheRedPike 4 points 4 days ago Yeah, I'm a little surprised they haven't been called faggot. permalink parent award report block reply Taylor3006 1 points 4 days ago Retarded faggots... permalink parent award report block reply FusionBlack 4 points 4 days ago I had a similar one of these but it originated from a military source . https://www.airslate.com/workflow/document/5454567-update-hurt-feelings-report I left it out on a work table at a DOD job. One of the new young DEI hires took it to the HR office and a investigation proceeded. Dumb asses in HR thought it was a real document. The older non woke workers had a damn good laugh when it was never spoke of again. This one was good also at the time clock. https://www.teacherspayteachers.com/Product/Free-Chicken-Strips-Funny-Punny-Rip-off-Tear-able-Classroom-Joke-April-Fools-11244778 permalink award report block reply pepperonishoes 1 points 4 days ago 😂 permalink parent award report block reply 26magarat 4 points 4 days ago Was treatment sought? Medication (SSRI's) Therapy Venting on social media Binge eating. permalink award report block reply NotAnotherNPC 3 points 4 days ago Hugh forgot we call them retards and faggots too... permalink award report block reply AtheistTrumper 3 points 4 days ago If you're getting called a moron, fucking blind, mentally ill, or a crackhead... You're either a journalist or you're surrounded by good friends permalink award report block reply ApplyingForce 1 points 4 days ago Hahahaha permalink award report block reply gunzby 1 points 4 days ago Do you know how awesome that job would be? You mean that I'll get paid to shit all over leftist media? Can I be an unpaid intern? I kind of feel bad taking money for such an awesome opportunity permalink award report block reply neomt 1 points 4 days ago Then stop being mentally ill, fucking blind, crackhead morons. Idk seems like an easy solution to me permalink award report block reply AgnesDomini 1 points 4 days ago Top KEK! As if they haven't called members of the Trump administration worse! permalink award report block reply pepperonishoes 1 points 4 days ago Hope they provide therapy mini horses. permalink award report block reply coinneach007 1 points 4 days ago Add a question \" Do you have a Safe Space available? Yes  No\" permalink award report block reply knnbccb 1 points 4 days ago Words are too hard for those mouthbreathers and pretend-journalists. You need to show them a picture of a doll, ask them to point the part where it hurts. permalink award report block reply UltraFrogMan 1 points 4 days ago Lmfao permalink award report block reply maverick202 0 points 4 days ago Kek permalink award report block reply UCantStumpTheTrump 1 points 4 days ago u/maverick202 is a self-admitted troll (read his post history) who calls people in this community \"incels\" and \"white trash,\" he also believes Joe Biden won the most votes of any President in history lmfao permalink parent award report block reply Pnw4gotpwd 0 points 4 days ago That's great! permalink award report block reply TheGoyimWhisperer 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply\nMathletesFoot 65 points 4 days ago If only he had the best people running his cabinet. permalink award report block reply DrWeeGee 11 points 4 days ago We don't even have average people. We have women and pajeets permalink parent award report block reply therealrivensky -2 points 4 days ago Imagine hating women and browns more than hating losing elections. Imagine admitting that the left's accusations that MAGA hate women and browns are true. I'm starting to think it's true that there's a coordinated and intentional subversion campaign being waged against us which aims to make MAGA lose the midterms by turning away all the normies that helped us win 2024 by portraying us as everything that the left says we are. You're either an idiot or you don't care if MAGA loses the midterms to the left. permalink parent award report block reply NomadicKrow2 11 points 4 days ago Pam Bondi, dude. I don't hate her pussy. I hate her pussyfooting. permalink parent award report block reply DrWeeGee 6 points 4 days ago I don't hate women. But Trump's picks are obviously shit permalink parent award report block reply Lady_MaGa 4 points 4 days ago Your comment is spot on.  And look at all the downvotes.  From infiltrators and subversives that lie and claim they love Trump but are really here doing what you exactly exposed.  I've said this many times and not only downvoted but attacked verbally.  I do believe the rest of the woman haters are exactly that, women haters. permalink parent award report block reply therealrivensky 4 points 4 days ago The only way to stop Trump is through a massively coordinated demoralization campaign that targets his base. It's clever because it does 2 things: 1. Makes sure that MAGA loses every election that doesn't have Trump's name on the ballot. 2. Makes sure that MAGA never fixes our elections so that every win we've had thus far was ultimately for nothing. And these people have basically been appointed to do just that. They are overtly helping the left in stalling MAGA, but they are doing this in a way that the left never could. Because the left can't make us look racist or misogynistic anymore to normies no matter how hard they or the fake news keep lying about it, but these people actually can. They can because we tolerate them in our base even as they go around whining nonstop about women and browns. What we need to understand is that most of these people just don't vote so we don't need them to win any election either. And that's because these people don't really care about winning any election, just about being proven right. You'll notice that all of them will eventually tell you that elections are rigged and pointless, if you listen to their whining long enough. Because that's the end goal, if MAGA doesn't vote, how can MAGA win? So yeah, these are low energy losers who should have never been allowed on this site. I don't really know why PDW tolerates their subversion, especially that this critical inflection point where we NEED to secure the midterms. permalink parent award report block reply view 4 more comments... MathletesFoot 3 points 4 days ago The Republicans don't need help losing midterms, they can do that all on thier own. permalink parent award report block reply therealrivensky 1 points 4 days ago The Republicans can be pressured into voting our agenda. The Democrats cannot. Look it's either we win the midterms or  the Democrats win. And if they win, there goes our hope to MAGA. permalink parent award report block reply view 3 more comments... UCantStumpTheTrump 2 points 4 days ago You are correct that this site (and social media in general) is flooded with the time-tested \"former trump supporter\" shills, the Democrats are backed into a corner with nothing to run on, so now their next best tactic is to make it seem like Trump's base has turned on him. Keep in mind, every election cycle Trump has gained millions of new voters - he is gaining support, not losing it permalink parent award report block reply load 4 more comments... guywholikesDjtof2024 6 points 4 days ago THE DEMONRATS CREATED THE CLIMATE LEADING TO KIRK GETTING MURDERED IN COLD BLOOD. THEY BROWBEAT YOU OVER THE SMALLEST OF NON-ISSUES, WHILE EVERYTHING IS A-OK WITH (D)EY/(D)EM. HAVE A WINNING MINDSET. BE ACTIVE. BECAUSE THEY ARE. THEY WANT US AND OUR FAVORITE PEOPLE DEAD AND WOULD CELEBRATE AND RUB THEIR DEATH IN OUR FACES. THEY GOT KIRK KILLED AND KEEP DOING WRONG BECAUSE THEY COULD KEEP GETTING AWAY WITH IT!! permalink parent award report block reply MAGABOND 6 points 4 days ago I get off on being a loser, that’s why I vote Republican. permalink parent award report block reply staroframphansbhole 2 points 4 days ago It’s amazing that nearly 10 years later, people still don’t get that without Trump and the MAGA ideology in general, the GOP would never win an election again. Party should be renamed because “Republican” carries a ton of fag baggage aka Lindsey Graham, Mitt Romney, John McCain, et al permalink parent award report block reply Appeal2Heaven98 1 points 4 days ago DOOMER! /s permalink parent award report block reply spinometer2 0 points 4 days ago HE HAS THE GREATEST CABINET EVER ASSEMBLED permalink parent award report block reply\nDrWeeGee 11 points 4 days ago We don't even have average people. We have women and pajeets permalink parent award report block reply therealrivensky -2 points 4 days ago Imagine hating women and browns more than hating losing elections. Imagine admitting that the left's accusations that MAGA hate women and browns are true. I'm starting to think it's true that there's a coordinated and intentional subversion campaign being waged against us which aims to make MAGA lose the midterms by turning away all the normies that helped us win 2024 by portraying us as everything that the left says we are. You're either an idiot or you don't care if MAGA loses the midterms to the left. permalink parent award report block reply NomadicKrow2 11 points 4 days ago Pam Bondi, dude. I don't hate her pussy. I hate her pussyfooting. permalink parent award report block reply DrWeeGee 6 points 4 days ago I don't hate women. But Trump's picks are obviously shit permalink parent award report block reply Lady_MaGa 4 points 4 days ago Your comment is spot on.  And look at all the downvotes.  From infiltrators and subversives that lie and claim they love Trump but are really here doing what you exactly exposed.  I've said this many times and not only downvoted but attacked verbally.  I do believe the rest of the woman haters are exactly that, women haters. permalink parent award report block reply therealrivensky 4 points 4 days ago The only way to stop Trump is through a massively coordinated demoralization campaign that targets his base. It's clever because it does 2 things: 1. Makes sure that MAGA loses every election that doesn't have Trump's name on the ballot. 2. Makes sure that MAGA never fixes our elections so that every win we've had thus far was ultimately for nothing. And these people have basically been appointed to do just that. They are overtly helping the left in stalling MAGA, but they are doing this in a way that the left never could. Because the left can't make us look racist or misogynistic anymore to normies no matter how hard they or the fake news keep lying about it, but these people actually can. They can because we tolerate them in our base even as they go around whining nonstop about women and browns. What we need to understand is that most of these people just don't vote so we don't need them to win any election either. And that's because these people don't really care about winning any election, just about being proven right. You'll notice that all of them will eventually tell you that elections are rigged and pointless, if you listen to their whining long enough. Because that's the end goal, if MAGA doesn't vote, how can MAGA win? So yeah, these are low energy losers who should have never been allowed on this site. I don't really know why PDW tolerates their subversion, especially that this critical inflection point where we NEED to secure the midterms. permalink parent award report block reply view 4 more comments... MathletesFoot 3 points 4 days ago The Republicans don't need help losing midterms, they can do that all on thier own. permalink parent award report block reply therealrivensky 1 points 4 days ago The Republicans can be pressured into voting our agenda. The Democrats cannot. Look it's either we win the midterms or  the Democrats win. And if they win, there goes our hope to MAGA. permalink parent award report block reply view 3 more comments... UCantStumpTheTrump 2 points 4 days ago You are correct that this site (and social media in general) is flooded with the time-tested \"former trump supporter\" shills, the Democrats are backed into a corner with nothing to run on, so now their next best tactic is to make it seem like Trump's base has turned on him. Keep in mind, every election cycle Trump has gained millions of new voters - he is gaining support, not losing it permalink parent award report block reply load 4 more comments...\ntherealrivensky -2 points 4 days ago Imagine hating women and browns more than hating losing elections. Imagine admitting that the left's accusations that MAGA hate women and browns are true. I'm starting to think it's true that there's a coordinated and intentional subversion campaign being waged against us which aims to make MAGA lose the midterms by turning away all the normies that helped us win 2024 by portraying us as everything that the left says we are. You're either an idiot or you don't care if MAGA loses the midterms to the left. permalink parent award report block reply NomadicKrow2 11 points 4 days ago Pam Bondi, dude. I don't hate her pussy. I hate her pussyfooting. permalink parent award report block reply DrWeeGee 6 points 4 days ago I don't hate women. But Trump's picks are obviously shit permalink parent award report block reply Lady_MaGa 4 points 4 days ago Your comment is spot on.  And look at all the downvotes.  From infiltrators and subversives that lie and claim they love Trump but are really here doing what you exactly exposed.  I've said this many times and not only downvoted but attacked verbally.  I do believe the rest of the woman haters are exactly that, women haters. permalink parent award report block reply therealrivensky 4 points 4 days ago The only way to stop Trump is through a massively coordinated demoralization campaign that targets his base. It's clever because it does 2 things: 1. Makes sure that MAGA loses every election that doesn't have Trump's name on the ballot. 2. Makes sure that MAGA never fixes our elections so that every win we've had thus far was ultimately for nothing. And these people have basically been appointed to do just that. They are overtly helping the left in stalling MAGA, but they are doing this in a way that the left never could. Because the left can't make us look racist or misogynistic anymore to normies no matter how hard they or the fake news keep lying about it, but these people actually can. They can because we tolerate them in our base even as they go around whining nonstop about women and browns. What we need to understand is that most of these people just don't vote so we don't need them to win any election either. And that's because these people don't really care about winning any election, just about being proven right. You'll notice that all of them will eventually tell you that elections are rigged and pointless, if you listen to their whining long enough. Because that's the end goal, if MAGA doesn't vote, how can MAGA win? So yeah, these are low energy losers who should have never been allowed on this site. I don't really know why PDW tolerates their subversion, especially that this critical inflection point where we NEED to secure the midterms. permalink parent award report block reply view 4 more comments... MathletesFoot 3 points 4 days ago The Republicans don't need help losing midterms, they can do that all on thier own. permalink parent award report block reply therealrivensky 1 points 4 days ago The Republicans can be pressured into voting our agenda. The Democrats cannot. Look it's either we win the midterms or  the Democrats win. And if they win, there goes our hope to MAGA. permalink parent award report block reply view 3 more comments... UCantStumpTheTrump 2 points 4 days ago You are correct that this site (and social media in general) is flooded with the time-tested \"former trump supporter\" shills, the Democrats are backed into a corner with nothing to run on, so now their next best tactic is to make it seem like Trump's base has turned on him. Keep in mind, every election cycle Trump has gained millions of new voters - he is gaining support, not losing it permalink parent award report block reply load 4 more comments...\nNomadicKrow2 11 points 4 days ago Pam Bondi, dude. I don't hate her pussy. I hate her pussyfooting. permalink parent award report block reply\nDrWeeGee 6 points 4 days ago I don't hate women. But Trump's picks are obviously shit permalink parent award report block reply\nLady_MaGa 4 points 4 days ago Your comment is spot on.  And look at all the downvotes.  From infiltrators and subversives that lie and claim they love Trump but are really here doing what you exactly exposed.  I've said this many times and not only downvoted but attacked verbally.  I do believe the rest of the woman haters are exactly that, women haters. permalink parent award report block reply therealrivensky 4 points 4 days ago The only way to stop Trump is through a massively coordinated demoralization campaign that targets his base. It's clever because it does 2 things: 1. Makes sure that MAGA loses every election that doesn't have Trump's name on the ballot. 2. Makes sure that MAGA never fixes our elections so that every win we've had thus far was ultimately for nothing. And these people have basically been appointed to do just that. They are overtly helping the left in stalling MAGA, but they are doing this in a way that the left never could. Because the left can't make us look racist or misogynistic anymore to normies no matter how hard they or the fake news keep lying about it, but these people actually can. They can because we tolerate them in our base even as they go around whining nonstop about women and browns. What we need to understand is that most of these people just don't vote so we don't need them to win any election either. And that's because these people don't really care about winning any election, just about being proven right. You'll notice that all of them will eventually tell you that elections are rigged and pointless, if you listen to their whining long enough. Because that's the end goal, if MAGA doesn't vote, how can MAGA win? So yeah, these are low energy losers who should have never been allowed on this site. I don't really know why PDW tolerates their subversion, especially that this critical inflection point where we NEED to secure the midterms. permalink parent award report block reply view 4 more comments...\ntherealrivensky 4 points 4 days ago The only way to stop Trump is through a massively coordinated demoralization campaign that targets his base. It's clever because it does 2 things: 1. Makes sure that MAGA loses every election that doesn't have Trump's name on the ballot. 2. Makes sure that MAGA never fixes our elections so that every win we've had thus far was ultimately for nothing. And these people have basically been appointed to do just that. They are overtly helping the left in stalling MAGA, but they are doing this in a way that the left never could. Because the left can't make us look racist or misogynistic anymore to normies no matter how hard they or the fake news keep lying about it, but these people actually can. They can because we tolerate them in our base even as they go around whining nonstop about women and browns. What we need to understand is that most of these people just don't vote so we don't need them to win any election either. And that's because these people don't really care about winning any election, just about being proven right. You'll notice that all of them will eventually tell you that elections are rigged and pointless, if you listen to their whining long enough. Because that's the end goal, if MAGA doesn't vote, how can MAGA win? So yeah, these are low energy losers who should have never been allowed on this site. I don't really know why PDW tolerates their subversion, especially that this critical inflection point where we NEED to secure the midterms. permalink parent award report block reply view 4 more comments...\nMathletesFoot 3 points 4 days ago The Republicans don't need help losing midterms, they can do that all on thier own. permalink parent award report block reply therealrivensky 1 points 4 days ago The Republicans can be pressured into voting our agenda. The Democrats cannot. Look it's either we win the midterms or  the Democrats win. And if they win, there goes our hope to MAGA. permalink parent award report block reply view 3 more comments...\ntherealrivensky 1 points 4 days ago The Republicans can be pressured into voting our agenda. The Democrats cannot. Look it's either we win the midterms or  the Democrats win. And if they win, there goes our hope to MAGA. permalink parent award report block reply view 3 more comments...\nUCantStumpTheTrump 2 points 4 days ago You are correct that this site (and social media in general) is flooded with the time-tested \"former trump supporter\" shills, the Democrats are backed into a corner with nothing to run on, so now their next best tactic is to make it seem like Trump's base has turned on him. Keep in mind, every election cycle Trump has gained millions of new voters - he is gaining support, not losing it permalink parent award report block reply\nguywholikesDjtof2024 6 points 4 days ago THE DEMONRATS CREATED THE CLIMATE LEADING TO KIRK GETTING MURDERED IN COLD BLOOD. THEY BROWBEAT YOU OVER THE SMALLEST OF NON-ISSUES, WHILE EVERYTHING IS A-OK WITH (D)EY/(D)EM. HAVE A WINNING MINDSET. BE ACTIVE. BECAUSE THEY ARE. THEY WANT US AND OUR FAVORITE PEOPLE DEAD AND WOULD CELEBRATE AND RUB THEIR DEATH IN OUR FACES. THEY GOT KIRK KILLED AND KEEP DOING WRONG BECAUSE THEY COULD KEEP GETTING AWAY WITH IT!! permalink parent award report block reply\nMAGABOND 6 points 4 days ago I get off on being a loser, that’s why I vote Republican. permalink parent award report block reply staroframphansbhole 2 points 4 days ago It’s amazing that nearly 10 years later, people still don’t get that without Trump and the MAGA ideology in general, the GOP would never win an election again. Party should be renamed because “Republican” carries a ton of fag baggage aka Lindsey Graham, Mitt Romney, John McCain, et al permalink parent award report block reply\nstaroframphansbhole 2 points 4 days ago It’s amazing that nearly 10 years later, people still don’t get that without Trump and the MAGA ideology in general, the GOP would never win an election again. Party should be renamed because “Republican” carries a ton of fag baggage aka Lindsey Graham, Mitt Romney, John McCain, et al permalink parent award report block reply\nAppeal2Heaven98 1 points 4 days ago DOOMER! /s permalink parent award report block reply\nspinometer2 0 points 4 days ago HE HAS THE GREATEST CABINET EVER ASSEMBLED permalink parent award report block reply\nFuckEveryDemocrat 21 points 4 days ago Mock, belittle, and troll these people every chance you get. permalink award report block reply DelendaEstMarxismo 10 points 4 days ago It's not just funny, it's effective politics. For decades Republicans have treated the press as if they're professionals and groveled for their acceptance even though they have been nothing but lying partisan leftist propagandist hacks. Trump finally taught the GOP that you don't have to indulge them. When you mock and troll them like he does, you discredit their legitimacy. permalink parent award report block reply UCantStumpTheTrump 3 points 4 days ago Exactly. Ridicule works. Even here, we are flooded with shills who are pretending to be upset Trump supporters, claiming \"no arrests\" (provably false) or \"nothing done on the border\" (again, provably false). These people need to be called out and ran off the site, many are Redditors here specifically to sow discord permalink parent award report block reply x79q3pb 5 points 4 days ago Demon's weakness. permalink parent award report block reply RachetQueen2020 1 points 4 days ago It is my strategy. Never apologize and troll. permalink parent award report block reply TrumpAndSimpsNotMAGA 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nDelendaEstMarxismo 10 points 4 days ago It's not just funny, it's effective politics. For decades Republicans have treated the press as if they're professionals and groveled for their acceptance even though they have been nothing but lying partisan leftist propagandist hacks. Trump finally taught the GOP that you don't have to indulge them. When you mock and troll them like he does, you discredit their legitimacy. permalink parent award report block reply UCantStumpTheTrump 3 points 4 days ago Exactly. Ridicule works. Even here, we are flooded with shills who are pretending to be upset Trump supporters, claiming \"no arrests\" (provably false) or \"nothing done on the border\" (again, provably false). These people need to be called out and ran off the site, many are Redditors here specifically to sow discord permalink parent award report block reply\nUCantStumpTheTrump 3 points 4 days ago Exactly. Ridicule works. Even here, we are flooded with shills who are pretending to be upset Trump supporters, claiming \"no arrests\" (provably false) or \"nothing done on the border\" (again, provably false). These people need to be called out and ran off the site, many are Redditors here specifically to sow discord permalink parent award report block reply\nx79q3pb 5 points 4 days ago Demon's weakness. permalink parent award report block reply\nRachetQueen2020 1 points 4 days ago It is my strategy. Never apologize and troll. permalink parent award report block reply\nTrumpAndSimpsNotMAGA 1 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply\nBallsackPaneer OP 19 points 4 days ago Sauce: https://x.com/rapidresponse47/status/1986132577862713413 permalink award report block reply I-am-Orlando PRO 2 points 4 days ago Thanks for the link permalink parent award report block reply\nI-am-Orlando PRO 2 points 4 days ago Thanks for the link permalink parent award report block reply\nmagapatriot_pa 17 points 4 days ago I voted for this permalink award report block reply Darkheartisland 15 points 4 days ago I upvoted this. permalink parent award report block reply Mortal_Wombat 9 points 4 days ago I want my mommy 🥹 🤣🤣🤣 permalink parent award report block reply\nDarkheartisland 15 points 4 days ago I upvoted this. permalink parent award report block reply Mortal_Wombat 9 points 4 days ago I want my mommy 🥹 🤣🤣🤣 permalink parent award report block reply\nMortal_Wombat 9 points 4 days ago I want my mommy 🥹 🤣🤣🤣 permalink parent award report block reply\nairborne3502 16 points 4 days ago Trump tissues would sell like hotcakes. permalink award report block reply Lurkermon 6 points 4 days ago giggity permalink parent award report block reply Mortal_Wombat 3 points 4 days ago Only if they leave an orange stain though. permalink parent award report block reply pepperonishoes 1 points 4 days ago Make it so. permalink parent award report block reply\nLurkermon 6 points 4 days ago giggity permalink parent award report block reply\nMortal_Wombat 3 points 4 days ago Only if they leave an orange stain though. permalink parent award report block reply\npepperonishoes 1 points 4 days ago Make it so. permalink parent award report block reply\nNorwegianskier 12 points 4 days ago Maybe they shouldnt base their political strategy around demonizing the opposition. What you do to others legitimize what others can do to you. Personally, I enjoy media being called names. I can understand why republicans do this from a strategic perspective. permalink award report block reply guywholikesDjtof2024 4 points 4 days ago it exposes yet more hypocrisy. the media screams about names, but never about how evil the left is for celebrating CJK's murder. permalink parent award report block reply\nguywholikesDjtof2024 4 points 4 days ago it exposes yet more hypocrisy. the media screams about names, but never about how evil the left is for celebrating CJK's murder. permalink parent award report block reply\nCounterwhat 6 points 4 days ago Politics is a blood sport. Bruising is inevitable. Remember, it's like punching cows. Have to get them moving in the right direction. permalink award report block reply\njusticein2020 5 points 4 days ago They're so lucky. Still way nicer than i would wish on the presstitutes. permalink award report block reply Nibba2 3 points 4 days ago It’s funny because they still do and did for the better part of a decade freely and openly print that the right were mentally deranged lunatics causing how much violence and even assassinations? permalink parent award report block reply Rope_Tree_Journalist 1 points 4 days ago Yup permalink parent award report block reply\nNibba2 3 points 4 days ago It’s funny because they still do and did for the better part of a decade freely and openly print that the right were mentally deranged lunatics causing how much violence and even assassinations? permalink parent award report block reply\nRope_Tree_Journalist 1 points 4 days ago Yup permalink parent award report block reply\nNerdrem3 5 points 4 days ago Going easy on them. permalink award report block reply TheRedPike 4 points 4 days ago Yeah, I'm a little surprised they haven't been called faggot. permalink parent award report block reply Taylor3006 1 points 4 days ago Retarded faggots... permalink parent award report block reply\nTheRedPike 4 points 4 days ago Yeah, I'm a little surprised they haven't been called faggot. permalink parent award report block reply Taylor3006 1 points 4 days ago Retarded faggots... permalink parent award report block reply\nTaylor3006 1 points 4 days ago Retarded faggots... permalink parent award report block reply\nFusionBlack 4 points 4 days ago I had a similar one of these but it originated from a military source . https://www.airslate.com/workflow/document/5454567-update-hurt-feelings-report I left it out on a work table at a DOD job. One of the new young DEI hires took it to the HR office and a investigation proceeded. Dumb asses in HR thought it was a real document. The older non woke workers had a damn good laugh when it was never spoke of again. This one was good also at the time clock. https://www.teacherspayteachers.com/Product/Free-Chicken-Strips-Funny-Punny-Rip-off-Tear-able-Classroom-Joke-April-Fools-11244778 permalink award report block reply pepperonishoes 1 points 4 days ago 😂 permalink parent award report block reply\npepperonishoes 1 points 4 days ago 😂 permalink parent award report block reply\n26magarat 4 points 4 days ago Was treatment sought? Medication (SSRI's) Therapy Venting on social media Binge eating. permalink award report block reply\nNotAnotherNPC 3 points 4 days ago Hugh forgot we call them retards and faggots too... permalink award report block reply\nAtheistTrumper 3 points 4 days ago If you're getting called a moron, fucking blind, mentally ill, or a crackhead... You're either a journalist or you're surrounded by good friends permalink award report block reply\nApplyingForce 1 points 4 days ago Hahahaha permalink award report block reply\ngunzby 1 points 4 days ago Do you know how awesome that job would be? You mean that I'll get paid to shit all over leftist media? Can I be an unpaid intern? I kind of feel bad taking money for such an awesome opportunity permalink award report block reply\nneomt 1 points 4 days ago Then stop being mentally ill, fucking blind, crackhead morons. Idk seems like an easy solution to me permalink award report block reply\nAgnesDomini 1 points 4 days ago Top KEK! As if they haven't called members of the Trump administration worse! permalink award report block reply\npepperonishoes 1 points 4 days ago Hope they provide therapy mini horses. permalink award report block reply\ncoinneach007 1 points 4 days ago Add a question \" Do you have a Safe Space available? Yes  No\" permalink award report block reply\nknnbccb 1 points 4 days ago Words are too hard for those mouthbreathers and pretend-journalists. You need to show them a picture of a doll, ask them to point the part where it hurts. permalink award report block reply\nUltraFrogMan 1 points 4 days ago Lmfao permalink award report block reply\nmaverick202 0 points 4 days ago Kek permalink award report block reply UCantStumpTheTrump 1 points 4 days ago u/maverick202 is a self-admitted troll (read his post history) who calls people in this community \"incels\" and \"white trash,\" he also believes Joe Biden won the most votes of any President in history lmfao permalink parent award report block reply\nUCantStumpTheTrump 1 points 4 days ago u/maverick202 is a self-admitted troll (read his post history) who calls people in this community \"incels\" and \"white trash,\" he also believes Joe Biden won the most votes of any President in history lmfao permalink parent award report block reply\nPnw4gotpwd 0 points 4 days ago That's great! permalink award report block reply\nTheGoyimWhisperer 1 points 4 days ago Comment removed upon the user being banned. permalink award report block reply"}