{"id": "8176339", "contents": "1311 The Face They Make When I Ask Them If They Want To Donate Their Tip To Mamdani 🤡🌎  HONK  HONK  🌎🤡 posted 4 days ago by RentFree2020 111 comments award share download report block\n111 comments Sort by Top Top New Worst Old Save mygovisacommie 102 points 4 days ago Anyone who supports socialism doesn’t work hard enough for their money. permalink award report block reply MrCuriousGuy513 28 points 4 days ago I agree. permalink parent award report block reply TheOriginalBrickBot 47 points 4 days ago HOLY FUCK this is absolutely true! I'm a repair tech for a dental company, and my coworker is a repair associate (level below a tech, more customer support). He's literal a poster child for a Mamadani voter. He's a fat, agnostic, neck beard socialist. On top of that he has literal tantrum/anger issues. He bitches about not making enough money and how he wishes he was a tech. The lead tech and I offer to train him on how to do repair jobs so he can beef up his resume. Basically paid training. He's a lazy piece of shit and says he will only do repair work if he's getting paid a repair tech salary. He turns down the training. Four months later our older tech retires, and he puts in an application. Management asks him if he has any repair experience. NOPE. Now he bitches and moans about how the company should have made him a tech based on the type of person he is and not his ability to repair. Mind you, both the lead tech and I have experience and degrees in our field.  Again, he's a fat, neck beard socialist who makes shit money and is happy that Mamdani was elected. Now we \"...can see\" how great socialism will be. End of story, people who support socialism are generally lazy, unmotivated fucks who only want gibbs for little to not work. permalink parent award report block reply FrmrAmericanRepublic 12 points 4 days ago True - they don't understand achievment via their own merits and expect everything handed to them. Its also why I mock socialists with \"I hate capitalism. (Sent from my iPhone)\" Though most are too retarded to get it. permalink parent award report block reply stormdraintrooper 1 points 4 days ago That's the most amusing part.  Insult them, and many times it goes right over their heads. permalink parent award report block reply user2827 3 points 4 days ago I can't relate to that industry, but the logic is ass backwards. The way I've seen it happen is closer to, guy gets hired as an equipment operator, shows that he's good at what he does, then a surge of work and the programmer can't keep up with demand and so they get asked to help the programmer.  Usually sooner than later, it's then that the offer for more pay in exchange for more responsibilities is offered. I've never seen happen any different way, except for cost of living adjustments. permalink parent award report block reply Thrasymachus 6 points 4 days ago This reveals one of the hard truths of the labor market.  You have to plan as if nobody has any goodness in their heart, because it's foolhardy to rely on it.  You have to rely on LEVERAGE, and consider things transactionally. When that equipment operator you mentioned is working at a programmer, their employer can and usually will start to rely on that level of skill and productivity.  At that point the employee has the ability to say, no, I think I'll take these skills elsewhere.  To the employer, it doesn't matter if the operator takes that skill to a competitor or starts living in a van down by the river, the result is, they lose an asset.  To avoid that, they have to pay him commensurately with the higher tier work he's doing. I only asked for a raise based on the naive assumption of \"It's Been A While\" once and I felt like an asshole when I realized it was presumptuous since I was still doing the same amount of work.  Instead I chose to add responsibilities and that made it easy and fair to ask for more money as a proportion of the business I brought it.  Create more value, earn more money. permalink parent award report block reply view 1 more comments... Cowboy888 2 points 4 days ago I can see this lard ass going into the company management and saying, \"Do you know who I am?\" permalink parent award report block reply ListenToSavage 2 points 4 days ago \"Yea I do. You're the unemployed fatty formerly known as repair associate.\" permalink parent award report block reply Tacitus1963 1 points 4 days ago Bernie Sanders has entered the conversation! permalink parent award report block reply Rydanovich 16 points 4 days ago It is a consistent trait. A lot of my clients support socialism. Every one of them are also dependent on socialist programs. None of them work, all are on snap and SSI. The second these programs stop, they are homeless. Without exception. permalink parent award report block reply RolandDelacroix 9 points 4 days ago So even when homeless they refuse to work? permalink parent award report block reply darkmodeforgotpass 10 points 4 days ago That's how homeless remain homeless. It is so easy for illegals to get a job. Imagine them when they use their money for a laundromat. They just don't want to work and live off the backs of anyone. So everyone is poor. Homeless crack heads have fucked with my things so much that I'm just never giving to them again. Not to mention that they are pigs when it comes to your S/O or children. They got themselves to that point and compound it eith drugs. It's a tough pill for some, but if you or I refused to work, no matter what, we'd be homeless as well. And they are able-bodied. These people are losers, and no amount of excuses or feel-bads will cover that up! permalink parent award report block reply Rydanovich 2 points 3 days ago Yep. I saw a lot of it when I was in the shelter. People with snap and SSI living in tents, refusing any and all other help because it comes with responsibilities. permalink parent award report block reply stormdraintrooper 1 points 4 days ago Oh yeah.  Sitting on a bucket in the median with a poorly worded sign is much more fulfilling.  It's for the drugs.  You can't really be employed and into your meth habit as well. What gets me, is their absolute filthiness.  Their camps are nothing more than emptied out garbage cans. permalink parent award report block reply IvanDrago 4 points 4 days ago I gotta ask, what is it that you do where these people are willing or needing to pay you from their gibs stash? I'm in the wrong line of work, because that's a growing client base when the Dems steal their next major election. permalink parent award report block reply Rydanovich 1 points 3 days ago I'm a caretaker for the elderly and the disabled. permalink parent award report block reply wilburh09 7 points 4 days ago A lot of young adults live a sheltered existence while working low paying jobs and thinking everyone should be Buddhist and that everyone is equal.  Hopefully many of them change their philosophy after years of grinding into a career and seeing how shitty many people are that don’t deserve shit from our taxpayer money or healthcare contributions.  Also many are brainwashed by their socialist loser high school teachers and college professors, as well as being brainwashed by pop media culture. permalink parent award report block reply IvanDrago 6 points 4 days ago Sales. I started the grind early selling golf balls, soda, plowing snow, mowing yards. Persuasion is an important life skill, because even if you're right, if you can't communicate it, the intellectual capacity is wasted. The earlier you get working, the sooner you figure out who the leeches are and how it's stolen from you. permalink parent award report block reply wilburh09 3 points 4 days ago But even that ..  you aren't paying rent and bills selling golf balls and soda .  But your point is valid.   Some people do have better work ethic values than others.  But just because someone is young and inexperienced making cheap wages working at Starbucks 30hrs a week  while 15 hours of classes (not concluding projects and homework/studying) in college doesn’t mean they are lazy.  They are probably misguided mostly, imo. permalink parent award report block reply Thrasymachus 3 points 4 days ago The fact that the dollar has been used as an instrument of the Federal Reserve board to siphon trillions of dollars of value from American labor to European bank accounts makes it so wages for unskilled labor is basically trash, appropriate for people who can wire it home to Mexico where it goes a lot further, or children who are still subsidized by their parents.  At one time that wage would have been able to support a livelihood with some thrift and careful planning.  Combine that with Marxist professors who tell them every made-up and ideological reason for these ills except the real ones and you can see how fertile the ground is for the radicalization of youth.  Add in the particular impressionability of young women based on illusory consensus and you've got...modern normie politics. permalink parent award report block reply view 1 more comments... Megaboom2025 1 points 4 days ago Don’t work* permalink parent award report block reply SavingPrivateGrace 43 points 4 days ago Come on honey, it's just the tip. permalink award report block reply STONKATRUCK 28 points 4 days ago A shame she could look pretty but instead she chose to look like a garbage bag permalink parent award report block reply Hanging_Chad 11 points 4 days ago she’s just unique, you bigot permalink parent award report block reply Megaboom2025 5 points 4 days ago Unique trash can. I blame the father. permalink parent award report block reply SicSemperTyrannis2 1 points 4 days ago Oscar the Grouch lives inside her? permalink parent award report block reply view 1 more comments... JohnMiller2020 2 points 4 days ago That is not unique, it's a unifrom permalink parent award report block reply Hanging_Chad 2 points 4 days ago kek permalink parent award report block reply Jaqen 10 points 4 days ago Indeed, the progressive movement has effectively destroyed the beauty of an entire generation of women. permalink parent award report block reply BunnyPicnic 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply MasterChief 6 points 4 days ago thats a softball player with a bow if I ever saw one permalink parent award report block reply Hanging_Chad 3 points 4 days ago softball players are lesbians IME permalink parent award report block reply MasterChief 3 points 4 days ago Just the ones with a bow if that's still a thing. Learned that from a carpet muncher in high school. Mustaches on gays supposedly means they are bottoms. Teardrop tattoos on the cheek means they've killed someone, or want to pretend like they did. permalink parent award report block reply Hanging_Chad 4 points 4 days ago what kind of bow? also, what do sideways pineapples mean? permalink parent award report block reply view 2 more comments... Thrasymachus 1 points 4 days ago lol isn't the teardrop is a prison thing?  Which makes it a bit of a ninety-degree turn from the gay identifiers. I remember when a single earing on a guy was apparently a signal, but since it was before the internet nobody was sure which ear was the gay one.  I was like, I'm pretty sure a guy with one single earing, you can just assume he's gay it probably doesn't matter which.  And bad luck for any hetero guys who didn't get the cultural memo and thought one earing would look cool (why?). permalink parent award report block reply AfrikaanerBoer 2 points 4 days ago No father figure who has been BLACKED™️ by groid after groid in “college” hence the tats, dyed hair and piercings….will be sterilized by aborting the countless niglets that defiled her womb and be a miserable cat lady by 35 💯🐈🐈‍⬛🐈🐈‍⬛🐈‍⬛🐈‍⬛🐈‍⬛🐈‍⬛🐈‍⬛🐈‍⬛🐈🐈🐈🐈 permalink parent award report block reply VirTW 18 points 4 days ago She wanted socialism ..... the community owns her tip now permalink award report block reply Hanging_Chad 2 points 4 days ago ah, that’s why tips are tax-free now.  it wouldn’t make sense to tax the gov’t/community permalink parent award report block reply mikejones 13 points 4 days ago Nothing like paying $27 for 6 steak tacos and a coke and they want a tip still. permalink award report block reply canada_is_communist 3 points 4 days ago $27 for 6 steak tacod and a coke hahahahha good one Try 2… permalink parent award report block reply SickofItall 10 points 4 days ago They HAVE to be held accountable for their vote. permalink award report block reply pi-triot 8 points 4 days ago Vocal fry, activate! permalink award report block reply monkadelic 8 points 4 days ago Jokes on them.  He's taking it either way. permalink award report block reply onesummerdream 7 points 4 days ago Prefect. Nice turn around. I’m sick of being asked if I want to round up for charity every where I go. permalink award report block reply RentFree2020 OP 10 points 4 days ago Exactly why I posted this. It's a nice little way to throw the guilt back at them. permalink parent award report block reply 1_Badcop 6 points 4 days ago This. I'm a charitable person. Or I was. Over the last several years  as I've learned what an unfathomable scam these nonprofits are, I've grown to become offended that they even ask me to contribute. Seriously, if I were younger, and crooked, I'd start my own non-profit. They are basically a license to print money. permalink parent award report block reply canada_is_communist 2 points 4 days ago Just donate 5% of ehat you raise and keep the rest lol permalink parent award report block reply JohnMiller2020 2 points 4 days ago Charity fatigue is real permalink parent award report block reply jornado87 5 points 4 days ago I actively decline that shit everywhere and have never been pressed about. permalink parent award report block reply RentFree2020 OP 1 points 4 days ago Same. If they aren't delivering or cleaning up after me i don't feel inclined to tip. I will never tip people at the register. I did during COVID if I picked up food. But, that was it. permalink parent award report block reply LadyGrahamsminge 2 points 4 days ago I fucking hate being asked that. It is meant to intentionally embarrass the customer if they say no. I turn it around on them with something new every time some idiot has the nerve to ask. My local Publix has a hijab wearing sheniqua working as a cashier, and her disdain for whites is nearly equal to my disdain of her ilk. Last time she asked, I said “ I will tell you like I told that junky in the parking lot on my way in, no. “ Bitch was seething and could do nothing about it. Have also just said  “ no, I’ve had a tough month and was hoping you could round down to the nearest 50.” They don’t ask me that shit anymore, after going to the manager desk several times and letting them know that times are hard, prices are high, and they shouldn’t be trying to embarrass their customers into paying even more for their groceries . It is a shitty way to conduct business, and I guarantee that the money never reaches anyone but those high paid administrators at the top of the charities. This country has changed so much since I was a kid. If they would have asked that of my Grandad or Grandma, let’s just say that they wouldn’t have done it twice. permalink parent award report block reply x79q3pb 1 points 4 days ago Any charity given through a grocery store is for the primary purpose of tax write offs for that business. permalink parent award report block reply tellmywifehello 6 points 4 days ago I just got an idea: a fake tip like those religious ones but inside the fold it says, \"I donated your tip to Mohamadani, he needs it more than you!\" permalink award report block reply Aquamine-Amarine 1 points 4 days ago That's a good one. permalink parent award report block reply corporateshizer 6 points 4 days ago This vapid, blank stare is the same look all the non-white register jockeys have these days. You speak to them, they stare back. permalink award report block reply Female 5 points 4 days ago If they really loved their supreme leader they would do it. permalink award report block reply OrangeManBadasss 4 points 4 days ago Or you know, just don't go to fucking Starbucks. permalink award report block reply NADSAQ 4 points 4 days ago i bought coffee away from home one time in 2025 and it was from kids running a booth at the Christian school permalink parent award report block reply RobinNet 3 points 4 days ago Sounds good on paper, right Sugar Tits? permalink award report block reply canada_is_communist 2 points 4 days ago Socialism for thee, but not for me Also grats on finding the absolute most cliche looking sbux employee lol permalink award report block reply SuperHonkey 2 points 4 days ago Missing the septum piercing 😬 permalink award report block reply HeCantDoIt 2 points 4 days ago Y'alls need to talk to more commies lol. They wouldn't get mad, they'd just say \"the billionaires should pay, because they have 99% of the wealth\". permalink award report block reply Nellie_the_Beaut 4 points 4 days ago They also theorize that if the government just taxes all these billionaires more - or better yet, just “seizes their wealth and properties because nobody needs that much money and it’s immoral to be that rich” -  they could finally have the socialist utopia they dream about.  The complete absence of basic math skills is astounding. permalink parent award report block reply Tromboneofsteel 2 points 3 days ago Not to mention the money of the 1% in this country would fund a socialist utopia for about 3 weeks and then it'd be gone. Now who pays? permalink parent award report block reply RentFree2020 OP 2 points 4 days ago Well, try this out a few times and report back. permalink parent award report block reply HeCantDoIt 1 points 4 days ago I already did. I had this exact conversation with my ex, and a couple of my co-workers a few years ago. One time my ex was complaining to me about her experience at a recent dental appointment, and our conversation veered into \"free healthcare\" territory. I forget how the whole convo went, but I probably said something like \"OK, then who is going to pay for it? Do you want your taxes to go up, or for inflation to go up due to all the money-printing required to 'pay' for it?\". She ignored my argument and just said that rich people can pay for it... And at a previous workplace, the topic of socialism got brought up once, and me 2 of my friends there hashed it out a bit. I remember saying: \"socialism is only possible because you give power to a tiny group of extremely corrupt people, who don't give a fuck about you, and who force you through the government's monopoly on violence, to hand-over huge chunks of your paycheck to pay for free things everyone wants. There's nothing voluntary or 'social' about that\". They didn't get mad, but just told me \"but the rich will pay for it, what's the problem\", and \"you're young and haven't studied these things, so of course you don't know how proper socialism could be done\". No anger or hostility in both instances, just coyness and \"the rich will pay for it!\". Also, while not quite related, a similar thing also happened on Reddit a few weeks ago. Some reddit fags were bitching about publicly-traded companies doing stupid things and being corrupted by shareholders, and I said \"part of the reason there's so much money sloshing around in the stock market is because the rich are FORCED to invest to protect their money, so that retarded beaurocrats don't get it through taxes and waste it instantly\". Their answer? \"Just tax the stock market for the rich!\". In these people's minds, their thought process is simply \"the rich have infinitely more than all of us, therefore why take from me?\". And breaking down that leg of their argument is impossible, because it'd require a tiny bit of abstract thinking (eg, rich people create jobs, invest in automation, increase wages by increasing demand for workers, etc.) - an ability none of them have. permalink parent award report block reply thisisatestof2 1 points 4 days ago Kek permalink award report block reply 5DchessWatch 1 points 4 days ago That's resting defaultbitchmode permalink award report block reply hnoble444 1 points 4 days ago LOL. Awesome. permalink award report block reply barwhack 1 points 4 days ago Don't give them a tip; in honor of Maam Dummy. permalink award report block reply CasuallyObservant 1 points 4 days ago Kek! permalink award report block reply canada_is_communist 1 points 4 days ago Honest question guy - if I pay this woman $5,000 CASH a month, does she accept to live with me instead of working this trash job? permalink award report block reply RentFree2020 OP 1 points 4 days ago Nope. Let's be real, the female in this photo is still attractive. Pink hair and retardation aside, I bet she's still getting a decent amount of attention so I'm sure her \"worth\" is much higher than 5,000 a month in girl world. permalink parent award report block reply canada_is_communist 1 points 4 days ago So why does she bother working for what, $100 a day? $2000 a month before taxes, so what, $1400 in new york? permalink parent award report block reply RentFree2020 OP 1 points 4 days ago I don't know this person personally haha. It's a screen grab from Google. - Try it. Go find a decent looking Starbucks employee and make the offer. Tell us how it goes. permalink parent award report block reply canada_is_communist 1 points 4 days ago Im honestly considering it. $5,000 a month to raise kids/take care of the home. Im serious. permalink parent award report block reply view 3 more comments... sordfysh PRO -1 points 4 days ago So you are saying that you as a capitalist can get back at the socialists by under paying them so they qualify for government benefits. You will convince them that capitalists don't care about other people, and you will convince them that the government will protect them from dire poverty. permalink award report block reply mailinvoter 1 points 4 days ago What a tard! Haha, faggot. I'll have a viente mocha with whipped cream, no soy! permalink parent award report block reply sordfysh PRO 1 points 4 days ago Lol. You go to Starbucks, faggot? And you get whipped cream? Ha! Americans order coffee in small, medium, or large. You can alternatively say 8, 12, or 16 oz. I don't even know what a venti means. And with your clear homosexuality, you should also get glitter sprinkles on top, too. Funny that you call me a faggot and then order one of the gayest drinks. But I know you Starbucks gays can get fruitier. Your degeneracy knows no bounds. permalink parent award report block reply mailinvoter 1 points 4 days ago No, I don't pay $25 for a cup of coffee flavored corn syrup. I grind my own beans at home (ironically, I do buy Starbucks brand beans when I get a 64oz bag for $3, but I digress). Just like I may speak a little Spanish doesn't make me a Messican, I speak a little faggot to interact with your kind. Sorry to lead you on, homoboy, but I don't let twinks pump and dump my butthole or get monkey pox sores in my throat like you. Go buy a coffee grinder, a decent brewer, and stop being a faggot that buys brown hot water from Dunkin Donuts. Oh wait, I forgot what this was even about. Nobody here wants US citizens to be on food stamps.  They are making fun of the people who voted to be fucked in the ass by a communist, and saying they can start paying the extra taxes they signed everyone else up for. I was calling you out for your retarded ass take on the situation.  These people were probably already on food stamps since they work for a coffee shop in their late twenties while living in New York City. They are going to learn that retarded actions have consequences. Also, yes, you are a faggot. permalink parent award report block reply sordfysh PRO 1 points 1 day ago Lol. You are talking about grindr coffee and explaining it in detail. You clearly like the penis. permalink parent award report block reply view 3 more comments... RentFree2020 OP 0 points 4 days ago No one is forcing them to work at Starbucks you retarded faggot. Also, blame the billion dollar corporation that's worshipped by them to pay them a wage. Seriously, all you fucking retards don't understand this. Not to mention these kinds of jobs were designed for high school and college kids. No one intended for putting milk in coffee to be a career. Fucking loser. permalink parent award report block reply sordfysh PRO 1 points 4 days ago Hey, I don't live in your community, so I don't care if you mistreat your fellow man. Just don't be surprised when the young people vote to take your money. You'll get the government you deserve. permalink parent award report block reply RentFree2020 OP 1 points 4 days ago Why is your position that we are under paying them? I still feel like your argument is stupid. I'm not Starbucks. I'm not paying their wages. I also don't think it's my responsibility to tip them to make up for the wage the multi billion dollar corporation refuses to pay them. Again. It's coffee. It's not a profession, it's not a skilled trade. permalink parent award report block reply sordfysh PRO 2 points 4 days ago This is America where we tip to reward and encourage proper American customer service. Go back to Europe or Israel or Cuba where you don't have to tip. permalink parent award report block reply view 9 more comments... BirthHole -1 points 4 days ago A non-Zionist as mayor, and the internet shitstorm begins. Oh the horribles!! permalink award report block reply\nmygovisacommie 102 points 4 days ago Anyone who supports socialism doesn’t work hard enough for their money. permalink award report block reply MrCuriousGuy513 28 points 4 days ago I agree. permalink parent award report block reply TheOriginalBrickBot 47 points 4 days ago HOLY FUCK this is absolutely true! I'm a repair tech for a dental company, and my coworker is a repair associate (level below a tech, more customer support). He's literal a poster child for a Mamadani voter. He's a fat, agnostic, neck beard socialist. On top of that he has literal tantrum/anger issues. He bitches about not making enough money and how he wishes he was a tech. The lead tech and I offer to train him on how to do repair jobs so he can beef up his resume. Basically paid training. He's a lazy piece of shit and says he will only do repair work if he's getting paid a repair tech salary. He turns down the training. Four months later our older tech retires, and he puts in an application. Management asks him if he has any repair experience. NOPE. Now he bitches and moans about how the company should have made him a tech based on the type of person he is and not his ability to repair. Mind you, both the lead tech and I have experience and degrees in our field.  Again, he's a fat, neck beard socialist who makes shit money and is happy that Mamdani was elected. Now we \"...can see\" how great socialism will be. End of story, people who support socialism are generally lazy, unmotivated fucks who only want gibbs for little to not work. permalink parent award report block reply FrmrAmericanRepublic 12 points 4 days ago True - they don't understand achievment via their own merits and expect everything handed to them. Its also why I mock socialists with \"I hate capitalism. (Sent from my iPhone)\" Though most are too retarded to get it. permalink parent award report block reply stormdraintrooper 1 points 4 days ago That's the most amusing part.  Insult them, and many times it goes right over their heads. permalink parent award report block reply user2827 3 points 4 days ago I can't relate to that industry, but the logic is ass backwards. The way I've seen it happen is closer to, guy gets hired as an equipment operator, shows that he's good at what he does, then a surge of work and the programmer can't keep up with demand and so they get asked to help the programmer.  Usually sooner than later, it's then that the offer for more pay in exchange for more responsibilities is offered. I've never seen happen any different way, except for cost of living adjustments. permalink parent award report block reply Thrasymachus 6 points 4 days ago This reveals one of the hard truths of the labor market.  You have to plan as if nobody has any goodness in their heart, because it's foolhardy to rely on it.  You have to rely on LEVERAGE, and consider things transactionally. When that equipment operator you mentioned is working at a programmer, their employer can and usually will start to rely on that level of skill and productivity.  At that point the employee has the ability to say, no, I think I'll take these skills elsewhere.  To the employer, it doesn't matter if the operator takes that skill to a competitor or starts living in a van down by the river, the result is, they lose an asset.  To avoid that, they have to pay him commensurately with the higher tier work he's doing. I only asked for a raise based on the naive assumption of \"It's Been A While\" once and I felt like an asshole when I realized it was presumptuous since I was still doing the same amount of work.  Instead I chose to add responsibilities and that made it easy and fair to ask for more money as a proportion of the business I brought it.  Create more value, earn more money. permalink parent award report block reply view 1 more comments... Cowboy888 2 points 4 days ago I can see this lard ass going into the company management and saying, \"Do you know who I am?\" permalink parent award report block reply ListenToSavage 2 points 4 days ago \"Yea I do. You're the unemployed fatty formerly known as repair associate.\" permalink parent award report block reply Tacitus1963 1 points 4 days ago Bernie Sanders has entered the conversation! permalink parent award report block reply Rydanovich 16 points 4 days ago It is a consistent trait. A lot of my clients support socialism. Every one of them are also dependent on socialist programs. None of them work, all are on snap and SSI. The second these programs stop, they are homeless. Without exception. permalink parent award report block reply RolandDelacroix 9 points 4 days ago So even when homeless they refuse to work? permalink parent award report block reply darkmodeforgotpass 10 points 4 days ago That's how homeless remain homeless. It is so easy for illegals to get a job. Imagine them when they use their money for a laundromat. They just don't want to work and live off the backs of anyone. So everyone is poor. Homeless crack heads have fucked with my things so much that I'm just never giving to them again. Not to mention that they are pigs when it comes to your S/O or children. They got themselves to that point and compound it eith drugs. It's a tough pill for some, but if you or I refused to work, no matter what, we'd be homeless as well. And they are able-bodied. These people are losers, and no amount of excuses or feel-bads will cover that up! permalink parent award report block reply Rydanovich 2 points 3 days ago Yep. I saw a lot of it when I was in the shelter. People with snap and SSI living in tents, refusing any and all other help because it comes with responsibilities. permalink parent award report block reply stormdraintrooper 1 points 4 days ago Oh yeah.  Sitting on a bucket in the median with a poorly worded sign is much more fulfilling.  It's for the drugs.  You can't really be employed and into your meth habit as well. What gets me, is their absolute filthiness.  Their camps are nothing more than emptied out garbage cans. permalink parent award report block reply IvanDrago 4 points 4 days ago I gotta ask, what is it that you do where these people are willing or needing to pay you from their gibs stash? I'm in the wrong line of work, because that's a growing client base when the Dems steal their next major election. permalink parent award report block reply Rydanovich 1 points 3 days ago I'm a caretaker for the elderly and the disabled. permalink parent award report block reply wilburh09 7 points 4 days ago A lot of young adults live a sheltered existence while working low paying jobs and thinking everyone should be Buddhist and that everyone is equal.  Hopefully many of them change their philosophy after years of grinding into a career and seeing how shitty many people are that don’t deserve shit from our taxpayer money or healthcare contributions.  Also many are brainwashed by their socialist loser high school teachers and college professors, as well as being brainwashed by pop media culture. permalink parent award report block reply IvanDrago 6 points 4 days ago Sales. I started the grind early selling golf balls, soda, plowing snow, mowing yards. Persuasion is an important life skill, because even if you're right, if you can't communicate it, the intellectual capacity is wasted. The earlier you get working, the sooner you figure out who the leeches are and how it's stolen from you. permalink parent award report block reply wilburh09 3 points 4 days ago But even that ..  you aren't paying rent and bills selling golf balls and soda .  But your point is valid.   Some people do have better work ethic values than others.  But just because someone is young and inexperienced making cheap wages working at Starbucks 30hrs a week  while 15 hours of classes (not concluding projects and homework/studying) in college doesn’t mean they are lazy.  They are probably misguided mostly, imo. permalink parent award report block reply Thrasymachus 3 points 4 days ago The fact that the dollar has been used as an instrument of the Federal Reserve board to siphon trillions of dollars of value from American labor to European bank accounts makes it so wages for unskilled labor is basically trash, appropriate for people who can wire it home to Mexico where it goes a lot further, or children who are still subsidized by their parents.  At one time that wage would have been able to support a livelihood with some thrift and careful planning.  Combine that with Marxist professors who tell them every made-up and ideological reason for these ills except the real ones and you can see how fertile the ground is for the radicalization of youth.  Add in the particular impressionability of young women based on illusory consensus and you've got...modern normie politics. permalink parent award report block reply view 1 more comments... Megaboom2025 1 points 4 days ago Don’t work* permalink parent award report block reply\nMrCuriousGuy513 28 points 4 days ago I agree. permalink parent award report block reply TheOriginalBrickBot 47 points 4 days ago HOLY FUCK this is absolutely true! I'm a repair tech for a dental company, and my coworker is a repair associate (level below a tech, more customer support). He's literal a poster child for a Mamadani voter. He's a fat, agnostic, neck beard socialist. On top of that he has literal tantrum/anger issues. He bitches about not making enough money and how he wishes he was a tech. The lead tech and I offer to train him on how to do repair jobs so he can beef up his resume. Basically paid training. He's a lazy piece of shit and says he will only do repair work if he's getting paid a repair tech salary. He turns down the training. Four months later our older tech retires, and he puts in an application. Management asks him if he has any repair experience. NOPE. Now he bitches and moans about how the company should have made him a tech based on the type of person he is and not his ability to repair. Mind you, both the lead tech and I have experience and degrees in our field.  Again, he's a fat, neck beard socialist who makes shit money and is happy that Mamdani was elected. Now we \"...can see\" how great socialism will be. End of story, people who support socialism are generally lazy, unmotivated fucks who only want gibbs for little to not work. permalink parent award report block reply FrmrAmericanRepublic 12 points 4 days ago True - they don't understand achievment via their own merits and expect everything handed to them. Its also why I mock socialists with \"I hate capitalism. (Sent from my iPhone)\" Though most are too retarded to get it. permalink parent award report block reply stormdraintrooper 1 points 4 days ago That's the most amusing part.  Insult them, and many times it goes right over their heads. permalink parent award report block reply user2827 3 points 4 days ago I can't relate to that industry, but the logic is ass backwards. The way I've seen it happen is closer to, guy gets hired as an equipment operator, shows that he's good at what he does, then a surge of work and the programmer can't keep up with demand and so they get asked to help the programmer.  Usually sooner than later, it's then that the offer for more pay in exchange for more responsibilities is offered. I've never seen happen any different way, except for cost of living adjustments. permalink parent award report block reply Thrasymachus 6 points 4 days ago This reveals one of the hard truths of the labor market.  You have to plan as if nobody has any goodness in their heart, because it's foolhardy to rely on it.  You have to rely on LEVERAGE, and consider things transactionally. When that equipment operator you mentioned is working at a programmer, their employer can and usually will start to rely on that level of skill and productivity.  At that point the employee has the ability to say, no, I think I'll take these skills elsewhere.  To the employer, it doesn't matter if the operator takes that skill to a competitor or starts living in a van down by the river, the result is, they lose an asset.  To avoid that, they have to pay him commensurately with the higher tier work he's doing. I only asked for a raise based on the naive assumption of \"It's Been A While\" once and I felt like an asshole when I realized it was presumptuous since I was still doing the same amount of work.  Instead I chose to add responsibilities and that made it easy and fair to ask for more money as a proportion of the business I brought it.  Create more value, earn more money. permalink parent award report block reply view 1 more comments... Cowboy888 2 points 4 days ago I can see this lard ass going into the company management and saying, \"Do you know who I am?\" permalink parent award report block reply ListenToSavage 2 points 4 days ago \"Yea I do. You're the unemployed fatty formerly known as repair associate.\" permalink parent award report block reply Tacitus1963 1 points 4 days ago Bernie Sanders has entered the conversation! permalink parent award report block reply\nTheOriginalBrickBot 47 points 4 days ago HOLY FUCK this is absolutely true! I'm a repair tech for a dental company, and my coworker is a repair associate (level below a tech, more customer support). He's literal a poster child for a Mamadani voter. He's a fat, agnostic, neck beard socialist. On top of that he has literal tantrum/anger issues. He bitches about not making enough money and how he wishes he was a tech. The lead tech and I offer to train him on how to do repair jobs so he can beef up his resume. Basically paid training. He's a lazy piece of shit and says he will only do repair work if he's getting paid a repair tech salary. He turns down the training. Four months later our older tech retires, and he puts in an application. Management asks him if he has any repair experience. NOPE. Now he bitches and moans about how the company should have made him a tech based on the type of person he is and not his ability to repair. Mind you, both the lead tech and I have experience and degrees in our field.  Again, he's a fat, neck beard socialist who makes shit money and is happy that Mamdani was elected. Now we \"...can see\" how great socialism will be. End of story, people who support socialism are generally lazy, unmotivated fucks who only want gibbs for little to not work. permalink parent award report block reply FrmrAmericanRepublic 12 points 4 days ago True - they don't understand achievment via their own merits and expect everything handed to them. Its also why I mock socialists with \"I hate capitalism. (Sent from my iPhone)\" Though most are too retarded to get it. permalink parent award report block reply stormdraintrooper 1 points 4 days ago That's the most amusing part.  Insult them, and many times it goes right over their heads. permalink parent award report block reply user2827 3 points 4 days ago I can't relate to that industry, but the logic is ass backwards. The way I've seen it happen is closer to, guy gets hired as an equipment operator, shows that he's good at what he does, then a surge of work and the programmer can't keep up with demand and so they get asked to help the programmer.  Usually sooner than later, it's then that the offer for more pay in exchange for more responsibilities is offered. I've never seen happen any different way, except for cost of living adjustments. permalink parent award report block reply Thrasymachus 6 points 4 days ago This reveals one of the hard truths of the labor market.  You have to plan as if nobody has any goodness in their heart, because it's foolhardy to rely on it.  You have to rely on LEVERAGE, and consider things transactionally. When that equipment operator you mentioned is working at a programmer, their employer can and usually will start to rely on that level of skill and productivity.  At that point the employee has the ability to say, no, I think I'll take these skills elsewhere.  To the employer, it doesn't matter if the operator takes that skill to a competitor or starts living in a van down by the river, the result is, they lose an asset.  To avoid that, they have to pay him commensurately with the higher tier work he's doing. I only asked for a raise based on the naive assumption of \"It's Been A While\" once and I felt like an asshole when I realized it was presumptuous since I was still doing the same amount of work.  Instead I chose to add responsibilities and that made it easy and fair to ask for more money as a proportion of the business I brought it.  Create more value, earn more money. permalink parent award report block reply view 1 more comments... Cowboy888 2 points 4 days ago I can see this lard ass going into the company management and saying, \"Do you know who I am?\" permalink parent award report block reply ListenToSavage 2 points 4 days ago \"Yea I do. You're the unemployed fatty formerly known as repair associate.\" permalink parent award report block reply Tacitus1963 1 points 4 days ago Bernie Sanders has entered the conversation! permalink parent award report block reply\nFrmrAmericanRepublic 12 points 4 days ago True - they don't understand achievment via their own merits and expect everything handed to them. Its also why I mock socialists with \"I hate capitalism. (Sent from my iPhone)\" Though most are too retarded to get it. permalink parent award report block reply stormdraintrooper 1 points 4 days ago That's the most amusing part.  Insult them, and many times it goes right over their heads. permalink parent award report block reply\nstormdraintrooper 1 points 4 days ago That's the most amusing part.  Insult them, and many times it goes right over their heads. permalink parent award report block reply\nuser2827 3 points 4 days ago I can't relate to that industry, but the logic is ass backwards. The way I've seen it happen is closer to, guy gets hired as an equipment operator, shows that he's good at what he does, then a surge of work and the programmer can't keep up with demand and so they get asked to help the programmer.  Usually sooner than later, it's then that the offer for more pay in exchange for more responsibilities is offered. I've never seen happen any different way, except for cost of living adjustments. permalink parent award report block reply Thrasymachus 6 points 4 days ago This reveals one of the hard truths of the labor market.  You have to plan as if nobody has any goodness in their heart, because it's foolhardy to rely on it.  You have to rely on LEVERAGE, and consider things transactionally. When that equipment operator you mentioned is working at a programmer, their employer can and usually will start to rely on that level of skill and productivity.  At that point the employee has the ability to say, no, I think I'll take these skills elsewhere.  To the employer, it doesn't matter if the operator takes that skill to a competitor or starts living in a van down by the river, the result is, they lose an asset.  To avoid that, they have to pay him commensurately with the higher tier work he's doing. I only asked for a raise based on the naive assumption of \"It's Been A While\" once and I felt like an asshole when I realized it was presumptuous since I was still doing the same amount of work.  Instead I chose to add responsibilities and that made it easy and fair to ask for more money as a proportion of the business I brought it.  Create more value, earn more money. permalink parent award report block reply view 1 more comments...\nThrasymachus 6 points 4 days ago This reveals one of the hard truths of the labor market.  You have to plan as if nobody has any goodness in their heart, because it's foolhardy to rely on it.  You have to rely on LEVERAGE, and consider things transactionally. When that equipment operator you mentioned is working at a programmer, their employer can and usually will start to rely on that level of skill and productivity.  At that point the employee has the ability to say, no, I think I'll take these skills elsewhere.  To the employer, it doesn't matter if the operator takes that skill to a competitor or starts living in a van down by the river, the result is, they lose an asset.  To avoid that, they have to pay him commensurately with the higher tier work he's doing. I only asked for a raise based on the naive assumption of \"It's Been A While\" once and I felt like an asshole when I realized it was presumptuous since I was still doing the same amount of work.  Instead I chose to add responsibilities and that made it easy and fair to ask for more money as a proportion of the business I brought it.  Create more value, earn more money. permalink parent award report block reply view 1 more comments...\nCowboy888 2 points 4 days ago I can see this lard ass going into the company management and saying, \"Do you know who I am?\" permalink parent award report block reply ListenToSavage 2 points 4 days ago \"Yea I do. You're the unemployed fatty formerly known as repair associate.\" permalink parent award report block reply\nListenToSavage 2 points 4 days ago \"Yea I do. You're the unemployed fatty formerly known as repair associate.\" permalink parent award report block reply\nTacitus1963 1 points 4 days ago Bernie Sanders has entered the conversation! permalink parent award report block reply\nRydanovich 16 points 4 days ago It is a consistent trait. A lot of my clients support socialism. Every one of them are also dependent on socialist programs. None of them work, all are on snap and SSI. The second these programs stop, they are homeless. Without exception. permalink parent award report block reply RolandDelacroix 9 points 4 days ago So even when homeless they refuse to work? permalink parent award report block reply darkmodeforgotpass 10 points 4 days ago That's how homeless remain homeless. It is so easy for illegals to get a job. Imagine them when they use their money for a laundromat. They just don't want to work and live off the backs of anyone. So everyone is poor. Homeless crack heads have fucked with my things so much that I'm just never giving to them again. Not to mention that they are pigs when it comes to your S/O or children. They got themselves to that point and compound it eith drugs. It's a tough pill for some, but if you or I refused to work, no matter what, we'd be homeless as well. And they are able-bodied. These people are losers, and no amount of excuses or feel-bads will cover that up! permalink parent award report block reply Rydanovich 2 points 3 days ago Yep. I saw a lot of it when I was in the shelter. People with snap and SSI living in tents, refusing any and all other help because it comes with responsibilities. permalink parent award report block reply stormdraintrooper 1 points 4 days ago Oh yeah.  Sitting on a bucket in the median with a poorly worded sign is much more fulfilling.  It's for the drugs.  You can't really be employed and into your meth habit as well. What gets me, is their absolute filthiness.  Their camps are nothing more than emptied out garbage cans. permalink parent award report block reply IvanDrago 4 points 4 days ago I gotta ask, what is it that you do where these people are willing or needing to pay you from their gibs stash? I'm in the wrong line of work, because that's a growing client base when the Dems steal their next major election. permalink parent award report block reply Rydanovich 1 points 3 days ago I'm a caretaker for the elderly and the disabled. permalink parent award report block reply\nRolandDelacroix 9 points 4 days ago So even when homeless they refuse to work? permalink parent award report block reply darkmodeforgotpass 10 points 4 days ago That's how homeless remain homeless. It is so easy for illegals to get a job. Imagine them when they use their money for a laundromat. They just don't want to work and live off the backs of anyone. So everyone is poor. Homeless crack heads have fucked with my things so much that I'm just never giving to them again. Not to mention that they are pigs when it comes to your S/O or children. They got themselves to that point and compound it eith drugs. It's a tough pill for some, but if you or I refused to work, no matter what, we'd be homeless as well. And they are able-bodied. These people are losers, and no amount of excuses or feel-bads will cover that up! permalink parent award report block reply Rydanovich 2 points 3 days ago Yep. I saw a lot of it when I was in the shelter. People with snap and SSI living in tents, refusing any and all other help because it comes with responsibilities. permalink parent award report block reply stormdraintrooper 1 points 4 days ago Oh yeah.  Sitting on a bucket in the median with a poorly worded sign is much more fulfilling.  It's for the drugs.  You can't really be employed and into your meth habit as well. What gets me, is their absolute filthiness.  Their camps are nothing more than emptied out garbage cans. permalink parent award report block reply\ndarkmodeforgotpass 10 points 4 days ago That's how homeless remain homeless. It is so easy for illegals to get a job. Imagine them when they use their money for a laundromat. They just don't want to work and live off the backs of anyone. So everyone is poor. Homeless crack heads have fucked with my things so much that I'm just never giving to them again. Not to mention that they are pigs when it comes to your S/O or children. They got themselves to that point and compound it eith drugs. It's a tough pill for some, but if you or I refused to work, no matter what, we'd be homeless as well. And they are able-bodied. These people are losers, and no amount of excuses or feel-bads will cover that up! permalink parent award report block reply\nRydanovich 2 points 3 days ago Yep. I saw a lot of it when I was in the shelter. People with snap and SSI living in tents, refusing any and all other help because it comes with responsibilities. permalink parent award report block reply\nstormdraintrooper 1 points 4 days ago Oh yeah.  Sitting on a bucket in the median with a poorly worded sign is much more fulfilling.  It's for the drugs.  You can't really be employed and into your meth habit as well. What gets me, is their absolute filthiness.  Their camps are nothing more than emptied out garbage cans. permalink parent award report block reply\nIvanDrago 4 points 4 days ago I gotta ask, what is it that you do where these people are willing or needing to pay you from their gibs stash? I'm in the wrong line of work, because that's a growing client base when the Dems steal their next major election. permalink parent award report block reply Rydanovich 1 points 3 days ago I'm a caretaker for the elderly and the disabled. permalink parent award report block reply\nRydanovich 1 points 3 days ago I'm a caretaker for the elderly and the disabled. permalink parent award report block reply\nwilburh09 7 points 4 days ago A lot of young adults live a sheltered existence while working low paying jobs and thinking everyone should be Buddhist and that everyone is equal.  Hopefully many of them change their philosophy after years of grinding into a career and seeing how shitty many people are that don’t deserve shit from our taxpayer money or healthcare contributions.  Also many are brainwashed by their socialist loser high school teachers and college professors, as well as being brainwashed by pop media culture. permalink parent award report block reply IvanDrago 6 points 4 days ago Sales. I started the grind early selling golf balls, soda, plowing snow, mowing yards. Persuasion is an important life skill, because even if you're right, if you can't communicate it, the intellectual capacity is wasted. The earlier you get working, the sooner you figure out who the leeches are and how it's stolen from you. permalink parent award report block reply wilburh09 3 points 4 days ago But even that ..  you aren't paying rent and bills selling golf balls and soda .  But your point is valid.   Some people do have better work ethic values than others.  But just because someone is young and inexperienced making cheap wages working at Starbucks 30hrs a week  while 15 hours of classes (not concluding projects and homework/studying) in college doesn’t mean they are lazy.  They are probably misguided mostly, imo. permalink parent award report block reply Thrasymachus 3 points 4 days ago The fact that the dollar has been used as an instrument of the Federal Reserve board to siphon trillions of dollars of value from American labor to European bank accounts makes it so wages for unskilled labor is basically trash, appropriate for people who can wire it home to Mexico where it goes a lot further, or children who are still subsidized by their parents.  At one time that wage would have been able to support a livelihood with some thrift and careful planning.  Combine that with Marxist professors who tell them every made-up and ideological reason for these ills except the real ones and you can see how fertile the ground is for the radicalization of youth.  Add in the particular impressionability of young women based on illusory consensus and you've got...modern normie politics. permalink parent award report block reply view 1 more comments...\nIvanDrago 6 points 4 days ago Sales. I started the grind early selling golf balls, soda, plowing snow, mowing yards. Persuasion is an important life skill, because even if you're right, if you can't communicate it, the intellectual capacity is wasted. The earlier you get working, the sooner you figure out who the leeches are and how it's stolen from you. permalink parent award report block reply wilburh09 3 points 4 days ago But even that ..  you aren't paying rent and bills selling golf balls and soda .  But your point is valid.   Some people do have better work ethic values than others.  But just because someone is young and inexperienced making cheap wages working at Starbucks 30hrs a week  while 15 hours of classes (not concluding projects and homework/studying) in college doesn’t mean they are lazy.  They are probably misguided mostly, imo. permalink parent award report block reply Thrasymachus 3 points 4 days ago The fact that the dollar has been used as an instrument of the Federal Reserve board to siphon trillions of dollars of value from American labor to European bank accounts makes it so wages for unskilled labor is basically trash, appropriate for people who can wire it home to Mexico where it goes a lot further, or children who are still subsidized by their parents.  At one time that wage would have been able to support a livelihood with some thrift and careful planning.  Combine that with Marxist professors who tell them every made-up and ideological reason for these ills except the real ones and you can see how fertile the ground is for the radicalization of youth.  Add in the particular impressionability of young women based on illusory consensus and you've got...modern normie politics. permalink parent award report block reply view 1 more comments...\nwilburh09 3 points 4 days ago But even that ..  you aren't paying rent and bills selling golf balls and soda .  But your point is valid.   Some people do have better work ethic values than others.  But just because someone is young and inexperienced making cheap wages working at Starbucks 30hrs a week  while 15 hours of classes (not concluding projects and homework/studying) in college doesn’t mean they are lazy.  They are probably misguided mostly, imo. permalink parent award report block reply Thrasymachus 3 points 4 days ago The fact that the dollar has been used as an instrument of the Federal Reserve board to siphon trillions of dollars of value from American labor to European bank accounts makes it so wages for unskilled labor is basically trash, appropriate for people who can wire it home to Mexico where it goes a lot further, or children who are still subsidized by their parents.  At one time that wage would have been able to support a livelihood with some thrift and careful planning.  Combine that with Marxist professors who tell them every made-up and ideological reason for these ills except the real ones and you can see how fertile the ground is for the radicalization of youth.  Add in the particular impressionability of young women based on illusory consensus and you've got...modern normie politics. permalink parent award report block reply view 1 more comments...\nThrasymachus 3 points 4 days ago The fact that the dollar has been used as an instrument of the Federal Reserve board to siphon trillions of dollars of value from American labor to European bank accounts makes it so wages for unskilled labor is basically trash, appropriate for people who can wire it home to Mexico where it goes a lot further, or children who are still subsidized by their parents.  At one time that wage would have been able to support a livelihood with some thrift and careful planning.  Combine that with Marxist professors who tell them every made-up and ideological reason for these ills except the real ones and you can see how fertile the ground is for the radicalization of youth.  Add in the particular impressionability of young women based on illusory consensus and you've got...modern normie politics. permalink parent award report block reply view 1 more comments...\nMegaboom2025 1 points 4 days ago Don’t work* permalink parent award report block reply\nSavingPrivateGrace 43 points 4 days ago Come on honey, it's just the tip. permalink award report block reply STONKATRUCK 28 points 4 days ago A shame she could look pretty but instead she chose to look like a garbage bag permalink parent award report block reply Hanging_Chad 11 points 4 days ago she’s just unique, you bigot permalink parent award report block reply Megaboom2025 5 points 4 days ago Unique trash can. I blame the father. permalink parent award report block reply SicSemperTyrannis2 1 points 4 days ago Oscar the Grouch lives inside her? permalink parent award report block reply view 1 more comments... JohnMiller2020 2 points 4 days ago That is not unique, it's a unifrom permalink parent award report block reply Hanging_Chad 2 points 4 days ago kek permalink parent award report block reply Jaqen 10 points 4 days ago Indeed, the progressive movement has effectively destroyed the beauty of an entire generation of women. permalink parent award report block reply BunnyPicnic 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply MasterChief 6 points 4 days ago thats a softball player with a bow if I ever saw one permalink parent award report block reply Hanging_Chad 3 points 4 days ago softball players are lesbians IME permalink parent award report block reply MasterChief 3 points 4 days ago Just the ones with a bow if that's still a thing. Learned that from a carpet muncher in high school. Mustaches on gays supposedly means they are bottoms. Teardrop tattoos on the cheek means they've killed someone, or want to pretend like they did. permalink parent award report block reply Hanging_Chad 4 points 4 days ago what kind of bow? also, what do sideways pineapples mean? permalink parent award report block reply view 2 more comments... Thrasymachus 1 points 4 days ago lol isn't the teardrop is a prison thing?  Which makes it a bit of a ninety-degree turn from the gay identifiers. I remember when a single earing on a guy was apparently a signal, but since it was before the internet nobody was sure which ear was the gay one.  I was like, I'm pretty sure a guy with one single earing, you can just assume he's gay it probably doesn't matter which.  And bad luck for any hetero guys who didn't get the cultural memo and thought one earing would look cool (why?). permalink parent award report block reply AfrikaanerBoer 2 points 4 days ago No father figure who has been BLACKED™️ by groid after groid in “college” hence the tats, dyed hair and piercings….will be sterilized by aborting the countless niglets that defiled her womb and be a miserable cat lady by 35 💯🐈🐈‍⬛🐈🐈‍⬛🐈‍⬛🐈‍⬛🐈‍⬛🐈‍⬛🐈‍⬛🐈‍⬛🐈🐈🐈🐈 permalink parent award report block reply\nSTONKATRUCK 28 points 4 days ago A shame she could look pretty but instead she chose to look like a garbage bag permalink parent award report block reply Hanging_Chad 11 points 4 days ago she’s just unique, you bigot permalink parent award report block reply Megaboom2025 5 points 4 days ago Unique trash can. I blame the father. permalink parent award report block reply SicSemperTyrannis2 1 points 4 days ago Oscar the Grouch lives inside her? permalink parent award report block reply view 1 more comments... JohnMiller2020 2 points 4 days ago That is not unique, it's a unifrom permalink parent award report block reply Hanging_Chad 2 points 4 days ago kek permalink parent award report block reply Jaqen 10 points 4 days ago Indeed, the progressive movement has effectively destroyed the beauty of an entire generation of women. permalink parent award report block reply BunnyPicnic 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nHanging_Chad 11 points 4 days ago she’s just unique, you bigot permalink parent award report block reply Megaboom2025 5 points 4 days ago Unique trash can. I blame the father. permalink parent award report block reply SicSemperTyrannis2 1 points 4 days ago Oscar the Grouch lives inside her? permalink parent award report block reply view 1 more comments... JohnMiller2020 2 points 4 days ago That is not unique, it's a unifrom permalink parent award report block reply Hanging_Chad 2 points 4 days ago kek permalink parent award report block reply\nMegaboom2025 5 points 4 days ago Unique trash can. I blame the father. permalink parent award report block reply SicSemperTyrannis2 1 points 4 days ago Oscar the Grouch lives inside her? permalink parent award report block reply view 1 more comments...\nSicSemperTyrannis2 1 points 4 days ago Oscar the Grouch lives inside her? permalink parent award report block reply view 1 more comments...\nJohnMiller2020 2 points 4 days ago That is not unique, it's a unifrom permalink parent award report block reply Hanging_Chad 2 points 4 days ago kek permalink parent award report block reply\nHanging_Chad 2 points 4 days ago kek permalink parent award report block reply\nJaqen 10 points 4 days ago Indeed, the progressive movement has effectively destroyed the beauty of an entire generation of women. permalink parent award report block reply\nBunnyPicnic 0 points 4 days ago Comment removed by community moderators. permalink parent award report block reply\nMasterChief 6 points 4 days ago thats a softball player with a bow if I ever saw one permalink parent award report block reply Hanging_Chad 3 points 4 days ago softball players are lesbians IME permalink parent award report block reply MasterChief 3 points 4 days ago Just the ones with a bow if that's still a thing. Learned that from a carpet muncher in high school. Mustaches on gays supposedly means they are bottoms. Teardrop tattoos on the cheek means they've killed someone, or want to pretend like they did. permalink parent award report block reply Hanging_Chad 4 points 4 days ago what kind of bow? also, what do sideways pineapples mean? permalink parent award report block reply view 2 more comments... Thrasymachus 1 points 4 days ago lol isn't the teardrop is a prison thing?  Which makes it a bit of a ninety-degree turn from the gay identifiers. I remember when a single earing on a guy was apparently a signal, but since it was before the internet nobody was sure which ear was the gay one.  I was like, I'm pretty sure a guy with one single earing, you can just assume he's gay it probably doesn't matter which.  And bad luck for any hetero guys who didn't get the cultural memo and thought one earing would look cool (why?). permalink parent award report block reply\nHanging_Chad 3 points 4 days ago softball players are lesbians IME permalink parent award report block reply MasterChief 3 points 4 days ago Just the ones with a bow if that's still a thing. Learned that from a carpet muncher in high school. Mustaches on gays supposedly means they are bottoms. Teardrop tattoos on the cheek means they've killed someone, or want to pretend like they did. permalink parent award report block reply Hanging_Chad 4 points 4 days ago what kind of bow? also, what do sideways pineapples mean? permalink parent award report block reply view 2 more comments... Thrasymachus 1 points 4 days ago lol isn't the teardrop is a prison thing?  Which makes it a bit of a ninety-degree turn from the gay identifiers. I remember when a single earing on a guy was apparently a signal, but since it was before the internet nobody was sure which ear was the gay one.  I was like, I'm pretty sure a guy with one single earing, you can just assume he's gay it probably doesn't matter which.  And bad luck for any hetero guys who didn't get the cultural memo and thought one earing would look cool (why?). permalink parent award report block reply\nMasterChief 3 points 4 days ago Just the ones with a bow if that's still a thing. Learned that from a carpet muncher in high school. Mustaches on gays supposedly means they are bottoms. Teardrop tattoos on the cheek means they've killed someone, or want to pretend like they did. permalink parent award report block reply Hanging_Chad 4 points 4 days ago what kind of bow? also, what do sideways pineapples mean? permalink parent award report block reply view 2 more comments... Thrasymachus 1 points 4 days ago lol isn't the teardrop is a prison thing?  Which makes it a bit of a ninety-degree turn from the gay identifiers. I remember when a single earing on a guy was apparently a signal, but since it was before the internet nobody was sure which ear was the gay one.  I was like, I'm pretty sure a guy with one single earing, you can just assume he's gay it probably doesn't matter which.  And bad luck for any hetero guys who didn't get the cultural memo and thought one earing would look cool (why?). permalink parent award report block reply\nHanging_Chad 4 points 4 days ago what kind of bow? also, what do sideways pineapples mean? permalink parent award report block reply view 2 more comments...\nThrasymachus 1 points 4 days ago lol isn't the teardrop is a prison thing?  Which makes it a bit of a ninety-degree turn from the gay identifiers. I remember when a single earing on a guy was apparently a signal, but since it was before the internet nobody was sure which ear was the gay one.  I was like, I'm pretty sure a guy with one single earing, you can just assume he's gay it probably doesn't matter which.  And bad luck for any hetero guys who didn't get the cultural memo and thought one earing would look cool (why?). permalink parent award report block reply\nAfrikaanerBoer 2 points 4 days ago No father figure who has been BLACKED™️ by groid after groid in “college” hence the tats, dyed hair and piercings….will be sterilized by aborting the countless niglets that defiled her womb and be a miserable cat lady by 35 💯🐈🐈‍⬛🐈🐈‍⬛🐈‍⬛🐈‍⬛🐈‍⬛🐈‍⬛🐈‍⬛🐈‍⬛🐈🐈🐈🐈 permalink parent award report block reply\nVirTW 18 points 4 days ago She wanted socialism ..... the community owns her tip now permalink award report block reply Hanging_Chad 2 points 4 days ago ah, that’s why tips are tax-free now.  it wouldn’t make sense to tax the gov’t/community permalink parent award report block reply\nHanging_Chad 2 points 4 days ago ah, that’s why tips are tax-free now.  it wouldn’t make sense to tax the gov’t/community permalink parent award report block reply\nmikejones 13 points 4 days ago Nothing like paying $27 for 6 steak tacos and a coke and they want a tip still. permalink award report block reply canada_is_communist 3 points 4 days ago $27 for 6 steak tacod and a coke hahahahha good one Try 2… permalink parent award report block reply\ncanada_is_communist 3 points 4 days ago $27 for 6 steak tacod and a coke hahahahha good one Try 2… permalink parent award report block reply\nSickofItall 10 points 4 days ago They HAVE to be held accountable for their vote. permalink award report block reply\npi-triot 8 points 4 days ago Vocal fry, activate! permalink award report block reply\nmonkadelic 8 points 4 days ago Jokes on them.  He's taking it either way. permalink award report block reply\nonesummerdream 7 points 4 days ago Prefect. Nice turn around. I’m sick of being asked if I want to round up for charity every where I go. permalink award report block reply RentFree2020 OP 10 points 4 days ago Exactly why I posted this. It's a nice little way to throw the guilt back at them. permalink parent award report block reply 1_Badcop 6 points 4 days ago This. I'm a charitable person. Or I was. Over the last several years  as I've learned what an unfathomable scam these nonprofits are, I've grown to become offended that they even ask me to contribute. Seriously, if I were younger, and crooked, I'd start my own non-profit. They are basically a license to print money. permalink parent award report block reply canada_is_communist 2 points 4 days ago Just donate 5% of ehat you raise and keep the rest lol permalink parent award report block reply JohnMiller2020 2 points 4 days ago Charity fatigue is real permalink parent award report block reply jornado87 5 points 4 days ago I actively decline that shit everywhere and have never been pressed about. permalink parent award report block reply RentFree2020 OP 1 points 4 days ago Same. If they aren't delivering or cleaning up after me i don't feel inclined to tip. I will never tip people at the register. I did during COVID if I picked up food. But, that was it. permalink parent award report block reply LadyGrahamsminge 2 points 4 days ago I fucking hate being asked that. It is meant to intentionally embarrass the customer if they say no. I turn it around on them with something new every time some idiot has the nerve to ask. My local Publix has a hijab wearing sheniqua working as a cashier, and her disdain for whites is nearly equal to my disdain of her ilk. Last time she asked, I said “ I will tell you like I told that junky in the parking lot on my way in, no. “ Bitch was seething and could do nothing about it. Have also just said  “ no, I’ve had a tough month and was hoping you could round down to the nearest 50.” They don’t ask me that shit anymore, after going to the manager desk several times and letting them know that times are hard, prices are high, and they shouldn’t be trying to embarrass their customers into paying even more for their groceries . It is a shitty way to conduct business, and I guarantee that the money never reaches anyone but those high paid administrators at the top of the charities. This country has changed so much since I was a kid. If they would have asked that of my Grandad or Grandma, let’s just say that they wouldn’t have done it twice. permalink parent award report block reply x79q3pb 1 points 4 days ago Any charity given through a grocery store is for the primary purpose of tax write offs for that business. permalink parent award report block reply\nRentFree2020 OP 10 points 4 days ago Exactly why I posted this. It's a nice little way to throw the guilt back at them. permalink parent award report block reply\n1_Badcop 6 points 4 days ago This. I'm a charitable person. Or I was. Over the last several years  as I've learned what an unfathomable scam these nonprofits are, I've grown to become offended that they even ask me to contribute. Seriously, if I were younger, and crooked, I'd start my own non-profit. They are basically a license to print money. permalink parent award report block reply canada_is_communist 2 points 4 days ago Just donate 5% of ehat you raise and keep the rest lol permalink parent award report block reply JohnMiller2020 2 points 4 days ago Charity fatigue is real permalink parent award report block reply\ncanada_is_communist 2 points 4 days ago Just donate 5% of ehat you raise and keep the rest lol permalink parent award report block reply\nJohnMiller2020 2 points 4 days ago Charity fatigue is real permalink parent award report block reply\njornado87 5 points 4 days ago I actively decline that shit everywhere and have never been pressed about. permalink parent award report block reply RentFree2020 OP 1 points 4 days ago Same. If they aren't delivering or cleaning up after me i don't feel inclined to tip. I will never tip people at the register. I did during COVID if I picked up food. But, that was it. permalink parent award report block reply\nRentFree2020 OP 1 points 4 days ago Same. If they aren't delivering or cleaning up after me i don't feel inclined to tip. I will never tip people at the register. I did during COVID if I picked up food. But, that was it. permalink parent award report block reply\nLadyGrahamsminge 2 points 4 days ago I fucking hate being asked that. It is meant to intentionally embarrass the customer if they say no. I turn it around on them with something new every time some idiot has the nerve to ask. My local Publix has a hijab wearing sheniqua working as a cashier, and her disdain for whites is nearly equal to my disdain of her ilk. Last time she asked, I said “ I will tell you like I told that junky in the parking lot on my way in, no. “ Bitch was seething and could do nothing about it. Have also just said  “ no, I’ve had a tough month and was hoping you could round down to the nearest 50.” They don’t ask me that shit anymore, after going to the manager desk several times and letting them know that times are hard, prices are high, and they shouldn’t be trying to embarrass their customers into paying even more for their groceries . It is a shitty way to conduct business, and I guarantee that the money never reaches anyone but those high paid administrators at the top of the charities. This country has changed so much since I was a kid. If they would have asked that of my Grandad or Grandma, let’s just say that they wouldn’t have done it twice. permalink parent award report block reply x79q3pb 1 points 4 days ago Any charity given through a grocery store is for the primary purpose of tax write offs for that business. permalink parent award report block reply\nx79q3pb 1 points 4 days ago Any charity given through a grocery store is for the primary purpose of tax write offs for that business. permalink parent award report block reply\ntellmywifehello 6 points 4 days ago I just got an idea: a fake tip like those religious ones but inside the fold it says, \"I donated your tip to Mohamadani, he needs it more than you!\" permalink award report block reply Aquamine-Amarine 1 points 4 days ago That's a good one. permalink parent award report block reply\nAquamine-Amarine 1 points 4 days ago That's a good one. permalink parent award report block reply\ncorporateshizer 6 points 4 days ago This vapid, blank stare is the same look all the non-white register jockeys have these days. You speak to them, they stare back. permalink award report block reply\nFemale 5 points 4 days ago If they really loved their supreme leader they would do it. permalink award report block reply\nOrangeManBadasss 4 points 4 days ago Or you know, just don't go to fucking Starbucks. permalink award report block reply NADSAQ 4 points 4 days ago i bought coffee away from home one time in 2025 and it was from kids running a booth at the Christian school permalink parent award report block reply\nNADSAQ 4 points 4 days ago i bought coffee away from home one time in 2025 and it was from kids running a booth at the Christian school permalink parent award report block reply\nRobinNet 3 points 4 days ago Sounds good on paper, right Sugar Tits? permalink award report block reply\ncanada_is_communist 2 points 4 days ago Socialism for thee, but not for me Also grats on finding the absolute most cliche looking sbux employee lol permalink award report block reply\nSuperHonkey 2 points 4 days ago Missing the septum piercing 😬 permalink award report block reply\nHeCantDoIt 2 points 4 days ago Y'alls need to talk to more commies lol. They wouldn't get mad, they'd just say \"the billionaires should pay, because they have 99% of the wealth\". permalink award report block reply Nellie_the_Beaut 4 points 4 days ago They also theorize that if the government just taxes all these billionaires more - or better yet, just “seizes their wealth and properties because nobody needs that much money and it’s immoral to be that rich” -  they could finally have the socialist utopia they dream about.  The complete absence of basic math skills is astounding. permalink parent award report block reply Tromboneofsteel 2 points 3 days ago Not to mention the money of the 1% in this country would fund a socialist utopia for about 3 weeks and then it'd be gone. Now who pays? permalink parent award report block reply RentFree2020 OP 2 points 4 days ago Well, try this out a few times and report back. permalink parent award report block reply HeCantDoIt 1 points 4 days ago I already did. I had this exact conversation with my ex, and a couple of my co-workers a few years ago. One time my ex was complaining to me about her experience at a recent dental appointment, and our conversation veered into \"free healthcare\" territory. I forget how the whole convo went, but I probably said something like \"OK, then who is going to pay for it? Do you want your taxes to go up, or for inflation to go up due to all the money-printing required to 'pay' for it?\". She ignored my argument and just said that rich people can pay for it... And at a previous workplace, the topic of socialism got brought up once, and me 2 of my friends there hashed it out a bit. I remember saying: \"socialism is only possible because you give power to a tiny group of extremely corrupt people, who don't give a fuck about you, and who force you through the government's monopoly on violence, to hand-over huge chunks of your paycheck to pay for free things everyone wants. There's nothing voluntary or 'social' about that\". They didn't get mad, but just told me \"but the rich will pay for it, what's the problem\", and \"you're young and haven't studied these things, so of course you don't know how proper socialism could be done\". No anger or hostility in both instances, just coyness and \"the rich will pay for it!\". Also, while not quite related, a similar thing also happened on Reddit a few weeks ago. Some reddit fags were bitching about publicly-traded companies doing stupid things and being corrupted by shareholders, and I said \"part of the reason there's so much money sloshing around in the stock market is because the rich are FORCED to invest to protect their money, so that retarded beaurocrats don't get it through taxes and waste it instantly\". Their answer? \"Just tax the stock market for the rich!\". In these people's minds, their thought process is simply \"the rich have infinitely more than all of us, therefore why take from me?\". And breaking down that leg of their argument is impossible, because it'd require a tiny bit of abstract thinking (eg, rich people create jobs, invest in automation, increase wages by increasing demand for workers, etc.) - an ability none of them have. permalink parent award report block reply\nNellie_the_Beaut 4 points 4 days ago They also theorize that if the government just taxes all these billionaires more - or better yet, just “seizes their wealth and properties because nobody needs that much money and it’s immoral to be that rich” -  they could finally have the socialist utopia they dream about.  The complete absence of basic math skills is astounding. permalink parent award report block reply Tromboneofsteel 2 points 3 days ago Not to mention the money of the 1% in this country would fund a socialist utopia for about 3 weeks and then it'd be gone. Now who pays? permalink parent award report block reply\nTromboneofsteel 2 points 3 days ago Not to mention the money of the 1% in this country would fund a socialist utopia for about 3 weeks and then it'd be gone. Now who pays? permalink parent award report block reply\nRentFree2020 OP 2 points 4 days ago Well, try this out a few times and report back. permalink parent award report block reply HeCantDoIt 1 points 4 days ago I already did. I had this exact conversation with my ex, and a couple of my co-workers a few years ago. One time my ex was complaining to me about her experience at a recent dental appointment, and our conversation veered into \"free healthcare\" territory. I forget how the whole convo went, but I probably said something like \"OK, then who is going to pay for it? Do you want your taxes to go up, or for inflation to go up due to all the money-printing required to 'pay' for it?\". She ignored my argument and just said that rich people can pay for it... And at a previous workplace, the topic of socialism got brought up once, and me 2 of my friends there hashed it out a bit. I remember saying: \"socialism is only possible because you give power to a tiny group of extremely corrupt people, who don't give a fuck about you, and who force you through the government's monopoly on violence, to hand-over huge chunks of your paycheck to pay for free things everyone wants. There's nothing voluntary or 'social' about that\". They didn't get mad, but just told me \"but the rich will pay for it, what's the problem\", and \"you're young and haven't studied these things, so of course you don't know how proper socialism could be done\". No anger or hostility in both instances, just coyness and \"the rich will pay for it!\". Also, while not quite related, a similar thing also happened on Reddit a few weeks ago. Some reddit fags were bitching about publicly-traded companies doing stupid things and being corrupted by shareholders, and I said \"part of the reason there's so much money sloshing around in the stock market is because the rich are FORCED to invest to protect their money, so that retarded beaurocrats don't get it through taxes and waste it instantly\". Their answer? \"Just tax the stock market for the rich!\". In these people's minds, their thought process is simply \"the rich have infinitely more than all of us, therefore why take from me?\". And breaking down that leg of their argument is impossible, because it'd require a tiny bit of abstract thinking (eg, rich people create jobs, invest in automation, increase wages by increasing demand for workers, etc.) - an ability none of them have. permalink parent award report block reply\nHeCantDoIt 1 points 4 days ago I already did. I had this exact conversation with my ex, and a couple of my co-workers a few years ago. One time my ex was complaining to me about her experience at a recent dental appointment, and our conversation veered into \"free healthcare\" territory. I forget how the whole convo went, but I probably said something like \"OK, then who is going to pay for it? Do you want your taxes to go up, or for inflation to go up due to all the money-printing required to 'pay' for it?\". She ignored my argument and just said that rich people can pay for it... And at a previous workplace, the topic of socialism got brought up once, and me 2 of my friends there hashed it out a bit. I remember saying: \"socialism is only possible because you give power to a tiny group of extremely corrupt people, who don't give a fuck about you, and who force you through the government's monopoly on violence, to hand-over huge chunks of your paycheck to pay for free things everyone wants. There's nothing voluntary or 'social' about that\". They didn't get mad, but just told me \"but the rich will pay for it, what's the problem\", and \"you're young and haven't studied these things, so of course you don't know how proper socialism could be done\". No anger or hostility in both instances, just coyness and \"the rich will pay for it!\". Also, while not quite related, a similar thing also happened on Reddit a few weeks ago. Some reddit fags were bitching about publicly-traded companies doing stupid things and being corrupted by shareholders, and I said \"part of the reason there's so much money sloshing around in the stock market is because the rich are FORCED to invest to protect their money, so that retarded beaurocrats don't get it through taxes and waste it instantly\". Their answer? \"Just tax the stock market for the rich!\". In these people's minds, their thought process is simply \"the rich have infinitely more than all of us, therefore why take from me?\". And breaking down that leg of their argument is impossible, because it'd require a tiny bit of abstract thinking (eg, rich people create jobs, invest in automation, increase wages by increasing demand for workers, etc.) - an ability none of them have. permalink parent award report block reply\nthisisatestof2 1 points 4 days ago Kek permalink award report block reply\n5DchessWatch 1 points 4 days ago That's resting defaultbitchmode permalink award report block reply\nhnoble444 1 points 4 days ago LOL. Awesome. permalink award report block reply\nbarwhack 1 points 4 days ago Don't give them a tip; in honor of Maam Dummy. permalink award report block reply\nCasuallyObservant 1 points 4 days ago Kek! permalink award report block reply\ncanada_is_communist 1 points 4 days ago Honest question guy - if I pay this woman $5,000 CASH a month, does she accept to live with me instead of working this trash job? permalink award report block reply RentFree2020 OP 1 points 4 days ago Nope. Let's be real, the female in this photo is still attractive. Pink hair and retardation aside, I bet she's still getting a decent amount of attention so I'm sure her \"worth\" is much higher than 5,000 a month in girl world. permalink parent award report block reply canada_is_communist 1 points 4 days ago So why does she bother working for what, $100 a day? $2000 a month before taxes, so what, $1400 in new york? permalink parent award report block reply RentFree2020 OP 1 points 4 days ago I don't know this person personally haha. It's a screen grab from Google. - Try it. Go find a decent looking Starbucks employee and make the offer. Tell us how it goes. permalink parent award report block reply canada_is_communist 1 points 4 days ago Im honestly considering it. $5,000 a month to raise kids/take care of the home. Im serious. permalink parent award report block reply view 3 more comments...\nRentFree2020 OP 1 points 4 days ago Nope. Let's be real, the female in this photo is still attractive. Pink hair and retardation aside, I bet she's still getting a decent amount of attention so I'm sure her \"worth\" is much higher than 5,000 a month in girl world. permalink parent award report block reply canada_is_communist 1 points 4 days ago So why does she bother working for what, $100 a day? $2000 a month before taxes, so what, $1400 in new york? permalink parent award report block reply RentFree2020 OP 1 points 4 days ago I don't know this person personally haha. It's a screen grab from Google. - Try it. Go find a decent looking Starbucks employee and make the offer. Tell us how it goes. permalink parent award report block reply canada_is_communist 1 points 4 days ago Im honestly considering it. $5,000 a month to raise kids/take care of the home. Im serious. permalink parent award report block reply view 3 more comments...\ncanada_is_communist 1 points 4 days ago So why does she bother working for what, $100 a day? $2000 a month before taxes, so what, $1400 in new york? permalink parent award report block reply RentFree2020 OP 1 points 4 days ago I don't know this person personally haha. It's a screen grab from Google. - Try it. Go find a decent looking Starbucks employee and make the offer. Tell us how it goes. permalink parent award report block reply canada_is_communist 1 points 4 days ago Im honestly considering it. $5,000 a month to raise kids/take care of the home. Im serious. permalink parent award report block reply view 3 more comments...\nRentFree2020 OP 1 points 4 days ago I don't know this person personally haha. It's a screen grab from Google. - Try it. Go find a decent looking Starbucks employee and make the offer. Tell us how it goes. permalink parent award report block reply canada_is_communist 1 points 4 days ago Im honestly considering it. $5,000 a month to raise kids/take care of the home. Im serious. permalink parent award report block reply view 3 more comments...\ncanada_is_communist 1 points 4 days ago Im honestly considering it. $5,000 a month to raise kids/take care of the home. Im serious. permalink parent award report block reply view 3 more comments...\nsordfysh PRO -1 points 4 days ago So you are saying that you as a capitalist can get back at the socialists by under paying them so they qualify for government benefits. You will convince them that capitalists don't care about other people, and you will convince them that the government will protect them from dire poverty. permalink award report block reply mailinvoter 1 points 4 days ago What a tard! Haha, faggot. I'll have a viente mocha with whipped cream, no soy! permalink parent award report block reply sordfysh PRO 1 points 4 days ago Lol. You go to Starbucks, faggot? And you get whipped cream? Ha! Americans order coffee in small, medium, or large. You can alternatively say 8, 12, or 16 oz. I don't even know what a venti means. And with your clear homosexuality, you should also get glitter sprinkles on top, too. Funny that you call me a faggot and then order one of the gayest drinks. But I know you Starbucks gays can get fruitier. Your degeneracy knows no bounds. permalink parent award report block reply mailinvoter 1 points 4 days ago No, I don't pay $25 for a cup of coffee flavored corn syrup. I grind my own beans at home (ironically, I do buy Starbucks brand beans when I get a 64oz bag for $3, but I digress). Just like I may speak a little Spanish doesn't make me a Messican, I speak a little faggot to interact with your kind. Sorry to lead you on, homoboy, but I don't let twinks pump and dump my butthole or get monkey pox sores in my throat like you. Go buy a coffee grinder, a decent brewer, and stop being a faggot that buys brown hot water from Dunkin Donuts. Oh wait, I forgot what this was even about. Nobody here wants US citizens to be on food stamps.  They are making fun of the people who voted to be fucked in the ass by a communist, and saying they can start paying the extra taxes they signed everyone else up for. I was calling you out for your retarded ass take on the situation.  These people were probably already on food stamps since they work for a coffee shop in their late twenties while living in New York City. They are going to learn that retarded actions have consequences. Also, yes, you are a faggot. permalink parent award report block reply sordfysh PRO 1 points 1 day ago Lol. You are talking about grindr coffee and explaining it in detail. You clearly like the penis. permalink parent award report block reply view 3 more comments... RentFree2020 OP 0 points 4 days ago No one is forcing them to work at Starbucks you retarded faggot. Also, blame the billion dollar corporation that's worshipped by them to pay them a wage. Seriously, all you fucking retards don't understand this. Not to mention these kinds of jobs were designed for high school and college kids. No one intended for putting milk in coffee to be a career. Fucking loser. permalink parent award report block reply sordfysh PRO 1 points 4 days ago Hey, I don't live in your community, so I don't care if you mistreat your fellow man. Just don't be surprised when the young people vote to take your money. You'll get the government you deserve. permalink parent award report block reply RentFree2020 OP 1 points 4 days ago Why is your position that we are under paying them? I still feel like your argument is stupid. I'm not Starbucks. I'm not paying their wages. I also don't think it's my responsibility to tip them to make up for the wage the multi billion dollar corporation refuses to pay them. Again. It's coffee. It's not a profession, it's not a skilled trade. permalink parent award report block reply sordfysh PRO 2 points 4 days ago This is America where we tip to reward and encourage proper American customer service. Go back to Europe or Israel or Cuba where you don't have to tip. permalink parent award report block reply view 9 more comments...\nmailinvoter 1 points 4 days ago What a tard! Haha, faggot. I'll have a viente mocha with whipped cream, no soy! permalink parent award report block reply sordfysh PRO 1 points 4 days ago Lol. You go to Starbucks, faggot? And you get whipped cream? Ha! Americans order coffee in small, medium, or large. You can alternatively say 8, 12, or 16 oz. I don't even know what a venti means. And with your clear homosexuality, you should also get glitter sprinkles on top, too. Funny that you call me a faggot and then order one of the gayest drinks. But I know you Starbucks gays can get fruitier. Your degeneracy knows no bounds. permalink parent award report block reply mailinvoter 1 points 4 days ago No, I don't pay $25 for a cup of coffee flavored corn syrup. I grind my own beans at home (ironically, I do buy Starbucks brand beans when I get a 64oz bag for $3, but I digress). Just like I may speak a little Spanish doesn't make me a Messican, I speak a little faggot to interact with your kind. Sorry to lead you on, homoboy, but I don't let twinks pump and dump my butthole or get monkey pox sores in my throat like you. Go buy a coffee grinder, a decent brewer, and stop being a faggot that buys brown hot water from Dunkin Donuts. Oh wait, I forgot what this was even about. Nobody here wants US citizens to be on food stamps.  They are making fun of the people who voted to be fucked in the ass by a communist, and saying they can start paying the extra taxes they signed everyone else up for. I was calling you out for your retarded ass take on the situation.  These people were probably already on food stamps since they work for a coffee shop in their late twenties while living in New York City. They are going to learn that retarded actions have consequences. Also, yes, you are a faggot. permalink parent award report block reply sordfysh PRO 1 points 1 day ago Lol. You are talking about grindr coffee and explaining it in detail. You clearly like the penis. permalink parent award report block reply view 3 more comments...\nsordfysh PRO 1 points 4 days ago Lol. You go to Starbucks, faggot? And you get whipped cream? Ha! Americans order coffee in small, medium, or large. You can alternatively say 8, 12, or 16 oz. I don't even know what a venti means. And with your clear homosexuality, you should also get glitter sprinkles on top, too. Funny that you call me a faggot and then order one of the gayest drinks. But I know you Starbucks gays can get fruitier. Your degeneracy knows no bounds. permalink parent award report block reply mailinvoter 1 points 4 days ago No, I don't pay $25 for a cup of coffee flavored corn syrup. I grind my own beans at home (ironically, I do buy Starbucks brand beans when I get a 64oz bag for $3, but I digress). Just like I may speak a little Spanish doesn't make me a Messican, I speak a little faggot to interact with your kind. Sorry to lead you on, homoboy, but I don't let twinks pump and dump my butthole or get monkey pox sores in my throat like you. Go buy a coffee grinder, a decent brewer, and stop being a faggot that buys brown hot water from Dunkin Donuts. Oh wait, I forgot what this was even about. Nobody here wants US citizens to be on food stamps.  They are making fun of the people who voted to be fucked in the ass by a communist, and saying they can start paying the extra taxes they signed everyone else up for. I was calling you out for your retarded ass take on the situation.  These people were probably already on food stamps since they work for a coffee shop in their late twenties while living in New York City. They are going to learn that retarded actions have consequences. Also, yes, you are a faggot. permalink parent award report block reply sordfysh PRO 1 points 1 day ago Lol. You are talking about grindr coffee and explaining it in detail. You clearly like the penis. permalink parent award report block reply view 3 more comments...\nmailinvoter 1 points 4 days ago No, I don't pay $25 for a cup of coffee flavored corn syrup. I grind my own beans at home (ironically, I do buy Starbucks brand beans when I get a 64oz bag for $3, but I digress). Just like I may speak a little Spanish doesn't make me a Messican, I speak a little faggot to interact with your kind. Sorry to lead you on, homoboy, but I don't let twinks pump and dump my butthole or get monkey pox sores in my throat like you. Go buy a coffee grinder, a decent brewer, and stop being a faggot that buys brown hot water from Dunkin Donuts. Oh wait, I forgot what this was even about. Nobody here wants US citizens to be on food stamps.  They are making fun of the people who voted to be fucked in the ass by a communist, and saying they can start paying the extra taxes they signed everyone else up for. I was calling you out for your retarded ass take on the situation.  These people were probably already on food stamps since they work for a coffee shop in their late twenties while living in New York City. They are going to learn that retarded actions have consequences. Also, yes, you are a faggot. permalink parent award report block reply sordfysh PRO 1 points 1 day ago Lol. You are talking about grindr coffee and explaining it in detail. You clearly like the penis. permalink parent award report block reply view 3 more comments...\nsordfysh PRO 1 points 1 day ago Lol. You are talking about grindr coffee and explaining it in detail. You clearly like the penis. permalink parent award report block reply view 3 more comments...\nRentFree2020 OP 0 points 4 days ago No one is forcing them to work at Starbucks you retarded faggot. Also, blame the billion dollar corporation that's worshipped by them to pay them a wage. Seriously, all you fucking retards don't understand this. Not to mention these kinds of jobs were designed for high school and college kids. No one intended for putting milk in coffee to be a career. Fucking loser. permalink parent award report block reply sordfysh PRO 1 points 4 days ago Hey, I don't live in your community, so I don't care if you mistreat your fellow man. Just don't be surprised when the young people vote to take your money. You'll get the government you deserve. permalink parent award report block reply RentFree2020 OP 1 points 4 days ago Why is your position that we are under paying them? I still feel like your argument is stupid. I'm not Starbucks. I'm not paying their wages. I also don't think it's my responsibility to tip them to make up for the wage the multi billion dollar corporation refuses to pay them. Again. It's coffee. It's not a profession, it's not a skilled trade. permalink parent award report block reply sordfysh PRO 2 points 4 days ago This is America where we tip to reward and encourage proper American customer service. Go back to Europe or Israel or Cuba where you don't have to tip. permalink parent award report block reply view 9 more comments...\nsordfysh PRO 1 points 4 days ago Hey, I don't live in your community, so I don't care if you mistreat your fellow man. Just don't be surprised when the young people vote to take your money. You'll get the government you deserve. permalink parent award report block reply RentFree2020 OP 1 points 4 days ago Why is your position that we are under paying them? I still feel like your argument is stupid. I'm not Starbucks. I'm not paying their wages. I also don't think it's my responsibility to tip them to make up for the wage the multi billion dollar corporation refuses to pay them. Again. It's coffee. It's not a profession, it's not a skilled trade. permalink parent award report block reply sordfysh PRO 2 points 4 days ago This is America where we tip to reward and encourage proper American customer service. Go back to Europe or Israel or Cuba where you don't have to tip. permalink parent award report block reply view 9 more comments...\nRentFree2020 OP 1 points 4 days ago Why is your position that we are under paying them? I still feel like your argument is stupid. I'm not Starbucks. I'm not paying their wages. I also don't think it's my responsibility to tip them to make up for the wage the multi billion dollar corporation refuses to pay them. Again. It's coffee. It's not a profession, it's not a skilled trade. permalink parent award report block reply sordfysh PRO 2 points 4 days ago This is America where we tip to reward and encourage proper American customer service. Go back to Europe or Israel or Cuba where you don't have to tip. permalink parent award report block reply view 9 more comments...\nsordfysh PRO 2 points 4 days ago This is America where we tip to reward and encourage proper American customer service. Go back to Europe or Israel or Cuba where you don't have to tip. permalink parent award report block reply view 9 more comments...\nBirthHole -1 points 4 days ago A non-Zionist as mayor, and the internet shitstorm begins. Oh the horribles!! permalink award report block reply"}