{"id": "8176573", "contents": "1142 🚨  Sen. John Thune to KEEP THE SENATE IN SESSION until the government reopens. posted 4 days ago by Looniz74 PRO 113 comments award share report block E X X ➠A L E R T S @ExxAlerts • 4d BREAKING: 🚨  Sen. John Thune to KEEP THE SENATE IN SESSION until the government reopens.\n113 comments Sort by Top Top New Worst Old Save Politoed 123 points 4 days ago Sounds like GOP is about to fold permalink award report block reply terribletwos 121 points 4 days ago When you hold all the cards and let your opponent win anyways. permalink parent award report block reply UsernameChexOut 57 points 4 days ago It might be a stretch to think that Democrats are opponents of Republicans. I think experience would teach us that they are both playing for the same team. permalink parent award report block reply terribletwos 22 points 4 days ago That's the joke. permalink parent award report block reply UsernameChexOut 7 points 4 days ago Kek 🤣 permalink parent award report block reply Simple_Doot 16 points 4 days ago My new motto since Trump has been personally dividing the base and adopting pure, distilled neocon positions is \"Its just two roads to the same place.\"  Unless Trump really is executing a Q-like rope-a-dope \"plan\" then its safe to say its over.  His recent behavior, over the last few months, has been anti-MAGA.  Absolutely repulsive if we are going by the MAGA standard that essentially etched in stone from 2016-2024. permalink parent award report block reply LiveFreeInXorDie 9 points 4 days ago Regarding Republicans, mine has been \"two sides of the same coin\", and then I always get the image of Janus, the double-faced god looking in two opposite directions, in my head. I genuinely hate thinking about the real possibility that Trump is (perhaps unwittingly) one of those Republicans, or is like you say, leading us down a different road to the same place. permalink parent award report block reply view 2 more comments... Handshake_Shmanshake 1 points 4 days ago What's hilarious to me is, is that somebody else will come along, some charismatic politician, and all the pissed off people who've seen NOTHING being done for their whole lives will say, \"This is the guy who's gonna fix it.\" And then... nothing happens.. again. permalink parent award report block reply Osmanthus 4 points 4 days ago That is team Aristocracy.  We are reverting to the mean.  Looks like communism, acts like feudalism. permalink parent award report block reply Counterwhat 2 points 3 days ago The Republicans are the Washington generals watching the globetrotters dribble up and down the court before being embarrassingly tea bag dunked on the way to losing. permalink parent award report block reply Stolen 25 points 4 days ago No recess appoints for President Trump. That is the real reason. permalink parent award report block reply Bythrfruitsyknow 20 points 4 days ago Yes, exactly people overlook this but Thune has done this several times and it's only to stop President Trump doing recess appointments. permalink parent award report block reply Joshua2001 12 points 4 days ago Yes if he wanted to motivate the democrats he should say \"if you don't make a deal we will adjourn the Senate and let Trump make recess appointments.\" permalink parent award report block reply mohel 7 points 4 days ago Imagine if the roles were reversed permalink parent award report block reply 4886Battery 15 points 4 days ago If the roles were reversed then the Dems would've waited exactly five seconds into the stoppage to get to removing the filibuster and stacking SCOTUS with 7 or 8 new liberal justices.  How do I know this?  Well, they told us all this before. permalink parent award report block reply ConvergenceMan 5 points 4 days ago Ram through the most grotesque bill imaginable, straight down party lines. \"It's the LAW OF THE LAND\" permalink parent award report block reply Redpilled2Depression 5 points 4 days ago You need to understand that the Republican Party are NOT on the side of the American people anymore than the Democrats are.\nThey’re two sides of the same corrupt coin, and BOTH need to be replaced. permalink parent award report block reply RedCalifornia 4 points 4 days ago When your master tells you to do it and your constituents can't find out who your master is. permalink parent award report block reply load 2 more comments... UsernameChexOut 24 points 4 days ago First time? permalink parent award report block reply DrWeeGee 16 points 4 days ago Every time permalink parent award report block reply madeaprofilejustforu 13 points 4 days ago Berg Stein Witz permalink parent award report block reply daty_dato 9 points 4 days ago Do you have a clue what he's doing? How is this good for the Dems? permalink parent award report block reply Hairytacofanatic 8 points 4 days ago Because the republicans are spineless fuck boys who literally cave in to their demands. All they are good for is Twitter memes, that’s it. Somehow, even though we hold literally all the fucking cards, I’ll bet the democrats win this by getting what ever they fucking want to reopen the gov. permalink parent award report block reply Handshake_Shmanshake 2 points 4 days ago They hold the cards, they do, not you, not some team you and everyone else believes you are on.. This government is a crock of shit, and has been since before most of us were born. This government serves private interests, foreigners, people who turned our nation into a giant fucking walmart where everything is overpriced and getting worse. permalink parent award report block reply EgregiousPhilbin 2 points 4 days ago But vote for them anyway. Otherwise Sessions cannot continue his important work behind the scenes. permalink parent award report block reply daty_dato -1 points 4 days ago If the plan goes correct, the dems will have no say in the gov reopening. It'll take a bit. We'll see if they just give up instead having to do all the time on the Senate Floor.  Yes the R's are spinless but it'll reopen, it'll be then what do they do. permalink parent award report block reply 4886Battery 3 points 4 days ago This is the RINOs' answer to Trump wanting to remove the filibuster. permalink parent award report block reply AlphaOmaga 1 points 4 days ago He’s on record saying he’s “ready to give democrats everything they want. “ Until he proves himself otherwise, fuck that clown. permalink parent award report block reply drattastic1 3 points 4 days ago That's what they usually do best. permalink parent award report block reply BlueKentuckyGirl 3 points 4 days ago Your not listening, just hearing permalink parent award report block reply load 3 more comments... BlackJack1776 81 points 4 days ago Now, make the democrats stand on the floor and filibuster. On. The. Floor. In person. Continuously. permalink award report block reply D__1 25 points 4 days ago Can't stress this enough. This shutdown would've been over 30 days ago if Dems had to stay up there and talk the entire time. People would see exactly who is shutting the government down and why but Republicans seem like they're trying to lose this. permalink parent award report block reply 45fan 9 points 4 days ago Ironically, the 60 votes to end debate was to stop assholes from filibustering. At the time sensible Congress critters used it to stop the hurdle of Senators that just wouldn't stop talking. Now the 60 vote threshold itself is being abused. I guess all rules will be gamed. permalink parent award report block reply Vorticity1 5 points 4 days ago No potty breaks. permalink parent award report block reply TinfoilHardhat 3 points 4 days ago Or vacations to Napa Valley wine country. permalink parent award report block reply armyofpedes4usa 66 points 4 days ago I want this shutdown to not end or at the very least go on for another month. permalink award report block reply FrmrAmericanRepublic 38 points 4 days ago Yep, I want all the parasites starved out. Then look at what REALLY is essential and only staff that. Its funny how national parks are booming with activity without all the 'permits' and other gov faggotry going on just to climb a fucking mountain/rock feature. permalink parent award report block reply ingrowntoenail 13 points 4 days ago Month?  I can last another 3 years. permalink parent award report block reply Dereliction 7 points 4 days ago We could do 30 if we try hard. permalink parent award report block reply HeavyMetalPatriot 2 points 4 days ago Your terms are acceptable. permalink parent award report block reply WisestGuru93 2 points 4 days ago Same, pede permalink parent award report block reply AwShitHereWeGoAgain 37 points 4 days ago Still a weak RINO faggot. permalink award report block reply PapaPepe 32 points 4 days ago BULLSHIT. He's doing it to prevent recess appointments permalink award report block reply lixa 3 points 4 days ago And codify agenda permalink parent award report block reply NeverInterruptEnemy 2 points 4 days ago It’s this. They will never allow Trump to get recess appointments even if they are for 6 months. In a right world, the second he got a recess appointment he could can that retard Bondi and get someone real inZ We don’t live in that world. permalink parent award report block reply Alldayeveryday 32 points 4 days ago He is doing this so the republicans cave in permalink award report block reply BidensPrisonWallet 19 points 4 days ago Why would AIPAC want Thune to do this ? permalink award report block reply Filo76 19 points 4 days ago Obviously so the GOP can fold like a lawn chair, send the bloated bill to Trump's desk where it will get vetoed, then they can point at Trump and blame him for the shutdown. permalink parent award report block reply MakeAmericaGreat9 8 points 4 days ago 🤦 They are already doing that. permalink parent award report block reply MikeyisNinja 6 points 4 days ago Did you know 3 weeks of SNAP is equal to what we send to Israel a year? permalink parent award report block reply johnrambo 3 points 4 days ago end both permalink parent award report block reply SavingPrivateGrace 11 points 4 days ago This is not good.  Democrats proposed a one-year extension of the enhanced health care subsidies which includes illegals.  They are in session until that gets written and voted on. permalink award report block reply HoganT -5 points 4 days ago The ACA does not include nor allow illegals. You’re talking about average Americans health insurance premiums going up by $1000 a month. permalink parent award report block reply MikeyisNinja 12 points 4 days ago Premiums going up because of the affordable healthcare act. Who knew government subsidies make things more unaffordable permalink parent award report block reply Above_Reproach 3 points 4 days ago Now do food subsidies. permalink parent award report block reply HoganT -4 points 4 days ago How about we put forward some health care reform then? I mean, we ran for a decade of repealing and replacing Obamacare. But President Trump seems to like the ACA. Regardless, jumping people’s monthly cost by $1000 or more ain’t good politics, fren. permalink parent award report block reply MikeyisNinja 5 points 4 days ago The best reform would be to let the system crash and let the market reset itself lol no amount of government money is going to solve the problem. permalink parent award report block reply view 5 more comments... AliceCooperBiden 2 points 4 days ago How about everyone just pay for their own healthcare? Too lazy to get a job? You can pay it yourself or get fucked by the bill collectors. permalink parent award report block reply view 2 more comments... SemperFidelis231 2 points 4 days ago \"The ACA does not include nor allow illegals.\" This has got to be the dumbest shit I've read in ages. You know what else doesn't include nor allow illegals? Voting. But they do that shit all the time. It doesn't matter what a program \"includes or allows\" if no one is actually checking it. Or worse, you have Dems actively pushing them onto it. permalink parent award report block reply HoganT -1 points 4 days ago So you’re stance is we can’t fund the ACA because of possible fraud by illegals? How easy do you think it is easy obtain fake identity and a health insurance policy with it? How many fraudster illegals are we talking about here that it’s worth upping people’s monthly insurance premiums from $350 to $1350? Shit you could say funding ANYTHING is about funding illegals by this flimsy ass standard. permalink parent award report block reply SemperFidelis231 1 points 3 days ago We shouldn't be funding the ACA period. Its an abomination of a bill that's driven healthcare prices through the roof. It exists solely to destroy the healthcare industry and force a single payer system. permalink parent award report block reply Klaus73 0 points 4 days ago Your expecting people to do their research. Folks don't understand ACA was not the only thing the democrats asked for. the ACA is overall not terrible for them - but they think the dirty xeno's will get it so they will happily slip into poverty and starve themselves. permalink parent award report block reply GodKingHarambe 9 points 4 days ago After he allowed Democrat faggots like Ruben Gallego to roam the countryside campaigning for other Democrat faggots all while  collecting his Senate check, permalink award report block reply Juzeza 6 points 4 days ago I’m working, you should be too permalink award report block reply MemeWarsVet 5 points 4 days ago This is substantial why? permalink award report block reply VirTW 5 points 4 days ago They bring in the mattresses when this happens....we will get to see schumer in his jammies permalink award report block reply daty_dato 2 points 4 days ago Doesn't matter what they do, it has an end date. permalink parent award report block reply Kraken_V_Algorithm 1 points 4 days ago I don't the think that meets the Senate dress code permalink parent award report block reply YodaBannon 1 points 4 days ago Depends tm permalink parent award report block reply 4886Battery 4 points 4 days ago The calls for removing the filibuster must've spooked him, has to look like he's doing something, Lord forbid he grew a spine and some principles leafed and he'd have to be a man and confront the Dems like they will no doubt confront the GOP once they regain some control. permalink award report block reply joesfbi 1 points 4 days ago He needs the fillibuster to keep the excuses. Removing it and not getting stuff done will be the death nail to how fake the Rinos actually are. permalink parent award report block reply friedchicken 4 points 4 days ago This is all about the epstein files permalink award report block reply Klaus73 1 points 4 days ago I mean...how long as Johnson denied those folks in Arizona representation now...4 weeks? permalink parent award report block reply Austin62Halo 4 points 4 days ago Don’t let ‘em go home. permalink award report block reply Moebius 3 points 4 days ago No Tofurkey  and Ethnically Sourced Trimmings for you... permalink award report block reply Choppermagic 2 points 4 days ago would be nice if they confirmed the rest of Trump's appointments permalink award report block reply Looniz74 OP PRO 2 points 4 days ago https://x.com/ExxAlerts/status/1987221948074467646?s=20 permalink award report block reply Nellie_the_Beaut 2 points 4 days ago This is all about keeping Trump from making any recess appointments. permalink award report block reply GoBigly 2 points 4 days ago Declare martial law and lock congress inside until they pass a bill. permalink award report block reply jonnyuno 2 points 4 days ago GOP sucks. permalink award report block reply PunishedOrange 2 points 4 days ago extend it to right before midterms, dems use it to super charge the base, dems take control of congress and impeach Trump. GOP is free of Trump forever and can now be the permanent victims begging for donations to \"fight\" the super majority dems. permalink award report block reply emorphia 1 points 4 days ago keeping it open but not doing anything while its open. permalink award report block reply barwhack 1 points 4 days ago Thune is a bag of gay dicks. permalink award report block reply Tacitus1963 1 points 4 days ago Remember this RINO sleaze bag Thune prevented PDJT from making recess appointments. The little weasel, Mike Johnson, is no better. permalink award report block reply BlueKentuckyGirl 1 points 4 days ago It’s all live on CSpan 2. You know who is watching this intently and listening to every word, the Brits and the EU permalink award report block reply Siteless_Vagrant 1 points 4 days ago I mean just rip the band aid off. End the filibuster. If the Dems have it done it by now, it’s because they’re just as scared of it as Republicans are. Call their bluff and end it. permalink award report block reply ReallyGayMods 2 points 4 days ago Dems can do 10000x more damage than repubs can with no filibuster permalink parent award report block reply johnparker 1 points 4 days ago And they will end it the moment they get in. permalink parent award report block reply cbonez416 1 points 4 days ago These guys should just go home who cares. The American people don't want you to reopen anyway. There's no march to reopen the government. Where's all the protest. permalink award report block reply Califunya 1 points 4 days ago GOP says…“Squeal like a pig America!!” permalink award report block reply Ferretman 1 points 4 days ago This is the way. permalink award report block reply Grindelwald 1 points 4 days ago Call roll every five minutes permalink award report block reply 2016TrumpMAGA 1 points 4 days ago DGAF.  End the fiulibuster. permalink award report block reply gezadreamsheets2 1 points 3 days ago And I’m sure all those fuckers are still getting paid permalink award report block reply dres3 1 points 4 days ago Democrats are welcomed to go ahead and be refeshed and all that mess. Granted they would be giving up their vote and make it easier for Rs, but Democrats clearly need all the rest for the days ahead. permalink award report block reply anotherrandomname 1 points 4 days ago Anything to prevent Trump getting recess appointments. permalink award report block reply ConfusedAngryArmed 1 points 4 days ago AKA, he's going to keep the government in session until Republicans give in to the Democrats' demands. The mistake here is underestimating the zealotry of the Left. permalink award report block reply raptormissle 0 points 4 days ago You got to know when to fold them. Know when to fold them. permalink award report block reply the_new_one 3 points 4 days ago Comment removed upon the user being banned. permalink award report block reply\nPolitoed 123 points 4 days ago Sounds like GOP is about to fold permalink award report block reply terribletwos 121 points 4 days ago When you hold all the cards and let your opponent win anyways. permalink parent award report block reply UsernameChexOut 57 points 4 days ago It might be a stretch to think that Democrats are opponents of Republicans. I think experience would teach us that they are both playing for the same team. permalink parent award report block reply terribletwos 22 points 4 days ago That's the joke. permalink parent award report block reply UsernameChexOut 7 points 4 days ago Kek 🤣 permalink parent award report block reply Simple_Doot 16 points 4 days ago My new motto since Trump has been personally dividing the base and adopting pure, distilled neocon positions is \"Its just two roads to the same place.\"  Unless Trump really is executing a Q-like rope-a-dope \"plan\" then its safe to say its over.  His recent behavior, over the last few months, has been anti-MAGA.  Absolutely repulsive if we are going by the MAGA standard that essentially etched in stone from 2016-2024. permalink parent award report block reply LiveFreeInXorDie 9 points 4 days ago Regarding Republicans, mine has been \"two sides of the same coin\", and then I always get the image of Janus, the double-faced god looking in two opposite directions, in my head. I genuinely hate thinking about the real possibility that Trump is (perhaps unwittingly) one of those Republicans, or is like you say, leading us down a different road to the same place. permalink parent award report block reply view 2 more comments... Handshake_Shmanshake 1 points 4 days ago What's hilarious to me is, is that somebody else will come along, some charismatic politician, and all the pissed off people who've seen NOTHING being done for their whole lives will say, \"This is the guy who's gonna fix it.\" And then... nothing happens.. again. permalink parent award report block reply Osmanthus 4 points 4 days ago That is team Aristocracy.  We are reverting to the mean.  Looks like communism, acts like feudalism. permalink parent award report block reply Counterwhat 2 points 3 days ago The Republicans are the Washington generals watching the globetrotters dribble up and down the court before being embarrassingly tea bag dunked on the way to losing. permalink parent award report block reply Stolen 25 points 4 days ago No recess appoints for President Trump. That is the real reason. permalink parent award report block reply Bythrfruitsyknow 20 points 4 days ago Yes, exactly people overlook this but Thune has done this several times and it's only to stop President Trump doing recess appointments. permalink parent award report block reply Joshua2001 12 points 4 days ago Yes if he wanted to motivate the democrats he should say \"if you don't make a deal we will adjourn the Senate and let Trump make recess appointments.\" permalink parent award report block reply mohel 7 points 4 days ago Imagine if the roles were reversed permalink parent award report block reply 4886Battery 15 points 4 days ago If the roles were reversed then the Dems would've waited exactly five seconds into the stoppage to get to removing the filibuster and stacking SCOTUS with 7 or 8 new liberal justices.  How do I know this?  Well, they told us all this before. permalink parent award report block reply ConvergenceMan 5 points 4 days ago Ram through the most grotesque bill imaginable, straight down party lines. \"It's the LAW OF THE LAND\" permalink parent award report block reply Redpilled2Depression 5 points 4 days ago You need to understand that the Republican Party are NOT on the side of the American people anymore than the Democrats are.\nThey’re two sides of the same corrupt coin, and BOTH need to be replaced. permalink parent award report block reply RedCalifornia 4 points 4 days ago When your master tells you to do it and your constituents can't find out who your master is. permalink parent award report block reply load 2 more comments... UsernameChexOut 24 points 4 days ago First time? permalink parent award report block reply DrWeeGee 16 points 4 days ago Every time permalink parent award report block reply madeaprofilejustforu 13 points 4 days ago Berg Stein Witz permalink parent award report block reply daty_dato 9 points 4 days ago Do you have a clue what he's doing? How is this good for the Dems? permalink parent award report block reply Hairytacofanatic 8 points 4 days ago Because the republicans are spineless fuck boys who literally cave in to their demands. All they are good for is Twitter memes, that’s it. Somehow, even though we hold literally all the fucking cards, I’ll bet the democrats win this by getting what ever they fucking want to reopen the gov. permalink parent award report block reply Handshake_Shmanshake 2 points 4 days ago They hold the cards, they do, not you, not some team you and everyone else believes you are on.. This government is a crock of shit, and has been since before most of us were born. This government serves private interests, foreigners, people who turned our nation into a giant fucking walmart where everything is overpriced and getting worse. permalink parent award report block reply EgregiousPhilbin 2 points 4 days ago But vote for them anyway. Otherwise Sessions cannot continue his important work behind the scenes. permalink parent award report block reply daty_dato -1 points 4 days ago If the plan goes correct, the dems will have no say in the gov reopening. It'll take a bit. We'll see if they just give up instead having to do all the time on the Senate Floor.  Yes the R's are spinless but it'll reopen, it'll be then what do they do. permalink parent award report block reply 4886Battery 3 points 4 days ago This is the RINOs' answer to Trump wanting to remove the filibuster. permalink parent award report block reply AlphaOmaga 1 points 4 days ago He’s on record saying he’s “ready to give democrats everything they want. “ Until he proves himself otherwise, fuck that clown. permalink parent award report block reply drattastic1 3 points 4 days ago That's what they usually do best. permalink parent award report block reply BlueKentuckyGirl 3 points 4 days ago Your not listening, just hearing permalink parent award report block reply load 3 more comments...\nterribletwos 121 points 4 days ago When you hold all the cards and let your opponent win anyways. permalink parent award report block reply UsernameChexOut 57 points 4 days ago It might be a stretch to think that Democrats are opponents of Republicans. I think experience would teach us that they are both playing for the same team. permalink parent award report block reply terribletwos 22 points 4 days ago That's the joke. permalink parent award report block reply UsernameChexOut 7 points 4 days ago Kek 🤣 permalink parent award report block reply Simple_Doot 16 points 4 days ago My new motto since Trump has been personally dividing the base and adopting pure, distilled neocon positions is \"Its just two roads to the same place.\"  Unless Trump really is executing a Q-like rope-a-dope \"plan\" then its safe to say its over.  His recent behavior, over the last few months, has been anti-MAGA.  Absolutely repulsive if we are going by the MAGA standard that essentially etched in stone from 2016-2024. permalink parent award report block reply LiveFreeInXorDie 9 points 4 days ago Regarding Republicans, mine has been \"two sides of the same coin\", and then I always get the image of Janus, the double-faced god looking in two opposite directions, in my head. I genuinely hate thinking about the real possibility that Trump is (perhaps unwittingly) one of those Republicans, or is like you say, leading us down a different road to the same place. permalink parent award report block reply view 2 more comments... Handshake_Shmanshake 1 points 4 days ago What's hilarious to me is, is that somebody else will come along, some charismatic politician, and all the pissed off people who've seen NOTHING being done for their whole lives will say, \"This is the guy who's gonna fix it.\" And then... nothing happens.. again. permalink parent award report block reply Osmanthus 4 points 4 days ago That is team Aristocracy.  We are reverting to the mean.  Looks like communism, acts like feudalism. permalink parent award report block reply Counterwhat 2 points 3 days ago The Republicans are the Washington generals watching the globetrotters dribble up and down the court before being embarrassingly tea bag dunked on the way to losing. permalink parent award report block reply Stolen 25 points 4 days ago No recess appoints for President Trump. That is the real reason. permalink parent award report block reply Bythrfruitsyknow 20 points 4 days ago Yes, exactly people overlook this but Thune has done this several times and it's only to stop President Trump doing recess appointments. permalink parent award report block reply Joshua2001 12 points 4 days ago Yes if he wanted to motivate the democrats he should say \"if you don't make a deal we will adjourn the Senate and let Trump make recess appointments.\" permalink parent award report block reply mohel 7 points 4 days ago Imagine if the roles were reversed permalink parent award report block reply 4886Battery 15 points 4 days ago If the roles were reversed then the Dems would've waited exactly five seconds into the stoppage to get to removing the filibuster and stacking SCOTUS with 7 or 8 new liberal justices.  How do I know this?  Well, they told us all this before. permalink parent award report block reply ConvergenceMan 5 points 4 days ago Ram through the most grotesque bill imaginable, straight down party lines. \"It's the LAW OF THE LAND\" permalink parent award report block reply Redpilled2Depression 5 points 4 days ago You need to understand that the Republican Party are NOT on the side of the American people anymore than the Democrats are.\nThey’re two sides of the same corrupt coin, and BOTH need to be replaced. permalink parent award report block reply RedCalifornia 4 points 4 days ago When your master tells you to do it and your constituents can't find out who your master is. permalink parent award report block reply load 2 more comments...\nUsernameChexOut 57 points 4 days ago It might be a stretch to think that Democrats are opponents of Republicans. I think experience would teach us that they are both playing for the same team. permalink parent award report block reply terribletwos 22 points 4 days ago That's the joke. permalink parent award report block reply UsernameChexOut 7 points 4 days ago Kek 🤣 permalink parent award report block reply Simple_Doot 16 points 4 days ago My new motto since Trump has been personally dividing the base and adopting pure, distilled neocon positions is \"Its just two roads to the same place.\"  Unless Trump really is executing a Q-like rope-a-dope \"plan\" then its safe to say its over.  His recent behavior, over the last few months, has been anti-MAGA.  Absolutely repulsive if we are going by the MAGA standard that essentially etched in stone from 2016-2024. permalink parent award report block reply LiveFreeInXorDie 9 points 4 days ago Regarding Republicans, mine has been \"two sides of the same coin\", and then I always get the image of Janus, the double-faced god looking in two opposite directions, in my head. I genuinely hate thinking about the real possibility that Trump is (perhaps unwittingly) one of those Republicans, or is like you say, leading us down a different road to the same place. permalink parent award report block reply view 2 more comments... Handshake_Shmanshake 1 points 4 days ago What's hilarious to me is, is that somebody else will come along, some charismatic politician, and all the pissed off people who've seen NOTHING being done for their whole lives will say, \"This is the guy who's gonna fix it.\" And then... nothing happens.. again. permalink parent award report block reply Osmanthus 4 points 4 days ago That is team Aristocracy.  We are reverting to the mean.  Looks like communism, acts like feudalism. permalink parent award report block reply Counterwhat 2 points 3 days ago The Republicans are the Washington generals watching the globetrotters dribble up and down the court before being embarrassingly tea bag dunked on the way to losing. permalink parent award report block reply\nterribletwos 22 points 4 days ago That's the joke. permalink parent award report block reply UsernameChexOut 7 points 4 days ago Kek 🤣 permalink parent award report block reply\nUsernameChexOut 7 points 4 days ago Kek 🤣 permalink parent award report block reply\nSimple_Doot 16 points 4 days ago My new motto since Trump has been personally dividing the base and adopting pure, distilled neocon positions is \"Its just two roads to the same place.\"  Unless Trump really is executing a Q-like rope-a-dope \"plan\" then its safe to say its over.  His recent behavior, over the last few months, has been anti-MAGA.  Absolutely repulsive if we are going by the MAGA standard that essentially etched in stone from 2016-2024. permalink parent award report block reply LiveFreeInXorDie 9 points 4 days ago Regarding Republicans, mine has been \"two sides of the same coin\", and then I always get the image of Janus, the double-faced god looking in two opposite directions, in my head. I genuinely hate thinking about the real possibility that Trump is (perhaps unwittingly) one of those Republicans, or is like you say, leading us down a different road to the same place. permalink parent award report block reply view 2 more comments... Handshake_Shmanshake 1 points 4 days ago What's hilarious to me is, is that somebody else will come along, some charismatic politician, and all the pissed off people who've seen NOTHING being done for their whole lives will say, \"This is the guy who's gonna fix it.\" And then... nothing happens.. again. permalink parent award report block reply\nLiveFreeInXorDie 9 points 4 days ago Regarding Republicans, mine has been \"two sides of the same coin\", and then I always get the image of Janus, the double-faced god looking in two opposite directions, in my head. I genuinely hate thinking about the real possibility that Trump is (perhaps unwittingly) one of those Republicans, or is like you say, leading us down a different road to the same place. permalink parent award report block reply view 2 more comments...\nHandshake_Shmanshake 1 points 4 days ago What's hilarious to me is, is that somebody else will come along, some charismatic politician, and all the pissed off people who've seen NOTHING being done for their whole lives will say, \"This is the guy who's gonna fix it.\" And then... nothing happens.. again. permalink parent award report block reply\nOsmanthus 4 points 4 days ago That is team Aristocracy.  We are reverting to the mean.  Looks like communism, acts like feudalism. permalink parent award report block reply\nCounterwhat 2 points 3 days ago The Republicans are the Washington generals watching the globetrotters dribble up and down the court before being embarrassingly tea bag dunked on the way to losing. permalink parent award report block reply\nStolen 25 points 4 days ago No recess appoints for President Trump. That is the real reason. permalink parent award report block reply Bythrfruitsyknow 20 points 4 days ago Yes, exactly people overlook this but Thune has done this several times and it's only to stop President Trump doing recess appointments. permalink parent award report block reply Joshua2001 12 points 4 days ago Yes if he wanted to motivate the democrats he should say \"if you don't make a deal we will adjourn the Senate and let Trump make recess appointments.\" permalink parent award report block reply\nBythrfruitsyknow 20 points 4 days ago Yes, exactly people overlook this but Thune has done this several times and it's only to stop President Trump doing recess appointments. permalink parent award report block reply\nJoshua2001 12 points 4 days ago Yes if he wanted to motivate the democrats he should say \"if you don't make a deal we will adjourn the Senate and let Trump make recess appointments.\" permalink parent award report block reply\nmohel 7 points 4 days ago Imagine if the roles were reversed permalink parent award report block reply 4886Battery 15 points 4 days ago If the roles were reversed then the Dems would've waited exactly five seconds into the stoppage to get to removing the filibuster and stacking SCOTUS with 7 or 8 new liberal justices.  How do I know this?  Well, they told us all this before. permalink parent award report block reply ConvergenceMan 5 points 4 days ago Ram through the most grotesque bill imaginable, straight down party lines. \"It's the LAW OF THE LAND\" permalink parent award report block reply\n4886Battery 15 points 4 days ago If the roles were reversed then the Dems would've waited exactly five seconds into the stoppage to get to removing the filibuster and stacking SCOTUS with 7 or 8 new liberal justices.  How do I know this?  Well, they told us all this before. permalink parent award report block reply\nConvergenceMan 5 points 4 days ago Ram through the most grotesque bill imaginable, straight down party lines. \"It's the LAW OF THE LAND\" permalink parent award report block reply\nRedpilled2Depression 5 points 4 days ago You need to understand that the Republican Party are NOT on the side of the American people anymore than the Democrats are.\nThey’re two sides of the same corrupt coin, and BOTH need to be replaced. permalink parent award report block reply\nRedCalifornia 4 points 4 days ago When your master tells you to do it and your constituents can't find out who your master is. permalink parent award report block reply\nUsernameChexOut 24 points 4 days ago First time? permalink parent award report block reply DrWeeGee 16 points 4 days ago Every time permalink parent award report block reply madeaprofilejustforu 13 points 4 days ago Berg Stein Witz permalink parent award report block reply\nDrWeeGee 16 points 4 days ago Every time permalink parent award report block reply madeaprofilejustforu 13 points 4 days ago Berg Stein Witz permalink parent award report block reply\nmadeaprofilejustforu 13 points 4 days ago Berg Stein Witz permalink parent award report block reply\ndaty_dato 9 points 4 days ago Do you have a clue what he's doing? How is this good for the Dems? permalink parent award report block reply Hairytacofanatic 8 points 4 days ago Because the republicans are spineless fuck boys who literally cave in to their demands. All they are good for is Twitter memes, that’s it. Somehow, even though we hold literally all the fucking cards, I’ll bet the democrats win this by getting what ever they fucking want to reopen the gov. permalink parent award report block reply Handshake_Shmanshake 2 points 4 days ago They hold the cards, they do, not you, not some team you and everyone else believes you are on.. This government is a crock of shit, and has been since before most of us were born. This government serves private interests, foreigners, people who turned our nation into a giant fucking walmart where everything is overpriced and getting worse. permalink parent award report block reply EgregiousPhilbin 2 points 4 days ago But vote for them anyway. Otherwise Sessions cannot continue his important work behind the scenes. permalink parent award report block reply daty_dato -1 points 4 days ago If the plan goes correct, the dems will have no say in the gov reopening. It'll take a bit. We'll see if they just give up instead having to do all the time on the Senate Floor.  Yes the R's are spinless but it'll reopen, it'll be then what do they do. permalink parent award report block reply 4886Battery 3 points 4 days ago This is the RINOs' answer to Trump wanting to remove the filibuster. permalink parent award report block reply AlphaOmaga 1 points 4 days ago He’s on record saying he’s “ready to give democrats everything they want. “ Until he proves himself otherwise, fuck that clown. permalink parent award report block reply\nHairytacofanatic 8 points 4 days ago Because the republicans are spineless fuck boys who literally cave in to their demands. All they are good for is Twitter memes, that’s it. Somehow, even though we hold literally all the fucking cards, I’ll bet the democrats win this by getting what ever they fucking want to reopen the gov. permalink parent award report block reply Handshake_Shmanshake 2 points 4 days ago They hold the cards, they do, not you, not some team you and everyone else believes you are on.. This government is a crock of shit, and has been since before most of us were born. This government serves private interests, foreigners, people who turned our nation into a giant fucking walmart where everything is overpriced and getting worse. permalink parent award report block reply EgregiousPhilbin 2 points 4 days ago But vote for them anyway. Otherwise Sessions cannot continue his important work behind the scenes. permalink parent award report block reply daty_dato -1 points 4 days ago If the plan goes correct, the dems will have no say in the gov reopening. It'll take a bit. We'll see if they just give up instead having to do all the time on the Senate Floor.  Yes the R's are spinless but it'll reopen, it'll be then what do they do. permalink parent award report block reply\nHandshake_Shmanshake 2 points 4 days ago They hold the cards, they do, not you, not some team you and everyone else believes you are on.. This government is a crock of shit, and has been since before most of us were born. This government serves private interests, foreigners, people who turned our nation into a giant fucking walmart where everything is overpriced and getting worse. permalink parent award report block reply\nEgregiousPhilbin 2 points 4 days ago But vote for them anyway. Otherwise Sessions cannot continue his important work behind the scenes. permalink parent award report block reply\ndaty_dato -1 points 4 days ago If the plan goes correct, the dems will have no say in the gov reopening. It'll take a bit. We'll see if they just give up instead having to do all the time on the Senate Floor.  Yes the R's are spinless but it'll reopen, it'll be then what do they do. permalink parent award report block reply\n4886Battery 3 points 4 days ago This is the RINOs' answer to Trump wanting to remove the filibuster. permalink parent award report block reply\nAlphaOmaga 1 points 4 days ago He’s on record saying he’s “ready to give democrats everything they want. “ Until he proves himself otherwise, fuck that clown. permalink parent award report block reply\ndrattastic1 3 points 4 days ago That's what they usually do best. permalink parent award report block reply\nBlueKentuckyGirl 3 points 4 days ago Your not listening, just hearing permalink parent award report block reply\nBlackJack1776 81 points 4 days ago Now, make the democrats stand on the floor and filibuster. On. The. Floor. In person. Continuously. permalink award report block reply D__1 25 points 4 days ago Can't stress this enough. This shutdown would've been over 30 days ago if Dems had to stay up there and talk the entire time. People would see exactly who is shutting the government down and why but Republicans seem like they're trying to lose this. permalink parent award report block reply 45fan 9 points 4 days ago Ironically, the 60 votes to end debate was to stop assholes from filibustering. At the time sensible Congress critters used it to stop the hurdle of Senators that just wouldn't stop talking. Now the 60 vote threshold itself is being abused. I guess all rules will be gamed. permalink parent award report block reply Vorticity1 5 points 4 days ago No potty breaks. permalink parent award report block reply TinfoilHardhat 3 points 4 days ago Or vacations to Napa Valley wine country. permalink parent award report block reply\nD__1 25 points 4 days ago Can't stress this enough. This shutdown would've been over 30 days ago if Dems had to stay up there and talk the entire time. People would see exactly who is shutting the government down and why but Republicans seem like they're trying to lose this. permalink parent award report block reply 45fan 9 points 4 days ago Ironically, the 60 votes to end debate was to stop assholes from filibustering. At the time sensible Congress critters used it to stop the hurdle of Senators that just wouldn't stop talking. Now the 60 vote threshold itself is being abused. I guess all rules will be gamed. permalink parent award report block reply\n45fan 9 points 4 days ago Ironically, the 60 votes to end debate was to stop assholes from filibustering. At the time sensible Congress critters used it to stop the hurdle of Senators that just wouldn't stop talking. Now the 60 vote threshold itself is being abused. I guess all rules will be gamed. permalink parent award report block reply\nVorticity1 5 points 4 days ago No potty breaks. permalink parent award report block reply TinfoilHardhat 3 points 4 days ago Or vacations to Napa Valley wine country. permalink parent award report block reply\nTinfoilHardhat 3 points 4 days ago Or vacations to Napa Valley wine country. permalink parent award report block reply\narmyofpedes4usa 66 points 4 days ago I want this shutdown to not end or at the very least go on for another month. permalink award report block reply FrmrAmericanRepublic 38 points 4 days ago Yep, I want all the parasites starved out. Then look at what REALLY is essential and only staff that. Its funny how national parks are booming with activity without all the 'permits' and other gov faggotry going on just to climb a fucking mountain/rock feature. permalink parent award report block reply ingrowntoenail 13 points 4 days ago Month?  I can last another 3 years. permalink parent award report block reply Dereliction 7 points 4 days ago We could do 30 if we try hard. permalink parent award report block reply HeavyMetalPatriot 2 points 4 days ago Your terms are acceptable. permalink parent award report block reply WisestGuru93 2 points 4 days ago Same, pede permalink parent award report block reply\nFrmrAmericanRepublic 38 points 4 days ago Yep, I want all the parasites starved out. Then look at what REALLY is essential and only staff that. Its funny how national parks are booming with activity without all the 'permits' and other gov faggotry going on just to climb a fucking mountain/rock feature. permalink parent award report block reply\ningrowntoenail 13 points 4 days ago Month?  I can last another 3 years. permalink parent award report block reply Dereliction 7 points 4 days ago We could do 30 if we try hard. permalink parent award report block reply HeavyMetalPatriot 2 points 4 days ago Your terms are acceptable. permalink parent award report block reply\nDereliction 7 points 4 days ago We could do 30 if we try hard. permalink parent award report block reply HeavyMetalPatriot 2 points 4 days ago Your terms are acceptable. permalink parent award report block reply\nHeavyMetalPatriot 2 points 4 days ago Your terms are acceptable. permalink parent award report block reply\nWisestGuru93 2 points 4 days ago Same, pede permalink parent award report block reply\nAwShitHereWeGoAgain 37 points 4 days ago Still a weak RINO faggot. permalink award report block reply\nPapaPepe 32 points 4 days ago BULLSHIT. He's doing it to prevent recess appointments permalink award report block reply lixa 3 points 4 days ago And codify agenda permalink parent award report block reply NeverInterruptEnemy 2 points 4 days ago It’s this. They will never allow Trump to get recess appointments even if they are for 6 months. In a right world, the second he got a recess appointment he could can that retard Bondi and get someone real inZ We don’t live in that world. permalink parent award report block reply\nlixa 3 points 4 days ago And codify agenda permalink parent award report block reply\nNeverInterruptEnemy 2 points 4 days ago It’s this. They will never allow Trump to get recess appointments even if they are for 6 months. In a right world, the second he got a recess appointment he could can that retard Bondi and get someone real inZ We don’t live in that world. permalink parent award report block reply\nAlldayeveryday 32 points 4 days ago He is doing this so the republicans cave in permalink award report block reply\nBidensPrisonWallet 19 points 4 days ago Why would AIPAC want Thune to do this ? permalink award report block reply Filo76 19 points 4 days ago Obviously so the GOP can fold like a lawn chair, send the bloated bill to Trump's desk where it will get vetoed, then they can point at Trump and blame him for the shutdown. permalink parent award report block reply MakeAmericaGreat9 8 points 4 days ago 🤦 They are already doing that. permalink parent award report block reply MikeyisNinja 6 points 4 days ago Did you know 3 weeks of SNAP is equal to what we send to Israel a year? permalink parent award report block reply johnrambo 3 points 4 days ago end both permalink parent award report block reply\nFilo76 19 points 4 days ago Obviously so the GOP can fold like a lawn chair, send the bloated bill to Trump's desk where it will get vetoed, then they can point at Trump and blame him for the shutdown. permalink parent award report block reply MakeAmericaGreat9 8 points 4 days ago 🤦 They are already doing that. permalink parent award report block reply\nMakeAmericaGreat9 8 points 4 days ago 🤦 They are already doing that. permalink parent award report block reply\nMikeyisNinja 6 points 4 days ago Did you know 3 weeks of SNAP is equal to what we send to Israel a year? permalink parent award report block reply johnrambo 3 points 4 days ago end both permalink parent award report block reply\njohnrambo 3 points 4 days ago end both permalink parent award report block reply\nSavingPrivateGrace 11 points 4 days ago This is not good.  Democrats proposed a one-year extension of the enhanced health care subsidies which includes illegals.  They are in session until that gets written and voted on. permalink award report block reply HoganT -5 points 4 days ago The ACA does not include nor allow illegals. You’re talking about average Americans health insurance premiums going up by $1000 a month. permalink parent award report block reply MikeyisNinja 12 points 4 days ago Premiums going up because of the affordable healthcare act. Who knew government subsidies make things more unaffordable permalink parent award report block reply Above_Reproach 3 points 4 days ago Now do food subsidies. permalink parent award report block reply HoganT -4 points 4 days ago How about we put forward some health care reform then? I mean, we ran for a decade of repealing and replacing Obamacare. But President Trump seems to like the ACA. Regardless, jumping people’s monthly cost by $1000 or more ain’t good politics, fren. permalink parent award report block reply MikeyisNinja 5 points 4 days ago The best reform would be to let the system crash and let the market reset itself lol no amount of government money is going to solve the problem. permalink parent award report block reply view 5 more comments... AliceCooperBiden 2 points 4 days ago How about everyone just pay for their own healthcare? Too lazy to get a job? You can pay it yourself or get fucked by the bill collectors. permalink parent award report block reply view 2 more comments... SemperFidelis231 2 points 4 days ago \"The ACA does not include nor allow illegals.\" This has got to be the dumbest shit I've read in ages. You know what else doesn't include nor allow illegals? Voting. But they do that shit all the time. It doesn't matter what a program \"includes or allows\" if no one is actually checking it. Or worse, you have Dems actively pushing them onto it. permalink parent award report block reply HoganT -1 points 4 days ago So you’re stance is we can’t fund the ACA because of possible fraud by illegals? How easy do you think it is easy obtain fake identity and a health insurance policy with it? How many fraudster illegals are we talking about here that it’s worth upping people’s monthly insurance premiums from $350 to $1350? Shit you could say funding ANYTHING is about funding illegals by this flimsy ass standard. permalink parent award report block reply SemperFidelis231 1 points 3 days ago We shouldn't be funding the ACA period. Its an abomination of a bill that's driven healthcare prices through the roof. It exists solely to destroy the healthcare industry and force a single payer system. permalink parent award report block reply Klaus73 0 points 4 days ago Your expecting people to do their research. Folks don't understand ACA was not the only thing the democrats asked for. the ACA is overall not terrible for them - but they think the dirty xeno's will get it so they will happily slip into poverty and starve themselves. permalink parent award report block reply\nHoganT -5 points 4 days ago The ACA does not include nor allow illegals. You’re talking about average Americans health insurance premiums going up by $1000 a month. permalink parent award report block reply MikeyisNinja 12 points 4 days ago Premiums going up because of the affordable healthcare act. Who knew government subsidies make things more unaffordable permalink parent award report block reply Above_Reproach 3 points 4 days ago Now do food subsidies. permalink parent award report block reply HoganT -4 points 4 days ago How about we put forward some health care reform then? I mean, we ran for a decade of repealing and replacing Obamacare. But President Trump seems to like the ACA. Regardless, jumping people’s monthly cost by $1000 or more ain’t good politics, fren. permalink parent award report block reply MikeyisNinja 5 points 4 days ago The best reform would be to let the system crash and let the market reset itself lol no amount of government money is going to solve the problem. permalink parent award report block reply view 5 more comments... AliceCooperBiden 2 points 4 days ago How about everyone just pay for their own healthcare? Too lazy to get a job? You can pay it yourself or get fucked by the bill collectors. permalink parent award report block reply view 2 more comments... SemperFidelis231 2 points 4 days ago \"The ACA does not include nor allow illegals.\" This has got to be the dumbest shit I've read in ages. You know what else doesn't include nor allow illegals? Voting. But they do that shit all the time. It doesn't matter what a program \"includes or allows\" if no one is actually checking it. Or worse, you have Dems actively pushing them onto it. permalink parent award report block reply HoganT -1 points 4 days ago So you’re stance is we can’t fund the ACA because of possible fraud by illegals? How easy do you think it is easy obtain fake identity and a health insurance policy with it? How many fraudster illegals are we talking about here that it’s worth upping people’s monthly insurance premiums from $350 to $1350? Shit you could say funding ANYTHING is about funding illegals by this flimsy ass standard. permalink parent award report block reply SemperFidelis231 1 points 3 days ago We shouldn't be funding the ACA period. Its an abomination of a bill that's driven healthcare prices through the roof. It exists solely to destroy the healthcare industry and force a single payer system. permalink parent award report block reply Klaus73 0 points 4 days ago Your expecting people to do their research. Folks don't understand ACA was not the only thing the democrats asked for. the ACA is overall not terrible for them - but they think the dirty xeno's will get it so they will happily slip into poverty and starve themselves. permalink parent award report block reply\nMikeyisNinja 12 points 4 days ago Premiums going up because of the affordable healthcare act. Who knew government subsidies make things more unaffordable permalink parent award report block reply Above_Reproach 3 points 4 days ago Now do food subsidies. permalink parent award report block reply HoganT -4 points 4 days ago How about we put forward some health care reform then? I mean, we ran for a decade of repealing and replacing Obamacare. But President Trump seems to like the ACA. Regardless, jumping people’s monthly cost by $1000 or more ain’t good politics, fren. permalink parent award report block reply MikeyisNinja 5 points 4 days ago The best reform would be to let the system crash and let the market reset itself lol no amount of government money is going to solve the problem. permalink parent award report block reply view 5 more comments... AliceCooperBiden 2 points 4 days ago How about everyone just pay for their own healthcare? Too lazy to get a job? You can pay it yourself or get fucked by the bill collectors. permalink parent award report block reply view 2 more comments...\nAbove_Reproach 3 points 4 days ago Now do food subsidies. permalink parent award report block reply\nHoganT -4 points 4 days ago How about we put forward some health care reform then? I mean, we ran for a decade of repealing and replacing Obamacare. But President Trump seems to like the ACA. Regardless, jumping people’s monthly cost by $1000 or more ain’t good politics, fren. permalink parent award report block reply MikeyisNinja 5 points 4 days ago The best reform would be to let the system crash and let the market reset itself lol no amount of government money is going to solve the problem. permalink parent award report block reply view 5 more comments... AliceCooperBiden 2 points 4 days ago How about everyone just pay for their own healthcare? Too lazy to get a job? You can pay it yourself or get fucked by the bill collectors. permalink parent award report block reply view 2 more comments...\nMikeyisNinja 5 points 4 days ago The best reform would be to let the system crash and let the market reset itself lol no amount of government money is going to solve the problem. permalink parent award report block reply view 5 more comments...\nAliceCooperBiden 2 points 4 days ago How about everyone just pay for their own healthcare? Too lazy to get a job? You can pay it yourself or get fucked by the bill collectors. permalink parent award report block reply view 2 more comments...\nSemperFidelis231 2 points 4 days ago \"The ACA does not include nor allow illegals.\" This has got to be the dumbest shit I've read in ages. You know what else doesn't include nor allow illegals? Voting. But they do that shit all the time. It doesn't matter what a program \"includes or allows\" if no one is actually checking it. Or worse, you have Dems actively pushing them onto it. permalink parent award report block reply HoganT -1 points 4 days ago So you’re stance is we can’t fund the ACA because of possible fraud by illegals? How easy do you think it is easy obtain fake identity and a health insurance policy with it? How many fraudster illegals are we talking about here that it’s worth upping people’s monthly insurance premiums from $350 to $1350? Shit you could say funding ANYTHING is about funding illegals by this flimsy ass standard. permalink parent award report block reply SemperFidelis231 1 points 3 days ago We shouldn't be funding the ACA period. Its an abomination of a bill that's driven healthcare prices through the roof. It exists solely to destroy the healthcare industry and force a single payer system. permalink parent award report block reply\nHoganT -1 points 4 days ago So you’re stance is we can’t fund the ACA because of possible fraud by illegals? How easy do you think it is easy obtain fake identity and a health insurance policy with it? How many fraudster illegals are we talking about here that it’s worth upping people’s monthly insurance premiums from $350 to $1350? Shit you could say funding ANYTHING is about funding illegals by this flimsy ass standard. permalink parent award report block reply SemperFidelis231 1 points 3 days ago We shouldn't be funding the ACA period. Its an abomination of a bill that's driven healthcare prices through the roof. It exists solely to destroy the healthcare industry and force a single payer system. permalink parent award report block reply\nSemperFidelis231 1 points 3 days ago We shouldn't be funding the ACA period. Its an abomination of a bill that's driven healthcare prices through the roof. It exists solely to destroy the healthcare industry and force a single payer system. permalink parent award report block reply\nKlaus73 0 points 4 days ago Your expecting people to do their research. Folks don't understand ACA was not the only thing the democrats asked for. the ACA is overall not terrible for them - but they think the dirty xeno's will get it so they will happily slip into poverty and starve themselves. permalink parent award report block reply\nGodKingHarambe 9 points 4 days ago After he allowed Democrat faggots like Ruben Gallego to roam the countryside campaigning for other Democrat faggots all while  collecting his Senate check, permalink award report block reply\nJuzeza 6 points 4 days ago I’m working, you should be too permalink award report block reply\nMemeWarsVet 5 points 4 days ago This is substantial why? permalink award report block reply\nVirTW 5 points 4 days ago They bring in the mattresses when this happens....we will get to see schumer in his jammies permalink award report block reply daty_dato 2 points 4 days ago Doesn't matter what they do, it has an end date. permalink parent award report block reply Kraken_V_Algorithm 1 points 4 days ago I don't the think that meets the Senate dress code permalink parent award report block reply YodaBannon 1 points 4 days ago Depends tm permalink parent award report block reply\ndaty_dato 2 points 4 days ago Doesn't matter what they do, it has an end date. permalink parent award report block reply\nKraken_V_Algorithm 1 points 4 days ago I don't the think that meets the Senate dress code permalink parent award report block reply\nYodaBannon 1 points 4 days ago Depends tm permalink parent award report block reply\n4886Battery 4 points 4 days ago The calls for removing the filibuster must've spooked him, has to look like he's doing something, Lord forbid he grew a spine and some principles leafed and he'd have to be a man and confront the Dems like they will no doubt confront the GOP once they regain some control. permalink award report block reply joesfbi 1 points 4 days ago He needs the fillibuster to keep the excuses. Removing it and not getting stuff done will be the death nail to how fake the Rinos actually are. permalink parent award report block reply\njoesfbi 1 points 4 days ago He needs the fillibuster to keep the excuses. Removing it and not getting stuff done will be the death nail to how fake the Rinos actually are. permalink parent award report block reply\nfriedchicken 4 points 4 days ago This is all about the epstein files permalink award report block reply Klaus73 1 points 4 days ago I mean...how long as Johnson denied those folks in Arizona representation now...4 weeks? permalink parent award report block reply\nKlaus73 1 points 4 days ago I mean...how long as Johnson denied those folks in Arizona representation now...4 weeks? permalink parent award report block reply\nAustin62Halo 4 points 4 days ago Don’t let ‘em go home. permalink award report block reply\nMoebius 3 points 4 days ago No Tofurkey  and Ethnically Sourced Trimmings for you... permalink award report block reply\nChoppermagic 2 points 4 days ago would be nice if they confirmed the rest of Trump's appointments permalink award report block reply\nLooniz74 OP PRO 2 points 4 days ago https://x.com/ExxAlerts/status/1987221948074467646?s=20 permalink award report block reply\nNellie_the_Beaut 2 points 4 days ago This is all about keeping Trump from making any recess appointments. permalink award report block reply\nGoBigly 2 points 4 days ago Declare martial law and lock congress inside until they pass a bill. permalink award report block reply\njonnyuno 2 points 4 days ago GOP sucks. permalink award report block reply\nPunishedOrange 2 points 4 days ago extend it to right before midterms, dems use it to super charge the base, dems take control of congress and impeach Trump. GOP is free of Trump forever and can now be the permanent victims begging for donations to \"fight\" the super majority dems. permalink award report block reply\nemorphia 1 points 4 days ago keeping it open but not doing anything while its open. permalink award report block reply\nbarwhack 1 points 4 days ago Thune is a bag of gay dicks. permalink award report block reply\nTacitus1963 1 points 4 days ago Remember this RINO sleaze bag Thune prevented PDJT from making recess appointments. The little weasel, Mike Johnson, is no better. permalink award report block reply\nBlueKentuckyGirl 1 points 4 days ago It’s all live on CSpan 2. You know who is watching this intently and listening to every word, the Brits and the EU permalink award report block reply\nSiteless_Vagrant 1 points 4 days ago I mean just rip the band aid off. End the filibuster. If the Dems have it done it by now, it’s because they’re just as scared of it as Republicans are. Call their bluff and end it. permalink award report block reply ReallyGayMods 2 points 4 days ago Dems can do 10000x more damage than repubs can with no filibuster permalink parent award report block reply johnparker 1 points 4 days ago And they will end it the moment they get in. permalink parent award report block reply\nReallyGayMods 2 points 4 days ago Dems can do 10000x more damage than repubs can with no filibuster permalink parent award report block reply johnparker 1 points 4 days ago And they will end it the moment they get in. permalink parent award report block reply\njohnparker 1 points 4 days ago And they will end it the moment they get in. permalink parent award report block reply\ncbonez416 1 points 4 days ago These guys should just go home who cares. The American people don't want you to reopen anyway. There's no march to reopen the government. Where's all the protest. permalink award report block reply\nCalifunya 1 points 4 days ago GOP says…“Squeal like a pig America!!” permalink award report block reply\nFerretman 1 points 4 days ago This is the way. permalink award report block reply\nGrindelwald 1 points 4 days ago Call roll every five minutes permalink award report block reply\n2016TrumpMAGA 1 points 4 days ago DGAF.  End the fiulibuster. permalink award report block reply\ngezadreamsheets2 1 points 3 days ago And I’m sure all those fuckers are still getting paid permalink award report block reply\ndres3 1 points 4 days ago Democrats are welcomed to go ahead and be refeshed and all that mess. Granted they would be giving up their vote and make it easier for Rs, but Democrats clearly need all the rest for the days ahead. permalink award report block reply\nanotherrandomname 1 points 4 days ago Anything to prevent Trump getting recess appointments. permalink award report block reply\nConfusedAngryArmed 1 points 4 days ago AKA, he's going to keep the government in session until Republicans give in to the Democrats' demands. The mistake here is underestimating the zealotry of the Left. permalink award report block reply\nraptormissle 0 points 4 days ago You got to know when to fold them. Know when to fold them. permalink award report block reply\nthe_new_one 3 points 4 days ago Comment removed upon the user being banned. permalink award report block reply"}