{"id": "8176890", "contents": "1191 🚨BREAKING: Black Jeep gunman FIRES at Border Patrol in Little Village raid – 3K+ illegals BUSTED already. No hits, but mobs HURL bricks & paint cans at feds in pure ANARCHY! posted 4 days ago by SuperHonkey 109 comments award share report block ⁿᵉʷˢ Trump pulse @pulse_trump • 4d 🚨 CHICAGO BLOODBATH: Gunman UNLOADS on ICE Heroes – Sanctuary Savages Strike Back! 🚨BREAKING: Black Jeep gunman FIRES at Border Patrol in Little Village raid – 3K+ illegals BUSTED already. No hits, but mobs HURL bricks & paint cans at feds in pure ANARCHY! Pritzker &\n109 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style deleted 110 points 4 days ago IncredibleMrE1 70 points 4 days ago Long overdue. Rendering aid to the enemy used to be a crime. permalink parent award report block reply War_Hamster 16 points 4 days ago But there's obviously no invasion. permalink parent award report block reply Lady_MaGa 11 points 4 days ago WEF sure wants a civil war on US soil. permalink parent award report block reply HeavyMetalPatriot 7 points 4 days ago Their terms are acceptable. permalink parent award report block reply AlmostFullyDilated 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply DeepStateParasite 12 points 4 days ago Threatening agents, throwing bricks and cans (deadly weapons), and then aiding and abetting shooters - yeah, not even a shame if they get shot. It's self defense. The ridiculous part is that they haven't responded forcefully yet. permalink parent award report block reply MastaJoda 2 points 4 days ago People throwing bricks should be shot on sight by snipers. Then everyone will see what a .30-06 really does to the human body. permalink parent award report block reply PoohBearBalloon 1 points 3 days ago Yup permalink parent award report block reply BlackPilledMAGA 21 points 4 days ago I agree. Nothing wrong with those optics,  America voted for 100% removal of all illegal aliens. Go peacefully or go in a box. permalink parent award report block reply deleted 17 points 4 days ago ShitFromShinola -9 points 4 days ago This is probably why you went on a watch list instead of the interview pile when you submitted your application to ICE. permalink parent award report block reply NoStepNovember 6 points 4 days ago This is why you are a faggot that doesn't belong here. And by here I mean, the US. Go back to whatever shithole country you came from and try to stop being a faggot. Times up. permalink parent award report block reply ShitFromShinola -3 points 4 days ago I'm Scots-Irish you sniveling faggot and was born on an Air Force base in Kansas where my father was stationed as a pilot. I am an Army veteran myself. How about you, pussyboy? permalink parent award report block reply view 7 more comments... KernalMustard 1 points 4 days ago Hell he wants to behead me. Might be time to send that death threat he gave me to the proper people permalink parent award report block reply ShitFromShinola -1 points 4 days ago You misunderstood. What I said was that when you were working at the Glory Hole in the mens room during the rap concert- a few of the brothers were talking about how you be given' head . Easy enough mistake to make for a low IQ dolt such as yourself. Sorry for the confusion. permalink parent award report block reply deleted 1 points 4 days ago HeavyMetalPatriot 2 points 4 days ago So...you don't want to work for free? permalink parent award report block reply ShitFromShinola -1 points 4 days ago Huh.... I thought everyone here believed they have soft, cushy, do-nothing jobs? permalink parent award report block reply MasterChief08 4 points 4 days ago 💯 permalink parent award report block reply Chickensaurus 2 points 4 days ago Everything tbe left does to ICE, patriots should be allowed to do to ATF. permalink parent award report block reply load 4 more comments... TheRedPilledArtist 57 points 4 days ago Let's maybe swap out the paint guns and rubber bullets for real ones. These aren't \"peaceful protestors.\" These are homicidal terrorists trying to kill you. permalink award report block reply SuperHonkey OP 17 points 4 days ago ☝🏻🫩 permalink parent award report block reply Bramage 44 points 4 days ago Time for the Feds to Open fire. permalink award report block reply roarkh1777 9 points 4 days ago I don’t understand why every fucker says “allegedly” in a report. He shot or didn’t shoot? Fuck allegedly. Pussy language permalink parent award report block reply Lady_MaGa 5 points 4 days ago It's easier to say what you want using allegedly than to insure future lawsuits you know they'll file. permalink parent award report block reply TrumpAndGodWin -8 points 4 days ago Optics prevent that when Democrats and globalists want to start a civil war and use that and alleged foreign involvement as plausible deniability for releasing bioweapons, cyberattacks, etc that could kill more than fifty percent of the population. permalink parent award report block reply FusionBlack 14 points 4 days ago It maybe time to over look those optics and do the right thing. They will kill us regardless. permalink parent award report block reply TrumpAndGodWin -1 points 4 days ago The right thing is doing it the right way to reduce the inevitable casualties when fighting evil. It's not about looking good, it's defeating the enemy while avoiding a pyrrhic victory. permalink parent award report block reply FusionBlack 3 points 4 days ago I don't think Black Jack Pershing would agree with that statement. permalink parent award report block reply permissible_missile 0 points 4 days ago Optics It's not about looking good These shills can't even keep it together for a single thread anymore. I demand higher quality operators. permalink parent award report block reply view 1 more comments... papa_newguineapig 0 points 4 days ago They WANT Hitler, so lets fucking give it to them. Enough is enough. These people insane leftists, like Muslims, are INCOMPATIBLE with HUMAN EXISTENCE. END.THEM. permalink parent award report block reply ShitFromShinola -3 points 4 days ago Have fun at your war crimes trial, Adolph! Why not just send them back to Buttfuckistan instead? permalink parent award report block reply papa_newguineapig 1 points 4 days ago Why? So they just come back and do this again in 50 years? No thanks. permalink parent award report block reply PoleWatcher 22 points 4 days ago If you ask me ICE is WAY too nice. permalink award report block reply ForgottenUsername 2 points 4 days ago There no need for a manhunt if you turn the car into swiss cheese permalink parent award report block reply henri_derelicte 18 points 4 days ago It’s time to return fire. They were brought into court over the use of tear gas. And unsurprisingly, the Obama judge determined immigration agents were “lying” about their side of the story. If we can win the battle in Chicago, we will defeat the Democrats nationwide permalink award report block reply CovfefeVideo 11 points 4 days ago This is like training for Dearborn. permalink award report block reply ckover9000 8 points 4 days ago BLOODBATH!!!! where no one was shot. permalink award report block reply cuckerberg2020 3 points 4 days ago You actually think Leftards that want to ban the 2a know how to aim? permalink parent award report block reply cptkloss5 8 points 4 days ago is the gunman black or the jeep...or both? permalink award report block reply ParmesanCartel -1 points 4 days ago Nigception permalink parent award report block reply SuperHonkey OP 3 points 4 days ago 🤣 permalink parent award report block reply SuperHonkey OP 8 points 4 days ago 4 stickies!! I'm definitely gonna play the lotto 🤣 permalink award report block reply cyberwar 7 points 4 days ago declare the demonrat party a terrorist organization permalink award report block reply SuperHonkey OP 1 points 4 days ago ☝🏻🫩 permalink parent award report block reply MasterChief08 7 points 4 days ago Fuck the left. Fuck Democrats. This is a fucking war and we're losing because our BITCH leaders are cowards. You have control of the military. 80% of cops voted for Trump. Wtf are you doing? permalink award report block reply nolefthandshakes 3 points 4 days ago playing the part. enjoy the show. it’s never been more apparent we are not represented and the restoration of America is not happening. hell, our birth rates are already past the point of no return along with many other countries. permalink parent award report block reply Easzq8 6 points 4 days ago Remember kiddies, they call you “Nazi” so that they can kill you. permalink award report block reply MasterChief08 6 points 4 days ago Give us immunity and we can solve this problem in 6 months.. permalink award report block reply SuperHonkey OP 4 points 4 days ago 6 weeks permalink parent award report block reply ThurstonHowell4th 1 points 4 days ago Six boxes of ammo permalink parent award report block reply Smooth 5 points 4 days ago Insurrection act NOW permalink award report block reply Quiznos585 4 points 4 days ago Breaking: Federal judge rules ICE has no authority to arrest shooter. permalink award report block reply onesummerdream 4 points 4 days ago Whatever these men are being paid, it ain’t enough. permalink award report block reply TheJakeFroggy 4 points 4 days ago I hope this gets shown to Trump and it should send him the message to just invoke the Insurrection Act. permalink award report block reply SuperHonkey OP 2 points 4 days ago It's an invasion, and needs to be treated as such permalink parent award report block reply hatredcopter 3 points 4 days ago Nice pajamas and crocs, lmfao permalink award report block reply SuperHonkey OP 1 points 4 days ago ikr! Pick my vegetables my ass! permalink parent award report block reply Trump2020or4eva 3 points 4 days ago Is now the time? When is enough enough holy shit permalink award report block reply Sparks1017 3 points 4 days ago Time for our side to  start using real bullets permalink award report block reply AlvinOfTheTrumpmunks 3 points 4 days ago The Feds also need to be busting these leftist posters online calling for violence against federal officers. permalink award report block reply HankScorpio 3 points 4 days ago The sound when he throws her into the car is fucking sweet. permalink award report block reply Twitter 3 points 4 days ago the interference and the media emboldening these freaks needs some hard justice delivered permalink award report block reply AgnesDomini 3 points 4 days ago Holy smokes! I've walked those streets hundreds of times. Honestly,  I'm surprised the numbers aren't higher. Little Village is practically all illegal aliens. permalink award report block reply Smurfection 3 points 4 days ago Ya know what you call illegal alien men in camo who are firing weapons at border patrol/ICE during a raid?  A battle.   Battles happen in war.   We are at war with the illegal alien invaders.   Those who draw weapons need to go to Gitmo as enemy combatants. permalink award report block reply Fuck_commies_2024 3 points 4 days ago Time to start sprayin’ niggas. permalink award report block reply knnbccb 2 points 4 days ago Still chickenshit about 'muh optics'? Use lethal force. permalink award report block reply MindPhantom109 2 points 4 days ago Time to open fire on the commies and the open border scum. permalink award report block reply BidensBodyDouble 2 points 4 days ago Who the fuck bothers to strap up but doesn't bother to change out of their pajamas and slippers permalink award report block reply SuperHonkey OP 1 points 4 days ago Retarded leftists that are unemployed permalink parent award report block reply BidensBodyDouble 2 points 4 days ago Fucking batshit to me to be worried enough you gotta defend your life but not wear shoes permalink parent award report block reply SaltyCamaro 2 points 4 days ago People who attack law enforcement should be shot.  Problem solved. permalink award report block reply genericamerican69 2 points 4 days ago Can we just get this civil/revolutionary/world war over with already. I got shit to do permalink award report block reply Haiti_kid 1 points 4 days ago All I see is chad white dudes just throwing weak illegals like rag dolls. permalink award report block reply GBA4ever 2 points 4 days ago She was opening the car door so the illegal could escape. FAFO permalink parent award report block reply utfanx2 1 points 4 days ago Flak is heaviest over the target. Double the effort. permalink award report block reply Choppermagic 1 points 4 days ago shoot them.\nEspecially the cars that block them.  Send the message permalink award report block reply PatriotSkorzeny 1 points 4 days ago lol camouflage. 🤣🤣 permalink award report block reply AlmostFullyDilated 1 points 4 days ago where is the shooting? permalink award report block reply AgnesDomini 1 points 4 days ago Chicago's Southside.  Little Village is the Mexican neighborhood where almost everyone there is an illegal alien. I married a man from Mexico, and I am a native Chicagoan,  been there MANY times to visit hubby's relatives. (He's legal now, BTW. Was here when Reagan granted amnesty, beforeIeven met him.) permalink parent award report block reply Bruno 1 points 4 days ago Is this what democracy looks like? permalink award report block reply raptormissle 1 points 4 days ago These are Antifa terrorists. They need to feel the consequences of live ammunition. permalink award report block reply Double_D 1 points 4 days ago Bloodbath? Did anyone even get hit? permalink award report block reply terribletwos 1 points 4 days ago That's not protesting. permalink award report block reply billybaldwin2 1 points 4 days ago Gang or cartel raid? Guess they want to see the full force of the American government. permalink award report block reply theDialecticalPlaya 1 points 4 days ago I don't see anything wrong at all. I still think they're not using enough force. permalink award report block reply RomeIsFalling 1 points 4 days ago And X banned me for a month for saying we should authorize lethal force to be used by ICE agents. Fucking Elon needs to get his bitch under control. permalink award report block reply SuperHonkey OP 2 points 4 days ago They're already authorized to use lethal force, they're federal officers. What need to change are the rules of engagement. permalink parent award report block reply TurboMAGA 1 points 4 days ago Eliminate them permalink award report block reply RoosterRaiser 1 points 4 days ago I'm only shocked it took this long to happen. What happens if ICE fires back? Are they allowed to? Same the the National Guard (when they eventually are deployed) - are they carrying live rounds or are we going to let them be murdered? permalink award report block reply Fren20 1 points 4 days ago Oh but how the dumb white woman want them,do they really believe they contribute to our country 😂😂😂 permalink award report block reply SuperHonkey OP 2 points 4 days ago They believe whatever the TV tells them permalink parent award report block reply POTUS_DonnieJ 0 points 4 days ago Rubio and Homan have been carrying the administration. Bondi and Noem have been too concerned with their own image, which is resulting in shit like this. permalink award report block reply Txiribiton 0 points 4 days ago Consequences of not arresting anyone and not being tough, it should escalate more and more. permalink award report block reply\ndeleted 110 points 4 days ago IncredibleMrE1 70 points 4 days ago Long overdue. Rendering aid to the enemy used to be a crime. permalink parent award report block reply War_Hamster 16 points 4 days ago But there's obviously no invasion. permalink parent award report block reply Lady_MaGa 11 points 4 days ago WEF sure wants a civil war on US soil. permalink parent award report block reply HeavyMetalPatriot 7 points 4 days ago Their terms are acceptable. permalink parent award report block reply AlmostFullyDilated 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply DeepStateParasite 12 points 4 days ago Threatening agents, throwing bricks and cans (deadly weapons), and then aiding and abetting shooters - yeah, not even a shame if they get shot. It's self defense. The ridiculous part is that they haven't responded forcefully yet. permalink parent award report block reply MastaJoda 2 points 4 days ago People throwing bricks should be shot on sight by snipers. Then everyone will see what a .30-06 really does to the human body. permalink parent award report block reply PoohBearBalloon 1 points 3 days ago Yup permalink parent award report block reply BlackPilledMAGA 21 points 4 days ago I agree. Nothing wrong with those optics,  America voted for 100% removal of all illegal aliens. Go peacefully or go in a box. permalink parent award report block reply deleted 17 points 4 days ago ShitFromShinola -9 points 4 days ago This is probably why you went on a watch list instead of the interview pile when you submitted your application to ICE. permalink parent award report block reply NoStepNovember 6 points 4 days ago This is why you are a faggot that doesn't belong here. And by here I mean, the US. Go back to whatever shithole country you came from and try to stop being a faggot. Times up. permalink parent award report block reply ShitFromShinola -3 points 4 days ago I'm Scots-Irish you sniveling faggot and was born on an Air Force base in Kansas where my father was stationed as a pilot. I am an Army veteran myself. How about you, pussyboy? permalink parent award report block reply view 7 more comments... KernalMustard 1 points 4 days ago Hell he wants to behead me. Might be time to send that death threat he gave me to the proper people permalink parent award report block reply ShitFromShinola -1 points 4 days ago You misunderstood. What I said was that when you were working at the Glory Hole in the mens room during the rap concert- a few of the brothers were talking about how you be given' head . Easy enough mistake to make for a low IQ dolt such as yourself. Sorry for the confusion. permalink parent award report block reply deleted 1 points 4 days ago HeavyMetalPatriot 2 points 4 days ago So...you don't want to work for free? permalink parent award report block reply ShitFromShinola -1 points 4 days ago Huh.... I thought everyone here believed they have soft, cushy, do-nothing jobs? permalink parent award report block reply MasterChief08 4 points 4 days ago 💯 permalink parent award report block reply Chickensaurus 2 points 4 days ago Everything tbe left does to ICE, patriots should be allowed to do to ATF. permalink parent award report block reply load 4 more comments...\nIncredibleMrE1 70 points 4 days ago Long overdue. Rendering aid to the enemy used to be a crime. permalink parent award report block reply War_Hamster 16 points 4 days ago But there's obviously no invasion. permalink parent award report block reply Lady_MaGa 11 points 4 days ago WEF sure wants a civil war on US soil. permalink parent award report block reply HeavyMetalPatriot 7 points 4 days ago Their terms are acceptable. permalink parent award report block reply AlmostFullyDilated 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply DeepStateParasite 12 points 4 days ago Threatening agents, throwing bricks and cans (deadly weapons), and then aiding and abetting shooters - yeah, not even a shame if they get shot. It's self defense. The ridiculous part is that they haven't responded forcefully yet. permalink parent award report block reply MastaJoda 2 points 4 days ago People throwing bricks should be shot on sight by snipers. Then everyone will see what a .30-06 really does to the human body. permalink parent award report block reply PoohBearBalloon 1 points 3 days ago Yup permalink parent award report block reply\nWar_Hamster 16 points 4 days ago But there's obviously no invasion. permalink parent award report block reply Lady_MaGa 11 points 4 days ago WEF sure wants a civil war on US soil. permalink parent award report block reply HeavyMetalPatriot 7 points 4 days ago Their terms are acceptable. permalink parent award report block reply AlmostFullyDilated 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply\nLady_MaGa 11 points 4 days ago WEF sure wants a civil war on US soil. permalink parent award report block reply HeavyMetalPatriot 7 points 4 days ago Their terms are acceptable. permalink parent award report block reply AlmostFullyDilated 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply\nHeavyMetalPatriot 7 points 4 days ago Their terms are acceptable. permalink parent award report block reply\nAlmostFullyDilated 1 points 4 days ago Comment removed by community filter. permalink parent award report block reply\nDeepStateParasite 12 points 4 days ago Threatening agents, throwing bricks and cans (deadly weapons), and then aiding and abetting shooters - yeah, not even a shame if they get shot. It's self defense. The ridiculous part is that they haven't responded forcefully yet. permalink parent award report block reply\nMastaJoda 2 points 4 days ago People throwing bricks should be shot on sight by snipers. Then everyone will see what a .30-06 really does to the human body. permalink parent award report block reply PoohBearBalloon 1 points 3 days ago Yup permalink parent award report block reply\nPoohBearBalloon 1 points 3 days ago Yup permalink parent award report block reply\nBlackPilledMAGA 21 points 4 days ago I agree. Nothing wrong with those optics,  America voted for 100% removal of all illegal aliens. Go peacefully or go in a box. permalink parent award report block reply\ndeleted 17 points 4 days ago ShitFromShinola -9 points 4 days ago This is probably why you went on a watch list instead of the interview pile when you submitted your application to ICE. permalink parent award report block reply NoStepNovember 6 points 4 days ago This is why you are a faggot that doesn't belong here. And by here I mean, the US. Go back to whatever shithole country you came from and try to stop being a faggot. Times up. permalink parent award report block reply ShitFromShinola -3 points 4 days ago I'm Scots-Irish you sniveling faggot and was born on an Air Force base in Kansas where my father was stationed as a pilot. I am an Army veteran myself. How about you, pussyboy? permalink parent award report block reply view 7 more comments... KernalMustard 1 points 4 days ago Hell he wants to behead me. Might be time to send that death threat he gave me to the proper people permalink parent award report block reply ShitFromShinola -1 points 4 days ago You misunderstood. What I said was that when you were working at the Glory Hole in the mens room during the rap concert- a few of the brothers were talking about how you be given' head . Easy enough mistake to make for a low IQ dolt such as yourself. Sorry for the confusion. permalink parent award report block reply deleted 1 points 4 days ago HeavyMetalPatriot 2 points 4 days ago So...you don't want to work for free? permalink parent award report block reply ShitFromShinola -1 points 4 days ago Huh.... I thought everyone here believed they have soft, cushy, do-nothing jobs? permalink parent award report block reply\nShitFromShinola -9 points 4 days ago This is probably why you went on a watch list instead of the interview pile when you submitted your application to ICE. permalink parent award report block reply NoStepNovember 6 points 4 days ago This is why you are a faggot that doesn't belong here. And by here I mean, the US. Go back to whatever shithole country you came from and try to stop being a faggot. Times up. permalink parent award report block reply ShitFromShinola -3 points 4 days ago I'm Scots-Irish you sniveling faggot and was born on an Air Force base in Kansas where my father was stationed as a pilot. I am an Army veteran myself. How about you, pussyboy? permalink parent award report block reply view 7 more comments... KernalMustard 1 points 4 days ago Hell he wants to behead me. Might be time to send that death threat he gave me to the proper people permalink parent award report block reply ShitFromShinola -1 points 4 days ago You misunderstood. What I said was that when you were working at the Glory Hole in the mens room during the rap concert- a few of the brothers were talking about how you be given' head . Easy enough mistake to make for a low IQ dolt such as yourself. Sorry for the confusion. permalink parent award report block reply deleted 1 points 4 days ago HeavyMetalPatriot 2 points 4 days ago So...you don't want to work for free? permalink parent award report block reply ShitFromShinola -1 points 4 days ago Huh.... I thought everyone here believed they have soft, cushy, do-nothing jobs? permalink parent award report block reply\nNoStepNovember 6 points 4 days ago This is why you are a faggot that doesn't belong here. And by here I mean, the US. Go back to whatever shithole country you came from and try to stop being a faggot. Times up. permalink parent award report block reply ShitFromShinola -3 points 4 days ago I'm Scots-Irish you sniveling faggot and was born on an Air Force base in Kansas where my father was stationed as a pilot. I am an Army veteran myself. How about you, pussyboy? permalink parent award report block reply view 7 more comments...\nShitFromShinola -3 points 4 days ago I'm Scots-Irish you sniveling faggot and was born on an Air Force base in Kansas where my father was stationed as a pilot. I am an Army veteran myself. How about you, pussyboy? permalink parent award report block reply view 7 more comments...\nKernalMustard 1 points 4 days ago Hell he wants to behead me. Might be time to send that death threat he gave me to the proper people permalink parent award report block reply ShitFromShinola -1 points 4 days ago You misunderstood. What I said was that when you were working at the Glory Hole in the mens room during the rap concert- a few of the brothers were talking about how you be given' head . Easy enough mistake to make for a low IQ dolt such as yourself. Sorry for the confusion. permalink parent award report block reply\nShitFromShinola -1 points 4 days ago You misunderstood. What I said was that when you were working at the Glory Hole in the mens room during the rap concert- a few of the brothers were talking about how you be given' head . Easy enough mistake to make for a low IQ dolt such as yourself. Sorry for the confusion. permalink parent award report block reply\ndeleted 1 points 4 days ago HeavyMetalPatriot 2 points 4 days ago So...you don't want to work for free? permalink parent award report block reply ShitFromShinola -1 points 4 days ago Huh.... I thought everyone here believed they have soft, cushy, do-nothing jobs? permalink parent award report block reply\nHeavyMetalPatriot 2 points 4 days ago So...you don't want to work for free? permalink parent award report block reply\nShitFromShinola -1 points 4 days ago Huh.... I thought everyone here believed they have soft, cushy, do-nothing jobs? permalink parent award report block reply\nMasterChief08 4 points 4 days ago 💯 permalink parent award report block reply\nChickensaurus 2 points 4 days ago Everything tbe left does to ICE, patriots should be allowed to do to ATF. permalink parent award report block reply\nTheRedPilledArtist 57 points 4 days ago Let's maybe swap out the paint guns and rubber bullets for real ones. These aren't \"peaceful protestors.\" These are homicidal terrorists trying to kill you. permalink award report block reply SuperHonkey OP 17 points 4 days ago ☝🏻🫩 permalink parent award report block reply\nSuperHonkey OP 17 points 4 days ago ☝🏻🫩 permalink parent award report block reply\nBramage 44 points 4 days ago Time for the Feds to Open fire. permalink award report block reply roarkh1777 9 points 4 days ago I don’t understand why every fucker says “allegedly” in a report. He shot or didn’t shoot? Fuck allegedly. Pussy language permalink parent award report block reply Lady_MaGa 5 points 4 days ago It's easier to say what you want using allegedly than to insure future lawsuits you know they'll file. permalink parent award report block reply TrumpAndGodWin -8 points 4 days ago Optics prevent that when Democrats and globalists want to start a civil war and use that and alleged foreign involvement as plausible deniability for releasing bioweapons, cyberattacks, etc that could kill more than fifty percent of the population. permalink parent award report block reply FusionBlack 14 points 4 days ago It maybe time to over look those optics and do the right thing. They will kill us regardless. permalink parent award report block reply TrumpAndGodWin -1 points 4 days ago The right thing is doing it the right way to reduce the inevitable casualties when fighting evil. It's not about looking good, it's defeating the enemy while avoiding a pyrrhic victory. permalink parent award report block reply FusionBlack 3 points 4 days ago I don't think Black Jack Pershing would agree with that statement. permalink parent award report block reply permissible_missile 0 points 4 days ago Optics It's not about looking good These shills can't even keep it together for a single thread anymore. I demand higher quality operators. permalink parent award report block reply view 1 more comments... papa_newguineapig 0 points 4 days ago They WANT Hitler, so lets fucking give it to them. Enough is enough. These people insane leftists, like Muslims, are INCOMPATIBLE with HUMAN EXISTENCE. END.THEM. permalink parent award report block reply ShitFromShinola -3 points 4 days ago Have fun at your war crimes trial, Adolph! Why not just send them back to Buttfuckistan instead? permalink parent award report block reply papa_newguineapig 1 points 4 days ago Why? So they just come back and do this again in 50 years? No thanks. permalink parent award report block reply\nroarkh1777 9 points 4 days ago I don’t understand why every fucker says “allegedly” in a report. He shot or didn’t shoot? Fuck allegedly. Pussy language permalink parent award report block reply Lady_MaGa 5 points 4 days ago It's easier to say what you want using allegedly than to insure future lawsuits you know they'll file. permalink parent award report block reply\nLady_MaGa 5 points 4 days ago It's easier to say what you want using allegedly than to insure future lawsuits you know they'll file. permalink parent award report block reply\nTrumpAndGodWin -8 points 4 days ago Optics prevent that when Democrats and globalists want to start a civil war and use that and alleged foreign involvement as plausible deniability for releasing bioweapons, cyberattacks, etc that could kill more than fifty percent of the population. permalink parent award report block reply FusionBlack 14 points 4 days ago It maybe time to over look those optics and do the right thing. They will kill us regardless. permalink parent award report block reply TrumpAndGodWin -1 points 4 days ago The right thing is doing it the right way to reduce the inevitable casualties when fighting evil. It's not about looking good, it's defeating the enemy while avoiding a pyrrhic victory. permalink parent award report block reply FusionBlack 3 points 4 days ago I don't think Black Jack Pershing would agree with that statement. permalink parent award report block reply permissible_missile 0 points 4 days ago Optics It's not about looking good These shills can't even keep it together for a single thread anymore. I demand higher quality operators. permalink parent award report block reply view 1 more comments... papa_newguineapig 0 points 4 days ago They WANT Hitler, so lets fucking give it to them. Enough is enough. These people insane leftists, like Muslims, are INCOMPATIBLE with HUMAN EXISTENCE. END.THEM. permalink parent award report block reply ShitFromShinola -3 points 4 days ago Have fun at your war crimes trial, Adolph! Why not just send them back to Buttfuckistan instead? permalink parent award report block reply papa_newguineapig 1 points 4 days ago Why? So they just come back and do this again in 50 years? No thanks. permalink parent award report block reply\nFusionBlack 14 points 4 days ago It maybe time to over look those optics and do the right thing. They will kill us regardless. permalink parent award report block reply TrumpAndGodWin -1 points 4 days ago The right thing is doing it the right way to reduce the inevitable casualties when fighting evil. It's not about looking good, it's defeating the enemy while avoiding a pyrrhic victory. permalink parent award report block reply FusionBlack 3 points 4 days ago I don't think Black Jack Pershing would agree with that statement. permalink parent award report block reply permissible_missile 0 points 4 days ago Optics It's not about looking good These shills can't even keep it together for a single thread anymore. I demand higher quality operators. permalink parent award report block reply view 1 more comments...\nTrumpAndGodWin -1 points 4 days ago The right thing is doing it the right way to reduce the inevitable casualties when fighting evil. It's not about looking good, it's defeating the enemy while avoiding a pyrrhic victory. permalink parent award report block reply FusionBlack 3 points 4 days ago I don't think Black Jack Pershing would agree with that statement. permalink parent award report block reply permissible_missile 0 points 4 days ago Optics It's not about looking good These shills can't even keep it together for a single thread anymore. I demand higher quality operators. permalink parent award report block reply view 1 more comments...\nFusionBlack 3 points 4 days ago I don't think Black Jack Pershing would agree with that statement. permalink parent award report block reply\npermissible_missile 0 points 4 days ago Optics It's not about looking good These shills can't even keep it together for a single thread anymore. I demand higher quality operators. permalink parent award report block reply view 1 more comments...\npapa_newguineapig 0 points 4 days ago They WANT Hitler, so lets fucking give it to them. Enough is enough. These people insane leftists, like Muslims, are INCOMPATIBLE with HUMAN EXISTENCE. END.THEM. permalink parent award report block reply ShitFromShinola -3 points 4 days ago Have fun at your war crimes trial, Adolph! Why not just send them back to Buttfuckistan instead? permalink parent award report block reply papa_newguineapig 1 points 4 days ago Why? So they just come back and do this again in 50 years? No thanks. permalink parent award report block reply\nShitFromShinola -3 points 4 days ago Have fun at your war crimes trial, Adolph! Why not just send them back to Buttfuckistan instead? permalink parent award report block reply papa_newguineapig 1 points 4 days ago Why? So they just come back and do this again in 50 years? No thanks. permalink parent award report block reply\npapa_newguineapig 1 points 4 days ago Why? So they just come back and do this again in 50 years? No thanks. permalink parent award report block reply\nPoleWatcher 22 points 4 days ago If you ask me ICE is WAY too nice. permalink award report block reply ForgottenUsername 2 points 4 days ago There no need for a manhunt if you turn the car into swiss cheese permalink parent award report block reply\nForgottenUsername 2 points 4 days ago There no need for a manhunt if you turn the car into swiss cheese permalink parent award report block reply\nhenri_derelicte 18 points 4 days ago It’s time to return fire. They were brought into court over the use of tear gas. And unsurprisingly, the Obama judge determined immigration agents were “lying” about their side of the story. If we can win the battle in Chicago, we will defeat the Democrats nationwide permalink award report block reply\nCovfefeVideo 11 points 4 days ago This is like training for Dearborn. permalink award report block reply\nckover9000 8 points 4 days ago BLOODBATH!!!! where no one was shot. permalink award report block reply cuckerberg2020 3 points 4 days ago You actually think Leftards that want to ban the 2a know how to aim? permalink parent award report block reply\ncuckerberg2020 3 points 4 days ago You actually think Leftards that want to ban the 2a know how to aim? permalink parent award report block reply\ncptkloss5 8 points 4 days ago is the gunman black or the jeep...or both? permalink award report block reply ParmesanCartel -1 points 4 days ago Nigception permalink parent award report block reply SuperHonkey OP 3 points 4 days ago 🤣 permalink parent award report block reply\nParmesanCartel -1 points 4 days ago Nigception permalink parent award report block reply SuperHonkey OP 3 points 4 days ago 🤣 permalink parent award report block reply\nSuperHonkey OP 3 points 4 days ago 🤣 permalink parent award report block reply\nSuperHonkey OP 8 points 4 days ago 4 stickies!! I'm definitely gonna play the lotto 🤣 permalink award report block reply\ncyberwar 7 points 4 days ago declare the demonrat party a terrorist organization permalink award report block reply SuperHonkey OP 1 points 4 days ago ☝🏻🫩 permalink parent award report block reply\nSuperHonkey OP 1 points 4 days ago ☝🏻🫩 permalink parent award report block reply\nMasterChief08 7 points 4 days ago Fuck the left. Fuck Democrats. This is a fucking war and we're losing because our BITCH leaders are cowards. You have control of the military. 80% of cops voted for Trump. Wtf are you doing? permalink award report block reply nolefthandshakes 3 points 4 days ago playing the part. enjoy the show. it’s never been more apparent we are not represented and the restoration of America is not happening. hell, our birth rates are already past the point of no return along with many other countries. permalink parent award report block reply\nnolefthandshakes 3 points 4 days ago playing the part. enjoy the show. it’s never been more apparent we are not represented and the restoration of America is not happening. hell, our birth rates are already past the point of no return along with many other countries. permalink parent award report block reply\nEaszq8 6 points 4 days ago Remember kiddies, they call you “Nazi” so that they can kill you. permalink award report block reply\nMasterChief08 6 points 4 days ago Give us immunity and we can solve this problem in 6 months.. permalink award report block reply SuperHonkey OP 4 points 4 days ago 6 weeks permalink parent award report block reply ThurstonHowell4th 1 points 4 days ago Six boxes of ammo permalink parent award report block reply\nSuperHonkey OP 4 points 4 days ago 6 weeks permalink parent award report block reply ThurstonHowell4th 1 points 4 days ago Six boxes of ammo permalink parent award report block reply\nThurstonHowell4th 1 points 4 days ago Six boxes of ammo permalink parent award report block reply\nSmooth 5 points 4 days ago Insurrection act NOW permalink award report block reply\nQuiznos585 4 points 4 days ago Breaking: Federal judge rules ICE has no authority to arrest shooter. permalink award report block reply\nonesummerdream 4 points 4 days ago Whatever these men are being paid, it ain’t enough. permalink award report block reply\nTheJakeFroggy 4 points 4 days ago I hope this gets shown to Trump and it should send him the message to just invoke the Insurrection Act. permalink award report block reply SuperHonkey OP 2 points 4 days ago It's an invasion, and needs to be treated as such permalink parent award report block reply\nSuperHonkey OP 2 points 4 days ago It's an invasion, and needs to be treated as such permalink parent award report block reply\nhatredcopter 3 points 4 days ago Nice pajamas and crocs, lmfao permalink award report block reply SuperHonkey OP 1 points 4 days ago ikr! Pick my vegetables my ass! permalink parent award report block reply\nSuperHonkey OP 1 points 4 days ago ikr! Pick my vegetables my ass! permalink parent award report block reply\nTrump2020or4eva 3 points 4 days ago Is now the time? When is enough enough holy shit permalink award report block reply\nSparks1017 3 points 4 days ago Time for our side to  start using real bullets permalink award report block reply\nAlvinOfTheTrumpmunks 3 points 4 days ago The Feds also need to be busting these leftist posters online calling for violence against federal officers. permalink award report block reply\nHankScorpio 3 points 4 days ago The sound when he throws her into the car is fucking sweet. permalink award report block reply\nTwitter 3 points 4 days ago the interference and the media emboldening these freaks needs some hard justice delivered permalink award report block reply\nAgnesDomini 3 points 4 days ago Holy smokes! I've walked those streets hundreds of times. Honestly,  I'm surprised the numbers aren't higher. Little Village is practically all illegal aliens. permalink award report block reply\nSmurfection 3 points 4 days ago Ya know what you call illegal alien men in camo who are firing weapons at border patrol/ICE during a raid?  A battle.   Battles happen in war.   We are at war with the illegal alien invaders.   Those who draw weapons need to go to Gitmo as enemy combatants. permalink award report block reply\nFuck_commies_2024 3 points 4 days ago Time to start sprayin’ niggas. permalink award report block reply\nknnbccb 2 points 4 days ago Still chickenshit about 'muh optics'? Use lethal force. permalink award report block reply\nMindPhantom109 2 points 4 days ago Time to open fire on the commies and the open border scum. permalink award report block reply\nBidensBodyDouble 2 points 4 days ago Who the fuck bothers to strap up but doesn't bother to change out of their pajamas and slippers permalink award report block reply SuperHonkey OP 1 points 4 days ago Retarded leftists that are unemployed permalink parent award report block reply BidensBodyDouble 2 points 4 days ago Fucking batshit to me to be worried enough you gotta defend your life but not wear shoes permalink parent award report block reply\nSuperHonkey OP 1 points 4 days ago Retarded leftists that are unemployed permalink parent award report block reply BidensBodyDouble 2 points 4 days ago Fucking batshit to me to be worried enough you gotta defend your life but not wear shoes permalink parent award report block reply\nBidensBodyDouble 2 points 4 days ago Fucking batshit to me to be worried enough you gotta defend your life but not wear shoes permalink parent award report block reply\nSaltyCamaro 2 points 4 days ago People who attack law enforcement should be shot.  Problem solved. permalink award report block reply\ngenericamerican69 2 points 4 days ago Can we just get this civil/revolutionary/world war over with already. I got shit to do permalink award report block reply\nHaiti_kid 1 points 4 days ago All I see is chad white dudes just throwing weak illegals like rag dolls. permalink award report block reply GBA4ever 2 points 4 days ago She was opening the car door so the illegal could escape. FAFO permalink parent award report block reply\nGBA4ever 2 points 4 days ago She was opening the car door so the illegal could escape. FAFO permalink parent award report block reply\nutfanx2 1 points 4 days ago Flak is heaviest over the target. Double the effort. permalink award report block reply\nChoppermagic 1 points 4 days ago shoot them.\nEspecially the cars that block them.  Send the message permalink award report block reply\nPatriotSkorzeny 1 points 4 days ago lol camouflage. 🤣🤣 permalink award report block reply\nAlmostFullyDilated 1 points 4 days ago where is the shooting? permalink award report block reply AgnesDomini 1 points 4 days ago Chicago's Southside.  Little Village is the Mexican neighborhood where almost everyone there is an illegal alien. I married a man from Mexico, and I am a native Chicagoan,  been there MANY times to visit hubby's relatives. (He's legal now, BTW. Was here when Reagan granted amnesty, beforeIeven met him.) permalink parent award report block reply\nAgnesDomini 1 points 4 days ago Chicago's Southside.  Little Village is the Mexican neighborhood where almost everyone there is an illegal alien. I married a man from Mexico, and I am a native Chicagoan,  been there MANY times to visit hubby's relatives. (He's legal now, BTW. Was here when Reagan granted amnesty, beforeIeven met him.) permalink parent award report block reply\nBruno 1 points 4 days ago Is this what democracy looks like? permalink award report block reply\nraptormissle 1 points 4 days ago These are Antifa terrorists. They need to feel the consequences of live ammunition. permalink award report block reply\nDouble_D 1 points 4 days ago Bloodbath? Did anyone even get hit? permalink award report block reply\nterribletwos 1 points 4 days ago That's not protesting. permalink award report block reply\nbillybaldwin2 1 points 4 days ago Gang or cartel raid? Guess they want to see the full force of the American government. permalink award report block reply\ntheDialecticalPlaya 1 points 4 days ago I don't see anything wrong at all. I still think they're not using enough force. permalink award report block reply\nRomeIsFalling 1 points 4 days ago And X banned me for a month for saying we should authorize lethal force to be used by ICE agents. Fucking Elon needs to get his bitch under control. permalink award report block reply SuperHonkey OP 2 points 4 days ago They're already authorized to use lethal force, they're federal officers. What need to change are the rules of engagement. permalink parent award report block reply\nSuperHonkey OP 2 points 4 days ago They're already authorized to use lethal force, they're federal officers. What need to change are the rules of engagement. permalink parent award report block reply\nTurboMAGA 1 points 4 days ago Eliminate them permalink award report block reply\nRoosterRaiser 1 points 4 days ago I'm only shocked it took this long to happen. What happens if ICE fires back? Are they allowed to? Same the the National Guard (when they eventually are deployed) - are they carrying live rounds or are we going to let them be murdered? permalink award report block reply\nFren20 1 points 4 days ago Oh but how the dumb white woman want them,do they really believe they contribute to our country 😂😂😂 permalink award report block reply SuperHonkey OP 2 points 4 days ago They believe whatever the TV tells them permalink parent award report block reply\nSuperHonkey OP 2 points 4 days ago They believe whatever the TV tells them permalink parent award report block reply\nPOTUS_DonnieJ 0 points 4 days ago Rubio and Homan have been carrying the administration. Bondi and Noem have been too concerned with their own image, which is resulting in shit like this. permalink award report block reply\nTxiribiton 0 points 4 days ago Consequences of not arresting anyone and not being tough, it should escalate more and more. permalink award report block reply"}