{"id": "8177096", "contents": "1423 No Longer posted 4 days ago by diogenesofthearch 38 comments award share download report block\n38 comments Sort by Top Top New Worst Old Save bigdickhangsright 30 points 4 days ago Omg his first fourteen words... permalink award report block reply guywholikesDjtof2024 14 points 4 days ago \"LOOK, FELLOW THEY/THEMS, TRUMP IS MAKING THE HITLER GESTURE1!1!1!1!11 AND THE BABY IS RAAAACISSST1!11!11 ABORT HIM NOW!!!!\" permalink parent award report block reply snoopy3210 -2 points 4 days ago 16 doesn’t fit your nazi sucking sound haha 😆 permalink parent award report block reply Glory-Unto-God 1 points 4 days ago I have seen absolutely 0 evidence of the last two words. permalink parent award report block reply RedStoneDeepState -4 points 4 days ago It's sixteen, neonazis are not even smart enough to count past 10 permalink parent award report block reply SimaYi 5 points 4 days ago Do you have a problem with securing a land and future for White children? permalink parent award report block reply RedStoneDeepState -4 points 4 days ago Considering I am married to an Asian woman, yes permalink parent award report block reply SpellingContable 2 points 4 days ago It will be delicious irony if it turns out that your wife is Japanese. permalink parent award report block reply view 2 more comments... bigdickhangsright 1 points 4 days ago 14 does not make someone a neo Nazi. Being a neo Nazi makes someone a neo Nazi. permalink parent award report block reply Mungo 1 points 4 days ago Or read cursive permalink parent award report block reply MedicallyReddit 18 points 4 days ago America first. No street shitters allowed permalink award report block reply keeman 7 points 4 days ago Also stop giving money and military support to foreign countries.  And that very much includes Israel. permalink parent award report block reply x79q3pb 1 points 3 days ago JIDF lurkers didn't like this comment one bit permalink parent award report block reply BeauHD 2 points 4 days ago A M E N permalink parent award report block reply 5DchessWatch 7 points 4 days ago Babby continued: For we are opposed around the world by a monolithic and ruthless conspiracy that relies primarily on covert means for expanding its sphere of influence--on infiltration instead of invasion, on subversion instead of elections, on intimidation instead of free choice, on guerrillas by night instead of armies by day. It is a system which has conscripted vast human and material resources into the building of a tightly knit, highly efficient machine that combines military, diplomatic, intelligence, economic, scientific and political operations. its preparations are concealed, not published. Its mistakes are buried, not headlined. Its dissenters are silenced, not praised. No expenditure is questioned, no rumor is printed, no secret is revealed. It conducts the Cold War, in short, with a war-time discipline no democracy would ever hope or wish to match. Nevertheless, every democracy recognizes the necessary restraints of national security-and the question remains whether those restraints need to be more strictly observed if we are to oppose this kind of attack as well as outright invasion. Damn, babby, you on FIRE!🔥🔥 permalink award report block reply Hanging_Chad 6 points 4 days ago based baby permalink award report block reply TheGreatWhiteNorth 3 points 4 days ago based AF baby permalink parent award report block reply BlueKentuckyGirl 5 points 4 days ago 🤠🦅🇺🇸🦅🍻 permalink award report block reply Coprolite 4 points 4 days ago 16 words permalink award report block reply chickeninoven 3 points 4 days ago How is based babby formed? permalink award report block reply patrioticwinning3 3 points 4 days ago So...maybe clean house at the DOJ and FBI so we can get the globohomos OUT of government and hold them accountable for their crimes? permalink award report block reply SimaYi 3 points 4 days ago Back when he had based speechwriters. permalink award report block reply MerlynTrump 2 points 4 days ago Great line permalink award report block reply RadicalCovfefe 2 points 4 days ago Atta boy permalink award report block reply Glory-Unto-God 2 points 4 days ago Meanwhile jeet Ohio governor sponsor permalink award report block reply Good_Behavior_Day 2 points 4 days ago Can't beat the classics. https://www.youtube.com/watch?v=UjZy2_wSuZg permalink award report block reply AlmostFullyDilated 1 points 4 days ago islam* ftfy op permalink award report block reply diogenesofthearch OP 1 points 4 days ago \"We will no longer surrender this Islam, or it's Islam, to the false song of globalism\"? permalink parent award report block reply AlmostFullyDilated 1 points 4 days ago what? permalink parent award report block reply diogenesofthearch OP 1 points 3 days ago I didn't see how >islam* fixed it. Frankly, I think it made it incomprehensible. permalink parent award report block reply Dontbeafraid 0 points 4 days ago But if youre jewish, we will gladly bend the knee and spread the cheeks permalink award report block reply Grumbledook 0 points 4 days ago Yeah like supporting other countries over our own. Like Israel permalink award report block reply Deportthemall23 14 points 4 days ago Comment removed upon the user being banned. permalink award report block reply Aquamine-Amarine 3 points 4 days ago It's never made sense to me that leftists (who claim to support women and gays) keep allying with Islamists (who stone and kill women and gays). I don't understand. Do they have brain damage? permalink parent award report block reply RedStoneDeepState -2 points 4 days ago No it isn't. permalink parent award report block reply Deportthemall23 7 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply Patriot5TN 2 points 4 days ago Yes this is correct permalink parent award report block reply HeavyMetalPatriot 1 points 4 days ago AKA, those of European blood. permalink parent award report block reply\nbigdickhangsright 30 points 4 days ago Omg his first fourteen words... permalink award report block reply guywholikesDjtof2024 14 points 4 days ago \"LOOK, FELLOW THEY/THEMS, TRUMP IS MAKING THE HITLER GESTURE1!1!1!1!11 AND THE BABY IS RAAAACISSST1!11!11 ABORT HIM NOW!!!!\" permalink parent award report block reply snoopy3210 -2 points 4 days ago 16 doesn’t fit your nazi sucking sound haha 😆 permalink parent award report block reply Glory-Unto-God 1 points 4 days ago I have seen absolutely 0 evidence of the last two words. permalink parent award report block reply RedStoneDeepState -4 points 4 days ago It's sixteen, neonazis are not even smart enough to count past 10 permalink parent award report block reply SimaYi 5 points 4 days ago Do you have a problem with securing a land and future for White children? permalink parent award report block reply RedStoneDeepState -4 points 4 days ago Considering I am married to an Asian woman, yes permalink parent award report block reply SpellingContable 2 points 4 days ago It will be delicious irony if it turns out that your wife is Japanese. permalink parent award report block reply view 2 more comments... bigdickhangsright 1 points 4 days ago 14 does not make someone a neo Nazi. Being a neo Nazi makes someone a neo Nazi. permalink parent award report block reply Mungo 1 points 4 days ago Or read cursive permalink parent award report block reply\nguywholikesDjtof2024 14 points 4 days ago \"LOOK, FELLOW THEY/THEMS, TRUMP IS MAKING THE HITLER GESTURE1!1!1!1!11 AND THE BABY IS RAAAACISSST1!11!11 ABORT HIM NOW!!!!\" permalink parent award report block reply\nsnoopy3210 -2 points 4 days ago 16 doesn’t fit your nazi sucking sound haha 😆 permalink parent award report block reply Glory-Unto-God 1 points 4 days ago I have seen absolutely 0 evidence of the last two words. permalink parent award report block reply\nGlory-Unto-God 1 points 4 days ago I have seen absolutely 0 evidence of the last two words. permalink parent award report block reply\nRedStoneDeepState -4 points 4 days ago It's sixteen, neonazis are not even smart enough to count past 10 permalink parent award report block reply SimaYi 5 points 4 days ago Do you have a problem with securing a land and future for White children? permalink parent award report block reply RedStoneDeepState -4 points 4 days ago Considering I am married to an Asian woman, yes permalink parent award report block reply SpellingContable 2 points 4 days ago It will be delicious irony if it turns out that your wife is Japanese. permalink parent award report block reply view 2 more comments... bigdickhangsright 1 points 4 days ago 14 does not make someone a neo Nazi. Being a neo Nazi makes someone a neo Nazi. permalink parent award report block reply Mungo 1 points 4 days ago Or read cursive permalink parent award report block reply\nSimaYi 5 points 4 days ago Do you have a problem with securing a land and future for White children? permalink parent award report block reply RedStoneDeepState -4 points 4 days ago Considering I am married to an Asian woman, yes permalink parent award report block reply SpellingContable 2 points 4 days ago It will be delicious irony if it turns out that your wife is Japanese. permalink parent award report block reply view 2 more comments...\nRedStoneDeepState -4 points 4 days ago Considering I am married to an Asian woman, yes permalink parent award report block reply SpellingContable 2 points 4 days ago It will be delicious irony if it turns out that your wife is Japanese. permalink parent award report block reply view 2 more comments...\nSpellingContable 2 points 4 days ago It will be delicious irony if it turns out that your wife is Japanese. permalink parent award report block reply view 2 more comments...\nbigdickhangsright 1 points 4 days ago 14 does not make someone a neo Nazi. Being a neo Nazi makes someone a neo Nazi. permalink parent award report block reply\nMungo 1 points 4 days ago Or read cursive permalink parent award report block reply\nMedicallyReddit 18 points 4 days ago America first. No street shitters allowed permalink award report block reply keeman 7 points 4 days ago Also stop giving money and military support to foreign countries.  And that very much includes Israel. permalink parent award report block reply x79q3pb 1 points 3 days ago JIDF lurkers didn't like this comment one bit permalink parent award report block reply BeauHD 2 points 4 days ago A M E N permalink parent award report block reply\nkeeman 7 points 4 days ago Also stop giving money and military support to foreign countries.  And that very much includes Israel. permalink parent award report block reply x79q3pb 1 points 3 days ago JIDF lurkers didn't like this comment one bit permalink parent award report block reply\nx79q3pb 1 points 3 days ago JIDF lurkers didn't like this comment one bit permalink parent award report block reply\nBeauHD 2 points 4 days ago A M E N permalink parent award report block reply\n5DchessWatch 7 points 4 days ago Babby continued: For we are opposed around the world by a monolithic and ruthless conspiracy that relies primarily on covert means for expanding its sphere of influence--on infiltration instead of invasion, on subversion instead of elections, on intimidation instead of free choice, on guerrillas by night instead of armies by day. It is a system which has conscripted vast human and material resources into the building of a tightly knit, highly efficient machine that combines military, diplomatic, intelligence, economic, scientific and political operations. its preparations are concealed, not published. Its mistakes are buried, not headlined. Its dissenters are silenced, not praised. No expenditure is questioned, no rumor is printed, no secret is revealed. It conducts the Cold War, in short, with a war-time discipline no democracy would ever hope or wish to match. Nevertheless, every democracy recognizes the necessary restraints of national security-and the question remains whether those restraints need to be more strictly observed if we are to oppose this kind of attack as well as outright invasion. Damn, babby, you on FIRE!🔥🔥 permalink award report block reply\nHanging_Chad 6 points 4 days ago based baby permalink award report block reply TheGreatWhiteNorth 3 points 4 days ago based AF baby permalink parent award report block reply\nTheGreatWhiteNorth 3 points 4 days ago based AF baby permalink parent award report block reply\nBlueKentuckyGirl 5 points 4 days ago 🤠🦅🇺🇸🦅🍻 permalink award report block reply\nCoprolite 4 points 4 days ago 16 words permalink award report block reply\nchickeninoven 3 points 4 days ago How is based babby formed? permalink award report block reply\npatrioticwinning3 3 points 4 days ago So...maybe clean house at the DOJ and FBI so we can get the globohomos OUT of government and hold them accountable for their crimes? permalink award report block reply\nSimaYi 3 points 4 days ago Back when he had based speechwriters. permalink award report block reply\nMerlynTrump 2 points 4 days ago Great line permalink award report block reply\nRadicalCovfefe 2 points 4 days ago Atta boy permalink award report block reply\nGlory-Unto-God 2 points 4 days ago Meanwhile jeet Ohio governor sponsor permalink award report block reply\nGood_Behavior_Day 2 points 4 days ago Can't beat the classics. https://www.youtube.com/watch?v=UjZy2_wSuZg permalink award report block reply\nAlmostFullyDilated 1 points 4 days ago islam* ftfy op permalink award report block reply diogenesofthearch OP 1 points 4 days ago \"We will no longer surrender this Islam, or it's Islam, to the false song of globalism\"? permalink parent award report block reply AlmostFullyDilated 1 points 4 days ago what? permalink parent award report block reply diogenesofthearch OP 1 points 3 days ago I didn't see how >islam* fixed it. Frankly, I think it made it incomprehensible. permalink parent award report block reply\ndiogenesofthearch OP 1 points 4 days ago \"We will no longer surrender this Islam, or it's Islam, to the false song of globalism\"? permalink parent award report block reply AlmostFullyDilated 1 points 4 days ago what? permalink parent award report block reply diogenesofthearch OP 1 points 3 days ago I didn't see how >islam* fixed it. Frankly, I think it made it incomprehensible. permalink parent award report block reply\nAlmostFullyDilated 1 points 4 days ago what? permalink parent award report block reply diogenesofthearch OP 1 points 3 days ago I didn't see how >islam* fixed it. Frankly, I think it made it incomprehensible. permalink parent award report block reply\ndiogenesofthearch OP 1 points 3 days ago I didn't see how >islam* fixed it. Frankly, I think it made it incomprehensible. permalink parent award report block reply\nDontbeafraid 0 points 4 days ago But if youre jewish, we will gladly bend the knee and spread the cheeks permalink award report block reply\nGrumbledook 0 points 4 days ago Yeah like supporting other countries over our own. Like Israel permalink award report block reply\nDeportthemall23 14 points 4 days ago Comment removed upon the user being banned. permalink award report block reply Aquamine-Amarine 3 points 4 days ago It's never made sense to me that leftists (who claim to support women and gays) keep allying with Islamists (who stone and kill women and gays). I don't understand. Do they have brain damage? permalink parent award report block reply RedStoneDeepState -2 points 4 days ago No it isn't. permalink parent award report block reply Deportthemall23 7 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply Patriot5TN 2 points 4 days ago Yes this is correct permalink parent award report block reply HeavyMetalPatriot 1 points 4 days ago AKA, those of European blood. permalink parent award report block reply\nAquamine-Amarine 3 points 4 days ago It's never made sense to me that leftists (who claim to support women and gays) keep allying with Islamists (who stone and kill women and gays). I don't understand. Do they have brain damage? permalink parent award report block reply\nRedStoneDeepState -2 points 4 days ago No it isn't. permalink parent award report block reply\nDeportthemall23 7 points 4 days ago Comment removed upon the user being banned. permalink parent award report block reply Patriot5TN 2 points 4 days ago Yes this is correct permalink parent award report block reply HeavyMetalPatriot 1 points 4 days ago AKA, those of European blood. permalink parent award report block reply\nPatriot5TN 2 points 4 days ago Yes this is correct permalink parent award report block reply\nHeavyMetalPatriot 1 points 4 days ago AKA, those of European blood. permalink parent award report block reply"}