{"id": "8177788", "contents": "1091 They were so desperate to stop Pres Trump's 2024 bid, that they massively overreached. Now they're going to face trials in Florida, where the Mar-o-Lago Raid took place. posted 4 days ago by Capoditutticapi1 72 comments award share report block Svetlana Lokhova @RealSLokhova • 4d They were so desperate to stop Pres Trump's 2024 bid, that they massively overreached. I was in the middle of giving evidence to Special Counsel Durham against Brennan, Comey, Halper, Steele and co when they raided President's home, seized all the Hillary Plan and Crossfire Svetlana Lokhova @RealSLokhova • 4d 👀\n72 comments Sort by Top Top New Worst Old Save hillaryforprison 61 points 4 days ago 2 more weeks; its on my desk. Same old story. Wake me up when one democrat criminal is put in prison. permalink award report block reply HeavyMetalPatriot 33 points 4 days ago You will be very well rested. permalink parent award report block reply grenades_and_ham 13 points 3 days ago Rip Van Wnkle rested. permalink parent award report block reply TrumpCare 4 points 3 days ago Name checks out permalink parent award report block reply Dem_slayer 2 points 3 days ago You sure you want to sleep forever? permalink parent award report block reply UCantStumpTheTrump -4 points 3 days ago Comey, Bolton and  Letitia James have already been indicted and charged with crimes, what makes you think that’s the end of it? permalink parent award report block reply Liberals_R_Idiots 2 points 3 days ago 😆 permalink parent award report block reply UCantStumpTheTrump 0 points 3 days ago can't formulate a response to my point, doomer shill BTFO permalink parent award report block reply hillaryforprison 2 points 3 days ago None of them have been found guilty of anything yet nor sentenced. They aren't in prison, but walking around like normal. permalink parent award report block reply HKFan 2 points 3 days ago They'll allow James to take a fall so the media and blacks can scream rayciss!!!!!! Comey and Bolton will be found not guilty by a deep state NOVA jury permalink parent award report block reply UCantStumpTheTrump 0 points 3 days ago Yeah let's look back at your predictions, who did you think would win the 2024 election? permalink parent award report block reply yodayoda 1 points 3 days ago 🤣 permalink parent award report block reply UCantStumpTheTrump 0 points 3 days ago Can't refute my point huh? Doomer shill faggot permalink parent award report block reply yodayoda 1 points 2 days ago 🤣🤣🤣 permalink parent award report block reply Billbuttlickerr 1 points 3 days ago Gimme a hit of that copium permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago How is that copium? Would you be happy if a federal grand jury indicted you for felony crimes? permalink parent award report block reply Billbuttlickerr 0 points 3 days ago Until they’re convicted and in an actual cell, it’s all theatre that you’re eating up. permalink parent award report block reply view 3 more comments... load 3 more comments... Roadpower 15 points 4 days ago Hopefully it goes places. permalink award report block reply chickeninoven 9 points 4 days ago As long as one of those places is not Pam's desk. permalink parent award report block reply hillaryforprison 1 points 3 days ago Her desk is like a Sarlacc pit. Things go in but don't come out. permalink parent award report block reply UsernameChexOut 8 points 4 days ago Narrator: it did not permalink parent award report block reply UCantStumpTheTrump -2 points 3 days ago Doomer faggot shill permalink parent award report block reply HKFan 12 points 3 days ago at this point watching nothing happen is pattern recognition, not dooming permalink parent award report block reply starjello -1 points 3 days ago Go away fag. You gay awankening assholes are fun to block. permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago LOL you got it completely wrong low-IQ mouth breather shill permalink parent award report block reply UsernameChexOut -9 points 3 days ago Are you this angry cause Epstein touched you in your bum-bum? permalink parent award report block reply Billbuttlickerr 5 points 3 days ago Just like we locked up Fauci. Just like we arrested all the vaccine makers.   Just like we arrested all the Dem governors for mistreating their states citizens. Should I keep going? permalink parent award report block reply view 11 more comments... Saltycue 11 points 3 days ago It's on Pam's desk and in a Biden judge courtroom permalink award report block reply grad16uc 10 points 3 days ago \"They massively overreached\" And they'll do it again. In about 1 year. permalink award report block reply donteatthat 3 points 3 days ago If you banged the hot chick from work and your wife knew and didn't do anything about it then why the fuck wouldn't you bang her again permalink parent award report block reply starjello 1 points 3 days ago That were the case you would bang her 7 days a week and twice on Sundays permalink parent award report block reply NewGoldenAge 6 points 3 days ago And no one will go to jail - suck my penis. Yum yum to my tummy tum tum. The end. FAGGOTS permalink award report block reply deleted 3 points 3 days ago NewGoldenAge 2 points 3 days ago ty! permalink parent award report block reply Thomm 6 points 3 days ago It’s svetlana lokhova’s twitter.  It has to be two more weeks this time! permalink award report block reply PoleWatcher 5 points 3 days ago Durham, lol permalink award report block reply Shitsbrokeyo 4 points 3 days ago So are the Hillary docs declassified or were they destroyed. Not the Russian collusisn Crossfire docs but the Libya docs. permalink award report block reply Covfefeandcream 4 points 3 days ago Yawn permalink award report block reply NotYourMan 3 points 3 days ago This must happen in Florida because it appears that it will not happen in DC.  Its too bad that we can't have these traitors on trial in DC but that seems to be impossible due to politics. permalink award report block reply Fine_Kentucky_Jenkum 2 points 3 days ago pffft!! Like it’s going to happen in Florida, either… permalink parent award report block reply yodayoda 3 points 3 days ago bullshit permalink award report block reply KneadThePeople 3 points 3 days ago “9 Aug” is an edit. Obviously the missing year is immediately noticed and upon comparison with previous quote/tweet packaging, something is clearly afoot. permalink award report block reply HKFan 3 points 3 days ago No, they aren't permalink award report block reply okboomer59 3 points 3 days ago What a colossal fuck-up was the Mar-a-Lago raid. That one misstep fucked them all. permalink award report block reply lizardo221 2 points 4 days ago Love it all permalink award report block reply UCantStumpTheTrump 0 points 3 days ago Yes! HIGH ENERGY! I believe we will see justice before Trump leaves office! permalink parent award report block reply lifeisahologram 2 points 3 days ago If Desantis can help actually do something about that before he leaves office, I will completely forgive him. permalink award report block reply Michalusmichalus 1 points 3 days ago They also tried to bully a judge who wasn't on their side. They tried to make her seclude herself or something, because she wouldn't do what they wanted. permalink award report block reply BradPitt 1 points 3 days ago I have faith that nothing will happen permalink award report block reply TrumpAndGodWin 3 points 3 days ago \"Losers focus on winners, winners focus on winning.\" DJT permalink parent award report block reply Spellmonger 1 points 3 days ago They were not desperate. After 60+ years of getting away with election fraud, they thought they were invincible. They very nearly are, and we need to let the Republican members of Congress know that we will not rely on voting to punish them if there is any hint of fraud in the 2026 election.  That includes all the crap they pulled in the 2020 add 2024, and 2025 elections. Politicians took away our right derived from the common law system of English law, Colonial law, and enshrined in our Constitution and is still in effect, no matter if it is hidden from us, to impanel a Citizens' Grand Jury to investigate government officials and hold them accountable. A Constitutional Right acknowledged by Justice Scalia in on May 4, 1992: ...the Grand Jury can investigate merely on suspicion that the law is being violated, or even because it wants assurance that it is not.  (*U.S. v Williams, Decided May 4, 1992, permalink award report block reply HenkZeilstra 1 points 3 days ago Talk, no action permalink award report block reply KamamblaToe -1 points 4 days ago Spoiler alert permalink award report block reply UCantStumpTheTrump -1 points 3 days ago You’re a reddit faggot trying to sow discord here permalink parent award report block reply KamamblaToe 0 points 2 days ago Two more weeks faggot!!! permalink parent award report block reply mohel -1 points 3 days ago Russian asset permalink award report block reply\nhillaryforprison 61 points 4 days ago 2 more weeks; its on my desk. Same old story. Wake me up when one democrat criminal is put in prison. permalink award report block reply HeavyMetalPatriot 33 points 4 days ago You will be very well rested. permalink parent award report block reply grenades_and_ham 13 points 3 days ago Rip Van Wnkle rested. permalink parent award report block reply TrumpCare 4 points 3 days ago Name checks out permalink parent award report block reply Dem_slayer 2 points 3 days ago You sure you want to sleep forever? permalink parent award report block reply UCantStumpTheTrump -4 points 3 days ago Comey, Bolton and  Letitia James have already been indicted and charged with crimes, what makes you think that’s the end of it? permalink parent award report block reply Liberals_R_Idiots 2 points 3 days ago 😆 permalink parent award report block reply UCantStumpTheTrump 0 points 3 days ago can't formulate a response to my point, doomer shill BTFO permalink parent award report block reply hillaryforprison 2 points 3 days ago None of them have been found guilty of anything yet nor sentenced. They aren't in prison, but walking around like normal. permalink parent award report block reply HKFan 2 points 3 days ago They'll allow James to take a fall so the media and blacks can scream rayciss!!!!!! Comey and Bolton will be found not guilty by a deep state NOVA jury permalink parent award report block reply UCantStumpTheTrump 0 points 3 days ago Yeah let's look back at your predictions, who did you think would win the 2024 election? permalink parent award report block reply yodayoda 1 points 3 days ago 🤣 permalink parent award report block reply UCantStumpTheTrump 0 points 3 days ago Can't refute my point huh? Doomer shill faggot permalink parent award report block reply yodayoda 1 points 2 days ago 🤣🤣🤣 permalink parent award report block reply Billbuttlickerr 1 points 3 days ago Gimme a hit of that copium permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago How is that copium? Would you be happy if a federal grand jury indicted you for felony crimes? permalink parent award report block reply Billbuttlickerr 0 points 3 days ago Until they’re convicted and in an actual cell, it’s all theatre that you’re eating up. permalink parent award report block reply view 3 more comments... load 3 more comments...\nHeavyMetalPatriot 33 points 4 days ago You will be very well rested. permalink parent award report block reply grenades_and_ham 13 points 3 days ago Rip Van Wnkle rested. permalink parent award report block reply\ngrenades_and_ham 13 points 3 days ago Rip Van Wnkle rested. permalink parent award report block reply\nTrumpCare 4 points 3 days ago Name checks out permalink parent award report block reply\nDem_slayer 2 points 3 days ago You sure you want to sleep forever? permalink parent award report block reply\nUCantStumpTheTrump -4 points 3 days ago Comey, Bolton and  Letitia James have already been indicted and charged with crimes, what makes you think that’s the end of it? permalink parent award report block reply Liberals_R_Idiots 2 points 3 days ago 😆 permalink parent award report block reply UCantStumpTheTrump 0 points 3 days ago can't formulate a response to my point, doomer shill BTFO permalink parent award report block reply hillaryforprison 2 points 3 days ago None of them have been found guilty of anything yet nor sentenced. They aren't in prison, but walking around like normal. permalink parent award report block reply HKFan 2 points 3 days ago They'll allow James to take a fall so the media and blacks can scream rayciss!!!!!! Comey and Bolton will be found not guilty by a deep state NOVA jury permalink parent award report block reply UCantStumpTheTrump 0 points 3 days ago Yeah let's look back at your predictions, who did you think would win the 2024 election? permalink parent award report block reply yodayoda 1 points 3 days ago 🤣 permalink parent award report block reply UCantStumpTheTrump 0 points 3 days ago Can't refute my point huh? Doomer shill faggot permalink parent award report block reply yodayoda 1 points 2 days ago 🤣🤣🤣 permalink parent award report block reply Billbuttlickerr 1 points 3 days ago Gimme a hit of that copium permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago How is that copium? Would you be happy if a federal grand jury indicted you for felony crimes? permalink parent award report block reply Billbuttlickerr 0 points 3 days ago Until they’re convicted and in an actual cell, it’s all theatre that you’re eating up. permalink parent award report block reply view 3 more comments... load 3 more comments...\nLiberals_R_Idiots 2 points 3 days ago 😆 permalink parent award report block reply UCantStumpTheTrump 0 points 3 days ago can't formulate a response to my point, doomer shill BTFO permalink parent award report block reply\nUCantStumpTheTrump 0 points 3 days ago can't formulate a response to my point, doomer shill BTFO permalink parent award report block reply\nhillaryforprison 2 points 3 days ago None of them have been found guilty of anything yet nor sentenced. They aren't in prison, but walking around like normal. permalink parent award report block reply\nHKFan 2 points 3 days ago They'll allow James to take a fall so the media and blacks can scream rayciss!!!!!! Comey and Bolton will be found not guilty by a deep state NOVA jury permalink parent award report block reply UCantStumpTheTrump 0 points 3 days ago Yeah let's look back at your predictions, who did you think would win the 2024 election? permalink parent award report block reply\nUCantStumpTheTrump 0 points 3 days ago Yeah let's look back at your predictions, who did you think would win the 2024 election? permalink parent award report block reply\nyodayoda 1 points 3 days ago 🤣 permalink parent award report block reply UCantStumpTheTrump 0 points 3 days ago Can't refute my point huh? Doomer shill faggot permalink parent award report block reply yodayoda 1 points 2 days ago 🤣🤣🤣 permalink parent award report block reply\nUCantStumpTheTrump 0 points 3 days ago Can't refute my point huh? Doomer shill faggot permalink parent award report block reply yodayoda 1 points 2 days ago 🤣🤣🤣 permalink parent award report block reply\nyodayoda 1 points 2 days ago 🤣🤣🤣 permalink parent award report block reply\nBillbuttlickerr 1 points 3 days ago Gimme a hit of that copium permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago How is that copium? Would you be happy if a federal grand jury indicted you for felony crimes? permalink parent award report block reply Billbuttlickerr 0 points 3 days ago Until they’re convicted and in an actual cell, it’s all theatre that you’re eating up. permalink parent award report block reply view 3 more comments...\nUCantStumpTheTrump 1 points 3 days ago How is that copium? Would you be happy if a federal grand jury indicted you for felony crimes? permalink parent award report block reply Billbuttlickerr 0 points 3 days ago Until they’re convicted and in an actual cell, it’s all theatre that you’re eating up. permalink parent award report block reply view 3 more comments...\nBillbuttlickerr 0 points 3 days ago Until they’re convicted and in an actual cell, it’s all theatre that you’re eating up. permalink parent award report block reply view 3 more comments...\nRoadpower 15 points 4 days ago Hopefully it goes places. permalink award report block reply chickeninoven 9 points 4 days ago As long as one of those places is not Pam's desk. permalink parent award report block reply hillaryforprison 1 points 3 days ago Her desk is like a Sarlacc pit. Things go in but don't come out. permalink parent award report block reply UsernameChexOut 8 points 4 days ago Narrator: it did not permalink parent award report block reply UCantStumpTheTrump -2 points 3 days ago Doomer faggot shill permalink parent award report block reply HKFan 12 points 3 days ago at this point watching nothing happen is pattern recognition, not dooming permalink parent award report block reply starjello -1 points 3 days ago Go away fag. You gay awankening assholes are fun to block. permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago LOL you got it completely wrong low-IQ mouth breather shill permalink parent award report block reply UsernameChexOut -9 points 3 days ago Are you this angry cause Epstein touched you in your bum-bum? permalink parent award report block reply Billbuttlickerr 5 points 3 days ago Just like we locked up Fauci. Just like we arrested all the vaccine makers.   Just like we arrested all the Dem governors for mistreating their states citizens. Should I keep going? permalink parent award report block reply view 11 more comments...\nchickeninoven 9 points 4 days ago As long as one of those places is not Pam's desk. permalink parent award report block reply hillaryforprison 1 points 3 days ago Her desk is like a Sarlacc pit. Things go in but don't come out. permalink parent award report block reply\nhillaryforprison 1 points 3 days ago Her desk is like a Sarlacc pit. Things go in but don't come out. permalink parent award report block reply\nUsernameChexOut 8 points 4 days ago Narrator: it did not permalink parent award report block reply UCantStumpTheTrump -2 points 3 days ago Doomer faggot shill permalink parent award report block reply HKFan 12 points 3 days ago at this point watching nothing happen is pattern recognition, not dooming permalink parent award report block reply starjello -1 points 3 days ago Go away fag. You gay awankening assholes are fun to block. permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago LOL you got it completely wrong low-IQ mouth breather shill permalink parent award report block reply UsernameChexOut -9 points 3 days ago Are you this angry cause Epstein touched you in your bum-bum? permalink parent award report block reply Billbuttlickerr 5 points 3 days ago Just like we locked up Fauci. Just like we arrested all the vaccine makers.   Just like we arrested all the Dem governors for mistreating their states citizens. Should I keep going? permalink parent award report block reply view 11 more comments...\nUCantStumpTheTrump -2 points 3 days ago Doomer faggot shill permalink parent award report block reply HKFan 12 points 3 days ago at this point watching nothing happen is pattern recognition, not dooming permalink parent award report block reply starjello -1 points 3 days ago Go away fag. You gay awankening assholes are fun to block. permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago LOL you got it completely wrong low-IQ mouth breather shill permalink parent award report block reply UsernameChexOut -9 points 3 days ago Are you this angry cause Epstein touched you in your bum-bum? permalink parent award report block reply Billbuttlickerr 5 points 3 days ago Just like we locked up Fauci. Just like we arrested all the vaccine makers.   Just like we arrested all the Dem governors for mistreating their states citizens. Should I keep going? permalink parent award report block reply view 11 more comments...\nHKFan 12 points 3 days ago at this point watching nothing happen is pattern recognition, not dooming permalink parent award report block reply\nstarjello -1 points 3 days ago Go away fag. You gay awankening assholes are fun to block. permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago LOL you got it completely wrong low-IQ mouth breather shill permalink parent award report block reply\nUCantStumpTheTrump 1 points 3 days ago LOL you got it completely wrong low-IQ mouth breather shill permalink parent award report block reply\nUsernameChexOut -9 points 3 days ago Are you this angry cause Epstein touched you in your bum-bum? permalink parent award report block reply Billbuttlickerr 5 points 3 days ago Just like we locked up Fauci. Just like we arrested all the vaccine makers.   Just like we arrested all the Dem governors for mistreating their states citizens. Should I keep going? permalink parent award report block reply view 11 more comments...\nBillbuttlickerr 5 points 3 days ago Just like we locked up Fauci. Just like we arrested all the vaccine makers.   Just like we arrested all the Dem governors for mistreating their states citizens. Should I keep going? permalink parent award report block reply view 11 more comments...\nSaltycue 11 points 3 days ago It's on Pam's desk and in a Biden judge courtroom permalink award report block reply\ngrad16uc 10 points 3 days ago \"They massively overreached\" And they'll do it again. In about 1 year. permalink award report block reply donteatthat 3 points 3 days ago If you banged the hot chick from work and your wife knew and didn't do anything about it then why the fuck wouldn't you bang her again permalink parent award report block reply starjello 1 points 3 days ago That were the case you would bang her 7 days a week and twice on Sundays permalink parent award report block reply\ndonteatthat 3 points 3 days ago If you banged the hot chick from work and your wife knew and didn't do anything about it then why the fuck wouldn't you bang her again permalink parent award report block reply starjello 1 points 3 days ago That were the case you would bang her 7 days a week and twice on Sundays permalink parent award report block reply\nstarjello 1 points 3 days ago That were the case you would bang her 7 days a week and twice on Sundays permalink parent award report block reply\nNewGoldenAge 6 points 3 days ago And no one will go to jail - suck my penis. Yum yum to my tummy tum tum. The end. FAGGOTS permalink award report block reply deleted 3 points 3 days ago NewGoldenAge 2 points 3 days ago ty! permalink parent award report block reply\ndeleted 3 points 3 days ago NewGoldenAge 2 points 3 days ago ty! permalink parent award report block reply\nNewGoldenAge 2 points 3 days ago ty! permalink parent award report block reply\nThomm 6 points 3 days ago It’s svetlana lokhova’s twitter.  It has to be two more weeks this time! permalink award report block reply\nPoleWatcher 5 points 3 days ago Durham, lol permalink award report block reply\nShitsbrokeyo 4 points 3 days ago So are the Hillary docs declassified or were they destroyed. Not the Russian collusisn Crossfire docs but the Libya docs. permalink award report block reply\nCovfefeandcream 4 points 3 days ago Yawn permalink award report block reply\nNotYourMan 3 points 3 days ago This must happen in Florida because it appears that it will not happen in DC.  Its too bad that we can't have these traitors on trial in DC but that seems to be impossible due to politics. permalink award report block reply Fine_Kentucky_Jenkum 2 points 3 days ago pffft!! Like it’s going to happen in Florida, either… permalink parent award report block reply\nFine_Kentucky_Jenkum 2 points 3 days ago pffft!! Like it’s going to happen in Florida, either… permalink parent award report block reply\nyodayoda 3 points 3 days ago bullshit permalink award report block reply\nKneadThePeople 3 points 3 days ago “9 Aug” is an edit. Obviously the missing year is immediately noticed and upon comparison with previous quote/tweet packaging, something is clearly afoot. permalink award report block reply\nHKFan 3 points 3 days ago No, they aren't permalink award report block reply\nokboomer59 3 points 3 days ago What a colossal fuck-up was the Mar-a-Lago raid. That one misstep fucked them all. permalink award report block reply\nlizardo221 2 points 4 days ago Love it all permalink award report block reply UCantStumpTheTrump 0 points 3 days ago Yes! HIGH ENERGY! I believe we will see justice before Trump leaves office! permalink parent award report block reply\nUCantStumpTheTrump 0 points 3 days ago Yes! HIGH ENERGY! I believe we will see justice before Trump leaves office! permalink parent award report block reply\nlifeisahologram 2 points 3 days ago If Desantis can help actually do something about that before he leaves office, I will completely forgive him. permalink award report block reply\nMichalusmichalus 1 points 3 days ago They also tried to bully a judge who wasn't on their side. They tried to make her seclude herself or something, because she wouldn't do what they wanted. permalink award report block reply\nBradPitt 1 points 3 days ago I have faith that nothing will happen permalink award report block reply TrumpAndGodWin 3 points 3 days ago \"Losers focus on winners, winners focus on winning.\" DJT permalink parent award report block reply\nTrumpAndGodWin 3 points 3 days ago \"Losers focus on winners, winners focus on winning.\" DJT permalink parent award report block reply\nSpellmonger 1 points 3 days ago They were not desperate. After 60+ years of getting away with election fraud, they thought they were invincible. They very nearly are, and we need to let the Republican members of Congress know that we will not rely on voting to punish them if there is any hint of fraud in the 2026 election.  That includes all the crap they pulled in the 2020 add 2024, and 2025 elections. Politicians took away our right derived from the common law system of English law, Colonial law, and enshrined in our Constitution and is still in effect, no matter if it is hidden from us, to impanel a Citizens' Grand Jury to investigate government officials and hold them accountable. A Constitutional Right acknowledged by Justice Scalia in on May 4, 1992: ...the Grand Jury can investigate merely on suspicion that the law is being violated, or even because it wants assurance that it is not.  (*U.S. v Williams, Decided May 4, 1992, permalink award report block reply\nHenkZeilstra 1 points 3 days ago Talk, no action permalink award report block reply\nKamamblaToe -1 points 4 days ago Spoiler alert permalink award report block reply UCantStumpTheTrump -1 points 3 days ago You’re a reddit faggot trying to sow discord here permalink parent award report block reply KamamblaToe 0 points 2 days ago Two more weeks faggot!!! permalink parent award report block reply\nUCantStumpTheTrump -1 points 3 days ago You’re a reddit faggot trying to sow discord here permalink parent award report block reply KamamblaToe 0 points 2 days ago Two more weeks faggot!!! permalink parent award report block reply\nKamamblaToe 0 points 2 days ago Two more weeks faggot!!! permalink parent award report block reply\nmohel -1 points 3 days ago Russian asset permalink award report block reply"}