{"id": "8178653", "contents": "1461 Every blue dot is an NGO... posted 3 days ago by Capoditutticapi1 120 comments award share report block DataRepublican (small r) @DataRepublican • 3d @SenTomCotton @LindseyGrahamSC @joniernst @DanSullivan_AK @iamlisalogan @SKDoubleDub33 Hard to appreciate the scale of this effort. Every blue dot is a NGO.\n120 comments Sort by Top Top New Worst Old Save Around the Web The Killer of Baldness Has Been Found! (Try This at Home) HaloGrow ThorsonTT 156 points 3 days ago Coast to coast money laundering for subversive activities. permalink award report block reply Capoditutticapi1 OP 104 points 3 days ago Imagine if you will the United States of America without NGO's siphoning, stealing, hoarding, embezzling, trillions in taxpayer money, how much closer to the American Dream most US Citizens would be right now... permalink parent award report block reply suckmycorona 30 points 3 days ago But what about the Clinton’s? Don’t you fee fees for them? permalink parent award report block reply Aoikaze2000 6 points 3 days ago I'd say they can go fuck themselves, but HRC might suicide me. permalink parent award report block reply DT170x 4 points 3 days ago ok I will say that to their demonic faces. Later u/DT170x was found dead at his house with 3 bullet holes in his head while stuffed into a duffle bag. Police ruled suicide. permalink parent award report block reply view 2 more comments... Spicy_cat 15 points 3 days ago Don't be antisemitic permalink parent award report block reply YaharaRiver 5 points 3 days ago Correct. Better and smarter to be islamaphobic, every single time! List of pisslamic NGOs: https://ngobase.org/swa/RLG.IS/islam-ngos-charities There’s 1,759 of them. ☠️ permalink parent award report block reply IForgotToAddAnEmail 5 points 3 days ago Incorrect, it's better to be weary of both. America First and only. MAGA BABY. permalink parent award report block reply Worldtraveler0405 4 points 3 days ago Funded by Wahhabi Arab oil from Dubai, Abu Dhabi, Qatar and Riyadh etc. permalink parent award report block reply Viewer01 12 points 3 days ago Our entire economy is built around do nothing lazy girl jobs meant to keep them out of the house and not having babies. Our economy isn’t real permalink parent award report block reply terribletwos 6 points 3 days ago I was about to say something similar. All these NGOs are just fake college girl jobs used to funnel fraud to themselves and the people who gave them money. permalink parent award report block reply breadbaker 2 points 3 days ago They came about via Reagan's abdication of government solving stuff, empowering private players -- often private social science majors, coming up with speculative solutions (like letting institutionalized mentally ill people be care for by their tired, worn out families), shoving insufficient funds their ways, and 1990 George Bush's  1000 points of light bullshit speech. The fact is women were just minor participants until the me, too moment made guys quit the senior positions out of guilt or fear. permalink parent award report block reply view 1 more comments... Agent_86 3 points 3 days ago I bet your hiding Rudolph The red nose reindeer in your closet aren't you? <---Heavy german accent. permalink parent award report block reply Smurfection 11 points 3 days ago Boomers would have all been millionaires right now if government hadn't stole their money.  Boomers really don't know how to budget. permalink parent award report block reply Agent_86 2 points 3 days ago Strange how the same reasons always seem to come up. They repeat like an old tune everyone knows by heart, though no one remembers who started it. After a while, you start to wonder if it’s the reasons keeping people stuck or something else entirely. permalink parent award report block reply Smurfection 2 points 2 days ago schools, TheNews™, entertainment. It's what is shaping society.  It should be family, Church and Great Ideas but dummies ain't got time for that. permalink parent award report block reply deleted 1 points 3 days ago GenWashington 1 points 3 days ago He typed the truth but didn't include all generations permalink parent award report block reply view 1 more comments... glow-operator-2-0 3 points 3 days ago We would have our interstellar empire now if it weren't for them. permalink parent award report block reply Capoditutticapi1 OP 3 points 3 days ago Exactly! ....and the flying cars we were promised! One in every driveway, or landing pad as it were... permalink parent award report block reply load 14 more comments... CommanderOfCheese 14 points 3 days ago You mean \"Our Democracy (TM)\" permalink parent award report block reply HeavyMetalPatriot 3 points 3 days ago To the left, \"democracy\" simply means \"rule by democrats\" permalink parent award report block reply NotYourMan 9 points 3 days ago This map explains the democrat \"conquest\" of the country.  Use USAID and other tax payer money to \"buy\" judges, mayors, city councils members then rewrite the voting laws so democrats can never lose.  Arrests must happen and I mean arresting people working on ballot counting. permalink parent award report block reply RedStoneDeepState -13 points 3 days ago Ah yes, churches are subversive activities permalink parent award report block reply Mortal_Wombat 16 points 3 days ago You see all those rainbow flags at churches over the past few years? That isn't a subversive ideology embraced by some of these fucktards? And they know it is too. permalink parent award report block reply breadbaker 3 points 3 days ago Churches are major NGOs. They often incorporate an NGO and gain local power that way. permalink parent award report block reply Mortal_Wombat 1 points 3 days ago That whole NGO shit is fucked. Including Red Cross and those fucking \"bell ringers\". permalink parent award report block reply DrCowboyPresident 11 points 3 days ago Mainline churches are, and it's nothing new. Take a look at this, and note the date of publication. https://time.com/archive/6603746/religion-american-malvern/ permalink parent award report block reply RedStoneDeepState -8 points 3 days ago That was FDR pushing communism. permalink parent award report block reply Iremembermypassword 9 points 3 days ago Next you will tell us Mosques don‘t engage in subversive activities. permalink parent award report block reply NeoDragoon 5 points 3 days ago It's part of a thread on USAID, churches are not being discussed. permalink parent award report block reply schiff_for_brains 2 points 3 days ago always-has-been.jpg permalink parent award report block reply load 2 more comments... IncredibleMrE1 44 points 3 days ago So many demons. America needs an exorcism. permalink award report block reply Spicy_cat 18 points 3 days ago When based Zoomers form Demon Slayer Corps and start beheading demons remember to nullify if you're on their jury permalink parent award report block reply MastaJoda 8 points 3 days ago Nulify? If I see mfs finally out there solving problems with their guns Im going to start checking names off my list as well. permalink parent award report block reply HeavyMetalPatriot 2 points 3 days ago If based Zs start taking heads, based Xs better get their asses out there to compete for high score. permalink parent award report block reply Spicy_cat 1 points 3 days ago Xers are basically just the tail end of the boomers.  They got to spend much of their career in what was still a functioning economy. permalink parent award report block reply Cacciali_Via 1 points 2 days ago Xers worked through the dot com bust, then the Great Recession. Also sky high interest rates that Gen Z has never experienced. We also simultaneously suffered through the advent of outsourcing and h1bs. There were some good years in there but we have been through plenty of economic shit. permalink parent award report block reply Smurfection 23 points 3 days ago I do not want our government funding NGOs.  NGOs have no place with government.  Period. While we're at it, repeal the Davis Bacon Act so all projects and maintenance contracts are open to whoever can do the job, not who can offer the most donations and kickbacks. permalink award report block reply A_Little_White_Duck 7 points 3 days ago But oh my, you'll get shoddy non-union workers and your building will collapse... permalink parent award report block reply Smurfection 1 points 2 days ago Hahahaha!   The best projects done under budget and on time with good quality work are non-union  white guys. permalink parent award report block reply OrangeManBadasss 2 points 3 days ago If they are non government organizations why should they get government funding? permalink parent award report block reply Smurfection 2 points 2 days ago How else would the kickbacks work?  You can't do the money laundering and kickbacks unless government partners with the people they want to do favors for. permalink parent award report block reply rivetjoint2 1 points 3 days ago Because they are doing the dirty work that the government can’t. permalink parent award report block reply Smurfection 1 points 2 days ago Explain to me how Vanessa Kerry's (John Kerry's billionaire heiress daughter) was doing the government's work by setting up a tent in Afghanistan, hiring her millionaire heiress Art history major friend to go there and teach how The Toilet is a great piece of modern art to Afghan women?   Please explain how that's doing the dirty work the government can't. https://www.youtube.com/watch?v=wdrvpSfJM1w Seriously, explain to me why a few extremely wealthy heiresses are doing the dirty work government won't do? permalink parent award report block reply TrumpLandslide20201 22 points 3 days ago We should all be rich as shit not just the few, the few that bitch and moan about Kings permalink award report block reply schiff_for_brains 3 points 3 days ago If everybody is rich, we're all equally poor. permalink parent award report block reply BlippiIsAPedo 5 points 3 days ago Not if every rich person does not spend their money as if it needs to be spent that moment permalink parent award report block reply Hanging_Chad 15 points 3 days ago they look purple to me permalink award report block reply MasterChief 8 points 3 days ago Not trying to be an asshole, I'm colorblind as hell. Have you ever done one of these? https://www.colorlitelens.com/ishihara-test.html permalink parent award report block reply Hanging_Chad 13 points 3 days ago HEX: #5035D2 red: 80 green: 53 blue: 210 the color’s name is “iris” https://en.wikipedia.org/wiki/Iris_(color) permalink parent award report block reply MasterChief 8 points 3 days ago ha gottem\nI can't tell the difference myself until someone tells me what color it is. Found out the hard way when applying to the AF permalink parent award report block reply walls4america 5 points 3 days ago If it helps you feel any better, and you’re male, I heard that the majority of those colorblind are male. I’d never heard of colorblindness until I was about 7. My mom had sent my dad to the store and while there to pick up a pack of pink Charmin toilet paper. He came home with green (a color my mom detested in TP) and when she asked him why he got green, he said it looked pink to him. That was when I learned he was colorblind. So we females of the family had to remember his colorblindness in the rare times we needed him to pick up anything for us ….and wanted a certain color. (But several years later Charmin stopped making colored TP, so that solved that issue.) permalink parent award report block reply GuerillaYourDreams 8 points 3 days ago I find that very cool. I wanted to find out if I had any color blindness and I passed 100%. permalink parent award report block reply Yheymos 2 points 2 days ago I searched for this comment because, yes they are purple! permalink parent award report block reply Mortal_Wombat 2 points 3 days ago Cobalt blue permalink parent award report block reply Capoditutticapi1 OP 2 points 3 days ago #6A0DAD (a deep purple, also known as \"Indigo\" or \"Royal Purple)  Calling it blue is a nice touch tying it to DemonRats though... permalink parent award report block reply Iremembermypassword 12 points 3 days ago This is literal foreign funded sedition! Where is the Donald? permalink award report block reply irongeek 11 points 3 days ago Everyone has a short term memory. Nobody was held accountable for fraud  from  DOGE finding. permalink award report block reply Filo76 9 points 3 days ago NGO:  Non-Governmental Organization /doubt permalink award report block reply walls4america 9 points 3 days ago No, actually it’s true. 😜 NGOs = Color Revolution. So, in trying to overthrow governments they are an organization that’s for making governments non-governments. The link to her thread I’ll give again here. She says the international NGOs have been trying to do a color revolution in the US.  At the US taxpayers’ expense. As of Inauguration Day, they’ve had to readjust their tactics. https://nitter.net/DataRepublican/status/1987569380738408622 permalink parent award report block reply Nibba2 3 points 3 days ago You’re right, it’s probably higher. Just type NGO into google and see how many it pulls up locally alone. permalink parent award report block reply OxAO 2 points 3 days ago both right.  They're Non-Governmental Organization(NGO) but the government pays a large part of their operations.\nWhich means it's not really Non-government. Same concept that Aerojet Rocketdyne, Lockheed and most military production business models have been running on. Corporations and the state work together this was the concept of Max Stirner that later was called Fascists-syndicalist predecessor of fascism permalink parent award report block reply MythArcana 8 points 3 days ago Nice to know where our tax dollars are really going. permalink award report block reply deleted 7 points 3 days ago MrHarryReems 4 points 3 days ago How else is the government going to do things that pesky constitution says they can't do? permalink parent award report block reply ACActual 6 points 3 days ago This is a sign of how complete the corruption really is.  Its the legal looting of the Treasury by politicians.  They know debt at 120% of GDP is unrecoverable.  The currency will fail in no more than a few years.   We followed the same pattern as every superpower since Spain permalink award report block reply Capoditutticapi1 OP 4 points 3 days ago Only 2 ways to stop it..., the hard way..., or the harder way! permalink parent award report block reply ACActual 3 points 3 days ago I recommend frens start studying Social Decay, Collapse.  Form groups of like minded willing to barter.  The larger the group the better permalink parent award report block reply KarenLukasik 5 points 3 days ago Good heavens,when can we start saying “was an NGO” permalink award report block reply Ch3f4554551n 5 points 3 days ago Remember when a 'non-governmental organization' was just called a business? Pepperidge Farm... permalink award report block reply JustInTime2_ 4 points 3 days ago All should be audited. permalink award report block reply Cville123 4 points 3 days ago Cut the money off permalink award report block reply Aggrieved03 4 points 3 days ago Every one of us are a tax slave funding it all. permalink award report block reply walls4america 4 points 3 days ago Her whole thread and the comments are extra interesting. It goes further in depth. https://nitter.net/DataRepublican/status/1987569380738408622 permalink award report block reply ozgroginexile 3 points 3 days ago This is rippling over into Australia as well. Stanford University are involved in the U16 Online Social Media ban here - which has been put in place by a WEF and Ex-Microsoft employee who was appointed to a bureaucratic position to decide what we can and cannot do online here anymore. permalink parent award report block reply Capoditutticapi1 OP 3 points 3 days ago Great you took the time to look further... permalink parent award report block reply Treefiddydiddy 4 points 3 days ago haemorrhaging tax cash to these fkn demons for decades permalink award report block reply GuerillaYourDreams 4 points 3 days ago Frightening, the levels of corruption. permalink award report block reply MPitcher1776 3 points 3 days ago Shutdown 95% of them. Only keep ones that don't get government money and not affiliated with a politician or lobbyist. permalink award report block reply asiatrails 3 points 3 days ago This is explosive permalink award report block reply Retardloserimsogay 3 points 3 days ago Map of targets permalink award report block reply mcoulton 3 points 3 days ago they used USAID money to build an army permalink award report block reply Capoditutticapi1 OP 1 points 3 days ago Yes they did, do, still at it... permalink parent award report block reply SonOfThunder 3 points 3 days ago Is there a link to that actual map anywhere? permalink award report block reply Dev404 3 points 3 days ago Much of it funded by Congress at both State and Federal levels. They're NGO in name only, they're 100% under instruction of the government who also gives them protection to keep functioning despite being caught in crime after crime with virtually no punishment. permalink award report block reply FusionBlack 3 points 3 days ago This is truly depressing. One big money laundrying operation and still no accountability. There should be stiff prison time for these offenders. If actions are not taken this will be another reason we fail next November. permalink award report block reply MPitcher1776 3 points 3 days ago Holy shit. permalink award report block reply Paydro 3 points 3 days ago We should just start our own NGO's at this point. Might as well permalink award report block reply AgnesDomini 3 points 3 days ago Dang! Why so many in Florida??? permalink award report block reply chickeninoven 3 points 3 days ago Look at that tumor around DC just sucking up the grift. permalink award report block reply bobbacringo 2 points 3 days ago If you would only understand who funds the NGO's. permalink award report block reply SurveilThis 2 points 3 days ago NGO = Non-indictable Government Organization. permalink award report block reply Trooph-Hurts 2 points 3 days ago End than all permalink award report block reply rivetjoint2 2 points 3 days ago Nuke the silent filibuster.  Pass the maga agenda.  Make the cuts, save the Republic.  Of course we know the uni-party can’t have that! permalink award report block reply Senaleb 2 points 3 days ago Use to be a big fan of datarepublican, but she's committed to defending Ben Shapiro and Ted Cruz in regards to Israeli money buying off US politicians. Literally the men she is criticizing here who have gotten fat off AIPAC funding. permalink award report block reply Cianevalies 2 points 3 days ago Florida must be a nice place tax wise for NGOS.. permalink award report block reply Megaboom2025 2 points 3 days ago All requiring G money? permalink award report block reply Hikedelics 2 points 3 days ago Damn go ahead Nevada! Looks like they have even less than Wyoming. permalink award report block reply C0drus 2 points 3 days ago In other words: Every blue dot 🔵 is like viagra for commies permalink award report block reply Grindelwald 2 points 3 days ago Outlaw government funding of NGOs.  Country would blow up. But better for it. How many “jobs” do they represent? permalink award report block reply Atruckdriver 0 points 2 days ago This picture is misleading in that it covers EVERYTHING. From rabid liberal agendas to senior citizen services. Although there is cross over as we have seen with the “get out the grandmas in wheelchairs” program for no kings, I think this is disingenuous. permalink award report block reply Sugz_Da_Feefth -1 points 3 days ago Slay. permalink award report block reply\nThorsonTT 156 points 3 days ago Coast to coast money laundering for subversive activities. permalink award report block reply Capoditutticapi1 OP 104 points 3 days ago Imagine if you will the United States of America without NGO's siphoning, stealing, hoarding, embezzling, trillions in taxpayer money, how much closer to the American Dream most US Citizens would be right now... permalink parent award report block reply suckmycorona 30 points 3 days ago But what about the Clinton’s? Don’t you fee fees for them? permalink parent award report block reply Aoikaze2000 6 points 3 days ago I'd say they can go fuck themselves, but HRC might suicide me. permalink parent award report block reply DT170x 4 points 3 days ago ok I will say that to their demonic faces. Later u/DT170x was found dead at his house with 3 bullet holes in his head while stuffed into a duffle bag. Police ruled suicide. permalink parent award report block reply view 2 more comments... Spicy_cat 15 points 3 days ago Don't be antisemitic permalink parent award report block reply YaharaRiver 5 points 3 days ago Correct. Better and smarter to be islamaphobic, every single time! List of pisslamic NGOs: https://ngobase.org/swa/RLG.IS/islam-ngos-charities There’s 1,759 of them. ☠️ permalink parent award report block reply IForgotToAddAnEmail 5 points 3 days ago Incorrect, it's better to be weary of both. America First and only. MAGA BABY. permalink parent award report block reply Worldtraveler0405 4 points 3 days ago Funded by Wahhabi Arab oil from Dubai, Abu Dhabi, Qatar and Riyadh etc. permalink parent award report block reply Viewer01 12 points 3 days ago Our entire economy is built around do nothing lazy girl jobs meant to keep them out of the house and not having babies. Our economy isn’t real permalink parent award report block reply terribletwos 6 points 3 days ago I was about to say something similar. All these NGOs are just fake college girl jobs used to funnel fraud to themselves and the people who gave them money. permalink parent award report block reply breadbaker 2 points 3 days ago They came about via Reagan's abdication of government solving stuff, empowering private players -- often private social science majors, coming up with speculative solutions (like letting institutionalized mentally ill people be care for by their tired, worn out families), shoving insufficient funds their ways, and 1990 George Bush's  1000 points of light bullshit speech. The fact is women were just minor participants until the me, too moment made guys quit the senior positions out of guilt or fear. permalink parent award report block reply view 1 more comments... Agent_86 3 points 3 days ago I bet your hiding Rudolph The red nose reindeer in your closet aren't you? <---Heavy german accent. permalink parent award report block reply Smurfection 11 points 3 days ago Boomers would have all been millionaires right now if government hadn't stole their money.  Boomers really don't know how to budget. permalink parent award report block reply Agent_86 2 points 3 days ago Strange how the same reasons always seem to come up. They repeat like an old tune everyone knows by heart, though no one remembers who started it. After a while, you start to wonder if it’s the reasons keeping people stuck or something else entirely. permalink parent award report block reply Smurfection 2 points 2 days ago schools, TheNews™, entertainment. It's what is shaping society.  It should be family, Church and Great Ideas but dummies ain't got time for that. permalink parent award report block reply deleted 1 points 3 days ago GenWashington 1 points 3 days ago He typed the truth but didn't include all generations permalink parent award report block reply view 1 more comments... glow-operator-2-0 3 points 3 days ago We would have our interstellar empire now if it weren't for them. permalink parent award report block reply Capoditutticapi1 OP 3 points 3 days ago Exactly! ....and the flying cars we were promised! One in every driveway, or landing pad as it were... permalink parent award report block reply load 14 more comments... CommanderOfCheese 14 points 3 days ago You mean \"Our Democracy (TM)\" permalink parent award report block reply HeavyMetalPatriot 3 points 3 days ago To the left, \"democracy\" simply means \"rule by democrats\" permalink parent award report block reply NotYourMan 9 points 3 days ago This map explains the democrat \"conquest\" of the country.  Use USAID and other tax payer money to \"buy\" judges, mayors, city councils members then rewrite the voting laws so democrats can never lose.  Arrests must happen and I mean arresting people working on ballot counting. permalink parent award report block reply RedStoneDeepState -13 points 3 days ago Ah yes, churches are subversive activities permalink parent award report block reply Mortal_Wombat 16 points 3 days ago You see all those rainbow flags at churches over the past few years? That isn't a subversive ideology embraced by some of these fucktards? And they know it is too. permalink parent award report block reply breadbaker 3 points 3 days ago Churches are major NGOs. They often incorporate an NGO and gain local power that way. permalink parent award report block reply Mortal_Wombat 1 points 3 days ago That whole NGO shit is fucked. Including Red Cross and those fucking \"bell ringers\". permalink parent award report block reply DrCowboyPresident 11 points 3 days ago Mainline churches are, and it's nothing new. Take a look at this, and note the date of publication. https://time.com/archive/6603746/religion-american-malvern/ permalink parent award report block reply RedStoneDeepState -8 points 3 days ago That was FDR pushing communism. permalink parent award report block reply Iremembermypassword 9 points 3 days ago Next you will tell us Mosques don‘t engage in subversive activities. permalink parent award report block reply NeoDragoon 5 points 3 days ago It's part of a thread on USAID, churches are not being discussed. permalink parent award report block reply schiff_for_brains 2 points 3 days ago always-has-been.jpg permalink parent award report block reply load 2 more comments...\nCapoditutticapi1 OP 104 points 3 days ago Imagine if you will the United States of America without NGO's siphoning, stealing, hoarding, embezzling, trillions in taxpayer money, how much closer to the American Dream most US Citizens would be right now... permalink parent award report block reply suckmycorona 30 points 3 days ago But what about the Clinton’s? Don’t you fee fees for them? permalink parent award report block reply Aoikaze2000 6 points 3 days ago I'd say they can go fuck themselves, but HRC might suicide me. permalink parent award report block reply DT170x 4 points 3 days ago ok I will say that to their demonic faces. Later u/DT170x was found dead at his house with 3 bullet holes in his head while stuffed into a duffle bag. Police ruled suicide. permalink parent award report block reply view 2 more comments... Spicy_cat 15 points 3 days ago Don't be antisemitic permalink parent award report block reply YaharaRiver 5 points 3 days ago Correct. Better and smarter to be islamaphobic, every single time! List of pisslamic NGOs: https://ngobase.org/swa/RLG.IS/islam-ngos-charities There’s 1,759 of them. ☠️ permalink parent award report block reply IForgotToAddAnEmail 5 points 3 days ago Incorrect, it's better to be weary of both. America First and only. MAGA BABY. permalink parent award report block reply Worldtraveler0405 4 points 3 days ago Funded by Wahhabi Arab oil from Dubai, Abu Dhabi, Qatar and Riyadh etc. permalink parent award report block reply Viewer01 12 points 3 days ago Our entire economy is built around do nothing lazy girl jobs meant to keep them out of the house and not having babies. Our economy isn’t real permalink parent award report block reply terribletwos 6 points 3 days ago I was about to say something similar. All these NGOs are just fake college girl jobs used to funnel fraud to themselves and the people who gave them money. permalink parent award report block reply breadbaker 2 points 3 days ago They came about via Reagan's abdication of government solving stuff, empowering private players -- often private social science majors, coming up with speculative solutions (like letting institutionalized mentally ill people be care for by their tired, worn out families), shoving insufficient funds their ways, and 1990 George Bush's  1000 points of light bullshit speech. The fact is women were just minor participants until the me, too moment made guys quit the senior positions out of guilt or fear. permalink parent award report block reply view 1 more comments... Agent_86 3 points 3 days ago I bet your hiding Rudolph The red nose reindeer in your closet aren't you? <---Heavy german accent. permalink parent award report block reply Smurfection 11 points 3 days ago Boomers would have all been millionaires right now if government hadn't stole their money.  Boomers really don't know how to budget. permalink parent award report block reply Agent_86 2 points 3 days ago Strange how the same reasons always seem to come up. They repeat like an old tune everyone knows by heart, though no one remembers who started it. After a while, you start to wonder if it’s the reasons keeping people stuck or something else entirely. permalink parent award report block reply Smurfection 2 points 2 days ago schools, TheNews™, entertainment. It's what is shaping society.  It should be family, Church and Great Ideas but dummies ain't got time for that. permalink parent award report block reply deleted 1 points 3 days ago GenWashington 1 points 3 days ago He typed the truth but didn't include all generations permalink parent award report block reply view 1 more comments... glow-operator-2-0 3 points 3 days ago We would have our interstellar empire now if it weren't for them. permalink parent award report block reply Capoditutticapi1 OP 3 points 3 days ago Exactly! ....and the flying cars we were promised! One in every driveway, or landing pad as it were... permalink parent award report block reply load 14 more comments...\nsuckmycorona 30 points 3 days ago But what about the Clinton’s? Don’t you fee fees for them? permalink parent award report block reply Aoikaze2000 6 points 3 days ago I'd say they can go fuck themselves, but HRC might suicide me. permalink parent award report block reply DT170x 4 points 3 days ago ok I will say that to their demonic faces. Later u/DT170x was found dead at his house with 3 bullet holes in his head while stuffed into a duffle bag. Police ruled suicide. permalink parent award report block reply view 2 more comments...\nAoikaze2000 6 points 3 days ago I'd say they can go fuck themselves, but HRC might suicide me. permalink parent award report block reply DT170x 4 points 3 days ago ok I will say that to their demonic faces. Later u/DT170x was found dead at his house with 3 bullet holes in his head while stuffed into a duffle bag. Police ruled suicide. permalink parent award report block reply view 2 more comments...\nDT170x 4 points 3 days ago ok I will say that to their demonic faces. Later u/DT170x was found dead at his house with 3 bullet holes in his head while stuffed into a duffle bag. Police ruled suicide. permalink parent award report block reply view 2 more comments...\nSpicy_cat 15 points 3 days ago Don't be antisemitic permalink parent award report block reply YaharaRiver 5 points 3 days ago Correct. Better and smarter to be islamaphobic, every single time! List of pisslamic NGOs: https://ngobase.org/swa/RLG.IS/islam-ngos-charities There’s 1,759 of them. ☠️ permalink parent award report block reply IForgotToAddAnEmail 5 points 3 days ago Incorrect, it's better to be weary of both. America First and only. MAGA BABY. permalink parent award report block reply Worldtraveler0405 4 points 3 days ago Funded by Wahhabi Arab oil from Dubai, Abu Dhabi, Qatar and Riyadh etc. permalink parent award report block reply\nYaharaRiver 5 points 3 days ago Correct. Better and smarter to be islamaphobic, every single time! List of pisslamic NGOs: https://ngobase.org/swa/RLG.IS/islam-ngos-charities There’s 1,759 of them. ☠️ permalink parent award report block reply IForgotToAddAnEmail 5 points 3 days ago Incorrect, it's better to be weary of both. America First and only. MAGA BABY. permalink parent award report block reply Worldtraveler0405 4 points 3 days ago Funded by Wahhabi Arab oil from Dubai, Abu Dhabi, Qatar and Riyadh etc. permalink parent award report block reply\nIForgotToAddAnEmail 5 points 3 days ago Incorrect, it's better to be weary of both. America First and only. MAGA BABY. permalink parent award report block reply\nWorldtraveler0405 4 points 3 days ago Funded by Wahhabi Arab oil from Dubai, Abu Dhabi, Qatar and Riyadh etc. permalink parent award report block reply\nViewer01 12 points 3 days ago Our entire economy is built around do nothing lazy girl jobs meant to keep them out of the house and not having babies. Our economy isn’t real permalink parent award report block reply terribletwos 6 points 3 days ago I was about to say something similar. All these NGOs are just fake college girl jobs used to funnel fraud to themselves and the people who gave them money. permalink parent award report block reply breadbaker 2 points 3 days ago They came about via Reagan's abdication of government solving stuff, empowering private players -- often private social science majors, coming up with speculative solutions (like letting institutionalized mentally ill people be care for by their tired, worn out families), shoving insufficient funds their ways, and 1990 George Bush's  1000 points of light bullshit speech. The fact is women were just minor participants until the me, too moment made guys quit the senior positions out of guilt or fear. permalink parent award report block reply view 1 more comments... Agent_86 3 points 3 days ago I bet your hiding Rudolph The red nose reindeer in your closet aren't you? <---Heavy german accent. permalink parent award report block reply\nterribletwos 6 points 3 days ago I was about to say something similar. All these NGOs are just fake college girl jobs used to funnel fraud to themselves and the people who gave them money. permalink parent award report block reply breadbaker 2 points 3 days ago They came about via Reagan's abdication of government solving stuff, empowering private players -- often private social science majors, coming up with speculative solutions (like letting institutionalized mentally ill people be care for by their tired, worn out families), shoving insufficient funds their ways, and 1990 George Bush's  1000 points of light bullshit speech. The fact is women were just minor participants until the me, too moment made guys quit the senior positions out of guilt or fear. permalink parent award report block reply view 1 more comments...\nbreadbaker 2 points 3 days ago They came about via Reagan's abdication of government solving stuff, empowering private players -- often private social science majors, coming up with speculative solutions (like letting institutionalized mentally ill people be care for by their tired, worn out families), shoving insufficient funds their ways, and 1990 George Bush's  1000 points of light bullshit speech. The fact is women were just minor participants until the me, too moment made guys quit the senior positions out of guilt or fear. permalink parent award report block reply view 1 more comments...\nAgent_86 3 points 3 days ago I bet your hiding Rudolph The red nose reindeer in your closet aren't you? <---Heavy german accent. permalink parent award report block reply\nSmurfection 11 points 3 days ago Boomers would have all been millionaires right now if government hadn't stole their money.  Boomers really don't know how to budget. permalink parent award report block reply Agent_86 2 points 3 days ago Strange how the same reasons always seem to come up. They repeat like an old tune everyone knows by heart, though no one remembers who started it. After a while, you start to wonder if it’s the reasons keeping people stuck or something else entirely. permalink parent award report block reply Smurfection 2 points 2 days ago schools, TheNews™, entertainment. It's what is shaping society.  It should be family, Church and Great Ideas but dummies ain't got time for that. permalink parent award report block reply deleted 1 points 3 days ago GenWashington 1 points 3 days ago He typed the truth but didn't include all generations permalink parent award report block reply view 1 more comments...\nAgent_86 2 points 3 days ago Strange how the same reasons always seem to come up. They repeat like an old tune everyone knows by heart, though no one remembers who started it. After a while, you start to wonder if it’s the reasons keeping people stuck or something else entirely. permalink parent award report block reply Smurfection 2 points 2 days ago schools, TheNews™, entertainment. It's what is shaping society.  It should be family, Church and Great Ideas but dummies ain't got time for that. permalink parent award report block reply\nSmurfection 2 points 2 days ago schools, TheNews™, entertainment. It's what is shaping society.  It should be family, Church and Great Ideas but dummies ain't got time for that. permalink parent award report block reply\ndeleted 1 points 3 days ago GenWashington 1 points 3 days ago He typed the truth but didn't include all generations permalink parent award report block reply view 1 more comments...\nGenWashington 1 points 3 days ago He typed the truth but didn't include all generations permalink parent award report block reply view 1 more comments...\nglow-operator-2-0 3 points 3 days ago We would have our interstellar empire now if it weren't for them. permalink parent award report block reply Capoditutticapi1 OP 3 points 3 days ago Exactly! ....and the flying cars we were promised! One in every driveway, or landing pad as it were... permalink parent award report block reply\nCapoditutticapi1 OP 3 points 3 days ago Exactly! ....and the flying cars we were promised! One in every driveway, or landing pad as it were... permalink parent award report block reply\nCommanderOfCheese 14 points 3 days ago You mean \"Our Democracy (TM)\" permalink parent award report block reply HeavyMetalPatriot 3 points 3 days ago To the left, \"democracy\" simply means \"rule by democrats\" permalink parent award report block reply\nHeavyMetalPatriot 3 points 3 days ago To the left, \"democracy\" simply means \"rule by democrats\" permalink parent award report block reply\nNotYourMan 9 points 3 days ago This map explains the democrat \"conquest\" of the country.  Use USAID and other tax payer money to \"buy\" judges, mayors, city councils members then rewrite the voting laws so democrats can never lose.  Arrests must happen and I mean arresting people working on ballot counting. permalink parent award report block reply\nRedStoneDeepState -13 points 3 days ago Ah yes, churches are subversive activities permalink parent award report block reply Mortal_Wombat 16 points 3 days ago You see all those rainbow flags at churches over the past few years? That isn't a subversive ideology embraced by some of these fucktards? And they know it is too. permalink parent award report block reply breadbaker 3 points 3 days ago Churches are major NGOs. They often incorporate an NGO and gain local power that way. permalink parent award report block reply Mortal_Wombat 1 points 3 days ago That whole NGO shit is fucked. Including Red Cross and those fucking \"bell ringers\". permalink parent award report block reply DrCowboyPresident 11 points 3 days ago Mainline churches are, and it's nothing new. Take a look at this, and note the date of publication. https://time.com/archive/6603746/religion-american-malvern/ permalink parent award report block reply RedStoneDeepState -8 points 3 days ago That was FDR pushing communism. permalink parent award report block reply Iremembermypassword 9 points 3 days ago Next you will tell us Mosques don‘t engage in subversive activities. permalink parent award report block reply NeoDragoon 5 points 3 days ago It's part of a thread on USAID, churches are not being discussed. permalink parent award report block reply schiff_for_brains 2 points 3 days ago always-has-been.jpg permalink parent award report block reply load 2 more comments...\nMortal_Wombat 16 points 3 days ago You see all those rainbow flags at churches over the past few years? That isn't a subversive ideology embraced by some of these fucktards? And they know it is too. permalink parent award report block reply breadbaker 3 points 3 days ago Churches are major NGOs. They often incorporate an NGO and gain local power that way. permalink parent award report block reply Mortal_Wombat 1 points 3 days ago That whole NGO shit is fucked. Including Red Cross and those fucking \"bell ringers\". permalink parent award report block reply\nbreadbaker 3 points 3 days ago Churches are major NGOs. They often incorporate an NGO and gain local power that way. permalink parent award report block reply Mortal_Wombat 1 points 3 days ago That whole NGO shit is fucked. Including Red Cross and those fucking \"bell ringers\". permalink parent award report block reply\nMortal_Wombat 1 points 3 days ago That whole NGO shit is fucked. Including Red Cross and those fucking \"bell ringers\". permalink parent award report block reply\nDrCowboyPresident 11 points 3 days ago Mainline churches are, and it's nothing new. Take a look at this, and note the date of publication. https://time.com/archive/6603746/religion-american-malvern/ permalink parent award report block reply RedStoneDeepState -8 points 3 days ago That was FDR pushing communism. permalink parent award report block reply\nRedStoneDeepState -8 points 3 days ago That was FDR pushing communism. permalink parent award report block reply\nIremembermypassword 9 points 3 days ago Next you will tell us Mosques don‘t engage in subversive activities. permalink parent award report block reply\nNeoDragoon 5 points 3 days ago It's part of a thread on USAID, churches are not being discussed. permalink parent award report block reply\nschiff_for_brains 2 points 3 days ago always-has-been.jpg permalink parent award report block reply\nIncredibleMrE1 44 points 3 days ago So many demons. America needs an exorcism. permalink award report block reply Spicy_cat 18 points 3 days ago When based Zoomers form Demon Slayer Corps and start beheading demons remember to nullify if you're on their jury permalink parent award report block reply MastaJoda 8 points 3 days ago Nulify? If I see mfs finally out there solving problems with their guns Im going to start checking names off my list as well. permalink parent award report block reply HeavyMetalPatriot 2 points 3 days ago If based Zs start taking heads, based Xs better get their asses out there to compete for high score. permalink parent award report block reply Spicy_cat 1 points 3 days ago Xers are basically just the tail end of the boomers.  They got to spend much of their career in what was still a functioning economy. permalink parent award report block reply Cacciali_Via 1 points 2 days ago Xers worked through the dot com bust, then the Great Recession. Also sky high interest rates that Gen Z has never experienced. We also simultaneously suffered through the advent of outsourcing and h1bs. There were some good years in there but we have been through plenty of economic shit. permalink parent award report block reply\nSpicy_cat 18 points 3 days ago When based Zoomers form Demon Slayer Corps and start beheading demons remember to nullify if you're on their jury permalink parent award report block reply MastaJoda 8 points 3 days ago Nulify? If I see mfs finally out there solving problems with their guns Im going to start checking names off my list as well. permalink parent award report block reply HeavyMetalPatriot 2 points 3 days ago If based Zs start taking heads, based Xs better get their asses out there to compete for high score. permalink parent award report block reply Spicy_cat 1 points 3 days ago Xers are basically just the tail end of the boomers.  They got to spend much of their career in what was still a functioning economy. permalink parent award report block reply Cacciali_Via 1 points 2 days ago Xers worked through the dot com bust, then the Great Recession. Also sky high interest rates that Gen Z has never experienced. We also simultaneously suffered through the advent of outsourcing and h1bs. There were some good years in there but we have been through plenty of economic shit. permalink parent award report block reply\nMastaJoda 8 points 3 days ago Nulify? If I see mfs finally out there solving problems with their guns Im going to start checking names off my list as well. permalink parent award report block reply\nHeavyMetalPatriot 2 points 3 days ago If based Zs start taking heads, based Xs better get their asses out there to compete for high score. permalink parent award report block reply Spicy_cat 1 points 3 days ago Xers are basically just the tail end of the boomers.  They got to spend much of their career in what was still a functioning economy. permalink parent award report block reply Cacciali_Via 1 points 2 days ago Xers worked through the dot com bust, then the Great Recession. Also sky high interest rates that Gen Z has never experienced. We also simultaneously suffered through the advent of outsourcing and h1bs. There were some good years in there but we have been through plenty of economic shit. permalink parent award report block reply\nSpicy_cat 1 points 3 days ago Xers are basically just the tail end of the boomers.  They got to spend much of their career in what was still a functioning economy. permalink parent award report block reply Cacciali_Via 1 points 2 days ago Xers worked through the dot com bust, then the Great Recession. Also sky high interest rates that Gen Z has never experienced. We also simultaneously suffered through the advent of outsourcing and h1bs. There were some good years in there but we have been through plenty of economic shit. permalink parent award report block reply\nCacciali_Via 1 points 2 days ago Xers worked through the dot com bust, then the Great Recession. Also sky high interest rates that Gen Z has never experienced. We also simultaneously suffered through the advent of outsourcing and h1bs. There were some good years in there but we have been through plenty of economic shit. permalink parent award report block reply\nSmurfection 23 points 3 days ago I do not want our government funding NGOs.  NGOs have no place with government.  Period. While we're at it, repeal the Davis Bacon Act so all projects and maintenance contracts are open to whoever can do the job, not who can offer the most donations and kickbacks. permalink award report block reply A_Little_White_Duck 7 points 3 days ago But oh my, you'll get shoddy non-union workers and your building will collapse... permalink parent award report block reply Smurfection 1 points 2 days ago Hahahaha!   The best projects done under budget and on time with good quality work are non-union  white guys. permalink parent award report block reply OrangeManBadasss 2 points 3 days ago If they are non government organizations why should they get government funding? permalink parent award report block reply Smurfection 2 points 2 days ago How else would the kickbacks work?  You can't do the money laundering and kickbacks unless government partners with the people they want to do favors for. permalink parent award report block reply rivetjoint2 1 points 3 days ago Because they are doing the dirty work that the government can’t. permalink parent award report block reply Smurfection 1 points 2 days ago Explain to me how Vanessa Kerry's (John Kerry's billionaire heiress daughter) was doing the government's work by setting up a tent in Afghanistan, hiring her millionaire heiress Art history major friend to go there and teach how The Toilet is a great piece of modern art to Afghan women?   Please explain how that's doing the dirty work the government can't. https://www.youtube.com/watch?v=wdrvpSfJM1w Seriously, explain to me why a few extremely wealthy heiresses are doing the dirty work government won't do? permalink parent award report block reply\nA_Little_White_Duck 7 points 3 days ago But oh my, you'll get shoddy non-union workers and your building will collapse... permalink parent award report block reply Smurfection 1 points 2 days ago Hahahaha!   The best projects done under budget and on time with good quality work are non-union  white guys. permalink parent award report block reply\nSmurfection 1 points 2 days ago Hahahaha!   The best projects done under budget and on time with good quality work are non-union  white guys. permalink parent award report block reply\nOrangeManBadasss 2 points 3 days ago If they are non government organizations why should they get government funding? permalink parent award report block reply Smurfection 2 points 2 days ago How else would the kickbacks work?  You can't do the money laundering and kickbacks unless government partners with the people they want to do favors for. permalink parent award report block reply rivetjoint2 1 points 3 days ago Because they are doing the dirty work that the government can’t. permalink parent award report block reply Smurfection 1 points 2 days ago Explain to me how Vanessa Kerry's (John Kerry's billionaire heiress daughter) was doing the government's work by setting up a tent in Afghanistan, hiring her millionaire heiress Art history major friend to go there and teach how The Toilet is a great piece of modern art to Afghan women?   Please explain how that's doing the dirty work the government can't. https://www.youtube.com/watch?v=wdrvpSfJM1w Seriously, explain to me why a few extremely wealthy heiresses are doing the dirty work government won't do? permalink parent award report block reply\nSmurfection 2 points 2 days ago How else would the kickbacks work?  You can't do the money laundering and kickbacks unless government partners with the people they want to do favors for. permalink parent award report block reply\nrivetjoint2 1 points 3 days ago Because they are doing the dirty work that the government can’t. permalink parent award report block reply Smurfection 1 points 2 days ago Explain to me how Vanessa Kerry's (John Kerry's billionaire heiress daughter) was doing the government's work by setting up a tent in Afghanistan, hiring her millionaire heiress Art history major friend to go there and teach how The Toilet is a great piece of modern art to Afghan women?   Please explain how that's doing the dirty work the government can't. https://www.youtube.com/watch?v=wdrvpSfJM1w Seriously, explain to me why a few extremely wealthy heiresses are doing the dirty work government won't do? permalink parent award report block reply\nSmurfection 1 points 2 days ago Explain to me how Vanessa Kerry's (John Kerry's billionaire heiress daughter) was doing the government's work by setting up a tent in Afghanistan, hiring her millionaire heiress Art history major friend to go there and teach how The Toilet is a great piece of modern art to Afghan women?   Please explain how that's doing the dirty work the government can't. https://www.youtube.com/watch?v=wdrvpSfJM1w Seriously, explain to me why a few extremely wealthy heiresses are doing the dirty work government won't do? permalink parent award report block reply\nTrumpLandslide20201 22 points 3 days ago We should all be rich as shit not just the few, the few that bitch and moan about Kings permalink award report block reply schiff_for_brains 3 points 3 days ago If everybody is rich, we're all equally poor. permalink parent award report block reply BlippiIsAPedo 5 points 3 days ago Not if every rich person does not spend their money as if it needs to be spent that moment permalink parent award report block reply\nschiff_for_brains 3 points 3 days ago If everybody is rich, we're all equally poor. permalink parent award report block reply BlippiIsAPedo 5 points 3 days ago Not if every rich person does not spend their money as if it needs to be spent that moment permalink parent award report block reply\nBlippiIsAPedo 5 points 3 days ago Not if every rich person does not spend their money as if it needs to be spent that moment permalink parent award report block reply\nHanging_Chad 15 points 3 days ago they look purple to me permalink award report block reply MasterChief 8 points 3 days ago Not trying to be an asshole, I'm colorblind as hell. Have you ever done one of these? https://www.colorlitelens.com/ishihara-test.html permalink parent award report block reply Hanging_Chad 13 points 3 days ago HEX: #5035D2 red: 80 green: 53 blue: 210 the color’s name is “iris” https://en.wikipedia.org/wiki/Iris_(color) permalink parent award report block reply MasterChief 8 points 3 days ago ha gottem\nI can't tell the difference myself until someone tells me what color it is. Found out the hard way when applying to the AF permalink parent award report block reply walls4america 5 points 3 days ago If it helps you feel any better, and you’re male, I heard that the majority of those colorblind are male. I’d never heard of colorblindness until I was about 7. My mom had sent my dad to the store and while there to pick up a pack of pink Charmin toilet paper. He came home with green (a color my mom detested in TP) and when she asked him why he got green, he said it looked pink to him. That was when I learned he was colorblind. So we females of the family had to remember his colorblindness in the rare times we needed him to pick up anything for us ….and wanted a certain color. (But several years later Charmin stopped making colored TP, so that solved that issue.) permalink parent award report block reply GuerillaYourDreams 8 points 3 days ago I find that very cool. I wanted to find out if I had any color blindness and I passed 100%. permalink parent award report block reply Yheymos 2 points 2 days ago I searched for this comment because, yes they are purple! permalink parent award report block reply Mortal_Wombat 2 points 3 days ago Cobalt blue permalink parent award report block reply Capoditutticapi1 OP 2 points 3 days ago #6A0DAD (a deep purple, also known as \"Indigo\" or \"Royal Purple)  Calling it blue is a nice touch tying it to DemonRats though... permalink parent award report block reply\nMasterChief 8 points 3 days ago Not trying to be an asshole, I'm colorblind as hell. Have you ever done one of these? https://www.colorlitelens.com/ishihara-test.html permalink parent award report block reply Hanging_Chad 13 points 3 days ago HEX: #5035D2 red: 80 green: 53 blue: 210 the color’s name is “iris” https://en.wikipedia.org/wiki/Iris_(color) permalink parent award report block reply MasterChief 8 points 3 days ago ha gottem\nI can't tell the difference myself until someone tells me what color it is. Found out the hard way when applying to the AF permalink parent award report block reply walls4america 5 points 3 days ago If it helps you feel any better, and you’re male, I heard that the majority of those colorblind are male. I’d never heard of colorblindness until I was about 7. My mom had sent my dad to the store and while there to pick up a pack of pink Charmin toilet paper. He came home with green (a color my mom detested in TP) and when she asked him why he got green, he said it looked pink to him. That was when I learned he was colorblind. So we females of the family had to remember his colorblindness in the rare times we needed him to pick up anything for us ….and wanted a certain color. (But several years later Charmin stopped making colored TP, so that solved that issue.) permalink parent award report block reply GuerillaYourDreams 8 points 3 days ago I find that very cool. I wanted to find out if I had any color blindness and I passed 100%. permalink parent award report block reply\nHanging_Chad 13 points 3 days ago HEX: #5035D2 red: 80 green: 53 blue: 210 the color’s name is “iris” https://en.wikipedia.org/wiki/Iris_(color) permalink parent award report block reply MasterChief 8 points 3 days ago ha gottem\nI can't tell the difference myself until someone tells me what color it is. Found out the hard way when applying to the AF permalink parent award report block reply walls4america 5 points 3 days ago If it helps you feel any better, and you’re male, I heard that the majority of those colorblind are male. I’d never heard of colorblindness until I was about 7. My mom had sent my dad to the store and while there to pick up a pack of pink Charmin toilet paper. He came home with green (a color my mom detested in TP) and when she asked him why he got green, he said it looked pink to him. That was when I learned he was colorblind. So we females of the family had to remember his colorblindness in the rare times we needed him to pick up anything for us ….and wanted a certain color. (But several years later Charmin stopped making colored TP, so that solved that issue.) permalink parent award report block reply\nMasterChief 8 points 3 days ago ha gottem\nI can't tell the difference myself until someone tells me what color it is. Found out the hard way when applying to the AF permalink parent award report block reply walls4america 5 points 3 days ago If it helps you feel any better, and you’re male, I heard that the majority of those colorblind are male. I’d never heard of colorblindness until I was about 7. My mom had sent my dad to the store and while there to pick up a pack of pink Charmin toilet paper. He came home with green (a color my mom detested in TP) and when she asked him why he got green, he said it looked pink to him. That was when I learned he was colorblind. So we females of the family had to remember his colorblindness in the rare times we needed him to pick up anything for us ….and wanted a certain color. (But several years later Charmin stopped making colored TP, so that solved that issue.) permalink parent award report block reply\nwalls4america 5 points 3 days ago If it helps you feel any better, and you’re male, I heard that the majority of those colorblind are male. I’d never heard of colorblindness until I was about 7. My mom had sent my dad to the store and while there to pick up a pack of pink Charmin toilet paper. He came home with green (a color my mom detested in TP) and when she asked him why he got green, he said it looked pink to him. That was when I learned he was colorblind. So we females of the family had to remember his colorblindness in the rare times we needed him to pick up anything for us ….and wanted a certain color. (But several years later Charmin stopped making colored TP, so that solved that issue.) permalink parent award report block reply\nGuerillaYourDreams 8 points 3 days ago I find that very cool. I wanted to find out if I had any color blindness and I passed 100%. permalink parent award report block reply\nYheymos 2 points 2 days ago I searched for this comment because, yes they are purple! permalink parent award report block reply\nMortal_Wombat 2 points 3 days ago Cobalt blue permalink parent award report block reply\nCapoditutticapi1 OP 2 points 3 days ago #6A0DAD (a deep purple, also known as \"Indigo\" or \"Royal Purple)  Calling it blue is a nice touch tying it to DemonRats though... permalink parent award report block reply\nIremembermypassword 12 points 3 days ago This is literal foreign funded sedition! Where is the Donald? permalink award report block reply\nirongeek 11 points 3 days ago Everyone has a short term memory. Nobody was held accountable for fraud  from  DOGE finding. permalink award report block reply\nFilo76 9 points 3 days ago NGO:  Non-Governmental Organization /doubt permalink award report block reply walls4america 9 points 3 days ago No, actually it’s true. 😜 NGOs = Color Revolution. So, in trying to overthrow governments they are an organization that’s for making governments non-governments. The link to her thread I’ll give again here. She says the international NGOs have been trying to do a color revolution in the US.  At the US taxpayers’ expense. As of Inauguration Day, they’ve had to readjust their tactics. https://nitter.net/DataRepublican/status/1987569380738408622 permalink parent award report block reply Nibba2 3 points 3 days ago You’re right, it’s probably higher. Just type NGO into google and see how many it pulls up locally alone. permalink parent award report block reply OxAO 2 points 3 days ago both right.  They're Non-Governmental Organization(NGO) but the government pays a large part of their operations.\nWhich means it's not really Non-government. Same concept that Aerojet Rocketdyne, Lockheed and most military production business models have been running on. Corporations and the state work together this was the concept of Max Stirner that later was called Fascists-syndicalist predecessor of fascism permalink parent award report block reply\nwalls4america 9 points 3 days ago No, actually it’s true. 😜 NGOs = Color Revolution. So, in trying to overthrow governments they are an organization that’s for making governments non-governments. The link to her thread I’ll give again here. She says the international NGOs have been trying to do a color revolution in the US.  At the US taxpayers’ expense. As of Inauguration Day, they’ve had to readjust their tactics. https://nitter.net/DataRepublican/status/1987569380738408622 permalink parent award report block reply\nNibba2 3 points 3 days ago You’re right, it’s probably higher. Just type NGO into google and see how many it pulls up locally alone. permalink parent award report block reply\nOxAO 2 points 3 days ago both right.  They're Non-Governmental Organization(NGO) but the government pays a large part of their operations.\nWhich means it's not really Non-government. Same concept that Aerojet Rocketdyne, Lockheed and most military production business models have been running on. Corporations and the state work together this was the concept of Max Stirner that later was called Fascists-syndicalist predecessor of fascism permalink parent award report block reply\nMythArcana 8 points 3 days ago Nice to know where our tax dollars are really going. permalink award report block reply\ndeleted 7 points 3 days ago MrHarryReems 4 points 3 days ago How else is the government going to do things that pesky constitution says they can't do? permalink parent award report block reply\nMrHarryReems 4 points 3 days ago How else is the government going to do things that pesky constitution says they can't do? permalink parent award report block reply\nACActual 6 points 3 days ago This is a sign of how complete the corruption really is.  Its the legal looting of the Treasury by politicians.  They know debt at 120% of GDP is unrecoverable.  The currency will fail in no more than a few years.   We followed the same pattern as every superpower since Spain permalink award report block reply Capoditutticapi1 OP 4 points 3 days ago Only 2 ways to stop it..., the hard way..., or the harder way! permalink parent award report block reply ACActual 3 points 3 days ago I recommend frens start studying Social Decay, Collapse.  Form groups of like minded willing to barter.  The larger the group the better permalink parent award report block reply\nCapoditutticapi1 OP 4 points 3 days ago Only 2 ways to stop it..., the hard way..., or the harder way! permalink parent award report block reply ACActual 3 points 3 days ago I recommend frens start studying Social Decay, Collapse.  Form groups of like minded willing to barter.  The larger the group the better permalink parent award report block reply\nACActual 3 points 3 days ago I recommend frens start studying Social Decay, Collapse.  Form groups of like minded willing to barter.  The larger the group the better permalink parent award report block reply\nKarenLukasik 5 points 3 days ago Good heavens,when can we start saying “was an NGO” permalink award report block reply\nCh3f4554551n 5 points 3 days ago Remember when a 'non-governmental organization' was just called a business? Pepperidge Farm... permalink award report block reply\nJustInTime2_ 4 points 3 days ago All should be audited. permalink award report block reply\nCville123 4 points 3 days ago Cut the money off permalink award report block reply\nAggrieved03 4 points 3 days ago Every one of us are a tax slave funding it all. permalink award report block reply\nwalls4america 4 points 3 days ago Her whole thread and the comments are extra interesting. It goes further in depth. https://nitter.net/DataRepublican/status/1987569380738408622 permalink award report block reply ozgroginexile 3 points 3 days ago This is rippling over into Australia as well. Stanford University are involved in the U16 Online Social Media ban here - which has been put in place by a WEF and Ex-Microsoft employee who was appointed to a bureaucratic position to decide what we can and cannot do online here anymore. permalink parent award report block reply Capoditutticapi1 OP 3 points 3 days ago Great you took the time to look further... permalink parent award report block reply\nozgroginexile 3 points 3 days ago This is rippling over into Australia as well. Stanford University are involved in the U16 Online Social Media ban here - which has been put in place by a WEF and Ex-Microsoft employee who was appointed to a bureaucratic position to decide what we can and cannot do online here anymore. permalink parent award report block reply\nCapoditutticapi1 OP 3 points 3 days ago Great you took the time to look further... permalink parent award report block reply\nTreefiddydiddy 4 points 3 days ago haemorrhaging tax cash to these fkn demons for decades permalink award report block reply\nGuerillaYourDreams 4 points 3 days ago Frightening, the levels of corruption. permalink award report block reply\nMPitcher1776 3 points 3 days ago Shutdown 95% of them. Only keep ones that don't get government money and not affiliated with a politician or lobbyist. permalink award report block reply\nasiatrails 3 points 3 days ago This is explosive permalink award report block reply\nRetardloserimsogay 3 points 3 days ago Map of targets permalink award report block reply\nmcoulton 3 points 3 days ago they used USAID money to build an army permalink award report block reply Capoditutticapi1 OP 1 points 3 days ago Yes they did, do, still at it... permalink parent award report block reply\nCapoditutticapi1 OP 1 points 3 days ago Yes they did, do, still at it... permalink parent award report block reply\nSonOfThunder 3 points 3 days ago Is there a link to that actual map anywhere? permalink award report block reply\nDev404 3 points 3 days ago Much of it funded by Congress at both State and Federal levels. They're NGO in name only, they're 100% under instruction of the government who also gives them protection to keep functioning despite being caught in crime after crime with virtually no punishment. permalink award report block reply\nFusionBlack 3 points 3 days ago This is truly depressing. One big money laundrying operation and still no accountability. There should be stiff prison time for these offenders. If actions are not taken this will be another reason we fail next November. permalink award report block reply\nMPitcher1776 3 points 3 days ago Holy shit. permalink award report block reply\nPaydro 3 points 3 days ago We should just start our own NGO's at this point. Might as well permalink award report block reply\nAgnesDomini 3 points 3 days ago Dang! Why so many in Florida??? permalink award report block reply\nchickeninoven 3 points 3 days ago Look at that tumor around DC just sucking up the grift. permalink award report block reply\nbobbacringo 2 points 3 days ago If you would only understand who funds the NGO's. permalink award report block reply\nSurveilThis 2 points 3 days ago NGO = Non-indictable Government Organization. permalink award report block reply\nTrooph-Hurts 2 points 3 days ago End than all permalink award report block reply\nrivetjoint2 2 points 3 days ago Nuke the silent filibuster.  Pass the maga agenda.  Make the cuts, save the Republic.  Of course we know the uni-party can’t have that! permalink award report block reply\nSenaleb 2 points 3 days ago Use to be a big fan of datarepublican, but she's committed to defending Ben Shapiro and Ted Cruz in regards to Israeli money buying off US politicians. Literally the men she is criticizing here who have gotten fat off AIPAC funding. permalink award report block reply\nCianevalies 2 points 3 days ago Florida must be a nice place tax wise for NGOS.. permalink award report block reply\nMegaboom2025 2 points 3 days ago All requiring G money? permalink award report block reply\nHikedelics 2 points 3 days ago Damn go ahead Nevada! Looks like they have even less than Wyoming. permalink award report block reply\nC0drus 2 points 3 days ago In other words: Every blue dot 🔵 is like viagra for commies permalink award report block reply\nGrindelwald 2 points 3 days ago Outlaw government funding of NGOs.  Country would blow up. But better for it. How many “jobs” do they represent? permalink award report block reply\nAtruckdriver 0 points 2 days ago This picture is misleading in that it covers EVERYTHING. From rabid liberal agendas to senior citizen services. Although there is cross over as we have seen with the “get out the grandmas in wheelchairs” program for no kings, I think this is disingenuous. permalink award report block reply\nSugz_Da_Feefth -1 points 3 days ago Slay. permalink award report block reply"}