{"id": "8178511", "contents": "1722 BREAKING: In a stunning move, the 9th U.S. Circuit Court of Appeals has ruled that President Donald Trump can deploy National Guard troops into Portland, Oregon, to protect Immigration and Customs Enforcement (ICE) facilities. This is huge posted 3 days ago by kek_saved_the_world 97 comments award share report block FAN TRUMP ARMY @TRUMP_ARMY_ • 3d 🚨 BREAKING: In a stunning move, the 9th U.S. Circuit Court of Appeals has ruled that President Donald Trump can deploy National Guard troops into Portland, Oregon, to protect Immigration and Customs Enforcement (ICE) facilities. This is huge 🔥\n97 comments Sort by Top Top New Worst Old Save Elon Just Walked Away – And His Reason Changes Everything Read More Ads by Ad.Style BlackPiIIedMAGA 109 points 3 days ago THE COURTS HAVE NO POWER TO DECIDE THIS. TRUMP knows this. HE has the supreme power over the military. permalink award report block reply booga 35 points 3 days ago Sure, but Trump listens to them so they clearly do. permalink parent award report block reply nakedjay 54 points 3 days ago I think Trump is establishing case law so they can't pull this shit again. permalink parent award report block reply CaliAli 21 points 3 days ago Exactly.  The the little bull runs down the hill and fucks a cow.  The big bull walks down and fucks them all. permalink parent award report block reply MAGAGIRL69 6 points 3 days ago Kinky. Does this actually happen in nature? permalink parent award report block reply view 5 more comments... Hanging_Chad 1 points 3 days ago fucks them all including the little bull? permalink parent award report block reply hillaryforprison 6 points 3 days ago Case law like democrats raiding a political opponent's house to try to change the outcome of an election, and like democrats arresting their political rival, using government resources to support a multi million $ smear campaign to disrupt 'democracy', then actually cheat in the elections, and stage an entrapment scheme with hired actors to film and smear any supporters and lock them up for 4 years without any trial, leading to deaths, the treason found through Biden/Burisma, and money laundering found by DOGE. The crimes the democrats did are so outrageous it would take a full 4 years of non stop action to prosecute all these, but because of a poor AG pick nothing is happening except Fox News interviews. This country will be destroyed by letting all these crimes have a pass- I hope people fully understand this. You will never have freedom again in anything. But yeah, let's just patiently wait for \"case law.\" permalink parent award report block reply KennyKetchem 5 points 3 days ago Yeah well there is a lot of laws that the left breaks. When they pull this shit again it is only going to piss us off more when case law is established and ignored. permalink parent award report block reply Rakkasan91b 1 points 3 days ago This isn't setting case law.  Its ceding his executive power to the judiciary through these absurd rulings he's obeying. I don't want him to be a tyrant, but damn he needs to stop asking mom and dad judiciary if he can use his legitimate constitutional powers ever time. permalink parent award report block reply EgregiousPhilbin 7 points 3 days ago Are you allowed to say reality-based stuff in here???? permalink parent award report block reply Liberals_R_Idiots 3 points 3 days ago Why are you such a dooming twat? permalink parent award report block reply NotYourMan 3 points 3 days ago He is undermining the entire \"No Kings\" farce by not behaving like a king.  On the other hand, democrats are acting like tyrants. permalink parent award report block reply SanityGumby 11 points 3 days ago He is following the orders to build a mountain of precedent. This makes his job easier when he needs to be heavy handed later permalink parent award report block reply Senaleb 5 points 3 days ago the thing is, precedent changes the minute a case is brought to the court. Judges change etc. Trying to govern by  setting precedent is just essentially throwing away 4 years of a presidency....or precidentcy (yeah I'm so clever!) permalink parent award report block reply Klown_Kutz 4 points 3 days ago Welcome to Post Constitutional Amurrica. Judges are now our kings. permalink parent award report block reply FusionBlack 2 points 3 days ago This and I am getting tired of this administration sitting on its hands waiting on corrupt judges . permalink parent award report block reply Executarian2 2 points 3 days ago I mean, that's just not true, lol. His power is explicitly limited and Congress have to approve military actions. What reality are you living in? permalink parent award report block reply load 5 more comments... LeRiverDanube 49 points 3 days ago How bout we get some judges arrested now? permalink award report block reply Filo76 32 points 3 days ago No kidding. Trump is winning nearly all these lawfare cases yet they keep throwing injunctions around with zero consequences. They are deliberately slowing him down. We need severe penalties or they will do this for the next 3 years. (And beyond) permalink parent award report block reply cross_bearer_02 7 points 3 days ago “Three Strikes Law” for rogue judges. After being overturned three times by a higher court, that judge is: Automatically impeached and removed from office May no longer seek election or be appointed to any judicial position (local, state, or federal) If they are a lawyer, they are disbarred and no longer eligible to practice law in any state or jurisdiction within the United States or its territories. Is forbidden from lobbying on behalf of any entity, business, organization, political faction, or any other group. Is forbidden from seeing any other office within government. Is forbidden from receiving any sort of security clearance, and any such clearance already given shall be revoked. permalink parent award report block reply SickIcarus 6 points 3 days ago Not a bad idea, but there should be a timeframe where strikes drop off. It’s not always a “rogue judge” - for example, sometimes a public defender just sucks, or an appeals lawyer does a better job, or new evidence is brought to light, etc. permalink parent award report block reply cross_bearer_02 1 points 3 days ago Agreed. Four years. That’s a full term for a President. permalink parent award report block reply EgregiousPhilbin 3 points 3 days ago Have you tried not voting for RINOs? permalink parent award report block reply trumpORbust 3 points 3 days ago Where is that other choice found on the ballot permalink parent award report block reply NotYourMan 1 points 3 days ago Well its good that the judges decided the president can do what the constitution tells us the president can do.  What a waste of time. permalink parent award report block reply henri_derelicte 19 points 3 days ago SCOTUS needs to move their ass and allow the national guard deployment in Chicago permalink award report block reply Beardholder 7 points 3 days ago And of they oppose it's time to arrest the supreme court for treason permalink parent award report block reply TrumpAndGodWin 2 points 3 days ago E.g. if the leftists vote against his very legal use of tariffs. permalink parent award report block reply thisaintitchief76 1 points 3 days ago I believe the ruling of this case will be used as such for everything moving forward. permalink parent award report block reply YodaBannon 19 points 3 days ago win time permalink award report block reply aaafirefly123 14 points 3 days ago Bout damn time. permalink award report block reply bumpman 2 points 3 days ago A little too late, it’s now just a cringey stand off between antifa tards and patriots every night and the cops are finally somewhat doing their job permalink parent award report block reply FrmrAmericanRepublic 13 points 3 days ago Fuck those robed faggots. Yes, it was in our favor but you know what? When you have these robed retards hampering the executive branch in executing duties that PROTECT FUCKING CITIZENS -- well, they can fuck ALL THE WAY OFF. permalink award report block reply they-see-me-trollin 4 points 3 days ago this.  need to start removing the rogue judges.  it's VERY well settled law that the president has very broad authority to defend federal assets, locations, and personnel, including using the military domestically.  it's so well settled that anyone suggesting otherwise is not just factually and legally wrong, they're a subverter activist. what the media has been trying to do is portray this expansive right of the executive as being used improperly for general law enforcement, while gaslighting people into thinking there is no mass violence and unrest in these cities.  the legal standard is higher, but when you have people trying to firebomb federal agents and facilities, crashing vehicles into them, shooting firearms at them, and the local law enforcement has stand-down orders, the insurrection act plainly authorizes deployment of military for such unrest. permalink parent award report block reply Username_here 12 points 3 days ago I don't understand why Trump would comply with any of these Judges rulings. They have zero authority. The fact that the Trump admin doesn't ignore them is disturbing permalink award report block reply TrumpAndGodWin 2 points 3 days ago All of this may just be a long plan to expose the huge corruption so that when he has no other choice than to get extreme the normies won't get in the way or get swept up in a leftist Podesta civil war plan. permalink parent award report block reply raptormissle 9 points 3 days ago All the democrats do is use lawfare when we win. When they win we do shit and take it. permalink award report block reply nautilus 5 points 3 days ago And then we \"conserve\" the new normal. permalink parent award report block reply coinneach007 8 points 3 days ago No this is not huge, this judge should never be able to make another ruling!  That would be huge! permalink award report block reply The_Emperor 1 points 3 days ago Stunning only that it was the 9th circuit.   Common sense regular day most elsewhere/elsewhen. permalink parent award report block reply chuey_316 3 points 3 days ago I could be mistaken, but I am pretty sure this is an old ruling, and the most recent one is from an activist judge blocking Trump. permalink award report block reply quodvox 2 points 3 days ago Nope, this ruling is from Nov 9th.  The Circuit Judge that ruled against Trump was overruled by the 9th Circuit Court of Appeals permalink parent award report block reply Emanresu99 2 points 2 days ago Are there any links to those rulings? permalink parent award report block reply ohwell316 3 points 3 days ago By any means necessary permalink award report block reply Bldg_2019 3 points 3 days ago The military has non-lethal (allegedly) riot control weapons. Perfect testing ground. Use them. HARD. permalink award report block reply ingrowntoenail 3 points 3 days ago Whatever they were planning on sending, quadruple it because they're going to need it to keep those chimps in line. permalink award report block reply Shih_Tabed 2 points 3 days ago Been trying to keep track of this and it seems twice a day this changes to Supreme Court blocks Trump, then Supreme Court allows Trump, etc.  I mean ICE must be like the John Travolta meme from Pulp Fiction by now. permalink award report block reply cosmos411 2 points 3 days ago FFS, can President Trump do anything without courts getting in the fucking way? permalink award report block reply Senaleb 2 points 3 days ago yeah would be hard to defend letting federal agents being shot at and then ruling they can't have federal protection lol. permalink award report block reply anti_masker 2 points 3 days ago Nice. permalink award report block reply hey_spike 1 points 3 days ago The permanent injunction wasn't so permanent. permalink award report block reply MAGASquatch 1 points 3 days ago Hopefully this will be used against the courts trying to obstruct ICE. Can charges be made on the obstructionist judges who refuse to detain illegals and allow criminals back out on the streets? permalink award report block reply Choppermagic 1 points 3 days ago Trump brought more balance to the 9th Circus in his first term permalink award report block reply Ligersrule1 1 points 3 days ago BrEaKiNg permalink award report block reply The_RedWolf 1 points 3 days ago isnt the 9th circuit the most liberal?  or am I misremembering? permalink award report block reply Weeha 1 points 3 days ago IT’S A TRAP! permalink award report block reply MOLON-LABE 1 points 3 days ago Uhhhh yeah. No shit. That's why he did it in the first place. permalink award report block reply 6iggu56icku5 1 points 3 days ago This should never have been in question permalink award report block reply JayKay1776 1 points 3 days ago The commander-in-chief is just being nice to these lower courts they have no authority over what president does with the National Guard or any of the military for that matter. District and appeals and any other chord except for the Supreme Court has no power over the presidency. permalink award report block reply ragnarokrobo 1 points 3 days ago STUNNING permalink award report block reply explodejoystick 1 points 3 days ago Oh gee thanks, 9th circuit court, no fucking shit you waste of human life. permalink award report block reply Speedgraphic69 1 points 3 days ago Mighty white of them permalink award report block reply Quiznos585 1 points 3 days ago The OR federal judge is already drawing up her next injunction over ruling this permalink award report block reply MixedBlacknWhite 1 points 3 days ago I remember a week ago when Faggot Newscome posted on Twitter that Trump was stopped deploying the National Guard. I remember Faggot saying this was a win etc.. Every reply, and I mean EVERY REPLY was saying that would be overturned and Trump will win. Calling Newscome a cock sucker, faggot, weapons grade retard.. the usual. Two things: Trump wins again, but we knew this would happen Where the fuck are the commies on social media? I ask because almost never on social media do I see a commie post that has support. Seriously, where the fuck are these people? It's like they don't exist, but I am told they are the generation on social media.. but nowhere to be found, ever? Weird permalink award report block reply TrumpVoter1 1 points 3 days ago How is this HUGE? SCOTUS and other appeals courts have said the same for other places. This was the only expected outcome permalink award report block reply thisisatestof2 1 points 3 days ago Ah.  One of those occasional the ninth circus actually gets something right decisions. permalink award report block reply ColbyP 1 points 3 days ago I'm not sure why this even needed to go to court. ICE is federal. The National Guard is federal. Both are outside the jurisdiction of individual states, much less individual city mayors getting uppity. permalink award report block reply SanityGumby 1 points 3 days ago Man, whatever happened to their Hawaiian judge permalink award report block reply R3tro 1 points 3 days ago Do much for that lower level permanent injunction permalink award report block reply tlorsung 1 points 3 days ago The Courts know this; they are just creating havoc for all!  These Judges must be fired for bad behavior and not Appling Blind Justice!  All their cases should be reviewed for biases! permalink award report block reply Nate_Higgersalot 1 points 3 days ago Is it huge?  Really?  Curing cancer would be huge. permalink award report block reply thxpk 1 points 3 days ago This is not true permalink award report block reply tommygigantica 1 points 3 days ago this is fucking 20 days old. fucking retards just reposting shit without any research permalink award report block reply MoreGuns 1 points 3 days ago I hope we see our brave ICE agents and Soliders on every street corner permalink award report block reply hillaryforprison 1 points 3 days ago No other president has had to report to faggot judges acting like POTUS. This should not be tolerated. permalink award report block reply pby1000 1 points 3 days ago It is surprising when courts follow the Constitution. permalink award report block reply m0ntsta 1 points 3 days ago I am so sick of these posts saying the judges “allowed” Trump to do this. They don’t “allow” Trump to do anything anymore than my kids “allow” me to enjoy a glass of wine with dinner. You don’t have any fucking say commie fuckbags. permalink award report block reply GreyKnight 1 points 3 days ago It was kinda the point of the executive branch… permalink award report block reply Obambi 0 points 3 days ago I know Trump is establishing case law but he’s too slow on this not really his fault permalink award report block reply Urusovite 0 points 3 days ago a little gift before they undo tariffs and let the world fuck us. permalink award report block reply BirthHole 0 points 3 days ago Thru all these lawsuits, the president is being set that the courts have the right to prevent an elected executive from discharging his duties until they say its OK. and this is bullshit. permalink award report block reply MemeWarsVet -5 points 3 days ago Not really. It won't increase the deportation numbers substantially. It's all a work. permalink award report block reply MasterChief08 2 points 3 days ago The national guard makes ICE & Border Patrol safer. That increases morale and definitely increases productivity. Sending in 200 officers into enemy territory like Portland is a huge risk. Now they have a few thousand guns pointing outwards at the rioters. The federal government is hiring 1000 new ICE agents by January and February. We don't want people quitting. Roughly 2.7 million illegal immigrants have left or been removed this year. We want that number to double next year. The goal is to completely erase the Biden invasion before the next presidential election. permalink parent award report block reply MemeWarsVet 1 points 3 days ago That is good but we need deportations to ramp up drastically. permalink parent award report block reply MasterChief08 1 points 3 days ago They will be. The BBB sets aside approximately $170 billion over four years for immigration enforcement, detention and deportation operations. By 2027 there will be 8000 new border patrol and 10k new ICE. Hiring is just ramping up. 1k new ICE employees will start by January and February. This year so far 2 million have left on their own with the incentives and 500k have been deported. It is very likely next year we will see over a million forced deportations per year. At this rate the Biden invasion will be completely erased before this term is over. This is why we need to absolutely everything possible to stop Democrats from winning power. Starting in three or four years we will be removing 10-20 million. That's when we'll start to see generational power from the left start to erode. permalink parent award report block reply\nBlackPiIIedMAGA 109 points 3 days ago THE COURTS HAVE NO POWER TO DECIDE THIS. TRUMP knows this. HE has the supreme power over the military. permalink award report block reply booga 35 points 3 days ago Sure, but Trump listens to them so they clearly do. permalink parent award report block reply nakedjay 54 points 3 days ago I think Trump is establishing case law so they can't pull this shit again. permalink parent award report block reply CaliAli 21 points 3 days ago Exactly.  The the little bull runs down the hill and fucks a cow.  The big bull walks down and fucks them all. permalink parent award report block reply MAGAGIRL69 6 points 3 days ago Kinky. Does this actually happen in nature? permalink parent award report block reply view 5 more comments... Hanging_Chad 1 points 3 days ago fucks them all including the little bull? permalink parent award report block reply hillaryforprison 6 points 3 days ago Case law like democrats raiding a political opponent's house to try to change the outcome of an election, and like democrats arresting their political rival, using government resources to support a multi million $ smear campaign to disrupt 'democracy', then actually cheat in the elections, and stage an entrapment scheme with hired actors to film and smear any supporters and lock them up for 4 years without any trial, leading to deaths, the treason found through Biden/Burisma, and money laundering found by DOGE. The crimes the democrats did are so outrageous it would take a full 4 years of non stop action to prosecute all these, but because of a poor AG pick nothing is happening except Fox News interviews. This country will be destroyed by letting all these crimes have a pass- I hope people fully understand this. You will never have freedom again in anything. But yeah, let's just patiently wait for \"case law.\" permalink parent award report block reply KennyKetchem 5 points 3 days ago Yeah well there is a lot of laws that the left breaks. When they pull this shit again it is only going to piss us off more when case law is established and ignored. permalink parent award report block reply Rakkasan91b 1 points 3 days ago This isn't setting case law.  Its ceding his executive power to the judiciary through these absurd rulings he's obeying. I don't want him to be a tyrant, but damn he needs to stop asking mom and dad judiciary if he can use his legitimate constitutional powers ever time. permalink parent award report block reply EgregiousPhilbin 7 points 3 days ago Are you allowed to say reality-based stuff in here???? permalink parent award report block reply Liberals_R_Idiots 3 points 3 days ago Why are you such a dooming twat? permalink parent award report block reply NotYourMan 3 points 3 days ago He is undermining the entire \"No Kings\" farce by not behaving like a king.  On the other hand, democrats are acting like tyrants. permalink parent award report block reply SanityGumby 11 points 3 days ago He is following the orders to build a mountain of precedent. This makes his job easier when he needs to be heavy handed later permalink parent award report block reply Senaleb 5 points 3 days ago the thing is, precedent changes the minute a case is brought to the court. Judges change etc. Trying to govern by  setting precedent is just essentially throwing away 4 years of a presidency....or precidentcy (yeah I'm so clever!) permalink parent award report block reply Klown_Kutz 4 points 3 days ago Welcome to Post Constitutional Amurrica. Judges are now our kings. permalink parent award report block reply FusionBlack 2 points 3 days ago This and I am getting tired of this administration sitting on its hands waiting on corrupt judges . permalink parent award report block reply Executarian2 2 points 3 days ago I mean, that's just not true, lol. His power is explicitly limited and Congress have to approve military actions. What reality are you living in? permalink parent award report block reply load 5 more comments...\nbooga 35 points 3 days ago Sure, but Trump listens to them so they clearly do. permalink parent award report block reply nakedjay 54 points 3 days ago I think Trump is establishing case law so they can't pull this shit again. permalink parent award report block reply CaliAli 21 points 3 days ago Exactly.  The the little bull runs down the hill and fucks a cow.  The big bull walks down and fucks them all. permalink parent award report block reply MAGAGIRL69 6 points 3 days ago Kinky. Does this actually happen in nature? permalink parent award report block reply view 5 more comments... Hanging_Chad 1 points 3 days ago fucks them all including the little bull? permalink parent award report block reply hillaryforprison 6 points 3 days ago Case law like democrats raiding a political opponent's house to try to change the outcome of an election, and like democrats arresting their political rival, using government resources to support a multi million $ smear campaign to disrupt 'democracy', then actually cheat in the elections, and stage an entrapment scheme with hired actors to film and smear any supporters and lock them up for 4 years without any trial, leading to deaths, the treason found through Biden/Burisma, and money laundering found by DOGE. The crimes the democrats did are so outrageous it would take a full 4 years of non stop action to prosecute all these, but because of a poor AG pick nothing is happening except Fox News interviews. This country will be destroyed by letting all these crimes have a pass- I hope people fully understand this. You will never have freedom again in anything. But yeah, let's just patiently wait for \"case law.\" permalink parent award report block reply KennyKetchem 5 points 3 days ago Yeah well there is a lot of laws that the left breaks. When they pull this shit again it is only going to piss us off more when case law is established and ignored. permalink parent award report block reply Rakkasan91b 1 points 3 days ago This isn't setting case law.  Its ceding his executive power to the judiciary through these absurd rulings he's obeying. I don't want him to be a tyrant, but damn he needs to stop asking mom and dad judiciary if he can use his legitimate constitutional powers ever time. permalink parent award report block reply EgregiousPhilbin 7 points 3 days ago Are you allowed to say reality-based stuff in here???? permalink parent award report block reply Liberals_R_Idiots 3 points 3 days ago Why are you such a dooming twat? permalink parent award report block reply NotYourMan 3 points 3 days ago He is undermining the entire \"No Kings\" farce by not behaving like a king.  On the other hand, democrats are acting like tyrants. permalink parent award report block reply\nnakedjay 54 points 3 days ago I think Trump is establishing case law so they can't pull this shit again. permalink parent award report block reply CaliAli 21 points 3 days ago Exactly.  The the little bull runs down the hill and fucks a cow.  The big bull walks down and fucks them all. permalink parent award report block reply MAGAGIRL69 6 points 3 days ago Kinky. Does this actually happen in nature? permalink parent award report block reply view 5 more comments... Hanging_Chad 1 points 3 days ago fucks them all including the little bull? permalink parent award report block reply hillaryforprison 6 points 3 days ago Case law like democrats raiding a political opponent's house to try to change the outcome of an election, and like democrats arresting their political rival, using government resources to support a multi million $ smear campaign to disrupt 'democracy', then actually cheat in the elections, and stage an entrapment scheme with hired actors to film and smear any supporters and lock them up for 4 years without any trial, leading to deaths, the treason found through Biden/Burisma, and money laundering found by DOGE. The crimes the democrats did are so outrageous it would take a full 4 years of non stop action to prosecute all these, but because of a poor AG pick nothing is happening except Fox News interviews. This country will be destroyed by letting all these crimes have a pass- I hope people fully understand this. You will never have freedom again in anything. But yeah, let's just patiently wait for \"case law.\" permalink parent award report block reply KennyKetchem 5 points 3 days ago Yeah well there is a lot of laws that the left breaks. When they pull this shit again it is only going to piss us off more when case law is established and ignored. permalink parent award report block reply Rakkasan91b 1 points 3 days ago This isn't setting case law.  Its ceding his executive power to the judiciary through these absurd rulings he's obeying. I don't want him to be a tyrant, but damn he needs to stop asking mom and dad judiciary if he can use his legitimate constitutional powers ever time. permalink parent award report block reply\nCaliAli 21 points 3 days ago Exactly.  The the little bull runs down the hill and fucks a cow.  The big bull walks down and fucks them all. permalink parent award report block reply MAGAGIRL69 6 points 3 days ago Kinky. Does this actually happen in nature? permalink parent award report block reply view 5 more comments... Hanging_Chad 1 points 3 days ago fucks them all including the little bull? permalink parent award report block reply\nMAGAGIRL69 6 points 3 days ago Kinky. Does this actually happen in nature? permalink parent award report block reply view 5 more comments...\nHanging_Chad 1 points 3 days ago fucks them all including the little bull? permalink parent award report block reply\nhillaryforprison 6 points 3 days ago Case law like democrats raiding a political opponent's house to try to change the outcome of an election, and like democrats arresting their political rival, using government resources to support a multi million $ smear campaign to disrupt 'democracy', then actually cheat in the elections, and stage an entrapment scheme with hired actors to film and smear any supporters and lock them up for 4 years without any trial, leading to deaths, the treason found through Biden/Burisma, and money laundering found by DOGE. The crimes the democrats did are so outrageous it would take a full 4 years of non stop action to prosecute all these, but because of a poor AG pick nothing is happening except Fox News interviews. This country will be destroyed by letting all these crimes have a pass- I hope people fully understand this. You will never have freedom again in anything. But yeah, let's just patiently wait for \"case law.\" permalink parent award report block reply\nKennyKetchem 5 points 3 days ago Yeah well there is a lot of laws that the left breaks. When they pull this shit again it is only going to piss us off more when case law is established and ignored. permalink parent award report block reply\nRakkasan91b 1 points 3 days ago This isn't setting case law.  Its ceding his executive power to the judiciary through these absurd rulings he's obeying. I don't want him to be a tyrant, but damn he needs to stop asking mom and dad judiciary if he can use his legitimate constitutional powers ever time. permalink parent award report block reply\nEgregiousPhilbin 7 points 3 days ago Are you allowed to say reality-based stuff in here???? permalink parent award report block reply\nLiberals_R_Idiots 3 points 3 days ago Why are you such a dooming twat? permalink parent award report block reply\nNotYourMan 3 points 3 days ago He is undermining the entire \"No Kings\" farce by not behaving like a king.  On the other hand, democrats are acting like tyrants. permalink parent award report block reply\nSanityGumby 11 points 3 days ago He is following the orders to build a mountain of precedent. This makes his job easier when he needs to be heavy handed later permalink parent award report block reply Senaleb 5 points 3 days ago the thing is, precedent changes the minute a case is brought to the court. Judges change etc. Trying to govern by  setting precedent is just essentially throwing away 4 years of a presidency....or precidentcy (yeah I'm so clever!) permalink parent award report block reply\nSenaleb 5 points 3 days ago the thing is, precedent changes the minute a case is brought to the court. Judges change etc. Trying to govern by  setting precedent is just essentially throwing away 4 years of a presidency....or precidentcy (yeah I'm so clever!) permalink parent award report block reply\nKlown_Kutz 4 points 3 days ago Welcome to Post Constitutional Amurrica. Judges are now our kings. permalink parent award report block reply\nFusionBlack 2 points 3 days ago This and I am getting tired of this administration sitting on its hands waiting on corrupt judges . permalink parent award report block reply\nExecutarian2 2 points 3 days ago I mean, that's just not true, lol. His power is explicitly limited and Congress have to approve military actions. What reality are you living in? permalink parent award report block reply\nLeRiverDanube 49 points 3 days ago How bout we get some judges arrested now? permalink award report block reply Filo76 32 points 3 days ago No kidding. Trump is winning nearly all these lawfare cases yet they keep throwing injunctions around with zero consequences. They are deliberately slowing him down. We need severe penalties or they will do this for the next 3 years. (And beyond) permalink parent award report block reply cross_bearer_02 7 points 3 days ago “Three Strikes Law” for rogue judges. After being overturned three times by a higher court, that judge is: Automatically impeached and removed from office May no longer seek election or be appointed to any judicial position (local, state, or federal) If they are a lawyer, they are disbarred and no longer eligible to practice law in any state or jurisdiction within the United States or its territories. Is forbidden from lobbying on behalf of any entity, business, organization, political faction, or any other group. Is forbidden from seeing any other office within government. Is forbidden from receiving any sort of security clearance, and any such clearance already given shall be revoked. permalink parent award report block reply SickIcarus 6 points 3 days ago Not a bad idea, but there should be a timeframe where strikes drop off. It’s not always a “rogue judge” - for example, sometimes a public defender just sucks, or an appeals lawyer does a better job, or new evidence is brought to light, etc. permalink parent award report block reply cross_bearer_02 1 points 3 days ago Agreed. Four years. That’s a full term for a President. permalink parent award report block reply EgregiousPhilbin 3 points 3 days ago Have you tried not voting for RINOs? permalink parent award report block reply trumpORbust 3 points 3 days ago Where is that other choice found on the ballot permalink parent award report block reply NotYourMan 1 points 3 days ago Well its good that the judges decided the president can do what the constitution tells us the president can do.  What a waste of time. permalink parent award report block reply\nFilo76 32 points 3 days ago No kidding. Trump is winning nearly all these lawfare cases yet they keep throwing injunctions around with zero consequences. They are deliberately slowing him down. We need severe penalties or they will do this for the next 3 years. (And beyond) permalink parent award report block reply cross_bearer_02 7 points 3 days ago “Three Strikes Law” for rogue judges. After being overturned three times by a higher court, that judge is: Automatically impeached and removed from office May no longer seek election or be appointed to any judicial position (local, state, or federal) If they are a lawyer, they are disbarred and no longer eligible to practice law in any state or jurisdiction within the United States or its territories. Is forbidden from lobbying on behalf of any entity, business, organization, political faction, or any other group. Is forbidden from seeing any other office within government. Is forbidden from receiving any sort of security clearance, and any such clearance already given shall be revoked. permalink parent award report block reply SickIcarus 6 points 3 days ago Not a bad idea, but there should be a timeframe where strikes drop off. It’s not always a “rogue judge” - for example, sometimes a public defender just sucks, or an appeals lawyer does a better job, or new evidence is brought to light, etc. permalink parent award report block reply cross_bearer_02 1 points 3 days ago Agreed. Four years. That’s a full term for a President. permalink parent award report block reply\ncross_bearer_02 7 points 3 days ago “Three Strikes Law” for rogue judges. After being overturned three times by a higher court, that judge is: Automatically impeached and removed from office May no longer seek election or be appointed to any judicial position (local, state, or federal) If they are a lawyer, they are disbarred and no longer eligible to practice law in any state or jurisdiction within the United States or its territories. Is forbidden from lobbying on behalf of any entity, business, organization, political faction, or any other group. Is forbidden from seeing any other office within government. Is forbidden from receiving any sort of security clearance, and any such clearance already given shall be revoked. permalink parent award report block reply SickIcarus 6 points 3 days ago Not a bad idea, but there should be a timeframe where strikes drop off. It’s not always a “rogue judge” - for example, sometimes a public defender just sucks, or an appeals lawyer does a better job, or new evidence is brought to light, etc. permalink parent award report block reply cross_bearer_02 1 points 3 days ago Agreed. Four years. That’s a full term for a President. permalink parent award report block reply\nSickIcarus 6 points 3 days ago Not a bad idea, but there should be a timeframe where strikes drop off. It’s not always a “rogue judge” - for example, sometimes a public defender just sucks, or an appeals lawyer does a better job, or new evidence is brought to light, etc. permalink parent award report block reply cross_bearer_02 1 points 3 days ago Agreed. Four years. That’s a full term for a President. permalink parent award report block reply\ncross_bearer_02 1 points 3 days ago Agreed. Four years. That’s a full term for a President. permalink parent award report block reply\nEgregiousPhilbin 3 points 3 days ago Have you tried not voting for RINOs? permalink parent award report block reply trumpORbust 3 points 3 days ago Where is that other choice found on the ballot permalink parent award report block reply\ntrumpORbust 3 points 3 days ago Where is that other choice found on the ballot permalink parent award report block reply\nNotYourMan 1 points 3 days ago Well its good that the judges decided the president can do what the constitution tells us the president can do.  What a waste of time. permalink parent award report block reply\nhenri_derelicte 19 points 3 days ago SCOTUS needs to move their ass and allow the national guard deployment in Chicago permalink award report block reply Beardholder 7 points 3 days ago And of they oppose it's time to arrest the supreme court for treason permalink parent award report block reply TrumpAndGodWin 2 points 3 days ago E.g. if the leftists vote against his very legal use of tariffs. permalink parent award report block reply thisaintitchief76 1 points 3 days ago I believe the ruling of this case will be used as such for everything moving forward. permalink parent award report block reply\nBeardholder 7 points 3 days ago And of they oppose it's time to arrest the supreme court for treason permalink parent award report block reply TrumpAndGodWin 2 points 3 days ago E.g. if the leftists vote against his very legal use of tariffs. permalink parent award report block reply\nTrumpAndGodWin 2 points 3 days ago E.g. if the leftists vote against his very legal use of tariffs. permalink parent award report block reply\nthisaintitchief76 1 points 3 days ago I believe the ruling of this case will be used as such for everything moving forward. permalink parent award report block reply\nYodaBannon 19 points 3 days ago win time permalink award report block reply\naaafirefly123 14 points 3 days ago Bout damn time. permalink award report block reply bumpman 2 points 3 days ago A little too late, it’s now just a cringey stand off between antifa tards and patriots every night and the cops are finally somewhat doing their job permalink parent award report block reply\nbumpman 2 points 3 days ago A little too late, it’s now just a cringey stand off between antifa tards and patriots every night and the cops are finally somewhat doing their job permalink parent award report block reply\nFrmrAmericanRepublic 13 points 3 days ago Fuck those robed faggots. Yes, it was in our favor but you know what? When you have these robed retards hampering the executive branch in executing duties that PROTECT FUCKING CITIZENS -- well, they can fuck ALL THE WAY OFF. permalink award report block reply they-see-me-trollin 4 points 3 days ago this.  need to start removing the rogue judges.  it's VERY well settled law that the president has very broad authority to defend federal assets, locations, and personnel, including using the military domestically.  it's so well settled that anyone suggesting otherwise is not just factually and legally wrong, they're a subverter activist. what the media has been trying to do is portray this expansive right of the executive as being used improperly for general law enforcement, while gaslighting people into thinking there is no mass violence and unrest in these cities.  the legal standard is higher, but when you have people trying to firebomb federal agents and facilities, crashing vehicles into them, shooting firearms at them, and the local law enforcement has stand-down orders, the insurrection act plainly authorizes deployment of military for such unrest. permalink parent award report block reply\nthey-see-me-trollin 4 points 3 days ago this.  need to start removing the rogue judges.  it's VERY well settled law that the president has very broad authority to defend federal assets, locations, and personnel, including using the military domestically.  it's so well settled that anyone suggesting otherwise is not just factually and legally wrong, they're a subverter activist. what the media has been trying to do is portray this expansive right of the executive as being used improperly for general law enforcement, while gaslighting people into thinking there is no mass violence and unrest in these cities.  the legal standard is higher, but when you have people trying to firebomb federal agents and facilities, crashing vehicles into them, shooting firearms at them, and the local law enforcement has stand-down orders, the insurrection act plainly authorizes deployment of military for such unrest. permalink parent award report block reply\nUsername_here 12 points 3 days ago I don't understand why Trump would comply with any of these Judges rulings. They have zero authority. The fact that the Trump admin doesn't ignore them is disturbing permalink award report block reply TrumpAndGodWin 2 points 3 days ago All of this may just be a long plan to expose the huge corruption so that when he has no other choice than to get extreme the normies won't get in the way or get swept up in a leftist Podesta civil war plan. permalink parent award report block reply\nTrumpAndGodWin 2 points 3 days ago All of this may just be a long plan to expose the huge corruption so that when he has no other choice than to get extreme the normies won't get in the way or get swept up in a leftist Podesta civil war plan. permalink parent award report block reply\nraptormissle 9 points 3 days ago All the democrats do is use lawfare when we win. When they win we do shit and take it. permalink award report block reply nautilus 5 points 3 days ago And then we \"conserve\" the new normal. permalink parent award report block reply\nnautilus 5 points 3 days ago And then we \"conserve\" the new normal. permalink parent award report block reply\ncoinneach007 8 points 3 days ago No this is not huge, this judge should never be able to make another ruling!  That would be huge! permalink award report block reply The_Emperor 1 points 3 days ago Stunning only that it was the 9th circuit.   Common sense regular day most elsewhere/elsewhen. permalink parent award report block reply\nThe_Emperor 1 points 3 days ago Stunning only that it was the 9th circuit.   Common sense regular day most elsewhere/elsewhen. permalink parent award report block reply\nchuey_316 3 points 3 days ago I could be mistaken, but I am pretty sure this is an old ruling, and the most recent one is from an activist judge blocking Trump. permalink award report block reply quodvox 2 points 3 days ago Nope, this ruling is from Nov 9th.  The Circuit Judge that ruled against Trump was overruled by the 9th Circuit Court of Appeals permalink parent award report block reply Emanresu99 2 points 2 days ago Are there any links to those rulings? permalink parent award report block reply\nquodvox 2 points 3 days ago Nope, this ruling is from Nov 9th.  The Circuit Judge that ruled against Trump was overruled by the 9th Circuit Court of Appeals permalink parent award report block reply Emanresu99 2 points 2 days ago Are there any links to those rulings? permalink parent award report block reply\nEmanresu99 2 points 2 days ago Are there any links to those rulings? permalink parent award report block reply\nohwell316 3 points 3 days ago By any means necessary permalink award report block reply\nBldg_2019 3 points 3 days ago The military has non-lethal (allegedly) riot control weapons. Perfect testing ground. Use them. HARD. permalink award report block reply\ningrowntoenail 3 points 3 days ago Whatever they were planning on sending, quadruple it because they're going to need it to keep those chimps in line. permalink award report block reply\nShih_Tabed 2 points 3 days ago Been trying to keep track of this and it seems twice a day this changes to Supreme Court blocks Trump, then Supreme Court allows Trump, etc.  I mean ICE must be like the John Travolta meme from Pulp Fiction by now. permalink award report block reply\ncosmos411 2 points 3 days ago FFS, can President Trump do anything without courts getting in the fucking way? permalink award report block reply\nSenaleb 2 points 3 days ago yeah would be hard to defend letting federal agents being shot at and then ruling they can't have federal protection lol. permalink award report block reply\nanti_masker 2 points 3 days ago Nice. permalink award report block reply\nhey_spike 1 points 3 days ago The permanent injunction wasn't so permanent. permalink award report block reply\nMAGASquatch 1 points 3 days ago Hopefully this will be used against the courts trying to obstruct ICE. Can charges be made on the obstructionist judges who refuse to detain illegals and allow criminals back out on the streets? permalink award report block reply\nChoppermagic 1 points 3 days ago Trump brought more balance to the 9th Circus in his first term permalink award report block reply\nLigersrule1 1 points 3 days ago BrEaKiNg permalink award report block reply\nThe_RedWolf 1 points 3 days ago isnt the 9th circuit the most liberal?  or am I misremembering? permalink award report block reply\nWeeha 1 points 3 days ago IT’S A TRAP! permalink award report block reply\nMOLON-LABE 1 points 3 days ago Uhhhh yeah. No shit. That's why he did it in the first place. permalink award report block reply\n6iggu56icku5 1 points 3 days ago This should never have been in question permalink award report block reply\nJayKay1776 1 points 3 days ago The commander-in-chief is just being nice to these lower courts they have no authority over what president does with the National Guard or any of the military for that matter. District and appeals and any other chord except for the Supreme Court has no power over the presidency. permalink award report block reply\nragnarokrobo 1 points 3 days ago STUNNING permalink award report block reply\nexplodejoystick 1 points 3 days ago Oh gee thanks, 9th circuit court, no fucking shit you waste of human life. permalink award report block reply\nSpeedgraphic69 1 points 3 days ago Mighty white of them permalink award report block reply\nQuiznos585 1 points 3 days ago The OR federal judge is already drawing up her next injunction over ruling this permalink award report block reply\nMixedBlacknWhite 1 points 3 days ago I remember a week ago when Faggot Newscome posted on Twitter that Trump was stopped deploying the National Guard. I remember Faggot saying this was a win etc.. Every reply, and I mean EVERY REPLY was saying that would be overturned and Trump will win. Calling Newscome a cock sucker, faggot, weapons grade retard.. the usual. Two things: Trump wins again, but we knew this would happen Where the fuck are the commies on social media? I ask because almost never on social media do I see a commie post that has support. Seriously, where the fuck are these people? It's like they don't exist, but I am told they are the generation on social media.. but nowhere to be found, ever? Weird permalink award report block reply\nTrumpVoter1 1 points 3 days ago How is this HUGE? SCOTUS and other appeals courts have said the same for other places. This was the only expected outcome permalink award report block reply\nthisisatestof2 1 points 3 days ago Ah.  One of those occasional the ninth circus actually gets something right decisions. permalink award report block reply\nColbyP 1 points 3 days ago I'm not sure why this even needed to go to court. ICE is federal. The National Guard is federal. Both are outside the jurisdiction of individual states, much less individual city mayors getting uppity. permalink award report block reply\nSanityGumby 1 points 3 days ago Man, whatever happened to their Hawaiian judge permalink award report block reply\nR3tro 1 points 3 days ago Do much for that lower level permanent injunction permalink award report block reply\ntlorsung 1 points 3 days ago The Courts know this; they are just creating havoc for all!  These Judges must be fired for bad behavior and not Appling Blind Justice!  All their cases should be reviewed for biases! permalink award report block reply\nNate_Higgersalot 1 points 3 days ago Is it huge?  Really?  Curing cancer would be huge. permalink award report block reply\nthxpk 1 points 3 days ago This is not true permalink award report block reply\ntommygigantica 1 points 3 days ago this is fucking 20 days old. fucking retards just reposting shit without any research permalink award report block reply\nMoreGuns 1 points 3 days ago I hope we see our brave ICE agents and Soliders on every street corner permalink award report block reply\nhillaryforprison 1 points 3 days ago No other president has had to report to faggot judges acting like POTUS. This should not be tolerated. permalink award report block reply\npby1000 1 points 3 days ago It is surprising when courts follow the Constitution. permalink award report block reply\nm0ntsta 1 points 3 days ago I am so sick of these posts saying the judges “allowed” Trump to do this. They don’t “allow” Trump to do anything anymore than my kids “allow” me to enjoy a glass of wine with dinner. You don’t have any fucking say commie fuckbags. permalink award report block reply\nGreyKnight 1 points 3 days ago It was kinda the point of the executive branch… permalink award report block reply\nObambi 0 points 3 days ago I know Trump is establishing case law but he’s too slow on this not really his fault permalink award report block reply\nUrusovite 0 points 3 days ago a little gift before they undo tariffs and let the world fuck us. permalink award report block reply\nBirthHole 0 points 3 days ago Thru all these lawsuits, the president is being set that the courts have the right to prevent an elected executive from discharging his duties until they say its OK. and this is bullshit. permalink award report block reply\nMemeWarsVet -5 points 3 days ago Not really. It won't increase the deportation numbers substantially. It's all a work. permalink award report block reply MasterChief08 2 points 3 days ago The national guard makes ICE & Border Patrol safer. That increases morale and definitely increases productivity. Sending in 200 officers into enemy territory like Portland is a huge risk. Now they have a few thousand guns pointing outwards at the rioters. The federal government is hiring 1000 new ICE agents by January and February. We don't want people quitting. Roughly 2.7 million illegal immigrants have left or been removed this year. We want that number to double next year. The goal is to completely erase the Biden invasion before the next presidential election. permalink parent award report block reply MemeWarsVet 1 points 3 days ago That is good but we need deportations to ramp up drastically. permalink parent award report block reply MasterChief08 1 points 3 days ago They will be. The BBB sets aside approximately $170 billion over four years for immigration enforcement, detention and deportation operations. By 2027 there will be 8000 new border patrol and 10k new ICE. Hiring is just ramping up. 1k new ICE employees will start by January and February. This year so far 2 million have left on their own with the incentives and 500k have been deported. It is very likely next year we will see over a million forced deportations per year. At this rate the Biden invasion will be completely erased before this term is over. This is why we need to absolutely everything possible to stop Democrats from winning power. Starting in three or four years we will be removing 10-20 million. That's when we'll start to see generational power from the left start to erode. permalink parent award report block reply\nMasterChief08 2 points 3 days ago The national guard makes ICE & Border Patrol safer. That increases morale and definitely increases productivity. Sending in 200 officers into enemy territory like Portland is a huge risk. Now they have a few thousand guns pointing outwards at the rioters. The federal government is hiring 1000 new ICE agents by January and February. We don't want people quitting. Roughly 2.7 million illegal immigrants have left or been removed this year. We want that number to double next year. The goal is to completely erase the Biden invasion before the next presidential election. permalink parent award report block reply MemeWarsVet 1 points 3 days ago That is good but we need deportations to ramp up drastically. permalink parent award report block reply MasterChief08 1 points 3 days ago They will be. The BBB sets aside approximately $170 billion over four years for immigration enforcement, detention and deportation operations. By 2027 there will be 8000 new border patrol and 10k new ICE. Hiring is just ramping up. 1k new ICE employees will start by January and February. This year so far 2 million have left on their own with the incentives and 500k have been deported. It is very likely next year we will see over a million forced deportations per year. At this rate the Biden invasion will be completely erased before this term is over. This is why we need to absolutely everything possible to stop Democrats from winning power. Starting in three or four years we will be removing 10-20 million. That's when we'll start to see generational power from the left start to erode. permalink parent award report block reply\nMemeWarsVet 1 points 3 days ago That is good but we need deportations to ramp up drastically. permalink parent award report block reply MasterChief08 1 points 3 days ago They will be. The BBB sets aside approximately $170 billion over four years for immigration enforcement, detention and deportation operations. By 2027 there will be 8000 new border patrol and 10k new ICE. Hiring is just ramping up. 1k new ICE employees will start by January and February. This year so far 2 million have left on their own with the incentives and 500k have been deported. It is very likely next year we will see over a million forced deportations per year. At this rate the Biden invasion will be completely erased before this term is over. This is why we need to absolutely everything possible to stop Democrats from winning power. Starting in three or four years we will be removing 10-20 million. That's when we'll start to see generational power from the left start to erode. permalink parent award report block reply\nMasterChief08 1 points 3 days ago They will be. The BBB sets aside approximately $170 billion over four years for immigration enforcement, detention and deportation operations. By 2027 there will be 8000 new border patrol and 10k new ICE. Hiring is just ramping up. 1k new ICE employees will start by January and February. This year so far 2 million have left on their own with the incentives and 500k have been deported. It is very likely next year we will see over a million forced deportations per year. At this rate the Biden invasion will be completely erased before this term is over. This is why we need to absolutely everything possible to stop Democrats from winning power. Starting in three or four years we will be removing 10-20 million. That's when we'll start to see generational power from the left start to erode. permalink parent award report block reply"}