{"id": "8179874", "contents": "1273 AHAHAHAHAHAHAHAHA posted 3 days ago by kek_saved_the_world 118 comments award share download report block\n118 comments Sort by Top Top New Worst Old Save Wtf_socialismreally 155 points 3 days ago This is something I will require a source for, as a quick propaganda (Google) search did not yield any results and I do not recognize this account. permalink award report block reply Ilanna 62 points 3 days ago Same. I see nothing like this out there except the original post. permalink parent award report block reply CantStumpIWin 30 points 2 days ago ITS ALMOST LIKE THIS SITE IS RUN BY REDDIT MODS. permalink parent award report block reply RiolindasReturn 6 points 2 days ago Cmon man “make do” lol. permalink parent award report block reply lostremote- 7 points 2 days ago This account is pretty good on identifying leftists who say retarded shit.  I’ve never had a problem with false information with them thst I can remember. permalink parent award report block reply Sparks1017 4 points 2 days ago Same  he's a good follow permalink parent award report block reply NeverInterruptEnemy 47 points 3 days ago This site wants you to be fucking retarded. There is no other explanation. permalink parent award report block reply Retardloserimsogay 31 points 3 days ago Pretty much, not sure why stuff like this is stickied. permalink parent award report block reply NeverInterruptEnemy 13 points 3 days ago This is either a psy-op or controlled opposition. permalink parent award report block reply Wozzing 2 points 2 days ago Bingo permalink parent award report block reply Gnometard 6 points 2 days ago Low testosterone, Facebook use, reddit use, tiktok and IG scrolling. Without the list above you've got the ability to not only recognize bullshit but you also don't find yourself with a closeted desire to fuck trannies permalink parent award report block reply vegaspatriot1776 3 points 2 days ago It's a sticky. That is all the proof you need. Trust me, bro! permalink parent award report block reply WokeYoke 5 points 2 days ago 0hour is the guy who doxes all the people who make threats against conservatives permalink parent award report block reply Wtf_socialismreally 1 points 2 days ago Interesting. permalink parent award report block reply BetterNameUnfound 2 points 3 days ago It's real. Catturd himself praised this guy, claiming the latter got the former out of a life-threatening jam last night. ...Oh, you mean Zohran withdrawing his claim, sorry, my bad. permalink parent award report block reply cyberwar 5 points 2 days ago catturd, the obese alcoholic boomer with a horrible taste in music? permalink parent award report block reply Here_we_go 2 points 2 days ago I wish twitter would stop cutting checks to grifters permalink parent award report block reply Duster_340 1 points 2 days ago Catturd is a cringy boomer out of touch with anything. permalink parent award report block reply Nerdrem3 1 points 3 days ago I don't see why he would say this even if he has no intention of following through. permalink parent award report block reply BidenShowerDrool 3 points 3 days ago because commies love to mimic each other. Soviet Russia's Lenin once told his party, \"promises are like pie crust made to be broken\". Lies are as natural to  Commies and Muslims as breathing. permalink parent award report block reply grenades_and_ham 1 points 2 days ago “Promise the people everything and give them nothing.” “We must lend a hand to our neighbors, we will extend a helping hand to our neighbor and help ourselves.” “Morons for Moronica!” ~ Moe Howard permalink parent award report block reply load 2 more comments... General_Specific 78 points 3 days ago No sauce =you are a dumb faggot. permalink award report block reply xBuckeyex 7 points 2 days ago Should be a deportable offense permalink parent award report block reply ragnarokrobo 2 points 2 days ago To be fair usually the \"source\" is a link to the screencapped tweet. permalink parent award report block reply General_Specific 1 points 2 days ago to be fair we don't post bullshit here that isn't true but is made to look true. permalink parent award report block reply Gofuys 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply LookFatty 51 points 3 days ago Guys a fag. Roof drop permalink award report block reply DT170x 17 points 3 days ago Does Gay Muslims throw themselves off of tall building or other Muslims got to throw him off. permalink parent award report block reply Viewer01 5 points 3 days ago He’s a witch. So he just floats. permalink parent award report block reply schiff_for_brains 4 points 3 days ago Looks like he weighs as much as a duck, too! permalink parent award report block reply UCantStumpTheTrump 5 points 3 days ago Trump at least tries to keep his promises, with Democrats its blatant lies to your face 24/7 permalink parent award report block reply fluffykitten 43 points 3 days ago Got a source besides some random dude on X? permalink award report block reply 2Clutch 27 points 2 days ago Yes, the word \"Breaking\" at the beginning of the tweet. permalink parent award report block reply schism 36 points 3 days ago Is this site just a hive of unsourced bullshit now?  I swear half the crap posted on here is just made up out of thin air. permalink award report block reply aoneleggedduck 13 points 2 days ago I'm glad, though, to see how many top comments are people calling out the lack of sauce. Try as they may, we still have some integrity around here. permalink parent award report block reply FromGodNotMonkey 6 points 2 days ago I'm NOT glad that it gets a sticky permalink parent award report block reply newuser8 13 points 3 days ago It's now $100/hr permalink award report block reply Wallllllllllllllllll 10 points 3 days ago Just make it $1,000 an hour with a tax rate of 97%. Government gets $970 and the worker gets $30. That will get us to a communist utopia real fast. And by communist utopia I mean well funded terrorist cells, free sex change surgeries, and empty store shelves. permalink parent award report block reply yukondave 8 points 3 days ago \"This time it will be different\" Photo of Antifa flag outside of Communist Headquarters in 1932 Germany. Karl-Liebknecht-Haus https://en.wikipedia.org/wiki/Karl-Liebknecht-Haus#/media/File:Bundesarchiv_Bild_183-09424-0006,_Berlin,_Karl-Liebknecht-Haus_am_Tag_der_Reichstagswahl.jpg permalink parent award report block reply trumpORbust 7 points 3 days ago Has cheeseburger? permalink parent award report block reply deleted 1 points 2 days ago Wallllllllllllllllll 2 points 2 days ago Oops 🤪 fixed permalink parent award report block reply Gletkin 6 points 3 days ago I make $250 per hour working from home. For the low low price of $9.99 per month I can teach you how to do it too. permalink parent award report block reply 3-10 3 points 3 days ago Yes, the site is called TryHackMe or HackTheBox. It’s legit. Best $10 a month. permalink parent award report block reply Nibba2 9 points 3 days ago Every Dems playbook. Biden promised student loan forgiveness, yet four days before the election said on national tv it would never happen. The news covered it up. permalink award report block reply redditadminssuckit 9 points 3 days ago I CAN'T FIND SOURCE ANYWHERE permalink award report block reply Roadpower 4 points 3 days ago I hadn't heard that he had made this pitch to the street socialist moron in the first place so starting there I looked this up. Apparently this started either very early this year or maybe in 2024. https://www.cityandstateny.com/policy/2025/02/mamdani-unveils-30-30-minimum-wage-push-part-mayoral-campaign/403015/ According to a report by AI the plan was: $20 per hour in 2027; $23.50 in 2028; $27 in 2029; $30 in 2030. I haven't found the retraction yet. permalink parent award report block reply MedicallyReddit 8 points 3 days ago Muslim faggot will do nothing other than ruin NYC beyond repair and fill the streets with cow dung permalink award report block reply SPEDMan64 6 points 3 days ago Akchewally it's the Hindus that throw dung. The Muslims just spear dung with their dicks...while it's still warm inside the ass. permalink parent award report block reply Wtf_socialismreally 1 points 2 days ago Akchewally it's the Hindus that throw dung. Really? I thought it was just the left. permalink parent award report block reply MaoHadOnly1Testicle 1 points 2 days ago The Muslims just spear dung with their dicks...while it's still warm inside the ass. *inside a goat's ass permalink parent award report block reply PensivePatriot 7 points 3 days ago ::sweats nervously refreshing the page for a legit source because he definitely sent this out as breaking news and is now in social capital debt to his conservative friends over the lack of receipts:: permalink award report block reply Hanging_Chad 6 points 3 days ago what’s NYC’s current min wage? permalink award report block reply SPEDMan64 8 points 3 days ago When I started working at Borders Books in 1996 it was $7.50, so I imagine it has risen a little since then. permalink parent award report block reply Awan-CIA-Car-Lot 5 points 3 days ago It's currently 16.50 an hour. permalink parent award report block reply Mungo 6 points 3 days ago So no $30 an hour, no free buses……what’s next? permalink award report block reply that_sound 7 points 3 days ago White flight. NYC goes the way of London and other major European cities. permalink parent award report block reply Redeemable 5 points 2 days ago Can we see the quote instead of some random X? permalink award report block reply JediDwag 5 points 3 days ago Just like Biden's student loan forgiveness. Anyone that thinks these pie in the sky bullshit policies that completely ignore economics are ever going to happen are suckers. permalink award report block reply Papabravo12 4 points 3 days ago You mean make do permalink award report block reply bidensmissingbrain 2 points 2 days ago In zohran’s case, make doo. permalink parent award report block reply Chachiex 4 points 3 days ago This was how elections worked til 2016 permalink award report block reply BasedCostanza91 4 points 3 days ago An Indian scamming? Imagine that. permalink award report block reply JackOfAllTirades 4 points 2 days ago I am glad that I read the comments. It confirmed my suspicions that the OP is full of shit and that the mod that stickied this is a faggot. permalink award report block reply YodaBannon 3 points 2 days ago Zohran and his Mohrans permalink award report block reply VirtusHonos 3 points 3 days ago that was fast permalink award report block reply DCPower 3 points 3 days ago Well that was quick permalink award report block reply Polander 3 points 2 days ago Why is this stickied? Where the downvote button? permalink award report block reply mullethawk 3 points 3 days ago It's \"make do,\" btw so nobody writes it wrong after seeing this post. permalink award report block reply Overtaxed 2 points 2 days ago No shitpost flair? permalink award report block reply Friar_Pede 2 points 2 days ago Fake permalink award report block reply IAmDisappoint 2 points 2 days ago Sause? permalink award report block reply thisisatestof2 2 points 3 days ago How long before no free buses? permalink award report block reply Choomguy 2 points 2 days ago Hochul already said she won’t fund that, been tried, homeless moved in… permalink parent award report block reply BeekeepingPatriot 2 points 2 days ago Sauce please permalink award report block reply NeilNewsNetwork 2 points 3 days ago fake news, i mean.. Mamdani is a liar in nearly everything, but he never said this permalink award report block reply OmegaBird 2 points 2 days ago Unsourced faggoty. permalink award report block reply FatigueIsReal 2 points 3 days ago I'm so glad he won. permalink award report block reply booblitchutz 2 points 2 days ago Well, source or not, $30 minimum wage will end commerce in NYC pretty much entirely. permalink award report block reply FattestConsequence 2 points 2 days ago Repeal thr 19th, voting age up to 25. permalink award report block reply Bastard 2 points 3 days ago No refunds. permalink award report block reply BaronFalcon 2 points 2 days ago Link it or fuck off faggot permalink award report block reply mass55th 2 points 3 days ago Reminds me of Bill Clinton's promise of a middle-class tax cut when he ran for President in 1992. Then, just before he was sworn into office in January 1993, he backtracked on that promise saying:  \"...that the plan was never a major theme in his race for the White House.\" They don't call him \"Slick Willie\" for nothing. permalink award report block reply Covfefebrulee 1 points 2 days ago aka communism permalink award report block reply KernalMustard 1 points 3 days ago Money the root of all evil. permalink award report block reply Roadpower 1 points 3 days ago No, unearned expectations is. permalink parent award report block reply Pdjco658 1 points 3 days ago this dude said ... Viva la revolución in his Che Guevara shirt and then said ... hold up ... huh ... i won? Fuck these people. permalink award report block reply pedeypete 1 points 3 days ago So in addition to being a goat fucker, he's a liar too. permalink award report block reply PKC_MAN 1 points 3 days ago It was never feasable in the first place. People who bought it are just stupid. permalink award report block reply PatriotLady1 1 points 3 days ago Who else WONDERS HOW MANY PEOPLE VOTED FOR ZOHAR to get $30/hr??????? SURPRISE surprise...he re-negged!!!!!!!!! permalink award report block reply Sparks1017 1 points 2 days ago Don't know the source of this, but his account is a great follow permalink award report block reply canada_is_communist 1 points 2 days ago In New york $30 is not even enough to buy a restaurant sandwich anymore... And they still expect 25%+ in \"tips\" permalink award report block reply PatriotLady1 1 points 3 days ago Who else WONDERS HOW MANY voted for Zohran SO THEY COULD GET $30/HR???... bet they're dumb-founded 😱 ...gee,what a surprise (NOT) permalink award report block reply MAGALADON9 1 points 2 days ago [Plays ussr anthem] BTW it's my ringtone for when lib family calls permalink award report block reply VirTW 1 points 3 days ago One of the first of realities of governing vrs running permalink award report block reply covok48 1 points 3 days ago Browns voted for him. Browns can deal. permalink award report block reply cafeman23 1 points 2 days ago ( Dark Helmet voice ) Mamdami:\nHere let me give you 30$/hr-- ( Instantly retracts promise ) OH YOU FELL FOR THAT TOO! YOU FELL FOR THE OLDEST TRICK IN THE BOOK! WHAT A GOOF! What's with you guys!? permalink award report block reply brewser724 1 points 3 days ago First of many upcoming backtracks... permalink award report block reply Rydanovich 1 points 2 days ago Sauce. permalink award report block reply Dev404 1 points 2 days ago NY is already having a lot of their taxes move out of the state. Why stop at $30 for minimum wage? Why not make it whatever these career criminal politicians make who all become multimillionaires within the first two years of office? AOC knows a lot about that, and her district isn't full of multimilionaires despite she loves socialism..... for everyone else, but not her. Socialism means equal for everyone, right? permalink award report block reply Cowboy888 1 points 3 days ago Ooooops! permalink award report block reply raptormissle 1 points 3 days ago The first of many retractions. Retraction Alpaca. permalink award report block reply Wrexxis780 1 points 2 days ago I hope he betrays his promises so much that they recall him permalink award report block reply DingleBalls 1 points 2 days ago NO REFUNDS permalink award report block reply IbleedOrange 1 points 2 days ago Grok says its bullshit. permalink award report block reply knnbccb 1 points 3 days ago Taqiyya honeymoon period over. That was fast. At least wait till Christmas. permalink award report block reply Kmdub2 1 points 2 days ago Do they not teach grammar at all any more? permalink award report block reply cyberwar 1 points 2 days ago this toothless troll was around in 2015 too. he got beaten up by his alcoholic girlfriend and had to flee the state. these are the retards you get your news from? permalink award report block reply mediweevil 1 points 3 days ago that took even less time than I expected. permalink award report block reply Rock9Head 1 points 3 days ago What about the free ponies? permalink award report block reply astralentity 1 points 2 days ago Isn't this why they were called the useful idiots? permalink award report block reply\nWtf_socialismreally 155 points 3 days ago This is something I will require a source for, as a quick propaganda (Google) search did not yield any results and I do not recognize this account. permalink award report block reply Ilanna 62 points 3 days ago Same. I see nothing like this out there except the original post. permalink parent award report block reply CantStumpIWin 30 points 2 days ago ITS ALMOST LIKE THIS SITE IS RUN BY REDDIT MODS. permalink parent award report block reply RiolindasReturn 6 points 2 days ago Cmon man “make do” lol. permalink parent award report block reply lostremote- 7 points 2 days ago This account is pretty good on identifying leftists who say retarded shit.  I’ve never had a problem with false information with them thst I can remember. permalink parent award report block reply Sparks1017 4 points 2 days ago Same  he's a good follow permalink parent award report block reply NeverInterruptEnemy 47 points 3 days ago This site wants you to be fucking retarded. There is no other explanation. permalink parent award report block reply Retardloserimsogay 31 points 3 days ago Pretty much, not sure why stuff like this is stickied. permalink parent award report block reply NeverInterruptEnemy 13 points 3 days ago This is either a psy-op or controlled opposition. permalink parent award report block reply Wozzing 2 points 2 days ago Bingo permalink parent award report block reply Gnometard 6 points 2 days ago Low testosterone, Facebook use, reddit use, tiktok and IG scrolling. Without the list above you've got the ability to not only recognize bullshit but you also don't find yourself with a closeted desire to fuck trannies permalink parent award report block reply vegaspatriot1776 3 points 2 days ago It's a sticky. That is all the proof you need. Trust me, bro! permalink parent award report block reply WokeYoke 5 points 2 days ago 0hour is the guy who doxes all the people who make threats against conservatives permalink parent award report block reply Wtf_socialismreally 1 points 2 days ago Interesting. permalink parent award report block reply BetterNameUnfound 2 points 3 days ago It's real. Catturd himself praised this guy, claiming the latter got the former out of a life-threatening jam last night. ...Oh, you mean Zohran withdrawing his claim, sorry, my bad. permalink parent award report block reply cyberwar 5 points 2 days ago catturd, the obese alcoholic boomer with a horrible taste in music? permalink parent award report block reply Here_we_go 2 points 2 days ago I wish twitter would stop cutting checks to grifters permalink parent award report block reply Duster_340 1 points 2 days ago Catturd is a cringy boomer out of touch with anything. permalink parent award report block reply Nerdrem3 1 points 3 days ago I don't see why he would say this even if he has no intention of following through. permalink parent award report block reply BidenShowerDrool 3 points 3 days ago because commies love to mimic each other. Soviet Russia's Lenin once told his party, \"promises are like pie crust made to be broken\". Lies are as natural to  Commies and Muslims as breathing. permalink parent award report block reply grenades_and_ham 1 points 2 days ago “Promise the people everything and give them nothing.” “We must lend a hand to our neighbors, we will extend a helping hand to our neighbor and help ourselves.” “Morons for Moronica!” ~ Moe Howard permalink parent award report block reply load 2 more comments...\nIlanna 62 points 3 days ago Same. I see nothing like this out there except the original post. permalink parent award report block reply CantStumpIWin 30 points 2 days ago ITS ALMOST LIKE THIS SITE IS RUN BY REDDIT MODS. permalink parent award report block reply RiolindasReturn 6 points 2 days ago Cmon man “make do” lol. permalink parent award report block reply lostremote- 7 points 2 days ago This account is pretty good on identifying leftists who say retarded shit.  I’ve never had a problem with false information with them thst I can remember. permalink parent award report block reply Sparks1017 4 points 2 days ago Same  he's a good follow permalink parent award report block reply\nCantStumpIWin 30 points 2 days ago ITS ALMOST LIKE THIS SITE IS RUN BY REDDIT MODS. permalink parent award report block reply RiolindasReturn 6 points 2 days ago Cmon man “make do” lol. permalink parent award report block reply\nRiolindasReturn 6 points 2 days ago Cmon man “make do” lol. permalink parent award report block reply\nlostremote- 7 points 2 days ago This account is pretty good on identifying leftists who say retarded shit.  I’ve never had a problem with false information with them thst I can remember. permalink parent award report block reply Sparks1017 4 points 2 days ago Same  he's a good follow permalink parent award report block reply\nSparks1017 4 points 2 days ago Same  he's a good follow permalink parent award report block reply\nNeverInterruptEnemy 47 points 3 days ago This site wants you to be fucking retarded. There is no other explanation. permalink parent award report block reply Retardloserimsogay 31 points 3 days ago Pretty much, not sure why stuff like this is stickied. permalink parent award report block reply NeverInterruptEnemy 13 points 3 days ago This is either a psy-op or controlled opposition. permalink parent award report block reply Wozzing 2 points 2 days ago Bingo permalink parent award report block reply Gnometard 6 points 2 days ago Low testosterone, Facebook use, reddit use, tiktok and IG scrolling. Without the list above you've got the ability to not only recognize bullshit but you also don't find yourself with a closeted desire to fuck trannies permalink parent award report block reply vegaspatriot1776 3 points 2 days ago It's a sticky. That is all the proof you need. Trust me, bro! permalink parent award report block reply\nRetardloserimsogay 31 points 3 days ago Pretty much, not sure why stuff like this is stickied. permalink parent award report block reply NeverInterruptEnemy 13 points 3 days ago This is either a psy-op or controlled opposition. permalink parent award report block reply Wozzing 2 points 2 days ago Bingo permalink parent award report block reply Gnometard 6 points 2 days ago Low testosterone, Facebook use, reddit use, tiktok and IG scrolling. Without the list above you've got the ability to not only recognize bullshit but you also don't find yourself with a closeted desire to fuck trannies permalink parent award report block reply vegaspatriot1776 3 points 2 days ago It's a sticky. That is all the proof you need. Trust me, bro! permalink parent award report block reply\nNeverInterruptEnemy 13 points 3 days ago This is either a psy-op or controlled opposition. permalink parent award report block reply Wozzing 2 points 2 days ago Bingo permalink parent award report block reply\nWozzing 2 points 2 days ago Bingo permalink parent award report block reply\nGnometard 6 points 2 days ago Low testosterone, Facebook use, reddit use, tiktok and IG scrolling. Without the list above you've got the ability to not only recognize bullshit but you also don't find yourself with a closeted desire to fuck trannies permalink parent award report block reply\nvegaspatriot1776 3 points 2 days ago It's a sticky. That is all the proof you need. Trust me, bro! permalink parent award report block reply\nWokeYoke 5 points 2 days ago 0hour is the guy who doxes all the people who make threats against conservatives permalink parent award report block reply Wtf_socialismreally 1 points 2 days ago Interesting. permalink parent award report block reply\nWtf_socialismreally 1 points 2 days ago Interesting. permalink parent award report block reply\nBetterNameUnfound 2 points 3 days ago It's real. Catturd himself praised this guy, claiming the latter got the former out of a life-threatening jam last night. ...Oh, you mean Zohran withdrawing his claim, sorry, my bad. permalink parent award report block reply cyberwar 5 points 2 days ago catturd, the obese alcoholic boomer with a horrible taste in music? permalink parent award report block reply Here_we_go 2 points 2 days ago I wish twitter would stop cutting checks to grifters permalink parent award report block reply Duster_340 1 points 2 days ago Catturd is a cringy boomer out of touch with anything. permalink parent award report block reply\ncyberwar 5 points 2 days ago catturd, the obese alcoholic boomer with a horrible taste in music? permalink parent award report block reply Here_we_go 2 points 2 days ago I wish twitter would stop cutting checks to grifters permalink parent award report block reply\nHere_we_go 2 points 2 days ago I wish twitter would stop cutting checks to grifters permalink parent award report block reply\nDuster_340 1 points 2 days ago Catturd is a cringy boomer out of touch with anything. permalink parent award report block reply\nNerdrem3 1 points 3 days ago I don't see why he would say this even if he has no intention of following through. permalink parent award report block reply BidenShowerDrool 3 points 3 days ago because commies love to mimic each other. Soviet Russia's Lenin once told his party, \"promises are like pie crust made to be broken\". Lies are as natural to  Commies and Muslims as breathing. permalink parent award report block reply grenades_and_ham 1 points 2 days ago “Promise the people everything and give them nothing.” “We must lend a hand to our neighbors, we will extend a helping hand to our neighbor and help ourselves.” “Morons for Moronica!” ~ Moe Howard permalink parent award report block reply\nBidenShowerDrool 3 points 3 days ago because commies love to mimic each other. Soviet Russia's Lenin once told his party, \"promises are like pie crust made to be broken\". Lies are as natural to  Commies and Muslims as breathing. permalink parent award report block reply grenades_and_ham 1 points 2 days ago “Promise the people everything and give them nothing.” “We must lend a hand to our neighbors, we will extend a helping hand to our neighbor and help ourselves.” “Morons for Moronica!” ~ Moe Howard permalink parent award report block reply\ngrenades_and_ham 1 points 2 days ago “Promise the people everything and give them nothing.” “We must lend a hand to our neighbors, we will extend a helping hand to our neighbor and help ourselves.” “Morons for Moronica!” ~ Moe Howard permalink parent award report block reply\nGeneral_Specific 78 points 3 days ago No sauce =you are a dumb faggot. permalink award report block reply xBuckeyex 7 points 2 days ago Should be a deportable offense permalink parent award report block reply ragnarokrobo 2 points 2 days ago To be fair usually the \"source\" is a link to the screencapped tweet. permalink parent award report block reply General_Specific 1 points 2 days ago to be fair we don't post bullshit here that isn't true but is made to look true. permalink parent award report block reply Gofuys 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply\nxBuckeyex 7 points 2 days ago Should be a deportable offense permalink parent award report block reply\nragnarokrobo 2 points 2 days ago To be fair usually the \"source\" is a link to the screencapped tweet. permalink parent award report block reply General_Specific 1 points 2 days ago to be fair we don't post bullshit here that isn't true but is made to look true. permalink parent award report block reply\nGeneral_Specific 1 points 2 days ago to be fair we don't post bullshit here that isn't true but is made to look true. permalink parent award report block reply\nGofuys 1 points 3 days ago Comment removed by community moderators. permalink parent award report block reply\nLookFatty 51 points 3 days ago Guys a fag. Roof drop permalink award report block reply DT170x 17 points 3 days ago Does Gay Muslims throw themselves off of tall building or other Muslims got to throw him off. permalink parent award report block reply Viewer01 5 points 3 days ago He’s a witch. So he just floats. permalink parent award report block reply schiff_for_brains 4 points 3 days ago Looks like he weighs as much as a duck, too! permalink parent award report block reply UCantStumpTheTrump 5 points 3 days ago Trump at least tries to keep his promises, with Democrats its blatant lies to your face 24/7 permalink parent award report block reply\nDT170x 17 points 3 days ago Does Gay Muslims throw themselves off of tall building or other Muslims got to throw him off. permalink parent award report block reply Viewer01 5 points 3 days ago He’s a witch. So he just floats. permalink parent award report block reply schiff_for_brains 4 points 3 days ago Looks like he weighs as much as a duck, too! permalink parent award report block reply\nViewer01 5 points 3 days ago He’s a witch. So he just floats. permalink parent award report block reply schiff_for_brains 4 points 3 days ago Looks like he weighs as much as a duck, too! permalink parent award report block reply\nschiff_for_brains 4 points 3 days ago Looks like he weighs as much as a duck, too! permalink parent award report block reply\nUCantStumpTheTrump 5 points 3 days ago Trump at least tries to keep his promises, with Democrats its blatant lies to your face 24/7 permalink parent award report block reply\nfluffykitten 43 points 3 days ago Got a source besides some random dude on X? permalink award report block reply 2Clutch 27 points 2 days ago Yes, the word \"Breaking\" at the beginning of the tweet. permalink parent award report block reply\n2Clutch 27 points 2 days ago Yes, the word \"Breaking\" at the beginning of the tweet. permalink parent award report block reply\nschism 36 points 3 days ago Is this site just a hive of unsourced bullshit now?  I swear half the crap posted on here is just made up out of thin air. permalink award report block reply aoneleggedduck 13 points 2 days ago I'm glad, though, to see how many top comments are people calling out the lack of sauce. Try as they may, we still have some integrity around here. permalink parent award report block reply FromGodNotMonkey 6 points 2 days ago I'm NOT glad that it gets a sticky permalink parent award report block reply\naoneleggedduck 13 points 2 days ago I'm glad, though, to see how many top comments are people calling out the lack of sauce. Try as they may, we still have some integrity around here. permalink parent award report block reply FromGodNotMonkey 6 points 2 days ago I'm NOT glad that it gets a sticky permalink parent award report block reply\nFromGodNotMonkey 6 points 2 days ago I'm NOT glad that it gets a sticky permalink parent award report block reply\nnewuser8 13 points 3 days ago It's now $100/hr permalink award report block reply Wallllllllllllllllll 10 points 3 days ago Just make it $1,000 an hour with a tax rate of 97%. Government gets $970 and the worker gets $30. That will get us to a communist utopia real fast. And by communist utopia I mean well funded terrorist cells, free sex change surgeries, and empty store shelves. permalink parent award report block reply yukondave 8 points 3 days ago \"This time it will be different\" Photo of Antifa flag outside of Communist Headquarters in 1932 Germany. Karl-Liebknecht-Haus https://en.wikipedia.org/wiki/Karl-Liebknecht-Haus#/media/File:Bundesarchiv_Bild_183-09424-0006,_Berlin,_Karl-Liebknecht-Haus_am_Tag_der_Reichstagswahl.jpg permalink parent award report block reply trumpORbust 7 points 3 days ago Has cheeseburger? permalink parent award report block reply deleted 1 points 2 days ago Wallllllllllllllllll 2 points 2 days ago Oops 🤪 fixed permalink parent award report block reply Gletkin 6 points 3 days ago I make $250 per hour working from home. For the low low price of $9.99 per month I can teach you how to do it too. permalink parent award report block reply 3-10 3 points 3 days ago Yes, the site is called TryHackMe or HackTheBox. It’s legit. Best $10 a month. permalink parent award report block reply\nWallllllllllllllllll 10 points 3 days ago Just make it $1,000 an hour with a tax rate of 97%. Government gets $970 and the worker gets $30. That will get us to a communist utopia real fast. And by communist utopia I mean well funded terrorist cells, free sex change surgeries, and empty store shelves. permalink parent award report block reply yukondave 8 points 3 days ago \"This time it will be different\" Photo of Antifa flag outside of Communist Headquarters in 1932 Germany. Karl-Liebknecht-Haus https://en.wikipedia.org/wiki/Karl-Liebknecht-Haus#/media/File:Bundesarchiv_Bild_183-09424-0006,_Berlin,_Karl-Liebknecht-Haus_am_Tag_der_Reichstagswahl.jpg permalink parent award report block reply trumpORbust 7 points 3 days ago Has cheeseburger? permalink parent award report block reply deleted 1 points 2 days ago Wallllllllllllllllll 2 points 2 days ago Oops 🤪 fixed permalink parent award report block reply\nyukondave 8 points 3 days ago \"This time it will be different\" Photo of Antifa flag outside of Communist Headquarters in 1932 Germany. Karl-Liebknecht-Haus https://en.wikipedia.org/wiki/Karl-Liebknecht-Haus#/media/File:Bundesarchiv_Bild_183-09424-0006,_Berlin,_Karl-Liebknecht-Haus_am_Tag_der_Reichstagswahl.jpg permalink parent award report block reply\ntrumpORbust 7 points 3 days ago Has cheeseburger? permalink parent award report block reply\ndeleted 1 points 2 days ago Wallllllllllllllllll 2 points 2 days ago Oops 🤪 fixed permalink parent award report block reply\nWallllllllllllllllll 2 points 2 days ago Oops 🤪 fixed permalink parent award report block reply\nGletkin 6 points 3 days ago I make $250 per hour working from home. For the low low price of $9.99 per month I can teach you how to do it too. permalink parent award report block reply 3-10 3 points 3 days ago Yes, the site is called TryHackMe or HackTheBox. It’s legit. Best $10 a month. permalink parent award report block reply\n3-10 3 points 3 days ago Yes, the site is called TryHackMe or HackTheBox. It’s legit. Best $10 a month. permalink parent award report block reply\nNibba2 9 points 3 days ago Every Dems playbook. Biden promised student loan forgiveness, yet four days before the election said on national tv it would never happen. The news covered it up. permalink award report block reply\nredditadminssuckit 9 points 3 days ago I CAN'T FIND SOURCE ANYWHERE permalink award report block reply Roadpower 4 points 3 days ago I hadn't heard that he had made this pitch to the street socialist moron in the first place so starting there I looked this up. Apparently this started either very early this year or maybe in 2024. https://www.cityandstateny.com/policy/2025/02/mamdani-unveils-30-30-minimum-wage-push-part-mayoral-campaign/403015/ According to a report by AI the plan was: $20 per hour in 2027; $23.50 in 2028; $27 in 2029; $30 in 2030. I haven't found the retraction yet. permalink parent award report block reply\nRoadpower 4 points 3 days ago I hadn't heard that he had made this pitch to the street socialist moron in the first place so starting there I looked this up. Apparently this started either very early this year or maybe in 2024. https://www.cityandstateny.com/policy/2025/02/mamdani-unveils-30-30-minimum-wage-push-part-mayoral-campaign/403015/ According to a report by AI the plan was: $20 per hour in 2027; $23.50 in 2028; $27 in 2029; $30 in 2030. I haven't found the retraction yet. permalink parent award report block reply\nMedicallyReddit 8 points 3 days ago Muslim faggot will do nothing other than ruin NYC beyond repair and fill the streets with cow dung permalink award report block reply SPEDMan64 6 points 3 days ago Akchewally it's the Hindus that throw dung. The Muslims just spear dung with their dicks...while it's still warm inside the ass. permalink parent award report block reply Wtf_socialismreally 1 points 2 days ago Akchewally it's the Hindus that throw dung. Really? I thought it was just the left. permalink parent award report block reply MaoHadOnly1Testicle 1 points 2 days ago The Muslims just spear dung with their dicks...while it's still warm inside the ass. *inside a goat's ass permalink parent award report block reply\nSPEDMan64 6 points 3 days ago Akchewally it's the Hindus that throw dung. The Muslims just spear dung with their dicks...while it's still warm inside the ass. permalink parent award report block reply Wtf_socialismreally 1 points 2 days ago Akchewally it's the Hindus that throw dung. Really? I thought it was just the left. permalink parent award report block reply MaoHadOnly1Testicle 1 points 2 days ago The Muslims just spear dung with their dicks...while it's still warm inside the ass. *inside a goat's ass permalink parent award report block reply\nWtf_socialismreally 1 points 2 days ago Akchewally it's the Hindus that throw dung. Really? I thought it was just the left. permalink parent award report block reply\nMaoHadOnly1Testicle 1 points 2 days ago The Muslims just spear dung with their dicks...while it's still warm inside the ass. *inside a goat's ass permalink parent award report block reply\nPensivePatriot 7 points 3 days ago ::sweats nervously refreshing the page for a legit source because he definitely sent this out as breaking news and is now in social capital debt to his conservative friends over the lack of receipts:: permalink award report block reply\nHanging_Chad 6 points 3 days ago what’s NYC’s current min wage? permalink award report block reply SPEDMan64 8 points 3 days ago When I started working at Borders Books in 1996 it was $7.50, so I imagine it has risen a little since then. permalink parent award report block reply Awan-CIA-Car-Lot 5 points 3 days ago It's currently 16.50 an hour. permalink parent award report block reply\nSPEDMan64 8 points 3 days ago When I started working at Borders Books in 1996 it was $7.50, so I imagine it has risen a little since then. permalink parent award report block reply Awan-CIA-Car-Lot 5 points 3 days ago It's currently 16.50 an hour. permalink parent award report block reply\nAwan-CIA-Car-Lot 5 points 3 days ago It's currently 16.50 an hour. permalink parent award report block reply\nMungo 6 points 3 days ago So no $30 an hour, no free buses……what’s next? permalink award report block reply that_sound 7 points 3 days ago White flight. NYC goes the way of London and other major European cities. permalink parent award report block reply\nthat_sound 7 points 3 days ago White flight. NYC goes the way of London and other major European cities. permalink parent award report block reply\nRedeemable 5 points 2 days ago Can we see the quote instead of some random X? permalink award report block reply\nJediDwag 5 points 3 days ago Just like Biden's student loan forgiveness. Anyone that thinks these pie in the sky bullshit policies that completely ignore economics are ever going to happen are suckers. permalink award report block reply\nPapabravo12 4 points 3 days ago You mean make do permalink award report block reply bidensmissingbrain 2 points 2 days ago In zohran’s case, make doo. permalink parent award report block reply\nbidensmissingbrain 2 points 2 days ago In zohran’s case, make doo. permalink parent award report block reply\nChachiex 4 points 3 days ago This was how elections worked til 2016 permalink award report block reply\nBasedCostanza91 4 points 3 days ago An Indian scamming? Imagine that. permalink award report block reply\nJackOfAllTirades 4 points 2 days ago I am glad that I read the comments. It confirmed my suspicions that the OP is full of shit and that the mod that stickied this is a faggot. permalink award report block reply\nYodaBannon 3 points 2 days ago Zohran and his Mohrans permalink award report block reply\nVirtusHonos 3 points 3 days ago that was fast permalink award report block reply\nDCPower 3 points 3 days ago Well that was quick permalink award report block reply\nPolander 3 points 2 days ago Why is this stickied? Where the downvote button? permalink award report block reply\nmullethawk 3 points 3 days ago It's \"make do,\" btw so nobody writes it wrong after seeing this post. permalink award report block reply\nOvertaxed 2 points 2 days ago No shitpost flair? permalink award report block reply\nFriar_Pede 2 points 2 days ago Fake permalink award report block reply\nIAmDisappoint 2 points 2 days ago Sause? permalink award report block reply\nthisisatestof2 2 points 3 days ago How long before no free buses? permalink award report block reply Choomguy 2 points 2 days ago Hochul already said she won’t fund that, been tried, homeless moved in… permalink parent award report block reply\nChoomguy 2 points 2 days ago Hochul already said she won’t fund that, been tried, homeless moved in… permalink parent award report block reply\nBeekeepingPatriot 2 points 2 days ago Sauce please permalink award report block reply\nNeilNewsNetwork 2 points 3 days ago fake news, i mean.. Mamdani is a liar in nearly everything, but he never said this permalink award report block reply\nOmegaBird 2 points 2 days ago Unsourced faggoty. permalink award report block reply\nFatigueIsReal 2 points 3 days ago I'm so glad he won. permalink award report block reply\nbooblitchutz 2 points 2 days ago Well, source or not, $30 minimum wage will end commerce in NYC pretty much entirely. permalink award report block reply\nFattestConsequence 2 points 2 days ago Repeal thr 19th, voting age up to 25. permalink award report block reply\nBastard 2 points 3 days ago No refunds. permalink award report block reply\nBaronFalcon 2 points 2 days ago Link it or fuck off faggot permalink award report block reply\nmass55th 2 points 3 days ago Reminds me of Bill Clinton's promise of a middle-class tax cut when he ran for President in 1992. Then, just before he was sworn into office in January 1993, he backtracked on that promise saying:  \"...that the plan was never a major theme in his race for the White House.\" They don't call him \"Slick Willie\" for nothing. permalink award report block reply\nCovfefebrulee 1 points 2 days ago aka communism permalink award report block reply\nKernalMustard 1 points 3 days ago Money the root of all evil. permalink award report block reply Roadpower 1 points 3 days ago No, unearned expectations is. permalink parent award report block reply\nRoadpower 1 points 3 days ago No, unearned expectations is. permalink parent award report block reply\nPdjco658 1 points 3 days ago this dude said ... Viva la revolución in his Che Guevara shirt and then said ... hold up ... huh ... i won? Fuck these people. permalink award report block reply\npedeypete 1 points 3 days ago So in addition to being a goat fucker, he's a liar too. permalink award report block reply\nPKC_MAN 1 points 3 days ago It was never feasable in the first place. People who bought it are just stupid. permalink award report block reply\nPatriotLady1 1 points 3 days ago Who else WONDERS HOW MANY PEOPLE VOTED FOR ZOHAR to get $30/hr??????? SURPRISE surprise...he re-negged!!!!!!!!! permalink award report block reply\nSparks1017 1 points 2 days ago Don't know the source of this, but his account is a great follow permalink award report block reply\ncanada_is_communist 1 points 2 days ago In New york $30 is not even enough to buy a restaurant sandwich anymore... And they still expect 25%+ in \"tips\" permalink award report block reply\nPatriotLady1 1 points 3 days ago Who else WONDERS HOW MANY voted for Zohran SO THEY COULD GET $30/HR???... bet they're dumb-founded 😱 ...gee,what a surprise (NOT) permalink award report block reply\nMAGALADON9 1 points 2 days ago [Plays ussr anthem] BTW it's my ringtone for when lib family calls permalink award report block reply\nVirTW 1 points 3 days ago One of the first of realities of governing vrs running permalink award report block reply\ncovok48 1 points 3 days ago Browns voted for him. Browns can deal. permalink award report block reply\ncafeman23 1 points 2 days ago ( Dark Helmet voice ) Mamdami:\nHere let me give you 30$/hr-- ( Instantly retracts promise ) OH YOU FELL FOR THAT TOO! YOU FELL FOR THE OLDEST TRICK IN THE BOOK! WHAT A GOOF! What's with you guys!? permalink award report block reply\nbrewser724 1 points 3 days ago First of many upcoming backtracks... permalink award report block reply\nRydanovich 1 points 2 days ago Sauce. permalink award report block reply\nDev404 1 points 2 days ago NY is already having a lot of their taxes move out of the state. Why stop at $30 for minimum wage? Why not make it whatever these career criminal politicians make who all become multimillionaires within the first two years of office? AOC knows a lot about that, and her district isn't full of multimilionaires despite she loves socialism..... for everyone else, but not her. Socialism means equal for everyone, right? permalink award report block reply\nCowboy888 1 points 3 days ago Ooooops! permalink award report block reply\nraptormissle 1 points 3 days ago The first of many retractions. Retraction Alpaca. permalink award report block reply\nWrexxis780 1 points 2 days ago I hope he betrays his promises so much that they recall him permalink award report block reply\nDingleBalls 1 points 2 days ago NO REFUNDS permalink award report block reply\nIbleedOrange 1 points 2 days ago Grok says its bullshit. permalink award report block reply\nknnbccb 1 points 3 days ago Taqiyya honeymoon period over. That was fast. At least wait till Christmas. permalink award report block reply\nKmdub2 1 points 2 days ago Do they not teach grammar at all any more? permalink award report block reply\ncyberwar 1 points 2 days ago this toothless troll was around in 2015 too. he got beaten up by his alcoholic girlfriend and had to flee the state. these are the retards you get your news from? permalink award report block reply\nmediweevil 1 points 3 days ago that took even less time than I expected. permalink award report block reply\nRock9Head 1 points 3 days ago What about the free ponies? permalink award report block reply\nastralentity 1 points 2 days ago Isn't this why they were called the useful idiots? permalink award report block reply"}