{"id": "8179461", "contents": "1654 NewsMax host goes Nuclear: \"This is why I hate liberal women...\" posted 3 days ago by HappyFunBall 178 comments award share report block Carl Higbie @CarlHigbie • 5d Women… who walk around saying they need a “safe space” just voted 80% for the guy who TOLD you he was gonna empty out prisons.\n178 comments Sort by Top Top New Worst Old Save Hanging_Chad 126 points 3 days ago based permalink award report block reply XlDEN 122 points 3 days ago There were good based reasons the Founding Fathers did not want women to vote. permalink parent award report block reply BaguettesOfRudysSUB 67 points 3 days ago They make children and have homes to keep. They don't go out and build cities, plow the land, or strategically kill invading Indians. permalink parent award report block reply deleted 27 points 3 days ago yukondave 2 points 3 days ago Ice Cream and Shark Attacks permalink parent award report block reply Deportthemall23 40 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply view 6 more comments... friedchicken 21 points 3 days ago And there's nothing wrong with that. Feminism is an extraordinary evil permalink parent award report block reply barronwin 5 points 3 days ago how do we get back to the Founding Fathers' vision? We must kick off an effort to remove the right to vote from women: THIS is the root cause of the deterioration of our country, more so than anything else permalink parent award report block reply SuperHonkey 2 points 2 days ago AWFLs permalink parent award report block reply Viewer01 38 points 3 days ago Women do need taking a hard look at. I was ambivalent until I found out 1/3 of gen z got murdered in the womb simply because of lifestyle reasons. This accounts for over 15 million abortions for that generation. It’s literally more murder than all wars and homicides in us history. If only white men voted this country would have a 2/3 super majority in both houses and the presidency. If we got 10% more of the white woman vote we’d do the same thing. permalink parent award report block reply ImYourHuckleberry24 23 points 3 days ago Yep. Every female I know of personally that aborted their innocent unborn baby, did it due to inconvenience. Imagine that. permalink parent award report block reply Viewer01 38 points 3 days ago Had an ex dump me for some dr. A year later she texts me to tell me he dumped her because she was pregnant with my kid. She didn’t even bother to tell me before she got an abortion. Insanely enough she wanted to get back together. Spent years texting me every six months or so. These hoes are mercenary. permalink parent award report block reply 45ichooseu 16 points 3 days ago Or she was pregnant with his kid and bounced. I've also seen the baby trap technique. I've seen this countless times with male friends. I was pretty good with women and even I frequently found myself up against women with commitment issues, leaving due to \"boredom/it's not a good time/too busy with school or work/needed to pursue career\", or simply found someone they thought was an upgrade. I've seen them voraciously go through friend groups or even family of their ex, permanently harming other relationships in the process. Women largely do whatever they want, can justify any behavior no matter how atrocious, absolutely can't consider others unless it also benefits them, and develop entitlement over the most absurd things simply because it feels good to them. Honestly, when Socrates wrote \"a woman's oath, I inscribe on water\", I totally get it. I understand every warning in The Book of Proverbs and elsewhere in the Bible. The Bible especially is 100% spot on regarding female behavior. I feel for you dude. I get it completely, been there many times. On the upside, men under 40 are going to be the biggest punishment to women moving forward. We've seen what makes them laugh, their tears are going to fall on deaf ears and once a cohesive male political block forms, women are going to get checked hard. In five years, I've seen \"repeal the 19th\" go from fringe MGTOW dudes to being spoken openly on the right as a discussion point. How long till it's a mainstream idea? permalink parent award report block reply view 5 more comments... ImYourHuckleberry24 14 points 3 days ago I'm so sorry. She killed your child. Feckless whores. permalink parent award report block reply OldBark2 13 points 3 days ago At the risk of sounding my age, 79, scriptures are full of referencing women in association with evil. So it's up to you men to once again exert control over your very attractive toxic masculinity when wanting sex. permalink parent award report block reply view 1 more comments... XlDEN 8 points 3 days ago They are fickle for sure. permalink parent award report block reply One-Man_Riot 5 points 3 days ago BuT rApE aNd IncEst!! permalink parent award report block reply barronwin 2 points 3 days ago or they're bitching about not having money to raise it - a kid on the street is still better than murder permalink parent award report block reply BaguettesOfRudysSUB -16 points 3 days ago Pulling more shit out of your ass and slathering it on these boards. Why don't you go ahead and tell us who these fictitious women were, fag? permalink parent award report block reply Viewer01 19 points 3 days ago Sadly not your mom. Fuck off back to Reddit pajeet. permalink parent award report block reply One-Man_Riot 7 points 3 days ago Found the baby killer. You know what abortion really is? Just a way for women to avoid accountability for their actions. Accountability is y’all’s fucking kryptonite. permalink parent award report block reply ImYourHuckleberry24 3 points 3 days ago Ah, you must have killed your unborn out of convenience. permalink parent award report block reply ImYourHuckleberry24 -1 points 3 days ago Your dumbass reply = zero fucks given permalink parent award report block reply IncredibleMrE1 17 points 3 days ago Few things have been as much of a scourge on the world as women's \"liberation.\" permalink parent award report block reply XlDEN 7 points 3 days ago Without abortion this nation would be 40% fuxated now and on the verge of collapse. permalink parent award report block reply BewareOfThePug 2 points 2 days ago This guy knows. permalink parent award report block reply uxername27 14 points 3 days ago chad permalink parent award report block reply ProtestantPatriot777 16 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply Skogin 7 points 3 days ago He referred to himself as alpha. I’ll allow it. permalink parent award report block reply deleted -1 points 3 days ago BaguettesOfRudysSUB 0 points 3 days ago Fuck off, comment sliding bot. permalink parent award report block reply view 1 more comments... ReturnOfSmarm 3 points 3 days ago Ya know, this whole modern liberal woman thing .... it just seems so, so.......  systemic. permalink parent award report block reply IncredibleMrE1 65 points 3 days ago Feminism is cancer. permalink award report block reply _Eric_Ciaramella_ 30 points 3 days ago 🌎👨‍🚀🔫👨‍🚀 permalink parent award report block reply Get_Off_Big_Tech 13 points 3 days ago This. There was no good wave of feminism. permalink parent award report block reply iirc_life 61 points 3 days ago Lookin at you, 19th amendment ... permalink award report block reply DoesItWorkAlready 35 points 3 days ago 19th amendment + hypergamy => societal destruction permalink parent award report block reply Megaboom2025 12 points 3 days ago Hypergamy has always and will always exist. Letting our women engage in it is problematic permalink parent award report block reply justicein2020 3 points 2 days ago All the ancient cultures across history figured it out. All came up with the same solution. Turns out thats the only way. And we'll end up there again eventually. Or not exist. permalink parent award report block reply iamherefortheluls 1 points 2 days ago at this point, either we end up there ourselves, or the muslims will end up there for us with those few of our women they choose to keep alive permalink parent award report block reply Hunter77 6 points 3 days ago Overturning an amendment is a lot tougher than reversing a SC decision though. permalink parent award report block reply goldkeyboardwarrior 2 points 3 days ago Overturning an amendment is a lot tougher than reversing a SC decision though. Too many people don’t seem to understand that and act like repealing the 19th would be as easy as Trump signing an EO declaring it null and void. It only takes 13 states to stop a new amendment. If we had the votes to repeal the 19th we would also have the votes to do anything else we want and the conversation would be moot. permalink parent award report block reply WoeToYou 11 points 3 days ago It might take 100 years to get there but don’t stop talking about it. Make it mainstream. permalink parent award report block reply goldkeyboardwarrior 2 points 3 days ago You can literally count on one hand the number of countries in the world that don’t allow women to vote and almost all of them are third world countries (technically Vatican City doesn’t let women vote but they’re about the size of a football stadium). I don’t see the US rushing to be the first superpower to ban women from voting in modern day. And one thing people don’t realize about the 19th is it didn’t explicitly allow women to vote but it banned states from banning women to vote. Several states already allowed women to vote so a repeal that does what people pushing for it want would have to have an explicit ban on women voting baked into it. Otherwise states would still be allowed to let women vote. permalink parent award report block reply view 8 more comments... iamherefortheluls 1 points 2 days ago the cultural push must begin now if that is ever to happen. The alternative is our culture and subspecies of the human gene simply gets eradicated by more functional tribes of men. It seems like not giving a fuck about what women think might be the most precious attribute in humanity's genes - one that beats literally all others. the future might be pretty gay permalink parent award report block reply barronwin 0 points 3 days ago where there's a will there's a way- this amendment is the true cancer of our country. Remove this and the path to MAGA will be possible permalink parent award report block reply barronwin 1 points 3 days ago we need to destroy the 19th amendment. Fast permalink parent award report block reply SupFrens 43 points 3 days ago Giving women the right to vote was the first domino to fall. It's been all downhill ever since. This is why I know Muslims and Indians will win, they control their women. permalink award report block reply _Sully_ 22 points 3 days ago We had the federal reserve before they could vote. It's not the women in the shadows my friend. It's the people who enable their hamster wheel brain. permalink parent award report block reply Shih_Tabed 16 points 3 days ago It really is.  When you look at the source, it is the simps that give these women a platform.  The simps that pay the bills all for some hint the woman gave that she would touch his pee pee someday.  If you take that away, women would be too busy paying their own way in life to be able to put much together. permalink parent award report block reply Hanging_Chad 4 points 3 days ago how loyal are their women where Sharia isn’t enforced? https://worldpopulationreview.com/country-rankings/penis-size-by-country edit: Ecuador & Netherlands have some big dicks permalink parent award report block reply aloha_snackbar22 3 points 3 days ago No. The first domino was not picking our own cotton and bringing in an invasive species to do that instead. permalink parent award report block reply barronwin 2 points 3 days ago well look at India- you know theyre not winning permalink parent award report block reply SupFrens 3 points 2 days ago Keep dreaming. I live in an upper class neighborhood with million dollar homes, in the last 10 years Indians have taken over my community. They're stealing your American Dream right up from underneath you. permalink parent award report block reply barronwin 1 points 2 days ago It's hard for them not to, when our own Vice President is creating more Indians to mix in our communities. Just take a look at these kids!! https://i.abcnewsfe.com/a/829b178b-d51a-4bb9-b68b-eff621afdb55/jd-vance-2-gty-gmh-250424_1745504414449_hpMain.jpg?w=1500 permalink parent award report block reply SavingPrivateGrace 25 points 3 days ago They vote for what they want most, abortion.  They are straight D voters. permalink award report block reply GuerillaYourDreams 11 points 3 days ago D is for dummies. permalink parent award report block reply wilburh09 10 points 3 days ago Exactly ..  coming from a family with a sister and multiple female cousins.  That’s really where they put their heels in.   “Vote blue no matter who” while drunk and laughing like hyenas. permalink parent award report block reply BewareOfThePug 2 points 2 days ago you could have also went with \"they want most, they voted for D, muslim D\" permalink parent award report block reply RememberCharlieKirk 1 points 3 days ago As if abortion is ever at risk of being banned The Uniparty is in favor of population control permalink parent award report block reply Dangerous 24 points 3 days ago Funny you're allowed to hate white women for this but not even acknowledge jews let alone hate them for the exact same political proclivity Even though this jewish political behavior predates and directly informed AWFL feminism... permalink award report block reply rebuildingMyself 5 points 2 days ago Or just any non-white women who all act the exact same way permalink parent award report block reply thevagabond 2 points 3 days ago kindly acquaint yourself with the concept of \"per-capita\" permalink parent award report block reply x79q3pb 2 points 2 days ago But I had breakfast yesterday permalink parent award report block reply Aquamine-Amarine 20 points 3 days ago This is what 18+ years of public school brainwashing gets you. This is why leftist women (and leftist men) are retarded. Conservative men and women don't do stupid shit like this. The schools are the problem! They learn this shit from somewhere, they don't just pull it out of thin air! Stop whining about women when you need to concentrate on the communists that infiltrated the school system instead! If the left can brainwash women so easily, why doesn't the right do the same? permalink award report block reply Roadpower 13 points 3 days ago Women by default are leftist. permalink parent award report block reply Overkillengine 11 points 3 days ago Marriage is just communism for two. permalink parent award report block reply thevagabond 2 points 3 days ago now that's fucking funny permalink parent award report block reply Leeboscan 2 points 3 days ago Fairly true. They feel before they think in every case. Except when the situation is obviously fubar. Which by that point its too late to fix. permalink parent award report block reply TrumpAndGodWin 5 points 3 days ago I find it \"funny\" that men don't work together in large numbers to solve problems like they used to, but now bitch about women while acting like old women sitting around a table bitching about men. All groups played a part in letting it get this bad, but men are most likely to fix it if they act like normal men again. permalink parent award report block reply Female 1 points 3 days ago It's easy to understand if you read Adam's excuse in Genesis chapter 3 Kjv (Adam blamed God) permalink parent award report block reply barronwin 2 points 3 days ago No dude. Even without schools, the 19th Amendment gives them the right to vote. THAT is the real problem. Remove that and neither will be a problem permalink parent award report block reply FBIsurveillance 20 points 3 days ago REPEAL THE 19TH AMENDMENT permalink award report block reply 1_Badcop 8 points 3 days ago Indeed! permalink parent award report block reply homertone 14 points 3 days ago They betray their white counterparts like it was nothing. permalink award report block reply ThorsonTT 12 points 3 days ago Women, generally, are subjective thinkers who are easily manipulated by appeals to emotion. permalink award report block reply HappyFunBall OP 8 points 3 days ago That's why infomercials work. permalink parent award report block reply Roadpower 5 points 3 days ago You don't even have to appeal to them with emotion. That is a self running program. permalink parent award report block reply projectarcturus1 11 points 3 days ago When are they going to address and do something about voter fraud? permalink award report block reply SDMan 10 points 3 days ago We COULD always repeal the 19th permalink award report block reply Aoikaze2000 10 points 3 days ago 19th Amendment was a mistake, and a genie we'll never put back into the bottle. permalink award report block reply Get_Off_Big_Tech 10 points 3 days ago Women will put it back in the bottle by voting in invaders who take their rights away. permalink parent award report block reply noPTSDforMePlease 10 points 3 days ago I legit think the 19th amendment is in jeopardy - Gen z and a large segment of millennial males actively think it's the root cause of all of Americas problems today. It won't get repealed for a few decades (gotta wait for boomers to die) but it will eventually. permalink award report block reply RememberCharlieKirk 12 points 3 days ago If Islam becomes the religion of the land, then a repeal of the 19th amendment is likely. However, if the USA government becomes Islamic, we would have more troubling consequences to worry us than just voting rights for women. permalink parent award report block reply uxername27 2 points 3 days ago Obama enters the chat permalink parent award report block reply clmeachum 2 points 3 days ago Not just the religion but the law of the country. permalink parent award report block reply Aquamine-Amarine -1 points 3 days ago No, it won't. And there will be war if it ever does. You idiots need to concentrate on fixing the school system because THAT is why leftist women are retarded. permalink parent award report block reply noPTSDforMePlease 9 points 3 days ago Oh no war. As of that isn't the default state of human nature. Oh no! It will. Women suffrage has only been around for about 100 years and every society that implemented it has weakened. It'll disappear eventually. permalink parent award report block reply throwaway29834751 8 points 3 days ago repeal the 14th amendment.   denaturalize 3000 foreigners from New York City per day.  deport 3000 foreigners from New York City per day. permalink award report block reply UNfreeNewZealand 6 points 3 days ago Their indoctrination started at primary in 1st grade.\nThere’s (part of)an old saying that the Marxists have exploited.\n“If you’re not a socialist when you’re 20, you haven’t got a heart.\nIf you’re still a socialist at 40, you haven’t got a brain”.\nThe Marxist doctrine has screwed over our youth. permalink award report block reply Fren20 4 points 3 days ago Parents partied too much went on cruises gave their little brats everything,a lot of it is the families. permalink parent award report block reply MAGA1773 6 points 3 days ago Women should not vote or hold any position of importance. permalink award report block reply WoeToYou 6 points 3 days ago Repeal the 19th permalink award report block reply Roadpower 5 points 3 days ago The 19th will self repeal when the dollar collapse arrives. permalink parent award report block reply WoeToYou 1 points 3 days ago 🤔 permalink parent award report block reply grannylovestrump 5 points 3 days ago take me in tender woman, take me in for heavens sake. Take me innnnnn tender woman sighs the snake permalink award report block reply Chickensaurus 5 points 3 days ago I like Higbie. Navy SEAL. Pro-2A. Good dude. permalink award report block reply goodtimebox 5 points 3 days ago They voted for him because the thought he was cute and were probably fingering themselves at polls.  Also it was the muzzie vs an old prune who harrased women.  What the hell were the republicans thinking?  They should have all gotten behind Addams. permalink award report block reply Burneraccountno4 1 points 2 days ago They did the same thing with Trudeau Jr (oh, so young and handsome and look at that hair). Now they got a collapsed standard of living, compelled speech laws, and state sponsored mass murder - all within a span of 10 years. permalink parent award report block reply Oodles 4 points 3 days ago Repeal the 19th Amendment permalink award report block reply Oodles 4 points 3 days ago It should not be a surprise. Women do everything based on emotion permalink award report block reply OmegaBird 4 points 2 days ago Liberal white women are the stupidest people on earth permalink award report block reply Rakkasan91b 3 points 3 days ago Well, he's not wrong. permalink award report block reply OldBark2 3 points 3 days ago Love Carl Higbie, my favorite host on NEWSMAX. permalink award report block reply greatpumpkin 3 points 2 days ago Their religion specifically states its ok to lie to 'unbelievers'. The 'religion of peace' translates as, 'my way or the highway'. taqiyya: islam's doctrine of deception permalink award report block reply Redeemable 3 points 2 days ago Revoke the right of women to vote. Our ancestors knew what they were doing permalink award report block reply Goatboy66 3 points 2 days ago Women have no Commin Sense. Repeal the 19th Amendment permalink award report block reply UnderHisWings 3 points 3 days ago He's not wrong. permalink award report block reply Gotmygoose 3 points 3 days ago I hate liberal men too. permalink award report block reply RogueLeaderX 3 points 3 days ago Remember: Young women in NYC voted 80% for Mamdani. Women shouldn't be able to vote till 40. permalink award report block reply Overkillengine 4 points 3 days ago Nah, they shouldn't be able to vote unless they are a net producer. permalink parent award report block reply Psarg 3 points 3 days ago Women evolved to doublespeak permalink award report block reply Forty7thHeaven 3 points 2 days ago Daaaamn!! Mofo is on point 🎯 permalink award report block reply Train_w_no_brakes 3 points 3 days ago Women should not be allowed to vote. Period. They are why 90% of the countries problems linger for decades. They feminize everything and infest everything they allowed to gain any power in.  I’ve watched over my lifetime countless company departments be ruined by libshit women. It’s time to repeal the 19th and let men run shit again. The west got this so wrong. 1000s of years of history told us this is what women do. Btw white knight faggots, this doesn’t mean women have no value. They do.  Just not leading anything outside of the home permalink award report block reply x79q3pb 3 points 2 days ago Women should be allowed to vote I think you accidently something there. permalink parent award report block reply Train_w_no_brakes 1 points 2 days ago Fixed it permalink parent award report block reply Jnicolet4431 3 points 3 days ago 💯🤦 permalink award report block reply TrustYourself 2 points 3 days ago We need to make it like Starship Troopers.   The only good bug is a dead bug. permalink award report block reply ovitz 1 points 3 days ago Oh. I was hoping you meant co-ed showers. permalink parent award report block reply TrustYourself 1 points 2 days ago We get those too.  I thought that was obvious.  :D permalink parent award report block reply roflcopt0rz_returns 2 points 2 days ago Women shouldn't vote. permalink award report block reply Moose_Antlers 2 points 3 days ago The young men in that generation are just as ridiculous. It's pure name recognition and bandwagon. These people literally know nothing and then vote on it. permalink award report block reply NotYourMan 2 points 2 days ago Feminist cult!  Democrats create cults that vote for democrats no matter what.  The feminist cult, the black cult, the gay cult, the lesbian cult, the trans cult are all created as part of political strategy. permalink award report block reply TheFozz 2 points 2 days ago Repeal the 19th ffs, women are too fucking retarded to vote. permalink award report block reply JackOfAllTirades 2 points 3 days ago The 19th. Repeal it. permalink award report block reply Liars-Burn-In-Hell 2 points 2 days ago The problem is women are allowed to vote. permalink award report block reply ChyNahAzzWhole1 2 points 2 days ago Nailed it. permalink award report block reply Smurfection 2 points 2 days ago Liberals are crazy.  These same women think abortion will solve the construct of violent crime. permalink award report block reply Pappy_Gunn 2 points 3 days ago He doesnt sugar coat it.  Excellent. permalink award report block reply Nellie_the_Beaut 2 points 3 days ago I’ve watched Carl Higbie a few times and he’s pretty great.  Well spoken, spot on and doesn’t pull any punches.  Refreshing if you’re in the mood for a traditional evening news program that doesn’t suck. permalink award report block reply boomerbutnotOKBoomer 2 points 2 days ago So glad he is saying it. Can't tell you how many of these arguments I've had with libtard women, including family. One sister is shocked -- SHOCKED I TELL YOU! - that I have guns. That i'm proud I have guns. That I make no bones about having guns, having self-defense classes under my belt, have pulled a gun on a guy who was trying to take me to his truck. AAAAARRRRRRGHGHGHGH!! Oh no! Don't defend yourself!! GAAAAAAAH permalink award report block reply Obambi 2 points 3 days ago Even Melania was sending letters to Putin to stop instead of the midget J. Lost respect for her for that a bit. She got emotional like all broads tend to do when it comes to serious shit. permalink award report block reply solarsavior 2 points 3 days ago IMO, this is why they voted for him.  He is an effective speaker and... The Real Reason Socialism is on the Rise - “...you will never get young people to conserve a society and an economy that is not working for them.” https://greatawakening.win/p/1ARK5A7eLw/the-real-reason-socialism-is-on-/ Ignore the \"Q\" stuff as this has little to do with \"Q\". permalink award report block reply Wupta PRO 1 points 3 days ago Absolutely spot on!! permalink award report block reply Anyone 1 points 3 days ago Stupidity and rape culture... permalink award report block reply Roadpower 1 points 3 days ago The experiment is over. permalink award report block reply Seeker_17 1 points 3 days ago Now bring in the muzzie rape gangs. permalink award report block reply raptormissle 1 points 3 days ago Libtards fantasize and celebrate their demise at the hands of criminals. They would rather be erased by a criminal than have it tarnish their virtue credit score. permalink award report block reply Redeemable 1 points 2 days ago Don't single out White liberal women. The colored ones vote D at even higher rates. permalink award report block reply throttlejohnson 1 points 3 days ago CH is based permalink award report block reply Peekov3 1 points 2 days ago 🚨 ⚠️ 🚨 permalink award report block reply Mhmm2MoreWeeks 1 points 3 days ago BRAINWASHED WHORES permalink award report block reply Michalusmichalus 1 points 2 days ago There are men walking around saying,\" vote blue no matter what\" too. All idiots. permalink award report block reply atomisten 1 points 2 days ago ok but \"voting blue\" lol cuomo is a faggot. there is no \"voting blue\". both candidates are communists. and both are lying about their actual views. permalink award report block reply ridge3z 1 points 3 days ago NYC is a parasitic city run by a kleptocratic government that bogs down New York State and the whole Northeast USA. Most of its citizens are pampered, weak and weak minded. Yes, even the \"tough streets\" NYC tough guys and gang affiliated are weaklings. A city of fools. permalink award report block reply ItsBacon 1 points 3 days ago Accelerate permalink award report block reply PatriotSkorzeny 1 points 2 days ago “Voted” 🤡 permalink award report block reply knnbccb 1 points 3 days ago Suicidal, misguided empathy of foolish, rebellious women. Modern day Jezebels. May stray dogs tear them apart from limb to limb, like what happened to the original Jezebel. https://www.biblegateway.com/passage/?search=2%20Kings%209%3A30-37&version=KJV permalink award report block reply dontdrinksoy 1 points 2 days ago IDGAF. Newsmax sucks. They're just right wing grifters like Fox. OANN for the real shit, okay. permalink award report block reply learntocode 0 points 3 days ago We can talk shit, or we can act. There needs to be a response. A cultural, political, response. Our women are being destroyed. Theg deserve better. permalink award report block reply thevagabond 0 points 3 days ago OMG Retarded blue states voted for democrats whaaaaaaaaaaaaaaaaaaaaaaaaaaaaaat!? what is this? permalink award report block reply Obambi 0 points 3 days ago 99 percent of women are idiots permalink award report block reply deleted -1 points 3 days ago Oleander 2 points 3 days ago Who gave them the right to vote? Somewhere along the way our men fucked up. In a more sane time most of these women would've been normal, just remember that. The way they are turning out is a failure on our part (and to some extent likely an intentional attack by foreign entities). I often notice that the women that turn out the worst had an awful or missing relationship with their father, it's a common theme. How many problems in this world can be traced back to a drought of quality, present fathers I wonder? Probably quite a lot. permalink parent award report block reply x79q3pb 2 points 2 days ago How many of those fathers were ousted by an overly emotional female and nothing to do with their parenting skills? permalink parent award report block reply Mhmm2MoreWeeks -2 points 3 days ago White Cunts are easiest to brainwash. You can wind them up like those old wind up toys and then watch them go. permalink award report block reply MEME-SUPREME -3 points 3 days ago FAFO permalink award report block reply\nHanging_Chad 126 points 3 days ago based permalink award report block reply XlDEN 122 points 3 days ago There were good based reasons the Founding Fathers did not want women to vote. permalink parent award report block reply BaguettesOfRudysSUB 67 points 3 days ago They make children and have homes to keep. They don't go out and build cities, plow the land, or strategically kill invading Indians. permalink parent award report block reply deleted 27 points 3 days ago yukondave 2 points 3 days ago Ice Cream and Shark Attacks permalink parent award report block reply Deportthemall23 40 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply view 6 more comments... friedchicken 21 points 3 days ago And there's nothing wrong with that. Feminism is an extraordinary evil permalink parent award report block reply barronwin 5 points 3 days ago how do we get back to the Founding Fathers' vision? We must kick off an effort to remove the right to vote from women: THIS is the root cause of the deterioration of our country, more so than anything else permalink parent award report block reply SuperHonkey 2 points 2 days ago AWFLs permalink parent award report block reply Viewer01 38 points 3 days ago Women do need taking a hard look at. I was ambivalent until I found out 1/3 of gen z got murdered in the womb simply because of lifestyle reasons. This accounts for over 15 million abortions for that generation. It’s literally more murder than all wars and homicides in us history. If only white men voted this country would have a 2/3 super majority in both houses and the presidency. If we got 10% more of the white woman vote we’d do the same thing. permalink parent award report block reply ImYourHuckleberry24 23 points 3 days ago Yep. Every female I know of personally that aborted their innocent unborn baby, did it due to inconvenience. Imagine that. permalink parent award report block reply Viewer01 38 points 3 days ago Had an ex dump me for some dr. A year later she texts me to tell me he dumped her because she was pregnant with my kid. She didn’t even bother to tell me before she got an abortion. Insanely enough she wanted to get back together. Spent years texting me every six months or so. These hoes are mercenary. permalink parent award report block reply 45ichooseu 16 points 3 days ago Or she was pregnant with his kid and bounced. I've also seen the baby trap technique. I've seen this countless times with male friends. I was pretty good with women and even I frequently found myself up against women with commitment issues, leaving due to \"boredom/it's not a good time/too busy with school or work/needed to pursue career\", or simply found someone they thought was an upgrade. I've seen them voraciously go through friend groups or even family of their ex, permanently harming other relationships in the process. Women largely do whatever they want, can justify any behavior no matter how atrocious, absolutely can't consider others unless it also benefits them, and develop entitlement over the most absurd things simply because it feels good to them. Honestly, when Socrates wrote \"a woman's oath, I inscribe on water\", I totally get it. I understand every warning in The Book of Proverbs and elsewhere in the Bible. The Bible especially is 100% spot on regarding female behavior. I feel for you dude. I get it completely, been there many times. On the upside, men under 40 are going to be the biggest punishment to women moving forward. We've seen what makes them laugh, their tears are going to fall on deaf ears and once a cohesive male political block forms, women are going to get checked hard. In five years, I've seen \"repeal the 19th\" go from fringe MGTOW dudes to being spoken openly on the right as a discussion point. How long till it's a mainstream idea? permalink parent award report block reply view 5 more comments... ImYourHuckleberry24 14 points 3 days ago I'm so sorry. She killed your child. Feckless whores. permalink parent award report block reply OldBark2 13 points 3 days ago At the risk of sounding my age, 79, scriptures are full of referencing women in association with evil. So it's up to you men to once again exert control over your very attractive toxic masculinity when wanting sex. permalink parent award report block reply view 1 more comments... XlDEN 8 points 3 days ago They are fickle for sure. permalink parent award report block reply One-Man_Riot 5 points 3 days ago BuT rApE aNd IncEst!! permalink parent award report block reply barronwin 2 points 3 days ago or they're bitching about not having money to raise it - a kid on the street is still better than murder permalink parent award report block reply BaguettesOfRudysSUB -16 points 3 days ago Pulling more shit out of your ass and slathering it on these boards. Why don't you go ahead and tell us who these fictitious women were, fag? permalink parent award report block reply Viewer01 19 points 3 days ago Sadly not your mom. Fuck off back to Reddit pajeet. permalink parent award report block reply One-Man_Riot 7 points 3 days ago Found the baby killer. You know what abortion really is? Just a way for women to avoid accountability for their actions. Accountability is y’all’s fucking kryptonite. permalink parent award report block reply ImYourHuckleberry24 3 points 3 days ago Ah, you must have killed your unborn out of convenience. permalink parent award report block reply ImYourHuckleberry24 -1 points 3 days ago Your dumbass reply = zero fucks given permalink parent award report block reply IncredibleMrE1 17 points 3 days ago Few things have been as much of a scourge on the world as women's \"liberation.\" permalink parent award report block reply XlDEN 7 points 3 days ago Without abortion this nation would be 40% fuxated now and on the verge of collapse. permalink parent award report block reply BewareOfThePug 2 points 2 days ago This guy knows. permalink parent award report block reply uxername27 14 points 3 days ago chad permalink parent award report block reply ProtestantPatriot777 16 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply Skogin 7 points 3 days ago He referred to himself as alpha. I’ll allow it. permalink parent award report block reply deleted -1 points 3 days ago BaguettesOfRudysSUB 0 points 3 days ago Fuck off, comment sliding bot. permalink parent award report block reply view 1 more comments... ReturnOfSmarm 3 points 3 days ago Ya know, this whole modern liberal woman thing .... it just seems so, so.......  systemic. permalink parent award report block reply\nXlDEN 122 points 3 days ago There were good based reasons the Founding Fathers did not want women to vote. permalink parent award report block reply BaguettesOfRudysSUB 67 points 3 days ago They make children and have homes to keep. They don't go out and build cities, plow the land, or strategically kill invading Indians. permalink parent award report block reply deleted 27 points 3 days ago yukondave 2 points 3 days ago Ice Cream and Shark Attacks permalink parent award report block reply Deportthemall23 40 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply view 6 more comments... friedchicken 21 points 3 days ago And there's nothing wrong with that. Feminism is an extraordinary evil permalink parent award report block reply barronwin 5 points 3 days ago how do we get back to the Founding Fathers' vision? We must kick off an effort to remove the right to vote from women: THIS is the root cause of the deterioration of our country, more so than anything else permalink parent award report block reply SuperHonkey 2 points 2 days ago AWFLs permalink parent award report block reply\nBaguettesOfRudysSUB 67 points 3 days ago They make children and have homes to keep. They don't go out and build cities, plow the land, or strategically kill invading Indians. permalink parent award report block reply deleted 27 points 3 days ago yukondave 2 points 3 days ago Ice Cream and Shark Attacks permalink parent award report block reply Deportthemall23 40 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply view 6 more comments...\ndeleted 27 points 3 days ago yukondave 2 points 3 days ago Ice Cream and Shark Attacks permalink parent award report block reply Deportthemall23 40 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply view 6 more comments...\nyukondave 2 points 3 days ago Ice Cream and Shark Attacks permalink parent award report block reply\nDeportthemall23 40 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply view 6 more comments...\nfriedchicken 21 points 3 days ago And there's nothing wrong with that. Feminism is an extraordinary evil permalink parent award report block reply\nbarronwin 5 points 3 days ago how do we get back to the Founding Fathers' vision? We must kick off an effort to remove the right to vote from women: THIS is the root cause of the deterioration of our country, more so than anything else permalink parent award report block reply\nSuperHonkey 2 points 2 days ago AWFLs permalink parent award report block reply\nViewer01 38 points 3 days ago Women do need taking a hard look at. I was ambivalent until I found out 1/3 of gen z got murdered in the womb simply because of lifestyle reasons. This accounts for over 15 million abortions for that generation. It’s literally more murder than all wars and homicides in us history. If only white men voted this country would have a 2/3 super majority in both houses and the presidency. If we got 10% more of the white woman vote we’d do the same thing. permalink parent award report block reply ImYourHuckleberry24 23 points 3 days ago Yep. Every female I know of personally that aborted their innocent unborn baby, did it due to inconvenience. Imagine that. permalink parent award report block reply Viewer01 38 points 3 days ago Had an ex dump me for some dr. A year later she texts me to tell me he dumped her because she was pregnant with my kid. She didn’t even bother to tell me before she got an abortion. Insanely enough she wanted to get back together. Spent years texting me every six months or so. These hoes are mercenary. permalink parent award report block reply 45ichooseu 16 points 3 days ago Or she was pregnant with his kid and bounced. I've also seen the baby trap technique. I've seen this countless times with male friends. I was pretty good with women and even I frequently found myself up against women with commitment issues, leaving due to \"boredom/it's not a good time/too busy with school or work/needed to pursue career\", or simply found someone they thought was an upgrade. I've seen them voraciously go through friend groups or even family of their ex, permanently harming other relationships in the process. Women largely do whatever they want, can justify any behavior no matter how atrocious, absolutely can't consider others unless it also benefits them, and develop entitlement over the most absurd things simply because it feels good to them. Honestly, when Socrates wrote \"a woman's oath, I inscribe on water\", I totally get it. I understand every warning in The Book of Proverbs and elsewhere in the Bible. The Bible especially is 100% spot on regarding female behavior. I feel for you dude. I get it completely, been there many times. On the upside, men under 40 are going to be the biggest punishment to women moving forward. We've seen what makes them laugh, their tears are going to fall on deaf ears and once a cohesive male political block forms, women are going to get checked hard. In five years, I've seen \"repeal the 19th\" go from fringe MGTOW dudes to being spoken openly on the right as a discussion point. How long till it's a mainstream idea? permalink parent award report block reply view 5 more comments... ImYourHuckleberry24 14 points 3 days ago I'm so sorry. She killed your child. Feckless whores. permalink parent award report block reply OldBark2 13 points 3 days ago At the risk of sounding my age, 79, scriptures are full of referencing women in association with evil. So it's up to you men to once again exert control over your very attractive toxic masculinity when wanting sex. permalink parent award report block reply view 1 more comments... XlDEN 8 points 3 days ago They are fickle for sure. permalink parent award report block reply One-Man_Riot 5 points 3 days ago BuT rApE aNd IncEst!! permalink parent award report block reply barronwin 2 points 3 days ago or they're bitching about not having money to raise it - a kid on the street is still better than murder permalink parent award report block reply BaguettesOfRudysSUB -16 points 3 days ago Pulling more shit out of your ass and slathering it on these boards. Why don't you go ahead and tell us who these fictitious women were, fag? permalink parent award report block reply Viewer01 19 points 3 days ago Sadly not your mom. Fuck off back to Reddit pajeet. permalink parent award report block reply One-Man_Riot 7 points 3 days ago Found the baby killer. You know what abortion really is? Just a way for women to avoid accountability for their actions. Accountability is y’all’s fucking kryptonite. permalink parent award report block reply ImYourHuckleberry24 3 points 3 days ago Ah, you must have killed your unborn out of convenience. permalink parent award report block reply ImYourHuckleberry24 -1 points 3 days ago Your dumbass reply = zero fucks given permalink parent award report block reply IncredibleMrE1 17 points 3 days ago Few things have been as much of a scourge on the world as women's \"liberation.\" permalink parent award report block reply XlDEN 7 points 3 days ago Without abortion this nation would be 40% fuxated now and on the verge of collapse. permalink parent award report block reply BewareOfThePug 2 points 2 days ago This guy knows. permalink parent award report block reply\nImYourHuckleberry24 23 points 3 days ago Yep. Every female I know of personally that aborted their innocent unborn baby, did it due to inconvenience. Imagine that. permalink parent award report block reply Viewer01 38 points 3 days ago Had an ex dump me for some dr. A year later she texts me to tell me he dumped her because she was pregnant with my kid. She didn’t even bother to tell me before she got an abortion. Insanely enough she wanted to get back together. Spent years texting me every six months or so. These hoes are mercenary. permalink parent award report block reply 45ichooseu 16 points 3 days ago Or she was pregnant with his kid and bounced. I've also seen the baby trap technique. I've seen this countless times with male friends. I was pretty good with women and even I frequently found myself up against women with commitment issues, leaving due to \"boredom/it's not a good time/too busy with school or work/needed to pursue career\", or simply found someone they thought was an upgrade. I've seen them voraciously go through friend groups or even family of their ex, permanently harming other relationships in the process. Women largely do whatever they want, can justify any behavior no matter how atrocious, absolutely can't consider others unless it also benefits them, and develop entitlement over the most absurd things simply because it feels good to them. Honestly, when Socrates wrote \"a woman's oath, I inscribe on water\", I totally get it. I understand every warning in The Book of Proverbs and elsewhere in the Bible. The Bible especially is 100% spot on regarding female behavior. I feel for you dude. I get it completely, been there many times. On the upside, men under 40 are going to be the biggest punishment to women moving forward. We've seen what makes them laugh, their tears are going to fall on deaf ears and once a cohesive male political block forms, women are going to get checked hard. In five years, I've seen \"repeal the 19th\" go from fringe MGTOW dudes to being spoken openly on the right as a discussion point. How long till it's a mainstream idea? permalink parent award report block reply view 5 more comments... ImYourHuckleberry24 14 points 3 days ago I'm so sorry. She killed your child. Feckless whores. permalink parent award report block reply OldBark2 13 points 3 days ago At the risk of sounding my age, 79, scriptures are full of referencing women in association with evil. So it's up to you men to once again exert control over your very attractive toxic masculinity when wanting sex. permalink parent award report block reply view 1 more comments... XlDEN 8 points 3 days ago They are fickle for sure. permalink parent award report block reply One-Man_Riot 5 points 3 days ago BuT rApE aNd IncEst!! permalink parent award report block reply barronwin 2 points 3 days ago or they're bitching about not having money to raise it - a kid on the street is still better than murder permalink parent award report block reply BaguettesOfRudysSUB -16 points 3 days ago Pulling more shit out of your ass and slathering it on these boards. Why don't you go ahead and tell us who these fictitious women were, fag? permalink parent award report block reply Viewer01 19 points 3 days ago Sadly not your mom. Fuck off back to Reddit pajeet. permalink parent award report block reply One-Man_Riot 7 points 3 days ago Found the baby killer. You know what abortion really is? Just a way for women to avoid accountability for their actions. Accountability is y’all’s fucking kryptonite. permalink parent award report block reply ImYourHuckleberry24 3 points 3 days ago Ah, you must have killed your unborn out of convenience. permalink parent award report block reply ImYourHuckleberry24 -1 points 3 days ago Your dumbass reply = zero fucks given permalink parent award report block reply\nViewer01 38 points 3 days ago Had an ex dump me for some dr. A year later she texts me to tell me he dumped her because she was pregnant with my kid. She didn’t even bother to tell me before she got an abortion. Insanely enough she wanted to get back together. Spent years texting me every six months or so. These hoes are mercenary. permalink parent award report block reply 45ichooseu 16 points 3 days ago Or she was pregnant with his kid and bounced. I've also seen the baby trap technique. I've seen this countless times with male friends. I was pretty good with women and even I frequently found myself up against women with commitment issues, leaving due to \"boredom/it's not a good time/too busy with school or work/needed to pursue career\", or simply found someone they thought was an upgrade. I've seen them voraciously go through friend groups or even family of their ex, permanently harming other relationships in the process. Women largely do whatever they want, can justify any behavior no matter how atrocious, absolutely can't consider others unless it also benefits them, and develop entitlement over the most absurd things simply because it feels good to them. Honestly, when Socrates wrote \"a woman's oath, I inscribe on water\", I totally get it. I understand every warning in The Book of Proverbs and elsewhere in the Bible. The Bible especially is 100% spot on regarding female behavior. I feel for you dude. I get it completely, been there many times. On the upside, men under 40 are going to be the biggest punishment to women moving forward. We've seen what makes them laugh, their tears are going to fall on deaf ears and once a cohesive male political block forms, women are going to get checked hard. In five years, I've seen \"repeal the 19th\" go from fringe MGTOW dudes to being spoken openly on the right as a discussion point. How long till it's a mainstream idea? permalink parent award report block reply view 5 more comments... ImYourHuckleberry24 14 points 3 days ago I'm so sorry. She killed your child. Feckless whores. permalink parent award report block reply OldBark2 13 points 3 days ago At the risk of sounding my age, 79, scriptures are full of referencing women in association with evil. So it's up to you men to once again exert control over your very attractive toxic masculinity when wanting sex. permalink parent award report block reply view 1 more comments... XlDEN 8 points 3 days ago They are fickle for sure. permalink parent award report block reply\n45ichooseu 16 points 3 days ago Or she was pregnant with his kid and bounced. I've also seen the baby trap technique. I've seen this countless times with male friends. I was pretty good with women and even I frequently found myself up against women with commitment issues, leaving due to \"boredom/it's not a good time/too busy with school or work/needed to pursue career\", or simply found someone they thought was an upgrade. I've seen them voraciously go through friend groups or even family of their ex, permanently harming other relationships in the process. Women largely do whatever they want, can justify any behavior no matter how atrocious, absolutely can't consider others unless it also benefits them, and develop entitlement over the most absurd things simply because it feels good to them. Honestly, when Socrates wrote \"a woman's oath, I inscribe on water\", I totally get it. I understand every warning in The Book of Proverbs and elsewhere in the Bible. The Bible especially is 100% spot on regarding female behavior. I feel for you dude. I get it completely, been there many times. On the upside, men under 40 are going to be the biggest punishment to women moving forward. We've seen what makes them laugh, their tears are going to fall on deaf ears and once a cohesive male political block forms, women are going to get checked hard. In five years, I've seen \"repeal the 19th\" go from fringe MGTOW dudes to being spoken openly on the right as a discussion point. How long till it's a mainstream idea? permalink parent award report block reply view 5 more comments...\nImYourHuckleberry24 14 points 3 days ago I'm so sorry. She killed your child. Feckless whores. permalink parent award report block reply\nOldBark2 13 points 3 days ago At the risk of sounding my age, 79, scriptures are full of referencing women in association with evil. So it's up to you men to once again exert control over your very attractive toxic masculinity when wanting sex. permalink parent award report block reply view 1 more comments...\nXlDEN 8 points 3 days ago They are fickle for sure. permalink parent award report block reply\nOne-Man_Riot 5 points 3 days ago BuT rApE aNd IncEst!! permalink parent award report block reply\nbarronwin 2 points 3 days ago or they're bitching about not having money to raise it - a kid on the street is still better than murder permalink parent award report block reply\nBaguettesOfRudysSUB -16 points 3 days ago Pulling more shit out of your ass and slathering it on these boards. Why don't you go ahead and tell us who these fictitious women were, fag? permalink parent award report block reply Viewer01 19 points 3 days ago Sadly not your mom. Fuck off back to Reddit pajeet. permalink parent award report block reply One-Man_Riot 7 points 3 days ago Found the baby killer. You know what abortion really is? Just a way for women to avoid accountability for their actions. Accountability is y’all’s fucking kryptonite. permalink parent award report block reply ImYourHuckleberry24 3 points 3 days ago Ah, you must have killed your unborn out of convenience. permalink parent award report block reply ImYourHuckleberry24 -1 points 3 days ago Your dumbass reply = zero fucks given permalink parent award report block reply\nViewer01 19 points 3 days ago Sadly not your mom. Fuck off back to Reddit pajeet. permalink parent award report block reply\nOne-Man_Riot 7 points 3 days ago Found the baby killer. You know what abortion really is? Just a way for women to avoid accountability for their actions. Accountability is y’all’s fucking kryptonite. permalink parent award report block reply\nImYourHuckleberry24 3 points 3 days ago Ah, you must have killed your unborn out of convenience. permalink parent award report block reply\nImYourHuckleberry24 -1 points 3 days ago Your dumbass reply = zero fucks given permalink parent award report block reply\nIncredibleMrE1 17 points 3 days ago Few things have been as much of a scourge on the world as women's \"liberation.\" permalink parent award report block reply\nXlDEN 7 points 3 days ago Without abortion this nation would be 40% fuxated now and on the verge of collapse. permalink parent award report block reply BewareOfThePug 2 points 2 days ago This guy knows. permalink parent award report block reply\nBewareOfThePug 2 points 2 days ago This guy knows. permalink parent award report block reply\nuxername27 14 points 3 days ago chad permalink parent award report block reply ProtestantPatriot777 16 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply Skogin 7 points 3 days ago He referred to himself as alpha. I’ll allow it. permalink parent award report block reply deleted -1 points 3 days ago BaguettesOfRudysSUB 0 points 3 days ago Fuck off, comment sliding bot. permalink parent award report block reply view 1 more comments...\nProtestantPatriot777 16 points 3 days ago Comment removed upon the user being banned. permalink parent award report block reply Skogin 7 points 3 days ago He referred to himself as alpha. I’ll allow it. permalink parent award report block reply deleted -1 points 3 days ago BaguettesOfRudysSUB 0 points 3 days ago Fuck off, comment sliding bot. permalink parent award report block reply view 1 more comments...\nSkogin 7 points 3 days ago He referred to himself as alpha. I’ll allow it. permalink parent award report block reply\ndeleted -1 points 3 days ago BaguettesOfRudysSUB 0 points 3 days ago Fuck off, comment sliding bot. permalink parent award report block reply view 1 more comments...\nBaguettesOfRudysSUB 0 points 3 days ago Fuck off, comment sliding bot. permalink parent award report block reply view 1 more comments...\nReturnOfSmarm 3 points 3 days ago Ya know, this whole modern liberal woman thing .... it just seems so, so.......  systemic. permalink parent award report block reply\nIncredibleMrE1 65 points 3 days ago Feminism is cancer. permalink award report block reply _Eric_Ciaramella_ 30 points 3 days ago 🌎👨‍🚀🔫👨‍🚀 permalink parent award report block reply Get_Off_Big_Tech 13 points 3 days ago This. There was no good wave of feminism. permalink parent award report block reply\n_Eric_Ciaramella_ 30 points 3 days ago 🌎👨‍🚀🔫👨‍🚀 permalink parent award report block reply Get_Off_Big_Tech 13 points 3 days ago This. There was no good wave of feminism. permalink parent award report block reply\nGet_Off_Big_Tech 13 points 3 days ago This. There was no good wave of feminism. permalink parent award report block reply\niirc_life 61 points 3 days ago Lookin at you, 19th amendment ... permalink award report block reply DoesItWorkAlready 35 points 3 days ago 19th amendment + hypergamy => societal destruction permalink parent award report block reply Megaboom2025 12 points 3 days ago Hypergamy has always and will always exist. Letting our women engage in it is problematic permalink parent award report block reply justicein2020 3 points 2 days ago All the ancient cultures across history figured it out. All came up with the same solution. Turns out thats the only way. And we'll end up there again eventually. Or not exist. permalink parent award report block reply iamherefortheluls 1 points 2 days ago at this point, either we end up there ourselves, or the muslims will end up there for us with those few of our women they choose to keep alive permalink parent award report block reply Hunter77 6 points 3 days ago Overturning an amendment is a lot tougher than reversing a SC decision though. permalink parent award report block reply goldkeyboardwarrior 2 points 3 days ago Overturning an amendment is a lot tougher than reversing a SC decision though. Too many people don’t seem to understand that and act like repealing the 19th would be as easy as Trump signing an EO declaring it null and void. It only takes 13 states to stop a new amendment. If we had the votes to repeal the 19th we would also have the votes to do anything else we want and the conversation would be moot. permalink parent award report block reply WoeToYou 11 points 3 days ago It might take 100 years to get there but don’t stop talking about it. Make it mainstream. permalink parent award report block reply goldkeyboardwarrior 2 points 3 days ago You can literally count on one hand the number of countries in the world that don’t allow women to vote and almost all of them are third world countries (technically Vatican City doesn’t let women vote but they’re about the size of a football stadium). I don’t see the US rushing to be the first superpower to ban women from voting in modern day. And one thing people don’t realize about the 19th is it didn’t explicitly allow women to vote but it banned states from banning women to vote. Several states already allowed women to vote so a repeal that does what people pushing for it want would have to have an explicit ban on women voting baked into it. Otherwise states would still be allowed to let women vote. permalink parent award report block reply view 8 more comments... iamherefortheluls 1 points 2 days ago the cultural push must begin now if that is ever to happen. The alternative is our culture and subspecies of the human gene simply gets eradicated by more functional tribes of men. It seems like not giving a fuck about what women think might be the most precious attribute in humanity's genes - one that beats literally all others. the future might be pretty gay permalink parent award report block reply barronwin 0 points 3 days ago where there's a will there's a way- this amendment is the true cancer of our country. Remove this and the path to MAGA will be possible permalink parent award report block reply barronwin 1 points 3 days ago we need to destroy the 19th amendment. Fast permalink parent award report block reply\nDoesItWorkAlready 35 points 3 days ago 19th amendment + hypergamy => societal destruction permalink parent award report block reply Megaboom2025 12 points 3 days ago Hypergamy has always and will always exist. Letting our women engage in it is problematic permalink parent award report block reply justicein2020 3 points 2 days ago All the ancient cultures across history figured it out. All came up with the same solution. Turns out thats the only way. And we'll end up there again eventually. Or not exist. permalink parent award report block reply iamherefortheluls 1 points 2 days ago at this point, either we end up there ourselves, or the muslims will end up there for us with those few of our women they choose to keep alive permalink parent award report block reply\nMegaboom2025 12 points 3 days ago Hypergamy has always and will always exist. Letting our women engage in it is problematic permalink parent award report block reply justicein2020 3 points 2 days ago All the ancient cultures across history figured it out. All came up with the same solution. Turns out thats the only way. And we'll end up there again eventually. Or not exist. permalink parent award report block reply iamherefortheluls 1 points 2 days ago at this point, either we end up there ourselves, or the muslims will end up there for us with those few of our women they choose to keep alive permalink parent award report block reply\njusticein2020 3 points 2 days ago All the ancient cultures across history figured it out. All came up with the same solution. Turns out thats the only way. And we'll end up there again eventually. Or not exist. permalink parent award report block reply iamherefortheluls 1 points 2 days ago at this point, either we end up there ourselves, or the muslims will end up there for us with those few of our women they choose to keep alive permalink parent award report block reply\niamherefortheluls 1 points 2 days ago at this point, either we end up there ourselves, or the muslims will end up there for us with those few of our women they choose to keep alive permalink parent award report block reply\nHunter77 6 points 3 days ago Overturning an amendment is a lot tougher than reversing a SC decision though. permalink parent award report block reply goldkeyboardwarrior 2 points 3 days ago Overturning an amendment is a lot tougher than reversing a SC decision though. Too many people don’t seem to understand that and act like repealing the 19th would be as easy as Trump signing an EO declaring it null and void. It only takes 13 states to stop a new amendment. If we had the votes to repeal the 19th we would also have the votes to do anything else we want and the conversation would be moot. permalink parent award report block reply WoeToYou 11 points 3 days ago It might take 100 years to get there but don’t stop talking about it. Make it mainstream. permalink parent award report block reply goldkeyboardwarrior 2 points 3 days ago You can literally count on one hand the number of countries in the world that don’t allow women to vote and almost all of them are third world countries (technically Vatican City doesn’t let women vote but they’re about the size of a football stadium). I don’t see the US rushing to be the first superpower to ban women from voting in modern day. And one thing people don’t realize about the 19th is it didn’t explicitly allow women to vote but it banned states from banning women to vote. Several states already allowed women to vote so a repeal that does what people pushing for it want would have to have an explicit ban on women voting baked into it. Otherwise states would still be allowed to let women vote. permalink parent award report block reply view 8 more comments... iamherefortheluls 1 points 2 days ago the cultural push must begin now if that is ever to happen. The alternative is our culture and subspecies of the human gene simply gets eradicated by more functional tribes of men. It seems like not giving a fuck about what women think might be the most precious attribute in humanity's genes - one that beats literally all others. the future might be pretty gay permalink parent award report block reply barronwin 0 points 3 days ago where there's a will there's a way- this amendment is the true cancer of our country. Remove this and the path to MAGA will be possible permalink parent award report block reply\ngoldkeyboardwarrior 2 points 3 days ago Overturning an amendment is a lot tougher than reversing a SC decision though. Too many people don’t seem to understand that and act like repealing the 19th would be as easy as Trump signing an EO declaring it null and void. It only takes 13 states to stop a new amendment. If we had the votes to repeal the 19th we would also have the votes to do anything else we want and the conversation would be moot. permalink parent award report block reply WoeToYou 11 points 3 days ago It might take 100 years to get there but don’t stop talking about it. Make it mainstream. permalink parent award report block reply goldkeyboardwarrior 2 points 3 days ago You can literally count on one hand the number of countries in the world that don’t allow women to vote and almost all of them are third world countries (technically Vatican City doesn’t let women vote but they’re about the size of a football stadium). I don’t see the US rushing to be the first superpower to ban women from voting in modern day. And one thing people don’t realize about the 19th is it didn’t explicitly allow women to vote but it banned states from banning women to vote. Several states already allowed women to vote so a repeal that does what people pushing for it want would have to have an explicit ban on women voting baked into it. Otherwise states would still be allowed to let women vote. permalink parent award report block reply view 8 more comments... iamherefortheluls 1 points 2 days ago the cultural push must begin now if that is ever to happen. The alternative is our culture and subspecies of the human gene simply gets eradicated by more functional tribes of men. It seems like not giving a fuck about what women think might be the most precious attribute in humanity's genes - one that beats literally all others. the future might be pretty gay permalink parent award report block reply\nWoeToYou 11 points 3 days ago It might take 100 years to get there but don’t stop talking about it. Make it mainstream. permalink parent award report block reply goldkeyboardwarrior 2 points 3 days ago You can literally count on one hand the number of countries in the world that don’t allow women to vote and almost all of them are third world countries (technically Vatican City doesn’t let women vote but they’re about the size of a football stadium). I don’t see the US rushing to be the first superpower to ban women from voting in modern day. And one thing people don’t realize about the 19th is it didn’t explicitly allow women to vote but it banned states from banning women to vote. Several states already allowed women to vote so a repeal that does what people pushing for it want would have to have an explicit ban on women voting baked into it. Otherwise states would still be allowed to let women vote. permalink parent award report block reply view 8 more comments...\ngoldkeyboardwarrior 2 points 3 days ago You can literally count on one hand the number of countries in the world that don’t allow women to vote and almost all of them are third world countries (technically Vatican City doesn’t let women vote but they’re about the size of a football stadium). I don’t see the US rushing to be the first superpower to ban women from voting in modern day. And one thing people don’t realize about the 19th is it didn’t explicitly allow women to vote but it banned states from banning women to vote. Several states already allowed women to vote so a repeal that does what people pushing for it want would have to have an explicit ban on women voting baked into it. Otherwise states would still be allowed to let women vote. permalink parent award report block reply view 8 more comments...\niamherefortheluls 1 points 2 days ago the cultural push must begin now if that is ever to happen. The alternative is our culture and subspecies of the human gene simply gets eradicated by more functional tribes of men. It seems like not giving a fuck about what women think might be the most precious attribute in humanity's genes - one that beats literally all others. the future might be pretty gay permalink parent award report block reply\nbarronwin 0 points 3 days ago where there's a will there's a way- this amendment is the true cancer of our country. Remove this and the path to MAGA will be possible permalink parent award report block reply\nbarronwin 1 points 3 days ago we need to destroy the 19th amendment. Fast permalink parent award report block reply\nSupFrens 43 points 3 days ago Giving women the right to vote was the first domino to fall. It's been all downhill ever since. This is why I know Muslims and Indians will win, they control their women. permalink award report block reply _Sully_ 22 points 3 days ago We had the federal reserve before they could vote. It's not the women in the shadows my friend. It's the people who enable their hamster wheel brain. permalink parent award report block reply Shih_Tabed 16 points 3 days ago It really is.  When you look at the source, it is the simps that give these women a platform.  The simps that pay the bills all for some hint the woman gave that she would touch his pee pee someday.  If you take that away, women would be too busy paying their own way in life to be able to put much together. permalink parent award report block reply Hanging_Chad 4 points 3 days ago how loyal are their women where Sharia isn’t enforced? https://worldpopulationreview.com/country-rankings/penis-size-by-country edit: Ecuador & Netherlands have some big dicks permalink parent award report block reply aloha_snackbar22 3 points 3 days ago No. The first domino was not picking our own cotton and bringing in an invasive species to do that instead. permalink parent award report block reply barronwin 2 points 3 days ago well look at India- you know theyre not winning permalink parent award report block reply SupFrens 3 points 2 days ago Keep dreaming. I live in an upper class neighborhood with million dollar homes, in the last 10 years Indians have taken over my community. They're stealing your American Dream right up from underneath you. permalink parent award report block reply barronwin 1 points 2 days ago It's hard for them not to, when our own Vice President is creating more Indians to mix in our communities. Just take a look at these kids!! https://i.abcnewsfe.com/a/829b178b-d51a-4bb9-b68b-eff621afdb55/jd-vance-2-gty-gmh-250424_1745504414449_hpMain.jpg?w=1500 permalink parent award report block reply\n_Sully_ 22 points 3 days ago We had the federal reserve before they could vote. It's not the women in the shadows my friend. It's the people who enable their hamster wheel brain. permalink parent award report block reply Shih_Tabed 16 points 3 days ago It really is.  When you look at the source, it is the simps that give these women a platform.  The simps that pay the bills all for some hint the woman gave that she would touch his pee pee someday.  If you take that away, women would be too busy paying their own way in life to be able to put much together. permalink parent award report block reply\nShih_Tabed 16 points 3 days ago It really is.  When you look at the source, it is the simps that give these women a platform.  The simps that pay the bills all for some hint the woman gave that she would touch his pee pee someday.  If you take that away, women would be too busy paying their own way in life to be able to put much together. permalink parent award report block reply\nHanging_Chad 4 points 3 days ago how loyal are their women where Sharia isn’t enforced? https://worldpopulationreview.com/country-rankings/penis-size-by-country edit: Ecuador & Netherlands have some big dicks permalink parent award report block reply\naloha_snackbar22 3 points 3 days ago No. The first domino was not picking our own cotton and bringing in an invasive species to do that instead. permalink parent award report block reply\nbarronwin 2 points 3 days ago well look at India- you know theyre not winning permalink parent award report block reply SupFrens 3 points 2 days ago Keep dreaming. I live in an upper class neighborhood with million dollar homes, in the last 10 years Indians have taken over my community. They're stealing your American Dream right up from underneath you. permalink parent award report block reply barronwin 1 points 2 days ago It's hard for them not to, when our own Vice President is creating more Indians to mix in our communities. Just take a look at these kids!! https://i.abcnewsfe.com/a/829b178b-d51a-4bb9-b68b-eff621afdb55/jd-vance-2-gty-gmh-250424_1745504414449_hpMain.jpg?w=1500 permalink parent award report block reply\nSupFrens 3 points 2 days ago Keep dreaming. I live in an upper class neighborhood with million dollar homes, in the last 10 years Indians have taken over my community. They're stealing your American Dream right up from underneath you. permalink parent award report block reply barronwin 1 points 2 days ago It's hard for them not to, when our own Vice President is creating more Indians to mix in our communities. Just take a look at these kids!! https://i.abcnewsfe.com/a/829b178b-d51a-4bb9-b68b-eff621afdb55/jd-vance-2-gty-gmh-250424_1745504414449_hpMain.jpg?w=1500 permalink parent award report block reply\nbarronwin 1 points 2 days ago It's hard for them not to, when our own Vice President is creating more Indians to mix in our communities. Just take a look at these kids!! https://i.abcnewsfe.com/a/829b178b-d51a-4bb9-b68b-eff621afdb55/jd-vance-2-gty-gmh-250424_1745504414449_hpMain.jpg?w=1500 permalink parent award report block reply\nSavingPrivateGrace 25 points 3 days ago They vote for what they want most, abortion.  They are straight D voters. permalink award report block reply GuerillaYourDreams 11 points 3 days ago D is for dummies. permalink parent award report block reply wilburh09 10 points 3 days ago Exactly ..  coming from a family with a sister and multiple female cousins.  That’s really where they put their heels in.   “Vote blue no matter who” while drunk and laughing like hyenas. permalink parent award report block reply BewareOfThePug 2 points 2 days ago you could have also went with \"they want most, they voted for D, muslim D\" permalink parent award report block reply RememberCharlieKirk 1 points 3 days ago As if abortion is ever at risk of being banned The Uniparty is in favor of population control permalink parent award report block reply\nGuerillaYourDreams 11 points 3 days ago D is for dummies. permalink parent award report block reply\nwilburh09 10 points 3 days ago Exactly ..  coming from a family with a sister and multiple female cousins.  That’s really where they put their heels in.   “Vote blue no matter who” while drunk and laughing like hyenas. permalink parent award report block reply\nBewareOfThePug 2 points 2 days ago you could have also went with \"they want most, they voted for D, muslim D\" permalink parent award report block reply\nRememberCharlieKirk 1 points 3 days ago As if abortion is ever at risk of being banned The Uniparty is in favor of population control permalink parent award report block reply\nDangerous 24 points 3 days ago Funny you're allowed to hate white women for this but not even acknowledge jews let alone hate them for the exact same political proclivity Even though this jewish political behavior predates and directly informed AWFL feminism... permalink award report block reply rebuildingMyself 5 points 2 days ago Or just any non-white women who all act the exact same way permalink parent award report block reply thevagabond 2 points 3 days ago kindly acquaint yourself with the concept of \"per-capita\" permalink parent award report block reply x79q3pb 2 points 2 days ago But I had breakfast yesterday permalink parent award report block reply\nrebuildingMyself 5 points 2 days ago Or just any non-white women who all act the exact same way permalink parent award report block reply\nthevagabond 2 points 3 days ago kindly acquaint yourself with the concept of \"per-capita\" permalink parent award report block reply x79q3pb 2 points 2 days ago But I had breakfast yesterday permalink parent award report block reply\nx79q3pb 2 points 2 days ago But I had breakfast yesterday permalink parent award report block reply\nAquamine-Amarine 20 points 3 days ago This is what 18+ years of public school brainwashing gets you. This is why leftist women (and leftist men) are retarded. Conservative men and women don't do stupid shit like this. The schools are the problem! They learn this shit from somewhere, they don't just pull it out of thin air! Stop whining about women when you need to concentrate on the communists that infiltrated the school system instead! If the left can brainwash women so easily, why doesn't the right do the same? permalink award report block reply Roadpower 13 points 3 days ago Women by default are leftist. permalink parent award report block reply Overkillengine 11 points 3 days ago Marriage is just communism for two. permalink parent award report block reply thevagabond 2 points 3 days ago now that's fucking funny permalink parent award report block reply Leeboscan 2 points 3 days ago Fairly true. They feel before they think in every case. Except when the situation is obviously fubar. Which by that point its too late to fix. permalink parent award report block reply TrumpAndGodWin 5 points 3 days ago I find it \"funny\" that men don't work together in large numbers to solve problems like they used to, but now bitch about women while acting like old women sitting around a table bitching about men. All groups played a part in letting it get this bad, but men are most likely to fix it if they act like normal men again. permalink parent award report block reply Female 1 points 3 days ago It's easy to understand if you read Adam's excuse in Genesis chapter 3 Kjv (Adam blamed God) permalink parent award report block reply barronwin 2 points 3 days ago No dude. Even without schools, the 19th Amendment gives them the right to vote. THAT is the real problem. Remove that and neither will be a problem permalink parent award report block reply\nRoadpower 13 points 3 days ago Women by default are leftist. permalink parent award report block reply Overkillengine 11 points 3 days ago Marriage is just communism for two. permalink parent award report block reply thevagabond 2 points 3 days ago now that's fucking funny permalink parent award report block reply Leeboscan 2 points 3 days ago Fairly true. They feel before they think in every case. Except when the situation is obviously fubar. Which by that point its too late to fix. permalink parent award report block reply\nOverkillengine 11 points 3 days ago Marriage is just communism for two. permalink parent award report block reply thevagabond 2 points 3 days ago now that's fucking funny permalink parent award report block reply\nthevagabond 2 points 3 days ago now that's fucking funny permalink parent award report block reply\nLeeboscan 2 points 3 days ago Fairly true. They feel before they think in every case. Except when the situation is obviously fubar. Which by that point its too late to fix. permalink parent award report block reply\nTrumpAndGodWin 5 points 3 days ago I find it \"funny\" that men don't work together in large numbers to solve problems like they used to, but now bitch about women while acting like old women sitting around a table bitching about men. All groups played a part in letting it get this bad, but men are most likely to fix it if they act like normal men again. permalink parent award report block reply Female 1 points 3 days ago It's easy to understand if you read Adam's excuse in Genesis chapter 3 Kjv (Adam blamed God) permalink parent award report block reply\nFemale 1 points 3 days ago It's easy to understand if you read Adam's excuse in Genesis chapter 3 Kjv (Adam blamed God) permalink parent award report block reply\nbarronwin 2 points 3 days ago No dude. Even without schools, the 19th Amendment gives them the right to vote. THAT is the real problem. Remove that and neither will be a problem permalink parent award report block reply\nFBIsurveillance 20 points 3 days ago REPEAL THE 19TH AMENDMENT permalink award report block reply 1_Badcop 8 points 3 days ago Indeed! permalink parent award report block reply\n1_Badcop 8 points 3 days ago Indeed! permalink parent award report block reply\nhomertone 14 points 3 days ago They betray their white counterparts like it was nothing. permalink award report block reply\nThorsonTT 12 points 3 days ago Women, generally, are subjective thinkers who are easily manipulated by appeals to emotion. permalink award report block reply HappyFunBall OP 8 points 3 days ago That's why infomercials work. permalink parent award report block reply Roadpower 5 points 3 days ago You don't even have to appeal to them with emotion. That is a self running program. permalink parent award report block reply\nHappyFunBall OP 8 points 3 days ago That's why infomercials work. permalink parent award report block reply\nRoadpower 5 points 3 days ago You don't even have to appeal to them with emotion. That is a self running program. permalink parent award report block reply\nprojectarcturus1 11 points 3 days ago When are they going to address and do something about voter fraud? permalink award report block reply\nSDMan 10 points 3 days ago We COULD always repeal the 19th permalink award report block reply\nAoikaze2000 10 points 3 days ago 19th Amendment was a mistake, and a genie we'll never put back into the bottle. permalink award report block reply Get_Off_Big_Tech 10 points 3 days ago Women will put it back in the bottle by voting in invaders who take their rights away. permalink parent award report block reply\nGet_Off_Big_Tech 10 points 3 days ago Women will put it back in the bottle by voting in invaders who take their rights away. permalink parent award report block reply\nnoPTSDforMePlease 10 points 3 days ago I legit think the 19th amendment is in jeopardy - Gen z and a large segment of millennial males actively think it's the root cause of all of Americas problems today. It won't get repealed for a few decades (gotta wait for boomers to die) but it will eventually. permalink award report block reply RememberCharlieKirk 12 points 3 days ago If Islam becomes the religion of the land, then a repeal of the 19th amendment is likely. However, if the USA government becomes Islamic, we would have more troubling consequences to worry us than just voting rights for women. permalink parent award report block reply uxername27 2 points 3 days ago Obama enters the chat permalink parent award report block reply clmeachum 2 points 3 days ago Not just the religion but the law of the country. permalink parent award report block reply Aquamine-Amarine -1 points 3 days ago No, it won't. And there will be war if it ever does. You idiots need to concentrate on fixing the school system because THAT is why leftist women are retarded. permalink parent award report block reply noPTSDforMePlease 9 points 3 days ago Oh no war. As of that isn't the default state of human nature. Oh no! It will. Women suffrage has only been around for about 100 years and every society that implemented it has weakened. It'll disappear eventually. permalink parent award report block reply\nRememberCharlieKirk 12 points 3 days ago If Islam becomes the religion of the land, then a repeal of the 19th amendment is likely. However, if the USA government becomes Islamic, we would have more troubling consequences to worry us than just voting rights for women. permalink parent award report block reply uxername27 2 points 3 days ago Obama enters the chat permalink parent award report block reply clmeachum 2 points 3 days ago Not just the religion but the law of the country. permalink parent award report block reply\nuxername27 2 points 3 days ago Obama enters the chat permalink parent award report block reply\nclmeachum 2 points 3 days ago Not just the religion but the law of the country. permalink parent award report block reply\nAquamine-Amarine -1 points 3 days ago No, it won't. And there will be war if it ever does. You idiots need to concentrate on fixing the school system because THAT is why leftist women are retarded. permalink parent award report block reply noPTSDforMePlease 9 points 3 days ago Oh no war. As of that isn't the default state of human nature. Oh no! It will. Women suffrage has only been around for about 100 years and every society that implemented it has weakened. It'll disappear eventually. permalink parent award report block reply\nnoPTSDforMePlease 9 points 3 days ago Oh no war. As of that isn't the default state of human nature. Oh no! It will. Women suffrage has only been around for about 100 years and every society that implemented it has weakened. It'll disappear eventually. permalink parent award report block reply\nthrowaway29834751 8 points 3 days ago repeal the 14th amendment.   denaturalize 3000 foreigners from New York City per day.  deport 3000 foreigners from New York City per day. permalink award report block reply\nUNfreeNewZealand 6 points 3 days ago Their indoctrination started at primary in 1st grade.\nThere’s (part of)an old saying that the Marxists have exploited.\n“If you’re not a socialist when you’re 20, you haven’t got a heart.\nIf you’re still a socialist at 40, you haven’t got a brain”.\nThe Marxist doctrine has screwed over our youth. permalink award report block reply Fren20 4 points 3 days ago Parents partied too much went on cruises gave their little brats everything,a lot of it is the families. permalink parent award report block reply\nFren20 4 points 3 days ago Parents partied too much went on cruises gave their little brats everything,a lot of it is the families. permalink parent award report block reply\nMAGA1773 6 points 3 days ago Women should not vote or hold any position of importance. permalink award report block reply\nWoeToYou 6 points 3 days ago Repeal the 19th permalink award report block reply Roadpower 5 points 3 days ago The 19th will self repeal when the dollar collapse arrives. permalink parent award report block reply WoeToYou 1 points 3 days ago 🤔 permalink parent award report block reply\nRoadpower 5 points 3 days ago The 19th will self repeal when the dollar collapse arrives. permalink parent award report block reply WoeToYou 1 points 3 days ago 🤔 permalink parent award report block reply\nWoeToYou 1 points 3 days ago 🤔 permalink parent award report block reply\ngrannylovestrump 5 points 3 days ago take me in tender woman, take me in for heavens sake. Take me innnnnn tender woman sighs the snake permalink award report block reply\nChickensaurus 5 points 3 days ago I like Higbie. Navy SEAL. Pro-2A. Good dude. permalink award report block reply\ngoodtimebox 5 points 3 days ago They voted for him because the thought he was cute and were probably fingering themselves at polls.  Also it was the muzzie vs an old prune who harrased women.  What the hell were the republicans thinking?  They should have all gotten behind Addams. permalink award report block reply Burneraccountno4 1 points 2 days ago They did the same thing with Trudeau Jr (oh, so young and handsome and look at that hair). Now they got a collapsed standard of living, compelled speech laws, and state sponsored mass murder - all within a span of 10 years. permalink parent award report block reply\nBurneraccountno4 1 points 2 days ago They did the same thing with Trudeau Jr (oh, so young and handsome and look at that hair). Now they got a collapsed standard of living, compelled speech laws, and state sponsored mass murder - all within a span of 10 years. permalink parent award report block reply\nOodles 4 points 3 days ago Repeal the 19th Amendment permalink award report block reply\nOodles 4 points 3 days ago It should not be a surprise. Women do everything based on emotion permalink award report block reply\nOmegaBird 4 points 2 days ago Liberal white women are the stupidest people on earth permalink award report block reply\nRakkasan91b 3 points 3 days ago Well, he's not wrong. permalink award report block reply\nOldBark2 3 points 3 days ago Love Carl Higbie, my favorite host on NEWSMAX. permalink award report block reply\ngreatpumpkin 3 points 2 days ago Their religion specifically states its ok to lie to 'unbelievers'. The 'religion of peace' translates as, 'my way or the highway'. taqiyya: islam's doctrine of deception permalink award report block reply\nRedeemable 3 points 2 days ago Revoke the right of women to vote. Our ancestors knew what they were doing permalink award report block reply\nGoatboy66 3 points 2 days ago Women have no Commin Sense. Repeal the 19th Amendment permalink award report block reply\nUnderHisWings 3 points 3 days ago He's not wrong. permalink award report block reply\nGotmygoose 3 points 3 days ago I hate liberal men too. permalink award report block reply\nRogueLeaderX 3 points 3 days ago Remember: Young women in NYC voted 80% for Mamdani. Women shouldn't be able to vote till 40. permalink award report block reply Overkillengine 4 points 3 days ago Nah, they shouldn't be able to vote unless they are a net producer. permalink parent award report block reply\nOverkillengine 4 points 3 days ago Nah, they shouldn't be able to vote unless they are a net producer. permalink parent award report block reply\nPsarg 3 points 3 days ago Women evolved to doublespeak permalink award report block reply\nForty7thHeaven 3 points 2 days ago Daaaamn!! Mofo is on point 🎯 permalink award report block reply\nTrain_w_no_brakes 3 points 3 days ago Women should not be allowed to vote. Period. They are why 90% of the countries problems linger for decades. They feminize everything and infest everything they allowed to gain any power in.  I’ve watched over my lifetime countless company departments be ruined by libshit women. It’s time to repeal the 19th and let men run shit again. The west got this so wrong. 1000s of years of history told us this is what women do. Btw white knight faggots, this doesn’t mean women have no value. They do.  Just not leading anything outside of the home permalink award report block reply x79q3pb 3 points 2 days ago Women should be allowed to vote I think you accidently something there. permalink parent award report block reply Train_w_no_brakes 1 points 2 days ago Fixed it permalink parent award report block reply\nx79q3pb 3 points 2 days ago Women should be allowed to vote I think you accidently something there. permalink parent award report block reply Train_w_no_brakes 1 points 2 days ago Fixed it permalink parent award report block reply\nTrain_w_no_brakes 1 points 2 days ago Fixed it permalink parent award report block reply\nJnicolet4431 3 points 3 days ago 💯🤦 permalink award report block reply\nTrustYourself 2 points 3 days ago We need to make it like Starship Troopers.   The only good bug is a dead bug. permalink award report block reply ovitz 1 points 3 days ago Oh. I was hoping you meant co-ed showers. permalink parent award report block reply TrustYourself 1 points 2 days ago We get those too.  I thought that was obvious.  :D permalink parent award report block reply\novitz 1 points 3 days ago Oh. I was hoping you meant co-ed showers. permalink parent award report block reply TrustYourself 1 points 2 days ago We get those too.  I thought that was obvious.  :D permalink parent award report block reply\nTrustYourself 1 points 2 days ago We get those too.  I thought that was obvious.  :D permalink parent award report block reply\nroflcopt0rz_returns 2 points 2 days ago Women shouldn't vote. permalink award report block reply\nMoose_Antlers 2 points 3 days ago The young men in that generation are just as ridiculous. It's pure name recognition and bandwagon. These people literally know nothing and then vote on it. permalink award report block reply\nNotYourMan 2 points 2 days ago Feminist cult!  Democrats create cults that vote for democrats no matter what.  The feminist cult, the black cult, the gay cult, the lesbian cult, the trans cult are all created as part of political strategy. permalink award report block reply\nTheFozz 2 points 2 days ago Repeal the 19th ffs, women are too fucking retarded to vote. permalink award report block reply\nJackOfAllTirades 2 points 3 days ago The 19th. Repeal it. permalink award report block reply\nLiars-Burn-In-Hell 2 points 2 days ago The problem is women are allowed to vote. permalink award report block reply\nChyNahAzzWhole1 2 points 2 days ago Nailed it. permalink award report block reply\nSmurfection 2 points 2 days ago Liberals are crazy.  These same women think abortion will solve the construct of violent crime. permalink award report block reply\nPappy_Gunn 2 points 3 days ago He doesnt sugar coat it.  Excellent. permalink award report block reply\nNellie_the_Beaut 2 points 3 days ago I’ve watched Carl Higbie a few times and he’s pretty great.  Well spoken, spot on and doesn’t pull any punches.  Refreshing if you’re in the mood for a traditional evening news program that doesn’t suck. permalink award report block reply\nboomerbutnotOKBoomer 2 points 2 days ago So glad he is saying it. Can't tell you how many of these arguments I've had with libtard women, including family. One sister is shocked -- SHOCKED I TELL YOU! - that I have guns. That i'm proud I have guns. That I make no bones about having guns, having self-defense classes under my belt, have pulled a gun on a guy who was trying to take me to his truck. AAAAARRRRRRGHGHGHGH!! Oh no! Don't defend yourself!! GAAAAAAAH permalink award report block reply\nObambi 2 points 3 days ago Even Melania was sending letters to Putin to stop instead of the midget J. Lost respect for her for that a bit. She got emotional like all broads tend to do when it comes to serious shit. permalink award report block reply\nsolarsavior 2 points 3 days ago IMO, this is why they voted for him.  He is an effective speaker and... The Real Reason Socialism is on the Rise - “...you will never get young people to conserve a society and an economy that is not working for them.” https://greatawakening.win/p/1ARK5A7eLw/the-real-reason-socialism-is-on-/ Ignore the \"Q\" stuff as this has little to do with \"Q\". permalink award report block reply\nWupta PRO 1 points 3 days ago Absolutely spot on!! permalink award report block reply\nAnyone 1 points 3 days ago Stupidity and rape culture... permalink award report block reply\nRoadpower 1 points 3 days ago The experiment is over. permalink award report block reply\nSeeker_17 1 points 3 days ago Now bring in the muzzie rape gangs. permalink award report block reply\nraptormissle 1 points 3 days ago Libtards fantasize and celebrate their demise at the hands of criminals. They would rather be erased by a criminal than have it tarnish their virtue credit score. permalink award report block reply\nRedeemable 1 points 2 days ago Don't single out White liberal women. The colored ones vote D at even higher rates. permalink award report block reply\nthrottlejohnson 1 points 3 days ago CH is based permalink award report block reply\nPeekov3 1 points 2 days ago 🚨 ⚠️ 🚨 permalink award report block reply\nMhmm2MoreWeeks 1 points 3 days ago BRAINWASHED WHORES permalink award report block reply\nMichalusmichalus 1 points 2 days ago There are men walking around saying,\" vote blue no matter what\" too. All idiots. permalink award report block reply\natomisten 1 points 2 days ago ok but \"voting blue\" lol cuomo is a faggot. there is no \"voting blue\". both candidates are communists. and both are lying about their actual views. permalink award report block reply\nridge3z 1 points 3 days ago NYC is a parasitic city run by a kleptocratic government that bogs down New York State and the whole Northeast USA. Most of its citizens are pampered, weak and weak minded. Yes, even the \"tough streets\" NYC tough guys and gang affiliated are weaklings. A city of fools. permalink award report block reply\nItsBacon 1 points 3 days ago Accelerate permalink award report block reply\nPatriotSkorzeny 1 points 2 days ago “Voted” 🤡 permalink award report block reply\nknnbccb 1 points 3 days ago Suicidal, misguided empathy of foolish, rebellious women. Modern day Jezebels. May stray dogs tear them apart from limb to limb, like what happened to the original Jezebel. https://www.biblegateway.com/passage/?search=2%20Kings%209%3A30-37&version=KJV permalink award report block reply\ndontdrinksoy 1 points 2 days ago IDGAF. Newsmax sucks. They're just right wing grifters like Fox. OANN for the real shit, okay. permalink award report block reply\nlearntocode 0 points 3 days ago We can talk shit, or we can act. There needs to be a response. A cultural, political, response. Our women are being destroyed. Theg deserve better. permalink award report block reply\nthevagabond 0 points 3 days ago OMG Retarded blue states voted for democrats whaaaaaaaaaaaaaaaaaaaaaaaaaaaaaat!? what is this? permalink award report block reply\nObambi 0 points 3 days ago 99 percent of women are idiots permalink award report block reply\ndeleted -1 points 3 days ago Oleander 2 points 3 days ago Who gave them the right to vote? Somewhere along the way our men fucked up. In a more sane time most of these women would've been normal, just remember that. The way they are turning out is a failure on our part (and to some extent likely an intentional attack by foreign entities). I often notice that the women that turn out the worst had an awful or missing relationship with their father, it's a common theme. How many problems in this world can be traced back to a drought of quality, present fathers I wonder? Probably quite a lot. permalink parent award report block reply x79q3pb 2 points 2 days ago How many of those fathers were ousted by an overly emotional female and nothing to do with their parenting skills? permalink parent award report block reply\nOleander 2 points 3 days ago Who gave them the right to vote? Somewhere along the way our men fucked up. In a more sane time most of these women would've been normal, just remember that. The way they are turning out is a failure on our part (and to some extent likely an intentional attack by foreign entities). I often notice that the women that turn out the worst had an awful or missing relationship with their father, it's a common theme. How many problems in this world can be traced back to a drought of quality, present fathers I wonder? Probably quite a lot. permalink parent award report block reply x79q3pb 2 points 2 days ago How many of those fathers were ousted by an overly emotional female and nothing to do with their parenting skills? permalink parent award report block reply\nx79q3pb 2 points 2 days ago How many of those fathers were ousted by an overly emotional female and nothing to do with their parenting skills? permalink parent award report block reply\nMhmm2MoreWeeks -2 points 3 days ago White Cunts are easiest to brainwash. You can wind them up like those old wind up toys and then watch them go. permalink award report block reply\nMEME-SUPREME -3 points 3 days ago FAFO permalink award report block reply"}