{"id": "8179230", "contents": "1623 Lawmakers in Congress are increasingly worried and planning for the possibility that Senator Adam Schiff will be indicted for mortgage fraud, Politico reports posted 3 days ago by I-am-Orlando PRO 141 comments award share download report block\n141 comments Sort by Top Top New Worst Old Save Around the Web Hair Grows Back in A Few Days! At Any Stage of Baldness HaloGrow HappyFunBall 99 points 3 days ago Prosecutors should take a look at his hard drive while they're at it. permalink award report block reply HeavyMetalPatriot 63 points 3 days ago They will! The FBI loves kiddie porn! permalink parent award report block reply mty_green_go 22 points 3 days ago lol 😂 permalink parent award report block reply _Sully_ 17 points 3 days ago Where do you think he’s been getting the “good stuff”? permalink parent award report block reply HeavyMetalPatriot 17 points 3 days ago Lindsay Graham! permalink parent award report block reply BeauHD 10 points 3 days ago Hotdog parties permalink parent award report block reply Rhuairhi 6 points 3 days ago Ed Buck permalink parent award report block reply patrioticwinning3 3 points 3 days ago Patel looks like they found some on his hard drive :p permalink parent award report block reply charlesthehammer 2 points 2 days ago They will ask where he got it so they can get theirs. permalink parent award report block reply MedicallyReddit 13 points 3 days ago He’ll just wipe it with a cloth like Killary permalink parent award report block reply IncredibleMrE1 7 points 3 days ago Or hammer it like a Pelosi permalink parent award report block reply BeauHD 4 points 3 days ago Once his seed has been dripped on the platters, it can't be polished off. Unless we are talking about an SSD. permalink parent award report block reply lifeisahologram 6 points 3 days ago Hard drive? dude I want forensics to take UV lights to his basement and get dna samples for missing children permalink parent award report block reply AnonByTheLake 5 points 3 days ago They should take a look at the Standard Hotel while they're at it. permalink parent award report block reply MasterChief08 3 points 3 days ago He needs to be charged in the most moderate jurisdiction they can find. What state was his fraud from? permalink parent award report block reply load 1 more comments... 2016TrumpMAGA 50 points 3 days ago Needs to be indicted, tried, and imprisoned for a hell of a lot more than mortgage fraud. permalink award report block reply MakeAmericaGreat9 32 points 3 days ago They got al capone for taxes, whatever it takes to lock this faggot traitor up. permalink parent award report block reply Gletkin 10 points 3 days ago Yep, They got Luciano for prostitution. permalink parent award report block reply Mungo 6 points 3 days ago Not so Lucky permalink parent award report block reply Gletkin 3 points 3 days ago It’s okay the us gov went back to him in wwii for help with the Italy invasion and he helped them with that and setting up the OSS which became the CIA. Whitney Webb is a good historian for this stuff. permalink parent award report block reply view 1 more comments... Pappy_Gunn 1 points 3 days ago he got the gift that keep giving permalink parent award report block reply MakeAmericaGreat9 4 points 3 days ago Shit, I don't think I knew that. permalink parent award report block reply possibletower 1 points 2 days ago Then the Navy got FDR to pardon him in exchange for getting his mafia thugs to police ports in NYC to stop sabotage from other gangs and Germany/Italy comrades and he was the reason Operation Husky went way too fast and easy. Shit he probably was the reason why Mussolini collapsed shortly after Husky. permalink parent award report block reply boomerbutnotOKBoomer 3 points 3 days ago And if you do it for mortgage fraud, all the other congress asswipes and their staff might go along to get rid of this. If it's for kiddie stuff, they'll suddenly have pressing family issues and will miss the votes. permalink parent award report block reply Shitsbrokeyo 7 points 3 days ago Good thing they deleted all the J6 committee notes. There must be some j6 committee files still lingering around or they wouldn't need the autopen pardons. permalink parent award report block reply Scumbag-reddit 5 points 3 days ago The FBI keeps their evidence in a specific room against the deepstate as leverage, so yeah it still exists permalink parent award report block reply GoldwaterVoter 5 points 3 days ago Although he had congressional immunity at the time, his outrageous fictional rendition of the Trump - Zelensky phone call was treasonous. Gotta be something in here to charge him with: https://www.law.cornell.edu/uscode/text/18/2385 permalink parent award report block reply KEK_1776_KEK 30 points 3 days ago I don't give a flying fuck about mortgage fraud - he needs to be tried as a traitor. Where are the Trump admin's balls in going after these criminal fucks for the crimes they actually committed instead of some bullshit mortgage fraud claim? I don't fucking care.  Pencil neck should be fitted for a fucking rope. permalink award report block reply BrokenWolf2022 6 points 3 days ago RICO charges have to start somewhere. permalink parent award report block reply _Sully_ 4 points 3 days ago Yeah but this is just how to do that. Find something that isn’t a political hot topic to get him in their jaws then go after him on the stuff people will pretend isn’t illegal. permalink parent award report block reply trumpORbust 2 points 3 days ago 10 times weaker on each threat permalink parent award report block reply Above_Reproach 1 points 3 days ago The justice just got multiplied by 10%. Bet. permalink parent award report block reply TrumpAndGodWin 1 points 3 days ago This is just the beginning. permalink parent award report block reply maverick202 2 points 3 days ago The tweet says \"possibility\". That means the beginning you're referring to hasn't \"begun\" yet.. If I'm a betting man, I'm betting the house that it never begins. permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply covok48 3 points 3 days ago Good, I hate him (and you). permalink parent award report block reply view 1 more comments... UCantStumpTheTrump 2 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply covok48 1 points 3 days ago Man, shut up. permalink parent award report block reply TexasDusty 1 points 3 days ago Yeah we’ve been hearing that since 2016. permalink parent award report block reply JesusTheOnlyWay 1 points 3 days ago How can you say that? You don't know that. In fact, it's likely this is the end. He gets fine, or something, and no real charges stick. There's no evidence to believe this is just the beginning. Saying that doesn't mean it's true, lol Q is like the right wing 'The Secret' movement permalink parent award report block reply goldkeyboardwarrior 1 points 3 days ago Feds prefer to charge you for things they can actually get a conviction for. Just because we know Schiff did some treasonous stuff doesn’t mean a jury will convict him of it (especially if his trial is in DC where he’ll just get off via jury nullification). On the other hand, mortgage fraud is pretty cut and dry. Just like Al Capone was convicted not of his mobster activities itself but of tax fraud his mobster activities financed. permalink parent award report block reply load 5 more comments... Viewer01 13 points 3 days ago I remain dubious that any tribe member will face a scintilla of justice. permalink award report block reply HeavyMetalPatriot 8 points 3 days ago Doomer! (AKA, a realist). permalink parent award report block reply Wrez77 12 points 3 days ago Well, they did get Al Capone on tax evasion.. permalink award report block reply lolpaladins 3 points 3 days ago Look, and we all know Al Capone did a lot worse than evade taxes. Like fuck little boys. Inject men with drugs, etc etc. oh wait, we were talking about Capone. permalink parent award report block reply covok48 1 points 3 days ago You sound retarded. permalink parent award report block reply noPTSDforMePlease 1 points 2 days ago Capone was a booze runner, not drug runner. He didn't inject anyone. permalink parent award report block reply lolpaladins 1 points 2 days ago I was talking about schiff https://www.justice.gov/usao-cdca/pr/ed-buck-sentenced-30-years-federal-prison-providing-methamphetamine-two-victims-who who used to do that shit together with Ed Buck because they are sick freaks. permalink parent award report block reply For_All_Mankind 11 points 3 days ago It doesn’t matter. If Democrats still support people after they threaten to shoot children in the head, why would they care about mortgage fraud? permalink award report block reply here2red 10 points 3 days ago So whats the worrying part? permalink award report block reply Nibba2 9 points 3 days ago Not a lot since it’s never coming. permalink parent award report block reply mty_green_go 4 points 3 days ago they're worrying that it might eventually happen in a few years, or never permalink parent award report block reply AwShitHereWeGoAgain 10 points 3 days ago Don't hold your breath.  I've seen this one before. permalink award report block reply Tabascocat12 7 points 3 days ago Indictments mean nothing anymore.  He would get a handpicked judge and biased jurors if it even went that far.  Only republicans face justice and I wish Trump knew that.  He probably does but can’t do anything about it. permalink award report block reply infinitysupreme 1 points 3 days ago If the Supreme Court hears the appeal, we're in business permalink parent award report block reply ColonelKlink 6 points 3 days ago How about treason, too? permalink award report block reply Hanging_Chad 6 points 3 days ago impeach that senator permalink award report block reply LineInTheSand 6 points 3 days ago The impeachment process is for the executive and judicial branches.  Instead, members of Congress can be expelled by a 2/3 vote of their legislative body. permalink parent award report block reply RiolindasReturn 4 points 3 days ago Members of The Club never vote themselves out, just withhold fundraising and campaign funds. permalink parent award report block reply Hanging_Chad 2 points 3 days ago does expulsion ban them from public office? permalink parent award report block reply LineInTheSand 4 points 3 days ago Unfortunately, no. permalink parent award report block reply joggin_noggin 1 points 3 days ago On a practical level it does. The problem is if Schiff gets tossed they'll install Newsome or someone equally loathsome. Imagine getting bug-chasing pedophile Scott Weiner to replace Schiff. It's a possibility. And he'll spend his time in the Senate proposing bills to make it legal to fuck minors and knowingly transmit HIV, just like he's done in CA. permalink parent award report block reply ingrowntoenail 6 points 3 days ago That's not how you spell hang. permalink parent award report block reply MajorClark 5 points 3 days ago It was democrats who said \"Nobody is above the law\".   Schiff has gotten away with to much corruption for to long.   It's time he pays for his crimes against humanity lying and theft of public funds.     Who has Schiff been blowing at the FBI & DOJ that he's always gotten away with his crimes?   FBI & DOJ need to be charged too. permalink award report block reply grenades_and_ham 5 points 3 days ago Tits Gowdy strikes again! permalink award report block reply MeMargie 5 points 3 days ago Stanford Hotel investigated? permalink award report block reply GuerillaYourDreams 6 points 3 days ago Standard. permalink parent award report block reply MeMargie 5 points 3 days ago thanks permalink parent award report block reply FusionBlack 4 points 3 days ago What a shame... permalink award report block reply Giant_Schwartz 3 points 3 days ago Meh, they will just make it up to him with better committee seats and more power. permalink award report block reply infinitysupreme 2 points 3 days ago Medal from the next Democrat President permalink parent award report block reply BrewSwillis 3 points 3 days ago I'll save them the worry. It's not gonna happen. Sorry to break it to ya. The other politicians won't let it happen. They are all on the same team. Biden was allowed to go after President Trump, because Trump's not on their team, and none of the politicians like him. permalink award report block reply AVeryNakedMan 3 points 3 days ago Lmao. permalink award report block reply harryparatestes 3 points 3 days ago They're not lawmakers, they're \"representatives\".  This \"lawmaker\" bullshit makes them sound like they rule us. permalink award report block reply Lower 3 points 3 days ago Mortgage fraud? That's ALL they are worried about? He should be indicted, tried and convicted of manyt things, magnitudes larger than mortgage fraud. permalink award report block reply SorosHasBallsackEyes 3 points 3 days ago Perhaps he shouldn't have committed fraud permalink award report block reply TidewaterYank 3 points 3 days ago Mortgage fraud? How 'bout impalement for ten years of treason. permalink award report block reply billybaldwin2 2 points 3 days ago I read things possibly coming. I need to see it happen. permalink award report block reply donteatthat 1 points 3 days ago Xhamster permalink parent award report block reply one_cool 2 points 3 days ago He was part of a coup attempt against our government.  Mortgage fraud doesn't begin to cover it. permalink award report block reply RogueLeaderX 2 points 3 days ago Please arrest this scum! permalink award report block reply GuerillaYourDreams 2 points 3 days ago What about the Standard Hotel? permalink award report block reply brassmule 2 points 3 days ago Gavin Newsome will have to appointment someone for the job. Himself?  Kamala? Pelosi? permalink award report block reply younglion11 2 points 3 days ago For mortgage fraud. Not the other exceedingly traitorous crimes. Makes sense permalink award report block reply GA_Logic 2 points 3 days ago He needs to payback his theft.  With interest. permalink award report block reply Above_Reproach 2 points 3 days ago better leave the govt closed. permalink award report block reply HankScorpio 2 points 3 days ago No one is above the law. Except Uni Party members. permalink award report block reply AbrahamLincoln 2 points 3 days ago Really going for the weakest possible charge. permalink award report block reply SaltyTitties4 2 points 3 days ago He won’t be. Anyone thing otherwise has not been paying attention. permalink award report block reply champdog 2 points 2 days ago Mortgage fraud? What kind of pussy DOJ do we have?  Oh wait..... nevermind..... permalink award report block reply PatriotLady1 2 points 3 days ago SHIFTY's INDICTMENT can't come soon enough ﻿‼️﻿ permalink award report block reply boomerbutnotOKBoomer 2 points 3 days ago He has deep familial roots and likely enough blackmail on other Congress critters that they know he'll take them down with him. permalink award report block reply takebackyourfreedom 2 points 3 days ago And will be convicted of nothing 😂 permalink award report block reply raptormissle 2 points 3 days ago No pieces of shit is above the law. permalink award report block reply dres3 2 points 3 days ago Whomsoever offers the most/best evidence becomes last in line for prosecution... permalink award report block reply Kimball_Kinnison 1 points 3 days ago DO IT! permalink award report block reply Nellie_the_Beaut 1 points 3 days ago PENCIL. NECK. permalink award report block reply Tartakovsky 1 points 3 days ago Indict the pedophile already permalink award report block reply dorkana 1 points 3 days ago treason, hello? permalink award report block reply American-Patriot 1 points 3 days ago Doesn't this guy rape and sacrifice babies? permalink award report block reply hey_spike 1 points 3 days ago Democrat Lawmakers are worried... There, I fixed it. permalink award report block reply Obambi 1 points 3 days ago Faggot is a major faggot! permalink award report block reply mty_green_go 3 points 3 days ago Faggening!! Happening now !! permalink parent award report block reply Trumpluv77 1 points 3 days ago How about fuckimg TREASON?!!! IM SOO SICK OF THESE MORTHAHE FRAUD INDICTMENTS!!!!! permalink award report block reply RusherOfDin 1 points 2 days ago This must be kind of what it felt like to know Al Capone was going to get busted for tax fraud. You're glad he's getting dragged to court for something but you're pissed off that it's not for all the people he killed. permalink award report block reply yodayoda 1 points 2 days ago I'm sure he's quaking in his boots permalink award report block reply patrioticwinning3 1 points 3 days ago Mortgage Fraud!?  WTF TREASON CHARGES NOW!!!!!!! permalink award report block reply Apersonofinterest 1 points 3 days ago Mortgage fraud should be the least of his problems. permalink award report block reply YearninNation 1 points 3 days ago two weeks permalink award report block reply BadBrainsBuzzcocks 1 points 3 days ago Mortgage fraud shouldn't even be the low hanging fruit. permalink award report block reply Justjayce 1 points 3 days ago How the turns tables. Fucking pe do permalink award report block reply Koikatrose 1 points 3 days ago Pedophilia, and treason as well. Should be....\nQuestion him about the little boy at the Standard Hotel. permalink award report block reply Blackmore 1 points 3 days ago None is above the law Mellon head, no one. permalink award report block reply GoldwaterVoter 1 points 3 days ago Couldn't happen to a bigger azzwhole. permalink award report block reply BrionK 1 points 2 days ago Words are cheap, just like Pam Blonde. permalink award report block reply I-am-Orlando OP PRO 1 points 3 days ago Link https://x.com/ElectionWiz/status/1987662811200475296?s=20 permalink award report block reply OldBark2 1 points 3 days ago Please, please let this happen. That little adam schiss is stinking up CA along with greasy newscum and the rest of the commie lefties. permalink award report block reply 559throw 1 points 3 days ago Lol, sure they are permalink award report block reply covok48 1 points 3 days ago All of your conservative wishes aren't going to happen. Just accept that, permalink award report block reply SBOJ_JOBS 1 points 2 days ago Lying on mortgage applications? I guess this is the same as when we imprisoned a murderous  mafia figure for income tax evasion because no-one wanted the public to know what had been allowed for years permalink award report block reply Treefiddydiddy 1 points 2 days ago I don't give an 'ed buck' about this prick permalink award report block reply SupFrens 1 points 2 days ago Is that all we have on this dickhead? Anything more substantial would be great? Like didn't he help organize J6 or some shit? Come on! permalink award report block reply KernalMustard 1 points 3 days ago Indicted. Celebrate when hes convicted. It will still be just a hand slap anyway. permalink award report block reply JDVance4President28 1 points 2 days ago In 2016 when Trump promised us that he would go after the deep state, I didn't realize it meant 10 years of no action with soft DOJ picks. Think about it. They spyed on his campaign. They stole an election. They dragged his name through the mud. Made him a felon, told the people he was a rapist and they tried to put his own son in jail. Yet. Nothing. Not a single fucking consequence. It feels like controlled opposition that seems to always benefit Israel. permalink award report block reply Goatboy66 1 points 2 days ago How about TREASON- RICO ACT! permalink award report block reply Koikatrose 1 points 2 days ago Standard Hotel... pedophilia....\nLittle boy....\nTreason....\nPerjury.....\nConspiracy....\nAnd God knows what else.....!!\nThis piece of garbage needs to be arrested for so much evil! permalink award report block reply throttlejohnson 1 points 3 days ago why would they be worried if someone else was commiting fraud? oh yeah...i see /s permalink award report block reply hamajun 1 points 2 days ago Possibility? It's inevitability. permalink award report block reply Seruna_Kanus 1 points 3 days ago They really had to be so retarded as to try and attack Trump in the industry that he practically owns. permalink award report block reply CatyKean 1 points 3 days ago Why worry? 🤔 permalink award report block reply Light_HIV_Effect 1 points 3 days ago Where you going to try him? DC? California? Maryland? They just need one judge to get any number of these cases thrown out because they're \"politically motivated\" and all the rest will follow until they can wait out a dem to cheat into the whitehouse for 2028. Big Tish, Comey, Fauci, Pencil neck, Omar, AOC, Pelosi are all going to walk free. permalink award report block reply OZJRant 1 points 2 days ago Schifty by name shifty by nature … he will have no problems escaping any punishment permalink award report block reply Pappy_Gunn 1 points 3 days ago He looks like a pedo abuser this guy ain't normal permalink award report block reply jonnyuno 1 points 2 days ago Prison for life. permalink award report block reply Rock9Head 1 points 3 days ago He’s getting off easy. permalink award report block reply\nHappyFunBall 99 points 3 days ago Prosecutors should take a look at his hard drive while they're at it. permalink award report block reply HeavyMetalPatriot 63 points 3 days ago They will! The FBI loves kiddie porn! permalink parent award report block reply mty_green_go 22 points 3 days ago lol 😂 permalink parent award report block reply _Sully_ 17 points 3 days ago Where do you think he’s been getting the “good stuff”? permalink parent award report block reply HeavyMetalPatriot 17 points 3 days ago Lindsay Graham! permalink parent award report block reply BeauHD 10 points 3 days ago Hotdog parties permalink parent award report block reply Rhuairhi 6 points 3 days ago Ed Buck permalink parent award report block reply patrioticwinning3 3 points 3 days ago Patel looks like they found some on his hard drive :p permalink parent award report block reply charlesthehammer 2 points 2 days ago They will ask where he got it so they can get theirs. permalink parent award report block reply MedicallyReddit 13 points 3 days ago He’ll just wipe it with a cloth like Killary permalink parent award report block reply IncredibleMrE1 7 points 3 days ago Or hammer it like a Pelosi permalink parent award report block reply BeauHD 4 points 3 days ago Once his seed has been dripped on the platters, it can't be polished off. Unless we are talking about an SSD. permalink parent award report block reply lifeisahologram 6 points 3 days ago Hard drive? dude I want forensics to take UV lights to his basement and get dna samples for missing children permalink parent award report block reply AnonByTheLake 5 points 3 days ago They should take a look at the Standard Hotel while they're at it. permalink parent award report block reply MasterChief08 3 points 3 days ago He needs to be charged in the most moderate jurisdiction they can find. What state was his fraud from? permalink parent award report block reply load 1 more comments...\nHeavyMetalPatriot 63 points 3 days ago They will! The FBI loves kiddie porn! permalink parent award report block reply mty_green_go 22 points 3 days ago lol 😂 permalink parent award report block reply _Sully_ 17 points 3 days ago Where do you think he’s been getting the “good stuff”? permalink parent award report block reply HeavyMetalPatriot 17 points 3 days ago Lindsay Graham! permalink parent award report block reply BeauHD 10 points 3 days ago Hotdog parties permalink parent award report block reply Rhuairhi 6 points 3 days ago Ed Buck permalink parent award report block reply patrioticwinning3 3 points 3 days ago Patel looks like they found some on his hard drive :p permalink parent award report block reply charlesthehammer 2 points 2 days ago They will ask where he got it so they can get theirs. permalink parent award report block reply\nmty_green_go 22 points 3 days ago lol 😂 permalink parent award report block reply\n_Sully_ 17 points 3 days ago Where do you think he’s been getting the “good stuff”? permalink parent award report block reply HeavyMetalPatriot 17 points 3 days ago Lindsay Graham! permalink parent award report block reply BeauHD 10 points 3 days ago Hotdog parties permalink parent award report block reply Rhuairhi 6 points 3 days ago Ed Buck permalink parent award report block reply\nHeavyMetalPatriot 17 points 3 days ago Lindsay Graham! permalink parent award report block reply\nBeauHD 10 points 3 days ago Hotdog parties permalink parent award report block reply\nRhuairhi 6 points 3 days ago Ed Buck permalink parent award report block reply\npatrioticwinning3 3 points 3 days ago Patel looks like they found some on his hard drive :p permalink parent award report block reply\ncharlesthehammer 2 points 2 days ago They will ask where he got it so they can get theirs. permalink parent award report block reply\nMedicallyReddit 13 points 3 days ago He’ll just wipe it with a cloth like Killary permalink parent award report block reply IncredibleMrE1 7 points 3 days ago Or hammer it like a Pelosi permalink parent award report block reply BeauHD 4 points 3 days ago Once his seed has been dripped on the platters, it can't be polished off. Unless we are talking about an SSD. permalink parent award report block reply\nIncredibleMrE1 7 points 3 days ago Or hammer it like a Pelosi permalink parent award report block reply\nBeauHD 4 points 3 days ago Once his seed has been dripped on the platters, it can't be polished off. Unless we are talking about an SSD. permalink parent award report block reply\nlifeisahologram 6 points 3 days ago Hard drive? dude I want forensics to take UV lights to his basement and get dna samples for missing children permalink parent award report block reply\nAnonByTheLake 5 points 3 days ago They should take a look at the Standard Hotel while they're at it. permalink parent award report block reply\nMasterChief08 3 points 3 days ago He needs to be charged in the most moderate jurisdiction they can find. What state was his fraud from? permalink parent award report block reply\n2016TrumpMAGA 50 points 3 days ago Needs to be indicted, tried, and imprisoned for a hell of a lot more than mortgage fraud. permalink award report block reply MakeAmericaGreat9 32 points 3 days ago They got al capone for taxes, whatever it takes to lock this faggot traitor up. permalink parent award report block reply Gletkin 10 points 3 days ago Yep, They got Luciano for prostitution. permalink parent award report block reply Mungo 6 points 3 days ago Not so Lucky permalink parent award report block reply Gletkin 3 points 3 days ago It’s okay the us gov went back to him in wwii for help with the Italy invasion and he helped them with that and setting up the OSS which became the CIA. Whitney Webb is a good historian for this stuff. permalink parent award report block reply view 1 more comments... Pappy_Gunn 1 points 3 days ago he got the gift that keep giving permalink parent award report block reply MakeAmericaGreat9 4 points 3 days ago Shit, I don't think I knew that. permalink parent award report block reply possibletower 1 points 2 days ago Then the Navy got FDR to pardon him in exchange for getting his mafia thugs to police ports in NYC to stop sabotage from other gangs and Germany/Italy comrades and he was the reason Operation Husky went way too fast and easy. Shit he probably was the reason why Mussolini collapsed shortly after Husky. permalink parent award report block reply boomerbutnotOKBoomer 3 points 3 days ago And if you do it for mortgage fraud, all the other congress asswipes and their staff might go along to get rid of this. If it's for kiddie stuff, they'll suddenly have pressing family issues and will miss the votes. permalink parent award report block reply Shitsbrokeyo 7 points 3 days ago Good thing they deleted all the J6 committee notes. There must be some j6 committee files still lingering around or they wouldn't need the autopen pardons. permalink parent award report block reply Scumbag-reddit 5 points 3 days ago The FBI keeps their evidence in a specific room against the deepstate as leverage, so yeah it still exists permalink parent award report block reply GoldwaterVoter 5 points 3 days ago Although he had congressional immunity at the time, his outrageous fictional rendition of the Trump - Zelensky phone call was treasonous. Gotta be something in here to charge him with: https://www.law.cornell.edu/uscode/text/18/2385 permalink parent award report block reply\nMakeAmericaGreat9 32 points 3 days ago They got al capone for taxes, whatever it takes to lock this faggot traitor up. permalink parent award report block reply Gletkin 10 points 3 days ago Yep, They got Luciano for prostitution. permalink parent award report block reply Mungo 6 points 3 days ago Not so Lucky permalink parent award report block reply Gletkin 3 points 3 days ago It’s okay the us gov went back to him in wwii for help with the Italy invasion and he helped them with that and setting up the OSS which became the CIA. Whitney Webb is a good historian for this stuff. permalink parent award report block reply view 1 more comments... Pappy_Gunn 1 points 3 days ago he got the gift that keep giving permalink parent award report block reply MakeAmericaGreat9 4 points 3 days ago Shit, I don't think I knew that. permalink parent award report block reply possibletower 1 points 2 days ago Then the Navy got FDR to pardon him in exchange for getting his mafia thugs to police ports in NYC to stop sabotage from other gangs and Germany/Italy comrades and he was the reason Operation Husky went way too fast and easy. Shit he probably was the reason why Mussolini collapsed shortly after Husky. permalink parent award report block reply boomerbutnotOKBoomer 3 points 3 days ago And if you do it for mortgage fraud, all the other congress asswipes and their staff might go along to get rid of this. If it's for kiddie stuff, they'll suddenly have pressing family issues and will miss the votes. permalink parent award report block reply\nGletkin 10 points 3 days ago Yep, They got Luciano for prostitution. permalink parent award report block reply Mungo 6 points 3 days ago Not so Lucky permalink parent award report block reply Gletkin 3 points 3 days ago It’s okay the us gov went back to him in wwii for help with the Italy invasion and he helped them with that and setting up the OSS which became the CIA. Whitney Webb is a good historian for this stuff. permalink parent award report block reply view 1 more comments... Pappy_Gunn 1 points 3 days ago he got the gift that keep giving permalink parent award report block reply MakeAmericaGreat9 4 points 3 days ago Shit, I don't think I knew that. permalink parent award report block reply possibletower 1 points 2 days ago Then the Navy got FDR to pardon him in exchange for getting his mafia thugs to police ports in NYC to stop sabotage from other gangs and Germany/Italy comrades and he was the reason Operation Husky went way too fast and easy. Shit he probably was the reason why Mussolini collapsed shortly after Husky. permalink parent award report block reply\nMungo 6 points 3 days ago Not so Lucky permalink parent award report block reply Gletkin 3 points 3 days ago It’s okay the us gov went back to him in wwii for help with the Italy invasion and he helped them with that and setting up the OSS which became the CIA. Whitney Webb is a good historian for this stuff. permalink parent award report block reply view 1 more comments... Pappy_Gunn 1 points 3 days ago he got the gift that keep giving permalink parent award report block reply\nGletkin 3 points 3 days ago It’s okay the us gov went back to him in wwii for help with the Italy invasion and he helped them with that and setting up the OSS which became the CIA. Whitney Webb is a good historian for this stuff. permalink parent award report block reply view 1 more comments...\nPappy_Gunn 1 points 3 days ago he got the gift that keep giving permalink parent award report block reply\nMakeAmericaGreat9 4 points 3 days ago Shit, I don't think I knew that. permalink parent award report block reply\npossibletower 1 points 2 days ago Then the Navy got FDR to pardon him in exchange for getting his mafia thugs to police ports in NYC to stop sabotage from other gangs and Germany/Italy comrades and he was the reason Operation Husky went way too fast and easy. Shit he probably was the reason why Mussolini collapsed shortly after Husky. permalink parent award report block reply\nboomerbutnotOKBoomer 3 points 3 days ago And if you do it for mortgage fraud, all the other congress asswipes and their staff might go along to get rid of this. If it's for kiddie stuff, they'll suddenly have pressing family issues and will miss the votes. permalink parent award report block reply\nShitsbrokeyo 7 points 3 days ago Good thing they deleted all the J6 committee notes. There must be some j6 committee files still lingering around or they wouldn't need the autopen pardons. permalink parent award report block reply Scumbag-reddit 5 points 3 days ago The FBI keeps their evidence in a specific room against the deepstate as leverage, so yeah it still exists permalink parent award report block reply\nScumbag-reddit 5 points 3 days ago The FBI keeps their evidence in a specific room against the deepstate as leverage, so yeah it still exists permalink parent award report block reply\nGoldwaterVoter 5 points 3 days ago Although he had congressional immunity at the time, his outrageous fictional rendition of the Trump - Zelensky phone call was treasonous. Gotta be something in here to charge him with: https://www.law.cornell.edu/uscode/text/18/2385 permalink parent award report block reply\nKEK_1776_KEK 30 points 3 days ago I don't give a flying fuck about mortgage fraud - he needs to be tried as a traitor. Where are the Trump admin's balls in going after these criminal fucks for the crimes they actually committed instead of some bullshit mortgage fraud claim? I don't fucking care.  Pencil neck should be fitted for a fucking rope. permalink award report block reply BrokenWolf2022 6 points 3 days ago RICO charges have to start somewhere. permalink parent award report block reply _Sully_ 4 points 3 days ago Yeah but this is just how to do that. Find something that isn’t a political hot topic to get him in their jaws then go after him on the stuff people will pretend isn’t illegal. permalink parent award report block reply trumpORbust 2 points 3 days ago 10 times weaker on each threat permalink parent award report block reply Above_Reproach 1 points 3 days ago The justice just got multiplied by 10%. Bet. permalink parent award report block reply TrumpAndGodWin 1 points 3 days ago This is just the beginning. permalink parent award report block reply maverick202 2 points 3 days ago The tweet says \"possibility\". That means the beginning you're referring to hasn't \"begun\" yet.. If I'm a betting man, I'm betting the house that it never begins. permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply covok48 3 points 3 days ago Good, I hate him (and you). permalink parent award report block reply view 1 more comments... UCantStumpTheTrump 2 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply covok48 1 points 3 days ago Man, shut up. permalink parent award report block reply TexasDusty 1 points 3 days ago Yeah we’ve been hearing that since 2016. permalink parent award report block reply JesusTheOnlyWay 1 points 3 days ago How can you say that? You don't know that. In fact, it's likely this is the end. He gets fine, or something, and no real charges stick. There's no evidence to believe this is just the beginning. Saying that doesn't mean it's true, lol Q is like the right wing 'The Secret' movement permalink parent award report block reply goldkeyboardwarrior 1 points 3 days ago Feds prefer to charge you for things they can actually get a conviction for. Just because we know Schiff did some treasonous stuff doesn’t mean a jury will convict him of it (especially if his trial is in DC where he’ll just get off via jury nullification). On the other hand, mortgage fraud is pretty cut and dry. Just like Al Capone was convicted not of his mobster activities itself but of tax fraud his mobster activities financed. permalink parent award report block reply load 5 more comments...\nBrokenWolf2022 6 points 3 days ago RICO charges have to start somewhere. permalink parent award report block reply\n_Sully_ 4 points 3 days ago Yeah but this is just how to do that. Find something that isn’t a political hot topic to get him in their jaws then go after him on the stuff people will pretend isn’t illegal. permalink parent award report block reply\ntrumpORbust 2 points 3 days ago 10 times weaker on each threat permalink parent award report block reply Above_Reproach 1 points 3 days ago The justice just got multiplied by 10%. Bet. permalink parent award report block reply\nAbove_Reproach 1 points 3 days ago The justice just got multiplied by 10%. Bet. permalink parent award report block reply\nTrumpAndGodWin 1 points 3 days ago This is just the beginning. permalink parent award report block reply maverick202 2 points 3 days ago The tweet says \"possibility\". That means the beginning you're referring to hasn't \"begun\" yet.. If I'm a betting man, I'm betting the house that it never begins. permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply covok48 3 points 3 days ago Good, I hate him (and you). permalink parent award report block reply view 1 more comments... UCantStumpTheTrump 2 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply covok48 1 points 3 days ago Man, shut up. permalink parent award report block reply TexasDusty 1 points 3 days ago Yeah we’ve been hearing that since 2016. permalink parent award report block reply JesusTheOnlyWay 1 points 3 days ago How can you say that? You don't know that. In fact, it's likely this is the end. He gets fine, or something, and no real charges stick. There's no evidence to believe this is just the beginning. Saying that doesn't mean it's true, lol Q is like the right wing 'The Secret' movement permalink parent award report block reply\nmaverick202 2 points 3 days ago The tweet says \"possibility\". That means the beginning you're referring to hasn't \"begun\" yet.. If I'm a betting man, I'm betting the house that it never begins. permalink parent award report block reply UCantStumpTheTrump 1 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply covok48 3 points 3 days ago Good, I hate him (and you). permalink parent award report block reply view 1 more comments...\nUCantStumpTheTrump 1 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply covok48 3 points 3 days ago Good, I hate him (and you). permalink parent award report block reply view 1 more comments...\ncovok48 3 points 3 days ago Good, I hate him (and you). permalink parent award report block reply view 1 more comments...\nUCantStumpTheTrump 2 points 3 days ago Keep in mind u/maverick202 is a self-admitted redditor troll who comes here to insult \"incels\" and \"white trash\" (his words) permalink parent award report block reply\ncovok48 1 points 3 days ago Man, shut up. permalink parent award report block reply\nTexasDusty 1 points 3 days ago Yeah we’ve been hearing that since 2016. permalink parent award report block reply\nJesusTheOnlyWay 1 points 3 days ago How can you say that? You don't know that. In fact, it's likely this is the end. He gets fine, or something, and no real charges stick. There's no evidence to believe this is just the beginning. Saying that doesn't mean it's true, lol Q is like the right wing 'The Secret' movement permalink parent award report block reply\ngoldkeyboardwarrior 1 points 3 days ago Feds prefer to charge you for things they can actually get a conviction for. Just because we know Schiff did some treasonous stuff doesn’t mean a jury will convict him of it (especially if his trial is in DC where he’ll just get off via jury nullification). On the other hand, mortgage fraud is pretty cut and dry. Just like Al Capone was convicted not of his mobster activities itself but of tax fraud his mobster activities financed. permalink parent award report block reply\nViewer01 13 points 3 days ago I remain dubious that any tribe member will face a scintilla of justice. permalink award report block reply HeavyMetalPatriot 8 points 3 days ago Doomer! (AKA, a realist). permalink parent award report block reply\nHeavyMetalPatriot 8 points 3 days ago Doomer! (AKA, a realist). permalink parent award report block reply\nWrez77 12 points 3 days ago Well, they did get Al Capone on tax evasion.. permalink award report block reply lolpaladins 3 points 3 days ago Look, and we all know Al Capone did a lot worse than evade taxes. Like fuck little boys. Inject men with drugs, etc etc. oh wait, we were talking about Capone. permalink parent award report block reply covok48 1 points 3 days ago You sound retarded. permalink parent award report block reply noPTSDforMePlease 1 points 2 days ago Capone was a booze runner, not drug runner. He didn't inject anyone. permalink parent award report block reply lolpaladins 1 points 2 days ago I was talking about schiff https://www.justice.gov/usao-cdca/pr/ed-buck-sentenced-30-years-federal-prison-providing-methamphetamine-two-victims-who who used to do that shit together with Ed Buck because they are sick freaks. permalink parent award report block reply\nlolpaladins 3 points 3 days ago Look, and we all know Al Capone did a lot worse than evade taxes. Like fuck little boys. Inject men with drugs, etc etc. oh wait, we were talking about Capone. permalink parent award report block reply covok48 1 points 3 days ago You sound retarded. permalink parent award report block reply noPTSDforMePlease 1 points 2 days ago Capone was a booze runner, not drug runner. He didn't inject anyone. permalink parent award report block reply lolpaladins 1 points 2 days ago I was talking about schiff https://www.justice.gov/usao-cdca/pr/ed-buck-sentenced-30-years-federal-prison-providing-methamphetamine-two-victims-who who used to do that shit together with Ed Buck because they are sick freaks. permalink parent award report block reply\ncovok48 1 points 3 days ago You sound retarded. permalink parent award report block reply\nnoPTSDforMePlease 1 points 2 days ago Capone was a booze runner, not drug runner. He didn't inject anyone. permalink parent award report block reply lolpaladins 1 points 2 days ago I was talking about schiff https://www.justice.gov/usao-cdca/pr/ed-buck-sentenced-30-years-federal-prison-providing-methamphetamine-two-victims-who who used to do that shit together with Ed Buck because they are sick freaks. permalink parent award report block reply\nlolpaladins 1 points 2 days ago I was talking about schiff https://www.justice.gov/usao-cdca/pr/ed-buck-sentenced-30-years-federal-prison-providing-methamphetamine-two-victims-who who used to do that shit together with Ed Buck because they are sick freaks. permalink parent award report block reply\nFor_All_Mankind 11 points 3 days ago It doesn’t matter. If Democrats still support people after they threaten to shoot children in the head, why would they care about mortgage fraud? permalink award report block reply\nhere2red 10 points 3 days ago So whats the worrying part? permalink award report block reply Nibba2 9 points 3 days ago Not a lot since it’s never coming. permalink parent award report block reply mty_green_go 4 points 3 days ago they're worrying that it might eventually happen in a few years, or never permalink parent award report block reply\nNibba2 9 points 3 days ago Not a lot since it’s never coming. permalink parent award report block reply\nmty_green_go 4 points 3 days ago they're worrying that it might eventually happen in a few years, or never permalink parent award report block reply\nAwShitHereWeGoAgain 10 points 3 days ago Don't hold your breath.  I've seen this one before. permalink award report block reply\nTabascocat12 7 points 3 days ago Indictments mean nothing anymore.  He would get a handpicked judge and biased jurors if it even went that far.  Only republicans face justice and I wish Trump knew that.  He probably does but can’t do anything about it. permalink award report block reply infinitysupreme 1 points 3 days ago If the Supreme Court hears the appeal, we're in business permalink parent award report block reply\ninfinitysupreme 1 points 3 days ago If the Supreme Court hears the appeal, we're in business permalink parent award report block reply\nColonelKlink 6 points 3 days ago How about treason, too? permalink award report block reply\nHanging_Chad 6 points 3 days ago impeach that senator permalink award report block reply LineInTheSand 6 points 3 days ago The impeachment process is for the executive and judicial branches.  Instead, members of Congress can be expelled by a 2/3 vote of their legislative body. permalink parent award report block reply RiolindasReturn 4 points 3 days ago Members of The Club never vote themselves out, just withhold fundraising and campaign funds. permalink parent award report block reply Hanging_Chad 2 points 3 days ago does expulsion ban them from public office? permalink parent award report block reply LineInTheSand 4 points 3 days ago Unfortunately, no. permalink parent award report block reply joggin_noggin 1 points 3 days ago On a practical level it does. The problem is if Schiff gets tossed they'll install Newsome or someone equally loathsome. Imagine getting bug-chasing pedophile Scott Weiner to replace Schiff. It's a possibility. And he'll spend his time in the Senate proposing bills to make it legal to fuck minors and knowingly transmit HIV, just like he's done in CA. permalink parent award report block reply ingrowntoenail 6 points 3 days ago That's not how you spell hang. permalink parent award report block reply\nLineInTheSand 6 points 3 days ago The impeachment process is for the executive and judicial branches.  Instead, members of Congress can be expelled by a 2/3 vote of their legislative body. permalink parent award report block reply RiolindasReturn 4 points 3 days ago Members of The Club never vote themselves out, just withhold fundraising and campaign funds. permalink parent award report block reply Hanging_Chad 2 points 3 days ago does expulsion ban them from public office? permalink parent award report block reply LineInTheSand 4 points 3 days ago Unfortunately, no. permalink parent award report block reply joggin_noggin 1 points 3 days ago On a practical level it does. The problem is if Schiff gets tossed they'll install Newsome or someone equally loathsome. Imagine getting bug-chasing pedophile Scott Weiner to replace Schiff. It's a possibility. And he'll spend his time in the Senate proposing bills to make it legal to fuck minors and knowingly transmit HIV, just like he's done in CA. permalink parent award report block reply\nRiolindasReturn 4 points 3 days ago Members of The Club never vote themselves out, just withhold fundraising and campaign funds. permalink parent award report block reply\nHanging_Chad 2 points 3 days ago does expulsion ban them from public office? permalink parent award report block reply LineInTheSand 4 points 3 days ago Unfortunately, no. permalink parent award report block reply joggin_noggin 1 points 3 days ago On a practical level it does. The problem is if Schiff gets tossed they'll install Newsome or someone equally loathsome. Imagine getting bug-chasing pedophile Scott Weiner to replace Schiff. It's a possibility. And he'll spend his time in the Senate proposing bills to make it legal to fuck minors and knowingly transmit HIV, just like he's done in CA. permalink parent award report block reply\nLineInTheSand 4 points 3 days ago Unfortunately, no. permalink parent award report block reply joggin_noggin 1 points 3 days ago On a practical level it does. The problem is if Schiff gets tossed they'll install Newsome or someone equally loathsome. Imagine getting bug-chasing pedophile Scott Weiner to replace Schiff. It's a possibility. And he'll spend his time in the Senate proposing bills to make it legal to fuck minors and knowingly transmit HIV, just like he's done in CA. permalink parent award report block reply\njoggin_noggin 1 points 3 days ago On a practical level it does. The problem is if Schiff gets tossed they'll install Newsome or someone equally loathsome. Imagine getting bug-chasing pedophile Scott Weiner to replace Schiff. It's a possibility. And he'll spend his time in the Senate proposing bills to make it legal to fuck minors and knowingly transmit HIV, just like he's done in CA. permalink parent award report block reply\ningrowntoenail 6 points 3 days ago That's not how you spell hang. permalink parent award report block reply\nMajorClark 5 points 3 days ago It was democrats who said \"Nobody is above the law\".   Schiff has gotten away with to much corruption for to long.   It's time he pays for his crimes against humanity lying and theft of public funds.     Who has Schiff been blowing at the FBI & DOJ that he's always gotten away with his crimes?   FBI & DOJ need to be charged too. permalink award report block reply\ngrenades_and_ham 5 points 3 days ago Tits Gowdy strikes again! permalink award report block reply\nMeMargie 5 points 3 days ago Stanford Hotel investigated? permalink award report block reply GuerillaYourDreams 6 points 3 days ago Standard. permalink parent award report block reply MeMargie 5 points 3 days ago thanks permalink parent award report block reply\nGuerillaYourDreams 6 points 3 days ago Standard. permalink parent award report block reply MeMargie 5 points 3 days ago thanks permalink parent award report block reply\nMeMargie 5 points 3 days ago thanks permalink parent award report block reply\nFusionBlack 4 points 3 days ago What a shame... permalink award report block reply\nGiant_Schwartz 3 points 3 days ago Meh, they will just make it up to him with better committee seats and more power. permalink award report block reply infinitysupreme 2 points 3 days ago Medal from the next Democrat President permalink parent award report block reply\ninfinitysupreme 2 points 3 days ago Medal from the next Democrat President permalink parent award report block reply\nBrewSwillis 3 points 3 days ago I'll save them the worry. It's not gonna happen. Sorry to break it to ya. The other politicians won't let it happen. They are all on the same team. Biden was allowed to go after President Trump, because Trump's not on their team, and none of the politicians like him. permalink award report block reply\nAVeryNakedMan 3 points 3 days ago Lmao. permalink award report block reply\nharryparatestes 3 points 3 days ago They're not lawmakers, they're \"representatives\".  This \"lawmaker\" bullshit makes them sound like they rule us. permalink award report block reply\nLower 3 points 3 days ago Mortgage fraud? That's ALL they are worried about? He should be indicted, tried and convicted of manyt things, magnitudes larger than mortgage fraud. permalink award report block reply\nSorosHasBallsackEyes 3 points 3 days ago Perhaps he shouldn't have committed fraud permalink award report block reply\nTidewaterYank 3 points 3 days ago Mortgage fraud? How 'bout impalement for ten years of treason. permalink award report block reply\nbillybaldwin2 2 points 3 days ago I read things possibly coming. I need to see it happen. permalink award report block reply donteatthat 1 points 3 days ago Xhamster permalink parent award report block reply\ndonteatthat 1 points 3 days ago Xhamster permalink parent award report block reply\none_cool 2 points 3 days ago He was part of a coup attempt against our government.  Mortgage fraud doesn't begin to cover it. permalink award report block reply\nRogueLeaderX 2 points 3 days ago Please arrest this scum! permalink award report block reply\nGuerillaYourDreams 2 points 3 days ago What about the Standard Hotel? permalink award report block reply\nbrassmule 2 points 3 days ago Gavin Newsome will have to appointment someone for the job. Himself?  Kamala? Pelosi? permalink award report block reply\nyounglion11 2 points 3 days ago For mortgage fraud. Not the other exceedingly traitorous crimes. Makes sense permalink award report block reply\nGA_Logic 2 points 3 days ago He needs to payback his theft.  With interest. permalink award report block reply\nAbove_Reproach 2 points 3 days ago better leave the govt closed. permalink award report block reply\nHankScorpio 2 points 3 days ago No one is above the law. Except Uni Party members. permalink award report block reply\nAbrahamLincoln 2 points 3 days ago Really going for the weakest possible charge. permalink award report block reply\nSaltyTitties4 2 points 3 days ago He won’t be. Anyone thing otherwise has not been paying attention. permalink award report block reply\nchampdog 2 points 2 days ago Mortgage fraud? What kind of pussy DOJ do we have?  Oh wait..... nevermind..... permalink award report block reply\nPatriotLady1 2 points 3 days ago SHIFTY's INDICTMENT can't come soon enough ﻿‼️﻿ permalink award report block reply\nboomerbutnotOKBoomer 2 points 3 days ago He has deep familial roots and likely enough blackmail on other Congress critters that they know he'll take them down with him. permalink award report block reply\ntakebackyourfreedom 2 points 3 days ago And will be convicted of nothing 😂 permalink award report block reply\nraptormissle 2 points 3 days ago No pieces of shit is above the law. permalink award report block reply\ndres3 2 points 3 days ago Whomsoever offers the most/best evidence becomes last in line for prosecution... permalink award report block reply\nKimball_Kinnison 1 points 3 days ago DO IT! permalink award report block reply\nNellie_the_Beaut 1 points 3 days ago PENCIL. NECK. permalink award report block reply\nTartakovsky 1 points 3 days ago Indict the pedophile already permalink award report block reply\ndorkana 1 points 3 days ago treason, hello? permalink award report block reply\nAmerican-Patriot 1 points 3 days ago Doesn't this guy rape and sacrifice babies? permalink award report block reply\nhey_spike 1 points 3 days ago Democrat Lawmakers are worried... There, I fixed it. permalink award report block reply\nObambi 1 points 3 days ago Faggot is a major faggot! permalink award report block reply mty_green_go 3 points 3 days ago Faggening!! Happening now !! permalink parent award report block reply\nmty_green_go 3 points 3 days ago Faggening!! Happening now !! permalink parent award report block reply\nTrumpluv77 1 points 3 days ago How about fuckimg TREASON?!!! IM SOO SICK OF THESE MORTHAHE FRAUD INDICTMENTS!!!!! permalink award report block reply\nRusherOfDin 1 points 2 days ago This must be kind of what it felt like to know Al Capone was going to get busted for tax fraud. You're glad he's getting dragged to court for something but you're pissed off that it's not for all the people he killed. permalink award report block reply\nyodayoda 1 points 2 days ago I'm sure he's quaking in his boots permalink award report block reply\npatrioticwinning3 1 points 3 days ago Mortgage Fraud!?  WTF TREASON CHARGES NOW!!!!!!! permalink award report block reply\nApersonofinterest 1 points 3 days ago Mortgage fraud should be the least of his problems. permalink award report block reply\nYearninNation 1 points 3 days ago two weeks permalink award report block reply\nBadBrainsBuzzcocks 1 points 3 days ago Mortgage fraud shouldn't even be the low hanging fruit. permalink award report block reply\nJustjayce 1 points 3 days ago How the turns tables. Fucking pe do permalink award report block reply\nKoikatrose 1 points 3 days ago Pedophilia, and treason as well. Should be....\nQuestion him about the little boy at the Standard Hotel. permalink award report block reply\nBlackmore 1 points 3 days ago None is above the law Mellon head, no one. permalink award report block reply\nGoldwaterVoter 1 points 3 days ago Couldn't happen to a bigger azzwhole. permalink award report block reply\nBrionK 1 points 2 days ago Words are cheap, just like Pam Blonde. permalink award report block reply\nI-am-Orlando OP PRO 1 points 3 days ago Link https://x.com/ElectionWiz/status/1987662811200475296?s=20 permalink award report block reply\nOldBark2 1 points 3 days ago Please, please let this happen. That little adam schiss is stinking up CA along with greasy newscum and the rest of the commie lefties. permalink award report block reply\n559throw 1 points 3 days ago Lol, sure they are permalink award report block reply\ncovok48 1 points 3 days ago All of your conservative wishes aren't going to happen. Just accept that, permalink award report block reply\nSBOJ_JOBS 1 points 2 days ago Lying on mortgage applications? I guess this is the same as when we imprisoned a murderous  mafia figure for income tax evasion because no-one wanted the public to know what had been allowed for years permalink award report block reply\nTreefiddydiddy 1 points 2 days ago I don't give an 'ed buck' about this prick permalink award report block reply\nSupFrens 1 points 2 days ago Is that all we have on this dickhead? Anything more substantial would be great? Like didn't he help organize J6 or some shit? Come on! permalink award report block reply\nKernalMustard 1 points 3 days ago Indicted. Celebrate when hes convicted. It will still be just a hand slap anyway. permalink award report block reply\nJDVance4President28 1 points 2 days ago In 2016 when Trump promised us that he would go after the deep state, I didn't realize it meant 10 years of no action with soft DOJ picks. Think about it. They spyed on his campaign. They stole an election. They dragged his name through the mud. Made him a felon, told the people he was a rapist and they tried to put his own son in jail. Yet. Nothing. Not a single fucking consequence. It feels like controlled opposition that seems to always benefit Israel. permalink award report block reply\nGoatboy66 1 points 2 days ago How about TREASON- RICO ACT! permalink award report block reply\nKoikatrose 1 points 2 days ago Standard Hotel... pedophilia....\nLittle boy....\nTreason....\nPerjury.....\nConspiracy....\nAnd God knows what else.....!!\nThis piece of garbage needs to be arrested for so much evil! permalink award report block reply\nthrottlejohnson 1 points 3 days ago why would they be worried if someone else was commiting fraud? oh yeah...i see /s permalink award report block reply\nhamajun 1 points 2 days ago Possibility? It's inevitability. permalink award report block reply\nSeruna_Kanus 1 points 3 days ago They really had to be so retarded as to try and attack Trump in the industry that he practically owns. permalink award report block reply\nCatyKean 1 points 3 days ago Why worry? 🤔 permalink award report block reply\nLight_HIV_Effect 1 points 3 days ago Where you going to try him? DC? California? Maryland? They just need one judge to get any number of these cases thrown out because they're \"politically motivated\" and all the rest will follow until they can wait out a dem to cheat into the whitehouse for 2028. Big Tish, Comey, Fauci, Pencil neck, Omar, AOC, Pelosi are all going to walk free. permalink award report block reply\nOZJRant 1 points 2 days ago Schifty by name shifty by nature … he will have no problems escaping any punishment permalink award report block reply\nPappy_Gunn 1 points 3 days ago He looks like a pedo abuser this guy ain't normal permalink award report block reply\njonnyuno 1 points 2 days ago Prison for life. permalink award report block reply\nRock9Head 1 points 3 days ago He’s getting off easy. permalink award report block reply"}