{"id": "8180439", "contents": "1094 Is this….is this….an admission of defeat? posted 2 days ago by Haiti_kid 107 comments award share download report block\n107 comments Sort by Top Top New Worst Old Save MikeyisNinja 75 points 2 days ago Redditors are so salty rn permalink award report block reply Meister_Bockmist 43 points 2 days ago and gay. permalink parent award report block reply TPMJB 16 points 2 days ago What else is new? permalink parent award report block reply NukeTheTroons 3 points 2 days ago And dumb and evil permalink parent award report block reply StayoutOfit 1 points 2 days ago That's not new . permalink parent award report block reply MegoThor 3 points 2 days ago And pedophiles. permalink parent award report block reply ATX_for_Trump 20 points 2 days ago TDS infiltrates almost every r/Austin post: Restaurant review? Nazi's eat there while SNAP recipients are starving!\nAccident on the I-35? must be a Redneck Drump supporter.\nLocal Property tax complaint - Trump cut our homeless funding!\nand on and on and on permalink parent award report block reply rebuildingMyself 12 points 2 days ago Even my small solid red town looks like San Francisco if you judge it based on the reddit sub. permalink parent award report block reply datraceman 7 points 2 days ago My favorite is how in my very red state of Alabama they love to celebrate how Birmingham is our blue dot! Except downtown is mostly a shithole outside of the baseball stadium area and one strip of downtown. The amount of shootings, muggings, and car jacking are just ignored because it goes against the narrative of the utopia. permalink parent award report block reply MasterChief08 7 points 2 days ago They don't care. I'm serious. They would rather the murder rate be what El Salvador experienced 8 years ago than ever admit they're wrong. These people are pure evil permalink parent award report block reply view 2 more comments... mty_green_go 4 points 2 days ago same with r/UFOs i was banned for speaking up against every other post being some TDS troll bait permalink parent award report block reply newuser8 3 points 2 days ago There are only a handful of subs that aren't retarded on a biblical level permalink parent award report block reply MikeyisNinja 3 points 2 days ago Pure copium on their part. permalink parent award report block reply newuser8 2 points 2 days ago It's every subreddit. That site went to shit by 2016 and gets worse every year. Even the trades like roofing and welding have been taken over. permalink parent award report block reply Rydanovich 14 points 2 days ago Reddit is fucking MAD right now. permalink parent award report block reply PatriotDescendant 7 points 2 days ago Exactly. Mad, not defeated. Socialist masters play the long game. Look how far they've progressed since the days of McCarthy! permalink parent award report block reply MasterChief08 6 points 2 days ago Joseph McCarthy is a hero. Texas and Florida need to update their curriculum to recognize this. permalink parent award report block reply newuser8 1 points 2 days ago My local high school had a play I went to and the musical was about the Salem witch trials. And sure enough, the teachers were able to weave McCarthyism in there as an analogy. Govt schools are evil permalink parent award report block reply Rydanovich 3 points 2 days ago As they say, don't stop hitting til they go down and stay down. permalink parent award report block reply PatriotDescendant 1 points 2 days ago Correct. permalink parent award report block reply SteelBallRun1890 2 points 2 days ago Oh, I've seen plenty of comments that are defeated. Many saying what is the point of voting and they are done after this kek permalink parent award report block reply ParticleCannon 3 points 2 days ago occuring in November doesn't help permalink parent award report block reply evilkitten 5 points 2 days ago The mods deleting posts talking about the end of the shutdown.  It's fucking hilarious. permalink parent award report block reply PatriotDescendant 3 points 2 days ago Not on the posts I'm seeing. They're cursing their turncoats. They're angry rather than defeated. permalink parent award report block reply load 5 more comments... tribunabessica 25 points 2 days ago I don't get it. Will there be free Healthcare for illegals now? permalink award report block reply SanityGumby 23 points 2 days ago No. Democrats gained literally 0 in this deal. It's the same as the original CR. Anything CNN had in their initial bullet lists of the deal were already going to be happening anyway. There was already going to be negotiation on Obamacare. There already was going to be funding through January for SNAP...because it's in the funding of the original CR. No illegal healthcare. No Obamacare funding beyond what remains with the ending of subsidies. permalink parent award report block reply Zskills 15 points 2 days ago Democrats gained literally 0 in this deal They got a bunch of their deepstate leeches re-hired with back pay permalink parent award report block reply SanityGumby 11 points 2 days ago No, they got nothing. Those people wouldn't have been let go if they just signed the original CR. All they did is not lose. All they got was a promise not to fire them until after the holidays. permalink parent award report block reply deleted 3 points 2 days ago RachetQueen2020 1 points 2 days ago Go look in the main Fed sub. They are literally crying about government re-opening. I hope it is just bots or agitators. permalink parent award report block reply view 1 more comments... TheFozz 1 points 2 days ago Dems are retarded, held out for nothing, they're so fucking retarded. permalink parent award report block reply TheThreeSeashells 3 points 2 days ago Even their claims of winning all those elections last week, which was a big reason they were holding out, didn't work.  Nobody is buying that Leftists getting elected in Leftist states/cities was a \"bellweather\" moment. permalink parent award report block reply view 1 more comments... NonbinaryPotatohead 1 points 2 days ago Kaiser Permanente is probably spamming the \"DO SOMETHING!\" button right now permalink parent award report block reply TheMostUselessFeeder 1 points 2 days ago Call me a doomer, but I straight up don't trust the Senate GOP promise to grant the ACA vote, cause dems should know that the vote is 100% going to fail UNLESS part of the deal was to give RINO turncoat votes to dems... so why accept it? permalink parent award report block reply The_Left_The 1 points 2 days ago I don't trust them either, but they didn't cave today, and that's better than what it could be. permalink parent award report block reply Zskills 1 points 2 days ago Yes, but not yet, and not because of this. Democrats will codify it into law once they regain government control in 2028 or 2030 and then republicans will defend it because the democrats are the real racists.  The GOP exists solely to enforce with rigor that which the radical left has perpetrated on our government and culture. permalink parent award report block reply DeportThemAllForever -1 points 2 days ago It’s Biden spend continues, no changes. So Republicans at the end continue Biden budget. permalink parent award report block reply CruzControl 13 points 2 days ago It for real is. They are signing the Red House CR as is.\nThe filibuster heat was getting too hot for them to handle and they found dems that were not up for re-election in 2026. Thune did give them one thing which was a lot less than what we were worrying about. A separate vote on the ACA subsidies in December - will need 51 to pass as it is filibuster proof. Dems are going to try and pin the rise in ACA premiums on the GOP/Trump. permalink award report block reply MehNahMehNah 4 points 2 days ago Is this a scenario where JD may have to come in to cast a deciding vote? Or is it the other house? Obama care needs to be gutted and made pointless. If the US persists in providing some national federally funded 'healthcare' it needs to be tied to reform of all the supporting (or supported) systems. Insurance companies out of control. Big Pharma. Hospital billing and accounting practices. Medical certifications and oversight. permalink parent award report block reply datraceman 7 points 2 days ago The problem is once Obamacare passed they had a small window to get rid of it and fucking John McCain ruined it. Unless Republicans come up with actual legislation to replace Obamacare with something sensible we are stuck with it because once socialism leaks into your government, you can't get rid of it. See all our dumbass welfare policies. Social Security, welfare, SNAP, etc. Once Obamacare wasn't repealed soon after it passed, we were screwed. Now, it's how do you contain it and limit it. permalink parent award report block reply Glory-Unto-God 2 points 2 days ago Gutless permalink parent award report block reply TheThreeSeashells -1 points 2 days ago Unless Republicans come up with actual legislation to replace Obamacare with something sensible Rand Paul handed President Trump a perfect plan in his first term and it was completely ignored.  It doesn't even require them to go through the process of repealing Obamacare.  It simply allows credit unions and other membership organizations to offer healthcare to their members, giving them the ability to negotiate lower rates because they would have numbers on their side. This would offer a more affordable option than Obamacare which in theory could likely choke Obamacare to death over time.  More importantly, it opens healthcare to the free market and creates actual competition.  Not just the \"we're jacking up your rates again and there's nothing you can do about it\" situation we have right now. If only President Trump got over his petty squabbling with Rand, stopped listening to his advisors who have no plan, and just embraced Rand's plan, we would actually have a solution.  The anti-Rand crowd here needs to do the same.  If you want to bitch and moan about his stance on tariffs, fine.  But why throw out a great idea because you disagree on him regarding other issues?  That's moronic. SPEZ: ...and here comes the aforementioned morons with the downvotes. permalink parent award report block reply pollsarefake 1 points 2 days ago You sound like a faggot with TDS permalink parent award report block reply view 1 more comments... TNgirl4Trump 8 points 2 days ago I saw someone point out that the representatives who caved are not up for reelection. I don’t want Trump giving the lunatics one single thing. permalink award report block reply HairOfTheDoge 8 points 2 days ago Leftists are so retarded. Mad about the shutdown and now mad about it ending. permalink award report block reply TheThreeSeashells 5 points 2 days ago They were mad about it starting because their controllers told them to be mad.  They're mad about it ending for the same reason and because they're being told they got nothing out of it.  None of them will be able to actually tell you a legitimate reason why they were mad about either one. permalink parent award report block reply newuser8 2 points 2 days ago Firmware OTA updates dictate their every move permalink parent award report block reply Trubs 2 points 2 days ago You'd think they'd be more upset about their mutilated genitalia. permalink parent award report block reply YaharaRiver 0 points 2 days ago It’s funny as hell.  They have to repay any unemployment compensation they received 😂👍 AND catch up on two months of work piling up on their desk! permalink parent award report block reply billybaldwin2 6 points 2 days ago Is this a new budget or a roll over of the last roll over that was the Dem's budget back in 2024? permalink award report block reply briantrash 6 points 2 days ago Part of the deal is that all of the layoffs that occurred during the shutdown will be undone. permalink award report block reply SanityGumby 7 points 2 days ago So, the original CR. None of them would have been laid off if the CR passed originally. And the only promise is they won't be fired again until after January. A promise. Not law. It was unlikely Trump was going to do mass firings right before Thanksgiving and Christmas. permalink parent award report block reply Diversityhire 4 points 2 days ago Boo, was hoping we make it through the holidays permalink award report block reply pococurante 1 points 2 days ago I regret to inform you that we can't stop winning permalink parent award report block reply clownworld30330 4 points 2 days ago No, it’s the uniparty’s victory. All the inroads Trump made with blacks: gone over EBT. All the progress made by Trump with normies: lost to bad news coverage. permalink award report block reply LWGII 3 points 2 days ago That will all be forgotten by Christmas. permalink parent award report block reply clownworld30330 1 points 2 days ago Oh I hope so. permalink parent award report block reply TheThreeSeashells 1 points 2 days ago It will be forgotten before that.  The second the gibs start getting handed out, nobody is going to give a shit anymore. permalink parent award report block reply TrumpAndSimpsNotMAGA 1 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply NADSAQ 3 points 2 days ago It’s an admission of culpability, at least. permalink award report block reply daty_dato 3 points 2 days ago It's theater. They got what they wanted. Now before the rubes learn it's their fault, get it over with. permalink award report block reply PhantomShield72 3 points 2 days ago At least they're admitting who it was that was keeping the govt. shut down to begin with. I wanted it to stay shut down forever for all I care.  But I was getting sick of watching them rile up their base with the false claim that R's were the ones shutting it down. permalink award report block reply Bullet3250 3 points 2 days ago And again.. Do those PROTESTING ... even know what or why they are protesting? Because I doubt it. All Rent a Mob tactics on the LEFT.... all day, every day.. permalink award report block reply HeavenlyTrumpets 3 points 2 days ago What compromise? I don't like that word. Dems weren't given anything in exchange for ending the shutdown were they? permalink award report block reply briantrash 3 points 2 days ago All of the layoffs that occurred during the shutdown will be undone. permalink parent award report block reply YaharaRiver 2 points 2 days ago Presto! Immediate end to their federal unemployment checks! AND if an employee is reinstated and receives back pay for the period they were laid off, they are required to repay the unemployment compensation (UC) benefits they received during that same period! Not the “big win” the dems think.  Now get to work, bitches, there’s two months of pile-up on your desk!! permalink parent award report block reply TheThreeSeashells 1 points 2 days ago there’s two months of pile-up on your desk!! Do you actually think they're going to work their asses off to catch up?  All that means is there will now be a permanent two month delay built-in to whatever it is they do. permalink parent award report block reply Smurfection 3 points 2 days ago If you know anyone on EBT, SNAP or Medicaid who couldn't get their monthly benefits, you should show them that lefty Democrats are protesting their welfare benefits.  Show the that Democrats would rather feed illegals aliens, house illegal aliens and give healthcare to illegal aliens than to them.  Show them how unreliable \"compassionate\" Dems are.  Tell them that Dems buy votes to enrich themselves and their families.  They don't care about impoverished Americans.  They think impoverished Americans are trash. permalink award report block reply ParticleCannon 3 points 2 days ago Protest that its shut down.  Protest that it ends. Do these people have jobs or are they just constant Protest temps? permalink award report block reply preferredfault 3 points 2 days ago It's all pre-planned theater, because Schumer needed a way out while still voting against it. Senator Kennedy predicted weeks ago that this is exactly what was going to happen. Trump should throw a hail mary and veto it anyways then demand even more concessions from Democrats. Keep this shit shutdown until Democrats cave on everything and more. permalink award report block reply Chickensaurus 2 points 2 days ago No....lol. permalink award report block reply YodaBannon 2 points 2 days ago global cooling reeeeeeee!!!!!!! permalink award report block reply SavingPrivateGrace 2 points 2 days ago The nutjobs are protesting their own nutjobs and threatening to primary them. permalink award report block reply WI-Patriot 2 points 2 days ago Is this the first time R's didn't cave? permalink award report block reply kyle6969 2 points 2 days ago The government all fucking hate you. Trump included. If you do t see that yet…… permalink award report block reply Rucktoe 2 points 2 days ago I have to give a small nod to the Rinos, for a brief moment in time they were not pussies. permalink award report block reply Zskills 2 points 2 days ago No food for the rentoids if MS13 doesn't get free healthcare!!!  Because I am compassionate permalink award report block reply HoganP 2 points 2 days ago From things I've seen around the net this morning, the lefties are pissed. permalink award report block reply AndyCuomoIsAMobster 2 points 2 days ago Coincidentally, total coincidence, after the election cycle has ended. permalink award report block reply DRK00 1 points 2 days ago Its not so much an admission, its a carefully crafted way to make it look like the R's are still the bad guys, but that the D's will fall on the sword. permalink award report block reply Fundadores 1 points 2 days ago Cracked like dogs! 😂 permalink award report block reply Agent_86 1 points 2 days ago Arctic blast? They ain't kidding lol. Ive got snow still coming down. My dogs love it lol. permalink award report block reply RachetQueen2020 1 points 2 days ago Even on the fed workers sub, they are crying about getting paid! I want to beat the ever loving shit out of each and every one of them. Fuck them. I want my money. permalink award report block reply ThePatriotGames2016 1 points 2 days ago no. the only way to defeat them is unfortunately destroying everything about them. permalink award report block reply spezisacuckold 1 points 2 days ago Not much of a win when we're basically continuing a Pelosi budget / and Harris/Biden levels of spending. permalink award report block reply bluewhiteandred 1 points 2 days ago what impact will this have on the thought of nuking the filibuster permalink award report block reply noPTSDforMePlease 1 points 2 days ago It's damage control. They want the illegals to think that Democrats were actually trying to get them healthcare but really it was about last week's elections. Those are over, so time for the government to open and the propaganda machine to kick in. permalink award report block reply OmegaBird 1 points 2 days ago Fuck Demoncrats. Not literally as they are all SDI riddled degenerates. But figuratively. permalink award report block reply SoyLatte 1 points 2 days ago Best part is Fetterman is one of the dems that voted Also, surprising, Tim Kaine. permalink award report block reply itspancakees 1 points 2 days ago A Republican president with a backbone is something many people alive today have never seen permalink award report block reply NonbinaryPotatohead 1 points 2 days ago They forced everyone to buy car insurance and made it illegal to drive without it. They tried to force everyone to have health insurance and wanted to make it illegal to breathe without it. When the government forces you to buy into corporate scams on a large scale that's how you know the US is also a corporation.\nThe new enterprise. \"Annuit Coeptis...Novos Ordo Seclorum.\" Not all is doomed. The faster we can get enough true believing Americans in these seats we can get rid of all this bullshit. It's just a numbers game that unfortunately does cost billionaire funding to win. permalink award report block reply Nasty_Savage 1 points 2 days ago They got what they wabted in the elections. The other stuff was a distraction no one was buying permalink award report block reply Wexit-Delecto 1 points 2 days ago WTF I don’t like shutdowns now! permalink award report block reply AlohaSnackbar 1 points 2 days ago If anyone thinks these 8 acted without orders from their Democrat overlords, I have a bridge for sale. Everyone knows that this type of \"caving\" was done via leadership selecting those that either needed to be seen as compromising -or- those that are so secure that the blowback from their base could be weathered. It's all theater, and frankly the WWF does it better.  (And yes, I know it's the WWE, but fuck forced renaming). permalink award report block reply keeman 0 points 2 days ago Yes.  America loses.  We need to gut the budget and we are strong arming Dems to pass another extension of Biden's insane levels of spending. permalink award report block reply SegAtari -2 points 2 days ago Admission of defeat? Bwahaha!\nThis is just kabuki theater. The only ones who got “defeated” with this compromise are those of us who actually want to fix our broken system.\nThis is just another dancing puppet show that allows the globalists and their elitist shill boyfriends to continue screwing this country over all while convincing the plebes that they’re “fighting to save it”.\nWake me up when the guillotines and scaffolds are actually being built. permalink award report block reply EyesSewnShut 1 points 2 days ago Comment removed by community moderators. permalink award report block reply\nMikeyisNinja 75 points 2 days ago Redditors are so salty rn permalink award report block reply Meister_Bockmist 43 points 2 days ago and gay. permalink parent award report block reply TPMJB 16 points 2 days ago What else is new? permalink parent award report block reply NukeTheTroons 3 points 2 days ago And dumb and evil permalink parent award report block reply StayoutOfit 1 points 2 days ago That's not new . permalink parent award report block reply MegoThor 3 points 2 days ago And pedophiles. permalink parent award report block reply ATX_for_Trump 20 points 2 days ago TDS infiltrates almost every r/Austin post: Restaurant review? Nazi's eat there while SNAP recipients are starving!\nAccident on the I-35? must be a Redneck Drump supporter.\nLocal Property tax complaint - Trump cut our homeless funding!\nand on and on and on permalink parent award report block reply rebuildingMyself 12 points 2 days ago Even my small solid red town looks like San Francisco if you judge it based on the reddit sub. permalink parent award report block reply datraceman 7 points 2 days ago My favorite is how in my very red state of Alabama they love to celebrate how Birmingham is our blue dot! Except downtown is mostly a shithole outside of the baseball stadium area and one strip of downtown. The amount of shootings, muggings, and car jacking are just ignored because it goes against the narrative of the utopia. permalink parent award report block reply MasterChief08 7 points 2 days ago They don't care. I'm serious. They would rather the murder rate be what El Salvador experienced 8 years ago than ever admit they're wrong. These people are pure evil permalink parent award report block reply view 2 more comments... mty_green_go 4 points 2 days ago same with r/UFOs i was banned for speaking up against every other post being some TDS troll bait permalink parent award report block reply newuser8 3 points 2 days ago There are only a handful of subs that aren't retarded on a biblical level permalink parent award report block reply MikeyisNinja 3 points 2 days ago Pure copium on their part. permalink parent award report block reply newuser8 2 points 2 days ago It's every subreddit. That site went to shit by 2016 and gets worse every year. Even the trades like roofing and welding have been taken over. permalink parent award report block reply Rydanovich 14 points 2 days ago Reddit is fucking MAD right now. permalink parent award report block reply PatriotDescendant 7 points 2 days ago Exactly. Mad, not defeated. Socialist masters play the long game. Look how far they've progressed since the days of McCarthy! permalink parent award report block reply MasterChief08 6 points 2 days ago Joseph McCarthy is a hero. Texas and Florida need to update their curriculum to recognize this. permalink parent award report block reply newuser8 1 points 2 days ago My local high school had a play I went to and the musical was about the Salem witch trials. And sure enough, the teachers were able to weave McCarthyism in there as an analogy. Govt schools are evil permalink parent award report block reply Rydanovich 3 points 2 days ago As they say, don't stop hitting til they go down and stay down. permalink parent award report block reply PatriotDescendant 1 points 2 days ago Correct. permalink parent award report block reply SteelBallRun1890 2 points 2 days ago Oh, I've seen plenty of comments that are defeated. Many saying what is the point of voting and they are done after this kek permalink parent award report block reply ParticleCannon 3 points 2 days ago occuring in November doesn't help permalink parent award report block reply evilkitten 5 points 2 days ago The mods deleting posts talking about the end of the shutdown.  It's fucking hilarious. permalink parent award report block reply PatriotDescendant 3 points 2 days ago Not on the posts I'm seeing. They're cursing their turncoats. They're angry rather than defeated. permalink parent award report block reply load 5 more comments...\nMeister_Bockmist 43 points 2 days ago and gay. permalink parent award report block reply TPMJB 16 points 2 days ago What else is new? permalink parent award report block reply NukeTheTroons 3 points 2 days ago And dumb and evil permalink parent award report block reply StayoutOfit 1 points 2 days ago That's not new . permalink parent award report block reply MegoThor 3 points 2 days ago And pedophiles. permalink parent award report block reply\nTPMJB 16 points 2 days ago What else is new? permalink parent award report block reply NukeTheTroons 3 points 2 days ago And dumb and evil permalink parent award report block reply StayoutOfit 1 points 2 days ago That's not new . permalink parent award report block reply\nNukeTheTroons 3 points 2 days ago And dumb and evil permalink parent award report block reply StayoutOfit 1 points 2 days ago That's not new . permalink parent award report block reply\nStayoutOfit 1 points 2 days ago That's not new . permalink parent award report block reply\nMegoThor 3 points 2 days ago And pedophiles. permalink parent award report block reply\nATX_for_Trump 20 points 2 days ago TDS infiltrates almost every r/Austin post: Restaurant review? Nazi's eat there while SNAP recipients are starving!\nAccident on the I-35? must be a Redneck Drump supporter.\nLocal Property tax complaint - Trump cut our homeless funding!\nand on and on and on permalink parent award report block reply rebuildingMyself 12 points 2 days ago Even my small solid red town looks like San Francisco if you judge it based on the reddit sub. permalink parent award report block reply datraceman 7 points 2 days ago My favorite is how in my very red state of Alabama they love to celebrate how Birmingham is our blue dot! Except downtown is mostly a shithole outside of the baseball stadium area and one strip of downtown. The amount of shootings, muggings, and car jacking are just ignored because it goes against the narrative of the utopia. permalink parent award report block reply MasterChief08 7 points 2 days ago They don't care. I'm serious. They would rather the murder rate be what El Salvador experienced 8 years ago than ever admit they're wrong. These people are pure evil permalink parent award report block reply view 2 more comments... mty_green_go 4 points 2 days ago same with r/UFOs i was banned for speaking up against every other post being some TDS troll bait permalink parent award report block reply newuser8 3 points 2 days ago There are only a handful of subs that aren't retarded on a biblical level permalink parent award report block reply MikeyisNinja 3 points 2 days ago Pure copium on their part. permalink parent award report block reply newuser8 2 points 2 days ago It's every subreddit. That site went to shit by 2016 and gets worse every year. Even the trades like roofing and welding have been taken over. permalink parent award report block reply\nrebuildingMyself 12 points 2 days ago Even my small solid red town looks like San Francisco if you judge it based on the reddit sub. permalink parent award report block reply datraceman 7 points 2 days ago My favorite is how in my very red state of Alabama they love to celebrate how Birmingham is our blue dot! Except downtown is mostly a shithole outside of the baseball stadium area and one strip of downtown. The amount of shootings, muggings, and car jacking are just ignored because it goes against the narrative of the utopia. permalink parent award report block reply MasterChief08 7 points 2 days ago They don't care. I'm serious. They would rather the murder rate be what El Salvador experienced 8 years ago than ever admit they're wrong. These people are pure evil permalink parent award report block reply view 2 more comments...\ndatraceman 7 points 2 days ago My favorite is how in my very red state of Alabama they love to celebrate how Birmingham is our blue dot! Except downtown is mostly a shithole outside of the baseball stadium area and one strip of downtown. The amount of shootings, muggings, and car jacking are just ignored because it goes against the narrative of the utopia. permalink parent award report block reply MasterChief08 7 points 2 days ago They don't care. I'm serious. They would rather the murder rate be what El Salvador experienced 8 years ago than ever admit they're wrong. These people are pure evil permalink parent award report block reply view 2 more comments...\nMasterChief08 7 points 2 days ago They don't care. I'm serious. They would rather the murder rate be what El Salvador experienced 8 years ago than ever admit they're wrong. These people are pure evil permalink parent award report block reply view 2 more comments...\nmty_green_go 4 points 2 days ago same with r/UFOs i was banned for speaking up against every other post being some TDS troll bait permalink parent award report block reply newuser8 3 points 2 days ago There are only a handful of subs that aren't retarded on a biblical level permalink parent award report block reply\nnewuser8 3 points 2 days ago There are only a handful of subs that aren't retarded on a biblical level permalink parent award report block reply\nMikeyisNinja 3 points 2 days ago Pure copium on their part. permalink parent award report block reply\nnewuser8 2 points 2 days ago It's every subreddit. That site went to shit by 2016 and gets worse every year. Even the trades like roofing and welding have been taken over. permalink parent award report block reply\nRydanovich 14 points 2 days ago Reddit is fucking MAD right now. permalink parent award report block reply PatriotDescendant 7 points 2 days ago Exactly. Mad, not defeated. Socialist masters play the long game. Look how far they've progressed since the days of McCarthy! permalink parent award report block reply MasterChief08 6 points 2 days ago Joseph McCarthy is a hero. Texas and Florida need to update their curriculum to recognize this. permalink parent award report block reply newuser8 1 points 2 days ago My local high school had a play I went to and the musical was about the Salem witch trials. And sure enough, the teachers were able to weave McCarthyism in there as an analogy. Govt schools are evil permalink parent award report block reply Rydanovich 3 points 2 days ago As they say, don't stop hitting til they go down and stay down. permalink parent award report block reply PatriotDescendant 1 points 2 days ago Correct. permalink parent award report block reply SteelBallRun1890 2 points 2 days ago Oh, I've seen plenty of comments that are defeated. Many saying what is the point of voting and they are done after this kek permalink parent award report block reply ParticleCannon 3 points 2 days ago occuring in November doesn't help permalink parent award report block reply\nPatriotDescendant 7 points 2 days ago Exactly. Mad, not defeated. Socialist masters play the long game. Look how far they've progressed since the days of McCarthy! permalink parent award report block reply MasterChief08 6 points 2 days ago Joseph McCarthy is a hero. Texas and Florida need to update their curriculum to recognize this. permalink parent award report block reply newuser8 1 points 2 days ago My local high school had a play I went to and the musical was about the Salem witch trials. And sure enough, the teachers were able to weave McCarthyism in there as an analogy. Govt schools are evil permalink parent award report block reply Rydanovich 3 points 2 days ago As they say, don't stop hitting til they go down and stay down. permalink parent award report block reply PatriotDescendant 1 points 2 days ago Correct. permalink parent award report block reply SteelBallRun1890 2 points 2 days ago Oh, I've seen plenty of comments that are defeated. Many saying what is the point of voting and they are done after this kek permalink parent award report block reply\nMasterChief08 6 points 2 days ago Joseph McCarthy is a hero. Texas and Florida need to update their curriculum to recognize this. permalink parent award report block reply newuser8 1 points 2 days ago My local high school had a play I went to and the musical was about the Salem witch trials. And sure enough, the teachers were able to weave McCarthyism in there as an analogy. Govt schools are evil permalink parent award report block reply\nnewuser8 1 points 2 days ago My local high school had a play I went to and the musical was about the Salem witch trials. And sure enough, the teachers were able to weave McCarthyism in there as an analogy. Govt schools are evil permalink parent award report block reply\nRydanovich 3 points 2 days ago As they say, don't stop hitting til they go down and stay down. permalink parent award report block reply PatriotDescendant 1 points 2 days ago Correct. permalink parent award report block reply\nPatriotDescendant 1 points 2 days ago Correct. permalink parent award report block reply\nSteelBallRun1890 2 points 2 days ago Oh, I've seen plenty of comments that are defeated. Many saying what is the point of voting and they are done after this kek permalink parent award report block reply\nParticleCannon 3 points 2 days ago occuring in November doesn't help permalink parent award report block reply\nevilkitten 5 points 2 days ago The mods deleting posts talking about the end of the shutdown.  It's fucking hilarious. permalink parent award report block reply\nPatriotDescendant 3 points 2 days ago Not on the posts I'm seeing. They're cursing their turncoats. They're angry rather than defeated. permalink parent award report block reply\ntribunabessica 25 points 2 days ago I don't get it. Will there be free Healthcare for illegals now? permalink award report block reply SanityGumby 23 points 2 days ago No. Democrats gained literally 0 in this deal. It's the same as the original CR. Anything CNN had in their initial bullet lists of the deal were already going to be happening anyway. There was already going to be negotiation on Obamacare. There already was going to be funding through January for SNAP...because it's in the funding of the original CR. No illegal healthcare. No Obamacare funding beyond what remains with the ending of subsidies. permalink parent award report block reply Zskills 15 points 2 days ago Democrats gained literally 0 in this deal They got a bunch of their deepstate leeches re-hired with back pay permalink parent award report block reply SanityGumby 11 points 2 days ago No, they got nothing. Those people wouldn't have been let go if they just signed the original CR. All they did is not lose. All they got was a promise not to fire them until after the holidays. permalink parent award report block reply deleted 3 points 2 days ago RachetQueen2020 1 points 2 days ago Go look in the main Fed sub. They are literally crying about government re-opening. I hope it is just bots or agitators. permalink parent award report block reply view 1 more comments... TheFozz 1 points 2 days ago Dems are retarded, held out for nothing, they're so fucking retarded. permalink parent award report block reply TheThreeSeashells 3 points 2 days ago Even their claims of winning all those elections last week, which was a big reason they were holding out, didn't work.  Nobody is buying that Leftists getting elected in Leftist states/cities was a \"bellweather\" moment. permalink parent award report block reply view 1 more comments... NonbinaryPotatohead 1 points 2 days ago Kaiser Permanente is probably spamming the \"DO SOMETHING!\" button right now permalink parent award report block reply TheMostUselessFeeder 1 points 2 days ago Call me a doomer, but I straight up don't trust the Senate GOP promise to grant the ACA vote, cause dems should know that the vote is 100% going to fail UNLESS part of the deal was to give RINO turncoat votes to dems... so why accept it? permalink parent award report block reply The_Left_The 1 points 2 days ago I don't trust them either, but they didn't cave today, and that's better than what it could be. permalink parent award report block reply Zskills 1 points 2 days ago Yes, but not yet, and not because of this. Democrats will codify it into law once they regain government control in 2028 or 2030 and then republicans will defend it because the democrats are the real racists.  The GOP exists solely to enforce with rigor that which the radical left has perpetrated on our government and culture. permalink parent award report block reply DeportThemAllForever -1 points 2 days ago It’s Biden spend continues, no changes. So Republicans at the end continue Biden budget. permalink parent award report block reply\nSanityGumby 23 points 2 days ago No. Democrats gained literally 0 in this deal. It's the same as the original CR. Anything CNN had in their initial bullet lists of the deal were already going to be happening anyway. There was already going to be negotiation on Obamacare. There already was going to be funding through January for SNAP...because it's in the funding of the original CR. No illegal healthcare. No Obamacare funding beyond what remains with the ending of subsidies. permalink parent award report block reply Zskills 15 points 2 days ago Democrats gained literally 0 in this deal They got a bunch of their deepstate leeches re-hired with back pay permalink parent award report block reply SanityGumby 11 points 2 days ago No, they got nothing. Those people wouldn't have been let go if they just signed the original CR. All they did is not lose. All they got was a promise not to fire them until after the holidays. permalink parent award report block reply deleted 3 points 2 days ago RachetQueen2020 1 points 2 days ago Go look in the main Fed sub. They are literally crying about government re-opening. I hope it is just bots or agitators. permalink parent award report block reply view 1 more comments... TheFozz 1 points 2 days ago Dems are retarded, held out for nothing, they're so fucking retarded. permalink parent award report block reply TheThreeSeashells 3 points 2 days ago Even their claims of winning all those elections last week, which was a big reason they were holding out, didn't work.  Nobody is buying that Leftists getting elected in Leftist states/cities was a \"bellweather\" moment. permalink parent award report block reply view 1 more comments... NonbinaryPotatohead 1 points 2 days ago Kaiser Permanente is probably spamming the \"DO SOMETHING!\" button right now permalink parent award report block reply TheMostUselessFeeder 1 points 2 days ago Call me a doomer, but I straight up don't trust the Senate GOP promise to grant the ACA vote, cause dems should know that the vote is 100% going to fail UNLESS part of the deal was to give RINO turncoat votes to dems... so why accept it? permalink parent award report block reply The_Left_The 1 points 2 days ago I don't trust them either, but they didn't cave today, and that's better than what it could be. permalink parent award report block reply\nZskills 15 points 2 days ago Democrats gained literally 0 in this deal They got a bunch of their deepstate leeches re-hired with back pay permalink parent award report block reply SanityGumby 11 points 2 days ago No, they got nothing. Those people wouldn't have been let go if they just signed the original CR. All they did is not lose. All they got was a promise not to fire them until after the holidays. permalink parent award report block reply deleted 3 points 2 days ago RachetQueen2020 1 points 2 days ago Go look in the main Fed sub. They are literally crying about government re-opening. I hope it is just bots or agitators. permalink parent award report block reply view 1 more comments... TheFozz 1 points 2 days ago Dems are retarded, held out for nothing, they're so fucking retarded. permalink parent award report block reply TheThreeSeashells 3 points 2 days ago Even their claims of winning all those elections last week, which was a big reason they were holding out, didn't work.  Nobody is buying that Leftists getting elected in Leftist states/cities was a \"bellweather\" moment. permalink parent award report block reply view 1 more comments...\nSanityGumby 11 points 2 days ago No, they got nothing. Those people wouldn't have been let go if they just signed the original CR. All they did is not lose. All they got was a promise not to fire them until after the holidays. permalink parent award report block reply\ndeleted 3 points 2 days ago RachetQueen2020 1 points 2 days ago Go look in the main Fed sub. They are literally crying about government re-opening. I hope it is just bots or agitators. permalink parent award report block reply view 1 more comments...\nRachetQueen2020 1 points 2 days ago Go look in the main Fed sub. They are literally crying about government re-opening. I hope it is just bots or agitators. permalink parent award report block reply view 1 more comments...\nTheFozz 1 points 2 days ago Dems are retarded, held out for nothing, they're so fucking retarded. permalink parent award report block reply TheThreeSeashells 3 points 2 days ago Even their claims of winning all those elections last week, which was a big reason they were holding out, didn't work.  Nobody is buying that Leftists getting elected in Leftist states/cities was a \"bellweather\" moment. permalink parent award report block reply view 1 more comments...\nTheThreeSeashells 3 points 2 days ago Even their claims of winning all those elections last week, which was a big reason they were holding out, didn't work.  Nobody is buying that Leftists getting elected in Leftist states/cities was a \"bellweather\" moment. permalink parent award report block reply view 1 more comments...\nNonbinaryPotatohead 1 points 2 days ago Kaiser Permanente is probably spamming the \"DO SOMETHING!\" button right now permalink parent award report block reply\nTheMostUselessFeeder 1 points 2 days ago Call me a doomer, but I straight up don't trust the Senate GOP promise to grant the ACA vote, cause dems should know that the vote is 100% going to fail UNLESS part of the deal was to give RINO turncoat votes to dems... so why accept it? permalink parent award report block reply The_Left_The 1 points 2 days ago I don't trust them either, but they didn't cave today, and that's better than what it could be. permalink parent award report block reply\nThe_Left_The 1 points 2 days ago I don't trust them either, but they didn't cave today, and that's better than what it could be. permalink parent award report block reply\nZskills 1 points 2 days ago Yes, but not yet, and not because of this. Democrats will codify it into law once they regain government control in 2028 or 2030 and then republicans will defend it because the democrats are the real racists.  The GOP exists solely to enforce with rigor that which the radical left has perpetrated on our government and culture. permalink parent award report block reply\nDeportThemAllForever -1 points 2 days ago It’s Biden spend continues, no changes. So Republicans at the end continue Biden budget. permalink parent award report block reply\nCruzControl 13 points 2 days ago It for real is. They are signing the Red House CR as is.\nThe filibuster heat was getting too hot for them to handle and they found dems that were not up for re-election in 2026. Thune did give them one thing which was a lot less than what we were worrying about. A separate vote on the ACA subsidies in December - will need 51 to pass as it is filibuster proof. Dems are going to try and pin the rise in ACA premiums on the GOP/Trump. permalink award report block reply MehNahMehNah 4 points 2 days ago Is this a scenario where JD may have to come in to cast a deciding vote? Or is it the other house? Obama care needs to be gutted and made pointless. If the US persists in providing some national federally funded 'healthcare' it needs to be tied to reform of all the supporting (or supported) systems. Insurance companies out of control. Big Pharma. Hospital billing and accounting practices. Medical certifications and oversight. permalink parent award report block reply datraceman 7 points 2 days ago The problem is once Obamacare passed they had a small window to get rid of it and fucking John McCain ruined it. Unless Republicans come up with actual legislation to replace Obamacare with something sensible we are stuck with it because once socialism leaks into your government, you can't get rid of it. See all our dumbass welfare policies. Social Security, welfare, SNAP, etc. Once Obamacare wasn't repealed soon after it passed, we were screwed. Now, it's how do you contain it and limit it. permalink parent award report block reply Glory-Unto-God 2 points 2 days ago Gutless permalink parent award report block reply TheThreeSeashells -1 points 2 days ago Unless Republicans come up with actual legislation to replace Obamacare with something sensible Rand Paul handed President Trump a perfect plan in his first term and it was completely ignored.  It doesn't even require them to go through the process of repealing Obamacare.  It simply allows credit unions and other membership organizations to offer healthcare to their members, giving them the ability to negotiate lower rates because they would have numbers on their side. This would offer a more affordable option than Obamacare which in theory could likely choke Obamacare to death over time.  More importantly, it opens healthcare to the free market and creates actual competition.  Not just the \"we're jacking up your rates again and there's nothing you can do about it\" situation we have right now. If only President Trump got over his petty squabbling with Rand, stopped listening to his advisors who have no plan, and just embraced Rand's plan, we would actually have a solution.  The anti-Rand crowd here needs to do the same.  If you want to bitch and moan about his stance on tariffs, fine.  But why throw out a great idea because you disagree on him regarding other issues?  That's moronic. SPEZ: ...and here comes the aforementioned morons with the downvotes. permalink parent award report block reply pollsarefake 1 points 2 days ago You sound like a faggot with TDS permalink parent award report block reply view 1 more comments...\nMehNahMehNah 4 points 2 days ago Is this a scenario where JD may have to come in to cast a deciding vote? Or is it the other house? Obama care needs to be gutted and made pointless. If the US persists in providing some national federally funded 'healthcare' it needs to be tied to reform of all the supporting (or supported) systems. Insurance companies out of control. Big Pharma. Hospital billing and accounting practices. Medical certifications and oversight. permalink parent award report block reply datraceman 7 points 2 days ago The problem is once Obamacare passed they had a small window to get rid of it and fucking John McCain ruined it. Unless Republicans come up with actual legislation to replace Obamacare with something sensible we are stuck with it because once socialism leaks into your government, you can't get rid of it. See all our dumbass welfare policies. Social Security, welfare, SNAP, etc. Once Obamacare wasn't repealed soon after it passed, we were screwed. Now, it's how do you contain it and limit it. permalink parent award report block reply Glory-Unto-God 2 points 2 days ago Gutless permalink parent award report block reply TheThreeSeashells -1 points 2 days ago Unless Republicans come up with actual legislation to replace Obamacare with something sensible Rand Paul handed President Trump a perfect plan in his first term and it was completely ignored.  It doesn't even require them to go through the process of repealing Obamacare.  It simply allows credit unions and other membership organizations to offer healthcare to their members, giving them the ability to negotiate lower rates because they would have numbers on their side. This would offer a more affordable option than Obamacare which in theory could likely choke Obamacare to death over time.  More importantly, it opens healthcare to the free market and creates actual competition.  Not just the \"we're jacking up your rates again and there's nothing you can do about it\" situation we have right now. If only President Trump got over his petty squabbling with Rand, stopped listening to his advisors who have no plan, and just embraced Rand's plan, we would actually have a solution.  The anti-Rand crowd here needs to do the same.  If you want to bitch and moan about his stance on tariffs, fine.  But why throw out a great idea because you disagree on him regarding other issues?  That's moronic. SPEZ: ...and here comes the aforementioned morons with the downvotes. permalink parent award report block reply pollsarefake 1 points 2 days ago You sound like a faggot with TDS permalink parent award report block reply view 1 more comments...\ndatraceman 7 points 2 days ago The problem is once Obamacare passed they had a small window to get rid of it and fucking John McCain ruined it. Unless Republicans come up with actual legislation to replace Obamacare with something sensible we are stuck with it because once socialism leaks into your government, you can't get rid of it. See all our dumbass welfare policies. Social Security, welfare, SNAP, etc. Once Obamacare wasn't repealed soon after it passed, we were screwed. Now, it's how do you contain it and limit it. permalink parent award report block reply Glory-Unto-God 2 points 2 days ago Gutless permalink parent award report block reply TheThreeSeashells -1 points 2 days ago Unless Republicans come up with actual legislation to replace Obamacare with something sensible Rand Paul handed President Trump a perfect plan in his first term and it was completely ignored.  It doesn't even require them to go through the process of repealing Obamacare.  It simply allows credit unions and other membership organizations to offer healthcare to their members, giving them the ability to negotiate lower rates because they would have numbers on their side. This would offer a more affordable option than Obamacare which in theory could likely choke Obamacare to death over time.  More importantly, it opens healthcare to the free market and creates actual competition.  Not just the \"we're jacking up your rates again and there's nothing you can do about it\" situation we have right now. If only President Trump got over his petty squabbling with Rand, stopped listening to his advisors who have no plan, and just embraced Rand's plan, we would actually have a solution.  The anti-Rand crowd here needs to do the same.  If you want to bitch and moan about his stance on tariffs, fine.  But why throw out a great idea because you disagree on him regarding other issues?  That's moronic. SPEZ: ...and here comes the aforementioned morons with the downvotes. permalink parent award report block reply pollsarefake 1 points 2 days ago You sound like a faggot with TDS permalink parent award report block reply view 1 more comments...\nGlory-Unto-God 2 points 2 days ago Gutless permalink parent award report block reply\nTheThreeSeashells -1 points 2 days ago Unless Republicans come up with actual legislation to replace Obamacare with something sensible Rand Paul handed President Trump a perfect plan in his first term and it was completely ignored.  It doesn't even require them to go through the process of repealing Obamacare.  It simply allows credit unions and other membership organizations to offer healthcare to their members, giving them the ability to negotiate lower rates because they would have numbers on their side. This would offer a more affordable option than Obamacare which in theory could likely choke Obamacare to death over time.  More importantly, it opens healthcare to the free market and creates actual competition.  Not just the \"we're jacking up your rates again and there's nothing you can do about it\" situation we have right now. If only President Trump got over his petty squabbling with Rand, stopped listening to his advisors who have no plan, and just embraced Rand's plan, we would actually have a solution.  The anti-Rand crowd here needs to do the same.  If you want to bitch and moan about his stance on tariffs, fine.  But why throw out a great idea because you disagree on him regarding other issues?  That's moronic. SPEZ: ...and here comes the aforementioned morons with the downvotes. permalink parent award report block reply pollsarefake 1 points 2 days ago You sound like a faggot with TDS permalink parent award report block reply view 1 more comments...\npollsarefake 1 points 2 days ago You sound like a faggot with TDS permalink parent award report block reply view 1 more comments...\nTNgirl4Trump 8 points 2 days ago I saw someone point out that the representatives who caved are not up for reelection. I don’t want Trump giving the lunatics one single thing. permalink award report block reply\nHairOfTheDoge 8 points 2 days ago Leftists are so retarded. Mad about the shutdown and now mad about it ending. permalink award report block reply TheThreeSeashells 5 points 2 days ago They were mad about it starting because their controllers told them to be mad.  They're mad about it ending for the same reason and because they're being told they got nothing out of it.  None of them will be able to actually tell you a legitimate reason why they were mad about either one. permalink parent award report block reply newuser8 2 points 2 days ago Firmware OTA updates dictate their every move permalink parent award report block reply Trubs 2 points 2 days ago You'd think they'd be more upset about their mutilated genitalia. permalink parent award report block reply YaharaRiver 0 points 2 days ago It’s funny as hell.  They have to repay any unemployment compensation they received 😂👍 AND catch up on two months of work piling up on their desk! permalink parent award report block reply\nTheThreeSeashells 5 points 2 days ago They were mad about it starting because their controllers told them to be mad.  They're mad about it ending for the same reason and because they're being told they got nothing out of it.  None of them will be able to actually tell you a legitimate reason why they were mad about either one. permalink parent award report block reply newuser8 2 points 2 days ago Firmware OTA updates dictate their every move permalink parent award report block reply\nnewuser8 2 points 2 days ago Firmware OTA updates dictate their every move permalink parent award report block reply\nTrubs 2 points 2 days ago You'd think they'd be more upset about their mutilated genitalia. permalink parent award report block reply\nYaharaRiver 0 points 2 days ago It’s funny as hell.  They have to repay any unemployment compensation they received 😂👍 AND catch up on two months of work piling up on their desk! permalink parent award report block reply\nbillybaldwin2 6 points 2 days ago Is this a new budget or a roll over of the last roll over that was the Dem's budget back in 2024? permalink award report block reply\nbriantrash 6 points 2 days ago Part of the deal is that all of the layoffs that occurred during the shutdown will be undone. permalink award report block reply SanityGumby 7 points 2 days ago So, the original CR. None of them would have been laid off if the CR passed originally. And the only promise is they won't be fired again until after January. A promise. Not law. It was unlikely Trump was going to do mass firings right before Thanksgiving and Christmas. permalink parent award report block reply\nSanityGumby 7 points 2 days ago So, the original CR. None of them would have been laid off if the CR passed originally. And the only promise is they won't be fired again until after January. A promise. Not law. It was unlikely Trump was going to do mass firings right before Thanksgiving and Christmas. permalink parent award report block reply\nDiversityhire 4 points 2 days ago Boo, was hoping we make it through the holidays permalink award report block reply pococurante 1 points 2 days ago I regret to inform you that we can't stop winning permalink parent award report block reply\npococurante 1 points 2 days ago I regret to inform you that we can't stop winning permalink parent award report block reply\nclownworld30330 4 points 2 days ago No, it’s the uniparty’s victory. All the inroads Trump made with blacks: gone over EBT. All the progress made by Trump with normies: lost to bad news coverage. permalink award report block reply LWGII 3 points 2 days ago That will all be forgotten by Christmas. permalink parent award report block reply clownworld30330 1 points 2 days ago Oh I hope so. permalink parent award report block reply TheThreeSeashells 1 points 2 days ago It will be forgotten before that.  The second the gibs start getting handed out, nobody is going to give a shit anymore. permalink parent award report block reply TrumpAndSimpsNotMAGA 1 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply\nLWGII 3 points 2 days ago That will all be forgotten by Christmas. permalink parent award report block reply clownworld30330 1 points 2 days ago Oh I hope so. permalink parent award report block reply TheThreeSeashells 1 points 2 days ago It will be forgotten before that.  The second the gibs start getting handed out, nobody is going to give a shit anymore. permalink parent award report block reply\nclownworld30330 1 points 2 days ago Oh I hope so. permalink parent award report block reply\nTheThreeSeashells 1 points 2 days ago It will be forgotten before that.  The second the gibs start getting handed out, nobody is going to give a shit anymore. permalink parent award report block reply\nTrumpAndSimpsNotMAGA 1 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply\nNADSAQ 3 points 2 days ago It’s an admission of culpability, at least. permalink award report block reply\ndaty_dato 3 points 2 days ago It's theater. They got what they wanted. Now before the rubes learn it's their fault, get it over with. permalink award report block reply\nPhantomShield72 3 points 2 days ago At least they're admitting who it was that was keeping the govt. shut down to begin with. I wanted it to stay shut down forever for all I care.  But I was getting sick of watching them rile up their base with the false claim that R's were the ones shutting it down. permalink award report block reply\nBullet3250 3 points 2 days ago And again.. Do those PROTESTING ... even know what or why they are protesting? Because I doubt it. All Rent a Mob tactics on the LEFT.... all day, every day.. permalink award report block reply\nHeavenlyTrumpets 3 points 2 days ago What compromise? I don't like that word. Dems weren't given anything in exchange for ending the shutdown were they? permalink award report block reply briantrash 3 points 2 days ago All of the layoffs that occurred during the shutdown will be undone. permalink parent award report block reply YaharaRiver 2 points 2 days ago Presto! Immediate end to their federal unemployment checks! AND if an employee is reinstated and receives back pay for the period they were laid off, they are required to repay the unemployment compensation (UC) benefits they received during that same period! Not the “big win” the dems think.  Now get to work, bitches, there’s two months of pile-up on your desk!! permalink parent award report block reply TheThreeSeashells 1 points 2 days ago there’s two months of pile-up on your desk!! Do you actually think they're going to work their asses off to catch up?  All that means is there will now be a permanent two month delay built-in to whatever it is they do. permalink parent award report block reply\nbriantrash 3 points 2 days ago All of the layoffs that occurred during the shutdown will be undone. permalink parent award report block reply YaharaRiver 2 points 2 days ago Presto! Immediate end to their federal unemployment checks! AND if an employee is reinstated and receives back pay for the period they were laid off, they are required to repay the unemployment compensation (UC) benefits they received during that same period! Not the “big win” the dems think.  Now get to work, bitches, there’s two months of pile-up on your desk!! permalink parent award report block reply TheThreeSeashells 1 points 2 days ago there’s two months of pile-up on your desk!! Do you actually think they're going to work their asses off to catch up?  All that means is there will now be a permanent two month delay built-in to whatever it is they do. permalink parent award report block reply\nYaharaRiver 2 points 2 days ago Presto! Immediate end to their federal unemployment checks! AND if an employee is reinstated and receives back pay for the period they were laid off, they are required to repay the unemployment compensation (UC) benefits they received during that same period! Not the “big win” the dems think.  Now get to work, bitches, there’s two months of pile-up on your desk!! permalink parent award report block reply TheThreeSeashells 1 points 2 days ago there’s two months of pile-up on your desk!! Do you actually think they're going to work their asses off to catch up?  All that means is there will now be a permanent two month delay built-in to whatever it is they do. permalink parent award report block reply\nTheThreeSeashells 1 points 2 days ago there’s two months of pile-up on your desk!! Do you actually think they're going to work their asses off to catch up?  All that means is there will now be a permanent two month delay built-in to whatever it is they do. permalink parent award report block reply\nSmurfection 3 points 2 days ago If you know anyone on EBT, SNAP or Medicaid who couldn't get their monthly benefits, you should show them that lefty Democrats are protesting their welfare benefits.  Show the that Democrats would rather feed illegals aliens, house illegal aliens and give healthcare to illegal aliens than to them.  Show them how unreliable \"compassionate\" Dems are.  Tell them that Dems buy votes to enrich themselves and their families.  They don't care about impoverished Americans.  They think impoverished Americans are trash. permalink award report block reply\nParticleCannon 3 points 2 days ago Protest that its shut down.  Protest that it ends. Do these people have jobs or are they just constant Protest temps? permalink award report block reply\npreferredfault 3 points 2 days ago It's all pre-planned theater, because Schumer needed a way out while still voting against it. Senator Kennedy predicted weeks ago that this is exactly what was going to happen. Trump should throw a hail mary and veto it anyways then demand even more concessions from Democrats. Keep this shit shutdown until Democrats cave on everything and more. permalink award report block reply\nChickensaurus 2 points 2 days ago No....lol. permalink award report block reply\nYodaBannon 2 points 2 days ago global cooling reeeeeeee!!!!!!! permalink award report block reply\nSavingPrivateGrace 2 points 2 days ago The nutjobs are protesting their own nutjobs and threatening to primary them. permalink award report block reply\nWI-Patriot 2 points 2 days ago Is this the first time R's didn't cave? permalink award report block reply\nkyle6969 2 points 2 days ago The government all fucking hate you. Trump included. If you do t see that yet…… permalink award report block reply\nRucktoe 2 points 2 days ago I have to give a small nod to the Rinos, for a brief moment in time they were not pussies. permalink award report block reply\nZskills 2 points 2 days ago No food for the rentoids if MS13 doesn't get free healthcare!!!  Because I am compassionate permalink award report block reply\nHoganP 2 points 2 days ago From things I've seen around the net this morning, the lefties are pissed. permalink award report block reply\nAndyCuomoIsAMobster 2 points 2 days ago Coincidentally, total coincidence, after the election cycle has ended. permalink award report block reply\nDRK00 1 points 2 days ago Its not so much an admission, its a carefully crafted way to make it look like the R's are still the bad guys, but that the D's will fall on the sword. permalink award report block reply\nFundadores 1 points 2 days ago Cracked like dogs! 😂 permalink award report block reply\nAgent_86 1 points 2 days ago Arctic blast? They ain't kidding lol. Ive got snow still coming down. My dogs love it lol. permalink award report block reply\nRachetQueen2020 1 points 2 days ago Even on the fed workers sub, they are crying about getting paid! I want to beat the ever loving shit out of each and every one of them. Fuck them. I want my money. permalink award report block reply\nThePatriotGames2016 1 points 2 days ago no. the only way to defeat them is unfortunately destroying everything about them. permalink award report block reply\nspezisacuckold 1 points 2 days ago Not much of a win when we're basically continuing a Pelosi budget / and Harris/Biden levels of spending. permalink award report block reply\nbluewhiteandred 1 points 2 days ago what impact will this have on the thought of nuking the filibuster permalink award report block reply\nnoPTSDforMePlease 1 points 2 days ago It's damage control. They want the illegals to think that Democrats were actually trying to get them healthcare but really it was about last week's elections. Those are over, so time for the government to open and the propaganda machine to kick in. permalink award report block reply\nOmegaBird 1 points 2 days ago Fuck Demoncrats. Not literally as they are all SDI riddled degenerates. But figuratively. permalink award report block reply\nSoyLatte 1 points 2 days ago Best part is Fetterman is one of the dems that voted Also, surprising, Tim Kaine. permalink award report block reply\nitspancakees 1 points 2 days ago A Republican president with a backbone is something many people alive today have never seen permalink award report block reply\nNonbinaryPotatohead 1 points 2 days ago They forced everyone to buy car insurance and made it illegal to drive without it. They tried to force everyone to have health insurance and wanted to make it illegal to breathe without it. When the government forces you to buy into corporate scams on a large scale that's how you know the US is also a corporation.\nThe new enterprise. \"Annuit Coeptis...Novos Ordo Seclorum.\" Not all is doomed. The faster we can get enough true believing Americans in these seats we can get rid of all this bullshit. It's just a numbers game that unfortunately does cost billionaire funding to win. permalink award report block reply\nNasty_Savage 1 points 2 days ago They got what they wabted in the elections. The other stuff was a distraction no one was buying permalink award report block reply\nWexit-Delecto 1 points 2 days ago WTF I don’t like shutdowns now! permalink award report block reply\nAlohaSnackbar 1 points 2 days ago If anyone thinks these 8 acted without orders from their Democrat overlords, I have a bridge for sale. Everyone knows that this type of \"caving\" was done via leadership selecting those that either needed to be seen as compromising -or- those that are so secure that the blowback from their base could be weathered. It's all theater, and frankly the WWF does it better.  (And yes, I know it's the WWE, but fuck forced renaming). permalink award report block reply\nkeeman 0 points 2 days ago Yes.  America loses.  We need to gut the budget and we are strong arming Dems to pass another extension of Biden's insane levels of spending. permalink award report block reply\nSegAtari -2 points 2 days ago Admission of defeat? Bwahaha!\nThis is just kabuki theater. The only ones who got “defeated” with this compromise are those of us who actually want to fix our broken system.\nThis is just another dancing puppet show that allows the globalists and their elitist shill boyfriends to continue screwing this country over all while convincing the plebes that they’re “fighting to save it”.\nWake me up when the guillotines and scaffolds are actually being built. permalink award report block reply\nEyesSewnShut 1 points 2 days ago Comment removed by community moderators. permalink award report block reply"}