{"id": "8180166", "contents": "1726 The real jan 6th story. posted 2 days ago by wst4 161 comments award share download report block\n161 comments Sort by Top Top New Worst Old Save Ghost_Soul167 132 points 2 days ago More than 1 person died that day.   Ashli Babbit was murdered by that Sgt of Arms that's got his hand on that faggot Micheal Fanone in the pic, Rosanne Boyland was beaten to death by a female metro pd officer whose name escapes me, then there were two men who had heart attacks and died after being hit and sprayed.  There might be more but those were the ones we found in the body camera and surveillance footage we were given as part of our brady rights. permalink award report block reply scottcaver1 57 points 2 days ago All correct, but that isnt the offocer that killed Babbit. His name was Byrd and he was shorter(?) And darker amd had a more round head. Idk who the the guy in this pic is. permalink parent award report block reply GarbageLivesMatter 20 points 2 days ago Murderer Michael Bryd quickly retired after the murder and the UniParty took care of him afterwards and he is living a nice life in retirement. permalink parent award report block reply BigMikesChef 6 points 2 days ago Wasn't he promoted first? Despite also having left his firearm on a public bathroom sink where kids were touring the building. permalink parent award report block reply GarbageLivesMatter 3 points 2 days ago A real dirtbag for sure. permalink parent award report block reply Shitsbrokeyo 9 points 2 days ago Micheal Byrd permalink parent award report block reply CleanUpPhillyTrump24 7 points 2 days ago What was the name of this black mad cow that beat Rosanne Boyland to death? https://x.com/DineshDSouza/status/1620139528685260800?lang=en Warning: graphic. permalink parent award report block reply Mikespenis123 1 points 2 days ago and Byrd has a worm crawling around under his forehead... permalink parent award report block reply PleaseHonk 41 points 2 days ago Faggot Fanone with the prison tatts, begged Joe Biden’s auto pen for a pardon, and GOT ONE. GUILTY AS FUCK. J6 sham committee suppressed video of him from J6 laughing it up, but he went to every Conservative J6 trial, lied and testified how he almost died, demanded the judge throw the peaceful protester in a Gulag for life. Faggot Fanone is as Evil as it gets permalink parent award report block reply cyberwar 13 points 2 days ago the black guy is the real evil scumbag, he bullied and probably killed police officers that didn't want to lie permalink parent award report block reply Rudy_DankMemer 2 points 2 days ago Faggot Fanone is as Evil as it gets We don't hate the derp state enough. permalink parent award report block reply CleanUpPhillyTrump24 1 points 2 days ago Autopen. permalink parent award report block reply snoopy3210 1 points 2 days ago permalink parent award report block reply cyberwar 20 points 2 days ago exactly, always enrages me when our side posts \"Babbit was the only person that died that day\" what the fuck! permalink parent award report block reply Suckitreddit 6 points 2 days ago And a man died too…in a crush of people, or heart attack or tear gassed or hit with a rubber bullet… I thought he was somewhat close to the beating tunnel. That’s why they hide the videos…they are still out there permalink parent award report block reply snoopy3210 2 points 2 days ago There’s the good black capitol police who said the other ones refused to lock the chambers doors!!! He wasnt called to work that day. He locked the house chamber that two other capitol officers tried to open for Qanon shaman permalink parent award report block reply Suckitreddit 1 points 2 days ago So many good people tricked that day. I hope they live to see judgement here on earth. And then judgement after. Nancy et al permalink parent award report block reply Skogin 2 points 2 days ago flashbang to the chest permalink parent award report block reply Rob55 4 points 2 days ago Officer that shot Babbit was Byrd, not in pic. You forgot about the 4 capital police officers that died by “suicide” after J6 permalink parent award report block reply Ghost_Soul167 2 points 2 days ago No, I didn't, I actually had an interaction with Freitag who was the first to \"kill himself\".  He had apologized to me after a random officer smashed my hand for having it on the rail, and said it was wrong for the officer to have done.  I had been joking around with him about being officer Friday.  Pretty sure permalink parent award report block reply PatriotDescendant 2 points 2 days ago Yes, that flattened reading \"only 1\"... permalink parent award report block reply load 8 more comments... B0bE 61 points 2 days ago Rosanne Boyland permalink award report block reply NamendaBiden 32 points 2 days ago Came to post this.  She was also killed that day.  Beaten to death by the Capitol or DC Metro Police. permalink parent award report block reply blitzkrieg1 2 points 2 days ago Exactly. https://patriots.win/p/1ARK5BIEzx/roseanne-boyland-was-beaten-to-d/c permalink parent award report block reply War_Hamster 29 points 2 days ago I've met Ashli Babbit's Mom Micki a few times and consider her a friend. To her credit, the wrist bands she's been handing out since 2022 include Rosanne's name on them.  She switched from \"Justice for Ashli\" to \"Justice for J6\". permalink parent award report block reply bck- 16 points 2 days ago Had no idea about her. Went to google, first result is some gay CBS news article from 2021 that says she “suffered a medical emergency.” Went to Twitter and found the video of her being clubbed in the head as she lay faced down. I cannot believe that this wasn’t a bigger story. Also turns out the officer doing the clubbing is a black woman? Unbelievable permalink parent award report block reply NonbinaryPotatohead 4 points 2 days ago likely not even a cop like these goofballs in the picture. All paid actors given a license to violence. permalink parent award report block reply Quidnunc 2 points 2 days ago the media tried to say that Roseanne died of an overdose. but too many people saw the black female cop beating her with the baton even after she was dead. Patriots dragged her body away from her and tried to do CPR. not sure what happened to the cop. probably got a raise and a medal. permalink parent award report block reply StoopidAsshole69 32 points 2 days ago Guys this isn’t funny. AOC was almost raped and murdered. permalink award report block reply NamendaBiden 19 points 2 days ago Its true.  She was in a completely different building, but she could totally imagine what it would have been like. permalink parent award report block reply Rock9Head 14 points 2 days ago You mean fantasize about. permalink parent award report block reply rebuildingMyself 6 points 2 days ago The idea of being able to bring that up in every speech from now until she retires was making her so excited she convinced herself it actually nearly happened permalink parent award report block reply Rock9Head 2 points 2 days ago If only they all could have achieved an erection. permalink parent award report block reply Major_Nutt 0 points 2 days ago The vast majority of rape victims orgasm during the event. permalink parent award report block reply MAGALADON9 10 points 2 days ago Folding her chubby lil arms pouting \"why is no one raping me!\" Her and her ridiculously white bf (BWC) role-play in the bedroom - cortez and Aztec princess, or some variations. permalink parent award report block reply 1_Badcop 2 points 2 days ago Pede, I did not need that visual permalink parent award report block reply MAGALADON9 4 points 2 days ago Be glad I didn't describe Lady G (Lindsey) permalink parent award report block reply view 1 more comments... Hanging_Chad 1 points 2 days ago Big White Cock? permalink parent award report block reply MAGALADON9 2 points 2 days ago Yep Sooo many squad types can't keep their hands off these Washington monument white guys.   I'll Illhan Omar, AOC, Kamala Harris, and many more. JDs wife a democrat before switched parties and went with the country white boy. Bill DeBlasio's wife was a big activist but stopped ranting about white people long enough to marry one.  It goes on and on https://m.youtube.com/watch?v=SlGFzeacyr0 permalink parent award report block reply view 1 more comments... drattastic1 1 points 2 days ago Isn't he, like most beta cucks, actually gay? permalink parent award report block reply MAGALADON9 1 points 2 days ago He does give off soy vibes but ya never know many people prefer the opposite sexually in terms of top/bottom dom/sub.   CEOs and powerful people often feel it is a relief to be totally submissive.  As for women forced by society to play a more masculine role eg. \"Girl Boss.... corner office... cut throat shark etc\" even professional female dommes (and I was a fixture in that world for years) don't actually like their subs and slaves. I mean they won't say it obviously it's their money - but I've had close relationships with many and 100% them are at least \"switchy\"...  Anyway who knows. She is publicly humiliating him often saying things like \"i don't know I often feel like a traitor dating a white man and considered if I should\"  --- whoooo boy I'd be a fucking ghost that night if a woman  said something  like that to me - on camera- for the world. Yeah no drama just echoes and dust. permalink parent award report block reply barefootozark 1 points 2 days ago And Kamala had to leave the Capital.  (She didn't . She was at the DNC with the pipe bomb stage prop.) permalink parent award report block reply Tele_Plus 0 points 2 days ago Thankfully Rep. Jason Crow remembered his Army Ranger training and was going to fight off everyone with a pen! permalink parent award report block reply Bohemyth_2 27 points 2 days ago The real reason pelosi is retiring That hag would feinstein herself rather than leave permalink award report block reply LaVaughnRobinson 3 points 2 days ago Still waiting for her daughters audio/video from that day.  She was there making a fakumentary about it all...amazing right. permalink parent award report block reply RememberCharlieKirk 3 points 2 days ago Nancy Pelosi's control of the Democrat Party is slightly diminishing, or rather challenged more in public; she must take such great offense to that change. permalink parent award report block reply MEME-SUPREME 23 points 2 days ago Democrats said it was worse than 9/11 The cover up continues. permalink award report block reply peterthegreen 14 points 2 days ago J6 WAS worse than 9/11, in reference to the government coup that was orchestrated by the Uniparty to install the illegitimate Autopen Regime, leading to persecution of patriots and the massive invasion of our country. Those responsible have yet to be held to account and efforts to undo the damage have been stymied by that same Uniparty and their Deep State operatives still carrying out their mission to destroy our Constitutional Republic. permalink parent award report block reply N0rds 4 points 2 days ago You think 9-11 didn't have government coup type meddling? The government 100% had a hand in those towers coming down. So they could hide the missing trillions, push the patriot act bullshit, and start to enact the globalism bullshit we see now. permalink parent award report block reply Skogin 1 points 2 days ago Our fren said J6 was worse government meddling. Although this may not have been obvious during the media onslaught, it is becoming inescapable: 9/11 scapegoated foreigners to destroy their lives, J6 smeared the majority of Americans to directly destroy our lives. permalink parent award report block reply punkalicious 6 points 2 days ago IT WAS WORSE THAN 10X THE HALL OF COSTS. Haha, just kidding. Abortion killed 60M. permalink parent award report block reply N0rds 1 points 2 days ago Oy vey, the antisemitisms!!!! Mocking the 60 million Jews who got sent on rollercoasters that ended in a fire pit is nothing to laugh about!!! For you to mock the 600 million Jews who were genocided by masturbation machines attached to their cut penises, is literally worse than what Hitler did to those poor 6 billion Jews during the Holocaust!!!!! permalink parent award report block reply punkalicious 1 points 2 days ago Hang on, I can barely read this. Let me turn on the lamp. That shade... permalink parent award report block reply MAGALADON9 18 points 2 days ago Jesus people Rosanne Boyland Was bludgeoned to death by a sheboon cop with a club. permalink award report block reply brainphreeze 13 points 2 days ago This has to be the easiest case for useless Bondi Kash and Bongino to go after Will they actually do anything? permalink award report block reply MAG-n-KAG 7 points 2 days ago there are easier things, and they still refuse to get off their asses.  i doubt they'll do anything about this.  id love to be proven wrong tho. permalink parent award report block reply TrumpAndGodWin 2 points 2 days ago Alex Jones said it again Sunday that Kash is compromised and living with a gay billionaire in Vegas. permalink parent award report block reply N0rds 1 points 2 days ago She's busy getting her hair done, to prep for another fox news interview. She has WAY more important things to do than fight for the American people.... permalink parent award report block reply airborne3502 13 points 2 days ago Yes, senators had objections to the election results. All of this was to table those objections so that later on Mike Pence could decide not to send the disputed electors back to the states for another look. \"Since there are no objections.\" Yeah, because they were tabled due to the events of January 6th. That was the end game. Pence was proud of his role in certifying the stolen election and gave Nancy Pelosi an elbow bump. permalink award report block reply FatigueIsReal 2 points 2 days ago I'll add.  More objections than any other election in history. permalink parent award report block reply War_Hamster 12 points 2 days ago This is an accurate summary, but what's missing is how Nancy Pelosi reconvened Congress under special rules that didn't allow for challenging the electors. I'm sure that was just a coincidence.... permalink award report block reply brutustyberius 2 points 2 days ago Or the J6 committee she illegally appointed without Republican selected representation (Nancy appointed Liz and Kitlinger). permalink parent award report block reply War_Hamster 1 points 2 days ago Agreed that it was an illegal committee, but the absence of an honest Republican (if one exists) allowed the J6 committee to manufacture and destroy evidence with no oversight. Double-edged sword. permalink parent award report block reply twentytwentyfourr 10 points 2 days ago not hard to blackmail a guy who has a giant swastika tattooed on his neck permalink award report block reply Smurfection 8 points 2 days ago Roseann Boyland was beaten to death by a black female cop.  Then to cover their tracks they defamed her as a drug addicts burn out. permalink award report block reply Psalm-118_24 8 points 2 days ago And they are responsible for other deaths...Matthew Perna, J6er committed suicide while waiting on sentencing.  Capitol Police Officer Howard Liebengood and MPD Officer Jeffrey Smith, 2 officers who responded to J6 \"committed suicide\".  Kyle DeFreytag, MPD, died of \"suicide\" the following July. permalink award report block reply Maga305_47 7 points 2 days ago Missed an awful lot of crying about it too… permalink award report block reply Aggrieved03 7 points 2 days ago Probably suicided officers who were coming forward. permalink award report block reply brutustyberius 2 points 2 days ago We’ve got a Bingo! permalink parent award report block reply buckeyeminuteman 6 points 2 days ago Roseanne Boyland was beaten to death by a Capitol police woman wielding a baton. permalink award report block reply Payasyougo 6 points 2 days ago Several police reportedly committed \"suicide\" for what they endured that day. permalink award report block reply XlDEN 3 points 2 days ago Yes, while others were promoted. The pipe bomber got a job at the CIA. permalink parent award report block reply Female 5 points 2 days ago The getting away with it part permalink award report block reply Herpawinski 5 points 2 days ago Unless the Capital Police captain lied, it wasn't the capital police behind it. There was a conspiracy but most of them were in the dark. I saw (posted here) video of an undercover telling a guard in the capital that \"friendlies\" would have colored wristbands (any color) and striped decals on their guns. On their guns. A short time later Ashley Babbit was shot by member of a security detail. The killer's hand is seen in the video. He has a bunch of colored wristbands (weird for a security guard) and his gun has a striped decal on it, showing that he's a \"friendly\". But he's security and in a suit. Why the hell would he need to signify to anyone that he's a \"friendly\"? He wouldn't, unless \"friendly\" doesn't mean undercover police, but something else. permalink award report block reply Prof_Smith 5 points 2 days ago Scum.  All of them are scum. permalink award report block reply Payasyougo 4 points 2 days ago Supposed ultra mega maga trump voter and Oath Keepers leader Ray Epps was only given probation for what he did that day. Epps stated that he experienced a \"life-changing reality shift\" when the \"Trump cult\" turned on him and his wife. permalink award report block reply CommieCucker 1 points 2 days ago \"We need to go... INSIDE the Capitol! We gotta insurrect this shit!\" permalink parent award report block reply TrumpAndSimpsNotMAGA 0 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply OldZilla 4 points 2 days ago And these Lying MFers coverrd it up. https://www.nytimes.com/2021/01/28/us/capitol-riot-woman-trampled.html permalink award report block reply Goatboy66 4 points 2 days ago Watch the Video \"EVERYTHING WRONG WITH THE CAPITAL SHOOTING IN TWENTY ONE MINUTES OR LESS\" permalink award report block reply SoulSnipper 4 points 2 days ago Fanone belongs in prison permalink award report block reply Prandogolio 3 points 2 days ago He would love it there permalink parent award report block reply SoulSnipper 2 points 2 days ago He's a catcher not a pitcher, they'd be lining up. He'd drop the soap on purpose... permalink parent award report block reply phro 3 points 2 days ago This makes me question the entire Ashlii Babbit thing too https://rumble.com/v3rv9o1-everything-wrong-with-the-capitol-shooting-in-21-minutes-or-less.html permalink award report block reply Southernwhitebread2 2 points 2 days ago Best video interpretation of that incident. She was air force intelligence prior. Supposed to have worked at a Maryland nuclear power plant and was investigating a terror attack while working there with her first husband. permalink parent award report block reply Southernwhitebread2 1 points 2 days ago https://www.podbean.com/ea/pb-uzvuc-1070c9c permalink parent award report block reply Chancho69 3 points 2 days ago we’re hung by the neck after a military tribunal? permalink award report block reply Retard_Strength 3 points 2 days ago • are faggots permalink award report block reply BoricuaPede 3 points 2 days ago You're missing how to spell \"waved\" like a giant retard. permalink award report block reply MemoryHoleyeO 2 points 2 days ago And the suicides! Need to reupload permalink award report block reply MAG-n-KAG 2 points 2 days ago Also the 4 Capitol Police officers that got \"suicided\" in the following 3-4 weeks. permalink award report block reply GarbageLivesMatter 2 points 2 days ago What did the UniParty do with Epps?  Is he in a safe house somewhere or living the good life in Arizona?  I'm surprised the Deep State haven't killed him yet. permalink award report block reply Crappydatum 2 points 2 days ago They'll give him a pair of glasses and no one will recognize him permalink parent award report block reply Rucktoe 2 points 2 days ago You missed the part where they silenced and jailed those they accused of wrongdoing. permalink award report block reply hrswift 2 points 2 days ago Only missed one thing: piglousy was able to call the election for bidumb because of the chaos they created permalink award report block reply Faintlight 2 points 2 days ago Fed Epps permalink award report block reply gaijin_ronin 2 points 2 days ago All four should be dead but since they played their roles a golden parachute came their way. permalink award report block reply RedCapNation 2 points 2 days ago All four in that picture need to be hung in public permalink award report block reply Somebody157 2 points 2 days ago Yes , your missing the end of the story which has not happened yet. My ending: The lairs, murderers get hung by the neck in a public execution. permalink award report block reply TrumpAndSimpsNotMAGA 1 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply Somebody157 1 points 2 days ago Leftist conspiracy theory lol. permalink parent award report block reply Sunnybats2 2 points 2 days ago Forgot at least three others killed by the pigs not just Ashli permalink award report block reply Female 2 points 2 days ago They tried to take our right to peaceful assembly away from us. We need to have peaceful assemblies again permalink award report block reply ArnoldF 2 points 2 days ago The capital police killed three other patriots that day. permalink award report block reply RedWave26 2 points 2 days ago Yes they blocked off the side streets on Constitution and Pennsylvania Avenues to force the entire crowd to the Capitol. permalink award report block reply mencheIke 2 points 2 days ago Ashli wasn't the only one killed that day, they killed that woman with billy clubs and it was on camera. Roseane Boyland permalink award report block reply BecauseYoudBeInJail 2 points 2 days ago https://www.youtube.com/watch?v=jV6XDoZ9_8I permalink award report block reply CySailor 2 points 2 days ago You forgot \"Received preemptive Presidential Pardons\"... No wait, guess they didn't. permalink award report block reply Krat 2 points 2 days ago You forgot the part where 0 of them were arrested after hunting down regular Americans and locked them up unconstitutionally violating the core tennets of freedom permalink award report block reply Prandogolio 2 points 2 days ago Communism permalink award report block reply PatriotSkorzeny 2 points 2 days ago They have qualified immunity. They are brave brave men. Heroes all. 🤭 permalink award report block reply Oodles 2 points 2 days ago Cops are not your friends permalink award report block reply josiborg 2 points 2 days ago They also helped kill and cover up the murder of Seth Rich permalink award report block reply phil_d_snutz 1 points 2 days ago bAcK tEh bLuE, right guys? 👎 permalink award report block reply barefootozark 1 points 2 days ago Yes, you are missing something.  Who build the fake and gay gallows? Just another thing that is videos and cell data is available to determine... but we can't figure it out. permalink award report block reply goatnuts 1 points 2 days ago Yes, youre missing something, the arkancide of Vince Foster. permalink award report block reply seattlerunner 1 points 2 days ago The guy with the beard, third from the left looks like an Antifa member. He always seemed to seedy and scummy for the dignity that position should entail. permalink award report block reply Crappydatum 1 points 2 days ago He's covered in tattoos that I'd like to have analysed permalink parent award report block reply ShadowInv 1 points 2 days ago Security guards led protestors to rooms and unlocked them (horned guy?) permalink award report block reply Michalusmichalus 1 points 2 days ago The police that tried to speak up kept dying. permalink award report block reply dukeofdoorcounty 1 points 2 days ago Nicely took down and rolled up 3 rings of plastic snow fence (they left the metal posts up). permalink award report block reply Dev404 1 points 2 days ago Capital punishment of not just those officers involved in setting up J6, but those in Congress, is needed as well. These amateur false flaggers need to be taught a permanent lesson instead of walking around freely and continuing their lies. Waiting on Kash and Bondi to do something about anything that has real substance. Still. permalink award report block reply HaSumBro 1 points 2 days ago They cut open tarps permalink award report block reply MatterThatMetals 1 points 2 days ago Bad cops suck. permalink award report block reply Clarice357 2 points 2 days ago Cops do what they are told to do.  Someone directed all this. permalink parent award report block reply BoberFett 1 points 2 days ago The Republicans after January 6th: Do nothing permalink award report block reply Urinetensions 1 points 2 days ago Wasn't Fannone banging Kathy Griffin at one point? permalink award report block reply Konsaki 1 points 2 days ago Just posting this for historical context: https://en.wikipedia.org/wiki/Praetorian_Guard https://en.wikipedia.org/wiki/Category:Roman_emperors_murdered_by_the_Praetorian_Guard permalink award report block reply Crappydatum 1 points 2 days ago Judas Pence contributing permalink award report block reply Megaboom2025 1 points 2 days ago How many undercover feds were there? permalink award report block reply FreedomLubber 1 points 2 days ago Autopen pardons permalink award report block reply PatrioticVideo 1 points 2 days ago ...answeed directly to the Speaker. permalink award report block reply DRKMSTR 1 points 2 days ago Capitol police tried to overthrow the government? permalink award report block reply ACActual 1 points 2 days ago 4 Patriots were murdered on January 6th permalink award report block reply nzsvz9 1 points 2 days ago Are proof that anyone with a left leaning, even in the slightest, cannot be objective. And are politically motivated leftists. permalink award report block reply knnbccb 1 points 2 days ago Treason not punished by death will return in another season. permalink award report block reply Stallion 1 points 2 days ago \"Suicides\" any officer who they thought might blow the whistle permalink award report block reply try4gain PRO 1 points 2 days ago there is literally video of cops standing by chilling while people walk into the Capital peacefully. permalink award report block reply posedgeclk 1 points 2 days ago Waived? Lol. permalink award report block reply Crappydatum 2 points 2 days ago Capitol police on in ? permalink parent award report block reply doodaddy 1 points 2 days ago some of them.  there is the black officer in the one video that says, \"we've been set up.\"  seems it always works this way.  you can't keep 100s of people on the script. permalink award report block reply friedchicken 1 points 2 days ago Yes, you are missing why and to what end permalink award report block reply Magaman4200 1 points 2 days ago PLUS they used it as an excuse for tyranny … ALL that after STEALING the election … permalink award report block reply matt11707 1 points 2 days ago harry dunn wrote a book, that was filled with lies and run for congess and lost. permalink award report block reply DITTOPatriot 1 points 2 days ago The part that is missing is that Kash and Bondi are covering it up. permalink award report block reply 2FBIAgents1Cup 1 points 2 days ago Yeah....Roseanne Boyland and two men who were clubbed into comas.... permalink award report block reply MyBallsAreRough 1 points 2 days ago Yes, broke windows and urged people to enter through broken windows permalink award report block reply NonbinaryPotatohead 0 points 2 days ago Makes you kind of wonder what is real in our history books. permalink award report block reply USNVET71 -1 points 2 days ago Those four losers in the picture need to be convicted of sedition, and they need to spend the rest of their miserable fucking lives in prison. They are traitors to this nation. permalink award report block reply\nGhost_Soul167 132 points 2 days ago More than 1 person died that day.   Ashli Babbit was murdered by that Sgt of Arms that's got his hand on that faggot Micheal Fanone in the pic, Rosanne Boyland was beaten to death by a female metro pd officer whose name escapes me, then there were two men who had heart attacks and died after being hit and sprayed.  There might be more but those were the ones we found in the body camera and surveillance footage we were given as part of our brady rights. permalink award report block reply scottcaver1 57 points 2 days ago All correct, but that isnt the offocer that killed Babbit. His name was Byrd and he was shorter(?) And darker amd had a more round head. Idk who the the guy in this pic is. permalink parent award report block reply GarbageLivesMatter 20 points 2 days ago Murderer Michael Bryd quickly retired after the murder and the UniParty took care of him afterwards and he is living a nice life in retirement. permalink parent award report block reply BigMikesChef 6 points 2 days ago Wasn't he promoted first? Despite also having left his firearm on a public bathroom sink where kids were touring the building. permalink parent award report block reply GarbageLivesMatter 3 points 2 days ago A real dirtbag for sure. permalink parent award report block reply Shitsbrokeyo 9 points 2 days ago Micheal Byrd permalink parent award report block reply CleanUpPhillyTrump24 7 points 2 days ago What was the name of this black mad cow that beat Rosanne Boyland to death? https://x.com/DineshDSouza/status/1620139528685260800?lang=en Warning: graphic. permalink parent award report block reply Mikespenis123 1 points 2 days ago and Byrd has a worm crawling around under his forehead... permalink parent award report block reply PleaseHonk 41 points 2 days ago Faggot Fanone with the prison tatts, begged Joe Biden’s auto pen for a pardon, and GOT ONE. GUILTY AS FUCK. J6 sham committee suppressed video of him from J6 laughing it up, but he went to every Conservative J6 trial, lied and testified how he almost died, demanded the judge throw the peaceful protester in a Gulag for life. Faggot Fanone is as Evil as it gets permalink parent award report block reply cyberwar 13 points 2 days ago the black guy is the real evil scumbag, he bullied and probably killed police officers that didn't want to lie permalink parent award report block reply Rudy_DankMemer 2 points 2 days ago Faggot Fanone is as Evil as it gets We don't hate the derp state enough. permalink parent award report block reply CleanUpPhillyTrump24 1 points 2 days ago Autopen. permalink parent award report block reply snoopy3210 1 points 2 days ago permalink parent award report block reply cyberwar 20 points 2 days ago exactly, always enrages me when our side posts \"Babbit was the only person that died that day\" what the fuck! permalink parent award report block reply Suckitreddit 6 points 2 days ago And a man died too…in a crush of people, or heart attack or tear gassed or hit with a rubber bullet… I thought he was somewhat close to the beating tunnel. That’s why they hide the videos…they are still out there permalink parent award report block reply snoopy3210 2 points 2 days ago There’s the good black capitol police who said the other ones refused to lock the chambers doors!!! He wasnt called to work that day. He locked the house chamber that two other capitol officers tried to open for Qanon shaman permalink parent award report block reply Suckitreddit 1 points 2 days ago So many good people tricked that day. I hope they live to see judgement here on earth. And then judgement after. Nancy et al permalink parent award report block reply Skogin 2 points 2 days ago flashbang to the chest permalink parent award report block reply Rob55 4 points 2 days ago Officer that shot Babbit was Byrd, not in pic. You forgot about the 4 capital police officers that died by “suicide” after J6 permalink parent award report block reply Ghost_Soul167 2 points 2 days ago No, I didn't, I actually had an interaction with Freitag who was the first to \"kill himself\".  He had apologized to me after a random officer smashed my hand for having it on the rail, and said it was wrong for the officer to have done.  I had been joking around with him about being officer Friday.  Pretty sure permalink parent award report block reply PatriotDescendant 2 points 2 days ago Yes, that flattened reading \"only 1\"... permalink parent award report block reply load 8 more comments...\nscottcaver1 57 points 2 days ago All correct, but that isnt the offocer that killed Babbit. His name was Byrd and he was shorter(?) And darker amd had a more round head. Idk who the the guy in this pic is. permalink parent award report block reply GarbageLivesMatter 20 points 2 days ago Murderer Michael Bryd quickly retired after the murder and the UniParty took care of him afterwards and he is living a nice life in retirement. permalink parent award report block reply BigMikesChef 6 points 2 days ago Wasn't he promoted first? Despite also having left his firearm on a public bathroom sink where kids were touring the building. permalink parent award report block reply GarbageLivesMatter 3 points 2 days ago A real dirtbag for sure. permalink parent award report block reply Shitsbrokeyo 9 points 2 days ago Micheal Byrd permalink parent award report block reply CleanUpPhillyTrump24 7 points 2 days ago What was the name of this black mad cow that beat Rosanne Boyland to death? https://x.com/DineshDSouza/status/1620139528685260800?lang=en Warning: graphic. permalink parent award report block reply Mikespenis123 1 points 2 days ago and Byrd has a worm crawling around under his forehead... permalink parent award report block reply\nGarbageLivesMatter 20 points 2 days ago Murderer Michael Bryd quickly retired after the murder and the UniParty took care of him afterwards and he is living a nice life in retirement. permalink parent award report block reply BigMikesChef 6 points 2 days ago Wasn't he promoted first? Despite also having left his firearm on a public bathroom sink where kids were touring the building. permalink parent award report block reply GarbageLivesMatter 3 points 2 days ago A real dirtbag for sure. permalink parent award report block reply\nBigMikesChef 6 points 2 days ago Wasn't he promoted first? Despite also having left his firearm on a public bathroom sink where kids were touring the building. permalink parent award report block reply GarbageLivesMatter 3 points 2 days ago A real dirtbag for sure. permalink parent award report block reply\nGarbageLivesMatter 3 points 2 days ago A real dirtbag for sure. permalink parent award report block reply\nShitsbrokeyo 9 points 2 days ago Micheal Byrd permalink parent award report block reply\nCleanUpPhillyTrump24 7 points 2 days ago What was the name of this black mad cow that beat Rosanne Boyland to death? https://x.com/DineshDSouza/status/1620139528685260800?lang=en Warning: graphic. permalink parent award report block reply\nMikespenis123 1 points 2 days ago and Byrd has a worm crawling around under his forehead... permalink parent award report block reply\nPleaseHonk 41 points 2 days ago Faggot Fanone with the prison tatts, begged Joe Biden’s auto pen for a pardon, and GOT ONE. GUILTY AS FUCK. J6 sham committee suppressed video of him from J6 laughing it up, but he went to every Conservative J6 trial, lied and testified how he almost died, demanded the judge throw the peaceful protester in a Gulag for life. Faggot Fanone is as Evil as it gets permalink parent award report block reply cyberwar 13 points 2 days ago the black guy is the real evil scumbag, he bullied and probably killed police officers that didn't want to lie permalink parent award report block reply Rudy_DankMemer 2 points 2 days ago Faggot Fanone is as Evil as it gets We don't hate the derp state enough. permalink parent award report block reply CleanUpPhillyTrump24 1 points 2 days ago Autopen. permalink parent award report block reply snoopy3210 1 points 2 days ago permalink parent award report block reply\ncyberwar 13 points 2 days ago the black guy is the real evil scumbag, he bullied and probably killed police officers that didn't want to lie permalink parent award report block reply\nRudy_DankMemer 2 points 2 days ago Faggot Fanone is as Evil as it gets We don't hate the derp state enough. permalink parent award report block reply\nCleanUpPhillyTrump24 1 points 2 days ago Autopen. permalink parent award report block reply snoopy3210 1 points 2 days ago permalink parent award report block reply\nsnoopy3210 1 points 2 days ago permalink parent award report block reply\ncyberwar 20 points 2 days ago exactly, always enrages me when our side posts \"Babbit was the only person that died that day\" what the fuck! permalink parent award report block reply Suckitreddit 6 points 2 days ago And a man died too…in a crush of people, or heart attack or tear gassed or hit with a rubber bullet… I thought he was somewhat close to the beating tunnel. That’s why they hide the videos…they are still out there permalink parent award report block reply snoopy3210 2 points 2 days ago There’s the good black capitol police who said the other ones refused to lock the chambers doors!!! He wasnt called to work that day. He locked the house chamber that two other capitol officers tried to open for Qanon shaman permalink parent award report block reply Suckitreddit 1 points 2 days ago So many good people tricked that day. I hope they live to see judgement here on earth. And then judgement after. Nancy et al permalink parent award report block reply Skogin 2 points 2 days ago flashbang to the chest permalink parent award report block reply\nSuckitreddit 6 points 2 days ago And a man died too…in a crush of people, or heart attack or tear gassed or hit with a rubber bullet… I thought he was somewhat close to the beating tunnel. That’s why they hide the videos…they are still out there permalink parent award report block reply snoopy3210 2 points 2 days ago There’s the good black capitol police who said the other ones refused to lock the chambers doors!!! He wasnt called to work that day. He locked the house chamber that two other capitol officers tried to open for Qanon shaman permalink parent award report block reply Suckitreddit 1 points 2 days ago So many good people tricked that day. I hope they live to see judgement here on earth. And then judgement after. Nancy et al permalink parent award report block reply Skogin 2 points 2 days ago flashbang to the chest permalink parent award report block reply\nsnoopy3210 2 points 2 days ago There’s the good black capitol police who said the other ones refused to lock the chambers doors!!! He wasnt called to work that day. He locked the house chamber that two other capitol officers tried to open for Qanon shaman permalink parent award report block reply Suckitreddit 1 points 2 days ago So many good people tricked that day. I hope they live to see judgement here on earth. And then judgement after. Nancy et al permalink parent award report block reply\nSuckitreddit 1 points 2 days ago So many good people tricked that day. I hope they live to see judgement here on earth. And then judgement after. Nancy et al permalink parent award report block reply\nSkogin 2 points 2 days ago flashbang to the chest permalink parent award report block reply\nRob55 4 points 2 days ago Officer that shot Babbit was Byrd, not in pic. You forgot about the 4 capital police officers that died by “suicide” after J6 permalink parent award report block reply Ghost_Soul167 2 points 2 days ago No, I didn't, I actually had an interaction with Freitag who was the first to \"kill himself\".  He had apologized to me after a random officer smashed my hand for having it on the rail, and said it was wrong for the officer to have done.  I had been joking around with him about being officer Friday.  Pretty sure permalink parent award report block reply\nGhost_Soul167 2 points 2 days ago No, I didn't, I actually had an interaction with Freitag who was the first to \"kill himself\".  He had apologized to me after a random officer smashed my hand for having it on the rail, and said it was wrong for the officer to have done.  I had been joking around with him about being officer Friday.  Pretty sure permalink parent award report block reply\nPatriotDescendant 2 points 2 days ago Yes, that flattened reading \"only 1\"... permalink parent award report block reply\nB0bE 61 points 2 days ago Rosanne Boyland permalink award report block reply NamendaBiden 32 points 2 days ago Came to post this.  She was also killed that day.  Beaten to death by the Capitol or DC Metro Police. permalink parent award report block reply blitzkrieg1 2 points 2 days ago Exactly. https://patriots.win/p/1ARK5BIEzx/roseanne-boyland-was-beaten-to-d/c permalink parent award report block reply War_Hamster 29 points 2 days ago I've met Ashli Babbit's Mom Micki a few times and consider her a friend. To her credit, the wrist bands she's been handing out since 2022 include Rosanne's name on them.  She switched from \"Justice for Ashli\" to \"Justice for J6\". permalink parent award report block reply bck- 16 points 2 days ago Had no idea about her. Went to google, first result is some gay CBS news article from 2021 that says she “suffered a medical emergency.” Went to Twitter and found the video of her being clubbed in the head as she lay faced down. I cannot believe that this wasn’t a bigger story. Also turns out the officer doing the clubbing is a black woman? Unbelievable permalink parent award report block reply NonbinaryPotatohead 4 points 2 days ago likely not even a cop like these goofballs in the picture. All paid actors given a license to violence. permalink parent award report block reply Quidnunc 2 points 2 days ago the media tried to say that Roseanne died of an overdose. but too many people saw the black female cop beating her with the baton even after she was dead. Patriots dragged her body away from her and tried to do CPR. not sure what happened to the cop. probably got a raise and a medal. permalink parent award report block reply\nNamendaBiden 32 points 2 days ago Came to post this.  She was also killed that day.  Beaten to death by the Capitol or DC Metro Police. permalink parent award report block reply blitzkrieg1 2 points 2 days ago Exactly. https://patriots.win/p/1ARK5BIEzx/roseanne-boyland-was-beaten-to-d/c permalink parent award report block reply\nblitzkrieg1 2 points 2 days ago Exactly. https://patriots.win/p/1ARK5BIEzx/roseanne-boyland-was-beaten-to-d/c permalink parent award report block reply\nWar_Hamster 29 points 2 days ago I've met Ashli Babbit's Mom Micki a few times and consider her a friend. To her credit, the wrist bands she's been handing out since 2022 include Rosanne's name on them.  She switched from \"Justice for Ashli\" to \"Justice for J6\". permalink parent award report block reply\nbck- 16 points 2 days ago Had no idea about her. Went to google, first result is some gay CBS news article from 2021 that says she “suffered a medical emergency.” Went to Twitter and found the video of her being clubbed in the head as she lay faced down. I cannot believe that this wasn’t a bigger story. Also turns out the officer doing the clubbing is a black woman? Unbelievable permalink parent award report block reply NonbinaryPotatohead 4 points 2 days ago likely not even a cop like these goofballs in the picture. All paid actors given a license to violence. permalink parent award report block reply Quidnunc 2 points 2 days ago the media tried to say that Roseanne died of an overdose. but too many people saw the black female cop beating her with the baton even after she was dead. Patriots dragged her body away from her and tried to do CPR. not sure what happened to the cop. probably got a raise and a medal. permalink parent award report block reply\nNonbinaryPotatohead 4 points 2 days ago likely not even a cop like these goofballs in the picture. All paid actors given a license to violence. permalink parent award report block reply\nQuidnunc 2 points 2 days ago the media tried to say that Roseanne died of an overdose. but too many people saw the black female cop beating her with the baton even after she was dead. Patriots dragged her body away from her and tried to do CPR. not sure what happened to the cop. probably got a raise and a medal. permalink parent award report block reply\nStoopidAsshole69 32 points 2 days ago Guys this isn’t funny. AOC was almost raped and murdered. permalink award report block reply NamendaBiden 19 points 2 days ago Its true.  She was in a completely different building, but she could totally imagine what it would have been like. permalink parent award report block reply Rock9Head 14 points 2 days ago You mean fantasize about. permalink parent award report block reply rebuildingMyself 6 points 2 days ago The idea of being able to bring that up in every speech from now until she retires was making her so excited she convinced herself it actually nearly happened permalink parent award report block reply Rock9Head 2 points 2 days ago If only they all could have achieved an erection. permalink parent award report block reply Major_Nutt 0 points 2 days ago The vast majority of rape victims orgasm during the event. permalink parent award report block reply MAGALADON9 10 points 2 days ago Folding her chubby lil arms pouting \"why is no one raping me!\" Her and her ridiculously white bf (BWC) role-play in the bedroom - cortez and Aztec princess, or some variations. permalink parent award report block reply 1_Badcop 2 points 2 days ago Pede, I did not need that visual permalink parent award report block reply MAGALADON9 4 points 2 days ago Be glad I didn't describe Lady G (Lindsey) permalink parent award report block reply view 1 more comments... Hanging_Chad 1 points 2 days ago Big White Cock? permalink parent award report block reply MAGALADON9 2 points 2 days ago Yep Sooo many squad types can't keep their hands off these Washington monument white guys.   I'll Illhan Omar, AOC, Kamala Harris, and many more. JDs wife a democrat before switched parties and went with the country white boy. Bill DeBlasio's wife was a big activist but stopped ranting about white people long enough to marry one.  It goes on and on https://m.youtube.com/watch?v=SlGFzeacyr0 permalink parent award report block reply view 1 more comments... drattastic1 1 points 2 days ago Isn't he, like most beta cucks, actually gay? permalink parent award report block reply MAGALADON9 1 points 2 days ago He does give off soy vibes but ya never know many people prefer the opposite sexually in terms of top/bottom dom/sub.   CEOs and powerful people often feel it is a relief to be totally submissive.  As for women forced by society to play a more masculine role eg. \"Girl Boss.... corner office... cut throat shark etc\" even professional female dommes (and I was a fixture in that world for years) don't actually like their subs and slaves. I mean they won't say it obviously it's their money - but I've had close relationships with many and 100% them are at least \"switchy\"...  Anyway who knows. She is publicly humiliating him often saying things like \"i don't know I often feel like a traitor dating a white man and considered if I should\"  --- whoooo boy I'd be a fucking ghost that night if a woman  said something  like that to me - on camera- for the world. Yeah no drama just echoes and dust. permalink parent award report block reply barefootozark 1 points 2 days ago And Kamala had to leave the Capital.  (She didn't . She was at the DNC with the pipe bomb stage prop.) permalink parent award report block reply Tele_Plus 0 points 2 days ago Thankfully Rep. Jason Crow remembered his Army Ranger training and was going to fight off everyone with a pen! permalink parent award report block reply\nNamendaBiden 19 points 2 days ago Its true.  She was in a completely different building, but she could totally imagine what it would have been like. permalink parent award report block reply Rock9Head 14 points 2 days ago You mean fantasize about. permalink parent award report block reply rebuildingMyself 6 points 2 days ago The idea of being able to bring that up in every speech from now until she retires was making her so excited she convinced herself it actually nearly happened permalink parent award report block reply Rock9Head 2 points 2 days ago If only they all could have achieved an erection. permalink parent award report block reply Major_Nutt 0 points 2 days ago The vast majority of rape victims orgasm during the event. permalink parent award report block reply MAGALADON9 10 points 2 days ago Folding her chubby lil arms pouting \"why is no one raping me!\" Her and her ridiculously white bf (BWC) role-play in the bedroom - cortez and Aztec princess, or some variations. permalink parent award report block reply 1_Badcop 2 points 2 days ago Pede, I did not need that visual permalink parent award report block reply MAGALADON9 4 points 2 days ago Be glad I didn't describe Lady G (Lindsey) permalink parent award report block reply view 1 more comments... Hanging_Chad 1 points 2 days ago Big White Cock? permalink parent award report block reply MAGALADON9 2 points 2 days ago Yep Sooo many squad types can't keep their hands off these Washington monument white guys.   I'll Illhan Omar, AOC, Kamala Harris, and many more. JDs wife a democrat before switched parties and went with the country white boy. Bill DeBlasio's wife was a big activist but stopped ranting about white people long enough to marry one.  It goes on and on https://m.youtube.com/watch?v=SlGFzeacyr0 permalink parent award report block reply view 1 more comments... drattastic1 1 points 2 days ago Isn't he, like most beta cucks, actually gay? permalink parent award report block reply MAGALADON9 1 points 2 days ago He does give off soy vibes but ya never know many people prefer the opposite sexually in terms of top/bottom dom/sub.   CEOs and powerful people often feel it is a relief to be totally submissive.  As for women forced by society to play a more masculine role eg. \"Girl Boss.... corner office... cut throat shark etc\" even professional female dommes (and I was a fixture in that world for years) don't actually like their subs and slaves. I mean they won't say it obviously it's their money - but I've had close relationships with many and 100% them are at least \"switchy\"...  Anyway who knows. She is publicly humiliating him often saying things like \"i don't know I often feel like a traitor dating a white man and considered if I should\"  --- whoooo boy I'd be a fucking ghost that night if a woman  said something  like that to me - on camera- for the world. Yeah no drama just echoes and dust. permalink parent award report block reply\nRock9Head 14 points 2 days ago You mean fantasize about. permalink parent award report block reply rebuildingMyself 6 points 2 days ago The idea of being able to bring that up in every speech from now until she retires was making her so excited she convinced herself it actually nearly happened permalink parent award report block reply Rock9Head 2 points 2 days ago If only they all could have achieved an erection. permalink parent award report block reply Major_Nutt 0 points 2 days ago The vast majority of rape victims orgasm during the event. permalink parent award report block reply\nrebuildingMyself 6 points 2 days ago The idea of being able to bring that up in every speech from now until she retires was making her so excited she convinced herself it actually nearly happened permalink parent award report block reply Rock9Head 2 points 2 days ago If only they all could have achieved an erection. permalink parent award report block reply\nRock9Head 2 points 2 days ago If only they all could have achieved an erection. permalink parent award report block reply\nMajor_Nutt 0 points 2 days ago The vast majority of rape victims orgasm during the event. permalink parent award report block reply\nMAGALADON9 10 points 2 days ago Folding her chubby lil arms pouting \"why is no one raping me!\" Her and her ridiculously white bf (BWC) role-play in the bedroom - cortez and Aztec princess, or some variations. permalink parent award report block reply 1_Badcop 2 points 2 days ago Pede, I did not need that visual permalink parent award report block reply MAGALADON9 4 points 2 days ago Be glad I didn't describe Lady G (Lindsey) permalink parent award report block reply view 1 more comments... Hanging_Chad 1 points 2 days ago Big White Cock? permalink parent award report block reply MAGALADON9 2 points 2 days ago Yep Sooo many squad types can't keep their hands off these Washington monument white guys.   I'll Illhan Omar, AOC, Kamala Harris, and many more. JDs wife a democrat before switched parties and went with the country white boy. Bill DeBlasio's wife was a big activist but stopped ranting about white people long enough to marry one.  It goes on and on https://m.youtube.com/watch?v=SlGFzeacyr0 permalink parent award report block reply view 1 more comments... drattastic1 1 points 2 days ago Isn't he, like most beta cucks, actually gay? permalink parent award report block reply MAGALADON9 1 points 2 days ago He does give off soy vibes but ya never know many people prefer the opposite sexually in terms of top/bottom dom/sub.   CEOs and powerful people often feel it is a relief to be totally submissive.  As for women forced by society to play a more masculine role eg. \"Girl Boss.... corner office... cut throat shark etc\" even professional female dommes (and I was a fixture in that world for years) don't actually like their subs and slaves. I mean they won't say it obviously it's their money - but I've had close relationships with many and 100% them are at least \"switchy\"...  Anyway who knows. She is publicly humiliating him often saying things like \"i don't know I often feel like a traitor dating a white man and considered if I should\"  --- whoooo boy I'd be a fucking ghost that night if a woman  said something  like that to me - on camera- for the world. Yeah no drama just echoes and dust. permalink parent award report block reply\n1_Badcop 2 points 2 days ago Pede, I did not need that visual permalink parent award report block reply MAGALADON9 4 points 2 days ago Be glad I didn't describe Lady G (Lindsey) permalink parent award report block reply view 1 more comments...\nMAGALADON9 4 points 2 days ago Be glad I didn't describe Lady G (Lindsey) permalink parent award report block reply view 1 more comments...\nHanging_Chad 1 points 2 days ago Big White Cock? permalink parent award report block reply MAGALADON9 2 points 2 days ago Yep Sooo many squad types can't keep their hands off these Washington monument white guys.   I'll Illhan Omar, AOC, Kamala Harris, and many more. JDs wife a democrat before switched parties and went with the country white boy. Bill DeBlasio's wife was a big activist but stopped ranting about white people long enough to marry one.  It goes on and on https://m.youtube.com/watch?v=SlGFzeacyr0 permalink parent award report block reply view 1 more comments...\nMAGALADON9 2 points 2 days ago Yep Sooo many squad types can't keep their hands off these Washington monument white guys.   I'll Illhan Omar, AOC, Kamala Harris, and many more. JDs wife a democrat before switched parties and went with the country white boy. Bill DeBlasio's wife was a big activist but stopped ranting about white people long enough to marry one.  It goes on and on https://m.youtube.com/watch?v=SlGFzeacyr0 permalink parent award report block reply view 1 more comments...\ndrattastic1 1 points 2 days ago Isn't he, like most beta cucks, actually gay? permalink parent award report block reply MAGALADON9 1 points 2 days ago He does give off soy vibes but ya never know many people prefer the opposite sexually in terms of top/bottom dom/sub.   CEOs and powerful people often feel it is a relief to be totally submissive.  As for women forced by society to play a more masculine role eg. \"Girl Boss.... corner office... cut throat shark etc\" even professional female dommes (and I was a fixture in that world for years) don't actually like their subs and slaves. I mean they won't say it obviously it's their money - but I've had close relationships with many and 100% them are at least \"switchy\"...  Anyway who knows. She is publicly humiliating him often saying things like \"i don't know I often feel like a traitor dating a white man and considered if I should\"  --- whoooo boy I'd be a fucking ghost that night if a woman  said something  like that to me - on camera- for the world. Yeah no drama just echoes and dust. permalink parent award report block reply\nMAGALADON9 1 points 2 days ago He does give off soy vibes but ya never know many people prefer the opposite sexually in terms of top/bottom dom/sub.   CEOs and powerful people often feel it is a relief to be totally submissive.  As for women forced by society to play a more masculine role eg. \"Girl Boss.... corner office... cut throat shark etc\" even professional female dommes (and I was a fixture in that world for years) don't actually like their subs and slaves. I mean they won't say it obviously it's their money - but I've had close relationships with many and 100% them are at least \"switchy\"...  Anyway who knows. She is publicly humiliating him often saying things like \"i don't know I often feel like a traitor dating a white man and considered if I should\"  --- whoooo boy I'd be a fucking ghost that night if a woman  said something  like that to me - on camera- for the world. Yeah no drama just echoes and dust. permalink parent award report block reply\nbarefootozark 1 points 2 days ago And Kamala had to leave the Capital.  (She didn't . She was at the DNC with the pipe bomb stage prop.) permalink parent award report block reply\nTele_Plus 0 points 2 days ago Thankfully Rep. Jason Crow remembered his Army Ranger training and was going to fight off everyone with a pen! permalink parent award report block reply\nBohemyth_2 27 points 2 days ago The real reason pelosi is retiring That hag would feinstein herself rather than leave permalink award report block reply LaVaughnRobinson 3 points 2 days ago Still waiting for her daughters audio/video from that day.  She was there making a fakumentary about it all...amazing right. permalink parent award report block reply RememberCharlieKirk 3 points 2 days ago Nancy Pelosi's control of the Democrat Party is slightly diminishing, or rather challenged more in public; she must take such great offense to that change. permalink parent award report block reply\nLaVaughnRobinson 3 points 2 days ago Still waiting for her daughters audio/video from that day.  She was there making a fakumentary about it all...amazing right. permalink parent award report block reply\nRememberCharlieKirk 3 points 2 days ago Nancy Pelosi's control of the Democrat Party is slightly diminishing, or rather challenged more in public; she must take such great offense to that change. permalink parent award report block reply\nMEME-SUPREME 23 points 2 days ago Democrats said it was worse than 9/11 The cover up continues. permalink award report block reply peterthegreen 14 points 2 days ago J6 WAS worse than 9/11, in reference to the government coup that was orchestrated by the Uniparty to install the illegitimate Autopen Regime, leading to persecution of patriots and the massive invasion of our country. Those responsible have yet to be held to account and efforts to undo the damage have been stymied by that same Uniparty and their Deep State operatives still carrying out their mission to destroy our Constitutional Republic. permalink parent award report block reply N0rds 4 points 2 days ago You think 9-11 didn't have government coup type meddling? The government 100% had a hand in those towers coming down. So they could hide the missing trillions, push the patriot act bullshit, and start to enact the globalism bullshit we see now. permalink parent award report block reply Skogin 1 points 2 days ago Our fren said J6 was worse government meddling. Although this may not have been obvious during the media onslaught, it is becoming inescapable: 9/11 scapegoated foreigners to destroy their lives, J6 smeared the majority of Americans to directly destroy our lives. permalink parent award report block reply punkalicious 6 points 2 days ago IT WAS WORSE THAN 10X THE HALL OF COSTS. Haha, just kidding. Abortion killed 60M. permalink parent award report block reply N0rds 1 points 2 days ago Oy vey, the antisemitisms!!!! Mocking the 60 million Jews who got sent on rollercoasters that ended in a fire pit is nothing to laugh about!!! For you to mock the 600 million Jews who were genocided by masturbation machines attached to their cut penises, is literally worse than what Hitler did to those poor 6 billion Jews during the Holocaust!!!!! permalink parent award report block reply punkalicious 1 points 2 days ago Hang on, I can barely read this. Let me turn on the lamp. That shade... permalink parent award report block reply\npeterthegreen 14 points 2 days ago J6 WAS worse than 9/11, in reference to the government coup that was orchestrated by the Uniparty to install the illegitimate Autopen Regime, leading to persecution of patriots and the massive invasion of our country. Those responsible have yet to be held to account and efforts to undo the damage have been stymied by that same Uniparty and their Deep State operatives still carrying out their mission to destroy our Constitutional Republic. permalink parent award report block reply N0rds 4 points 2 days ago You think 9-11 didn't have government coup type meddling? The government 100% had a hand in those towers coming down. So they could hide the missing trillions, push the patriot act bullshit, and start to enact the globalism bullshit we see now. permalink parent award report block reply Skogin 1 points 2 days ago Our fren said J6 was worse government meddling. Although this may not have been obvious during the media onslaught, it is becoming inescapable: 9/11 scapegoated foreigners to destroy their lives, J6 smeared the majority of Americans to directly destroy our lives. permalink parent award report block reply\nN0rds 4 points 2 days ago You think 9-11 didn't have government coup type meddling? The government 100% had a hand in those towers coming down. So they could hide the missing trillions, push the patriot act bullshit, and start to enact the globalism bullshit we see now. permalink parent award report block reply Skogin 1 points 2 days ago Our fren said J6 was worse government meddling. Although this may not have been obvious during the media onslaught, it is becoming inescapable: 9/11 scapegoated foreigners to destroy their lives, J6 smeared the majority of Americans to directly destroy our lives. permalink parent award report block reply\nSkogin 1 points 2 days ago Our fren said J6 was worse government meddling. Although this may not have been obvious during the media onslaught, it is becoming inescapable: 9/11 scapegoated foreigners to destroy their lives, J6 smeared the majority of Americans to directly destroy our lives. permalink parent award report block reply\npunkalicious 6 points 2 days ago IT WAS WORSE THAN 10X THE HALL OF COSTS. Haha, just kidding. Abortion killed 60M. permalink parent award report block reply N0rds 1 points 2 days ago Oy vey, the antisemitisms!!!! Mocking the 60 million Jews who got sent on rollercoasters that ended in a fire pit is nothing to laugh about!!! For you to mock the 600 million Jews who were genocided by masturbation machines attached to their cut penises, is literally worse than what Hitler did to those poor 6 billion Jews during the Holocaust!!!!! permalink parent award report block reply punkalicious 1 points 2 days ago Hang on, I can barely read this. Let me turn on the lamp. That shade... permalink parent award report block reply\nN0rds 1 points 2 days ago Oy vey, the antisemitisms!!!! Mocking the 60 million Jews who got sent on rollercoasters that ended in a fire pit is nothing to laugh about!!! For you to mock the 600 million Jews who were genocided by masturbation machines attached to their cut penises, is literally worse than what Hitler did to those poor 6 billion Jews during the Holocaust!!!!! permalink parent award report block reply punkalicious 1 points 2 days ago Hang on, I can barely read this. Let me turn on the lamp. That shade... permalink parent award report block reply\npunkalicious 1 points 2 days ago Hang on, I can barely read this. Let me turn on the lamp. That shade... permalink parent award report block reply\nMAGALADON9 18 points 2 days ago Jesus people Rosanne Boyland Was bludgeoned to death by a sheboon cop with a club. permalink award report block reply\nbrainphreeze 13 points 2 days ago This has to be the easiest case for useless Bondi Kash and Bongino to go after Will they actually do anything? permalink award report block reply MAG-n-KAG 7 points 2 days ago there are easier things, and they still refuse to get off their asses.  i doubt they'll do anything about this.  id love to be proven wrong tho. permalink parent award report block reply TrumpAndGodWin 2 points 2 days ago Alex Jones said it again Sunday that Kash is compromised and living with a gay billionaire in Vegas. permalink parent award report block reply N0rds 1 points 2 days ago She's busy getting her hair done, to prep for another fox news interview. She has WAY more important things to do than fight for the American people.... permalink parent award report block reply\nMAG-n-KAG 7 points 2 days ago there are easier things, and they still refuse to get off their asses.  i doubt they'll do anything about this.  id love to be proven wrong tho. permalink parent award report block reply\nTrumpAndGodWin 2 points 2 days ago Alex Jones said it again Sunday that Kash is compromised and living with a gay billionaire in Vegas. permalink parent award report block reply\nN0rds 1 points 2 days ago She's busy getting her hair done, to prep for another fox news interview. She has WAY more important things to do than fight for the American people.... permalink parent award report block reply\nairborne3502 13 points 2 days ago Yes, senators had objections to the election results. All of this was to table those objections so that later on Mike Pence could decide not to send the disputed electors back to the states for another look. \"Since there are no objections.\" Yeah, because they were tabled due to the events of January 6th. That was the end game. Pence was proud of his role in certifying the stolen election and gave Nancy Pelosi an elbow bump. permalink award report block reply FatigueIsReal 2 points 2 days ago I'll add.  More objections than any other election in history. permalink parent award report block reply\nFatigueIsReal 2 points 2 days ago I'll add.  More objections than any other election in history. permalink parent award report block reply\nWar_Hamster 12 points 2 days ago This is an accurate summary, but what's missing is how Nancy Pelosi reconvened Congress under special rules that didn't allow for challenging the electors. I'm sure that was just a coincidence.... permalink award report block reply brutustyberius 2 points 2 days ago Or the J6 committee she illegally appointed without Republican selected representation (Nancy appointed Liz and Kitlinger). permalink parent award report block reply War_Hamster 1 points 2 days ago Agreed that it was an illegal committee, but the absence of an honest Republican (if one exists) allowed the J6 committee to manufacture and destroy evidence with no oversight. Double-edged sword. permalink parent award report block reply\nbrutustyberius 2 points 2 days ago Or the J6 committee she illegally appointed without Republican selected representation (Nancy appointed Liz and Kitlinger). permalink parent award report block reply War_Hamster 1 points 2 days ago Agreed that it was an illegal committee, but the absence of an honest Republican (if one exists) allowed the J6 committee to manufacture and destroy evidence with no oversight. Double-edged sword. permalink parent award report block reply\nWar_Hamster 1 points 2 days ago Agreed that it was an illegal committee, but the absence of an honest Republican (if one exists) allowed the J6 committee to manufacture and destroy evidence with no oversight. Double-edged sword. permalink parent award report block reply\ntwentytwentyfourr 10 points 2 days ago not hard to blackmail a guy who has a giant swastika tattooed on his neck permalink award report block reply\nSmurfection 8 points 2 days ago Roseann Boyland was beaten to death by a black female cop.  Then to cover their tracks they defamed her as a drug addicts burn out. permalink award report block reply\nPsalm-118_24 8 points 2 days ago And they are responsible for other deaths...Matthew Perna, J6er committed suicide while waiting on sentencing.  Capitol Police Officer Howard Liebengood and MPD Officer Jeffrey Smith, 2 officers who responded to J6 \"committed suicide\".  Kyle DeFreytag, MPD, died of \"suicide\" the following July. permalink award report block reply\nMaga305_47 7 points 2 days ago Missed an awful lot of crying about it too… permalink award report block reply\nAggrieved03 7 points 2 days ago Probably suicided officers who were coming forward. permalink award report block reply brutustyberius 2 points 2 days ago We’ve got a Bingo! permalink parent award report block reply\nbrutustyberius 2 points 2 days ago We’ve got a Bingo! permalink parent award report block reply\nbuckeyeminuteman 6 points 2 days ago Roseanne Boyland was beaten to death by a Capitol police woman wielding a baton. permalink award report block reply\nPayasyougo 6 points 2 days ago Several police reportedly committed \"suicide\" for what they endured that day. permalink award report block reply XlDEN 3 points 2 days ago Yes, while others were promoted. The pipe bomber got a job at the CIA. permalink parent award report block reply\nXlDEN 3 points 2 days ago Yes, while others were promoted. The pipe bomber got a job at the CIA. permalink parent award report block reply\nFemale 5 points 2 days ago The getting away with it part permalink award report block reply\nHerpawinski 5 points 2 days ago Unless the Capital Police captain lied, it wasn't the capital police behind it. There was a conspiracy but most of them were in the dark. I saw (posted here) video of an undercover telling a guard in the capital that \"friendlies\" would have colored wristbands (any color) and striped decals on their guns. On their guns. A short time later Ashley Babbit was shot by member of a security detail. The killer's hand is seen in the video. He has a bunch of colored wristbands (weird for a security guard) and his gun has a striped decal on it, showing that he's a \"friendly\". But he's security and in a suit. Why the hell would he need to signify to anyone that he's a \"friendly\"? He wouldn't, unless \"friendly\" doesn't mean undercover police, but something else. permalink award report block reply\nProf_Smith 5 points 2 days ago Scum.  All of them are scum. permalink award report block reply\nPayasyougo 4 points 2 days ago Supposed ultra mega maga trump voter and Oath Keepers leader Ray Epps was only given probation for what he did that day. Epps stated that he experienced a \"life-changing reality shift\" when the \"Trump cult\" turned on him and his wife. permalink award report block reply CommieCucker 1 points 2 days ago \"We need to go... INSIDE the Capitol! We gotta insurrect this shit!\" permalink parent award report block reply TrumpAndSimpsNotMAGA 0 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply\nCommieCucker 1 points 2 days ago \"We need to go... INSIDE the Capitol! We gotta insurrect this shit!\" permalink parent award report block reply TrumpAndSimpsNotMAGA 0 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply\nTrumpAndSimpsNotMAGA 0 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply\nOldZilla 4 points 2 days ago And these Lying MFers coverrd it up. https://www.nytimes.com/2021/01/28/us/capitol-riot-woman-trampled.html permalink award report block reply\nGoatboy66 4 points 2 days ago Watch the Video \"EVERYTHING WRONG WITH THE CAPITAL SHOOTING IN TWENTY ONE MINUTES OR LESS\" permalink award report block reply\nSoulSnipper 4 points 2 days ago Fanone belongs in prison permalink award report block reply Prandogolio 3 points 2 days ago He would love it there permalink parent award report block reply SoulSnipper 2 points 2 days ago He's a catcher not a pitcher, they'd be lining up. He'd drop the soap on purpose... permalink parent award report block reply\nPrandogolio 3 points 2 days ago He would love it there permalink parent award report block reply SoulSnipper 2 points 2 days ago He's a catcher not a pitcher, they'd be lining up. He'd drop the soap on purpose... permalink parent award report block reply\nSoulSnipper 2 points 2 days ago He's a catcher not a pitcher, they'd be lining up. He'd drop the soap on purpose... permalink parent award report block reply\nphro 3 points 2 days ago This makes me question the entire Ashlii Babbit thing too https://rumble.com/v3rv9o1-everything-wrong-with-the-capitol-shooting-in-21-minutes-or-less.html permalink award report block reply Southernwhitebread2 2 points 2 days ago Best video interpretation of that incident. She was air force intelligence prior. Supposed to have worked at a Maryland nuclear power plant and was investigating a terror attack while working there with her first husband. permalink parent award report block reply Southernwhitebread2 1 points 2 days ago https://www.podbean.com/ea/pb-uzvuc-1070c9c permalink parent award report block reply\nSouthernwhitebread2 2 points 2 days ago Best video interpretation of that incident. She was air force intelligence prior. Supposed to have worked at a Maryland nuclear power plant and was investigating a terror attack while working there with her first husband. permalink parent award report block reply\nSouthernwhitebread2 1 points 2 days ago https://www.podbean.com/ea/pb-uzvuc-1070c9c permalink parent award report block reply\nChancho69 3 points 2 days ago we’re hung by the neck after a military tribunal? permalink award report block reply\nRetard_Strength 3 points 2 days ago • are faggots permalink award report block reply\nBoricuaPede 3 points 2 days ago You're missing how to spell \"waved\" like a giant retard. permalink award report block reply\nMemoryHoleyeO 2 points 2 days ago And the suicides! Need to reupload permalink award report block reply\nMAG-n-KAG 2 points 2 days ago Also the 4 Capitol Police officers that got \"suicided\" in the following 3-4 weeks. permalink award report block reply\nGarbageLivesMatter 2 points 2 days ago What did the UniParty do with Epps?  Is he in a safe house somewhere or living the good life in Arizona?  I'm surprised the Deep State haven't killed him yet. permalink award report block reply Crappydatum 2 points 2 days ago They'll give him a pair of glasses and no one will recognize him permalink parent award report block reply\nCrappydatum 2 points 2 days ago They'll give him a pair of glasses and no one will recognize him permalink parent award report block reply\nRucktoe 2 points 2 days ago You missed the part where they silenced and jailed those they accused of wrongdoing. permalink award report block reply\nhrswift 2 points 2 days ago Only missed one thing: piglousy was able to call the election for bidumb because of the chaos they created permalink award report block reply\nFaintlight 2 points 2 days ago Fed Epps permalink award report block reply\ngaijin_ronin 2 points 2 days ago All four should be dead but since they played their roles a golden parachute came their way. permalink award report block reply\nRedCapNation 2 points 2 days ago All four in that picture need to be hung in public permalink award report block reply\nSomebody157 2 points 2 days ago Yes , your missing the end of the story which has not happened yet. My ending: The lairs, murderers get hung by the neck in a public execution. permalink award report block reply TrumpAndSimpsNotMAGA 1 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply Somebody157 1 points 2 days ago Leftist conspiracy theory lol. permalink parent award report block reply\nTrumpAndSimpsNotMAGA 1 points 2 days ago Comment removed upon the user being banned. permalink parent award report block reply Somebody157 1 points 2 days ago Leftist conspiracy theory lol. permalink parent award report block reply\nSomebody157 1 points 2 days ago Leftist conspiracy theory lol. permalink parent award report block reply\nSunnybats2 2 points 2 days ago Forgot at least three others killed by the pigs not just Ashli permalink award report block reply\nFemale 2 points 2 days ago They tried to take our right to peaceful assembly away from us. We need to have peaceful assemblies again permalink award report block reply\nArnoldF 2 points 2 days ago The capital police killed three other patriots that day. permalink award report block reply\nRedWave26 2 points 2 days ago Yes they blocked off the side streets on Constitution and Pennsylvania Avenues to force the entire crowd to the Capitol. permalink award report block reply\nmencheIke 2 points 2 days ago Ashli wasn't the only one killed that day, they killed that woman with billy clubs and it was on camera. Roseane Boyland permalink award report block reply\nBecauseYoudBeInJail 2 points 2 days ago https://www.youtube.com/watch?v=jV6XDoZ9_8I permalink award report block reply\nCySailor 2 points 2 days ago You forgot \"Received preemptive Presidential Pardons\"... No wait, guess they didn't. permalink award report block reply\nKrat 2 points 2 days ago You forgot the part where 0 of them were arrested after hunting down regular Americans and locked them up unconstitutionally violating the core tennets of freedom permalink award report block reply\nPrandogolio 2 points 2 days ago Communism permalink award report block reply\nPatriotSkorzeny 2 points 2 days ago They have qualified immunity. They are brave brave men. Heroes all. 🤭 permalink award report block reply\nOodles 2 points 2 days ago Cops are not your friends permalink award report block reply\njosiborg 2 points 2 days ago They also helped kill and cover up the murder of Seth Rich permalink award report block reply\nphil_d_snutz 1 points 2 days ago bAcK tEh bLuE, right guys? 👎 permalink award report block reply\nbarefootozark 1 points 2 days ago Yes, you are missing something.  Who build the fake and gay gallows? Just another thing that is videos and cell data is available to determine... but we can't figure it out. permalink award report block reply\ngoatnuts 1 points 2 days ago Yes, youre missing something, the arkancide of Vince Foster. permalink award report block reply\nseattlerunner 1 points 2 days ago The guy with the beard, third from the left looks like an Antifa member. He always seemed to seedy and scummy for the dignity that position should entail. permalink award report block reply Crappydatum 1 points 2 days ago He's covered in tattoos that I'd like to have analysed permalink parent award report block reply\nCrappydatum 1 points 2 days ago He's covered in tattoos that I'd like to have analysed permalink parent award report block reply\nShadowInv 1 points 2 days ago Security guards led protestors to rooms and unlocked them (horned guy?) permalink award report block reply\nMichalusmichalus 1 points 2 days ago The police that tried to speak up kept dying. permalink award report block reply\ndukeofdoorcounty 1 points 2 days ago Nicely took down and rolled up 3 rings of plastic snow fence (they left the metal posts up). permalink award report block reply\nDev404 1 points 2 days ago Capital punishment of not just those officers involved in setting up J6, but those in Congress, is needed as well. These amateur false flaggers need to be taught a permanent lesson instead of walking around freely and continuing their lies. Waiting on Kash and Bondi to do something about anything that has real substance. Still. permalink award report block reply\nHaSumBro 1 points 2 days ago They cut open tarps permalink award report block reply\nMatterThatMetals 1 points 2 days ago Bad cops suck. permalink award report block reply Clarice357 2 points 2 days ago Cops do what they are told to do.  Someone directed all this. permalink parent award report block reply\nClarice357 2 points 2 days ago Cops do what they are told to do.  Someone directed all this. permalink parent award report block reply\nBoberFett 1 points 2 days ago The Republicans after January 6th: Do nothing permalink award report block reply\nUrinetensions 1 points 2 days ago Wasn't Fannone banging Kathy Griffin at one point? permalink award report block reply\nKonsaki 1 points 2 days ago Just posting this for historical context: https://en.wikipedia.org/wiki/Praetorian_Guard https://en.wikipedia.org/wiki/Category:Roman_emperors_murdered_by_the_Praetorian_Guard permalink award report block reply\nCrappydatum 1 points 2 days ago Judas Pence contributing permalink award report block reply\nMegaboom2025 1 points 2 days ago How many undercover feds were there? permalink award report block reply\nFreedomLubber 1 points 2 days ago Autopen pardons permalink award report block reply\nPatrioticVideo 1 points 2 days ago ...answeed directly to the Speaker. permalink award report block reply\nDRKMSTR 1 points 2 days ago Capitol police tried to overthrow the government? permalink award report block reply\nACActual 1 points 2 days ago 4 Patriots were murdered on January 6th permalink award report block reply\nnzsvz9 1 points 2 days ago Are proof that anyone with a left leaning, even in the slightest, cannot be objective. And are politically motivated leftists. permalink award report block reply\nknnbccb 1 points 2 days ago Treason not punished by death will return in another season. permalink award report block reply\nStallion 1 points 2 days ago \"Suicides\" any officer who they thought might blow the whistle permalink award report block reply\ntry4gain PRO 1 points 2 days ago there is literally video of cops standing by chilling while people walk into the Capital peacefully. permalink award report block reply\nposedgeclk 1 points 2 days ago Waived? Lol. permalink award report block reply Crappydatum 2 points 2 days ago Capitol police on in ? permalink parent award report block reply\nCrappydatum 2 points 2 days ago Capitol police on in ? permalink parent award report block reply\ndoodaddy 1 points 2 days ago some of them.  there is the black officer in the one video that says, \"we've been set up.\"  seems it always works this way.  you can't keep 100s of people on the script. permalink award report block reply\nfriedchicken 1 points 2 days ago Yes, you are missing why and to what end permalink award report block reply\nMagaman4200 1 points 2 days ago PLUS they used it as an excuse for tyranny … ALL that after STEALING the election … permalink award report block reply\nmatt11707 1 points 2 days ago harry dunn wrote a book, that was filled with lies and run for congess and lost. permalink award report block reply\nDITTOPatriot 1 points 2 days ago The part that is missing is that Kash and Bondi are covering it up. permalink award report block reply\n2FBIAgents1Cup 1 points 2 days ago Yeah....Roseanne Boyland and two men who were clubbed into comas.... permalink award report block reply\nMyBallsAreRough 1 points 2 days ago Yes, broke windows and urged people to enter through broken windows permalink award report block reply\nNonbinaryPotatohead 0 points 2 days ago Makes you kind of wonder what is real in our history books. permalink award report block reply\nUSNVET71 -1 points 2 days ago Those four losers in the picture need to be convicted of sedition, and they need to spend the rest of their miserable fucking lives in prison. They are traitors to this nation. permalink award report block reply"}